[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 483,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1hm18t3",
        "author": "AutoModerator",
        "title": "NFL Christmas Gameday Megathread",
        "content": "1:00pm ET - Kansas City Chiefs @ Pittsburg Steelers\n\n4:30pm ET - Baltimore Ravens @ Houston Texans",
        "upvotes": 34,
        "comments": 616,
        "media": null,
        "permalink": "/r/netflix/comments/1hm18t3/nfl_christmas_gameday_megathread/"
    },
    {
        "id": "1hnz9w9",
        "author": "Robemilak",
        "title": "Hwang Dong-hyuk confirms that David Fincher is developing an English-language ‘SQUID GAME’ remake set in America",
        "content": "",
        "upvotes": 44,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1hnz9w9/hwang_donghyuk_confirms_that_david_fincher_is/"
    },
    {
        "id": "1hnjxjj",
        "author": "Robemilak",
        "title": "Netflix execs tell screenwriters to have characters “announce what they’re doing so that viewers who have a program on in the background can follow along”",
        "content": "",
        "upvotes": 392,
        "comments": 129,
        "media": null,
        "permalink": "/r/netflix/comments/1hnjxjj/netflix_execs_tell_screenwriters_to_have/"
    },
    {
        "id": "1ho0nhl",
        "author": "yogeshroud",
        "title": "Isn't it crazy to think, Netflix earned about $2.07 billion from anime, nearly double Crunchyroll's $1.16 billion.",
        "content": "Despite crunchyroll's dedicated user base, Netflix’s massive subscriber count of 230 million far surpassing Crunchyroll's 15 million gives it a significant advantage.",
        "upvotes": 10,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ho0nhl/isnt_it_crazy_to_think_netflix_earned_about_207/"
    },
    {
        "id": "1hntxkj",
        "author": "Spectacularsquid42",
        "title": "Need a good show to binge!",
        "content": "Hey! Me and wifey are looking for a new TV series to binge on we have watched a lot so I’ll reply to comments if I’ve already watched versus trying to remember all the names and listening them. We are pretty open minded when it comes to shows, we have prime and hbo as well! Thank you ! ",
        "upvotes": 12,
        "comments": 58,
        "media": null,
        "permalink": "/r/netflix/comments/1hntxkj/need_a_good_show_to_binge/"
    },
    {
        "id": "1hnwvrl",
        "author": "SpicyTortiIla",
        "title": "Carry on - What did I miss?",
        "content": "Ethan received an earbud from a girl, she is also seen later giving a backpack to the traveler, (I think it was the gas mask and parachute) \n\nWhat happened to her? What about the second bomb? Mateo was boarding with bomb 1. Which was token by the traveler. Am I missing something?",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hnwvrl/carry_on_what_did_i_miss/"
    },
    {
        "id": "1hn2ir0",
        "author": "alkosz",
        "title": "Squid Game Season 2 was actually good",
        "content": "i know a lot of people here hate the second season and admittedly sure its not as good as the first one, however its a pretty close tie. having our antagonist directly involved into the game a second time yet we now know the entire time who it is probably has to be the best writing switch in any series ive ever watched. it was very entertaining not knowing when he'll switch up back to his own side and felt oddly satisfying watching him do so at the end. granted there was barely any sad moments in the series like the first one had, not as memorable of characters but it still got the job done it set out to do. at the end of it all i still wanted to watch more and any series that makes me feel that way deserves a great score.\n\ni would rate the first season a definite 10/10\n\nthis new season is definitely a 8/10\n\ncould've done better, better pacing, better characters and more drama but definitely not bad at all.",
        "upvotes": 990,
        "comments": 820,
        "media": null,
        "permalink": "/r/netflix/comments/1hn2ir0/squid_game_season_2_was_actually_good/"
    },
    {
        "id": "1hnds35",
        "author": "StudioJamesCao",
        "title": "I animated Squid Game action figures in stop motion",
        "content": "",
        "upvotes": 62,
        "comments": 4,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vx403pmrvd9e1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1hnds35/i_animated_squid_game_action_figures_in_stop/"
    },
    {
        "id": "1hnyg88",
        "author": "Redlikemethodz",
        "title": "Weird image artifacts on new TV",
        "content": "Just got a cheapo TV for the playroom and upon testing it out I'm seeing weird image artifacts when Netflix's nav options or TV ratings is displayed.  Tested this on the TV's Fire TV OS and via a PS5.  Don't see this on any other of my TVs / devices.  Any idea?",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hnyg88/weird_image_artifacts_on_new_tv/"
    },
    {
        "id": "1hnwmrk",
        "author": "LemonySnicketTeeth",
        "title": "Squid Games 2",
        "content": "So not too spoil things for anybody. \nWatching the 1st episode of season 2 tonight. \nThey keep showing one guys hand a lot during the episode, and both my wife and I were shocked at how calloused this character's hands were, just didn't seem to match the character. \n",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hnwmrk/squid_games_2/"
    },
    {
        "id": "1hnw49x",
        "author": "MasonJames136",
        "title": "Shows like Blue Eye Samurai / Edgerunners / Arcane?",
        "content": "As the title suggestions, I am interested in more shows with (preferably) similar art style to Blue Eye Samurai, as well as something that can pull at my emotions. I recently finished Edgerunners and Arcane, and I am looking for something else to get into. Any suggestions?\n\nSide note, suggestions on Netflix (US) are preferred, if not in the US providing the region would be great.",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hnw49x/shows_like_blue_eye_samurai_edgerunners_arcane/"
    },
    {
        "id": "1hnnmde",
        "author": "LeBichour",
        "title": "What happened in regards to the quality of Netflix shows these last years ?",
        "content": "I just finished Squid Game season 2 and I really do not understand what is happening at Netflix.\n\nSince 2023, they produced completely terrible seasons of shows that destroyed every single time the subreddits of each of those shows. I’m thinking of : \n\n- Squid Game season 2\n- Outer Banks season 4\n- You season 4\n- The Witcher season 3\n- The Umbrella Academy season 4\n- Sex Education season 4\n- Disenchantment part 5 \n- Virgin River season 6 \n\nDoes someone have an explanation for all of those messes ? Should we be scared for Stranger Things season 5 ?  ",
        "upvotes": 13,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1hnnmde/what_happened_in_regards_to_the_quality_of/"
    },
    {
        "id": "1hnvncy",
        "author": "Mean_Eye4585",
        "title": "Murderville Season 2..?!",
        "content": "I’ve been SLEEPING on this gem of a show. I cannot believe a season 2 hasn’t yet been released. I just binge watched and then immediately watched the Christmas special. Can we start a petition? Or cause an actual scene?? I’ll start💃🏼☺️",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hnvncy/murderville_season_2/"
    },
    {
        "id": "1ho12g4",
        "author": "themadhatter077",
        "title": "What happened to Mind Hunter?",
        "content": "Are they still planning to shoot Season 3? \n\nThis show left us hanging. Can't find any news on it any more. I really wish they would continue the story. It's riveting and one of my favorite crime shows that is based on a true story. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ho12g4/what_happened_to_mind_hunter/"
    },
    {
        "id": "1ho0t2y",
        "author": "Robemilak",
        "title": "'Carry-On' Set to Enter Netflix's \"Top 10 of All Time\" Movie List",
        "content": "",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ho0t2y/carryon_set_to_enter_netflixs_top_10_of_all_time/"
    },
    {
        "id": "1hnu5bo",
        "author": "LatterPick7252",
        "title": "WWE SmackDown - December 27, 2024 | Live on Netflix in Chile, Brazil &amp; Spain",
        "content": "",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hnu5bo/wwe_smackdown_december_27_2024_live_on_netflix_in/"
    },
    {
        "id": "1hnvuat",
        "author": "Proper_Chemistry148",
        "title": "Ackley bridge",
        "content": "If any of you guys/girls are on the United Kingdom Netflix server, watch ackley bridge. It is very good and worth the watch. One of the main characters ( Jordan) is my good friends dad in real life!!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hnvuat/ackley_bridge/"
    },
    {
        "id": "1hnzfmf",
        "author": "DelayDifficult3376",
        "title": "Learning English with Movies",
        "content": "I'm not a native English speaker. But our teachers taught us about English. I understand English. I love to watch Hollywood movies. \n\nWhich one is more helpful to learn English? Watching with subtitles or no subtitles?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hnzfmf/learning_english_with_movies/"
    },
    {
        "id": "1hnskbp",
        "author": "Ok_Doctor_2057",
        "title": "Why is the streaming quality of movies so bad on mobile?",
        "content": "Very weird and specific issue but whenever I watch a movie on netflix on my phone the quality is always kinda blurry, looks worse than 720p, doesn't happen when I watch any TV show on the same phone and on the same internet and it doesn't happen whatsoever on my PC.",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hnskbp/why_is_the_streaming_quality_of_movies_so_bad_on/"
    },
    {
        "id": "1hnvt1j",
        "author": "Proper_Chemistry148",
        "title": "Need something new ",
        "content": "I love 2010s series’s, such as walking dead and Prison break. Them sort of shows really excite me so looking for some shows that are like these. Thanks in advance. Sorry if there are any spelling or grammar errors, I have heavy dyslexia and struggle with this. Thank you all 💕💙",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hnvt1j/need_something_new/"
    },
    {
        "id": "1hnv1tp",
        "author": "AA0208",
        "title": "Squid Game Season 2 Boat Captain",
        "content": "So apparently this captain was helping the cop for 2 damn years for free! But he was caught doing something to a drone. I'm guessing he knows where the island is and for two years he kept visiting islands that were wrong but why?.... Why not just kill the cop? What about when the others notice the drone pilot is no longer on the ship, it should be obvious the captain did it, the drone is in his office and the other guy caught the captain in the area of commotion. Hopefully they clear this up",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hnv1tp/squid_game_season_2_boat_captain/"
    },
    {
        "id": "1hnuxbq",
        "author": "Exciting-Metal-2517",
        "title": "Issues with Netflix pausing? ",
        "content": "My Netflix on my Roku Express was pausing every 5-10 seconds and driving me bonkers!! I canceled Netflix twice over it, when tech support just had me run through what I had already tried and it didn’t work again. So I picked up little pieces from around the internet and tried a few things and it stopped! So thought I’d share what I did here, in case anyone else is having the same issues. \n\nFirst, deleted all cookies I could on the Netflix account in my browser. \nAlso on the browser, changed the video quality to medium. \nDeleted and reinstalled the app.\nHit play and when it paused the first time, gave it about a minute before hitting play. \n\nNo more pausing!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hnuxbq/issues_with_netflix_pausing/"
    },
    {
        "id": "1hn3b1j",
        "author": "Cheddar18",
        "title": "So La Palma absolutely sucked.. what other natural disaster movies or shows should I try next!? ",
        "content": "Talk about plot armor... damn what a disappointment of a show. \n\n\nBut now I'd love to watch any other natural disaster shows or movies- I've seen Greenland so many times but am not sure what else to watch that's actually good. I'd love any recommendations please!! \n\n\nEdit- thank you everyone for the recs, please keep them coming because I love this genre!! I started The Wave 🕺🏻",
        "upvotes": 86,
        "comments": 73,
        "media": null,
        "permalink": "/r/netflix/comments/1hn3b1j/so_la_palma_absolutely_sucked_what_other_natural/"
    },
    {
        "id": "1hnlewa",
        "author": "amatamasamo",
        "title": "Home screen permanently / only showing me games ",
        "content": "I have seen a few posts in a similar vein, but nothing addressing this exact issue, which is that every single time I open the browser UI, I am only ever shown the insufferable watermelon game. No new releases, no actual film or television recommendations, just this useless, gaudy game that I have zero interest or intention of ever playing. Is this just a me problem, or are others seeing/dealing with the same thing? ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hnlewa/home_screen_permanently_only_showing_me_games/"
    },
    {
        "id": "1hnt8g9",
        "author": "Natas29A",
        "title": "How can I stream Netflix on my 12-year-old Sharp Aquos TV?",
        "content": "Hi everyone!\n\nI have a 46-inch Sharp Aquos TV that I bought around 2010. I've been trying to figure out how to stream Netflix on it, but I'm not sure what my best options are. The TV has some HDMI ports and a USB port. I have an android tablet and an iPad.\n\nI've considered using Chromecast or some other streaming device, but I'd love to hear your thoughts or suggestions. Has anyone managed to get Netflix working on a similar older TV? \n\nFor those who would be tempted to just tell me to buy a new TV : I just want to give a purpose to my TV that have been sitting lifeless on my fireplace for several years, I've figured out that streaming Netflix would be a good solution.\n\nThanks in advance for your help!",
        "upvotes": 0,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1hnt8g9/how_can_i_stream_netflix_on_my_12yearold_sharp/"
    },
    {
        "id": "1hn4upw",
        "author": "Zeroyhme",
        "title": "Squid Game: Season 1 vs Season 2",
        "content": "",
        "upvotes": 54,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1hn4upw/squid_game_season_1_vs_season_2/"
    },
    {
        "id": "1hnncr2",
        "author": "randomguy0952",
        "title": "Why does Spy x family not appear on my netflix?",
        "content": "I've been waching spy x family on my home country, That's when I moved to qatar, The problem is I can't find spy x family in netflix it's only the movie. I really wanted to finish the whole season can someone please help?\n\n",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hnncr2/why_does_spy_x_family_not_appear_on_my_netflix/"
    },
    {
        "id": "1hnrrs3",
        "author": "No_Entertainment8792",
        "title": "Squid Game Season 2 Shouldn’t be judged",
        "content": "Season 2 of squid games was good imho. I thought it was not as great as season 1 but also season 1 is low key a masterpiece so there is no topping that. I know I just judged this season but I feel like personal I can't fully give my opinion on this season until the next one drops. This is because the season ends on a cliffhanger and it feels like season 2 and 3 are meant to be judged together. That's why when I watch the next season I am going to look at it as if it's season 2 b and then I will be able to formulate a proper opinion on this season.",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1hnrrs3/squid_game_season_2_shouldnt_be_judged/"
    },
    {
        "id": "1hnr9p8",
        "author": "emofem22",
        "title": "Movie help",
        "content": "Hey guys, I remember watching a hand drawn/painted animated film on UK Netflix a few months ago and I’m having a hard time remembering what it was called and I’m also struggling to remember what it was about, if anyone could help me I would really appreciate it. Thanks :) ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hnr9p8/movie_help/"
    },
    {
        "id": "1ho06kc",
        "author": "EthanWilliams_TG",
        "title": "Comedian Hannah Berner Speaks Out on Her Controversial Netflix NSFW Blake Lively Joke",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ho06kc/comedian_hannah_berner_speaks_out_on_her/"
    },
    {
        "id": "1hnwh5w",
        "author": "Dazzling_Rip7921",
        "title": "what’s the deal with Squid Game 2 characters",
        "content": "What's up with these over stereotyped characters? I swear to god i cringed every second Thanos the rapper was on screen. I just finished episode 3 and I thought it would be a great show but then the game started. The red light-green light part where Thanos starts jumping like a Joker wannabe after witnessing the girl he tried to bang (by fucking rapping an improvized song, and she also liked it) get shot in the head is absolutely horrible, with over exaggerated facial expressions, or the part where they introduce the Crypto Youtuber??!! Whaaaat the fuccckkk it's like a total boomer tried to replicate the gen-z world.\nAnd let’s not speak about the fact that the dude who witnessed his boss get shot in the head now is the frontman of a fucking marine group, like veteran soldiers need him to guide them and take strategic decisions.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hnwh5w/whats_the_deal_with_squid_game_2_characters/"
    }
]