[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 9,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 32,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1kk752l",
        "author": "Short-Complex4819",
        "title": "A Deadly American Marriage - Molly's Lies",
        "content": "Among her many INSANE lies was something that didn't sit well with me at all. Wondering if anyone else thought of this too.\n\nSo Molly lied to the maid of honor and said she had been friends with Mags, the wife who died of an asthma attack. Why didn't anyone say to the father when he gave those lies about Mag's father: Didn't your daughter claim to be friends with Mags? If she had been murdered by Jason, why didn't she know already to be afraid of him? Why did she marry someone who she thought had killed her friend?\n\nThere were SO many opportunities here to catch these people up in her lies and to send them to jail forever, and I am just beyond disgusted that there wasn't a bigger push to expose her for the BPD lying fraud she is, and HE is.",
        "upvotes": 166,
        "comments": 86,
        "media": null,
        "permalink": "/r/netflix/comments/1kk752l/a_deadly_american_marriage_mollys_lies/"
    },
    {
        "id": "1kk53z5",
        "author": "cdigir13",
        "title": "A Deadly American Marriage: Molly’s Mom",
        "content": "I was basically convinced it was an actual murder when I heard Molly’s Mom was there the whole time. And that her story was, Molly’s Dad and Mom heard Molly scream and her dad grabbed a baseball bat and went to see what was going on and her mom rolled over and went back to sleep.  But what really convinced me was later it they said Mollys parents were aware of the “domestic abuse” and that her mom gave the children specific safe words and her phone number and had the children hide it because Mollys Mom believed he was that dangerous. There is NO WAY you would roll over and go back to sleep in that situation. She would have been awake and 911 called or ready to be called. ",
        "upvotes": 67,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1kk53z5/a_deadly_american_marriage_mollys_mom/"
    },
    {
        "id": "1kk7yoq",
        "author": "S4v1r1enCh0r4k",
        "title": "David Fincher and Netflix Reportedly Clash Over Title of Squid Game American Spin-Off, Netflix wants to keep \"Squid Game\" in the title, Fincher doesn't",
        "content": "",
        "upvotes": 29,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1kk7yoq/david_fincher_and_netflix_reportedly_clash_over/"
    },
    {
        "id": "1kkd0la",
        "author": "54321hope",
        "title": "Fuuuuuck. (Orgasm Inc) I need brain bleach.",
        "content": "I missed this in 2022 and decided to watch this today after seeing news about the federal trial, but knowing nothing else about it. \n\nIronically, I just really wanted some distraction from things I'm worrying about. Big mistake. Totally and profoundly SHOOK. Repulsed, nauseous, and I was weeping by the end for some of the victims who spoke up in one way or another. Nicole Daedone is an egomaniacal monster and I hope they throw the WHOLE book at her. Off in search of some comedic antidote....",
        "upvotes": 8,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1kkd0la/fuuuuuck_orgasm_inc_i_need_brain_bleach/"
    },
    {
        "id": "1kk5oez",
        "author": "proofofclaim",
        "title": "Was Zero Day written by AI?",
        "content": "Would any anonymous Netflix employees care to divulge anything?\n\nThe plot was so disconnected, so many loose threads that went nowhere and intrigues that turned into dead ends. \n\nThe characters were flat and some of the dialogue was bizarre. Some conversations just came to weirdly abrupt ends or with people blurting out inappropriate tangents. \n\nThe scenes were all too short and chaotic, like those 10 second clips with no cohesion people generate in Runway and call a movie. \n\nAnd the black female president was too incompetent to lead so they had to call back the old white former president with Alzheimers?\n\nHow did they get flaming liberal actors like De Niro to star in a miniseries that is a conservative's wet dream? \n\nNothing about this show makes sense! I just have this strong feeling that this is an experiment in AI generated scripts.",
        "upvotes": 16,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1kk5oez/was_zero_day_written_by_ai/"
    },
    {
        "id": "1kjiek1",
        "author": "Opening_Income9862",
        "title": "A Deadly American Marriage",
        "content": "I was keeping an open mind as to the guilt of Molly and her father. Then, they described the recording devices she had set up. \n\nThe fact that the worst example of his 'abuse' that they shared from the recordings was that argument over the dinner sealed the deal for me. That OBVIOUSLY wasn't abuse and the fact they thought THAT was evidence of abuse is actually the strongest evidence that he WASN'T abusive. He sounded frustrated, and yes, he was kind of a jerk to his daughter, but abuse? Insane. A biological parent threatening to separate the kids from their stepparent in response to the stepparent threatening the same thing is a pretty natural response.\n\nMolly clearly has borderline personality disorder and both Molly and her Father are sick individuals, in my opinion. ",
        "upvotes": 634,
        "comments": 321,
        "media": null,
        "permalink": "/r/netflix/comments/1kjiek1/a_deadly_american_marriage/"
    },
    {
        "id": "1kk528v",
        "author": "GenTrapstar",
        "title": "Brooklyn Nine Nine",
        "content": "Just want to say I really like Captain Holt’s character. Watched the show when it first came out probably the first 3 seasons. Recently picked it back up and it’s still just as funny. Glad to kno there’s 8 seasons sad that it came to a finale😞\n\nP.S all the characters are great and have good personalities IMO. Like there’s not really a bad character on the show IMO. ",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kk528v/brooklyn_nine_nine/"
    },
    {
        "id": "1kkfrvx",
        "author": "Tilley881",
        "title": "Space Force s3",
        "content": "With all the nonsense going on in our country lately, this is a prime time to give us a space force season 3. Season 2 was kinda meh....but this could be epic!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kkfrvx/space_force_s3/"
    },
    {
        "id": "1kkcclz",
        "author": "Zestyclose-Let7929",
        "title": "Netflix shuts off during a watch and after every episode.",
        "content": "I cancelled my Netflix because I was forced to upgrade to the $17.99 a month because my $7.99 plan with Ads shut off during shows. Turned off after every episode. The Ads freeze. Then shuts off. \n\nI paid the $17.99 a month for a while to be able to continue the shows. \n\nI figured let them figure out the problem. \nHere I am 6 months later and the same issues. \n\nActually it also kicks me out of Netflix and I have to start to reload again. Only to have it happen minutes later. \n\nThis is clearly intended to go to the $17.99 a month because I am not the only one experiencing. \n\nAnd I order thru Netflix directly. No third party, ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1kkcclz/netflix_shuts_off_during_a_watch_and_after_every/"
    },
    {
        "id": "1kkbxsm",
        "author": "TheArxeus",
        "title": "extra member as profile in main account",
        "content": "So back when I was living with my parents I used to have my profile on their account. Then I moved out and that profile became an extra member. Now Im back living with my parents and no longer need that extra member but I can't find a way to use my profile back on their account. Is there any way to achieve this? I can't transfer my profile from my extra member account.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kkbxsm/extra_member_as_profile_in_main_account/"
    },
    {
        "id": "1kkali7",
        "author": "Mammoth-Clock-4876",
        "title": "Bad boy ! Ma freddy?",
        "content": "Buongiorno a tutti. Ma nella serie islamica uscita da poco “ bad boy” qualcuno mi sa dire che fine fa il temibile Freddy? Inizia la serie in modo crudissimo , dove ci sono sti delinquenti affiliati a freddy che ammazzano il suo primo amico. Poi freddy minaccia il protagonista di uccidere il suo nuovo compagno di cella nero.\nE poi ? Dean si rifiuta di amazzarlo e quindi? Poi non si vede più , né lui e nemmeno il killer col cappellino che all’inizio spacca la mascella al modus operandi di american history X.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kkali7/bad_boy_ma_freddy/"
    },
    {
        "id": "1kj3bot",
        "author": "RoxieMatthews",
        "title": "Molly Martens is a psycho - A Deadly American Marriage",
        "content": "I’m in shock with this girl - she’s an absolute psycho. Like the audacity to be talking like she’s the victim!? Like we should feel bad for her?\n\nHer lies about giving birth to Sarah, and how obsessed she is talking about adopting them. She wanted those kids and Jason paid for it. \n\nAlso the RECORDING they tried to use as proof as abuse is insane. Yelling and fighting within families is normal and doesn’t = abuse. Absolutely pathetic excuse. \n\nHer and her disgusting father should still be in prison. I hope she has an awful life. Vile humans. ",
        "upvotes": 1111,
        "comments": 650,
        "media": null,
        "permalink": "/r/netflix/comments/1kj3bot/molly_martens_is_a_psycho_a_deadly_american/"
    },
    {
        "id": "1kk9kyr",
        "author": "ElsaJeanAsDeanerys",
        "title": "The Eternaut - similar TV shows or movies.",
        "content": "Hello. Im looking for similar television shows or movies. I like post apocaliptic scfi TV shows and movies like a The Eternaut. It can be on Netflix and it can be on other platforms aswell. Sorry for my bad English. Thank you for your help and have good day. Any similar TV shows and movies?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kk9kyr/the_eternaut_similar_tv_shows_or_movies/"
    },
    {
        "id": "1kjy8p4",
        "author": "TimesandSundayTimes",
        "title": "British Netflix boss: the key to my success? Zero snobbery",
        "content": "",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kjy8p4/british_netflix_boss_the_key_to_my_success_zero/"
    },
    {
        "id": "1kkg9ad",
        "author": "john_hamm",
        "title": "I opened this Happy Gilmore VHS 📼 Chubbs would be proud",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kkg9ad/i_opened_this_happy_gilmore_vhs_chubbs_would_be/"
    },
    {
        "id": "1kk91yg",
        "author": "Witty-Telephone-8950",
        "title": "Changed ratings, shows aren’t showing up",
        "content": "I've been using my mom's Netflix account for a long time because we just never changed the parental controls for my account bc it was set for Netflix kids. Recently I finally changed my account settings for all ratings (rated R and down) but shows aren't showing up. I've been meaning to watch \"you\" on it and it didn't show up so I started typing in other shows and they weren't showing up such as \"breaking bad\" and \"outer banks\" to just name a few. Is this because I just changed the age rating? Or is it a glitch?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kk91yg/changed_ratings_shows_arent_showing_up/"
    },
    {
        "id": "1kk39v1",
        "author": "lunacomet",
        "title": "HTTP ERROR 403",
        "content": "Hello everyone,\n\nSince yesterday I have unfortunately been receiving HTTP ERROR 403 when trying to access Netflix from my PC. I went to the support website &amp; followed all of the suggestions from closing all Netflix tabs &amp; restarting my browser &amp; my PC. I've also cleared all cookies &amp; checked if my PC needed any updates. I lastly contacted support directly both yesterday &amp; today after waiting 24hrs as they suggested without any improvements. :( The issue only seems to be on PC, it works perfectly on my TV &amp; phone.  \n  \nI think sometime yesterday I might've left my gaming controller on my keyboard, and it could've possibly spam refreshed the netflix website. I'm not sure if this could be related to the issue.  \nBy chance does anyone have any suggestions? Is this a temporary ban or permanent ban? Thank you",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kk39v1/http_error_403/"
    },
    {
        "id": "1kk7w3s",
        "author": "Empty-Instruction282",
        "title": "Last Bullet: Lost bullet trilogy Turbo-Charged Showdown on Netflix!",
        "content": "The Lost Bullet trilogy, a French action-thriller series, follows Lino (Alban Lenoir), a skilled mechanic and ex-convict turned police asset, navigating a world of corrupt cops and high-stakes car chases. In Lost Bullet (2020), Lino, imprisoned after a botched heist, joins a drug squad to modify police vehicles. When his mentor, Charas, is killed by crooked cop Areski (Nicolas Duvauchelle), Lino must find a bullet in a missing car to prove his innocence, delivering gritty action and practical stunts. Lost Bullet 2 (2022) sees Lino, now a cop, seeking revenge for Charas and his brother’s murder, leading a narcotics unit with Julia (Stéfi Celma). The sequel ramps up car chases and combat, exploring Lino’s moral dilemmas amidst corruption.Last Bullet (2025), the trilogy’s finale, premieres on Netflix May 7, 2025. Fresh from prison, Lino pursues Areski and a corrupt commander, forming fragile alliances in a chaotic chase across southern France. Packed with intense fights, a tram battle, and helicopter pursuits, it concludes Lino’s vendetta with explosive, practical stunts. The trilogy, directed by Guillaume Pierret, is celebrated for its raw action, lean storytelling, and Lenoir’s compelling performance, earning praise as a standout Euro-action franchise.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kk7w3s/last_bullet_lost_bullet_trilogy_turbocharged/"
    },
    {
        "id": "1kjveel",
        "author": "abhijeit",
        "title": "Problems and plot holes in 1899 (Netflix)",
        "content": "Just finished  1899 and loved the atmosphere, but the more I think about it, the more the plot holes and unresolved mysteries bother me. Here’s my breakdown of the biggest issues—let me know what I missed or if you have theories!\n\n# 1. The Simulation Twist Undermines Everything\n\nThe big reveal that it’s all a simulation (or layers of them) makes emotional moments feel weightless. If nothing’s \"real,\" why should we care about character deaths or trauma? Even worse, the rules of the simulation are never clear—why do the black crystals, memory bugs, or the Prometheus ship behave so inconsistently?\n\n# 2. Character Backstories Go Nowhere\n\n1899 set up really interesting character stories but then forgot about them. The French couple Clemence and Lucien had a troubled marriage with hints of cheating or maybe an abortion, but none of it went anywhere. The French lady who seemed to be forcing Ling Yi into prostitution just disappeared from the story. Ling Yi and her mom did something horrible - they killed another girl to steal her identity - but the show never explained why this mattered. They also hinted Ling Yi might be pregnant, then dropped it completely.\n\nThe little girl Ada died suddenly for no clear reason. Krester's story about his scar and being gay started strong but went nowhere. Why did so many people jump off the ship? Was the simulation breaking? Miguel, the stowaway, had strange visions and a connection to the boy Elliot, but we never learned his backstory. Angel and Ramiro's secret about Ramiro killing a priest to pretend to be him also didn't lead anywhere.\n\nIt's frustrating because all these stories felt important at first, but in the end, none of them really mattered or got explained. The show made us care about these characters, then left us hanging.\n\n# 3. The Pyramid, the Black Goo, and Elliot’s Role\n\n* The black pyramid/archive is treated as a big deal, but we never learn what it actually *does*.\n* The black substance spreads like a virus, but is it code? A metaphor? Who knows.\n* Elliot exists as a child in the simulation, but why? Is he a glitch, a memory, or a failsafe?\n\n# 4. The Ending Creates More Confusion\n\nMaura wakes up in 2099 on a spaceship, implying the 1899 simulation was just one layer. But:\n\n* Why is Ciaran suddenly in control?\n* Are the other passengers real people or AI?\n* If this is \"reality,\" how does it connect to the 1899 simulation?\n\n# 5. Cancellation Left Us Hanging\n\nNetflix axed the show after one season, so we’ll *never* get answers about Ciaran, the spaceship, or whether any of it mattered. The creators (*Dark* fans know this pain) love complex mysteries, but without payoff, it feels like wasted potential.\n\n# Was It All Just a Video Game?\n\nSome theories suggest  1899 is a psychological experiment or a *Matrix*\\-style VR game, but with no S2, we’re left guessing.\n\nWhat do you think—did the plotholes ruin it for you, or was the ride worth it?",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kjveel/problems_and_plot_holes_in_1899_netflix/"
    },
    {
        "id": "1kjy3cf",
        "author": "Putrid_Draft378",
        "title": "Default \"data saver\" video quality preset",
        "content": "I feel like Netflix should enabled the \"data saver\" video quality preset by default for everyone, to combat climate change, reduce energy consumption and energy dependency from abroad, and reduce air pollution.\n\nMost people aren't gonna notice it anyway, and even if they do and complain, they before mentioned stuff is more important than \"eye candy\".\n\nAnd this should be the case for all other video streaming platforms and services as well, in my opinion, with people of course still having the option to change the quality manually if they want. \n\nBut Netflix should be first on doing this, and it would really help them reach their environmental goals.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kjy3cf/default_data_saver_video_quality_preset/"
    },
    {
        "id": "1kjhgzz",
        "author": "InterestingCod3541",
        "title": "What to watch?",
        "content": "Can you give me suggestions on what to watch? Here are some series I have watched so you know my genre (it's mixed): The Good Place, Brooklyn Nine-Nine, Dead to Me, Lucifer, The Flash (season 6), Inventing Anna, The Queen's Gambit, Sherlock, The Office, Stranger Things, Wednesday, Money Heist, Lupin, The Lincoln Lawyer, Breaking Bad, Dead Boy Detectives, Young Sheldon, Good Witch, Altered Carbon, Unbreakable Kimmy Schmidt, Space Force, Russian Doll, Locke &amp; Key, Manifest, Chaos, Lost in Space.\n\nSo I like comedy, criminal, sci-fi...\nI gave you a lot, haha, but so you know what I have watched and what I like. Thank you!",
        "upvotes": 16,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1kjhgzz/what_to_watch/"
    },
    {
        "id": "1kk7vye",
        "author": "SelfAmbitious",
        "title": "JOHN CENA RETAINS IN A CRAZY FINISH!!!!!!! Wwe Backlash 2025 Review",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kk7vye/john_cena_retains_in_a_crazy_finish_wwe_backlash/"
    },
    {
        "id": "1kj6k79",
        "author": "Nastia_dream",
        "title": "Is Orange is the new Black worth watching all the way through ?",
        "content": "So i started watching this show recently for the first time, i’m only 3 episodes into it and i kind of like it. I think it’s definitely that kind of show to watch after a long day at work and unwind. But is it worth watching all 7 seasons? I heard the writing gets worse after first few seasons. ",
        "upvotes": 54,
        "comments": 85,
        "media": null,
        "permalink": "/r/netflix/comments/1kj6k79/is_orange_is_the_new_black_worth_watching_all_the/"
    },
    {
        "id": "1kjdhey",
        "author": "Molybecks",
        "title": "Phil Spector case would make for an amazing ‘Monster’ series/‘American Crime Story’",
        "content": "\n\nPhil Spector would make for an amazing ‘Monsters’ series\n\nIn 2003 music producer “accidentally” shot and instantly killed actress Lana Clarkson in his mansion, pretty much in the same spot he got married to his wife at the time (not Ronnie Spector, they were long divorced by this point) \n\nThe trial was bonkers and the whole thing is all types of creepy. ",
        "upvotes": 12,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kjdhey/phil_spector_case_would_make_for_an_amazing/"
    },
    {
        "id": "1kk2xa2",
        "author": "MasterGeek",
        "title": "Will there be more breakups and divorces after people watch The Four Seasons show ? It legitimizes the \"grass is greener\" perspective",
        "content": "Will there be more breakups and divorces after people watch The Four Seasons show ?\n\nIt legitimizes the \"grass is greener\" perspective after watching what Nick did",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1kk2xa2/will_there_be_more_breakups_and_divorces_after/"
    },
    {
        "id": "1kjs9vt",
        "author": "BattleNo1217",
        "title": "Confusing plot in The Eternaut",
        "content": "There seems to be a very confusing plot element in the series. Juan and Tano go out to find Clara, but reach a wall of cars. Then they go to a church, which seems to be on the same side of the city as Tano's house. Then they bypass the wall of cars through a tunnel - and end up back at Tano's house! How is that possible? \n\nAnd then the people from the church set out for Campo de Mayo, but how could they do that if they are back at the \"wrong\" side of the city?\n\nIn the end, what was the goal of cutting through the wall of cars?\n\nAnother thing: the car Juan finds in the wall of cars seems to be on both sides of the wall.\n\nMaybe I got something wrong.",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1kjs9vt/confusing_plot_in_the_eternaut/"
    },
    {
        "id": "1kjgp6y",
        "author": "indiewire",
        "title": "The Best Movies New to Netflix in May 2025",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kjgp6y/the_best_movies_new_to_netflix_in_may_2025/"
    },
    {
        "id": "1kjifij",
        "author": "aniikenobi",
        "title": "recs for really good shows based on my likes?",
        "content": "Struggling to find something good! My favorite shows (not just on netflix, for a better idea of my faves) are The 100, The Good Place, Reign, Criminal Minds, The Haunting of Hill House, Bly Manor, The Last of Us, Obi-Wan Kenobi, &amp; You s1-3. I also liked the Kidfluencing doc, various true crime docs, Normal People, Cruel Summer, Supernatural, Bridgerton, etc. \n\nTIA!! ",
        "upvotes": 4,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1kjifij/recs_for_really_good_shows_based_on_my_likes/"
    },
    {
        "id": "1kjno3y",
        "author": "tako1559",
        "title": "\"Your device isn’t part of the Netflix Household for this account\"",
        "content": "Is this a new thing? I literally was watching on netflix on my computer yesterday but this morning this showed up and I couldn't watch anything anymore. I noticed it says this on their website now but I don't know if it's a new thing or not. \n\nMy dad and sister back in the West Coast can use it, but I'm unable to. I've been living on the East Coast for the longest time and this is the first time this has showed up for me. \n\n",
        "upvotes": 1,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1kjno3y/your_device_isnt_part_of_the_netflix_household/"
    },
    {
        "id": "1kjvqj3",
        "author": "Remarkable_Shake9364",
        "title": "Content not playing at 4k",
        "content": "So my monitor supports 1440p, I have a 4k UHD subscription. But every show and movie I click on it says HD, but there’s Spatial Audio. Why is there nothing available on 4k?",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1kjvqj3/content_not_playing_at_4k/"
    }
]