[
    {
        "id": "1i91uga",
        "author": "BunyipPouch",
        "title": "Announcement: Today's AMA/Q&amp;A with Brady Corbet, director of A24's 'The Brutalist' has unfortunately been cancelled.",
        "content": "",
        "upvotes": 110,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/lhkbu3klfzee1.jpeg?auto=webp&amp;s=0d23f73e5cc6f009fb15f0af7adf892fad781c82"
        },
        "permalink": "/r/movies/comments/1i91uga/announcement_todays_amaqa_with_brady_corbet/"
    },
    {
        "id": "1i6llai",
        "author": "ICumCoffee",
        "title": "What is the Best Film You Watched Last Week? (01/14/25 – 01/21/25)",
        "content": "The way this works is that you post a review of the Best Film you watched this week. It can be any new or old release that you want to talk about.\n\n**Here are some rules:**\n\n1. **Check to see if your favorite film of last week has been posted already.**\n2. **Please post your favorite film of last week.**\n3. **Explain why you enjoyed your film.**\n4. **ALWAYS use SPOILER TAGS.**\n5. **Comments that only contain the title of the film will be removed.**\n\n[Last Week's Best Submissions:](https://old.reddit.com/r/movies/comments/1i17gtb/what_is_the_best_film_you_watched_last_week/)\n\n|Film|User|\n|:-|:-|\n|[Nosferatu (2024)](https://old.reddit.com/r/movies/comments/1i17gtb/what_is_the_best_film_you_watched_last_week/m748z7l/)|Comic\\_Book\\_Reader|\n|[The Last Samurai (2003)](https://old.reddit.com/r/movies/comments/1i17gtb/what_is_the_best_film_you_watched_last_week/m73rn48/)|acerage|\n|[Get Away (2024)](https://old.reddit.com/r/movies/comments/1i17gtb/what_is_the_best_film_you_watched_last_week/m73rdky/)|parky101|\n|[Better Man (2024)](https://old.reddit.com/r/movies/comments/1i17gtb/what_is_the_best_film_you_watched_last_week/m75mj6u/)|\\_Maui\\_|\n|[Asteroid City (2023)](https://old.reddit.com/r/movies/comments/1i17gtb/what_is_the_best_film_you_watched_last_week/m77zpoc/)|roadrunner440x6|\n\n​",
        "upvotes": 28,
        "comments": 114,
        "media": null,
        "permalink": "/r/movies/comments/1i6llai/what_is_the_best_film_you_watched_last_week/"
    },
    {
        "id": "1i9oyhj",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Kate Mara in 'The Astronaut' - Following her first space mission, astronaut Sam Walker is placed under NASA’s care for rehabilitation and medical testing. However, when disturbing occurrences begin happening, she fears that something extraterrestrial has followed her back to Earth",
        "content": "",
        "upvotes": 347,
        "comments": 58,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/brdgtqpno5fe1.jpeg?auto=webp&amp;s=f6cecaa61e3942d7072c9f25fd8c345e3e31971c"
        },
        "permalink": "/r/movies/comments/1i9oyhj/first_image_of_kate_mara_in_the_astronaut/"
    },
    {
        "id": "1i9p1z1",
        "author": "QouthTheCorvus",
        "title": "Willem DaFoe is truly such an incredible actor. He elevates every movie he's in",
        "content": "I just watched The Florida Project, and his performance in that is so amazing. It's crazy how watchable he is as an actor. You're so immersed in his role and the world around him. Despite being such a well known actor, you completely accept that he's Bobby, manager of the Magic Kingdom. \n\n  \nThere's also The Lighthouse, a movie that completely lives or dies by his performance, and he puts on a fantastic show. It's a very stage play performance, but it's so fun to watch. [The curse in The Lighthouse](https://www.youtube.com/watch?v=I3vcK-ppzqE&amp;ab_channel=TheOncomingStorm) alone is one of the greatest pieces of acting I've ever seen. Such a powerful scene. \n\n  \nI can't believe this man hasn't won an Oscar yet. He's a complete gift to the film industry. ",
        "upvotes": 240,
        "comments": 74,
        "media": null,
        "permalink": "/r/movies/comments/1i9p1z1/willem_dafoe_is_truly_such_an_incredible_actor_he/"
    },
    {
        "id": "1i99efa",
        "author": "Sisiwakanamaru",
        "title": "Sandra Bullock and Nicole Kidman will officially return for ‘Practical Magic 2.’",
        "content": "",
        "upvotes": 2506,
        "comments": 126,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/arFthvZbWgIQZN-ZI2aPrABalZOvMWFTj2uwXVwQAL4.jpg?auto=webp&amp;s=55157e771f3262dd1250dab67d4e296193de7be5"
        },
        "permalink": "/r/movies/comments/1i99efa/sandra_bullock_and_nicole_kidman_will_officially/"
    },
    {
        "id": "1i9dt36",
        "author": "New_Transition8925",
        "title": "Movies that capture the *feel* of the 1990s",
        "content": "I was born the in early 1990s, but was really too young to remember how exactly those times felt (socially, politically, aesthetically, etc.) It doesn’t have to necessarily be a movie *made* in the 90s (I’m sure that will make the most sense though), I’m just looking for movies that highlight the general feeling of the time. \n\nI’m hoping to watch some films that really capture the era, all recs are welcome! ",
        "upvotes": 696,
        "comments": 1628,
        "media": null,
        "permalink": "/r/movies/comments/1i9dt36/movies_that_capture_the_feel_of_the_1990s/"
    },
    {
        "id": "1i94cwg",
        "author": "mayukhdas1999",
        "title": "First Image of Daisy Ridley in 'WE BURY THE DEAD' - In the aftermath of a catastrophic military experiment, a desperate woman joins a \"body retrieval unit” in the hope of finding her husband alive, but her search takes a chilling turn when the corpses start showing signs of life",
        "content": "",
        "upvotes": 2558,
        "comments": 169,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9ux81zejyzee1.jpeg?auto=webp&amp;s=d1c1011591bf244168117feb7fe753e0661f90e5"
        },
        "permalink": "/r/movies/comments/1i94cwg/first_image_of_daisy_ridley_in_we_bury_the_dead/"
    },
    {
        "id": "1i9ojec",
        "author": "BunyipPouch",
        "title": "Poster for the 50th Anniversary 4K Restoration &amp; Re-Release of Peter Weir's 1975 Masterpiece 'Picnic at Hanging Rock'",
        "content": "",
        "upvotes": 75,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8hhl8ae0l5fe1.jpeg?auto=webp&amp;s=b7866c810e2a08c45ac0f27546b0a048ff3b2728"
        },
        "permalink": "/r/movies/comments/1i9ojec/poster_for_the_50th_anniversary_4k_restoration/"
    },
    {
        "id": "1i98pfx",
        "author": "MarvelsGrantMan136",
        "title": "Zach Cregger to Tackle ‘Resident Evil’ Reboot, Igniting Bidding War",
        "content": "",
        "upvotes": 1234,
        "comments": 175,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/m-uTYCJep8m9dWlHRUdR7w-zhkAbQKr6xyfnnLpB8fU.jpg?auto=webp&amp;s=db49d5588519c6a7b09a406d9033faa0872e687d"
        },
        "permalink": "/r/movies/comments/1i98pfx/zach_cregger_to_tackle_resident_evil_reboot/"
    },
    {
        "id": "1i8twf3",
        "author": "cheff1616",
        "title": "When does a movie really start? Connecticut official wants theaters to post accurate times",
        "content": "This is giving hidden-fees-on-Ticketmaster",
        "upvotes": 10946,
        "comments": 1126,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/DnK7yD3XqPe3vUdccBYCJfcb6UnoyEvdhnxr7AEhe7k.jpg?auto=webp&amp;s=ac421bc646ace8247f8b8e6ed6cedbaea0716e0d"
        },
        "permalink": "/r/movies/comments/1i8twf3/when_does_a_movie_really_start_connecticut/"
    },
    {
        "id": "1i96d1t",
        "author": "MarvelsGrantMan136",
        "title": "Daisy Ridley’s ‘Star Wars’ Movie Enlists 'Oceans 12' Writer George Nolfi",
        "content": "",
        "upvotes": 1541,
        "comments": 650,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sLMggscKx6M-hltLgebaePbbSq55olabZbz9yLNvQz4.jpg?auto=webp&amp;s=9cc4930e048f00ebf02c95c01283302ea0008e35"
        },
        "permalink": "/r/movies/comments/1i96d1t/daisy_ridleys_star_wars_movie_enlists_oceans_12/"
    },
    {
        "id": "1i8sgep",
        "author": "Zaku71",
        "title": "Eric Stoltz made me understand the tragedy of the ending of Back to the Future and the inhumanity of the American Dream.",
        "content": "I think a good part of here knows the story behind the first casting of the protagonist of \"Back to the Future\". Michael J. Fox was not available and Eric Stoltz was chosen. But his type of acting was not suitable for what was a comedy, he was fired and MJF who had become available was called. The rest is history.\n\nBut recently I saw an interview with Lea Thompson (who plays Marty McFly's mother, Lorraine Baines).\n\n[https://www.youtube.com/watch?v=r-\\_lWQhgLYA](https://www.youtube.com/watch?v=r-_lWQhgLYA)\n\nHere she tells an interesting anecdote. After the first reading of the script with the actors they are all enthusiastic, the story is great everyone laughs etc etc. Then they ask Eric what he thinks and he says it is a tragedy. Because at the end of the film Marty remembers a past and a family that no longer exists. His new family are strangers who have lived a totally different life. And this new family has lost a son, because at home they have a stranger who coincidentally has the same name.\n\nAnd I add, the movie tells us that all this is perfectly okay why? Because now Marty has a nicer house, he has a new car, he has so many *things*. Marty has lost his whole life but in exchange he has so many new material goods. And this is the essence of the American Dream, as long as you have things (goods, money, power, fame), everything else (love, family, beliefs) can be sacrificed.\n\n(I think that even Crispin Glover - who played Marty's dad, was very critical about the movie message: money and financial success = happiness)",
        "upvotes": 8177,
        "comments": 1115,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XzfKNWWJFBlrEqy-261eJkMTosqqsC_z6rpRwIQ-YPI.jpg?auto=webp&amp;s=8101554b1ff8048953908cc27734fbce5701a977"
        },
        "permalink": "/r/movies/comments/1i8sgep/eric_stoltz_made_me_understand_the_tragedy_of_the/"
    },
    {
        "id": "1i92zz7",
        "author": "MarvelsGrantMan136",
        "title": "The Wayans Brothers' 'Scary Movie' Reboot Sets June 12, 2026 Theatrical Release",
        "content": "",
        "upvotes": 1234,
        "comments": 183,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nFX73oZFhtc2OcUcyP4pWU4Am7Akj3hjDDMvZorax18.jpg?auto=webp&amp;s=ca755e6531bd1a8cfffa86388e7d637e4b6f30ae"
        },
        "permalink": "/r/movies/comments/1i92zz7/the_wayans_brothers_scary_movie_reboot_sets_june/"
    },
    {
        "id": "1i8xn1a",
        "author": "MarvelsGrantMan136",
        "title": "New Image of Scarlett Johansson and Jonathan Bailey in 'Jurassic World: Rebirth'",
        "content": "",
        "upvotes": 2422,
        "comments": 822,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/peq10eybkyee1.jpeg?auto=webp&amp;s=86b6733df1c17e8c677355076f2155e29cf6ee84"
        },
        "permalink": "/r/movies/comments/1i8xn1a/new_image_of_scarlett_johansson_and_jonathan/"
    },
    {
        "id": "1i93nsx",
        "author": "SanderSo47",
        "title": "Denis Villeneuve’s Criterion Movie Closet Picks",
        "content": "",
        "upvotes": 1083,
        "comments": 73,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NFJRwW7vD18SjRLNRvaZ9KAP4Ju2xHR4_mg90qKfkKQ.jpg?auto=webp&amp;s=ffebd3aaed533e1be369d0910132e9639268b456"
        },
        "permalink": "/r/movies/comments/1i93nsx/denis_villeneuves_criterion_movie_closet_picks/"
    },
    {
        "id": "1i9nn3p",
        "author": "MrGittz",
        "title": "What are scenes cut/deleted from a film that SHOULDNT have been cut out?",
        "content": "Deleted scenes have always fascinated me. There are quite a few infamous cut out sequences. Some have been put back in alternate or extended cuts, others released as bonus features, and some have never seen the light of day. Others were scripted but never even filmed.\n\nThe ones that come to mind for me are Michael Corleone killing Fabrizo in Godfather part 1(apparently part of this scene was shot before it got cut and the idea saved for part 2 where it was cut again). There’s a picture of this sequence, or part of it, where Michael apparently shoots Fabrizio with a shot gun. No idea where would it would fit in but the pictures are floating around the internet. I can see why it was cut but it’s something id love to see. \n\nSuperman TMP. Added to the special edition but cut from theatrical is a sequence where Lex Luthor tests Superman’s powers before he can enter Lex’s underground lair. He shoot’s Superman with machine gun bullets, sets him on fire and then freezes him whole. It’s a fun sequence with some cool FX. Even the director, Richard Donner, on the dvd commentary is puzzled why he ever cut the scene.\n\n\nI always loved the Sentry Gun sequence in Aliens which was added back in for the special edition. \n\nGhostbusters 2 has a number of deleted scenes. Many have never been seen. One that’s never been seen is Ray getting possessed by Vigo and crashing the Ecto 1A(remnants of this scene remain in the first montage sequence where we see Peter in the back of the Ecto 1 looking repeatedly to Ray whose running a red light.)\n\n\nAnother from GB2 but has been released which is Dana addressing the fact that she’s involved in another paranormal event and so is there something that makes her vulnerable to these situations? This one is good because it makes light of something we the audience are thinking about. Dana Barrett just so happened to walk in that Slime?Out of all the people it was her AND she has a baby the bad guy wants? After what happened in the first film? Really?\n\nThe alternate ending of Little Shop of Horrors works way better in my opinion. Much darker. But funnier. Great miniature work.\n\nSpider-Man 2 has an extended cut which some extra bits of action on the train but more than anything there’s a scene with MJ and her friend going shoe shopping that I love. It really delves into who MJ is and her friend really gives a nice performance. Plus J Jonah Jameson trying on the Spidey suit is GREAT, the one brought in by garbage man\n\nKill Bill. Ok. This is an interesting one. The Kill Bill that’s been released(both volumes) is not the Kill Bill originally planned. QT wrote an earlier draft and he cut out what I consider to be the best chapter in the entire saga. “Yuki’s Revenge”. This was never filmed. And it’s a damn shame. Gogo has a twin sister and she tracks down Beatrix right after killing Vernita Green. In the film we hear an Ice Cream Truck roaming Vernitas neighborhood. In the script? That’s Yuki and shes found The Brusge and they both go on destroying the neighborhood in an explosive action sequence. Beyond that, there’s a version of the film called “Kill Bill The Whole Bloody Affair” which combines both parts into one film. The House of Blue Leaves is in color and extended(as it was , Extended anime sequence, a new anime sequence but most importantly? We, the audience, spend the entire film thinking Beatrix lost her baby. We don’t find out until SHE finds out that BB is alive. I can only imagine the power of this sequence. It removed the stinger from the end of volume 1 where Bill reveals the truth.\n\nSo those are some of my favourites. I have more but don’t want to name them all.\n\n What are yours?",
        "upvotes": 26,
        "comments": 83,
        "media": null,
        "permalink": "/r/movies/comments/1i9nn3p/what_are_scenes_cutdeleted_from_a_film_that/"
    },
    {
        "id": "1i91mrt",
        "author": "NoCulture3505",
        "title": "‘Godzilla x Kong’ Sequel Adds Kaitlyn Dever To Cast",
        "content": "",
        "upvotes": 1043,
        "comments": 266,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/x35qIYmfXnliBZTgCdv7hOd21yskhEaM2hond9IwRIw.jpg?auto=webp&amp;s=f11abf0a187d1762cff802d91be0ddf8fea5449a"
        },
        "permalink": "/r/movies/comments/1i91mrt/godzilla_x_kong_sequel_adds_kaitlyn_dever_to_cast/"
    },
    {
        "id": "1i94d5b",
        "author": "mayukhdas1999",
        "title": "First Image of Rosamund Pike in 'HALLOW ROAD' - A teenage girl accidentally hits a pedestrian and urgently calls her parents for help. In a frantic rush to reach her, the parents drive down the eerie and desolate Hallow Road, only to uncover dark secrets that threaten to tear their family apart",
        "content": "",
        "upvotes": 563,
        "comments": 84,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2a9hflgdxzee1.jpeg?auto=webp&amp;s=c4470c8280413484c7b697655126d897d80a4c88"
        },
        "permalink": "/r/movies/comments/1i94d5b/first_image_of_rosamund_pike_in_hallow_road_a/"
    },
    {
        "id": "1i9o9xm",
        "author": "griefofwant",
        "title": "Who will the 14 be if they make Ocean's 14?",
        "content": "David Leitch is in talks to direct a new Ocean's movie. \n\nOf the original cast of Ocean's 11, Carl Reiner and Bernie Mac have both passed away.\n\nAssuming the rest of the cast comes back, that leaves five spots open on the crew. Who do you think they should cast?\n\nThey could bring back Julia Roberts, Eddie Izzard and Andy Garcia who were in the team in 12 and 13.\n\nThere's also Ocean's 8 cast members like Sandra Bullock or Cate Blanchett. \n\nOr they could bring in some new actors. Ryan Gosling would be a good fit and he just did The Fall Guy with Leitch. \n\n",
        "upvotes": 19,
        "comments": 108,
        "media": null,
        "permalink": "/r/movies/comments/1i9o9xm/who_will_the_14_be_if_they_make_oceans_14/"
    },
    {
        "id": "1i9qeso",
        "author": "indiewire",
        "title": "‘If I Had Legs I’d Kick You,’ Starring a Sensational Rose Byrne, Is a Welcome Shock to Sundance’s System (Commentary)",
        "content": "",
        "upvotes": 9,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aq4kpJzuu2UeRNVLXOYcCmsITNHEuOUG6e9BncOf7NE.jpg?auto=webp&amp;s=a25e5621c543dcda702a69e2cd2ef2aea0505698"
        },
        "permalink": "/r/movies/comments/1i9qeso/if_i_had_legs_id_kick_you_starring_a_sensational/"
    },
    {
        "id": "1i9nrl9",
        "author": "North_Meeting886",
        "title": "Have you ever snuck into a r-rated movie as a kid? If so, how?",
        "content": "When I was a kid, I absolutely LOVED horror movies. But the worst part about me liking them was that most of the movies I was interested in were r-rated.\n\nI have thought of sneaking into a movie theater by myself and trying to watch one of those r-rated movies multiple times, but unfortunately I was too much of a coward to do so.\n\nI was always afraid that a worker at the movie theater would check my IDs or something, and then I would get busted out.\n\nHas anyone here ever tried to sneak into a r-rated movie and actually succeeded? If so, then how did you do it? Is it true that some theaters don't even check tickets or IDs these days when entering for a r-rated movie?\n\nEdit: If they do check your tickets/IDs, do they check them at the seats or just at the entrance???",
        "upvotes": 12,
        "comments": 83,
        "media": null,
        "permalink": "/r/movies/comments/1i9nrl9/have_you_ever_snuck_into_a_rrated_movie_as_a_kid/"
    },
    {
        "id": "1i98rnz",
        "author": "Old_Campaign653",
        "title": "Rewatching The Social Network in 2025",
        "content": "One of my all time favorite movies. I especially love the breakdown of each main character and their ideologies:\n\nAt the top, you have the clashing between Eduardo Saverin and Sean Parker. \n\nEduardo is a good guy with bad ideas. He tries to monetize the site too early, and can’t see the forest for the trees. Despite this, he is a team player and is the only person to put his money where his mouth is and fund the company. It’s this naivety that ultimately gets him ousted from his own company by Mark and Sean. \n\nSean Parker is his exact opposite - a bad guy with really good ideas. He is able to predict the path social media is on, and even calls out the success of photo/video based sites while coked out of his mind. He knows how to influence Mark, but he is a creepy leech who ultimately enjoys lurking after college girls more than he enjoys creating companies.\n\nOn the other side, you have the Winklevii and Divya. The very definition of “born on third base and think they hit a triple”. \n\nThey are suing Mark mostly based on what they feel their site could have been, vs. what it ever actually was. They never had a website or a product to compare to Facebook. They had a lot of money and influence which they used to consistently fail upwards while thinking they were “playing fair” the whole time. \n\nFinally, there’s Mark caught in the middle. He reminds me a lot of Louis Bloom in Nightcrawler, when Jake Gyllenhaal says “what if my problem wasn’t that I don’t understand people, it was that I don’t like them?” \n\nIMO, Mark understands people better than he’s ever given credit for. He understands the insecurity that drives much of a person’s actions, and the innate desire everyone has for intimacy. This is demonstrated in the beginning of the movie with his facemash site. He knows everyone will use it, because it lets them compare themselves to people they know. This is essentially what Facebook and social media became in the 2010s - a way to compare your whole life to everyone else’s highlight reels.\n\nHe also knows that the Winklevii are onto something with their website idea, but he resents them because they don’t even understand why it’s so valuable. He hates how little they crave any kind of companionship or intimacy, since they have grown up in an abundance of both. \n\nUltimately, the movie is about a bunch of rich kids arguing with each other. 15 years later, everyone involved is richer than they were, and nothing really happened. Sorkin and Fincher took the most boring premise ever and turned it into one of the most fascinating movies I’ve ever watched.",
        "upvotes": 174,
        "comments": 40,
        "media": null,
        "permalink": "/r/movies/comments/1i98rnz/rewatching_the_social_network_in_2025/"
    },
    {
        "id": "1i9mwvb",
        "author": "theatlantic",
        "title": "“Hard Truths” review, by Shirley Li",
        "content": "",
        "upvotes": 13,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/R60LKAbTBgVeNjfgf4nhlDaWrTAPgS1Lun_htOctJkA.jpg?auto=webp&amp;s=36b4e78eefafc791dd7f257b650d3ec6903b3778"
        },
        "permalink": "/r/movies/comments/1i9mwvb/hard_truths_review_by_shirley_li/"
    },
    {
        "id": "1i9o7k1",
        "author": "whatsthatnowthen",
        "title": "the Room Next Door",
        "content": "I just watched the Room Next Door---it was very good.  Definitely sad but at the same time a celebration of life and friendship.  I like both Tilda Swinton and Juilianne Moore...so they did a good job as usual.  \n\nBeautiful vibrant colours.  Nice scenery.  Its not all negative and helps you or others think about death but not get bogged down by the subject. ",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1i9o7k1/the_room_next_door/"
    },
    {
        "id": "1i92stz",
        "author": "Frank_and_Beanz",
        "title": "The ending to Judas and the Black Messiah.",
        "content": "One of the saddest, sickest, most infuriating scenes put to film, and to know it was based on a real act makes my blood boil to rage. Fantastic recreation technically, the acting top notch. But fuck, what a heinous moment in history of man. I hadn't known about it before choosing to watch the movie so I think it was an important story to tell.\n\nAnd to show the real guy at the end pretty obviously just coping with what he did by acting like anything he did was courageous is crazyyyy. Like, my man, you were snaking your own people for YEARS. You took your own life after that documentary. You felt life ending guilt about what you did.\n\nJust a well made film. Lakeith getting nominated in Supporting though is wild lol.",
        "upvotes": 171,
        "comments": 16,
        "media": null,
        "permalink": "/r/movies/comments/1i92stz/the_ending_to_judas_and_the_black_messiah/"
    },
    {
        "id": "1i8n8d9",
        "author": "herewego199209",
        "title": "After re-watching Superbad again for the 1000th time since I first watched it as a freshman in high-school when it came out, I have to say it's a 10/10 perfect comedy imo. One of the best comedy scripts ever and the movie does not date like a lot of teen sex comedies.",
        "content": "There's some comedies from my childhood and teens that I watch now that I still have nostalgia for, but I look at them and I go yeah this is dated or this isn't as funny as I remember. I had that feeling a few years ago with American Pie where I watched it again and it really started to feel dated which is alarming for me because it seems like yesterday I was watching that movie as a kid on HBO behind my parents back. Superbad to me from start to finish is as perfect of a comedy as you're going to get. A very funny, relatable script from Seth Rogen and Evan Goldberg. Really cool locations and sets by Greg mottle and all the characters are so perfectly cast and portrayed. Not one missed joke in the entire movie and it's genuinely a movie that even at 32 I still laugh at damn near every frame now as I did at 14 when I saw it in theaters. ",
        "upvotes": 2266,
        "comments": 304,
        "media": null,
        "permalink": "/r/movies/comments/1i8n8d9/after_rewatching_superbad_again_for_the_1000th/"
    },
    {
        "id": "1i9qevq",
        "author": "craigjclark68",
        "title": "Myth of Man Review: Visually Transcendent (directed by Jamin Winans, director of ‘Ink’ and ‘The Frame’)",
        "content": "",
        "upvotes": 2,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/y3vQLCUq-uBvFwummu1sPH3LJVoFCf_aXEezIRJOO5U.jpg?auto=webp&amp;s=5f04452c1792b9de101731f3b6dd04a40478a2b9"
        },
        "permalink": "/r/movies/comments/1i9qevq/myth_of_man_review_visually_transcendent_directed/"
    },
    {
        "id": "1i8vpx7",
        "author": "MrDannyOcean",
        "title": "The killer interior design in Hitchcock’s “Rope”",
        "content": "",
        "upvotes": 388,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/U9LkGzc-e2G6aTiDTIwHj1csR9R2eYCNaxRlbU53poE.jpg?auto=webp&amp;s=32050a616916b0f282806413b9af079fb5ea0fcf"
        },
        "permalink": "/r/movies/comments/1i8vpx7/the_killer_interior_design_in_hitchcocks_rope/"
    },
    {
        "id": "1i90p05",
        "author": "Apprehensive_Way8674",
        "title": "Citizen Kane’s camerawork is mind-blowing",
        "content": "I bought Citizen Kane on iTunes a while back and finally decided to turn it on.\n\nI watched it when I was a teenager and didn’t appreciate it at the time.\n\nAlmost every single shot has some kind of amazing movement, framing or cinematography.\n\nI am flabbergasted at what they pulled off all the way back then - especially given how routine most camerawork was at the time.\n\nIf you for some reason haven’t watched it, but geek out on people like Cuaron, I can’t recommend you watch it this weekend enough.",
        "upvotes": 196,
        "comments": 68,
        "media": null,
        "permalink": "/r/movies/comments/1i90p05/citizen_kanes_camerawork_is_mindblowing/"
    },
    {
        "id": "1i9ess7",
        "author": "latticep",
        "title": "Who is the most beloved living actor?",
        "content": "Not necessarily who is the greatest or most accomplished. For example, whose death do you think would result in greatest global mourning? Personally, I think it's Ian McKellen. I think the world will be devasted when he passes. Watching RotK today and hearing him tell Pippin about death and White Shores made me misty eyed. May he enjoy many more years of good health! ",
        "upvotes": 25,
        "comments": 325,
        "media": null,
        "permalink": "/r/movies/comments/1i9ess7/who_is_the_most_beloved_living_actor/"
    },
    {
        "id": "1i8yek9",
        "author": "Ankh4921",
        "title": "Which actors/actress do you feel don’t live up to the hype?",
        "content": "Not BAD actors. Just ‘ok’ actors, and not great enough to justify their fame. \n\nOne example for me would be George Clooney. I’m struggling to think of a performance where he has really moved me. And I don’t understand why he is so highly regarded as an actor, apart from his reputation as a nice guy, and his role as beloved Dr. Doug Ross in E.R.\n\nDon’t get me wrong - I enjoyed E.R. and I liked his character. I’m NOT saying he’s a bad actor. It’s just that when I see him in a movie it feels like I’m watching George Clooney act, rather than the character he is portraying. \n\nSo which actors do you feel this way about? ",
        "upvotes": 250,
        "comments": 1408,
        "media": null,
        "permalink": "/r/movies/comments/1i8yek9/which_actorsactress_do_you_feel_dont_live_up_to/"
    },
    {
        "id": "1i9oiih",
        "author": "JonasKahnwald11",
        "title": "Prisoners - Where's my Daughter",
        "content": "",
        "upvotes": 3,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/PXC3cdKWOwj3nbbkYzZCK2e47yJknhtZ8So-DQYp50w.jpg?auto=webp&amp;s=bc8b2792967e0afa3cb54b400b748566e3975716"
        },
        "permalink": "/r/movies/comments/1i9oiih/prisoners_wheres_my_daughter/"
    }
]