[
    {
        "id": "1o1cp2z",
        "author": "shiruken",
        "title": "The Nobel Prize in Chemistry 2025: Awarded to Susumu Kitagawa, Richard Robson, and Omar M. Yaghi \"for the development of metal-organic frameworks\"",
        "content": "The Nobel Prize in Chemistry 2025 was awarded to [Susumu Kitagawa](https://en.wikipedia.org/wiki/Susumu_Kitagawa), [Richard Robson](https://en.wikipedia.org/wiki/Richard_Robson_(chemist)), and [Omar M. Yaghi](https://en.wikipedia.org/wiki/Omar_M._Yaghi) \"for the development of metal-organic frameworks.\"\n\n* [Official Press Release](https://www.nobelprize.org/prizes/chemistry/2025/press-release/)\n* [Popular Information](https://www.nobelprize.org/prizes/chemistry/2025/popular-information/)\n* [Scientific Explanation of the Award](https://www.nobelprize.org/prizes/chemistry/2025/advanced-information/)\n* [Video of the Prize Announcement](https://www.youtube.com/watch?v=0d02ONEXWkc)\n\n&gt;Susumu Kitagawa, Richard Robson and Omar Yaghi are awarded the Nobel Prize in Chemistry 2025. They have developed a new form of molecular architecture. In their constructions, metal ions function as cornerstones that are linked by long organic (carbon-based) molecules. Together, the metal ions and molecules are organised to form crystals that contain large cavities. These porous materials are called metal–organic frameworks (MOF). By varying the building blocks used in the MOFs, chemists can design them to capture and store specific substances. MOFs can also drive chemical reactions or conduct electricity.\n\n&gt;“Metal–organic frameworks have enormous potential, bringing previously unforeseen opportunities for custom-made materials with new functions,” says Heiner Linke, Chair of the Nobel Committee for Chemistry.\n\n&gt;It all started in 1989, when Richard Robson tested utilising the inherent properties of atoms in a new way. He combined positively charged copper ions with a four-armed molecule; this had a chemical group that was attracted to copper ions at the end of each arm.\n\n&gt;When they were combined, they bonded to form a well-ordered, spacious crystal. It was like a diamond filled with innumerable cavities.\n\n&gt;Robson immediately recognised the potential of his molecular construction, but it was unstable and collapsed easily. However, Susumu Kitagawa and Omar Yaghi provided this building method with a firm foundation; between 1992 and 2003 they made, separately, a series of revolutionary discoveries. Kitagawa showed that gases can flow in and out of the constructions and predicted that MOFs could be made flexible. Yaghi created a very stable MOF and showed that it can be modified using rational design, giving it new and desirable properties.\n\n&gt;Following the laureates’ groundbreaking discoveries, chemists have built tens of thousands of different MOFs. Some of these may contribute to solving some of humankind’s greatest challenges, with applications that include separating PFAS from water, breaking down traces of pharmaceuticals in the environment, capturing carbon dioxide or harvesting water from desert air.",
        "upvotes": 300,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/po4f2DI5HsQ0ovq843rCJc4BklL2J1jHNqA9QpeP1Ug.jpeg?auto=webp&amp;s=6adf5958359418903698e14687385344af0faafe"
        },
        "permalink": "/r/science/comments/1o1cp2z/the_nobel_prize_in_chemistry_2025_awarded_to/"
    },
    {
        "id": "1o0hps8",
        "author": "shiruken",
        "title": "The Nobel Prize in Physics 2025: Awarded to John Clarke, Michel H. Devoret, and John M. Martinis \"for the discovery of macroscopic quantum mechanical tunnelling and energy quantisation in an electric circuit\"",
        "content": "The Nobel Prize in Physics 2025 was awarded to [John Clarke](https://en.wikipedia.org/wiki/John_Clarke_(physicist)), [Michel H. Devoret](https://en.wikipedia.org/wiki/Michel_Devoret), and [John M. Martinis](https://en.wikipedia.org/wiki/John_M._Martinis) **\"for the discovery of macroscopic quantum mechanical tunnelling and energy quantisation in an electric circuit.\"**\n\n* [Official Press Release](https://www.nobelprize.org/prizes/physics/2025/press-release/)\n* [Popular Information](https://www.nobelprize.org/prizes/physics/2025/popular-information/)\n* [Scientific Explanation of the Award](https://www.nobelprize.org/prizes/physics/2025/advanced-information/)\n* [Video of the Prize Announcement](https://www.youtube.com/watch?v=m9FUkAis62s)\n\n&gt;Quantum mechanics allows a particle to move straight through a barrier, using a process called tunnelling. As soon as large numbers of particles are involved, quantum mechanical effects usually become insignificant. The laureates’ experiments demonstrated that quantum mechanical properties can be made concrete on a macroscopic scale.\n\n&gt;In 1984 and 1985, **John Clarke**, **Michel H. Devoret** and **John M. Martinis** conducted a series of experiments with an electronic circuit built of superconductors, components that can conduct a current with no electrical resistance. In the circuit, the superconducting components were separated by a thin layer of non-conductive material, a setup known as a Josephson junction. By refining and measuring all the various properties of their circuit, they were able to control and explore the phenomena that arose when they passed a current through it. Together, the charged particles moving through the superconductor comprised a system that behaved as if they were a single particle that filled the entire circuit.\n\n&gt;This macroscopic particle-like system is initially in a state in which current flows without any voltage. The system is trapped in this state, as if behind a barrier that it cannot cross. In the experiment the system shows its quantum character by managing to escape the zero-voltage state through tunnelling. The system’s changed state is detected through the appearance of a voltage.\n\n&gt;The laureates could also demonstrate that the system behaves in the manner predicted by quantum mechanics – it is quantised, meaning that it only absorbs or emits specific amounts of energy.\n\n&gt;“It is wonderful to be able to celebrate the way that century-old quantum mechanics continually offers new surprises. It is also enormously useful, as quantum mechanics is the foundation of all digital technology,” says Olle Eriksson, Chair of the Nobel Committee for Physics.\n\n&gt;The transistors in computer microchips are one example of the established quantum technology that surrounds us. This year’s Nobel Prize in Physics has provided opportunities for developing the next generation of quantum technology, including quantum cryptography, quantum computers, and quantum sensors.",
        "upvotes": 354,
        "comments": 8,
        "media": null,
        "permalink": "/r/science/comments/1o0hps8/the_nobel_prize_in_physics_2025_awarded_to_john/"
    },
    {
        "id": "1o2ic4c",
        "author": "mvea",
        "title": "Almost 55,000 preschool children in Gaza acutely malnourished, Lancet study estimates. Study shows clear link between Israeli aid restrictions and malnutrition among children aged between six months and five years.",
        "content": "",
        "upvotes": 1205,
        "comments": 65,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7C9_znJW_J_7C25aV9oNIVf0cEhEKwwl4Z52X_01pYw.jpeg?auto=webp&amp;s=4828247032f5e70e7235ee30d54c19059305b0c0"
        },
        "permalink": "/r/science/comments/1o2ic4c/almost_55000_preschool_children_in_gaza_acutely/"
    },
    {
        "id": "1o279wt",
        "author": "scientificamerican",
        "title": "Last season’s 2024–2025 mRNA COVID vaccines reduced people’s risk of emergency department visits by 29 percent, their risk of hospitalizations by 39 percent and their risk of death by 64 percent, according to a new study, published on Wednesday in the New England Journal of Medicine.",
        "content": "",
        "upvotes": 3186,
        "comments": 121,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bir4vhMHBz_uMb1FtHpT5bRlZ5UMieuXRScipShh9AM.jpeg?auto=webp&amp;s=eb7aa1208ecadf15ddc163b0b089f0b2fc85224e"
        },
        "permalink": "/r/science/comments/1o279wt/last_seasons_20242025_mrna_covid_vaccines_reduced/"
    },
    {
        "id": "1o22eyx",
        "author": "mvea",
        "title": "Political views, not sex and violence, now drive literary censorship. Progressives target books promoting racism, sexism and homophobia. The right attack books that promote diversity, or violate norms of cisgendered heterosexuality. The right through legislative action and the left use social media.",
        "content": "",
        "upvotes": 4942,
        "comments": 911,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/A6RBS7OivQDMaFsc4y5ufxD8Mmr47RUoh4qEers-IT4.jpeg?auto=webp&amp;s=59b4d15529e47c2aa147c5dd713449f59c59f4ee"
        },
        "permalink": "/r/science/comments/1o22eyx/political_views_not_sex_and_violence_now_drive/"
    },
    {
        "id": "1o232zv",
        "author": "chrisdh79",
        "title": "Green tea trains muscles to handle sugar better and boost metabolism | Mice receiving green tea had significantly improved glycemic control, suggesting that green tea boosts metabolic function.",
        "content": "",
        "upvotes": 3173,
        "comments": 129,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Qihh66CHwh_lIHW8bReSkJDBXizDtwMN1gTGGPRDdBI.jpeg?auto=webp&amp;s=a151c51e170246d683ecb7e0338488a1c27f7ac2"
        },
        "permalink": "/r/science/comments/1o232zv/green_tea_trains_muscles_to_handle_sugar_better/"
    },
    {
        "id": "1o2bl5p",
        "author": "nohup_me",
        "title": "Study links high school subject choice to future political preferences: humanities lean towards liberal and left-wing party support, while business and technical subjects incline towards right-wing support",
        "content": "",
        "upvotes": 488,
        "comments": 126,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/a-67dmvR3tUn7pa9KgV7YvevEh5IcbEMwM09tYbi0gU.jpeg?auto=webp&amp;s=d602377ddf13bc63336cc887a3dd8e0f3ef0541b"
        },
        "permalink": "/r/science/comments/1o2bl5p/study_links_high_school_subject_choice_to_future/"
    },
    {
        "id": "1o26pdj",
        "author": "smurfyjenkins",
        "title": "Universities are natural targets for populist leaders, as they challenge the narrative that the leader reflects the one true will of the people. Universities are characterized not only by a pluralism of ideas but also possess an elitist character: these attributes conflict with populist rulers.",
        "content": "",
        "upvotes": 501,
        "comments": 38,
        "media": null,
        "permalink": "/r/science/comments/1o26pdj/universities_are_natural_targets_for_populist/"
    },
    {
        "id": "1o2412t",
        "author": "chrisdh79",
        "title": "Psilocybin therapy linked to reduced suicidal thoughts in people with psychiatric disorders | Results point to the possibility that psilocybin could play a role in mental health treatment strategies aimed at reducing suicide risk.",
        "content": "",
        "upvotes": 684,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aFXMR-8KGS0YVhVn26-z9oUDl8mQz5BsFvkCwCm7EFQ.jpeg?auto=webp&amp;s=9c22e7eb64a3449f70fb8f2ca3fc952d03926c1f"
        },
        "permalink": "/r/science/comments/1o2412t/psilocybin_therapy_linked_to_reduced_suicidal/"
    },
    {
        "id": "1o1nyc1",
        "author": "mvea",
        "title": "Natural sweetener Stevia found to turbocharge male pattern baldness treatment: Mice given Stevia patch had 18 times better absorption of minoxidil and hair coverage of 67.5% in bald areas after just 35 days. That's significantly better than the usual 3 to 6 months to produce new hair in humans.",
        "content": "",
        "upvotes": 12411,
        "comments": 299,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2I4iCwgaoewO_QEK6NjcyPbI7U7CoyQhhbrhOCWM0no.jpeg?auto=webp&amp;s=2ae545b429d98bab50c86d9b47df7f17e0cb779a"
        },
        "permalink": "/r/science/comments/1o1nyc1/natural_sweetener_stevia_found_to_turbocharge/"
    },
    {
        "id": "1o1yek5",
        "author": "thebelsnickle1991",
        "title": "Doctors in China say they transplanted a genetically modified pig liver into a 71-year-old man who lived 171 days after the procedure, and 38 of those days were with the pig organ in place – a first to be published in a peer-reviewed journal.",
        "content": "",
        "upvotes": 1405,
        "comments": 96,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6dt8E3kF5SLz2RJyM-PshyIPZGFtrpXd8yvZYsWA3hs.jpeg?auto=webp&amp;s=c3c71d498e6025c14e5c1e631cbbed7c300d67d9"
        },
        "permalink": "/r/science/comments/1o1yek5/doctors_in_china_say_they_transplanted_a/"
    },
    {
        "id": "1o255s9",
        "author": "smurfyjenkins",
        "title": "Voters of ethnic political parties (parties intended to champion one ethnic group) remain loyal to their party even when they receive little in terms of material welfare. They vote not just for material improvements but symbolic goods, such as seeing members of their ethnicity in positions of power.",
        "content": "",
        "upvotes": 398,
        "comments": 68,
        "media": null,
        "permalink": "/r/science/comments/1o255s9/voters_of_ethnic_political_parties_parties/"
    },
    {
        "id": "1o25mtg",
        "author": "-Mystica-",
        "title": "Record-breaking 2024 Amazon fires released 791 million tons of CO₂, equivalent to Germany’s annual emissions, a sevenfold rise from recent averages. This massive carbon surge signals severe ecosystem collapse and a potential tipping point for the planet’s largest rainforest.",
        "content": "",
        "upvotes": 318,
        "comments": 12,
        "media": null,
        "permalink": "/r/science/comments/1o25mtg/recordbreaking_2024_amazon_fires_released_791/"
    },
    {
        "id": "1o2j3hb",
        "author": "drewiepoodle",
        "title": "Study on mouse models of Alzheimer’s disease found that inhibiting the function of a key protein in the circadian system can decrease levels of harmful tau proteins and reduce neurodegeneration.",
        "content": "",
        "upvotes": 63,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zKdYzSJ5gY3dMsQ3egJFjWxlieb9NIXwJKgGIv0I6GY.jpeg?auto=webp&amp;s=056f35d49b4c43521fb5eb8fcbcbae743af8d4f4"
        },
        "permalink": "/r/science/comments/1o2j3hb/study_on_mouse_models_of_alzheimers_disease_found/"
    },
    {
        "id": "1o238z2",
        "author": "noah2623",
        "title": "Brain area linked to chronic pain discovered — offering hope for treatments",
        "content": "",
        "upvotes": 340,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3jdaCZmUksgGL0zBrvt27lTnOWN1K0EodWyU5YLwG3E.jpeg?auto=webp&amp;s=59772efddd58e69e03fde06768be08ee3cdce342"
        },
        "permalink": "/r/science/comments/1o238z2/brain_area_linked_to_chronic_pain_discovered/"
    },
    {
        "id": "1o1f0r1",
        "author": "New_Scientist_Mag",
        "title": "Older men are more likely to pass on disease-causing mutations to their children because of the faster growth of mutant cells in the testes with age",
        "content": "",
        "upvotes": 13465,
        "comments": 558,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nDPtaDrvOb9L4v21JuTtmrRCI9_8Beit3gr5GC-pOq4.jpeg?auto=webp&amp;s=48c75b0320cc3200a90c68825c5276d3e414e457"
        },
        "permalink": "/r/science/comments/1o1f0r1/older_men_are_more_likely_to_pass_on/"
    },
    {
        "id": "1o1wnlc",
        "author": "unsw",
        "title": "Low-cost ketamine treatment for depression found to be effective long term, offering a cheaper alternative to patented ketamine treatments",
        "content": "",
        "upvotes": 1067,
        "comments": 108,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Bx78aLm0xVzyol9ssgWZUXGAk-tDB_pj4qo0r_vQIBM.jpeg?auto=webp&amp;s=4793ccb9b1393af947aa4d3c0f7c20768e979c42"
        },
        "permalink": "/r/science/comments/1o1wnlc/lowcost_ketamine_treatment_for_depression_found/"
    },
    {
        "id": "1o2a3oc",
        "author": "ChallengeAdept8759",
        "title": "Researchers find information from social ties predicts conspiracy beliefs, as evidenced by the attempted assassination of Donald Trump",
        "content": "",
        "upvotes": 110,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jdhzmIWMdZ5cl7PRDVdvENTOxcUc-QLFppL2lE12YgU.jpeg?auto=webp&amp;s=334f2f37d7310a0ffd19bc8ecc421501e25275c3"
        },
        "permalink": "/r/science/comments/1o2a3oc/researchers_find_information_from_social_ties/"
    },
    {
        "id": "1o2iqnv",
        "author": "orcinus__orca",
        "title": "New study from the Canadian Arctic shows that during warm, low-ice years, ringed seals have thinner blubber, depleted fatty acids, and high metabolic stress. High PCB and mercury levels add oxidative damage to their liver, showing how climate change and pollutants together threaten Arctic wildlife.",
        "content": "",
        "upvotes": 35,
        "comments": 1,
        "media": null,
        "permalink": "/r/science/comments/1o2iqnv/new_study_from_the_canadian_arctic_shows_that/"
    },
    {
        "id": "1o2i8ee",
        "author": "darrenjyc",
        "title": "Toronto’s Subway Deer Enigma Unmasked With DNA Analysis",
        "content": "",
        "upvotes": 33,
        "comments": 2,
        "media": null,
        "permalink": "/r/science/comments/1o2i8ee/torontos_subway_deer_enigma_unmasked_with_dna/"
    },
    {
        "id": "1o2izvi",
        "author": "Constant_Swimmer3059",
        "title": "Identical AI models split into “teams” began showing human-like group bias — favoring corrections from their own group while ignoring outsiders.",
        "content": "",
        "upvotes": 30,
        "comments": 8,
        "media": null,
        "permalink": "/r/science/comments/1o2izvi/identical_ai_models_split_into_teams_began/"
    },
    {
        "id": "1o29tt3",
        "author": "andyhfell",
        "title": "Astronomers find a small (million-solar mass), starless object in the distant universe from a glitch in a larger gravitationally lensed image. The existence of small dark matter clumps could rule out some hypotheses of the nature of dark matter.",
        "content": "",
        "upvotes": 66,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gzlQOjv_vEGf38sB0rkofgByydkO2ZXpSA-PEWAUuk4.jpeg?auto=webp&amp;s=8b8dfd5d4af9fc5539d042e7a4d5d64d5f3d6494"
        },
        "permalink": "/r/science/comments/1o29tt3/astronomers_find_a_small_millionsolar_mass/"
    },
    {
        "id": "1o2ahpu",
        "author": "Cad_Lin",
        "title": "Sometimes life demands more than one language. In the early 1900s South Caucasus, German settlers used German for family and community life and Russian for education and official matters. A recent study shows how their newspapers reflected this bilingual balance and identity.",
        "content": "",
        "upvotes": 50,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lCLSivv_oK6pyB3kckjiPYNVTN32LYoyPfHI67FJEHw.png?auto=webp&amp;s=314a76a1604c9c9f357d1d87edd75e3e05d5ecdc"
        },
        "permalink": "/r/science/comments/1o2ahpu/sometimes_life_demands_more_than_one_language_in/"
    },
    {
        "id": "1o1pdih",
        "author": "drewiepoodle",
        "title": "Fish that inhabit polar waters have a protein in their blood that prevent them from freezing. Researchers develop stripped-down, synthetic version of protein, simple enough to be manufactured at scale, powerful enough to inhibit formation of ice crystals at sub-zero temperatures.",
        "content": "",
        "upvotes": 1408,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YNqM0EzyvjrWFLcuVNgmaiQgCaJCsaMGTB788-Tr3O8.jpeg?auto=webp&amp;s=80107668902b4886d95ff551750907de771a2422"
        },
        "permalink": "/r/science/comments/1o1pdih/fish_that_inhabit_polar_waters_have_a_protein_in/"
    },
    {
        "id": "1o259pm",
        "author": "-Mystica-",
        "title": "A Phase 1 placebo-controlled trial tested a new conjugate vaccine (TSCV) against typhoid and invasive salmonella in 22 healthy U.S. adults. The vaccine was safe, causing only mild, short-lived pain, and induced strong immune responses in 100% of recipients—none in the placebo group.",
        "content": "",
        "upvotes": 87,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jaOpARH5BGnnzqTcoxU_O_wNzlCjTarsSpudmQaM1hI.png?auto=webp&amp;s=9a2831ee5aaa2f01bcaebd7c7eb4bdebdc609832"
        },
        "permalink": "/r/science/comments/1o259pm/a_phase_1_placebocontrolled_trial_tested_a_new/"
    },
    {
        "id": "1o1gt47",
        "author": "nohup_me",
        "title": "Forgetting is an active dopamine-involved process rather than a brain glitch. A study using worms 80% genetically identical to humans, demonstrates that dopamine assists in both memory retention and forgetting: worms unable to produce dopamine retained memory significantly longer than regular worms",
        "content": "",
        "upvotes": 2638,
        "comments": 194,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Wg93NEIjjwdGu5ZKeNGR7auMi9nX7-b61rMy8k4dEhw.jpeg?auto=webp&amp;s=6dc9459f9323861b41f4dde600297bd9ad7f06ba"
        },
        "permalink": "/r/science/comments/1o1gt47/forgetting_is_an_active_dopamineinvolved_process/"
    },
    {
        "id": "1o1n5qy",
        "author": "PrincetonEngineers",
        "title": "Researchers drove 52k miles crisscrossing the U.S. to measure emissions from 96 sewer plants and found the facilities emit roughly double the amount of nitrous oxide and methane—both potent greenhouse gases—estimated by the EPA [Nature Water]",
        "content": "",
        "upvotes": 1204,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sHmLkc-hjIpTt9Xr3Rklh9N3yAr79HMVSKDARRiBls0.jpeg?auto=webp&amp;s=115ebea59f85ffe3eb719875050d47fb856c0f45"
        },
        "permalink": "/r/science/comments/1o1n5qy/researchers_drove_52k_miles_crisscrossing_the_us/"
    },
    {
        "id": "1o2nl9o",
        "author": "FunnyGamer97",
        "title": "Menstrual cycle affects women’s reaction time but not as much as being active | Women performed best on cognitive tests during ovulation but physical activity level had a stronger influence on brain function overall, study finds",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/science/comments/1o2nl9o/menstrual_cycle_affects_womens_reaction_time_but/"
    },
    {
        "id": "1o2fb7f",
        "author": "NinjaDiscoJesus",
        "title": "A cGAS-mediated mechanism in naked mole-rats potentiates DNA repair and delays aging.",
        "content": "",
        "upvotes": 19,
        "comments": 1,
        "media": null,
        "permalink": "/r/science/comments/1o2fb7f/a_cgasmediated_mechanism_in_naked_molerats/"
    },
    {
        "id": "1o16jop",
        "author": "mvea",
        "title": "Scientists discover antibody that neutralizes 98.5% of more than 300 different HIV strains, one of the broadest antibodies against HIV identified. In experiment with humanized mice (with immune systems modified to resemble that of humans) it permanently reduced HIV viral load to undetectable levels.",
        "content": "",
        "upvotes": 6180,
        "comments": 142,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lTOjon-ILcBLTBfvBAKpyOzmCFt_C6PwEIYt_r4CLys.jpeg?auto=webp&amp;s=a5d81b494070da2a0c993a43498ed34dfdb33bfc"
        },
        "permalink": "/r/science/comments/1o16jop/scientists_discover_antibody_that_neutralizes_985/"
    }
]