[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 42,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 13,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1q8c7eq",
        "author": "GiveMeSomeSunshine3",
        "title": "‘Black Mirror’ Renewed For Season 8 At Netflix",
        "content": "",
        "upvotes": 854,
        "comments": 85,
        "media": null,
        "permalink": "/r/netflix/comments/1q8c7eq/black_mirror_renewed_for_season_8_at_netflix/"
    },
    {
        "id": "1q8hpk0",
        "author": "FunRealistic7609",
        "title": "Scrolling Netflix for 30 mins. Still haven't picked anything",
        "content": "Please suggest a really good show or movie that’s genuinely worth watching. Any genre works drama, romance, thriller, comedy, or even something underrated that surprised you. I’m in the mood to binge or just relax and enjoy a good story. Drop your best Netflix recommendations and save me from endless scrolling.",
        "upvotes": 74,
        "comments": 134,
        "media": null,
        "permalink": "/r/netflix/comments/1q8hpk0/scrolling_netflix_for_30_mins_still_havent_picked/"
    },
    {
        "id": "1q7orjz",
        "author": "Similar_Diver9558",
        "title": "‘Stranger Things’ Fans Crashed Netflix Looking For An Alternate Finale—But It Doesn't Exist",
        "content": "",
        "upvotes": 1572,
        "comments": 123,
        "media": null,
        "permalink": "/r/netflix/comments/1q7orjz/stranger_things_fans_crashed_netflix_looking_for/"
    },
    {
        "id": "1q8hg5j",
        "author": "coolerdude56",
        "title": "”Not in the same household” even though i am",
        "content": "Im getting sick of netflix not even getting this household thing right. Yea i get that it doesnt work when im in another city but now it doesnt even work even when im at home, and also for my sister that is always at home. Everyone is connected to the same wifi.",
        "upvotes": 22,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1q8hg5j/not_in_the_same_household_even_though_i_am/"
    },
    {
        "id": "1q8lcdu",
        "author": "AltruisticAide9776",
        "title": "The people we meet on vacation movie was so without depth and even without romance ?",
        "content": "I'm starting to feel like romance only works in tv shows not in movies when there is not a hint of mystery/unpredictability. In tv shows the characters gets time to develop their own characters as well as a connection with each other , in movies there just isn't that time. Look at how interesting the romance felt in heated rivalry compared to people we meet on vacation, heck even Emily in Paris romance arks are better though people are tired of them now.\n\nThis movie while watchable was just not it, there just wasn't really a reason as to why they did not get together earlier . I feel like friends to lovers works only in tv shows, like that is why so many people were shipping Harry and Hermione ( well that is a series of films/books but you get the point ).\n\nThe only redeeming quality was Poppy speaking honestly with Sarah and apologizing for her closeness with Alex.\n\nI don't get why Alex was pissed at Poppy for not I guess being more forward with her feelings when um he has a girlfriend and even got engaged to her after they had an emotional moment the previous night ? Like isn't that him running away and not wanting to acknowledge he feelings for Poppy and he is accusing her of running away?\n\nThe ending where Poppy was like \" home is where you re with your person \" was soo juvenile .\n\n  \nEdit : I know I said the \" only redeeming quality was Poppy speaking honestly with Sarah and apologizing for her closeness with Alex but really it was for Alex to have those boundaries , he was the one engaged to Sarah after all , why is it Poppy the one to apologise. ",
        "upvotes": 8,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1q8lcdu/the_people_we_meet_on_vacation_movie_was_so/"
    },
    {
        "id": "1q8mwc4",
        "author": "abdul_bino",
        "title": "Going on a 17 hour plane ride need some TV suggestions?",
        "content": "No more than five seasons. Have already already watched the wire breaking bad better call Saul GOT parks and rec the office. Don’t mind anime either. Any and all suggestions are welcome.",
        "upvotes": 4,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1q8mwc4/going_on_a_17_hour_plane_ride_need_some_tv/"
    },
    {
        "id": "1q832jb",
        "author": "Economy-Specialist38",
        "title": "Netflix co-CEO says he doesn’t read business books—at all. Instead, he reads one 1902 fiction about a ship and its reckless ‘hot dog’ captain over and over again",
        "content": "",
        "upvotes": 57,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1q832jb/netflix_coceo_says_he_doesnt_read_business/"
    },
    {
        "id": "1q8ole1",
        "author": "yeetskrtyeetskrt",
        "title": "anyone’s netflix not working?",
        "content": "i kid you not i have tried to watch netflix on 4 different devices but it either never loads onto netflix or when a couple things load and i try to watching something the show won’t load. we may be thinking an internet issue but i can load every other streaming service with no issues. any solutions?",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1q8ole1/anyones_netflix_not_working/"
    },
    {
        "id": "1q89b3m",
        "author": "TheShyBuck",
        "title": "Are there more Korean shows on Netflix in the Middle East and North Africa than on Netflix in America or Europe? does Netflix in America have more Western shows?",
        "content": "I am from the Middle East\n\nWhen the president Yoon met the CEO of Netflix nearly 2 years ago, the Korean president called for increased investment in Korean shows (billions)\n\nand since that day nearly all that I see on Netflix are Korean shows added every week. I can't find enough American and European shows to watch on Netflix,\n\nUnfortunately most streaming services are not available in my country except for Amazon Prime and Netflix\n\nand no I never watched Korean shows on Netflix before so it is not the algorithms",
        "upvotes": 6,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1q89b3m/are_there_more_korean_shows_on_netflix_in_the/"
    },
    {
        "id": "1q84on1",
        "author": "Wonderful_Nebula_802",
        "title": "Just finished watching Animal Kingdom.",
        "content": "What a brilliant series!!! \nI think I might watch it again! \nI loved Pope. Any one else have a favourite?  \nAny recommendations for a series that’s just as good?  \n",
        "upvotes": 13,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1q84on1/just_finished_watching_animal_kingdom/"
    },
    {
        "id": "1q8o2oq",
        "author": "wh1tef3rrari",
        "title": "Episodes keep glitching back a couple seconds every 1-2 minutes",
        "content": "I’ve constantly had issues with netflix, whether it’s on my ipad, or my laptop, there is always a bug. The latest one is that no matter what I watch, every 1-2 minutes it’ll glitch back and rewind ten seconds or so randomly. I’m not touching my screen, I’m not doing anything, just watching my show and it does this. What can I do? It’s on my laptop, I’ve uninstalled and reinstalled yet the issue persists. It’s extremely irritating ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q8o2oq/episodes_keep_glitching_back_a_couple_seconds/"
    },
    {
        "id": "1q8hcra",
        "author": "Hairy-Stop4005",
        "title": "Finally able to afford a Netflix subscription - top recommendations right now?",
        "content": "Basically as title says. I purchased my Netflix subscription. I’ve seen stranger things and loved it. I’m more so looking for series (thriller,dramas, psychological) that kinda thing. \n\nThank you in advance! ",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1q8hcra/finally_able_to_afford_a_netflix_subscription_top/"
    },
    {
        "id": "1q8kksv",
        "author": "FormalAdvertising444",
        "title": "In your opinion, what's the standard differences between TV-14 (Early Teens) and TV MA? (Late teens)",
        "content": "Tbh, the difference for me is pretty baffling to the point Netflix gives some shows like Anime either a rating of TV 14 or TV MA. In my country, Stranger Things, My Hero Academia (Anime), etc is given a TV 14 (Early Teens) or TV MA (Late teens) rating sometimes.\n\nI know that TV MA is a rating warning that it contains more extreme violence than TV 14 like stronger nudity scenes, stronger gore, the usage of the F word is used more etc\n\nI watched shows like Weak Hero (KDrama) and it felt TV 14 despite the TV MA rating it got cuz lack of gore and sexual content. The amount of swearing it has makes sense why it got that rating, but other shows with a TV 14 rating even had swearing and more brutal scenes to watch imo. Even some Anime with a rating of TV MA has milder swearing or minimal swearing than other TV 14 shows lol (maybe Anime does have more like others, but it's just mistranslation)",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1q8kksv/in_your_opinion_whats_the_standard_differences/"
    },
    {
        "id": "1q7vgvo",
        "author": "Gordonica",
        "title": "Harlan Coben? why not Janet Evanovich?",
        "content": "I see all the Harlan Coben stories made into Netflix series. I would like to see a series based on Janet Evanivich's novels about the female bondsman. One movie was made with the woman from greys anatomy and it was great. And only one VI Warshovski movie was ever made with Kathleen Turner (it was great). Anyone else?\n",
        "upvotes": 30,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1q7vgvo/harlan_coben_why_not_janet_evanovich/"
    },
    {
        "id": "1q7yxx1",
        "author": "stellacampus",
        "title": "The recent Stephen King series are worth watching.",
        "content": "Both 11-22-63 and Castle rock are worth a watch.  11-22-63 is very well made and a must for time travel fans. It's just a well told story. I also recommend the book for readers. Castle Rock is also a good watch.  I think the first season is more interesting and the second season is more entertaining - ultimately they come together as a full story. Both are executive produced by Stephen King and J.J. Abrams.",
        "upvotes": 15,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1q7yxx1/the_recent_stephen_king_series_are_worth_watching/"
    },
    {
        "id": "1q7zlmt",
        "author": "LilNello1",
        "title": "His &amp; Hers",
        "content": "So just finished watching this new miniseries, and wow I must say had me on the edge of my seat.  So good and makes me want to read the book now too.  So without giving away too many spoilers for those who have seen it.  What is everyone’s else’s thoughts and on why you did or didn’t like it?",
        "upvotes": 13,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1q7zlmt/his_hers/"
    },
    {
        "id": "1q81whh",
        "author": "harpreetthind",
        "title": "Need recommendation for movies on Netflix",
        "content": "Just got done watching Stranger Things what else does everybody recommend watching? Want something similar to Stranger Things if possible thanks for the recommendations.",
        "upvotes": 9,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1q81whh/need_recommendation_for_movies_on_netflix/"
    },
    {
        "id": "1q8gst3",
        "author": "BreakDefiant8956",
        "title": "Whats happening with netflix over in Bulgaria",
        "content": "I just tried making an account and yes everything went fine. Then i selected my plan and the whole screen in the app went white. I restarted the app and it isnt loading. I visited the official website but its not loading too whats happening ?!?!?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q8gst3/whats_happening_with_netflix_over_in_bulgaria/"
    },
    {
        "id": "1q8fk8q",
        "author": "Shrouded_ParadoxX",
        "title": "What does my watchlist say about my TV taste?",
        "content": "1. Dark\n2. Breaking Bad\n3. Better call saul\n4. Game of thrones \n5. Dexter\n6. Lost\n7. The walking dead \n8. Prison break \n9. The sapronas\n10. The wire\n11. Mad men\n12. You\n13. From\n14. All of us are dead\n15. Alice in the borderland \n16. True detective (S1)\n17. Chernobyl \n18. House of the dragons\n19. Succession \n20. The witcher \n21. Vikings\n22. Sherlock \n23. Peaky blinders \n24. Mr robot\n25. Daredevil \n26. The boys\n27. Narcos\n28. The newsroom",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1q8fk8q/what_does_my_watchlist_say_about_my_tv_taste/"
    },
    {
        "id": "1q8f0sh",
        "author": "godguided",
        "title": "Does anyone else think Maeve Courtier-Lilley looks a bit like Sydney Sweeney?",
        "content": "Am I the only one who sees this?\nWhile watching Run Away on Netflix, Maeve Courtier-Lilley kept reminding me of Sydney Sweeney , i mean not a full doppelgänger, but certain angles, expressions, and overall vibe felt really similar.\n\nIt’s especially noticeable in close-ups and softer lighting. Like there’s something about the eyes and facial structure that made me do a double take more than once. I searched but i saw not single reddit or thread feeling the same. \n\nCurious if anyone else noticed this or if it’s just me 🤔",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1q8f0sh/does_anyone_else_think_maeve_courtierlilley_looks/"
    },
    {
        "id": "1q7i0mn",
        "author": "intelerks",
        "title": "Netflix gives first look at 2026 releases, from ‘Enola Holmes 3’ to ‘Peaky Blinders’",
        "content": "",
        "upvotes": 69,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1q7i0mn/netflix_gives_first_look_at_2026_releases_from/"
    },
    {
        "id": "1q803dq",
        "author": "Working_Branch_751",
        "title": "People We Meet On Vacation",
        "content": "Is anyone excited for this movie? I just watched the trailer and it is so meh! The chemistry seems so off between the two leads. I've watched Tom Blyth in Billy the Kid and he is really good in that. I want to watch this one but also don't want to waste my time. Thoughts from anyone who watched it/will watch it? ",
        "upvotes": 8,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1q803dq/people_we_meet_on_vacation/"
    },
    {
        "id": "1q8kfrm",
        "author": "Green_Coach1359",
        "title": "Someone made their own stranger things finale",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q8kfrm/someone_made_their_own_stranger_things_finale/"
    },
    {
        "id": "1q7ket8",
        "author": "EdnaJosie8924",
        "title": "Which series do you rewatch once a year?",
        "content": "I have a running list of series that I typically watch once a year.  I think it’s a comfort thing…Do you? And if so, which ones?\n\nMine are typically:\n\nThe Sopranos, Six Feet Under, House of Cards. Hacks, Dexter, Veronica Mars, Bates Motel, Ozark, Schitt’s Creek… ",
        "upvotes": 18,
        "comments": 102,
        "media": null,
        "permalink": "/r/netflix/comments/1q7ket8/which_series_do_you_rewatch_once_a_year/"
    },
    {
        "id": "1q7crlh",
        "author": "Lhakey",
        "title": "His&amp;Hers - My honest thoughts",
        "content": "I literally wrapped this show up 20 minutes ago and WOW. I have some strong emotions on this one.\n\nSide note: I am by no means a critic. I just wanted to share my thoughts in case you were on the edge.\n\nIt’s a stark contrast from your typical detective show, mixing in lust, hatred, romance, and love into a twisted story. It was refreshing! Throughout the show I drew sharp comparisons between titles like Gone Girl and The Girl on the Train, with a distinct splash of the traditional detective themed Hollywood blockbuster. However, even then it was entirely different. \n\nThere is definitely something to be said about the predictability throughout this show. With modern day crime films, I often feel I have a solid grasp of when or how an event is going to take place or come forth, but not with this. This was entirely fresh and entirely unpredictable. The director does a fantastic job of steering the viewers mind; Pushing us to a prejudice and bias that even the most experienced crime thriller fanatics try to avoid. I thoroughly enjoyed the plot and its many twists and turns.\n\nI say all this with some slight criticism. In order to accomplish such a rollercoaster of a plot line, I did feel there was a certain loss of realism. The general structure of the plot is gripping, but the actual substance of it can be slightly off putting. I felt as if some of the reasonings were a slight bit of a reach for my tastes, but could be well within the palettes of most viewers.\n\nFrom a cinematographic point of view, the show was well made. The scenery, the mood, and the pacing, was attractive to your typical crime thriller junkie. I have little to complain about aside from the pacing in the last episode. I felt as if there could have been a slight bit more to explore concerning the main protagonist and his trauma, but it was brushed off for the jaw dropping peak of the show (absolutely 100% unexpected). So yes, I will say the cinematography was well done. It’s no Lord of the Rings or Interstellar, but it has more than enough to make the viewing experience pleasurable. \n\nAlso, there were so many morals and lessons put into this story. Maybe it’s just me being impressionable, but I definitely felt there was some moving moments throughout. \n\nI strongly recommend this series and look forward to more similar work in the future. \n\n\n TLDR: Great series. It was a nail biter that had me constantly questioning my theories. There’s some minor misgivings but they are made up for by other plot twists and so on. 8.2/10. Strongly recommend!\n",
        "upvotes": 30,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1q7crlh/hishers_my_honest_thoughts/"
    },
    {
        "id": "1q8ckzd",
        "author": "Emergency_Air4575",
        "title": "Netflix gets one more month.",
        "content": "Netflix, you did it again. You pulled me into another show. RUN AWAY starts a bit slow, but the final three episodes are intense, especially the last one. Alright Netflix, you’ve earned one more month.",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1q8ckzd/netflix_gets_one_more_month/"
    },
    {
        "id": "1q7zd7k",
        "author": "xdylanx2424",
        "title": "Can’t watch 4k content with dual monitors (pc)",
        "content": "So I have the KTC-M27P6 4K Mini-LED + Dell 24” 1080p monitor and I bought the HVEC extension from Microsoft store thinking it would allow me to watch 4k content. I tried everything to get it to work only to find out it was because I had dual monitors. After unplugging my 1080p monitor i was finally able to watch 4k content. \n\nI tested this both on app and on edge and as long as I have both monitors plugged in I’m stuck at 1080p content is there a way to fix this? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q7zd7k/cant_watch_4k_content_with_dual_monitors_pc/"
    },
    {
        "id": "1q7ohso",
        "author": "Caityb13",
        "title": "Need Trashy Reality Competition Recs",
        "content": "Feel like we’ve watched everything on Netflix that falls under this category but truly these shows are our guilty pleasure. It feels like it takes forever to get new shows and we go months without content to watch. Any recommendations? Below are the ones we watched and liked. (We also like culinary competition shows like next gen chef) \n\n\\-Love Is Blind\n\n\\-Perfect Match\n\n\\-The Circle\n\n\\-Too Hot to Handle\n\n\\-The Trust\n\n\\-The Ultimatum\n\n\\-Temptation Island \n\n\\-Sneaky Links\n\n\\-Battle camp\n\n\\-The Mole",
        "upvotes": 3,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1q7ohso/need_trashy_reality_competition_recs/"
    }
]