[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 10,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 40,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1kuxg99",
        "author": "takenforgranted_19",
        "title": "Netflix Recommendation Needed",
        "content": "Hey everyone,\n\nI'm feeling super bored and in desperate need of a good show or movie to dive into on Netflix. I'm a huge fan of the thriller and mystery genres — love anything that keeps me on the edge of my seat or has a solid \"whodunit\" vibe.\n\nWould really appreciate your recommendations!\n\nThanks in advance!\n\n\n\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kuxg99/netflix_recommendation_needed/"
    },
    {
        "id": "1kuubpn",
        "author": "InternationalBake360",
        "title": "Signing in every time you watch??",
        "content": "This is becoming so fucking annoying. We have 5 TV’s all in the same house - all on the same WiFi - and every single time we try to use Netflix on any of our tv’s it’s forcing its “confirm your account bs” I’m one bad day away from cancelling this. The audacity must be on sale for them to think this is appropriate over and over and over again. I hate you Netflix. ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kuubpn/signing_in_every_time_you_watch/"
    },
    {
        "id": "1kuj27n",
        "author": "Affectionate_Fan2001",
        "title": "What should I watch?",
        "content": "I've watched all these shows and now i don't know what's next. If you could give me some names i would really appreciate it. It doesn't have to be only similar to this list, you could write anything that made you binge watch it. Thanks!!\n\n* La Casa de Papel\n* Teen Wolf\n* Alta Mar\n* Titans\n* Prison Break\n* Once Upon a Time\n* Outer Banks\n* Pretty Little Liars\n* Riverdale\n* Anne with an E\n* Fate: The Winx Saga\n* Stranger Things\n* Shadow and Bone\n* How to Get Away with Murder\n* Rise of Empire\n* Dahmer\n* Mindhunter\n* Alice in Borderland\n* Squid Game\n* Bridgerton\n* Elite\n* The Sandman\n* Alchemy of Souls\n* My Demon\n* Death’s Game\n* Berlin\n* Burning Body\n* The Chosen\n* The Perfect Couple\n* Dear Child\n* The Fall of the House Usher\n* Wednesday\n* Inside Man\n* Monsters\n* Criminal Minds\n* Kaos\n* Breathless\n* Lucifer\n* House of the Dragon\n* Black Doves\n* XO Kitty\n* AHS: Murder House\n* The Hunting Party\n* The 100\n* You\n* The Umbrella Academy\n* 911 Lonestar\n* Emily in Paris\n* The White Lotus\n* Yellowstone\n* Grey’s Anatomy\n* The Rookie\n* AGGTM",
        "upvotes": 13,
        "comments": 76,
        "media": null,
        "permalink": "/r/netflix/comments/1kuj27n/what_should_i_watch/"
    },
    {
        "id": "1kuxcrc",
        "author": "wrighttoby",
        "title": "Why is there a storage limit for Smart Downloads?",
        "content": "Hi it's my first post here,\n\nI have been recently running into this issue where I cannot set Netflix's Smart Downloading feature to use more than 9.5gb of storage and don't know why this is a case, I have tried this on both Android 10 and Android 15 thinking it might of been a container-based issue with the way Google have Implemented a feature that restricts what files apps have access to, I found this wasn't the case and I thought this might of just been a cap assigned by netflix probably because of licencing, I tried searching this up and I found that this cap seemed to be undocumented as of my current research and so I don't know if this is just a problem with me. I do have Netflix Premium so I don't know why this could be a problem since it's noted that premium has more features compared to the other plans and it just says I can download on up to 6 supported devices at a time but never specified how much I could download.\n\nI am a person that notices every aspect of quality change and like my downloaded content to be at least 1080p.\n\nSorry i had to use this account, I didn't have enough karma on my \"main\".",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kuxcrc/why_is_there_a_storage_limit_for_smart_downloads/"
    },
    {
        "id": "1kujo36",
        "author": "smcneal",
        "title": "A Deadly American Marriage: Interview with Jason Corbett's daughter",
        "content": "",
        "upvotes": 10,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kujo36/a_deadly_american_marriage_interview_with_jason/"
    },
    {
        "id": "1kuskk6",
        "author": "starwarden2245",
        "title": "How to fix full screen problem",
        "content": "I have a windows 11 laptop and whenever I watch Netflix on the app in full screen the shows tends to glitch and move as shown in the vid. It doesn’t happen when playing on non fullscreen and also doesn’t happen with other apps like YouTube. Anyone know how to fix this issue? It rlly bothers me cuz it takes out of the watching experience ",
        "upvotes": 2,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/pdqlv6iffu2f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1kuskk6/how_to_fix_full_screen_problem/"
    },
    {
        "id": "1kuv7yx",
        "author": "Puzzleheaded_Elk996",
        "title": "Psycho on Netflix",
        "content": "The original Hitchcock film. I don't know why, but the quality and resolution of the version on Netflix feels off. Could someone explain why to me? Thank you if you read this.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kuv7yx/psycho_on_netflix/"
    },
    {
        "id": "1kuh3ej",
        "author": "Equivalent_Phrase_25",
        "title": "I think cyberpunk is one of the best anime’s of all time",
        "content": "Ik no one’s gonna agree and say I don’t watch enough anime but hear me out. All I really watch is sci-fi and anime and when theirs a sci-fi anime I get real excited. I watched cyberpunk awhile ago obviously but it’s still my 3rd favorite anime ever. 1.) attack on titan 2.) demon slayer which is another hot take but whatever. I’m not a big fan of the very long anime’s like one peice or Naruto but if I was I would probably include them. I’m not including romance anime’s because most of them low-key all follow the same format but maybe just different names / looks. Does anyone agree about my take? I loved the scenario , the characters, the backstories , the futuristic look. ",
        "upvotes": 8,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1kuh3ej/i_think_cyberpunk_is_one_of_the_best_animes_of/"
    },
    {
        "id": "1kutu3h",
        "author": "Boolinks",
        "title": "Netflix \"Household Policy\" Issue",
        "content": "My Netflix account has randomly started saying my account \"isn't part of the household\" when trying to watch tv in my guest house. It's literally on the property - is there a way to sort this out? I can bypass for a brief period of time by getting a code texted to me but It's becoming a nuisance.",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1kutu3h/netflix_household_policy_issue/"
    },
    {
        "id": "1kuti06",
        "author": "cmd242",
        "title": "American manhunt plothole question",
        "content": "In the third episode, how did the CIA go from identifying the courier was by interviewing ksm to tapping his phone calls? How did they do that and how did they find him?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kuti06/american_manhunt_plothole_question/"
    },
    {
        "id": "1ktwl7m",
        "author": "Creative-Ad-1363",
        "title": "Loudermilk is oddly comforting",
        "content": "Just discovered this hidden gem. It's been around for a few years.\nLoudermilk is an addiction counselor with a motley crew of devotees that attend his regular meetings in a catholic church.\n\nThe cast are mostly men, and there are some gross moments (doll episode).\n\nAnja Savcic is the only regular woman casted. They manage her presence nicely without being overly sexual, which I can appreciate. \n\nThe show also mingles comedy with hard topics such as living with disabilities, misogyny, and failure really well. \n\nI've rewatched it several times, especially when winding down at night or if there's nothing else to watch (skipping the doll episode). \n\nAnyone else find this show oddly comforting? ",
        "upvotes": 211,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1ktwl7m/loudermilk_is_oddly_comforting/"
    },
    {
        "id": "1kusfhk",
        "author": "Gentle-Babble",
        "title": "Sneaky Link - episode 6 Painting",
        "content": "Zoe!  Without question, her painting was the Best!   No fear in having a lot of blank space.  The cutest little paintings, and everything felt reserved, pure and kind.  With a lot of room to grow!!  Loved it.\n\nhttps://preview.redd.it/tant1po2eu2f1.png?width=1170&amp;format=png&amp;auto=webp&amp;s=0767044f3db250993f648cf3b7cb575e6447ec3b\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kusfhk/sneaky_link_episode_6_painting/"
    },
    {
        "id": "1ktuex4",
        "author": "Beginning_Rich_8571",
        "title": "Is anyone tired of waiting for stranger things..",
        "content": "i literally started watching stranger things in 7th grade… I’m now a mother of a 1 year old and have been marred for 2 years 😭 like bout time stranger things come out my baby will be 2 going on 3 seems like. ",
        "upvotes": 203,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1ktuex4/is_anyone_tired_of_waiting_for_stranger_things/"
    },
    {
        "id": "1ku2pob",
        "author": "Worldpeacee007",
        "title": "Opinion: The Untold series is losing its magic and the last two episodes have been awful",
        "content": "Just finished watching both the Liver King and Favre Untold Episodes.\n\n  \nWhile I enjoyed the \"Shooting Guards\" episode quite a bit, I cant help but be shocked by how awful the Liver King and Favre Episodes were.\n\nI am a huge fan of the series and the Way brothers work, but since they have handed off directorial duties to other filmmakers, I cant help but think the series is losing its juice. \n\nThe Liver King episode was one of the worst documentaries I think I have ever seen in my life and the Favre episode was a bit a mess. Not even the gorgeous soundtrack the series boasts and brilliant editing could save the two from being borderline unwatchable.\n\nI hope the Way brothers direct more episodes in the future because they are some of the most talented and exciting filmmakers at the moment.  \n\nJust a personal opinion of course",
        "upvotes": 26,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1ku2pob/opinion_the_untold_series_is_losing_its_magic_and/"
    },
    {
        "id": "1ku3ghs",
        "author": "okayfriday",
        "title": "What is the most mind-bending and / or edge-of-your-seat movie you've seen?",
        "content": "I've tried to elicit some recommendations by indicating the movies I've seen / liked, but the returns are not very targeted. Would love to hear about the movie(s) that have gripped you!!",
        "upvotes": 22,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1ku3ghs/what_is_the_most_mindbending_and_or/"
    },
    {
        "id": "1kuvfvw",
        "author": "LittleLord_FuckPantz",
        "title": "TIMOTHEE DE Chalamet FRANCOIS",
        "content": "Great movie \"The King\" but Why is the guy with most French name playing the king of England? This must be offensive to not only me as a Brit but also to all of the French who died in this war 700 years ago. \n\nTimothee de Chalamat more like Timothee Me Chardonnay because that's what I needed after looking up their names on IMDB ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kuvfvw/timothee_de_chalamet_francois/"
    },
    {
        "id": "1ktql04",
        "author": "strawberrycheescak",
        "title": "Anyone else unable to find anything good on Netflix?",
        "content": "I feel like ive watched all the interesting shows/movies on there and theres nothing good for me to watch. I live in Austria so its probably different depending on the person but I feel like its just the same types of shows/movies that show up that ive either watched or im not interested in (the crime shows/movies about someone going missing). Anyone else feel this way? I don’t really know how to find new shows on there or if there are any new ones I can watch. It feels like they’re just not releasing as good content anymore. ",
        "upvotes": 137,
        "comments": 76,
        "media": null,
        "permalink": "/r/netflix/comments/1ktql04/anyone_else_unable_to_find_anything_good_on/"
    },
    {
        "id": "1kua116",
        "author": "ThenTomorrow508",
        "title": "Is the 13,99 € plan worth it?",
        "content": "Hello everyone,\n\nMy family and i arent the type of people to spend money on too much stuff. However my Dad and Mom are both hugeee on movies. They love watching them ! Which is why i wanted to buy them Netflix. I dont earn much and im a student which is why im a bit stingy on purchasing the 13,99 € option instead of the 4,99 € \n\nBut i want them to have the better netflix experience without the ads and everything. They deserve to watch their movies without constant ad breaks and what not.\n\n\nWhat plan did you guys buy and what do you recommend? Are the ads a lot or is it mangable? ",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kua116/is_the_1399_plan_worth_it/"
    },
    {
        "id": "1kuutiz",
        "author": "Local_Week3444",
        "title": "Netflix New Interface is Sooooo Horrible",
        "content": "I was looking online to see if anybody else had complained about this yet and it didn't come up in my search. What I found was from 6 months ago people complaining about what appears to be the issue now, so maybe they were in beta. But I see that Netflix did a new interface that they think is so lovely for all of us. I think it's horrendous and people 6 months ago were complaining about how large these tiles are and so hard to look at things. I hate that I have to see this huge icon in my list and I can't see very many tiles so I lose track of where I'm at. Why doesn't Netflix listen to users complaining about it 6 months ago? \n\nI was able to turn it off but I'm wondering if it will be only temporary b/c Netflix thinks it's so grand. Anybody else feel this way?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kuutiz/netflix_new_interface_is_sooooo_horrible/"
    },
    {
        "id": "1ktdjr7",
        "author": "muffinpie90",
        "title": "Anyone else sick of the long wait between seasons and wish we had 22 episodes again?",
        "content": "Even 13-16 episodes would be better than 8. It's taken almost a decade to produce 42 episodes of Stranger Things... Why is this the norm? Kind of over it and it loses the momentum with these big breaks.",
        "upvotes": 842,
        "comments": 115,
        "media": null,
        "permalink": "/r/netflix/comments/1ktdjr7/anyone_else_sick_of_the_long_wait_between_seasons/"
    },
    {
        "id": "1kuhz76",
        "author": "athousandpapercuts73",
        "title": "AB Wynter was a Sh** Boss: The Residence",
        "content": "SPOILERS AHEAD!!!\n\nThe end of the series really acts like Wynter is beyond reproach just for caring about the traditions of the White House -- and tries to blame his employees for having conflict with him. Na-ah dude he's a poor manager and management is more than half of his job.\n\nDespite his strong loyalties to the house and professionalism. AB Winter is a sh** boss. He's great to have as an employee, totally collected yes-man, but as far as working under him-- \nhe doesn't acknowledge hard work, he calls in overqualified people for non-emergency situations and, despite references to the contrary, he appears to be quite prone to conflict at all times in private AND public.\n\nMost importantly he doesn't stick up for his staff at all. He says something about \"it's not our job to push back\" to Jasmine-- that is not the point-- last minute changes disrespect your staff and ruin the ability for things to run smoothly. \nIf the weird anti-tradition squad wants to make changes let them do it within a reasonable time frame. \n\nSomeone else's lack of organization is NOT your fake emergency. These poor people putting in all this work just to have their boss let it be thrown away without his acknowledgement or apology it's nuts. Feel so bad for them..and yes I worked in service for 8 years so that might be influencing me here 😂. \n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kuhz76/ab_wynter_was_a_sh_boss_the_residence/"
    },
    {
        "id": "1kug7ej",
        "author": "cmatty12",
        "title": "Question on Sirens New Show",
        "content": "Just binged Sirens – loved it but confused about one thing (Simone)\n\nSo I just powered through Sirens in a day (don’t judge me lol) and honestly, it was hilarious. Super fun watch. I thought the ending was perfect — Peter trading in his wife for a younger, better-looking one? Iconic. Good for him 😂\n\nBut one thing kinda confused me… why was the whole staff so happy and even playing music when Simone got fired? I mean yeah, she was a little intense and definitely had that boss energy, but I didn’t really catch her being straight-up rude to everyone. Did I miss something? Or was it more subtle? Just felt like there was something I wasn’t picking up on.\n\nAlso, Devon. Man. It felt like she was kinda in love with being miserable? Like her sister chose a life of comfort and happiness, and Devon just could not wrap her head around it. It’s like she couldn’t grasp that maybe not everyone wants to be in the struggle all the time lol.\n\nAnyway, would love to hear what y’all thought. Did I just miss some major cues?",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1kug7ej/question_on_sirens_new_show/"
    },
    {
        "id": "1kts0wy",
        "author": "volch-devz",
        "title": "WTF happened to Love Death Robots S4?",
        "content": "The animation this season is amazing as always, no complain there. But the writing...\n\n(Rant Begins) I still watch some episodes from the previous seasons over and over again out of love (Zima Blue is by far my favorite) but this season is just that... Animation. I felt such a void watching all 10 of them.\nThe Red Hot Chilli Peppers, amazing animation... But it's not even close to being my favorite band and what I am watching is just another video of song. The cat episode and the alien episode made me appreciate 3 robots and The Drowned Giant so much more. Night of the Mini Dead is fun and hilarious but Close Encounters in season 4 feels like fanfic. \nCompare How Zeke got Religion to The Secret War, or Shape Shifters to Spider Rose or The Screaming Tyrannosaur. \n\nAm I the only one who feels that Netflix exploits the popularity of a show all the way to oblivion? Sucking the very essence that made them original and creative till nothing remains? ",
        "upvotes": 44,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1kts0wy/wtf_happened_to_love_death_robots_s4/"
    },
    {
        "id": "1kthgvq",
        "author": "No_Corner1086",
        "title": "Thoughs on Sirens?",
        "content": "I’ve been marathoning it since yesterday. I finished it today and IDK. I kinda love it but I also kinda hate it. I feel like it has a really cool concept but it’s execution is shaky. What do you guys think? Have you seen Sirens yet? ",
        "upvotes": 118,
        "comments": 214,
        "media": null,
        "permalink": "/r/netflix/comments/1kthgvq/thoughs_on_sirens/"
    },
    {
        "id": "1kudsj2",
        "author": "fuck4everything",
        "title": "I cant remember name of the movie",
        "content": "&gt;!What is this movie about teenagers in the house who plays a game about who kills and the last guy kills himself accidentaly with a katana they found it in his mobile.!&lt;\n\n&gt;!they trying to find out who is the killer that kills!&lt;",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1kudsj2/i_cant_remember_name_of_the_movie/"
    },
    {
        "id": "1ku5i9m",
        "author": "aarplain",
        "title": "Goodfellas scene out of order",
        "content": "Goodfellas is one of my favorite movies of all time. I own a blu ray special edition and I’ve easily watched this movie 50-100 times. I watched it on Netflix tonight, because why not. I swear there is a sequence out of order. I watched it and immediately had to rewind because something triggered my brain. It’s the scene with the baby sitter who works for him moving drugs. It’s inserted during the Lufthansa heist scenes. It doesn’t make sense for it to be there and I thought it came later in the movie. Am I going crazy here?",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1ku5i9m/goodfellas_scene_out_of_order/"
    },
    {
        "id": "1kub4ru",
        "author": "Heavy_Committee",
        "title": "Subtitles issue",
        "content": "I want the old Netflix subtitles style but even when I select it, it doesn't change and gives me the subtitles with a background. \nAny help getting the old style back? ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kub4ru/subtitles_issue/"
    },
    {
        "id": "1kud3b9",
        "author": "picksix06",
        "title": "The Residence Editing",
        "content": "Does anyone else find the editing of the residence to be like a YouTube video meant for kids? There’s not even a split second between characters talking to each other most of the time. I feel like it’s constant stimulation overload between the pace of conversation, music constantly coming and going, quick shot changes, etc… it feels like I’m watching a Mr Beast video in editing style. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kud3b9/the_residence_editing/"
    },
    {
        "id": "1ku44pd",
        "author": "Unlucky-Zucchini-251",
        "title": "Poor bitrate on Netflix (Edge)",
        "content": "I’ve tried everything I can to resolve this issue but haven’t had success, so I would really appreciate any help or suggestions.\n\nThe issue I’m facing is that in Microsoft Edge, the bitrate and resolution of streaming titles don’t go above **1080p** and around **700 kbps**. This is despite the fact that my system and display support much higher quality — I’m using a **1600p OLED** panel with a **240Hz refresh rate** and **Dolby Vision** support.\n\nJust so you know, my system has an **RTX 4070** GPU and an **Intel Core Ultra 9 185H** processor, and I’m on the **Netflix Premium plan** that supports **Ultra HD playback**.\n\nInterestingly, on **Google Chrome**, the bitrate can reach up to **18,000 kbps** (18 Mbps) and **4K resolution**, even though Chrome itself is capped at 1080p in some cases. Still, the quality and bitrate are noticeably better on Chrome.\n\nHowever, I prefer using Microsoft Edge because **Chrome doesn’t support Dolby Vision**, and I’d like to take advantage of that feature while still getting the best possible bitrate and resolution.\n\nCould you help me figure out why Edge is limiting the quality and how I can unlock higher bitrate and resolution when streaming?\n\nThank you in advance!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ku44pd/poor_bitrate_on_netflix_edge/"
    },
    {
        "id": "1ku3511",
        "author": "_tytbs_",
        "title": "Are any of you watching/have watched Snack VS Chef?",
        "content": "I'm watching the show currently but I'm not sure if I want to complete watching it. So if someone does recommend watching this show completely and if the ending really is worth it, do let me know.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ku3511/are_any_of_you_watchinghave_watched_snack_vs_chef/"
    }
]