[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 492,
        "comments": 271,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 10,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1j6arrx",
        "author": "JemJemIsHerName",
        "title": "Apple Cider Vinegar- holy crap!",
        "content": "I’m not sure if I’m late to this but oh my god. This may be one of the best shows I’ve seen in a long time. I hate it, I love it, I’m angry, I’m sad. It’s giving the “Inventing Anna” energy but with much higher stakes. A fake cure to cancer that probably killed a lot of people and is still in line with the fake “cures” we see today for medically curable stuff. It’s so fascinating and infuriating at the same time. I love this show, I hate this happened. I love it’s being put out there. I haven’t been so angry/interested in a show in a long time. 9/10 I would recommend! ",
        "upvotes": 38,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1j6arrx/apple_cider_vinegar_holy_crap/"
    },
    {
        "id": "1j5yp2g",
        "author": "Dependent-Arm-7443",
        "title": "With Love, Meghan is Actually Good",
        "content": "I know Meghan Markle gets a lot of hate, but honestly, I actually liked her show. It feels like people dismiss it because of who she is, rather than judging it fairly. If you actually watch it with an open mind, it’s enjoyable in its own right. As someone who watches lots of lifestyle/ cooking shows, she actually uses lots of good cooking/ home making techniques. She has a warm, calming presence that makes it easy to watch. The cinematography, the food, the storytelling—it’s well-produced and enjoyable. I mean she is exploring something she loves – She clearly enjoys what she’s doing, and I respect that.\n\nAnd let’s be real—of course, she’s not filming in her own house. Security risks aside, most food and lifestyle shows aren’t filmed in the host’s actual home. People are just looking for things to criticize.\n\nShe’s trying her hand at something new, something she clearly loves. Why is that such a crime? Not everything has to be groundbreaking—sometimes, it’s just about making something enjoyable.\n\nIf it’s not your thing, that’s totally fine, but hating for the sake of hating is just unnecessary. Anyone else actually like the show?",
        "upvotes": 158,
        "comments": 184,
        "media": null,
        "permalink": "/r/netflix/comments/1j5yp2g/with_love_meghan_is_actually_good/"
    },
    {
        "id": "1j62d09",
        "author": "CommercialAlert158",
        "title": "Gabby Petito Documentary",
        "content": "I am watching episode one of this horrible story 😔 there are so many mistakes made on all accounts. Just to start with in the first episode when the police stopped them and spent time with them to figure out what was going on. Why would they put Him in the Hotel room and have the young girl (Gabby) sleep in her car? I know this is a minor question considering this being a horrible story but it just shocked me? Anyone have any ideas on this?",
        "upvotes": 89,
        "comments": 108,
        "media": null,
        "permalink": "/r/netflix/comments/1j62d09/gabby_petito_documentary/"
    },
    {
        "id": "1j5l4kc",
        "author": "Robemilak",
        "title": "Netflix Is Planning To Spend $18 Billion on Content in 2025",
        "content": "",
        "upvotes": 335,
        "comments": 156,
        "media": null,
        "permalink": "/r/netflix/comments/1j5l4kc/netflix_is_planning_to_spend_18_billion_on/"
    },
    {
        "id": "1j5t8sw",
        "author": "S4v1r1enCh0r4k",
        "title": "The Night Agent is the most watched show in the US for a third week straight with 1.52 billion minutes viewed",
        "content": "",
        "upvotes": 89,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1j5t8sw/the_night_agent_is_the_most_watched_show_in_the/"
    },
    {
        "id": "1j63z7h",
        "author": "llc4269",
        "title": "I wish Sweet Magnolias ended with season 3 because 4 is just terrible",
        "content": "I wish Sweet Magnolias had ended on season 3 because season 4 was incredibly disappointing.\n\n I posted this in sweetmagnoliaNetflix and was declined because the mod said that I was too mean because I was honest that I highly disliked season 4. Granted they said I wasn't mean to anyone (and honestly I wasn't even mean) they just took offense that I didn't say lovely things and didn't like the season, I guess. Which I absolutely did not.\n\nSo, if you still love this show, please just skip ahead because I found season 4 to such a major disappointment with the exception of the fact that Heather Headley, is truly an amazing vocalist. The rest of season 4 though is a dumpster fire. I can't seem to get the spoiler text block out to work so I'm going to do a whole bunch of spaces to make sure that nobody gets inadvertently spoiled and I hope that's okay.\n\nI used to love this show so very much. I looked forward to it more than even Virgin River, and I'm a huge fan of that. I cared deeply about the characters, it was so beautifully filmed and idealized and it just was such a great escape. And tell season 4. I literally had to watch the last two episodes three times because I kept zoning out due to my lack of caring at all. We see more of Cals mom than him and it's annoying. At this point I just hope they don't renew anymore. \n\nSPOILERS BELOW!\n\n\n.\n\n.\n\n\n.\n\n.\n\n.\n\n.\n\n.\n\n.\n\n.\n\n.\n\n.\n\n.\n\n.\n\n.\n\n.\n\n.\n\n.\n\n\nThat time jump was absolutely stupid and disastrous. Everyone seemed to progress and grow except for Katie who looks exactly the same. And we're supposed to believe that a little kids book demands a book tour? Seriously? All the sudden Maddie and Cal are just engaged and we missed it? And that weird Halloween wedding was just dumb. April and Ty have been in love forever and then he's gone most of the season? And I couldn't care less about Dana Sue and Ronnie's money issues considering they were given a massive amount in an inheritance.\n\nSullivan's isn't Sullivan's anymore without Dana Sue and now she's doing some cooking school which I don't give a flying flip about. I could not care less about Ty being in a band especially since he wanted to do something with his hands and suddenly he's going on tour? Don't even get me started with the idiocy of Ronnie and his motorcycle.\n\nHelen has some government job which no one really knows anything about and just does nothing but detract from the main plot line and I don't even care about her and Eric anymore. When they got engaged I was like meh. This whole show jumped the shark and as far as I'm concerned they should have stopped at season 3. We didn't even get good good payback with Kathy! \n\nAnd even though Bill wasn't the greatest dad ever they did him dirty. He just dies we're left with his narcissistic mother and then he's never mentioned again Other than a Christmas gift to Bexs. The only couple I really like is Noreen and her new man. I know a lot of people don't like her but I do but she didn't have nearly enough screen time. It's just so disappointing. \n\nThe fact that Isaac still hasn't revealed who his mother is is ridiculous and I could not care less about his romance even though I'm all for adding LGBTQ+ romance but I just don't care about these two because they're boring as all get out. I hope with Maddie moving to New York everything just ends. Everything that I used to love about this show is been destroyed in one season. And I'm good if they don't renew it. Even if it gets renewed, I'm not going to watch it.\n\nHopefully the moderators here have less of a hard on for the show and can handle a independent and truth of you for how I see this show. If you loved it though head on over to Sweet Magnolia Netflix subreddit.I'm sure they'd love to post your review.",
        "upvotes": 14,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1j63z7h/i_wish_sweet_magnolias_ended_with_season_3/"
    },
    {
        "id": "1j6chch",
        "author": "Plane-Cloud-5837",
        "title": "Running Point is sort of based on a true story",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j6chch/running_point_is_sort_of_based_on_a_true_story/"
    },
    {
        "id": "1j6c5e6",
        "author": "Extreme_Yellow685",
        "title": "What shows do you recommend ?",
        "content": "I’m look for something similar to\nYoung Sheldon\nDynasty\nModern family \nDesperate housewives \nFriends\nThe office \nI just finished young Sheldon and don’t know what else to watch 😫😫😫",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1j6c5e6/what_shows_do_you_recommend/"
    },
    {
        "id": "1j64z9l",
        "author": "AverageBasicMan",
        "title": "Running Point - Game 1 Playoffs",
        "content": "In season one episode nine of Running Point, The Waves play their first playoff game at home against Minnesota. But didn't they just sneak into the playoffs? So then wouldn't that first game be at Minnesota?\n\nI thought maybe that they were in a play in game. But the announcer says that The Waves win game 1 of the series. \n\nThoughts? ",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j64z9l/running_point_game_1_playoffs/"
    },
    {
        "id": "1j67zn0",
        "author": "anymoose",
        "title": "Chaos - Manson Murders",
        "content": "It's just a new re-branding of the old \"Charlie don't surf\" tee-shirts for anyone who is old enough to remember that.\n\n&gt;!Make an edgy counter factual flick that hints Manson was the true victim and get yourself some sales/clicks/views .... I'm really sorry I wasted my time on this BS !&lt;",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1j67zn0/chaos_manson_murders/"
    },
    {
        "id": "1j675iq",
        "author": "buttholesnarfing",
        "title": "Anyone else's \"continue watching\" broken for the past YEAR?",
        "content": "No, watch history is not turned off. Yes, the app is up to date and so is my IOS. Yes, the problem persists across all devices (iphone, ipad, PC) and on both wifi &amp; cellular. Yes, I have tried fiddling around to trick the app into updating my progress. \n\nStill... \"continue watching\" will not update. It will usually register the first or second episode of something, or the first few mins of a movie, and then never update it again no matter how far I get into the series or how many times I let it play to completion. \n\nWhy is this happening, and is there a fix? \n\nIt already feels awful giving so much money to a company that does so many shitty things. If their service isn't even going to work, I just can't justify paying for it any longer. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j675iq/anyone_elses_continue_watching_broken_for_the/"
    },
    {
        "id": "1j5ywfx",
        "author": "CarelessSentence1709",
        "title": "I’ve thought I’ve seen terrible series “finales” but Aquarius takes it.",
        "content": "I know the problem is because they were canceled, but why couldn’t they at least let them have a final special or something to wrap it up, I feel like it wasn’t even FAIR. I will say the show was not the greatest thing in the world but it was good enough and had SO much potential. The problem with it was they went overboard with side plots, almost every character was the star of their own show within the show and it was getting gratuitous. \n\nShafe’s addiction story wrapped and then he was in limbo. Carmichael they gave way too much agency to and it was not necessary, Emma’s dad and their whole thing went on far too long with he and that wheelchair guy, but it at least had something to do with the Manson Family.  And the Walt situation I think could’ve been worked into the Manson plot and that would’ve been compelling, but we don’t know their vision. They didn’t have a fair shot or didn’t take advantage of the time they had, but to just cancel on that cliffhanger was criminal. \n\nThis is why I hate network television . ",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j5ywfx/ive_thought_ive_seen_terrible_series_finales_but/"
    },
    {
        "id": "1j506he",
        "author": "yahoonews",
        "title": "A boy's kidnapping case was on Netflix's 'Unsolved Mysteries'. He has now been found safe.",
        "content": "",
        "upvotes": 569,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1j506he/a_boys_kidnapping_case_was_on_netflixs_unsolved/"
    },
    {
        "id": "1j6ac23",
        "author": "Ebrundle",
        "title": "Games Ads are Out of Bounds. Let us turn it OFF",
        "content": "I understand them trying to push some ads, but it's outrageous. Every time I've opened netflix for the past 6 months, my screen is filled with auto-rolling predatory game ads. No way to cancel it. It's torment. Netflix needs to allow users the option to turn off the game ads",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1j6ac23/games_ads_are_out_of_bounds_let_us_turn_it_off/"
    },
    {
        "id": "1j5sc7r",
        "author": "ConceptAble4425",
        "title": "Roosters",
        "content": "Has anybody seen the new show Roosters? Heard its a copy of Alpha Males but its a nice show, really enjoyed the light heartedness. \n\nActing was also decent! Good show overall.",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j5sc7r/roosters/"
    },
    {
        "id": "1j5ytrp",
        "author": "indiewire",
        "title": "Best New Movies Streaming on Netflix in March 2025",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j5ytrp/best_new_movies_streaming_on_netflix_in_march_2025/"
    },
    {
        "id": "1j63tdq",
        "author": "Zeethouuuuuugh",
        "title": "Movie recommendations !",
        "content": "Hey everyone!\nI’m looking for some intense thriller movie recommendations that are available on Netflix. Something gripping, full of suspense, and keeps me on the edge of my seat. Any suggestions? 😊",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j63tdq/movie_recommendations/"
    },
    {
        "id": "1j5ueo1",
        "author": "Famous_Permit4184",
        "title": "Formula1 - Stupid Netflix episode order",
        "content": "How is a company like netflix capable og making a such a counter intuitive user interface is beyond me? I was looking forward to see the new season of F1 and moves from one of the past seasons up to season 7th and it starts at the last episode. So confused I watch the last episode first, even doubled checked twice that it was the first (I did also react over the title, but thought it was the end of the prev season). GREAT!! Is this an error or is the UI/UX team just amateurs? If this is the way it's suppose to be, in opposite order, add numbers, ... (season premiere) or (season finale). It's not that hard, to remove all confusion. ",
        "upvotes": 3,
        "comments": 12,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/4easz0bvyane1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1j5ueo1/formula1_stupid_netflix_episode_order/"
    },
    {
        "id": "1j62egv",
        "author": "Master-Fondant5389",
        "title": "Netflix not working",
        "content": "When I open the app to watch something the app works normally but no movie thumbnail or profile picture or movie loads the app just works but nothing loads",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j62egv/netflix_not_working/"
    },
    {
        "id": "1j5wgrk",
        "author": "Morganbanefort",
        "title": "‘A certain kind of chaos’: Errol Morris unpacks Charles Manson theories",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j5wgrk/a_certain_kind_of_chaos_errol_morris_unpacks/"
    },
    {
        "id": "1j4y7yw",
        "author": "Waste-Scratch2982",
        "title": "'Running Point' Renewed for Season 2 at Netflix",
        "content": "",
        "upvotes": 229,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1j4y7yw/running_point_renewed_for_season_2_at_netflix/"
    },
    {
        "id": "1j5zy62",
        "author": "lilbigblue7",
        "title": "Favorite Tablet (7-10\") device for streaming",
        "content": "I haven't owned a tablet in years but I'm finding myself in situations where having a tablet that's sized about 7\"-10\" is going to be a better option to stream content than with my laptop (too big) or my phone (too small). I know there's some solid brand name devices (apple, samsung, google) that I could go with that 110% would get the job done, but if I didn't want to spend that kind of money what devices would y'all recommend that you've used? I will only be using the tablet for streaming content at 1080p (don't really care about anything higher resolution) and doomscrolling social media like Instagram/Facebook.",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1j5zy62/favorite_tablet_710_device_for_streaming/"
    },
    {
        "id": "1j6clxl",
        "author": "IndianMamba1224",
        "title": "Harry Potter TV series is coming",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j6clxl/harry_potter_tv_series_is_coming/"
    },
    {
        "id": "1j69hlq",
        "author": "ReasonBR",
        "title": "Why even bother releasing Resident Alien season 3 if it’s just a recap/rerun?!?",
        "content": "Season 3 is a complete rerun of season 1 &amp; 2. There is absolutely nothing new… literally every single thing is footage from the previous seasons. 2 seasons combined into 8 episodes. It’s like one big recap. Why even release it? I know season 3 got put off due to the strikes but why even bother and why does nobody have a problem with this?! Maybe it has to do with their contract with Netflix. Who knows but I think it’s absolutely pointless and nuts. Love the show, can’t wait for season 4! Even tho season 4 should be season 3 but whateva lol, I love the show anyways!",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1j69hlq/why_even_bother_releasing_resident_alien_season_3/"
    },
    {
        "id": "1j513r9",
        "author": "Gtk5623",
        "title": "What show is this? My math teacher asked us and nobody knows",
        "content": "",
        "upvotes": 126,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1j513r9/what_show_is_this_my_math_teacher_asked_us_and/"
    },
    {
        "id": "1j5xo2v",
        "author": "Medical_Neat5037",
        "title": "Funny movies?",
        "content": "I'd like to watch a movie with my 9 year-old daughter tonight, and I was hoping for recommendations for comedies we can both enjoy? She tends to prefer animated but we can go live-action if it's engaging enough. Thanks in advance for any suggestions!",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1j5xo2v/funny_movies/"
    },
    {
        "id": "1j676mm",
        "author": "ReconTrooperTTV",
        "title": "Why is this happening?",
        "content": "Thats my boy is the interview? ",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/w7mhso47odne1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1j676mm/why_is_this_happening/"
    },
    {
        "id": "1j60cgw",
        "author": "Ok_Rush_5368",
        "title": "Netflix Comedy Specials Gone?",
        "content": "Is it just me or did Netflix remove all their comedy specials off the platform? I can’t seem to find any - Bargatze, Gaffigan, Gervais, Chappelle…nothin ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1j60cgw/netflix_comedy_specials_gone/"
    },
    {
        "id": "1j5qvi9",
        "author": "indiewire",
        "title": "The Best Indie Movies on Netflix: 32 Overlooked Films Streaming This March",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j5qvi9/the_best_indie_movies_on_netflix_32_overlooked/"
    },
    {
        "id": "1j4nnle",
        "author": "Eeepp",
        "title": "'The Recruit' Canceled At Netflix After 2 Seasons",
        "content": "",
        "upvotes": 590,
        "comments": 302,
        "media": null,
        "permalink": "/r/netflix/comments/1j4nnle/the_recruit_canceled_at_netflix_after_2_seasons/"
    }
]