[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 494,
        "comments": 273,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 18,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jl584x",
        "author": "Halloween_Nyx",
        "title": "Adolescence, a quote from the show I haven’t seen discussed yet really hit me",
        "content": "When the father is discussing with his wife how he saw some awful manosphere videos online because he was just trying to look up a workout video. \n\nThis was such a hard hitting line for me that could go by unnoticed. It is so easy to fall into that pipeline without any intentions of actually looking up people like Andrew Tate. As someone is constantly in the gym and looking up workout and diet recommendations on YouTube, I will almost always run into those kinds of videos and I just ignore them. \n\nSo many friends or fellow gym bros have shifted their attitude into this alpha male, high quality man, Andrew Tate style aggressiveness from YouTube and social media feeding them these influencers when originally all they were doing was looking up workout videos. \n\nIt’s incredibly concerning how easy it is and I feel for anyone trying to get into fitness and having to deal with this. Just understand there are normal fitness influencers out there that are not this way. ",
        "upvotes": 207,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1jl584x/adolescence_a_quote_from_the_show_i_havent_seen/"
    },
    {
        "id": "1jlg981",
        "author": "NixyVixy",
        "title": "Adolescence has AMAZING Camera work",
        "content": "The single camera shot scenes are incredible.  \n\nThe acting is phenomenal.  The story is captivating and riveting - but the camera work blew me away.  \n\nThe way it they chose to film is amazingly impactful.   \n\nYou see the view and timing as if you’re in the scene - including moments that are often shortened in other media, like someone getting hot chocolate from a vending machine.  \n\nThey don’t rush seemingly boring moments, and they don’t draw out seemingly significant moments.   The pacing of the plot ( via single camera lens) is perfect.  \n",
        "upvotes": 44,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1jlg981/adolescence_has_amazing_camera_work/"
    },
    {
        "id": "1jl25mi",
        "author": "RevolutionaryRip2504",
        "title": "the show adolescence isn't saying men=bad",
        "content": "I've seen a lot of men on different subs arguing about how the new show Adolescence with Owen Cooper is anti-male. However, I think this is very false. \n\nJamie (played by Owen Cooper) does not become evil overnight; he became this way due to loneliness, suppressing emotions, and exposure to harmful online communities. There are many times in the show where I sympathized with Jamie, given that he is just a 13-year-old boy. I think that societal expectations regarding men showing their emotions led Jamie to struggle with emotional repression, which caused him to lash out when he was rejected. And before you say \"he was bullied\", I don't think he was. Jamie asked Katie out when he knew she would be vulnerable, and then she just called him out on it. As someone who was bullied as a kid, bullying is more repetitive. from the show, It just seemed like she had \"bullied\" him this one time. The show more urges people to create better support systems for young men so they learn how to manage their emotions rather than just saying men are bad. \n\nBasically, the moral of the story is to make sure that you are teaching your boys how to show their emotions in a healthy way, ask for help, and learn how to handle rejection. I think this show did an excellent job examining how online spaces can radicalize young boys and how its important to understand the challenges they face like internalizing emotions.",
        "upvotes": 126,
        "comments": 169,
        "media": null,
        "permalink": "/r/netflix/comments/1jl25mi/the_show_adolescence_isnt_saying_menbad/"
    },
    {
        "id": "1jlhzud",
        "author": "Alan_Stamm",
        "title": "The Residence (8 eps): 'Clue meets The West Wing, with a side of Downton Abbey”",
        "content": "Recommendation from culture writer Meredith Blake at [The Contrarian](https://contrarian.substack.com/p/contrarian-culture-club-recommendations-2da), a Substack news site with a weekly \"Culture Club\" column:\n\n&gt;I realize that a show about murder and incompetence at the White House might not sound like the most appealing thing right now, but would still urge anyone who enjoys a good whodunnit and loves going behind the scenes of hallowed institutions to fire up *The Residence.*  \nFrom executive producer Shonda Rhimes and creator Paul William Davies, this witty, upstairs-downstairs murder mystery is set at the White House during a tense state dinner with Australia. In the midst of the lavish event—featuring a performance by a sparkly Kylie Minogue—chief usher A.B. Wynter (Giancarlo Esposito, of *Breaking Bad* and *Better Call Saul* fame) is found dead in the third-floor game room.\n\n&gt;Enter Cordelia Cupp (Uzo Aduba, *Orange Is the New Black),* a consulting detective for the Metropolitan Police and eccentric bird enthusiast (is there any other kind?) tasked with investigating the murder. Turns out there are plenty of people in the household staff with violent grudges against Wynter, from free-spirited butler Sheila (Edwina Findley) to aggrieved pastry chef Didier (Bronson Pinchot). Al Franken also has a supporting role as a senator leading the hearing inquiry into the murder. (A real stretch for him, to be sure.)  \nI like to imagine the elevator pitch for this was something like “*Clue* meets *The West Wing,* with a side of *Downton Abbey.”* The eight-episode series is very loosely inspired by *The Residence: Inside the Private World of the White House,* by Kate Anderson Brower (who also happens to be a [*Contrarian* ](https://contrarian.substack.com/p/flipping-the-script-how-americas)[contributor](https://contrarian.substack.com/p/flipping-the-script-how-americas)).  \nAnd while it clearly deviates from the source material and is consciously over-the-top in a very Rhimesian way, *The Residence* does manage to paint a fascinating portrait of life inside the White House, complete with elaborate sets and detailed production. It also humorously explores the tensions that can emerge between the residence staff, many of whom have worked at the White House for decades, though the administrations change every few years (may it remain that way).\n\n[Photo by Jessica Brooks of Netflix](https://preview.redd.it/hrrc0unaobre1.jpg?width=3600&amp;format=pjpg&amp;auto=webp&amp;s=eadf08a4716363cbdf7117c1d44106c014480da8)",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jlhzud/the_residence_8_eps_clue_meets_the_west_wing_with/"
    },
    {
        "id": "1jkwa8x",
        "author": "[deleted]",
        "title": "Adolescence: It's OK to not like something",
        "content": "I feel like I've had to make this post because even though I thought Adolescence was OK, I didn't think it was great. The supporters of this show have become SO hateful online it's ridiculous!\n\nPeople are saying \"It's a masterpiece\", \"This will be studied in Media classes\", \"This show was eye-opening and life-changing\" and that's FINE! You know why? Because everybody is entitled to an opinion!\n\nTikTok, X, Facebook, Reddit, everywhere I leave my opinion saying \"I thought it was alright, pretty good, I probably wouldn't watch again though\" I get people saying...\n\n\"You obviously didn't get it 🙄 \"\n\"You must have a low IQ, this is only for deep thinkers to watch\"\n\"Sorry that TikTok has rotted you're brain and you can't go more than 5 mins without getting bored\"\n\"You're part of the problem with society\"\n\"We found the Andrew Tate supporter who hates women!!!\" (I'm gay lol)\n\nMy point is that it's OK to not be a big fan of a fictional TV show lol Everybody has an opinion. But it just seems like fans of this show are actively going out of their way to be rude and aggressive towards those who weren't big fans of the show.\n\nI can understand the obvious hate towards those who are wearing tin foil hats or who are actual Andrew Tate supporters, but what is the deal with getting angry with a random person who just didn't like it? Lol\n\nI know it explores sensitive topics but people really need to chill out over this show. One of the key messages was how we behave online and some of the fans are completely contradicting that message imho. They're being SO hateful towards people who have a different opinion. \n\nRant over, thank you for coming to my Ted Talk. ",
        "upvotes": 183,
        "comments": 274,
        "media": null,
        "permalink": "/r/netflix/comments/1jkwa8x/adolescence_its_ok_to_not_like_something/"
    },
    {
        "id": "1jlqp08",
        "author": "Crazyandconfused10",
        "title": "Wish Adolescence series had better conclusion and not left us confused",
        "content": "So was Jamie guilty or not?\n\nThere have been many instances wherein he is shown as not guilty like\n\n\\-When Jamie telling to psychologist that he didn't kill her? Yes he explained other stuff quite clearly i.e the relation between Katie and him etc but he said he didn't kill her.\n\n\\- When the girl at school was hitting Ryan saying he murdered Katie. Also the conversation between Ryan and other friend while walking to cafeteria was very sus.  \n(I thought Adam i,e D.I son's heard the conversation and would tell it to his dad)\n\n\\-And also  when the guy who worked at supermarket said to Jamie' dad that Jamie might have not done the crime bc of some anatomy marks being different and told them to get a nice lawyer to get him out of this mess.\n\nI wish they showed if Jamie was guilty or not at the end. And cleared all those doubts they gave us that I have mentioned above.  \nWhen I was watching ep 1 , the scene where they showed Jamie and Katie fighting , I was expecting they would show exact clip properly in the end showing what exactly happened and the conversation  that took place and just everything.  \nWhat are your opinions? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jlqp08/wish_adolescence_series_had_better_conclusion_and/"
    },
    {
        "id": "1jlpjjx",
        "author": "c74",
        "title": "gold &amp; greed is fun. 96.42424242% fun to watch",
        "content": "had fun watching this.  was worth the time.  sure it is one of those 'reality' shows that is not reality but the characters were fun. wings can fly but the beasts swim.  songs of a monkey are A gesture of lOve.  my love to you is close to a cliff after a full moon -23.8 * 32 /42 pLus 3.  iron + space - silver and multiplied by .3 minus 3.  breathe sunshine.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jlpjjx/gold_greed_is_fun_9642424242_fun_to_watch/"
    },
    {
        "id": "1jllow8",
        "author": "jayestevesatx",
        "title": "Green Light, Red Light Game in AR Glasses",
        "content": "Pretty fun to play! Nice that you can take it on any environment. A slight movement already loses the game so, like Squid Games, pretty hard to win! ",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/fmfwaf3mlcre1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1jllow8/green_light_red_light_game_in_ar_glasses/"
    },
    {
        "id": "1jla4bg",
        "author": "sryracha",
        "title": "Spoiler warning ❗️The Residence",
        "content": "Just finished the show- amazing experience and the comedy was perfect for my humor. I did feel like the reveal was a little anticlimatic, but regardless, I made the best decision spending my day off watching it. I just have one question: by the end, why did grandma know who the murderer was?",
        "upvotes": 12,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jla4bg/spoiler_warning_the_residence/"
    },
    {
        "id": "1jlp57e",
        "author": "Haunting-Musician624",
        "title": "Backstory of Adolescence (My theory)",
        "content": "One single event doesnot results in a person being turned into a hate mongering youth. I documented my thoughts throughout my teen years so I feel I can explain it.\n\n(Seperate people may have seperate views everyone's right)\n\nJAMIE'S RELATIONSHIP WITH SCHOOL AND INTERNET'S INFLUENCE\n\nLet talk about Jamie. Jamie is a 8th grade student the puberty genes are striking him as far as he can see suddenly he's more interested in girls .He goes to school he has a trio. But they are not the popular one What jamie and his trio wants?\n\nPopularity! liked by girls!\n\nBut they are not that trio. Their trio being not the popular one may have been picked out my the popular ones. But he sidelines and ignores it thinking maybe it would help them being friends with the popular people.\n\nHere he discovers the manosphere the Andrew tate people. Though people claim that he saw Andrew tate one day ane boom now he's the most toxic person No! It doesnot works like that\n\nLet me tell you from my experience Jamie a not so\n\npopular kid being picked out by the popular ones\n\nlearns about andrew. Andrews spits all the toxic\n\nanomalies available in the world to jamie.Jamie doesnot instantly changes into a woman hating person but slowly he starts to undermine them. This undermining with time became his copium mechanism to being rejected by the girls and the popular kids\n\nHere comes Katie as seen from the show and from my personal experiences in my life most probably she was the one famous girl we all have in our class. Katie in earlier circumstances (before the nude got leaked) may not have had much interaction with Jamie. Her nudes got leaked she is getting backlack from every freaking person available in the world.She's feeling worse.\n\nJamie's entry to the scene: Jamie using the usual trope no one says but everyone knows\n\nWHEN A GIRL IS SAD I AM GOING TO TALK WITH HER AND MAYBE I MIGHT HAVE A CHANCE\n\nJamie has a crush on Katie but he's too underconfident to say it but here comes the chance (yes it's bad and I don't support it but he's a 13 year old so don't start calling a 13 year old a incel or narcissist they are just hormone induced teens)\n\nJamie goes to Katie and starts talking with her. Katie gets offended She's already vulnerable from all the things\n\nAnother unsaid rules when you are bullied\n\nWHEN A STRONGER PERSON IS BULLYING YOU AND YOU FEEL NOT IN POWER START DOING IT TO A WEAKER PERSON IT WOULD RESULT IN HAVING SOME APPRECIATION FROM THE BULLIES YOU WANT TO BE FRIEND WITH CHANGE IN FOCUS TO THE SMALLER ONE JUST LIKE BARTER SYSTEM)\n\nJamie too may or maynot have said something or persuaded her it's upto your perception\n\nHere comes Katie's chance to barter the criticism to Jamie\n\nKatie makes a long comment to get the appreciation from all the people.\n\nNOW FROM JAMIE'S PERSPECTIVE\n\nJAMIE always had a crush on Katie but he never accepted it he was a insecure self hating kid moreover Andrew tate philosophy taught him to undermine the girls as a copium.\n\nNOW THIS IS THE THING YOU CAN DO ALL ANDREW TATE SHIT TO COPE WITH IT BUT A CRUSH A CRUSH\n\nNow he thought he had a chance but it backfired now he's the center of the class. Already he was getting picked on, his all frustration on not being the popular one the Andrew tate and manosphere hate that had been ignited in him\n\nmade a small event into a major event Jamie feels like it's the end of the world everyone's against him. He had no one reassure to talk to. He\n\nNow he does the unthinkable which no freaking justification can justify but I tried to breakdown the mind\n\nJAMIE'S RELATIONSHIP WITH DAD\n\nI want to request everyone please stop blaming the parents for a kids work. A kid is not a canvas to paint he comes with certain characteristics\n\nA person is not a puppet his emotions his thoughts his reactions are not stationary it constantly evolves. But it has a certain framework a skeleton.\n\nAlso it varies with situations a person in a tense situation is not his usual self.\n\nJamie's dad was a sweetheart. I can see redditors saying Jamie's dad has anger issues but the thing is most of the dads in this world would do the same when a person is in such a situation\n\nWHAT INFLUENCE JAMIE'S DAD MIGHT HAVE HAD TO JAMIE'S MIND?\n\nJamie as every son wants to be appreciated by his dad. Jamie's dad tried his best as he can to break the cycle of abuse.\n\nBut as mens are told don't cry don't express your feelings to others he couldnot have a man to man talk to jamie he couldnot talk about him about this school struggles\n\nIf he had taught jamie to express his thought jamie might have not made the cyber bullying as such a big deal. He would have learned to take things in a small manner\n\nAccording to me Jamie's parents has the least contribution to the final event which jamie did\n\nJAMIE'S RELATIONSHIP WITH MOTHER\n\nAs other redditors wants to show that jamie hated his mother hence he never talked with her but I think if I was in the same situation I would have asked my dad too\n\nJamie was not an incel he loved his mother and\n\nsister but he was closer to his dad\n\nThe copium of girls was only for the people outside his family\n\nAs you can see I can pretty much relate with Jamie but I had the good opportunity to have parents whom I could talk with moreover I had good friends",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jlp57e/backstory_of_adolescence_my_theory/"
    },
    {
        "id": "1jlcak2",
        "author": "Any-Guidance-9178",
        "title": "The Residence vs. Knives Out",
        "content": "Watching Knives Out or Glass Onion, it’s easy to take for granted how incredibly easy Rian Johnson makes it look. The reveals are satisfying because not only is it possible for things to have happened that way, he’s pieced everything together so skillfully that it wouldn’t make sense for things to have happened any *other* way.\n \nWith The Residence, on the other hand, I was trying to lean in and give it the benefit of the doubt, but by the end it had entirely lost me with two wildly implausible elements:\n \n&gt;!A.B. used his journal to meticulously document noteworthy events and record thoughtful, generous impressions of the people around him. This was 99%+ of the content of his journal. And in a tussle, someone tears out a half-sheet from it and not only does that sheet happen to be so tonally different from the rest as to read as a flawless suicide note, the rip goes out of its way to include just one word from the next paragraph and that word is “goodbye”!?! Infinite monkeys with infinite typewriters would produce Shakespeare’s complete works, but infinite journal-writers and infinite journal-rippers would never produce this scenario.!&lt;\n \n&gt;!After A.B. hangs up from the call with Lilly making nice and asking him to meet up, he says, “I’m going to be dead by the end of the night.” The show scrambles over itself to point out that that’s not a thing that humans actually say, but pointing out bad writing doesn’t make it any less bad. A.B. has admittedly had a pretty contentious day dealing with various personnel and interpersonal issues, but that’s his *entire job*. The show didn’t sell me for one second on the idea that this night of doing mostly things he’s been doing for his whole career was so extraordinary that he had a premonition of his own murder following an apparently innocuous call, he (this polished, poised ultimate public servant) casually said as much to a foreign diplomat, and the Australian guy was like okay that’s the end of this conversation I guess rather than asking, “Excuse me, what in the actual hell are you talking about?”!&lt;\n \nI actually think the show could’ve worked if they leaned into the parody angle and played it as a send-up of murder mystery tropes like &gt;!everyone incredibly developing a motive to kill the guy on this particular night!&lt; and wild coincidences leading to unbelievable turns of events like &gt;!the yellow oval room having a revolving door of people in and out all evening, and the murderer timing it exactly right to the point that she’s basically walking out of the room as someone else is walking in!&lt;. But to thread the needle on the attempted humor/sincerity blend, you need such skilled writing, and in my opinion it just wasn’t there.",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jlcak2/the_residence_vs_knives_out/"
    },
    {
        "id": "1jlj5tj",
        "author": "C_N_G_J",
        "title": "Movies to watch",
        "content": "Idk why but these last couple of days I’ve been really into horror movies and suspenseful movies and crime movies. I wanted to check this sub out and see what are some of best movies you guys would suggest. Thanks in advance.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jlj5tj/movies_to_watch/"
    },
    {
        "id": "1jl359j",
        "author": "Junior_Apartment6388",
        "title": "They put up pictures of Stephen Graham’s real family to make the final Adolescence scene even more emotional 😢",
        "content": "",
        "upvotes": 15,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1jl359j/they_put_up_pictures_of_stephen_grahams_real/"
    },
    {
        "id": "1jl9vak",
        "author": "Internal-Bed-3150",
        "title": "Black Mirror season 7 will return to the show's roots",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jl9vak/black_mirror_season_7_will_return_to_the_shows/"
    },
    {
        "id": "1jl9unm",
        "author": "MysteriousDelay6266",
        "title": "‘Pop The Balloon’ Lands Live Netflix Order - LIVE every Thursday at 8pm ET from April 10",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jl9unm/pop_the_balloon_lands_live_netflix_order_live/"
    },
    {
        "id": "1jlllvy",
        "author": "Significant-Source98",
        "title": "Hot/great British Netflix mini series to watch",
        "content": "I’ve recently been interested in British mini series and I’m looking for some more recommendations \n\nI’ve watched adolescence, Stay close, Marcella (3rd season so far is blah lol), Missing you, Safe, the stranger, fool me once .. so basically a lot of Harlan coben lol\n\nAny recommendations?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jlllvy/hotgreat_british_netflix_mini_series_to_watch/"
    },
    {
        "id": "1jllepu",
        "author": "Significant-Source98",
        "title": "Long Netflix (completed) series to watch next",
        "content": "I’m looking for a new long Netflix series, that’s completed (preferably least 3 seasons) to watch next. \n\nSome of what I’ve already watched:\n\nThe blacklist,You, Suits, Gossip girl , The crown , House, Ozark, Queen of the south, Greys anatomy (finishing the last season), House of cards (currently obsessed lol but I’ll be done it soon)\n\nSo basically any drama with wit, crime, political, medical drama etc etc \n\nOther recommendations are definitely welcome :)",
        "upvotes": 1,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1jllepu/long_netflix_completed_series_to_watch_next/"
    },
    {
        "id": "1jkwlm4",
        "author": "DorothyMortimer",
        "title": "I love The Residence!",
        "content": "Don’t worry, no spoilers! I just want to shout from the rooftops about how much I love Uzo Aduba and The Residence. I knew it was a Shonda show going in, so was expecting excellence, and guess what? I was not disappointed ❤️ I love it, binged it all, and highly recommend it. Done!",
        "upvotes": 55,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1jkwlm4/i_love_the_residence/"
    },
    {
        "id": "1jlfe7q",
        "author": "Hairy-Link-8615",
        "title": "Netflix Causing Screen Disconnects on PC",
        "content": "Hey all,\n\nI’ve been having a weird issue lately when trying to use Netflix on my PC. I’ve got a 3070 GPU and the latest Nvidia drivers installed.\n\nWhenever I run Netflix—whether it's through Chrome, Edge, or even the Windows Store app—my screens disconnect every couple of minutes. They go black for a few seconds, then come back. It’s super frustrating.\n\nAt first, I thought it might be ShadowPlay (had issues with that before), so I disabled it, but the problem still happens.\n\nI’ve seen a couple of posts mentioning similar problems, but none of the suggested fixes have worked for me so far—or they were from a while ago.\n\nIf anyone’s experienced this or has ideas, I’d really appreciate the help.\n\nThanks!\n\n3070 GFX",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jlfe7q/netflix_causing_screen_disconnects_on_pc/"
    },
    {
        "id": "1jl1t7x",
        "author": "Blue-Sea2255",
        "title": "Con Mum (2025)",
        "content": "This documentary feels like an email I’d normally find in my spam folder, but squared twenty times. Yet, someone clicked on it knowingly because they were at the weakest point in their life.\n\nWhat’s truly disturbing is that there are no criminal charges. Why is this being silently allowed?\n\nI hope those who went into debt because of this scam receive some compensation from this documentary.\n\nA few lessons:\n\n1. Don’t share everything about yourself online.\n2. Trust, but always verify.\n3. Avoid checking your spam folder or messages from unknown people when you're emotionally vulnerable, drunk, or seeking connection.\n4. Never accept free money or free gift from anyone (nothing comes free).",
        "upvotes": 15,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1jl1t7x/con_mum_2025/"
    },
    {
        "id": "1jlamjz",
        "author": "Tb12s46",
        "title": "Can someone recommend me a show?",
        "content": "My favourite shows to date have been:\n\n1. How to sell drugs online (fast)\n2. Resident Alien\n3. Black Mirror\n\nBased on those are there any other shows that you recommend with a mix of passive comedy or slightly eerie like Black Mirror with some degree of tech or sci-fi theme?",
        "upvotes": 3,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1jlamjz/can_someone_recommend_me_a_show/"
    },
    {
        "id": "1jl7tfc",
        "author": "MysteriousDelay6266",
        "title": "Ransom Canyon | Official Trailer | Netflix | APRIL 17",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jl7tfc/ransom_canyon_official_trailer_netflix_april_17/"
    },
    {
        "id": "1jl5lav",
        "author": "Tamasi18",
        "title": "Adolescence",
        "content": "Watching #Adolescence is an emotional wrecking ball. It will break you—as a parent, as a human—leaving you raw, vulnerable, and questioning everything. But some stories are worth breaking for.",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jl5lav/adolescence/"
    },
    {
        "id": "1jlcsq7",
        "author": "young7dragon",
        "title": "How to save profile history into CSV or any type of file",
        "content": "As you can see the title\n\nI cancelled the Netflix due to finance issue so I decided to leave Netflix which is much harder for me to leave therefore, I want to save all the stuff I have been watched it on Netflix for 10 years so does anyone know how to do it? Not transfer to another profile.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jlcsq7/how_to_save_profile_history_into_csv_or_any_type/"
    },
    {
        "id": "1jkydfb",
        "author": "Robemilak",
        "title": "Netflix Sets Korean Series ‘Scandals’ Starring Son Ye-jin, Ji Chang-wook &amp; Nana",
        "content": "",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jkydfb/netflix_sets_korean_series_scandals_starring_son/"
    },
    {
        "id": "1jkiost",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix Orders Live-Action Scooby-Doo Origin Series",
        "content": "",
        "upvotes": 62,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1jkiost/netflix_orders_liveaction_scoobydoo_origin_series/"
    },
    {
        "id": "1jkglwg",
        "author": "asurangonne",
        "title": "What would happen after the ending of Adolescence according to UK laws?",
        "content": "After bawling at the ending. (the aurora song was unfair too seriously)  \nI got curious to know what would happen to J after he pleads guilty?\n\nI googled and it seems for first degree murder, its life in prison for 15 and up, but J should be 13 when he committed the crime.\n\nIs he as good as dead to the millers? Because the ending really felt that way too in some sense.",
        "upvotes": 76,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1jkglwg/what_would_happen_after_the_ending_of_adolescence/"
    },
    {
        "id": "1jl7o5n",
        "author": "pokerfacefan",
        "title": "Is it possible for an extra member to be in another country?",
        "content": "Just a quick question. I’m in Canada and my girlfriend is in the Philippines. And I really wanna watch this show with her, but she doesn’t have Netflix herself. Is it possible for me to make her an extra non-household member of my account? Or are extra members restricted to only being from the same country as me? ",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1jl7o5n/is_it_possible_for_an_extra_member_to_be_in/"
    },
    {
        "id": "1jl6ib4",
        "author": "johnwatchingnetflix",
        "title": "My Top 3 Shows (2024)",
        "content": "These were my top 3 shows of 2024 (they weren’t released in 2024, it’s just the year I watched them)\n1) Atypical Family\n2) 7 Lives of Lea \n3) Welcome to the Family (Catalan version)\n\nNone of these shows are in English but they’re genuinely so good, PLEASE give them a chance!!! I especially recommend #2, I really need more people to watch that show.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jl6ib4/my_top_3_shows_2024/"
    },
    {
        "id": "1jl5brt",
        "author": "Gamesnic",
        "title": "Why is HDR content darker than SDR?",
        "content": "So I have an HDR 1440p monitor since a few months, and on Youtube it looks absolutely stunning when reaching those 1200 nits. It's just gorgeous.\n\nI just put my Netflix subscription to Premium to test out HDR, and when playing back an HDR show (it shows the HDR logo) then I can see it stream 1080p HDR content when looking at the CTRL Alt Shift D stats. However, as example Love, Death and Robots is literally darker with HDR than with SDR, and the highlights clip wayyy to early, like maybe at 150 nits. Why, what is Netflix doing to their HDR stuff?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jl5brt/why_is_hdr_content_darker_than_sdr/"
    }
]