[
    {
        "id": "1i3qboh",
        "author": "BunyipPouch",
        "title": "Join us Friday 1/24 at 3 PM ET for a live AMA/Q&amp;A with Brady Corbet, director of A24's 'The Brutalist'. It stars Adrien Brody, Felicity Jones, and Guy Pearce. The 3h35 epic-drama was recently nominated for 7 Golden Globes and is releasing nationwide next week.",
        "content": "",
        "upvotes": 79,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zkllw8td9mde1.jpeg?auto=webp&amp;s=e2ff5e06beea46e0088a96cabed5015e2326a2cd"
        },
        "permalink": "/r/movies/comments/1i3qboh/join_us_friday_124_at_3_pm_et_for_a_live_amaqa/"
    },
    {
        "id": "1i36zgg",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Wolf Man / One of Them Days / The Last Showgirl / The Brutalist)",
        "content": "# New Theatrical Releases\n\n[Wolf Man](https://old.reddit.com/r/movies/comments/1i36wh1/official_discussion_wolf_man_spoilers/?)\n\n[One of Them Days](https://old.reddit.com/r/movies/comments/1i36wmw/official_discussion_one_of_them_days_spoilers/?)\n\n[The Last Showgirl](https://old.reddit.com/r/movies/comments/1i36wob/official_discussion_the_last_showgirl_spoilers/?)\n\n[The Brutalist](https://old.reddit.com/r/movies/comments/1i37yra/official_discussion_the_brutalist_spoilers/?)\n\n# Streaming Releases\n\n[Wallace &amp; Gromit: Vengeance Most Fowl](https://old.reddit.com/r/movies/comments/1hsvowt/official_discussion_wallace_gromit_vengeance_most/?)\n\n# Still in Theaters\n\n[Den of Thieves 2: Pantera](https://old.reddit.com/r/movies/comments/1hxuwnk/official_discussion_den_of_thieves_2_pantera/?)\n\n[Better Man](https://old.reddit.com/r/movies/comments/1hxuwpf/official_discussion_better_man_spoilers/?)\n\n[A Complete Unknown](https://old.reddit.com/r/movies/comments/1hlsi27/official_discussion_a_complete_unknown_spoilers/?)\n\n[The Fire Inside](https://old.reddit.com/r/movies/comments/1hlsi3n/official_discussion_the_fire_inside_spoilers/?)\n\n[Nosferatu](https://old.reddit.com/r/movies/comments/1hmffh4/official_discussion_nosferatu_2024_spoilers/?)\n\n[Babygirl](https://old.reddit.com/r/movies/comments/1hmffj8/official_discussion_babygirl_spoilers/?)",
        "upvotes": 38,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1i36zgg/official_discussion_megathread_wolf_man_one_of/"
    },
    {
        "id": "1i5gax3",
        "author": "ToranjaNuclear",
        "title": "What are the most dangerous documentaries ever made? As in, where the crew exposed themselves to dangers of all sorts to film it?",
        "content": "Somehow I thought this would be a very easy thing to find, I would look it up on google and find dozens of lists but...somehow I couldn't? I did find [one list](https://www.gamesradar.com/10-dangerous-documentaries/), but it seems to list documentaries about dangerous things rather than the filming itself being dangerous for the most part.\n\nI guess I wanted the equivalent of [Roar](https://en.wikipedia.org/wiki/Roar_(film)) or [Aguirre](https://en.wikipedia.org/wiki/Aguirre,_the_Wrath_of_God), but as a documentary. Something like [The Act of Killing](https://en.wikipedia.org/wiki/The_Act_of_Killing), or a youtube documentary I saw years ago of a guy that went to live among the cartel.",
        "upvotes": 1130,
        "comments": 480,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/P7XDJ9yrtW94yx8TfWYZbJkdjTJWUgbWOdqQ602lzoA.jpg?auto=webp&amp;s=dbe22dcf8e127421ae0ee835015254b8e2045060"
        },
        "permalink": "/r/movies/comments/1i5gax3/what_are_the_most_dangerous_documentaries_ever/"
    },
    {
        "id": "1i5h7vr",
        "author": "CalSwete",
        "title": "Movies to make 11 year old cry ",
        "content": "Hello,\n\nMy daughter (11f) and her friend (11f) are having a sleepover. They want to watch a movie to make them cry. So far we have tried A walk to Remember, Bridge to Terebithia, Titantic, the notebook, Marley and Me. No tears or anything. Just laughter. I think these girls have no souls. Any suggestions? We have to keep it pg-13 and below. Thanks! \nEdit for movies I forgot she watched at a different time:\n\n\nForgot they have seen most Disney movies prior- not Fox and the hound so will tell them that. \n\nHave also watched My girl with no tears \n\n\nSecond update: they have decided on Old Yeller. I will let you know. Also I made a mistake and my daughter’s friend cried at the end of A wall to Remember- so it’s just my daughter who has problems. \n\nThird update: they tried old Yeller but couldn’t get into it. Her friend hasn’t seen My girl and my daughter saw it a while ago so they are giving that a shot. \n\nWe watched the preview to Stepmom on Amazon and it wasn’t a real trailer so I couldn’t sell it. \n\nShe also got mad at me because I rounded her up to 11 and she is actually 10.8 years old and wants accurate recommendations based on her correct age. \n\n4th update. They finished my girl. Her friend cried. My daughter said she just couldn’t cry  she wanted to share this picture for all the my girl fans [https://imgur.com/a/dwobAmV](https://imgur.com/a/dwobAmV). Her friend is still crying from it and started crying when she read the speech. So there is hope for her. \n\nI just want to say my daughter has a dark sense of humor and loves to laugh but she is the sweetest kid. She is the first to offer help. Shes very kind and sweet. She helps her teacher during lunch. She also has a strong moral compass and compassion to animals and people. She stands up for her friends and her beliefs and is just a generally a great kid. I’m sure in a few years so will be a crier like me. Thank you all for your suggestions. We will make our way through a lot of these. \n\nI think tomorrow we will do a Schindler’s list family movie night. My husband is thrilled..\n\nI think we will have to do grave of the fireflies tomorrow as well. Lots of suggestions. I haven’t heard of it. ",
        "upvotes": 604,
        "comments": 1600,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/30ToaVLV-n7TsjRkXp4hd-voX7pbxrh9eJy6jM140x4.jpg?auto=webp&amp;s=37cf99d38bc6a3c9c4e454312a68ab1d2d472936"
        },
        "permalink": "/r/movies/comments/1i5h7vr/movies_to_make_11_year_old_cry/"
    },
    {
        "id": "1i523bl",
        "author": "MarvelsGrantMan136",
        "title": "‘Moana 2’ Passes $1 Billion Globally",
        "content": "",
        "upvotes": 4281,
        "comments": 724,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nqnzC5tMGea2KEcZQ8qqRPc-vfyFufSvcbAZeZhnOF0.jpg?auto=webp&amp;s=733db49829f67b2691a27cf0ea42c331cbf00ea0"
        },
        "permalink": "/r/movies/comments/1i523bl/moana_2_passes_1_billion_globally/"
    },
    {
        "id": "1i4zal1",
        "author": "BunyipPouch",
        "title": "Poster for Amazon's 'This Is The Tom Green Documentary' - Directed by Tom Green - It follows Green’s early beginnings in Canada to Hollywood stardom and a full-circle return from L.A. to a rural farm in Canada.",
        "content": "",
        "upvotes": 2579,
        "comments": 350,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/tf6nymsnkyde1.jpeg?auto=webp&amp;s=0fa43af55c8395934fedfb5e89ef160294383a49"
        },
        "permalink": "/r/movies/comments/1i4zal1/poster_for_amazons_this_is_the_tom_green/"
    },
    {
        "id": "1i5fjbe",
        "author": "Ofbatman",
        "title": "The Goonies at 40",
        "content": "Just walked out of a showing of The Goonies. It’s surprising how much it holds up. I’ve gotta say the pacing of the film is everything. No lulls just a story that moves forward with little to no exposition. So funny.\n\nThere’s something about the movies from this time that just grab your attention and don’t let go. Weird Science is the same.",
        "upvotes": 251,
        "comments": 110,
        "media": null,
        "permalink": "/r/movies/comments/1i5fjbe/the_goonies_at_40/"
    },
    {
        "id": "1i51czy",
        "author": "Ok-Competition-1814",
        "title": "Characters who are supposed to be athletes but are really bad at it\n",
        "content": "I'm thinking of Taron Egerton who is introduced in Carry-On as a former track star. Trouble is, he runs like it’s his first day with new legs. Unnatural arm swing, duck feet, it’s a mess. What are some other characters who fit this bill? I imagine the gold standard is still Tim Robbins pitching in Bull Durham. ",
        "upvotes": 1610,
        "comments": 1036,
        "media": null,
        "permalink": "/r/movies/comments/1i51czy/characters_who_are_supposed_to_be_athletes_but/"
    },
    {
        "id": "1i59a85",
        "author": "BunyipPouch",
        "title": "'This is the Tom Green Documentary' - Official Trailer",
        "content": "",
        "upvotes": 486,
        "comments": 103,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/e7EIFedqxzMjvmUG8Qbh7ToPcmL7RGSKbX8Y3PPNSIE.jpg?auto=webp&amp;s=71d53df44f7ea6d485ac715f57db151e7ea79609"
        },
        "permalink": "/r/movies/comments/1i59a85/this_is_the_tom_green_documentary_official_trailer/"
    },
    {
        "id": "1i55f94",
        "author": "MarcoG790",
        "title": "Something I noticed in after many rewatches of Once Upon a Time in Hollywood ",
        "content": "In Once Upon a Time in Hollywood, Steve McQueen talks about Roman Polanski and Sharon Tate’s marital situation and her history with Jay Sebring. McQueen says, “Jay loves Sharon. That's what's up. And he knows, as sure as God made little green apples, that one of these days that Polish prick's [Roman Polanski] gonna fuck things up and when he does, Jay's gonna be there.” \n\nI may be reading into this a little much (or maybe this was obvious) but I just realized that this quote may have more importance than I had initially thought. At the end of the movie, we know that Sharon Tate ultimately survives the Manson murders in contrast to what actually happened. Is it possible that this quote from Steve McQueen may have been Tarantino’s thoughts for how Polanski and Tate’s marriage would have worked out if she had survived? Especially since Polanski has turned out to be an extremely awful person, this may have been the thing that McQueen was pointing to when he said that Polanski’s going to fuck things up one day. \n\nLet me know your thoughts.",
        "upvotes": 472,
        "comments": 68,
        "media": null,
        "permalink": "/r/movies/comments/1i55f94/something_i_noticed_in_after_many_rewatches_of/"
    },
    {
        "id": "1i57yxx",
        "author": "No_Macaroon_7608",
        "title": "The Wailing(2016) is the scariest movie I have seen till now!!",
        "content": "I have watched many horror movies and very rarely I feel scared. But today, after watching The Wailing I am sure that this is the scariest movie I have ever seen. The plot of this movie is absolutely terrifying. Aside from how scary the movie is, the writing in this movie is one of the best ever. Also the acting by little child is simply phenomenal. 5/5 movie.",
        "upvotes": 154,
        "comments": 59,
        "media": null,
        "permalink": "/r/movies/comments/1i57yxx/the_wailing2016_is_the_scariest_movie_i_have_seen/"
    },
    {
        "id": "1i5b9rd",
        "author": "Draxtonsmitz",
        "title": "What are some trilogies or series where the middle movies are better than the original?",
        "content": "Star Wars OT jumps out as I think the popular consensus is that Empire is better than New Hope. What are some other series where the second is better than the first?\n\nI’ve never seen The Godfather movies, it’s just never come up or happens, but I always hear the second is the best one. \n\nWhat are some other series where the second is better than the first?",
        "upvotes": 71,
        "comments": 433,
        "media": null,
        "permalink": "/r/movies/comments/1i5b9rd/what_are_some_trilogies_or_series_where_the/"
    },
    {
        "id": "1i5lj3l",
        "author": "UnderstandingFun8976",
        "title": "What is the hardest you’ve ever cried in a movie?",
        "content": "I’m a massive movie crier so I’ve cried during a LOT of movies. However, I’ll never forget the first time I watched Aftersun. As soon as the Under Pressure scene began and I realised what was implied, I felt like I’d been hit by a truck and cried for hours lol.\n\nIs there a movie that hit you so hard you’ll never forget the emotions you felt while watching it?",
        "upvotes": 13,
        "comments": 77,
        "media": null,
        "permalink": "/r/movies/comments/1i5lj3l/what_is_the_hardest_youve_ever_cried_in_a_movie/"
    },
    {
        "id": "1i5h5z3",
        "author": "ReallyAsleep",
        "title": "Films to get lost in the atmosphere of?",
        "content": "I don’t exactly know what type of film this is, just that in these cases the story comes second and the vibes come first. Some atmospheric films like this I really enjoyed are tinker tailor soldier spy (2011), both Bladerunners, Prisoners, The Assassination of Jesse James by the Coward Robert Ford, and just about every David Fincher film.",
        "upvotes": 25,
        "comments": 94,
        "media": null,
        "permalink": "/r/movies/comments/1i5h5z3/films_to_get_lost_in_the_atmosphere_of/"
    },
    {
        "id": "1i524jr",
        "author": "indiewire",
        "title": "‘The Straight Story’ May Lack David Lynch’s Signature Darkness, but It Led to His Eerie Masterworks",
        "content": "",
        "upvotes": 204,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8oSlGnaWfNHrx1juBn90GfdMzJs7YQ4FXAoD-Nn495o.jpg?auto=webp&amp;s=6b803b81804787d2c8b8119b3ba31934d3265af2"
        },
        "permalink": "/r/movies/comments/1i524jr/the_straight_story_may_lack_david_lynchs/"
    },
    {
        "id": "1i51yul",
        "author": "tnick771",
        "title": "Was 2000-09 an exceptional decade for movies?",
        "content": "I’ve been rewatching a lot of movies from that time period and I’m curious if it’s my nostalgia for when I was growing up making me think it was truly an exceptional span, or if there was something magical happening. \n\nTo briefly summarize: \n\n* 2000: Gladiator, Memento, Crouching Tiger, Hidden Dragon, Almost Famous, American Psycho, The Patriot, O Brother, Where Art Thou?\n* 2001: The Lord of the Rings: The Fellowship of the Ring, Harry Potter and the Sorcerer’s Stone, Shrek, A Beautiful Mind, Donnie Darko, Spirited Away, The Royal Tenenbaums\n* 2002: The Lord of the Rings: The Two Towers, Harry Potter and the Chamber of Secrets, Spider-Man, The Bourne Identity, Catch Me If You Can, Signs, City of God\n* 2003: The Lord of the Rings: The Return of the King, Finding Nemo, Pirates of the Caribbean: The Curse of the Black Pearl, Kill Bill: Vol. 1, Lost in Translation, X2: X-Men United, The Last Samurai\n* 2004: Eternal Sunshine of the Spotless Mind, The Incredibles, Harry Potter and the Prisoner of Azkaban, Spider-Man 2, Mean Girls, The Aviator, Shaun of the Dead\n* 2005: Batman Begins, Harry Potter and the Goblet of Fire, Pride &amp; Prejudice, Brokeback Mountain, Sin City, The Chronicles of Narnia: The Lion, the Witch and the Wardrobe, Walk the Line\n* 2006: The Departed, Pan’s Labyrinth, Casino Royale, The Prestige, Children of Men, Little Miss Sunshine, Borat\n* 2007: No Country for Old Men, There Will Be Blood, Ratatouille, Harry Potter and the Order of the Phoenix, The Bourne Ultimatum, Superbad, Zodiac\n* 2008: The Dark Knight, Iron Man, WALL-E, Slumdog Millionaire, The Curious Case of Benjamin Button, Twilight, In Bruges\n* 2009: Avatar, Inglourious Basterds, The Hangover, Up, The Hurt Locker, Zombieland, District 9\n\nI mean just look at 2007..!\n\nHowever, I suspect if you pick any 10-year span in modern movie history you can come up with a similarly impressive list?\n\nOn the contrary – it was also the golden age of CGI and brought two of the most successful film franchises in history – Lord of the Rings and Harry Potter – to the screen. \n\nCurious what other opinions are. ",
        "upvotes": 142,
        "comments": 187,
        "media": null,
        "permalink": "/r/movies/comments/1i51yul/was_200009_an_exceptional_decade_for_movies/"
    },
    {
        "id": "1i512z5",
        "author": "evilsir",
        "title": "What's A Sequel That Made You Rethink Your Opinion of The Original?",
        "content": "For me, it's Smile 2. I went into it with some hesitation because i remember definitely not caring very much  for the original, but I am a sucker for horror movies. Long story short, i really liked Smile 2 an awful lot &gt;!especially  the ending, which was super insane and unexpected.!&lt;\n\nSo I rewatched the original Smile and was pleasantly surprised that my attitude towards it had changed quite a bit.\n\nso like i asked, which sequel have you seen that changed your mind about the original?",
        "upvotes": 134,
        "comments": 316,
        "media": null,
        "permalink": "/r/movies/comments/1i512z5/whats_a_sequel_that_made_you_rethink_your_opinion/"
    },
    {
        "id": "1i58zx1",
        "author": "HotOne9364",
        "title": "Alice in Wonderland (1949)",
        "content": "It's more Tim Burton than the Tim Burton adaptation!",
        "upvotes": 38,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/uJ-Ub2WoKPD2KxyxDCwMBT-Z0xJK-evRNMtv_OYZz-c.jpg?auto=webp&amp;s=cc9be7a4025100de86c041706d73b530d8105c91"
        },
        "permalink": "/r/movies/comments/1i58zx1/alice_in_wonderland_1949/"
    },
    {
        "id": "1i58hvr",
        "author": "Acrable_",
        "title": "Rush Hour Series",
        "content": "I just rewatched the Rush Hour series and man am I feeling nostalgic right now! The chemistry between Jackie Chan and Chris Tucker is unbeatable, and the action scenes are still so thrilling. Plus, the humor is timeless and always makes me laugh. It's such a classic series that never gets old, and the blend of comedy and action is just perfect. I love how each movie keeps you on the edge of your seat while also delivering so many laughs. Truly one of the best buddy cop franchises out there!",
        "upvotes": 41,
        "comments": 29,
        "media": null,
        "permalink": "/r/movies/comments/1i58hvr/rush_hour_series/"
    },
    {
        "id": "1i4lei3",
        "author": "BunyipPouch",
        "title": "Questlove To Direct ‘SNL’ Music Documentary For NBC - Titled ’50 Years of SNL Music’, the three-hour special will feature untold stories behind the culture-defining, groundbreaking and newsmaking musical performances, sketches and cameos of the past 50 years of SNL.",
        "content": "",
        "upvotes": 1526,
        "comments": 96,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qGBSc_yp6KfKdtMoETgT0FcIOmMpGl1hQOPeajly04g.jpg?auto=webp&amp;s=541ad19e1ae9ec2193eb29febc7e8a3b50a31296"
        },
        "permalink": "/r/movies/comments/1i4lei3/questlove_to_direct_snl_music_documentary_for_nbc/"
    },
    {
        "id": "1i5jgaf",
        "author": "TigerTerrier",
        "title": "I just learned that Del originally had a longer speech in 'Planes, Trains, and Automobiles' at the end",
        "content": "I saw a clip with Steve Martin talking about it and found the movie script. Starting on page 119 where Del gives a longer explanation about his wife dying and him being alone. It absolutely broke my heart to read. Did yall know about this? And what do you think? \n\nhttps://assets.scriptslug.com/live/pdf/scripts/planes-trains-and-automobiles-1987.pdf…",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1i5jgaf/i_just_learned_that_del_originally_had_a_longer/"
    },
    {
        "id": "1i5iegl",
        "author": "LollipopChainsawZz",
        "title": "How Greta Gerwig and IMAX Got Netflix to Flinch on ‘Narnia’ Release",
        "content": "",
        "upvotes": 6,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XlWyn-t8einw7RBEnbFzw2_Lv-f0reU4Dg9OSREnk14.jpg?auto=webp&amp;s=72c795e0eb519639f82c665fdefa470d7df70a2d"
        },
        "permalink": "/r/movies/comments/1i5iegl/how_greta_gerwig_and_imax_got_netflix_to_flinch/"
    },
    {
        "id": "1i5dcz0",
        "author": "Early-Piano2647",
        "title": "The score in The Wizard of Oz is incredible",
        "content": "Hats off to the composer, sometimes I’ll listen to it on its own and think ‘how does someone come up with this’. I think it won the Oscar, and honestly I can see why. It’s so complicated and detailed. Also makes me think how this detail is lacking in modern scores thanks to the use of electronics. Would like to see a balance between the two.",
        "upvotes": 14,
        "comments": 11,
        "media": null,
        "permalink": "/r/movies/comments/1i5dcz0/the_score_in_the_wizard_of_oz_is_incredible/"
    },
    {
        "id": "1i5l1z9",
        "author": "ExplainOddTaxiEnding",
        "title": "What are some must-watch David Lynch short films?",
        "content": "Firstly R.I.P. to David Lynch and God rest his beautiful soul.\n\nI've never watched a Lynch movie yet and I decided I'm going to watch all of them (or atleast the most popular ones).\n\nI was about to watch Blue Velvet today but thought I should watch some of his short films to get into the right mood.\n\nSo what short films of his would you say are worth watching before watching his feature lenght films to get into the mood? Or what are his best short films in your opinion?\n\nThanks for listening and for your answers!",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/movies/comments/1i5l1z9/what_are_some_mustwatch_david_lynch_short_films/"
    },
    {
        "id": "1i4prm0",
        "author": "bjclements",
        "title": "What movie had a terrible trailer but ended being very good?",
        "content": "What movie had a terrible trailer but ended up being surprisingly good? One that comes to mind is Speak No Evil (2024). Its trailer was so obnoxious it practically became a meme, yet the movie itself turned out to be awesome. What are some other examples of films with misleading or off-putting trailers that defied expectations?",
        "upvotes": 461,
        "comments": 610,
        "media": null,
        "permalink": "/r/movies/comments/1i4prm0/what_movie_had_a_terrible_trailer_but_ended_being/"
    },
    {
        "id": "1i5kken",
        "author": "LieWalker",
        "title": "Tell me a scene where a character is expecting to be proposed to, but ends up being broken up with.",
        "content": "I need to find a scene like the one in Legally Blonde where Elle expects to be proposed to, but ends up being dumped. The older the better but anything would work at this point. The most important point being that a character is expecting a proposal, but ends up being broken up with.\nReference:\nhttps://youtu.be/sij4r12cVHo?si=RLX75ZxNWwaPAN64\n",
        "upvotes": 2,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sbuwAOFJ8r1Sf1rjwyoiVPp3QdM011UJYbGH5pnA8Sk.jpg?auto=webp&amp;s=6863160d1d47b5e638e076d69bd6b50dc33b7220"
        },
        "permalink": "/r/movies/comments/1i5kken/tell_me_a_scene_where_a_character_is_expecting_to/"
    },
    {
        "id": "1i4i4kr",
        "author": "Mst3Kgf",
        "title": "Among \"The Sandlot's\" many virtues, I really like how it doesn't go the \"underdog team comes together to win championship\" approach so prominent in the 90s. Indeed, it gleefully subverts that.",
        "content": "The 90s especially liked using that storyline in kids sports movies, in no small part thanks to the success of \"The Mighty Ducks.\" But \"The Sandlot\" has none of that, as the whole point of the titular baseball field is that the gang of friends who use it have an endless game that they play themselves with no organization save their own. There is no championship to win, it's just kids having fun. And while there is the subplot with the snobby Little League team midway through the film, it's just one of several episodes in the film's storyline and the film gleefully subverts the \"championship game\" by having it be a completely one-sided affair where the gang crushes the Little Leaguers (in no small part due to Ham's trash talking behind the plate). It's another way \"The Sandlot\" is such an endearing classic. Championship games are not nearly as important as saving the Baby Ruth ball from the Beast.",
        "upvotes": 1411,
        "comments": 90,
        "media": null,
        "permalink": "/r/movies/comments/1i4i4kr/among_the_sandlots_many_virtues_i_really_like_how/"
    },
    {
        "id": "1i58sza",
        "author": "dvsinla",
        "title": "Any Cannon Films fans out there? I caught an exploitation drama called Crack House 1989 at a midnight screening last night. Hilarious. ",
        "content": "It's also on Tubi. \n\nCannon was this amazing low budget independent film company 70s through the 90s. There's 2 docs on them called *Electric Boogaloo: The Wild, Untold Story of Cannon Films* and *The Go-Go Boys: The Inside Story of Cannon Films*.\n\nThey made probably 600-700 movies... a few oscar nominated ones like Runaway Train... but a lot of fun or bad cheezy action exploitation films like the Charles Bronson ones in the 80s, Chuck Norris movies... and some amazing cheezy musicals like Breakin 2 electric boogaloo and the infamous The Apple\n\nso last night I was able to go see one of the lesser later ones (they released didn't produce) as they were winding down their run...  called Crack House from 1989. From the director of Death Spa.\n\nAbsolutely hilarious. \n\nIt's about a little high school white girl living in the hood that's been destroyed by gangs and drugs, dating an ex gang member and she's gonna be a designer and get out of there.  \n\nthen the spiral begins... “oh My boyfriend is now in jail. my drunk mom doesn’t care.  I’m gonna start dating the high school drug dealer.   \n  \nOh let me try some crack now I need more crack. I'm hooked on crack.   \n  \noh my grades have fallen and my guidance counselor is the drug supplier and now I have to strip for him to get a fix.   \n  \noh I’m kidnapped by the Big drug kingpin and I’m now his slave sex whore. What has happened to my life? “  \n  \nit's like an exploitation after school special, Also part of the fun is the older experienced cast with Richard Roundtree and Jim Brown as the cop and drug kingpin. Anyone ever see this?  ",
        "upvotes": 20,
        "comments": 21,
        "media": null,
        "permalink": "/r/movies/comments/1i58sza/any_cannon_films_fans_out_there_i_caught_an/"
    },
    {
        "id": "1i48xc8",
        "author": "bigdicks415",
        "title": "Why are there literally hundreds of WW2 Nazi movies, but only a handful of ones about the Japanese?",
        "content": "I feel like there are probably more WW2 Nazi movies than any other genre. by comparison I can only think of may be 5 or 6 about the Japanese .\n\nWhy such the disparity?\n\nFor one it's a bit disingenuous and disrespectful to portray WW2 as a purely European conflict.  And from a strictly entertainment standpoint, you could write up a million different scripts that would put Private Ryan to shame.\n\nAlso, the few movies I have seen about Japanese in WW2 tend to portray them as noble warriors when in reality they were every bit as evil and diabolical as the Nazis, and committed some of the worst atrocities of the last hundred years.  \n\nTheir treatment of POWs was also probably the worst fates suffered during any US military war. They would literally mass execute captured soldiers and sailors, often by beheading....\n\nWhy is there no Inglorious Bastards Japanese version to date?",
        "upvotes": 5367,
        "comments": 1850,
        "media": null,
        "permalink": "/r/movies/comments/1i48xc8/why_are_there_literally_hundreds_of_ww2_nazi/"
    },
    {
        "id": "1i5eoze",
        "author": "Both_Sherbert3394",
        "title": "I watched an obscure movie from the 70s called 'The Noah' that I found on Vimeo",
        "content": "So I had made a post a few weeks ago looking for films that fit into a weird sub genre that I wasn't exactly sure how to identify, but basically films about apocalyptic events that take place away from the core of the action; as in, a traditional apocalypse movie would be something like *The Day After Tomorrow*, whereas I was more interested in things like *Invasion of the Body Snatchers*. *Knock at the Cabin* would also be a more recent example of this.\n\nSomeone mentioned *The Noah* from 1975, and I have no idea how they knew about it, because even with no view count, the Vimeo post has exactly three likes and one comment. It has just over 400 ratings on IMDb, and was reportedly made for just $200,000. Word to the wise, if you find a weird 70s movie and the budget is less than half a million, chances are you're gonna get some good shit. \n\nBasically the entire film is Robert Strauss, a soldier who survived a war we know nothing about, other than that everyone outside this island is dead. The whole film is just about him inventing these imaginary people in his head, represented by voices he responds to but are never visually shown. He eventually grows his imaginary world, which we hear but never see, creating a really interesting experience that wasn't quite like anything I've seen before.\n\nI won't give away the entire thing, because it really was a pretty memorable experience, but it was just nice to see something so different and out of the box. Curious if anyone's ever come across this one.",
        "upvotes": 9,
        "comments": 4,
        "media": null,
        "permalink": "/r/movies/comments/1i5eoze/i_watched_an_obscure_movie_from_the_70s_called/"
    },
    {
        "id": "1i4jutn",
        "author": "onlysortofintothis",
        "title": "Just realizing Road Trip is based on The Odyssey",
        "content": "I saw a Road Trip poster and just realized it's a college-movie version of The Odyssey.\n\nIt's been awhile so there may be more connections, but:\n\n- Tom Green tells the story to a bunch of students, like a Greek storyteller\n\n- The main guy is trying to get to Ithaca (Odysseus' kingdom he's trying to return to)\n\n- His Queen had suitors trying to get her attention, and the main guy is worried about his girlfriend and other men\n\n- All the hijinks on the trip are humorous parallels to all the obstacles Odysseus and his men encountered\n\nMaybe I'm the only person that cares and likes making these connections, but thought I'd share just in case :)\n\nEDIT: Some people have corrected some details in comments, which is fair because it's been 20+ years since I've watched it. But the motifs are still there :)",
        "upvotes": 786,
        "comments": 139,
        "media": null,
        "permalink": "/r/movies/comments/1i4jutn/just_realizing_road_trip_is_based_on_the_odyssey/"
    },
    {
        "id": "1i53lo3",
        "author": "mayukhdas1999",
        "title": "First Image from 'ANCESTRAL VISIONS OF THE FUTURE'. A film by Lemohang Jeremiah Mosese ('This Is Not a Burial, It’s a Resurrection')",
        "content": "",
        "upvotes": 25,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/946t9wt3hzde1.jpeg?auto=webp&amp;s=c27926a9b6f5701cbcbbd0129f794bd280bdb790"
        },
        "permalink": "/r/movies/comments/1i53lo3/first_image_from_ancestral_visions_of_the_future/"
    }
]