[
    {
        "id": "1ggzmq2",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://t.me/+K_tQ4Zzi0S80YjFk): Gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[LA TAVERNA DELLO STUDENTE](https://t.me/latavernadellostudente/5207): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g30QJSClHjRAUvFBqKJa-Re4duFBniS6HkLBoJRdgOQ.jpg?auto=webp&amp;s=2c44cf9a902b77de7dce3b5cad542f22791fb32e"
        },
        "permalink": "/r/torino/comments/1ggzmq2/la_piola_friends_meetup/"
    },
    {
        "id": "1ggzmpq",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram group for apartment hunting: https://t.me/CaseStudentiTorino\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1ggzmpq/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1gph2p4",
        "author": "AggressiveHelp5215",
        "title": "studenti sui vent'anni che cerchino nuove amicizie? / bachelor students who are looking for friends?",
        "content": "Io sono uno studente squattrinato fuorisede del primo anno, a Torino da poco e in cerca di nuove conoscenze in questa magnifica città. \n\nMi piace lo sport, andare in bici (non a Torino dove me la scavallerrebbero prima di comprarla), le escursioni in montagna, la storia, andare al mare, il gelato, le lasagne, provo il massimo piacimento quando ci si cala nel proprio ruolo nei giochi/giochi da tavolo cosi tanto da prendersela sul personale ed insultarsi a vicenda tra amici, mi alleno in palestra (trovare il gymbro a torino non sarebbe male), dibattere e parlare dei temi più disparati, e, nutro da sempre un' insaziabile sete di scoperta verso nuovi paesi, culture e luoghi da esplorare (spendendo il meno possibile).",
        "upvotes": 11,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1gph2p4/studenti_sui_ventanni_che_cerchino_nuove_amicizie/"
    },
    {
        "id": "1gptr81",
        "author": "Musicistherapy_",
        "title": "Sushi",
        "content": "Buonasera, non sono di torino centro per questo ho seriamente bisogno di consigli di un buon sushi in centro. Mi raccomando, il sushi migliore che conoscete. Un sushi che sia un bel locale, magari un po’ “elegante” e romantico. Grazie",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1gptr81/sushi/"
    },
    {
        "id": "1gptess",
        "author": "CryingAlwaysCrying",
        "title": "Cerco un Consiglio per uno Psicologo a Torino",
        "content": "Ciao a tutti!\n\nMi sono appena trasferito a Torino e sto cercando uno psicologo (inglese / spagnolo). Vorrei una persona che abbia un approccio accogliente e con cui mi senta a mio agio. Se avete qualche consiglio o sapete dove potrei trovare un professionista affidabile, vi sarei davvero grato!\n\nGrazie mille in anticipo!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1gptess/cerco_un_consiglio_per_uno_psicologo_a_torino/"
    },
    {
        "id": "1gprwvd",
        "author": "fableafy_fr",
        "title": "triennale unito, magistrale polito ",
        "content": "attualmente sono al secondo anno di triennale sotto UniTo e sto frequentando un corso L-18. Potrei fare una magistrale sotto PoliTo inerente a ciò che ho studiato in triennale? perchè mi pare di capire che sia possibile ma non riesco a capire quanto sia effettivamente difficile nella pratica e di preciso quali limitazioni ci sono.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1gprwvd/triennale_unito_magistrale_polito/"
    },
    {
        "id": "1gplqid",
        "author": "human_sam_",
        "title": "Posti simili al Comala nel resto d'Europa?",
        "content": "Sembra una cavolata, ma il motivo per cui non riesco a cercare/accettare lavoro all'estero è il non sapere se ci sarà un posto come il Comala xD  \nConoscete qualcosa di simile in giro?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1gplqid/posti_simili_al_comala_nel_resto_deuropa/"
    },
    {
        "id": "1gordji",
        "author": "PuzzleheadedHotel406",
        "title": "Fanculo servizio GTT",
        "content": "Servizio più di merda non lo ho mai visto.\nHo vissuto in campagna per 17 anni, dove passavano sì e no 2 bus all'ora, ed il servizio mi ha comunque soddisfatto sempre di più rispetto a quello di questa città.\n\nBus che non arrivano mai e pieni fino a quando la gente a bordo non si fa male, rotti e sporchi (a volte non si può manco bippare perché i macchinari a bordo so spaccato o non funzionano), abbonamenti dai prezzi in aumento ma che offrono MENO rispetto a prima, continui scioperi e assenze di servizi per misteriosi \"lavori\" che non avvengono mai...\n\nAh, e la gente di merda che non sa comportarsi sopra è la ciliegina sulla torta, anche se lì purtroppo non è colpa della GTT.\nPurtroppo, dico, perché mi piacerebbe poterli insultare ancora di più.",
        "upvotes": 97,
        "comments": 45,
        "media": null,
        "permalink": "/r/torino/comments/1gordji/fanculo_servizio_gtt/"
    },
    {
        "id": "1gpcvfb",
        "author": "flying_stingray",
        "title": "Classical music concerts in Torino",
        "content": "Hello mortals and immortals. Is there any classical music enthusiast here? I am searching for some related info and found teatro regio(more of opera and ballet, play?), lingotto musica(I found their programm is charming), rai auditorium, unione musicale. Where do you usually get news and update? Any website to see all the upcoming event in Torino? Which hall is the best/your favorite? My Italian is mere and sad so the search result is not the finest either. If you have any tips and tricks to nourish this vagabond's music life please feel free to share. Grazie mille.",
        "upvotes": 2,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1gpcvfb/classical_music_concerts_in_torino/"
    },
    {
        "id": "1gpp59u",
        "author": "Winter-Western-8526",
        "title": "UNITO CONSIGLI ESAMI",
        "content": "Ciao, mi piacerebbe che qualcuno mi consigliasse degli esami di Unito per i crediti liberi in cui si riesce a copiare facilmente. Esami da 6/10 crediti. Grazie",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1gpp59u/unito_consigli_esami/"
    },
    {
        "id": "1gosg1q",
        "author": "davves12",
        "title": " Nuove amicie a Torino ",
        "content": "Ciao a tutti, sono un ragazzo di 29 anni che si è trasferito a Torino 5 anni fa. Da allora, complici vari motivi tra cui il mio carattere introverso, non sono riuscito a crearmi nessuna amicizia in questa città. Mi dispiace perché in realtà una volta che mi trovo a mio agio divento una persona molto aperta.\n\nMi farebbe davvero piacere trovare qualcuno/a con interessi simili con cui poter uscire in centro, fare passeggiate in montagna, visitare musei, fare qualche gioco da tavola o più banalmente chiacchierare del più e del meno :)\n\nDove fare amicizia a Torino? Oppure, se anche voi cercate nuove amicizie, scrivetemi pure! Mi farebbe piacere conoscere persone con interessi simili e creare un gruppo per uscire e divertirsi insieme!",
        "upvotes": 16,
        "comments": 19,
        "media": null,
        "permalink": "/r/torino/comments/1gosg1q/nuove_amicie_a_torino/"
    },
    {
        "id": "1gozt3h",
        "author": "CryingAlwaysCrying",
        "title": "Cinemas in Torino that screen films in the original language?",
        "content": "Ciao a tutti!\n\nI recently moved to Torino and am hoping to find cinemas that screen films in their original language with Italian subtitles. After hearing “Il Gladiatore II” one too many times, I’m on the verge of giving up! 😅\n\nI’ve tried Cityplex, The Space, and a few others, but they only seem to show a couple of movies in the original language, often with limited screenings.\n\nIf anyone knows of cinemas in Torino that regularly screen films in English (or other original languages) — or specific days/times to catch these — I’d love any recommendations!\n\nGrazie mille in advance!",
        "upvotes": 6,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1gozt3h/cinemas_in_torino_that_screen_films_in_the/"
    },
    {
        "id": "1gomoe4",
        "author": "CarelessArm2623",
        "title": "Borseggio a Porta Susa, ho la foto del ladro ma non so chi è la borseggiata",
        "content": "Domenica sera verso le 18 io e la mia ragazza abbiamo assistito ad un borseggio di un portafoglio rosa a danno di una signora con lo zaino bianco che saliva sul bus alla fermata XVIII Dicembre (mi pare fosse il 10N).\n\nIl tempo che la mia ragazza me lo facesse notare e il bus era già partito. Non sono riuscito a farmi restituire il portafoglio ma ho avuto l’idea brillante di fotografare il ladro; ricevendo poi le sue minacce.\n\nSe conoscete qualcuno che corrisponde alla dinamica e sta esponendo denuncia mi contatti. ",
        "upvotes": 36,
        "comments": 29,
        "media": null,
        "permalink": "/r/torino/comments/1gomoe4/borseggio_a_porta_susa_ho_la_foto_del_ladro_ma/"
    },
    {
        "id": "1gos84m",
        "author": "Tetraidropolaf",
        "title": "Collettivi fotografici",
        "content": "Ciao a tutti! Ho 23 anni e mi sono appena trasferito a Torino per l'università. Sono appassionato di fotografia, soprattutto di paesaggi, natura e macro, e sto cercando di conoscere gente nuova con questa stessa passione. Volevo chiedere se conoscete collettivi fotografici o associazioni in città dove potersi unire e magari partecipare a qualche progetto o uscita insieme.\n\nE allargo anche l'invito alla community di Reddit: se c'è qualcuno che ama la fotografia e ha voglia di fare qualche scatto o esplorare insieme, mi farebbe piacere! :)",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1gos84m/collettivi_fotografici/"
    },
    {
        "id": "1goa4zf",
        "author": "vartdesign",
        "title": "Ragazze Torino ",
        "content": "Ciao! Mi chiamo Bianca e ho 24 anni. Vorrei ampliare le mie conoscenze facendo amicizia con ragazze della mia età. \nSono una ragazza timida e un pochino introversa, ciò mi ha portato a non crearmi delle occasioni per conoscere nuove persone. \nAttualmente lavoro, ma la mia passione é l'illustrazione grafica e l'arte, cui mi sto autoformando per poter essere in un futuro presto la mia professione. \nScrivetemi pure!",
        "upvotes": 12,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1goa4zf/ragazze_torino/"
    },
    {
        "id": "1googcn",
        "author": "Jumpy-Ingenuity3082",
        "title": "Dopocena a Torino",
        "content": "Ciao a tutti, sono nuova in città e in settimana è il mio compleanno. Vorrei organizzare un dopocena, magari con una torta e qualche bottiglia, in un locale con musica di sottofondo o karaoke, ma anche con giochi da tavolo. Sapreste consigliarmi qualche posto carino e che non mi richieda un rene? Saremo circa 8 persone. Valuto qualsiasi zona, facilmente raggiungibile con i mezzi (preferibilmente quadrilatero/ San salvario). Grazie ❤️",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1googcn/dopocena_a_torino/"
    },
    {
        "id": "1go8tvu",
        "author": "MSH_KillerElite",
        "title": "Italian language Class/Courses",
        "content": "Hello, Coming to Torino and was wondering is there any cheap or free classes for learning Italian !?  \nI really like it to be in person and in a class, not online.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1go8tvu/italian_language_classcourses/"
    },
    {
        "id": "1gofhka",
        "author": "arminredditer",
        "title": "Car sharing Torino",
        "content": "Quali app di car sharing si possono usare a Torino? So di Enjoy, ma vedo recensioni terrificanti. Ce ne sono altre? Sto cercando qualcosa per mantenere l'abitudine alla guida una volta che avrò ripreso a guidare",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1gofhka/car_sharing_torino/"
    },
    {
        "id": "1go78dp",
        "author": "Realistic_Exam_6242",
        "title": "Nuovo in Torino, in cerca di nuovi amici e conoscenze",
        "content": "Ciao! 32enne nuovo in città in cerca di nuovi amici e conoscenze.\n\nHobbies/passioni: arrampicata in palestra (BSide, Sasp), specialty coffee (filtro), basket (male), concerti e giochi da tavolo. Se anche tu sei in cerca di nuove conoscenze e condividi qualcuna delle mie passioni, scrivimi!\n\n\\_\\_\\_\\_\\_\\_\n\nHey! 32yo just landed in town is looking for new friends to hang out with\n\nHobbies: indoor bouldering (BSide, Sasp), specialty coffee (filter), basketball (for fun), gigs e tabletop games. If you're also new and looking for new friends to hang out with, do say hi!",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1go78dp/nuovo_in_torino_in_cerca_di_nuovi_amici_e/"
    },
    {
        "id": "1gobr34",
        "author": "Zestyclose_Ant4248",
        "title": "How can i get accepted in polito",
        "content": "im in ib student taking physics math econ hl and i was predicted a 33/44 (5 5 6) and im going to repeat my sat soon, how much should i get to get accepted?",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1gobr34/how_can_i_get_accepted_in_polito/"
    },
    {
        "id": "1gnxdln",
        "author": "Academic-Wave-2596",
        "title": "Caffè Per Studiare ",
        "content": "Hello guys! I'm looking for a coffee place or biblioteca to study today. Wanted to change a bit and want to be out of home for a while hahaha \n\nI hear your opinions and recommendations! If possible if you have something not that expensive would be good... I'm just a student :$\n\nGrazie!",
        "upvotes": 8,
        "comments": 19,
        "media": null,
        "permalink": "/r/torino/comments/1gnxdln/caffè_per_studiare/"
    },
    {
        "id": "1go426g",
        "author": "davidekilla",
        "title": "Igiene dentale a Torino",
        "content": "Buonasera, sono uno studente fuorisede e avrei bisogno di fare un’igiene dentale.\nSapreste consigliarmi dei buoni dentisti/studi dentistici preferebilmente in zona politecnico (o comunque raggiungibile con i mezzi pubblici) che non chiedano un occhio alla testa? Grazie in anticipo!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1go426g/igiene_dentale_a_torino/"
    }
]