[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 488,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1haf6gm",
        "author": "netflix",
        "title": "Netflix received 36 Golden Globes nominations!\n\nCongratulations to Emilia Pérez, Nobody Wants This, Squid Game, Monsters: The Lyle and Erik Menendez Story, Maria, Ripley, Griselda, Black Doves, The Gentlemen, The Diplomat, A Man on the Inside, and Glen Powell who scored his first-ever nomination.",
        "content": "",
        "upvotes": 28,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1haf6gm/netflix_received_36_golden_globes_nominations/"
    },
    {
        "id": "1hhjdin",
        "author": "yesidkwhat1",
        "title": "La Palma and Carry-On",
        "content": "By far some of THE most insane unrealistic pieces of media I’ve ever consumed, not a single thing made any sense and I loved every bit of all of it. Merry Christmas! ",
        "upvotes": 31,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1hhjdin/la_palma_and_carryon/"
    },
    {
        "id": "1hhhi5g",
        "author": "Mu5hroomHead",
        "title": "Every American should watch “If Anything Happens I Love You”",
        "content": "America probably has the highest number of school shootings in the whole world. And every time a school shooting happens, it’s all over the news. It ignites conversations about gun control, etc. But in the end, nothing changes.\n\nThis short film portrays the devastation left behind after everyone forgets and moves on. It beautifully shows the destruction left behind. It’s personal, and it’s raw.\n\nI think everybody should watch this short film, especially Americans. Put yourselves in the situation of the parents…",
        "upvotes": 15,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hhhi5g/every_american_should_watch_if_anything_happens_i/"
    },
    {
        "id": "1hguwkt",
        "author": "GaleSTRIK3",
        "title": "La Palma Was Absolutely Ridiculous ",
        "content": "I NEED to know the math behind this wave because there is no way in hell anyone on that plane is in one piece",
        "upvotes": 554,
        "comments": 173,
        "media": null,
        "permalink": "/r/netflix/comments/1hguwkt/la_palma_was_absolutely_ridiculous/"
    },
    {
        "id": "1hh1ulu",
        "author": "Pogrebnik",
        "title": "The Russo Brothers Unleash Sci-Fi Magic in the First Trailer for Netflix's 'The Electric State'",
        "content": "",
        "upvotes": 114,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1hh1ulu/the_russo_brothers_unleash_scifi_magic_in_the/"
    },
    {
        "id": "1hhgcdi",
        "author": "Alan_Stamm",
        "title": "'The Six Triple Eight' Review: Kerry Washington in Inspiring WWII Drama from Tyler Perry",
        "content": "",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hhgcdi/the_six_triple_eight_review_kerry_washington_in/"
    },
    {
        "id": "1hhmvc9",
        "author": "abhilash512",
        "title": "5 Major Takeaways from WWE Raw on Netflix Kickoff Show",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hhmvc9/5_major_takeaways_from_wwe_raw_on_netflix_kickoff/"
    },
    {
        "id": "1hhiujp",
        "author": "Hjbinatx",
        "title": "Netflix drops all AMC?",
        "content": "This evening on my US Netflix account, all AMC shows say “remind me.”  I was in the middle of watching Fear the Walking Dead and when I exited the app and came back, it was not available. None of my devices have AMC shows available. Anyone else seeing this?\n",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hhiujp/netflix_drops_all_amc/"
    },
    {
        "id": "1hh1m15",
        "author": "baranun",
        "title": "Don't Look Up",
        "content": "Great movie!\n\nI REALLY hope there won't be a giant asteroid coming towards earth in the next 4 years and turn this movie from dark comedy to humanities last documentary.",
        "upvotes": 21,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1hh1m15/dont_look_up/"
    },
    {
        "id": "1hhk3jp",
        "author": "Silver-Vermicelli-15",
        "title": "AU release dates - fail",
        "content": "I've found this a number of times with Netflix when they provide a release date. B/c Australia is ahead of North America the date listed in the app (tv and devices) is incorrect. \n\nFor instance today is the 19th, I've waited weeks for a release which was listed for today...no drop. I'm guessing that come the 19th in the US it'll be available but just a guess.\n\nFor a company as large as Netflix who has bothered with location blocking it seems crazy they can't seem to figure out locales and release dates. \n\nFAIL!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hhk3jp/au_release_dates_fail/"
    },
    {
        "id": "1hhjbhz",
        "author": "MonkeyDingDing",
        "title": "Low volume using iPod minis when watching TV shows?",
        "content": "Haven’t had Netflix since 2020, I only got it again tonight for the 2 x-mas nfl games….\n\nAnyway, might as well test it and use it for a month, but the volume absolutely sucks with the mini’s.  Is that normal?\n\nYTTV, Peacock, ESPN+ and Prime all sound fine.\n\nI’ll have the games go through my surround sound system, but that’s just overkill for me when I want to watch a TV show or 2 in the evening.\n\nAny suggestions, thanks.",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hhjbhz/low_volume_using_ipod_minis_when_watching_tv_shows/"
    },
    {
        "id": "1hhit01",
        "author": "irishjedi115",
        "title": "Brightness issues",
        "content": "I’ve been watching The Ranch today. All of part 4 was completely fine. As soon as I got to part 5 everything was visibly darker. I thought it was just the scene at the start of the episode but as it went on, it didn’t get brighter. I went back to the previous episode and the brightness was perfectly fine. Jumped back to my current episode and it’s still too dark. Any ideas what’s going on?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hhit01/brightness_issues/"
    },
    {
        "id": "1hhc4g5",
        "author": "Andoppy18",
        "title": "Was Walter White a Good Marketer?",
        "content": "",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hhc4g5/was_walter_white_a_good_marketer/"
    },
    {
        "id": "1hhfb2z",
        "author": "Electronic-Fact6618",
        "title": "Help! I can;t seem to download movies and tv shows on my laptop",
        "content": "Title is self explanatory. I am struggling to work out how to download things. I am on a windows 11 laptop and just got Netflix again after a while. If anyone could help me sort it, I would be appreciative.\n\n  \nThanks in advance",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hhfb2z/help_i_cant_seem_to_download_movies_and_tv_shows/"
    },
    {
        "id": "1hhfasf",
        "author": "Sketchtea",
        "title": "Recommend me a good series based on..",
        "content": "I’m looking for a series like arcane, avatar (with the blue people) , re:zero. They all have something in common, pretty sure. Like 2 sides fighting against eachother whilst each side has interesting characters with good lore. Please recommend any series ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hhfasf/recommend_me_a_good_series_based_on/"
    },
    {
        "id": "1hgjpkg",
        "author": "Alan_Stamm",
        "title": "'Carry-On' Review: Decent Airport Thriller [streaming now]",
        "content": "",
        "upvotes": 154,
        "comments": 129,
        "media": null,
        "permalink": "/r/netflix/comments/1hgjpkg/carryon_review_decent_airport_thriller_streaming/"
    },
    {
        "id": "1hhenad",
        "author": "lukmcl",
        "title": "\"This device is not part of your netflix household\"",
        "content": "I get this error when opening netflix, despite the fact that we don't have a home internet connection, and we don't use Netflix on our TV. It only affects 2 of us, however. Any idea why?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hhenad/this_device_is_not_part_of_your_netflix_household/"
    },
    {
        "id": "1hhi10s",
        "author": "Famous_Cricket1107",
        "title": "Someone know how to take screenshots without the reproduction bar",
        "content": "You know, this thing, and by the way the screen turns black when i try to take a screenshot, i have been taken SS before, so i dont know why is black NOW.\n\nhttps://preview.redd.it/c3pub5h9pp7e1.png?width=1777&amp;format=png&amp;auto=webp&amp;s=0e9fcbee9c574923c95d6dad9a80ff062a35bcb4\n\n You guys have any recommendation? i just want to record funny anime reactions and share my fav moments.\n\nI need to remove the red bar and get a clean image.",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hhi10s/someone_know_how_to_take_screenshots_without_the/"
    },
    {
        "id": "1hglzk1",
        "author": "Andoppy18",
        "title": "How Mindhunter’s Marketing Won Critics and True Crime Junkies — But Missed a Mass Audience",
        "content": "",
        "upvotes": 53,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1hglzk1/how_mindhunters_marketing_won_critics_and_true/"
    },
    {
        "id": "1hh9qmy",
        "author": "Royal_Difficulty_678",
        "title": "Films / show with British (or European) academic theme? ",
        "content": "I’m looking for shows with an Oxford/ Cambridge or European academic vibe. Similar to the man who knew infinity set in Cambridge or the ones about Turing and Hawkins.  Modern shows like the 3 body problem set at Oxford are good too. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hh9qmy/films_show_with_british_or_european_academic_theme/"
    },
    {
        "id": "1hh4bsc",
        "author": "FakenFrugenFrokkels",
        "title": "Star Trek TNG, Voyager, Enterprise",
        "content": "Hello Netflix Sub I just discovered! I’ve noticed these titles recently showing back up on my app. Is anyone else seeing this? I’m posting because I get an error message any time I try to play them. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hh4bsc/star_trek_tng_voyager_enterprise/"
    },
    {
        "id": "1hh872c",
        "author": "Yeeting1234",
        "title": "Netflix sharing",
        "content": "If one person of the household is travelling and activates the travel mode (because that person is away from home), can the people still at home keep using netflix?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hh872c/netflix_sharing/"
    },
    {
        "id": "1hh05lz",
        "author": "TechnologyEconomy858",
        "title": "TV error nw-4-7. AND iPhone won't cast thru screen mirror or Netflix app. Does cast thru Chromecast from Pixel",
        "content": "I am stumped.  My wife and I share a Netflix standard account.  She has an iPhone. I have a Pixel.  And we have a 10y/o Sony Bravia TV that is connected via LAN cable to our network.  The TV software is up to date.  The TV has a Chromecast dongle and an Apple TV 'dongle'.  Login functionality has gone waaaaaayy downhill almost across the board and I don't know why.  Not sure if we have one problem or more than one problem.  We didn't change anything.\n\nNetflix app works fine on both our phones.\n\nNetflix will cast to the TV just fine from my phone from within the Netflix app.\n\nNetflix will not cast from her iPhone via screen mirror or from the Netflix app.  When she tries to screen mirror Netflix, it won't let her choose our TV...the device selection is blank.  She can screen mirror all other apps to the TV just fine, so this is only a Netflix issue.\n\nWe tried accessing Netflix from within the Apple TV interface.  She scanned the QR with her phone.  Her phone said she was all set while the Apple TV interface said it had trouble signing her in, Code 113.  Why the mismatch?\n\nNetflix will not start on the TV.  It tries to, then gives an error code nw-4-7.  I've reset the TV Internet content, run the Netflix diagnostics (\"Netflix server 2...nw-4-7\"), reset the Netflix app on the TV, cleared Netflix account cache via online instructions and done everything I can access from within the Netflix app,,the Netflix app on the TV and anything else within the TV ...all to no avail.  I updated our wifi mesh software.   Every other TV app works fine, and we have no trouble with computers or our phones on our wifi.  All network things have been turned off and on to reset.  No connectivity issues were found in TV self diagnostics.\n\nI don't even mind buying a new TV (😂) but based on our symptoms I don't think that will fix the issue.  \n\nThoughts from the group?  Please and thank you 🙂 Happy holidays! ",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hh05lz/tv_error_nw47_and_iphone_wont_cast_thru_screen/"
    },
    {
        "id": "1hhfzhg",
        "author": "Optimal-Topic1830",
        "title": "I know money talks, but I’m so over streaming TV and the constant cancelling of shows.",
        "content": "There should be a rule/law where streaming networks must pick up a show for two seasons, at least, and then can make the decision to cancel it after that. I feel like there are too many shows out there now that were never given the chance to grow its audience. ",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1hhfzhg/i_know_money_talks_but_im_so_over_streaming_tv/"
    },
    {
        "id": "1hgf38t",
        "author": "Njbryan13",
        "title": "La Palma",
        "content": "Is the worst show I’ve ever loved to watch the whole thing of. Omg is the show horrible but lord knows I had to watch it from beginning until the end because of how horribly great it was done. Wtf. ",
        "upvotes": 75,
        "comments": 132,
        "media": null,
        "permalink": "/r/netflix/comments/1hgf38t/la_palma/"
    },
    {
        "id": "1hh52rd",
        "author": "MrPink0612152504",
        "title": "All she needed was the love he gave",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/fsdptsfttm7e1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1hh52rd/all_she_needed_was_the_love_he_gave/"
    },
    {
        "id": "1hgtarz",
        "author": "Zealouscat_94",
        "title": "Carry On",
        "content": "I just watched this movie and something that I wonder about is what happened to the woman with the blue hair? It seemed apparent that she was in on the scheme as well but nothing seemed to happen to her.",
        "upvotes": 9,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1hgtarz/carry_on/"
    },
    {
        "id": "1hg765b",
        "author": "Whobitmyname",
        "title": "Netflix’s One Piece Season 2 Reportedly Wraps Filming",
        "content": "",
        "upvotes": 254,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1hg765b/netflixs_one_piece_season_2_reportedly_wraps/"
    },
    {
        "id": "1hhelup",
        "author": "rachiepants2017",
        "title": "Anyone else enjoying this season of Queer Eye? I love this cast!",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hhelup/anyone_else_enjoying_this_season_of_queer_eye_i/"
    },
    {
        "id": "1hhg0sw",
        "author": "angela4512",
        "title": "Kordell Beckham Reveals Sweet Piece of Advice NFL Star Brother Odell Beckham Jr. Gave Him While Starring on 'Love Island USA'",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hhg0sw/kordell_beckham_reveals_sweet_piece_of_advice_nfl/"
    },
    {
        "id": "1hhhqx4",
        "author": "vibinandtrying",
        "title": "My partner and I switch off ",
        "content": "This is really annoying me. My partner and I switch off households in different states. I travel for work and my partner comes to me sometimes. Recently in the past 2 to 3 months Netflix is no longer showing the I’m traveling option only the update household. We’re trying to save money and we are not understanding why this is changed. We are one household. Every single time we’re having to update the household. I’m a pause. The show to get up and pee and I come back and I have to update the household which then makes her have to update it in five minutes. What the heck happened?!?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hhhqx4/my_partner_and_i_switch_off/"
    }
]