[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mbhoob",
        "author": "Nexfinity",
        "title": "Bad Influence Season 2 - Passes",
        "content": "Has anyone else heard rumors of Netflix doing a second season and covering all the child exploitation and CSAM legal troubles that Passes is facing? Would be interesting to see how they handle as I thought season 1 was fascinating and abhorrent. \n\n\n\nI like how they focused on the blame the parents share, which would be interesting with Passes since they required parental consent for the under 18 creators, though there's claims they allowed a few creators around that. Also a platform making $$$ off of selling bikini pics of 12-year-old girls is wild. Would be pretty explosive as Alec Celestin recruited and partnered with Lucy Guo who is now the \"youngest self-made female billionaire\".\n\n  \nAny other ideas for a second season?",
        "upvotes": 51,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mbhoob/bad_influence_season_2_passes/"
    },
    {
        "id": "1mbi3pw",
        "author": "restrictednumber1996",
        "title": "I can’t lie anymore. The Hunting Wives is sleazy, twisty and a hell of a summer binge.",
        "content": "Look, it isn’t Emmy award winning TV. The acting only ranges slightly fair. The characters are terrible people. \n\nBut I’d be lying if I said I wasn’t sucked in from the very first episode. It’s got everything a good summer binge should have for me. Like a trashy beach read. A mystery, sex, lies, and twists. It’s a super fun romp. \n\nAlso: I see some comments stating that Brad and Jamie are underage, thus making some scenes uncomfortable. Idk about the book, but they are 18 years of age on the show. Still taboo because he is a student, but I did want to mention that. Malin did an interview on it recently. \n\nAll in all, if you want a quick and breezy watch with some bonkers moments, take a watch. ",
        "upvotes": 44,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1mbi3pw/i_cant_lie_anymore_the_hunting_wives_is_sleazy/"
    },
    {
        "id": "1mb0szl",
        "author": "wayowayooo",
        "title": "Cruise director in Amy Bradley documentary receiving tons of backlash",
        "content": "Looks like Kirk Detweiler is getting tons backlash for his comments in the Amy Bradley is Missing documentary. He’s completely deleted his social media. I was surprised to see he didn’t express more empathy and remorse for how the situation has unfolded - so I think the criticism is deserved. What do you think?",
        "upvotes": 579,
        "comments": 225,
        "media": null,
        "permalink": "/r/netflix/comments/1mb0szl/cruise_director_in_amy_bradley_documentary/"
    },
    {
        "id": "1majx8l",
        "author": "K1mbacat",
        "title": "Netflix cancelling shows after one season is making me want to cancel my subscription",
        "content": "Is anyone else frustrated about this? I’ll watch a new show (released within the past few months), finish the season and get invested, only to find out they’ve cancelled it a month later. I’ve found articles saying it’s due to “low viewership”, but they didn’t even recommend the shows to me, no advertising, etc, and then cancel it shortly after, before most people have even heard of the series. I’m starting to consider cancelling my subscription because of this.",
        "upvotes": 726,
        "comments": 182,
        "media": null,
        "permalink": "/r/netflix/comments/1majx8l/netflix_cancelling_shows_after_one_season_is/"
    },
    {
        "id": "1mb3ksh",
        "author": "gena5445",
        "title": "Untamed",
        "content": "I felt this show was decent but one thing that really annoyed me was the trope of ‘character being saved at the last second’. This show did this literally 3 times! One character was being choked to death.. at the last second, he/she is saved. Another was trapped in a cave in the middle of nowhere. As water is pouring in,he/ she is saved. The last one, when a character was shot and the shooter was doing yet another annoying trope ( talking too much, it’s time for you to die etc), the good guy/girl was miraculously saved…By ANOTHER trope … you hear the gun shot…the victim looks pained. And wait what? The killer is shot instead!! And the ‘friend’ just happened to show up at ‘just the right time’ and in ‘just the right place’ so they can shoot the shooter! 🤦‍♀️🤦‍♀️\n\nOn another note~ Eric Bana is 🔥",
        "upvotes": 34,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1mb3ksh/untamed/"
    },
    {
        "id": "1mbku0n",
        "author": "HehroMaraFara",
        "title": "Hightown",
        "content": "Had to give up halfway through season 2. I don’t know what the concept was, but if it wa to give us anyone to give a shit about, they failed miserably. \n\nThe show synopsis: Shitty, selfish people do shitty, selfish things to other shitty, selfish people. The “protagonist” is an annoying spoiled child who constantly acts tough but can’t even take on a junky in rehab without begging for mercy. \n\nIt’s bad. You won’t care if anyone dies and will cringe at all the long, unnecessary sex scenes and horrible “romantic” dialogue and deliveries. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mbku0n/hightown/"
    },
    {
        "id": "1mb08ti",
        "author": "Meinov",
        "title": "Squid Game kinda lost its original theme in season 2 and season 3.",
        "content": "**A bit of context first:** I was one of those people who watched *Squid Game* as soon as it dropped back in October 2021. I was genuinely thrilled that the show was getting the attention it deserved, and I was really hyped for the upcoming seasons.\n\nThat said, I have to admit—I’m disappointed with how *Season 2* and *Season 3* turned out. Don’t get me wrong, I’m not saying they’re outright bad, but they lost the original theme and depth that made *Season 1* so impactful. The first season was a sharp commentary on Korean society, particularly capitalism. It portrayed a world where the lives of the poor were reduced to entertainment for the ultra-rich—a brutal but honest reflection of societal inequality.\n\nIf Netflix plans to create a U.S. spinoff—or one based in any other country—I hope they do more than just swap Korean actors for American ones. They need to research and present social commentary that fits that country’s context. Otherwise, it’ll just feel hollow.\n\n*Season 1* worked because it explored the darker side of capitalism and the widening gap between rich and poor. Even the twist with Player 001 being the mastermind added a layer of complexity that elevated the story. *Season 2* tried to pivot toward themes like democracy and how easily the masses can be manipulated when money is involved, which had potential, but the execution fell flat. By *Season 3*, the games didn’t feel as engaging, and the characters were far less memorable. It felt like people were dying left and right without much emotional weight.\n\nEven the subplot involving the soldier with PTSD, which initially added a sense of mystery, ended up being disappointing—especially when it turned out he was lying the whole time. The police officer, who had so much intrigue in the first season, felt completely useless across the next two. And Gi-hun’s death, all for the sake of the baby—only for him to never meet his daughter—felt like a bitter conclusion that didn’t land emotionally.\n\nNow there’s talk of a *Squid Game USA* and even a whole cinematic universe. Honestly, I think that’s a bad idea, especially considering how the quality dipped in *Season 2* and *3*. I don’t want this to turn into a franchise where the core idea becomes nothing more than “rich people watch poor people suffer,” stripped of any real message or nuance.\n\nI can talk about this more",
        "upvotes": 18,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1mb08ti/squid_game_kinda_lost_its_original_theme_in/"
    },
    {
        "id": "1mbg25c",
        "author": "IcyAd6894",
        "title": "rant",
        "content": "For the past month, I've been trying to put on a show daily hoping that I find something that's barely interesting to watch. Man, the quality absolutely sucks!! They're not even 1% engaging, totally bland. Forget a good storyline, the characters are dull, the conversations they have are no more interesting than my neighbours. There's nothing that's gripping about them. I remember a couple of years ago, there were shows that would suck you into their world, no matter what other tasks you were doing and lure you to binge-watch entire seasons. Now, I'm trying so hard to focus my mind and giving it a chance to barely excite me, but I'm getting bored every passing minute. Please give me suggestions ! ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mbg25c/rant/"
    },
    {
        "id": "1mbf04y",
        "author": "ThoughtExtreme165",
        "title": "Bug on LG CX Netflix App: Unable to Scroll Through Seasons/Episodes",
        "content": "Hey everyone,\nI'm having a persistent issue with the Netflix app on my LG CX and was wondering if anyone has seen this before or found a fix.\nWhen I go into a show with multiple seasons (like \"One Piece\" in the video), I can't [properly scroll through them](https://youtu.be/s0LjJvWXvp8?si=RhuVeYrJjWhkoMIr). I can move up and down the season list on the left, but the episode list on the right doesn't update to match the selected season. It's just stuck on the episodes from the first season I clicked on.\nI recorded a short video demonstrating the problem: Https://youtu.be/s0LjJvWXvp8?si=RQeNgfSwKKHNd84e\nSo far, I've tried the usual troubleshooting steps:\n * Closing and relaunching the Netflix app\n * Restarting the TV\n * Checking for updates for both the app and the TV's firmware\nHas anyone else with an LG CX or another WebOS TV run into this? Any known workarounds would be greatly appreciated!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mbf04y/bug_on_lg_cx_netflix_app_unable_to_scroll_through/"
    },
    {
        "id": "1mbe95o",
        "author": "anonymoose373",
        "title": "Why are some movies discoloured?",
        "content": "Some movies on netflix appear with a pink and green tint, as if it has lost all blue colour (Happy Gilmore 2 and Game Over, Man!) while others are unaffected (true memoirs of an international assassin and Pineapple Express). I assume this ins't a hardware issue as it only affects certain titles, but this is happening on a chromecast with google TV, playing on a Toshiba TV",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mbe95o/why_are_some_movies_discoloured/"
    },
    {
        "id": "1mbdigb",
        "author": "No_Forever1304",
        "title": "There must be a separate genre for shows like Walter boys, ransom canyon and motorheads",
        "content": "What is the genre called? It all feels the same. Terrible cliche acting, a certain amount of righteousness, very predictable storylines. All of them give the same vibe. ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1mbdigb/there_must_be_a_separate_genre_for_shows_like/"
    },
    {
        "id": "1mb9hj3",
        "author": "lovemyhoodedsweaters",
        "title": "Can Americans usually tell if actors in U.S. shows are actually from Australia?",
        "content": "Not necessarily Netflix related, but I just watched Untamed and just found out this lead actor Eric Bana is actually from Australia. I'm from the Netherlands and I don't notice the accent, but I was just wondering... isn't it annoying for Americans that they can hear the accent and can tell he's not from the US? Or is it so well done that it's hard to notice?   \nIn the Netherlands actors shouldn't try to do a Flemish accent or even another accent within the Netherlands, 'cause you can immediately tell they are not from that area. ",
        "upvotes": 4,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1mb9hj3/can_americans_usually_tell_if_actors_in_us_shows/"
    },
    {
        "id": "1mal9qz",
        "author": "Spirited-Region-2611",
        "title": "Did anyone else think Trainwreck: Astroworld, took forever to get to the point?",
        "content": "I found myself zoning out because, I’m aware it was telling a lot of peoples stories, but the documentary just wasn’t as captivating as the other ones. ",
        "upvotes": 58,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1mal9qz/did_anyone_else_think_trainwreck_astroworld_took/"
    },
    {
        "id": "1mb2hnp",
        "author": "Princess_Butterscoth",
        "title": "Building the Band; Kudos to the judges for ruling based on the purpose of the show",
        "content": "Just finished Building the Band and overall enjoyed the show and found the ending to be very satisfying. After the first few episodes my tops were 1)SZN4, 2) Soulidified, 3)3Quency and Sweet Seduction could have fought for 3 if not for Allison’s attitude cause they all really could sing. Overall I appreciated the judges eliminating bands based on chemistry and their overall blending. By the last episode though I loved the powerhouse voices of SZN4, I definitely believed they could have been more dynamic. I wanted to see a little 1,2 step. 3Quency brought we their voices, entertainment, and chemistry. They deserved the win.  \n\nIn comparison I think about Season 2 of Rhythm and Flow. Watching that felt so frustrating in comparisons. It felt like quite a few mediocre acts moved along too far in the competition. Why was the ultimate winner given kudos for getting the basics of his craft right while his opponent was giving A+ performances from day 1. The premise of the show was to find the best rapper, not go on potential. It felt like the judges were focused on their own preferences rather than what the premise of the show was based on. ",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mb2hnp/building_the_band_kudos_to_the_judges_for_ruling/"
    },
    {
        "id": "1mb5rmi",
        "author": "TheTrojan320",
        "title": "Happy Gilmore 2 Filming Location Question",
        "content": "The filming locations show The Shoppes at the Farm as a location that the movie was filmed at…anyone have an idea which scene this is? I can’t seem to figure it out. It’s in Whitehouse Station NJ. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mb5rmi/happy_gilmore_2_filming_location_question/"
    },
    {
        "id": "1maqaq9",
        "author": "Electronic_Driver_78",
        "title": "Sandman Season 2: A Story Without Evil, Yet Full of Consequence",
        "content": "Just finished the last season of The Sandman, and something struck me that I can't stop thinking about: there’s no clear villain. Actually, there’s no real villain at all.\n\nSure, we have Lord Azazel arguably the closest candidate. But can you really call a demon a \"villain\" when evil is literally his nature? He’s doing what demons do. There's no moral twist, no manipulation, just raw, elemental ambition. Even Lucifer, who I fully expected to be the looming big bad this season, didn’t take that role. And honestly, I was a little disappointed she didn’t even show up at Morpheus’ funeral. I kept waiting for her to appear, one last move, one final word but no. Her absence almost said more than her presence could have.\n\nThe beauty of this season, I think, is how conflict arises from duty, grief, pride, and change rather than a singular evil force. Morpheus isn't fighting villains; he's navigating consequences. Everyone's following their nature, their role in the grand cosmic dance, even when it clashes with others. And that makes it all feel more... mythic? More tragic? Definitely more human.\n\nCurious if anyone else felt the same. Did you miss having a \"main antagonist\"? Or did the lack of one make the story hit harder?\n",
        "upvotes": 11,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1maqaq9/sandman_season_2_a_story_without_evil_yet_full_of/"
    },
    {
        "id": "1mb77aq",
        "author": "avidichard",
        "title": "Problem with changing payment",
        "content": "It is absolutely impossible to change paiement method in my netflix account. When entering the new credit card information, they request a Phone number and no matter which phone number I put, they never send a text and write that there is an error. I have tried every possible way to change that freakin' payment method and even tech support through chat decline all of my cards (2) and both have more than enough money available on it to be paid. I have 1 week to figure out how to manage that. It's very annoying that they do not have any backup payment cards. It's one card and if you change it, it changes the payment method completely. I've been living this scenario once in the past and it was a nightmare to get that changed, now, I'm living it again because noone can do it. Anyone has any solutions?\n\nSome extra info, The account was in the Philippines but we pay through our Canadian credit card. It works, it has been done before but unfortunately, the Philippines Credit card was used again for 1 month so now I cannot put the Canadian card back. We have a Canadian Phone number in the Netflix account but when needing to confirm, it requires a Philippines phone number and we tried using the old one and it does not work, the phone works, the SMS works but Netflix does not want to accept.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mb77aq/problem_with_changing_payment/"
    },
    {
        "id": "1mb6jxx",
        "author": "flowlowland",
        "title": "What headphones are they wearing in the booths in Building the Band?",
        "content": "Just curious as I can't find them in a search. I've been looking for a good pair of headphones, and if they chose them for this show, maybe they're worth checking out. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mb6jxx/what_headphones_are_they_wearing_in_the_booths_in/"
    },
    {
        "id": "1marwjt",
        "author": "luckygirl3434",
        "title": "Hunting Wives - Evan Jonigkeit makes my skin crawl",
        "content": "I’m only on Episode 3 and im really digging the show so far.\n\nBut every time Evan Jonigkeit is on screen, my skin just crawls. I thought he was Jason Hurst from Drop Dead Diva aged badly at first - then I realized he is a different person.\n\n",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1marwjt/hunting_wives_evan_jonigkeit_makes_my_skin_crawl/"
    },
    {
        "id": "1mb4x1o",
        "author": "LLD615",
        "title": "Help with log out",
        "content": "At a rental house and want to watch Netflix. Previous renters didn’t logout and have their profiles password protected. There doesn’t seem to be a way to log them out so we can log in. Any suggestions?",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1mb4x1o/help_with_log_out/"
    },
    {
        "id": "1ma3fls",
        "author": "StreetFriendship1200",
        "title": "Binge-worthy limited series?",
        "content": "It’s Saturday afternoon. Hubby and I were planning to host some friends for cocktails and a lovely dinner, but they just called to cancel the last minute because they are sick and don’t wanna make us ill. So we have the night to ourselves, for date night. And some amazing cocktails, appetizers and a grilled porkchop dinner ahead of us. Don’t feel like inviting anyone else, so I’m currently searching for a good Netflix movie or limited series to watch tonight. Something good, like a thriller or action pack. Any suggestions welcome! I’m running out of patience scrolling aimlessly on damn Netflix and reading reviews 🙄",
        "upvotes": 242,
        "comments": 412,
        "media": null,
        "permalink": "/r/netflix/comments/1ma3fls/bingeworthy_limited_series/"
    },
    {
        "id": "1mavdh6",
        "author": "infantile-eloquence",
        "title": "Subtitles changed format",
        "content": "Anyone found that the subtitles now move across the screen next to the person speaking instead of being central to the screen like always and everywhere else?\n\nIt's really distracting - currently watching the US office on UK Netflix if it matters.\n\n",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mavdh6/subtitles_changed_format/"
    },
    {
        "id": "1ma7qv2",
        "author": "kathyknitsalot",
        "title": "Untamed",
        "content": "Just finished watching this and I feel like something was off. I usually like Eric Bana and Sam Neill, and the story was interesting but I don’t know if it was the writing or acting.  It was hard to get into the characters.  Any of them. Anyone else have an opinion? ",
        "upvotes": 117,
        "comments": 155,
        "media": null,
        "permalink": "/r/netflix/comments/1ma7qv2/untamed/"
    },
    {
        "id": "1may80m",
        "author": "Fast_Bee_9759",
        "title": "Adolescence accents",
        "content": "Can anyone from the uk comment on the accents ? It seems that Eddie, Manda and Jamie have northern (i think) accents but their daughter,Lisa, does not. I know that northern accent can sometimes simboloze lower class/upper class but wanted to ask ?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1may80m/adolescence_accents/"
    },
    {
        "id": "1mbdlcb",
        "author": "Junior_Apartment6388",
        "title": "Every single crazy cameo and hidden detail in Happy Gilmore 2 you missed",
        "content": "I couldn’t believe how many cameos there were in Happy Gilmore 2! Why so many musicians too? Eminem, Kid Cudi, Post Malone, Bad Bunny. The film was basically one big cameo, still thoroughly enjoyed it though",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1mbdlcb/every_single_crazy_cameo_and_hidden_detail_in/"
    },
    {
        "id": "1mb0jq1",
        "author": "Amazing_Package_5672",
        "title": "Can’t log into my added household account???",
        "content": "Family member just added me to their household on their netflix account. I got the invitation, accepted it, and created my new account. I went to log into it on my TV and it said my email didn’t exist in their system??? I got the confirmation email after I created my account so I’m confused what happened. I logged out on my computer to see if I could only have it on 1 device but now I can’t log back in at all. \nHas this happened to anyone else??? Is there some sort of waiting period or trick I need to do?? heeeellllpppp",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mb0jq1/cant_log_into_my_added_household_account/"
    },
    {
        "id": "1mahwxl",
        "author": "Old_Customer_1894",
        "title": "Was it worth it, In-ho?",
        "content": "",
        "upvotes": 13,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/j4luf9fowdff1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1mahwxl/was_it_worth_it_inho/"
    },
    {
        "id": "1mb40cx",
        "author": "canned_peaches99",
        "title": "Netflix is making me be a new member when I’m using the account within the household.",
        "content": "I moved out of my parent’s house about 4 years ago and since then Netflix changed its rules about being in the same household so I eventually got booted off on my laptop and phone. I recently moved back to my parents and now when I try to log into the Netflix account on those devices it tells me I need to be on a extra member account. They pay for premium. I just want to know if this is a glitch or if I actually have to do that. My parents are older and sometimes it’s hard to do the whole “sending verification code thing” 😭. ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1mb40cx/netflix_is_making_me_be_a_new_member_when_im/"
    },
    {
        "id": "1mb22r5",
        "author": "Immediate_Zombie_682",
        "title": "Anyone know what show this is?",
        "content": "I saw a post on Instagram with a clip from a show and I can’t remember the name. It was a woman in a grocery store dressed like the 1950s maybe, and she overheard two women in the next aisle discussing that her husband was having an affair. She knocked over a tower of soup cans she was hiding behind. Anyone know what show this is, and is it worth watching? ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1mb22r5/anyone_know_what_show_this_is/"
    },
    {
        "id": "1mb8ran",
        "author": "gttd4evr",
        "title": "Unhappy with Netflix",
        "content": "I've had the basic Netflix account  for 10 years. They email me when there is a price increase which is fine because there are always price increases. \nWhat I don't understand is them telling me that I need to change my plan or they will play commercials then when I try to enter my gift card they say that my basic plan doesn't support gift cards.\nI have a $100 gift card that I got for my birthday and Netflix isn't letting me use it.\n",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1mb8ran/unhappy_with_netflix/"
    }
]