[
    {
        "id": "1kanxim",
        "author": "WatchTheSkiesAMA",
        "title": "Hey r/movies! I’m Scott Mann - director, writer, and co-Founder of Flawless. Flawless and XYZ Films are releasing the sci-fi adventure WATCH THE SKIES exclusively in AMC Theatres on May 9. I also directed the survival-thriller FALL. Joined by co-directors of SKIES, Victor &amp; Albin. Ask us anything!",
        "content": "Hey r/movies! I’m Flawless co-founder Scott Mann. Flawless and XYZ Films are releasing WATCH THE SKIES  exclusively in AMC Theatres on May 9. It’s the world's first theatrical full-length feature to use ﻿AI for immersive dubbing. Ask me anything!\n\nWATCH THE SKIES was originally filmed in Swedish, but the original cast re-recorded their dialogue in English and Flawless' technology seamlessly integrates the English dialogue into the film, ensuring perfect lip sync. With full endorsement from SAG, Flawless is leading the charge in ethical AI filmmaking, pushing boundaries, and crafting a new era of cinematic storytelling.\n\nI’ll be back today at 1pm PT, along with WATCH THE SKIES filmmakers Victor Danell (Director) and Albin Pettersson (Producer), to answer your questions.\n\nMore info about our new movie:\n\nOfficial Trailer: \n\n[https://www.youtube.com/watch?v=-pI5eTJa2FI&amp;t=3s](https://www.youtube.com/watch?v=-pI5eTJa2FI&amp;t=3s) \n\nWATCH THE SKIES - Exclusively in AMC Theatres on May 9th!\n\nSynopsis: A rebellious teenage woman’s father went missing years ago and she believes that he didn’t run away, but was abducted by aliens. She joins forces with a funky UFO club made up of a lovable group of weirdos and rejects. Together, they embark on an adventure that takes them far beyond the boundaries of the law and ultimately, our world.",
        "upvotes": 10,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/lpkfrzlizrxe1.png?auto=webp&amp;s=d32782d2f5dccb018d1123bd7d0fe3402c3d1d22"
        },
        "permalink": "/r/movies/comments/1kanxim/hey_rmovies_im_scott_mann_director_writer_and/"
    },
    {
        "id": "1kankcc",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Zach Cregger’s ‘Weapons’",
        "content": "",
        "upvotes": 4301,
        "comments": 329,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mqb9dknxwrxe1.jpeg?auto=webp&amp;s=ac2aa0bd14014b0146aeabf6dd36398428adfb1d"
        },
        "permalink": "/r/movies/comments/1kankcc/official_poster_for_zach_creggers_weapons/"
    },
    {
        "id": "1kan9yo",
        "author": "MarvelsGrantMan136",
        "title": "THE SMASHING MACHINE | Official Trailer | A24",
        "content": "",
        "upvotes": 2046,
        "comments": 669,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4BgTQ9qV4JFRu5KADyJOfgh9bGouvi8G7QHnv40A2t8.jpg?auto=webp&amp;s=5c94c63a3ae9ce3aaf497b834f3b4c1263f78f4d"
        },
        "permalink": "/r/movies/comments/1kan9yo/the_smashing_machine_official_trailer_a24/"
    },
    {
        "id": "1kamq1u",
        "author": "MarvelsGrantMan136",
        "title": "First Images from Darren Aronofsky’s ‘Caught Stealing’ - A former baseball player (Austin Butler) finds himself immersed in criminality in New York in the 1990s.",
        "content": "",
        "upvotes": 1898,
        "comments": 316,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/f9b2z3kqprxe1.jpeg?auto=webp&amp;s=ec3feb231d7424668b09add551d9370b8f515e99"
        },
        "permalink": "/r/movies/comments/1kamq1u/first_images_from_darren_aronofskys_caught/"
    },
    {
        "id": "1kanpqt",
        "author": "MarvelsGrantMan136",
        "title": "Weapons | Official Trailer",
        "content": "",
        "upvotes": 459,
        "comments": 155,
        "media": null,
        "permalink": "/r/movies/comments/1kanpqt/weapons_official_trailer/"
    },
    {
        "id": "1kao9n5",
        "author": "semafornews",
        "title": "Why ‘Margin Call’ remains Wall Street’s favorite movie — and the best indictment of it",
        "content": "",
        "upvotes": 349,
        "comments": 99,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cu7OJzo9xZGYF4VMdpgvFBM5rwbJ3Rba1bWP-cH5NwQ.jpg?auto=webp&amp;s=c39e3da87530276478a9641378fbdb4d2b1769db"
        },
        "permalink": "/r/movies/comments/1kao9n5/why_margin_call_remains_wall_streets_favorite/"
    },
    {
        "id": "1karhhy",
        "author": "ChiefLeef22",
        "title": "'Thunderbolts*' - Review Thread",
        "content": "Director: Jake Schreier\n\nCast: Florence Pugh, David Harbour, Sebastian Stan, Wyatt Russell, Hannah John-Kamen, Lewis Pullman, Julia Louis-Dreyfus\n\n*Ensnared in a death trap, an unconventional team of antiheroes -- Yelena Belova, Bucky Barnes, Red Guardian, Ghost, Taskmaster and John Walker -- embarks on a dangerous mission that forces them to confront the darkest corners of their pasts.*\n\nRotten Tomatoes: [91%](https://www.rottentomatoes.com/m/thunderbolts)\n\nMetacritic: [70/100](https://www.metacritic.com/movie/thunderbolts/)\n\nSome Reviews:\n\n[IndieWire - David Ehrlich](https://www.indiewire.com/criticism/movies/thunderbolts-review-marvel-movie-1235119020/) \\-  B-\n\n&gt;It’s a force strong enough to bond a group of enemies into the world’s greatest team of superheroes, and to malform decent people into indiscriminate murderers. It’s a force strong enough to cohere a string of spandex-clad blockbusters into one of the defining cultural phenomena of the 21st century, and — just maybe — a force strong enough to save that series of blockbusters from collapsing under its own weight in the face of certain Doom. Time will tell. The good news for the MCU is that “Thunderbolts\\*” buys them some more of it, and at a much-needed discount.\n\n[Variety - Peter Debruge](https://variety.com/2025/film/reviews/thunderbolts-review-marvel-the-new-avengers-1236381303/)\n\n&gt;However frivolous it may sound, Schreier’s scrappy ensemble effort is anything but a one-off (and considering its almost $200 million budget, not so scrappy either). It may star six characters you either forgot about or couldn’t name if your life depended on it, but going forward, you’ll be expected to know who they are and could be quizzed on events that happen in “Thunderbolts” at any time — starting with the asterisk that appears after the title, and the explanation which rewards opening-weekend audiences with spoiling for everyone who catches up with it late.\n\n[Empire - John Nugent](https://www.empireonline.com/movies/reviews/thunderbolts/) \\- 3/5\n\n&gt;It doesn’t always land, but it dares to be different, from the title to the team-up. Fresh and thoughtful in a way recent Marvel efforts haven’t always managed.\n\n[IGN - Clint Gage](https://www.ign.com/articles/thunderbolts-review-marvel-sebastian-stan-florence-pugh-david-harbour?utm_source=threads,twitter) \\- 7/10\n\n&gt;Thunderbolts\\* is the most solid the sacred timeline has felt in a little while, providing an adventure befitting its overlooked title characters. While it very capably dabbles in a darker tone – touching on the mental health of heroes and villains alike – the filmmakers struggle to balance that dabbling with a snappy, comedic energy. While the movie as a whole left me feeling like it was a downer on the balance, it’s at least the good kind of downer, filled with characters I’m looking forward to seeing again.\n\n[SlashFilm - BJ Colangelo](https://www.slashfilm.com/1846662/marvel-thunderbolts-movie-review/) \\- 7/10\n\n&gt;\"Thunderbolts\\*\" is exactly the type of movie the MCU needs right now, but after a losing streak of less-than-stellar performances, I fear that audiences won't turn out for the second-string players, which will only send the message to the powers at be to go back to the boring, safe, well of familiarity. But I hope I'm wrong. I hope that \"Thunderbolts\\*\" overperforms at the box office and helps usher in a new era of Marvel movies that allows actors to act, stakes to be raised by putting characters in tangible environments instead of CGI hellscapes, characters that force us to flex our empathy muscles, and Florence Pugh leading the way.\n\n[Collider - Ross Bonaime](https://collider.com/thunderbolts-review-mcu/) \\- 8/10\n\n&gt;*Thunderbolts\\** might not be the mightiest hero that the MCU needs, but **it feels like this cinematic universe is taking a step forward in an already convoluted world.** This isn’t necessarily a huge sea change, but it shows that even this deep in, Marvel can tell smarter, more emotional stories without forsaking fun, action, and big explosions. It’s the sort of level that more superhero films should be at, and shows exciting promise for where these movies could go (especially with *Fantastic Four* coming in just a few months). And even though the film does at times feel like it's setting up for future projects, it never feels burdened by this, but rather, like we're seeing the natural progression of where these characters' stories should lead. *Thunderbolts\\** is a pleasant surprise in the MCU; it only took a team-up of Marvel’s unlikeliest superheroes to bring it out in them.\n\n[DEADLINE - Pete Hammond](https://deadline.com/2025/04/thunderbolts-review-marvels-fun-supporting-avengers-1236379893/)\n\n&gt;Director Jack Schreier who was imported from the Netflix limited series *Beef,* is more interested in the “human” elements here than a lot of fancy CGI trickery Marvel has been so fond of in the past, and so there is much to uncover as this group of anti-heroes, not seeing themselves as “heroes” at all, deal with issues of trust, betrayal, and just who they really are. It is a smart and amusing script by Eric Pearson and Joanna Calo an origin story inspired of course by the 1997 comic but quite different and one that could go to intriguing places in future installments and the already announced new editions of the Avengers franchise.\n\n[Independent (UK) - Clarisse Loughrey](https://www.the-independent.com/arts-entertainment/films/reviews/thunderbolts-review-marvel-florence-pugh-b2740716.html) \\- 4/5\n\n&gt;*Thunderbolts\\** does feel different to what’s come before, not because of those indie credentials, but because it’s the first of its kind to seem genuinely self-aware. We’re repeatedly told that, now the Avengers are gone, the world is lacking in heroes and it’s becoming increasingly clear the old systems don’t work anymore. These are statements that apply equally to Marvel’s frustrated inability to build a new roster post-*Endgame*, since they refuse to stick by anything that isn’t a box office smash (RIP the Eternals), and to the general, hopeless state of our world. *Thunderbolts\\**, in that odd way, might actually then be the ultimate Marvel film for now.\n\n[TIMES (UK) - Kevin Maher](https://www.thetimes.com/culture/film/article/thunderbolts-review-marvel-florence-pugh-c9rldc6f7) \\- 4/5\n\nIn the end the most radical element of this revamped Marvel entry is its suggestion that the problems of the world can’t be solved by a super-powered punch to the face, but by a heartfelt group hug. Sappy and saccharine, perhaps.",
        "upvotes": 226,
        "comments": 161,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2p435Urc_QX6k6fnrVNCUiW1KUdpQNemSPb479VFOD4.jpg?auto=webp&amp;s=03dde806cb87c02355cc42346ff3ee962b26cbd4"
        },
        "permalink": "/r/movies/comments/1karhhy/thunderbolts_review_thread/"
    },
    {
        "id": "1ka4ra4",
        "author": "danielthetemp",
        "title": "New image of David Corenswet and Rachel Brosnahan in James Gunn's 'SUPERMAN'",
        "content": "",
        "upvotes": 8209,
        "comments": 872,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mqie1lg6rmxe1.jpeg?auto=webp&amp;s=d5d4de346a7b4b5c6f85ffd819fe9f75d5c6e8af"
        },
        "permalink": "/r/movies/comments/1ka4ra4/new_image_of_david_corenswet_and_rachel_brosnahan/"
    },
    {
        "id": "1kao7gu",
        "author": "KillerCroc1234567",
        "title": "New Poster for “Bring Her Back”",
        "content": "",
        "upvotes": 154,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/takxznv92sxe1.jpeg?auto=webp&amp;s=c3e2d2e8f3e507789845e20632529653ee5584ca"
        },
        "permalink": "/r/movies/comments/1kao7gu/new_poster_for_bring_her_back/"
    },
    {
        "id": "1kanrhz",
        "author": "indiewire",
        "title": "Kathy Bates Tells Director Rob Reiner She Regrets Toning Down Misery Violence",
        "content": "",
        "upvotes": 161,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/A42Dr4NIa_A8GRUv9PWtkPIOBKqFPAVSUjovYrZoQws.jpg?auto=webp&amp;s=9a84e195e12336368b4b2a2fb2cc0666cb0c0425"
        },
        "permalink": "/r/movies/comments/1kanrhz/kathy_bates_tells_director_rob_reiner_she_regrets/"
    },
    {
        "id": "1kamklx",
        "author": "Chai_Lijiye",
        "title": "Leonardo DiCaprio Calls Taxi Driver His Favorite Scorsese Film – Scorsese Credits the Film’s Success to Screenwriter Paul Schrader.",
        "content": "",
        "upvotes": 174,
        "comments": 19,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/iaazrbadorxe1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1kamklx/leonardo_dicaprio_calls_taxi_driver_his_favorite/"
    },
    {
        "id": "1ka7uii",
        "author": "Revolutionary-Ear870",
        "title": "Warner Bros releases 2 hours of promo footage for “Weapons” on a unlisted YouTube video",
        "content": "New line posted this on IG along with the official account for the movie. Haven’t gotten time to watch but seems very creepy based of what I seen from trimming through. Zach Cregger is a great director so I’m very excited for this movie \n\nThat mystery is going to propel you through at least half of the movie, but that is not the movie,\" the filmmaker divulges. \"The movie will fork and change and reinvent and go in new places. It doesn't abandon that question, believe me, but that's not the whole movie at all. By the midpoint, we've moved on to way crazier s--- than that.\"- actual quote from zach ",
        "upvotes": 1965,
        "comments": 291,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4hzPwjIoPYxF10TBwGsU37aQE5TFUkmp-waew9-f8y8.jpg?auto=webp&amp;s=ddada8924cf07c3f9fc00b380e2b1e583400445f"
        },
        "permalink": "/r/movies/comments/1ka7uii/warner_bros_releases_2_hours_of_promo_footage_for/"
    },
    {
        "id": "1k9v9ns",
        "author": "MarvelsGrantMan136",
        "title": "First Images of Julia Garner &amp; Josh Brolin in Zach Cregger’s ‘WEAPONS’ - The film revolves around multi-related plots marked by the disappearance of school kids at exactly 2:17 AM",
        "content": "",
        "upvotes": 6367,
        "comments": 401,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/pkcva0xtskxe1.jpeg?auto=webp&amp;s=25e363342f06f7a543b59b3da67e541608c81032"
        },
        "permalink": "/r/movies/comments/1k9v9ns/first_images_of_julia_garner_josh_brolin_in_zach/"
    },
    {
        "id": "1karljn",
        "author": "Task_Force-191",
        "title": "BROKEBACK MOUNTAIN - 20th Anniversary Release Official Trailer - Only in Theaters this June",
        "content": "",
        "upvotes": 30,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mMORtFmQiCu3IZdF3aIkZpw1R35oVbR1BMUvORhXpkk.jpg?auto=webp&amp;s=ce389e9f43829db33ed88364396468f20391ba86"
        },
        "permalink": "/r/movies/comments/1karljn/brokeback_mountain_20th_anniversary_release/"
    },
    {
        "id": "1kaob6b",
        "author": "InterestConscious804",
        "title": "Tell me about the scene of \"Baby Driver\".",
        "content": "I am an English learner.\n\nI have a question about the scene where Doc talks to BABY about making money.\n\nWhy \"The good news is you're about to make a lot of money.And the good news is you're about to make a A lot of money. \"Did Doc say the same thing twice?\n\nIs this his joke? I'd be happy if someone could tell me.\n",
        "upvotes": 33,
        "comments": 15,
        "media": null,
        "permalink": "/r/movies/comments/1kaob6b/tell_me_about_the_scene_of_baby_driver/"
    },
    {
        "id": "1kaq1j4",
        "author": "Comic_Book_Reader",
        "title": "Fear Street: Prom Queen | Official Trailer | Netflix",
        "content": "",
        "upvotes": 25,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OdYlp0Lp_pzoriaDaSWlEIXTPps6OFDbv_G9nKWDU2Y.jpg?auto=webp&amp;s=ad45080ae7fe54e3ec87a91927012ab21aa42ca1"
        },
        "permalink": "/r/movies/comments/1kaq1j4/fear_street_prom_queen_official_trailer_netflix/"
    },
    {
        "id": "1ka9a0g",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Mamoru Hosoda’s New Movie ‘Scarlet’",
        "content": "",
        "upvotes": 453,
        "comments": 43,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/fscpkx7vpnxe1.jpeg?auto=webp&amp;s=7d6890671a58de4c676f1c0b0cd1cf381c394983"
        },
        "permalink": "/r/movies/comments/1ka9a0g/official_poster_for_mamoru_hosodas_new_movie/"
    },
    {
        "id": "1ka8e41",
        "author": "SanderSo47",
        "title": "April 25-27 Box Office Recap: 'Sinners' stays on #1 with $45.7 million. That's a phenomenal 4.8% drop from last week, one of the greatest drops for a horror film. 'Revenge of the Sith' surprises with $25.4 million, finishing on second place. 'The Accountant 2' and 'Until Dawn' deliver mixed results.",
        "content": "https://preview.redd.it/pizakhm3inxe1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=eee07f629f1feffae153d32cdfc17527d5f4508b\n\nWell, well, well. Don't you love a busy weekend at the movies? \n\n***Sinners*** not only retained the top spot, but also had an incredible hold, signaling that this film is going to have some damn fantastic legs. The 20th anniversary reissue of ***Star Wars: Episode III – Revenge of the Sith*** also posted a fantastic result. The rest of the wide releases were a mixed bag; ***The Accountant 2*** opened almost on par with its predecessor but it's clear it might struggle to break even, ***Until Dawn*** opened below $10 million, while A24 dumped ***The Legend of Ochi*** in 1,153 theaters.\n\nThe top 10 earned a combined $139.9 million this weekend. That's up a massive 148% from last year, when ***Challengers*** debuted at #1.\n\nAs mentioned, ***Sinners*** stayed at #1, earning $45.7 million this weekend. This is an absolutely insane 4.8% drop from last weekend. This is completely bonkers in so many ways. For reference, ***Get Out*** dropped just 15.4% in its second weekend, and that was already considered a phenomenal hold for horror.\n\nGenerally, horror films drop at least 60%, which is reason why they are known for poor legs. In some uncommon cases, some tend to drop 50% or more. In even more uncommon cases, they can drop 49% or less, and that's often a case of good word of mouth. But for a film to drop just 4.8%? This is incredibly rare to happen, especially when the film didn't have a big expansion nor had a holiday to give it a leg. And for this to happen to a horror film? Almost unheard of.\n\n[If you check the smallest second weekend drops for any film playing at over 3,000 theaters](https://www.boxofficemojo.com/chart/smallest_second_weekend_gross_drop/?by_release_scale=super_saturated), you'll see that nearly all of them were boosted by holidays on their second weekend (like ***Heart Eyes*** recently). If we exclude them, *Sinners* had the second greatest second weekend drop, just behind 2011's ***Puss in Boots*** (3%). This is simply spectacular, and it's a sign that its \"A\" on CinemaScore has done an exceptional job.\n\nThrough 10 days, the film has earned a fantastic $123.2 million. Even with ***Thunderbolts*** coming up this weekend, ***Sinners*** is proving that it will have a long life in theaters. It should easily hit $250 million domestically, and it could get close to $300 million as well. Sky's the limit here, pals.\n\nIn second place, the 20th anniversary reissue of ***Star Wars: Episode III – Revenge of the Sith*** earned a fantastic $25.4 million in 2,800 theaters. That's one of the debuts for a re-release, it's notoriously higher than ***Titanic***'s 2012 re-release ($17 million), and it's also higher than the 1997 re-issues of ***The Empire Strikes Back*** ($21 million) and ***Return of the Jedi*** ($16 million), although these two sold more adjusted for inflation. With these numbers, the film hit a lifetime gross of $405 million.\n\nDespite the reviled status of the prequels, ***Revenge of the Sith*** sports the best reception (obviously not a high bar). A lot of fans who grew up with these films still have fond memories, and they want to relive that on the big screen. Another advantage is the fact that the film is very... memeable. So many quotes from the film (\"General Kenobi, you're a bold one\", \"I have the high ground\", \"I. AM. THE SENATE!\", etc.) have become popular, thanks to a lot of posts in the Internet (especially r/PrequelMemes). Nostalgia was strong with this one.\n\nIn third place, Amazon MGM's ***The Accountant 2*** debuted with $24.5 million in 3,610 theaters. That's slightly below the 2016 original, despite 9 years of inflation and a huge performance on streaming and home media.\n\nAmazon has made it clear that they don't view theatrical the same way as other studios; they said that as long as they can recoup their marketing investment, then they're fine with the film's performance. Which is why they're not bad headlines over the film's $80 million budget. But still, it feels like the film could've done better than this. After all, the original film sold incredibly well on home media (becoming the most rented title of 2017) and performed very well on streaming too. All that and the film debuted $200,000 less than the original? That grows even larger if we take inflation into account.\n\nPerhaps it's simply a case of waiting too long to release a sequel. Generally, it's in the best interest of a sequel to release as close as possible to the original, so that the public still has it fresh in their minds. 3 years is the usual, and 5 is pushing it a bit. But it took 9 years for ***The Accountant 2*** to happen, and perhaps some of its audience moved on. The trailers offered exactly what you came to expect from the film, but maybe some people preferred to wait for streaming or PVOD? It's possible.\n\nAccording to Amazon MGM, 58% of the audience was male, and 69% was 35 and over. Unsurprisingly, it's a very dad movie. They gave it a solid \"A–\" on CinemaScore, down from the original's \"A\". That film had some great legs, while ***The Accountant 2*** will face some competition. For now, a lifetime total close to $70 million is likely for the film. Maybe Amazon will be satisfied and greenlight a third film, but it's up in the air if it will get a theatrical release.\n\n***A Minecraft Movie*** dropped 44%, adding $22.7 million this weekend. The film's domestic total stands at $379.9 million, and it should finish with close to $450 million. [WB just announced rowdy screenings of the film with \"block party edition\" starting this Friday.](https://www.hollywoodreporter.com/movies/movie-news/minecraft-movie-block-party-edition-1236202463/) Pray for theater employees, this is gonna be wild.\n\nIn fifth place, Sony's ***Until Dawn*** earned just $8 million in 3,055 theaters. That's David F. Sandberg's worst debut as director, and barely above last year's ***Tarot***. But ***Tarot*** is an original film, while this has the benefit of a known IP.\n\nEven before we saw the first trailer, there was skepticism for an ***Until Dawn*** film. After all, the point of the game was to take the concept of watching a horror film and transform it into an interactive experience. By readapting it to film, it defeats its purpose and just feels redundant. To help differentiate itself, they decided to make the film a time loop horror, while also emphasizing that it takes place within the game's universe. But it was a concept that game fans didn't appreciate and non-fans didn't feel compelled to buy a ticket. \n\nAnd hindsight is 20/20, but maybe Sony wasn't expecting ***Sinners*** to truly break out like this. Even then, scheduling a horror film the week after another horror film is asking for trouble. Weak reviews (53% on RT) didn't help either. Basically, audiences have two options for horror, and ***Sinners*** was the priority for... pretty much everyone.\n\nAccording to Sony, 55% of the audience was male, and 73% of the audience was in the 18-34 demographic. They gave it a weak \"C+\" on CinemaScore; usually horror films get this grade, but that's why they often fall off quickly. With competition from ***Final Destination: Bloodlines*** coming up, ***Until Dawn*** will vanish quickly from theaters. Look for it to finish with around $20 million.\n\nWith Easter over, ***The King of Kings*** had a freefall. It collapsed 76%, earning $4.2 million this weekend. Yep, sounds about right. The film's domestic total stands at $54.7 million, and it's gonna finish with around $60 million, if it continues dropping like this.\n\n***The Amateur*** dropped 47%, adding $3.6 million this weekend. Yep, the film is really struggling to find legs here. The film has earned $33.7 million, and it's now gonna finish below $40 million domestically.\n\nIn eighth place, A24's ***Warfare*** dropped 45%, earning $2.6 million this weekend. The film has amassed $21.8 million so far, and it's gonna finish with a little over $25 million.\n\nIn ninth place, ***The Legend of Ochi*** flopped with just $1.4 million in 1,153 theaters. That's incredibly weak, but you can tell A24 didn't want to push it. Considering last week's numbers in limited release were very poor, it's unsurprising that the film failed to catch on wide release. With a sea of competition on its way, it will disappear quickly from theaters.\n\nRounding up the Top 10 was ***Pink Floyd: Live at Pompeii***. It played in just 654 theaters, but that was enough to hit $1.3 million and crack the Top 10. \n\nOutside the Top 10, we find Universal/Blumhouse's ***Drop***, which is living up to its title. It collapsed 71%, earning just $946,815 this weekend. The film has earned just $15.8 million, and it's set to finish with around $17 million.\n\nWe also had two films, ***Cheech and Chong’s Last Movie*** and ***On Swift Horses***, which barely cracked wide release. But both films faltered, earning just $560,420 and $485,000, respectively.\n\n#**OVERSEAS**\n\n***A Minecraft Movie*** added $37.8 million overseas, taking the worldwide total to $816.5 million. It debuted in Japan ($4M) and South Korea ($2.5M), which were fine. The best markets are the UK ($67.1M), Germany ($33.7M), Australia ($31.8M), Mexico ($28.4M) and China ($25.5M).\n\nThe Force was also strong outside America. The re-issue of ***Star Wars: Episode III – Revenge of the Sith*** made $17 million this weekend, taking the film's lifetime total to $891 million. That's impressive, considering it was playing in just 34 markets. The best debuts were in Germany ($4.6M), the UK ($2.3M), Mexico ($1.7M), Australia ($1.3M) and France ($900K). After 20 years, it should crack the $900 million milestone.\n\n***The Accountant 2*** debuted with $13.7 million in 71 markets, for a $37.7 million worldwide debut. It had modest starts in Mexico ($1.5M), the UK ($1.2M), Australia ($1.2M), Germany ($1M) and Taiwan ($667K). The original film made $155 million back in 2016, and there's no indication that the sequel will earn more than that.\n\n***Sinners*** added $13.5 million in 71 markets, taking the worldwide total to $163 million. That's a pretty great drop, although the fact that it started a little low contributed to that. The best markets are the UK ($9.5M), France ($4.9M), Australia ($2.8M), Mexico ($2.5M) and Germany ($2M). The film should hit $100 million overseas, but as we said last week, this will skew heavily on the domestic side.\n\n***Until Dawn*** had a middling debut in America, but it appears like overseas will save it from embarrassment. It earned $10.1 million in 60 markets, for a $18.1 million worldwide debut. It shouldn't have a problem in recouping its $15 million budget.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*A Complete Unknown* | Dec/25 | Searchlight | $11,655,553 | $75,001,720 | $139,446,191 | $70M\n*Mickey 17* | Mar/6 | Warner Bros. | $19,002,852 | $46,047,147 | $131,847,147 | $118M\n\n- The Times They Are A-Changin'. Well, Searchlight's ***A Complete Unknown*** has ended its run with almost $140 million worldwide. The budget was $70 million, making it Searchlight's most expensive film, and it's very likely the film lost money in the end. But Searchlight and Disney might not mind that, considering they got 8 Oscar noms for the film, including Best Picture. Now, we'll see how Timothée Chalamet does again this Christmas, on that new ***Marty Supreme*** film.\n\n- Well, I guess that's it, Mickey heads. ***Mickey 17*** has ended its run after just a few weeks with a poor $131 million worldwide, against a $118 million budget. It's a sadly unsurprising result; for many months, many questioned if the film could overcome its weird premise and tonal whiplash for audiences. Turns out that audiences just didn't care much for it. Fear not for Bong Joon-ho tho; he's already working on a few films, one of which will be animated.\n\n#**THIS WEEKEND**\n\nWell, it's that time again. The first weekend of May signals the beginning of the lucrative summer season. And for that, we have a new MCU film.\n\nAnd that film is ***Thunderbolts***, which marks the MCU's 36th film. It stars Florence Pugh, Sebastian Stan, Wyatt Russell, Olga Kurylenko, Lewis Pullman, Geraldine Viswanathan, David Harbour, Hannah John-Kamen, and Julia Louis-Dreyfus, and follows a group of misfits teaming up for... something? Hey, that sounds familiar. The MCU is coming off the disappointment of ***Captain America: Brave New World***, which earned very weak reviews and failed to break even. Will ***Thunderbolts*** be different?\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 507,
        "comments": 92,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/a7TVsLtKDDvV49NW4U2kfWJ2XPXBxlGIkCBaKQ-APAg.png?auto=webp&amp;s=3d2f1b744d0a28493ee4a84e7bc54b57bcdf12a4"
        },
        "permalink": "/r/movies/comments/1ka8e41/april_2527_box_office_recap_sinners_stays_on_1/"
    },
    {
        "id": "1ka2u3x",
        "author": "NoCulture3505",
        "title": "Dev Patel to Direct, Star in Period Revenge Action Thriller ‘The Peasant’ for Fifth Season",
        "content": "",
        "upvotes": 925,
        "comments": 73,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/oqP0cIXQMyiHfar89HCT3yo9TMTWkR3lUCgqXCYNlP0.jpg?auto=webp&amp;s=9aeb9e50b9e9bd7150459232a4af51258c37a08e"
        },
        "permalink": "/r/movies/comments/1ka2u3x/dev_patel_to_direct_star_in_period_revenge_action/"
    },
    {
        "id": "1k9zvje",
        "author": "MarvelsGrantMan136",
        "title": "‘Shogun’ Star Anna Sawai Joins David Leitch Next Film ‘How To Rob A Bank’ At Amazon MGM Studios",
        "content": "",
        "upvotes": 1316,
        "comments": 76,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bL1KKR1DTIooUxATHDY6j5vbFkX1sCDH_8uVeZVE2GU.jpg?auto=webp&amp;s=2ea76791d3dc3fa491b750fefc2ce463ad4333de"
        },
        "permalink": "/r/movies/comments/1k9zvje/shogun_star_anna_sawai_joins_david_leitch_next/"
    },
    {
        "id": "1ka4hm3",
        "author": "Professional_Rent261",
        "title": "What’s the best line from a character who only had one line in a movie?",
        "content": "Was thinking about this after rewatching *Air Force One* (1997). There’s this random military guy who gets his one moment and absolutely nails it:\n\n&gt;**“Liberty 2-4 is changing call signs! Liberty 2-4 is now Air Force One!”**\n\nGives me chills every time. Dude had one job and he crushed it.\n\n  \nWhat’s your favorite example of an actor or character getting just *one* line, but it being super memorable? Could be serious, funny, iconic, whatever.",
        "upvotes": 712,
        "comments": 565,
        "media": null,
        "permalink": "/r/movies/comments/1ka4hm3/whats_the_best_line_from_a_character_who_only_had/"
    },
    {
        "id": "1k9s983",
        "author": "MarvelsGrantMan136",
        "title": "‘Avengers: Doomsday’ Officially Begins Filming",
        "content": "",
        "upvotes": 3658,
        "comments": 701,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_wf2NObgpuZPdM9Drjndtyh_MJA9SjQ_z6S-cY7ECo0.jpg?auto=webp&amp;s=804b6cdbd303e0dfb3d966bee25ce3e85b2c91d9"
        },
        "permalink": "/r/movies/comments/1k9s983/avengers_doomsday_officially_begins_filming/"
    },
    {
        "id": "1k9oiod",
        "author": "Prabu-Silitwangi",
        "title": "What's a trend in movies right now that you wish dies a horrible death?",
        "content": "For me it's the uninspiring use of popular songs from the 70s, 80s, 90s, but preferably nirvana. It has to be nirvana if possible. Take the hook, slow it down and drown it in a heavy reverb effects and you just created a masterpiece of cinematical background music because the young audience will think the song is cool and the older ones will like it because it's nostalgic.",
        "upvotes": 10146,
        "comments": 5223,
        "media": null,
        "permalink": "/r/movies/comments/1k9oiod/whats_a_trend_in_movies_right_now_that_you_wish/"
    },
    {
        "id": "1ka2dmk",
        "author": "Planatus666",
        "title": "Ben Affleck visits the Criterion Closet",
        "content": "",
        "upvotes": 829,
        "comments": 177,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mo9sj1jCdUQbl10UGqcnfrYqzCO-c0RApdz0rxWSIDQ.jpg?auto=webp&amp;s=8dfcd0e677e20934e56831055e550cf62fdc311c"
        },
        "permalink": "/r/movies/comments/1ka2dmk/ben_affleck_visits_the_criterion_closet/"
    },
    {
        "id": "1kaevck",
        "author": "ITS_GOOD_FOR_YOU",
        "title": "Who is the coolest movie character of all-time?",
        "content": "Top 2 that come to mind are of course owned by the great Harrison Ford -- Han Solo and Indiana Jones. \n\nI'd throw Ian McKellan in the ring for Gandalf. \n\nTom Cruise as Ethan Hunt is extra awesome in a way where his awesomeness is bolstered by knowing the fact that Cruise does so many of the stunts; helps envelop you into the movie...\n\nWho is at the top of your list?",
        "upvotes": 133,
        "comments": 532,
        "media": null,
        "permalink": "/r/movies/comments/1kaevck/who_is_the_coolest_movie_character_of_alltime/"
    },
    {
        "id": "1k9uysn",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Benny Safdie's 'The Smashing Machine' Starring Dwayne Johnson",
        "content": "",
        "upvotes": 1860,
        "comments": 516,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ak57eio9qkxe1.jpeg?auto=webp&amp;s=440c46733452eedec27c570259d4c3c8f8ae568d"
        },
        "permalink": "/r/movies/comments/1k9uysn/official_poster_for_benny_safdies_the_smashing/"
    },
    {
        "id": "1k9saly",
        "author": "CampMain",
        "title": "Monty Python and the Holy Grail at 50: a hilarious comic peak. The endlessly quoted 1975 comedy remains both a clear product of its era and a timelessly funny masterwork",
        "content": "",
        "upvotes": 2552,
        "comments": 225,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nGCRBQ1QB8yxryIRRrzFsG9T510aeINT3wpLAMkWA_4.jpg?auto=webp&amp;s=58d3851587c4cc424d505bb9f6dceae30e7aaa07"
        },
        "permalink": "/r/movies/comments/1k9saly/monty_python_and_the_holy_grail_at_50_a_hilarious/"
    },
    {
        "id": "1kansve",
        "author": "NoCulture3505",
        "title": "Jackie Chan to Receive Locarno Film Festival Lifetime Honor",
        "content": "",
        "upvotes": 18,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nLuV6RWrEP0Cd9M9cBKi6FnGaeS5q5EzXHZG6qtxyAc.jpg?auto=webp&amp;s=08fe45d338c0a44d1d3c6d3943d174b7a984294a"
        },
        "permalink": "/r/movies/comments/1kansve/jackie_chan_to_receive_locarno_film_festival/"
    },
    {
        "id": "1k9x39r",
        "author": "DeepThinkingReader",
        "title": "What's a critically panned movie that you just can't help loving?",
        "content": "For me, it's Roland Emmerich's 10,000 BC. It has 10% on Rotten Tomatoes, and it's based on a crackpot theory about the pyramids from the rear end of Graham Hancock. But somehow, no matter how many times I see this movie, I never get tired of it. The scene where Steven Strait javelins the Pharaoh and shouts \"He is not a god!\" is one of my favourite movie scenes ever. Also, the music is awesome, the filming locations are gorgeous, and the miniature pyramid models used in production are fantastic. So despite the story being illogical and stupid, and the historiography being absolutely batshit, 10,000 BC will always be one of my guilty pleasures.",
        "upvotes": 936,
        "comments": 1906,
        "media": null,
        "permalink": "/r/movies/comments/1k9x39r/whats_a_critically_panned_movie_that_you_just/"
    },
    {
        "id": "1ka4auz",
        "author": "ChiefLeef22",
        "title": "‘Miami Vice’ Movie in the Works with Joseph Kosinski Directing",
        "content": "",
        "upvotes": 333,
        "comments": 174,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ETjsTkrQocCdfxgi9d0yDCR5I5pHIA1FQOk6vZrCq3c.jpg?auto=webp&amp;s=b56edc1af96d1d7f2279761d0248dc397c424da7"
        },
        "permalink": "/r/movies/comments/1ka4auz/miami_vice_movie_in_the_works_with_joseph/"
    },
    {
        "id": "1kanpd4",
        "author": "KillerCroc1234567",
        "title": "Thomasin McKenzie &amp; Katie Douglas Leading Temple Hill Horror Franchise Hopeful ‘The Rule Of Three’; Protagonist Launching For Cannes",
        "content": "",
        "upvotes": 12,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mtQQjbx1QmM_-gExp2OpXCN9nQ5TgdYO62fa-ui7FVc.jpg?auto=webp&amp;s=bb94cfd466313552dbd3a207713d2af0d55c5467"
        },
        "permalink": "/r/movies/comments/1kanpd4/thomasin_mckenzie_katie_douglas_leading_temple/"
    }
]