[
    {
        "id": "1r01avh",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 10,
        "comments": 451,
        "media": null,
        "permalink": "/r/realmadrid/comments/1r01avh/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1r0vbmd",
        "author": "Bijay12356",
        "title": "Our players were happier because they had a day off before the UCL final, rather than they had qualified for another final 😭😭",
        "content": "",
        "upvotes": 667,
        "comments": 25,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/tqnia1ewnmig1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1r0vbmd/our_players_were_happier_because_they_had_a_day/"
    },
    {
        "id": "1r0y45f",
        "author": "Resident-Stretch9723",
        "title": "2012 Ronaldo was something else | 3 Goal + 1 Assist",
        "content": "",
        "upvotes": 240,
        "comments": 36,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6b0ufixthnig1/CMAF_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1r0y45f/2012_ronaldo_was_something_else_3_goal_1_assist/"
    },
    {
        "id": "1r14uq4",
        "author": "dhinchak14",
        "title": "Real Madrid - eternal passion for football",
        "content": "",
        "upvotes": 38,
        "comments": 6,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/fl3joi6dxoig1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1r14uq4/real_madrid_eternal_passion_for_football/"
    },
    {
        "id": "1r0s0cz",
        "author": "7dek",
        "title": "Luka Modrić vs Juventus [2017 UCL FINAL]",
        "content": "",
        "upvotes": 248,
        "comments": 20,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/km2deyaeplig1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1r0s0cz/luka_modrić_vs_juventus_2017_ucl_final/"
    },
    {
        "id": "1r0yqld",
        "author": "ADITYA_RAKESH",
        "title": "Angelo Stiller. Why don't we go for him???",
        "content": "Why don't we go for him. He will solve many of our problems. Since it is pretty much clear PSG won't sell Vitinha , I personally think Stiller would be the best fit. He knows how to find his forwards(something Kroos was the master of). He is cheap too and the DLP we need. I think the club should atleast consider him. If Perez and the board don't consider him because he is not marketable just coz of his looks, it's a disgrace\n\n\n\n\n\nLet me know ur thoughts on this",
        "upvotes": 16,
        "comments": 82,
        "media": null,
        "permalink": "/r/realmadrid/comments/1r0yqld/angelo_stiller_why_dont_we_go_for_him/"
    },
    {
        "id": "1r0l25d",
        "author": "Available-Display719",
        "title": "Next Match against Real Sociedad who come to Bernabeu with solid 10 match unbeaten streak. Barca was one of the teams they won against.",
        "content": "",
        "upvotes": 96,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/24csr2ub5kig1.jpeg?auto=webp&amp;s=a508d07d4ac508dd842fcf9ace2c12e034e4d3a3"
        },
        "permalink": "/r/realmadrid/comments/1r0l25d/next_match_against_real_sociedad_who_come_to/"
    },
    {
        "id": "1r06pen",
        "author": "o6ohunter",
        "title": "Off-Ball Workrate: Mbappè v Kane v Haaland",
        "content": "",
        "upvotes": 468,
        "comments": 211,
        "media": null,
        "permalink": "/r/realmadrid/comments/1r06pen/offball_workrate_mbappè_v_kane_v_haaland/"
    },
    {
        "id": "1r0ay0t",
        "author": "Majestic-Nobody-3178",
        "title": "Yesterday’s game means Real Madrid have kept a clean-sheet at Mestalla for the FIRST TIME since January 2013 - 13 years ago.",
        "content": "",
        "upvotes": 242,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/b7wnhd8maiig1.jpeg?auto=webp&amp;s=a03e14a76210f345cd6561f40bd1d444b0fcef03"
        },
        "permalink": "/r/realmadrid/comments/1r0ay0t/yesterdays_game_means_real_madrid_have_kept_a/"
    },
    {
        "id": "1r0676z",
        "author": "No-Independent2522",
        "title": "For all our defence issues this season, we still have conceded the least amount of goals in La Liga, and Courtois has kept the most clean sheets.",
        "content": "",
        "upvotes": 338,
        "comments": 75,
        "media": null,
        "permalink": "/r/realmadrid/comments/1r0676z/for_all_our_defence_issues_this_season_we_still/"
    },
    {
        "id": "1qzw5v7",
        "author": "Secure-Bowl-8973",
        "title": "Mbappe's reaction to Mastantuono's attempt",
        "content": "",
        "upvotes": 1692,
        "comments": 230,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/walqidfyqeig1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qzw5v7/mbappes_reaction_to_mastantuonos_attempt/"
    },
    {
        "id": "1r0ndyb",
        "author": "Blazing_Wetsack",
        "title": "Madrid has been boring this year",
        "content": "Yeahyeah everyone is probably tired of the talk but i want to put my two cents in. This isnt a vini or mbappe problem either is a play style problem. There is no identity in the club. We arent a creative team and arent a counter attacking team. Yeah we counter well but thats just when the opportunity opens itself up. \n\nThere is no fluidity in the team. We hold the ball and dont do anything will it. There is no triangle passing in the team. The off ball movements are terrible. Everyone passes and stands there after, noone passes and moves to  get open for another ball. Only pass side to side in the back and try to take it up a wing and it is just bad play. \n\nVini and mbappe have been shit at dribbling and pass recently. Mbappe scores goals but dude has trouble making a simple pass and he has been getting stopped on more dribbles than not. \n\nIm glad trent is back because i think he will be a massive boost to the squad with how he passes. \n\nWith all that said 7 wins in a row playing ugly ball is impressive and can definitely win the league this year",
        "upvotes": 44,
        "comments": 34,
        "media": null,
        "permalink": "/r/realmadrid/comments/1r0ndyb/madrid_has_been_boring_this_year/"
    },
    {
        "id": "1r0lwpu",
        "author": "Ornery-Ad-781",
        "title": "How good was Luis Figo?",
        "content": "Hello there!\nBarca fan here and I have a question. I started following football during 2010 WC when I was 8. I was mostly watching casually till 2017/18 but I always supported Barca. I saw least years of Messi's Barca journey and some games before then. So I was too young to able to see Figo play. I know he was our captain when he left and I'm wondering how good he was. Was he better at Barca or Madrid. Did he meet expectations and do yall consider him a Madrid legend? \nTy for reading and your answers.",
        "upvotes": 38,
        "comments": 29,
        "media": null,
        "permalink": "/r/realmadrid/comments/1r0lwpu/how_good_was_luis_figo/"
    },
    {
        "id": "1r0uuip",
        "author": "Aggressive_Gate_1046",
        "title": "why our team' s fanbase turned to player fc after our last UCL, is it coincidence or ..",
        "content": "all we r hearing now is majority of our fanbase are divided and turned into each player's supporter...like jude fc,vini fc ,guler fc, mbappe fc. ..After 23-24 season 3-4 of our players were competing for ballon d'or including jude and vini (top contenders with carva) and i never seen a hate post against these 2 from our own fanbase at that tym.... theres actually no seperate fanbase as vini fc or jude fc . they support each other. and likewise mbappe fc &amp; guler fc are teamed up against latter 2 players but sometimes these 2 fanbase(MBAPPE fc ,guler fc) fight eachother.\nwe can clearly see what's the issue and idk y og madrid fans believing the narrative. The pr of our certain player is disgusting and he himself cooking that good image everytime . NB:- not hate post, i wanna know y this player fc generated only after someone arrived our team...",
        "upvotes": 9,
        "comments": 27,
        "media": null,
        "permalink": "/r/realmadrid/comments/1r0uuip/why_our_team_s_fanbase_turned_to_player_fc_after/"
    },
    {
        "id": "1r166uz",
        "author": "o6ohunter",
        "title": "What has been your favorite game this season so far?",
        "content": "For me, it has to be the Olympiakos match. Vinicius and Mbappè were unplayable. I know the ending scoreline wasn’t the most convincing, but we easily could’ve had 2-3 more goals that game. That’s the type of beautiful rock and roll football this team can play when we’re not dealing with mind numbing low blocks. ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/realmadrid/comments/1r166uz/what_has_been_your_favorite_game_this_season_so/"
    },
    {
        "id": "1r0cvz1",
        "author": "1stand11",
        "title": "So this sub is going after Mbappe?",
        "content": "Look at this sub page over the past 24 hours or so. It’s littered with a bunch of videos going directly after Mbappe. I don’t think you have to be a genius to realize why that is. Are Vini FC fans really this insecure that they have to relentlessly target Mbappe when Vini doesn’t play a single match? In all seriousness, how many times do we have to have this nonsense Player FC chat on here? Why so many people on here continue to attempt to individualize collective team problems to a single individual is mind boggling. \n\nBigger picture, the back line in front of Courtois has been a shambles for several seasons between injuries, aging players, new inexperienced players, and not enough synergy between any one unit. In front of them, Perez never replaced Kroos and Modric with tempo setting midfielders who genuinely control and dictate matches. Too many of the current midfielders are athletic and able to cover lots of ground. But are not the technicians of Kroos and Modric levels who know when to speed games up, slow things down, and keep things ticking. \n\nUp top, Mbappe, Vini, and Rodrygo all prefer to operate from the LW area. We all know that. Of the three, yes, Mbappe is the most effective attacking wise operating from the left side space. You only have to look at his career numbers to very quickly realize Vini and Rodrygo are nowhere close to Mbappe’s output. And I’m also talking about operating from wide areas as well as a winger. Personally, I think Mbappe operates best from a floating role going across the front lines. With Garcia playing ahead of him as the striker. As for Vini, his one real move of kicking it past the defender and trying to beat them for pace has been found out. Vini visibily looks slower than several years ago and his separation pace looks diminished. You only have to go back and look at highlights from several years ago and compare him to now to see that it’s quite obvious. And he never allows the LB to get forward to work with him. As for Rodrygo, he very likely wants out but knows Madrid is as good as it gets for him. We will never see the best of him playing from the RW. Which is a shame because he’s a very good player. ",
        "upvotes": 52,
        "comments": 147,
        "media": null,
        "permalink": "/r/realmadrid/comments/1r0cvz1/so_this_sub_is_going_after_mbappe/"
    },
    {
        "id": "1r0fckb",
        "author": "Key-Incident7901",
        "title": "Has this sub always been this seemingly divided between individual players?",
        "content": "Got back into football when the Euros started. Bounced between watching a few teams and the subs, before finding myself being drawn to Real Madrid.\n\nIt feels like there’s a lot of people who are fans of one individual player before they are fans of Real Madrid. Almost as if they would rather see the player they like succeed or the player they hate fail, over seeing the club be successful. Has it always been like this?\n\nI’m sure it’s not unique to Madrid and that it may just be a small, vocal contingent of fans that are like this but it feels like it more so than other clubs.\n\nEdit: Mbappe, Vini, Arda, and Jude Bellingham seem to have the most and loudest fans. I’m sure I’m missing someone else.",
        "upvotes": 26,
        "comments": 24,
        "media": null,
        "permalink": "/r/realmadrid/comments/1r0fckb/has_this_sub_always_been_this_seemingly_divided/"
    },
    {
        "id": "1qzprn7",
        "author": "Bijay12356",
        "title": "Trent cameo against Valencia.He is better on the ball than all of our midfielders.",
        "content": "",
        "upvotes": 973,
        "comments": 91,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/kznsg8cm6dig1/CMAF_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qzprn7/trent_cameo_against_valenciahe_is_better_on_the/"
    },
    {
        "id": "1qzlenk",
        "author": "No-Independent2522",
        "title": "Carreras with a great goal",
        "content": "",
        "upvotes": 1728,
        "comments": 71,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/wg8y59sb9cig1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qzlenk/carreras_with_a_great_goal/"
    },
    {
        "id": "1r02o7a",
        "author": "Individual-Insect927",
        "title": "Trent made things work?",
        "content": "I know we still play bad.  Uninteresting and barely get a w with Mbappe or someone else stepping up.  But i noticed sth and wanna know if you guys did as well or not . When Trent came , we started playing better . The passes became faster and smooth . Like water.  It was like the players were connected now . Idk how to describe it since eng is not my fist language . Even though Trent didnt do much but he had a + impact .",
        "upvotes": 113,
        "comments": 48,
        "media": null,
        "permalink": "/r/realmadrid/comments/1r02o7a/trent_made_things_work/"
    },
    {
        "id": "1r0g65w",
        "author": "John4deere",
        "title": "Were there people here who wanted CR7 to leave during his final seasons?",
        "content": "With the current fanbase split into camps: Mbappe FC, Vinicius FC, Bellingham FC, Arda FC, I’m curious how things looked back then.\n\nDuring Cristiano Ronaldo’s last seasons at Madrid, when the team was clearly built around him, were there Madridistas on this sub arguing that it would be better if he left?\n\nThat we were too dependent on him, or that the team needed to move on?\n\nNot talking about trolls or rivals, but actual regulars here.\n\nWas that sentiment real, or is today’s player-fan tribalism on another level? Veterans, please enlighten me.",
        "upvotes": 23,
        "comments": 47,
        "media": null,
        "permalink": "/r/realmadrid/comments/1r0g65w/were_there_people_here_who_wanted_cr7_to_leave/"
    },
    {
        "id": "1qzr6y3",
        "author": "Less_Ad_2409",
        "title": "Mbappe casually insulting the referee in French.",
        "content": "First sequence, he turns back toward the referee and clearly delivers a nice “dickhead” in French. \n\nYou can spot it after the subtitles stops and he’s about to leave the field.\n\n Then you see him standing next to Camavinga. Someone tells him “come, come,” in french but instead he points at the referee and says, “They’re such buffoons,”",
        "upvotes": 535,
        "comments": 66,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/kxb8n936jdig1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qzr6y3/mbappe_casually_insulting_the_referee_in_french/"
    },
    {
        "id": "1qzm0b2",
        "author": "No-Independent2522",
        "title": "Kylian Mboopi scores",
        "content": "",
        "upvotes": 1010,
        "comments": 97,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/1fttdokidcig1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qzm0b2/kylian_mboopi_scores/"
    },
    {
        "id": "1qzmsou",
        "author": "Majestic-Nobody-3178",
        "title": "Doesn’t feel like it at all but we are actually on a 7 game winning streak in La Liga.",
        "content": "",
        "upvotes": 638,
        "comments": 68,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mqa0qrz5jcig1.jpeg?auto=webp&amp;s=2aaad8ab369751d71e5cae029702fd761ae05069"
        },
        "permalink": "/r/realmadrid/comments/1qzmsou/doesnt_feel_like_it_at_all_but_we_are_actually_on/"
    },
    {
        "id": "1qzmkk1",
        "author": "nameless111111111111",
        "title": "Mbappé to Carreras: \"You only score against Valencia\"",
        "content": "",
        "upvotes": 587,
        "comments": 11,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ls0xggcjhcig1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qzmkk1/mbappé_to_carreras_you_only_score_against_valencia/"
    },
    {
        "id": "1qzxjz8",
        "author": "Ruben12ES",
        "title": "Fem] Real Madrid | Yesterday, Athenea received the award for best player in the league for the month of January. She also scored a goal and provided an assist during the match, helping her team secure the victory.",
        "content": "",
        "upvotes": 78,
        "comments": 5,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qzxjz8/fem_real_madrid_yesterday_athenea_received_the/"
    },
    {
        "id": "1qzn8f6",
        "author": "InspectorExact3836",
        "title": "Valencia fans verbally abusing Madrid fan",
        "content": "",
        "upvotes": 275,
        "comments": 51,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/sdlhzyfdmcig1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qzn8f6/valencia_fans_verbally_abusing_madrid_fan/"
    },
    {
        "id": "1qzmmis",
        "author": "Bijay12356",
        "title": "Real Madrid have kept a clean-sheet at Mestalla for the FIRST TIME since January 2013 - 13 years ago.",
        "content": "",
        "upvotes": 282,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/froutetwhcig1.jpeg?auto=webp&amp;s=6e7a13007de7b8a9621ccce0e609cd4649695c8a"
        },
        "permalink": "/r/realmadrid/comments/1qzmmis/real_madrid_have_kept_a_cleansheet_at_mestalla/"
    },
    {
        "id": "1qzf1hj",
        "author": "Resident-Stretch9723",
        "title": "Counter Attack Greatness",
        "content": "",
        "upvotes": 657,
        "comments": 13,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/0c42xtt02big1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qzf1hj/counter_attack_greatness/"
    },
    {
        "id": "1qzqnfc",
        "author": "Adorable_Shaytan",
        "title": "Mbappe's dangerous run against Valencia, which had no support from the attackers or the team at the beginning of the match in the first half.",
        "content": " look at how much space they had left and we didn't h\n\nave a single soul in the middle trying to get that pass from Mbappe🤦🏽‍♂️.\n\nHow are we supposed to win the big games when we can't even make use of golden opportunities like this? \n\nThe same issue arises when Kylian plays ST and Vinicius plays as the LW, our team simply refuses to get into the dangerous parts very often ",
        "upvotes": 130,
        "comments": 79,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/01i169tfedig1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qzqnfc/mbappes_dangerous_run_against_valencia_which_had/"
    }
]