[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 12,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1o9kmmk",
        "author": "Conscious-Can-5334",
        "title": "The Perfect Neighbor - thoughts?",
        "content": "This has me bawling. It’s so sad. Those poor children. That woman should have been arrested from the start. Why didn’t I hear about this in the news when it was happening? ",
        "upvotes": 147,
        "comments": 325,
        "media": null,
        "permalink": "/r/netflix/comments/1o9kmmk/the_perfect_neighbor_thoughts/"
    },
    {
        "id": "1o9mj78",
        "author": "sallymacsmack81",
        "title": "Victoria Beckham’s supposed ‘Victory’ - David Beckham has been subsidising my eyeliners.",
        "content": "The whole premise of the Victoria Beckham documentary was that she fought for 17 years to be taken seriously in fashion and build her brand, all for it to finally stabilise in 2023 after cumulative losses of -£69 million pounds, to post a triumphant profit. But the truth is she posted a EBITDA profit of around £2m pounds, but still an operating loss of -£2.9m. This year, she’s had to extend loans of £6.3m to keep it afloat. It’s not successful and hasn’t been, and if you can’t make a company generate a return in 17 years, after that much investment, it’s not going to magically start making a return. And for that £70 million investment to have meant anything, it needs to be able to generate more than that at some point, not just pay it back. Like who in god’s name pumps that much cash into something year after year, as an escalating commitment to failure, and then gets a documentary made about what a big success it is. I’m baffled! I own some of her eyeliners, and now I know David Beckham has partially subsidised them!",
        "upvotes": 33,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1o9mj78/victoria_beckhams_supposed_victory_david_beckham/"
    },
    {
        "id": "1o9fgki",
        "author": "Previous-Boss-1480",
        "title": "boots 🥾",
        "content": "is anyone else obsessed with boots!? I absolutely love the show finally finished last night and I wish it had more already lol! I’m so curious where did Sargent Sullivan go? I wonder if next season it’ll actually show them in “war” I have sooo many unanswered questions 😅 did anyone else love the show?? also like why did James kinda lead cam on that irritates me so bad I truly thought they would do good together .. also love cams progress I feel like he needed that camp more than the others \nsorry for the spiraling just need someone to talk to about it 🤣",
        "upvotes": 30,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1o9fgki/boots/"
    },
    {
        "id": "1o8wc2o",
        "author": "BradyPhoenix",
        "title": "The Perfect Neighbour",
        "content": "Just finished watching this and more than anything it was just so sad. Those poor babies.\n\nIt did warm my heart a bit to see how much the community cared for one another’s children though. I hope they’re all doing alright.",
        "upvotes": 325,
        "comments": 523,
        "media": null,
        "permalink": "/r/netflix/comments/1o8wc2o/the_perfect_neighbour/"
    },
    {
        "id": "1o9q9if",
        "author": "Last-Maize7926",
        "title": "The Diplomate Season 3",
        "content": "All of you, if you have watched Season 3 of diplomate, please suggest what do you think of this season.\n\nor if you have already stated watching it what do episodes are you in and what have you liked so far",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o9q9if/the_diplomate_season_3/"
    },
    {
        "id": "1o9ksho",
        "author": "Kipper3469",
        "title": "The Perfect Neighbor, susans condition",
        "content": "Anyone notice Susan’s condition. Like in the first few clips she was like bigger and had a head full of hair and during the sentencing she just looked like a ghoul like she has completely decomposed in 2 years. Like I mean in my opinion I think she was more pushed to shooting by anger and fear but I just find it so crazy that she aged more in 2 years then some people do in 10. Maybe because the stress of the trial or what it is I don’t know but I just found one of the craziest parts how much she had aged in such a short amount of time ",
        "upvotes": 7,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1o9ksho/the_perfect_neighbor_susans_condition/"
    },
    {
        "id": "1o9439z",
        "author": "throughthequad",
        "title": "The next Monster Series",
        "content": "I would love to see Netflix go for an Ed Kemper story and resurrect Cameron Britton as Kemper. He was so good in MindHunter, I would love an entire miniseries seeing him portray Kemper. ",
        "upvotes": 36,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1o9439z/the_next_monster_series/"
    },
    {
        "id": "1o9h83z",
        "author": "VelvetOrbitXO",
        "title": "Suggest netflix series",
        "content": "HI, anyone to suggest good Netflix series that will be worth my time watching 😉 any genre that will be worth it to watch, kind of get bored when I am doing nothing during my free time 😁 ",
        "upvotes": 6,
        "comments": 77,
        "media": null,
        "permalink": "/r/netflix/comments/1o9h83z/suggest_netflix_series/"
    },
    {
        "id": "1o9dkr8",
        "author": "PlantNerdxo",
        "title": "‘You purchased an extra member slot’ - wait what?",
        "content": "I just got this email from Netflix. I absolutely did not purchase an ‘extra member slot’. I immediately logged on to cancel this.\n\n\nHas this happened to anyone else?",
        "upvotes": 10,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1o9dkr8/you_purchased_an_extra_member_slot_wait_what/"
    },
    {
        "id": "1o9cru3",
        "author": "njdotcom",
        "title": "See all the Netflix Christmas movies premiering in 2025",
        "content": "",
        "upvotes": 9,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o9cru3/see_all_the_netflix_christmas_movies_premiering/"
    },
    {
        "id": "1o9qizg",
        "author": "LittleMsJenniSolis",
        "title": "So many Alexandria Ocasio-Cortez references on \"The Big Show Show\"",
        "content": "I have been watching \"The Big Show Show\" all night long. It seems that in every episode for, the first half of the season, Representative Alexandria Ocasio-Cortez's name is referenced/mentioned at least four times per episode. It seems to me that the show is hinting at 2028's presidential election being won by AOC. Such a coincidence the writers wanted to name drop her so much.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o9qizg/so_many_alexandria_ocasiocortez_references_on_the/"
    },
    {
        "id": "1o9k7cq",
        "author": "No_Calligrapher2005",
        "title": "Suggestions of shows I watched",
        "content": "I’m new to Netflix and movies that I have already watched keep showing up as suggestions to watch. How do I stop those movie suggestions from appearing so that I can receive new suggestions that I haven’t seen? ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o9k7cq/suggestions_of_shows_i_watched/"
    },
    {
        "id": "1o9p0ha",
        "author": "DrownMeInSalsaPlease",
        "title": "Corporations own us",
        "content": "This is ridiculous. I own the house and the internet. My mother owns the netflix account.\n\nI work overnight so i cant even message and get the code. But because i’m not a home i now have to get permission to use netflix on the go???\n\nWhy do companies continuously find ways to restrict access and price gouge us at every fricken opportunity. So tired of this garbage.\n\nEdit: to clarify, my mother lives in MY house. So it is literally the same household.",
        "upvotes": 1,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1o9p0ha/corporations_own_us/"
    },
    {
        "id": "1o9k0uu",
        "author": "Adorable_Fig4485",
        "title": "squid games",
        "content": "I watched the first season of squid games when it came out and found it really interesting. However I haven't been able to watch the later 2 seasons. I tried watching them but they didn't intrigue me and miserably failed to catch my eye. Should I watch them like is it worthit or should I just leave it? ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o9k0uu/squid_games/"
    },
    {
        "id": "1o9fryn",
        "author": "Alexfd1971",
        "title": "Maze Runner: The Scorch Trials could have easily have been the end of that (ps: haven't seen the 3rd one)",
        "content": "The first Maze Runner was perfect and could have been left at that, but it was great that they made Scorch Trials to give fans more and maybe add a bit because of how cliff hang the end felt, and it was good up until TERRASSA RATTED OUT THE RIGHT ARM!!\nIt was a dumb decision and the way they paced it towards the whole crew getting jumped was faster than Wally West, I'm just saying from what I currently see that the 3rd one was just a cash grab (about to watch 3rd one anyway to see if it's worth it)\n\nUpdate: Just watched The Death Cure, was most definitely a cash grab, I crashed out every time Teresa was on. I know they probably were following the way the books were published (I didn't know it was based off a book) but still, they had Teresa as the love interest when it should have been Brenda, Gally was nice to have but still was a bit out of touch, and then newt dies, terrible, would recommend only to watch the first one and then no more, it's definitely not worth it",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1o9fryn/maze_runner_the_scorch_trials_could_have_easily/"
    },
    {
        "id": "1o9m4ks",
        "author": "Pudix20",
        "title": "How can I see more genres/options similar to old Netflix",
        "content": "I’m using Netflix on a Google TV. Somewhat recently, they updated to these large tiles that basically show 4 options on the screen at a time. And these hyper specific categories, each of which have 7-10 movies/shows in them. \n\n“Suspenseful movies about friendship”\n“Critically-acclaimed underdog drama movies”\n“Don’t watch hungry”\n\nAnyway I don’t actually *mind* hyper specific categories. And I know you can access the genres through search. But this seems *less* user-friendly to me. \n\nAny suggestions? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o9m4ks/how_can_i_see_more_genresoptions_similar_to_old/"
    },
    {
        "id": "1o91djd",
        "author": "SufficientPrice7633",
        "title": "3 years ago, Extraordinary Attorney Woo was released",
        "content": "",
        "upvotes": 9,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o91djd/3_years_ago_extraordinary_attorney_woo_was/"
    },
    {
        "id": "1o8jkte",
        "author": "Routine-Asparagus-16",
        "title": "The Diplomat Is Back.",
        "content": "I've been  waiting for season 3 of the Diplomat.... It wasn't a long wait and at least there's 8 episodes. Season 2 was a longer wait with 6 episodes... I dnt think 10 episodes is a thing anymore.",
        "upvotes": 128,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1o8jkte/the_diplomat_is_back/"
    },
    {
        "id": "1o9bcry",
        "author": "bloomdaleaddict",
        "title": "Travelling and can’t watch netflix on TV",
        "content": "I travel a lot and sometimes a few weeks at a time. All these times, I can always access netflix on my hotels or apartment TV. But last night, it says that it wasn’t part of my household network (yea, cuz I am out of town). \n\nI reached out to the customer service and they said I can just update my household and it will give me 2 weeks while my family at home won’t be affected. I did what he instructed and my partner just called me saying that our netflix is not working at home.\n\nI reached out again and the agent said that I can only log in to tvs on the same network at a time and I should only watch through other media like phone or tablets while I am traveling. Then what’s the point of paying for multiple devices when I can’t even watch comfortably when I am traveling?? Aren’t their slogan watch anything from anywhere?\n\nDoes anyone know if there is a way to bypass it?\n\nThank you!",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1o9bcry/travelling_and_cant_watch_netflix_on_tv/"
    },
    {
        "id": "1o9fbx0",
        "author": "Dunder6002",
        "title": "In Creeped Out, episode \"A Boy Called Red\" did the aunt know Vincent travelled back in time?",
        "content": "**ENDING SPOILERS D:** plz watch it before continuing!!!\n\nI rewatched Creeped Out after a few years, and now just finished watching s1 ep9 \"A Boy called Red\" and in the end, Vincent's aunt gives him a wink and it got me thinking; Did she know Vincent was Red the entire time and that he changed the past? Instead of falling into the well where the ball of light (the portal) was, he teleported back to the future (his timeline) by touching the portal while it was in the garden?\n\n(She told Vincent his dad changed after he saw his childhood friend called Red fall into the well and disappeared forever. She also witnessed it too.)\n\nLike, did she know? Did she know that originally, Red fell into the well, but then decided to change the future by not doing it? Hinting the wink in the ending scene? Or at least she was somehow aware Vincent (Red) changed the future? And also, how did they not notice that Vincent looked exactly like his dads childhood friend? (...they don't know he time travelled and was the same person.) Cuz there's gotta be more than just her believing there was something weird with the house, right?\n\nOr am I just overthinking it over a PG-rated series?\n\nTL;DR I'm wondering if Vincent’s aunt knew he was actually Red and that he changed the past. The wink at the end got me thinking that if she aware of the altered timeline and that Vincent was Red?\n\nIt's all speculations and theories, I wanna hear what you guys think! Gimme your opinions :P",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o9fbx0/in_creeped_out_episode_a_boy_called_red_did_the/"
    },
    {
        "id": "1o9ed5i",
        "author": "graemeisverytired",
        "title": "Ross Duffer doubts that streaming will ever see another story like Netflix's Stranger Things",
        "content": "\"When we started,\" Duffer said, \"It was very early Netflix, \\[...\\] And I don’t know how many more opportunities there are going to be to tell stories of this length on that size canvas. So whenever I have the regrets that Matt was saying, I’m excited that we were able to take advantage of this very specific period of time in the industry.\"\n\nMore: [https://www.thepopverse.com/tv-stranger-things-season-5-ross-duffer-netflix-streaming-spin-off/](https://www.thepopverse.com/tv-stranger-things-season-5-ross-duffer-netflix-streaming-spin-off/)",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o9ed5i/ross_duffer_doubts_that_streaming_will_ever_see/"
    },
    {
        "id": "1o8aq54",
        "author": "Dariusgamer2007",
        "title": "Anyone else just can’t seem to watch Netflix anymore?",
        "content": "I don’t know if I’m going through a ‘burnt out’ phase with Netflix but I just can’t bring myself to watch new things anymore. Plenty of movies and series but when I try to watch one I just exit Netflix. Is it possible to be burnt out from watching movies &amp; series? ",
        "upvotes": 220,
        "comments": 121,
        "media": null,
        "permalink": "/r/netflix/comments/1o8aq54/anyone_else_just_cant_seem_to_watch_netflix/"
    },
    {
        "id": "1o8rj29",
        "author": "tyblake02",
        "title": "The Residence needs a season 2",
        "content": "I'm not done with the show yet so please no spoilers but I hate that Netflix canceled this show! How do you cancel a Emmy nomination show after only one season? ",
        "upvotes": 20,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1o8rj29/the_residence_needs_a_season_2/"
    },
    {
        "id": "1o9b8cz",
        "author": "purplerain0411",
        "title": "I just finished Olympos and… I HATE Amaia. Here’s why.",
        "content": "First off — yes, her mom is horrible. Nobody deserves that.\n\nBut can we stop excusing everything Amaia does just because her mother pressures her? She’s not the only one under pressure.\n- Zoe gets it from her parents.\n- Christian lives in his brother’s shadow.\n- Renata’s fighting her own battles.\n- The coaches never stop pushing everyone.\n\nThey all deal with it differently. Some even dope (which is bad, obviously).\nBut Amaia? She goes beyond cheating — she sabotages people.\n\nIt’s one thing to dope to be better.\nIt’s another to literally endanger your teammates just to feel superior.\n\nHer ego is insane:\n- Always needs to be the center of attention.\n- Gave Zoe a hard time for no reason.\n- Treats her “best friend” Roque like trash.\n- Constantly yells and criticizes instead of motivating her team.\n\nWhen Nuria broke her record, the first thing Amaia thought was “she must be doping.” Her ego just couldn’t handle being outperformed.\n\nAnd then? She almost drowned a teammate because she didn’t get the info she wanted. Fatima literally had to stop her. Like… WHAT.\n\nShe’s also a total hypocrite.\n- Preaches anti-doping but spikes Fatima’s drink and even pushes her down the stairs?!\n- Visits Fatima in the “hospital” and doesn’t even care about her — only about the duet and her own image.\n\nHonestly, sabotaging others is way worse than doping.\n\nI’ll give her credit: calling NADA was the right thing to do. Fair play matters.\nBut let’s be real — with all the awful stuff she’s done, Amaia’s no better than the rest of the cheaters.\n\nShe’s selfish, reckless, and completely lost in her own ego.\n\nSorry not sorry, but Amaia is the villain of the show. 😤",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o9b8cz/i_just_finished_olympos_and_i_hate_amaia_heres_why/"
    },
    {
        "id": "1o9b1dn",
        "author": "ilovemeloball",
        "title": "Cassandra vs Cobweb",
        "content": "I watched the show Cassandra a few months ago and I really enjoyed it, and last night I watched the new movie Cobweb. However, I noticed the ending with the sister being hid in the walls by her parents for being deformed was literally the same as Cassandra’s daughter in that show. Just found it interesting and I think it lowkey ruined the ending of Cobweb. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o9b1dn/cassandra_vs_cobweb/"
    },
    {
        "id": "1o8rk3m",
        "author": "Adolfo1980",
        "title": "Favorite series with episodes 40 min or less",
        "content": "Work nights have been getting longer and some days the wife and I don't have time for a 60 min episode before we have to get to bed.\n\nWhat are some good recommendations for series with episodes 30-40 minutes in length?",
        "upvotes": 18,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1o8rk3m/favorite_series_with_episodes_40_min_or_less/"
    },
    {
        "id": "1o9atte",
        "author": "Scared_Report3009",
        "title": "Dystopian rec",
        "content": "I need some good dystopian movies or shows I’m currently watching the 100 and just finished the divergent series. I loved the hunger games. So anything that is similar to those I think I’d enjoy? ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1o9atte/dystopian_rec/"
    },
    {
        "id": "1o9arlz",
        "author": "Sad_Engineering_802",
        "title": "In search of a removed movie",
        "content": "Hey guys, I vaguely remember this movie from long ago in Netflix when I got really into animation as a child (The Secret of Kells was my go to when I was little!). I was wondering if I could describe this film and see if anyone could identify the movie:\n\nI don’t remember very much about the plot of the movie, but I do remember that it was hand drawn possibly before 2009 and it was one of the suggestions on Netflix right after you finished the secret of Kells. It recommended this movie it was a full length feature and extremely colorful, and for some reason in my mind, it was kind of surrealist/ multi genre. I know that it was taken off Netflix ~10 years ago so this may be a long stretch.\n\nDoes this ring a bell with anybody? It could’ve been a foreign language film, but I’m pretty sure that it was dubbed in English.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o9arlz/in_search_of_a_removed_movie/"
    }
]