[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 5,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1mwcfdh",
        "author": "Complex_Lynx_8546",
        "title": "SUSHI?!?!🍣",
        "content": "Ciao ragazzi,\n\nCerco qualche anima per andare a mangiare sushi domani sera o sabato sera perché non avrei voglia di stare a casa… Io mi sono trasferito da qualche mese a Torino, proponete voi il locale..",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mwcfdh/sushi/"
    },
    {
        "id": "1mwf33s",
        "author": "Equal-Cauliflower813",
        "title": "Qualche ragazzo che si vuole conoscere dal vivo?",
        "content": "F24 Domani vado a pinerolo non conosco nessuno li si prospetta una noia mortale qualcuno che ha voglia di uscire nei prossimi giorni cosi tanto per se non avete nulla da fare????\n\nA torino proprio città non sono mai stata avete qualche direzioni da darmi per andare da qualche parte per non morire da sola nelle campagne vuote di pinerolo? Sto solo una settimana ",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1mwf33s/qualche_ragazzo_che_si_vuole_conoscere_dal_vivo/"
    },
    {
        "id": "1mwezqs",
        "author": "BonusProper7385",
        "title": "Zona aurora (corso vercelli)",
        "content": "Ciao, sto per trasferirmi a Torino e sto prendendo in considerazione un appartamento su corsi Vercelli, nella parte vicina alla dora, è vivibile? Ossia, quanto è più alto il rischio di essere derubati rispetto alle altre zone di Torino? ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mwezqs/zona_aurora_corso_vercelli/"
    },
    {
        "id": "1mw8tp5",
        "author": "Intelligent-Tart-287",
        "title": "San Donato Area",
        "content": "I’m thinking about renting a house at San Donato, a few streets under Corso Regina Margherita. I wonder what people of Turin think about this area in general and how good it is in terms of transportation, etc. Thank you! ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1mw8tp5/san_donato_area/"
    },
    {
        "id": "1mwd4j1",
        "author": "Strange-Inflation689",
        "title": "i am starting masters degree at IUC Turin in Jan 2026. any tips on where to stay and things i should know before moving?",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mwd4j1/i_am_starting_masters_degree_at_iuc_turin_in_jan/"
    },
    {
        "id": "1mwbxit",
        "author": "CookTraditional6164",
        "title": "question about jobs",
        "content": "Hello everyone I am an older student of the politecnico (27M now) that left torino after covid because of various issues and after 5 years i decided to come back to torino to finish my bachelors degree (hahaha  i know). I wanted to ask you how impossible is finding a job in torino these days? My italian is basically non existant and ideally i would want something part time while finishing the degree , of course I know english at a very good level , maybe something in the tourist sector? I have also thought about the delivery driver thing , maybe buying an electric scooter to do it but as far as I remember it was fairly oversaturated and not very easy  to get orders. Any ideas? Secondly, while I already have a friend group in the city I am also  looking to meet some new people so anyone that will  be new to the city and looking for some buddies  hit me up.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1mwbxit/question_about_jobs/"
    },
    {
        "id": "1mw7hzc",
        "author": "Zorganight",
        "title": "Best mobile package for Italy",
        "content": "Hello everyone, I’ll be coming to Torino in September for my Erasmus and staying for about 5–6 months. I’m looking for a mobile package, but I’m not sure which provider or plan to choose. I’ve checked Vodafone, but I'm not sure. Since I’ll also be traveling around Europe, it would be great if the package includes other EU countries. Any recommendations?",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1mw7hzc/best_mobile_package_for_italy/"
    },
    {
        "id": "1mw41xh",
        "author": "Floofs-In-Space",
        "title": "Short* bike rides? *45 minutes to 120 minutes.",
        "content": "Ciao. I just moved to Turin. I'm looking for short rides around town. Something around an hour or two. \n\nI'm open to all road surfaces, but prefer dirt and gravel. But I'm on a cross-country mountain bike.  \n  \nI live near Porto Nuova.  \n\n",
        "upvotes": 1,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1mw41xh/short_bike_rides_45_minutes_to_120_minutes/"
    },
    {
        "id": "1mw3c45",
        "author": "Broad-Comedian2529",
        "title": "Dove grigliare?",
        "content": "Esistono parchi in città dove sia possibile e legale fare una grigliata? Non vorrei dovermi spostare dalla città se possibile. Ho visto persone grigliare al Dora e alla Pellerina, ma non so se si possa fare.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mw3c45/dove_grigliare/"
    },
    {
        "id": "1mvkft8",
        "author": "No-Ant-9038",
        "title": "Panchine nel parco",
        "content": "Perché le panchine del parco in cui vado, in zona Crocetta, sono la maggior parte girate al contrario, verso il muro e non verso il parco? Mi passa la voglia di fumare un cannone seduto siccome sarei troppo imparanoiato girandomi verso io muro🥲",
        "upvotes": 9,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mvkft8/panchine_nel_parco/"
    },
    {
        "id": "1mvu81k",
        "author": "CrowNo7009",
        "title": "Aiuto, prima volta a Torino, prima volta allo stadio per Juve-Inter",
        "content": "Ciao\n\nIl 13 settembre 2025 sarò a Torino per assistere alla partita Juventus-Inter, che si giocherà alle 18:00. L'aereo arriverà a Torino alle 14:00 del 13 settembre. L'hotel è vicino alla stazione di Torino Porta Nuova. Il 14 partirò da Torino.\n\nPensavo che dall'aeroporto sarei andato in hotel, avrei fatto il check-in, avrei lasciato la valigia e sarei andato allo stadio. Guardando Google Maps sembra che dall'aeroporto a Torino Porta Nuova ci vorranno circa 50-60 minuti, e poi altri minuti per arrivare da Porta Nuova all'Allianz Arena.\n\nÈ la prima volta che assisto a una partita italiana e non so quanto saranno affollati autobus/treni/metropolitana e ovviamente non voglio perdermi la partita.\n\nPuoi aiutarmi dicendomi:\n\n1. A che ora dovrei mettermi in coda all'ingresso dello stadio? 2. Quali mezzi di trasporto dovrei usare dall'aeroporto all'hotel e dall'hotel allo stadio?\n2. Ci sono linee ferroviarie/autobus/metropolitane speciali che collegano \"Torino Porta Nuova\" allo stadio?\n\nVisto che è la mia prima volta a Torino, cosa mi consigli per mangiare o vedere?\n\nGrazie",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1mvu81k/aiuto_prima_volta_a_torino_prima_volta_allo/"
    },
    {
        "id": "1mvtfnq",
        "author": "Friendly-Army-7729",
        "title": "cerco amicizie (anche per qualcosa di serio) lgbt",
        "content": "ciao, mi chiamo Alessio e ho 22 anni. Mi piacerebbe conoscere qualcuno di interessante qua a torino. Mi piace molto fare passeggiate e discutere di arte, musica etc. Sono una persona molto solare. Se qualcuno fosse interessato, me lo dica senza problemi. Lascio anche il mio profilo instagram per sicurezza @thealejoooooooooo",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mvtfnq/cerco_amicizie_anche_per_qualcosa_di_serio_lgbt/"
    },
    {
        "id": "1mv9pf3",
        "author": "Live-Drag635",
        "title": "Proteine e creatina a buon prezzo",
        "content": "Ciao raga,\nSono nuovo in questo mondo e sto cercando proteine e creatina senza spendere troppo. Avete qualche consiglio su dove comprarle?\nGrazie mille in anticipo!!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mv9pf3/proteine_e_creatina_a_buon_prezzo/"
    },
    {
        "id": "1muophm",
        "author": "BeginningRace8883",
        "title": "Ci sono tifosi del Toro qui? Domanda sulle trasferte",
        "content": "Ciao a tutti,  \nsono al mio secondo anno da abbonato in Curva Maratona. Non sono italiano, ma mi sono trasferito a Torino e mi sono subito legato al Toro, alla sua storia e al suo spirito (anche perché mi ricorda molto la squadra che tifavo a casa mia).\n\nVolevo chiedere: qualcuno sa se per le trasferte – tipo quella contro l’Inter settimana prossima e in generale per le partite fuori casa – vengono organizzati pullman o viaggi di gruppo dai gruppi di tifosi (UG, TH, CAST ecc.)?\n\nMi piacerebbe unirmi, conoscere gente e vivere la scena al massimo, andando a più trasferte possibile quest’anno \n\nGrazie in anticipo!",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1muophm/ci_sono_tifosi_del_toro_qui_domanda_sulle/"
    },
    {
        "id": "1mupqy5",
        "author": "DirectInteraction825",
        "title": "Piste di atletica",
        "content": "Ciao a tutti, \n\nSono nuovo a Torino, e sto cercando una pista di atletica dove poter correre la sera dopo il lavoro. \n\nNota 1: Non cerco squadre o allenatori, solo una pista dove poter correre da solo (eventualmente con altra gente che come me si allena in contemporanea sulla pista). \n\nNota 2: quando mi alleno random vado al Valentino, ma per provare qualche lungo mi piacerebbe avere una pista. \n\nNota 3: meno costa meglio è. \n\n",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mupqy5/piste_di_atletica/"
    },
    {
        "id": "1mucxi0",
        "author": "pisia",
        "title": "Chiese più belle di Torino?",
        "content": "Ieri passeggiando sono entrata nella Chiesa dei Santi Angeli Custodi e sono rimasta ammaliata dalla sua bellezza, con le decorazioni neogotiche piene di angeli ovunque, e ho pensato che a Torino c'è della bellissima arte sacra che non è molto valorizzata. Quali sono le vostre chiese preferite a Torino? Anche la Gran Madre la trovo stupenda e molto particolare, a metà tra un tempio pagano e una chiesa, e la cappella di Lourdes in Santa Giulia è una piccola perla. Menzione disonorevole alla Chiesa del Santo Volto di quel minchione di Mario Botta che se la gioca come chiesa più brutta d'Italia.",
        "upvotes": 11,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1mucxi0/chiese_più_belle_di_torino/"
    },
    {
        "id": "1mulzdy",
        "author": "KaleidoscopeKey6439",
        "title": "Errore ore iscrizione MBA università Torino",
        "content": "Ciao ragazzi,\n\nsto cercando di iscrivermi all'MBA offerto dalla Saa School of Management (Università di Torino) ma, quando seleziono il corso di mio interesse, non mi fa procedere in quanto mi appare il seguente messaggio:\n\n\"Funzione non accessibile. L'utente non ha i permessi di accesso a questa funzione.\"\n\nQualcuno ha avuto lo stesso problema, oppure sa come risolvere?\n\nHo contattato l'università, mi hanno detto che mi avrebbero fatto sapere ma ancora nulla.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mulzdy/errore_ore_iscrizione_mba_università_torino/"
    },
    {
        "id": "1mudhv2",
        "author": "SwrileyJones",
        "title": "Hiking without a car - Seeking advice",
        "content": "Hello everyone! I am planning to go to Torino for the first time in september/October and am really want to do some hiking. I am having a hard time finding good routes that are available by public transport that does not take several hours to the start, and am wondering if you know about any that I might be missing. \nI am open to sharing a car or with someone if they wish to or contribution with gas money and snacks. Or just joining a guided mountain tour would also be nice. Every advice is highly appreciated!\n\nLove from Sweden",
        "upvotes": 6,
        "comments": 17,
        "media": null,
        "permalink": "/r/torino/comments/1mudhv2/hiking_without_a_car_seeking_advice/"
    },
    {
        "id": "1mupxfu",
        "author": "Abbronzatissimo",
        "title": "Dove mangiare per il compleanno",
        "content": "Ciao a tutti, M29, sto cercando un ristorante dove mangiare cena con la mia compagna, F28, questo sabato per il suo compleanno.\nCi va bene anche un ristorante pettinato, però abbiamo alcune condizioni: lei non mangia carne e in particolare maiale/salumi, la mangia non di maiale solo se fatta bene, io sono celiaco.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mupxfu/dove_mangiare_per_il_compleanno/"
    },
    {
        "id": "1mupw9h",
        "author": "gloopie21",
        "title": "dove posso trovare i gashapon a torino?",
        "content": "titolo",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mupw9h/dove_posso_trovare_i_gashapon_a_torino/"
    },
    {
        "id": "1mupeen",
        "author": "_pigreco_",
        "title": "ciclo meccanico aperto",
        "content": "ciao, mi si è allentata la cassetta posteriore della mia MTB. dato il mio di fiducia sta chiuso ne avete uno aperto da consigliarmi. a torino città ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mupeen/ciclo_meccanico_aperto/"
    },
    {
        "id": "1munx3h",
        "author": "AdMundane2565",
        "title": "Come arrivare all’aeroporto da Barriera di Milano coi mezzi pubblici?",
        "content": "Per giovedì mattina. Immagino ci vorrà un po’ di tempo in più, ma che mezzi dovrei prendere?",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1munx3h/come_arrivare_allaeroporto_da_barriera_di_milano/"
    },
    {
        "id": "1muhdc5",
        "author": "Gexea",
        "title": "Rivenditori Pokemon",
        "content": "Sto cercando negozi che vendano bustine e box Pokémon a prezzi non maggiorati. Ho fatto un giro alle Gru e in alcune edicole di Santa Rita ma per il momento, chi più chi meno, hanno gonfiato un po’ i prezzi. Visto che aprendo Maps escono una miriade di risultati speravo che qualcuno potesse aiutarmi a fare un po’ di scrematura. Grazie in anticipo 🫶🏼",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1muhdc5/rivenditori_pokemon/"
    },
    {
        "id": "1mug7mq",
        "author": "sarahhhh05",
        "title": "conoscete monopolio immobiliare?",
        "content": "sto cercando casa a torino, e tra i vari annunci continuo a trovarne alcuni di un’agenzia immobiliare chiamata “monopolio immobiliare”. negli annunci mettono sono la planimetria e le foto degli esterni. non so se fidarmi, dato che so dell’esistenza di agenzie che chiedono soldi per accedere a database di appartamenti. qualcuno di voi ha già avuto esperienze con loro? ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1mug7mq/conoscete_monopolio_immobiliare/"
    },
    {
        "id": "1mumin1",
        "author": "jouteix9093",
        "title": "Visited torino today.....",
        "content": "Me and my parents came from Grenoble (France) to Turin this morning.\n\nTo our surprise, everybodys closed and we can't get transport tickets '-'.\n\nThis is the first time we come across a city where you cant buy tickets from a bus stop or tram stop (we tried 6 stops, they're all with little to no information about where to even get tickets)\nAnd train stations, I found one GTT agency inside them (took an e scooter at some point), there was 30 people queue, and when I asked the lady, she advised me to not wzit here and go outside look for tobacco shop :|.\n\nSpent 3 hours walking going over 10 tobacco shops to find them all closed, so we are stuck in the hotel near the Flixbus station, and everything worth visiting is 40 mins walk away.\n\nDownloaded the official tickets app, it requests fiscal number, Im a young student with no fiscal number and my parents arent EU citizens.\n\nWe asked some locals as to why is everyone closed, we're visiting. They said that the whole city basically shuts down for a while after the 15th of august.\n\nWe've visited many countries late august over the past few years, and this is the first time we stumble upon such thing.\n\n300 euros gone to waste .... :/",
        "upvotes": 0,
        "comments": 25,
        "media": null,
        "permalink": "/r/torino/comments/1mumin1/visited_torino_today/"
    },
    {
        "id": "1mtx7yh",
        "author": "sezam97",
        "title": "Is Porto Palazzo a safe area to stay",
        "content": "Ciao everybody, I’m sorry for writing in English but I don’t know Italian at all. \n\nMe and my friends are planning to visit your beautiful city in late September for 5 days and we found a place to stay that is near Porta Palazzo. I just wanted to know if the area is safe as some people in the reviews are calling it sketchy, but maybe they are just overreacting. We are 4 men, so we should be fine but we would still like to avoid any confrontation especially at night.\n\nIf you don’t recommend it, then what are some better areas to stay in?\n\nThanks in advance",
        "upvotes": 5,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1mtx7yh/is_porto_palazzo_a_safe_area_to_stay/"
    },
    {
        "id": "1mtmsht",
        "author": "Powerful-Branch-6956",
        "title": "Cerco un’amica per condividere la passione per la montagna ⛷️🏂",
        "content": "Ciao! 🌸 Sono una ragazza di 34 anni di Torino e sto cercando **un’amica** con cui condividere la passione per la montagna ed iscriversi assieme a uno sci club.  \nSto seguendo un corso di snowboard (sono principiante :)), ma va benissimo anche se fai sci: l’importante è avere una compagna con cui andare in montagna, divertirsi e crescere insieme nello sport.\n\nSo che è ancora presto per pensare alla prossima stagione, ma mi piacerebbe già cominciare a conoscere qualcuna con cui organizzarsi. ❄️",
        "upvotes": 9,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1mtmsht/cerco_unamica_per_condividere_la_passione_per_la/"
    },
    {
        "id": "1mtw6hq",
        "author": "Miserable_Pop_3115",
        "title": "parrucchiere donna colore",
        "content": "ciao, mi serve una correzione colore, li vorrei sul ramato, che non mi spenni, diciamo che sono disposta a pagare max 120 comprensivo di frangia/piega/colore, grazie!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mtw6hq/parrucchiere_donna_colore/"
    },
    {
        "id": "1mtvfa5",
        "author": "gloopie21",
        "title": "giornata a tema arabo a torino?",
        "content": "la mia ragazza è un amante della cultura araba e vorrei portarla per il suo compleanno in giro per torino tra i posti più belli culturalmente arabi, avete qualche idea?",
        "upvotes": 1,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1mtvfa5/giornata_a_tema_arabo_a_torino/"
    },
    {
        "id": "1mtyjnj",
        "author": "Sensitive_Cellist493",
        "title": "Nuovi amici👍",
        "content": "Cerchiamo qualcuno con cui far amicizia e fare magari qualche uscita di sera tra amici, cerchiamo gente tranquilla, min. 15 anni max 18, zona Madonna di campagna 😁🤐😁👍😁👍👍👍👉🏻👈🏻🎀",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mtyjnj/nuovi_amici/"
    }
]