[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 46,
        "comments": 139,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mfcfh4",
        "author": "SoftPois0n",
        "title": "‘Fubar’ Canceled By Netflix After 2 Seasons",
        "content": "",
        "upvotes": 127,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1mfcfh4/fubar_canceled_by_netflix_after_2_seasons/"
    },
    {
        "id": "1mfapqn",
        "author": "cieje",
        "title": "the best phrase on Netflix? \"limit series\"",
        "content": "I'd much rather know beforehand that a show will intentionally have an actual ending, than hoping Netflix decides to renew something.\n\nI was really hoping the contract from the WGA strikes would've included a requirement that a certain % of contacts were multi-year or something. having the writers worried about getting renewed all the time leads to bad writing. and unfinished plots.\n\nedit well, \"limited series\" I'm sure you get it.",
        "upvotes": 33,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1mfapqn/the_best_phrase_on_netflix_limit_series/"
    },
    {
        "id": "1mffkvv",
        "author": "self-fix",
        "title": "KPop Demon Hunters 2 And 3 Are Heading To Netflix, Says Report",
        "content": "",
        "upvotes": 14,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mffkvv/kpop_demon_hunters_2_and_3_are_heading_to_netflix/"
    },
    {
        "id": "1mep55y",
        "author": "Cynthiaaxxxx",
        "title": "A show you stumbled upon with zero expectations but ended up loving",
        "content": "There are times you just press play on something random and then boom, you’re hooked. Wondering what Netflix series or movie took you by surprise in a good way.",
        "upvotes": 411,
        "comments": 1195,
        "media": null,
        "permalink": "/r/netflix/comments/1mep55y/a_show_you_stumbled_upon_with_zero_expectations/"
    },
    {
        "id": "1mf3pz6",
        "author": "Careless_Leg_6513",
        "title": "My Oxford Year",
        "content": "Sooo. What is with the guy having a secret disease hiding in every gig he works at, first bridgerton, now this. Lol\nAnd Sofia needs to do some other roles. I feel like all of her movies are kind of the same. The damsel in distress and ends up saving the whole tribe. ",
        "upvotes": 39,
        "comments": 56,
        "media": null,
        "permalink": "/r/netflix/comments/1mf3pz6/my_oxford_year/"
    },
    {
        "id": "1mfm6m0",
        "author": "amigoreview",
        "title": "When \"4K\" Isn’t Really 4K on Netflix",
        "content": "Just following-up on some 4K discrepancies on Netflix for the Australia/UK/US regions. Thanks to [4kfilmdb](https://4kfilmdb.com) for exposing these titles falsely advertised as 4K.\n\n1) **Dolittle (2020)**\n\n* **Advertised:** 4K Dolby Vision/HDR10+ (Netflix AU/UK)\n* **Reality:** HD 1920x1080, **no 4K at all!**\n\n2) **Ferris Bueller’s Day Off (1986)**\n\n* **Advertised:** 4K Dolby Vision (Netflix US)\n* **Reality:** Nowhere near 4K, **HD only** (despite the badge).",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mfm6m0/when_4k_isnt_really_4k_on_netflix/"
    },
    {
        "id": "1mffecm",
        "author": "StingVay",
        "title": "Can someone help me find my favorite childhood movie?",
        "content": "When i was a kid i watched an animated movie on netflix that ive tried to find everyhwere but no matter what i search i cant find it so i thought id ask here. From what i remember the premise was something like 3 kids were the \"chose ones\" and sent to go through time or soething like that, and accompanying each of them was a little mythical creature that helped them in their journey, and i remember that the evil person that was trying to stop them also had 3 kids that had little magical beasts, and near the end the plot twist was that the 3 \"evil\" kids were actually the chosen ones and they actually were the ones who had to save the day so they all teamed up and beat the villain. I know its not alot to go off of but thats pretty much all i can remember, if someone knows what im talking about please let me know ive been searching for years!",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1mffecm/can_someone_help_me_find_my_favorite_childhood/"
    },
    {
        "id": "1mf3cl8",
        "author": "PTsarC",
        "title": "“Too much” was total shite",
        "content": "Here I was thinking it would be a funny “eat pray love” kinda show. With selflove and healing in the spotlight. The type of show you want to see when you’re just feeling down and you need some sort of boost of empowering. \n\nJessica is not too much, she is just childish. Plus, what’s up with the constant sexscene’s? Almost a porn for teens if you tell me. ",
        "upvotes": 25,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1mf3cl8/too_much_was_total_shite/"
    },
    {
        "id": "1mfjnd3",
        "author": "suru_24",
        "title": "My Oxford Years",
        "content": "Just finished my oxford year on Netflix.\n\nWell!!!! let me give some tea if you are yet to watch.\n\nCorey - omg treat to the eyes. \nSofia - still needs to work on her expressions.\n\nStoryline - who has read the book they know about the ending but, the movie makers made it worse.\nI love the chemistry but after the birthday party, it's like we all are waiting for James to just die.. \nI knew what was coming when started watching yet I ruined my Friday evening.\n 5/10 - for one time watch.\n1/10 - re-watch \n10/10 - Corey's face card!!!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mfjnd3/my_oxford_years/"
    },
    {
        "id": "1mflypw",
        "author": "javster2",
        "title": "Is the quality better on a PS5 or PC?",
        "content": "I know that the best device for quality streaming is a tv with native app. But if my pc has similar performance to a ps5, which one would have better quality considering both are using the same 4k monitor? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mflypw/is_the_quality_better_on_a_ps5_or_pc/"
    },
    {
        "id": "1mfgeuu",
        "author": "MsLadybug_theTeacher",
        "title": "Netflix Household Rule Changes?",
        "content": "I know that back in 2023, Netflix was “cracking down on password sharing” by creating all the Household rules. \n\nHowever, I thought that laptops, tablets, and phones were exempt from the Household rules due to the traveling exemptions. (Meaning that since you take these devices traveling, they don’t necessarily fall under the Household rules.)\n\nI use a family member’s account, but I only use it on my laptop or phone. This has worked for me up until today (August 1, 2025). I was watching Netflix just last night on my laptop and last weekend on my phone and I had no issues.\n\nHas anyone else just today/this month started having problems like this? \n\nThe only theory my family has is that Netflix decided to put on further enforcements on their rules as of this month (August 2025), but I haven’t seen anything online to support this theory.",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1mfgeuu/netflix_household_rule_changes/"
    },
    {
        "id": "1mfeap9",
        "author": "An_Obese_American",
        "title": "New update",
        "content": "Are there still categories I can find? I used to go to the categories, and then standup comedy. I feel like a boomer already, why do they update what’s not broken. I scrolled all the way down, and found things like “athletic teen shows”, why is that a category. ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mfeap9/new_update/"
    },
    {
        "id": "1mfiavl",
        "author": "Hizzle3003",
        "title": "Are you still watching??",
        "content": "Does anyone know how to turn this function on?? I somehow turned it off but I want it back!! When you google it all you get is how turn it off. I’ve tried to reverse it but that hasn’t worked.\nIt used to guide me when it was time for bed😂😂",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mfiavl/are_you_still_watching/"
    },
    {
        "id": "1mfgyny",
        "author": "closetexistentialist",
        "title": "Former Netflix Executive Alleges Gender Bias and Sexual Harassment in Lawsuit",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mfgyny/former_netflix_executive_alleges_gender_bias_and/"
    },
    {
        "id": "1mfgt2l",
        "author": "gregsbrain",
        "title": "Two houses and Netflix is an absolute PITA",
        "content": "We go back and forth between two houses every week and have to re-aurhorize Netflix every f'ing time. This is just so.stupid. I am sure they can easily tell that we go between two locations and that we are never accessing Netflix from both locations at the same time. Grrrr!",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mfgt2l/two_houses_and_netflix_is_an_absolute_pita/"
    },
    {
        "id": "1mf41nk",
        "author": "Chinawhite777",
        "title": "Good recommendation if you are a geek like me and like swords and magic (Shadow and Bone)",
        "content": "In my opinion very well written. I don't know if it is underrated. But only found it after ChatGPT recommended series to me. It is luckily not one of those fake series which don't seem natural. This one seems pretty high quality to me.",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mf41nk/good_recommendation_if_you_are_a_geek_like_me_and/"
    },
    {
        "id": "1mfd63x",
        "author": "Beatroot_lover",
        "title": "Netflix isn't loading",
        "content": "Okay so I was tryna watch mlp so ofc I open Netflix on my laptop. Problem is nothings loading. I only seeike the top bar with home, TV shows... Etc. Everything else like on the screen is blank. I go check it in my phone and Netflix works perfectly in there. So idk what's going on. I would try to log out but j can't press anything. I've also tried turning My laptop on and off again. And the problem isn't with wifi since everythjng else works. Perfectly. Also if it helps I'm using Opera gx",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mfd63x/netflix_isnt_loading/"
    },
    {
        "id": "1mfiv7h",
        "author": "catatron2005",
        "title": "Blindspot has to be the weirdest tv show",
        "content": "Like not objectively but it’s all steady cam footage, and it looks like it’s been written in ai. Is this what all of those Netflix shows that you skip past bc it’s the same ai generated slop are like",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mfiv7h/blindspot_has_to_be_the_weirdest_tv_show/"
    },
    {
        "id": "1meq56g",
        "author": "rohanad1986",
        "title": "'Emily in Paris' actor says he was devastated after being 'fired' from show: 'A tragedy'",
        "content": "",
        "upvotes": 16,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1meq56g/emily_in_paris_actor_says_he_was_devastated_after/"
    },
    {
        "id": "1mfa8v4",
        "author": "Dolly9019",
        "title": "Adolescence episode 1",
        "content": "I've avoided content about this show as much as possible, so please no spoilers.\n\nQ1. Is it realistic that there would be armed police at the arrest of a 13year old who was in bed at home?\n\nQ2. Why do they same his name so much? E.g. Jamie I'm just going to ask you some questions. Is that OK Jamie? Is it to kind of 'ground' him?\n\nDuring the arrest and when he is first being processed, they use a language and phrases that aren't part of everyday conversation. I was surprised Jamie said he understood. When the officer was telling him about his detention, I was lost 🙈",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1mfa8v4/adolescence_episode_1/"
    },
    {
        "id": "1mf0z97",
        "author": "Warm_Wear_1495",
        "title": "Ad glitches make watching certain scenes technically impossible",
        "content": "Once netflix started forcing ads ive had this issue anytime an ad comes up:\nThe video freezes, stutters, glitches then the ad plays. Once it ends, the video glitches and freezes and stutters then SKIPS FORWARD the video im watching by 15 seconds. If I try to rewind w the skip 10 second button it launches me before the ad, then glitches and brings me back to where it skips forward. I cant even drag the time to during the physical ad, it just glitches me forward. I have missed so many scenes because of this issue, anybody else have this?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mf0z97/ad_glitches_make_watching_certain_scenes/"
    },
    {
        "id": "1mfbbrk",
        "author": "Kevy-Em",
        "title": "Will there be a roast this year?",
        "content": "Last year the Tom Brady roast did so well, I'm hoping there will be another one this year, I'm really hoping Adam Sandler or Eminem will be the next celebrity",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mfbbrk/will_there_be_a_roast_this_year/"
    },
    {
        "id": "1mf5ulx",
        "author": "indiewire",
        "title": "Best New Movies on Netflix August 2025",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mf5ulx/best_new_movies_on_netflix_august_2025/"
    },
    {
        "id": "1mestl5",
        "author": "Entrepreneur-ecom",
        "title": "Help Test My Netflix Straw! [Survey]",
        "content": "Hi All, \n\nPlease help me make a decision.!\n\nI made a hands-free illuminated straw for binge-watching in bed. \n\nhttps://forms.gle/9MMSdVPDwWJfx53j7. \n\nFeedback on design and pricing welcome!\n\n\nThanks!",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mestl5/help_test_my_netflix_straw_survey/"
    },
    {
        "id": "1mel55u",
        "author": "Cobydraws19",
        "title": "AWFUL Tooth Drilling Wednesday Ad",
        "content": "I listen to podcasts while I’m at work &amp; I need to talk about this fucking Netflix ad for “Wednesday” that I heard yesterday. \n\nIt goes: “Hi I’m Wednesday Adams blah blah here’s a recording I had made of my root canal” and then like 10-15 seconds of EARSPLITTING TOOTH DRILLING SOUNDS, followed by “Wednesday season 2, only on Netflix”. \n\nI IMMEDIATELY clamped my lips over my teeth. \n\nI shouldn’t even have to justify why this is a visceral and physically uncomfortable concept for an ad, but I’m at work in the shipping industry, on 10 foot ladders with my hands literally full. I can’t skip it. \n\n“Wednesday morbid hehe” I DONT WANT THAT SHIT UP IN MY EARBUDS! My teeth HURT!!\n\nI want this off air IMMEDIATELY. Reaching out to the other victims of this ad lol",
        "upvotes": 10,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1mel55u/awful_tooth_drilling_wednesday_ad/"
    },
    {
        "id": "1mebxal",
        "author": "RCAPU",
        "title": "Hunting Wives and Wigs",
        "content": "Just finished watching the first season. It was entertaining. However I could not get over the wigs on Margo and Callie. They were so bad. If they get a season 2, I hope they fix that. Totally distracting.",
        "upvotes": 29,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1mebxal/hunting_wives_and_wigs/"
    },
    {
        "id": "1mex77b",
        "author": "DreamOn2020",
        "title": "Scandal hits differently after a second watch",
        "content": "13 years ago I watched Shonda Rhimes’ Scandal for the drama and salaciousness, but the political side of the show always went over my head. Boy, does it hit differently now! I don’t think I even bothered to finish the series but now I’m engrossed because I understand exactly what’s happening, all the terminology, each character’s job, the lies, the deceit, the fixes, and it feels scary-real. Is this just a work of fiction or was it clever foreshadowing?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1mex77b/scandal_hits_differently_after_a_second_watch/"
    },
    {
        "id": "1mfceke",
        "author": "Powerful_Gate_4871",
        "title": "Am i tripping or Malin akerman in The Hunting Wives looks like a older Lana del rey",
        "content": "Okay, hear me out. I might be spiraling a little here but I SWEAR I’m not alone. I just started watching The Hunting Wives, and the second Malin Åkerman stepped on screen I had to pause and rewatch her entrance like three times because I genuinely thought Lana Del Rey had gone full method actress and snuck into a limited series for fun.\n\nLike seriously, THE VIBE IS UNCANNY.\n\nIt’s not just the bone structure (though, let’s talk about that flawless symmetry and those cheekbones that could slice glass). It’s the whole ethereal, vintage glamor-meets-smoldering-siren aesthetic. Malin is channeling ultra soft-focus noir queen energy, and that’s LDR’s entire brand. The pouty lips? Check. The dreamy bedroom eyes that look like they’ve seen a thousand tragedies and three failed love affairs? Double check. That effortless blend of elegance and danger? Like… are you kidding me.\n\nEven the styling in The Hunting Wives is doing some heavy lifting in this comparison. The hair is big, brushed out, and retro glam. The wardrobe? Draped in silk and southern charm, with that “I may look like I bake pies but I’ve definitely buried secrets in the backyard” energy. It’s basically Born to Die era Lana meets Chemtrails Over the Country Club if it were a thriller.\n\nAnd don’t even get me started on the voice. Malin’s got that low, honey-dipped register that feels like it should be narrating an Old Hollywood murder ballad. Tell me she couldn’t say “my baby’s in the bar with his dandelion wine” and make it sound like a threat and a lullaby.\n\nI don’t know if this is brilliant casting, a weird timeline crossover, or my brain just doing somersaults—but I’m not letting this one go. Malin Åkerman = future Lana Del Rey. You heard it here first. Someone cast them as mother and daughter in a twisted psychological thriller IMMEDIATELY.\n\nAnyone else see it or am I losing it?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mfceke/am_i_tripping_or_malin_akerman_in_the_hunting/"
    },
    {
        "id": "1mf7bk3",
        "author": "Ok-Lychee-2155",
        "title": "Sure Happy Gilmore 2 wasn't that funny but man that storyline sucked",
        "content": "Sorry for another HG2 post...\n\nSo it didn't need to be hilarious and honestly my humour expectations were pretty low. The storyline expectations and what they'd do with all the characters though, was much higher. \n\nThe Maxi Golf concept was really good and current with Liv Golf but the execution was so damn bad.\n\nAll it needed to be was Shooter and Gilmore teaming up with 2-3 of the cameo golfers (probably Scheffler and fuck if it could've been Tiger, or even Daly!) and having playoff with other actual golfers, or actors who seemed like golfers, in a more grounded maxi/standard golf playoff. The first half being Gilmore actually getting good at golf again and being courted along with Tiger and Shooter to bring back fan favourites.\n\nAlso, this might be a stretch, but Stiller could've quietly brought back White Goodman from Dodgeball and been the man behind Maxi golf. Vanessa didn't need to be dead, the motivation to \"save golf\" was enough.\n\nI expected that as it was a sequel to something which is one of the most quoted comedies of all time to be bigger in scale but it overall looked really cheap, and the scale actually felt smaller than the first movie.\n\nAlso - it's one of the most quoted and rewatched movie of all time, why did they have to literally replay the old jokes?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1mf7bk3/sure_happy_gilmore_2_wasnt_that_funny_but_man/"
    },
    {
        "id": "1mdzg0u",
        "author": "Emondm24",
        "title": "Happy Gilmore 2 thoughts",
        "content": "I enjoyed it.  I quite enjoyed the video game like golf challenge during the last twenty minutes, it had the nice kind of the screw ball comedy that fits in this kind of world.  I liked seeing Ben Stiller return, the MJF and Becky roles, Haley Joel Osment having a key role.  He had the beard in his small role in the Boys so I knew who he was.  Didn’t like Shooters face turn.  Paying homage to the ones no longer with us was respectful.",
        "upvotes": 68,
        "comments": 86,
        "media": null,
        "permalink": "/r/netflix/comments/1mdzg0u/happy_gilmore_2_thoughts/"
    }
]