[
    {
        "id": "1lcwoxq",
        "author": "SonyPictures",
        "title": "Danny Boyle Here: Ask Me Anything.",
        "content": "Hello Reddit! Director Danny Boyle here. \n\nI'm back, and I’m excited to answer your questions about my new film 28 Years Later. It's starring Aaron Taylor-Johnson, Jodie Comer and Ralph Fiennes and is out in UK cinemas on June 19th and US movie theatres on June 20th. \n\nI'll be online from 5pm BST on Tuesday June 17th - drop your questions below and I hope to answer as many as I can. Speak soon!\n\nhttps://preview.redd.it/ro4j9kivca7f1.jpg?width=788&amp;format=pjpg&amp;auto=webp&amp;s=391f46c6bc5fb615d471e7a15d601d977e765eb9\n\n\n\n&gt;**Edit** Director Danny Boyle here. Hello Reddit! Thanks for participating in the AMA about my new film 28 Years Later. Catch it in UK, cinemas June 19th, in US movie theatre June 20th.",
        "upvotes": 1502,
        "comments": 688,
        "media": null,
        "permalink": "/r/movies/comments/1lcwoxq/danny_boyle_here_ask_me_anything/"
    },
    {
        "id": "1lfdn01",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Celine Song - Friday 6/20 at 1:00 PM ET - Oscar-Nominated Director and Writer of A24's 'Past Lives' and 'Materialists'",
        "content": "",
        "upvotes": 92,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8h8fbj4qjw7f1.png?auto=webp&amp;s=e7a085a11d3bb5ab106edd091d7de1a8f3172a47"
        },
        "permalink": "/r/movies/comments/1lfdn01/amaqa_announcement_celine_song_friday_620_at_100/"
    },
    {
        "id": "1lfbvly",
        "author": "MarvelsGrantMan136",
        "title": "David Lynch Script for Unfinished Film 'Ronnie Rocket' Sells for $150,000 at Auction; Director’s chair goes for $70,000, while personal copy of 'Mulholland Drive' fetches $98,000",
        "content": "",
        "upvotes": 3412,
        "comments": 134,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3529q3Qk2svFARglZuBGp-koFkTgCc9S0pf61uCNSpA.jpeg?auto=webp&amp;s=e66c050a0964d36553ae9254984413b7c3a2348d"
        },
        "permalink": "/r/movies/comments/1lfbvly/david_lynch_script_for_unfinished_film_ronnie/"
    },
    {
        "id": "1lfjann",
        "author": "BunyipPouch",
        "title": "M. Night Shyamalan's next film, 'Remain', has begun filming. The supernatural romantic-thriller stars Jake Gyllenhaal &amp; Phoebe Dynevor, with plot details remaining under wraps.",
        "content": "",
        "upvotes": 724,
        "comments": 162,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Vr0vIx2Mkkal47mLgmrE6bFGyUN6ZgeAae6Dh_-Epnc.png?auto=webp&amp;s=ff90e158740a311980722b0937ccedb9cd8bb85f"
        },
        "permalink": "/r/movies/comments/1lfjann/m_night_shyamalans_next_film_remain_has_begun/"
    },
    {
        "id": "1lf7lrz",
        "author": "Task_Force-191",
        "title": "New poster for ‘Chainsaw Man: The Movie -Reze Arc’",
        "content": "",
        "upvotes": 2490,
        "comments": 306,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2t1rrk3n4v7f1.jpeg?auto=webp&amp;s=a06252642300039efa0b842d17b70e827347e243"
        },
        "permalink": "/r/movies/comments/1lf7lrz/new_poster_for_chainsaw_man_the_movie_reze_arc/"
    },
    {
        "id": "1lfpfv1",
        "author": "MrGittz",
        "title": "Here is an RARE UNUSED Teaser for Ghostbusters 2 which plays like a parody of a late night infomercial commercial. Part of it was used in the finished film.",
        "content": "",
        "upvotes": 168,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JRV2XCKb7eiQOb80yJMK3ZaPcktsnxPUsdEFtuBBpr4.jpeg?auto=webp&amp;s=b060bf2187ea9549a28e14ddf667e87a37527a6c"
        },
        "permalink": "/r/movies/comments/1lfpfv1/here_is_an_rare_unused_teaser_for_ghostbusters_2/"
    },
    {
        "id": "1lfeh0b",
        "author": "Fritja",
        "title": "Chinese Studios Reveal Plans for AI-Powered Remakes of Classic Kung Fu Movies from Bruce Lee, Jackie Chan and Jet Li",
        "content": "",
        "upvotes": 662,
        "comments": 183,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gt2pjVk8XPE3JIWXEVrQf9KUzgw7AGPIx3AeJBEIwoY.jpeg?auto=webp&amp;s=c77c09ca92e52608c132551825b9744f28f4d049"
        },
        "permalink": "/r/movies/comments/1lfeh0b/chinese_studios_reveal_plans_for_aipowered/"
    },
    {
        "id": "1lfj2oi",
        "author": "indiewire",
        "title": "‘Mission: Impossible’ Exit Interview: Stunt Coordinator Wade Eastwood Looks Back at a Decade with Tom Cruise",
        "content": "",
        "upvotes": 264,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MR_5Hs9cHd6ey5ZhxxYxCKCyn6ViT_nPWssZuL-EKT4.jpeg?auto=webp&amp;s=c68eeb06b14cccf6889789022eea390868fa6b60"
        },
        "permalink": "/r/movies/comments/1lfj2oi/mission_impossible_exit_interview_stunt/"
    },
    {
        "id": "1lfchde",
        "author": "NoCulture3505",
        "title": "'The Last Emperor' Screenwriter Mark Peploe Dies at 82",
        "content": "",
        "upvotes": 452,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/UpY3pkYnmcndAwLDqLSLhHZNFavB7F7xX7e099gUEHU.jpeg?auto=webp&amp;s=ce5a75c644ff1379773184d3413ecf69a9f33ef7"
        },
        "permalink": "/r/movies/comments/1lfchde/the_last_emperor_screenwriter_mark_peploe_dies_at/"
    },
    {
        "id": "1lfjgfw",
        "author": "UsefulWeb7543",
        "title": "What’s your Opinion on Promising Young Woman?",
        "content": "I like to ask about what are your opinions and thoughts about a movie Promising Young Woman? It came out in 2020. It's one of the critical acclaimed films and written by Emerald Farrell and stars Carey Mulligan. She gave one of the stunning powerful performances in the movie. She should've won academy award for her role. ",
        "upvotes": 182,
        "comments": 202,
        "media": null,
        "permalink": "/r/movies/comments/1lfjgfw/whats_your_opinion_on_promising_young_woman/"
    },
    {
        "id": "1lfk3dd",
        "author": "UsefulWeb7543",
        "title": "What’s your opinion on The Iron Claw?",
        "content": "I watched the Iron Claw movie. I was so devastated and crying. It made my heart broke and the performances especially Zac Efron gave the greatest ones playing a biopic wrestling character in the true events. The movie was disturbed by A24. It's sad and heartbreaking. Has anyone seen it or What's your opinion on The Iron Claw? Tell me about it.",
        "upvotes": 116,
        "comments": 186,
        "media": null,
        "permalink": "/r/movies/comments/1lfk3dd/whats_your_opinion_on_the_iron_claw/"
    },
    {
        "id": "1lfnbps",
        "author": "lilsxclusive",
        "title": "What’s one movie you wish you could watch again for he first time?",
        "content": "Not just any old great movie, I mean the one that had you hooked by the balls, just drop that one film that just hit differently first time round and nothing has been able to replicate. Could be a dramatic plot twist or just out right brilliant production or just something that resonated with your life at that time. Drop yours below and I’ll go first ",
        "upvotes": 68,
        "comments": 329,
        "media": null,
        "permalink": "/r/movies/comments/1lfnbps/whats_one_movie_you_wish_you_could_watch_again/"
    },
    {
        "id": "1lf5tfl",
        "author": "neuro_space_explorer",
        "title": "A discourse on The Flintstones Movie, and how it was misunderstood in an era of film excess.",
        "content": "This discussion is based on a recent viewing of The Flintstones Movie, a film that despite everts review of as a hallmark of my childhood and easily understood. \n\nThis might be in my mind the most underrated adaptation of a cartoon right next to Speed Racer. If you google it you find it holds a 5/10 IMDb rating, a 2.5/4 star Ebert review and a 23% rotten tomato score. \n\nFirst of all this might be the best casting I’ve seen in any adaptation ever. The writing is so on point it feels like a perfect blend of nineties satire and 50s humor. The star of the show is the effects, costume and set design. \n\nEbert says in his 2.5 star review: “This is a great-looking movie, a triumph of set design and special effects, creating a fantasy world halfway between suburbia and a prehistoric cartoon. The frame is filled with delightful and inventive notions, all based on the idea that modern America might somehow be reconstructed out of rocks. Just watching it is fun.”\n\nHe continues: \n\n“Still, there is a lot to praise here. The best way to describe the look of this movie is to say that the physical world of the cartoon series and the comic strip has been translated to live action with no compromise. The cars that run on foot-power, for example, look as clunky and heavy as in the original drawings, but somehow plausible, too (and there’s a great early scene where the Flintstones motor out to the drive-in to see a movie “Tar Wars,” of course). All sorts of consumer products and office equipment and supplies are reproduced in stone, and the costumes are a combo of caveman chic and suburban ready-to-wear. On the heels of “Jurassic Park,” it’s also fun to see a variety of prehistoric dinosaurs.”\n\nAnd yet we lived in an era where these great achievements weren’t enough to be a great film, but going back today with the vision of hindsight it does. \n\nIt’s a magical film that captures the imagination purely through world building.\n\nWhat are your thoughts? Overrated? Underrated? ",
        "upvotes": 734,
        "comments": 173,
        "media": null,
        "permalink": "/r/movies/comments/1lf5tfl/a_discourse_on_the_flintstones_movie_and_how_it/"
    },
    {
        "id": "1lesfjc",
        "author": "ChiefLeef22",
        "title": "'28 Years Later' - Review Thread",
        "content": "Director: Danny Boyle\n\nCast: Jodie Comer; Aaron Taylor-Johnson; Ralph Fiennes; Alfie Williams\n\n**Rotten Tomatoes:** [100%](https://www.rottentomatoes.com/m/28_years_later)\n\n**Metacritic:** [82/100](https://www.metacritic.com/movie/28-years-later/)\n\nSome Reviews:\n\n[Manila Bulletin - Philip Cu Unjieng](https://mb.com.ph/2025/06/18/the-28-legacy-continues-a-review-of-28-years-later)\n\n&gt;What’s nice to note is how Boyle has cast consummate actors in this film, the type who could read off a label of canned sardines and still find depth, emotion, and spark in the delivery of those lines. Initially, it seems that Taylor-Johnson will be doing the heavy lifting. Still, it merely misleads us, as the narrative then focuses on Jodie Comer’s Isla and onto Fiennes’ Dr. Kelson. I want to give a special shout-out to the young actor Alfie Williams. He is the one carrying the whole film, and this is his first feature film work, having previously done a TV series. Boyle teases out an excellent performance from the lad, and I won’t be surprised if many film reviewers in the forthcoming week will single him out as being the best thing in this film. And what’s impressive is how he manages this with the three heavyweight thespians who are on board.There’s the horror and the suspense as a given for this cult franchise, but look out for the human drama and the emotional impact. It’s Boyle and Garland elevating the film, and rising above its genre.\n\n[AwardsWatch - Erik Anderson](https://awardswatch.com/28-years-later-review-danny-boyles-iphone-shot-zombie-sequel-is-audacious-disjointed-and-bewildering-b/) \\- 'B'\n\n&gt;Most of the time, *28 Years Later* is frequently begging to be rejected by general audiences, even as it courts the admiration of longtime fans, who may nonetheless find themselves put off by the film’s turn toward unearned emotion, its relatively meager expansion of this universe, and its occasionally jarring tonal shifts. (The abrupt sequel-teasing stinger feels like it’s from an entirely different strain of the zombie subgenre.) Much like the virus at the series’ center, it’s a film whose DNA is constantly mutating, resulting in an inconceivable host subject—one that is both corrosive and something of a marvel.\n\n[DEADLINE - Damon Wise](https://deadline.com/2025/06/28-years-later-review-danny-boyle-jodie-comer-zombie-horror-1236436839/)\n\n&gt;Most threequels tend to go bigger, but *28 Years Later* bucks that trend by going smaller, eventually becoming a chamber piece about a boy trying to hold onto his mother. It still delivers shocks, even if the sometimes over-zealous editing distracts from Anthony Dod Mantle’s painterly cinematography\n\n[The Hollywood Reporter - David Rooney](https://www.hollywoodreporter.com/movies/movie-reviews/28-years-later-review-jodie-comer-aaron-taylor-johnson-1236294541/)\n\n&gt;One of the chief rewards of *28 Years Later* is that it never feels like a cynical attempt to revisit proven material merely for commercial reasons. Instead, the filmmakers appear to have returned to a story whose allegorical commentary on today’s grim political landscape seems more relevant than ever. Intriguing narrative building blocks put in place for future installments mean they can’t come fast enough.\n\n[NextBestPicture - Josh Parham](https://nextbestpicture.com/28-years-later/) \\- 7/10\n\n&gt;Boyle’s exuberant filmmaking and Garland’s incisive script sometimes clash when forced to muddle through laborious exercises that feel borrowed from the previous films anyway. It’s a scenario that reminds me of Ridley Scott’s “Prometheus” and “Alien: Covenant,” two films with intriguing ideas that struggled to fashion them within the framework of the established franchise. Perhaps the continuation will find more clever avenues to explore further and enrich this text. As is, what is left is imperfect but still an enthralling return into a dark but provocative world.\n\n[IndieWire - David Ehrlich](https://www.indiewire.com/criticism/movies/28-years-later-review-1235133645/) \\- 'B+'\n\n&gt;While Boyle isn’t lofty enough to suggest that the infected are beautiful creatures who deserve God’s love or whatever (this is still a movie about wild-eyed naked zombies, after all, and its empathy for them only goes so far), “28 Years Later” effectively uses the tropes of its genre to insist that the line between a tragedy and a statistic is thinner than we think, and more permeable than we realize. The magic of the placenta, indeed. \n\n[Rolling Stone - David Fear](https://www.rollingstone.com/tv-movies/tv-movie-reviews/28-years-later-review-danny-boyle-1235353364/)\n\n&gt;Taken on its own, however, Boyle and Garland’s trip back to this hellscape makes the most of casting a jaundiced, bloodshot eye at our current moment. Their inaugural imagining of a world torn asunder surfed the post-millennial fear that modern society wasn’t equipped to handle something truly catastrophic. This new movie is blessed with the knowledge that something always rises from the ashes, but that the risk of regressing back to some fabricated mythology of a Golden Age, complete with *Henry V* film clips and St. George’s flags, is there on the surface as well. If postapocalyptic entertainment has taught us anything, it’s that the walking dead aren’t always the gravest threat. It’s those who sacrifice their soul and sense of empathy that you have to watch out for.\n\n[The Wrap - William Bibbiani](https://www.thewrap.com/28-years-later-review-danny-boyle/)\n\n&gt;For now, though, “28 Years Later” stands on its own — or at least, as its own temporary capper on this multi-decade series — and it stands tall. The filmmakers haven’t redefined the zombie genre, but they’ve refocused their own culturally significant riff into a lush, fascinating epic that has way more to say about being human than it does about (re-)killing the dead.\n\n[Variety - Peter Debruge](https://variety.com/2025/film/reviews/28-years-later-review-1236435361/)\n\n&gt;Where the original film tapped into society’s collective fear of infection, its decades-later follow-up (which undoes any developments implied by “28 Weeks Later” with an opening chyron that explains the Rage virus “was driven back from continental Europe”) zeroes in on two even most primal anxieties: fear of death and fear of the other. To which you might well ask, aren’t all horror movies about surviving an unknown threat of some kind? Yes, but few have assumed the psychic toll taken by such violence quite so effectively as “28 Years Later,” which has been conceived as the start of a new trilogy, but towers on its own merits (part two, subtitled “The Bone Temple,” is already in the can and expected next January).",
        "upvotes": 3522,
        "comments": 1097,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_kOOIuTo1rVcfa-MtVh0MDHmhqKB_4DqOunXAInL7rU.jpeg?auto=webp&amp;s=1ee730cc813ea0bf7037a2a06930ab70904b2553"
        },
        "permalink": "/r/movies/comments/1lesfjc/28_years_later_review_thread/"
    },
    {
        "id": "1lex5b7",
        "author": "Legalize_Canada",
        "title": "What's the worst case you've seen of a trailer spoiling a movie?",
        "content": "The latest Alien film is guilty of this. Multiple character deaths shown in the trailers. And not just quick jump cuts or shots where you can't see their faces. Clearly shown character deaths in the trailer. \n\nI've gotten to where I don't even watch trailers anywhere. I would rather avoid spoilers and go in blind. ",
        "upvotes": 1738,
        "comments": 1397,
        "media": null,
        "permalink": "/r/movies/comments/1lex5b7/whats_the_worst_case_youve_seen_of_a_trailer/"
    },
    {
        "id": "1lepn3p",
        "author": "MarvelsGrantMan136",
        "title": "New Image of Russell Crowe as Hermann Goring in James Vanderbilt's 'Nuremberg' - Chronicles the true story of the eponymous trials held by the Allies against the defeated Nazi regime.",
        "content": "",
        "upvotes": 3515,
        "comments": 268,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/a86vh7jwhq7f1.jpeg?auto=webp&amp;s=e658ed38b4c17d6dca298bd1ef68c87a708da27f"
        },
        "permalink": "/r/movies/comments/1lepn3p/new_image_of_russell_crowe_as_hermann_goring_in/"
    },
    {
        "id": "1lekuy3",
        "author": "TylerFortier_Photo",
        "title": "James Cameron's The Abyss Pulled From Disney+ in the UK Because of Banned 'Rat Abuse' Scene - IGN",
        "content": "&gt;James Cameron’s beloved sci-fi film [The Abyss](https://www.ign.com/movies/the-abyss) **has been removed from Disney+ in the UK due to the inclusion of a banned scene.**\n\n&gt;The original version of the 1989 film **includes a scene in which a rat is dunked into a vat of fluorocarbon liquid — and a real rat** ***was*** **used in production**. The rodent is believed to have survived, but **that didn’t stop groups like charity The Royal Society for the Prevention of Cruelty to Animals (RSPCA) from taking steps to have the scene removed 36 years ago.**\n\n&gt;The scene was **subsequently cut by the British Board of Film Classification (BBFC) under the Cinematograph Films (Animals) Act 1937, which means it must be cut for any theatrical use**. The BBFC **also cut the scene under the Video Recordings Act 1984, meaning it must not be included on releases on formats such as Blu-Ray and DVD. Similarly, the scene should also not be aired on traditional TV in the UK.**\n\n&gt;Despite this, a **version of the film that included the banned scene was added to Disney+ a few months ago in April**. In response, the RSPCA called out what it described **as a \"loophole\" that enabled the banned rat scene to make it onto Disney+ in the UK, pointing out that streaming platforms are not bound by the same standards as film releases in cinema, DVD, or on traditional television.**",
        "upvotes": 6332,
        "comments": 1083,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GMBzDK9xFLlYU1HQA8hZ-nRYvQSXuuArSGtjawoHui8.jpeg?auto=webp&amp;s=510f193641a96eb1a6349a8537bbf27c57f42e15"
        },
        "permalink": "/r/movies/comments/1lekuy3/james_camerons_the_abyss_pulled_from_disney_in/"
    },
    {
        "id": "1lex5lx",
        "author": "ggroover97",
        "title": "How PG Became Hollywood’s Hottest Rating",
        "content": "",
        "upvotes": 980,
        "comments": 98,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BeHoZyChPFjJxzZu3ODP3WNGa1CipjjyGm50_3jxFC4.jpeg?auto=webp&amp;s=4f7f3324aa93012c99b1fa4552dff6d6a2860ac0"
        },
        "permalink": "/r/movies/comments/1lex5lx/how_pg_became_hollywoods_hottest_rating/"
    },
    {
        "id": "1lfp6o1",
        "author": "geekbydefault",
        "title": "Which movie music made the biggest impact on you?",
        "content": "For me it was, without a doubt, \"Hello Zep\" playing at the end scene of SAW. From the relief thinking Adam got the bad guy to this song starting up, realizing we were duped.\n\nNever seen a crowd go so silent and traumatized and to this day that song gives me goosebumps.\n\nWhat song or music from a movie had a similar impact on you?",
        "upvotes": 14,
        "comments": 63,
        "media": null,
        "permalink": "/r/movies/comments/1lfp6o1/which_movie_music_made_the_biggest_impact_on_you/"
    },
    {
        "id": "1lfg5y6",
        "author": "Sudden-Victory240",
        "title": "What’s one movie that genuinely motivated you—and how did it impact your life afterward?",
        "content": "I’m looking for movies that truly left a mark on you—not just entertaining ones, but something that made you want to change your life, work harder, or see things differently. Whether it’s a biopic, drama, or even a sports film—what movie lit that fire in you, and what did you do after watching it? I’d love to watch something that helps me reset and recharge.\n",
        "upvotes": 43,
        "comments": 91,
        "media": null,
        "permalink": "/r/movies/comments/1lfg5y6/whats_one_movie_that_genuinely_motivated_youand/"
    },
    {
        "id": "1lfhek2",
        "author": "SanctimoniousSally",
        "title": "Movies you continue to think about long after watching",
        "content": "When I watch something (whether I liked it or not), my thoughts don't tend to linger but quickly move on to the next thing. Occasionally, I'll come across a movie that really sticks with me. Even weeks later, I'll still be thinking about it. Mulling it over. And I don't necessarily have to think it's a great film. But for whatever reason, I just can't shake it for weeks or more after watching.\n\nThe one that really burrowed it's way in was Once Upon A Time In Hollywood. Now I thought this movie was fine. Good even, if not slow in parts. The acting was predictabley great but overall just an okay film for me. But I just couldn't stop thinking about it after watching and I don't know why. Maybe it's the \"what if\" ending. I'll probably never really know.\n\nI've also experienced this with Blade Runner 2049 and a handful of others.\n\nSo I'm just curious if other people encounter this and what their experiences are like? What movies haunted you and did you know why?",
        "upvotes": 28,
        "comments": 163,
        "media": null,
        "permalink": "/r/movies/comments/1lfhek2/movies_you_continue_to_think_about_long_after/"
    },
    {
        "id": "1lep0p9",
        "author": "BunyipPouch",
        "title": "Francis Ford Coppola‘s epic 'Megalopolis' will be touring six cities this summer accompanied by the five-time Oscar winning filmmaker who’ll be holding a live discussion and Q&amp;A alongside the film screening.",
        "content": "",
        "upvotes": 1892,
        "comments": 299,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kqf3DUfqRx0DK97QI1wVhK31GDF6Dd7YDhMN76x5AR4.jpeg?auto=webp&amp;s=862d240e585e36f02e17f631581a88e542820a5d"
        },
        "permalink": "/r/movies/comments/1lep0p9/francis_ford_coppolas_epic_megalopolis_will_be/"
    },
    {
        "id": "1lexbg4",
        "author": "MarvelsGrantMan136",
        "title": "‘Dragon’s Lair’: James Bobin in Talks to Direct Video Game Adaptation for Ryan Reynolds, Netflix",
        "content": "",
        "upvotes": 503,
        "comments": 95,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/k49gz-x1GDfgSOP2Dz813cRLdlVMjxTkgoowFDJQfSg.jpeg?auto=webp&amp;s=a8f48358e70d3466d7e8b9c09514181fc25629c6"
        },
        "permalink": "/r/movies/comments/1lexbg4/dragons_lair_james_bobin_in_talks_to_direct_video/"
    },
    {
        "id": "1lei130",
        "author": "parallelogramm3r",
        "title": "Demolition Man",
        "content": "I’m rewatching this, it’s probably been 10 years since I’ve seen it. It’s got a pretty mediocre rating on IMDB but I think it is peak 1990’s action movie stuff along with movies like The Rock and Con Air.   \n\nA lot of the futuristic sci-fi elements have aged pretty well and it’s just a fun, well-made action movie.  \n\nBut what I really want to know is how you would use the three seashells.\n",
        "upvotes": 3210,
        "comments": 903,
        "media": null,
        "permalink": "/r/movies/comments/1lei130/demolition_man/"
    },
    {
        "id": "1leu2f7",
        "author": "Savings-Whole-6517",
        "title": "The Gentleman is severely underrated. A gem in a saturated year (2019)",
        "content": "Just rewatched this movie alone in silence at home (recommended ). It’s definitely a film that loses a bunch its nuances when watched with others, it’s like you can’t fully absorb their characters with distractions. \n\nI’m so glad that I had knee surgery and got bored enough to rewatch.\n\nColin Ferrall and Hugh Grant in god mode. McConaughey gave the perfect “Lion” signature role. Best of all was the unassuming and unique acting chops in Charlie Hunnam. Everyone gave this script their best and it shows \n\nAnyone else have a similar experience with this film?\n\nP.S. yes I know it’s a Guy Richie film but that doesn’t make it automatically a great picture, it’s underrated ",
        "upvotes": 565,
        "comments": 162,
        "media": null,
        "permalink": "/r/movies/comments/1leu2f7/the_gentleman_is_severely_underrated_a_gem_in_a/"
    },
    {
        "id": "1lexlsi",
        "author": "Informal-Neck8905",
        "title": "Movies you can never see again.",
        "content": "What are some movies you just can never stomach to watch again.  Clockwork Orange (though the power desensitization is relevant).  Requiem for a Dream afterwards I watched cartoons for hours!!! I can’t understand what a person can gain from the movie other than “drugs are bad, therapist can be dangerous, and seek help when the tv starts to talk TO you”",
        "upvotes": 319,
        "comments": 975,
        "media": null,
        "permalink": "/r/movies/comments/1lexlsi/movies_you_can_never_see_again/"
    },
    {
        "id": "1leq1g8",
        "author": "MrGittz",
        "title": "Ghostbusters 2 has always had the “It’s kid friendlier” label but I always found it WAY more frightening. As a kid Vigo was nightmare fuel. The subway scene? The Bathtub? The slime?",
        "content": "I’m not going to sit here and say the sequel is a better film. It’s awesome, but it’s not overall better. The climax is far too rushed. But I do find it scarier. GB1 has the Dana gets possessed scene. That’s as scary as things get. Ghostbusters 2? Let me introduce you to my boy Vigo The Carpathian. Died at 105 years old. Didn’t die of old age either, he was poisoned, shot, stabbed, hung, disembowelled &amp; drawn &amp; quartered. His last words, just before his head died was “Death is but a door, time but a window, I’ll be back”. Holy crap this guy terrified me as a kid. When he leaves the painting, his snarls, his face? His freaky voice? And that’s all before his final form which is holy shiiiit scary. When his face does that twisty thing? I wonder how they did that before CGI. \n\nThe movie also has a Subway sequence where decapitated heads on pikes appear after Vigo calls out Winston’s name in the dark like a racist ass. Of course he picked Winston. \n\nThen we get the bathtub scene. Oh man. This shit traumatized me. Everytime I saw water running out of a faucet I was convinced mood slime was going to come out and get me.  \n\nMy grandma also had a mink coat and everytime I saw this thing, I poked it wondering if mink heads weren’t going to pop out and bite me. \n\nAnd I don’t think the first film has a sequence as intense as the dark room scene when Ray and Egon are looking at pictures of Vigo and his pictures spontaneously combust while Ray and Egon get locked in. We don’t see Egon or Ray ever panicked as much as they are in that sequence.\n\nHonestly? I don’t think anyone’s gotten Ghostbusters right since the second film. All these sequels and reboots, they just don’t have that secret sauce(the cast &amp; Ivan Reitman as director).  \n\nAs a kid, I had no conception Ghostbusters was suppose to be a comedy. I remember seeing it in the comedy section of our local video store and thinking “are these people insane? Comedy?” Of course as we grow we began to understand the dry sarcasm and jokes. \n\nBut somewhere, maybe because they don’t smoke or swear as much, the sequel got labeled as more kid friendly and I don’t think that’s true.",
        "upvotes": 746,
        "comments": 209,
        "media": null,
        "permalink": "/r/movies/comments/1leq1g8/ghostbusters_2_has_always_had_the_its_kid/"
    },
    {
        "id": "1lfc0q3",
        "author": "indiewire",
        "title": "Gena Rowlands’ 10 Best Performances",
        "content": "",
        "upvotes": 19,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XRj5ohjNGHPKyAQPBRDmNHLtWWX-yiWXhPbrUTpJnhI.jpeg?auto=webp&amp;s=ba29eb1d970ecf3ea0d652c0519393313d6aa317"
        },
        "permalink": "/r/movies/comments/1lfc0q3/gena_rowlands_10_best_performances/"
    },
    {
        "id": "1ler03n",
        "author": "NoCulture3505",
        "title": "Blumhouse Buys ‘Saw’ Stake From Twisted Pictures",
        "content": "",
        "upvotes": 496,
        "comments": 50,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/26LAHa1_XJNIYQ6YDtz6QoprqT5mhMqL_hCBv0U-OT8.jpeg?auto=webp&amp;s=d646390ec66ae408a1b19ef20d27c470f26a9958"
        },
        "permalink": "/r/movies/comments/1ler03n/blumhouse_buys_saw_stake_from_twisted_pictures/"
    },
    {
        "id": "1lfrtg5",
        "author": "facebookboy2",
        "title": "Persian Lessons, now playing on Youtube for free!  Based on a true story of a Jew who pretended to be Persian in order to save his own life (English subtitle availabe if you adjust the translation setting)",
        "content": "Based on a true story.  A Jew's life was spared because he claimed to be Persian.  A German officer made this Jew teach him few words of Persian everyday.  But the Jew taught him a made up Klingon language.  ",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/L5ITStmfs-IsRTxfd1pZ54alPcTA_e6uzEjDkzToFao.jpeg?auto=webp&amp;s=412cb9c9cbfec53c82a361734cbe88a660e87d07"
        },
        "permalink": "/r/movies/comments/1lfrtg5/persian_lessons_now_playing_on_youtube_for_free/"
    },
    {
        "id": "1lezaii",
        "author": "West_Conclusion_1239",
        "title": "The Elephant Man by David Lynch. John Hurt should have been an Oscar winner.",
        "content": "Just watched The Elephant Man by David Lynch, what a powerful, beautiful, and moving film.\n\nJohn Hurt was incredible in it, i simply believed him, every look, every glance, every word.\n\nIt wasn't just a gimmick, he became John Merrick.\n\nIn any other year in which he wasn't against Robert DeNiro in Raging Bull, he would and should have easily won the Oscar, and it would have been one of the most deserved Oscar wins ever.\n\nI think it's one of the greatest male performances of all time, and it's deeply undertalked compared to others.\n\nDo you agree?\n\n",
        "upvotes": 111,
        "comments": 28,
        "media": null,
        "permalink": "/r/movies/comments/1lezaii/the_elephant_man_by_david_lynch_john_hurt_should/"
    },
    {
        "id": "1lefb01",
        "author": "MarvelsGrantMan136",
        "title": "Springsteen: Deliver Me From Nowhere | Official Trailer",
        "content": "",
        "upvotes": 1285,
        "comments": 443,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bK8DBcaSltwNwtz65rqy3UR-FgdQLvPkbMDnnZ924Ug.jpeg?auto=webp&amp;s=8b32036310edfb89ef998da1da82843805f3a1ee"
        },
        "permalink": "/r/movies/comments/1lefb01/springsteen_deliver_me_from_nowhere_official/"
    }
]