[
    {
        "id": "1h17exz",
        "author": "ChandlerAndIsaiah",
        "title": "Hi /r/movies! We're Chandler Levack &amp; Isaiah Lehtinen, director and lead actor of I LIKE MOVIES, a Canadian coming-of-age comedy-drama about a young cinephile working in a video rental store. It premiered at TIFF in 2022 and it's now available to watch in the US! Ask us anything.\n",
        "content": "",
        "upvotes": 124,
        "comments": 119,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3c6c5g82ug3e1.jpeg?auto=webp&amp;s=aa5e31cd04a3f9b3158949b20b8f4b168c07c9d1"
        },
        "permalink": "/r/movies/comments/1h17exz/hi_rmovies_were_chandler_levack_isaiah_lehtinen/"
    },
    {
        "id": "1h0uf7h",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Gladiator II / Wicked: Part I / Moana 2)",
        "content": "[Gladiator II](https://old.reddit.com/r/movies/comments/1gwxxwd/official_discussion_gladiator_ii_spoilers/?)\n\n[Wicked: Part I](https://old.reddit.com/r/movies/comments/1gwxxy1/official_discussion_wicked_part_i_spoilers/?)\n\n[Moana 2](https://old.reddit.com/r/movies/comments/1h0uevk/official_discussion_moana_2_spoilers/?)",
        "upvotes": 23,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1h0uf7h/official_discussion_megathread_gladiator_ii/"
    },
    {
        "id": "1h1whvh",
        "author": "theozarksparkman",
        "title": "Forget actual run time. What's the \"longest\" movie ever?",
        "content": "Last night me and my wife tried to watch The Curious Case of Benjamin Button (we didn't finish it so even tho its been out forever please dont spoil if you can). \n\nThirty min in felt like we were halfway through. We thought we were getting near the end.... nope, hour and a half left.\n\nWe liked the movie mostly. Well made, well acted, but I swear to god it felt like the run time of Titanic and Lord of the Rings in the same movie.\n\nWe're gonna finish it today.\n\nIgnoring run time, what's the \"longest\" movie of all time?\n\nEDIT: I just finished the movie. It was..... pretty good.",
        "upvotes": 8378,
        "comments": 6274,
        "media": null,
        "permalink": "/r/movies/comments/1h1whvh/forget_actual_run_time_whats_the_longest_movie/"
    },
    {
        "id": "1h2d2b1",
        "author": "80severything",
        "title": "Transformers The Movie 1986",
        "content": "This is one of the most insane films aimed at kids ever produced, the daytime cartoon version has lots of action and stuff blowing up but mostly characters come out largely unscathed but not in this big budget animated adaptation.  It basically begins with an all out assault on the autobots and crazy levels of violence and destruction it's like an animated version of the storming of the beach of Normandy from Saving Private Ryan, kids all over the United States were stunned as they watched their favorite characters autobots and decepticons alike are gunned down violently and we watch Optimus Prime himself mow down several decepticon's himself in truck form and the action never really lets up to much.  There hasn't been a Transformers movie that was as awesome as this one is.  ",
        "upvotes": 339,
        "comments": 162,
        "media": null,
        "permalink": "/r/movies/comments/1h2d2b1/transformers_the_movie_1986/"
    },
    {
        "id": "1h24bh9",
        "author": "luchablay",
        "title": "I watched 365 movies this year, and here is what I learned. ",
        "content": "I decided back in January that I wanted to try to stop doom scrolling. And instead of scrolling for 2 hours I would watch a movie instead. Over the course of the month I decided to try to watch the equivalent of one movie a day all year. Well, I finished early and I learned 3 things. \n\n1: People are in entirely too many movies.  I know actors gotta eat, but man, I saw so much cross over from actors in the last 10 years. It got so bad that I started recognizing people who weren’t even IN other movies. \n\n2: You can really tell when a movie has a budget. Watching primary low-mid budget horror movies, you can really tell the difference when a movie has a bit of money to make everything look good. \n\n3: If your movie isn’t 2 hours then it only needs to be an hour and a half. None of this 1:45 nonsense. Either pad it out to 2 hours or ideally, cut it down to a buck thirty.  Especially (not Sexually! lol)  if you are making a horror movie. \n\nCouple of facts: \n\nFirst movie I watched: Cube 2: hypercube\n\nLast movie: Planes trains and automobiles. \n\nBest movie: American Fiction \n\nWorst Movie: The Creeps.  \n\nMovies I watched that I had seen before: 16\n\nMost movies watched in a single day: 5\n\n\nIt’s been a long year and I’ve enjoyed having something else to focus on.  Hope this finds you well, and watch more movies. \n\nEdit: sexually lol \n\nAs requested Top 10: \n\n1: American Fiction\n\n2: biosphere \n\n3: They Cloned Tyrone \n\n4: 1917\n\n5: Maxxxine \n\n6: the Blackening\n\n7: the vast of night \n\n8: The green knight \n\n9: bottoms \n\n10: Shadow in the cloud (seriously I dare you not to love this)",
        "upvotes": 1407,
        "comments": 371,
        "media": null,
        "permalink": "/r/movies/comments/1h24bh9/i_watched_365_movies_this_year_and_here_is_what_i/"
    },
    {
        "id": "1h23iiw",
        "author": "ILikeNeurons",
        "title": "Denzel Washington at 70: his 20 greatest films – ranked! ",
        "content": "",
        "upvotes": 1523,
        "comments": 370,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qfhDBnMdBaneBNnBTyesfmz36DH-SgQQfTo2zrFgxeQ.jpg?auto=webp&amp;s=93d3622618afe13a82a2e351fc243a035de3d4d4"
        },
        "permalink": "/r/movies/comments/1h23iiw/denzel_washington_at_70_his_20_greatest_films/"
    },
    {
        "id": "1h1z7zf",
        "author": "MarvelsGrantMan136",
        "title": "Robert Eggers’ ‘Nosferatu’ Will Screen in 35mm; Runtime Revealed - 2 Hours, 12 Minutes",
        "content": "",
        "upvotes": 2428,
        "comments": 149,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/oyuqCw5xwLREkN9JqnxLNnQOrwAaN9EpIpjVleqEwh8.jpg?auto=webp&amp;s=ed72d46baf4921f8a0a5f46f24e6816e07509548"
        },
        "permalink": "/r/movies/comments/1h1z7zf/robert_eggers_nosferatu_will_screen_in_35mm/"
    },
    {
        "id": "1h2cd4r",
        "author": "tacoreddit",
        "title": "Mexican Cinema Icon Silvia Pianl passes away at 93",
        "content": "",
        "upvotes": 266,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6r4-eyrjSnpchEdVv9h3mYLIRHy4BIYHV5eWvhY2Pt8.jpg?auto=webp&amp;s=90d11880adf78e3510e610260749e72b45042273"
        },
        "permalink": "/r/movies/comments/1h2cd4r/mexican_cinema_icon_silvia_pianl_passes_away_at_93/"
    },
    {
        "id": "1h23ocm",
        "author": "AZSnakepit1",
        "title": "Maleficent took over $750m worldwide. Why has Robert Stromberg never directed another theatrical feature?",
        "content": "Was just rewatching Maleficent, and surprised to discover, despite its commercial success, Robert Stromberg has only directed TV stuff since. Can't think of another movie, taking in over three-quarters of a billion. whose director was one and done. \n\nYou'd think its success would have merited further work. Does anyone know why not? I couldn't immediately find any recent interviews with him where it might be discussed. ",
        "upvotes": 948,
        "comments": 70,
        "media": null,
        "permalink": "/r/movies/comments/1h23ocm/maleficent_took_over_750m_worldwide_why_has/"
    },
    {
        "id": "1h20ob8",
        "author": "BunyipPouch",
        "title": "First Poster for Comedy 'Operation Taco Gary's' - Starring Simon Rex, Dustin Milligan, Brenda Song, Jason Biggs, and Doug Jones - Two brothers embark on a cross country road trip that quickly devolves when they become involved in a global conspiracy.",
        "content": "",
        "upvotes": 663,
        "comments": 141,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/k0i85zh4do3e1.png?auto=webp&amp;s=54212457a70944ae4c582d9618d54a8780085d39"
        },
        "permalink": "/r/movies/comments/1h20ob8/first_poster_for_comedy_operation_taco_garys/"
    },
    {
        "id": "1h2ec41",
        "author": "BunyipPouch",
        "title": "Michael Mann's 'The Keep' - Official 4K Restoration Trailer - Vinegar Syndrome - Supernatural horror cult classic newly restored from its original camera negative and featuring exclusive new interviews with cast and crew.",
        "content": "",
        "upvotes": 71,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/y00wYrmrJnT45pq-KW-DXnYECPkDdjSe_hvLO7mm1-s.jpg?auto=webp&amp;s=6ba777140b86a958082fcd876b341d582c9c1a5d"
        },
        "permalink": "/r/movies/comments/1h2ec41/michael_manns_the_keep_official_4k_restoration/"
    },
    {
        "id": "1h2bygb",
        "author": "Phyliinx",
        "title": "What's this sub's opinion on Rambo number 4? And Rambo in general.",
        "content": "In january of 2025, Rambo 4 will be released in germany after being banned in 2008. To celebrate and profit on that, the distributor chose to release the movie with a special edition, that includes the theatrical cut, the extended cut, special features and 44 booklet pages of information about the creation of the movie. \n\nSo I wanted to know from you: how is this sub's opinion on Rambo 4? And would you say Rambo 1-3 are worth it? Do I need them to understand Rambo 4 or the Rambo character in general? \n\nWhat gets me interested in Rambo 4 is: Stallone wrote, directed and lead it. It's a project full of his passion. ",
        "upvotes": 82,
        "comments": 158,
        "media": null,
        "permalink": "/r/movies/comments/1h2bygb/whats_this_subs_opinion_on_rambo_number_4_and/"
    },
    {
        "id": "1h22vbb",
        "author": "SingSongSalamander",
        "title": "If you could only ever recommend one film for the rest of your life, what would it be?",
        "content": "I'm looking to make a must-watch list that's not just all the standard \"classics\". I'd love to see what people's all time personal favorites are, especially if they are not the usual \"top 100 films of all time\" type lists. If you could only recommend one film to folks ever again, I feel like it would be more interesting to recommend a personal best that's not obvious! All genres welcome, I'm trying to branch out!",
        "upvotes": 287,
        "comments": 1184,
        "media": null,
        "permalink": "/r/movies/comments/1h22vbb/if_you_could_only_ever_recommend_one_film_for_the/"
    },
    {
        "id": "1h29wuf",
        "author": "Silly_Wrongdoer3709",
        "title": "Best movies made from TV shows? ",
        "content": "For example, The Simpson’s Movie from \nThe Simpsons, or El Camino from\nBreaking Bad. \n\nThey’re my two personal favourites. While\nEl Camino was somewhat of a step down from Breaking Bad, it was still a pretty amazing movie, and could’ve been pretty successful as a stand-alone movie, the plot definitely would’ve worked. Was also just a beautiful conclusion to Jesse’s story. \n\nThe Simpson’s Movie was probably my second favourite. The Simpsons is probably one of my favourite TV shows of all time, and my favourite cartoon/animation by far. The movie wasn’t much of a step down from the series and episodes themselves. It was just as funny as most episodes are, but had a lot more emotions in it. I also much preferred the animation style it had than what the series turned into a couple years later. ",
        "upvotes": 93,
        "comments": 175,
        "media": null,
        "permalink": "/r/movies/comments/1h29wuf/best_movies_made_from_tv_shows/"
    },
    {
        "id": "1h1yyoj",
        "author": "BunyipPouch",
        "title": "Monica Barbaro ('Top Gun: Maverick', 'A Complete Unknown') Joins Barry Keoghan, Mark Ruffalo, Chris Hemsworth, Halle Berry, Nick Nolte, and Jennifer Jason Leigh in Jewel-Theft Thriller ‘Crime 101’ from Director Bart Layton ('American Animals')",
        "content": "",
        "upvotes": 297,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5Tk2vFlQsqrlnf03sW4Km_Qx-EeJBxjtvVnXVmZU6kM.jpg?auto=webp&amp;s=f7db01267570c9a522dccf38580521ca0ca3e111"
        },
        "permalink": "/r/movies/comments/1h1yyoj/monica_barbaro_top_gun_maverick_a_complete/"
    },
    {
        "id": "1h23kbh",
        "author": "mitkoboga",
        "title": "What is the scariest movie you've ever watched?",
        "content": "The scariest movie I’ve ever seen is Insidious. It wasn’t just the jump scares—it was the feeling of constant dread. The idea of spirits invading a home, especially the Lipstick-Face Demon, stuck with me. The scenes in “The Further” were so creepy, like stepping into a nightmare you can’t escape. Even the silence in the movie felt tense, and the music made everything worse. What made it scarier was how real it felt—like this could happen to anyone. I couldn’t stop thinking about it afterward, and for days, I kept feeling like something was watching me from the shadows.\n\n",
        "upvotes": 150,
        "comments": 438,
        "media": null,
        "permalink": "/r/movies/comments/1h23kbh/what_is_the_scariest_movie_youve_ever_watched/"
    },
    {
        "id": "1h2ako5",
        "author": "PatientCalendar1000",
        "title": "Silvia pinal one of the last surviving Golden age of Mexican cinema and also the Golden age of Hollywood has passed away at 93",
        "content": "\n\nSilvia Pinal Hidalgo (born 12 September 1931 – 28 November 2024)was a Mexican actress. She began her career in the theater, venturing into cinema in 1949. She was one of Mexico's greatest female stars, star from the Golden Age of Mexican cinema and part of the Golden Age of Hollywood for her film Shark! (1969). Her work in film and popularity in her native country led Pinal to work in Europe (Spain and Italy). Pinal achieved international recognition by starring in a famous film trilogy directed by Luis Buñuel: Viridiana (1961), El ángel exterminador (1962) and Simón del Desierto (1965).",
        "upvotes": 46,
        "comments": 4,
        "media": null,
        "permalink": "/r/movies/comments/1h2ako5/silvia_pinal_one_of_the_last_surviving_golden_age/"
    },
    {
        "id": "1h1zls9",
        "author": "MiserableSnow",
        "title": "Mononoke the Movie: The Phantom in the Rain is out now on Netflix",
        "content": "",
        "upvotes": 190,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QiAF63GXoWsIDbibO5YGl0I43em0LRdCFo0nsw02fiE.jpg?auto=webp&amp;s=0286b90cc959b55364f8ee29d396682f0314844d"
        },
        "permalink": "/r/movies/comments/1h1zls9/mononoke_the_movie_the_phantom_in_the_rain_is_out/"
    },
    {
        "id": "1h2bls2",
        "author": "indiewire",
        "title": "A Weapon Against Oblivion: Fernanda Torres and Selton Mello on ‘I’m Still Here’",
        "content": "",
        "upvotes": 30,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MfJ4BUvSsyx6WYb-17_TcIbo5UCQIsQUYdtMijkUYhQ.jpg?auto=webp&amp;s=e505a7acdee5a600291c7560595916d7634103ae"
        },
        "permalink": "/r/movies/comments/1h2bls2/a_weapon_against_oblivion_fernanda_torres_and/"
    },
    {
        "id": "1h2h2kz",
        "author": "Allison-Cloud",
        "title": "Trippy movie about a kid who dies from an overdose and then watches his sister",
        "content": "Hello everyone! First post here =) I saw a movie years ago about this kid who is running from some people and then ends up overdosing in a bathroom, or getting shot in the bathroom when flushing the drugs. It is one of the two. Then he is watching his sister after he dies. I can't remember the name at all. I thought it was something like \"enter the abyss\" but I can't find anything by that name. There is \"Into the abyss\" but that is not the movie in question.\n\nIf you know this movie please tell me!!",
        "upvotes": 9,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1h2h2kz/trippy_movie_about_a_kid_who_dies_from_an/"
    },
    {
        "id": "1h1lzmx",
        "author": "Jurgy-22",
        "title": "Orlando Bloom",
        "content": "I’m watching Pirates right now and am wondering, with his track record. Being in massive franchises of LOTR and Pirates of the Caribbean, as well as excellent roles in Kingdom of Heaven and Troy, as well as black hawk down. Why was he never Hollywoods Big name for solo movies? I always thought of him as super talented but seems he never got his stand alone big time movies. he always played a great role but never got the shine as Hollywoods next big thing. (Feel free to downvote if I’m being stupid but I’m genuinely curious to see what you guys think). ",
        "upvotes": 2022,
        "comments": 539,
        "media": null,
        "permalink": "/r/movies/comments/1h1lzmx/orlando_bloom/"
    },
    {
        "id": "1h29nl9",
        "author": "OgarTheDead",
        "title": "Watching Every Talking Animal Film Ever Made",
        "content": "[https://docs.google.com/spreadsheets/d/1144NRs5UFEIAS0pyalyBlpLWarsbXmsPb3ap-yuEWYs/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1144NRs5UFEIAS0pyalyBlpLWarsbXmsPb3ap-yuEWYs/edit?usp=sharing)\n\nMe and my friends are embarking upon a long and very stupid journey to watch every single talking animal film (we will later also be creating a Tier List for them). In order to classify as a talking animal film it must meet these two criteria\n\n1. the animal MUST talk (obviously) so human like animals such as snoopy are disqualified\n2. the animal/animals MUST be one of the main protagonists (this leaves a movie like Shrek up to debate as he is a secondary protagonist, leaving open to discussion)\n\nIf we have somehow missed a movie (TV specials do not count) please comment and We will add it to the list, otherwise pray for our sanity. all we've seen so far is the Alvin and the Chipmunk movies and we already went slightly crazy\n\nEdit: Link updated so everyone can view my apologies\n\nEdit 2: [https://letterboxd.com/OgarTheDed/](https://letterboxd.com/OgarTheDed/) Adding my Letterboxed so people can track my progress and I will be creating a weekly/ bi-weekly update post (IMPORTANT: there will be very little if any progress until after December 16th due to IRL schedule freeing up then)",
        "upvotes": 33,
        "comments": 144,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cl_LNySbkLHiLyyXhfmdemzQvPenaJ8MgPHVMOyab6o.jpg?auto=webp&amp;s=8427e45ff97f766654a86478907af44bd545efbe"
        },
        "permalink": "/r/movies/comments/1h29nl9/watching_every_talking_animal_film_ever_made/"
    },
    {
        "id": "1h1qea7",
        "author": "iakgk",
        "title": "Who was the most attractive character you’ve seen in a movie?\n\n",
        "content": "Naturally, this is going to get a lot of different answers, but for me, it has to be Jennifer Connelly in *Career Opportunities*. There's just something mesmerizing about her presence in that movie—the confidence, charm, and that unforgettable scene in the department store—it was absolutely captivating to a younger version of me. Then there’s young Emmanuelle Béart, who exuded such elegance and beauty that it felt almost otherworldly. Those characters and performances left a lasting impression on me and probably defined my early movie crushes. What about you?",
        "upvotes": 726,
        "comments": 1931,
        "media": null,
        "permalink": "/r/movies/comments/1h1qea7/who_was_the_most_attractive_character_youve_seen/"
    },
    {
        "id": "1h22ndy",
        "author": "JonasKahnwald11",
        "title": "Official Poster for 'Inheritance' - Starring Phoebe Dynevor and Rhys Ifans",
        "content": "",
        "upvotes": 78,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/lntwgzpvso3e1.jpeg?auto=webp&amp;s=fc8aaf057552088800be53e0c29397be2c75c839"
        },
        "permalink": "/r/movies/comments/1h22ndy/official_poster_for_inheritance_starring_phoebe/"
    },
    {
        "id": "1h1y335",
        "author": "rusty_85_",
        "title": "Movies you were really excited to show someone, only for them to dislike it or even crap all over it.",
        "content": "Ever been so excited to share one of your favourite movies with someone and then get disappointed by their reaction to it?\n\nI think what bugs me the most is when they barely pay attention to the film and are on their phone or something. Man that annoys me.\n\nI really wanted some of my family to watch Inception because I enjoyed it, but throughout the movie they constantly complained. I know people have different opinions but that was so frustrating.",
        "upvotes": 115,
        "comments": 311,
        "media": null,
        "permalink": "/r/movies/comments/1h1y335/movies_you_were_really_excited_to_show_someone/"
    },
    {
        "id": "1h1928r",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for the Live-Action 'Lilo &amp; Stitch' Movie",
        "content": "",
        "upvotes": 7492,
        "comments": 731,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/roitfglg6h3e1.jpeg?auto=webp&amp;s=9fb9603a48c5350f9852181fac805e04213b8a88"
        },
        "permalink": "/r/movies/comments/1h1928r/new_poster_for_the_liveaction_lilo_stitch_movie/"
    },
    {
        "id": "1h21m30",
        "author": "CammysComicCorner",
        "title": "What's Christopher Guest been up to?",
        "content": "It feels like it's been a minute since we've seen anything by him. *Family Tree* was a fun little series on HBO back in 2013, and then *Mascots* in 2016, and then nothing since! And while *Mascots* wasn't nearly as good as his other films, I was hopeful it was serving as a filler movie before his next big one.",
        "upvotes": 62,
        "comments": 47,
        "media": null,
        "permalink": "/r/movies/comments/1h21m30/whats_christopher_guest_been_up_to/"
    },
    {
        "id": "1h1xtvx",
        "author": "AdvancedSkincare",
        "title": "Planes, Trains, and Automobiles - an older film with so much heart!",
        "content": "I admit, last night was the first time seeing this movie. I’m from the Midwest and was always recommended this movie but never got around to seeing it. I loved it! Not only was John Candy’s performance so moving, but Steve Martin really sold it. Especially during the scene in the bedroom. This has now become a permanent rotation in my holiday films.\n\nWhat’s everyone else think? Any fond memories relating to this film?",
        "upvotes": 77,
        "comments": 56,
        "media": null,
        "permalink": "/r/movies/comments/1h1xtvx/planes_trains_and_automobiles_an_older_film_with/"
    },
    {
        "id": "1h1yo5g",
        "author": "dancingbanana123",
        "title": "What was going on in the Chinese movie industry in the early 80s?",
        "content": "So I was looking at [this list of movies ordered by most box office admissions](https://en.wikipedia.org/wiki/List_of_films_by_box_office_admissions) and I noticed all the top ones are Chinese. At first I figured \"big population, makes sense\" but then I noticed that they're *all* from 1979 to 1985. What's up with that? There are FOUR movies from 1980 alone that had more box office admissions than Titanic (the largest non-Chinese movie in terms of box office admissions). The idea of that many movies from the *same* year being that big is insane to me. What was going on during this period?\n\nI tried asking some Chinese friends of mine, and while they recognized some of the movies, they weren't really sure why it only lasted during this 6 year timeframe. One suggested that the Tiananmen Square incident could've brought an end to it, but that was in 1989, which would still leave an unexplained 4 year gap. I wasn't sure if I should ask this here, r/AskHistorians, or some other sub, but if anyone has any ideas, let me know.\n\nI also noticed a surprising lack of Indian movies, given the reputation of Bollywood and size of India. If population were the sole reason, I would figure India would also take several of the top spots on that list.",
        "upvotes": 57,
        "comments": 9,
        "media": null,
        "permalink": "/r/movies/comments/1h1yo5g/what_was_going_on_in_the_chinese_movie_industry/"
    },
    {
        "id": "1h20tpu",
        "author": "wrathfulgrape",
        "title": "Movies to help distract those who are alone/heartbroken during the holidays?",
        "content": "Crappy last few months and nursing a broken heart and nowhere to go on Thanksgiving. Planning on spending the day with my cat but could use some distraction and comfort in art.\n\nI am sure I am not the only one.\n\nSo are there any recommendations for us? Please, no love stories or family themed films (ie Paddington). All other genres are a go.\n\nFor example, I find Alien and Aliens to be great distractions to get my mind off of my emotions. \n\nThanks.",
        "upvotes": 35,
        "comments": 65,
        "media": null,
        "permalink": "/r/movies/comments/1h20tpu/movies_to_help_distract_those_who_are/"
    },
    {
        "id": "1h23gns",
        "author": "Ok_Office_3217",
        "title": "Detective Loki in Prisoners: A Masterclass in Character and Performance!",
        "content": "Just finished watching Prisoners, and I have to say, Detective Loki stole the show for me.\nThe subtle eye \"tics,\" the tightly buttoned shirt on his solid frame, and that sharp haircut—such a distinct and compelling character! Jake Gyllenhaal’s performance was absolutely top-notch, bringing so much depth to the role.\n\nWhat did you all think of him?\n",
        "upvotes": 20,
        "comments": 13,
        "media": null,
        "permalink": "/r/movies/comments/1h23gns/detective_loki_in_prisoners_a_masterclass_in/"
    },
    {
        "id": "1h2f96r",
        "author": "dcterr",
        "title": "Easter Sunday",
        "content": "I watched Easter Sunday tonight, which is a very funny and entertaining movie! Jo Koy is great in this one, as are many of the other actors and actresses. Although as with most comedies, the story isn't too realistic, I still think it says a lot about the importance of family ties vs. more superficial things, like your job and your personal image. It also says that although most families go through lots of personal drama, they're still perhaps the most important thing in our lives, as well as good friends, and it's important to always remember this, especially during the holidays.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1h2f96r/easter_sunday/"
    }
]