[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 12,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1pgxjw4",
        "author": "sico666",
        "title": "Nuovi amici 2",
        "content": "Siamo 7 amici (f26, 2f28, m28, m29, m26, m31) di Torino e provincia, i nostri interessi in generale gravitano attorno a:\n\n-le feste all'aperto (ci piace la natura)\n-il buon bere\n-il fantasy\n-il cinema\n-i concerti e il teatro\n-le conversazioni profonde\n-sparare cazzate\n- la magia e l'esoterismo\n -le gite\n -la cultura\n -l'arte\n-Igbtq+ \n-videogiochi\nSiamo inclusivi e di mentalità molto aperta, vogliamo ampliare la nostra cerchia. \n\nPer farvi capire chi siamo:\n\n• un intellettuale palestrato con la passione per gli abiti eleganti \n\n• un ragazzo timido, sensibile e introspettivo\n\n• un'artista ADHD un po' punk con la passione per la psicologia e l'horror \n\n• un'antropologa appassionata di esoterismo e concettualità\n\n• un informatico tranquillo e gentile, che quando beve diventa caotico\n\n• una jojobro, strega che ricorda un gatto\n\n•  un ragazzo molto estroverso, con la passione per i vampiri e i profumi ricercati\n\n Astenersi snob, omofobi e razzisti!!!",
        "upvotes": 7,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1pgxjw4/nuovi_amici_2/"
    },
    {
        "id": "1pgra26",
        "author": "spacecraft628",
        "title": "DISCOTECA DAI 35 ANNI IN SU: SONDAGGIO",
        "content": "Ciao a tutti!\n\nSe ci fosse una serata in discoteca pensata principalmente con musica per adulti dai 35 anni in su, dalle 18.00/18.30 fino alle 23.00/24.00, preferireste andare di sabato, di domenica o andrebbero bene entrambi allo stesso modo?\n\nMi aiutate? Grazie!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1pgra26/discoteca_dai_35_anni_in_su_sondaggio/"
    },
    {
        "id": "1pgsd7r",
        "author": "Awkward-Warning-9238",
        "title": "Cenone di Capodanno",
        "content": "Ciao. \n\nSto cercando di prenotare un bel ristorante per Capodanno. Ci saranno 6 adulti, 1 cane da 10 kg e un neonato. \n\nQualcuno ha qualche suggerimento?",
        "upvotes": 2,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1pgsd7r/cenone_di_capodanno/"
    },
    {
        "id": "1pgkupi",
        "author": "salvo_2000",
        "title": "Nuove amicizie",
        "content": "Buongiorno a tutti, siamo 3 amici (io e l’altro mio amico di 19anni e l’altro 20 anni) in giro per Torino e dintorni, sempre pronti a conoscere nuove persone, fare serate tranquille o avventure improvvisate. Se hai voglia di nuove conoscenze genuine, risate e un po’ di spontaneità… scrivici. Le cose migliori nascono così",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1pgkupi/nuove_amicizie/"
    },
    {
        "id": "1pg1092",
        "author": "maschera84",
        "title": "Perchè si spaccia a cielo aperto in San Salvario di Sabato alle 13:00?",
        "content": "Non sono qui per criticare, anche perchè io e la mia famiglia siamo nuovi qui a Torino e la città ci piace molto.\n\nOggi, dopo una passeggiata al Valentino con le mie bimbe, abbiamo deciso di andare a mangiare un boccone a San Salvario, che ci era stata descritta come una zona una volta difficile, ma oggi in completa rivalutazione.\n\nE, infatti, alcune aree sono molto carine. \n\nFin quando pero' ci siamo addentrati in delle vie in cui sembrava un altro stato. Ragazzi ai bordi degli incroci che si guardavano intorno e aspettavano chiaramente clienti, mentre altri facevano \"i pali\" all'ingresso delle strade.\n\nInutile dire che ci hanno squadrato come fossimo degli alieni e guardato con aria minacciosa, ma io non ero preoccupato perchè ho capito che erano lì per vendere droga e non per rapinare gente random.\n\nSembrava essere entrati in una piazza di spaccio.\n\nQuello che non capisco, in una città virtuosa come Torino, com'è possibile che durante il giorno di un sabato qualunque, si lasci spacciare droga così spontaneamente, senza pudore?\n\nNon si parla di Barriera di Milano o di posti periferici (non che li si debba sorvolare, sia chiaro), ma di un posto centralissimo, dove un turista può tranquillamente capitarci per sbaglio con i bambini. Praticamente a due passi da via Lagrange.\n\nPossibile che non ci sia modo per la Polizia di intervenire e setacciare le aree?",
        "upvotes": 64,
        "comments": 58,
        "media": null,
        "permalink": "/r/torino/comments/1pg1092/perchè_si_spaccia_a_cielo_aperto_in_san_salvario/"
    },
    {
        "id": "1pgqtdh",
        "author": "Virtuousrea",
        "title": "Dermatologo",
        "content": "Salve bella gente, cerco un dermatologo a Torino che sia bravo nella cura di dermatiti, rosacea, acne ecc. Soprattutto che abbia un approccio al paziente che non si riduca ad un semplice sguardo, ma che sia una visita più approfondita, magari con macchinari appositi.  Mi sapete consigliare qualcuno? Provenite da una qualche esperienza positiva? Inoltre gradito è anche un listino prezzo onesto ahah",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pgqtdh/dermatologo/"
    },
    {
        "id": "1pgf4v1",
        "author": "Imperatron_",
        "title": "Nuove conoscenze",
        "content": "Ciao a tutti ho 19 anni e sto in affitto a Torino da fine settembre per l'università (unito), considerando che mi sono spostato dalla provincia di Lecce solamente con il mio cane e senza coinquilino sto facendo abbastanza fatica a conoscere persone nuove.\n\nIn università chiacchero a volte con delle persone ma non ho stretto con nessuno. Mi chiedevo se qualcuno avesse dei consigli per conoscere nuove persone? Il fatto che verso le persone che non conosco appaia come riservato e che non sono un tipo da discoteca non aiuta molto (anche se quando si supera la barriera iniziale poi sono molto espansivo), pero' generalmente sono una persona socievole, e anche se non mi identifico in quel gruppo sono un po' nerd, non mi piacciono le discoteche pero' impazzisco per andare a bere in dei bar/pub e mi piace fare delle camminate e i videogiochi.\n\nCon tutto lo studio dell'università mi sta pesando non uscire con un gruppo/qualcuno anche perché la città mi piace molto, specialmente se messa a paragone dal piccolo comune da qui vengo\n\nSe avete dei consigli scrivetemi pure in privato o qui sotto",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1pgf4v1/nuove_conoscenze/"
    },
    {
        "id": "1pgmmka",
        "author": "GiuseppeAlletto",
        "title": "Estasi, Misticismo e Arte: la mostra “Femminile Eterno/a” di Giuseppe Al...",
        "content": "Ti sei mai domandato cosa accade quando il misticismo femminile incontra l’estasi più profonda e diventa arte pura? \n\n\n\nEstasi, Misticismo e Arte: la mostra “Femminile Eterno/a” di Giuseppe Alletto – Torino 2025\n\n\n\nSabato 13 dicembre 2025, dalle 17:00 alle 21:00, inaugura la mostra di una mostra unica: Un ‘Eterno/femminile, il nuovo progetto artistico di Giuseppe Alletto ospitato da CSA Farm Gallery a Torino. \n\n\n\nAlletto rilegge figure archetipiche, soggetti comuni, tatto, diversità, sensualità e libertà, corpi aperti e scoperti e le intense e profonde possibilità del misticismo femminile.\n\nQuesta esposizione nasce come un’intensa indagine sul misticismo al femminile e sull’estasi intesa come “uscita fuori di sé”, un’esperienza sospesa tra spiritualità, corpo e trascendenza. Alletto rilegge figure archetipiche come Santa Teresa d’Avila e Giovanna d’Arco, interrogando la zona di confine dove il rapimento spirituale sfiora il sensuale e si intreccia all’erotico, rivelando un linguaggio simbolico potente e contemporaneo.\n\nAttraverso disegni in grafite, carboncino, pittura a olio e un sorprendente uso di lamiere metalliche, l’artista cattura la tensione del momento estatico, trasformando il corpo femminile in un veicolo di sacralità carnale e in un ponte verso una trascendenza universale. Ogni opera è un invito a contemplare il mistero dell’estasi, la fragilità del corpo e la forza inesauribile del sacro declinato al femminile.\n\nLa mostra, con testo critico di Giuseppe Biasutti e a cura di Marcello Corazzini, sarà visitabile dal 13 dicembre 2025 al 10 gennaio 2026, dal mercoledì al sabato, dalle 16:00 alle 19:30, presso CSA Farm Gallery, Via Vanchiglia 36, Torino.\n\nPer informazioni: [info@csafarmgallery.it](mailto:info@csafarmgallery.it) – +39 339 7796065",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_3qLna9Hoc0XbiS8W5eJdC2BQyOFBoecrmWo9rOGX0Q.jpeg?auto=webp&amp;s=7e01269c43dd0585ac791743f7594466af2f0f11"
        },
        "permalink": "/r/torino/comments/1pgmmka/estasi_misticismo_e_arte_la_mostra_femminile/"
    },
    {
        "id": "1pgen0a",
        "author": "qazwest2021",
        "title": "Visiting Turin on Dec 25th and 26th",
        "content": "Hi everyone\n\nMy family and I will be visiting Turin on December 25th and 26th. \n\nWill the airport bus run on those days or will we have to take a cab?\n\nDo you think most museums and restaurants will be closed? \n\nAlso do we need cash or can we use credit cards / phones for all purchases even small ones? \n\nThanks a lot!",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1pgen0a/visiting_turin_on_dec_25th_and_26th/"
    },
    {
        "id": "1pgt0ab",
        "author": "gloopie21",
        "title": "qualcuno conosce parrucchiere BRAVO che sappia fare un mullet/shaggy??",
        "content": "ciao ragazzi per caso qualcuno conosce qualche parrucchiere a torino bravo bravo in tagli femminili un po' complessi come lo shaggy-mullet? sto cercando come una pazza ma non trovo nessuno di bravo vi prego aiuto😭🙏",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pgt0ab/qualcuno_conosce_parrucchiere_bravo_che_sappia/"
    },
    {
        "id": "1pgdo28",
        "author": "Top-Initiative-5626",
        "title": "Hi. Is Via Sant’Anselmo in the North of San Salvario safe? I am a woman moving to Turin for the first time, an would really appreciate if someone could share their thoughts on where I should look for an accommodation and not.",
        "content": "",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1pgdo28/hi_is_via_santanselmo_in_the_north_of_san/"
    },
    {
        "id": "1pgk5ww",
        "author": "Temporary_Voice_949",
        "title": "Qualcuno vuole fare amicizia?",
        "content": "[M] 20 - cerco F\nNiente di complesso o complicato, preferibilmente",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1pgk5ww/qualcuno_vuole_fare_amicizia/"
    },
    {
        "id": "1pframj",
        "author": "Alone-Entertainer911",
        "title": "NEGOZI VINTAGE",
        "content": "Vorrei trovare lavoro in questo tipo di negozietti, fare esperienza e imparare tutto su questo mondo, conoscete negozi a torino che potrebbero cercare?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pframj/negozi_vintage/"
    },
    {
        "id": "1pfjppt",
        "author": "Working_Way_6253",
        "title": "F Austrian looking for people to hang out with",
        "content": "Hey everyone! I'm originally from Austria, but I'm in Italy right now, working on my degree. Looking to meet new people – anyone around?",
        "upvotes": 6,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1pfjppt/f_austrian_looking_for_people_to_hang_out_with/"
    },
    {
        "id": "1pfrui2",
        "author": "Platform_Crocs",
        "title": "Corsi di Italiano?",
        "content": "Ciao ragazz*, mi sono trasferito a Torino qualche mese fa per l'università e sto cercando corsi di italiano. Il mio livello è tra A2 e B1. Sono aperto anche a qualcuno che voglia fare uno scambio linguistico con me. Sono un madrelingua inglese e vengo da New York :-)",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1pfrui2/corsi_di_italiano/"
    },
    {
        "id": "1pfqi5r",
        "author": "bottomwin",
        "title": "Negozio di foulard",
        "content": "Ciaoo, sapreste consigliarmi un negozio dove comprare un foulard per mia madre? La prossima settimana sarò a Torino per dare un esame e pensavo di cogliere l'occasione per comprarle il regalo di Natale. Ho un budget di 30 euro.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pfqi5r/negozio_di_foulard/"
    },
    {
        "id": "1pf7ehb",
        "author": "FrancescoLog",
        "title": "LOCALI SERALI LUCI BASSE E ATMOSFERA",
        "content": "Ciao a tutti 👋  \nSono un ragazzo di 28 anni, lavoro tutto il giorno e durante la settimana sono praticamente un eremita.  \nNon ho ancora amici veri e propri qua a Torino e ogni tanto, soprattutto il venerdì o il sabato, mi andrebbe di uscire da solo in un posto dove si può stare tranquilli, chillare sul divano o al bancone, bere una birretta/cocktail leggero o un calice di vino e ascoltare buona musica. STILE SPEAKEASY\n\nNon cerco discoteca, non cerco il posto dove si rimorchia a tutti i costi e non voglio nemmeno spendere 50€ di ingresso + drink. Mi basta un locale con atmosfera calda, luci basse, gente rilassata e magari un po’ di live o un dj che gira vinili decenti.\n\nQualche idea?",
        "upvotes": 23,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1pf7ehb/locali_serali_luci_basse_e_atmosfera/"
    },
    {
        "id": "1pfi6dz",
        "author": "Garaad252",
        "title": "Seeking Local Safety Advice (Corso Vercelli 3)",
        "content": "I'm an international male student moving to Turin soon.\n\nI have found a room at Corso Vercelli 3 (near Porta Palazzo / Aurora) for €320 per month, ALL-INCLUSIVE, which is a huge deal for my budget.\nSince this area is very lively and multicultural, I wanted to ask locals for honest, concise advice:\n\n1. Safety: How safe is the immediate Corso Vercelli area for a man walking alone late at night?\n\n2. Overall Recommendation: Does the €320 all-inclusive price outweigh the safety concerns of the neighborhood?",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1pfi6dz/seeking_local_safety_advice_corso_vercelli_3/"
    },
    {
        "id": "1pfkfie",
        "author": "albertot011",
        "title": "Piccolo trasloco",
        "content": "Devo portare una cassettiera e qualche sedia da Torino nord a Moncalieri. Conoscete qualcuno che lo faccia a tempo perso, magari un falegname o un robivecchi? Budget sui 50 € direi.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1pfkfie/piccolo_trasloco/"
    },
    {
        "id": "1pf118f",
        "author": "prutprit",
        "title": "Ecco svelato il mistero delle Enjoy",
        "content": "In una mail comunicano che trasformano il servizio in Enjoy Point, quindi si potranno noleggiare e restituire i veicoli solo nelle stazioni di servizio dedicate (oltre a stazioni e aeroporti).\n\nPeccato.",
        "upvotes": 11,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1pf118f/ecco_svelato_il_mistero_delle_enjoy/"
    },
    {
        "id": "1pf49zm",
        "author": "davivesp",
        "title": "Nuove amicizie",
        "content": "Ciao a tutti, ecco a voi l’ennesimo post del genere!\nVivo a Torino da qualche anno, ho 30 anni e mi sto rendendo conto che diventa sempre più difficile ampliare la cerchia di conoscenze.  \nMi piacerebbe trovare nuove amicizie sincere, non solo per fare due passi o bere qualcosa, ma anche per scambiarsi idee, confidarsi ogni tanto e costruire un rapporto più del semplice “passare il tempo”.\nSe vi va di conoscere qualcun altro, fatevi sentire, magari abbiamo qualcosa in comune ✨",
        "upvotes": 7,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1pf49zm/nuove_amicizie/"
    },
    {
        "id": "1pes7qf",
        "author": "_ilmarziano_",
        "title": "Aggiornamenti \"Scomparsa\" Enjoy",
        "content": "Ho appena ricevuto questa mail, quindi a quanto pare non stanno sparendo ma stanno rivoluzionando tutto il servizio e il metodo di fruizione di esso.",
        "upvotes": 27,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qblus596ad5g1.jpeg?auto=webp&amp;s=ace3cb1b6c204a9380fdb2abae7f99a805fbc105"
        },
        "permalink": "/r/torino/comments/1pes7qf/aggiornamenti_scomparsa_enjoy/"
    },
    {
        "id": "1pevo54",
        "author": "Silvano_315",
        "title": "Coworking migliori",
        "content": "Ciao a tutti e tutte, volevo chiedere una vostra opinioni su quali fossero i migliori coworking a Torino. \n\nAndrebbe bene anche la vostra top 3 in base a questi fattori: qualità/prezzo, zona, networking/eventi e spazi di lavoro. \n\nPer esperienza ho già provato il ToolBox e OGR Tech, entrambi molto belli e validi. Lavorando in ambito consulenza data science mi sembra migliore il secondo, però vorrei sapere se ce ne fossero altri in città. \n\nGrazie a chiunque voglia rispondere :)",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1pevo54/coworking_migliori/"
    },
    {
        "id": "1pexq75",
        "author": "Pablitos1989",
        "title": "Sfide amatoriali di calciobalilla a torneo",
        "content": "https://ciboetrash.it/torneo-amatoriale-di-calciobalilla-edizione-a-doppia-lega/",
        "upvotes": 2,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/kuofsi0bke5g1.jpeg?auto=webp&amp;s=7e849b1aa2fa1fb1397884b4e3d4d0af214fba6a"
        },
        "permalink": "/r/torino/comments/1pexq75/sfide_amatoriali_di_calciobalilla_a_torneo/"
    },
    {
        "id": "1pf2rn8",
        "author": "Awkward-Warning-9238",
        "title": "Parcheggio durante Capodanno.",
        "content": "Ciao a tutti. \n\nVorrei un parcheggio custodito a Torino, l'hotel in cui alloggiamo non ha più posti auto, ricevo recensioni contrastanti online per prezzi e sicurezza. \n\nPreferiremmo pagare un po' di più per un parcheggio custodito, alloggiamo nel centro di Torino ma non avremo molti bagagli, quindi siamo felici di camminare 15/20 minuti se necessario, ma più vicini è meglio è. \n\nSarebbe anche utile se potessimo prenotare in anticipo, così sappiamo che abbiamo uno spazio, dato che immagino che sarà occupato durante il periodo di Capodanno. \n\nGrazie",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1pf2rn8/parcheggio_durante_capodanno/"
    },
    {
        "id": "1pet23x",
        "author": "Coccorocco1",
        "title": "Sushi alla carta",
        "content": "Salve a tutti, per il compleanno della mia ragazza vorrei portarla in un buon sushi alla carta (non ne conosco perché sono sempre andato ai sushi all you can eat). Pensavo ad un posto carino ma non troppo costoso se possibile 😁 insomma la giusta via di mezzo. Grazie mille 👍",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1pet23x/sushi_alla_carta/"
    },
    {
        "id": "1pf1e81",
        "author": "blinx00",
        "title": "Pacchi fermi a Torino con poste italiane",
        "content": "Salve, ho spedito circa 30 pacchi verso la fine di novembre e sono ancora tutti fermi a Torino, qualcuno ha lo stesso problema o succede solo con me? Grazie ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1pf1e81/pacchi_fermi_a_torino_con_poste_italiane/"
    },
    {
        "id": "1per2sp",
        "author": "UnusualZorro77",
        "title": "Consigli per un fuorisede a Torino?",
        "content": "Ciao a tutti,\nsono uno studente all’ultimo anno di liceo e l’anno prossimo vorrei trasferirmi a Torino per l’università. Sarebbe la mia prima esperienza lontano da casa, quindi sono un po' in ansia e sto cercando di raccogliere più info possibili.\nVolevo chiedervi qualche consiglio su dove conviene vivere a Torino, quali sono le zone migliori per studenti e dove si concentra più la vita universitaria. Cercherò una stanza in affitto, quindi ogni dritta su quartieri comodi, tranquilli o da evitare è super apprezzata.\nSe avete anche suggerimenti su posti frequentati da giovani, locali carini o spazi per studiare e conoscere gente, ancora meglio. Grazie!",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1per2sp/consigli_per_un_fuorisede_a_torino/"
    }
]