[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 5,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1ny45d5",
        "author": "bert87",
        "title": "Sometimes you Have to Look up",
        "content": "",
        "upvotes": 164,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1lvv2qwrj5tf1.jpeg?auto=webp&amp;s=8d87edd74577256dca7897b8c9a2f24cf52253d0"
        },
        "permalink": "/r/torino/comments/1ny45d5/sometimes_you_have_to_look_up/"
    },
    {
        "id": "1nynn84",
        "author": "NonSequiturMiami",
        "title": "Tartufo (white truffles)",
        "content": "Any news on the harvest this year? Did the hot summer make it a poor year, or did late rain save it?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nynn84/tartufo_white_truffles/"
    },
    {
        "id": "1nytaey",
        "author": "Gullible_Drummer_246",
        "title": "Piante Carolina Reaper a Torino?",
        "content": "Come da titolo chiedevo se qualcuno sa dove posso trovare piante di varie varietà to peperoncino, ma soprattutto Carolina Reaper a Torino.\n\nDopo il trasloco su Torino purtroppo non ne ho ritrovate.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nytaey/piante_carolina_reaper_a_torino/"
    },
    {
        "id": "1nyt1ci",
        "author": "bbHiron",
        "title": "Moving to Turin soon, what to avoid?",
        "content": "Hey! I will be living in Turin for few months, what are some areas i should be avoiding (especially at night)? I know about Barriera di Milano and Porta Nuova, is there more i should know about? \n\nAlso, are there specific bus/tram routes i should avoid too? Are 11 and 72 safe? Because i would be using them quite a bit to visit some friends lol. Thx! ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1nyt1ci/moving_to_turin_soon_what_to_avoid/"
    },
    {
        "id": "1nyr3eo",
        "author": "Necessary-League2287",
        "title": "Applicazione per consultare eventi Torino/dintorni",
        "content": "Ciao ragazzi! Mi domandavo se esistesse un’applicazione per consultare eventi per Torino e dintorni, mi ricordo che qualcuno su un vecchio post del sub l’aveva pubblicato ma non ricordo come si chiama. O magari anche il nome di qualche pagina instagram/social che tiene aggiornato su eventi giovanili ecc…\nGrazie 🫶🏻",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1nyr3eo/applicazione_per_consultare_eventi_torinodintorni/"
    },
    {
        "id": "1nykypb",
        "author": "Intrepid-Routine-875",
        "title": "Ma come si fa il cambio di residenza a Torino?",
        "content": "Io sono abituata ai vecchi tempi in cui andavi al comune o alla circoscrizione di competenza, prendevi il biglietto e dichiaravi il nuovo indirizzo all'operatore, fine.\n\nQui a Torino ovunque dicono che si faccia soltanto online il cambio di residenza, e che serve la carta d'identità elettronica. Io la carta d'identità elettronica non ce l'ho e per farla mi richiedono la residenza.\n\nQuindi come ne esco? Come prendo la residenza a Torino?",
        "upvotes": 2,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1nykypb/ma_come_si_fa_il_cambio_di_residenza_a_torino/"
    },
    {
        "id": "1nym3ep",
        "author": "Prestigious_Body5834",
        "title": "Scambio carte magic Final Fantasy",
        "content": "Ciao a tutti. ho un sacco di doppie da scambiare. Se qualcuno è interessato ci possiamo trovare da qualche parte",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nym3ep/scambio_carte_magic_final_fantasy/"
    },
    {
        "id": "1nylkxn",
        "author": "Frengo_17",
        "title": "Cerco il local",
        "content": "Ciao a tutti sapete se a Torino c'è un local di yugi?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nylkxn/cerco_il_local/"
    },
    {
        "id": "1nxuigc",
        "author": "Zig389_",
        "title": "Gtt",
        "content": "Sento moltissime persone che si lamentano del servizio Gtt, ma io personalmente non lo vedo così male rispetto anche solo ad altre città. I pullman alcune volte sono in ritardo, ma solitamente dalla mia esperienza sono relativamente puntuali. La metro funziona molto bene e ha delle frequenze alte. Ditemi cosa ne pensate voi",
        "upvotes": 29,
        "comments": 39,
        "media": null,
        "permalink": "/r/torino/comments/1nxuigc/gtt/"
    },
    {
        "id": "1ny3xut",
        "author": "matt994",
        "title": "Trovare casa per 1 mese per trasferta di lavoro sta diventando un incubo",
        "content": "Buonasera a tutti, sto per trasferirmi a Torino per lavoro per circa un mese e sto facendo parecchia fatica a trovare una sistemazione temporanea.\n\nMi rivolgo quindi a voi per chiedere qualche consiglio o aiuto.\nCerco un appartamento arredato e pronto all’uso, con utenze già attive, in zona centrale - idealmente tra Porta Nuova e Piazza Vittorio.\n\nA livello di budget posso arrivare fino a 2.000–2.500 €, coperti dall’azienda. Il problema è che sul mercato trovo solo Airbnb per pochi giorni o contratti transitori di almeno 6 mesi.\n\nAvete suggerimenti, contatti o piattaforme alternative dove potrei cercare questo tipo di soluzione?\n\nGrazie in anticipo a chiunque possa darmi una mano 🙏",
        "upvotes": 9,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1ny3xut/trovare_casa_per_1_mese_per_trasferta_di_lavoro/"
    },
    {
        "id": "1nyl11e",
        "author": "Dangerous-One5036",
        "title": "Torino borgo vittoria",
        "content": "Buongiorno a tutti, stavo valutando di prendere una casa  nella zona di Torino borgo vittoria (vicino alla stazione susa e altri servizi) qualcuno che ci abita, mi sa dire com'è come zona? Grazie ",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1nyl11e/torino_borgo_vittoria/"
    },
    {
        "id": "1nxzelv",
        "author": "Similar_Profit_7298",
        "title": "Test ADHD",
        "content": "Salve, qualcuno conosce a Torino un posto(privato, non posso fare un anno di attesa) dove si possa andare a fare il test per ADHD o, più in generale, per le neurodivergenze? E nel caso potreste anche spiegarmi come dovrebbe funzionare la procedura e quanto potrebbe costarmi",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1nxzelv/test_adhd/"
    },
    {
        "id": "1ny2dgc",
        "author": "Danimann02",
        "title": "Custom cake",
        "content": "Hi, does anybody have any recommendation for bakeries that make custom cakes or birthday cakes? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ny2dgc/custom_cake/"
    },
    {
        "id": "1ny7ee2",
        "author": "KvotheDeBruyne",
        "title": "Dove comprare pasta termica a Torino",
        "content": "Ciao a tutti!\nSapete dove posso comprare pasta termica per CPU e un cacciavite per aprire un laptop qui a Borgo Vittoria o nei dintorni?\nSe c’è qualche negozio aperto la domenica, posso anche andare verso il centro.\nGrazie mille in anticipo! ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ny7ee2/dove_comprare_pasta_termica_a_torino/"
    },
    {
        "id": "1ny23ez",
        "author": "thecruz831",
        "title": "Rendimi le cose facili!!",
        "content": "Qualcuno mi può indicare un buon ristorante non turistico a Torino che offra pasta e vino eccellenti? Non ho bisogno di un locale super chic, solo di una bella atmosfera. Grazie in anticipo!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ny23ez/rendimi_le_cose_facili/"
    },
    {
        "id": "1nxxxar",
        "author": "Thestonksman599xx",
        "title": "Mercatini orologi vintage",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1nxxxar/mercatini_orologi_vintage/"
    },
    {
        "id": "1nxx8pz",
        "author": "Virtual-Ad-8601",
        "title": "Which EDISU dorm is better: Olimpia or Verdi?",
        "content": "Hi, I am a female psychology student and will attend Unito as an Erasmus student in the spring semester. I got a room at Olimpia dorm bit my second option was Verdi - which one is better?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nxx8pz/which_edisu_dorm_is_better_olimpia_or_verdi/"
    },
    {
        "id": "1nxwqaf",
        "author": "Main_Bus9170",
        "title": "Corsi di calcio per adulti",
        "content": "Buonasera, qualcuno conosce dei corsi di calcio serali per adulti qua a Torino, eccetto quelli del CUS?\n\n(Calcio o calcetto)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nxwqaf/corsi_di_calcio_per_adulti/"
    },
    {
        "id": "1nxnnzx",
        "author": "Nunzz66",
        "title": "Cercare casa a Torino",
        "content": "Ciao a tutti!\nSto cercando casa a Torino con budget €260k, mi piacerebbe avere una casa da almeno 90 mq2 e almeno 2 camere.\nUn grosso valore aggiunto per me sarebbe la vicinanza ad un parco o alle aree verdi (come viali alberati, etc)\n\nAvevo adocchiato queste zone:\nCentro\nCrocetta/San Secondo\nSan Salvario\nCavoretto/Gran Madre\n \nCampidoglio\nSan Donato\nCit Turin\nBorgo San Paolo\nCensia\nPozzo Strada\n\nSto tenendo in considerazione anche Moncalieri e Collegno.\n\nPer me spostarmi non è un problema, adoro spesso andare in centro, ma mi rendo conto che i prezzi siano più elevati.\nSono innamorato di Vanchiglia e la zona dall'altra parte del Po', ma in particolare con quest'ultima, la reputo fuori budget.\n\nAttualmente sono in Santa Rita e mi trovo bene. Quali di queste zone mi consigliate per qualità della vita, vicinanza al verde e migliore rapporto qualità/prezzo?",
        "upvotes": 4,
        "comments": 23,
        "media": null,
        "permalink": "/r/torino/comments/1nxnnzx/cercare_casa_a_torino/"
    },
    {
        "id": "1nxqr9u",
        "author": "Current-Remote8989",
        "title": "Leave after Applying for Residence Permit",
        "content": "Hi, I’m a new student at Turin and for personal reasons after a week of my first arrival to Torino and applying to the residence permit, I will have to leave for a few weeks or a month. Is there any legal problems about me leaving Torino a few days after applying to the residence permit and leaving with my multi entry visa and temporary ticket of application (ricevuta)?",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1nxqr9u/leave_after_applying_for_residence_permit/"
    },
    {
        "id": "1nxpfo9",
        "author": "No_Win_9102",
        "title": "Cerco conoscenze a torino",
        "content": "Ho 18 anni e sono di Torino. Sto cercando gente con cui fare conoscenza preferibilmente intorno alla mia età, cerco gente nel chill che magari condivide anche stesse passioni, come gli anime, la natura, i film, musica e altro. se vi va scrivetemi pure (:",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nxpfo9/cerco_conoscenze_a_torino/"
    },
    {
        "id": "1nxcl95",
        "author": "Parking-Job-3175",
        "title": "Credete che la AI week e in generale la conversione tecnologica di Torino darà una spinta alla città? Come vedete il futuro economico della città?",
        "content": "Discussione ",
        "upvotes": 6,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1nxcl95/credete_che_la_ai_week_e_in_generale_la/"
    },
    {
        "id": "1nx0c16",
        "author": "VecchiaPrugna",
        "title": "Com'è vivere a Collegno?",
        "content": "",
        "upvotes": 9,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1nx0c16/comè_vivere_a_collegno/"
    },
    {
        "id": "1nx3n4q",
        "author": "DarwinGGBG",
        "title": "Sarò a Torino venerdì 24/10 per un concorso pubblico, hotel e ristorante consigliati?",
        "content": "Come da titolo, lunedì 20 arriverò (non il 24, errore mio) a Torino in macchina (sono poco distante, Bergamo) per un concorso pubblico. La mia ragazza mi farà compagnia. Dopo il concorso di venerdì vorremmo pernottare una notte in zona e cenare (zona Scalo eventi). Consigli?",
        "upvotes": 7,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1nx3n4q/sarò_a_torino_venerdì_2410_per_un_concorso/"
    },
    {
        "id": "1nxa7kr",
        "author": "Sam-2305",
        "title": "Bravo veterinario",
        "content": "Ciao a tutti e tutte! 😊\n\nCome da titolo, sto cercando un veterinario.\n\nQuello da cui vado attualmente è molto bravo, però è veramente scomodo perché non è vicinissimo ed è in un posto dove per parcheggiare devi iniziare a pregare tutti i santi che conosci almeno una settimana prima.\n\nPer favore, qualcuno sa consigliarmi un bravo veterinario, magari in zona Pozzo Strada/Parella? Io sono in zona Corso Brunelleschi (verso il mercato), non lontana dal Martini.\n\nGrazie infinite a chiunque mi darà qualche indicazione. \n\nAh, se c'è la cat tax da pagare lo faccio volentieri 😅😅",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1nxa7kr/bravo_veterinario/"
    },
    {
        "id": "1nwzf3v",
        "author": "Original_Draw_9492",
        "title": "Torino Metro Coast to Coast",
        "content": "Probabilmente è stato già chiesto e se ne è già parlato però non sono molto attivo su reddit in modo costante, quindi chiedo:\nQualcuno di voi ha mai fatto tutto il percorso della metro Fermi-Bengasi o viceversa? Quanto ci mette circa? \nGoogle maps mi ha detto circa mezz'ora però mi sembrano pochino sinceramente 🤔",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1nwzf3v/torino_metro_coast_to_coast/"
    },
    {
        "id": "1nxbn97",
        "author": "Babele_20",
        "title": "Sconto studenti",
        "content": "Ciao! Sapete dirmi quali supermercati fanno sconti studenti? Tipo il 10% o altro?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1nxbn97/sconto_studenti/"
    },
    {
        "id": "1nx89ee",
        "author": "BonusProper7385",
        "title": "Com'è zona vigevano",
        "content": "Esattamente ciò che dico sopra, soprattutto tra l'intersezione di via Francesco cigna e corso vigevano.\nNon devo andare a viverci, però dovrei staccare verso le 8 di sera e non vorrei brutti incidenti ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1nx89ee/comè_zona_vigevano/"
    }
]