[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 5,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1mix31m",
        "author": "telespalla-iba",
        "title": "Cosa sono queste strutture in corso Principe Oddone?",
        "content": "",
        "upvotes": 24,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8m69oztldchf1.jpeg?auto=webp&amp;s=5033d5a6bb4a72f79aa7ace4687af97922a2f037"
        },
        "permalink": "/r/torino/comments/1mix31m/cosa_sono_queste_strutture_in_corso_principe/"
    },
    {
        "id": "1mj7upw",
        "author": "Wide-Scientist-659",
        "title": "mi trasferisco a Torino per l’università: consigli?",
        "content": "Ciao a tutti! Tra un paio di settimane mi trasferirò a Torino per iniziare l'università e volevo chiedervi qualche consiglio. È la prima volta che vivo in città, quindi mi piacerebbe sapere cosa fare e cosa evitare, zone carine dove uscire, consigli pratici per chi arriva da fuori città o altri suggerimenti utili per ambientarmi. Grazie mille in anticipo!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1mj7upw/mi_trasferisco_a_torino_per_luniversità_consigli/"
    },
    {
        "id": "1miejrw",
        "author": "guigbd",
        "title": "Expat students in Turin",
        "content": "🌆Are you a new student in Turin and don't know where to start to get around the city? \n\nWe are an international group of young people who organize events over the weekend, appointments for an aperitif and why not, some practical workshops to increase their skills and be more attractive on the market. \n\nCurrently this is our second year and everything is in development, so if you like feel free to leave me your email or a contact below to be added\n\nSee you soon 🔜 ",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1miejrw/expat_students_in_turin/"
    },
    {
        "id": "1miqo81",
        "author": "whiteobama123",
        "title": "Jicama dove trovare",
        "content": "Ciao gente \nChissà se qualcuno ha trovato Jicama in città \n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1miqo81/jicama_dove_trovare/"
    },
    {
        "id": "1mikipe",
        "author": "PumpkinPunk96",
        "title": "Consigli per corsi di cucito a Torino?",
        "content": "Ciao a tutti! 👋  \nSono una studentessa internazionale che vive a Torino e mi piacerebbe iniziare a prendere lezioni di cucito 🪡.  \nQualcuno conosce corsi o insegnanti bravi in città?  \nGrazie in anticipo per qualsiasi consiglio! 🙏",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1mikipe/consigli_per_corsi_di_cucito_a_torino/"
    },
    {
        "id": "1mi46zg",
        "author": "Shot-Presentation250",
        "title": "Piscine Torino?",
        "content": "Ciao ragazzi , mi chiedevo se ci fossero piscine in città,  io sono a Santa Rita / borgo cina , non automunito , esistono piscine balneari qui vicino o poco distanti? \nGrazie ",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1mi46zg/piscine_torino/"
    },
    {
        "id": "1mh8fov",
        "author": "P0lpett0n3",
        "title": "Come posso fare volontariato in modo saltuario e flessibile?",
        "content": "Ciao, mi piacerebbe fare volontariato e magari sfruttare questa esperienza anche per conoscere nuove persone.\n\nPerò impiego già molto tempo nel lavoro e mi sembra che le associazioni più famose che ho guardato online abbiamo come requisito un minimo di ore giornaliere da non sottovalutare, quasi paragonabili a quelle di un impiego full time o part time. Ma probabilmente ne conosco poche.\n\nHo più di 30 anni quindi non posso usufruire del servizio civile, mi consigliate altre opportunità che siano flessibili per quanto riguarda il tempo impiegato?",
        "upvotes": 13,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1mh8fov/come_posso_fare_volontariato_in_modo_saltuario_e/"
    },
    {
        "id": "1mhau2a",
        "author": "ivlia-x",
        "title": "Tatuaggi nello stile B&amp;W american traditional, consigliereste qualcuno?",
        "content": "Ciauuu\nSto cercando un artista che lavora in questo stile, conoscete qualcuno a Torino? Non mi interessa il lavoro di bassa qualità perciò volevo sentire le vostre opinioni\n\nHo già uno sleeve e un paio di altre cose ma voglio finalmente cominciare anche sulle gambe",
        "upvotes": 4,
        "comments": 29,
        "media": null,
        "permalink": "/r/torino/comments/1mhau2a/tatuaggi_nello_stile_bw_american_traditional/"
    },
    {
        "id": "1mgj9rw",
        "author": "BrutalSock",
        "title": "Questi sono due euro di “brioche farcita” da Berlica Barbis",
        "content": "Quella roba minuscola evidenziata nella terza foto è la teorica farcitura. ",
        "upvotes": 204,
        "comments": 28,
        "media": null,
        "permalink": "/r/torino/comments/1mgj9rw/questi_sono_due_euro_di_brioche_farcita_da/"
    },
    {
        "id": "1mhdcv1",
        "author": "Illustrious_Rule_593",
        "title": "Biking In Turin",
        "content": "Hey Guys! From a bike lover who likes riding in city, parks and extra urban areas of Turin, is there anyone would like to join for bike riding? for sure any level are welcomed but I am not professional, it's just chilling and riding hahaha",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1mhdcv1/biking_in_turin/"
    },
    {
        "id": "1mh6i6t",
        "author": "DanielFHD4K",
        "title": "Autolavaggi",
        "content": "Ciao a tutti, mi chiedevo, esistono autolavaggi in dove si possano utilizzare le proprie spugne e i propri detergenti?\n\nHo provato una rapida ricerca online ma non ne sono venuto a capo. Grazie mille!",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1mh6i6t/autolavaggi/"
    },
    {
        "id": "1mgo2mx",
        "author": "MatteVat25",
        "title": "Tennis solo per ricchi",
        "content": "Raga, ma è normale pagare 28 euro per un'ora  un campo in cemento all'aperto di giorno...quindi niente luci. Mi sembra davvero esagerato. Quanto pagate dove andate voi?",
        "upvotes": 15,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1mgo2mx/tennis_solo_per_ricchi/"
    },
    {
        "id": "1mh6sjf",
        "author": "SamPorterBridges2025",
        "title": "Com’è il treno Regionale Veloce da Santhià o Vercelli a Milano Porta Garibaldi e ritorno?",
        "content": "Ciao a tutti!\nDovrò iniziare a viaggiare spesso sulla tratta Rivarolo → Milano Porta Garibaldi, e stavo cercando la soluzione migliore, treni compresi￼.\nQualcuno sa se i treni Regionali Veloci sono umanamente accettabili?\n\nMi serve saperlo perché vorrei lavorare a bordo con PC e hotspot, e non so se è praticabile.\nMi chiedevo anche se la situazione ritardi sia migliorata negli anni, oppure se i treni sono ancora spesso in ritardo.\n\nGrazie mille a chi può aiutare!",
        "upvotes": 1,
        "comments": 24,
        "media": null,
        "permalink": "/r/torino/comments/1mh6sjf/comè_il_treno_regionale_veloce_da_santhià_o/"
    },
    {
        "id": "1mgicz8",
        "author": "vah_man_",
        "title": "Turin Tram",
        "content": "",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mgicz8/turin_tram/"
    },
    {
        "id": "1mgmwg3",
        "author": "Goddess1802",
        "title": "Places to visit",
        "content": "Hii! I'm going to visit Turin during 12-19 august. What places do you recommend visiting?   \nWhat are some good and affordable places to eat and what club would you recommend for students?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mgmwg3/places_to_visit/"
    },
    {
        "id": "1mglhye",
        "author": "murrayland",
        "title": "Coming Torino in a week. Any advice for club nights on the Saturday?",
        "content": "LGBT / LGBT friendly. Enjoy any music but not anything too pop / cheesy. Techno disco house etc works well. Bunker looks good but not sure if any nights are running? \n\n\nAppreciate it's a quiet time of year so any advice appreciated! \n\n\nWhile I'm here, any cool cocktail / rooftop bars and vegan restaurants would be good. And any events for the 9th - 16th August.\n\nThanks ",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1mglhye/coming_torino_in_a_week_any_advice_for_club/"
    },
    {
        "id": "1mgezs4",
        "author": "Frengo_17",
        "title": "informazioni",
        "content": "Ciao a tutti, volevo sapere se conoscete un negozio a torino che vede articoli punk rock tipo magliette, spille e stickers ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mgezs4/informazioni/"
    },
    {
        "id": "1mfyljz",
        "author": "xXCyb3rBu11yXx",
        "title": "Perché dicono “entra in Parella, esci in barella”?",
        "content": "Mi sono trasferito in Parella un paio di mesi fa e ho sentito quella frase  ",
        "upvotes": 21,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1mfyljz/perché_dicono_entra_in_parella_esci_in_barella/"
    },
    {
        "id": "1mfwjyl",
        "author": "PsychologyCorrect152",
        "title": "amiche a torino",
        "content": "Ciao a tutti sono una ragazza di 36 anni in cerca di amicizie preferibilmente femminili.Sono molto sociale però da quando vivo qua a torino non sono riuscita a farmi molti amici...\nParlo anche perfettamente inglese se qualcuno vuole praticarlo ^^\nMi piace fare camminate,amo i gatti,mi piace cucinare e ho una passione molto grande per la Korea del sud.\nSpero di trovare qualche buon amica qua ^^",
        "upvotes": 8,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1mfwjyl/amiche_a_torino/"
    },
    {
        "id": "1mfr67p",
        "author": "Shot-Presentation250",
        "title": "Evento particolare in centro",
        "content": "Salve, non sono nato a Torino e sono qui solo da qualche anno , poi essendo studente la mia vita al di fuori della mie 4 mura non è il massimo ma non scrivo per questo, piuttosto per dirmi che non conosco i tipi famosi in zona. \n\nIeri decisi di fare una passeggiata in centro e di chillare su una panchina di fronte Biraghi . Dopo 10 minuti arriva un ragazzo con la bici, che forse qualcuno di voi conosce, che mi racconta di essere stato derubato e che aveva bisogno di soldi per comprare un biglietto flicbus per chissà dove , per tornare a casa. Gli ho fatto qualche domanda per capire la situazione ed era disperato così gli ho detto senza troppe pretese (anche onestamente perché mi intimidiva e preferivo quello ad uno scippo con minaccia annessa) che lo avrei aiutato  ma non sarei mai andato con lui da nessuna parte ad accompagnarlo chissà dove per un biglietto,  piuttosto gli davo dei soldi. Lui mi fa \"comunque guarda seguimi su instagram e chiedimi i soldi indietro , chiedine anche di più se vuoi\" alla fine gli do 20 euro e lui va verso la stazione.  Ad oggi non ho ricevuto nessun messaggio però con questo post voglio mettervi in guardia dal tipo.\nLa foto profilo la potete trovare sul suo profilo ig : mowgliskunk , ha una bici e vi farà vedere le sue mani nere perché \"ha cercato i suoi documenti sotto ogni auto di torino\" .\n\nSe ci dovessero essere sviluppi aggiornerò il post ma non penso sinceramente. ",
        "upvotes": 12,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1mfr67p/evento_particolare_in_centro/"
    },
    {
        "id": "1mg3loy",
        "author": "Effective_Device_356",
        "title": "Geopolitica Amatoriale",
        "content": "Ciao, ultimamente sono fissato con conferenze di Dario Fabbri, Lucio Caracciolo in alcuni si parla di Geopolitica (seguite il Podcast Imperium Areum). Mi piacerebbe scambiare qualche chiacchiera tipo: Perché il nazionalismo sembra torni sempre nei momenti di crisi? L'Italia ha bisogno di una politica alla Milei? La Cina è in crisi o ascesa? \n\n",
        "upvotes": 2,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1mg3loy/geopolitica_amatoriale/"
    },
    {
        "id": "1mfz23f",
        "author": "aanuliM",
        "title": "Planimetrie degli appartamenti di Torino",
        "content": "Buonasera, sono una studentessa fuorisede,  vivo a Torino da più di un anno, e anche se per ora non voglio ancora trasferirmi dal mio attuale appartamento, ogni tanto bazzico annunci online per curiosità, in particolare di bilocali e trilocali. Ho notato peroʻ che la maggior parte di essi, anche in belle zone, hanno delle metrature e planimetrie terribili, con questi pseudo open-space piccolissimi con divano affacciato direttamente sulla cucina, senza possibilità di mettere un bel mobile con tv, per non parlare dei bagni-corridoi nei quali si riesce a mala pena a camminare. Si tratta principalmente di appartamenti degli anni 60-70 (o anche più d' epoca a volte). \nVengo dalla provincia di milano e sono familiare con le planimetrie di quelli anni, ma qui a Torino mi sembrano fatti davvero male, con spazi angusti che difficilmente si possono sistemare con una ristrutturazione, a meno che non si voglia creare un Loft o simili. \n\nMi rivolgo quindi ad architetti o in generale chi lavora nel settore immobiliare. La mia impressione è fondata? Se si perchè si è deciso di procedere con questi progetti fatti così male? Capisco la speculazione legata al boom economico, ma ripeto nella provincia di Milano per quanto lo schema sia quello gli spazi risultano più decenti o per lo meno salvabili.",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1mfz23f/planimetrie_degli_appartamenti_di_torino/"
    },
    {
        "id": "1mftn9e",
        "author": "_tarassaco",
        "title": "Conoscenze?",
        "content": "Ciaaao, mi trasferisco a Torino tra un mese e non conosco nessuno\nHo 19 anni, mi piace leggere, vagare senza meta per ore, guardare anime, andare a ballare, disegnare, a volte gioco alla switch o faccio robe col fil di ferro, mi piacciono un sacco le nuvole, sono dipendente solo da caffeina e nicotina, spesso mi dicono che quando parlo sembro fatta e rido molto spesso anche senza motivo\nSe qualche persona estroversa (o comunque con più capacità di socializzazione di me) volesse prendermi sotto la sua ala ne sarei molto molto grata..",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1mftn9e/conoscenze/"
    },
    {
        "id": "1mfvvvf",
        "author": "silveringo",
        "title": "Friends",
        "content": "Ciao a tutti, mi sono lasciato 1 settimana fa e l'unico modo che ho per non pensarci è uscendo insieme a qualcuno. Vorrei fare nuove amicizie qua a Torino, maschi e femmine. Vado in palestra (fitactive) quindi potremmo andarci insieme, o semsemplicemente un'uscita tranquilla qua e là ogni tanto. \nSe mi dimentico di rispondere qua, chiedo scusa, vi lascio comunque IG: ananahhas_",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1mfvvvf/friends/"
    },
    {
        "id": "1mflvjs",
        "author": "ImpressedGuy95",
        "title": "Cose divertenti",
        "content": "Ci sono attività divertenti e particolari da fare a Torino? Cerco qualcosa di diverso dalle solite proposte ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mflvjs/cose_divertenti/"
    },
    {
        "id": "1mfm7nr",
        "author": "Vinther000",
        "title": "Flower shop",
        "content": "Hello\nI’m looking for the best flower shop in the Torino area. Anyone have any recommendations?\nI’m looking to buy a bouquet of 100 red roses if possible. Any idea what the price might be?\nThank you in advance",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1mfm7nr/flower_shop/"
    },
    {
        "id": "1mf2uwq",
        "author": "Careful_Molasses_496",
        "title": "Trovare un bilocale da studente è impossibile (rant)",
        "content": "Le garanzie non vanno bene: nemmeno le buste paga di qualche familiare al di sotto di 1500€ vengono prese in considerazione. I garanti devono essere in Italia, così come il contratto di lavoro a tempo indeterminato. Le agenzie chiedono due o tre mensilità, e ci sono anche agenzie fuffa e privati che truffano o vogliono affittare in nero. Spesso le richieste di affitto non vengono accettate per motivi non specificati: “la proprietà ha deciso di procedere con un altro candidato”. Prendere casa è peggio di un colloquio di lavoro. \n\nI prezzi non saranno quelli di Milano, ma è possibile che dopo quattro mesi sia ancora al punto di partenza? Non so se rassegnarmi e smettere di cercare durante agosto, ogni giorno controllo i gruppi Facebook e i principali siti d’affitto, ho anche le notifiche attive.\n\nTroverò una casa? A settembre compariranno magicamente centinaia di affitti che potranno esaudire la domanda? Chissà. \n\nP.S.: dimenticavo i bilocali di 40mq a 700€ che cadono a pezzi ",
        "upvotes": 26,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1mf2uwq/trovare_un_bilocale_da_studente_è_impossibile_rant/"
    },
    {
        "id": "1mfl4rz",
        "author": "Ryan-game",
        "title": "Distribuire volantini in centro per tredicenni",
        "content": "Vorrei guadagnare un po' di soldi e vorrei sapere (ovviamente con il consenso dei genitori) quali locali sono disposti per questo lavoro e  come chiederlo",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mfl4rz/distribuire_volantini_in_centro_per_tredicenni/"
    },
    {
        "id": "1mfkmq1",
        "author": "Conscious-Trouble430",
        "title": "Searching For a Proper Pub",
        "content": "Apologies for writing in English.  I could also write this in Italian, but my target audience more likely speaks English.  \n\nI'll soon be retiring (at 60 yrs) in Rivoli and am looking for a proper pub to pass some time, drink some pints, watch some sports, and maybe even become a regular.  I understand and accept that pub culture is different in Italy and am not casting stones.  At the same time, I'd like a place to drink and speak English (although I can also carry on in Italian if needed).   Thanks in advance for any suggestions to try out.  Bonus points for 1) being &lt; 10 minute walk from the Metro and 2) having Guinness on tap.   ",
        "upvotes": 1,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1mfkmq1/searching_for_a_proper_pub/"
    },
    {
        "id": "1meu7rj",
        "author": "vah_man_",
        "title": "Saturday market- Torino",
        "content": "",
        "upvotes": 26,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1meu7rj/saturday_market_torino/"
    }
]