[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 496,
        "comments": 273,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 15,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jgt282",
        "author": "Mindless_musings",
        "title": "Episode 3 of Adolescence FLOORED me and I think it will stick with me for a very long time.",
        "content": "The acting, man, the acting was straight up magnificent. What the hell. How can a one hour long episode about a psychiatrist and a 13 yr old boy be so fucking gripping? The back and forth, the one-take, the expressions, the physicality, the _craft._ I gave this episode \na standing ovation in my room because it deserves it and soooo much more. The way both the actress and the child actor did their scenes... I am truly speechless. Their talent is astounding and apparent and so compelling. The range of emotion, the humanity in the twistedness of Jaime, the eventual realisation and coming-to-terms of the psychiatrist, the way the spectrum of Jaime’s character was shown without disarming clarity. \n\nI will never ever forget this episode. I thought the first two were amazing but this one. Goddamn. God fucking damn. Some actors are just meant to be and I hope this boy goes far and I hope him and the actress earn their flowers (I will look them up once I’m done with episode 4 but I just HAD to spew my thoughts out about episode 3 first. The writing, the dialogue, the camerawork, direction, cinematography all are spectacular in their own right but I feel like in such a claustrophobic setting as the third episode, it couldn’t have worked so magically had lesser actors been on the job so just appreciating that aspect here primarily). ",
        "upvotes": 139,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1jgt282/episode_3_of_adolescence_floored_me_and_i_think/"
    },
    {
        "id": "1jh5kmm",
        "author": "ashleyriot31",
        "title": "Last show you finished in one sitting?",
        "content": "The 8 show. Got recommended because I liked Squid Game but wow this was so much better. I just wanted to watch an episode then go to bed but I ended up finishing the whole thing.",
        "upvotes": 10,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1jh5kmm/last_show_you_finished_in_one_sitting/"
    },
    {
        "id": "1jh3gew",
        "author": "Ester_LoverGirl",
        "title": "Watching Adolescence for the third time",
        "content": "\nAnd I am still surprised that he never call for his mom.\n\nWhy no one is talking about that? Of course we realized why after episode 2.\n\nHe doesn’t trust women and think they are useless and of course, just there to be slave ot whatever these crazy incels think.\n\nBut the first time you watched the show, did you notice this too? Did you find it odd and made you kind of « uncomfortable » that he was screaming for his dad and not his mom?\n\nBecause that is what I was feeling.\nBecause i would reach for my mom is anything like this would happen to me. To feel love and comfort.\nThat would be the « normal » thing to do.\n\nAnd the first time I watch the show I knew something was off with this little guy who never mentioned his mom, not once.",
        "upvotes": 20,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1jh3gew/watching_adolescence_for_the_third_time/"
    },
    {
        "id": "1jh8pcd",
        "author": "sidroy81",
        "title": "Netflix’s Origin Story: How the Streamer Killed Blockbuster Video, Snagged ‘House of Cards’ From HBO and Changed Hollywood Forever",
        "content": "",
        "upvotes": 3,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1jh8pcd/netflixs_origin_story_how_the_streamer_killed/"
    },
    {
        "id": "1jh0dyu",
        "author": "bing_bang_bum",
        "title": "Justice for Adolescence Episode 2",
        "content": "Just finished ep 2 so I’m not done yet, but I’ve read the discussions and, don’t get me wrong, I was not in the least bit let down by ep 3. It was a masterpiece. But honestly episode 2 hit me harder. The power the kids had over the adults. The fucking hurt and rage of Jade. The sheer magnitude of having 100+ child actors doing their job effortlessly for a full hour. The CAMERA WORK (a literal seamless transition from ground to drone). The fluctuations between tight, emotional portraits to clinical medium to wide shots. The acting all around from, what…7 leads? It was an absolute masterclass in filmmaking and already is in my top episodes of any TV show, ever. I am completely marveled.",
        "upvotes": 25,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1jh0dyu/justice_for_adolescence_episode_2/"
    },
    {
        "id": "1jha6rl",
        "author": "Takato185",
        "title": "Adolescence Question",
        "content": "Did Derek, the guy from social services, know that Jamie is in fact a murderer or did he just know he is a suspect? Up to what age is an appropriate adult needed in a situation like this?",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jha6rl/adolescence_question/"
    },
    {
        "id": "1jh3tui",
        "author": "JemJemIsHerName",
        "title": "The Residence is very entertaining!",
        "content": "It gives the vibes of the Knives out/Glass onion “greatest detective ever” stuff. It’s so tongue in cheek about it. They even say in episode 1 they want the guy Daniel Craig plays in the detective movies to investigate. The episodes are named after top nextflix shows/movies (the fall of the house of Usher, Knives out…) and that’s a cute nod. The show is actually really fun and a good mystery. It’s probably not winning Emmy awards but it’s entertaining and a fun watch and I would suggest friends watch it. ",
        "upvotes": 9,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jh3tui/the_residence_is_very_entertaining/"
    },
    {
        "id": "1jgwso2",
        "author": "brittan5",
        "title": "Adolescence: Emojis, 80/20, etc.",
        "content": "I guess I’m old —I’ve heard of the incel concept but the show made me feel as if I’ve been living under a rock with the explanation of the emojis, 80/20 interpretation, etc.  \nCan someone explain this in relation to Jamie and the show in general? I know the show didn’t specifically state what he was involved in online, but what was your takeaway or perception? How do you believe this played into Jamie’s belief system or himself and women? ",
        "upvotes": 26,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1jgwso2/adolescence_emojis_8020_etc/"
    },
    {
        "id": "1jh665m",
        "author": "No_Narwhal9099",
        "title": "Question About The Residence - SPOILER",
        "content": "I have a spoiler question about The Residence on Netflix. I loved the show! But what happened to the calligrapher? Why was he so bad at writing the names? I assumed he must have been drugged, as it seemed AB would have not stood for this guy as the calligrapher if he were usually that bad at his job. Did we find out and I missed it?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jh665m/question_about_the_residence_spoiler/"
    },
    {
        "id": "1jh45n8",
        "author": "ILikeDrawingGuys",
        "title": "Am I the only one who sees the resemblance?",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jh45n8/am_i_the_only_one_who_sees_the_resemblance/"
    },
    {
        "id": "1jh98rn",
        "author": "neonxdragon",
        "title": "Question re: Adolescent. How heavy is it?",
        "content": "Looking for a new show to binge this weekend and Adolescent is being talked about everywhere. \n\nI know the basics on the storyline. How heavy is it? Is it triggering for those that have gone through similar things IRL?\n\nContext without going too dark: my highschool boyfriend of almost 3 years was tragically murdered some years ago. And my other ex bf that I dated before him brutally murdered someone a few months ago.",
        "upvotes": 1,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1jh98rn/question_re_adolescent_how_heavy_is_it/"
    },
    {
        "id": "1jh8w84",
        "author": "S4v1r1enCh0r4k",
        "title": "'One Piece' Is Back on April 12 with Egghead Arc Part 2, Special recap episode will air on April 5",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jh8w84/one_piece_is_back_on_april_12_with_egghead_arc/"
    },
    {
        "id": "1jh8qgg",
        "author": "neodiodorus",
        "title": "Adolescence E2 finale - Sting's Fragile (children's choir transcription) and... that camerawork",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jh8qgg/adolescence_e2_finale_stings_fragile_childrens/"
    },
    {
        "id": "1jgw1ib",
        "author": "Original2021",
        "title": "Uzo Aduba  is brilliant in The Residence",
        "content": "The only reason I watched the series is because of the lead actress Uzo Aduba. I've been a fan of her work since In Treatment. I didn't like the writing and overall series but she definitely carried the series. I watch a lot of mysteries mainly British and this wasn't really a mystery but a dramedy.",
        "upvotes": 10,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jgw1ib/uzo_aduba_is_brilliant_in_the_residence/"
    },
    {
        "id": "1jh2378",
        "author": "madeforfun9",
        "title": "The residence",
        "content": "I just finish watching the residence, started thinking about how there is a similar show on Netflix already but can’t remember the title! The first season I think there we’re having a party and I swear Dave Franco was in it? Does anyone know what the series is called? It was same concept, someone was murdered &amp; they couldn’t leave until the detective finished interviewing everyone",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jh2378/the_residence/"
    },
    {
        "id": "1jgya2g",
        "author": "MqAbillion",
        "title": "The Residence.  SO close to being great.",
        "content": "Just binged S1. All the actors nailed their roles and it was fun to watch, but omg this is the most disappointing murder mystery series I’ve seen. The “bad guy” was obvious by the third episode.  \n\nIf you want to Agatha Christie, Agatha Christie. You need better plots. ",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jgya2g/the_residence_so_close_to_being_great/"
    },
    {
        "id": "1jgc5mm",
        "author": "Exotic_Process_8235",
        "title": "UK teachers, how real are the school scenes in 'Adolescence'?",
        "content": "As a mother of a baby boy, I am frankly horrified at the state of the school. Teachers that are dead inside, only videos playing, unruly students and bullies etc. I'm so worried that this is the future for my son. Is it overly dramatised or is it the reality? ",
        "upvotes": 140,
        "comments": 105,
        "media": null,
        "permalink": "/r/netflix/comments/1jgc5mm/uk_teachers_how_real_are_the_school_scenes_in/"
    },
    {
        "id": "1jh5c2v",
        "author": "BennyyyMacc",
        "title": "“This title is not available to watch instantly please try another title” answer in Netflix help has not helped",
        "content": "I have unplugged chrome cast from the tv and plugged it back in \n\nUninstalled Netflix and reinstalled it \n\nSigned out and signed back in to Netflix account.\n\nRestarted chromecast \n\nTried to reload Netflix\n\nStarted watching episode on my phone then tried to cast it to tv and it stopped \n\nAny other ideas on what I can do ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jh5c2v/this_title_is_not_available_to_watch_instantly/"
    },
    {
        "id": "1jg2pvg",
        "author": "Flashy-Squirrel6762",
        "title": "The reason so many of us are missing the point of Adolescence",
        "content": "To everyone saying it’s pretty clear in the first episode and all the evidence points to it. \n\nI, like many, was waiting for the plot twist where *anyone else* was the murderer. \n\nAnd I sat with why, one reason is - it’s because we are constantly shown what it looks like from Jamie’s view. Like the lady constable DS Frank said in the school, “Right, the perpetrator always gets the front line. ‘A man raped a woman’. We’ve followed Jamie’s brain around this entire case…Everyone will remember Jamie. No one will remember her”. \n\nIt’s also shot in such a way that you *feel* like you are a bystander - right next to Jamie, experiencing everything with him. \n\nFrom the moment they barge into his room, sitting in the van looking out the window, not eating his cornflakes, drawing blood, the strip search and to the room where he keeps denying it. You say yes he punched her but you don’t SEE the knife or the stabbing clearly. \n\nAnd then as the episodes progress, you pick and choose the information that supports your hypothesis. He was bullied, he just retaliated. Someone else has the knife. \n\nThe only impact we visibly see of Katie’s death was her friend - who was hurting but was also rude &amp; violent &amp; “troubled”. \n\nThe scene with the psychologist also starts with Jamie being beaten - again more sympathy. He likes hot chocolate, he LOOKS so innocent. Boys will be boys, but Katie rejected him, while he was doing a nice thing by showing her support. The only time you feel some sense of horror is when he’s yelling at the psychologist, but then he calms down and says sorry. \n\nUntil he actually says he wants to plead guilty, you don’t *want* to believe it. \n\nThis whole show is a masterclass in **how we erase the victim every step of the way**. The narrative is always from the man’s point of view and we forget the woman. \n\nAnd how to find excuses because we don’t want to believe. I couldn’t even tell you what Katie looked like. But I know Jamie likes hot chocolate and hates pickles. \n",
        "upvotes": 591,
        "comments": 321,
        "media": null,
        "permalink": "/r/netflix/comments/1jg2pvg/the_reason_so_many_of_us_are_missing_the_point_of/"
    },
    {
        "id": "1jg7f5l",
        "author": "Super-Jury8571",
        "title": "Adolescence, people are hyper fixated on the bullying",
        "content": "I loved the show, I watched a few days ago, and since then I’ve been seeing a lot of videos and post about the show. Something that’s been bugging me is the hyper fixation of the bullying. I don’t think it should be ignored, it was showed for a reason, however I hate seeing people use it as a justification or excuse for murdering Katie. \n \nJamie was a victim, but not of Katie’s. Katie’s comments were made after he participated in the passing around of her nudes and the negative commentary of her body and then tried to take advantage of Katie’s “vulnerability” by asking her out. When she rejected him he felt so insulted and humiliated because “how dare someone who is flat and who no one else wants rejects him”. When she retaliates by calling him an incel he tries to intimidate and scare her and when that doesn’t work he murders her. He then leaves her body on the ground, runs off and proceeds to deny murdering her even though there is OVERWHELMING evidence that he killed her. He feels absolutely no guilt and even tried to validate himself by calling her names later in the series. A lot of people act like Jamie is Katie’s victim or that the names she called him is why he killed her when it’s not. \n\nJamie is a victim of societies unrealistic standards for men, unbroken familial cycles, the school system and other men who prey on insecure, neglected and isolated boys. With that being said I don’t feel bad for Jamie, I recognize what he represents however I feel no sympathy. Jamie still killed an innocent girl because he was insecure. Jamie did not kill Katie because she called him names, he killed her because he felt small and powerless and needed to make someone feel weaker. \n\n(This is just how I interpreted the show, I’m interested to hear yalls opinions!! Just keep it kind please) ",
        "upvotes": 159,
        "comments": 83,
        "media": null,
        "permalink": "/r/netflix/comments/1jg7f5l/adolescence_people_are_hyper_fixated_on_the/"
    },
    {
        "id": "1jgv22f",
        "author": "DanMatei",
        "title": "100 years of solitude",
        "content": "Does anybody know what language melchior was writing in his diary????? I ve made a bet with someone i say it’s hevrew they say its hindu it’s been bithering me for a long time please help 🙏 🙏🙏🙏🙏",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jgv22f/100_years_of_solitude/"
    },
    {
        "id": "1jgwkpa",
        "author": "contradictory_douche",
        "title": "New TV UI is so bad I've stopped browsing Netflix",
        "content": "Filling up your screen with 1-2 suggestions makes browsing for something to watch such a laborious experience.  I don't even bother now. I'll open up prime, crave or Disney +  where I can a broad variety of options on the screen at once. Netflix used to be my go to when I wanted to look for something, now it's my last stop. It's such a minor thing but it's completely ruined the experience for me.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jgwkpa/new_tv_ui_is_so_bad_ive_stopped_browsing_netflix/"
    },
    {
        "id": "1jgzlin",
        "author": "Wooden-Motor5261",
        "title": "What is the name of this Kdrama",
        "content": "What is the name of that kdrama about the stepmother who hires a babysitter and the babysitter turns out to be the mother of the child? I think it was on Netflix maybe but I can't find it. PLS HELP",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jgzlin/what_is_the_name_of_this_kdrama/"
    },
    {
        "id": "1jg1z9p",
        "author": "Prestigious-Neat-625",
        "title": "Stephen Graham is F-ing Phenomenal",
        "content": "I cant get over his performance in Adolescence, but also Bodies, This is England, and everything he's done. HE IS SO FUCKING AMAZING IN EVERY ROLE HE DOES.\n\nI'm sorry, idk if this is the right sub, but Adolescence has been an unreal watching experience. Not only is the story, cinematography, and acting amazing, but the underlying message too?? Omg. \n\n\nNetflix, it's time to leave Hollywood behind and keep finding British shows!!",
        "upvotes": 171,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1jg1z9p/stephen_graham_is_fing_phenomenal/"
    },
    {
        "id": "1jg0jf8",
        "author": "julialoveslush",
        "title": "Who is this actor in adolescence?",
        "content": "Can’t find him on IMDB but sure I’ve seen him somewhere. He was behind the desk at the police station ",
        "upvotes": 184,
        "comments": 82,
        "media": null,
        "permalink": "/r/netflix/comments/1jg0jf8/who_is_this_actor_in_adolescence/"
    },
    {
        "id": "1jh6nbp",
        "author": "IrishStarUS",
        "title": "Netflix fans convinced steamy vampire series is new Twilight but there's a catch",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jh6nbp/netflix_fans_convinced_steamy_vampire_series_is/"
    },
    {
        "id": "1jgktvx",
        "author": "Somethingman_121224",
        "title": "Netflix's Live-Action 'One Piece' Finds Its Tashigi",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jgktvx/netflixs_liveaction_one_piece_finds_its_tashigi/"
    },
    {
        "id": "1jguq6z",
        "author": "IAmQuiteWe1rd",
        "title": "Documentary search",
        "content": "Hello! I'm looking for a documentary that I KNOW I must've seen on Netflix, but I can't seem to find it. \nIt's a documentary about something something gay men in Nazi Germany's military. I tried to Google it but it only came up with El Dorado (the one about the gay nightclub). \nDoes anyone know of this documentary, or if it's even on Netflix?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jguq6z/documentary_search/"
    },
    {
        "id": "1jgfy2e",
        "author": "Synapse709",
        "title": "The Residence: 1 thing left unexplained",
        "content": "Not sure where else to post this.\n\nAm I the only one that thought a calligrapher who sucks at his job working at the White House was a strange detail?\n\nIt was never explained and there were many ways to tie it into the story and clues.  \nGreat show, but this was a missed point that left me curious.",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jgfy2e/the_residence_1_thing_left_unexplained/"
    },
    {
        "id": "1jgms3q",
        "author": "absolute_bodies23fan",
        "title": "Adolescence",
        "content": "Here's my review of this show:\n\nThe continuous shots made me feel like I was watching a video of someone underwater and trying to hold my breath to see how long I'd last... Impressive how the actors stayed in character for 50 minutes straight. \n\nThis whole thing felt so rushed and slow paces at the same time I don't even know how that works but it was so on and off. \n\nParts of it looked like BODIES or something that has already been done before\n\nWell done Stephen, brilliant actor per usual, loved him in BODIES more tho, I'm surprised he didn't the hype during that show in 2023 because it was wonderful. \n\nHowever, I understood the point of the show, it was hardly about the murder, we'd know because they spent more time showing his toxic masculinity rather than trying to figure out how innocent/guilty he is. (Atleast this is also my take on how I knew it wasn't mainly about the murder) we saw him confess but nothing like major court scene. It was nice to see the family POV and it gives us a better picture on how he grew up. But I wish we saw some of the before the murder, to get to see more of his attitude towards her. \n",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1jgms3q/adolescence/"
    }
]