[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1owwjnd",
        "author": "fugaainfinit",
        "title": "Is the service down?",
        "content": "Just got \"kicked\" from tv, and it seems on all devices the same. On web it says \"membership canceled\" while membership is paid and active as usual. Chat is not aviabile, phone is not avaiabile. Looks like a technical glitch? Anyone else experiencing it?",
        "upvotes": 5,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1owwjnd/is_the_service_down/"
    },
    {
        "id": "1owezk6",
        "author": "Impossible-Air-2843",
        "title": "What's the best show currently on Netflix?",
        "content": "Looking for a new show to watch , any recommendations?\n\nHey guys so I'm looking for a new show to watch , I can't tell you specifically the genre I like because it really depends but I'll tell you what I've watched recently that I really liked so you can get an idea , turn of the tide , Dep q , the feud , mobland, Tulsa king , son of a donkey , so yea it's a mix , any recommendations of some good attention catching series ? Thank you ",
        "upvotes": 65,
        "comments": 170,
        "media": null,
        "permalink": "/r/netflix/comments/1owezk6/whats_the_best_show_currently_on_netflix/"
    },
    {
        "id": "1ox1e1k",
        "author": "igneousigneous",
        "title": "Older Series About Local Politics",
        "content": "I \\*think\\* it was a Netflix show. Easily 8 years ago. It was about a fictional local/governor campaign and the race leading up to an election. It was filmed like The Office - with reality camera work and talking-head interviews. I remember it was funny and touching, and pretty gripping. Anyone have a clue? Am I crazy?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ox1e1k/older_series_about_local_politics/"
    },
    {
        "id": "1owzj6u",
        "author": "the_oncoming_doctor",
        "title": "One of the worst UI updates ever",
        "content": "I just got the latest UI update and they just seems to have butchered the UI. Clicking on a title now starts playing it instead of showing the earlier menu. This is bad because if I have to look at the episodes list or add or remove an item from my list I have to start playing which also bring it to my continue watching.\n\nSometimes my wife just watches something from my profile forgetting to switch to hers and now when I go to watch it starts from the middle. What’s more infuriating is that I don’t see a start over button anymore. So I have to rewind it and make sure I don’t see the clips when rewinding.\n\nThe previous menu list was good enough they did they have to update it to this shit.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1owzj6u/one_of_the_worst_ui_updates_ever/"
    },
    {
        "id": "1ox28s4",
        "author": "stxvnq",
        "title": "Why do netflix asked me to pay for the bill even when the bill is due next month.",
        "content": "Hi, I wanted to asked if anyone is currently have the same problem as me. my bill is due next month which is 14 December but suddenly it says “We couldn't process your last payment” even though I did pay my last month bill. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ox28s4/why_do_netflix_asked_me_to_pay_for_the_bill_even/"
    },
    {
        "id": "1ox072u",
        "author": "CanonizedCroissant",
        "title": "HELP: I cannnot see the dark scenes in Stranger Things",
        "content": "I’m trying to do a rewatch and i am having the hardest time seeing dark scenes. I am watching on an IPad pro (my laptop), I have the brightness turned all the way up, and “reduce white point” turned off. I’ve been googling for other solutions, but the dark scenes are still way too dark and I can’t see a thing lol. Any recommendations are appreciated!",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ox072u/help_i_cannnot_see_the_dark_scenes_in_stranger/"
    },
    {
        "id": "1owhx3w",
        "author": "Officialbrandonly",
        "title": "Netflix auto-starting episodes instead of showing episode lists",
        "content": "I’m just frustrated that companies can just update their services and make them worse. I watch Netflix on a Roku stick and ever since the update instead of being able to see the description and take a peek at some of the episodes it just automatically starts the fucking episode.\n\nI don’t see any way to fix it in the settings just so annoyed because it’s probably updated like this just to make people watch more Netflix. It’s so predatory and annoying.",
        "upvotes": 15,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1owhx3w/netflix_autostarting_episodes_instead_of_showing/"
    },
    {
        "id": "1ovwaue",
        "author": "dini_93",
        "title": "Why do I feel like I've been wrong about my understanding of Vietnam after watching Turning Point: The Vietnam War?",
        "content": "Context: I fell if love with Vietnam  as I travelled across the country last year. Till date, it is one the best experience in visiting a foreign country I've had. Food, Culture, Nature and the People are all fabulous. \n\nDuring my visit to Cu Chi Tunnels, I befriended my tour guide who was super informative. We spoke a lot about the culture and history of Vietnam with more focus on the war. He was from the North and his family were part of the communist party. But he was neutral and explained the whole scenario. One thing I was clear, that there's no good guy or bad guy here. Both the sides had committed war crimes. But then I visited the War Memorial, I felt the US did horrific attrocitices. They equally killed civilians as did the communists. So all in all, I had a belief that all 3 parties, The communists of North, South Vietnamese and The US were all equally guilty of inflicting so much pain to common people and created so much disruption that no one could live happlity during that period in time. \n\nBut after watching this series, I feel the South Vietnamese were the neutral guys who got stuck between the North and the US. Is this a right way of understanding the whole scenario?",
        "upvotes": 270,
        "comments": 336,
        "media": null,
        "permalink": "/r/netflix/comments/1ovwaue/why_do_i_feel_like_ive_been_wrong_about_my/"
    },
    {
        "id": "1owcp30",
        "author": "RiskAndReason",
        "title": "What are we watching today? 🍿",
        "content": "What’s on your watchlist tonight, and would you recommend it?  \n  \nI’m looking for something to unwind with this evening... could be a movie, doc, or a new series drop",
        "upvotes": 20,
        "comments": 109,
        "media": null,
        "permalink": "/r/netflix/comments/1owcp30/what_are_we_watching_today/"
    },
    {
        "id": "1owv9sr",
        "author": "intelerks",
        "title": "Rockstar surprises fans with Red Dead Redemption’s jump to mobile and modern consoles",
        "content": "",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1owv9sr/rockstar_surprises_fans_with_red_dead_redemptions/"
    },
    {
        "id": "1owluo8",
        "author": "Fickle_Notice2822",
        "title": "Psychological thriller recommendations",
        "content": "What’s the best psychological thriller movie or show that you recommend. I love movies or shows with crazy and unexpected plot twists that really get you thinking. I’ve already watched behind her eyes which I know is one that everyone recommends and I really enjoyed it.",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1owluo8/psychological_thriller_recommendations/"
    },
    {
        "id": "1ownhei",
        "author": "InitiativeHot7774",
        "title": "I need help",
        "content": "There used to be this show i watched in like, 7 years ago maybe. it had these two main characters, one short, one tall, and a side character, an army man with a tank. in one episode, the short and tall guy were in a magic contest, and they got stuck in the ocean or smthg.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ownhei/i_need_help/"
    },
    {
        "id": "1ovy7e4",
        "author": "huffpostuk",
        "title": "The Beast In Me Reviews: Critics Weigh In On Netflix Thriller",
        "content": "",
        "upvotes": 34,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1ovy7e4/the_beast_in_me_reviews_critics_weigh_in_on/"
    },
    {
        "id": "1owfuo1",
        "author": "wBrite",
        "title": "Subtitles",
        "content": "Did everyone else's subtitles just change fonts out of nowhere? I can only change size and style. Now they are all in sans serif caps with a drop shadow. ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1owfuo1/subtitles/"
    },
    {
        "id": "1owo2x3",
        "author": "Alarmed_Eye_2177",
        "title": "I’m Jumping Ship OC&gt;LA",
        "content": "I can’t stand selling sunset anymore and I gave it one last chance. I am a reality show lover, and watch it for the drama. (I always say I love these shows because I don’t have enough drama in my life so I get my fix when i watch them😅) This wasn’t drama this show has turned into girl on girl hatred at its worst…it is tied with secret lives of Mormon wives… selling OC is 10,000x better and brings that Laguna beach, The Hills, Real Housewives, kinda drama which I crave.\n\nI made this post to see if anyone agrees but also I needed to bitch lol. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1owo2x3/im_jumping_ship_ocla/"
    },
    {
        "id": "1ow0cjx",
        "author": "the_trend_memo",
        "title": "The Wait Is Over! Netflix House Philadelphia Officially Opens",
        "content": "",
        "upvotes": 10,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ow0cjx/the_wait_is_over_netflix_house_philadelphia/"
    },
    {
        "id": "1owify2",
        "author": "volcanic_clay",
        "title": "How to add existing member with one profile on account as Extra Member?",
        "content": "I am trying to add a single dude who only has one profile in his Netflix account as an Extra Member.  They want to maintain their history and such.  Netflix chat is telling me even if a new email address is made, since their existing account only contains one profile there is no way it can be transferred and therefore that user cannot be added as an extra member and maintain their history.  Is this accurate?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1owify2/how_to_add_existing_member_with_one_profile_on/"
    },
    {
        "id": "1owunkx",
        "author": "Lumpy_Concept9911",
        "title": "Can I watch Frankenstein in parts?",
        "content": "I’ve been meaning to watch the Frankenstein movie on Netflix but it’s like 2h 21m. I don’t know if I can watch 2 hours of movie at home without being interrupted especially since I only have Netflix on tv in the family living room. But I’m scared that pausing it multiple times would kill the immersion.",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1owunkx/can_i_watch_frankenstein_in_parts/"
    },
    {
        "id": "1ovfgtu",
        "author": "RiskAndReason",
        "title": "Just watched Netflix’s Frankenstein last night",
        "content": "Didn’t expect it to hit that hard. Beautiful cinematography, haunting score, and a surprisingly human story beneath all the darkness. What did you all think of it? What should I watch after this? ",
        "upvotes": 196,
        "comments": 68,
        "media": null,
        "permalink": "/r/netflix/comments/1ovfgtu/just_watched_netflixs_frankenstein_last_night/"
    },
    {
        "id": "1ovjlrj",
        "author": "Mindless-Platypus-75",
        "title": "Death by Lightning Thread",
        "content": "",
        "upvotes": 104,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1ovjlrj/death_by_lightning_thread/"
    },
    {
        "id": "1ovzsl6",
        "author": "BossJosh74",
        "title": "Last Samurai Standing switching back and forth sub vs dub.",
        "content": "I was wondering if the dub is CGI or some AI CGI magic? Does anyone else think it is a little \"uncanny valley\" or does it seem real? I love lip flaps and the art of matching them from Voice Artists. ",
        "upvotes": 7,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1ovzsl6/last_samurai_standing_switching_back_and_forth/"
    },
    {
        "id": "1ovwt2v",
        "author": "baguetteworld",
        "title": "Fave Netflix show in a different language?",
        "content": "Favourite Netflix show in a different language — Aka not originally in English \n\nNot sure why I need more characters :(\n\n\nIsiwndnsjejedndnvgrfyucjvjvjivific",
        "upvotes": 11,
        "comments": 79,
        "media": null,
        "permalink": "/r/netflix/comments/1ovwt2v/fave_netflix_show_in_a_different_language/"
    },
    {
        "id": "1owdmtv",
        "author": "xxxdanixxx0",
        "title": "Building the band had favourites.",
        "content": "I feel like ALOT of the audition songs people did on the show were SET UPS.(I don't believe they picked their songs.) And I'm not just on about people who didn't make it into bands the people that did make it they tried to set them up and failed.\n\nPeople who made it into bands like nori, wennely,haley I even think elise.(and many more people.)the show was setting them up. Now don't get me wrong elise had one of the best audtions but hear me out.\n\nOn American idol she sang aretha Franklin, while on on btb she sang tate mcrae those are two VERY DIFFERENT songs.now she made it work and it was AMAZING however if you listen to the original version of the song she sang on btb...SET UP.(and this is coming from someone who likes that song)\n\nNow Haley, the songs she sings on tiktok alot of belting yk meanwhile on btb she sings feather and they want to believe she picked that no what are tou supposedto do with that... also on her tiktok she said she wanted to sing sia for her mum AGAIN two VERY DIFFERENT songs.\n\nAnd wennely and nori to choose water by tyla and greedy for an AUDITION SONG.They made  it work but there's other songs that could've showcased their vocals (which I've seen outside of the voice.)like when nori sung a victoria monet song on the 3quency tour that suited her voice unlike greedy cause she actually can sing but that song was not doing \nHer justice And wennely, singing water...what are you supposed to do with.\n\nI Don't think she was set up but you'd think brianna would sing a beyonce song considering she's huge fan or and rnb song considering she said she grew up on shirelles,destinys child etc.\n\nI could go on for ages but you get the point.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1owdmtv/building_the_band_had_favourites/"
    },
    {
        "id": "1owhmp4",
        "author": "Ember_Grove20",
        "title": "Which Netflix series or movie had your favorite ending?",
        "content": "Some shows and movies really nail their ending, while others leave you thinking about what could have been. Which series or movie ending do you think was the best, and why? Curious to hear everyone’s thoughts and experiences!",
        "upvotes": 0,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1owhmp4/which_netflix_series_or_movie_had_your_favorite/"
    },
    {
        "id": "1owmr2h",
        "author": "Soggy_Recording_1740",
        "title": "House of dynamite question",
        "content": "Does anybody who watched the house kf dynamite movie know how it ended? Did the nuke hit or no? I just got done watching it and I didn’t understand the ending.",
        "upvotes": 0,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1owmr2h/house_of_dynamite_question/"
    },
    {
        "id": "1ow0it9",
        "author": "CableBeautiful4316",
        "title": "Which upcoming new Netflix originals are you excited about?",
        "content": "Squid game ended this year and stranger things is about to end. Netflix is working on many new originals internationally. Which ones are you most excited about?",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ow0it9/which_upcoming_new_netflix_originals_are_you/"
    },
    {
        "id": "1ow5mi7",
        "author": "suprswimmer",
        "title": "Sound messed up only on Netflix?",
        "content": "The TV sound works fine for any other streaming service or disc we watch, so it's weird -- the last week or so sound has been spotty/glitchy on Netflix. Sometimes we start something and it begins with no sound and if we restart it is back on. Or during the episode it will sound bumpy, almost? Like the noise is cutting in and out really fast like the Internet is spotty, but connection is perfect and this doesn't happen anywhere else.\n\nIs this an issue for anyone else?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ow5mi7/sound_messed_up_only_on_netflix/"
    },
    {
        "id": "1ow54v3",
        "author": "TyraneeLDP",
        "title": "Crime Scene: Zero is fascinating!",
        "content": "I’m an American watcher but I’m loving Korean competition shows. I’ve seen Devil’s Plan and Culinary Class Wars and thought they were both fantastic. Crime Scene:Zero is no exception.\n\nIt’s such a *different* concept - Actors doing their best to LARP as characters in a murder mystery yet still legitimately trying to find the killer so they win money. Each actor gets a profile of their character and only the “murderer” knows they’re the killer and has to lie and fool the others. There are these elaborate sets with different “rooms” where the contestants find evidence and debate sections where they each can sway opinion.\n\nThere are a few things in the first 2 episodes I couldn’t culturally follow but that’s to be expected. The stories are really elaborate and it’s a super fun guessing game. High recommendation. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ow54v3/crime_scene_zero_is_fascinating/"
    }
]