[
    {
        "id": "1ph9lu7",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 9,
        "comments": 1882,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ph9lu7/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1pia1vr",
        "author": "scoreboard-app",
        "title": "Pre Match Thread: Real Madrid vs Manchester City, UEFA Champions League Match 6",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1pia1vr)",
        "upvotes": 68,
        "comments": 166,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pia1vr/pre_match_thread_real_madrid_vs_manchester_city/"
    },
    {
        "id": "1pi7j56",
        "author": "Ready_Ad_1353",
        "title": "[ABC.es] Xabi Alonso feels isolated, and his players are taking advantage of his vulnerability. He has recently become a political figure, attempting to win over the dressing room by offering concessions: shorter video sessions, untouchable stars, more days off, fewer tactical obligations",
        "content": "In these 6 months of the Alonso era, the Real Madrid dressing room has not meshed well with him. He arrived to raise the bar, both in training and matches; to impose discipline and order in a dressing room that was spoiled and toxic; and to modernize the team's style of play. As the weeks went by, the players grew increasingly frustrated with his tactical demands, high press, advanced defensive line, endless video sessions, and limited rest days. And Alonso, knowing he was losing the dressing room, gradually gave in, eventually offering them his full support, his arm, and whatever else they asked for.\n\nThe latest example is recent. The before and after the victory at San Mamés demonstrates the power of the dressing room. Traveling on Tuesday instead of Wednesday angered a good number of the players, and after the win against Athletic, Alonso granted them two days off, when only one had been planned. So the preparation for the match against Celta included only one training session, on Saturday. This is just one example of the many that have occurred since the Vinicius case erupted.\n\nUntil then, Alonso didn't really know what it meant to coach Real Madrid. And that's despite being a player for five years, and having witnessed how a coach like Mourinho lost the support of a large majority of his players when things started to go wrong. Now Alonso himself is experiencing firsthand the influence players have at Real Madrid, but he doesn't understand why he was brought in if, at the first sign of trouble, the club looked the other way, as happened with Vinicius. That's when Xabi understood that he had to manage 25 egos and put his coaching role aside. The beginning of the end.\n\nAlonso believed that coaching on his knees would boost the dressing room, but usually, it's quite the opposite. Everything that has happened in recent weeks has paved the way for what seems imminent: his dismissal.",
        "upvotes": 465,
        "comments": 208,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NGG1d91SGSNO_1MEIZpz5FybytyLdSBFw4BOg28N2jg.jpeg?auto=webp&amp;s=fff75be8dda7b029b065e62dbb4674d662a0c3d0"
        },
        "permalink": "/r/realmadrid/comments/1pi7j56/abces_xabi_alonso_feels_isolated_and_his_players/"
    },
    {
        "id": "1pihgz5",
        "author": "Humble-Dot-1022",
        "title": "Guardiola recommends Xabi to use his own one when going to the toilet",
        "content": "I'm trying to not get my post removed, but basically when asked what advice he would give Xabi, given that they are friends, Pep said \"I would recommend him to pee with his own one\". He added \"I know it won't come out perfume, so that will improve things for him\".\n\nThis is a Spanish expression, meaning \"do what you want to do, not what others tell you\".\n\nhttps://www.dailymotion.com/video/x9vc6iw",
        "upvotes": 136,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WAAx58pxp8F9y2ny4JXeYwbeFb7bVuFBQxp8HD3SZKM.jpeg?auto=webp&amp;s=f8c1fcc679c2b0d9c87377bbe6a3dfd1852ceea0"
        },
        "permalink": "/r/realmadrid/comments/1pihgz5/guardiola_recommends_xabi_to_use_his_own_one_when/"
    },
    {
        "id": "1piadbi",
        "author": "SandwichSisters",
        "title": "All Xabi asked for was a bit of professionalism and effort",
        "content": "All of the stuff that gets leaked supposedly attacking Xabi to me is nothing but embarrassing for the players and the club. \n\nI am very curious who can come to the club and actually do something positive.\n\nHalf the team would be outside of the squad of Flick’s Barca.\n\nHopefully Papa Flo can do a solid cleanup and put the place in order",
        "upvotes": 258,
        "comments": 60,
        "media": null,
        "permalink": "/r/realmadrid/comments/1piadbi/all_xabi_asked_for_was_a_bit_of_professionalism/"
    },
    {
        "id": "1pigx30",
        "author": "Bald-Eagle619",
        "title": "Gareth Bale on the 'Wales, Golf, Madrid' flag: \"I got slaughtered by the Spanish media. I felt hard done by because it comes down to misinformation. I don't prioritise golf more than I do my country and my club and physically haven't done one thing wrong. I look back at it now &amp; laugh about it.\"",
        "content": "Can we talk about the “Wales. Golf. Madrid” flag?\n\nThat slogan is the one thing I felt hard done by. For one thing, no one knew how much golf I actually played. If I ask you now how much golf you reckon I played, you’d probably say three or four times a week maybe, something along those lines?\n\nRoughly, yep.\n\nI played once every two to three weeks, but only on a day off. I'd never play a game for eight hours, I was always very professional about it. But people don't know that so they make up that slogan.\n\nDo you recount the Wales game against Hungary in November 2019 where the incident with the flag happened that would go on to incense the Spanish media?\n\nWe’d just qualified for the Euros so I'm obviously celebrating, the whole team's there, then someone puts the flag [with the slogan] in front of me. What am I supposed to do? I'm like, I can't throw my own country's flag on the floor because that is the worst thing I could do. I actually didn't physically ever touch the flag, which for me was important because I was like, it's not me doing this – I'm just celebrating with my friends. Then what happened happened.\n\nThings got pretty ugly.\n\nI got absolutely slaughtered [by the Spanish media]. I felt a bit hard done by because it all comes down to misinformation. I obviously don't prioritise golf more than I do my country and my club and physically haven't done one thing wrong. I look back at it now and it's like, it is what it is. I can't do anything about it. You have to laugh or you cry. So I laughed.\n\nDid you ever cry about it?\n\nNo. If people were ever against me, I would run on, smile and laugh. That was my way of coping with it. I either get angry and I play well or I enjoy and smile and laugh about it and play well. I didn't want to show any weakness and be upset.\n\nAre you surprised by how well you were able to play despite what was going on?\n\nI still remember that game I came on for the last 30 minutes [against Real Sociedad at the Bernabéu four days later], I was getting fully whistled, then by the end I was getting applauded. I played so well. In the car driving home, my agent called me and he was like, you are literally insane. No one can deal with that type of pressure and come on and do those things – you're just weird. And I'm like, well luckily I'm mentally strong. If other people were in my situation, I'm not sure they would've coped.\n\nWhat would you put that down to?\n\nMy dad is very strong. The way he and my mum brought me up was like “no bullshit”. They sacrificed a lot when I was growing up, travelling and giving up their weekends. It’s something I only understand now I’m a parent doing it with my son. But if I went to a game and I didn't try, Dad was like, you can play shit. I don't care. You can play amazing. I don't care. But if you don't try, that's not acceptable. I say it to my son now, he is only seven but trying is the only thing I require from you. It teaches you a lifelong lesson. You can't just give up when you don't like it or things aren't going well.\n\nEven when you’re being vilified?\n\nI've always said with journalism, if they could only write about facts then it would change the game. But some people just write what they want and ultimately you've got a reader, so why wouldn't they believe it? There should be a responsibility on them that they only write the truth.\n\nI’m a journalist and I’ve got a truth for you: are you OK that I'm on the green and you're not?\n\nYeah, I am. Facts. That’s a cold, hard fact.",
        "upvotes": 96,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/M3bXr6VIl2aB-68aIxzTZcH3bZXFvJ0ZQFS0A_0_rY0.jpeg?auto=webp&amp;s=3a0e2c46d3365038519d80dc9e1e046c05c96d00"
        },
        "permalink": "/r/realmadrid/comments/1pigx30/gareth_bale_on_the_wales_golf_madrid_flag_i_got/"
    },
    {
        "id": "1pi6wf3",
        "author": "National-Bus4521",
        "title": "bro wasnt joking after all",
        "content": "",
        "upvotes": 289,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0eoni6pzf66g1.png?auto=webp&amp;s=952f9b126941db3ad7f521cc82fbf35e1a8eb84e"
        },
        "permalink": "/r/realmadrid/comments/1pi6wf3/bro_wasnt_joking_after_all/"
    },
    {
        "id": "1pi487z",
        "author": "Hiroshima-6-1945",
        "title": "Tchouameni: \"If we lose 0-2 it's our problem, not the coach's\"",
        "content": "",
        "upvotes": 433,
        "comments": 53,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ARVeIyhVBsthenVt_MEOtqrmkaBHAy4Bg1ryDwbQFu4.jpeg?auto=webp&amp;s=7b04f85a6835315f5f4e0c3cef58715ac1e7c7d7"
        },
        "permalink": "/r/realmadrid/comments/1pi487z/tchouameni_if_we_lose_02_its_our_problem_not_the/"
    },
    {
        "id": "1pi0ocp",
        "author": "Due_Requirement_1170",
        "title": "This summarizes it quite nicely.",
        "content": "",
        "upvotes": 850,
        "comments": 166,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/qc0wny10k46g1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pi0ocp/this_summarizes_it_quite_nicely/"
    },
    {
        "id": "1piaapu",
        "author": "asensia-kopfschmerz",
        "title": "Xabi Alonso knows what’s wrong at Real Madrid. But he’s powerless to fix it",
        "content": "Reported by Dermot Corrigan, the Athletic.\n\n  \nAI generated summary (prompt: focus on facts not reported before and support the title): \n\nA chaotic 2-0 loss to Celta Vigo featuring 2 red cards exposes Xabi Alonso's inability to correct Madrid's culture. Despite a €120m defensive overhaul adding Trent Alexander-Arnold, discipline remains poor. With Vinicius Jr. refusing to renew his contract due to friction with Alonso, the coach appears powerless to command his stars.",
        "upvotes": 151,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FOz2tVWytMpXsj_XdACjb3lZ5xcFH4OanLzRk1qLW0Y.jpeg?auto=webp&amp;s=e09cdae61116f1d9ac31d5182e084a3c80381381"
        },
        "permalink": "/r/realmadrid/comments/1piaapu/xabi_alonso_knows_whats_wrong_at_real_madrid_but/"
    },
    {
        "id": "1pieenx",
        "author": "ace-s",
        "title": "Flo and the board should have supported Xabi like Liverpool have been supporting Slot",
        "content": "I find it crazy that the club's mouthpieces are spreading rumors that Xabi Alonso will be sacked if we lose to Man City, what do theyt expect Xabi to do with a injury ridden squad that does not give a fuck. I was hoping the club to put pressure on the players but it seems that they are not willing to face the actual problem with this team.\n\nVini should have been punished after his tantrum in El Classico. Just look at Liverpool, they removed one of their greatest players ever from the squad list because he acted out against the manager.\n\nThe player issue is bigger than the manager issue. We have a player problem, without that getting fixed not even Klopp can do anything with this squad.\n\nFor once this club should not cave into the players and have their manager's back. Its been 2 years in a row where we clearly have player problems.\n\nWe need to learn from other clubs, otherwise we will be constantly changing managers because we are not fixing the real problem instead...",
        "upvotes": 77,
        "comments": 41,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pieenx/flo_and_the_board_should_have_supported_xabi_like/"
    },
    {
        "id": "1pi4cju",
        "author": "TheConnstant",
        "title": "Changing the manager will not change anything",
        "content": "No managerial change or signing/exit will help Real Madrid if the player whom the team is built around constantly clogs up places of other players and doesn't actually do what he is supposed to do( Make runs towards the box)",
        "upvotes": 270,
        "comments": 105,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/l6ifi9beq56g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pi4cju/changing_the_manager_will_not_change_anything/"
    },
    {
        "id": "1pi8foq",
        "author": "8Nakul",
        "title": "Kylian Mbappé didn’t train with Real Madrid squad and he’s a doubt to face Manchester City.",
        "content": "",
        "upvotes": 102,
        "comments": 79,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pi8foq/kylian_mbappé_didnt_train_with_real_madrid_squad/"
    },
    {
        "id": "1pikpw1",
        "author": "ManuMora98",
        "title": "[Fem] Real Madrid 2 - 0 Wolfsburg | Maria 19', Linda 67' | Huge win against one of the historic teams of women's football, playing with 10 the second half (9 in the added time), and tie with 10 points in the top spots of the table | Women's CL Match Day 5",
        "content": "",
        "upvotes": 19,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/sawgjy76496g1.jpeg?auto=webp&amp;s=287bf12b32e397dd4a833660a5b4732564082fc9"
        },
        "permalink": "/r/realmadrid/comments/1pikpw1/fem_real_madrid_2_0_wolfsburg_maria_19_linda_67/"
    },
    {
        "id": "1picwdc",
        "author": "cyrusmancub",
        "title": "Mbappé is a serious doubt against City with a muscle injury. Xabi will release the squad list tomorrow before the match",
        "content": "",
        "upvotes": 37,
        "comments": 25,
        "media": null,
        "permalink": "/r/realmadrid/comments/1picwdc/mbappé_is_a_serious_doubt_against_city_with_a/"
    },
    {
        "id": "1phsflr",
        "author": "NotRod96",
        "title": "This is what Mbappe lacks as a 9",
        "content": "Mbappe is not the problem and he’s having an amazing year. However, this is such a good example of what he lacks as a 9 and in hindsight, it cost us points. He was two steps late because he didn’t make this run and that cost us a goal. \n\nHow is he not attacking the space here? This is what Ronaldo has done his whole career that helped him score 50+ goals per season…",
        "upvotes": 668,
        "comments": 258,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ol1quwpki26g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1phsflr/this_is_what_mbappe_lacks_as_a_9/"
    },
    {
        "id": "1phspvk",
        "author": "DelusionBuster1225",
        "title": "Nico Paz vs Lautaro Martinez",
        "content": "",
        "upvotes": 572,
        "comments": 36,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zqprj7dok26g1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1phspvk/nico_paz_vs_lautaro_martinez/"
    },
    {
        "id": "1phpj1o",
        "author": "Top_Bread_4595",
        "title": "I think this is true",
        "content": "",
        "upvotes": 786,
        "comments": 50,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ha0orxqax16g1.jpeg?auto=webp&amp;s=df296799bc173a7d580dcfdfa1381b2ba8c4b839"
        },
        "permalink": "/r/realmadrid/comments/1phpj1o/i_think_this_is_true/"
    },
    {
        "id": "1pik0y5",
        "author": "ManuMora98",
        "title": "Real Madrid W [2] - 0 Wolfsburg W | Linda Caicedo great goal 66' (Weir assist, we're playing with 10)",
        "content": "",
        "upvotes": 8,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/J18OYe5at8GMFZATrkQA63rDhBjPG3cLpLc4pXCkRvw.jpeg?auto=webp&amp;s=2a22170e9a4b5bdc159a846ef7a5256a9af4f9f8"
        },
        "permalink": "/r/realmadrid/comments/1pik0y5/real_madrid_w_2_0_wolfsburg_w_linda_caicedo_great/"
    },
    {
        "id": "1piiatq",
        "author": "ManuMora98",
        "title": "Real Madrid W [1] - 0 Wolfsburg W | Maria Méndez 19' (Eva Navarro assist)",
        "content": "",
        "upvotes": 12,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qStvSRjFW8mSrlPUvlHAoNvxphfz_QkEgrmKt5A56n0.jpeg?auto=webp&amp;s=088cf77f2802574acb53c00725516f1d5359b088"
        },
        "permalink": "/r/realmadrid/comments/1piiatq/real_madrid_w_1_0_wolfsburg_w_maria_méndez_19_eva/"
    },
    {
        "id": "1pij36y",
        "author": "zinful77",
        "title": "Real vs barca Tactics",
        "content": "Just finished watching the first half of barca UCL game. Aside from their ridiculous high line and aggressive press.. their attacking strategy is worth noting.\n\nA few things I noticed\n\n1 - RB and LB overlapping and underlapping runs (mostly RB Kounde)\n\nKounde and yamal connection is amazing.. kounde received so many passes that led to dangerous balls towards the middle of the box. Valverde is perfect for this. \n\n2 - raphinha free roaming.. playing a lot off the ball that created lots of space for balde and fermin towards the left and center. \n\n3 - constant box presence in the form of lewandowski and raphinha\n\n\nIn CWC RM utilized Fran and Trent pretty good. Wondering what changed Carreras can also be that attacking threat but the problem I see is vini hogging the ball and not passing for those lapping runs. Hopefully xabi points this out to the team. \n",
        "upvotes": 10,
        "comments": 10,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pij36y/real_vs_barca_tactics/"
    },
    {
        "id": "1pi9jw6",
        "author": "theeama",
        "title": "Blaming Mbappe, Vini, or Alonso Won't solve the problems. It's a collective issue.",
        "content": "For many years, I've tuned into Madrid games. For many years, you could tell that Madrid's young players weren't ready to take over. One of my mates used to say, \"Watch what will happen when the senior guys leave, can these Madrid youngsters do it when they don't have those players to hold their hands?\"\n\nAnd well, we're seeing that now, your players are just not mature enough because they were never asked to be mature.\n\nReal Madrid is an unbalanced squad. The profiles are correct, but the players need a reality check on where they need to be for the team to excel. They need to understand that the team is better than the individual. \n\nLet's break it down:\n\nVini and Mbappe CAN PLAY TOGETHER. The notion that two absolute world-class players best in their positions can't play together is just rubbish. The notion that Vini is selfish and Mbappe is selfish is again rubbish. These are Twitter takes and haters just spewing nonsense. \n\nThe problem that Vini and Mbappe have is that Madrid's Midfield and shape are counter-productive. \n\n Yes, both players like to occupy the left wing and left half space, but we also know that both players are intelligent enough and have good movement to know how to rotate and be in the best possible space, and they have shown multiple times this year that it can work. \n\n  \nMadrid's problem really lies in the fact that your midfield doesn't have a fucking clue. \n\nBellingham is not a 10. Let's just state this. He is not a 10. And the sooner Bellingham accepts this, Xabi accepts this, you won't see much improvement. Bellingham is a box-to-box midfielder and should be employed as such. \n\n  \nThe reason why you don't want Bellingham in the 10 position is because of the attackers that you have. What Madrid needs for 10 is a pure playmaker, your Ozil, Di Maria, Odegard, Guler, Nico Paz. \n\nYou need a pure playmaking 10 here because you have players that are very good off-ball and are very good with receiving the ball at their feet or into space. \n\nBellingham is great in a lot of areas, but his strengths would be best utilized deeper to help progress the ball forward, laying it off to the #10 or distributing it out wide for one of the wingers to drive it forward. \n\nHe can then crash the box to get on cutbacks or crosses, or be the man from deep to break the low block with a deeper unmark runs. \n\nA Bellingham, Tchouameni Pivot could work. \n\n  \nStop Icing Rodrygo. It's simple as that, in every attack especially Madrids, you need that selfless player that will run and run and keep on going. Rodrygo provided that in previous years and he is more than good enough todo so. Now the player might feel disrespected and might feel that the club doesn't care about him but i sincerely believe, that an attack of Vini Mbappe Rodrygo can work and should be working. \n\n  \nYes you do need fullbacks and defenders and maybe adding some more creative midfield players, but your squad has the right profiles and player types to be successful. \n\nVini's head is all about his contract at this point, Rodrygo has one and half foot out the door. \n\nBellingham is in no mans land at this point, even his england spot isn't secure. \n\nBut the noise, the internal distractions, the noise from the outside. Too much non-footballing nonsense is happening at Madrid. \n\n",
        "upvotes": 36,
        "comments": 30,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pi9jw6/blaming_mbappe_vini_or_alonso_wont_solve_the/"
    },
    {
        "id": "1pi67g1",
        "author": "ManuMora98",
        "title": "Our opponent in the Copa del Rey Round of 32 is Talavera de la Reina",
        "content": "",
        "upvotes": 37,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wyp8364z966g1.jpeg?auto=webp&amp;s=dbdf80cf6b1b5155eb7213456dfe82b1e2fe9182"
        },
        "permalink": "/r/realmadrid/comments/1pi67g1/our_opponent_in_the_copa_del_rey_round_of_32_is/"
    },
    {
        "id": "1pifsg7",
        "author": "ManuMora98",
        "title": "[Fem] Our Starting XI against Wolfsburg (home) | Women's CL Match Day 5",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/dykvs8iq686g1.jpeg?auto=webp&amp;s=3796358eb679ea79c3bf2ef815a05597090e596a"
        },
        "permalink": "/r/realmadrid/comments/1pifsg7/fem_our_starting_xi_against_wolfsburg_home_womens/"
    },
    {
        "id": "1phpfsn",
        "author": "FrrancondonaEra",
        "title": "is this look like a team everyone is just shooting without even trying to think that we might need to keep the ball",
        "content": "",
        "upvotes": 210,
        "comments": 51,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9w9uy70fw16g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1phpfsn/is_this_look_like_a_team_everyone_is_just/"
    },
    {
        "id": "1pidco3",
        "author": "Madridv22",
        "title": "Right winger is needed",
        "content": "If you watch the games the right winger side of the field is empty. Of all the players of our 3 peat I’d love to have Gareth Bale right now. He would tear up the space on the flank. \n\nWould you guys like Salah? Could he play champions league or not? Not familiar if the new format changed that part of the rules. ",
        "upvotes": 5,
        "comments": 23,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pidco3/right_winger_is_needed/"
    },
    {
        "id": "1pip47v",
        "author": "Physical_Package_340",
        "title": "Are we doomed tomorrow?",
        "content": "With Mbappe (most likely) and Cama (confirmed) injured for tomorrow, what are your thoughts? Other players (potential starters) injured : Militao, huijsen, carvajal, TAA\n\n\nI feel like it's a lose - lose situation because, either we will get spanked or Vini will have one of his best games to show Mbappe is the problem 🤣, get his extension and our suffering will never end! \n\n",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pip47v/are_we_doomed_tomorrow/"
    },
    {
        "id": "1pi4f8r",
        "author": "Cultural_Big_510",
        "title": "Cr7 talking about the difference between spanish and English refs",
        "content": "\nHere’s a video of Cry explaining the difference between Spanish referees and English referees, and honestly it perfectly highlights something a lot of fans don’t really think about. In England, the culture around referees is completely different. Players can say things like “fuck off” in the heat of the moment, and most referees just let it slide because they understand it’s part of the intensity and emotion of the match. They don’t take it personally, and they don’t react harshly unless it crosses a very clear line. English refs tend to prioritize keeping the game flowing, so they usually avoid giving cards for simple verbal frustration.\n\nBut in Spain, referees take that kind of language and attitude much more seriously. They view insults or disrespect as a direct challenge to their authority on the pitch. The environment is stricter, the expectations for player behavior are higher, and referees are quicker to show cards if they feel they’ve been disrespected. So something that might be ignored in the Premier League can easily result in a yellow or even a red card in La Liga.\n\nThat’s why this video is so relevant, especially after everything that’s been happening recently  like Bellingham insulting the referee and the whole situation with Carreras’ red card. When you understand how different football cultures treat referees, it actually explains a lot. What players might see as normal reaction or heat-of-the-moment frustration, Spanish refs interpret as a serious offense.\n\nSo I just wanted to share this video because it gives really clear context for those moments. It helps people understand why certain players get punished more harshly in Spain for things they would probably get away with in England. It’s not necessarily about the referee being dramatic , it’s just a different culture and a different standard in how respect is enforced on the pitch.",
        "upvotes": 15,
        "comments": 5,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/b4u0g4epr56g1/CMAF_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pi4f8r/cr7_talking_about_the_difference_between_spanish/"
    },
    {
        "id": "1phijj7",
        "author": "Snoo87224",
        "title": "Xabi Alonso And Madrid.",
        "content": "Real Madrid under Xabi Alonso so far:\n\n👕 21 games played\n\n✅ 15 wins\n\n❌ 3 defeats\n\n🟰 3 draws\n\n\n⚽️ 44 goals scored\n\n— Majority of these coming from Mbappé, who has been carrying the attack so far.\n\n🥅 20 goals conceded\n\n🔒 9 clean sheets\n\n🥈 2nd in La Liga, 4 points behind the leaders\n\n🌟 4/5 wins in the Champions League\n\n📉 Big-game struggles:\n\n— Lost the Madrid Derby\n\n— Lost to a terrible, out-of-form Liverpool side\n\n— Lost to 10th-place Celta Vigo",
        "upvotes": 215,
        "comments": 76,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/m3mczhlkm06g1.jpeg?auto=webp&amp;s=0eb5ba488d70001059c7129789a2d2f60e746786"
        },
        "permalink": "/r/realmadrid/comments/1phijj7/xabi_alonso_and_madrid/"
    },
    {
        "id": "1phbxbd",
        "author": "supplementarytables",
        "title": "BREAKING: Éder Militão suffers tear in the biceps femoris muscle of his left leg with involvement of the tendon.\n\nReal Madrid defender will be out for 3-4 months, reports @AranchaMobile.",
        "content": "",
        "upvotes": 482,
        "comments": 141,
        "media": null,
        "permalink": "/r/realmadrid/comments/1phbxbd/breaking_éder_militão_suffers_tear_in_the_biceps/"
    }
]