[
    {
        "id": "1h17exz",
        "author": "ChandlerAndIsaiah",
        "title": "Hi /r/movies! We're Chandler Levack &amp; Isaiah Lehtinen, director and lead actor of I LIKE MOVIES, a Canadian coming-of-age comedy-drama about a young cinephile working in a video rental store. It premiered at TIFF in 2022 and it's now available to watch in the US! Ask us anything.\n",
        "content": "",
        "upvotes": 135,
        "comments": 119,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3c6c5g82ug3e1.jpeg?auto=webp&amp;s=aa5e31cd04a3f9b3158949b20b8f4b168c07c9d1"
        },
        "permalink": "/r/movies/comments/1h17exz/hi_rmovies_were_chandler_levack_isaiah_lehtinen/"
    },
    {
        "id": "1h0uf7h",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Gladiator II / Wicked: Part I / Moana 2)",
        "content": "[Gladiator II](https://old.reddit.com/r/movies/comments/1gwxxwd/official_discussion_gladiator_ii_spoilers/?)\n\n[Wicked: Part I](https://old.reddit.com/r/movies/comments/1gwxxy1/official_discussion_wicked_part_i_spoilers/?)\n\n[Moana 2](https://old.reddit.com/r/movies/comments/1h0uevk/official_discussion_moana_2_spoilers/?)",
        "upvotes": 37,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1h0uf7h/official_discussion_megathread_gladiator_ii/"
    },
    {
        "id": "1h2n6jj",
        "author": "herewego199209",
        "title": "The death of R rated comedies or even comedies in general that get wide releases never made sense to me. In the 2000s those comedies were made relatively cheaply, IE Superbad was made for 20 million and made well over $170 million. You'd think studios would love this.",
        "content": "I don't get why we don't have more rated R comedies or even romantic or sex comedies anymore. The one romantic comedy that they marketed really well recently and made a shit ton of money was Anyone but you and that movie was made for $25 and made $225 million. I don't get the excuse that comedies don't  make a lot of money overseas or that blu-rays don't sell anymore. ",
        "upvotes": 11660,
        "comments": 1894,
        "media": null,
        "permalink": "/r/movies/comments/1h2n6jj/the_death_of_r_rated_comedies_or_even_comedies_in/"
    },
    {
        "id": "1h32fqx",
        "author": "fungobat",
        "title": "The Professional - 30 Year Anniversary 4K Restoration - Official Trailer",
        "content": "",
        "upvotes": 828,
        "comments": 218,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vZkkjiDs9z03gYQ2AtphhwTAXSvkxJjub_lZS1desB8.jpg?auto=webp&amp;s=2a81674d42a9e932a498c76bd435cce7127ad597"
        },
        "permalink": "/r/movies/comments/1h32fqx/the_professional_30_year_anniversary_4k/"
    },
    {
        "id": "1h330ci",
        "author": "Bennett1984",
        "title": "Robert Downey Jr., Mickey Rourke, Demi Moore and the Great Hollywood Comeback Performances",
        "content": "",
        "upvotes": 708,
        "comments": 73,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/oOIjNJkceH1NAhXSkox7ROcsoFkUubMOXaglACGcva8.jpg?auto=webp&amp;s=4f955233d1c910bffa01f48ead81e8f8843f6281"
        },
        "permalink": "/r/movies/comments/1h330ci/robert_downey_jr_mickey_rourke_demi_moore_and_the/"
    },
    {
        "id": "1h2lv4j",
        "author": "onlyididntsayfudge",
        "title": "After rewatching Inception my opinion on the ending has now changed forever",
        "content": "I always believed that Leo was actually awake at the end. Nolan just showed us the spinning top as it was about to topple over before cutting to black and ending the movie. \n\nAfter rewatching the movie for who knows how many times I fully believe now that Leo is still dreaming. \n\n1. Nolan never showed us the top falling over which I understand was to keep the audiences guessing but…\n\n2. Every time Leo sees his kids in his mind in his dreams throughout the movie, they are wearing the exact same clothes. Which means he is remembering a memory of them. At the end of the movie when he comes back to his kids, they are wearing the same. fucking. clothes. And they haven’t aged at all. \n\nAnyway that’s where I’m leaning now - he’s still dreaming. \n\nEdit: I’m loving the discussions! After reading all your comments I appear to be wrong - Leo’s kids in the end were not wearing the exact same clothes. Check out the [Differences in clothing](https://images.app.goo.gl/EJ4dezvGqa6Uxgf8A) that I found by googling it. I seemed to have gotten ahead of myself on this one. \n\nI’ve also heard about the wedding ring being a totem, which I can totally agree with. \n\nI will say this - after reading the discussions, I started thinking about the wife died in the movie. She died by falling off a ledge. Gravity took her down. Gravity was also a big component/the kick to wake the team up at the end. So now I’m even more curious! Is Leo dreaming because he still has not experienced his gravity drop in “the real world.” Hmmm 🤔 ",
        "upvotes": 4634,
        "comments": 682,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mQ-PoKhA8Aer8be5I7KbShk4ZC3ftZtJCfP925zrNB0.jpg?auto=webp&amp;s=0054626cbbc684d5e96696a9ab15ce38dc239f6b"
        },
        "permalink": "/r/movies/comments/1h2lv4j/after_rewatching_inception_my_opinion_on_the/"
    },
    {
        "id": "1h2u90n",
        "author": "Scherzoh",
        "title": "Why are some directors put into \"movie jail\" when a movie bombs, but others are allowed to have multiple failures over the course of their careers?",
        "content": "Jonathan Frakes was placed into 'movie jail' following the failure of Clockstoppers. Meanwhile a filmmaker like Ridley Scott has a few movies that have failed to make money at the box office but is still allowed projects with massive budgets.\n\nThis is not a dig at Ridley specifically, I am simply curious.\n\nEdit: Yes, I know these are two wildly different directors, both in fame and talent.  Frakes was my example because he's the first person I heard use the term 'movie jail.' It could be any director who has had a failure, but also some success.",
        "upvotes": 1310,
        "comments": 447,
        "media": null,
        "permalink": "/r/movies/comments/1h2u90n/why_are_some_directors_put_into_movie_jail_when_a/"
    },
    {
        "id": "1h34ecp",
        "author": "keepfighting90",
        "title": "Rebel Ridge is a damn good thriller - reminiscent of a modern-day 'Rambo'",
        "content": "Just caught Jeremy Saulnier's newest flick, Rebel Ridge, on Netflix. I'm a big fan of his, and consider Blue Ruin and Green Room to be 2 of the best thrillers in the last 10-15 years. Hold the Dark was just ok but I was still excited to check this one, since I love the first Rambo and this seemed to be in the mold of that classic \"stoic badass strolls into small town and gets into it with corrupt lawmen\" narrative. \n\nThis is a much more restrained, and lower-key movie than the trailers make it seem. It's really more of a slow burn thriller as opposed to an action movie, and it does an amazing job of slowly building the suspense and elevating the stakes so that whenever the rare action scenes do pop up, they feel like they have impact and meaning. \n\nThe film is carried hard by Aaron Pierre, and his performance is honestly enough to justify watching it. I've never seen him in anything before but after this, I'm definitely going to be keeping an eye on any future projects (I know he's going to John Stewart in the Lanterns show, which I'm pretty hyped about). He has movie star levels of presence and charisma and most importantly, he is built like a fucking *tank* and completely sells the badass ex-Marine character who can kick anyone's ass around him. \n\nWhat I loved about how the movie approached the narrative is that Terry is constantly trying to defuse the situation. This isn't some Dwayne Johnson action blockbuster or John Wick power fantasy where the hero just demolishes everyone without any effort. Terry consciously goes out of his way to avoid violence - loved the little touches where he unloads guns in tense situations. It's just too bad that these fools keep asking for it, so when he has  no choice but to put a beatdown of these corrupt asshole cops, it's immensely satisfying. The action scenes are really well done, keeping the fight choreography grounded and realistic, showing how Terry uses his technique and size to quickly put guys down.\n\nThe story felt pretty timely too, dealing with asset forfeiture laws, and Don Johnson and Emory Cohen are both great as the primary antagonists. Nice supporting turns from AnnaSophia Robb and David Denman as well.\n\nThis is the kind of thriller I feel like we don't get much of anymore, one that feels refreshingly adult, grounded and keeping the stakes personal and intimate. Highly recommend.",
        "upvotes": 195,
        "comments": 47,
        "media": null,
        "permalink": "/r/movies/comments/1h34ecp/rebel_ridge_is_a_damn_good_thriller_reminiscent/"
    },
    {
        "id": "1h2w6kq",
        "author": "Ginger_Jesus",
        "title": "What made \"Napoleon Dynamite\" work and \"Gentlemen Broncos\" not?",
        "content": "They were written by the same people and has the same...style? I am not a very good critic, and while I do consider Napoleon Dynamite the better movie, I didn't hate Gentlemen Broncos, I was curious why one did so well and the other flopped so hard when they seem like similar movies with similar comedic beats. For what it's worth, my buddy and I quote Gentlemen Broncos much more then Napoleon Dynamite, at the very least it wasn't a forgettable movie, and there's value in that I think.",
        "upvotes": 512,
        "comments": 329,
        "media": null,
        "permalink": "/r/movies/comments/1h2w6kq/what_made_napoleon_dynamite_work_and_gentlemen/"
    },
    {
        "id": "1h2zedx",
        "author": "ThingsAreAfoot",
        "title": "Monologues where someone tells a full story.  ",
        "content": "I recently rewatched Gangs of New York and for all of DDL’s theatricality in various performances, he can be beautifully subtle: \n\nhttps://youtu.be/h8U3slXNy10\n\nThat’s the scene where he slowly describes to Leo’s character Amsterdam, basically, his life story. What he’s all about, how he’s managed to survive. \n\nAnother scene like that is the famous Jaws scene with Robert Shaw where he talks about his encounter with sharks as a WW2 soldier after his ship the USS Indianapolis was sunk in shark-infested waters: \n\nhttps://youtu.be/u9S41Kplsbs\n\nAnother one of the most famous is Marlon Brando in Apocalypse Now, relaying his visions and experiences of horror in war - the disturbing aftermath after he and his group inoculate a village - and using that to justify and rationalize his own brutality:\n\nhttps://youtu.be/mPPGMNOLaMw\n\nIn all of those cases the actors are so good you feel like they’re retelling a genuine memory, you can almost even see it in their eyes. \n\nWhat are some other similar ones? 4-5 minute (or however long) monologues where the actors and the writing are so good the scene just transfixes and transports you, and you can so easily visualize everything. ",
        "upvotes": 248,
        "comments": 198,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Ism9mKaoycI6v05uRx922lHPqVPzjYBMnsHUagYtXiA.jpg?auto=webp&amp;s=607b9b9f8ca0992d960071a6f7b6f773e6929f43"
        },
        "permalink": "/r/movies/comments/1h2zedx/monologues_where_someone_tells_a_full_story/"
    },
    {
        "id": "1h2ivu4",
        "author": "Sisiwakanamaru",
        "title": "'Prisoners:' The perfect Thanksgiving movie to turn into that panic spin",
        "content": "",
        "upvotes": 1920,
        "comments": 100,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gjiNjaTDrveQ5LdaFGUr627QVljnq5Kxik2yTH4amVI.jpg?auto=webp&amp;s=ad7f7bb3434da6b3406c249a85e668450946ae40"
        },
        "permalink": "/r/movies/comments/1h2ivu4/prisoners_the_perfect_thanksgiving_movie_to_turn/"
    },
    {
        "id": "1h2ww9d",
        "author": "Plenty-Spell-3404",
        "title": "Be sure to see Misery if you haven't seen it yet.",
        "content": "**PLOT:** Annie Wilkes (Kathy Bates), Sheldon’s number one fan, rescues the author from the scene of a car accident. The former nurse takes care of him in her remote house, but becomes irate when she discovers that the author has killed Misery off in his latest book. Annie keeps Sheldon prisoner while forcing him to write a book that brings Misery back to life.\n\n**REVIEW:** It's simply brilliant! One of the finest psychological horror films I have ever seen, very much in the league of classics like Psycho and The Shining. Kathy Bates is simply awesome! Must must watch if you are a psychological thriller fan.",
        "upvotes": 226,
        "comments": 68,
        "media": null,
        "permalink": "/r/movies/comments/1h2ww9d/be_sure_to_see_misery_if_you_havent_seen_it_yet/"
    },
    {
        "id": "1h2sxjf",
        "author": "MiserableSnow",
        "title": "Lupin The IIIrd The Movie | Special Teaser Trailer",
        "content": "",
        "upvotes": 367,
        "comments": 51,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MbVHwCEL0GKy6xIXvUnJieB0kOjbCoWtDthflcNs5Mo.jpg?auto=webp&amp;s=5a3d06f0a0db97230b7bf3b8dd4899c341699a4d"
        },
        "permalink": "/r/movies/comments/1h2sxjf/lupin_the_iiird_the_movie_special_teaser_trailer/"
    },
    {
        "id": "1h2yblt",
        "author": "KillerCroc1234567",
        "title": "Adam Somner, Oscar-Nominated Assistant Director and Producer, Dies at 57",
        "content": "",
        "upvotes": 155,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qzimZKn7fZI1jC6ZtwovwN3cjcC3CXiwoe67o4fVrvM.jpg?auto=webp&amp;s=2487536c50786948e7ea6af729e613844bf32953"
        },
        "permalink": "/r/movies/comments/1h2yblt/adam_somner_oscarnominated_assistant_director_and/"
    },
    {
        "id": "1h32ppc",
        "author": "MakeItSo978",
        "title": "What’s one film you still can’t decide if it’s good or not? ",
        "content": "For me it’s Watchmen, I’ve watched this movie like 10 times. Every time I watch it my opinion changes on it. I just watched it tonight, and I think it’s not very good. There is a lot of things I like about it you could even say love. But I just notice something new that bothers me. Just curious about your opinion? ",
        "upvotes": 78,
        "comments": 305,
        "media": null,
        "permalink": "/r/movies/comments/1h32ppc/whats_one_film_you_still_cant_decide_if_its_good/"
    },
    {
        "id": "1h2qg7w",
        "author": "OutlandishnessNice82",
        "title": "Brave Movie 2025",
        "content": "Hi all, I wanted to share a project with you that I’m deeply involved in and very proud of! The article just dropped today and shooting starts next summer. ‘Brave’ will be the first feature film shot on Choctaw nation land and the tribe are deeply involved with the production. Cannot wait to be able to help bring this fantastic story to the screen 😊 \n\nhttps://www.hollywoodreporter.com/movies/movie-features/brave-choctaw-nation-film-amber-midthunder-dallas-goldtooth-1236071582/",
        "upvotes": 199,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WFaPbcJxgnP9fPJ9jVycCHAEhi0OZYZWPakAk5Qq14k.jpg?auto=webp&amp;s=8ca2916a71a48947db02e9156d7f93812b549c82"
        },
        "permalink": "/r/movies/comments/1h2qg7w/brave_movie_2025/"
    },
    {
        "id": "1h2zqer",
        "author": "NoCulture3505",
        "title": "‘The Last Showgirl’: Read The Screenplay That Pamela Anderson Waited Her Entire Career For",
        "content": "",
        "upvotes": 47,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qFF9RxY568Jtm9XQ8nVgTWRBdtgo3XcTqoq8myeA08M.jpg?auto=webp&amp;s=65386fca02afb3f3eadea118134f4286c2995a9d"
        },
        "permalink": "/r/movies/comments/1h2zqer/the_last_showgirl_read_the_screenplay_that_pamela/"
    },
    {
        "id": "1h3158q",
        "author": "BunyipPouch",
        "title": "New Poster for Absurdist-Comedy 'Universal Language' - Canada's Official Oscar Submission - Received Critical Acclaim at Cannes &amp; TIFF - Two women find frozen cash, try to retrieve it. A tour guide leads tourists around Winnipeg sites. A man quits his job and visits his mother.",
        "content": "",
        "upvotes": 41,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/s2zzcw42xx3e1.jpeg?auto=webp&amp;s=a0037178d71a13ecae18490f99d901bc9d5b2f10"
        },
        "permalink": "/r/movies/comments/1h3158q/new_poster_for_absurdistcomedy_universal_language/"
    },
    {
        "id": "1h2mzxh",
        "author": "noshoes77",
        "title": "My Neighbor Totoro screenings have started! ",
        "content": "If you’re like me and have never seen it on the big screen, here is your chance! ",
        "upvotes": 240,
        "comments": 25,
        "media": null,
        "permalink": "/r/movies/comments/1h2mzxh/my_neighbor_totoro_screenings_have_started/"
    },
    {
        "id": "1h2r1cn",
        "author": "airpipeline",
        "title": "What great classic films should definitely never have a sequel?",
        "content": "\nWhich classic films would genuinely NOT benefit from a sequel, and WHY?   (Unless it’s obvious to all, might you tell us WHY you offer your answer?) \n\nThese days, many (almost all) movies are made with a sequel or trilogy in mind. Even if the story ends with the destruction of the galaxy, there’s always room for that follow-up (and the potential for additional ca$h). \n\nIn the past, movies were not created with this mindset.  Which movies are notably Not sequel ready?  In other words and in a roundabout way, how have sequels affected the quality of the movies being made today?\n\nIn my thinking, _Groundhog Day_ is a good example.  The story is completely wrapped up by the end.  No sequel necessary or wanted.  ",
        "upvotes": 111,
        "comments": 499,
        "media": null,
        "permalink": "/r/movies/comments/1h2r1cn/what_great_classic_films_should_definitely_never/"
    },
    {
        "id": "1h2ytgb",
        "author": "New-Length-8099",
        "title": "Go Your Own Way: Billy Wilder and the Fine Art of Independent Cinema",
        "content": "",
        "upvotes": 28,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/O2iHpRJb9kSKyptEzV4Dlv3-lpmiz1ETqO2zGpDQZYA.jpg?auto=webp&amp;s=165321558c6f8cf9ec83c62e2d7d1c728ec071d3"
        },
        "permalink": "/r/movies/comments/1h2ytgb/go_your_own_way_billy_wilder_and_the_fine_art_of/"
    },
    {
        "id": "1h2zlnz",
        "author": "Purple-Acanthisitta8",
        "title": "The Strangers Chapter 1 did something incredible.",
        "content": "This movie is so bad that in the middle of movie I’m making this post, I don’t care who gets killed or who doesn’t, the acting is atrocious and that couple chemistry is pointless and blend. Nothing and no quality to redeem this movie but yet it’s a massive success when it comes down to box office.\n\nOn a budget of almost 9 million it made close to 48 million, let’s say advertising costed them another 9 million so let’s just say total production and cost for advertisers and miscellaneous stuff costed this movie $20 million. Still they made 28 million profit and we not including 4K blu ray sales.\n\nI don’t know how they did it but good for them.",
        "upvotes": 26,
        "comments": 23,
        "media": null,
        "permalink": "/r/movies/comments/1h2zlnz/the_strangers_chapter_1_did_something_incredible/"
    },
    {
        "id": "1h2ibnh",
        "author": "Chubbynuts",
        "title": "Movie about White Death - Simo Häyhä, the finnish sniper who shot over 500 russian soldiers at Winter War, is in the makings",
        "content": "[translated from Yle news:](https://yle.fi/a/74-20127817)\n\nThe story of the most famous sniper of the Winter War has never before been brought to the silver screen.\n\nThe Russians gave Häyhä the name \"White Death\" — and for good reason.\n\nAccording to his personal notebook, Häyhä killed 542 Russian soldiers during the 98 days of the Winter War. This is more than any other sniper in the world has achieved in such a short time.\n\nThe movie is set during the winter of 1939-1940 on the Kollaa front, where a small group of Finns stood to stop an overwhelmingly superior enemy from invading Finland.\n\nHäyhä was seriously wounded in the battles at Kollaa just a week before the end of the Winter War. He awoke from a coma on the day the war ended.\n\nDue to his injuries, Häyhä was unable to take part in the Continuation War, though he would have wanted to.\n\nSimo Häyhä was born in 1905 in Rautjärvi, Karelia, and passed away as a respected war hero in a veterans' care home in Hamina in 2002.\n\nThe film's consultant is Major (ret.) Tapio Saarelainen, who has authored several books about Häyhä.\n\n[more news details](https://www.screendaily.com/news/finnish-film-h%C3%A4yh%C3%A4-about-the-white-death-sniper-in-the-works-exclusive/5199577.article)",
        "upvotes": 313,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jFr-ngnudUlXgAs0DVl2nq-_ca7f-BFQHwho6Kl6CK4.jpg?auto=webp&amp;s=6f46283d8d508b3f87517ce65151b01cab656759"
        },
        "permalink": "/r/movies/comments/1h2ibnh/movie_about_white_death_simo_häyhä_the_finnish/"
    },
    {
        "id": "1h2meap",
        "author": "KillerCroc1234567",
        "title": "Focus Features Nabs Noomi Rapace’s Sci-Fi Thriller ‘Hot Spot’",
        "content": "",
        "upvotes": 109,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Mspb81sdpAABSPkiAb2S92P2TzQfc6gID55BEY62y7A.jpg?auto=webp&amp;s=3f9af35389f21ec20e4d654b907fd4dcd0963c20"
        },
        "permalink": "/r/movies/comments/1h2meap/focus_features_nabs_noomi_rapaces_scifi_thriller/"
    },
    {
        "id": "1h2d2b1",
        "author": "80severything",
        "title": "Transformers The Movie 1986",
        "content": "This is one of the most insane films aimed at kids ever produced, the daytime cartoon version has lots of action and stuff blowing up but mostly characters come out largely unscathed but not in this big budget animated adaptation.  It basically begins with an all out assault on the autobots and crazy levels of violence and destruction it's like an animated version of the storming of the beach of Normandy from Saving Private Ryan, kids all over the United States were stunned as they watched their favorite characters autobots and decepticons alike are gunned down violently and we watch Optimus Prime himself mow down several decepticon's himself in truck form and the action never really lets up to much.  There hasn't been a Transformers movie that was as awesome as this one is.  ",
        "upvotes": 639,
        "comments": 313,
        "media": null,
        "permalink": "/r/movies/comments/1h2d2b1/transformers_the_movie_1986/"
    },
    {
        "id": "1h1whvh",
        "author": "theozarksparkman",
        "title": "Forget actual run time. What's the \"longest\" movie ever?",
        "content": "Last night me and my wife tried to watch The Curious Case of Benjamin Button (we didn't finish it so even tho its been out forever please dont spoil if you can). \n\nThirty min in felt like we were halfway through. We thought we were getting near the end.... nope, hour and a half left.\n\nWe liked the movie mostly. Well made, well acted, but I swear to god it felt like the run time of Titanic and Lord of the Rings in the same movie.\n\nWe're gonna finish it today.\n\nIgnoring run time, what's the \"longest\" movie of all time?\n\nEDIT: I just finished the movie. It was..... pretty good.",
        "upvotes": 9231,
        "comments": 6883,
        "media": null,
        "permalink": "/r/movies/comments/1h1whvh/forget_actual_run_time_whats_the_longest_movie/"
    },
    {
        "id": "1h24bh9",
        "author": "luchablay",
        "title": "I watched 365 movies this year, and here is what I learned. ",
        "content": "I decided back in January that I wanted to try to stop doom scrolling. And instead of scrolling for 2 hours I would watch a movie instead. Over the course of the month I decided to try to watch the equivalent of one movie a day all year. Well, I finished early and I learned 3 things. \n\n1: People are in entirely too many movies.  I know actors gotta eat, but man, I saw so much cross over from actors in the last 10 years. It got so bad that I started recognizing people who weren’t even IN other movies. \n\n2: You can really tell when a movie has a budget. Watching primary low-mid budget horror movies, you can really tell the difference when a movie has a bit of money to make everything look good. \n\n3: If your movie isn’t 2 hours then it only needs to be an hour and a half. None of this 1:45 nonsense. Either pad it out to 2 hours or ideally, cut it down to a buck thirty.  Especially (not Sexually! lol)  if you are making a horror movie. \n\nCouple of facts: \n\nFirst movie I watched: Cube 2: hypercube\n\nLast movie: Planes trains and automobiles. \n\nBest movie: American Fiction \n\nWorst Movie: The Creeps.  \n\nMovies I watched that I had seen before: 16\n\nMost movies watched in a single day: 5\n\n\nIt’s been a long year and I’ve enjoyed having something else to focus on.  Hope this finds you well, and watch more movies. \n\nEdit: sexually lol \n\nAs requested Top 10: \n\n1: American Fiction\n\n2: biosphere \n\n3: They Cloned Tyrone \n\n4: 1917\n\n5: Maxxxine \n\n6: the Blackening\n\n7: the vast of night \n\n8: The green knight \n\n9: bottoms \n\n10: Shadow in the cloud (seriously I dare you not to love this)\n\n\nEdit 2: people have a lot of opinions about movies, yet it seems mine are the only ones that are invalid? \n\nThere are a ton of other things I learned from watching so many movies in such a short time. I, however, typically like to enjoy things more than shit on them (I.e. the beautiful madness that is Shadow in the Clouds). \n\nSo allow me to clarify what in reverse:\n\n3: In regards to run time, yes I agree, a story is as long as it needs to be, but streaming places like Netflix don’t usually care,  because they want a longer movie that keeps you watching. This can kill whatever story they were trying to tell. This is less a problem with Older movies, and more a modern issue and issue with a lot of horror movies (which is 80% what I watched).  It was my way of saying that movies could be tightened up to be more impactful and memorable.  For the “movies should be as long as they need to tell the story” people, we all know if movies needed to be as long as they need to be then there wouldn’t be a need for an editor nor “directors cuts.” Some stories don’t need the time and some stories need more. \n\n2: of course movies have different budgets, I am saying it is VERY noticeable when you go back to back and see a difference. It is amazing what people can do on a smaller budget to make it look good and how a larger budget production can blow the money and you don’t ever really see it on the screen.  \n\n1: so many faces end up looking the same. Admittedly I come from an era where there were big names in the theaters and someone being in a movie meant something. Not something GOOD necessarily but something.  With this last year, I would see movies with an actor in it and still not know what sort of movie it is. You see “Justin Long” is in a horror movie and you know you are basically in for a good time. You see someone like Gerald Farlong in a movie and you just wanna know if you should know him from something (you shouldn’t. I made him up).  I do like that Square jaw man from the Hit Man tho. \n\nIf I learned anything real, it’s that I love movies, and even if a movie is bad, as long as it’s fun, then it didn’t waste my time. \n\nGlad you all love American fiction and vast of night.  \n\nGlad you all hate American fiction and the green knight. \n\nI’m gonna go watch “It’s a wonderful knife” now. \n\n\n\n",
        "upvotes": 2475,
        "comments": 547,
        "media": null,
        "permalink": "/r/movies/comments/1h24bh9/i_watched_365_movies_this_year_and_here_is_what_i/"
    },
    {
        "id": "1h2cd4r",
        "author": "tacoreddit",
        "title": "Mexican Cinema Icon Silvia Pianl passes away at 93",
        "content": "",
        "upvotes": 641,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6r4-eyrjSnpchEdVv9h3mYLIRHy4BIYHV5eWvhY2Pt8.jpg?auto=webp&amp;s=90d11880adf78e3510e610260749e72b45042273"
        },
        "permalink": "/r/movies/comments/1h2cd4r/mexican_cinema_icon_silvia_pianl_passes_away_at_93/"
    },
    {
        "id": "1h2qz8b",
        "author": "Impossible_Werewolf8",
        "title": "Favorite movie by european country: Portugal",
        "content": "Hello there,\n\nyesterday, I've asked you for your favorite movie set in Poland - and I really would like to thank all the participants: We got around 50 comments and almost as many movie suggestions. Especially with this in mind, the final result is very close: ***Krótki film o zabijaniu*** (engl.: *A Short Film About Killing*) has won the race with just 12 upvotes (minus the given downvotes).\n\nToday, I'm asking you for your favorite movie set in Portugal. As always, the winner  will soon take its place in [our official letterboxd list](https://letterboxd.com/lalunallena/list/reddits-favourite-movie-by-european-country/share/N58XneSCnjHwwiJw/detail/). And as always, there are only two rules:\n\n* It's about where the movie is set plot-wise and not about where the movie was filmed. In case of historical movies, it's important that the bigger part of the movie takes place in a geogprahical territory, that is part of the given country today. Sometimes, especially when it's really hard to find any movie, it is also fine if only a certain part of the film is set in the respective country - but it has to be a large part.\n* Winner movie is the movie with the most upvotes (minus the given downvotes) after 24 hours. Therefore, it's important that you only mention one movie per comment and that you check up if you're movie was mentioned in an earlier comment before you suggest it.\n\nI'm really looking forward to your film suggestions!\n\n&gt;Day 36: Poland - Krótki film o zabijaniu (engl.: A Short Film About Killing)\n\n&gt;Day 35: Norway - Flåklypa Grand Prix (engl.: Pinchcliffe Grand Prix)\n\n&gt;Day 34: North Macedonia - Нема да бидеш сама (engl.: You Won’t Be Alone)\n\n&gt;Day 33: Netherlands - Zwartboek (engl.: Black Book)\n\n&gt;Day 32: Montenegro - Igla Ispod Praga (engl.: The Black Pin)\n\n&gt;Day 31: Monaco - La fille de Monaco (engl.: The Girl from Monaco)\n\n&gt;Day 30: Moldova - Carbon\n\n&gt;Day 29: Malta - Luzzu\n\n&gt;Day 28: Luxembourg - Läif a Séil (engl.: The Last Ashes)\n\n&gt;Day 27: Lithuania -Vaikai iš Amerikos viešbučio (engl.: The Children from the Hotel America)\n\n&gt;Day 26: Liechtenstein - Kinder der Berge\n\n&gt;Day 25: Latvia - Kriminālās ekselences fonds (engl.: The Foundation of Criminal Excellence)\n\n&gt;Day 24: Kosovo - Zgjoi (engl.: Hive)\n\n&gt;Day 23: Italy - Nuovo Cinema Paradiso (engl.: Cinema Paradiso)\n\n&gt;Day 22: Ireland - The Wind That Shakes the Barley\n\n&gt;Day 21: Iceland - Englar Alheimsins (engl.: Angels of the Universe)\n\n&gt;Day 20: Hungary - Sátántangó\n\n&gt;Day 19: Greece - Κυνόδοντας (engl.: Dogtooth)\n\n&gt;Day 18: Germany - Das Leben der Anderen (engl.: The Lives of Others)\n\n&gt;Day 17: Georgia - ცისფერი მთები ანუ დაუჯერებელი ამბავი (engl.: Blue Mountains)\n\n&gt;Day 16: France - La Haine\n\n&gt;Day 15: Finland - Mies vailla menneisyyttä (engl.: The Man Without a Past)\n\n&gt;Day 14: Estonia - Vehkleja (engl.: The Fencer)\n\n&gt;Day 13: Denmark - Jagten (engl.: The Hunt)\n\n&gt;Day 12: Czechia - Spalovač mrtvol (engl.: The Cremator)\n\n&gt;Day 11: Cyprus - Smuggling Hendrix\n\n&gt;Day 10: Croatia - Kako je počeo rat na mome otoku (engl.: How the War Started on My Island)\n\n&gt;Day 9: Bulgaria - Източни пиесиИзточни пиеси (engl.: Eastern Plays)\n\n&gt;Day 8: Bosnia and Herzegovina - Ničija zemlja (engl.: No Man's Land)\n\n&gt;Day 7: Belgium - In Bruges\n\n&gt;Day 6: Belarus - Иди и смотри (engl.: Come and See)\n\n&gt;Day 5: Azerbaijan - Yuxu (engl.: The Dream)\n\n&gt;Day 4: Austria - Funny Games\n\n&gt;Day 3: Armenia - Նռան գույնը (engl.: The Color of Pomegranates)\n\n&gt;Day 2: Andorra - El fred que crema (engl.: The Burning Cold)\n\n&gt;Day 1: Albania - Lulekuqët mbi Mure (engl.: Red Poppies on Walls)5",
        "upvotes": 43,
        "comments": 62,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jDGM4vmL8dGUfU2QeTEP1GJiB20Upc7gie089IBWF2w.jpg?auto=webp&amp;s=4d8dec2293dd383684c787452f1c2ac30560ac75"
        },
        "permalink": "/r/movies/comments/1h2qz8b/favorite_movie_by_european_country_portugal/"
    },
    {
        "id": "1h2tcvi",
        "author": "Vista____",
        "title": "The Night Before 2015",
        "content": "This is the perfect Christmas movie for adults. \n\nDoesn’t take the crude humour too far while maintaining a wholesome message the whole runtime. The main trios chemistry rocks. Also adding a few hilarious side characters. It’s the ideal watch with a couple of friends over the holidays, highly recommend. ",
        "upvotes": 28,
        "comments": 8,
        "media": null,
        "permalink": "/r/movies/comments/1h2tcvi/the_night_before_2015/"
    },
    {
        "id": "1h2ukld",
        "author": "Ok-Speed-8182",
        "title": "Ransom (1996) and a shout out to Delroy Lindo",
        "content": "Just saw Ransom for the first time in 20 years or so and this feels like a bit of forgotten movie. What's Reddit's opinion on this one? It's not a perfect movie, I think it's just a tiny bit too long in the build up to the switch perhaps, but overall I think it's a good movie that's elevated by the performances. There's are a few scenes in this that really work well in my opinion, especially the back and forth between Mel and Sinise where they're yelling at eachother. Great stuff. Sinise is a good villain as well. He's not cliché. Seeing these old Mel Gibson movies you really understand he was a star back then. Dude just has the x factor in that regard. Regardless of the controversial behavior outside of his films. The man was a moviestar.\n\nSmall shout out to Delroy Lindo as well. For a while in the 90s he seemed to be everywhere and he's one of those guys like a Brian Cox for example that just makes your movie better/more interesting when he's in it. Great onscreen presence. \n\nWhat did Reddit think of this movie?",
        "upvotes": 21,
        "comments": 26,
        "media": null,
        "permalink": "/r/movies/comments/1h2ukld/ransom_1996_and_a_shout_out_to_delroy_lindo/"
    },
    {
        "id": "1h23iiw",
        "author": "ILikeNeurons",
        "title": "Denzel Washington at 70: his 20 greatest films – ranked! ",
        "content": "",
        "upvotes": 1955,
        "comments": 448,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qfhDBnMdBaneBNnBTyesfmz36DH-SgQQfTo2zrFgxeQ.jpg?auto=webp&amp;s=93d3622618afe13a82a2e351fc243a035de3d4d4"
        },
        "permalink": "/r/movies/comments/1h23iiw/denzel_washington_at_70_his_20_greatest_films/"
    }
]