[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 488,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1hu51ps",
        "author": "ineedsometacos",
        "title": "Use \"Viewing Restrictions\" to ban specific titles from recommendations ",
        "content": "Unfortunately this doesn't work for broader categories of content, like blocking whole genres, but it does work for specific titles you don't want to appear as recommended content for you.\n\nhttps://preview.redd.it/byz0x43vt5be1.png?width=1540&amp;format=png&amp;auto=webp&amp;s=381c2ab50ebde40b1e5249a934d59f308800bf01\n\nhttps://preview.redd.it/3s1fpvhzt5be1.png?width=1420&amp;format=png&amp;auto=webp&amp;s=5020529065c8f5852bf03ac66afa59659ca7c410\n\n",
        "upvotes": 13,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hu51ps/use_viewing_restrictions_to_ban_specific_titles/"
    },
    {
        "id": "1hu9311",
        "author": "Anonythrowthetrash",
        "title": "Should I Worry about “New Sign In” from Netflix email",
        "content": "I was worried when I got an legit email from Netflix saying there was a new sign in on iPhone Safari - Mobile Browser from Michigan. This was a few days ago. Then I try to go into my account settings on my app, which does bring me into a browser submenu, then I got the same email but from Texas. I did this the same thing and still got the same email. I think it thinks going into the account settings is a new sign in.\n\nWhat I did notice is that time was from Michigan but this time was Texas. Is this anything I should be worried about?",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1hu9311/should_i_worry_about_new_sign_in_from_netflix/"
    },
    {
        "id": "1htd9hj",
        "author": "Whobitmyname",
        "title": "‘Wallace &amp; Gromit: Vengeance Most Fowl’ Has Become The Most Watched Film Broadcast On English TV With 16.2M Viewers",
        "content": "",
        "upvotes": 149,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1htd9hj/wallace_gromit_vengeance_most_fowl_has_become_the/"
    },
    {
        "id": "1hu9aq2",
        "author": "BreadfruitNo9500",
        "title": "Hannibal not appearing",
        "content": "I saw that it was on Netflix two weeks ago and I was thought I was gonna watch it after I got back from somewhere but now it appears it’s not there anymore and yet all sources tell me it’s still on Netflix in America. Anyone know why it’s not appearing",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hu9aq2/hannibal_not_appearing/"
    },
    {
        "id": "1hu8400",
        "author": "OptimusShredder",
        "title": "Finally got the subtitles right with Squid Game 2",
        "content": "There is a lot of great international content on Netflix but as a guy who has played too many concerts and been to too many, my hearing isn’t the best, so I enjoy watching shows with the captions on.  Most of the time though the subtitles aren’t even the same words that are being spoken.  Just wanted to come here and say that the words are spot on with Squid Games 2.  Finally Netflix, thank you. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hu8400/finally_got_the_subtitles_right_with_squid_game_2/"
    },
    {
        "id": "1hu70vj",
        "author": "Original-Ease-9139",
        "title": "Some titles not displaying or displaying broken video",
        "content": "So, I have been a recurring customer for a while.  I've never had an issue with Netflix until this past week. \n\nWhen they added the new lineup, which has the tobery Mcguire version of Spiderman among several other movies and shows, Netflix decided to break itself. \n\nSeveral movies and shows simply do not display video. Or it's video displayed like the broken channels on not-so-legal cable boxes back in the day, you know, rainbow lines, video \"noise\" but not much else. It doesn't happen on every movie or show, but enough of them that it's an annoyance. \n\nAnyone had this happen? Or any suggestions on how to fix it? Netflix is on the Xbox, I've already deleted and reinstalled, I've changed hdmi cable and port, nothing fixes it. Is Netflix just bonked? Seriously considering unsubscribing and going to a different service. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hu70vj/some_titles_not_displaying_or_displaying_broken/"
    },
    {
        "id": "1htyod9",
        "author": "MiserablePiano5211",
        "title": "Device not a part of the household issue",
        "content": "My parents have a Netflix account that they have upgraded to a larger family plan. I live in the same house with them and have my own profile on my phone and PS5 however Netflix will randomly lockout my profile on both these devices but works on the main computer my parents watch on and the only way to fix it is get a code sent to my dad, but the weird thing is it clearly states on their account that both my devices are apart of the household but they only work once he opens the link and goes through it. Any ideas?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1htyod9/device_not_a_part_of_the_household_issue/"
    },
    {
        "id": "1httsr2",
        "author": "dakky21",
        "title": "Audio stutters in App on Windows 11 in full-screen",
        "content": "Got a super weird problem on Windows 11 HTPC: when watching Netflix through the app and using \"Dolby Atmos for home theater\" as spatial sound in sound settings, everything works great, sound is great, Denon AVR says input is \"Atmos\", everything is fine to the moment I put the app in full screen. \n\nWhen Netflix app is in full-screen, the audio starts to mute itself and pause, while the video plays normally. The moment I exit fullscreen mode and leave Netflix app maximized, audio starts to works normally. It makes no sense that a change into fullscreen makes audio go silent every few seconds.\n\nAny ideas?",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1httsr2/audio_stutters_in_app_on_windows_11_in_fullscreen/"
    },
    {
        "id": "1htpaw1",
        "author": "Eaglestark98",
        "title": "Interview with the vampire was surprisingly really well done.",
        "content": "Just going to say this was really well done with really good actors.  I was pleasantly surprised!  I enjoyed the back and forth between the vampire focusing on the telling of the story and the interviewer trying cut out the embellishments and go for the stuff he’s leaving out.  In a way it feels like, yes the vampire wants to look good in his story, but also cares more about HOW it sounds something pretty important for stories that last the rest of time.  Whereas the interviewer focusing on hard hitting facts that are cut and dry is something often focused on tonight news.  Something not know for its longevity.  Like each one wants a story but its style of storytelling reflects their age relatively.  I’m used to Netflix being some quick on and done stuff and it’s nice to see something with a little more art and vision.  Like comparing an album to a mixtape.  Can’t wait for part 2",
        "upvotes": 15,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1htpaw1/interview_with_the_vampire_was_surprisingly/"
    },
    {
        "id": "1htz8s5",
        "author": "hectorb3",
        "title": "In The Dark",
        "content": "Tonight, I wanted to try something different from my normal genres of Fantasy, Action/Adventure, and Sci-Fi, so I saw \"In The Dark\" and gave it a try. Now I'm hooked. I binged 7 episodes. The story line is unique. The actors make it all so believable. They really sell it. ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1htz8s5/in_the_dark/"
    },
    {
        "id": "1htni42",
        "author": "laeiryn",
        "title": "Removing unwanted shows/films/rows: is there a way to block Games or WWE at all? [ALL][USA]",
        "content": "There's entire rows of this stuff in the way of desired content now, and **no easily visible way to mark it as \"do not recommend\" or anything.**\n\n*Why* there's sketchy mobile games now being advertised through Netflix is a different problem; I just need to know how to mechanically remove it/reject these recommendations/block games from being accessible via our subscription. \n\nFor the Karens who care: The *very first* game advertised is called 'Too Hot to Handle' and it's pretty clearly meant to be sexually titillating; our kids are older teens so they're not limited to 'child' Netflix, but games like this don't really need to be the very first thing they see when opening the app. \n\n#More importantly, it's in the way of desired content.  Is there any way to remove or block certain categories from showing up? Especially 'games'. \n\nThere's also a whole row of live-streaming wrestling matches that can't be thumbs-downed to dissuade the app from trying to suggest similar content. \n\n(Some of the games advertised also have in-app purchases - !!! - and there's no way to block those from going through on the card on record for payment)\n\nThe wrestling content is at least still tv programming; it's just a genre I'd like be to be able to de-prioritize (it should not be at the top, above my list, above continue watching, nor above the category I actually clicked on). \n\nThe games are a cash grab that don't belong, but I know better than to think Netflix will get rid of anything that scrapes them a bit of profit, so I just need to know how to never see 'games' again via my own paid subscription. Especially not as one of the first rows, before I get to the content that I have actively engaged with. \n\n(and of course it's just crap mobile games expy'd, it's not even like we're being offered to demo Echo the Dolphin )\n\nI'm in the USA getting the games spam via Region 1 but I ASSUME they're hawking this to everyone so I also labeled it 'all'.",
        "upvotes": 10,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1htni42/removing_unwanted_showsfilmsrows_is_there_a_way/"
    },
    {
        "id": "1hu13x6",
        "author": "Adventurous-Sport-45",
        "title": "Netflix just casually is missing the last episode of AARO? ",
        "content": "Netflix was releasing episodes of the series 全領域異常解決室 (AARO in English) on a weekly basis, more or less around the same time as their availability in Japan. However, the last episode of the first season, which came out on December 18, is inexplicably missing. \n\nOf course, the episode is still available on a channel on the Japanese version of Prime Video, as well as some other sources, but it's strange that it is missing from Netflix. \n\nHas anyone seen this happen with any other shows? Is this a glitch in Netflix's automation, or is there a reason behind it? \n\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hu13x6/netflix_just_casually_is_missing_the_last_episode/"
    },
    {
        "id": "1htto99",
        "author": "Mikethederp",
        "title": "Dexter?",
        "content": "Sooo my wife and I have been watching Dexter lately everyday on Netflix, but we just opened the app to continue tonight's episode and it's gone?\nI don't recall seeing any notice about it being removed from rotation soon... are we SoL?\n",
        "upvotes": 2,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1htto99/dexter/"
    },
    {
        "id": "1htl2ck",
        "author": "MechanicalKiller",
        "title": "Squid Game Season 2 Score Appreciation",
        "content": "After finishing the season (twice now) I went to go listen to the score, specifically the one from the mingle game. Its called \"Round the Circle V\" and its amazing. \n\nJung Jaeil does an amazing job at creating such tension and edge of seat moments through his score. Vocal sounds, a back and forward synth, with those distorted drums. Its amazing.\n\nCant wait to hear more in season 3.",
        "upvotes": 10,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1htl2ck/squid_game_season_2_score_appreciation/"
    },
    {
        "id": "1hta7wf",
        "author": "S4v1r1enCh0r4k",
        "title": " R.L. Stine confirms the writers are currently working on three more Fear Street movies ",
        "content": "",
        "upvotes": 40,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hta7wf/rl_stine_confirms_the_writers_are_currently/"
    },
    {
        "id": "1hu9plt",
        "author": "Key_Hovercraft5197",
        "title": "Netflix needs to tighten up the plot holes in Squid Game (spoilers)",
        "content": "Just finished up Squid Game season 2, and I really loved how they tried to make the season different from last season with the inclusion of the past winner who wanted to shut down the games BUT..........\n\nWhy is there so many veterans amongst the latest contestants? We got three former Marines and one former Special Forces soldier. Are soldiers in Korea more likely than other professions to go into debt or financial crisis? Is that why so many of them joined Russia to fight Ukrainians?\n\nAnd where did all the rebellious contestants learn to shoot guns or learn how to fight? Last I checked, gun ownership is illegal in South Kore? Yet they asked specifically for people who know how to shoot and I was surprised they got a number of extras and that artist to volunteer.\n\nLOL the only ones who have any military training besides the named veterans, are probably the pink soldiers, but they were getting shot left and right from a bunch of civilians and a portrait artist. It doesn't speak well about the quality of the Korean army training that a group of mostly untrained civilians and a fucking portrait artist were slaughtering them. But historically it makes sense since the Korean army is said to be poorly trained which is why they needed US help, and right now the Ukrainians are beating them up too today. It's weird it is like watching the Viet Cong beat a professional military all over again.\n\n  \nWhich also means that it doesn't bode well for Gi-hun's hired guns once they find the island. I think Gi-hun's hired guns are all ex-Korean military? Be looking at the poor performance of the pink soldiers, the hired guns won't do well either in the future rescue mission. He should have hired well-trained soldiers from the US or NATO, or soldiers from countries who defeated the US in the past like Vietnam (I have mad respect for the Viet Cong and the Vietnamese, they are great fighters who fear nobody), or Ukrainian mercs who have experienced slaughtering the Korean military in Russia.",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hu9plt/netflix_needs_to_tighten_up_the_plot_holes_in/"
    },
    {
        "id": "1hu2g2x",
        "author": "Grumpy_001",
        "title": "Stranger things ",
        "content": "Dear Netflix, \n\nI’m always excited by the line up that you bring, especially the documentaries!\n\nBut FFS, can you please help hurry along the finale to stranger things?!?!? We’ve waited long enough! The kids are getting old. We’re getting old…..I’d love to see the end before age catches up with my sight and hearing 🤦‍♀️ \n\nYours sincerely, \n\nA Fan (that’s quickly losing hope) ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hu2g2x/stranger_things/"
    },
    {
        "id": "1htj2mw",
        "author": "MaverickWithANeedle",
        "title": "Issues w Netflix App on Fire Tablet",
        "content": "Anyone else having this issue? Have emptied storage, and cache, checked app is up to date, and restarted device. Have tried checking search engines for answers- but can’t find much. When I type “Netflix down?” Into search bar, I get the buffering issues for the Paul V Tyson fight. It’s (Netflix) working fine on my FireStick plugin for my TV, but on my fire tablet, the app pretends to open, then crashes and takes me back to the home screen. Can’t even access downloaded content right now. ",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1htj2mw/issues_w_netflix_app_on_fire_tablet/"
    },
    {
        "id": "1hu6jar",
        "author": "poutyinu",
        "title": "an absolute miserable first impression",
        "content": "~~as WWE RAW is coming to netflix, for the first time, ive decided to use netflix.. and its making me regret every penny ive paid to do so~~\n\n~~(all of this happened while using netflix via my computer on a chromium browser)~~\n\n~~upon first getting my account up and going and getting on the site, then fiddling with the profile picture, i immediately began having problems with the tabs to find shows. they couldnt find anything. the home page still worked so i looked there, saw a show (dragonball daima) and clicked it. it gave me an error and signed me out. signed back in and tried a few more times, each with the same result. official help with the error said maybe it was my internet, so i restarted the router and modem, tried again, same crap.~~  \n~~finally i found a thing on reddit saying to clear netflix cookies. that made the tabs work again, i could see stuff under tv shows and movies.~~  \n~~tried to click breaking bad to load it up. jumped to a screen telling me i dont have to sign out. i wasnt signing out, i was trying to play breaking bad. it makes me sign in again. repeat this with a couple more shows. same problem. this time i could find no help for the browser issue, so i instead restarted my computer.~~  \n~~now we get to where i am now: i try to sign in after restarting my computer and now, upon being made to sign in~~ **~~again~~**~~, i am shown a bright yellow-orange error stating \"Something went wrong We are having technical difficulties and are actively working on a fix. Please try again in a few minutes.\"~~  \n~~it has been several minutes. no change.~~\n\n~~what am i doing wrong? is there an issue with netflix? is there an issue with me? am i stupid?~~  \n~~i just want to watch monday night wrestling now that its no longer on tv and, like every single thing in life, i cant do so much as that without some miserable interruption to prevent something that might grant me even a microscopic amount of happiness. someone help me.~~\n\nthe issue i had was with the supermium browser. i tried with both microsoft edge and google chrome and both worked fine, so its ether a plugin i have (which i dont know which itd be since nothing i have should interact with netflix) or supermium as a whole  \nsorry for being a grumpy doomer ive just been having a hard time lately",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hu6jar/an_absolute_miserable_first_impression/"
    },
    {
        "id": "1hsuod8",
        "author": "Background_Silver702",
        "title": "Best show I’ve seen in a while: Man on the Inside",
        "content": "The title says it all. But this was such a heart-warming show. One of the best shows I’ve seen on Netflix in a while. \nGreat acting, laugh out loud moments, poignant, good storytelling and great cinematography. \nI am so enthused that there’s going to be a second season. \n10/10 for me. ",
        "upvotes": 222,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1hsuod8/best_show_ive_seen_in_a_while_man_on_the_inside/"
    },
    {
        "id": "1hthaur",
        "author": "SuperPigDots",
        "title": "How do I add \"extra members\" on my Netflix Premium plan paid through my T-Mobile Magenta plan?",
        "content": "I recently upgraded to Netflix Premium through my T-Mobile Magenta plan. On the Netflix Premium features that were/are advertised to me, just like on the Netflix website, it says:\n\n&gt;Option to add up to 2 [extra members](https://help.netflix.com/en/node/123279) who don't live with you.\n\nI want to take advantage of this by adding one of my parents (non-household and lives far away) as the extra member. I looked everywhere I could think of, but I do not see Netflix currently offering any interface, option, or way to add these extra members. I would like to know:\n\n1. How do I add a member?\n2. Does it cost extra? \n3. If it costs extra, then, how much?",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hthaur/how_do_i_add_extra_members_on_my_netflix_premium/"
    },
    {
        "id": "1htfsh1",
        "author": "BeastElyse",
        "title": "New on Netflix (based on the lag between titles and images while scrolling) ",
        "content": "Has anyone else experienced a delay in images catching up with titles while scrolling through options? I decided to make a few combos (because this is how I spend my weekends, now). ",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1htfsh1/new_on_netflix_based_on_the_lag_between_titles/"
    },
    {
        "id": "1hthfwb",
        "author": "Motorboke",
        "title": "Netflix not updating shows on my profile. ",
        "content": "I’ve been having the issue lately that whenever I watch a show on my phone it won’t update what I’ve been watching on my profile, but I do notice that it will update the show I’m watching on my mom’s profile instead. \nBefore I watch a show I make sure I am in my profile so I know it’s not an issue of me clicking the wrong profile. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hthfwb/netflix_not_updating_shows_on_my_profile/"
    },
    {
        "id": "1hthd6z",
        "author": "RareCheesecake595",
        "title": "WHY is there no English subtitle option without Closed Captioning (CC)???",
        "content": "Please. I am not a native english speaker but don't want to watch the dubbed version. I know English well enough to understand everything with subtitles but not well enough to understand ALL of it without. Sure, most of it. But maybe there whispering, maybe there are explosions or other loud sounds (I'm looking at you Nolan), maybe there is just one word I don't know, maybe they are using colloquial language I'm not familiar with, maybe there using names I don't understand. But I don't want to see this annoying closed captioning s\\*\\*\\* because... well it is ANNOYING AS HELL. Besides, maybe some native speaker folks want to watch with normal subtitles as well? I imagine watching while eating chips/crisps for example or watching Nolan movies. Or maybe you don't want to turn up the volume too loud.\n\nAlso, why is there stuff included in the CC which one can see? For example there was someone seen spitting on the floor, why would you add \\[spits\\]??? Dude, I see it! It does not happen often but sometimes.\n\nWouldn't it be easy as hell to offer a subtitle-version without CC? All the text is there already anyway, just search and delete everything in square brackets, it can't be that hard for real.\n\nAre they really thinking there is NO ONE who would like subtitles for the original/production language without CC?",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hthd6z/why_is_there_no_english_subtitle_option_without/"
    },
    {
        "id": "1hstkcy",
        "author": "VeracitiSiempre",
        "title": "Cunk on Life now airing",
        "content": "I watched it, and it was outstanding, as usual. If you’re a fan of the  Philomena, you’re in for a treat!\n\nDeadline link because I felt like I was supposed to add *something\n",
        "upvotes": 87,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1hstkcy/cunk_on_life_now_airing/"
    },
    {
        "id": "1htw2t0",
        "author": "lockdownsurvivor",
        "title": "Woman of Honour",
        "content": "Despite scrolling downward by over a week, I cannot find the last post on this show but I know I saw it.  Maybe it was too short and the reddit moderators deleted it.\n\nWhat did people think of it?\n\n* I was surprised Anna Kendrick directed it.\n* I found her character very unlikeable.\n* Of course \"Bachelor #3\" was more unlikeable.  Creepy AF, in fact.\n* I didn't know until the credits rolled that it was based on a true story.  Glad the ahole died in prison.\n\nThoughts, sub?\n\n(If the gets deleted because it's \"to short\" I will not be a happy camper.)\n\nxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaabbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbccccccccccccccccccccccccccccccccccccccccccccccc\n\n",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1htw2t0/woman_of_honour/"
    },
    {
        "id": "1htika3",
        "author": "Accomplished_Sir_868",
        "title": "Asking me to “rebuy” plan ",
        "content": "I paid Dec. 10 (charge is on my visa) and I am unable to log in to my account since last night- when I scan the QR and log in it’s asking me to select a plan….\nI can’t seem to get through on the chat- anyone know what’s going on? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1htika3/asking_me_to_rebuy_plan/"
    },
    {
        "id": "1ht1ei1",
        "author": "Ready-Flamingo6494",
        "title": "Horizon An American Saga, how have I not heard of this before until Netflix just released chapter 1?",
        "content": "I will admit, I'm not one that pays close attention to new releases on Netflix or mainstream media releases. But holy #$@&amp; hell. This came out of nowhere for me.\n\nI do not think I've been more emotionally distraught, angry, hopeless - utterly overwhelmed with grief - all of it at once from a movie in a long time, if ever. \n\nSPOILER\n\nThe scene where the raiding Apache open up the tent as the family prays. I...I just can't... I can't get my head around it. Wow just wow. \n\n",
        "upvotes": 21,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1ht1ei1/horizon_an_american_saga_how_have_i_not_heard_of/"
    },
    {
        "id": "1htmebo",
        "author": "bxbyspooks_31",
        "title": "Maybe a dumb question 🤷🏻‍♀️",
        "content": "So I created my mom's account at home because she is in the hospital and she won't be able to use my account considering the no sharing policy Netflix decided to do. \n\nQuestion is, since I used her card to purchase and create the account and made the account at my house, and Netflix somehow tracks the location. Will she be able to use her own account once she gets signed in on her phone in the hospital? \n\nI probably should have came here and asked this before her card took the money, but I didn't and here I am now 💀",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1htmebo/maybe_a_dumb_question/"
    },
    {
        "id": "1htfuc7",
        "author": "berryruby",
        "title": "How may people can watch netflix at the same time on one account and one profile?",
        "content": "So I have 1 netflix account that I pay for, And 3 profiles on it (one for me, my brother and then one for my 3 friends) So how many people can watch netfkix at the same time on one account and one profile? I have standard premium plan btw. I searched on internet but I genuinely dont get it",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1htfuc7/how_may_people_can_watch_netflix_at_the_same_time/"
    }
]