[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 41,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 11,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1q5j88c",
        "author": "FarScheme4636",
        "title": "Run Away - Harlan Coban - TERRIBLE",
        "content": "DONT READ UNTIL YOUVE FINISHED IT\n\nSorry but I keep searching for people’s opinion’s on this show and it’s always mostly positive - I’m so confused!! This was one of this worst series. First of all, why was the daughter not a suspect for the police as she was the last person who saw him dead? There was also NO chemistry between the detectives and that sex storyline was so unnecessary?! Also why would they drag out the whole storyline just to say the daughter killed Aaron?   And then reveal it was the mum? Cornelius said that a few episodes ago too! Also the music.. the acting.. it was TERRIBLE. I don’t understand how people thought this was good? 60K for a dealer to tell james nesbitt that his daughter was seen on the bus… WHY did the detectives not find out that info from the missing persons report?!? Did they even bother looking for her?!? Honestly I’m raging. The whole show was STUPID!!! Plus why does everyone have a gun in the UK!!!!!!! The percentage of gun violence in the UK is 5%.. FIVE PERCENT\n\nAND ANOTHER THING WHY DID THE PARENTS GO TO THE DRUG DEN AND THE MUM GET HERSELF SHOT IF SHE KNEW WHERE THE DAUGHTER WAS AND WHO KILLED AARON… it makes NO SENSE!!!!!!!",
        "upvotes": 49,
        "comments": 69,
        "media": null,
        "permalink": "/r/netflix/comments/1q5j88c/run_away_harlan_coban_terrible/"
    },
    {
        "id": "1q574ut",
        "author": "Book24_",
        "title": "Did I miss the point of Adolescence?",
        "content": "I believe that Adolescence was a great TV show. However I just think it was too short and that the conclusion was underwhelming. I feel like they should’ve given us the trial at least. I definitely missed the point and I want help better understanding the plot and the message.\n\nEdit: Thank you to everyone who helped me to understand the message. I have a clearer understanding of it now.",
        "upvotes": 22,
        "comments": 71,
        "media": null,
        "permalink": "/r/netflix/comments/1q574ut/did_i_miss_the_point_of_adolescence/"
    },
    {
        "id": "1q4zly0",
        "author": "forevony_0904",
        "title": "Run away ~Harlen Coban",
        "content": "I have a question about this show. So im up to the last 3 eps but im so confused about Anya. Paige's sister. Why is it that sometimes shes in a wheelchair and other times shes not. Like she legit ran up to their dad and hugged him ine night. Then the next day shes riding in her wheelchair again. Her legs looked fine to loke skip up n jump in her dads arms. Like. Did I miss something. What's the story there. \n\nLoving this show so far. Just super confused is all",
        "upvotes": 47,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1q4zly0/run_away_harlen_coban/"
    },
    {
        "id": "1q54qbf",
        "author": "Interesting_Rush570",
        "title": "RIPLEY",
        "content": "  Netflix’s *Ripley* is a great thriller that leans hard into mood, restraint, and slow-burn suspense. The story unfolds patiently, trusting atmosphere over exposition, and it pays off. Every frame feels deliberate. The black-and-white photography is stunning, turning light, shadow, and negative space into tools of tension. Italy isn’t presented as a postcard; it’s cool, distant, and quietly menacing, perfectly matching Tom Ripley’s inner life.\n\nAndrew Scott’s performance is controlled and unsettling, never asking for sympathy yet constantly holding your attention. The suspense doesn’t come from action but from watching small lies calcify into something dangerous. Long silences, lingering shots, and precise editing create unease without ever announcing it.\n\nThe setting, from cramped interiors to vast coastal spaces, reinforces the feeling of isolation and moral drift. *Ripley* is elegant, cold, and hypnotic—a series that rewards patience and leaves a chill long after the final scene fades to black, with quiet confidence and precision",
        "upvotes": 25,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1q54qbf/ripley/"
    },
    {
        "id": "1q5e120",
        "author": "denbrough",
        "title": "Just finished Harlan Coben’s Run Away and have one serious question (spoiler alert!)",
        "content": "Where is the goddamn Henry?\nI think I watched it very carefully, but twist after twist after twist - and still no Henry till the very end. Poor guy and his father!",
        "upvotes": 6,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1q5e120/just_finished_harlan_cobens_run_away_and_have_one/"
    },
    {
        "id": "1q5cwsu",
        "author": "foo337",
        "title": "Netflix Kingdoms",
        "content": "Is the singular best zombie media I have ever consumed and I’ve consumed everything I can get my grubby paws on that has zombies. It did so many things that I’ve been wanting from any zombie show for decades when it comes to the pacing and showing instead of telling of the plague outbreak and spread. I could write several thousands of characters but I’ll keep it short and just say the show absolutely slaps and does everything I wanted correctly if not better ",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q5cwsu/netflix_kingdoms/"
    },
    {
        "id": "1q5oyis",
        "author": "Nanaof8girls",
        "title": "Connection trouble",
        "content": "I’m wondering if anyone has connection problem with Netflix and knows what to do!? I used to have Spectrum and then changed to Verizon. Nothing is any better. I have other streaming channels and have zero problems, only with Netflix. I will be watching a show and will get kicked off back to Home Screen, when starting a show and even during it, it will stop and start spinning - so frustrating. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q5oyis/connection_trouble/"
    },
    {
        "id": "1q4ykfd",
        "author": "Orangeandjasmine777",
        "title": "Harlan Coben new series Run Away",
        "content": "Pleasantly surprised and really enjoyed Run Away. It was gripping. From the first episode, all the way. \nJames Nesbitt is truly fab! So is Minnie Driver but unfortunately she's not in it much. \nWhat are your thoughts? \n",
        "upvotes": 32,
        "comments": 69,
        "media": null,
        "permalink": "/r/netflix/comments/1q4ykfd/harlan_coben_new_series_run_away/"
    },
    {
        "id": "1q52zxf",
        "author": "thepurplethorn",
        "title": "Members Only: Palm Beach .. the F class of Palm Beach society",
        "content": "But what a blast that was, my guilty pleasure. You will downvote me to death but I actually liked this show. I was never a fan of Real Housewives or those types if reality shows, so cringe, but this one I actually enjoyed a bit. Maybe because I live in South FL and could relate to a lot of the scenery.\n\nWigs, tacky dresses, cellulite, fake boobs, saggy skin and bickering aside some of these characters were actually entertaining and funny. \n\nMaria , although annoyingly emotional narcissist, was hilarious. \n\nThe self proclaimed Grande Damme Gale was hilarious too, and I could see that she must’ve been a very beautiful woman when she was young.\n\nRosalyn was also an interesting character, she must’ve worked very hard to be the prim and proper soft spoken princess, but I can see from a mile away she just wanna party and dance on tables ",
        "upvotes": 19,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1q52zxf/members_only_palm_beach_the_f_class_of_palm_beach/"
    },
    {
        "id": "1q5fj2x",
        "author": "forevony_0904",
        "title": "Just finished runaway",
        "content": "2nd show watched  of 2026 for me. just came out on Netflix this year. an amazing physiological thriller yet again. so interesting. a bit of cult vibes and culture like drama. some blood and gore. g** violence. substance abuse.  but overall such a good show. omg the twist at the end tho. didnt expect that. im in loveeeee with this show. go watch it nowww \n",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q5fj2x/just_finished_runaway/"
    },
    {
        "id": "1q56ns2",
        "author": "Global_Research_9335",
        "title": "Netflix ad tier disables Picture in Picture on iPhone Air",
        "content": "Posting this so others don’t waste time troubleshooting. On iPhone with Dynamic Island and iOS Picture in Picture enabled, the Netflix ad supported tier does not allow Picture in Picture, background playback, or Dynamic Island playback.\n\nAs soon as you swipe up to leave the app, playback pauses immediately and then fully stops. No PiP window appears. It feels like a bug, but *Netflix support confirmed this is intentional on the ad tier so ads remain full screen*.\n\nThis restriction is not clearly disclosed in the app. If Picture in Picture matters to you on iPhone, the Netflix ad tier is not worth it.",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1q56ns2/netflix_ad_tier_disables_picture_in_picture_on/"
    },
    {
        "id": "1q5778o",
        "author": "applesauce2011",
        "title": "Watch ideas??",
        "content": "I don’t pay for Netflix anymore, but I’m dog sitting for a week and they have Netflix. What is a must watch?? Props if I can get through it by Friday, but I dog sit a lot so I can space it out lol\n\nThings I’ve already seen and liked:\nStranger things\nGinny and Georgia\nOzarks\nThe OA\nWitcher \nWednesday\nSabrina (the new one)\nUmbrella Academy\nMost of Black Mirror",
        "upvotes": 7,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1q5778o/watch_ideas/"
    },
    {
        "id": "1q5cg1f",
        "author": "Loud-Effort958",
        "title": "Shows like man on inside",
        "content": "Are there any that are similar or others that you liked \n\nI couldn’t get into the good place but liked nobody wants this\n\nI guess I like comedy light hearted heartfelt family type ",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1q5cg1f/shows_like_man_on_inside/"
    },
    {
        "id": "1q55kb8",
        "author": "Fantastic_Manner8685",
        "title": "Call of the night season 1 was so good! Season 2 when?",
        "content": "I LOVED season 1, but is season 2 even coming to Netflix? Its been like 4 or 5 months since it released, is this the usual time it takes for things to appear here or is it not coming at all?",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1q55kb8/call_of_the_night_season_1_was_so_good_season_2/"
    },
    {
        "id": "1q5jxue",
        "author": "coolbeans_acubmg",
        "title": "Did Netflix remove members only palm beach?",
        "content": "I was watching this absolutely horrid show yesterday, and today it seems to have fallen off the face of the earth on netflix. It’s not even in my watch history… If you look it up it’ll say it’s #9 on Netflix right now, but won’t play anything… can’t tell if this is somehow me or not…",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1q5jxue/did_netflix_remove_members_only_palm_beach/"
    },
    {
        "id": "1q5mgua",
        "author": "ania11111",
        "title": "My fav show Star Trek Next Generation is being cancelled Jan 8",
        "content": "Anyone knows where I will be able to watch it instead? This is so upsetting to me as it's one of the only shows I love dearly. Only reason I pay for netflix is to watch Star Trek and Friends! They need to chill as none of their new stuff is worthy to pay for.",
        "upvotes": 0,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1q5mgua/my_fav_show_star_trek_next_generation_is_being/"
    },
    {
        "id": "1q5404d",
        "author": "LucrativelyGreyt",
        "title": "HEARTbroken (and recommendation for) KAOS",
        "content": "I’m sooo sorry if this isn’t allowed but it’s 95% a reccomendation and 5% a review so I hope it is !!!\n\nI just wanted to say I’m extreeeeemely picky especially with shows but I just found the Netflix show “KAOS” yesterday and I’m halfway through and I AAAAABSOLUTELY LOVE this show I’m talking BIGGGG love I 100000% reccomend it it’s hilarious, it’s about Greek mythology which I’ve allllllways loved, they do the bestttt job ever with this show like I can’t say a singleeee thing even 1% bad about it it’s seriously amazing …..\n\n\nHOWEVER\n\nI am COMPLETELY heartbroken because it was made in 2024 so I was loving it so much I stopped to google if there would be a second season and it says even tho it got insanely positive reviews etc they STILL decided not to renew it because “it didn’t meet Netflix’s high standards for renewal” 😭😭😭😭 I ususally can get over when a show is cancelled even if I really loved it I’ll just be sad and move on but I literally had to join this sub JUSTTT to reccomend it because it’s literally that amazing and I just can noooot get over this cancellation 😭😭😭😭 \n\n\nTLDR why you should watch it / cool things about it IMO:\n\n-hilaaarious\n-about Greek mythology\n-goes deep into different Greek myths\n-super diverse and LGBTGIA+ friendly and some cast \n-aesthetically pleasing\n-creative \n-a bazillion other things but this is supposed to be the short part 😹😹😹 \n\n\n\nHere’s hoping Netflix realizes what a toooootally PERFECT show they’re cutting short in its infancy 😭😭😭😭 \n\n\nEdit: a word \n\n",
        "upvotes": 4,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1q5404d/heartbroken_and_recommendation_for_kaos/"
    },
    {
        "id": "1q5l79g",
        "author": "Sensitive-Ability390",
        "title": "Stranger Things vs. \"Reality Bites\" (1994)",
        "content": "Reality Bites stars Winona Ryder (Joyce Byers) and Ethan Hawke (father of Maya Hawke, Robin Buckley). The movie starts with a flashback to the recent graduation of Ryder's character from college, probably class of 1993, just like Mike, Lucas, Dustin, Will, and Max.\n\nDo we know where Mike went to college? Because he might have dated his mom.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q5l79g/stranger_things_vs_reality_bites_1994/"
    },
    {
        "id": "1q51mjo",
        "author": "LaDeskWood",
        "title": "Think Best Guess Live is rigged? You're Wrong.",
        "content": "Let's really put this into perspective since there are so many people online complaining that they think it's rigged.\n\nNetflix is projected to have brought in 45 BILLION dollars in 2025. That is earning a revenue of 123 million dollars day. \n\nBest Guess Live gives out $15,000 every weekday, so 260 days out of the year. That adds up to a little under 4 million dollars. With special giveaways let's just pretend it's actually 5 million dollars over the course of the year. Let's pretend it's 10 million even, that's 0.01% of their annual revenue. **It takes Netflix approximately about 2 hours to generate 10 million dollars.**\n\nWhy would a company that makes 123 million dollars a day risk their reputation to save 10 million dollars? It would be like you or me risking a felony charge to save a nickel we found on the sidewalk.\n\n**Netflix is a 500 billion dollar company, you think they're going to risk catching a federal charge over a $15,000 daily trivia game?????**\n\nThey're literally doing this for retention. If someone was going to cancel their account because they don't like the content being carried, maybe having this keeps them around because they have fun playing it.\n\n\"The clues are impossible!\" There's literally 80,000 people making random guesses. On a puzzle they are trying to make impossible on guess 1 and 2 specifically. They go through the answers after to ensure their thought process and why the clue is fair. Why would anyone be giving away money in a game where there are 5 guesses want to make it easy to be figured out on the 1st and 2nd guess? It makes no sense.\n\n**TL;DR:** Netflix makes the prize pool money in the time it takes you to watch one movie. They have zero incentive to rig it and every legal/financial incentive to keep it fair so you keep opening the app every night and don't cancel your membership if you don't like the tv/film options available.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q51mjo/think_best_guess_live_is_rigged_youre_wrong/"
    },
    {
        "id": "1q5m8xl",
        "author": "Thefewmam",
        "title": "I despise Fiona Gallagher from Shameless",
        "content": "Im on season 4 episode 4 i HATE fiona so much bro i couldn’t post on the shameless subreddit so im posting here cause i watch shameless on netflix she is a devil and deserves to get sense smacked into her",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1q5m8xl/i_despise_fiona_gallagher_from_shameless/"
    },
    {
        "id": "1q4sqc8",
        "author": "funny-wizard",
        "title": "Unknown number",
        "content": "Do you think her mother had a crush on her daughter’s boyfriend? Because later she used to threaten Owen’s new girlfriend as well. Owen also had this feeling",
        "upvotes": 6,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1q4sqc8/unknown_number/"
    },
    {
        "id": "1q58onv",
        "author": "HomeSuspicious33",
        "title": "How can I change my profile pic to an old one not available anymore on mobile?",
        "content": "I know the id for scoops ahoy steve harrington but I don’t know how to change it to him on mobile because Im pretty sure devtools does not support mobile",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q58onv/how_can_i_change_my_profile_pic_to_an_old_one_not/"
    },
    {
        "id": "1q4qvmz",
        "author": "Ok-Lavishness4747",
        "title": "What is a good horror movie/series?",
        "content": "I’ve scoured everywhere for good horror movies to binge watch with my friends but all of them were either just meh or straight up disgusting. Something actually scary that would not let me sleep 😭\n\nBtw it doesn’t have to be only on Netflix, you guys can recommend outside of Netflix as well. As long as it’s good 😊 ",
        "upvotes": 6,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1q4qvmz/what_is_a_good_horror_movieseries/"
    },
    {
        "id": "1q3ypqy",
        "author": "hummusluvr8",
        "title": "David Fincher's American 'Squid Game' Spin-Off Makes New Progress in Massive Update",
        "content": "I really hope this happens, David Fincher directing this will be a great fit. This could potentially be the most watched Netflix show ever (surpassing Squid Game season 1). I hope to see casting confirmations soon, any predictions?",
        "upvotes": 366,
        "comments": 135,
        "media": null,
        "permalink": "/r/netflix/comments/1q3ypqy/david_finchers_american_squid_game_spinoff_makes/"
    },
    {
        "id": "1q4ycbc",
        "author": "thug_waffle47",
        "title": "is the premium subscription worth it?",
        "content": "i have a fancy LG OLED tv, although, it’s a few years old it should do 4k no problem.\n\ni splurged on the premium plan this last time i reactivated my account but 🤷‍♂️ it looks just as good as any other app on my tv. if anything, it looks way darker than HBO or Prime or Paramount+\n\nanyone else feel the same? did i get duped? i just switched back to the 1080p plan but that wont go into effect until the 22nd so i guess ill know better then\n\nwhile im here tho, adolescence has been my most recent watch. any other recommendations?",
        "upvotes": 4,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1q4ycbc/is_the_premium_subscription_worth_it/"
    },
    {
        "id": "1q5lbsg",
        "author": "Automatic_Tone_2098",
        "title": "Why is Netflix becoming worse every single day?",
        "content": "Prices go up constantly. Quality get's worse, and I mean the service not the content, even though the content is going bad as well. \n\nTo be honest, Netflix has turned into everything that we hated about all other services. They have gotten a grip on our commodity and laziness and our constant need for something to binge and they are exploiting us. Not for me anymore. These abusive tactics need to stop. And we the paying customers create, with our choices, the companies that we want. If you are ok with 40000 conditions to use a system that we pay for our the wazoo. ",
        "upvotes": 0,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1q5lbsg/why_is_netflix_becoming_worse_every_single_day/"
    },
    {
        "id": "1q5lr0z",
        "author": "bigbwolf18",
        "title": "If they would just have heard the leaked gossip or fan fiction like the three head dragon theory or the clock theory the **Stranger Things** final wouldn’t have sucked so fucking hard.\n\nFive fucking minutes.\nThat’s all it took",
        "content": "If they would just have heard the leaked gossip or fan fiction like the three head dragon theory or the clock theory the **Stranger Things** final wouldn’t have sucked so fucking hard.\n\nFive fucking minutes.  \nThat’s all it took to defeat the Mind Flayer.\n\nAn ancient interdimensional entity that was built up across eight seasons gets wiped out like nothing. At least show some demogorgon or something that actually feels threatening.\n\nHow the fuck does a creature that can jump dimensions control minds and terrorise an entire town for years get nerfed this badly in one episode.\n\nThis thing carried the fear and tension of the whole show and suddenly it’s dumb weak and convenient because the writers wanted to wrap shit up fast.\n\nLazy writing.  \nBad execution.  \nToo many plot holes.\n\nFans didn’t want miracles. We just wanted the ending to respect the scale of the monster you spent years hyping.\n\nYou don’t build cosmic horror for almost a decade just to kill it like a side quest boss.\n\nWhat a waste.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1q5lr0z/if_they_would_just_have_heard_the_leaked_gossip/"
    },
    {
        "id": "1q4lppr",
        "author": "Didyou1123",
        "title": "Good detective show?",
        "content": "I really enjoyed The Residence and the new Knives Out movie, so I was thinking about getting into detective shows. Is there any detective shows like those you might recommend?",
        "upvotes": 11,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1q4lppr/good_detective_show/"
    }
]