[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 15,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1pbnpt4",
        "author": "RiskAndReason",
        "title": "What do you think is the most overrated thing on Netflix?",
        "content": "Curious what everyone’s pick is for the most overrated Netflix show or movie.\n\nWhich title do you think gets way more hype than it deserves, and why? \n\nI’m not looking for hate, just honest opinions and maybe a few hot takes. 🫡",
        "upvotes": 129,
        "comments": 513,
        "media": null,
        "permalink": "/r/netflix/comments/1pbnpt4/what_do_you_think_is_the_most_overrated_thing_on/"
    },
    {
        "id": "1pbdb97",
        "author": "Ha8lpo321",
        "title": "Netflix quietly killed casting from phones to newer Chromecasts and Google TV Streamer",
        "content": "",
        "upvotes": 240,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1pbdb97/netflix_quietly_killed_casting_from_phones_to/"
    },
    {
        "id": "1pbgp78",
        "author": "Such_Environment5893",
        "title": "What is the justification of increasing subscription prices when Netflix continues to cancel shows after 2 seasons?",
        "content": "It doesn't make any sense to me.\n\nWhy get me hooked on shows if they are not going to be finished?\n\nWhat is the justification of this cycle of killing shows after 2 seasons only to start new shows?\n\nIs the price difference THAT MUCH between a renewal vs a new show?\n\nOr is it this overwhelming desire to find the next \"Walking Dead\" or \"Game of Thrones\" mega hit? Is it a case of \"unless it goes viral, its a failure?\"\n\nThe economy of streaming services is pissing me off. These price increases don't seem justified in the slightest.\n\nThis is why I've more often switched to watching YouTube, as at least I can rely on those content creators to keep giving me content I want to watch instead of \"well, my last video didnt get 1 million views, so I guess I'm calling it quits!\".",
        "upvotes": 109,
        "comments": 87,
        "media": null,
        "permalink": "/r/netflix/comments/1pbgp78/what_is_the_justification_of_increasing/"
    },
    {
        "id": "1pc1ufz",
        "author": "TimesandSundayTimes",
        "title": "Gary Lineker nets multimillion Netflix World Cup podcast deal",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pc1ufz/gary_lineker_nets_multimillion_netflix_world_cup/"
    },
    {
        "id": "1pc2rjw",
        "author": "Hot-Slide-7305",
        "title": "Christmas movies",
        "content": "I've recently got netflix got put on my Television, at this time of year there will no doubt be plenty of Christmas TV shows/movies on it, can any of you recommend any of good ones you think I may enjoy?\n",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pc2rjw/christmas_movies/"
    },
    {
        "id": "1pburn8",
        "author": "funkymoonbeam",
        "title": "Does anyone have the Avatar code for the Kuromi icons?",
        "content": "I cannot find the codes anywhere, was hoping a kind person would be able to share the pouting Kuromi avatar code.\n\n  \nI'm referring to [this](https://pbs.twimg.com/media/GwnZKnWXkAA9jAq?format=jpg&amp;name=large) set of icons they released for the '*My Melody &amp; Kormi*' show. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pburn8/does_anyone_have_the_avatar_code_for_the_kuromi/"
    },
    {
        "id": "1patdun",
        "author": "f41ryb0n3s777",
        "title": "Removed a movie while i was watching it",
        "content": "Honestly just sharing it cus it’s funny but a little annoyed by it too. I was watching “Now You See Me 2” and i paused it for like 5 minutes to take a pee break. I come back and turn on the movie and it says title not available. I just brush it off as a typical Netflix glitch and refresh the page to see THAT THEY REMOVED THE MOVIE OFF THE WEBSITE 😭😭😭 REALLY NETFLIX\n",
        "upvotes": 404,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1patdun/removed_a_movie_while_i_was_watching_it/"
    },
    {
        "id": "1pbdvk9",
        "author": "TheMirrorUS",
        "title": "Linda Carman was 'warned' not to go on boat trip with son before death",
        "content": "",
        "upvotes": 18,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pbdvk9/linda_carman_was_warned_not_to_go_on_boat_trip/"
    },
    {
        "id": "1pbpjhd",
        "author": "pirategonzo",
        "title": "Watching Breaking Bad, Went to Lunch, Came Back and it is GONE??? Is it Just Me?",
        "content": "I feel like I am losing my mind. My \"continue watching\" is gone, and if I search for Breaking Bad I can't find it. I was just watching it less than two hours ago.",
        "upvotes": 5,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1pbpjhd/watching_breaking_bad_went_to_lunch_came_back_and/"
    },
    {
        "id": "1pbzep4",
        "author": "GoddessRayne",
        "title": "Shows all look faded",
        "content": "Wondering if others are seeing this. We’ve checked on our tv Netflix as well as our Roku where we usually stream from. Everything seems washed out. Other streaming platforms are fine. It’s just a Netflix thing. I guess it’s better than too dark 😆 ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pbzep4/shows_all_look_faded/"
    },
    {
        "id": "1pbl2tn",
        "author": "HauntingFold6451",
        "title": "Please help me find this cartoon on Netflix from  around 2016-2018 era",
        "content": "I used to watch this show where there were these characters who fought monster like enemies and were trying to survive. It had CGI animation, and a distinct animation style. The characters kinda reminded me of castle crashers. I watched it on my wii with my sister when I was younger. I only remember one part distinctively. There is a scene where they are visiting a theater, (outside). One or two of the characters are looking through a box of props. and a knuckles like character (sonic) picked up a skull and referenced Shakespeare. \"to be or not to be, that is the problem\" He then got corrected because he said it wrong. I am 100% sure that scene exists because we had a skull decor and my sister, who was very young, picked it up and recited the same thing (wrong)\n\nAny help would be valued, and any further questions I will try to answer\n\nEdit: solved its mutant busters",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pbl2tn/please_help_me_find_this_cartoon_on_netflix_from/"
    },
    {
        "id": "1pbkmzc",
        "author": "Own-Relative-850",
        "title": "Stranger Things 5 Dolby Vision problem",
        "content": "When watching season 5 of ST I noticed that epsiode 2 and E2 only doesn't detect Dolby Vision on my TV (LG Oled c3). Episodes 1, 3 and 4, as well as previous seasons don't have this problem. Is there something I can do about it?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pbkmzc/stranger_things_5_dolby_vision_problem/"
    },
    {
        "id": "1pc16g9",
        "author": "HehroMaraFara",
        "title": "Stranger Things Season 5",
        "content": "I cooled on the series after 3 so waited a bit longer to start the last season. \n\nThis is probably the single best example of why a show focused so heavily on children should probably end after 3 seasons or else face the inevitable completely lost vibe and charm and crash landing of an ending. \n\nIt’s just fucking weird bro. Being adults sucks that forgiving effect of being a cute kid even if you’re a mid at best actor. Now it’s just, this mfer has no business being on anything ever and now it’s obvious. \n\nThey even had to cast other people in their late 20s to play high schoolers because if they actually cast literal teenagers, it would be jarring af. \n\nGlad it’s over. Shoulda been a long time ago. ",
        "upvotes": 0,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1pc16g9/stranger_things_season_5/"
    },
    {
        "id": "1pbfvc1",
        "author": "gronbek",
        "title": "Beast in me grain filter",
        "content": "Started watching the beast in me and noticed directly that the image is very grainy. Like there is a filter with lots of small dots everywhere. \nIs this normal?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pbfvc1/beast_in_me_grain_filter/"
    },
    {
        "id": "1pbp8ud",
        "author": "ThunderRoad22",
        "title": "ISO email address (or another option) for customer service feedback",
        "content": "I recently had an incredibly frustrating and disappointing experience with Netflix's customer service (via both phone and chat) that I don't need to get into here. At the end of the chat, the representative gave me two different email addresses I could use to give feedback on my experience. I wrote out a nice long email detailing my experience, and...it bounced back. From both addresses. I just called phone support and was told that the addresses I was given were for outbound emails only, and that they didn't have a customer service feedback email address. When I asked how I could give feedback on my experience, I was told that the only way is by mailing a physical letter to their headquarters in Los Gatos, CA. (Oh, the irony). \n\nBlindly mailing a letter off makes me think I'll never know if it was received or seen, and I certainly wouldn't expect to ever hear back from anyone. So now I'm looking for a way to give feedback on my experience (and hopefully find a solution to what prompted my call in the first place) either online or via email. Does anyone know of anyway that I can do so? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pbp8ud/iso_email_address_or_another_option_for_customer/"
    },
    {
        "id": "1pb93gz",
        "author": "Boredpoquito31",
        "title": "Recommend me some animals documentary",
        "content": "Can you recommend me some of the best animals documentary on Netflix right now? I want something that will be so interesting to watch , even of it's a series of a full movie. Thank you!",
        "upvotes": 7,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1pb93gz/recommend_me_some_animals_documentary/"
    },
    {
        "id": "1pbeb7g",
        "author": "Apprehensive-Care690",
        "title": "Series recommendation",
        "content": "Please please give me a good recommendation series or movies that is SciFi or movies with zombies plot. My netflix is getting cobwebs. Just not Godzilla.",
        "upvotes": 2,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1pbeb7g/series_recommendation/"
    },
    {
        "id": "1pbjcbv",
        "author": "Fit-Supermarket-6726",
        "title": "My netflix keeps having issues on pc",
        "content": "Every time i use it. Whatever i watch. After every 5 - 10 maybe 15 min. Its random. My netflix gets a error and it restarts. I have to chose a profile again and select the show i am watching. Any fixes?\nWindows btw",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pbjcbv/my_netflix_keeps_having_issues_on_pc/"
    },
    {
        "id": "1pbixrc",
        "author": "notjordansime",
        "title": "Cast feature missing - needed for accessibility",
        "content": "Hi, I help a few local seniors with various tech issues in my spare time. Recently, the cast feature has stopped working and a few people that I help heavily rely on that for accessibility. The TV App interface is simply too confusing for them, they cannot use it. \n\nThey rely on the cast feature to be able to navigate the UI, to select a show that they want to watch. It’s a phenomenal solution that makes browsing Netflix possible for them. The feature still works on all other streaming services, including YouTube. They can cast their home screen and browse the Netflix catalogue while casting, but as soon as they try to put on a show it all falls apart. This isn’t a matter of convenience, it’s the only way they’re able to navigate the UI. I have tried to show them how to do it normally, and I usually get responses like “that’s too much for me, it’s not worth the hassle”. \n\nAny solutions, or should I contact Netflix support?",
        "upvotes": 1,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1pbixrc/cast_feature_missing_needed_for_accessibility/"
    },
    {
        "id": "1patbpk",
        "author": "StunningComment6064",
        "title": "True crime",
        "content": "Which is the best Netflix TV show based on true crimes? Which one do you recommend, or which one has stayed in your memory even today after you watched it?",
        "upvotes": 41,
        "comments": 69,
        "media": null,
        "permalink": "/r/netflix/comments/1patbpk/true_crime/"
    },
    {
        "id": "1pbfiay",
        "author": "Wooden-Butterfly7339",
        "title": "Cool Screen shot filter",
        "content": "When you turn on Netflix, you get a carousel of screen shots of available shows. Many of those shots have a subtle filter that I really like! \nSpartacus is a good example. Does anyone know what it's called or how it's done?\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pbfiay/cool_screen_shot_filter/"
    },
    {
        "id": "1pbedne",
        "author": "RingRevolutionary552",
        "title": "Where is sesoan 1 of Gilmore Girls ?",
        "content": "I started watching Gilmore Girls and I am on sesoan 1 and now I see that they removed only sesoan 1. I can watch other sesoans but not 1, why ? How do I fix this ?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pbedne/where_is_sesoan_1_of_gilmore_girls/"
    },
    {
        "id": "1pbpjdn",
        "author": "Healthy_Birthday_135",
        "title": "Just wondering",
        "content": "Posting this here because my Karma is too low for r/strangerthings.\n\nWhat main character has done the least in terms of helping the group, screentime or just not been doing much in general.\n\nIm just wondering because peoples favorite characters are very split among fans. But who has done the least for the group/party.\n\nFor me its. (Some of yall are gonna dissagree)\n\nWill. I find it hard to think about something that will has actually done. I know that he can feel the monsters thay may help but in terms of helping the group or doing plans he really has not done much. I also always think that he conplains a lot.\n\nJonathan. I liked him from s1-s2 but after that he is basically just there to compete with Steve and does not do much else.\n\nMax. YES i like Max very much as a character. The only thing i can think of that she did that was helpfull was to lead the group to Vecna but other than that she has not done that much except for being cocky and dumping Lucas for no reason.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pbpjdn/just_wondering/"
    },
    {
        "id": "1pb5snp",
        "author": "grahamalondis",
        "title": "Anyone else unable to stream particular episodes of Stranger Things S5 in 4K?",
        "content": "I'm on a wired connection at about 100 Mbps and I've tested it multiple times. Other seasons of Stranger Things, the trailers, and even the first episode of season 5 stream in 4K no problem. But for some reason episodes 2 and 3 (haven't checked 4) are only streaming 1080 and look like they're on a DVD from 2007. Like the bit rate of the video won't go beyond 1.87 Mbps while the episodes that play normally are above 12mbps. Awful.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pb5snp/anyone_else_unable_to_stream_particular_episodes/"
    },
    {
        "id": "1pan4i2",
        "author": "Remarkable-Slide-750",
        "title": "Stranger things season 5! What’s your thoughts?",
        "content": "I loved season 5! I had low expectations because it’s hard for a show to keep me engaged after season 3 and the fact so much time has passed between seasons but I think season 5 was carefully orchestrated! The characters weren’t overly exaggerated, the storyline had a lot of hooks so you’re not just waiting for that “one” thing to happen, and the relatable symbolizations of inner battles we all good through. I say bravo for keeping season 5 evolved while maintaining a steady baseline story! ",
        "upvotes": 34,
        "comments": 76,
        "media": null,
        "permalink": "/r/netflix/comments/1pan4i2/stranger_things_season_5_whats_your_thoughts/"
    },
    {
        "id": "1pb5edr",
        "author": "harpreetthind",
        "title": "Question",
        "content": "Looking for movie recommendations already watched good girls watching Wednesday and finished watching\nThe haunting of Hill House what does everybody else recommend watching?\nThanks",
        "upvotes": 3,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1pb5edr/question/"
    },
    {
        "id": "1pbauuq",
        "author": "hey_Imokie",
        "title": "Why did they discontinue Spinning out???",
        "content": "So I randomly remembered this show and now I’m annoyed all over again.\n\nIt actually had a pretty solid plot, good casting, and the chemistry was great. And the best part? The way they portrayed Kat’s bipolar disorder was so nuanced, no glamorizing, no over-the-top chaos, just a very real, very human depiction.\n\nIf only they’d bring it back. Honestly, it deserved so much better.\n",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pbauuq/why_did_they_discontinue_spinning_out/"
    },
    {
        "id": "1pb0za5",
        "author": "GuineaPKilledMe",
        "title": "I really wish they'd bring Hoops back",
        "content": "Ever since it released in 2020 it's been my comfort show. I don't know why it was so universally disliked. It's funny and silly and personally I enjoy how they go overboard with vulgarity. Apparently the reason it was cancelled after one season was due to the vulgarity, but why even allow season 1 then? \n\nUgh I miss Ben :(",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pb0za5/i_really_wish_theyd_bring_hoops_back/"
    },
    {
        "id": "1pavdny",
        "author": "Notoriously_So",
        "title": "New Layout",
        "content": "I don't know if this is a beta thing or whatever, but the new Netflix layout on Chromecast and TV is pure garbage. The icons are way too big and it's basically impossible to navigate. Why can't they just leave things how they were before?",
        "upvotes": 8,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1pavdny/new_layout/"
    }
]