[
    {
        "id": "1k5n4b0",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Cheech &amp; Chong - Thursday 4/24 at 4:00 PM ET",
        "content": "",
        "upvotes": 29,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1pfbms03lhwe1.png?auto=webp&amp;s=31c3b0a34bbb3968197f0b76abe17a8d21a12795"
        },
        "permalink": "/r/movies/comments/1k5n4b0/amaqa_announcement_cheech_chong_thursday_424_at/"
    },
    {
        "id": "1k56e6v",
        "author": "HuntingDaze",
        "title": "Hi /r/movies! We are Nahéma Ricci (lead actress), Annick Blanc (director/writer) &amp; Maria Gracia Turgeon (producer) of HUNTING DAZE, a Canadian thriller that premiered at SXSW in 2024. A stranded young woman joins a group of hunters at a remote cabin, threatening the group's balance. Ask us anything!",
        "content": "More information:\n\nNina, a young, tempestuous woman, finds herself stranded in the far North. She convinces five men on a bachelor hunting trip, to put her up for a few days. In this masculine microsociety, by turns hilarious and philosophical, Nina starts to feel a sense of belonging she never has before. But a mysterious stranger’s arrival changes the course of this improvised holiday forever. Both raw and dreamlike, Hunting Daze offers up a unique universe where humour, horror, the uncanny, and the sensual combine.\n\nOur film played at SXSW, Fantasia, Sydney FF, KVFF, and more in 2024. It's out now in the US and Canada on Digital.\n\nTrailer:\n\n[https://www.youtube.com/watch?v=O66TVAcpeFM](https://www.youtube.com/watch?v=O66TVAcpeFM)\n\nNahéma was also the star of 2019's \\*\\*Antigone\\*\\* from French-Canadian director Sophie Deraspe, which won five Canadian Screen Awards (and TIFF's Best Canadian Film Award) and was submited to the Oscars as Canada's Best International Feature Film choice.\n\nMaria was twice-nominated for an Oscar for Best Live Action Short Film (\\*\\*Fauve\\*\\* in 2019 and \\*\\*Brotherhood\\*\\* in 2020, both from Canada).\n\nThis is Annick's feature directorial debut.\n\nWe will be back at 4 PM ET today (Tuesday 4/22) to answer your questions. Ask us anything!\n\n",
        "upvotes": 46,
        "comments": 59,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/d3rm59260ewe1.png?auto=webp&amp;s=6941c135f5447b968eddd37ae5d4ea8d60f160e1"
        },
        "permalink": "/r/movies/comments/1k56e6v/hi_rmovies_we_are_nahéma_ricci_lead_actress/"
    },
    {
        "id": "1k5fz7j",
        "author": "ChiefLeef22",
        "title": "‘Conclave’ Viewership Soars After Pope Francis’ Death, Up 283% to Nearly 7 Million Minutes Watched",
        "content": "",
        "upvotes": 21474,
        "comments": 682,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/e0xfL4vlEpenYa7NaWhlrXQy01fHKa2MdzuQb43lWnY.jpg?auto=webp&amp;s=12233e9f82452f66a9c4a18e4833c425c224c96e"
        },
        "permalink": "/r/movies/comments/1k5fz7j/conclave_viewership_soars_after_pope_francis/"
    },
    {
        "id": "1k5gl11",
        "author": "MarvelsGrantMan136",
        "title": "Ryan Coogler Thanks Fans for Historic ‘Sinners’ Opening, Calls Cinema A Necessary Pillar of Society",
        "content": "",
        "upvotes": 3460,
        "comments": 130,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/a6x9ETuk96023-JP31Wym3MlpMPRX6gmuN7hprdAS3Y.jpg?auto=webp&amp;s=274c17c82b004f46f1bfad3009740fdba7031390"
        },
        "permalink": "/r/movies/comments/1k5gl11/ryan_coogler_thanks_fans_for_historic_sinners/"
    },
    {
        "id": "1k58g7o",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Wes Anderson's 'THE PHOENICIAN SCHEME'",
        "content": "",
        "upvotes": 9125,
        "comments": 644,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wrnp1kd5iewe1.jpeg?auto=webp&amp;s=32b2b6a56890abe79f5cfad01f2c34716b5defeb"
        },
        "permalink": "/r/movies/comments/1k58g7o/official_poster_for_wes_andersons_the_phoenician/"
    },
    {
        "id": "1k5ke3y",
        "author": "verissimoallan",
        "title": "In a controversial decision, the Brazilian Academy of Cinema announced that \"I'm Still Here\" will be ineligible in all categories at the 2025 Prêmio Grande Otelo (the Brazilian Oscars) because it is superior to the other candidates. Instead, the film will win only a special award.",
        "content": "",
        "upvotes": 1269,
        "comments": 101,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fbq3TxX6mFVR4AH-Ok-BSEwpVvJ2CkyG77sZy21opXs.jpg?auto=webp&amp;s=02aa0386b75d0620ba09da79407655a947218dc4"
        },
        "permalink": "/r/movies/comments/1k5ke3y/in_a_controversial_decision_the_brazilian_academy/"
    },
    {
        "id": "1k5izao",
        "author": "NoCulture3505",
        "title": "Andy Serkis ‘Animal Farm’ Animated Film Casts Seth Rogen, Glenn Close, Woody Harrelson and More in Voice Roles",
        "content": "",
        "upvotes": 1248,
        "comments": 119,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BYmYPlwHw_iCc2t50ECUO2lSuIGLypmqCjJrpQt0h3Y.jpg?auto=webp&amp;s=557a17a579397ee87651df54922d854551c4b38b"
        },
        "permalink": "/r/movies/comments/1k5izao/andy_serkis_animal_farm_animated_film_casts_seth/"
    },
    {
        "id": "1k5oe0w",
        "author": "Maleficent_Fault_943",
        "title": "'I Know What You Did Last Summer' director breaks down trailer, says Sarah Michelle Gellar isn't coming back",
        "content": "",
        "upvotes": 379,
        "comments": 58,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/eEdPyRefUpSTxvfLhNF7oFQyOtWZZtoyFihUUvJri0k.jpg?auto=webp&amp;s=99c714c7fef5257afd6a5c1daf787975202fbd2a"
        },
        "permalink": "/r/movies/comments/1k5oe0w/i_know_what_you_did_last_summer_director_breaks/"
    },
    {
        "id": "1k5656q",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'Deep Cover' - Three improv actors (Bryce Dallas Howard, Orlando Bloom &amp; Nick Mohammed) are hired by the police to help stage low-level stings. Their instinct to ‘always say yes’ without breaking character leads them deep inside the London criminal underworld.",
        "content": "",
        "upvotes": 4035,
        "comments": 372,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/x2bbg5590ewe1.jpeg?auto=webp&amp;s=885587fc6a77b928f90e3e5396011cfd22207506"
        },
        "permalink": "/r/movies/comments/1k5656q/official_poster_for_deep_cover_three_improv/"
    },
    {
        "id": "1k5rf13",
        "author": "Polyglotpen",
        "title": "Truman show ending",
        "content": "Anyone else notice that in the final scene, when Truman is about to exit through the door in the sky, Christof desperately tries to keep him in the show by saying There's no more truth out there than in the world I created for you?\n\nOn my first watch as a kid, I thought this was just a desperate plea. But rewatching as an adult, I realized Christof was actually telling the truth from his perspective. The real world Truman was escaping to in 1998 was already filled with reality TV, manufactured personas, and the early stages of our current parasocial nightmare.\n\nTruman wasn't escaping artifice for reality - he was just trading one stage for a bigger, more complex one where he'd have the illusion of control.\n\nThis adds such a haunting layer to that final bow and \"In case I don't see ya - good afternoon, good evening, and good night.\" It's not just a goodbye to his fictional world, but almost a greeting to ours.\n",
        "upvotes": 113,
        "comments": 27,
        "media": null,
        "permalink": "/r/movies/comments/1k5rf13/truman_show_ending/"
    },
    {
        "id": "1k5fed2",
        "author": "MrGittz",
        "title": "Movies you loved as a kid &amp; adult only to discover the movie had a negative reputation with critics &amp; audiences. For me it’s got to be “Ghostbusters 2”",
        "content": "I grew up loving Ghostbusters. The movies, the cartoons, and the toys.\n\nBut as I got older I started realizing more and more that “Ghostbusters 2” had a less than stellar reputation. That shocked me. I mean is it as good as the first? No. But it’s still a damn good time. It’s got a great plot device(negative charged slime), a scary bad guy(VIGO!), some fun set pieces(court room bust) but most all?\nYou get to spend time with these actors playing these characters. They have this wonderful chemistry together. \n\nThey have such great chemistry. I remember coming across the IMDb score for the 2nd Ghostbusters. Back then it was much lower than it is now. In the 5/10 range. What gives?\n\nI watched Roger Ebert and Gene Siskel, fans of the first film, rip the sequel to shreds. \n\nI would read how critics and audiences thought it’s a retread of the first film, it wasn’t funny, didn’t make sense. “Why are people still not believing in ghosts after the first film”. That last one never made sense to me. In the entire film only like 3 people say they don’t believe. One or which is an insane judge. Another a kid I mean…it’s 2025 and people still think we didn’t go to the moon or that the earth is flat. So I don’t think everyone would be accepting to the idea of ghosts and marshmallow men. \n\n\nSo what are some other examples of films you loved then found out they weren’t as liked or respected as you imagined?",
        "upvotes": 693,
        "comments": 1103,
        "media": null,
        "permalink": "/r/movies/comments/1k5fed2/movies_you_loved_as_a_kid_adult_only_to_discover/"
    },
    {
        "id": "1k5bfi7",
        "author": "Pep_Baldiola",
        "title": "“Tombstone” has been released in 4K UHD on digital platforms and Blu-ray",
        "content": "",
        "upvotes": 707,
        "comments": 54,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3CJgG60IpSSWBm1_6zMh8LjSXZuMBEoW7-7KUHsr9xY.jpg?auto=webp&amp;s=f2e1834b6b74576619156e142c121323021ccb21"
        },
        "permalink": "/r/movies/comments/1k5bfi7/tombstone_has_been_released_in_4k_uhd_on_digital/"
    },
    {
        "id": "1k5dqo6",
        "author": "CinephileCrystal",
        "title": "Don Bluth's All Dogs Go To Heaven (1989) never ceases to be a emotional experience, especially when you realize the tragic backstory for some of the scenes",
        "content": "Judith Barsi, the child actress who voiced Anne-Marie, was killed by her dad right after she did the voice-work for the movie. \n\nThe last scene of Charlie (Burt Reynolds) saying goodbye to Anne-Marie, Reynolds' teary voice can be heard because it was real, the actor kept breaking down whenever he voiced his lines as he had to hear the voice of a dead child telling him how much she loved him. \n\nJudith Barsi struggled to sing the song, [Soon You'll Come Home](https://www.youtube.com/watch?v=kSMJTSKXtLs), because of the abuse at home and how she related to the song. She broke down crying and they ended up using another girl to dub Barsi's singing. \n\nThe movie itself is a moving and solid picture. I don't think Burt Reynolds getsw enough credit on how good he was in this voice acting role. He even showed he could sing. I like his duet with Melba Moore. \n\n\nI just adore Don Bluth and I wish he had made more movies.",
        "upvotes": 474,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FnfSUDM3SqYkNR4hjYOBoWvXpMs1ePIDpFXxd3gyhuY.jpg?auto=webp&amp;s=38403883a16e26c7bb832d545011e64110a0f9f3"
        },
        "permalink": "/r/movies/comments/1k5dqo6/don_bluths_all_dogs_go_to_heaven_1989_never/"
    },
    {
        "id": "1k5r97z",
        "author": "GetKickedintheBalls",
        "title": "Are there any people on this sub who actually do still like going to the movie theaters?",
        "content": "I know people like to shit on movie theaters on this site, but are there some outliers on here who generally like to go? Because while some reasons people mentioned are legit, like tickers and snacks being more expensive, people displaying antisocial behavior and improper etiquette, and the floors being sticky and such, there are some reasons people have that are pretty dumb to me.\n\nLike people admitting that they go to the theaters less because they own a big TV set now, a sofa, and have the ability to pause the move whenever you want, which makes me ask, \"Why is this a reason to avoid theaters now, especially since you had such options being given to you for a long-ass time now (i.e. VCRs, cable, VOD, DVDs)?\". Like I don't go to a theater thinking the movie's forcing me to watch all the way through. It's okay to miss out on some things. If you're concerned though, then just go beforehand or don't drink as much, or just hold it if your bladder's strong enough lol. I just hate the idea of people saying that the theater experience is \"dated\" now, and will soon become as \"niche\" as arcades.\n\nI do miss the days when we could watch whenever we want and not think about what critics have to say about them and pay tickets and snacks for them at a very fair price. It just really sucks that the theater experience has to be reserved for \"event\" films like Nolan or Villeneuve's movies simply because of how costly it is now.",
        "upvotes": 66,
        "comments": 216,
        "media": null,
        "permalink": "/r/movies/comments/1k5r97z/are_there_any_people_on_this_sub_who_actually_do/"
    },
    {
        "id": "1k57se1",
        "author": "FilmWaffle-FilmForum",
        "title": "Movie endings where no one “wins”",
        "content": "Most movies have the typical hero vs villain trend where one “wins” and the other “loses”. What movies have endings with no clear winner. I feel like most revenge movies fit into this category, I Saw the Devil is the first one that comes to mind considering he basically tuned into a villain himself. \n\nWhat other movies can you think of? ",
        "upvotes": 929,
        "comments": 1581,
        "media": null,
        "permalink": "/r/movies/comments/1k57se1/movie_endings_where_no_one_wins/"
    },
    {
        "id": "1k5cgqy",
        "author": "icedoutkatana",
        "title": "What’s the best movie that truly *feels* like its city?",
        "content": "Some movies don’t just take place in a city, they *become* the city. Whether it’s the grimy streets of NYC in Taxi Driver, the night-time streets of LA in Nightcrawler, 70s San Fran for Zodiac, which films do you think best embodies their setting? Not just as a backdrop, but as a character itself.\n\nBonus points for cities other than NYC &amp; LA. Give me some Philly examples, Houston, Detroit, Seattle, Nola! \n\nMy personal pick would be “ATL”. The title speaks for itself lol.",
        "upvotes": 417,
        "comments": 790,
        "media": null,
        "permalink": "/r/movies/comments/1k5cgqy/whats_the_best_movie_that_truly_feels_like_its/"
    },
    {
        "id": "1k5lxr5",
        "author": "Odd_Advance_6438",
        "title": "Oscar Isaac singing “Love is the drug” in Sucker Punch is easily my favorite part. It’s crazy they cut it out of the theatrical version",
        "content": "",
        "upvotes": 110,
        "comments": 41,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/1z96upaiahwe1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1k5lxr5/oscar_isaac_singing_love_is_the_drug_in_sucker/"
    },
    {
        "id": "1k54e5s",
        "author": "Bluntfeedback",
        "title": "A24-ification",
        "content": "\nJust finished my A24 weekend marathon (wrapped up with Everything Everywhere All At Once, Talk to Me, and Civil War) and I'm struck again by how consistently this studio has managed to dominate cultural conversations around film for the past decade.\n\nWhat started as an indie darling has become a full-on cultural phenomenon - to the point where \"it's an A24 film\" has become shorthand for a certain aesthetic and quality expectation. They've somehow managed to bridge the gap between critical acclaim and cult following in a way that feels unique in today's fragmented media landscape.\n\nTheir formula seems deceptively simple: find distinctive directorial voices, give them creative freedom, market the films with striking visuals and minimal exposition, and let word-of-mouth do the rest. But the consistency is remarkable.\n\nWhat I find most interesting is how they've become a trusted brand for younger audiences who might otherwise be disengaged from non-franchise cinema. The way their films spread through TikTok and social media feels different from traditional film marketing.\n\nDo you think any other studio has matched their cultural impact in recent years? ",
        "upvotes": 1011,
        "comments": 235,
        "media": null,
        "permalink": "/r/movies/comments/1k54e5s/a24ification/"
    },
    {
        "id": "1k5t78v",
        "author": "OCGamerboy",
        "title": "Scary Movie: What are you waiting for?",
        "content": "",
        "upvotes": 24,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WfCoS0xc_If7buHOUbofEZmkEMuIkJN9F6YWZFdqX_0.jpg?auto=webp&amp;s=816a2f4cd2f406523caf2bd3071bb1d24dd0d4b8"
        },
        "permalink": "/r/movies/comments/1k5t78v/scary_movie_what_are_you_waiting_for/"
    },
    {
        "id": "1k4kcs2",
        "author": "MarvelsGrantMan136",
        "title": "New Oscars Rule: If You Don’t See All the Nominated Films, You Can’t Vote",
        "content": "",
        "upvotes": 47398,
        "comments": 1794,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cmKiQRTdAG60tRvxu0TW4Zn5IR8liBQippjgcfwwgPc.jpg?auto=webp&amp;s=e95db0c42e5f8436321569a5f64684c0a748dfb9"
        },
        "permalink": "/r/movies/comments/1k4kcs2/new_oscars_rule_if_you_dont_see_all_the_nominated/"
    },
    {
        "id": "1k58icv",
        "author": "NoCulture3505",
        "title": "Mountainhead | Official Teaser | Max",
        "content": "",
        "upvotes": 259,
        "comments": 77,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LJgFdtuXQiedRv6ZQijlN5M8kdzkPaKIG5EBzSDBojU.jpg?auto=webp&amp;s=5b245b4ac80194bb3192753311a1433ec148ca18"
        },
        "permalink": "/r/movies/comments/1k58icv/mountainhead_official_teaser_max/"
    },
    {
        "id": "1k5evq0",
        "author": "Askanything236",
        "title": "Going to the movies by myself has become one of my favorite things to do",
        "content": "In recent weeks I have seen two different movies (Drop and Warfare) on my own. As much as I do like going to the movies with people to of course be able to react to things together, there is something I have really started to enjoy about going by myself. \n\nIt’s almost like de-stressing after a long day where you just don’t want to have to talk to anyone and can sit in a dark theater, enjoy a snack and watch the film. \n\nI’m not even necessarily super introverted it’s just become my thing, does anyone else enjoy this? \n\nAlso another part of it is if there is a movie you want to see that others don’t, I don’t think you should be stopped from watching it. ",
        "upvotes": 105,
        "comments": 33,
        "media": null,
        "permalink": "/r/movies/comments/1k5evq0/going_to_the_movies_by_myself_has_become_one_of/"
    },
    {
        "id": "1k5ljc8",
        "author": "alotofbruhmoments",
        "title": "We need to talk about kevin",
        "content": "So…I finally decided to watch We Need to Talk About Kevin. After finishing the movie, I came straight here to see what people had to say about the ending and the film overall. One question that keeps coming up is: Why didn’t Kevin kill his mother?\n\nA lot of people interpret it as Kevin wanting to punish her or provoke a reaction—and while I agree with that interpretation to some extent, I have a different take I’d like to share.\n\nI think Kevin didn’t kill his mother because doing so would’ve given his actions a clear motive. Let me explain.\n\nThere’s a scene where his mother asks him why he collects those “crash CDs,” and he replies: “There is no point. That’s the point.” That line really stuck with me. It shows that Kevin is fascinated by meaningless things—things that have no purpose.\n\nWhich brings me to my theory: he killed his father, sister, and classmates because there was no reason to. His father was kind to him, his sister was just a child, and the classmates didn’t really do anything to him. There was no personal vendetta. And in Kevin’s twisted worldview at the time, that lack of meaning made it worth doing.\n\nBut killing his mother? That would have made sense. That would have had a clear motive:revenge, hatred, resentment. And that’s exactly why he didn’t do it.\n\nAt the end of the movie, when she asks him “Why?”, he says, “I used to think I knew. Now I’m not so sure.” To me, that shows he’s grown out of that phase of finding meaning in meaninglessness, and now he’s left with confusion and regret, or at least uncertainty.\n",
        "upvotes": 42,
        "comments": 23,
        "media": null,
        "permalink": "/r/movies/comments/1k5ljc8/we_need_to_talk_about_kevin/"
    },
    {
        "id": "1k5rtfd",
        "author": "ChrisPrattFalls",
        "title": "Watched Bio-Dome (1996) on Earth Day… and the coincidences were weirdly spot-on",
        "content": "So I half-jokingly pulled Bio-Dome off the shelf tonight and said, “Let’s watch this, it’s Earth Day,” totally forgetting the movie actually takes place on Earth Day. Already kind of a funny coincidence.\n\nThen during the movie there’s this fake newspaper headline that says “Pope Condemns Bio-Dome.” We laughed at how random and over the top it was.\n\nBut then I remembered… the actual Pope just died yesterday. And not just any pope...Pope Francis, who was known for being a major advocate for the environment. He literally wrote an encyclical on climate change. So the Earth Day connection felt extra surreal.\n\nAnd to make it even weirder, there’s a throwaway line in the movie about red food dye, and sure enough, earlier today there was an actual press conference about banning certain petroleum-based food dyes like Red 3 and Red 40.\n\nIt’s obviously just coincidence, but it kind of felt like Bio-Dome accidentally synced up with the real world for Earth Day 2025. Has that ever happened to anyone else, where a totally random movie weirdly lines up with current events?",
        "upvotes": 15,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1k5rtfd/watched_biodome_1996_on_earth_day_and_the/"
    },
    {
        "id": "1k5k0tf",
        "author": "Unlikely_Macaron330",
        "title": "What are some movies you enjoyed that you cannot recommend to anyone?",
        "content": "I really enjoyed the movie ' sorry to bother you', and if you've seen it you'd know why. It starts out as a regular film, then it goes from 0 to wtf and never gets off the gas. Another one that I can't recommend to anyone, would have to be filth. I really loved how this movie takes you on a psychotic ride, and shows a man's decaying mental state perfectly. However like the book, it's a bit much for people. What are some other films you enjoyed that you cannot recommend to anyone? ",
        "upvotes": 49,
        "comments": 224,
        "media": null,
        "permalink": "/r/movies/comments/1k5k0tf/what_are_some_movies_you_enjoyed_that_you_cannot/"
    },
    {
        "id": "1k5bozj",
        "author": "West_Conclusion_1239",
        "title": "Jack Nicholson turns 88 years old: Most successful filmography/career ever??",
        "content": "Today it's Jack Nicholson's birthday, he turns 88 years old, he's pound for pound one of the top four or five greatest American actors ever in acting history.\n\nAnd i may be wrong, but i think in hindsight, he may have the best and most successful filmography ever in cinema history, certainly my favorite. \n\nI mean, it's so diverse and eclectic, unlike DeNiro who, despite considering him the superior actor with higher highs and better and more masterpieces on his belt, he occasionally returns too frequently into the gangster genre.\n\nAnd still to this day he's the most Oscar nominated male actor in history in the acting categories, with twelve nominations.\n\nLook at his filmography:\n\nEasy Rider\n\nFive Easy Pieces\n\nCarnal Knowledge\n\nThe King Of Marvin Gardens \n\nThe Last Detail\n\nChinatown\n\nThe Passenger\n\nOne Flew Over The Cuckoo's Nest\n\nThe Shining\n\nThe Postman Always Rings Twice\n\nReds\n\nTerms of Endearment\n\nPrizzi's Honor\n\nHeartburn\n\nIronweed\n\nThe Witches of Eastwick\n\nBatman\n\nHoffa\n\nA Few Good Men\n\nWolf\n\nAs Good As It Gets\n\nThe Pledge\n\nAbout Schmidt\n\nSomething's Gotta Give \n\nThe Departed\n\nIt may be controversial to say these days, but he has a claim to be the most successful actor ever.\n\nUnparalleled legend.",
        "upvotes": 136,
        "comments": 184,
        "media": null,
        "permalink": "/r/movies/comments/1k5bozj/jack_nicholson_turns_88_years_old_most_successful/"
    },
    {
        "id": "1k5plwr",
        "author": "SirSiro",
        "title": "Found connection between new movie coming out \"Weapons\" and \"Barbarian\"",
        "content": "Watching the trailer for the movie to be released titled Weapons, there is a link at the end of the trailer to http://maybrookmissing.com/\n\n\nAnywho, if you follow the link you get to a page discussing the recent events of missing children in the movie's universe. A little ways down there's another link to an article titled \"Underground Prison Discovered in Rental Home.\" Reading through the article, I noticed some direct references to the plot of Barbarian and the article event quotes Barbarry St. in which the events of the movie took place.\n\nThis was all at first glance and just thought it was interesting! Curious to see how these two films will be connected.  ",
        "upvotes": 18,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/O3hQSV-oC2RAt1-aUF6g4tRGqvq06CLD5CYN85KfcWE.jpg?auto=webp&amp;s=37124ccabe5391e7b85f0d5591caa004aee66c47"
        },
        "permalink": "/r/movies/comments/1k5plwr/found_connection_between_new_movie_coming_out/"
    },
    {
        "id": "1k5ti9j",
        "author": "zhonglin",
        "title": "Is there any movie or tv show recap channel? Just want to have a quick recap before I watch some new season.",
        "content": "For some of the show, like SILO, I just to watch the new season, but I want to have a quick recap with season 1, I tried look with youtube, it seems some of the recap are just AI voice.\n\nI want to watch some real-human, good quality recap videos. Anyone know good one for this.\n\nYoutube channel or Tiktok?   \n",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1k5ti9j/is_there_any_movie_or_tv_show_recap_channel_just/"
    },
    {
        "id": "1k5th71",
        "author": "AcanthaceaeActive795",
        "title": "Any Bittersweet, jazzy nightlife city movies?",
        "content": "Hello looking for movie suggestions based on this idea I’m imagining in my head a kinda melancholy movie, with jazz, the city, themes of depression or sadness, club, slow dancing. I’m sure something like it exists. \n\nSomething well shot and serious, with a phenomenal soundtrack. Really looking for a good jazz soundtrack ",
        "upvotes": 6,
        "comments": 8,
        "media": null,
        "permalink": "/r/movies/comments/1k5th71/any_bittersweet_jazzy_nightlife_city_movies/"
    },
    {
        "id": "1k55pih",
        "author": "NoCulture3505",
        "title": "I KNOW WHAT YOU DID LAST SUMMER - Official Trailer (HD)",
        "content": "",
        "upvotes": 186,
        "comments": 236,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/F-rFAlzV460QqEuL_kGgQr5RZwfojm-m5VNsMXhL6Ns.jpg?auto=webp&amp;s=9ce0a0746961b25ed8a4afc6b0fc456440c200f5"
        },
        "permalink": "/r/movies/comments/1k55pih/i_know_what_you_did_last_summer_official_trailer/"
    },
    {
        "id": "1k5eigz",
        "author": "mikerockitjones",
        "title": "Brawl in cell block 99 was one of Vince Vaughns best movies I've seen him in.",
        "content": "I like him as a comedian. Seeing him serious was really great. I have no idea I've never seen this until today. My only opinion was that I didn't like the title of the movie. The story was good.  His dark hero character was interesting. Seeing him bald he's almost unrecognizable. I like that there's no set up for a sequel it's a complete movie within. What are some other one and done movies that need no sequel?",
        "upvotes": 60,
        "comments": 79,
        "media": null,
        "permalink": "/r/movies/comments/1k5eigz/brawl_in_cell_block_99_was_one_of_vince_vaughns/"
    },
    {
        "id": "1k550cx",
        "author": "MarvelsGrantMan136",
        "title": "‘Enola Holmes 3’ Begins Production; Millie Bobby Brown, Henry Cavill, Louis Partridge and More Returning",
        "content": "",
        "upvotes": 213,
        "comments": 50,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/yThzmKiWInxRKI3vvT0z2ql_Qavke-xWi-oj5wIPSuQ.jpg?auto=webp&amp;s=5bcc890392762fdecf497f21f84167b374519b66"
        },
        "permalink": "/r/movies/comments/1k550cx/enola_holmes_3_begins_production_millie_bobby/"
    }
]