[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 15,
        "comments": 105,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 72,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1lo1clp",
        "author": "Weird-Personality-31",
        "title": "get rid of netflix games.",
        "content": "I want the option to disable games. I want it gone.\n\nI hate the fact that they use money which we paid to make stupid games. this is not what netflix is about.\n\nIf I want to game I will buy my AAA games.\n\nBe gone with this trash!!",
        "upvotes": 136,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1lo1clp/get_rid_of_netflix_games/"
    },
    {
        "id": "1lnrhna",
        "author": "antonia71007",
        "title": "a few takes of mine from the poop cruise documentary (this has definitely been talked about before but idc)",
        "content": "first of all, the guy with the glasses and the bachelorette party were so goddamn annoying. i’m pretty sure the guy cared more about his father in law than the cruise. now i get that shitting in a bag isn’t nice, but wanna know what’s worse? walking around ankle deep in other people’s piss and shit, or shitting on top of someone else’s layered shit. they were clearly all so privileged to act like that. and then they were all disgusted when the piss and shit got everywhere. who’s fault was that? yours for not using the damn bags and continuing to use the toilets. \n\nsecondly, who thought it was a good idea to open the bar? that was really stupid, they were obviously gonna go crazy. and then they were surprised when it turned into a poop deck frat party? like what did you expect?? theyve been stuck there for 4 days.\n\nthirdly, i felt bad for the dad. he was recently divorced and just wanted to have a good time with his daughter, and that was what happened, and he felt like he had failed. at least they still go on cruises together \n\nand obviously, i was dying laughing everytime the indian chef came on screen. when he was talking about someone throwing the shit bag and hitting someone else, i was rolling\n\nthat’s it folks. thanks for coming to my ted talk",
        "upvotes": 295,
        "comments": 69,
        "media": null,
        "permalink": "/r/netflix/comments/1lnrhna/a_few_takes_of_mine_from_the_poop_cruise/"
    },
    {
        "id": "1loa2fb",
        "author": "ElvenQueen726",
        "title": "I'm obsessed with the tiger and magpie in Kpop Demon Hunters",
        "content": "The tiger and the magpie were easily my favourite characters in the movie, and if you’re also into art and mythology like I am, here’s a little background on their historical references.\n\nIn traditional Korean art, the white tiger and magpie often appear together in a style called [Jakhodo](https://exhibitions.asianart.org/exhibitions/jakhodo-today/#:~:text=The%20tiger%20and%20magpie%20pairing%20appears%20so%20frequently%20in%20Korean%20art%20that%20it%20comprises%20its%20own%20genre%3A%20jakhodo%2C%20paintings%20depicting%20tigers%20and%20magpies) (*jak* = magpie, *ho* = tiger, *do* = painting). These images were used as talismans to ward off evil spirits.\n\nThe tiger was intentionally given those ridiculous, bulging yellow eyes to make it look dumb. That’s why it’s traditionally nicknamed “idiot tiger” (바보호랑이), and the paintings are often called *“Idiot Tiger and Scolding Magpie.”* So, in its introduction scene when the magpie looked annoyed and judgmental that was on purpose.\n\nThis art style is part of a genre called [Kkachi Horangi](https://en.wikipedia.org/wiki/Minhwa#:~:text=Kkachi%20horangi%20(%EA%B9%8C%EC%B9%98%ED%98%B8%EB%9E%91%EC%9D%B4)%20is,structure%20of%20Joseon%27s%20feudal%20society), and it’s basically satire. The goofy-looking tiger represents authority (intentionally depicted as silly and clumsy like corrupt officials or clueless aristocrats), and the magpie is the voice of the common people, calling them out.\n\nWhen Jinu mentioned he made the hat for the tiger but the bird kept stealing it, that was a reference to a real J[oseon-era Minhwa painting that shows a tiger smoking a pipe and wearing a top hat](https://korelimited.com/blogs/korelimited/the-korean-tiger-a-hallmark-of-korean-identity#:~:text=One%20of%20the%20most%20striking%20features%20of%20art%20portraying%20the%20Korean%20tiger%20is%20the%20eyes%3B%20they%20are%20often%20bulging%20and%20painted%20a%20bright%20yellow.%20This%20is%20a%20recurring%20aspect%20of%20most%2C%20if%20not%20all%20art%20with%20the%20tiger%20as%20its%20subject), while a magpie stands nearby.\n\nThe White Tiger (Baekho in Korean) is also one of the Four Holy Beasts in Sino-Korean mythology, symbolising the West and the element of metal. It’s a powerful, protective figure with deep cultural significance.\n\nI actually did a breakdown of the movie and shared some theories about the tiger in a separate [post](https://www.reddit.com/r/movies/comments/1lmhs7a/kpop_demon_hunters_movie_analysis_theories/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button) if anyone’s interested.\n\nhttps://preview.redd.it/8slwt5zaz2af1.png?width=937&amp;format=png&amp;auto=webp&amp;s=813ed2ffe493193302e9f83b02839916a0229094",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1loa2fb/im_obsessed_with_the_tiger_and_magpie_in_kpop/"
    },
    {
        "id": "1ln8s7l",
        "author": "Jumpy-Purple7593",
        "title": "What’s a hidden gem on Netflix that you always recommend but no one ever seems to watch?",
        "content": "We all have that one show or movie we loved on Netflix, the one you tell people about constantly, but for some reason, nobody ever seems to give it a shot. Mine is “The OA” ,weird, emotional, and absolutely brilliant. Every time I recommend it, people nod politely and go right back to rewatching The Office for the 6th time. So let’s hear it: what’s your underrated favorite? Could be a foreign film, a forgotten limited series, or a random docuseries that blew your mind. ",
        "upvotes": 1437,
        "comments": 1531,
        "media": null,
        "permalink": "/r/netflix/comments/1ln8s7l/whats_a_hidden_gem_on_netflix_that_you_always/"
    },
    {
        "id": "1lo3bm1",
        "author": "LauraEats",
        "title": "Netflix Drops Teaser for ‘Troll 2,’ the Biggest Nordic Film Production Yet",
        "content": "",
        "upvotes": 9,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lo3bm1/netflix_drops_teaser_for_troll_2_the_biggest/"
    },
    {
        "id": "1lntmmm",
        "author": "picantepepper1",
        "title": "Someone Feed Phil Appreciation Post",
        "content": "This new season made me compelled to write this : I do hope he is a good person IRL, but wow, watching this show makes me feel really touched by the small gestures he does throughout the trips to these different countries. \n\nYes, the family connection is there with his wife, his kids, his brother, and previously his parents (RIP). He's been able to pivot to \"Jokes for Max\" in a really heartwarming way. \n\nBut there are two points I want to emphasize:\n\n1). How in recent seasons when he is traveling he is very conscious to discuss the societal issues and humanitarian efforts going on in all of these countries/cities. It might feel heavy handed at times, but it is the minimum he can do to raise awareness for good causes.\n\n2). How he treats the people he works with and the people he cares about. Almost always in each episode he has a scene where he's having the camera crew getting in on trying the food, too. He will typically treat the local fixers to meals which reinforces this as well. But most of all what I thought was touching this season were his personal stories with his dad's Filipino nurse and his Guatemalan nanny - how he went out of his way to honor them during these journeys. \n\nCombined to me shows someone who cares for his staff no matter how long you worked for him. Feeling like the Everybody Loves Raymond royalties are doing a bit of good in their afterlife. \n\nPhil if you see this, I love ya. \n\n",
        "upvotes": 39,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1lntmmm/someone_feed_phil_appreciation_post/"
    },
    {
        "id": "1lo8oom",
        "author": "instant_ace",
        "title": "Casting no longer working?",
        "content": "Have a Chromecast that using my Android or Iphone can cast to without issues, until last night.  Seems like Nextflix is the only app that this applies to, YT TV, Amazon Prime Video, Paramount all work fine, its just Netflix that can't cast to the Chromecast plugged into the old dumb TV anymore.  Has anyone else experienced this in the last few days?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lo8oom/casting_no_longer_working/"
    },
    {
        "id": "1lo25xa",
        "author": "micheal-in-the-bath",
        "title": "Redrawing a deleted concept from K-pop Demon Hunters",
        "content": "I haven’t watched this movie yet but it was all over my page on instagram, so I kinda know the storyline and characters. I just saw this art concept and THEY WERE SUPPOSED TO KISS 😭😭😭 Gotta say we were absolutely ROBBED. ",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lo25xa/redrawing_a_deleted_concept_from_kpop_demon/"
    },
    {
        "id": "1loasdx",
        "author": "aaronreds91",
        "title": "TIRES! End of Season 2",
        "content": "Finished Season 2 and it was awesome. Great character and storyline development. Funnier. And the cameos! What you think about it??\nAlso, don't want to be a teenage girl about it but... the Kilah and Cal thing??? Shit made me smile, ngl.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1loasdx/tires_end_of_season_2/"
    },
    {
        "id": "1lo9p9u",
        "author": "brijazz012",
        "title": "Merging Accounts",
        "content": "Looking for a little guidance - here's my current situation:\n\n1) I am an extra member on a family member's Premium account.\n\n2) My partner has a standard account, with profiles set up for herself, her daughter and her son\n\nI'm going to be moving into her house and am planning on setting up my own Premium account. Is there a way to move myself (from my extra member slot) and my partner/her kids into my new account without losing our watchlists, recommendations, etc.? Thanks!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lo9p9u/merging_accounts/"
    },
    {
        "id": "1lo0rf2",
        "author": "kwaka300",
        "title": "Layout",
        "content": "This new layout is really winding me up making me not want to use Netflix. It’s so much clunkier and a slog to navigate. The expansion of thumbnails is overbearing and in your face, bring back the old one asap. ",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lo0rf2/layout/"
    },
    {
        "id": "1lo8m07",
        "author": "Pls_un-ban_me",
        "title": "Is squid games ending realistic to you?",
        "content": "Many people have died in these games. It's unlikely that no one would notice or suspect something is wrong. No matter how rich or powerful this organization is, their disappearance would be noticed by their friends, family, and people who knew them. So, why haven't any investigations started? It doesn't make sense that no one has looked into it.\n\n Or maybe I'm overthinking it.\n\nThe ending should have ended with kang no-eul (yes I had to search her name up) saving one of the books before she set the fire that had the record of the gamers in it, and driving to a police station or something. To symbolize some hope of justice and a stop to the game\n\nAlso I kinda liked season 3 NGL but damn that ending had me crying 😭. I feel emotionally abused",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1lo8m07/is_squid_games_ending_realistic_to_you/"
    },
    {
        "id": "1lo8lcj",
        "author": "p0oundcake",
        "title": "Survey help for MSc dissertation",
        "content": "Hopefully it’s ok to post this, feel free to delete if not. \n\n\nHi everyone. I’m running a survey as part of my postgraduate dissertation in Translation and Technology at UCL. The project explores how English-speaking viewers engage with subtitles and whether optional on-screen explanations could help improve understanding.\n\nIt takes about 15-20 minutes to complete, and no personal information is collected.\n\nWho can take part?\n\n- Aged 18 or over\n- Watch foreign-language content on streaming platforms (e.g. Netflix) with English subtitles\nIf that sounds like you, I’d really appreciate your input: https://forms.office.com/e/6Hd0DtYJsx\n\nDo reach out if you have any questions or concerns.\n\nThank you for your time!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lo8lcj/survey_help_for_msc_dissertation/"
    },
    {
        "id": "1lnx5vp",
        "author": "44cody44",
        "title": "Love, Death, and Robots",
        "content": "I need to express my love/appreciation for this series. \n\nSome have described it as a black mirror for teenagers. And I have to respectfully disagree; as I find that statement extremely reductive and disrespectful to the show. It insinuates that the show is juvenile and lacks depth. \n\nholy cow! Does this show stand on its own. Perhaps it’s the fact that it is animated/CGI mostly, or that most episodes are 10-15 min. \n\nI’ve now seen most of the top rated episodes, and I’m thoroughly impressed. To say the least. \n\nThis series is a thousand things all at the same time. Shocking, Sexy, Violent, Mysterious, And even Comical.\n\nI haven’t heard much about it. And I only checked it out because of an instagram reel. But I’m glad I went down the rabbit hole. \n\nDo yourself a favor and watch the top 10 highest rated episodes on IMDB. You’ll thank me later. I’m sure. \n\n",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lnx5vp/love_death_and_robots/"
    },
    {
        "id": "1lnxtiv",
        "author": "kathi182",
        "title": "Poop Cruise questions..",
        "content": "All apologies if this has been asked already, but it’s driving me nuts- they say all electricity immediately shut off, but how did the key cards keep working to allow people into their rooms…and how were they able to continuously make announcements over the PA system? Don’t these systems require electricity?",
        "upvotes": 6,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1lnxtiv/poop_cruise_questions/"
    },
    {
        "id": "1lo5n6w",
        "author": "suhpriseshawtyyy_",
        "title": "Thoughts on Squid game S3! 〇△□",
        "content": "From start to finish, it was visually stunning, a true cinematic masterpiece. But what really stood out to me was the dialogue and the storytelling. The writing was incredible. Everything was so intentional and meaningful—it all felt purposeful and symbolic.\n\nTake player 149, for example. She killed her own son (007) to save player 222 and her newborn. That parallel—of a mother sacrificing her own child so another mother and baby could live—was so powerful. It captured the essence of what it means to be a mother, and it really emphasized the value of life. It wasn’t just tragic and it made sense, emotionally and narratively.\n\nAnd then there’s In-ho. I genuinely think he wanted Gi-hun to win. When he offered Gi-hun the knife, it felt like he was testing him—to see if he would break character, to see if Gi-hun would abandon his morals. When In-ho asked, “Do you still have faith in people?”—that line hit hard. And the answer came, not in words, but in action. By choosing not to sacrifice the baby, Gi-hun showed that he still had faith in humanity.\n\nGi-hun’s final words before his death—“We are not horses. We are humans. Humans are…” that monologue was insane. So layered. It brought everything full circle: from him gambling on horses in the beginning to the VIPs betting on players in the game. That line wasn’t just for the VIPs—it was for us, the audience. A reminder that greed and selfishness can lead to disunity and inhumanity in our society. \n\nI could talk about this season forever. If you’ve seen it, I’d love to hear your thoughts too :) ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lo5n6w/thoughts_on_squid_game_s3_〇/"
    },
    {
        "id": "1lo5m5n",
        "author": "chespiotta",
        "title": "My watch list not showing all titles?",
        "content": "I’m trying to put all my Netflix watch list movies on another app, in case they get deleted before I have the chance to watch them/so that I can save them for later. \n\nI have at least a dozen movies and shows on my watch list that aren’t showing when I click on “My List” (probably more, I can’t exactly count them), but when I click on the titles there’s a check mark next to it. Ex. Charlie St Cloud, Firestarter, The Last Summer. I live in Canada, am not traveling, there’s only one profile, and I didn’t accidentally remove all of them (if that helps)\n\nAny idea on why this is happening and how to fix it? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lo5m5n/my_watch_list_not_showing_all_titles/"
    },
    {
        "id": "1lo5h3t",
        "author": "CappytainZ",
        "title": "Would someone who's never heard/like K-pop music still like Kpop Demon Hunters?",
        "content": "Netflix keeps suggesting Kpop Demon Hunters, and it honestly seems pretty cool. The only thing holding me back is that I fear I wouldn't really be the target audience, because I've never really listened to Kpop before. Would I still be able to appreciate the movie?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lo5h3t/would_someone_whos_never_heardlike_kpop_music/"
    },
    {
        "id": "1ln7niq",
        "author": "zentyme_",
        "title": "Squid Game: Season 1 vs Seasons 2-3",
        "content": "",
        "upvotes": 229,
        "comments": 75,
        "media": null,
        "permalink": "/r/netflix/comments/1ln7niq/squid_game_season_1_vs_seasons_23/"
    },
    {
        "id": "1lo458f",
        "author": "Affectionate_Yam4221",
        "title": "7 Shows To Watch if You Love ‘The Waterfront'",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lo458f/7_shows_to_watch_if_you_love_the_waterfront/"
    },
    {
        "id": "1lo3jzd",
        "author": "Legitimate_Ad3625",
        "title": "the squid game season 3 vips were more cringe than ever — why did bad line readings slip through again…?",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lo3jzd/the_squid_game_season_3_vips_were_more_cringe/"
    },
    {
        "id": "1lo0m9x",
        "author": "Hopeful-Flamingo-145",
        "title": "Favourite tv show recommendations",
        "content": "What's ur favourite tv show recommendations like stranger things, fubar, OBX, dexter and more. It seems like all shows now suck. Im looking forward to hearing ur guys' responses ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lo0m9x/favourite_tv_show_recommendations/"
    },
    {
        "id": "1lo0aj7",
        "author": "Exzstence",
        "title": "Video games?",
        "content": "Why does Netflix not get that no one wants to play video games from Netflix? Why does it keep pushing this? I see GTA San Andreas every day on my homepage as if I did not play that game 15 years ago. People who play video games certainly would never use Netflix to do it. PlayStation and Xbox, etc, are the preferred options for that. Netflix should stay with movies and shows.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lo0aj7/video_games/"
    },
    {
        "id": "1lo0a76",
        "author": "Samadissad",
        "title": "Netflix downloads on add plan",
        "content": "Hello I just wanted to ask when I download on an add plan does it do the whole series and count as one of my 15 downloads or 1 episode that counts as 1 download. So then would it just be better for me to download movies? \n\nPlease help!!!\n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lo0a76/netflix_downloads_on_add_plan/"
    },
    {
        "id": "1lnrdlf",
        "author": "randomuser_q12",
        "title": "What do you want to see on Netflix and what needs to come back?",
        "content": "I remember a few years ago they had the original twilight zone. I’m an old fashioned girly that loves her twilight zone and I want it to come back! But I’m very happy to see they have Alfred Hitchcock’s movies. I would love to see more Asian horror movies like my favs a tale of two sisters, juon series, and ringu. I don’t know if those were ever on Netflix but I hope to see it there one day!",
        "upvotes": 5,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1lnrdlf/what_do_you_want_to_see_on_netflix_and_what_needs/"
    },
    {
        "id": "1lnm2ah",
        "author": "mmmadness",
        "title": "'KPop Demon Hunters' Review: Sony Animation's Stunning Animated Musical Slays Demons and Serves K-Pop Realness",
        "content": "",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lnm2ah/kpop_demon_hunters_review_sony_animations/"
    },
    {
        "id": "1lnybrw",
        "author": "DentistFlashy6030",
        "title": "Extra Members with Premium?",
        "content": "Hi I pay for Netflix Premium and according to the Account &gt; Membership tab in my account, I should be getting 2 extra members 'for an additional $8.99/mo' which I am currently paying.\n\nThe problem is it's only allowing me 1 member. There's another slot that says '1 slot available' however there's no button or option to add a person, the only clickable button is 'Buy another slot' which is charging me ANOTHER $8.99 for that second member. \n\nIs anyone else running into this issue? It seemed to have just started today or recently. Up until now I've had 2 members without a problem, but now it's only showing one and the second one costs extra, although it's stating i get 2 extra members with my current tier. HELP!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lnybrw/extra_members_with_premium/"
    },
    {
        "id": "1lnn2l1",
        "author": "wijnandsj",
        "title": "any way to get rid of the mobile games in my view?",
        "content": "It's really rather annoying all those games I'm never going to play and have 0 interest in. Can it be removed from the app/site in any way? Or is this unavoidable?",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lnn2l1/any_way_to_get_rid_of_the_mobile_games_in_my_view/"
    },
    {
        "id": "1lnxvnl",
        "author": "jamieaugustine25",
        "title": "I love the Mingle scene in squid game",
        "content": "I think it’s my favorite game scene in the show, down to the way it’s filmed and the design of the game itself. The frantic, quick music represents the atmosphere and the blinking lights add to the atmosphere of panic. With an extremely time limit, hoards of people and a need for face paced decision making, the game really brings out the worst and shows what people will do when placed under high stress situations. I know that’s what most of the games are supposed to do, but this one just makes it better because when placed in a situation like this where everyone is yelling, people make decisions that might not be what they would usually do, but what they need to survive. I don’t know if this makes any sense, I just needed to rant.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lnxvnl/i_love_the_mingle_scene_in_squid_game/"
    },
    {
        "id": "1lnx7sk",
        "author": "barneylerten",
        "title": "Is 'The Secret Agent' on Netflix or not?",
        "content": "Hi there! So several online articles said it was added on Friday, praised the 2016 3-part series 'The Secret Agent' - but we just searched Netflix every which way and couldn't find it, with or without the 'The.' Maybe it takes time to show up?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lnx7sk/is_the_secret_agent_on_netflix_or_not/"
    }
]