[
    {
        "id": "1kf7u97",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 28,
        "comments": 5701,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kf7u97/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1ki52pf",
        "author": "Charybd1ss",
        "title": "OTD 1 year ago this happened.  9 minutes. 2 shots. 2 goals.",
        "content": "",
        "upvotes": 1490,
        "comments": 52,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/0qzhaolwcnze1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ki52pf/otd_1_year_ago_this_happened_9_minutes_2_shots_2/"
    },
    {
        "id": "1kibsnw",
        "author": "Total_Escape_9778",
        "title": "Sergio Ramo's 92:48 equalizer is by far the most important in our club's history...",
        "content": "After watching Barcelona’s second leg against Inter Milan, I’ve started to think that even us Real Madrid fans, don’t fully grasp just how unbelievable it is to have won 15 Champions League titles. This Barcelona team looked capable of beating anyone in the world, pulling off comebacks after comebacks. Yet, they didn’t win it. Because in the end it all comes down to mentality- something they’ve lacked for most of the past decade.\n\nWe won the Champions League in 2002 with a superb team featuring Raul, Zidane, Makelele, Figo, Hierro, and Roberto Carlos. After that, we signed even more global superstars like Ronaldo Nazario, David Beckham etc, only to face repeated humiliation in the Champions League. Were we not good enough? No, we simply lacked that X-factor.\n\nBy 2012, we had a phenomenal team under Mourinho that managed to stop one of the best Barcelona sides in history from winning La Liga. But we still bottled the semifinals against Bayern Munich, a tie we absolutely should have won. Ig it was just destiny at the end.\n\nThen came 2014. We reached the final against Atlético Madrid. They took the lead around the 30th minute and defended with everything they had for the rest of the game. We created plenty of chances, many of which should have been finished, but we failed to convert them. By the 85th minute, I had given up hope. Most of us had. After a decade of coming up short in these kinds of moments, it felt all too familiar. But then came that iconic Ramos header in stoppage time, and everything changed. For the first time in what felt like forever, we came back from behind in a Champions League knockout game. From that point on, the victory felt inevitable. Atlético were drained, and we finished the job. But it had an ever-lasting impact on this club's legacy.\n\nSince then, we’ve gone on to win five more Champions League titles. Each run has been filled with close matches and incredible comebacks. Whether you call it luck or the X-factor, there’s something unique about this club. We simply don’t give up.\n\nAnother reason for our success is our adaptability. Against Manchester City in both 2022 and 2024, we defended with everything we had. A lot of big clubs wouldn’t do that, out of pride or because they’re married to a particular style. We aren’t tied down by ideology. Look at Barcelona. After taking the lead against Inter, they kept trying to score again instead of wasting time and locking the game down because they didn’t want to go against their principles. That stupid decision cost them a place in the Champions League final.\n\nMoreover, since 2014, nearly every major club has suffered heartbreak in the Champions League. Every single one—except Real Madrid. And in the end, it all comes down to that one Ramos header.",
        "upvotes": 146,
        "comments": 24,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kibsnw/sergio_ramos_9248_equalizer_is_by_far_the_most/"
    },
    {
        "id": "1kid0ag",
        "author": "Miserable-Subject-87",
        "title": "Xabi Alonso, prepared to say yes to Real Madrid and then complete his move as soon as the exit process with Ancelotti will be finalised. Bayer are accelerating the process to find a new head coach with talks to progress as they’re now expecting Xabi to leave.",
        "content": "",
        "upvotes": 79,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wpIbgb3MAiV6ZUZsNbmwzZfXEipNQiKcsi_orzoqGls.jpg?auto=webp&amp;s=cbe3864e3270280b078cb0af4e8f353b6f973ff7"
        },
        "permalink": "/r/realmadrid/comments/1kid0ag/xabi_alonso_prepared_to_say_yes_to_real_madrid/"
    },
    {
        "id": "1khw5z4",
        "author": "Miserable-Subject-87",
        "title": "Huijsen, ready to pull a Bellingham. The Englishman turned down better offers to play for Real Madrid. The center-back is following in his footsteps.",
        "content": "",
        "upvotes": 538,
        "comments": 70,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ABEnGAdUNfrtmsVj5F8EZWHM0rSnGEiQVNs9D5FpG4U.jpeg?auto=webp&amp;s=f3fba4122d2a7470115d081fe32b2a2a9a8bb22c"
        },
        "permalink": "/r/realmadrid/comments/1khw5z4/huijsen_ready_to_pull_a_bellingham_the_englishman/"
    },
    {
        "id": "1kicd4l",
        "author": "15th_anynomous",
        "title": "You are giving the best attacking fullback to a to a coach who loves to use his fullbacks. What do we expect?",
        "content": "We know that Xabi Alonso likes to make use of his fullbacks. He has like 70 or something g/a between his fullbacks. Now he will get to manage the best attacking fullback. So what can we expect see? How will Xabi use Trent in relation to the other player? Also we know that Trent cant defend against an autistic toddler. How will he solve that?",
        "upvotes": 21,
        "comments": 20,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kicd4l/you_are_giving_the_best_attacking_fullback_to_a/"
    },
    {
        "id": "1khrcqo",
        "author": "123kallem",
        "title": "A Letter to the Kids of My Country | By Arda Guler",
        "content": "",
        "upvotes": 404,
        "comments": 60,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1GFh0_r8aDsRRFLQ_oVBEfgNUtzWD60tqCA8JhzKl7c.jpeg?auto=webp&amp;s=056de4413a15d07226160ed80279e178c9c22b15"
        },
        "permalink": "/r/realmadrid/comments/1khrcqo/a_letter_to_the_kids_of_my_country_by_arda_guler/"
    },
    {
        "id": "1khstb9",
        "author": "Bompton-G-Uno",
        "title": "Look what came in the mail today!",
        "content": "It’s such a thing of beauty 🔥🔥🔥",
        "upvotes": 323,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/uiuvzyesskze1.jpeg?auto=webp&amp;s=ff7d6e1f1e86532b9aeb4679b669b08524dd0cfa"
        },
        "permalink": "/r/realmadrid/comments/1khstb9/look_what_came_in_the_mail_today/"
    },
    {
        "id": "1khlhwp",
        "author": "EffectiveTie3144",
        "title": "OTD may 8-th 2024 Real Madrid beat Bayern Munich 2-1 home after the Joselu' s brace remontada and qualified in the UCL final.",
        "content": "",
        "upvotes": 694,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/e5vthwAZk_pch6jh5p-F-74X98KPh-wVEXOAwFGnFP4.jpeg?auto=webp&amp;s=8007100f2b6cb147ffe3883e519162d9cbd65e0e"
        },
        "permalink": "/r/realmadrid/comments/1khlhwp/otd_may_8th_2024_real_madrid_beat_bayern_munich/"
    },
    {
        "id": "1khqov5",
        "author": "laurifroggy",
        "title": "Camiseta rosa claro de mujer de la tienda oficial 👑 🤍",
        "content": "",
        "upvotes": 245,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1YzAsdPCWweaYl7n9NeN6FzLwN1Uty7x0eIoxZUUuV0.jpeg?auto=webp&amp;s=d30f779cda23045c83ab32dccd5031fb6b650d9d"
        },
        "permalink": "/r/realmadrid/comments/1khqov5/camiseta_rosa_claro_de_mujer_de_la_tienda_oficial/"
    },
    {
        "id": "1khjll2",
        "author": "Miserable-Subject-87",
        "title": "Rodrygo is facing an uncertain future. Güler completes the “overtaking” over the Brazilian, taking advantage of his poor form. With Vini, Mbappé, and Bellingham, his future as a starter is in jeopardy. For the club, a sale is a realistic option.",
        "content": "",
        "upvotes": 542,
        "comments": 180,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/G67Q5Lftep8LLToe73UMNJbyd2Goio_DhdHlKAeV7f8.jpeg?auto=webp&amp;s=e2a2d9de3b723c9462ffb742305709a7f82288a2"
        },
        "permalink": "/r/realmadrid/comments/1khjll2/rodrygo_is_facing_an_uncertain_future_güler/"
    },
    {
        "id": "1khvupg",
        "author": "takeiteasymyfriend",
        "title": "RMTV strategy against Referee Organisation is damaging reputation",
        "content": "I understand Real want changes in the Referee Organisation after Negreira payments but their current strategy seems stupid and damages our reputation.\n\nWhy Real do not ask RMTV to do some real investigation journalism in order to educate fans? Why do they not prepare some serious documentaries about this case?\n\nI would love to know the actual responsibilities of Negreira and if it is true his reports were the basis for promoting and demoting referees.\n\nIf this is true, I would like to know if there are statistical correlations between referees demoted and promoted by Negreira and average points won/ lost by Barça with those referees vs averages.\n\nI would like to know if it is true that Negreira son was acting as referees personal driver in home games in Barcelona and was warning referees about avoiding mistakes that could damage Barça.\n\nWhy Referee organisation has not condenmened those payments?\n\nWhat are the appoinents by Negreira still in management positions or in active Referee?\n\nAre there any retired referees willing to talk about this? Can RMTV find any?\n\nAre two consecutive years without a penalty against Barça in La liga an statistical anomaly? What was the actual chance for that to happen? Has it ever happened before to any club in the world?",
        "upvotes": 71,
        "comments": 38,
        "media": null,
        "permalink": "/r/realmadrid/comments/1khvupg/rmtv_strategy_against_referee_organisation_is/"
    },
    {
        "id": "1kh8fe8",
        "author": "o6ohunter",
        "title": "An Inter fan showing a Vini shirt to Barcelona fans at the San Siro",
        "content": "",
        "upvotes": 2802,
        "comments": 84,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/matij5cqbfze1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kh8fe8/an_inter_fan_showing_a_vini_shirt_to_barcelona/"
    },
    {
        "id": "1khm6ph",
        "author": "dakdakdakp",
        "title": "Real Madrid to treat Militao's recovery as a new signing",
        "content": "Source: Jorge C Picon\n\nMadrid continues to fully trust a defender to reach his best form despite suffering two back to back ACLs in two years. Madrid believes it's a huge boost to the team and will not rule out the CWC for Militao.",
        "upvotes": 239,
        "comments": 115,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EvTzsadd91KvSy96OCDnqE4BS1bFf8DO_yF-QMJ9B88.jpeg?auto=webp&amp;s=ad8564e1bcdc3ac71df15cc4ca7604142a74b39a"
        },
        "permalink": "/r/realmadrid/comments/1khm6ph/real_madrid_to_treat_militaos_recovery_as_a_new/"
    },
    {
        "id": "1khkjk9",
        "author": "Ready_Ad_1353",
        "title": "Trent Alexander-Arnold rejected the offer of a significant pay rise from Liverpool that would have made him one of the best-paid fullbacks in world football.",
        "content": "",
        "upvotes": 210,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EH9wzMD-jHtwWePU7y6vqf5tgsO__R0IZMsoq_o68As.jpeg?auto=webp&amp;s=8ca466188480a970697ea0332e9dd19ef0c1a087"
        },
        "permalink": "/r/realmadrid/comments/1khkjk9/trent_alexanderarnold_rejected_the_offer_of_a/"
    },
    {
        "id": "1khhrdr",
        "author": "Medium_Breadfruit_22",
        "title": "Not signing Dani Huijsen does not make any sense..",
        "content": "He fits the club’s policy to sign young and up and coming players. He’s already a big big player in the premier league which is one of the most difficult/physical in the world, especially as a CB. As expected a host of big clubs have already courted him. Also, dont get why people say “hes unproven”. When you play week in week out for such a good side and get called up for spain and is the starting cb, idk how much more proven you can find at his age. Secondly, the boy is a Madrid fan. He seemingly loves madrid and his fav is our very own Ramos. Finally, his price. I know his release clause of 50m is a bit steep and madrid has refrained for going for high cost players lately but the fact that they dont have to outbid any clubs and the player himself is willing to join makes everything so much more straightforward. I say get the guy in",
        "upvotes": 265,
        "comments": 97,
        "media": null,
        "permalink": "/r/realmadrid/comments/1khhrdr/not_signing_dani_huijsen_does_not_make_any_sense/"
    },
    {
        "id": "1kh4fmw",
        "author": "EndGamerX",
        "title": "Absolute Cinema from RM official TT account",
        "content": "",
        "upvotes": 392,
        "comments": 18,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ihzbqzqxieze1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kh4fmw/absolute_cinema_from_rm_official_tt_account/"
    },
    {
        "id": "1kgyssl",
        "author": "94Temimi",
        "title": "There are those that chase a single title, we won 6 in the past decade. We made look easy, but it's not. And the world never gave this achievement the reverence its due!",
        "content": "",
        "upvotes": 742,
        "comments": 40,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/82yy0zhbddze1.jpeg?auto=webp&amp;s=d679369575321306327df9aa34ddea3142660024"
        },
        "permalink": "/r/realmadrid/comments/1kgyssl/there_are_those_that_chase_a_single_title_we_won/"
    },
    {
        "id": "1khikbb",
        "author": "popularboy17",
        "title": "What Was It Like To Watch The Galacticos Play?",
        "content": "I hear a lot about how the original Galacticos were a “failure” but I also hear that they were a pleasure to watch. Did they play noticeably more beautiful football than other teams at the time? It’s hard to get a good understanding from youtube highlights, I’m interested to hear about your experiences, was it anything like : “even though we lost at least I watched some magical football” ? Or were they simply just not that good?",
        "upvotes": 46,
        "comments": 34,
        "media": null,
        "permalink": "/r/realmadrid/comments/1khikbb/what_was_it_like_to_watch_the_galacticos_play/"
    },
    {
        "id": "1khborr",
        "author": "jelenji",
        "title": "What’s stopping Camavinga from becoming our Joao Neves",
        "content": "Just watched PSG’s midfield put in a masterclass against Arsenal. The exact same Arsenal that dominated us in our 1st leg against them. Vitinha and Fabian Ruiz were wonderful but I truly believe Joao Neves is the heart of success between the 3. \n\nIn my opinion, Cama has a similar game to Neves. Great presser, ball caring, and “destroyer” in the midfield while also having a taller frame and more pace than Neves. Cama is truly amazing to watch on his day, so what exactly is holding him back from taking the next step to becoming a solidified world class CM?",
        "upvotes": 125,
        "comments": 78,
        "media": null,
        "permalink": "/r/realmadrid/comments/1khborr/whats_stopping_camavinga_from_becoming_our_joao/"
    },
    {
        "id": "1kgvbbh",
        "author": "EffectiveTie3144",
        "title": "OTD May 7-th 2006, Zinedine Zidane retired from Club Football at Real Madrid. Zinedine Zidane said goodbye as a player to the Santiago Bernabéu in his last game for Real Madrid.",
        "content": "",
        "upvotes": 915,
        "comments": 21,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kgvbbh/otd_may_7th_2006_zinedine_zidane_retired_from/"
    },
    {
        "id": "1kh301i",
        "author": "TimothyX7",
        "title": "[Jose Felix Diaz] - Real Madrid have INTENSIFIED their interest in Dean Huijsen",
        "content": "",
        "upvotes": 314,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Po1jtJITQ2Fn0xrE4qcwxKSGfZ8mG4gaO5NYlY9h67E.jpg?auto=webp&amp;s=fd01b8df946826db700cf6a36161f19d003ad6cc"
        },
        "permalink": "/r/realmadrid/comments/1kh301i/jose_felix_diaz_real_madrid_have_intensified/"
    },
    {
        "id": "1kh3i7t",
        "author": "Miserable-Subject-87",
        "title": "Joan Martínez gets back on track. The youth team CB, who tore his ACL in August, is now training normally with Arbeloa’s Juvenil A team. The Club World Cup is difficult, but not impossible.",
        "content": "",
        "upvotes": 245,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ULWAr5M-PJBJqlFqOypTj6fK2bb5sauD1JAPXfGiZqo.jpg?auto=webp&amp;s=dc819eeaad6e45891e96fa60708d5326132d8153"
        },
        "permalink": "/r/realmadrid/comments/1kh3i7t/joan_martínez_gets_back_on_track_the_youth_team/"
    },
    {
        "id": "1kgtnoq",
        "author": "Onegoofylad",
        "title": "Just how fast things come back at you…",
        "content": "",
        "upvotes": 878,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6tmtMSzRNAwUae3YLxNomNIjVc10655rXTIfDIctnkY.jpeg?auto=webp&amp;s=38afde5965359d6d3a8881e0d067590f529a9d14"
        },
        "permalink": "/r/realmadrid/comments/1kgtnoq/just_how_fast_things_come_back_at_you/"
    },
    {
        "id": "1kgud48",
        "author": "ColdAd3682",
        "title": "Winning the UCL is a dream few achieve. Winning it back-to-back? Almost impossible — only Real Madrid dared and did it. A three-peat is history, legacy, and heart — not just about one magical season like a treble, but about ruling Europe for years.",
        "content": "",
        "upvotes": 734,
        "comments": 68,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/6m2yib6lbcze1.jpeg?auto=webp&amp;s=0ede40ae1caba92472840538eb0673b00352104e"
        },
        "permalink": "/r/realmadrid/comments/1kgud48/winning_the_ucl_is_a_dream_few_achieve_winning_it/"
    },
    {
        "id": "1kh2ehd",
        "author": "xChristian11x",
        "title": "Annual 2024 magazine came in with poster",
        "content": "Gave the poster a place in the bedroom, feels extra special after yesterday's ucl matchday",
        "upvotes": 197,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5goan7mm4eze1.jpeg?auto=webp&amp;s=5c26f1d334645c39ec1afe446ac1a701eb666e30"
        },
        "permalink": "/r/realmadrid/comments/1kh2ehd/annual_2024_magazine_came_in_with_poster/"
    },
    {
        "id": "1kghq2v",
        "author": "fomdj",
        "title": "The crying has started😂",
        "content": "Bro thought this was laliga",
        "upvotes": 3520,
        "comments": 527,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/tu3df2t3n8ze1.png?auto=webp&amp;s=118a3dad9f03753788502ed94df7cbf61ee9db61"
        },
        "permalink": "/r/realmadrid/comments/1kghq2v/the_crying_has_started/"
    },
    {
        "id": "1kggllf",
        "author": "HisokaZoldycc",
        "title": "Who's a non madrid player that you really admire? I'll go first",
        "content": "also sommer",
        "upvotes": 2777,
        "comments": 308,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ky3l4g1ie8ze1.jpeg?auto=webp&amp;s=a79edd5f4aa394fee313a5d801f5b71eecb11491"
        },
        "permalink": "/r/realmadrid/comments/1kggllf/whos_a_non_madrid_player_that_you_really_admire/"
    },
    {
        "id": "1kh0u88",
        "author": "Puzzleheaded_Pen8520",
        "title": "Paolo Di Canio: \"I can't blame him for this new experience ... it's part of the culture where you can improve\"",
        "content": "Di Canio on Alexander-Arnold joining from Liverpool\n\n",
        "upvotes": 92,
        "comments": 16,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/l77ojsjusdze1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kh0u88/paolo_di_canio_i_cant_blame_him_for_this_new/"
    },
    {
        "id": "1kgh4ii",
        "author": "fomdj",
        "title": "INTER fans are something else man😂😂",
        "content": "THANK YOU SO MUCH FRATTESI😂",
        "upvotes": 2237,
        "comments": 69,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/w1lhexnfi8ze1.png?auto=webp&amp;s=9bac2caf9c905edb1921b5c75fa96b5329c1468e"
        },
        "permalink": "/r/realmadrid/comments/1kgh4ii/inter_fans_are_something_else_man/"
    },
    {
        "id": "1kgguxc",
        "author": "AsColdAsPalmer",
        "title": "Careful there, can’t jinx it too early",
        "content": "",
        "upvotes": 1987,
        "comments": 118,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/6n9mszwgg8ze1.jpeg?auto=webp&amp;s=14e3733c71059bcb41c0e7c3d87410dcf6dca5ba"
        },
        "permalink": "/r/realmadrid/comments/1kgguxc/careful_there_cant_jinx_it_too_early/"
    }
]