[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 492,
        "comments": 258,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1i9lgow",
        "author": "Whobitmyname",
        "title": "‘Pantheon’ Season 2 to Stream For The First Time on Netflix, All 8 Episodes Premiere February 21",
        "content": "",
        "upvotes": 44,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1i9lgow/pantheon_season_2_to_stream_for_the_first_time_on/"
    },
    {
        "id": "1i9gfsp",
        "author": "Witty-Two-343",
        "title": "Anybody know a fix around this ?",
        "content": "",
        "upvotes": 23,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1i9gfsp/anybody_know_a_fix_around_this/"
    },
    {
        "id": "1i9o0y5",
        "author": "Ok-Block5105",
        "title": "The night agent season 2",
        "content": "Highly disappointed tbh, should’ve ended after season 1. Lot’s of bad acting, too many characters, just overall unappealing. Personally Eve Harlow made the whole show.",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1i9o0y5/the_night_agent_season_2/"
    },
    {
        "id": "1i94kc3",
        "author": "mntgoat",
        "title": "Kevin Can F**k Himself",
        "content": "If you have some time to check out a very unique show, please give Kevin Can F**k Himself a chance. \n\nI don't want to spoil it for anyone, I feel it is best to just be surprised by the format.\n\nSmall warning, you must make it past the first scene before giving up. \n\nApologies if this has been posted before but I just haven't seen it mentioned here before. \n\n",
        "upvotes": 95,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1i94kc3/kevin_can_fk_himself/"
    },
    {
        "id": "1i94xib",
        "author": "Honest-Regular-9561",
        "title": "Is the Night Agent actually good man?",
        "content": "I’ve been seeing so much promotion for the new season and it’s starting to intrigue me. I need to know is this show good. Not average because I could watch other stuff if it’s just a regular show. With all the hype is it some of the best when it comes to Netflix shows? The name always threw me off.",
        "upvotes": 75,
        "comments": 106,
        "media": null,
        "permalink": "/r/netflix/comments/1i94xib/is_the_night_agent_actually_good_man/"
    },
    {
        "id": "1i8rjwk",
        "author": "Sweaty-Toe-6211",
        "title": "Netflix has reached an agreement and renewed the Breaking Bad series until April 18, 2027.",
        "content": "",
        "upvotes": 406,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1i8rjwk/netflix_has_reached_an_agreement_and_renewed_the/"
    },
    {
        "id": "1i8muj5",
        "author": "Sudden_Pop_2279",
        "title": "Squid Game Season 3 Is Coming ‘Sooner Than You Expect’ Director Says",
        "content": "",
        "upvotes": 994,
        "comments": 130,
        "media": null,
        "permalink": "/r/netflix/comments/1i8muj5/squid_game_season_3_is_coming_sooner_than_you/"
    },
    {
        "id": "1i9ekkb",
        "author": "Thin_Reward4843",
        "title": "[REQUEST] does anyone know this show?",
        "content": "Recent English language (American) Netflix drama series about a suburban family where someone shows up out of nowhere to a party and won't leave or something. The trailer is a guy at a party and another guy asking him to leave. It's a drama, not a comedy. It was not popular, didn't get a ton of reviews, isn't talked about a lot on Reddit. Every time I try to google it the browser takes me to the stupid app. I saw the trailer at my in laws house. I think it was called the Stranger or the Invitation or the Gift or something but I know those are all other movies or shows. Ugh. Help please! Does not come up when you google any of this. ",
        "upvotes": 10,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i9ekkb/request_does_anyone_know_this_show/"
    },
    {
        "id": "1i9lush",
        "author": "HyperActive1DUK",
        "title": "Is there any way to see movies in my list that have been removed from the platform?",
        "content": "I tried asking Netflix support about this, but the agent didn't seem to understand the question no matter how I worded it, so I thought it might be a better use of my time to ask here.",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i9lush/is_there_any_way_to_see_movies_in_my_list_that/"
    },
    {
        "id": "1i9pxxy",
        "author": "badicaldude22",
        "title": "How to see the \"previously on this show\" recap?",
        "content": "My wife and I have been slow-binging This Is Us (1-2 episodes/night) on Hulu. I recently realized it's also on Netflix and since we already have Netflix and have nothing else to watch on Hulu currently, we're canceling Hulu. But when we switched to watching it on Netflix the 30-second \"previously on This Is Us\" recap no longer plays. It always played on Hulu. When we didn't feel like watching it, it was very easy to skip by pressing the \"forward 10 seconds\" button a couple times, but I found it nice to watch if we took a break from the show or when they brought back characters/storylines from several episodes or seasons back. \n\nI've clicked through the settings and can't find a way to get it to play. I also searched on this sub. In one post from 3 years ago someone said \"it's in trailers and more at the bottom of the episode list.\" I scrolled to the bottom of the episode list and there is nothing that says trailers and more. In another post from a year ago, someone said to toggle the \"watch from the beginning\" setting. I couldn't find that setting, and furthermore, when I googled how to find it, I found several other posts about it that said the actual function of that setting is (was?) to reset your watch history on a show so that it starts from the first episode of the first season again. That's not what I want to do.\n\nIf there is a setting that works in 2025 to cause the recap to play at the beginning of each episode let me know",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i9pxxy/how_to_see_the_previously_on_this_show_recap/"
    },
    {
        "id": "1i9o0kq",
        "author": "Practical-Creme-6025",
        "title": "Netflix hikes prices in the US, Croatia and Egypt",
        "content": "Price changes are as follows:\n\nUnited States \n\n- Standard with ads - $7.99 (up from $6.99)\n- Standard - $17.99 (up from $15.49)\n- Premium - $24.99 (up from $22.99)\n\nCroatia \n\n- Basic - €5.99 (up from €4.99)\n- Standard - €9.99 (up from €7.99)\n- Premium - €12.99 (up from €9.99)\n\n*No ad-supported plans available in Croatia\n\nEgypt \n\n- Basic - $1.99 (up from $1.39)\n- Standard - $3.39 (up from $2.39)\n- Premium - $3.99 (up from $3.29)\n\n*No ad-supported plans available in Egypt\n\nArgentina \n\n- Basic - $5.79 (up from $3.99)\n- Standard - $9.59 (up from $6.89)\n- Premium - $12.99 (up from $9.29)\n\n*No ad-supported plans available in Egypt\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i9o0kq/netflix_hikes_prices_in_the_us_croatia_and_egypt/"
    },
    {
        "id": "1i9k9wx",
        "author": "North_Drummer2034",
        "title": "Tell Me Who I Am",
        "content": "I watched this last night at work and I’m confused about all the hate towards the brother after reading some other reviews. I feel like if I was Alex, I wouldn’t want to know. I don’t understand the whole “you kept this from me and it’s the ultimate betrayal” thing. What is the point of telling someone about trauma and abuse that they went through if they would’ve never remembered it. I think Marcus was right for trying to protect his brother. What do you guys think? I feel like I’m alone in this opinion ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i9k9wx/tell_me_who_i_am/"
    },
    {
        "id": "1i8x25x",
        "author": "LauraEats",
        "title": "'Squid Game' Topped the 2024 Single-Week Charts with 4.9 Billion Minutes Watched",
        "content": "",
        "upvotes": 55,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i8x25x/squid_game_topped_the_2024_singleweek_charts_with/"
    },
    {
        "id": "1i9fai4",
        "author": "kukov",
        "title": "Terrible desktop streaming quality (even with Win 11 app) causes me to use alternate options",
        "content": "I was excited to watch EMILIA PEREZ tonight and resubbed to Netflix for the first time in a while. \n\nI only watch things on my PC Desktop (high-end machine, fiber connection). For years I was able to get a great bitrate (8+ Mbps) by using their Win 11 desktop app. I seemed to recall they'd lowered their computer-streaming bitrate recently so I chose to get the most expensive plan, thinking maybe if I opted for the 4k version it would give me a higher bitrate while streaming to PC. It did not. \n\nEMILIA PEREZ came through at 2.5Mbps. \n\n(insert grey death suffering meme guy). \n\nI gave it 25 mins of low-bitrate nonsense before I fired up \\[an alternate viewing option\\]. I'm writing this as I wait the 15 mins for it to download.\n\nI'm still happy to give Netflix my money for the month. I *want* to pay them for content that I want to watch. I want that content to get my views. But for some reason Netflix decided to *regress* in quality (I believe this bitrate downgrade came right around COVID, similar to Google removing the ability to play owned movies on YouTube.) At least we'll always have Apple - supporting 21:9 monitor-owners since 2010. \n\nI'm not going to ask: \"Why do they do this?\". I know. You know. It's because we don't matter, and they don't care. The amount of people who watch Netflix exclusively on PCs is probably 0.0001% of their user base and we're not worth catering to. That makes sense. I just wish they figured out some way for their service to be able to feed us a higher bitrate stream of their content. I get that people who own TVs probably don't notice or care about bitrate, but computer-streaming people would. ",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1i9fai4/terrible_desktop_streaming_quality_even_with_win/"
    },
    {
        "id": "1i9gdbu",
        "author": "megs21111",
        "title": "Cant use netflix on my other phone",
        "content": "Does anybody else have the same problem? I already paid netflix for 2 devices but unfortunately its only working on one device everytime i try to sign in on my other phone its says wrong password but its the right password and its working normally in my other phone , why??? How to fix this? Its so annoying i want to watch with my other phone! Netflix is greedy or sumething?\n\n",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i9gdbu/cant_use_netflix_on_my_other_phone/"
    },
    {
        "id": "1i9ouju",
        "author": "mushtymen",
        "title": "Outerbanls Kiara hate",
        "content": "I love Sarah with all my heart but the way people are just brushing off how she cheated on Topper with John B then decided to cheat on John B with Topper. Like I wouldn't mind people ignoring it but when they go off about how they hate Kie cause she was dismissing her and Pope's relation it gets a bit much",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i9ouju/outerbanls_kiara_hate/"
    },
    {
        "id": "1i9hm99",
        "author": "Potty-",
        "title": "Saturday Morning All Star Hits - What Do You Think?",
        "content": "This sketch series from Netflix, Saturday Morning All Star Hits, is somehow way better than The Who Was Show, a show which I think ripped off Horrible Histories. How about you? What do you think of Saturday Morning All Star Hits?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i9hm99/saturday_morning_all_star_hits_what_do_you_think/"
    },
    {
        "id": "1i9bo05",
        "author": "verxram",
        "title": "Help-Some contents won't show in other profiles",
        "content": "The netflix account  is from my wife. We're from the philippines. After we visit hongkong and macau, my wife noticed that some content are not showing up like the Apothecary Diaries after we visit those places. However, for my profile, the series is shown and i can watch it. Btw, she used esim while i used a physical sim for internet. How to troubleshoot this issue on my wife's profile? thanks",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i9bo05/helpsome_contents_wont_show_in_other_profiles/"
    },
    {
        "id": "1i92at2",
        "author": "can-i-get-a-heya",
        "title": "Bring back Lovesick worldwide",
        "content": "This is for anyone else who’s upset that Netflix has decided to remove Lovesick (formerly known as Scrotal Recall) from Netflix worldwide. I’ve made a petition to bring it back as it’s the only place where it’s possible to watch all 3 seasons.\n\nPlease sign it if you either love the show as well or know what it’s like to have your favorite/comfort show removed by streaming services! 😩\n\nSign, share and confirm - thankssss 😘🫶🏻",
        "upvotes": 16,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1i92at2/bring_back_lovesick_worldwide/"
    },
    {
        "id": "1i9ig2q",
        "author": "Badadadadad2",
        "title": "Blackspace",
        "content": "I recently started the Israeli series Blackspace on Netflix and quickly finished season 1. It appeared to end on a cliffhanger with no season 2. Google says that season 2 came out in 2024 and is on Netflix but I can’t find it. I specified that I live in the US but it gave me the same answers. I haven’t been able to find any further information. Does anyone know where to find season 2?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i9ig2q/blackspace/"
    },
    {
        "id": "1i90h6o",
        "author": "whokeshav",
        "title": "Finished watching The Night Agent Season 2",
        "content": "I believe the season 1 story line is way better than season 2 though they introduced lot of characters in new season but the thriller is missing I didn’t liked the Catherine’s character, Alice was way better overall watch is worth it’s Peter’s character which is keeping the whole storyline alive. ",
        "upvotes": 17,
        "comments": 91,
        "media": null,
        "permalink": "/r/netflix/comments/1i90h6o/finished_watching_the_night_agent_season_2/"
    },
    {
        "id": "1i9heto",
        "author": "JHarr121212_",
        "title": "Night Agent S2E9- Rose’s BAD clip on bangs",
        "content": "Did anyone else notice how egregiously bad Rose’s clip on bangs looked in the flashback at the beginning of season 2, episode 9? I was cringing. You could literally see her hairline under the bangs and where they were clipped in on top of her head. Who approved that??? 😂",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i9heto/night_agent_s2e9_roses_bad_clip_on_bangs/"
    },
    {
        "id": "1i9g0vy",
        "author": "Sunstar823",
        "title": "My kid was watching and clicked to go to the ad free plan without realizing it, I changed it back 30 minutes later after getting an email notifying me of the plan upgrade. Will I be charged extra and how can I prevent my kid from accidentally upgrading my account in the future?",
        "content": "I'm surprised my kid was even able to approve that, that should be something that only the parental accounts can do, either way I'm just wondering if I'm going to be charged for being on the premium plan for 30 minutes and how I can prevent this in the future, I didn't see any toggles in my account settings. Thanks! ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i9g0vy/my_kid_was_watching_and_clicked_to_go_to_the_ad/"
    },
    {
        "id": "1i9bzhb",
        "author": "cardboardboxbro",
        "title": "Recommendations for a Show/Documentary on Cartels from Mexico or Colombia?",
        "content": "Anywhere on Netflix and or anywhere else!\n\nId appreciate some recommendations\nI already have watched the main ones like narcos and the pablo escobar one on Netflix",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i9bzhb/recommendations_for_a_showdocumentary_on_cartels/"
    },
    {
        "id": "1i8zl1x",
        "author": "hootsuite",
        "title": "Netflix’s Squid Game Season 2 Premiere Dominated Social Media",
        "content": "Netflix shows fueled social media conversations in 2024, according to Hootsuite’s Social Listening data 🦉\n\n*Squid Game* Season 2, which premiered in December, led the pack with a massive **36.5 million interactions**, making it the most talked-about show on social media 🦑\n\nNetflix continued its reign, with *Bridgerton* and *Outer Banks* securing the second and third spots, while HBO’s *House of the Dragon* landed at number four. Overall, **Netflix claimed 6 of the top 10 most buzzed-about shows** of the year.\n\n📺 Curious to see the full list? Read more [here](https://blog.hootsuite.com/best-tv-shows/?utm_campaign=reddit_content_2025&amp;utm_medium=organic_social&amp;utm_source=reddit)!\n\nhttps://preview.redd.it/jcmb70oyyyee1.png?width=1500&amp;format=png&amp;auto=webp&amp;s=9f0eba43c4b7dbb4ac0e7564cc725fb606537d3f\n\n",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i8zl1x/netflixs_squid_game_season_2_premiere_dominated/"
    },
    {
        "id": "1i9ng3z",
        "author": "ClutterFixed",
        "title": "Netflix has dropped quality too far!",
        "content": "Let me start by saying, I've been using this service for around 10 years, so this is from bitter experience.\n\nI'm using Netflix on a 4k HDR 2021 Samsung tv, on the Netflix app, from a wired cat. 6 connection to a 1000/1000 fiber line with very low latency. I have also tested from a 4K Google TV and several phones, Android and iOS, the results are very similar. Poor picture quality. I have also tested different connection types from different locations,\n\nOver the past five years i have noticed a very steep decline in quality, especially on older titles and titles that \"aren't hot\". I know why, it's the amount of data, both sending, receiving and storing. It's expensive, and thats why I was willing to pay almost 40 dollars monthly.\n\nI am on the 4k package, I'm paying through my teeth for a crisp image, and they deliver this gritty, lumpy, pixelated picture on my devices? \n\nNetflix should take a look at why, besides volume of content, people keep using the service.\n\nThey should use qualified people to check the algorithmic content they're spewing out, and have better standards for picture quality. \nThis is unacceptable!\n\nI don't even have to share a picture, you can just check for yourself.\n\nEdit:\nEdited to remove a part I wrote about poor quality of content because it took focus away from my main point. Which is the steep decline in picture quality, especially on older movies and shows on their service.",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1i9ng3z/netflix_has_dropped_quality_too_far/"
    },
    {
        "id": "1i9ayco",
        "author": "XHimeYume",
        "title": "Playback speed ANY CHANGES from 2025-2026 ??",
        "content": "Anyone have any news if they plan on increasing the speed on playback ? if its going to stay 1.5x while other platform is offering 2x and 3-4x ... im thinking to unsubscribe as i realised i using it less and less, normally i go in, watch some episode then change website to watch further as they talked to slowly for me...\n\nbeen using it for years and so far i love it on the profile, on the suggestions and list, and how it continues off whenever you left off that is what i love the best. but the slow talking is getting on my nerves and i lose concentration cant stay and focus on the show... end up dropping it or switching to another platform because i will want to know what happens. or it gets too slow and i say i comeback next time i throw it in the lazy watch bin....\n\nbeen using it for i think since it started in Singapore.. and my plan is the max plan now with +2 user extended (i have to msg people too waste time to keep track on payment or i pay for everyone...) so if not worth my time anymore i thinking if i should just one less thing to do and pay..",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i9ayco/playback_speed_any_changes_from_20252026/"
    },
    {
        "id": "1i9atje",
        "author": "jay_jay_dee",
        "title": "Need help swapping “profiles” on two linked accounts with 2 different email addresses",
        "content": "Hey guys, I’m new to Reddit and I don’t know if I’m completely phrasing this question right but I’m hoping I can find an answer. Basically I have one primary account thats under my “sisters email”. Under that email, is three profiles, mine, my brother-in-law‘s, and my nieces.\n\nThe secondary account, which is under my email, is the additional account so it is limited to only “one profile”. And the profile attached to that account is my sisters.\n\nSo basically the issue is I need to swap the profile assigned under my sister’s email address (the main account) with my profile on the secondary account.\n\nI called up Netflix and they said there was no way to do this, but I just don’t buy that as an answer. If anyone has any advice or input at all, it would be greatly appreciated. Thank you!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i9atje/need_help_swapping_profiles_on_two_linked/"
    },
    {
        "id": "1i9aj2q",
        "author": "davkistner",
        "title": "The Old Guard 2 - something that doesn’t make sense to me (and other thoughts)",
        "content": "So I know Charlize Theron herself said (and I think I heard it from others I concede in the project as well) that a major reason for the delay is that Netflix leadership changed and blah blah blah. The longer this delay continues, the more I think that’s bullshit. I dno what the real issue is, but if that’s what happened, how come it didn’t affect any other Netflix shows/movies? Everything else seems to be relatively on track. \n\nAlso, the last I heard was that the movie was possibly being moved to 2026 now! Im not sure how legit that is though. If it is, what is the issue? At this rate, I’m betting they won’t be making any more after this one finally releases. IF it releases. I’m starting to doubt we will ever get it at this point.\n\nLastly, I was super surprised that the sub for this movie has less than 700 followers. I was going to post there, but that sub is not very active. \n\nSo my questions to all of you:\n\nDo you think the change in leadership was the actual issue? I know there were multiple issues, but, other than the strikes, this seems to be the one that they cite specifically as delaying them. \n\nDoes anybody have any concrete information on a possible release date? Is it really possibly going to 2026? 😭😭",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i9aj2q/the_old_guard_2_something_that_doesnt_make_sense/"
    },
    {
        "id": "1i8xrbi",
        "author": "Herazim",
        "title": "Extra member help needed",
        "content": "I'm not sure what happened, I have a Netflix account with 3 profiles. One of them was made into an extra member a year ago for a SmartTV in another location.\n\nStarting 2 days ago the app keeps asking for a SMS verification, the profile isn't an extra member anymore and the slot is empty. How do I restore this and why did this happen ? I don't want to make an extra Netflix account, can't I use the other profile like I did for the past year ?",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i8xrbi/extra_member_help_needed/"
    }
]