[
    {
        "id": "1qb0tcv",
        "author": "creel_515",
        "title": "Comunicado Oficial: Xabi Alonso",
        "content": "",
        "upvotes": 1067,
        "comments": 1121,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JCimpryegy-WEiZaUulyoOkKN9ghk7CFwwDUqe0Anzg.jpeg?auto=webp&amp;s=16bb327fad782c4fef76561cb6511176a3160a11"
        },
        "permalink": "/r/realmadrid/comments/1qb0tcv/comunicado_oficial_xabi_alonso/"
    },
    {
        "id": "1qb105e",
        "author": "creel_515",
        "title": "Comunicado Oficial: Álvaro Arbeloa",
        "content": "",
        "upvotes": 290,
        "comments": 323,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JCimpryegy-WEiZaUulyoOkKN9ghk7CFwwDUqe0Anzg.jpeg?auto=webp&amp;s=16bb327fad782c4fef76561cb6511176a3160a11"
        },
        "permalink": "/r/realmadrid/comments/1qb105e/comunicado_oficial_álvaro_arbeloa/"
    },
    {
        "id": "1qbkda1",
        "author": "nocturnal_brownie",
        "title": "Xabi Alonso is genuinely one of the kindest and most humble person in football. It wasn’t supposed to end like this..",
        "content": "",
        "upvotes": 327,
        "comments": 33,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/yqoa6r49c2dg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qbkda1/xabi_alonso_is_genuinely_one_of_the_kindest_and/"
    },
    {
        "id": "1qbkzn4",
        "author": "andy111999",
        "title": "Fabrizio Romano :- Xabi Alonso told the club today:\"You CAN'T give the players this much power.\" \"It's IMPOSSIBLE for a coach to rule in a dressing room if the club is always taking the players' side.\"",
        "content": "",
        "upvotes": 293,
        "comments": 66,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qbkzn4/fabrizio_romano_xabi_alonso_told_the_club/"
    },
    {
        "id": "1qbabvj",
        "author": "dark4403",
        "title": "The greeting between Florentino Pérez and Xabi Alonso after losing the Super Cup. Florentino’s face says it all.",
        "content": "",
        "upvotes": 1143,
        "comments": 161,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/znzha6di10dg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qbabvj/the_greeting_between_florentino_pérez_and_xabi/"
    },
    {
        "id": "1qb4v7f",
        "author": "No-Independent2522",
        "title": "Arda Guler on Instagram",
        "content": "",
        "upvotes": 2054,
        "comments": 125,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9016aw5d1zcg1.jpeg?auto=webp&amp;s=8ee2657a8a28f5df3149269bc76c48da625c715b"
        },
        "permalink": "/r/realmadrid/comments/1qb4v7f/arda_guler_on_instagram/"
    },
    {
        "id": "1qbeh0c",
        "author": "NickSsS10",
        "title": "In 8 months, Xabi had a single RM post on his social media account.",
        "content": "The man focused on his job. No PR merchant, no social media drama. I respect this man a lot.\n\nI feel second hand betrayal today. He was supposed to have the time and transfers he needs. Instead he found himself in a scapegoat position for egoes and management issues. \n\nI hope he succeeds in his career! Gentlemen character and sure a great coach.",
        "upvotes": 393,
        "comments": 59,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/94vdy6jsw0dg1.png?auto=webp&amp;s=c7e0d3cef1ddf350a7a3ad3e1e3d36c679097d50"
        },
        "permalink": "/r/realmadrid/comments/1qbeh0c/in_8_months_xabi_had_a_single_rm_post_on_his/"
    },
    {
        "id": "1qb41k1",
        "author": "No-Independent2522",
        "title": "Brahim coming back from AFCON (hopefully with the trophy)",
        "content": "",
        "upvotes": 1319,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/c01fc4k4wycg1.jpeg?auto=webp&amp;s=2b5872495de4b6416692b590510c468b977c93df"
        },
        "permalink": "/r/realmadrid/comments/1qb41k1/brahim_coming_back_from_afcon_hopefully_with_the/"
    },
    {
        "id": "1qb4l8g",
        "author": "cyrusmancub",
        "title": "Mbappe on IG, thanking Xabi",
        "content": "",
        "upvotes": 1093,
        "comments": 325,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/lrl9cgvlzycg1.jpeg?auto=webp&amp;s=904b32359fddc082ae50bd6716630e86e0b174da"
        },
        "permalink": "/r/realmadrid/comments/1qb4l8g/mbappe_on_ig_thanking_xabi/"
    },
    {
        "id": "1qbcfcv",
        "author": "RealMood8898",
        "title": "Unacceptable from Mbappe",
        "content": "Look at this other angle of the altercation between Mbappe and Xavi the way he waves him off with his hand and talks back of him it’s pathetic especially from a player who has won the least here compared to most. Not even vini talked back like this to Xabi,  Mbappe is a problem for this club but nobody will admit it. ",
        "upvotes": 378,
        "comments": 136,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zb5jpioug0dg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qbcfcv/unacceptable_from_mbappe/"
    },
    {
        "id": "1qb7lav",
        "author": "Top_Bread_4595",
        "title": "Real Madrid players bidding farewell to Xabi Alonso with emotional words! Stop this nonsense… you are the reason for his dismissal.",
        "content": "\nHonestly, I can’t stand this hypocrisy. The same players who rejected his playing style and training methods, rebelled against his management approach, and caused his sacking. The same players who refused to listen to him last night in front of the cameras, when he asked them to respect the opposing team, and they shamefully ignored him and turned their backs on him — especially Mbappé, who was telling his friends not to listen to him and to head straight to the dressing room.\nI firmly believe that this particular scene was the straw that broke the camel’s back and led to his dismissal, because it clearly showed how isolated Xabi had become and how he had lost control over his players, who refused to obey his instructions from the very first moment.\nSo I say to the players: stop acting. You are the ones who disrespected him and caused his sacking.",
        "upvotes": 571,
        "comments": 174,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qb7lav/real_madrid_players_bidding_farewell_to_xabi/"
    },
    {
        "id": "1qb2nsf",
        "author": "cyrusmancub",
        "title": "Practically no one at Real Madrid knew about Xabi Alonso’s exit. The majority, including the players, learned from the club’s official statement.",
        "content": "",
        "upvotes": 841,
        "comments": 170,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qb2nsf/practically_no_one_at_real_madrid_knew_about_xabi/"
    },
    {
        "id": "1qb26l1",
        "author": "No-Independent2522",
        "title": "Fabrizio Romano : \"All Xabi Alonso wanted was to transfer his style from Bayer Leverkusen to Real Madrid, but that didn't work out. So, he personally requested to leave because his style didn't receive a warm welcome inside the dressing room.\"",
        "content": "",
        "upvotes": 817,
        "comments": 267,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bnLpo3PgscWRT6U66yoZEn3W82yXau7oLV2i46_ahHo.jpeg?auto=webp&amp;s=6816479ec5ac4603052a174948640dcc35104b9f"
        },
        "permalink": "/r/realmadrid/comments/1qb26l1/fabrizio_romano_all_xabi_alonso_wanted_was_to/"
    },
    {
        "id": "1qb8fop",
        "author": "KucoTheKing",
        "title": "Perez will TRY to sign Jurgen Klopp 🚨",
        "content": "",
        "upvotes": 235,
        "comments": 140,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/c89efexrozcg1.jpeg?auto=webp&amp;s=f7b03d8ac886777c88c6ed2272abd8cf7dc1c5bd"
        },
        "permalink": "/r/realmadrid/comments/1qb8fop/perez_will_try_to_sign_jurgen_klopp/"
    },
    {
        "id": "1qaso6g",
        "author": "carlospum",
        "title": "Florentino should allow this attitudes... We were the \"club señor\" this is not acceptable",
        "content": "This is not the real Madrid I know... This behavior is what other teams do, not my team, not Real Madrid\n\nI though mbappe was not like this... I hope someone explains him what is our club really and how we behave historically\n\nThis is the behavior Neymar, Pique, Jordi Alba etc always had. Wtf is wrong with the team???",
        "upvotes": 1478,
        "comments": 429,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2yeo6wounwcg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qaso6g/florentino_should_allow_this_attitudes_we_were/"
    },
    {
        "id": "1qbenqc",
        "author": "Invhinsical",
        "title": "Yet Another Club Legend Disrespected... What Else is New? It Must Not Be Ignored That Xabi Has Been Disrespected From His First Day As Manager",
        "content": "Xabi performed a miracle at Bayer Leverkusen. Even if Bundesliga is a 'easy' league, just look at where Leverkusen were before him, where they are now, and how much they dominated Bayern Munich while he was here.\n\nReal Madrid asked him to manage the club because of that miracle... But then they fucking disallowed him to do anything which he did at Leverkusen. He had to abandon his 343 high-press possession style. He had to abandon any hopes of getting anything but token effort from his forwards. Wirtz pressed like a madman. He lost the luxury of subbing off these lazy forwards even when he intended to close off the match. \n\nHe never said anything wrong in public. He handled the Vini tantrum with maximum grace. Lesser managers have completely relegated better players to the u21 team for lesser offense. He stood 100% behind his players and hell, his employer, when Flo made extremely aggressive comments on Negreia and Barca.\n\nHe had Xhaka to orchestrate everything at Leverkusen. Real didn't have anyone to make play from the deep. How many years it has been since Kroos has been unreplaced? Is there any serious club which has ever won anything without a creative central midfielder with a great passing range? Xabi had to ask Arda or Jude to play that role, and Arda didn't have the required defensive game and Jude the required passing game. If Trent was the Kroos replacement than Alonso barely got to field him in the eleven.\n\nHis team's performance on the pitch was acceptable as a new manager, despite everything.\n\nFinally, the only thing he demanded yesterday from the club after losing to a better football side on the day was a bit of class. Ignoring everything else, they were the better team on the pitch yesterday and there was no harm in performing the guard of honour for them, especially as the manager clearly asked the set of players to. Publicly opposing your manager on such a small issue is no good. Maybe Mbappe lead the team on that, but no one went against Mbappe. Just goes to show what is happening in that dressing room. \n\nWhat was Xabi to do after that? He is a club legend, and a very young manager. His stock hasn't plummeted at Real Madrid and he still has heavy demand elsewhere.\n\nWhat makes you think Arbeloa will be treated any better? He is the same age profile and probably worse when it comes to top level experience. He is no Zidane in terms of gravitas as far as his playing career goes. If Xabi's playing career earned him no respect as the manager, Arbeloa might earn even less respect. \n\nAre the only managers who survive in this club yes men and extremely lenient motivators? Had Real Madrid not managed to attract Courtois despite the 2 years he spent at Atleti (which was only possible because Courtois himself isn't a good person, just ask KDB) and had a different keeper, will they actually have been nearly as successful in all competitions? The amount of insane saves he makes is elite, and more importantly, the amount of mistakes he makes is in a different realm even when compared to someone like Donnarumma or Alisson. How much has the sheer quality of players like Courtois, prime Rudiger, Modric, Kroos, Ronaldo and Benzema carried the club over the years? That team would have won a lot despite the manager.\n\nXabi didn't have any player with the attitude of Modric but he had at least 8 players with an unsolicited ego. Most of them had no respect for him. Maybe because he was a disciplinarian when he came here and these players don't believe that they need discipline? Because he has always been classy and these players are allergic to class? \n\nJust how does Arbeloa deal with all this now?",
        "upvotes": 97,
        "comments": 45,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qbenqc/yet_another_club_legend_disrespected_what_else_is/"
    },
    {
        "id": "1qb28hw",
        "author": "EfficientCurrency582",
        "title": "Is that video the reason Xabi left?",
        "content": "There is a [video ](https://x.com/TeaKupps/status/2010730879505874960?s=20)circulating online from yesterday where Xabi calls his players to line up for a guard of honour, and Mbappé pulls the players back and puts himself above the authority of the coach. Do you think this might be the reason why Xabi eventually decided to leave the club because he was surrounded by ego players who didn´t respect him?",
        "upvotes": 414,
        "comments": 128,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qb28hw/is_that_video_the_reason_xabi_left/"
    },
    {
        "id": "1qb6hus",
        "author": "No-Independent2522",
        "title": "Rodrygo and Courtois on IG",
        "content": "Rodrygo on IG: \n\n“Mister, thank you for every day we spent together, for the trust, the learning, and the moments of shared experience.\n\nI wish you great success on your future, and that your journey continues to grow.\n\nI wish you all the best always.🤍”\n\nThibaut Courtois on IG: \n\n“Thank you so much for everything, Xabi.\n\nIt has been a great pleasure working with you, and I wish you all the success in the future. You deserve it.”",
        "upvotes": 229,
        "comments": 28,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qb6hus/rodrygo_and_courtois_on_ig/"
    },
    {
        "id": "1qbl4tr",
        "author": "NegotiationRough1451",
        "title": "Xabi Alonso is the permanent Real Madrid manager with the 5th shortest spell at the club in the 21st century, despite having the 4th highest points-per-game during the same period Was it really the right decision to sack Alonso? 🤔",
        "content": "",
        "upvotes": 34,
        "comments": 16,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qbl4tr/xabi_alonso_is_the_permanent_real_madrid_manager/"
    },
    {
        "id": "1qb2ezq",
        "author": "o6ohunter",
        "title": "Why am I not seeing the same hate campaign for Mbappé for going against Xabi?",
        "content": "When Vini was subbed out the Clasico and gave his infamous reaction, he was berated and chewed by the fanbase. He didn’t refuse the substitution, he simply expressed how upset he was with it, and rightfully so considering how well he was playing that match. Now, we see Mbappé blatantly go against the manager’s wishes and it’s just crickets. Since he’s our top scorer it’s ok. The double standard needs to be addressed. Being a pivotal or big player doesn’t give you right to walk around like you’re above it all. That goes for every player.",
        "upvotes": 347,
        "comments": 200,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qb2ezq/why_am_i_not_seeing_the_same_hate_campaign_for/"
    },
    {
        "id": "1qatcme",
        "author": "o6ohunter",
        "title": "The duel between Lamine Yamal and Kylian Mbappé",
        "content": "",
        "upvotes": 953,
        "comments": 105,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/pqzz862cuwcg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qatcme/the_duel_between_lamine_yamal_and_kylian_mbappé/"
    },
    {
        "id": "1qb9l9d",
        "author": "Ill-Improvement-8670",
        "title": "Real Madrid manager win record under Perez. Wow Carlo, he was not the problem and it shows",
        "content": "",
        "upvotes": 142,
        "comments": 40,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/19c6scckwzcg1.jpeg?auto=webp&amp;s=2febee37a357985deffaa5e4730206b700406d33"
        },
        "permalink": "/r/realmadrid/comments/1qb9l9d/real_madrid_manager_win_record_under_perez_wow/"
    },
    {
        "id": "1qb744c",
        "author": "Mastermind_737",
        "title": "Et tu brute... Smh, but maybe Zizou on a short term? 🧐 If not why sack Xabi?",
        "content": "Can't wait till Rudiger and Alaba finally leave, so we get 36 million euros salary freed up. And we can bring in some quality depth to the defense and never see Tchouameni playing down there ever again. Xabi deserved to get to that second season and fulfill his vision, but the injury situation has been horrible and the players haven't helped either.\n\nThe dream now would be to see a short term deal with Zidane coming in and just doing his magic. It would be good for him to familiarize hands on with the french players and also get back to coaching after half a decade away. And if he wants to coach the french team once Deschamps leaves, he should have a gentleman agreement to allow that. And Zidane is only 53 with the opportunity to sign some top defenders next season, so maybe he decides to stay. He's been in the scene quite a bit recently attending the NFL game at the Bernabéu and greeting Florentino Pérez, so idk. The only manager better than Alonso is Zizou, so why sack if you have none better, unless Zizou is a possibility.\n\nAnd Arbeloa should keep coaching the Castilla side and is wasted being the Madrid coach because he doesn't have the reputation which has a big influence in terms of managing players. And Castilla is looking good with him there which is what we want with our youth products and promotion isn't a far reach compared to previous seasons. Hopefully the situation is resolved quick.",
        "upvotes": 176,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/co8u3gk0gzcg1.jpeg?auto=webp&amp;s=70dae2ae8e7b54f55d93661e4b773714dfbdd261"
        },
        "permalink": "/r/realmadrid/comments/1qb744c/et_tu_brute_smh_but_maybe_zizou_on_a_short_term/"
    },
    {
        "id": "1qb3jwb",
        "author": "i_likeorangecats",
        "title": "Why is every post that criticizes the board or Pérez taken down?",
        "content": "What’s the point of having this sub for discussion then? I genuinely don’t get it. Even the mildest posts don’t survive a minute right now. Mod team, if you love the club, let people talk about what they want, there’s no harm in civil discussion. We’re not living in the Middle Ages. We all love this club and are trying to figure out what’s wrong.",
        "upvotes": 227,
        "comments": 52,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qb3jwb/why_is_every_post_that_criticizes_the_board_or/"
    },
    {
        "id": "1qav6ur",
        "author": "dark4403",
        "title": "You played your heart out, thank you Vini",
        "content": "",
        "upvotes": 572,
        "comments": 87,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/09n9283j8xcg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qav6ur/you_played_your_heart_out_thank_you_vini/"
    },
    {
        "id": "1qbgnlo",
        "author": "Deep_Agent316",
        "title": "What the last 16 Years of Real Madrid Managers has taught me",
        "content": "Not sure how anyone here who has been a fan of Real Madrid are surprised by what is going on. Lets go on a brief review of Real's recent managerial history.\n\n1. Jose Mourinho played his 4-2-3-1 for years, falling short of the goal post. After 3 years, 1 La Liga, 1 Copa, and 3 UCL Semi exits. He was replaced.\n2. Carlo replaced Mourinho and shifted to a 4-3-3 and found success immediately winning a UCL. His second season was trophyless and he left the club.\n3. Rafa Benitez followed Carlo and tried to implement the 4-2-3-1 again. His stint was 7 Months.\n4. Zidane followed Benitez. Put the team back in a 4-3-3 and we all know how that went(3 UCLs).\n5. Lopetegui arrived after the depature of CR7. He actually kept playing the 4-3-3, but ultimately clashed because he had his own ideas that didn't match the clubs. He lasted 4 Months.\n6. Santiago Solari was a caretaker manager after Lopetegui's dismissal. Won't criticize much here but he played a handful of different formations and tactics in a season that ended in an embarrassing UCL exit to Ajax.\n7. Zidane returns, business as usual in the 4-3-3. Although this stint ended after 2 years and 2 titles due to a trophyless 2nd season.\n8. Carlo returns again for a 2nd trophy filled stint. He played the 4-3-3 as always.\n9. Enter Xabi Alonso. Whose plan is to bring his style from Leverkusen and implement it at Real\n\nWhat did I learn from these managers over these years?\n\n1. No matter who you are, Real Madrid will part ways with a manager who is not doing well. Carlo Ancelotti came to Real, won immediately in his first season. Had a poor 2nd season and was OUT. Zidane in his second stint was allowed to finish the season (he won 3 UCLs in a row in his first tenure). Before he and the club \"mutually\" parted ways. But parted ways nonetheless. Mourinho was given 3 years, in which he won 3 trophies, with 3 UCL semifinal exits.\n2. Real Madrid are not looking for a coach. When you look at the history I listed above. The managers who did the least tactically, had the most success. This is important to me because it seems like Xabi came to Madrid to teach the players how to play his style of football. This created clashes. This squad is highly decorated, and Xabi is trying to teach them how to play a new brand of football when they already have/had a winning formula. At least in their minds.\n\nTl;DR Xabi Alonso's tactics will work at a smaller club where he has full control. Or it can work at a big club if he is given years to implement his style like Jurgen Klopp had at Liverpool. Xabi Alonso's style is not the right fit for Madrid's win immediately mentality. And this should be no surprise to anyone.",
        "upvotes": 44,
        "comments": 34,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qbgnlo/what_the_last_16_years_of_real_madrid_managers/"
    },
    {
        "id": "1qb54tq",
        "author": "No-Independent2522",
        "title": "Tchouameni and Huijsen on Insta",
        "content": "",
        "upvotes": 173,
        "comments": 26,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qb54tq/tchouameni_and_huijsen_on_insta/"
    },
    {
        "id": "1qbamyn",
        "author": "dark4403",
        "title": "Álvaro Arbeloa: \"And this is Real Madrid, when everyone counts us out as dead, we come back and win the Champions.\"\n\nGood luck, Spartan 🤍",
        "content": "",
        "upvotes": 91,
        "comments": 7,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/x735gsyv30dg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qbamyn/álvaro_arbeloa_and_this_is_real_madrid_when/"
    },
    {
        "id": "1qarb5g",
        "author": "sadiq10mb",
        "title": "Why Xabi Alonso is not respected by our players?",
        "content": "Squad need to follow command from coach, right? But how come manager of the biggest club in the world get neglected like this. Why can't board give more authority to the manager. I don't imagine any player reacting like what Vini did when Zidane was our coach. \nBy limiting the power for the manager, I think the board is digging the grave for us.",
        "upvotes": 973,
        "comments": 315,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/n8ot0qnr9wcg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qarb5g/why_xabi_alonso_is_not_respected_by_our_players/"
    },
    {
        "id": "1qb5e8u",
        "author": "cyrusmancub",
        "title": "Xabi Alonso did not resign. He was sacked.",
        "content": "",
        "upvotes": 148,
        "comments": 82,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qb5e8u/xabi_alonso_did_not_resign_he_was_sacked/"
    }
]