[
    {
        "id": "1pb9xd4",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 16,
        "comments": 1699,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pb9xd4/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1pcbmwi",
        "author": "o6ohunter",
        "title": "A collective issue, not an individual one",
        "content": "",
        "upvotes": 446,
        "comments": 135,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/km0qvxj99t4g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pcbmwi/a_collective_issue_not_an_individual_one/"
    },
    {
        "id": "1pcobz7",
        "author": "RM-PostMatchSurveys",
        "title": "No Longer Doing Post Match Surveys",
        "content": "It's clear that the ratings for these matches are not being done objectively and this issue has only worsened this season with the amount of Player FC fans we have in the sub. I'm tired of seeing submissions that give 10s to Arda while rating Jude a 1 or vice versa, 10s for Mbappe and Vini even when it's clear they had a mid match, people giving 1s to every player if we lose a match, etc. Sorry to those who have enjoyed the surveys.",
        "upvotes": 66,
        "comments": 22,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pcobz7/no_longer_doing_post_match_surveys/"
    },
    {
        "id": "1pc5685",
        "author": "CoolIsopod3095",
        "title": "Throwback to this amazing real madrid counterattack against Ajax. Commentary makes it 10x cooler",
        "content": "",
        "upvotes": 716,
        "comments": 55,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/udam7ogpqr4g1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pc5685/throwback_to_this_amazing_real_madrid/"
    },
    {
        "id": "1pcj1ld",
        "author": "Prestigious_Tax2069",
        "title": "The Holy Cow's Coach…! Congrats to Real Madrid’s Board",
        "content": "This isn't \"rage-after-a-draw\" talk or some reactionary street language. This is literally what Spanish journalists have been saying nonstop over the past hours. What's happening at Real Madrid is a full-on administrative disaster. Yes the chaos on the pitch and the disgusting behavior in midfield is 100% the board's fault. No debate.\n\nXabi Alonso is a very good coach, at least against small and medium teams. He started the season destroying them without mercy, which is exactly how you win a league comfortably. He showed personality, he didn’t care if he benched Bellingham or Vinicius , everyone saw it in the Club World Cup and the early weeks of the season.\n\nThen suddenly everything flipped the moment some of the \"holy cows\" in the locker room started acting up.\nYep  the board stepped in and basically told Xabi not to be too harsh on certain players. Or in other words: \"Find a middle ground between you and the players.\"\nThat might work in some random street café not in a football club.\n\nThis isn't even a defense of Xabi. He made mistakes, sure. But let's ask the million-dollar question:\n\n**Does the coach have complete freedom**?\nOf course not. Not even close. It's impossible for him to make any decision freely because if one of the \"holy cows\" drops in form, their market value drops with them  and the board can't have that.\n\nThese deadweight names aren't going to succeed. These lost players won't give you anything. They failed under the smiling  coach, and they failed under the strict and demanding one. They're rotting pieces that will drag down the whole club unless the board steps in.\n",
        "upvotes": 75,
        "comments": 34,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pcj1ld/the_holy_cows_coach_congrats_to_real_madrids_board/"
    },
    {
        "id": "1pcjxvt",
        "author": "Snoo-30138",
        "title": "Why can’t we attack more centrally? Well here’s one reason why",
        "content": "I might be slightly over critical here but I’m finding it uneasy that Mbappe almost always bends his run to the left side. \n\nHis first touch here could’ve easily been towards the goal, but instead decides to go towards Vini and totally demolishes any chances of picking away the man on Vini.\n\nVini also could’ve done better here maybe with a cut back, but this is Mbappe’s mistake to start with. ",
        "upvotes": 40,
        "comments": 48,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/uuh7a7aoru4g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pcjxvt/why_cant_we_attack_more_centrally_well_heres_one/"
    },
    {
        "id": "1pc5yoq",
        "author": "Tuffyobro",
        "title": "Why is Endrick not getting a chance to prove  himself?",
        "content": "I think it’s very strange that Endrick isn’t getting enough minutes to prove himself. He was only subbed for one game this season with a total of like 12 minutes.\n\nHe was a real bright spark in the Copa del Rey last season, and every time he played, he looked like a genuine goal threat.\n\nHe scored a goal every 121 minutes last season, despite mostly coming on as a late substitute in la liga. He was the top scorer in the Copa del Rey and produced some really nice goals.\n\nI agree that his overall game still needs improvement, but he brings that goal threat which most of our attackers except Mbappé (and to some extent Gonzalo García) are lacking right now.\n\nYoung talent do not want to come to Madrid if they risk rotting on the bench for no reason.   \n",
        "upvotes": 164,
        "comments": 113,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pc5yoq/why_is_endrick_not_getting_a_chance_to_prove/"
    },
    {
        "id": "1pca18h",
        "author": "cyrusmancub",
        "title": "Mendy is out, having suffered a hamstring injury",
        "content": "",
        "upvotes": 76,
        "comments": 76,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pca18h/mendy_is_out_having_suffered_a_hamstring_injury/"
    },
    {
        "id": "1pc3uic",
        "author": "ColdAd3682",
        "title": "Real Madrid Transfer DealSheet: Rodrygo for sale, centre-back and midfield targets",
        "content": "",
        "upvotes": 105,
        "comments": 43,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fnWmINrUxFPyvD-BlbzP6GNfya4F1JNfOQEODte4cjY.jpeg?auto=webp&amp;s=bf747cda2d05dd2bda25613c44c6f16c3bfaefaa"
        },
        "permalink": "/r/realmadrid/comments/1pc3uic/real_madrid_transfer_dealsheet_rodrygo_for_sale/"
    },
    {
        "id": "1pca59u",
        "author": "Parking_Writer6719",
        "title": "Vini Jr x Bruno Mars",
        "content": "We want this Vini back :(",
        "upvotes": 36,
        "comments": 24,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/shm1mgahys4g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pca59u/vini_jr_x_bruno_mars/"
    },
    {
        "id": "1pccu4w",
        "author": "No-Independent2522",
        "title": "Real Madrid and the Community of Madrid sign a collaboration protocol for the creation of Madrid Innovation District  It will generate 1.2 billion euros annually to the regional GDP and more than 23,000 permanent jobs",
        "content": "",
        "upvotes": 23,
        "comments": 3,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pccu4w/real_madrid_and_the_community_of_madrid_sign_a/"
    },
    {
        "id": "1pbpydm",
        "author": "Fit_Wrap_9580",
        "title": "Saw this video in X, why is real not playing like this,",
        "content": "It didn't matter who had to score, they played as a team, the important thing was to win no matter if it was with a goal from Fran García (who scored a goal), now it absolutely has to be just one player who scores because they can't be substituted either.\n\n  \nI was so happy to see this real madrid, my depression left my body lol, this real madrid had life in them. \n\nLook at Valverde who is playing so good, he is supposed to play like that.",
        "upvotes": 454,
        "comments": 81,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/qg0r2oerxn4g1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pbpydm/saw_this_video_in_x_why_is_real_not_playing_like/"
    },
    {
        "id": "1pc416y",
        "author": "Fluffy-Management199",
        "title": "In Hindsight, was Carlo just unfairly treated ?",
        "content": "Now before everyone jumps at me for saying how terrible last season was, I’m not saying he was perfect but he did have a terrible defense all the year round because of injuries \n\nYes the football wasn’t pretty always but we didn’t have drama and well we did decent against smaller teams atleast even if the football wasn’t pretty necessarily. \n\nWas it unfair to be highly critical against Carlo in hindsight given that he had multiple injuries in the back line ?\n\nDo you think he would have succeeded if he had these new signings?\n\n\n\nEDIT: I also think that Xabi is given much more leniency when it comes to the results and football because he was a former player and a legend and if he wasnt, he would have a much higher repercussion in the fanbase",
        "upvotes": 52,
        "comments": 63,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pc416y/in_hindsight_was_carlo_just_unfairly_treated/"
    },
    {
        "id": "1pc3twe",
        "author": "Total_Escape_9778",
        "title": "With 9 goals in only 5 matches, this is already the most prolific Champions League season of Mbappé’s career when it comes to goal scoring.",
        "content": "Just for context, the record of highest goal scoring season in the champions league is held by Cristiano Ronaldo with 17 goals in 11 games in the 2013-14 season.",
        "upvotes": 52,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/yndi1rckar4g1.png?auto=webp&amp;s=39d420a1ea4eb22e886704672055577fc3489b7e"
        },
        "permalink": "/r/realmadrid/comments/1pc3twe/with_9_goals_in_only_5_matches_this_is_already/"
    },
    {
        "id": "1pbifs9",
        "author": "o6ohunter",
        "title": "Zinedine Zidane playing some pick up. Safe to say he’s still got it",
        "content": "",
        "upvotes": 857,
        "comments": 32,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/53ip59ynkm4g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pbifs9/zinedine_zidane_playing_some_pick_up_safe_to_say/"
    },
    {
        "id": "1pbfu9r",
        "author": "Nakul03",
        "title": "Kylian Mbappé has now scored 60 goals in 2025, with five matches still to play. 🇫🇷🔥",
        "content": "",
        "upvotes": 1104,
        "comments": 118,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/lzno0bmh3m4g1.jpeg?auto=webp&amp;s=b3c6a4649afb0206f32fa614cd25045c36b4ebf5"
        },
        "permalink": "/r/realmadrid/comments/1pbfu9r/kylian_mbappé_has_now_scored_60_goals_in_2025/"
    },
    {
        "id": "1pcinp3",
        "author": "neauneau",
        "title": "Visiting Madrid on May, looking to go to a game",
        "content": "Hi all, we're in the Netherlands and we're planning to go to Madrid for a long weekend when we play against Athletic club. I'd love to get tickets to the game to go with my son who's 8 and a huge fan. \n\nI'm a bit concerned about ticket availability from searching and reading on this sub. I understand tickets will be available about a week before the game, but I take it it's not really worth it getting the Madridistas premium pack right? Do I have a chance to buy tickets on the official website or is everything scooped up by 3rd party resellers? \n\nThanks for your advice, Hala Madrid! ",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pcinp3/visiting_madrid_on_may_looking_to_go_to_a_game/"
    },
    {
        "id": "1pbj3ct",
        "author": "Saharan-Gladiator",
        "title": "Xabi is starting to seem like a hypocrite",
        "content": "During the CWC, he was praising Gonzalo Garcia but Gonzalo only gets brought in at the 89th minute. Benching Vini when he's having a bad game is great but Mbappé plays the whole game even if he's not having a good game. Gonzalo and Endrick must feel pretty discouraged right now. There's even a fake AI picture of Endrick crying during the Girona game, that's how he must feeling inside. Xabi has went back on all of his promises since the start of the season. So many questionable decisions from Xabi",
        "upvotes": 327,
        "comments": 165,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pbj3ct/xabi_is_starting_to_seem_like_a_hypocrite/"
    },
    {
        "id": "1pbmtik",
        "author": "sosephjr",
        "title": "Vini chance against Girona at 45’. Take a closer look to one player…",
        "content": "",
        "upvotes": 183,
        "comments": 172,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/bzkqoexycn4g1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pbmtik/vini_chance_against_girona_at_45_take_a_closer/"
    },
    {
        "id": "1pcovor",
        "author": "_Ademola",
        "title": "2024/25. A detailed breakdown of everything that's wrong with us this season",
        "content": "This might be a bit of a rant, but I’m genuinely tired of seeing half-baked analysis with zero depth. I’ll try to give a sensible, short overview of the issues we’re seeing this season. This won’t be an in-depth tactical breakdown (not my expertise). It’s just basic things I consider logical, and I think most people should agree with me on.\n\nI’ll be trying to touch on the following points, in no particular order:\n\n\\- Is Mbappe a problem? Can we win the big trophies with him? Does he have to prove himself?  \n\\- Is Vinicius a problem? Is he finished because he didn’t win the Ballon d’Or?  \n\\- Arda Guler or Jude Bellingham at number 10? How do we resolve this issue?  \n\\- How well is Xabi doing? Is he being thrown under the bus?  \n\\- Rodrygo? Garcia?  \n\\- Fan FC battles: Jude FC &amp; Vini FC vs Mbappe FC &amp; Guler FC.  \n\\- Ancelotti’s sacking and what we can learn from it.\n\nIt's a lot to go through so please bear with me. **First**, let’s start with last season. We signed Mbappe and had a terrible season, going trophyless even though he scored a lot of goals. This resulted in Carlo’s sacking. Meanwhile, PSG went on to win the Champions League and looked better as a team doing it.\n\nNaturally, questions have not started being asked and the fanbase has became divided. Some acknowledge that Mbappe is a world class player but still think that questions should be asked of his play and ability to deliver high-end trophies. Alternatively, we have two other more extreme positions; those who think Mbappe is the second coming of Ronaldo, and those who think he should never have been signed because he's “the problem.”\n\nWhat do I think? **I think Mbappe is a generational player and I've always been a fan(to reasonable extents)**. However, I've also always said that Mbappe had to prove himself at Real Madrid. I think this is a reasonable stance to take. He’s always demanded that any team he plays in be built around him. **However, he's not proven to be clutch enough to make that sacrifice worth it**. If the main reasons for his failures to win the UCL or Ballon d'or have always been his teammates, it doesn't make sense to walk into a team that(at the time of his arrival) had won 2/3 UCL trophies and still insist that those(new) team-mates are the reason why those failures continue. He's running out of excuses.\n\nHe joined Real Madrid because we can help him get to the next level. But we can’t do that if we make the mistakes PSG did. Unfortunately, Mbappe’s signing seems to have come with a lot of unreasonable fans that seem to think it’s worthwhile to sacrifice every other player (who’ve proven themselves in the shirt) to please him. This is foolish IMO. They try to compare him to Ronaldo. The difference is that Ronaldo came into Real Madrid more accomplished than other players. Even then, he had to earn the right to be crowned their king by proving himself not only with goals, but with CRUCIAL goals that WON US TROPHIES. Until Mbappe does that, we absolutely should not treat him as untouchable no matter how many goals he scores, or how good he is for France. **This is why we’re Real Madrid.**\n\nOn the other hand, I see a lot of extreme opinions saying our chances in the future are worse with him. I STRONGLY disagree, and will give my reasons why I don’t think this is the right stance either. IMO, these opinions are wrong because they’re born out of frustration rather than logic. Seeing a large number of irrational Mbappe fans throw our other players under the bus has given an excuse for these people to do the same to him, which is why we’ve seen a rise of in-fighting between these “cults.” Neither side is accurate IMO.\n\nAlthough, at least for the Vini and Jude cults, it’s a good thing that most of them are actually Real Madrid fans since both of these players didn’t really bring a large fanbase over. It’s not Mbappe’s fault that he has a following that cares more about him than the club, especially a following that’s so insecure that they don’t want anyone to share the spotlight with him. However, most of his fans are absolutely ridiculous. I don’t intend to go on a rant about them. I’d rather try to ignore them as much as I can. They degrade the conversation.\n\nNow to give my answer to the questions I’ve raised so far, here's what I think:\n\n**I think Real Madrid should be dominating European football with Mbappe, Vinicius, and Bellingham, and that removing any of these three reduces our chances of success. I also think that hypothetically, Mbappe and Vinicius would be our best players about 50% and 30% of the time each.**\n\nHere’s why I think so. Once again, I don’t claim to be a tactico, but here are some stats from last season:  \n\\- Mbappe: 45G + 5A = 50  \n\\- Vinicius: 22G + 19A = 41  \n\\- Jude: 15G + 15A = 30\n\n&gt;! Please note that I'm not making my conclusions based on these stats alone! as that would be shallow. I'm talking based on everything I've watched of these players, both in and out of a Real Madrid shirt, as well as recent clips I watched of our highlights in the last two seasons. !&lt;\n\nTo continue, in my opinion, this looks good and is what we actually want to see! And yet the consensus in the fanbase today seems to be that this trio will never work and we need to pick only one or a combination of two of these players. They use last season and a few games this season as their evidence.\n\nBut I disagree. Yes, last season was bad, but it was definitely not because of anything that shows these three fundamentally don't work as a group. **We had much bigger problems:**\n\n\\- Fran Garcia and Vasquez playing at fullback. Nothing much to say about this. We lost both Carvajal and Mendy to injury, of course.\n\n\\- Having to mostly play Asencio (inexperienced) and Tchouameni at CB, with Rudiger being out of form and playing with injury in most cases.\n\n\\- Losing Kroos (very crucial due to his passing ability), Modric having his minutes managed even more, and losing Tchouameni in midfield because he played as a CB so many times. Joselu as well (though his presence was less felt).\n\n\\- We also had Jude playing with an injury mostly, which is noteworthy.\n\n\\- Mbappe being out of form at a crucial time in the beginning of the season, so we had to play catch-up in the league after. This is very understandable because he was new, and yet he adapted well enough to still end up as our best player.\n\n\\- Understandably, it also took some time for Vinicius and Mbappe to form any kind of connection.\n\n\\- Ancelotti insisting on moving from a front 2 to a front 3 with Rodrygo, giving us even fewer bodies in midfield. This was a consistently bizarre choice Ancelotti kept making. On one hand, it’s difficult to defend this. On the other, it could have been because we had so few options in midfield that he saw Rodrygo as a better pick rather than having to pick 4 midfielders out of Jude.\n\n**When you consider all of this**, the truth is that we had major problems. We had too many injuries in defence and were too light in midfield. **And yet today I see a lot of revisionism**:\n\n\\- Being dishonest about Ancelotti to make Xabi seem better than he actually is. My answer to this is that while Carlo had to be held accountable for last season and the board wanted a change, judging him as a manager off last season is ridiculous. He wasn’t adequately backed and lost key players to retirement and injuries. Also, sometimes bad seasons happen. To the hardcore Xabi defenders: if we held him to the same standards for last season alone, he went trophyless last season and had some embarrassing cup defeats.\n\n\\- Pushing the claim that Vinicius is “finished” because he didn’t win the Ballon d’Or, or because he “hasn’t scored in the last 10 games.” This is another silly claim. They pretend like he didn’t have 41 G+A last season and doesn’t have 12 so far in this one, and try to use last season to single him out.\n\n\\-I’ve also seen ridiculous takes about Bellingham and Fede (who’s out of form atm but is still a good player).\n\n**This season**, we've addresses many of these issues, **while others have fixed themselves:**\n\n\\- Militao and Rudiger coming back fully fit. Carvajal coming back as well alongside Mendy.  \n\\- Signed Huijsen and Carreras. Signed Trent. That’s 3 defensive additions.  \n\\- Called up Garcia, who’s shown that he can be a good backup and offer us a different dynamic in CF when needed, just like Joselu.\n\nOur team already starts to look good at this point. So keeping in mind that we made these signings(and that we had players coming from injury), **here's what I think our plans for this season should have been:**\n\n\\- Invest in and improve the offensive dynamic between Vini &amp; Mbappe (with Jude) so they’re more consistent and dangerous to play against. As I showed, last season was promising. This season should be even better.\n\n\\- Sign a replacement for Kroos. It doesn’t have to be exactly like him, just a midfielder that sticks exclusively to midfield duties, particularly one that’s very good in possession. Once again, I’m not a tactico, so though I have some ideas, I’m not confident enough to state them.\n\n\\- Rotate effectively to get Rodrygo back in form and keep Goncalo Garcia active. They’d be crucial in a long season.\n\n\\- Keep Modric. He’s still quality and leaves us a leader in the dressing room and an extra person to call on if we’re in trouble.\n\n\\- Stick to the same 4-4-2 which has been used in almost every successful season we’ve enjoyed recently.\n\n\\- Perhaps get Mbappe and Vini(Mbappe especially) to do a bit more work out of possession?\n\n\\- Create a culture where players are comfortable with being rotated, while still making them feel valued. We showed glimpses of this in the CWC.\n\nAnd so our expected formation would be a 4-4-2 with:  \nVini.                         Mbappe  \nJude  \nNM                             Tchouameni              Valverde\n\nCarreras.           Militao.                      Rudiger.          Carvajal\n\nnote: NM means “new midfielder”, the one that would good in possession.\n\nArguments can be made in some cases: Trent/Carvajal, Mendy/Carreras, etc., but in general I think this is a strong lineup that could win both the league and the UCL. GG, Rodrygo, Camavinga, Huijsen, Asencio, Guler, Modric (remember, we should have kept him) can be the core of the rotations, although we still remain light in midfield, especially with Cama being injury-prone. Then we’d still have Endrick, Ceballos, Brahim, and Fran to call on if needed.\n\n**I strongly feel like we should have gone in this direction**. However, we’ve now seen quite a lot of worrying deviations from this **that don’t make much sense:**\n\n\\- Insistence on playing a 4-3-3 instead of a 4-4-2 that clearly fits this team better, and is a cheat code for UCL knockout fixtures due to it being defensively solid and adding extra cover for players like Mbappe (or maybe Trent) that are defensively suspect.\n\n\\- Continuing from the above, we signed Mastantuono when we already have too many forwards. We should have signed a midfielder instead.\n\n\\- Letting go of Modric, leaving us even lighter in midfield, and losing out on his leadership and team spirit.\n\n\\- Not investing in the offensive dynamic between Vini and Mbappe from last season, the one that’s also similar to Vini + Rodrygo &amp; Vini + Benz in a 4-4-2. Instead, it’s a new system that seems to want Vini to strictly stay on the touchline while Mbappe plays completely central in a 4-3-3 (except Mbappe can also choose to leave his position whenever he wants, which is strange).\n\n\\- Continuing from the previous point. Xabi made bizarre decisions at the start of the season with Vini that showed a clear deviation from what we should have been trying to do. Once again, we should be emphasizing the strike partnership between Vini and Mbappe as much as possible and making them our core. They’re our best players. However, so far the message Xabi has been sending is that Vini is replaceable and that he's setting up his team to play exclusively to Mbappe's strengths ALONE, while not playing to other players’ strengths as well. Perhaps this started as an instruction from the board to punish Vini for his refusal to sign a contract, but ultimately it is a bad design for the team. This IMO has been a cause of low morale for Vini.\n\n\\- Trying to justify our lightness in midfield with the lie that Guler can play as an 8 or can be taught to be a Kroos replacement. This is just not true as he’s not that kind of player. He’s clearly a player that’s very efficient and switched-on in the final third, but he doesn’t have the possession-mindedness that we need in our “Kroos replacement.” Imo our ideal setup involving Guler shouldn’t have him tasked with deep midfielder duties. It should have him either play as a 10, or start more regularly in Valverde’s position at RM, especially in games vs weaker teams that defend deep.\n\n\\- Not doing nearly enough to get the best out of players that would make us a complete team and give us options: GG, Rodrygo, Endrick, and even Mastantuono (even though he doesn’t exist in my ideal formulation). For one, we have too many forwards. Secondly, Xabi hasn’t been smart about giving these players enough minutes in good conditions to help them. A lot of this revolves around his determination to make Mbappe play every single 90, even those that are not necessary. Unfortunately, this has a ripple effect. Not only does this reduce the available minutes for these players, it’s difficult to manage other players’ minutes without drama because they can get upset about the double standard (rightfully so). Vini is an example of this. We’ve managed to make every minute Rodrygo plays an attack against Vini, which hasn’t helped either player. Compare this to managers that can promote a collaborative mentality even when players compete for spots, and there’s a clear breakdown in communication here that needs to be fixed.\n\n**To conclude,** I believe most of these things are Xabi's responsibility to fix. So far, he doesn’t seem to have managed to inspire love or respect like Zidane, Mourinho, or Ancelotti did did. He also hasn’t introduced a particularly attractive brand of football. He hasn’t given players like Endrick or GG a chance. No player seems to be performing better under him (besides Guler). He’s not getting results on the pitch that leave us confident about our chances of winning the UCL and La Liga this season. So far his reign has been broken promises, contradictions, and bizarre decisions.\n\nI was very optimistic about his appointment, although there were some red flags. But so far he looks unconvinced about what he wants to implement. His vision is not clear on the pitch, and he doesn’t seem to inspire our players off it. The best he’s shown was in the CWC and the first few games of the season. The problem with those periods is that the formulas he used are not sustainable:  \n\\- **CWC**: Pre-Mbappe. We were decent but not particularly impressive. All in all, this was never sustainable because our best possible team IMO involves Mbappe, as I already outlined.  \n\\- **Early this season**: Good results from the Mbappe-centric style + Guler (who is perfect for it). While this could win games against average opposition, it requires dropping Vini + Bellingham, who are two of the best (and clutch) players in world football. This makes no sense IMO. We need these players if we’re serious about winning and not just looking to flat-track bully weak opposition.\n\nI’ll stop here, but I hope I provided at least some answers. I know I’ve probably raised a few new questions as well, so feel free to ask away. I’d be happy to discuss extra points (or even disagreements) in a kind manner. Thanks! ",
        "upvotes": 2,
        "comments": 28,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pcovor/202425_a_detailed_breakdown_of_everything_thats/"
    },
    {
        "id": "1pbg970",
        "author": "Nakul03",
        "title": "Xabi Alonso reaction to Mbappe miss vs Girona 90+4'",
        "content": "",
        "upvotes": 294,
        "comments": 57,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/33kv8un86m4g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pbg970/xabi_alonso_reaction_to_mbappe_miss_vs_girona_904/"
    },
    {
        "id": "1pc5mu7",
        "author": "Cursorium",
        "title": "Is Celta match sold out or am I using the site wrong?",
        "content": "I am visiting Madrid on Sunday, and I wanted to visit the match against Celta, but I am having trouble getting the tickets. I sometimes get the option to choose a seat, but whenever I try to choose a seat, there's a message that there are no seats available anymore. I refresh the site, and then there are new seats available. Am I doing something wrong?",
        "upvotes": 8,
        "comments": 13,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pc5mu7/is_celta_match_sold_out_or_am_i_using_the_site/"
    },
    {
        "id": "1pbek7b",
        "author": "Painting-Best",
        "title": "We have to talk about Federico Valverde...",
        "content": "Straight to the point, this guy has been a shadow of his former self. His perfomances as a middlefielder have been average at best since the cwc. There is not a single thing he contributes to the game. He doesnt create chances, doesnt control the tempo, never takes his space on runs, plays like he's scared to play offensive and the guy doesnt even shoot anymore. He used to be this extremely passionate workhorse but we dont see that nowadays either. He plays like he's tired. Keep in mind this is the captain of real madrid we're talking about here. You wouldnt ever notice that he's the captain if it werent for his armband. This sub is going crazy about Jude and Arda but in reality Fede is the one who's been severly underperforming. Camavinga 100% deserves the starting spot over him. Hope he gets back to his best...",
        "upvotes": 253,
        "comments": 87,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pbek7b/we_have_to_talk_about_federico_valverde/"
    },
    {
        "id": "1pbko2o",
        "author": "Critical-Remove-1878",
        "title": "\"We should blame Xabi, these players won the UCL a couple of seasons ago, they didn't suddenly get worse\"",
        "content": "Here's an example of why this couldn't be further from the truth:\n\nManchester City won a treble in 22/23 (in more dominant fashion than our double in 23/24) and yet last season most of their players were terrible. Now Ederson and Gundogan are playing in Turkey, Cancelo and Mahrez are playing in Saudi, De Bruyne and Rodri are injured all the time, Walker plays for the worst team in EPL, Grealish plays for Everton, others like Stones or Ake are washed, even Bernardo or Foden are nowhere as good as they used to be.\n\nApart from Haaland, the only ones who are as good or improved from their 22/23 squad are... Alvarez and Palmer, two players that ironically don't even play for them anymore.\n\nAnd this is just the most recent example, we've seen other teams winning trophies and then regressing a lot soon. Inter 2010, Chelsea 2021 are a couple of good examples. We've seen it with our own team as well. How good were the likes of Marcelo, Isco, Asensio, Varane etc. in 2018 and how these guys were performing a season or two or three later?\n\nI don't understand why people can't grasp the concept of players regressing, even if they won trophies in the near past. Doesn't matter if these players are in their 20s, don't have injury issues or they were very succesful recently. Dembele and Raphinha were both considered failures until a year ago, yet last season they were the two most influential players. Salah went from Ballon d'Or candidate to a completely painful to watch ghost of himself, in a matter of few months. Hazard was considered a top 10 player on earth when he joined us. Players get better and worse all the time, I know some people are too sentimental with our current squad, but it's time we should start accepting that fact, some players (not all of them) are already past their primes.",
        "upvotes": 127,
        "comments": 92,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pbko2o/we_should_blame_xabi_these_players_won_the_ucl_a/"
    },
    {
        "id": "1pbbg7o",
        "author": "Frostb1",
        "title": "Aint no way y'all doubting Bellingham",
        "content": "People gonna downvote this shit but Bellingham is so much better than arda, everywhere. We lost because we couldnt convert open chances. The blame doesnt go to Bellingham alone. Anyone who says Bellingham is the problem shouldn't watch madrid. He is alone the reason we won against barca, infact our last UCL was won cause he was there. So before y'all talk about my bubblegum like that. Use your brain.",
        "upvotes": 162,
        "comments": 117,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pbbg7o/aint_no_way_yall_doubting_bellingham/"
    },
    {
        "id": "1pbd6ld",
        "author": "Little_Knowledge6249",
        "title": "This club situation is not Xabi’s fault",
        "content": "I will get attacked for this opinion, but even if Xabi gets sacked we will be the same with the new coach because guys, let’s be real, this squad is tactically built wrong. We don’t have a proper 8 or 6 who will make us have a good midfield that makes us win matches Our 6, who is  Tchouaméni, a 90M worth player, he is not a proper 6. many deserve this place more than him: Caicedo or Elliott Henderson or Wharton or De Jong and many more. And our 8, the English model who doesn’t want to play 8 and makes a mess because he wants to play 10 and park at the front to score tap-ins and celebrate, but to play as a proper 8 and be useful for the team ? No it won’t happen.\n And the big two stars Vini and Kylian who only want their personal benefit, not the team. The poor press they don’t even do it.\nVini , who made the disrespectful action in the classico who loses the ball a million times in every match and become a winger can’t get even agianst any Right back in 1v1 except some matches and we saw it and makes stupid decisions most of the matches this season,man even Bradley put him in his pocket \nAnd Kylian, who wants princess treatment. he won’t press like the rest of the team; he doesn’t want to tire himself every match. He just scores goals and celebrates, that’s all.\n\nXabi obviously have faults but will it be Every time the coach faults? So Carlo was first now Xabi, Every time we will do the same mistake and blame the Coach and forget about the Ridiculous players ?",
        "upvotes": 102,
        "comments": 74,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pbd6ld/this_club_situation_is_not_xabis_fault/"
    },
    {
        "id": "1pb9xky",
        "author": "Awkward_Method1552",
        "title": "Madridistas these days",
        "content": "",
        "upvotes": 155,
        "comments": 14,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/qi73ytdtqk4g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pb9xky/madridistas_these_days/"
    },
    {
        "id": "1pb1efn",
        "author": "No-Independent2522",
        "title": "Losing my sanity over this team 😭 [OC]",
        "content": "",
        "upvotes": 689,
        "comments": 31,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/rvyv83dzbi4g1.jpeg?auto=webp&amp;s=a6d26c567a66fb2ac27058c64c1cd73cfd259f42"
        },
        "permalink": "/r/realmadrid/comments/1pb1efn/losing_my_sanity_over_this_team_oc/"
    },
    {
        "id": "1pb2q7u",
        "author": "killorbekilled_",
        "title": "KP Boateng: \"Before I joined Barcelona, I said Cristiano Ronaldo is the best player and Real Madrid is the best.\" \"After I joined Barca, they forced me to say Lionel Messi is the best, otherwise you cannot play here.\" \"I LIED because I wanted to play.\" (@unscriptedtheshow youtube)",
        "content": "",
        "upvotes": 526,
        "comments": 79,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/43rebdbani4g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pb2q7u/kp_boateng_before_i_joined_barcelona_i_said/"
    },
    {
        "id": "1pb4rny",
        "author": "Mean_Teach_6999",
        "title": "In other news... Justin seen wearing a Real Madrid Kit!",
        "content": "I know we're all upset but just saw this and wanted to share !",
        "upvotes": 363,
        "comments": 56,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xvigyc4t5j4g1.png?auto=webp&amp;s=ac01b745875e92c9f9a79ba33b34d4314e23eb33"
        },
        "permalink": "/r/realmadrid/comments/1pb4rny/in_other_news_justin_seen_wearing_a_real_madrid/"
    }
]