[
    {
        "id": "1qs6q60",
        "author": "scoreboard-app",
        "title": "[Pre-Match Thread] Real Madrid vs Rayo Vallecano, La Liga match 22",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1qs6q60)",
        "upvotes": 36,
        "comments": 55,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qs6q60/prematch_thread_real_madrid_vs_rayo_vallecano_la/"
    },
    {
        "id": "1qnd1ex",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 19,
        "comments": 3816,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qnd1ex/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1qscige",
        "author": "Bijay12356",
        "title": "Kroos is cooking our midfielders 😮‍💨",
        "content": "",
        "upvotes": 2410,
        "comments": 115,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/j3pndzp4qqgg1.jpeg?auto=webp&amp;s=58111170534e534f013df80870ca3f284aad12c6"
        },
        "permalink": "/r/realmadrid/comments/1qscige/kroos_is_cooking_our_midfielders/"
    },
    {
        "id": "1qs3zf1",
        "author": "Timely-Structure-905",
        "title": "Dread it… run from it… destiny arrives all the same. Benfica again in UCL playoffs. Are they inevitable?",
        "content": "",
        "upvotes": 378,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9gnvibcw4pgg1.jpeg?auto=webp&amp;s=a1d4be74facf8c5eb0e355968ba8ee00065309c3"
        },
        "permalink": "/r/realmadrid/comments/1qs3zf1/dread_it_run_from_it_destiny_arrives_all_the_same/"
    },
    {
        "id": "1qs48x8",
        "author": "ace-s",
        "title": "Ultra Sur prepares massive whistles against Florentino and the players",
        "content": "",
        "upvotes": 346,
        "comments": 60,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qs48x8/ultra_sur_prepares_massive_whistles_against/"
    },
    {
        "id": "1qs4cyz",
        "author": "KabiX2",
        "title": "OTD in 2009 we signed Julien Faubert on loan, one of the football players of all time🔥",
        "content": "",
        "upvotes": 294,
        "comments": 68,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/yy8rwcno7pgg1.jpeg?auto=webp&amp;s=7a96ddcf05122e0da5007e96761fb2883a4c765a"
        },
        "permalink": "/r/realmadrid/comments/1qs4cyz/otd_in_2009_we_signed_julien_faubert_on_loan_one/"
    },
    {
        "id": "1qs978d",
        "author": "Betonomeshalka",
        "title": "Who the hell is Arbeloa to dismiss people who oppose the current club’s direction as not true fans?",
        "content": "You must’ve seen the press conference news that Arbeloa called people who whistled and booed the team 2 weeks ago no real fans of Real Madrid. Same happened again this week.\n\nThis is dictatorship bullshit similar to Putin and Trump, as if anyone who opposes current government is the enemy of the state.\n\nSince when can’t the people display their displeasure with current club affairs? \n\n# The whole idea of sport is based on fans and supporters.\n\nSomeone has to knock some sense into him. In my opinion, that’s way too offensive to the fanbase.",
        "upvotes": 168,
        "comments": 56,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qs978d/who_the_hell_is_arbeloa_to_dismiss_people_who/"
    },
    {
        "id": "1qs1vo1",
        "author": "Ready_Ad_1353",
        "title": "Eden Hazard asked if Chelsea was the best club he's played with: \"No, Madrid is better. My time at Chelsea was unbelievable but as a club, Madrid is the very best, Its number one. My dream was to play for Madrid when I was young, I always told to my dad that one day I want to play for Madrid.\"",
        "content": "",
        "upvotes": 360,
        "comments": 41,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/00w95csnoogg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qs1vo1/eden_hazard_asked_if_chelsea_was_the_best_club/"
    },
    {
        "id": "1qsr8cx",
        "author": "Safe_Cauliflower_646",
        "title": "The board and mainly Perez is the main reason of our drop in performance the last 2 seasons",
        "content": "I see a lot of people shifting the blame onto one or two players to explain the disaster that was last season and this season, but we’re not looking at the bigger picture.\n\nThe board sets the standards for the team and decides who has authority. After we won the Champions League in the 2023–2024 season, our most important player for the team’s dynamics left (Kroos). The board basically set Carlo up to fail when they didn’t sign a ball-controlling midfielder or any center-backs, even though we clearly needed them due to the high age ceiling and Nacho leaving.\n\nThis season, Xabi still didn’t get a ball-playing midfielder, even though he explicitly asked the board, and now Modrić has also left. We’re left with a midfield that can’t pass the ball if their lives depended on it. Regardless, we still started the season relatively well until the Clásico happened. We were winning, Vini got substituted, and then he acted like a fuckinh 25-year-old man-child clown. Regardless of whether you agree with Xabi’s decision, that doesn’t give him the right to act like that.\n\nBut fine, we are still 7 points ahead. Vini would get his lesson and we will move on… except we didn’t. The board decided to back Vini, saying he shouldn’t have been substituted, and basically endorsed his behavior. From that moment on, you could feel that Xabi lost control of the team. Things started going south, and we ended up losing everything.\n\nThis is obviously not all the reasons, but most of the problems we suffer from can be traced back to the board.",
        "upvotes": 13,
        "comments": 11,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qsr8cx/the_board_and_mainly_perez_is_the_main_reason_of/"
    },
    {
        "id": "1qsjbl0",
        "author": "Tricky_Fish1711",
        "title": "When do you think everything started to fall apart",
        "content": "I still remember watching the el classico we won 2-1 where everyone were been talking about how good our team performed while I was sat there wondering how Vini had to ruin that win by yelling at the coach. It felt wrong the next day when he apologised to everyone except the coach whom he actually disrespected other than the fans. Would love to know your opinion ",
        "upvotes": 36,
        "comments": 56,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qsjbl0/when_do_you_think_everything_started_to_fall_apart/"
    },
    {
        "id": "1qs645a",
        "author": "MrCubeCollector",
        "title": "Cristiano Ronaldo out of Rubik’s cubes",
        "content": "",
        "upvotes": 150,
        "comments": 3,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6r8rlwswjpgg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qs645a/cristiano_ronaldo_out_of_rubiks_cubes/"
    },
    {
        "id": "1qs7w2j",
        "author": "asensia-kopfschmerz",
        "title": "Arbeloa on the “untouchables”: “I always want the best players on the pitch. And the more minutes the stars are available to the team, the better…They can make a difference at any moment. There will be people who aren't Madrid fans and won't want them on the pitch.”",
        "content": "Álvaro Arbeloa: “I understand the debates, but I always want the best players on the pitch. And the more minutes the stars are available to the team, the better. In Villarreal, the goal came from a very good play by Vinicius, for example; the second one. They can make a difference at any moment. There will be people who aren't Madrid fans and won't want them on the pitch.”",
        "upvotes": 116,
        "comments": 56,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qs7w2j/arbeloa_on_the_untouchables_i_always_want_the/"
    },
    {
        "id": "1qs7v1g",
        "author": "tfisthh",
        "title": "Context matters: Arbeloa’s comments",
        "content": "",
        "upvotes": 112,
        "comments": 75,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9wuko2edvpgg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qs7v1g/context_matters_arbeloas_comments/"
    },
    {
        "id": "1qs38pd",
        "author": "ace-s",
        "title": "According to the club, I am not a Madridisa...",
        "content": "Thanks for the gaslighting Flo and Alvaro. I actually lost respect in him. The fans have the right to be mad and he goes and gaslights the fans?\n\nApparently\n\nI am not a Madridista for wanting only the players who preform to get minutes or when a player is not having a good game to get subbed out.\n\nI am not a Madridista for criticizing the club for constantly getting humiliated in big games and it being the players and board fault.\n\nI am not a Madridista for feeling embarrassed how they humiliated us infront of the entire world over a stupid award\n\nI am not a Madridista for being tired of our club constantly blaming its on everything on the managers or the referees and never the players or themselves.\n\nI am not a Madridista for feeling ashamed that a club \"captain\" throws a public tantrum during a time when the team is on a winstreak and finally we won Vs. them after constant humilation. Making it all about HIM and not the club\n\nI am not a Madridista for feeling offended that the club chose the players over the most exciting manager in the past few years who was also a club legend. Something EVERYONE knew that needs time and patience.\n\nI really hope they whistle at them.",
        "upvotes": 183,
        "comments": 63,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qs38pd/according_to_the_club_i_am_not_a_madridisa/"
    },
    {
        "id": "1qs49cw",
        "author": "KabiX2",
        "title": "OTD in 2007 three Polish players joined Real Madrid academy",
        "content": "Krzysztof Król, Kamil Glik and Szymon Matuszek. Honestly it's quite unique story, because we got 3 players from quite uncommon nationality in La Liga and Real Madrid historically. All signed a contract for 3,5 years, but never debuted in the first team. Król trained in Castilla while the other two went to Real Madrid C.\nKról was a left back, he admired Roberto Carlos and he played U19 National team.\nGlik was a center back and he was bought from Union Deportivo Horadada where he made a good impression on Real Madrid squad. He had the best career out of these 3 and was a solid defender.\nMatuszek was a CDM and he was considered the most talented and came from a club called Pilar de la Horadada.\n\n",
        "upvotes": 85,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xwh4xxwx6pgg1.jpeg?auto=webp&amp;s=a86d059c0e3185eb512fcbaa5ace44b7ced2b532"
        },
        "permalink": "/r/realmadrid/comments/1qs49cw/otd_in_2007_three_polish_players_joined_real/"
    },
    {
        "id": "1qs06wm",
        "author": "Majestic-Nobody-3178",
        "title": "Was thinking about this recently and 9/11 players from our 23/24 final starting lineup from 2 years ago still play for us. What the hell happened to some of these players man?",
        "content": "",
        "upvotes": 150,
        "comments": 67,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5k51513f9ogg1.jpeg?auto=webp&amp;s=5560266a79a7e6a02222f265285b8f51609dbf54"
        },
        "permalink": "/r/realmadrid/comments/1qs06wm/was_thinking_about_this_recently_and_911_players/"
    },
    {
        "id": "1qs6s3r",
        "author": "Crafty-Requirement40",
        "title": "Florentino Perez never learnt his lesson",
        "content": "In 2005, he targeted Xabi Alonso but didn't buy him because Xabi was a young talented spanish defensive midfield so Xabi joined Liverpool and they won Champions League. In the other hand, Perez bought Julio Baptista, an brazilian attacking midfield, and forced him to play as defensive midfield then failed disastrously, we were trophyless 2 season in a row that year\n\nIn 2025, another talented defensive midfield name Martin Zubimendi was skipped because he is spanish (not brazilian). Then Martin is shining in Arsenal, they are on top of PL and CL, when we're struggling and might have 2nd trophyless season in a row.\n\nIt's time to step down Perez.",
        "upvotes": 49,
        "comments": 29,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qs6s3r/florentino_perez_never_learnt_his_lesson/"
    },
    {
        "id": "1qsjc4a",
        "author": "Fit_Wrap_9580",
        "title": "Mourinho about leaders and captains",
        "content": "",
        "upvotes": 8,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/DFfEr6M932bObyh5FkBeB0asIkkIrfJ-1MTgzPSgrjM.jpeg?auto=webp&amp;s=f179830c39630b4ea2e79ea7f579243c30f5d373"
        },
        "permalink": "/r/realmadrid/comments/1qsjc4a/mourinho_about_leaders_and_captains/"
    },
    {
        "id": "1qs661s",
        "author": "o6ohunter",
        "title": "Why do some fans believe anything they see from the media?",
        "content": "People on here read tweets from MadridZone, MARCA, whatever the source and just take it as absolute law. There are countless examples that I can’t just instantly recall, but I’ll use a recent example.\n\nJude’s been on the hot seat for a little now and the media’s out in full force. I saw a tweet bashing him for being at a party shortly after the Benfica loss. And this wasn’t just some small tweet, it had about a million or so views and counting. Quotes full of people mocking/ridiculing him. All that just for the picture used in the tweet to be a picture from 2024… This is the news our fanbase is consuming (and believing) day in and day out.\n\nAnd don’t let it be a player who’s currently disliked (such as Vini). When people who already don’t like a player see negative news about said player, all critical thinking goes out the window. That post affirms their bias so they’re not about to go fact checking or commit real thinking on it. Textbook confirmation bias. If it’s drama you want, there’s plenty of reality TV out there for you, but I guess it doesn’t quite scratch the itch of spreading false narratives of a player on a team you love and support.",
        "upvotes": 17,
        "comments": 29,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qs661s/why_do_some_fans_believe_anything_they_see_from/"
    },
    {
        "id": "1qrj5gl",
        "author": "Hot-Cantaloupe-6217",
        "title": "Crazy stats! I hope Mbappe keeps this momentum until we get the 9 reinforcement players we need to recover",
        "content": "",
        "upvotes": 484,
        "comments": 117,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/o9i88i7o4kgg1.png?auto=webp&amp;s=4de7bc36c0e0449afb922161f40d67321617f06f"
        },
        "permalink": "/r/realmadrid/comments/1qrj5gl/crazy_stats_i_hope_mbappe_keeps_this_momentum/"
    },
    {
        "id": "1qrbv9v",
        "author": "Far_Awareness4497",
        "title": "The lack of urgency from our players is disgusting",
        "content": "Most of players are not in form but that's not what infuriates me, it's the lack of effort that kills me. You can criticise Bellingham and valverde current form but These guys put in the effort. Unlike so many of our players. Look at tchouameni jogging to the post, he could have prevented the goal if he ran like valverde. Tchouameni is out of his depths, it's time the board sells him and make some profit now that he's still young and not completely finished.",
        "upvotes": 804,
        "comments": 135,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/rq5owev6uigg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qrbv9v/the_lack_of_urgency_from_our_players_is_disgusting/"
    },
    {
        "id": "1qs26av",
        "author": "cyrusmancub",
        "title": "Squad list against Rayo",
        "content": "",
        "upvotes": 20,
        "comments": 15,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qs26av/squad_list_against_rayo/"
    },
    {
        "id": "1qr2vn0",
        "author": "Ready_Ad_1353",
        "title": "Real Madrid to face Benfica in the UCL Knockout Playoffs",
        "content": "",
        "upvotes": 1551,
        "comments": 309,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/i0c7j4rw1hgg1.jpeg?auto=webp&amp;s=1a7d1a4aaf04e1d8bb3640def10846328d616112"
        },
        "permalink": "/r/realmadrid/comments/1qr2vn0/real_madrid_to_face_benfica_in_the_ucl_knockout/"
    },
    {
        "id": "1qr73so",
        "author": "Dangerous_Tip_4985",
        "title": "I prefer not to speak. If I speak, I am in big trouble.",
        "content": "",
        "upvotes": 690,
        "comments": 44,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/oqnkhejkzhgg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qr73so/i_prefer_not_to_speak_if_i_speak_i_am_in_big/"
    },
    {
        "id": "1qrzwdx",
        "author": "Specialist_Pickle_92",
        "title": "What’s your unpopular opinion about Real Madrid?",
        "content": "Some people think Mbappé is the problem  pointing to PSG winning the Champions League after he left and Real Madrid struggling since he arrived.  \nSome believe Bellingham constantly playing as a No.10 instead of a box-to-box No.8 is hurting the team.  \nSome blame Vini.  \nSome think Huijsen and Asencio don’t form a scary or dominant defensive line at all.  \nOthers believe Real Madrid still hasn’t replaced Kroos and Modrić.  \nAnd there are many more opinions I haven’t even mentioned. So what do you think the real problem is?",
        "upvotes": 13,
        "comments": 101,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qrzwdx/whats_your_unpopular_opinion_about_real_madrid/"
    },
    {
        "id": "1qr6mpf",
        "author": "Bijay12356",
        "title": "When we used to fight until the final whistle, when we didn’t know the meaning of surrender 🥲",
        "content": "",
        "upvotes": 504,
        "comments": 31,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/orbp1x29whgg1.jpeg?auto=webp&amp;s=e5b1c12cb2fe2172f0f5bc085a36c6e4e85437da"
        },
        "permalink": "/r/realmadrid/comments/1qr6mpf/when_we_used_to_fight_until_the_final_whistle/"
    },
    {
        "id": "1qrau7e",
        "author": "TheFeatherDiaries",
        "title": "The only player in the last 15+ seasons to create more chances than Arda Guler per 90 mins in La Liga is 2010/11 Mesut Ozil who played the whole season as a pure Number 10. Moreover Arda ranks third in chances creation percentage through long balls over the same time period.",
        "content": "",
        "upvotes": 209,
        "comments": 65,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/izu3nm6fmigg1.png?auto=webp&amp;s=0cc7ea7b5e1cf13213b7f5d750244db49b799860"
        },
        "permalink": "/r/realmadrid/comments/1qrau7e/the_only_player_in_the_last_15_seasons_to_create/"
    },
    {
        "id": "1qred9w",
        "author": "IcefoxX5",
        "title": "Real Madrid Castilla [1]-0 CA Osasuna Promesas - César Palacios golazo 45'+3",
        "content": "",
        "upvotes": 113,
        "comments": 9,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9e7mpkkd9jgg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qred9w/real_madrid_castilla_10_ca_osasuna_promesas_césar/"
    },
    {
        "id": "1qshpuk",
        "author": "Salt-Estimate-8836",
        "title": "All the team needs is a faster paced midfield",
        "content": "Seeing this video makes me realise that all real Madrid needs is a midfield that is fast paced with passing and movements. It's exactly what Modric said once \"I learned that the quicker play moves, the less physical the game will be. When the game moves fast, you have to think fast. When it slows down, it gives physical players a chance to get close\". Our current midfield is just so slow on the ball like oh my days.\n\nSee this video with Prime Madrid plays like the speed of passing and counter attacks is crazy.\n\n[https://www.youtube.com/watch?v=yHvN4oCSfj4](https://www.youtube.com/watch?v=yHvN4oCSfj4)\n\n",
        "upvotes": 0,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/plXTNxUd_D5RtDv9NAD1NUtJpYAr8Vr87OMlCNR6NUw.jpeg?auto=webp&amp;s=2fe42f0dc71e12e9aabc4a3b6e159c50d1dd2189"
        },
        "permalink": "/r/realmadrid/comments/1qshpuk/all_the_team_needs_is_a_faster_paced_midfield/"
    },
    {
        "id": "1qsb6dg",
        "author": "ninenine2hundred",
        "title": "Some detail about the game against benfica",
        "content": "Madrid defending on a 4-4-2, bellingham drops as the left wing to defend and vini-mbappe are the two at the top, arda guller stays in the middle as a number 8 and tchouameni on his side as a number 5, and thats why it create spaces there for the other team. you just have to put bellingham in the middle in this situations.  \n  \nTo fix this i would put arda guller and mbappe at the top, vini at the left wing to defend and help carreras who had a really bad game, and bellingham-tchouameni in the middle.\n\nThis also change carreras game because vini could help him instead of bellingham who is slower and have the instinct of defending the middle regardless.\n\njust some insight on the arbeloa decisions in this game that some people probably didnt notice",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qsb6dg/some_detail_about_the_game_against_benfica/"
    }
]