[
    {
        "id": "1gojfbv",
        "author": "AutoModerator",
        "title": "L'Ammazzacaffè di r/Italia",
        "content": "L'Ammazzacaffé r\\/italiano. Posta quello che vuoi, quando vuoi. Nuovo thread ogni settimana.\n\n#Wiki di r/Italia\n\nServe un'intro a reddit? leggi qui:\n\nhttps://www.reddit.com/r/Italia/wiki/index/\n\n#Ti servono i mod?\n\nScrivi in modmail cliccando [qui](https://www.reddit.com/message/compose?to=/r/Italia)",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/Italia/comments/1gojfbv/lammazzacaffè_di_ritalia/"
    },
    {
        "id": "1gmm7ny",
        "author": "senove2900",
        "title": "Riapriamo r/Perugia!",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/Italia/comments/1gmm7ny/riapriamo_rperugia/"
    },
    {
        "id": "1gpqwcz",
        "author": "Lukedf9",
        "title": "Perle di Giorgia Meloni",
        "content": "Quante ne deve combinare o dire ancora?\nÈ una mi impressione o sta accumulando figure di merda una dopo l’altra? \nCosa pensa la gente che l’ha votata a distanza di qualche anno?",
        "upvotes": 138,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/at4jsgt8fi0e1.jpeg?auto=webp&amp;s=5cfe4ebae904b4a03fcaaa0f9147ed4b0b889696"
        },
        "permalink": "/r/Italia/comments/1gpqwcz/perle_di_giorgia_meloni/"
    },
    {
        "id": "1gphzmq",
        "author": "Asiablog",
        "title": "12 NOVEMBRE 2003. Attentato di Nassiriya. In Iraq, un gruppo di militanti di al-Qāida a bordo di un’autocisterna forza l’entrata della base Maestrale e fa esplodere un'autobomba che uccide 28 persone: 9 iracheni e 19 italiani, di cui 12 carabinieri, 5 militari e 2 civili.",
        "content": "",
        "upvotes": 228,
        "comments": 70,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/c9l2ufoz9g0e1.jpeg?auto=webp&amp;s=3ac83114f3bfb4230438db376c6074001e32b130"
        },
        "permalink": "/r/Italia/comments/1gphzmq/12_novembre_2003_attentato_di_nassiriya_in_iraq/"
    },
    {
        "id": "1gpl6ld",
        "author": "LePertichenelQLO",
        "title": "Elon Musk a \"Quarta Repubblica\": \"Natalità problema globale, in Italia dovete fare figli\"",
        "content": "**\"In Italia dovete fare figli\".** È questo il monito di **Elon Musk** durante la sua intervista esclusiva con **Nicola Porro** durante la puntata di **\"Quarta Repubblica\"** di lunedì 11 novembre. Inoltre \"These judges need to go\", \"questi giudici devono andarsene\". Così **Elon Musk** ha commentato su X il post di un utente che riportava la notizia della **sospensione della convalida del trattenimento per 7 migranti** decisa dalla sezione immigrazione del Tribunale di Roma, che si è anche rimesso alla Corte Ue.\n\nSinceramente non sto capendo come mai Musk intervenga in questo modo, così autoritario, sulla direzione che deve ottenere il governo italiano. Certo, la Meloni ha mostrato interesse nei suoi confronti, ma, presumo, per politiche commerciali ed internazionali. [Boh, io trovo del tutto fuori luogo questi suoi interventi](https://myspacecomrafaelcoche.blogspot.com/2024/11/elon-musk-quarta-repubblica-natalita.html)\n\n[https://www.tgcom24.mediaset.it/politica/elon-musk-quarta-repubblica-natalita\\_90211743-202402k.shtml](https://www.tgcom24.mediaset.it/politica/elon-musk-quarta-repubblica-natalita_90211743-202402k.shtml)",
        "upvotes": 125,
        "comments": 236,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1_qqnYW7HpxuR33xmAdbbD7zYLGw2QLlvWFBbWC68-Y.jpg?auto=webp&amp;s=32e163ed802f9c5956440502ea0f6f4687d33d17"
        },
        "permalink": "/r/Italia/comments/1gpl6ld/elon_musk_a_quarta_repubblica_natalità_problema/"
    },
    {
        "id": "1gph00f",
        "author": "Solaredinotte",
        "title": "Come fanno i dottori ad evadere le tasse?",
        "content": "Sono stato nella sala d’attesa di un dottore privato normalissimo per due ore. Visitava una persona ogni 20 minuti, e il costo della visita era di 40 euro (a nero).\n\nMi sono fatto due calcoli veloci e si intasca la media di 960€ al giorno al ritmo di 8 ore.\n\nNon voglio fare polemica sull’evasione delle tasse ecc. Mi chiedo come si possono dichiarare circa &lt;30k al mese di nero? Posso capire €200 e ci fai la spesa in contanti, ma una somma così grande deve essere versata come minimo in banca no? Sbaglio qualcosa?",
        "upvotes": 278,
        "comments": 285,
        "media": null,
        "permalink": "/r/Italia/comments/1gph00f/come_fanno_i_dottori_ad_evadere_le_tasse/"
    },
    {
        "id": "1gpnowa",
        "author": "DualLegFlamingo",
        "title": "\"These judges need to go\": Elon Musk dice la sua riferendosi ai giudici che hanno bocciato l'opzione centri di accoglienza per migranti in Albania ",
        "content": "Mi chiedo cosa sarebbe successo se Musk (o miliardario simile e non italiano) avesse fatto una sorta di endorsement verso un governo PD/tecnico/non dell'attuale destra italiana.\n\n\nFonte dell'articolo Repubblica, lo so. Il focus non è l'editore ma l'eventuale universo parallelo di cui sopra.",
        "upvotes": 78,
        "comments": 43,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/DRLP_KaLHvtymE23YbbUaehHt3AR0qGOfhh37luptxg.jpg?auto=webp&amp;s=058674a27bb16b81ee27bc81ab0b68e19863f3c3"
        },
        "permalink": "/r/Italia/comments/1gpnowa/these_judges_need_to_go_elon_musk_dice_la_sua/"
    },
    {
        "id": "1gpi464",
        "author": "Lower_Boysenberry794",
        "title": "Storia triste sul capitalismo in Italia.",
        "content": "Ho un amico d'infanzia (M35) che ha intrapreso la carriera di chef, il cui sogno è sempre stato aprire un locale tutto suo. Terminata la scuola, ha fatto esperienza in giro per il mondo, inizialmente su navi da crociera per poi passare a ristoranti in USA/Inghilterra fintanto che non è riuscito a racimolare abbastanza per aprire il suo locale.\n\nCirca un anno e mezzo fa ha deciso di fare il grande passo e tornare in Italia, aprendo un ristorantino di pesce in un paese vicino. Per via della mia mentalità con propensione al rischio pari allo zero assoluto, gli ho sconsigliato la mossa e piuttosto di continuare a fare lo chef da mercenario, visto che ora ha un buon nome e di conseguenza lavoro e paga ottima li trova molto facilmente.  \nPer aprire il locale ha dovuto affrontare parecchie spese, dai macchinari e strumenti per la cucina a sistemare il posto, motivo per il quale ha dovuto aprire un piccolo mutuo con la banca. A questo aggiungiamo il fatto che è in affitto.\n\nL'esperienza e la bravura degli anni però hanno fatto il loro, infatti mi diceva che per i primi mesi le cose gli sono andate molto bene, rientrava dai costi e tutto sommato vedeva una buona crescita della clientela.  \nTutto finchè non gli hanno aperto un altro ristorante (sempre specialità pesce) a 50 metri di distanza, con la stessa impronta del suo per clientela e prezzi.  \nVoi direte: normale concorrenza, e ci sta. Vince il migliore e ne beneficia la qualità.\n\nInvece salta fuori che il secondo ristorante è stato aperto da un tizio, figlio di un noto industriale della zona. Questo (ironia della sorte) è un nostro coetaneo, famoso perchè dedito alla bella vita e per aver lavorato qualcosa come mai in vita sua. Preciso che non parlo di gente benestante, ma di gente schifosamente ricca, per darvi un'idea ha la barchetta ormeggiata non so dove (con piscina sul ponte), ogni estate fa qualche settimana veleggiando a Ibiza e posti simili. E fin qui nulla di male.  \nSe non fosse che il tizio, giocando con i soldi del monopoli, da qualche anno a questa parte apre e chiude locali in provincia, non sapendo un beneamato cazzo di come si fa ristorazione. Prende un posto, lo rimodernizza, ci piazza dentro un *manager* che faccia tutto e gestisca il posto. Un paio sono ancora aperti, mentre ne ha chiusi 3 (di quelli che conosco io).  \nMia personale opinione è che cerchi di far vedere al papi che anche lui è un bravo ~~feudatario~~ imprenditore, ma le sfumature psicologiche le lascio da parte.\n\nTornando al ristorante, lo ha aperto da meno di un anno; ho un'amica che per pagarsi gli studi fa la cameriera lì il fine settimana, dice che lavoricchiano il sabato/domenica e basta, qualche tavolo ma poca roba. E la cosa si nota passandoci davanti.  \nAl mio amico girano un pò i maroni perchè per quanto poco qualche tavolo glielo porta via, ha notato un leggero calo ma se devi pagare utenze, affitto, mutuo e via dicendo, un solo tavolo ti fa la differenza.  \nE si chiede come fa questo a tirare avanti avendo da pagare personale (e *manager*), pure lui in affitto e come clienti fa meno di un quarto dei suoi.   \nCon la lieve differenza che il mio amico ci passa 12 ore al giorno dentro al ristorante.\n\nConcludo dicendo che questa storia (a mio avviso) rappresenta in pieno il fare impresa in Italia. O sei uscito dal buco giusto, o sei un fenomeno. E anche in quel caso, spera sempre che quello nato dal buco giusto rimanga a farsi le piste in barca.\n\n  \n",
        "upvotes": 165,
        "comments": 117,
        "media": null,
        "permalink": "/r/Italia/comments/1gpi464/storia_triste_sul_capitalismo_in_italia/"
    },
    {
        "id": "1gpj7sd",
        "author": "DIeG03rr3",
        "title": "Oggi mi è arrivato questo libro per la tesi. Solo ora mi rendo conto che l'autore è uno dei due professori dietro il caso di Gioventù Ribelle",
        "content": "Per chi vuole saperne di più su Gioventù Ribelle, vi lascio con [il video di Yotobi](https://youtu.be/wF4P3jiHED4?si=3okofXDhXOfSEoVW) e [un video di Luca Wright](https://www.youtube.com/live/4XvCdOe6AnM?si=Sc-iLXTYB0iGXNwY) che approfondisce ulteriormente la questione",
        "upvotes": 92,
        "comments": 18,
        "media": null,
        "permalink": "/r/Italia/comments/1gpj7sd/oggi_mi_è_arrivato_questo_libro_per_la_tesi_solo/"
    },
    {
        "id": "1gpp3wi",
        "author": "vedinapoliepoimuori",
        "title": "È lo Stato che deve intervenire contro l'overtourism!",
        "content": "Dato che si può costringere i proprietari di casa con le buone d'altronde ognuno fa quello che vuole dei propri immobili e dato che gli affitti brevi sono molto più remunerativi deve essere lo Stato a fare qualcosa.\nMagari farsi garante per chi ha difficoltà a pagare l'affitto oppure comprare gli immobili sfitti e imporre un'affitto decente insomma tante cose che secondo i fasci al governo non faranno mai.",
        "upvotes": 35,
        "comments": 88,
        "media": null,
        "permalink": "/r/Italia/comments/1gpp3wi/è_lo_stato_che_deve_intervenire_contro/"
    },
    {
        "id": "1gpvqax",
        "author": "TiLancioUnaMolotov",
        "title": "oggi sono stato investito",
        "content": "oggi stavo andando in palestra, ero arrivato propio di fronte all'entrata dove c'è una strada abbastanza affolata, una macchina si ferma gentilmente per farmi passare la strada e dopo aver passato la prima corsia guardo per la seconda e vedo arrivare una macchina che rallenta, essendo sicuro che mi avesse visto passo ma sto qua invece di fermarsi continua (stava andando almeno a 50/60), fortunatamente mi sono reso conto che mi arrivava addosso e ho avuto il riflesso di \"pararmi\" e quindi ho attutito molto l'impatto, comunque cado a terra e mi cago addosso, mi rialzo subito con l'idea di riempire di botte chi dietro al volante.\nquando stava per partire il gancio guardo la macchina e vedo il parabrezza sfondato (si, sono stato io) quindi mi fermo e nonostante il tipo insiteva di portarmi al pronto soccorso io ho rifiutato e sono andato ad allenarmi tranquillamente. l'unico errore è stato non prendere la targa ma a sangue caldo non c'ho propio pensato.\ncomunque dopo la botta di adrenalina mi sono sentito dio sceso in terra ahaha.\nVolevo condividere questa esperienza, se qualcosa non è chiara chiedete che non so scrivere\n\naggiornamento: domani mattina andrò in pronto soccorso, sta sera non riesco propio anche perché se vado in quello del mio paese mi mandano in un altro paese perchè da me il ps fa schifo e non hanno neanche un dottore per controllarmi",
        "upvotes": 15,
        "comments": 48,
        "media": null,
        "permalink": "/r/Italia/comments/1gpvqax/oggi_sono_stato_investito/"
    },
    {
        "id": "1gpiism",
        "author": "9oRo",
        "title": "Dragon Ball è stata inserita tra le serie TV preferite dagli italiani (Giorno 8)",
        "content": "Dragon Ball è stata la serie più upvotata del giorno 7\n\nLa serie più upvotata in questo thread verrà inserita nella lista delle serie TV preferite dagli italiani",
        "upvotes": 80,
        "comments": 93,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/q9bfhhcmgg0e1.png?auto=webp&amp;s=1e31af086d822203d144b664c48e43c7d43a83a2"
        },
        "permalink": "/r/Italia/comments/1gpiism/dragon_ball_è_stata_inserita_tra_le_serie_tv/"
    },
    {
        "id": "1gppttn",
        "author": "RevolutionarySir5293",
        "title": "Ho reimmaginato la serie di One Piece",
        "content": "",
        "upvotes": 28,
        "comments": 5,
        "media": null,
        "permalink": "/r/Italia/comments/1gppttn/ho_reimmaginato_la_serie_di_one_piece/"
    },
    {
        "id": "1gpi33p",
        "author": "Itchy-Blackberry-104",
        "title": "is Paolo Bitta canceled?",
        "content": "my man Paolo Bitta disappeared from the facebook gifs overnight...is it because of the infamous \"ciapa i maroni\" move? there is just a hint of Silvano but he's a jerk anyway ",
        "upvotes": 75,
        "comments": 31,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0697j5webg0e1.png?auto=webp&amp;s=7330298169fdab500780992b5d803dac685d0774"
        },
        "permalink": "/r/Italia/comments/1gpi33p/is_paolo_bitta_canceled/"
    },
    {
        "id": "1gplygs",
        "author": "Pale-Psychology-4989",
        "title": "Ma le pubblicità funzionano davvero?",
        "content": "Davvero la gente compra prodotti o servizi solo perché li ha visti (per esempio) su youtube? Vedere la pubblicità dei biscotti x ti porta effettivamente a comprarli? Personalmente evito di comprare prodotti visti in pubblicità proprio perché la reputo invadente e insopportabile. Mi sembra assurdo che le persone si facciano condizionare così facilmente da un video di 15 secondi su YouTube che anzi dovrebbe dare profondamente fastidio a tutti dato che ti fa perdere tempo",
        "upvotes": 33,
        "comments": 76,
        "media": null,
        "permalink": "/r/Italia/comments/1gplygs/ma_le_pubblicità_funzionano_davvero/"
    },
    {
        "id": "1gpmgb7",
        "author": "Swimming-Waltz-3521",
        "title": "Sono intrappolato in un lavoro che è un perfetto sistema di sfruttamento",
        "content": "32M, Lavoro da un anno e mezzo nel settore auto in Liguria, ho sempre avuto ruoli commerciali nella mia vita, ma da quando mi hanno riconosciuto una invalidità parziale ho voluto dire addio alla partita Iva per potermi prendere meglio cura di me.\nUn'azienda vicino a dove vivo, la più grossa nella mia provincia, mi ha contattato offrendomi indeterminato come categoria protetta, 1500 al mese più 100 di anticipo provvigioni al mese. Mi è stato detto che gli straordinari erano forfettari a 150 al mese, ma che ci saremmo dati i turni per non strafare.\n\nOggi lavoro 220 ore al mese (52 ore in media di straordinario), 6 su 7, non vengono compensati dagli straordinari i giorni che uno si prende in settimana per fare ogni cosa che richieda del tempo in settimana, il capo fa continuamente mobbing su diversi lavoratori (siamo una 40ina, nessuno che voglia fare vertenza) in vari modi, mi sono addirittura sentito sfottere per la mia invalidità. Le ore segnate sulla busta non sono mai quelle vere, sempre le 168 da CCNL, non ho un cartellino a dimostrazione delle ore che faccio. Vengo ripreso perché vado in bagno, o perché vado via all'orario da contratto anziché fermarmi. Mi hanno cambiato di mansione diverse volte senza mai comunicare nulla per iscritto.\n\nOra, io vorrei liberarmi da questa gabbia ma il lavoro sembra essere scomparso dalla mia provincia, sarei disposto a fare qualunque cosa pur di sfuggire a questo posto, ma trovo solo offerte incompatibili con la mia situazione fisica. Ho paura a denunciare perché in una piccola provincia ho paura di farmi il nome del piantagrane, e comunque in molte cose sarebbe la mia parola contro la loro.\nNon voglio tornare da mia madre, non alla mia età, sono in affitto e non ho una famiglia che mi possa sostenere economicamente.\n\nSto male, ogni giorno vivo il viaggio per andare a lavorare come fosse la passeggiata nel Miglio Verde, ho paura a fare la minima cosa perché potrei essere umiliato, perché la pubblica umiliazione è uno dei metodi preferiti dal capo per \"correggere\" gli errori.\nEro già sotto ansiolitici, ma adesso è peggiorata la situazione. Comincio a non avere voglia di mangiare, non riesco ad avere le energie per avere una vita sociale.\n\nAccetto qualunque suggerimento, anche se vi chiedo già scusa per il fatto che probabilmente mi sembrerà tutto impossibile.\nIn realtà mi fa stare già meglio aver comunicato ad altri la mia situazione.",
        "upvotes": 29,
        "comments": 11,
        "media": null,
        "permalink": "/r/Italia/comments/1gpmgb7/sono_intrappolato_in_un_lavoro_che_è_un_perfetto/"
    },
    {
        "id": "1gpfpzg",
        "author": "FreedomFighter6999",
        "title": "Ho cliccato male su un sito di scommesse e ho perso 600euro stamattina. AMA",
        "content": "Sono un mongolo come tanti e sta mattina ho perso 600eur\n\nAllievo il dolore con un AMA ",
        "upvotes": 96,
        "comments": 98,
        "media": null,
        "permalink": "/r/Italia/comments/1gpfpzg/ho_cliccato_male_su_un_sito_di_scommesse_e_ho/"
    },
    {
        "id": "1gpfdf2",
        "author": "lllllIIIIlllIIl",
        "title": "Sì alle nozze Ita-Lufthansa, il Mef firma l'accordo",
        "content": "",
        "upvotes": 78,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gmUjoMMyuRdzDp6inhPOQZ9l3Wyv7119KzzYugg_eCk.jpg?auto=webp&amp;s=a5f7174767ce77dc7b63d7ead8d333b6ffacdc9b"
        },
        "permalink": "/r/Italia/comments/1gpfdf2/sì_alle_nozze_italufthansa_il_mef_firma_laccordo/"
    },
    {
        "id": "1gpwif1",
        "author": "Whiite999",
        "title": "Perfavore aiutatemi, sono un portapizze in nero e ho litigato con la titolare. ",
        "content": "21M, vi incollo direttamente il messaggio che ho mandato a lei ovviamente tutto aninomo non voglio fare casino, e spero che nessuno che mi conosca lo legga. Premetto che la paga in teoria sarebbe 30€ l’ora dalle 19 alle 22. \n\nEcco il messaggio che gli ho mandato poco fa io a lei dopo che ho chiesto due sere di pausa e mi ha detto che una poteva darmela e l’altra no.\n\nNon mi sembra di chiedere tanto, sono solo 2 sere in cui devo stare in famiglia. In quasi 4 mesi non mi sono mai lamentato di niente, ne delle ore in piu non pagate, dato che tutto agosto mi avete sempre fatto venire alle 6.30 e non andavo via prima delle 22:30/23 ma ok. E anche altre volte tipo oggi, che alle 18:00 ero in pizzeria anzi che alle 19 e ho preso sempre la stessa paga. Mentre quando vi mette comodo a voi mi volete pagare a ore tipo una volta che sono andato via alle 21:30 ho preso 5€ in meno, mentre gli altri 34/50 giorni che ho fatto di piu prendevo uguale. Ne quando sono stato 20 giorni con le stampelle e adesso devo fare fisioterapia e speriamo che la mia caviglia torni come prima, dove ho detto che sono caduto per i cavoli miei e non mentre stavo portando due pizze, solo perchè non volevo mettervi nei casini a voi. \n\nDetto questo io vi voglio bene perché comunque siamo stati tanto assieme e siete sempre gentili con me, ma comunque io per queste cose mi sento preso per il culo e non mi va piu di essere trattato cosi, mentre da parte mia avete sempre trovato una persona gentile e disponibile.\n\n \n(si sono caduto perche uno mi ha tagliato la strada senza freccia e per evitarlo mi è finita la caviglia sotto la moto, 20 giorni di stampelle)\n\nAl che lei mi ha risposto con degli audio arrabbiata dicendo che si sente insultata che non mi devo permettere di lanciagli del fango addosso, che 30€ a sera sono piu che giusti dato che la moto e la benzina la pagano loro e dato xhe ogni sera mi sono potuto prendere una pizza a fine lavoro, o comunque qaualcosa avanzato sul banco. \n\nNon mi va di scrivere tutto, comunque io mi sento male, perché ho lavorato 4 mesi tutti i giorni tranne 4/5 sono stato sempre disponibile quando me lo chiedeva ho fatto straordinari (che non sono stati pagati) e ho sempre lavorato bene, appena chiedo se mi paga almeno 5€ le mezz’ore in piu mi sento attaccato e non mi va. \n\nSecondo voi è normale tutto questo? contratto o no mi sono comportato bene io? cosa ho sbagliato? chi ha ragione ed è giusto che mi attacchi cosi? \n\n",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/Italia/comments/1gpwif1/perfavore_aiutatemi_sono_un_portapizze_in_nero_e/"
    },
    {
        "id": "1gpw3qk",
        "author": "DiegoFerra",
        "title": "Smettiamo di dare del furbo a chi aggira le regole",
        "content": "https://blog.urbanfile.org/2024/11/12/milano-trasporti-m2-stop-ai-furbetti-del-cancelletto/?unapproved=184728&amp;moderation-hash=d4ab07b42fc9de41fe5877ad7a91299e#comment-184728\nPrendo spunto da questo articolo che chiama \"furbetti\" quelli che saltano i tornelli/usano la metro senza pagare. Si dovrebbero usare termini come incivili o disonesti. Finché chi aggira le regole è definito \"furbo\" la cosa sarà vista come più intelligente",
        "upvotes": 5,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-HmEPC4Vw3BbJHRUzCZLebnuBGOanRTiDLuX8t-CcYw.jpg?auto=webp&amp;s=e4a3ca122d6ed1b26521b31f85615237aaa495f4"
        },
        "permalink": "/r/Italia/comments/1gpw3qk/smettiamo_di_dare_del_furbo_a_chi_aggira_le_regole/"
    },
    {
        "id": "1gpgfd4",
        "author": "Acceptable-Driver473",
        "title": "Avete mai avuto un professore incompetente? Se sì, in che modo risulta esserlo?",
        "content": "Inizio io. Vado al classico e faccio il secondo anno. L'anno scorso in scienze mi è capitata una professoressa bravissima. Quest'anno però le hanno cambiato sezione e a noi è toccata una professoressa oggettivamente di merda. Per prima cosa, vorrei dire che non sa spiegare, ma il fatto è che non ci prova nemmeno:fa leggere a noi le cose sul libro e poi ci chiede di ripeterle il paragrafo letto, e se abbiamo dei dubbi si rifiuta di chiarirli. Aggiungo che la professoressa in questione ci insegna chimica, che non è una disciplina che comprendi al volo, e soprattutto servono degli esempi concreti per capirla, non basta leggere un libro di testo. Ma la cosa che la rende incompetente è il modo in cui interroga. Faccio un esempio realmente accaduto:ha interrogato una mia amica che erano le 8:55, quindi ha avuto il tempo di farle tre domande, a cui lei ha risposto correttamente, ma erano tre domande. Così lei ha chiesto con garbo di continuare l'interrogazione la settimana dopo. La professoressa dapprima ha rifiutato, poi la mia amica ha insistito e quindi lei ha acconsentito. Tutto bene, direte voi, peccato che quel pomeriggio la mia amica si sia ritrovata un 4 in scienze sul registro elettronico. Ma il motivo che mi ha spinto a scrivere questo post è quello più scandaloso:ha interrogato una ragazza in una prima della mia stessa sezione. L'interrogazione è andata benissimo, e questa ragazza ha anche ricevuto dei complimenti, quando a fine interrogazione la professoressa le ha chiesto quale fosse la sua media generale, e la media di questa ragazza era 5, e quello è stato il voto ricevuto per l'interrogazione. Perdonate il post chilometrico, ma dovevo veramente sfogarmi con qualcuno. Grazie per l'attenzione, in ogni caso.",
        "upvotes": 50,
        "comments": 115,
        "media": null,
        "permalink": "/r/Italia/comments/1gpgfd4/avete_mai_avuto_un_professore_incompetente_se_sì/"
    },
    {
        "id": "1gpu2ce",
        "author": "mrkdsgn",
        "title": "È a norma?",
        "content": "Sto acquistando casa ed è presente una grata in giardino con questo scalino. Il costruttore, ovviamente, mi dice che è a norma ma alcuni operai mi hanno invitato a controllare. Voi cosa ne dite? Eventualmente dovrei far aggiungere nel contratto di acquisto una dichiarazione che tutti i lavori rispettano le norme di sicurezza, secondo voi è possibile?",
        "upvotes": 6,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wz4gu7o32j0e1.jpeg?auto=webp&amp;s=65ebb81d42eafa07db1db724c589958107782fff"
        },
        "permalink": "/r/Italia/comments/1gpu2ce/è_a_norma/"
    }
]