[
    {
        "id": "1pk1m27",
        "author": "LiteraryBoner",
        "title": "Introducing the Fantasy Box Office Game: Two years ago I met a redditor who was running a Fantasy Box Office League game from an Excel spreadsheet and now it’s a fully functional website. Get ready for the 2026 Box Office year with us!",
        "content": "# [fantasyboxofficegame.com](http://fantasyboxofficegame.com)\n\n\n\nJust want to start off by stating that this is not a paid ad and this website is totally free to use.\n\n\n\nTwo years ago I was looking for a way to get more nerdy about movies. I love fantasy football and had heard of some similar games centered around the box office, so I did some googling and found a post on reddit from u/Chris_Tennant saying that he had made a game that runs off of Google Sheets. I messaged him and we ended up chatting on discord and he said it was a work in progress but he was looking for people to play it and give feedback. So I put a couple leagues together, two leagues with my coworkers and one with some other r/movies mods, and long story short we had an absolute blast with it. \n\n\n\nChris has been working on this thing like crazy since then and this last year he upgraded it from a Google Sheet to a \\[website\\](fantasyboxofficegame.com). It looks great and is really intuitive. This year I’m running four leagues and it’s been a wild year for the BO and anyone who follows the news will tell you it’s only going to get more unpredictable. Here’s how the game works.   \n  \n\n\n**The game consists of three drafts throughout the year, one every four months, in which you draft movies only for the coming four months. Jan-Apr, May-Aug, Sep-Dec.**\n\n\n\n**When you select a movie you take on the burden of 2.5x that movie’s budget upon release.**\n\n\n\n**So if you pick a movie with a budget of 100mil, you get negative 250mil when that movie comes out and then gain the box office for its entire theater run as it happens.** \n\n\n\n**There are essentially three different kinds of draft picks.**\n\n* **The Hit Pick. One movie chosen from the entire calendar year that you are betting on to make all the money. You only get one of these per year. You will probably want a major blockbuster.** \n* **Seasonal Picks. 3-4 of these per draft, so 9-12 total. This will make up the bulk of your roster. You can adjust how many depending on how many people are in your league or whatever rules you want.** \n* **The Bomb Pick. This is a pick that you think will** ***lose*** **a lot of money, and it goes to all of your opponents rosters instead of yours. You only get one of these per year and they are chosen during the first draft, much like the Hit Pick.** \n\n  \nAs the movies on your roster release, you take on their negative budget and watch it slowly climb back up as it continues to make money. Here’s what our current season looks like:\n\nhttps://preview.redd.it/ytyge9jcol6g1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=be324efdcbc56169cc020cb951cb4c1bbe09c8b5\n\n\n\nEach of those datapoints is clickable to see what movie release it is and you can see the numerical stats here (please do not roast me for picking Snow White, no Disney Live Action Remake had lost money before this):\n\nhttps://preview.redd.it/f60anpkdol6g1.png?width=1045&amp;format=png&amp;auto=webp&amp;s=6592e4adcef2789259f7305b5371fa5028095a16\n\nWe have been playing this for two years now and the drafts are always so fun and unpredictable and there’s a surprising amount of strategy to it. You don’t always know budgets this far in advance so you have to gamble a bit on which studios are more conservative with their budgets and realistically how expensive movies look.   \n  \nSo get some friends together or organize a league here in the comments with other redditors. **It’s totally free** and if you’re a movie nerd like me then I can vouch that this really adds a lot of fun and investment to every release!",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/movies/comments/1pk1m27/introducing_the_fantasy_box_office_game_two_years/"
    },
    {
        "id": "1pjb7p8",
        "author": "appletv",
        "title": "Hi Reddit! We’re Joseph Kosinski and Jerry Bruckheimer, the filmmakers behind F1® The Movie, Ask us anything on December 12th @ 11am PT / 2pm ET!",
        "content": "Hi Reddit!\n\nIt’s Joseph Kosinski and Jerry Bruckheimer here, the filmmakers behind F1® The Movie.\n\nGet behind the wheel with us on Friday, Dec. 12 at 11 a.m. PT / 2 p.m. ET! We’ll be answering your questions about making the film, from the technical challenges of capturing real Formula 1® racing to working with actual F1® drivers, and everything in between.\n\nhttps://preview.redd.it/98dzqap56f6g1.jpg?width=5712&amp;format=pjpg&amp;auto=webp&amp;s=eca14003eec35cdf9f830d68cf6933cc2607ada8",
        "upvotes": 41,
        "comments": 51,
        "media": null,
        "permalink": "/r/movies/comments/1pjb7p8/hi_reddit_were_joseph_kosinski_and_jerry/"
    },
    {
        "id": "1pjz12z",
        "author": "ThaddeusJP",
        "title": "The iconic ‘Home Alone’ house is being renovated by its new owner (The interior is being restored to match its appearance in the original 1990 film)",
        "content": "",
        "upvotes": 3045,
        "comments": 193,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JkjAgfHwap79JfvKUbFwDp3BUqXd7jT1UG91f2ZYq2s.jpeg?auto=webp&amp;s=42dce4f982edf3770d5ab1d06cdad28c4776436a"
        },
        "permalink": "/r/movies/comments/1pjz12z/the_iconic_home_alone_house_is_being_renovated_by/"
    },
    {
        "id": "1pjztxc",
        "author": "MarvelsGrantMan136",
        "title": "Jim Ward, the Voice of Captain Qwark in 'Ratchet &amp; Clank' (Video Games &amp; Movie), Doug Dimmadome &amp; Chet Ubetcha in 'The Fairly OddParents' and More, Dies at 66",
        "content": "",
        "upvotes": 488,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hifbdlT_d6j5bD3H5XqfE5wef0v7_TVM52A4iFE_2Jg.jpeg?auto=webp&amp;s=0b1592aa4d22b5a07c84eabc0466182234981b03"
        },
        "permalink": "/r/movies/comments/1pjztxc/jim_ward_the_voice_of_captain_qwark_in_ratchet/"
    },
    {
        "id": "1pjwsai",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Tim Blake Nelson - Monday 12/15 at 2:00 PM ET - Actor in 'O Brother, Where Art Thou?\", 'Lincoln', 'The Ballad of Buster Scruggs', 'The Testament of Ann Lee', 'Holes, 'Captain America: Brave New World', 'Old Henry', 'Watchmen', 'Syriana', and much more.",
        "content": "",
        "upvotes": 588,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/i2mfqormnk6g1.png?auto=webp&amp;s=8c3ff879e7f6879a477d557d714224038a115197"
        },
        "permalink": "/r/movies/comments/1pjwsai/amaqa_announcement_tim_blake_nelson_monday_1215/"
    },
    {
        "id": "1pjjohz",
        "author": "MarvelsGrantMan136",
        "title": "Jennifer Lawrence, Josh Hutcherson to Return for ‘Hunger Games: Sunrise on the Reaping’",
        "content": "",
        "upvotes": 4768,
        "comments": 271,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/L2z0cG_tzainLyhvB-QooNebVYqv3vrftA0dGz-Tekc.jpeg?auto=webp&amp;s=f558bc5d9a8f8e732bae9da15140dd667396b208"
        },
        "permalink": "/r/movies/comments/1pjjohz/jennifer_lawrence_josh_hutcherson_to_return_for/"
    },
    {
        "id": "1pj7t9c",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'Supergirl'",
        "content": "",
        "upvotes": 31155,
        "comments": 2295,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7wgdxs5kqe6g1.jpeg?auto=webp&amp;s=1f8837b8c5b0f6deab471dd25c519d73492bd344"
        },
        "permalink": "/r/movies/comments/1pj7t9c/official_poster_for_supergirl/"
    },
    {
        "id": "1pjj2wy",
        "author": "MarvelsGrantMan136",
        "title": "’28 Years Later III’ Moving Forward At Sony: Cillian Murphy In Talks, Alex Garland Penning",
        "content": "",
        "upvotes": 2652,
        "comments": 315,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FIv64C-yfs0K_eh7hiXA4a98sd6ZsG_2SRQ2DL-gkcU.jpeg?auto=webp&amp;s=a55385c9c924d5e8fddeb6dc6d78f23c02460b77"
        },
        "permalink": "/r/movies/comments/1pjj2wy/28_years_later_iii_moving_forward_at_sony_cillian/"
    },
    {
        "id": "1pjsdgu",
        "author": "Shiny-Tie-126",
        "title": "A new billboard for Spielberg’s next UFO movie has appeared in New York City, it also teases the film’s release date, June 12, 2026",
        "content": "",
        "upvotes": 477,
        "comments": 83,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YciLJ6hX3SkaTPM--fRYoYq23R1LVy2o7nepN2oGf2w.jpeg?auto=webp&amp;s=208922e0f4b7266803ea74951701badf7b5076d1"
        },
        "permalink": "/r/movies/comments/1pjsdgu/a_new_billboard_for_spielbergs_next_ufo_movie_has/"
    },
    {
        "id": "1pjpd6p",
        "author": "Kilordes",
        "title": "Random thoughts about John Wick (2014) and the chop shop scene",
        "content": "Re-watching the scene with Aurelio and Tarasov: the first few times I watched these scenes I was thinking of it as Aurelio owing John respect, and being disgusted by Tarasov's behavior. But re-watching it now, I realize that Aurelio is absolutely *terrified*. He realizes that if John thinks for a moment that he's helped Tarasov that he's dead, whereas if he humiliates Tarsov and kicks him out at least he has a chance of surviving Viggo's wrath. Both the scenes with Tarasov and the scenes with John he's basically making the case for his life, just in different ways.\n\nIt's easy to miss because John doesn't show any overt hostility towards Aurelio but part of Reeves' performance is he doesn't often show that, and the (apparently) calm drinking scene where Aurelio pours John a drink and they have the brief conversation about Tarasov is still one fraught with tension.\n\nAurelio's anxiousness is most evident when Tarasov first shows up with the car. It's not just Aurelio being disdainful of Tarasov, he's acutely aware that now he's involved, and knows that John's going to show up at some point. And if John thinks Aurelio helped Tarasov that he's a dead man. It's honestly a fantastic performance from Leguizamo, an all time great character actor, demonstrating a mix of emotions that I think often gets overlooked. It's honestly kind of amusing that he's demonstrating less fear during the conversation with Viggo (although not none) than he is when he's talking to Tarasov.",
        "upvotes": 757,
        "comments": 82,
        "media": null,
        "permalink": "/r/movies/comments/1pjpd6p/random_thoughts_about_john_wick_2014_and_the_chop/"
    },
    {
        "id": "1pjydg1",
        "author": "Melanismdotcom",
        "title": "The Moment | Official Trailer HD | A24",
        "content": "",
        "upvotes": 134,
        "comments": 61,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BWhgPJ9hZJRVOMV_WDlypdJLYovMQMKxtTe124cZAZI.jpeg?auto=webp&amp;s=45fd590180a766c2dadb603cc2a458aad1160d69"
        },
        "permalink": "/r/movies/comments/1pjydg1/the_moment_official_trailer_hd_a24/"
    },
    {
        "id": "1pjl3qz",
        "author": "yaboijaredd1996",
        "title": "Peter Jackson’s “King Kong” is still unmatched.",
        "content": "This movie is absolutely excellent in my opinion; I think it’s one of Peter Jackson’s best films, right alongside The Lord of the Rings. It’s perfect in pretty much every way. I love the directing, the acting, the actors, the score, and the locations. The CGI for the time looked phenomenal back in 2005 and still holds up incredibly well today. I know that the film’s length was and still is controversial, but I actually don’t mind it. I personally think that the buildup to Skull Island is well done, and I think the whole movie was paced fairly well overall - with the first hour being in New York City and on the ship, the second hour on the island, and the third and final hour back in New York with Kong causing chaos. What do you all think? I think this is still the best version of Kong; I wish the newer movies had kept the 2005 design.\n\nEdit - this is in no way a diss to any of the other films; I like King Kong no matter what, and they're all good in their own ways. I just personally find this one, in my opinion, to be the best. I love having discussions like this and seeing the discussions; it's super awesome to be able to talk about these things with people who are just as passionate about movies as I am. The overall consensus does appear to be that I'm right about this, though.",
        "upvotes": 961,
        "comments": 338,
        "media": null,
        "permalink": "/r/movies/comments/1pjl3qz/peter_jacksons_king_kong_is_still_unmatched/"
    },
    {
        "id": "1pjfz2i",
        "author": "MarvelsGrantMan136",
        "title": "First Images from 'The Weight' Starring Ethan Hawke and Russell Crowe - In 1930s Oregon, Samuel (Hawke) is a battle-scarred veteran who takes a dangerous job smuggling a fortune in gold across the wilderness to save what remains of his family.",
        "content": "",
        "upvotes": 1274,
        "comments": 94,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0v5dzy2v3g6g1.jpeg?auto=webp&amp;s=0eee5237c107eb8721b1bd43f9527326553c8d39"
        },
        "permalink": "/r/movies/comments/1pjfz2i/first_images_from_the_weight_starring_ethan_hawke/"
    },
    {
        "id": "1pjbal6",
        "author": "MarvelsGrantMan136",
        "title": "Jeffrey Garcia, the Voice of Sheen in 'Jimmy Neutron: Boy Genius', Dies at 50",
        "content": "",
        "upvotes": 1998,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ChCuOieB3DPVOG54TCm9kddYJOzNwsQAT1ISEtFJFE0.png?auto=webp&amp;s=967f2b0c37cdf6f78b873dcdd2a7cc91a9f1c482"
        },
        "permalink": "/r/movies/comments/1pjbal6/jeffrey_garcia_the_voice_of_sheen_in_jimmy/"
    },
    {
        "id": "1pjfl3h",
        "author": "BunyipPouch",
        "title": "Francis Ford Coppola's 'Megalopolis' Returning to Theaters on New Year's Day Exclusively at Alamo Drafthouse Locations",
        "content": "",
        "upvotes": 875,
        "comments": 230,
        "media": null,
        "permalink": "/r/movies/comments/1pjfl3h/francis_ford_coppolas_megalopolis_returning_to/"
    },
    {
        "id": "1pjxivz",
        "author": "YourChopperPilotTTV",
        "title": "Puss in Boots: The Last Wish directed by Joel Crawford (2022) Del Mar",
        "content": "",
        "upvotes": 48,
        "comments": 40,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/1cfqsn5ztk6g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1pjxivz/puss_in_boots_the_last_wish_directed_by_joel/"
    },
    {
        "id": "1pjl03s",
        "author": "ubcstaffer123",
        "title": "Disney composer Alan Menken: ‘I won my first Oscar, then Howard Ashman told me he was dying’",
        "content": "",
        "upvotes": 380,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/f8Q3sdrprCYHF_3eubptMmYNQXWbe77BO5GvrXjmEqw.jpeg?auto=webp&amp;s=25ca3f6ad4ad87104eedb82444c09ed2cfef65e6"
        },
        "permalink": "/r/movies/comments/1pjl03s/disney_composer_alan_menken_i_won_my_first_oscar/"
    },
    {
        "id": "1pj9pfe",
        "author": "ChiefLeef22",
        "title": "Ryan Coogler discusses why he turned down the invitation to join The Academy, saying he finds it stressful to judge other people's work, and is more drawn to the everyday, blue-collar elements of filmmaking than to glamorous ballrooms",
        "content": "",
        "upvotes": 1501,
        "comments": 41,
        "media": null,
        "permalink": "/r/movies/comments/1pj9pfe/ryan_coogler_discusses_why_he_turned_down_the/"
    },
    {
        "id": "1pjbils",
        "author": "EuphoricButterflyy",
        "title": "First image of ‘BUDDY’, a new horror movie starring Cristin Milioti, Topher Grace and Michael Shannon. The film follows a girl and her friends who must escape a demented kids TV show.",
        "content": "",
        "upvotes": 1064,
        "comments": 86,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9r2tuc0cef6g1.jpeg?auto=webp&amp;s=65902a94e44b50b3ab7232abf7c729ada3dee85f"
        },
        "permalink": "/r/movies/comments/1pjbils/first_image_of_buddy_a_new_horror_movie_starring/"
    },
    {
        "id": "1pj91xt",
        "author": "darth_vader39",
        "title": "Ramin Djawadi to Score DC Studios’ ‘Supergirl’",
        "content": "",
        "upvotes": 1191,
        "comments": 95,
        "media": null,
        "permalink": "/r/movies/comments/1pj91xt/ramin_djawadi_to_score_dc_studios_supergirl/"
    },
    {
        "id": "1pjjmu7",
        "author": "UniverslBoxOfficeGuy",
        "title": "'Ella McCay' - Review Thread",
        "content": "*Set in an unnamed state in 2008, an idealistic 34-year-old lieutenant governor juggles familial issues and a challenging work life while preparing to take over the job of her mentor, the state's longtime incumbent governor, who suddenly accepts a cabinet position in the incoming Obama administration.*\n\nCast: Emma Mackey, Jamie Lee Curtis, Jack Lowden, Woody Harrelson, Rebecca Hall\n\nRotten Tomatoes: 21%\n\nMetacritic: 41\n\nSome reviews:\n\nJocelyn Noveck, Associated Press 1/4 - It’s hard to understand how “Ella McCay,” the first original feature from writer-director Brooks in 15 years, goes so utterly haywire. Is this really the same mind that wrote the memorable “Broadcast News”? “Terms of Endearment”? “As Good As It Gets”?\n\nJohnny Oleksinski, New York Post 1/4 - This sloppy slog is terrible; short, but interminable.\n\nMoira MacDonald, Seattle Times 2.5/4 - It’s not at all unpleasant spending two hours with Ella and her family and colleagues, but it leaves you feeling a little nostalgic for what it could have been.\n\nRadheyan Simonpillai, Globe and Mail - Ella McCay, the movie, feels like we’re being bear hugged by a lovable, slightly boozy old grand-uncle who genuinely hopes to find common ground with a new generation, but also can’t help being a little patronizing.\n\nNick Schager, The Daily Beast - Its phoniness epitomized by Emma Mackey’s lead turn, it’s the biggest dud of the artist’s career, and the holiday season’s most egregious misfire.\n\nOdie Henderson, Boston Globe 2/4 - Ella McCay never registers as a real person; she’s a collection of tics that Mackey desperately tries to play.\n\nVikram Murthi, IndieWire B - Watching “Ella McCay” can sometimes feel like time travel, particularly for those vested in bygone eras of American filmmaking, but if you’re capable of tuning into its wavelength, an old but worthwhile spirit can be found.\n\nTim Robey, Daily Telegraph (UK) 1/5 - There’s not a great deal more to be said about the experience, except that it is best politely avoided, like a Christmas invitation from neighbours you find chirpy, well-meaning and off-puttingly strange on every collision.\n\nTara Brady, Irish Times 3/5 - At 85, Brooks retains an instinct for human foibles and complex characters, even if on this occasion the material doesn’t always live up to his cast.\n\nTim Grierson, Screen International - This comedy-drama contains some of the crackling dialogue and disarming candour of Brooks’ best work. Ultimately, however, this disjointed character study ultimately feels as messy as its heroine’s life.\n\nAdrian Horton, Guardian 2/5 - Ella McCay is, first and foremost, a mess -- a clunky collection of incoherent characters and confounding plot that seem to defy basic story logic at every turn, and not in a surprising or intriguing way.\n\nWilliam Bibbiani, TheWrap - 'Ella McCay' is a film about American politics in the same way that Pixar’s 'Cars' is a movie about cars. As in yes, these are definitely films about politics and cars. But no, politics and cars don't work like that.\n\nDavid Rooney, The Hollywood Reporter - Almost everyone here is trying way too hard, with the exception of Mackey, who’s appealing and natural even when stuck in a phony world full of phony characters.\n\nTaylor Williams, Slant Magazine 2/4 - As it follows its main character navigating political and personal waters, James L. Brook’s film finds itself poised between sincerity and artificiality\n\n\nRotten Tomatoes page:\nhttps://www.rottentomatoes.com/m/ella_mccay\n\nMetacritic page:\nhttps://www.metacritic.com/movie/ella-mccay/",
        "upvotes": 327,
        "comments": 99,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mGBn66B6ZbqPWPSbtQpN_72VQavbxG0gbY9tYov2aRQ.jpeg?auto=webp&amp;s=8aab0462623f76af9be4c4bc358460424f969b5f"
        },
        "permalink": "/r/movies/comments/1pjjmu7/ella_mccay_review_thread/"
    },
    {
        "id": "1pjnvdk",
        "author": "KevinRobertsUSA",
        "title": "What is the Sweatiest Movie?",
        "content": "What do you think is the sweatiest movie of all time? By that I mean what movie did the characters sweat the most in? An argument could be made for Ben Hur as the guys in that galley were clearly sweating buckets, however there is a lot of sweat in the Rocky movies as well as Alien. I could also see a case for Body Heat or Sweat City, which even has sweat in the name. What movie do you think wins the title of sweatiest film of all time?",
        "upvotes": 169,
        "comments": 571,
        "media": null,
        "permalink": "/r/movies/comments/1pjnvdk/what_is_the_sweatiest_movie/"
    },
    {
        "id": "1pj3aqq",
        "author": "Comic_Book_Reader",
        "title": "The Drama | Official Teaser HD | A24",
        "content": "",
        "upvotes": 2070,
        "comments": 517,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JQBLipAvA24aBpjkiIzywZ85DLqr9imb5U0W2ucbgWQ.jpeg?auto=webp&amp;s=d7f5d6aab4e2ff00f918d05c854cd6e597643fb1"
        },
        "permalink": "/r/movies/comments/1pj3aqq/the_drama_official_teaser_hd_a24/"
    },
    {
        "id": "1pjcqgi",
        "author": "BaronGikkingen",
        "title": "New poster for John Woo's HARD BOILED, in theatres January with exclusive new interview",
        "content": "Tickets on sale now for Hard Boiled (January 25-28), A Better Tomorrow (March 1-4) and The Killer (April 5-9) \n\nMore info here: [https://collider.com/john-woo-movies-theatrical-re-release-2026-hard-boiled-a-better-tomorrow-the-killer/](https://collider.com/john-woo-movies-theatrical-re-release-2026-hard-boiled-a-better-tomorrow-the-killer/)",
        "upvotes": 663,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5fdafkbemf6g1.jpeg?auto=webp&amp;s=a23a254daefae2c50636d5f2f3aa38d77da9cb9c"
        },
        "permalink": "/r/movies/comments/1pjcqgi/new_poster_for_john_woos_hard_boiled_in_theatres/"
    },
    {
        "id": "1pjvwa8",
        "author": "LaserDiscCurious",
        "title": "\"Fear\" (1996): A teen male-led version of FATAL ATTRACTION with Mark Wahlberg as a sadistic \"bunny boiler\" obsessed with Reese Witherspoon. Maybe not as antertaining as it seems but still a enjoyable thriller",
        "content": "I have mixed feelings about FEAR. I liked Reese Witherspoon's performance a lot, her Nicole was relatable and pleasant but her character does some dumbass decisions which were frustrating to watch and the main family is weird. The dad (William Petersen) is creepy, at one point he's checking out his daughter's teen best friend (Alyssa Milano in full vixen mode), and the stepmom (Amy Brenneman) calls her stepdaughter a bitch because she came iin late. Not to mention, when the new boyfriend gets invited to the home, the stepmom is in a bikini, getting awfully close to her stepdaughter's boyfriend. Those plot threads made me wonder if the movie was going to say the family was problematic but it was like Cape Fear, left unresolved. \n\nMark Wahlberg committs himself to playing a psychotic meathead who is dangerously obsessed with Witherspoon, at one point he masturbates her during a roller coaster ride. \n\nIt's not as thrilling or exciting as Fatal Attraction because the movie drags a lot and then it turned into a home invasion movie. \n\nWitherspoon is good and Milano is fun in a small but important part. The parents were too weird. Wahlberg does a good job in playing a psycho though he makes it too obcvious. Right from the start, you know he's nutso.",
        "upvotes": 23,
        "comments": 21,
        "media": null,
        "permalink": "/r/movies/comments/1pjvwa8/fear_1996_a_teen_maleled_version_of_fatal/"
    },
    {
        "id": "1pjxkgt",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Jim Cummings - Saturday 12/13 at 3:00 PM ET - Filmmaker &amp; actor known for 'Thunder Road', 'The Last Stop In Yuma County', 'The Wolf of Snow Hollow', 'The Beta Test', and 'Corey Feldman vs The World'",
        "content": "",
        "upvotes": 17,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1z57an1cuk6g1.png?auto=webp&amp;s=7353a620ff49c1f4611fa0090db736a6686aab37"
        },
        "permalink": "/r/movies/comments/1pjxkgt/amaqa_announcement_jim_cummings_saturday_1213_at/"
    },
    {
        "id": "1pjnjr0",
        "author": "stellifer_arts",
        "title": "The Producers (1967) directed by Mel Brooks - a producer and his accountant (played by Zero Mostel and Gene Wilder) are eagerly watching the debut of their theatrical production that is designed to fail so as to scam their investors for $$$$$",
        "content": "",
        "upvotes": 96,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/otqtky9-YWa26soZG-6PUYd4fBJ9vEUEAxK-UMOhJck.jpeg?auto=webp&amp;s=074917d245cabc9d03fa8367d4173f7b00af4fdd"
        },
        "permalink": "/r/movies/comments/1pjnjr0/the_producers_1967_directed_by_mel_brooks_a/"
    },
    {
        "id": "1pjzgrg",
        "author": "darth_vader39",
        "title": "German theatrical poster for the 25th anniversary restoration of Edward Yang’s Yi Yi | The film opens in Germany on December 18 via Rapid Eye Movies",
        "content": "",
        "upvotes": 10,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3o3oe1lc9l6g1.jpeg?auto=webp&amp;s=a231f66fcc37be089151335f5b4939d02c3eeda7"
        },
        "permalink": "/r/movies/comments/1pjzgrg/german_theatrical_poster_for_the_25th_anniversary/"
    },
    {
        "id": "1pj23bl",
        "author": "BunyipPouch",
        "title": "Kevin Smith Talks ‘Dogma’ Rebirth &amp; How His His New ‘Jay and Silent Bob’ Film Was Derailed - In a candid conversation, the filmmaker discusses his history with Affleck and Damon, the feature he'll shoot in 2026 and wishing he'd concentrated \"on being more of a \"financial success\" during his career.",
        "content": "",
        "upvotes": 1258,
        "comments": 365,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BZU39hV0ukkYxViM1W-M7eup-i2a9hQZSSly8CSqKzg.jpeg?auto=webp&amp;s=a8aa52ec8f0c94082b5b7546ac394052433857c9"
        },
        "permalink": "/r/movies/comments/1pj23bl/kevin_smith_talks_dogma_rebirth_how_his_his_new/"
    },
    {
        "id": "1pjha1y",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Thomasin McKenzie - Monday 12/15 at 4:10 PM ET - Actress in 'Jojo Rabbit', 'Last Night In Soho', 'The Testament of Ann Lee', 'The Power of the Dog', 'Leave No Trace', 'Eileen', 'Old', 'The King', and lots more.",
        "content": "",
        "upvotes": 193,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4afrrwxqhg6g1.png?auto=webp&amp;s=2ae5da175a3384c29e41c31b5aa8a55be79c5fe6"
        },
        "permalink": "/r/movies/comments/1pjha1y/amaqa_announcement_thomasin_mckenzie_monday_1215/"
    }
]