[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 484,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1h24oeh",
        "author": "techfinpro",
        "title": "Netflix Issues New Adults-Only Warning for ‘Stranger Things’ Ahead of Season 5",
        "content": "",
        "upvotes": 241,
        "comments": 98,
        "media": null,
        "permalink": "/r/netflix/comments/1h24oeh/netflix_issues_new_adultsonly_warning_for/"
    },
    {
        "id": "1h1x1rm",
        "author": "S4v1r1enCh0r4k",
        "title": " China censored LGBT Scenes in Arcane Season 2, the scenes west saw were starkly different ",
        "content": "",
        "upvotes": 199,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1h1x1rm/china_censored_lgbt_scenes_in_arcane_season_2_the/"
    },
    {
        "id": "1h2h42x",
        "author": "biggs1199",
        "title": "Rhythm and flow ",
        "content": "If this season was going to be this terrible they should have just canceled the series. That’s the thing that pisses me off about Netflix, when a series deserves to be cancelled they don’t and when a series doesn’t deserve to be cancelled it is. Im still trying to figure out why KAOS was cancelled…",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h2h42x/rhythm_and_flow/"
    },
    {
        "id": "1h2h0r6",
        "author": "billiondollartrade",
        "title": "Why tf does Netflix keep making good as shows just to cancel the dam show 2 seasons later ! ! And then allow the trash shows to go for seasons on seasons! ",
        "content": "For the Love of God, so many shows that are actually good and they just be dropping those but “ oh no let’s keep the trash show about some stupid comedy or sx “ anything damn sex related is all they give a fck about. ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1h2h0r6/why_tf_does_netflix_keep_making_good_as_shows/"
    },
    {
        "id": "1h2deqa",
        "author": "Fluffy-Isopod7469",
        "title": "How do I  get Netflix to work at a second home? Need help ",
        "content": "So I read that you had to go to the primary home, sign into Netflix at that home from the Wi-Fi with your phone, stream something, then go back to the second home, stream something on that homes Wi-Fi, then it should work on the TV.\n\nWell I did that and it’s still showing “This TV isn’t apart of your Netflix household” on my TV.\n\nHow the hell do I fix this?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h2deqa/how_do_i_get_netflix_to_work_at_a_second_home/"
    },
    {
        "id": "1h27ixu",
        "author": "443610",
        "title": "How “Senna” meticulously recreated every detail of F1 legend's life - from cars to racing suits",
        "content": "",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h27ixu/how_senna_meticulously_recreated_every_detail_of/"
    },
    {
        "id": "1h2gb2w",
        "author": "fufa_badmash",
        "title": "Comment Section on Netflix?",
        "content": "What if Netflix added comment section like YouTube where viewers could leave comments on individual episodes, movies, or entire series, similar to YouTube?\n\nImagine the possibilities:\n\n* Fans could discuss their favourite scenes, share theories, and point out Easter eggs.\n* Mini-reviews and recommendations would help you decide what to watch next.\n* Community-driven conversations could make Netflix feel more interactive and social.\n\nBut... there’s also the downside:\n\n* Spoilers everywhere!\n* Would it distract from the “lean-back” streaming experience Netflix is known for?\n\nWould this be a game-changing feature or just unnecessary noise?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1h2gb2w/comment_section_on_netflix/"
    },
    {
        "id": "1h2ga9g",
        "author": "shakha",
        "title": "Have there been any updates on Mo season 2?",
        "content": "This show is difficult to look up info on. I googled it and accidentally spent quite a bit of time reading about The Mole! So, where is season 2? When is it coming?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h2ga9g/have_there_been_any_updates_on_mo_season_2/"
    },
    {
        "id": "1h2cuuf",
        "author": "spookysteely",
        "title": "Ads don't play unless Netflix tab selected?",
        "content": "I just noticed something weird today on my laptop. When an ad is playing and I click off the tab, netflix auto pauses the content, and doesn't begin playing it again until I manually press play in the tab again. \n\n  \nIt doesn't auto-pause actual content when I click off the tab, just the advertisement. Has anyone else noticed this? Was this a new change just added?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h2cuuf/ads_dont_play_unless_netflix_tab_selected/"
    },
    {
        "id": "1h19gp5",
        "author": "TheLaraSuChronicles",
        "title": "Netflix kids' movie, Spellbound slammed by parents for 'normalizing' divorce and 'pushing for family separation'",
        "content": "",
        "upvotes": 305,
        "comments": 124,
        "media": null,
        "permalink": "/r/netflix/comments/1h19gp5/netflix_kids_movie_spellbound_slammed_by_parents/"
    },
    {
        "id": "1h1zk63",
        "author": "ontario-guy",
        "title": "Kids missing almost all shows?",
        "content": "I’m not sure if it’s an issue with my Firestick or Netflix…when I loaded it up this morning there was the 5 featured shows, one row of shows, and then just a row of kids characters. I think there were only like 10 different shows and the search wouldn’t bug up the shows that were there yesterday. It’s the same in iOS.\n\nAnyone else seeing issues like this? I can’t imagine Netflix is intentionally removing 90%+ of their kids shows. (I’m in Canada FWIW)",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h1zk63/kids_missing_almost_all_shows/"
    },
    {
        "id": "1h1p1d2",
        "author": "JinJaDubstep",
        "title": "Best ACTUALLY SCARY movies on Netflix currently?",
        "content": "What are some of the best actually scary movies on Netflix currently? Not a fan of slow burn movies or creepy movies. looking for movies with a lot of \"scary\" parts (ie - conjuring 2, smile 2, evil dead rise)",
        "upvotes": 23,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1h1p1d2/best_actually_scary_movies_on_netflix_currently/"
    },
    {
        "id": "1h279h6",
        "author": "RidleyMCI",
        "title": "Netflix Payment Method changed without my knowledge",
        "content": "Has anyone ever had their Netflix payment method change to someone else’s they know for seemingly no reason?\n\nSo I was going through my finances and realised I hadn’t been charged for Netflix in quite some time, but I’ve been using it no problem. I log on to my account on the website and the payment method is a card I don’t recognise. As far as I knew, I hadn’t been hacked. \n\nThe only thing I could think of is that a while ago, I logged out of my Uncle’s Netflix account on his smart TV, and into my own. I then went into my emails and found an email I missed that said my payment details had been changed, around 2 weeks after I logged into my uncle’s TV. I didn’t think he could’ve done it because he’d have needed my password to change the payment method, as I don’t think you can do it in the TV app and I didn’t write my password down anywhere. But when I called him, he confirmed it was his card. He hasn’t been paying for double Netflix or anything, he didn’t even notice. I have no idea how this has happened. \n\nMy uncle is not a tech genius in the slightest so I genuinely don’t think he would’ve been able to hack my password, nor do I think he would try to do that. I’m just concerned that mine and/or his details have been compromised. Is there an explanation for this? Could he have changed the payment details without my password without realising he was logged into my account? \n\nEdit: I should also say that the only reason this flagged to me is that I stopped paying for my Netflix several months ago as I barely used it, only to log onto to find it was working again. And that’s when I discovered the unfamiliar bank details that turned out to be my uncle’s.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h279h6/netflix_payment_method_changed_without_my/"
    },
    {
        "id": "1h26ddn",
        "author": "Romulo_und_Remo",
        "title": "Can I change my icon to one from the Profile Icon history?",
        "content": "I want to change mine to one from Arcane but I'm currently using the Dedenne icon and I don't want to lose it since the Pokemon Concierge icons are not available anymore. Would I be able to pick it from my history?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h26ddn/can_i_change_my_icon_to_one_from_the_profile_icon/"
    },
    {
        "id": "1h1m7ro",
        "author": "beeemmvee",
        "title": "Buy Now!",
        "content": "Wow.\n\nI knew some of this but had no idea how far it actually went. The slime of humanity is truly revealed. \n\nThis is a must see for every human consumer on the planet. \n\n  \n",
        "upvotes": 29,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1h1m7ro/buy_now/"
    },
    {
        "id": "1h235la",
        "author": "ok_raspberry_jam",
        "title": "Funny spelling mistake on \"Ransom\" description",
        "content": "\"A skilled crisis and hostage negotiator uses his knowledge of human behavior to **DIFFUSE** dangerous situations all over the world.\"  \n  \nAll over the whole world! Like a fine mist. Someone stop this man.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1h235la/funny_spelling_mistake_on_ransom_description/"
    },
    {
        "id": "1h2cei5",
        "author": "No_Significance_573",
        "title": "Are people really able to just download a movie or show right off Netflix?",
        "content": "I see that button for download but didn’t think that literally meant “since you have this subscription you can just download what you’re watching onto your current device.” Is it?\n\n  \nI saw a quick comment saying it may depend on the plan you have(?) or it doesn’t work like that anymore, but it seems odd that you could let’s say download a movie that would otherwise be leaving Netflix but you now have it on your device. Like is that what’s really happening? I always wondered.",
        "upvotes": 0,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1h2cei5/are_people_really_able_to_just_download_a_movie/"
    },
    {
        "id": "1h1tvbh",
        "author": "bore-ito",
        "title": "Mortel Season 3??",
        "content": "I don’t think I’ve seen  any recent posts but I’ve been waiting for the new season since 2022 I think. Is there any news on when it’ll come out?? I hope it hasn’t been canceled…\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h1tvbh/mortel_season_3/"
    },
    {
        "id": "1h1qocj",
        "author": "Agreeable_Car_9778",
        "title": "How do I watch netflix outside of my home?",
        "content": "So I bought netflix in my country before leaving and right now I am in another country for my studies, but today it suddenly told that since the wifi I use is not same as my household wifi ill only be able to watch netflix for another 14 days on mobile before it told me to do something on my home TV which I didn't quite understand, could someone help me I dont quite understand what that means?",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1h1qocj/how_do_i_watch_netflix_outside_of_my_home/"
    },
    {
        "id": "1h15qyp",
        "author": "healthyF0X",
        "title": "The docuseries My Wife, My Abuser highlights the enormous challenges faced by male victims of domestic abuse",
        "content": "",
        "upvotes": 35,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1h15qyp/the_docuseries_my_wife_my_abuser_highlights_the/"
    },
    {
        "id": "1h24xf4",
        "author": "_iamNumberTWO_",
        "title": "Proud of my Top 10",
        "content": "From top, then left to right.\n\nSuggest better TV shows and I shall watch them and see whether any new ones can break my solid 10.\n\nHouse of Cards is by far my top TV show, although Peaky Blinders do have some better seasons in general. Prison Break sits at 4 only because of its very solid first two seasons. Could be replaced with BB.\n\nServant is definitely top 10. Dark could be ranked higher. My 6-10 could actually be mixed up.\n\nLet me know your thoughts?",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1h24xf4/proud_of_my_top_10/"
    },
    {
        "id": "1h1jlhw",
        "author": "DustinFreeman",
        "title": "Few Kids TV shows disappeared from Kids profile.",
        "content": "Few of the TV shows my Kids watch disappeared from their profile that was set to TV-Y 7 rating content. They came back after I bumped up the profile to allow contents with TV-G rating.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h1jlhw/few_kids_tv_shows_disappeared_from_kids_profile/"
    },
    {
        "id": "1h1jjzb",
        "author": "T2p2xx",
        "title": " Loading/buffering Nightmare",
        "content": "Every time I click on an episode of a show the sound starts playing but it’s stuck on the black screen with the red buffering circle. I have to back out multiple times and come back in before it plays. Sometimes I have to reload Netflix for it to work. I don’t get it. I do the “check your network” in Netflix and it says internet connection, servers 1 &amp; 2, and connection speed are all good. I’ve deleted the application and reinstalled it on the Fire Stick. None of the other applications have issues. Is anyone else experiencing this issues? Does anyone have any suggestions on fixing it? ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h1jjzb/loadingbuffering_nightmare/"
    },
    {
        "id": "1h1bn8b",
        "author": "CarmenFiFi",
        "title": "many titles missing from netflix kids",
        "content": "i have a netflix kids profile set up on a few of our devices. today the kids tried to watch their usual shows and i noticed very few titles are coming up, including netflix originals like gabby’s dollhouse. anyone else experiencing something similar? i checked across devices and it’s the same on all. \n\ni also noticed they added several “playlists” with some of these missing shows’ episodes in them but nothing comes up when i search the titles. ",
        "upvotes": 6,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1h1bn8b/many_titles_missing_from_netflix_kids/"
    },
    {
        "id": "1h1swtd",
        "author": "ukstandup",
        "title": "Netflix’s I Will Find You is Coming, and It Sounds Like a Must-Watch\n",
        "content": "Big news for thriller fans! Netflix has officially greenlit I Will Find You, the first U.S. scripted series from bestselling author Harlan Coben. If you have been craving a heart-pounding, twisty story, this one is going to keep you glued to your screen.  \n  \nThe plot is already giving me chills. An innocent father, serving a life sentence for the murder of his son, discovers new evidence that his child might actually still be alive. What does he do? Break out of prison to find the truth. It is packed with mystery, suspense, and enough emotional weight to keep you hooked.\n\nMore info at  \n[https://www.jonn.co.uk/2024/11/netflixs-i-will-find-you-is-coming-and.html](https://www.jonn.co.uk/2024/11/netflixs-i-will-find-you-is-coming-and.html)",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h1swtd/netflixs_i_will_find_you_is_coming_and_it_sounds/"
    },
    {
        "id": "1h1lq74",
        "author": "boubou64",
        "title": "Video quality - throttling ",
        "content": "Watching Netflix regular plan no ads. Don't bother with premium because just us and a 1080p tv. Why should I bother with premium subscription?  I've been noticing pixely picture and tested my speed and it's very fast so it wasn’t bandwidth. I thought to change my plan to premium just to find out once and for all. It was almost instantaneous!.  Same internet speeds. Beautiful full HD tv netflix picture. That feels wrong. They say premium for 4k and more screens. Regular is advertised for 1080p. Looks like Netflix is throttling the regular service.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h1lq74/video_quality_throttling/"
    },
    {
        "id": "1h1krcd",
        "author": "Aggressive_Duck_1",
        "title": "Vizio TV Issue",
        "content": "Hi! I’m trying to set up Netflix on my Vizio TV but it is not working. Here’s a list of what I’ve done.\n\n1. Plug in TV, sign into Wi-Fi, go to Netflix (which is pre-installed and has a button on the controller.)\n2. Put in email and password several times, none of which worked. Every time it says something along the lines of “This password is wrong, try again” etc etc.\n3. Call Vizio support. Factory Reset TV, test Wi-Fi, everything. Nothing is working and I’m getting the same message.\n4. Reset Netflix password. Still get the same error message. Assume it’s a Netflix issue.\n\nAny ideas?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h1krcd/vizio_tv_issue/"
    },
    {
        "id": "1h1kkkh",
        "author": "lambdaIuka",
        "title": "My Moto 5G Stylus 2023 cannot use Netflix. It just goes to a black screen whenever I want to watch something, but I hear audio and see subtitles.",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h1kkkh/my_moto_5g_stylus_2023_cannot_use_netflix_it_just/"
    },
    {
        "id": "1h0zd7h",
        "author": "Thejoe923",
        "title": "Is it me or Netflix does not have a big variety of “good” comedy series? ",
        "content": "I watched: \nThe office ( both ), Brooklyn99, Superstore, Loudermilk, Tires, Shamless, Derry Girls, Big mouth, I think you should leave, Afterlife and Cunk on earth. Am i missing any other good showes?? ",
        "upvotes": 19,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1h0zd7h/is_it_me_or_netflix_does_not_have_a_big_variety/"
    },
    {
        "id": "1h17a5j",
        "author": "Beau_bell",
        "title": "Canceled show that don't feel too incomplete ",
        "content": "Another Life and Away are both shows you can watch and feel satisfied by the last episode despite it being canceled, and despite having plans for more. What other Netflix shows are like this? ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h17a5j/canceled_show_that_dont_feel_too_incomplete/"
    }
]