[
    {
        "id": "1otnjmm",
        "author": "RM-PostMatchSurveys",
        "title": "[Post-Match Survey] Real Madrid 0-0 Rayo Vallecano",
        "content": "",
        "upvotes": 13,
        "comments": 3,
        "media": null,
        "permalink": "/r/realmadrid/comments/1otnjmm/postmatch_survey_real_madrid_00_rayo_vallecano/"
    },
    {
        "id": "1otauls",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 10,
        "comments": 1326,
        "media": null,
        "permalink": "/r/realmadrid/comments/1otauls/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1ovs7s9",
        "author": "No-Independent2522",
        "title": "While every post here is about our great decline, enjoy a meme",
        "content": "",
        "upvotes": 304,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/tfzom6pggy0g1.jpeg?auto=webp&amp;s=1a0b388abcf0dbae837d279f51cdfe468f274acc"
        },
        "permalink": "/r/realmadrid/comments/1ovs7s9/while_every_post_here_is_about_our_great_decline/"
    },
    {
        "id": "1ovb6lf",
        "author": "soldier101br",
        "title": "Arsenal U16 players had the chance to meet the Madrid stars Vini Jr. and Rodrygo after the seleção training session",
        "content": "",
        "upvotes": 248,
        "comments": 13,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ovb6lf/arsenal_u16_players_had_the_chance_to_meet_the/"
    },
    {
        "id": "1ov766u",
        "author": "ItsKBS",
        "title": "Toni Kroos on Arda Guler being his successor: \"I think he’s definitely a player you can build on for the future. But I don’t really like to make comparisons – Arda is a different type of player than I am. His best position is clearly more attacking, so it’s not really about being a successor.\"",
        "content": "",
        "upvotes": 369,
        "comments": 48,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/1xd1x32w9u0g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ov766u/toni_kroos_on_arda_guler_being_his_successor_i/"
    },
    {
        "id": "1ov21vb",
        "author": "Violet_Kitty_room319",
        "title": "Carlo Ancelotti on Jude Bellingham's attitude",
        "content": "Lots of people have said this about Bellingham. The full interview was posted today on [The rest is football](https://www.youtube.com/watch?v=HbEhbOtwsvY), he also talks about player egos, the Brazil team, evolving his management style &amp; a bit about Xabi Alonso.",
        "upvotes": 622,
        "comments": 73,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/24vfcn1d2t0g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ov21vb/carlo_ancelotti_on_jude_bellinghams_attitude/"
    },
    {
        "id": "1ov7lhb",
        "author": "TheFeatherDiaries",
        "title": "Beautiful Camera angle of Arda's last minute run vs Rayo Vallecano",
        "content": "",
        "upvotes": 275,
        "comments": 40,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/jbp168w1du0g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ov7lhb/beautiful_camera_angle_of_ardas_last_minute_run/"
    },
    {
        "id": "1ovhki6",
        "author": "soldier101br",
        "title": "Vini Jr. And Carlo Ancelotti talking during the open training session of the Seleção",
        "content": "According to the Tati Mantovani,TNT Brasil repórter that covers Madrid in general and thats currently Covering the seleção during this National Duty,today was dedicated to more orientations Since the whole group got reunited now with the Arrival From PH,Fabrício Bruno and Vitor Roque,wich came late due to brasileirão Matches. In special, Ancelotti had 2 moments of direct orientation to Vini on this open training session. Still about the training session,The Team was divided in 3 groups to play the standard dummy circle,before moving to a more reserved Pitch on Arsenal Training ground. ",
        "upvotes": 80,
        "comments": 27,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/cwvb58ov5w0g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ovhki6/vini_jr_and_carlo_ancelotti_talking_during_the/"
    },
    {
        "id": "1ovf04e",
        "author": "PlantComprehensive77",
        "title": "It's honestly scary how predictable our attack is.",
        "content": "Just watched a La Liga video on all the goals we've scored so far in the 25/26 season, and I'm shitting my pants at how predictable our attack is. \n\n95% of the goals we've scored so far are either penalties or counter-attacks, with an occasional longshot. \n\n\\- We don't score from set pieces\n\n\\- We don't score headers\n\n\\- We barely score from crosses (low or high)\n\n\\- We don't score tap-ins\n\n\\- We don't score from possession play \n\nOur attack is so incredibly one-dimensional. We made a Liverpool defense that  got fucked in the ass by Haaland and Doku look like prime Milan. Anyone who thinks this type of attacking play is sustainable is mentally ill. ",
        "upvotes": 103,
        "comments": 92,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ovf04e/its_honestly_scary_how_predictable_our_attack_is/"
    },
    {
        "id": "1ovd314",
        "author": "No-Independent2522",
        "title": "The club has unveiled a new corporate image for the Santiago Bernabéu stadium, featuring a logo that highlights the profile of the stadium’s futuristic exterior and shortens its name from Santiago Bernabéu to simply Bernabéu",
        "content": "",
        "upvotes": 73,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q0UeTD6ls1_zXTEdDW6y_dERjoKZmjf_YNfE7rCRHS0.jpeg?auto=webp&amp;s=cb673df8e17da75a419e1fbbdf515ad655cb8586"
        },
        "permalink": "/r/realmadrid/comments/1ovd314/the_club_has_unveiled_a_new_corporate_image_for/"
    },
    {
        "id": "1ouxr2z",
        "author": "More-Judgment-9253",
        "title": "Endrick Passing/ Central Play",
        "content": "Since they don't have any good attackers at Lyon endrick's definitely gonna be a starter, and he's most likely gonna be scoring a lot imo. I still don't think he can be a ST here for now though, he's gonna have to play on the RW.  \nCredit: Douba on twitter",
        "upvotes": 266,
        "comments": 53,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/p70yvg65qr0g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ouxr2z/endrick_passing_central_play/"
    },
    {
        "id": "1ov3615",
        "author": "Puzzleheaded-Delay60",
        "title": "This fanbase has become our own worst enemy and it needs to stop, we are all on the same team.",
        "content": "This club has arguably the worst fanbase when it comes to supporting our own players and backing the manager. Just look at other teams that are having a worst season than us, Liverpool literally won the league last season and now they have lost 6 games in a row and are out of the title race and yet I don't hear any slot out, sell this player and sell that player nonsense. \n\nWe only lost two games and drawn one so far this season but the way this fanbase is acting you would think we are in relegation. Everything seems blown out way of proportion and all its doing is feeding into the tabloids/medias hands to create a narrative about how the locker room is in disarray and all those clips in the Rayo game is just proving my point. Just wait until after the international break when we start to win games again how all these \"issues\" just vanish and all the xabi out and player fc hating fans go quiet, it happened after we lost to Atletico Madrid and we bounced back just fine. \n\nlosing to Liverpool in the champions league is not the end of the world as we are still in the top 8, all we need to do is learn from our mistakes and move on. We are so much better than last season, and yet still finding our new identity, its not perfect but we are heading in the right direction.",
        "upvotes": 79,
        "comments": 57,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ov3615/this_fanbase_has_become_our_own_worst_enemy_and/"
    },
    {
        "id": "1ov7xyu",
        "author": "Slowpokebread",
        "title": "Let's talk about a good and balanced right side",
        "content": "Both of our last games got a lot to do with the right side attack now working. Especially the Liverpool game.\n\nIn 23-24 Cavajal was on his prime, Valverde did a lot to cover for him.\n\nI think Valverde did well in the Valencia game, but in the Liverpool game he rarely came up. and Jude wasn't on the right side either. Both Diaz and Rodrygo proved they are not good starters on the right.\n\nWith TAA back, we can use Valverde as Right midfielder again, but TAA isn't some typical full back who just run into space and cross, we need to change the system if we want to use him well.\n\nEndrick certainly can bring some good attack since he can run, dribble and charge into the box. It's just he needs to learn more about pass combination/run back to help defense. I do think he deserves more chances compare to Rodrygo on the right.",
        "upvotes": 26,
        "comments": 22,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ov7xyu/lets_talk_about_a_good_and_balanced_right_side/"
    },
    {
        "id": "1ov7r5k",
        "author": "1Fils",
        "title": "Who would you prefer to be the freekick taker permanently for the team ?",
        "content": "I’ve been watching the last couple of seasons and the current one closely, and one thing that comes to mind is the inconsistency in our freekick takers. We’ve got decent players in the squad that can take that role permanently —Güler, Trent, Mastantuono, Rodrygo, Mbappe (if he perfects it and stays consistent).\n\nHistorically, we’ve had legends like Cristiano, Roberto carlos who filled that role when needed. Personally, I think it’s time we settle on one player be a constant threat from set pieces.",
        "upvotes": 22,
        "comments": 43,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ov7r5k/who_would_you_prefer_to_be_the_freekick_taker/"
    },
    {
        "id": "1ova1v1",
        "author": "estagingapp",
        "title": "Why Xabi's Attacking Structure Fell Flat Against Rayo Vallecano – Tactical Analysis",
        "content": "",
        "upvotes": 16,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1Cs8SVO7JetPia28jP9gBOXpFTUUUHioxDT9du4nHSY.png?auto=webp&amp;s=0655a3c98f5a20f1368941468f9decfe3637a05b"
        },
        "permalink": "/r/realmadrid/comments/1ova1v1/why_xabis_attacking_structure_fell_flat_against/"
    },
    {
        "id": "1oue980",
        "author": "chunchunmaru1129",
        "title": "Only the true madridistas will remember this goal.🔥",
        "content": "",
        "upvotes": 907,
        "comments": 77,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/rm17455ton0g1.jpeg?auto=webp&amp;s=128fb1bf4e59aeb8e8ad728298862a3c6f555c2c"
        },
        "permalink": "/r/realmadrid/comments/1oue980/only_the_true_madridistas_will_remember_this_goal/"
    },
    {
        "id": "1ov0y6t",
        "author": "Bini_9",
        "title": "The obsession with individual players in this place, what is up with that?",
        "content": "Every season this place becomes obsessed with certain players and their lack of playtime. \n\nI've seen users demanding for Brahim to get more playing time in previous seasons. And when he got and gets to start, he doesn't perform. \n\nPeople wanted Rodrygo to play more on the left, he gets to play there some matches and doesn't perform. He hasn't performed for a very long time now. \n\nPeople demanded for Guler to start. He plays well against low blocks but is a liability in the big matches and in matches with high tempo or physical play. \n\nCamavinga is/was talked about like the solution to our issues in the midfield. But he hasn't shown it, he's very inconsistent. More bad performances than good, and he's injured too often. \n\nNow it's Endrick. He's the answer to all the problems according to users here. The fact is that he has shown that he is very raw and has been injured for a while. \n\nIt makes me wonder why this is. Why do the users here think that certain individuals will fix everything? \n\nIs this place filled with very young users? Is it years of the club relying on individuals to win us titles that has lead to this discourse?",
        "upvotes": 28,
        "comments": 42,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ov0y6t/the_obsession_with_individual_players_in_this/"
    },
    {
        "id": "1ou7atn",
        "author": "TheFeatherDiaries",
        "title": "Xabi Alonso furious after Vinicius loses ball in 1 vs 3 dribble : '' Pass it, pass, pass, PASS! GOD DAMN IT.\"",
        "content": "",
        "upvotes": 1388,
        "comments": 345,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/e5zd9vuh7m0g1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ou7atn/xabi_alonso_furious_after_vinicius_loses_ball_in/"
    },
    {
        "id": "1oufulh",
        "author": "cyrusmancub",
        "title": "Real Madrid and Lyon are finalizing a six-month loan for Endrick",
        "content": "",
        "upvotes": 408,
        "comments": 82,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oufulh/real_madrid_and_lyon_are_finalizing_a_sixmonth/"
    },
    {
        "id": "1ounn5t",
        "author": "Footboler",
        "title": "Player Power vs Xabi Alonso",
        "content": "Another man utd problem loading at Real. It will take minimum 7 years for this player power caused consequences to be fixed. The board must draw the line now, either you follow the manager or ship out . There can be no compromise on this . This is a  dangerous time for the club. Fans must back the manager too\n\nSecondly the game is getting tactical and the era of relying on individual brilliance is gone. Big Clubs understand this and this is why they are going for younger tactical managers . You must adapt and change or perish ",
        "upvotes": 153,
        "comments": 123,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ounn5t/player_power_vs_xabi_alonso/"
    },
    {
        "id": "1ou97tz",
        "author": "No-Independent2522",
        "title": "Real Madrid Legend, Hall of Famer, attacker, midfielder, Defender, GK, President, socio Eduardo Camavinga celebrated his 23rd birthday tonight at with his France teammates",
        "content": "",
        "upvotes": 696,
        "comments": 22,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/fvkjgsmxom0g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ou97tz/real_madrid_legend_hall_of_famer_attacker/"
    },
    {
        "id": "1ouidya",
        "author": "More-Judgment-9253",
        "title": "Gonzalo Garcia- CWC Compilation",
        "content": "Did all this just to rot on the bench😔",
        "upvotes": 217,
        "comments": 49,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zmqlk8h4fo0g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ouidya/gonzalo_garcia_cwc_compilation/"
    },
    {
        "id": "1ouewy7",
        "author": "More-Judgment-9253",
        "title": "Lack of team control:  Vini says he doesn't want long balls, play properly.  Güler didn't even know when to jump into the press, and Camavinga didn't know when to attack. Huijsen says we're two against one, help out. Mbappe says in attack, we're always down a man.",
        "content": "Do you guys think this is bad for Xabi? To me I think these are very worrying signs if the players are confused and don't know when to press, complaining about the attack, and the lack of  buildup.  This is the translation from twitter btw, I'll put the link:  [(20) (fan) REAL MADRID FANS 🤍 on X: \"🗣️ ](https://x.com/AdriRM33/status/1988230151910682923)",
        "upvotes": 238,
        "comments": 77,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/qpb5ly2orn0g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ouewy7/lack_of_team_control_vini_says_he_doesnt_want/"
    },
    {
        "id": "1oubgic",
        "author": "Ready_Ad_1353",
        "title": "Thomas Tuchel: “I'm delighted that Bellingham has returned, he comes back as a 10. I think that's his best position. One of his strengths is to score from this position. He scores ‘#9 goals’ &amp; tap-ins which is unusual for a 10. It seems easy, but to arrive in position at the right time is difficult”",
        "content": "",
        "upvotes": 325,
        "comments": 49,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/35we6Jcit6tbxLiwxLtcg9LSm50aHx0s8ImXA_NQPCg.jpeg?auto=webp&amp;s=1a38bd8e46657e8e3d8c8d63a75f44918094dada"
        },
        "permalink": "/r/realmadrid/comments/1oubgic/thomas_tuchel_im_delighted_that_bellingham_has/"
    },
    {
        "id": "1oul342",
        "author": "Special_Virus851",
        "title": "Trent Alexander Arnold",
        "content": "still our best signing(according to me)",
        "upvotes": 85,
        "comments": 23,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/bsk6r66dxo0g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1oul342/trent_alexander_arnold/"
    },
    {
        "id": "1oufkfp",
        "author": "Mastermind_737",
        "title": "Much different team now. The aerial game is no longer an option with this starting squad/current system, yet hope isn't lost. Before and after for those unaware of the difference. 3rd image is my opinion of what should change.",
        "content": "This is a basic comparison. When breaking down teams in a low block our old team was almost perfect. Which is why we would have often 4+ goal scorelines. It was a solid structure that allow a bombardment of crosses and insurance to stop the counter. \n\nNow we only have Jude as a threat in the box, but very fast and technical players with Valverde in midifeld and Mbappe and Vini. We can no longer lean on the aerial attack, but in the building department of Benzema holding the ball and playing it through to Ronaldo and Bale stays the same. Jude will fill that role and provide that outlet to Mbappe and Vini. \n\nVini now with an actual crossing option will have to be defended more closely giving him more opportunities to be dangerous. Going down the line to cross to Jude, cutback to arda/Valverde, or to use the space in between to go for himself. The same applies to Mbappe who actually is much more efficient when shooting across goal on the right like his most recent el clásico goal. If Vini and Mbappe swap wings, they most certainly will create a headache for defenders. \n\nAnd when we are in dire need of a goal, that switch of Arda for Gonzalo and pairing Gonzalo and Jude in the box will work wonders. \n\nWe no longer are an aerial based team, but we have the components to spread the field and be dangerous. Xabi needs to experiment more until we have a proper structure in attack. I appreciate his usage of Masantouno/Brahim, but we have Mbappe we will perform a much better job in creating danger on that right side and Jude we will perform an even better job in being strong and protecting/blocking out the centerbacks creating space for the team to score. Lemme know what y'all think. ",
        "upvotes": 137,
        "comments": 54,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oufkfp/much_different_team_now_the_aerial_game_is_no/"
    },
    {
        "id": "1ounfbe",
        "author": "ManuMora98",
        "title": "[Fem] Real Madrid 1 - 1 Paris FC | Weir 97'; Azzaro 40' (p) | Weir saves a point after the team missed very clear chances om the first half, 7 points out of 9 | Women's CL Match Day 3",
        "content": "",
        "upvotes": 41,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gu5ugo8fdp0g1.jpeg?auto=webp&amp;s=83fd5ec6a083283c0bd5f70a1fd203b0f2e1a080"
        },
        "permalink": "/r/realmadrid/comments/1ounfbe/fem_real_madrid_1_1_paris_fc_weir_97_azzaro_40_p/"
    },
    {
        "id": "1oud24z",
        "author": "tzaje",
        "title": "Gymnastics legend Nadia Comăneci wears a Jude signed Real Madrid shirt during an event in home country Romania. In 2026 there will be 50 years since her perfect 10, a world first in Olympic gymnastics.",
        "content": "",
        "upvotes": 123,
        "comments": 4,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oud24z/gymnastics_legend_nadia_comăneci_wears_a_jude/"
    },
    {
        "id": "1ouh2uu",
        "author": "Critical-Remove-1878",
        "title": "At this point of the season, the last time we had brought a new coach: 3D, 1L in La Liga + a home loss to some team from Moldova",
        "content": "I think that interchanging between Ancelotti-Zidane for a decade, with small breaks inbetween, has made people forget how it's like to appoint a completely NEW manager, who hasn't managed the team again or wasn't an assistant manager previously.\n\nWhen Ancelotti was brought in 2021, at that point of the season we had dropped points in 4 La Liga games in 12, not 2/12. We also lost 1-2 to Sheriff Tiraspol at home, one of the most shocking results in the history of the competition. We barely managed to get a 3-3 draw at home vs Levante, with Vini scoring in the 85th minute. We barely won 2-1 vs Valencia, with two goals after the 85th minute again. Of course, none of it mattered in the end, because we won the league and the UCL.\n\nWhen Zidane had his first full season on his 2nd tenure (19/20), we had 4D, 1L in 12 league games, even worse than 21/22 and we hadn't even faced Barcelona. In the UCL we got completely destroyed by PSG (3-0) and then drew 2-2 at home vs Club Brugge. We won La Liga too at that season btw.\n\nRight now we had lost our two toughest fixtures of the first half of the season (Atletico away, Liverpool away) and just dropped 2 points against a team that are usually tough to play against.\n\nA large part of the difficult schedule is gone. In the UCL we face a winless team away, then Man City at home, then Monaco at home and then Benfica (with 0 points right now) away. That's at least 3 wins if we play our normal football. In La Liga we've faced 5/7 teams that are 2nd-8th right now and we won 4/5 of those games. Look at our record against top 6-8 La Liga teams last season and this will put a smile on your face. ",
        "upvotes": 55,
        "comments": 17,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ouh2uu/at_this_point_of_the_season_the_last_time_we_had/"
    },
    {
        "id": "1otyaa3",
        "author": "KabiX2",
        "title": "Since Courtois is injured I think it's good time to repost this",
        "content": "",
        "upvotes": 892,
        "comments": 25,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/79bbrk83mj0g1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1otyaa3/since_courtois_is_injured_i_think_its_good_time/"
    }
]