[
    {
        "id": "1ltte8p",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Larry Charles - Tuesday 7/8 at 3:00 PM ET - Director of 'Borat', 'Bruno', 'The Dictator', 'Dicks: The Musical', 'Religulous' - Writer on 'Seinfeld', 'Curb Your Enthusiasm'",
        "content": "",
        "upvotes": 37,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/t1ipo0rp8gbf1.png?auto=webp&amp;s=8e6cfcfbc060becd8c1990f8e8e5243912541d77"
        },
        "permalink": "/r/movies/comments/1ltte8p/amaqa_announcement_larry_charles_tuesday_78_at/"
    },
    {
        "id": "1lu8bkm",
        "author": "SanderSo47",
        "title": "July 4-6 Box Office Recap – 'Jurassic World Rebirth' opens with a fantastic $147.8M domestically and $322.6M worldwide on its first five days. Meanwhile, 'F1' reaches almost $300M worldwide and becomes Apple's biggest film at the box office.",
        "content": "https://preview.redd.it/gaqv8rk75jbf1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=d006313609133fa978537c52a8d1d185b3009d57\n\nIt was a weekend for fireworks and dinosaurs.\n\n***Jurassic World Rebirth*** opened with a monster $322 million worldwide, showing there's still power in this franchise after 30 years. And while ***F1*** took a rough drop in the domestic market, it's still a hit overseas, as the film is nearing $300 million worldwide and officially became Apple's highest grossing film ever.\n\nThe Top 10 earned a combined $152 million this weekend. That's 0.2% up from last year, when ***Despicable Me 4*** debuted atop.\n\nDebuting at #1, ***Jurassic World Rebirth*** debuted with $92 million in 4,308 theaters. Adding in its numbers from Wednesday and Thurday, the film earned an incredible $147.8 million. This is hard to compare with the previous ***Jurassic World*** films, as all films opened on Friday. So just for reference; ***Fallen Kingdom*** earned $148 million on its first 3 days, and ***Dominion*** made $145 million.\n\nWhat does this debut suggest? What everyone always knew: people love dinosaurs. And that has always been the franchise's biggest advantage. There are no other dino franchises currently, which has allowed Universal to cater to an audience that wants to see these monsters in the big screen. There's a lot of franchises that have experienced fatigue, but the ***Jurassic*** clearly is still beloved 32 years later after its debut in theaters.\n\nThe film had a very rushed production; it was officially announced in January 2024, although a script was written for quite some time. Gareth Edwards was hired one month later, when the current release date was already set. So basically the film was reported, filmed and released in the span of just 18 months. That's very short for a blockbuster. But then again, audiences don't pay much attention to productions. What they care for is if the film looks interesting or catches their interest, and Universal achieved it. They sold it as a \"back to basics\" film, choosing to just abandon all characters from the prior films and focus on new characters, played by Scarlett Johansson, Mahershala Ali, Jonathan Bailey. Turns it out all worked out.\n\nAccording to Universal, 61% of the audience was male. The films are popular with families, although ***Rebirth*** starts to point that it's losing some young audience members. Only 36% of the audience was 25 and under, which is below ***Fallen Kingdom*** (56%) and ***Dominion*** (41%). At the end of the day, that's pretty much imminent when your franchise is 30 years old.\n\nSo yes, everything worked out in the end. Well, almost everything. What did ***Rebirth*** fail at? Reception. Critics were unimpressed with the film, giving it a mediocre 52% on RT. Somehow, that was an improvement over the past two films, but that's still not a good score. Regardless, the debut suggests the audience was still excited to watch the film. But the film's word of mouth indicates that this will play very, very differently, and that's another thing were ***Rebirth*** failed.\n\nAudiences gave ***Jurassic World Rebirth*** a very weak \"B\" on CinemaScore, which is very poor for a blockbuster. That's worse than any of the ***Jurassic World*** films, and it's the second lowest in the franchise, just above ***Jurassic Park III*** (\"B–\"). This is an indication that audiences are not content with the film. It's hard to point to a domestic total prediction given that this is a 5-day debut, but with high competition like ***Superman*** and ***The Fantastic Four: First Steps*** arriving, it's very likely the film will continue the franchise's decline at the box office. Definitely a success, but it's gonna put a lot of pressure on the next film.\n\nLast week's champ ***F1*** added $25.7 million this weekend. That's a rough 55% drop from last week, but when you have a juggernaut like ***Jurassic World***, a drop like that is pretty much imminent. Through 10 days, the film has amassed $109.2 million domestically, the first Apple title to hit that milestone. There's still heavy competition on its way, but ***F1*** should still have enough gas left to hit $160 million domestically.\n\nIn third place, ***How to Train Your Dragon*** dipped 43%, adding $11.2 million this weekend. That took its domestic total to $224.2 million, finally becoming the franchise's biggest film in the domestic market.\n\nThere doesn't appear to be any signs of life in Disney/Pixar's ***Elio***. It dropped 45% and made just $5.7 million. That drop is barely better than last week, indicating word of mouth isn't really doing anything to save the film. The film has made an abysmal $55 million so far, and it's going to struggle to hit $65 million at this rate.\n\n***28 Years Later*** remained at #5, although it still dropped 53% and added $4.5 million this weekend. At least that's better than last week's steep 67% drop, but it's still rough. The film has already earned $60.2 million, and it should finish with around $67 million domestically.\n\n***M3GAN 2.0*** continued disappointing on its second weekend. The film collapsed a poor 61%, earning just $3.9 million this weekend. That's far worse than the original's second weekend drop (a very light 39.8%). The sequel has earned a very poor $18.7 million, which is a colossal 68% behind the original through the same point. With more competition on its way, it's highly likely the film will finish with less than $25 million domestically.\n\n***Lilo &amp; Stitch*** dropped 45% and earned $3.8 million. The film has amassed $408.5 million so far.\n\nIn eighth place, ***Mission: Impossible – The Final Reckoning*** eased just 34% and added $2.7 million this weekend. The film's domestic total stands at $191.1 million, and it will soon pass ***Rogue Nation*** ($195 million) to become the fourth biggest film in the franchise.\n\n***Materialists*** had another rough drop this weekend. This time, it dropped 55% and added $1.3 million. That took its total to $33.5 million.\n\nRounding out the Top 10 was the 41st anniversary re-release of ***This Is Spinal Tap***. It earned $1 million from 1,015 theaters, taking its lifetime gross to $5.7 million. Man, it should've made $1.1 million, come on.\n\n#**OVERSEAS**\n\n***Jurassic World Rebirth*** debuted with $174 million overseas, for a monster $322.6 million worldwide debut. China was its biggest debut with $41.5 million, which is the biggest for a Hollywood title this year. However, it should be noted that the film was quite front-loaded in the market amidst poor word of mouth. Other strong debuts were seen in the UK ($16.6M), Mexico ($13.9M), Germany ($7.6M), South Korea ($7.4M), Spain ($6.5M), Australia ($5.9M), India ($5.5M/best of franchise), France ($5.3M) and Italy ($4.7M).\n\nAll the ***Jurassic World*** films have cracked $1 billion, but don't expect the same to happen to ***Rebirth***. Not only was it lower than ***Dominion*** $392 million worldwide debut, but most of these debuts were all from 5-day debuts, which is boosting its numbers. For now, a $800 million worldwide total is likely. Another success in the franchise, but it will continue marking another decline.\n\n***F1*** was impacted domestically, but it continues killing it overseas. Despite the arrival of ***Rebirth***, the film dipped just 38% and added $56.3 million overseas, taking its worldwide total to $293 million. It's already Apple's biggest film worldwide. In China, the film had an insane 2% second weekend drop, which is the best for a Hollywood title this year, and now the film is set to massively over-perform in the market. The best markets are China ($22M), the UK ($17.3M), Mexico ($12.3M), France ($11.5M) and Australia ($9.8M). Assuming it keeps holding very well, the film should definitely pass $450 million worldwide.\n\n***How to Train Your Dragon*** added $21 million overseas, taking its worldwide total to $519 million. The best markets are China ($35.5M), Mexico ($33.4M), the UK ($24.6M), Brazil ($17.2M) and France ($14.2M). It has already passed the original film's worldwide gross, and by tomorrow it will pass ***The Hidden World*** ($520 million).\n\n***28 Years Later*** added $7 million overseas, allowing it to cross $125 million worldwide. The UK has been its biggest market, unsurprisingly, earning $17 million so far. The film should finish with around $140 million worldwide.\n\nContinuing its absolutely pathetic run in pretty much every territory, Disney/Pixar's ***Elio*** made $6.7 overseas, taking its worldwide total to just $97.7 million worldwide. The best markets are France ($4.7M), the UK ($4.1M), South Korea ($3.6M), China ($3.5M) and Mexico ($2.8M). 3 weeks in and a Pixar title still hasn't cracked $100 million worldwide. What a time to be alive.\n\n***Lilo &amp; Stitch*** added $6.1 overseas, taking its worldwide total to $972 million. That allowed it to finally pass ***A Minecraft Movie*** as the year's second highest grossing film, just behind ***Ne Zha 2***. The best markets are Mexico ($66.5M), the UK ($48.3M), France ($40.5M), Brazil ($36.5M) and Germany ($30.8M).\n\nWith $3.9 million overseas, ***Mission: Impossible – The Final Reckoning*** has officially passed ***Dead Reckoning*** worldwide with a $576.1 million total, becoming the fourth biggest film in the franchise.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*A Minecraft Movie* | Apr/4 | Warner Bros. | $162,753,003 | $423,949,195 | $954,928,702 | $150M\n\n- *A Minecraft Movie* has closed its run with a fantastic $954 million worldwide. Considering the insanely negative response to its first teaser, it's still a sign of the brand's strength that it could make almost $1 billion. Of course, the film's legs were very mediocre (2.60x is not great at all for family films, given those easily pass 3x), which is a sign that they weren't fully satisfied by the film itself. Whenever the sequel comes up, they must deliver something better than this, quality-wise.\n\n#**THIS WEEKEND**\n\nA new era of DC begins this weekend.\n\nThat's because it's the arrival of DC's ***Superman***, the first film in the new DC Universe (DCU). Written and directed by James Gunn, it stars David Corensweet as the Man of Steel, and it follows Superman's journey to reconcile his alien heritage with his adoptive human family. To say that expectations are high for this film is selling it short. As previously mentioned, this is gonna kick off a new DC Universe, after the DCEU had the insane distinction of having 8 box office flops in a row. And that's not even including the absolute misfire of ***Joker: Folie à Deux***. Needless to say, the brand is at an all-time low and ***Superman*** will need to win over people. With a high $225 million budget and an extensive marketing campaign, this film really needs to be a home run for the sake of DC.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 54,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/u5G-BUhw-Vcgp9aUmeWslLrW3Rgsz6McvdI0CNWIsao.png?auto=webp&amp;s=9a469a3b2d530dd36c12c0fef3bbb468132a12c1"
        },
        "permalink": "/r/movies/comments/1lu8bkm/july_46_box_office_recap_jurassic_world_rebirth/"
    },
    {
        "id": "1lu90a7",
        "author": "MarvelsGrantMan136",
        "title": "Denis Villeneuve Will Shoot All of ‘Dune Messiah’ in IMAX",
        "content": "",
        "upvotes": 8107,
        "comments": 452,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6JwDinPYbCLc5uT6va5LR5k3-nbK3QZjOPkEZIX-_eg.jpeg?auto=webp&amp;s=79a5bad20497cd57b389647cdb3b18c002ef6fc1"
        },
        "permalink": "/r/movies/comments/1lu90a7/denis_villeneuve_will_shoot_all_of_dune_messiah/"
    },
    {
        "id": "1ltxdtg",
        "author": "ChiefLeef22",
        "title": "Lily Gladstone has been cast in the new ‘Thomas Crown Affair’ movie, directed by &amp; starring Michael B. Jordan | The film follows a rich playboy who enjoys stealing art for a hobby but meets his match in an insurance investigator who quickly fall for each other.",
        "content": "",
        "upvotes": 3666,
        "comments": 442,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zReRIP-JO9Dv8J1xK2YzOlRy1sc7CAYNfx8BGwk5B2s.jpeg?auto=webp&amp;s=1d6147eeede7cf325f4e4713ad98838f639cff3a"
        },
        "permalink": "/r/movies/comments/1ltxdtg/lily_gladstone_has_been_cast_in_the_new_thomas/"
    },
    {
        "id": "1ltzkt7",
        "author": "MarvelsGrantMan136",
        "title": "AMC Theatres to Offer 50% Off Tickets on Tuesdays and Wednesdays (Starts July 8)",
        "content": "",
        "upvotes": 1294,
        "comments": 101,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/P-A2BTzRsG-dl-sYNAZFE0wZkJuSud-0ONUdLBeI1BU.jpeg?auto=webp&amp;s=1afe1fb62304bc916e44d65afecc675badd7b9d8"
        },
        "permalink": "/r/movies/comments/1ltzkt7/amc_theatres_to_offer_50_off_tickets_on_tuesdays/"
    },
    {
        "id": "1lu0adr",
        "author": "cmaia1503",
        "title": "Cosmo Jarvis Pulls Out Of Christopher Nolan’s ‘The Odyssey’; ‘Shogūn’ Star Replaced By Logan Marshall-Green",
        "content": "",
        "upvotes": 1010,
        "comments": 203,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EZURG3Of8vnLBKw_AGqF3np-VbkY3Wa7uIABLt5IVwo.jpeg?auto=webp&amp;s=ef3cb932589ba66e0baa60e2c6fad3845c4c84bc"
        },
        "permalink": "/r/movies/comments/1lu0adr/cosmo_jarvis_pulls_out_of_christopher_nolans_the/"
    },
    {
        "id": "1ltlh9d",
        "author": "DemiFiendRSA",
        "title": "Scarlett Johansson Becomes Hollywood’s Highest Grossing Lead Actor With ‘Jurassic World Rebirth’",
        "content": "",
        "upvotes": 11145,
        "comments": 1119,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5LsF-9mqXB03YDesSKAqkowzaFLSsqAZfJie8Qv95W0.jpeg?auto=webp&amp;s=52fec97e3600bc0c8bae61f4c25ecb5fd82d18c5"
        },
        "permalink": "/r/movies/comments/1ltlh9d/scarlett_johansson_becomes_hollywoods_highest/"
    },
    {
        "id": "1ltw49n",
        "author": "KillerCroc1234567",
        "title": "New Poster for \"The Bad Guys 2\"",
        "content": "",
        "upvotes": 692,
        "comments": 63,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/6skcyw19tgbf1.jpeg?auto=webp&amp;s=f878a6c9617bc48b312cc9220bf0c7b7919c141e"
        },
        "permalink": "/r/movies/comments/1ltw49n/new_poster_for_the_bad_guys_2/"
    },
    {
        "id": "1ltwfbl",
        "author": "KillerCroc1234567",
        "title": "Jon M. Chu To Direct Live-Action ‘Hot Wheels’ Movie For Mattel, Warner Bros. &amp; Bad Robot",
        "content": "",
        "upvotes": 486,
        "comments": 148,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qsjeV-ss7amDp76UTQbVUsV-pHtEOpKFSHCcg5C1Eh4.jpeg?auto=webp&amp;s=81b2d9d17f4f2e2fa0d8e18fb01d76666c889445"
        },
        "permalink": "/r/movies/comments/1ltwfbl/jon_m_chu_to_direct_liveaction_hot_wheels_movie/"
    },
    {
        "id": "1lthzdy",
        "author": "dvsinla",
        "title": "Saw Spaceballs in 70mm last night... sound cut out, audience took over, it was amazing",
        "content": "Went to see Spaceballs in 70mm last night in Hollywood… part of a summer 70mm program.\n\nIt was packed.\n\nThe movie started great as usual... but right when Dark Helmet gets to Mr. Radar, the sound cuts out.\n\nSo we all end up watching in silence for about 5 minutes…\n\nBut the best part? Since most people there knew the movie by heart, they just started doing the dialogue out loud. It was hilarious. People were actually matching the lip movements on screen.\n\nEventually they had to cancel the screening, which was a bummer, but those 5 minutes were awesome. I would’ve honestly watched the whole thing that way. I know it by heart.",
        "upvotes": 5536,
        "comments": 241,
        "media": null,
        "permalink": "/r/movies/comments/1lthzdy/saw_spaceballs_in_70mm_last_night_sound_cut_out/"
    },
    {
        "id": "1ltxy6c",
        "author": "NoCulture3505",
        "title": "TOGETHER - Official Trailer #2 - In Theaters July 30",
        "content": "",
        "upvotes": 266,
        "comments": 103,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TpHtmlMhbF2ZapOD5zvMO6Kk0Rab9NyO0SJth0Y6-XA.jpeg?auto=webp&amp;s=546103d95c529de25566ca399059867479ecd19f"
        },
        "permalink": "/r/movies/comments/1ltxy6c/together_official_trailer_2_in_theaters_july_30/"
    },
    {
        "id": "1lu3aqv",
        "author": "vaisatriani",
        "title": "Movies You've Walked Out Of",
        "content": "I'm curious what movies you've walked out of for any reason.  Maybe the movie was terrible, maybe you got sick, maybe you got an emergency text.\n\nDid you eventually see the film?\n\nI've got a few of 'em.\n\nDRAGONSLAYER: I was 11 years old and a friend's mom took us.  The film is surprisingly rather brutal, and when we got to the scene where the baby dragons are eating the princess, she noped out of the film and we all had to leave.  I ended up seeing it a few weeks later when the film hit a second run theater (my brother took me).  Great movie.\n\nJOES VS THE VOLCANO: My girlfriend at the time was hating it so we left shortly after Tom Hanks got onto the yacht.  She offered me positive inducement to leave so we did so.  I eventually saw it when it hit VHS and a few times since.  It's OK.\n\nSPIDER-MAN: I was liking the film but something didn't agree with me from the meal I had prior to sitting down.  What I thought would be a quick bathroom break ended up running until the film ended.  I was loving the film up until the point that I left so I went and saw it the following weekend.  My wife, who was with me for the aborted viewing, loved the film and saw it again with me.  Great movie.  I know that critical consensus holds that the sequel is the best of the trilogy but I prefer that first one still.\n\n  \nThere have been others I've come close to walking out on because the movie was terrible but, to my memory, those are the only three for me where I actually did leave early.",
        "upvotes": 137,
        "comments": 940,
        "media": null,
        "permalink": "/r/movies/comments/1lu3aqv/movies_youve_walked_out_of/"
    },
    {
        "id": "1ltsgnb",
        "author": "BunyipPouch",
        "title": "First Poster for Coming-of-Age Animation 'Boys Go To Jupiter' - Billy, a teenage gig worker, aims to make $5,000. His quest is derailed by a gelatinous alien's appearance.",
        "content": "",
        "upvotes": 431,
        "comments": 43,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/aenn6ip9zfbf1.jpeg?auto=webp&amp;s=776a08ad3525e8caf90c82d79c6958412ba06b7a"
        },
        "permalink": "/r/movies/comments/1ltsgnb/first_poster_for_comingofage_animation_boys_go_to/"
    },
    {
        "id": "1ltxvom",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Oscar Nunez - Friday 7/18 at 2:00 PM ET - Actor from 'The Office', 'Disenchanted', 'The Lost City', 'Mr. Iglesias', 'People of Earth', 'Baywatch', and much more.",
        "content": "",
        "upvotes": 204,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ew0yqqci4hbf1.jpeg?auto=webp&amp;s=83f6e08f42896a555d9ffcacb3f3ea7dbee98154"
        },
        "permalink": "/r/movies/comments/1ltxvom/amaqa_announcement_oscar_nunez_friday_718_at_200/"
    },
    {
        "id": "1lu4lxa",
        "author": "darth_vader39",
        "title": "Terry Gilliam Reflects On ‘Brazil’ As Film Celebrates 40th Anniversary &amp; The Challenges Of Getting Movies Made Today: “I Really Don’t Want Any More Fights”",
        "content": "",
        "upvotes": 58,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OGDgajJ5v7DGQ6VkQi8LiJC8QDtC0lVB5G_FQGyYsiM.jpeg?auto=webp&amp;s=c3be784d58800994fc6f8c53a2770bc609fc7baf"
        },
        "permalink": "/r/movies/comments/1lu4lxa/terry_gilliam_reflects_on_brazil_as_film/"
    },
    {
        "id": "1ltwgjx",
        "author": "NoCulture3505",
        "title": "Kenneth Branagh, Producer Charles Roven Set For ‘The Thomas Crown Affair’ At Amazon MGM",
        "content": "",
        "upvotes": 135,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rN3_8yXwl3G7zUvIbo8f4byHvBU6vUwqEAZi8ocrit4.jpeg?auto=webp&amp;s=2bb6f8156c7ea1670a4338550b9b1e477acc944a"
        },
        "permalink": "/r/movies/comments/1ltwgjx/kenneth_branagh_producer_charles_roven_set_for/"
    },
    {
        "id": "1ltmf6a",
        "author": "wordsandwich",
        "title": "I think I finally understand No Country for Old Men for myself",
        "content": "I've always loved this movie since I first saw it in theaters, but I think I've always struggled to connect with it thematically. Obviously the movie is subject to a wide variety of interpretation, but I saw it again last night and there were a couple of scenes that stood out to me this time:\n\n1. The conversation Sheriff Ed Bell has with his brother. His brother brings up the point about having humility and warns Ed not to believe the world *works differently for you*.\n\n2. The scene where Carson Welles meets Lleweyln Moss in the hospital in Mexico. Carson is talking about Chigurh, and Llewelyn makes the comments \"Who is this guy? The ultimate badass?\" in kind of an annoyed tone of voice.\n\nThe three main protagonists of the movie, Llewelyn, Ed Bell, and Chigurh, all share the same flaw to varying degrees--they all share in a degree of personal exceptionalism:\n\n1. Ed Bell believes at some level that he's on a noble path, and like he tells his brother, he felt like his choices would be validated in the end by \"God suddenly coming into my life\"--feeling like his life would culminate in some spiritual satisfaction and was therefore meant to be. He has become disillusioned by the lack of this feeling--a lack of success or victory as a lawman (as he sees it), with the criminals getting away with heinous, senseless violence. He can't even find closure in his personal life--the dream he describes to his wife in the end symbolizes that: it doesn't have a happy, meaningful ending--it just ends.\n\n2. Llewlyn thinks *he* is the ultimate badass and that he's smart/tough enough to overcome any adversary, even if it's the full brunt of the drug cartel. He tries to act like he's Rambo by putting all of his Vietnam combat experience into staging his escape/cat-and-mouse hunt with Chigurh, and his ego won't let him give up the fight. Carla Jean is enamored by this quality when she tries to tell Ed Bell that Llewelyn can take on all comers. In actuality, we see, as Carson points out, that he's a loser who can't make ends meet and is really not that difficult to predict. The movie devotes a fair number of scenes to him \"prepping\" for the fight by buying various things from sporting goods stores, and as a moviegoer you expect some kind of Rambo/A-Team/MacGyver-esque ingenuity from that, but it doesn't really amount to much. His skills and instincts keep him alive for a while, but he never really turns the tables and is vastly outnumbered by the cartel, which has no dearth of hitmen after him.\n\n3. Chigurh, of course, is delusional and insane and believes he is some sort of supernatural force of fate.\n\nAll three guys commit the sin of vanity in their own ways, and Reality ensues for them all, but the only one to cash his chips in and move on with life is Bell. He is humbled by the carnage and literally escapes with his life after he decides to give up his pursuit (with Chigurh right there!). That's the movie for me--it's an all-time great movie that still has me thinking about it nearly twenty years later.",
        "upvotes": 674,
        "comments": 114,
        "media": null,
        "permalink": "/r/movies/comments/1ltmf6a/i_think_i_finally_understand_no_country_for_old/"
    },
    {
        "id": "1ltqb82",
        "author": "Task_Force-191",
        "title": "The Last Blossom (HOUSENKA) New Poster",
        "content": "",
        "upvotes": 247,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3h6w0swtefbf1.jpeg?auto=webp&amp;s=e0b70768ca27414be264dd2bbab35e1c08cf3794"
        },
        "permalink": "/r/movies/comments/1ltqb82/the_last_blossom_housenka_new_poster/"
    },
    {
        "id": "1lt5rcj",
        "author": "ChiefLeef22",
        "title": "'Psycho' at 65: How Alfred Hitchcock revolutionised cinema start times | Before 'Psycho', it was fairly common for people to just “show up\" to movies halfway through a film, watch the second half and then stay for the first half of the next showing. Hitchcock insisted cinemas to become more strict",
        "content": "",
        "upvotes": 5467,
        "comments": 239,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/w59vi6gMRTe8CNuTl32zx3NNI3swHS5d5yIUzyqRE2Q.jpeg?auto=webp&amp;s=b8de22f4632549dbaa73811f96d6e234c7d71751"
        },
        "permalink": "/r/movies/comments/1lt5rcj/psycho_at_65_how_alfred_hitchcock_revolutionised/"
    },
    {
        "id": "1lu3idv",
        "author": "BunyipPouch",
        "title": "First Poster for Documentary '2000 Meters to Andriivka' - A Ukrainian platoon attempts to liberate a strategic village from Russian forces. A journalist joins them, observing the impacts of war and growing doubts about its resolution.",
        "content": "",
        "upvotes": 30,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hn107w767ibf1.jpeg?auto=webp&amp;s=f0169a0f67e151902f35c7399f179b288a684693"
        },
        "permalink": "/r/movies/comments/1lu3idv/first_poster_for_documentary_2000_meters_to/"
    },
    {
        "id": "1ltgnjg",
        "author": "thebigeverybody",
        "title": "Most distracting use of sound effects you've ever heard in a movie?",
        "content": "I used to do SFX and my first job out of university was a shock to me because I realized motorbikes and gunshots on screen didn't sound like actual motorbikes or gunshots. I suddenly realized the studio's collection of 100 000 sound effects was useless without the experience to know which 50 effects the audience had been conditioned to accept as authentic by other films. And then there as the foleying that I helped with, in which a man kneeing a watermelon doesn't sound like a Hollywood effect, a real punch to the face doesn't sound like a Hollywood effect, but a man kneeing a watermelon with olive oil on his leg sounded \"right\" for reasons I can't explain.\n\nSomething I appreciate in the filming of movies is when the actors are actually shouting in loud environments (nightclubs, windstorms) because they're recorded in silence and the music/wind is added later. What this usually results in is the audio being loud to establish it's loud, then the SFX editor has to radically drop the levels because the actors have been recorded talking in their normal voices. I appreciate it when the director gives them directions to act like they're in a loud place. I was on a set once where the director had the actors put earplugs in so they HAD to yell (everyone in the scene had long hair or were given weird hats to hide the ear plugs).\n\nAnyways, I'm watching Bullet Train Explosion right now and they just used the Wilhelm scream for a student getting punched. I had to burst out laughing because, well, it sounds right when someone falls off a cliff, not when someone falls over a train seat.\n\n\n\n",
        "upvotes": 1063,
        "comments": 831,
        "media": null,
        "permalink": "/r/movies/comments/1ltgnjg/most_distracting_use_of_sound_effects_youve_ever/"
    },
    {
        "id": "1luaps5",
        "author": "firedog7881",
        "title": "It’s amazing how much Robin Williams’ Man of the Year is still relevant today",
        "content": "I’m watching Man of the Year and it sounds like it was made in the last 5. It really showcases how much the parties sway but the issues are the same. Robin Williams’ character is the blending of so many people today no matter where you’re at on the left to right spectrum. This is not meant to be anything other than an observation of the relevance of the movie. ",
        "upvotes": 12,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1luaps5/its_amazing_how_much_robin_williams_man_of_the/"
    },
    {
        "id": "1ltherl",
        "author": "LetMeExplainDis",
        "title": "Has a movie's rating ever revealed a spoiler?",
        "content": "Let's say a movie is rated R for suicide themes or sex scenes etc. If you're nearing the end and you still haven't seen that particular thing then you already know what's going to happen and you can probably guess which character it happens to. Most of the time it's not a big deal but has this ever spoiled a major plot point for you?\n\nObviously use spoiler text for your answers.",
        "upvotes": 530,
        "comments": 214,
        "media": null,
        "permalink": "/r/movies/comments/1ltherl/has_a_movies_rating_ever_revealed_a_spoiler/"
    },
    {
        "id": "1lu0o9s",
        "author": "JohannGambolputtyUlm",
        "title": "Wind of Change (Scorpions Biopic) - Teaser Trailer",
        "content": "",
        "upvotes": 22,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/86p4LsXI0QoHx56uryYSqNdFscsJfv4O_n0Vf4RQzwg.jpeg?auto=webp&amp;s=cebec7d8da138fbafc0d16526562409bc78d56ac"
        },
        "permalink": "/r/movies/comments/1lu0o9s/wind_of_change_scorpions_biopic_teaser_trailer/"
    },
    {
        "id": "1lte5b5",
        "author": "tonivesdream",
        "title": "The Story behind The Day After” (1983) - possibly the most important movie ever shown on TV. (OC)",
        "content": "I’ve been obsessed with the cultural shockwave that The Day After (1983) created for quite a while. \n\nA made-for-TV movie that somehow ended up scaring the hell out of hundreds of millions people and left Ronald Reagan “greatly depressed”, leading to him rethinking the nuclear arms race.\n\nAfter weeks of research, I was lucky enough to speak with director Nicholas Meyer himself, plus the PR mastermind behind the film, Josh Baran, who helped turn it into one of the most talked-about broadcasts in American history.\n\nIt feels like this story is somehow just as relevant now as it was back then. \n\nWould love to hear your thoughts and I hope you enjoy! ",
        "upvotes": 753,
        "comments": 201,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1oU1slvMAbCrFRJ_sTJDrqVb4mRoCo0sCEbvjb0OvQ8.jpeg?auto=webp&amp;s=4ee14b592f8f4a59ae7bdd16ddb0513856a506c9"
        },
        "permalink": "/r/movies/comments/1lte5b5/the_story_behind_the_day_after_1983_possibly_the/"
    },
    {
        "id": "1lu30tv",
        "author": "BoFlix",
        "title": "New Sovereign teaser 'America' - Nick Offerman, Jacob Tremblay",
        "content": "",
        "upvotes": 17,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/oT_URwOsj8RtlK9R7-LeM4WdbnBvDQ-qjNsDQcSFDtw.jpeg?auto=webp&amp;s=90e6ebbdb90df5191295dadf265eecbec8aa0d58"
        },
        "permalink": "/r/movies/comments/1lu30tv/new_sovereign_teaser_america_nick_offerman_jacob/"
    },
    {
        "id": "1ltk139",
        "author": "Wanderinaimlesslyish",
        "title": "What movie is kinda ok if you’ve never seen the source material?",
        "content": "For example- When I first saw “The Last Airbender” movie in 2010, I’d never seen any of the Tv show, and I thought the movie was “alright”. Only after I watched the TV show/ finished the book of water did I think it was terrible. (Source material as in books, movies, tv shows, real-life events, historical events, etc)",
        "upvotes": 278,
        "comments": 570,
        "media": null,
        "permalink": "/r/movies/comments/1ltk139/what_movie_is_kinda_ok_if_youve_never_seen_the/"
    },
    {
        "id": "1lubr3x",
        "author": "drippyfetus",
        "title": "Any emotional movies like Waves (2019)?",
        "content": "I went from watching Euphoria, then Grand Army, to Waves (2019) and pretty much sobbed at all of them (I might be due on my period lmao). \n\nI’m looking for more emotionally raw, beautifully shot, character-driven films. Coming-of-age, trauma, family tension, grief, anything gut-punching really. I just want something to ruin me a bit more. Any recs?",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/movies/comments/1lubr3x/any_emotional_movies_like_waves_2019/"
    },
    {
        "id": "1lto1ev",
        "author": "SiTheHandsomeGuy",
        "title": "What’s a movie you were completely wrong about going in?",
        "content": "We all have those films we went into with low expectations, maybe the trailer didn’t grab us, or we thought it wasn’t our genre but then it totally blew us away. On the flip side, maybe a super-hyped movie just didn’t hit for you at all. What movie completely flipped your expectations, either positively or negatively? What made you change your mind? Mine: *Edge of Tomorrow.* Thought it was gonna be another generic Tom Cruise action flick, but it turned out to be clever, funny, and rewatchable as hell.",
        "upvotes": 96,
        "comments": 268,
        "media": null,
        "permalink": "/r/movies/comments/1lto1ev/whats_a_movie_you_were_completely_wrong_about/"
    },
    {
        "id": "1lt06s3",
        "author": "Infinite-Fold-1360",
        "title": "'Vietnam was insane, Apocalypse Now only slightly less so': The inside story of the wildest shoot in film history",
        "content": "A good read about Apocalypse now. Been over 15 years since I watched the movie. I knew it was a very difficult movie to make but this article made me realise that coppala had to overcome insurmountable barriers.\n\nMore than the oliver stone triology or full metal jacket, it is apocalypse now that probably resonates more with the Vietnam war. The entire setting makes you undergo that disturbing feeling of war. The fact that the entire cast and crew underwent similar territory as the soldiers, could probably be one of the reasons.",
        "upvotes": 3204,
        "comments": 137,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4O1LekHwTC8PrtW5KjARAZeJrPyXFpipRTEtqysGE5w.jpeg?auto=webp&amp;s=b98e81ff87d0228d6e1669b2a6075c91d30c8f8b"
        },
        "permalink": "/r/movies/comments/1lt06s3/vietnam_was_insane_apocalypse_now_only_slightly/"
    },
    {
        "id": "1lu4w7b",
        "author": "Independent_Olive373",
        "title": "Human Traffic",
        "content": "I believe that the movie Human Traffic is the only movie ever made to truly capture what it was like going raving in the 90s in the UK. Are there any other films that capture clubbing as authentically as that movie?\n\nThe excitement of the build up, the ticket chaos, sly ways to sneak in, the drugs, the constant talking shit to strangers and the afterparty. It's almost perfect.\n\nMost film directors never seem to have stepped foot into a nightclub, but Justin Kerrigan obviously knows his E's from his Whizz. \n\nIf you have not seen that film and want to see why British Gen Xers get teary when they here You Got The Love by Candi Staton, I would highly recommend watching\n\n",
        "upvotes": 9,
        "comments": 17,
        "media": null,
        "permalink": "/r/movies/comments/1lu4w7b/human_traffic/"
    },
    {
        "id": "1ltsugc",
        "author": "Dsalter92",
        "title": "Best Stephen King movie adaptations?",
        "content": "I’m looking to have a bit of a Stephen King marathon after recently watching The Monkey, any recommendations for the best ones to watch? \n\nI’ve seen the likes of IT, Green Mile, The Shawshank Redemption, Salem’s Lot, The Shining, Doctor Sleep and The Mist\n\nAre there any others of high quality and worth watching? ",
        "upvotes": 42,
        "comments": 193,
        "media": null,
        "permalink": "/r/movies/comments/1ltsugc/best_stephen_king_movie_adaptations/"
    }
]