[
    {
        "id": "1lcwoxq",
        "author": "SonyPictures",
        "title": "Danny Boyle Here: Ask Me Anything.",
        "content": "Hello Reddit! Director Danny Boyle here. \n\nI'm back, and I’m excited to answer your questions about my new film 28 Years Later. It's starring Aaron Taylor-Johnson, Jodie Comer and Ralph Fiennes and is out in UK cinemas on June 19th and US movie theatres on June 20th. \n\nI'll be online from 5pm BST on Tuesday June 17th - drop your questions below and I hope to answer as many as I can. Speak soon!\n\nhttps://preview.redd.it/ro4j9kivca7f1.jpg?width=788&amp;format=pjpg&amp;auto=webp&amp;s=391f46c6bc5fb615d471e7a15d601d977e765eb9\n\n\n\n&gt;**Edit** Director Danny Boyle here. Hello Reddit! Thanks for participating in the AMA about my new film 28 Years Later. Catch it in UK, cinemas June 19th, in US movie theatre June 20th.",
        "upvotes": 1246,
        "comments": 632,
        "media": null,
        "permalink": "/r/movies/comments/1lcwoxq/danny_boyle_here_ask_me_anything/"
    },
    {
        "id": "1ldorjo",
        "author": "BigFootAMA",
        "title": "Hi /r/movies! - I faked a murder. I faked a Bigfoot hoax. I faked a town. Then I edited it to look\nlike a 1978 documentary. It's called The Town That Cried Bigfoot. AMA.",
        "content": "Hi r/movies,\n\nI’m Mark Dossett, creator of The Town That Cried Bigfoot — a lost 1978 documentary about a small-town Bigfoot hoax that spirals into murder. But the deeper you dig, the stranger it gets —because none of it’s real. Not even the town.\n\nI built this film completely backward — starting with real 1970s news footage I found, then reverse-engineering a fictional murder, a cryptid hoax, and a made-up southern town buried inside real news footage.\n\nLet’s just say... if you Google “Weyburn, Virginia” while watching, you might start to question what’s real and what isn’t.\n\nAsk me anything about editing the truth into lies, creating fake towns, tricking Google, Bigfoot folklore, Blair Witch-style worldbuilding, or how the hell any of this even worked. Or anything else you want to discuss.\n\n**Film info:**\n\nThe Town That Cried Bigfoot\n\nGenre: Faux Documentary / Mystery / True Crime (kinda sorta)\n\nRuntime: 47 minutes\n\nWritten, Directed &amp; Edited by: Mark Dossett\n\n**Synopsis**:\n\nIn the winter of 1978, four desperate councilmen in Weyburn, Virginia staged a fake Bigfoot sighting to save their town from economic ruin. The plan worked — until someone turned up dead.\n\nBut here’s the kicker— none of this ever happened. The footage is real. The town is fake. The hoax is real enough to show up on MapQuest. This is a hoax within a hoax — crafted to feel like a lost documentary buried in public access archives.\n\n**Trailer:**\n\n[https://www.youtube.com/watch?v=Mnpr9EBMhsg](https://www.youtube.com/watch?v=Mnpr9EBMhsg)\n\n**Where to Watch:**\n\nAmazon Prime Video: [https://www.amazon.com/dp/B0DXDM6RLN](https://www.amazon.com/dp/B0DXDM6RLN)\n\nGumroad (Download the full film for $5 and support the filmmaker):\n\n[https://1978bigfoot.gumroad.com/l/film](https://1978bigfoot.gumroad.com/l/film)\n\nOfficial Merch: [https://weyburn-shop.fourthwall.com](https://weyburn-shop.fourthwall.com)\n\nAlso streaming on select free platforms: Stash TV, Fawesome TV, and Xumo.\n\nAsk me anything! I'll be back tomorrow (Wednesday 6/18) at 5 PM ET to answer any questions.\n\n",
        "upvotes": 97,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/olr6ueucxh7f1.png?auto=webp&amp;s=2e3f1ab32f1a11a8b1e23778e526dad732d11672"
        },
        "permalink": "/r/movies/comments/1ldorjo/hi_rmovies_i_faked_a_murder_i_faked_a_bigfoot/"
    },
    {
        "id": "1lei130",
        "author": "parallelogramm3r",
        "title": "Demolition Man",
        "content": "I’m rewatching this, it’s probably been 10 years since I’ve seen it. It’s got a pretty mediocre rating on IMDB but I think it is peak 1990’s action movie stuff along with movies like The Rock and Con Air.   \n\nA lot of the futuristic sci-fi elements have aged pretty well and it’s just a fun, well-made action movie.  \n\nBut what I really want to know is how you would use the three seashells.\n",
        "upvotes": 947,
        "comments": 413,
        "media": null,
        "permalink": "/r/movies/comments/1lei130/demolition_man/"
    },
    {
        "id": "1lefb01",
        "author": "MarvelsGrantMan136",
        "title": "Springsteen: Deliver Me From Nowhere | Official Trailer",
        "content": "",
        "upvotes": 538,
        "comments": 252,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bK8DBcaSltwNwtz65rqy3UR-FgdQLvPkbMDnnZ924Ug.jpeg?auto=webp&amp;s=8b32036310edfb89ef998da1da82843805f3a1ee"
        },
        "permalink": "/r/movies/comments/1lefb01/springsteen_deliver_me_from_nowhere_official/"
    },
    {
        "id": "1ldwikw",
        "author": "MarvelsGrantMan136",
        "title": "‘Harold &amp; Kumar’ Getting New Sequel as ‘Cobra Kai’ Creators Ink Deal to Write, Direct",
        "content": "",
        "upvotes": 4759,
        "comments": 339,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Lu8enQOUGUNQDoleTNk8JDdIrxmUrbfcdozgvjap5pc.jpeg?auto=webp&amp;s=f47962a49b18ea5172fd48d20c1eb8e2eeb4baee"
        },
        "permalink": "/r/movies/comments/1ldwikw/harold_kumar_getting_new_sequel_as_cobra_kai/"
    },
    {
        "id": "1le9uhu",
        "author": "KarKrush",
        "title": "A work-copy of the \"Lost\" Jerry Lewis film \"The day the clown cried\" has now been sold.",
        "content": "A quick AI translate from Swedish television:\n\n**\"After the Revelation: Hans Crispin Has Sold the Legendary Jerry Lewis Film**  \nUpdated yesterday at 22:31, Published yesterday at 10:03\n\n– I received a modest sum, says Hans Crispin to Kulturnyheterna. But I can't tell who bought \"The Day the Clown Cried.\"\n\nHans Crispin's pirate copy of the legendary Jerry Lewis film is the only known complete version.\n\nSwedish actor and TV personality Hans Crispin recently revealed to the magazine Icon that in 1980 he stole a film reel of the legendary Jerry Lewis film \"The Day the Clown Cried\" and made a pirated copy, which he has kept for 45 years.\n\nAfter that, he also invited SVT Kulturnyheterna to view the film.\n\nThe news gained international attention and was covered by Newsweek and Vulture, among others.\n\n**Only Known Copy**  \nThe film, which is about a clown in Auschwitz during the Holocaust, has never been publicly shown and is considered a \"holy grail\" for film enthusiasts. It has long been regarded as lost; the copy Crispin has is the only known version with intact editing and sound.\n\nHans Crispin, who at the time worked copying porn films to VHS at Europafilm, stole the film along with a co-conspirator and kept it in secret for decades.\n\nIn the Kulturnyheterna interview a few weeks ago, he said he was now done with the secret and ready to pass it on to the next generation. And he has done so.\n\n– I have sold it. For a modest sum. I can't reveal more. They came here and watched it. They made an offer. I accepted it, signed a paper, and promised not to tell anything more.\n\n**\"You're not supposed to do that\"**  \nWhen asked how he feels about having sold something he in a \"Jönssonligan-like\" scheme stole and pirated so long ago, he responds that he has reflected on it over the years.\n\n– Yes, I stole it. I did. And I've thought about it — you're not supposed to do that. That's how it is. But I really wanted to preserve it. And I looked up the statute of limitations a long time ago. Two years. And the rights to this film are so tangled that no one really knows who has rights to this copy.\n\n**How does it feel now, that your big secret is out?**\n\n– A bit empty, actually. I mean, I can't watch the film anymore. I’ve always been able to before. Or show it to someone. You and Caroline Hainer were the last to see \"The Day the Clown Cried\" at my place.\n\nKulturnyheterna's freelance critic Caroline Hainer shared the story of Hans Crispin in the magazine Icon. However, she believes that the film will likely be accessible to a wider audience in the future.\n\n– Of course, there are financial interests. Jerry Lewis was one of the biggest comedians in the US in the 1950s. I guess it has fallen into the hands of someone who wants to distribute it. I would say there’s a risk that the public might see it. It’s a bad film.\"\n\nSource: [Hans ”Jönssonligan-kupp” blev en världsnyhet – nu har han sålt den legendariska filmen | SVT Nyheter](https://www.svt.se/kultur/efter-avslojandet-hans-crispin-har-salt-den-legendariska-filmen)",
        "upvotes": 578,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/L4KnnhB7EgYVWwU0ZPljCspIOFDKWNDFZ3xElcuu4w0.jpeg?auto=webp&amp;s=1c77b5642ad4729342d9d71dcc06d1dba7a24d16"
        },
        "permalink": "/r/movies/comments/1le9uhu/a_workcopy_of_the_lost_jerry_lewis_film_the_day/"
    },
    {
        "id": "1ldzo4u",
        "author": "StevenSanders90210",
        "title": "David Zaslav’s Pay To Be “Substantially” Lowered Ahead Of Split, WBD Says, But CEO Will Still Reap Rewards",
        "content": "",
        "upvotes": 2040,
        "comments": 74,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sdGJbAJ1bFxV97GWUQTKjfNrGVkcD46kB2mr0IuqJg4.jpeg?auto=webp&amp;s=a6b46638974a7a13ea7c8afa5ba9c0bb1a1e85a2"
        },
        "permalink": "/r/movies/comments/1ldzo4u/david_zaslavs_pay_to_be_substantially_lowered/"
    },
    {
        "id": "1ldo7i5",
        "author": "buttatoad",
        "title": "Movies that changed real life behavior",
        "content": "Thinking along the lines of Final Destination 2 with the logs falling off the truck and landing onto cars (one decapitating the state trooper). Ever since, people have tried to get away from being behind these vehicles.\n\nWhat are more examples where movies have actually changed how people behave in their own lives?",
        "upvotes": 9571,
        "comments": 3843,
        "media": null,
        "permalink": "/r/movies/comments/1ldo7i5/movies_that_changed_real_life_behavior/"
    },
    {
        "id": "1le3rdb",
        "author": "Proper-Ad7371",
        "title": "12 Angry Men: They almost convicted before even talking about the evidence",
        "content": "Just watched the original for the first time. Loved it, great acting, great story, and actually reminded me of the one time I actually was on a jury and convinced others to acquit because of doubt.\n\nThe thing that bothers me - they had 11-1 at first, then number 8 says some very unconvincing things about his doubts, then says he’ll change to guilty if nobody else switches. He was lucky the one guy joined him, otherwise the kid would have gotten the chair.\n\nThen he brings up all the holes in the evidence, and breaks the others one at a time. Why didn’t he do that before even the first vote? Or at least before agreeing to the second one? Much of the evidence was questionable, and he was clearly prepared to talk about it.\n\nOtherwise I loved it.",
        "upvotes": 1028,
        "comments": 268,
        "media": null,
        "permalink": "/r/movies/comments/1le3rdb/12_angry_men_they_almost_convicted_before_even/"
    },
    {
        "id": "1le13hr",
        "author": "DemiFiendRSA",
        "title": "‘Raised by Wolves’ Screenwriter Aaron Guzikowski to Pen ‘Death Stranding’ Animated Movie",
        "content": "",
        "upvotes": 1422,
        "comments": 121,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_nRhKjwmTKnfBTdv3YfYOffsCwW8jIB7ggMrysS3TjI.jpeg?auto=webp&amp;s=e9cbee6f10f42f04987d154772c5dad19dd0dc59"
        },
        "permalink": "/r/movies/comments/1le13hr/raised_by_wolves_screenwriter_aaron_guzikowski_to/"
    },
    {
        "id": "1lefcmo",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'Springsteen: Deliver Me from Nowhere' Starring Jeremy Allen White",
        "content": "",
        "upvotes": 122,
        "comments": 26,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/nn91qtqveo7f1.jpeg?auto=webp&amp;s=6ecd72350b760c1b116f6fee9b6e652b8d19d0b4"
        },
        "permalink": "/r/movies/comments/1lefcmo/official_poster_for_springsteen_deliver_me_from/"
    },
    {
        "id": "1lekuy3",
        "author": "TylerFortier_Photo",
        "title": "James Cameron's The Abyss Pulled From Disney+ in the UK Because of Banned 'Rat Abuse' Scene - IGN",
        "content": "&gt;James Cameron’s beloved sci-fi film [The Abyss](https://www.ign.com/movies/the-abyss) **has been removed from Disney+ in the UK due to the inclusion of a banned scene.**\n\n&gt;The original version of the 1989 film **includes a scene in which a rat is dunked into a vat of fluorocarbon liquid — and a real rat** ***was*** **used in production**. The rodent is believed to have survived, but **that didn’t stop groups like charity The Royal Society for the Prevention of Cruelty to Animals (RSPCA) from taking steps to have the scene removed 36 years ago.**\n\n&gt;The scene was **subsequently cut by the British Board of Film Classification (BBFC) under the Cinematograph Films (Animals) Act 1937, which means it must be cut for any theatrical use**. The BBFC **also cut the scene under the Video Recordings Act 1984, meaning it must not be included on releases on formats such as Blu-Ray and DVD. Similarly, the scene should also not be aired on traditional TV in the UK.**\n\n&gt;Despite this, a **version of the film that included the banned scene was added to Disney+ a few months ago in April**. In response, the RSPCA called out what it described **as a \"loophole\" that enabled the banned rat scene to make it onto Disney+ in the UK, pointing out that streaming platforms are not bound by the same standards as film releases in cinema, DVD, or on traditional television.**",
        "upvotes": 55,
        "comments": 40,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GMBzDK9xFLlYU1HQA8hZ-nRYvQSXuuArSGtjawoHui8.jpeg?auto=webp&amp;s=510f193641a96eb1a6349a8537bbf27c57f42e15"
        },
        "permalink": "/r/movies/comments/1lekuy3/james_camerons_the_abyss_pulled_from_disney_in/"
    },
    {
        "id": "1ldv3jn",
        "author": "CreatorSearchInsight",
        "title": "What is an often cited 'movie fact' or 'myth' that just isn't true?",
        "content": "For example:  \n*'Heath Ledger (as the Joker) improvised during the hospital scene when the button didn't set the explosives off as it should've, proving his amazing acting and quick thinking.' (The Dark Knight, 2008)*\n\nOften cited, but not based in fact at all with no reputable source ever proving it so. I believe it's actually even been disproven at this point, but the myth has spread further than the truth.\n\nWhat are some other examples?",
        "upvotes": 2068,
        "comments": 1254,
        "media": null,
        "permalink": "/r/movies/comments/1ldv3jn/what_is_an_often_cited_movie_fact_or_myth_that/"
    },
    {
        "id": "1le87km",
        "author": "94Rangerbabe",
        "title": "What made for kids movie absolutely messed you up as a child.",
        "content": "For me, ( born in 71) it was Charlie and the chocolate factory. The scene where they blow up like a blueberry and go floating down that stream just freaked me out. My imagination, took it like they go through these pipes and get squashed between rollers like on those old-fashioned washing machines to ring the water out.\nI had nightmares about that for years. \nIt’s amazing how a small suggestion can spark an entire narrative for a kid. Truly, that’s not the best movie for a little kid.\nI also remember, I was scared of sharks being in my closet just from the commercials for Jaws. ",
        "upvotes": 292,
        "comments": 560,
        "media": null,
        "permalink": "/r/movies/comments/1le87km/what_made_for_kids_movie_absolutely_messed_you_up/"
    },
    {
        "id": "1ldu474",
        "author": "MarvelsGrantMan136",
        "title": "Tom Cruise, Dolly Parton, Debbie Allen and Wynn Thomas to Be Presented Honorary Oscars",
        "content": "",
        "upvotes": 1891,
        "comments": 266,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QsunnDvMX6dlOav91ZTrX-24wk2tOh2_rJiIPdlIHaU.jpeg?auto=webp&amp;s=11e59421626c5d12614a3c8b56da5005d83d81af"
        },
        "permalink": "/r/movies/comments/1ldu474/tom_cruise_dolly_parton_debbie_allen_and_wynn/"
    },
    {
        "id": "1lejdmp",
        "author": "KillerCroc1234567",
        "title": "Kathryn Bigelow’s ‘A House of Dynamite’ Sets October 24th Release on Netflix",
        "content": "",
        "upvotes": 39,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/P32kUNatoAKqbPogGysstpQQCvKw2P1KMGoYEHAdE0k.jpeg?auto=webp&amp;s=52a57df051b7a207bec252484e6c259071e99de1"
        },
        "permalink": "/r/movies/comments/1lejdmp/kathryn_bigelows_a_house_of_dynamite_sets_october/"
    },
    {
        "id": "1leaa61",
        "author": "snowyriveradl",
        "title": "Movies where the characters don't mind living a simple life and don't strive for materialistic success (big house, money, expensive cars &amp; clothes, status), or where the characters marry down.",
        "content": "For example, in Health Ledger's A Knight's Tale, Heath Ledger's love interest is from a rich family, but she doesnt hesitate in talking about running away to live with Heath Ledger's character who is very poor. Heath's character says that she'll live with the pigs, and she says \"yes, with the pigs\". 🐖\n\nIn today's Western society, i see on social media and instagram that it looks like everyone is trying to get the best car, best clothes, best holiday destinations, expensive high end restaurants, big houses, social status, money, beautiful dresses and suits. It becomes a comparison game.\n\nSo it'd be really refreshing to have some movie recommendations where the characters are literally perfectly okay with living in a humble, simple life.\n\nEdit: I realise there's probably lots of movies that demonstrate this, but could you just give me some movie recommendations. Because this societal materialistic concept is something I struggle with. I dont want to go with the societal flow. I want to be okay with a simple life.",
        "upvotes": 155,
        "comments": 190,
        "media": null,
        "permalink": "/r/movies/comments/1leaa61/movies_where_the_characters_dont_mind_living_a/"
    },
    {
        "id": "1leilj5",
        "author": "BunyipPouch",
        "title": "Caitríona Balfe ('Outlander', 'Belfast') Joins Everest Sherpa Movie ‘Tenzing’, Joins Tom Hiddleston and Willem Dafoe - About the life of Sherpa Tenzing Norgay and his summit of Mount Everest in 1953 alongside fellow outsider New Zealander Edmund Hillary.",
        "content": "",
        "upvotes": 26,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/uRgb89diPkk-Xjnz9iSP9_uCanXnvLtTQALBkhR0Vdw.jpeg?auto=webp&amp;s=cde1c9ff5e3dbff3304565ddaaa1c1e39092c5dc"
        },
        "permalink": "/r/movies/comments/1leilj5/caitríona_balfe_outlander_belfast_joins_everest/"
    },
    {
        "id": "1ldyull",
        "author": "Amaruq93",
        "title": "The 'Orca' returns to Amity Island | A replica of the iconic boat from “Jaws”, 9 years in the making, arrived at Martha's Vinyard for the film's 50th anniversary",
        "content": "",
        "upvotes": 683,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0A6hVUd9mPBwFrhOd5FzGtA92TOLPqwyaxpA2efKiVw.jpeg?auto=webp&amp;s=acf114711a45146fb8d99e4dede1e9ff9a1eef77"
        },
        "permalink": "/r/movies/comments/1ldyull/the_orca_returns_to_amity_island_a_replica_of_the/"
    },
    {
        "id": "1lea6pa",
        "author": "kowaikanojo",
        "title": "Long movies that are JUSTIFIED in their extra long run time?",
        "content": "There’s been a bit of an epidemic, especially in recent years, where movies are unnecessarily long to the point where it’s a bit indulgent on the director’s part and the film’s narrative doesn’t justify the XXL run time and it becomes a bit of a drag.\n\nI’ve never been a big musical fan but I grew up watching the Sound of Music as a kid, so I decided to rewatch tonight (it’s probably been around 15 years) - and for a movie that is 3 hours long, wow does every piece still feel so important.\n\nMaria and Von Trapp get together PAST the two hour point in the movie, yet the build up was so necessary to have you involved in the romance, and certainly didn’t feel as long as it actually was in run time. The pacing is actually incredible for the narrative and building that emotional buy in, which is shocking and rare for a film so long.\n\nWhat films do you think genuinely justify an extra long run time and benefit from it? (and to throw a wrench in it, what movies utterly fail here?)",
        "upvotes": 117,
        "comments": 380,
        "media": null,
        "permalink": "/r/movies/comments/1lea6pa/long_movies_that_are_justified_in_their_extra/"
    },
    {
        "id": "1ldns5e",
        "author": "BunyipPouch",
        "title": "First Poster for Comedy-Fantasy 'Fucktoys' - A woman embarks upon a sex worker odyssey through Trashtown with her friends to break a terrible curse that has befallen her - SXSW Special Jury Prize winner.",
        "content": "",
        "upvotes": 2444,
        "comments": 359,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/skttqspgth7f1.jpeg?auto=webp&amp;s=52a6eb1b9f8bc6187b8f9dab2784fef2dc1cca43"
        },
        "permalink": "/r/movies/comments/1ldns5e/first_poster_for_comedyfantasy_fucktoys_a_woman/"
    },
    {
        "id": "1leivf2",
        "author": "keepfighting90",
        "title": "I'm Still Here (2024) was fantastic",
        "content": "Just finished this movie and wow, what an emotional gut punch. I saw a lot of critical acclaim for the movie last year, especially for Fernanda Torres' performance, and it's all very much deserved. Really, you can't talk about this movie without talking about Torres because she absolutely carries it on her back. It's one of the best acting performances I've seen in the past few years, especially because of how unshowy and restrained it is. It's all in the gestures, the expressions, the way she's barely holding it up to try and keep her family together after Rubens' disappearance. Just an absolute clinic in acting craft and technique. \n\nBut tbh the performances are stellar across the board, especially the girls that play the daughters. It all just comes off as so naturalistic, grounded and real. It often felt like I was watching a documentary of a Brazilian family's life. \n\nIt's ultimately a movie where the payoff is less about catharsis and more about acceptance. I knew the movie was based on a true story so I did a bit of reading beforehand to give myself some historical context, and knew what was coming. Even so, the writing and the performances make the characters feel so human and vulnerable that it's impossible to not feel their shock and pain, which overtime turns into a distant sadness and melancholy. \n\nI saw the main theme as using memory as a form of resistance. Rubens is gone, but Eunice and the children keep him alive by constantly going back to their photo and video memories of each other. The final frame of the movie seemed purposefully reflective of the earlier photo taken at the beach, at a time when the family was at their happiest with Rubens still around.\n\nIf I have one minor nitpick, it's that the 2 codas in the 90s and 2014 don't have quite the same level of impact as the first 75% of the movie - although the ending is quite powerful with old Eunice finally seeing Rubens being vindicated in the present day. But overall this is still a very powerful, poignant experience anchored by an absolutely incredible central performance by Fernanda Torres.",
        "upvotes": 23,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1leivf2/im_still_here_2024_was_fantastic/"
    },
    {
        "id": "1ldl571",
        "author": "BunyipPouch",
        "title": "First Image of Liam Neeson in Thriller 'Ice Road: Vengeance' - A sequel to the 2021 film 'The Ice Road', co-starring Fan Bingbing, it follows Neeson as he travels to Nepal to scatter ashes. While on a packed tour bus, he encounters Nepali mercenaries and must fight them off to protect the travelers.",
        "content": "",
        "upvotes": 3113,
        "comments": 590,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2zyv3a177h7f1.jpeg?auto=webp&amp;s=7369a0d3d4003dfc7dbb9d3701c7d5575c489b27"
        },
        "permalink": "/r/movies/comments/1ldl571/first_image_of_liam_neeson_in_thriller_ice_road/"
    },
    {
        "id": "1leaszn",
        "author": "confibulator",
        "title": "Gary Oldman explains Tiptoes",
        "content": "",
        "upvotes": 81,
        "comments": 26,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/92HdhZLR8H30QwigMIq8EJab3AvVtxh8I9jrdGC3B3c.jpeg?auto=webp&amp;s=3f7cdad31ebb2298ba471d6e725bc918bb0e07f3"
        },
        "permalink": "/r/movies/comments/1leaszn/gary_oldman_explains_tiptoes/"
    },
    {
        "id": "1lefrf4",
        "author": "CaptainTuttle_4077th",
        "title": "Best movies for someone who's bedridden?",
        "content": "My dad severely threw his back out, and is stuck in bed until he recovers. What movies would you recommend to help him pass the time?\n\nRecommendations do not need to be strictly cheery or uplifting films. He's open-minded when it comes to genre, but his favorites are Crime, Mystery, Thriller, Action, Comedy, and war movies.\n\nThank you!",
        "upvotes": 26,
        "comments": 155,
        "media": null,
        "permalink": "/r/movies/comments/1lefrf4/best_movies_for_someone_whos_bedridden/"
    },
    {
        "id": "1ldxgza",
        "author": "lord_coen",
        "title": "David Lynch: an Iconic American Surrealist Filmmaker",
        "content": "David Lynch presented a uniquely innocent, yet penetrating, interpretation of the American Dream, a concept that could easily serve as the title for any of his films.",
        "upvotes": 441,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aULuODfrRkhDJyCGUHzNRp3-CAL_4hoCTu7i6DdKoh0.jpeg?auto=webp&amp;s=8c47639148b91806f5e8c310db652cdd4c4c705d"
        },
        "permalink": "/r/movies/comments/1ldxgza/david_lynch_an_iconic_american_surrealist/"
    },
    {
        "id": "1lel2w8",
        "author": "RejectingBoredom",
        "title": "Dated stuff aside, Dr. No actually holds up incredibly well",
        "content": "Watching Dr. No for the first time in over a decade. I binged the whole series over the summer of 2011 and decided to get back to the original.\n\nI think it’s because, relative to the other later films, Dr. No is quite simple that it’s aged well. I don’t know how its budget compares to Thunderball and the like, but this is a more standard 60s thriller with Bondisms added on top.\n\nHalf of the movie feels like a Caribbean detective adventure, and that just fits brilliantly. I do like the campy and more epic later films, but this format works, and I think it’s why Casino Royale is such a strong film too. \n\nObviously it has its “yep, definitely a ‘60s movie” moments, but as a spy thriller from 1962? Holds up pretty damn well. \n\nI have no clue why, I remembered this as one of the worst Bond movies. Connery is, of course, a huge part of why the movie works. ",
        "upvotes": 10,
        "comments": 12,
        "media": null,
        "permalink": "/r/movies/comments/1lel2w8/dated_stuff_aside_dr_no_actually_holds_up/"
    },
    {
        "id": "1ldpegs",
        "author": "MarvelsGrantMan136",
        "title": "Tom Rhys Harries Lands Role Of ‘Clayface’ In DC Studios James Watkins Movie",
        "content": "",
        "upvotes": 903,
        "comments": 130,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QsxslE2xjLvXqfPuZ0lkEnacTVb1EyGcovuiV1gZd6k.jpeg?auto=webp&amp;s=a61baba1715e7c7c9e284406a603bd16ad77ae15"
        },
        "permalink": "/r/movies/comments/1ldpegs/tom_rhys_harries_lands_role_of_clayface_in_dc/"
    },
    {
        "id": "1ldr27z",
        "author": "MarvelsGrantMan136",
        "title": "Pixar's ELIO - Review Thread",
        "content": "**Pixar's ELIO - Review Thread**\n\n* [Rotten Tomatoes](https://www.rottentomatoes.com/m/elio): 83% (54 Reviews)\n* [Metacritic](https://www.metacritic.com/movie/elio/): 62 (21 Reviews)\n\nReviews:\n\n[Variety](https://variety.com/2025/film/reviews/elio-review-pixar-1236433834/) (70):\n\n&gt;Elio is right at home in the Pixar catalog, but lacks those undeniable signs of intelligent life (wit, surprise and the capacity to expand the medium) that set the studio’s best work apart.\n\n[Hollywood Reporter](https://www.hollywoodreporter.com/movies/movie-reviews/elio-review-pixar-disney-zoe-saldana-brad-garrett-1236292709/) (60):\n\n&gt;Elio feels just a tad too familiar in its sights and story beats to seem totally fresh.\n\n[IndieWire ](https://www.indiewire.com/criticism/movies/elio-review-disney-pixar-1235132832/)(58):\n\n&gt;Elio isn’t a bad time at the theaters — it’s pretty to look at, charming enough, and frequently funny. But by shying away from investing in where its main character is coming from, the movie makes his galactic adventures feel a bit weightless.\n\n[SlashFilm](https://www.slashfilm.com/1888624/elio-pixar-movie-review/) (75):\n\n&gt;The frenetic pace may keep kids hooked, but parents will appreciate the sequences when Elio hits the pause button and allows audiences to sit in the silence — of complicated ideas, of emotionally challenging conversations, and of the wonders around us we too often fail to appreciate.\n\n[Collider](https://collider.com/elio-review-pixar/) (70):\n\n&gt;But despite how charming and fun Elio is, it still falls prey to some of Pixar’s occasional problems. Yes, this is a story of intergalactic adventures and a wide universe of possibilities, but it still can get a bit convoluted at times.\n\n[The Guardian](https://www.theguardian.com/film/2025/jun/17/elio-review-pixar):\n\n&gt;Overall, it’s an entertaining bit of summer fun.\n\n[Empire](https://www.empireonline.com/movies/reviews/elio/) (80):\n\n&gt;Robert Zemeckis’ Contact for kids. A slow start gives way to a charming, visually inventive adventure that might just inspire a new generation of astronomers to look to the skies.\n\nFor centuries, people have called out to the universe looking for answers—in Disney and Pixar's all-new feature film *Elio*, the universe calls back! The cosmic misadventure introduces Elio, a space fanatic with an active imagination and a huge alien obsession. So, when he's beamed up to the Communiverse, an interplanetary organization with representatives from galaxies far and wide, Elio's all in for the epic undertaking. Mistakenly identified as Earth's leader, Elio must form new bonds with eccentric alien lifeforms, navigate a crisis of intergalactic proportions, and somehow discover who and where he is truly meant to be.",
        "upvotes": 721,
        "comments": 424,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SwfXxusvXy7Ao8MdZ6P4M1Oo9wgdtHzA7PueZge1YcE.jpeg?auto=webp&amp;s=54c4d99de75bdcb92d88299f08040bd28dc93ff7"
        },
        "permalink": "/r/movies/comments/1ldr27z/pixars_elio_review_thread/"
    },
    {
        "id": "1le733k",
        "author": "Rubixcubelube",
        "title": "'Bring Them Down' is probably one of the best films I've ever seen. A brutal and believable examination of old family grudges in rural communities. Superbly shot. Sharp and to the point. As beautiful a piece of art as it is a moral reminder of how anger can lose everyone the battle.",
        "content": "I am a huge sucker for rural grudge match films and this hits all the notes. I've seen some critisicm about this film losing momentum, but fro my experience growing up around farms, thats entirely realistic to the way these kinds of things play out. Violence and generational antagonism end with regret and a dull thud, not explosions and winners. \n\nThis, combined with last years King Tide has me feeling spoilt and hopeful that real film making will continue despite the trouble we face. \n\nAnybody got any recommendations of films with similar themes?  ",
        "upvotes": 81,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mcdXbsxzJTXsb5WCaRWhhhdWkOxY4aGse87SNCApJ_g.jpeg?auto=webp&amp;s=41e18ea45aa8aa96e10bea9c5c5e2083b3ea912a"
        },
        "permalink": "/r/movies/comments/1le733k/bring_them_down_is_probably_one_of_the_best_films/"
    },
    {
        "id": "1ldyer6",
        "author": "MarvelsGrantMan136",
        "title": "Nakoa-Wolf Momoa &amp; Ida Brooke Join ‘Dune 3’",
        "content": "",
        "upvotes": 279,
        "comments": 170,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0Jdj8BYL3eyn1Quxfwk6butSWgrXQzzn2QEpBRD5TvA.jpeg?auto=webp&amp;s=570f2fc86f0838ba72eb6fa606446b7c01205b4e"
        },
        "permalink": "/r/movies/comments/1ldyer6/nakoawolf_momoa_ida_brooke_join_dune_3/"
    },
    {
        "id": "1lef1yo",
        "author": "LoopOF_reality",
        "title": "WEIRD Supernatural films which feel like a fever dream?",
        "content": "Want to watch some weird supernatural films which feel like a fever dream, idk movies like doonie darko  I guess or the first ghost rider, the tone and everything. Want to watch movies like that, please recommend as I am just binging movies to distract myself from real life as much as I can. Am looking for those truly weird, obscure, and interesting supernatural films that capture that fever dream aesthetic. movies that transport you to a different reality, where the line between the real and unreal is beautifully blurred. I want to dive into something that feels off-kilter and thought-provoking.\n",
        "upvotes": 17,
        "comments": 103,
        "media": null,
        "permalink": "/r/movies/comments/1lef1yo/weird_supernatural_films_which_feel_like_a_fever/"
    }
]