[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 12,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 713,
        "comments": 5203,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1o1iob4",
        "author": "pleasedontbemeantom3",
        "title": "Wayward was sooo good until it wasn't.",
        "content": "Did anyone else feel this way?\n\nSpoilers ahead.\n\n\nI was so sucked in by wayward, it was great, the plot the mystery, the acting (Mae was a little flat but that's their shtick and I like them and Toni was so awesome I just didn't mind), I was loving it. \n\nThere was so much energy and intrigue in the show. And then in episode 8, I felt like it just didn't deliver. I think it just wasn't good as a limited series. The mystery that was built was too big for the wrap up. I wanted to understand by the end something about the inner world or workings of the townspeople. In general, for a show which centered so much around emotions, the deeper we got into the series the more shallow the characters seemed to become. It was really disappointing. We never were let into the characters internal experience. \n\nI wanted so badly to see Laura and Alex actually TALK about things. Like the relationship was never sold as functional or emotionally intimate. I get if at first they were freaked out but when they got on the same page, why was the most we got was a a couple arguments? No real conversation. Alex is obsessive and won't let things go about work but his wife is obviously going through all this and not  actually planning on leaving town snd he's not bothering her constantly about it? \n\nThe timeline just felt wonky and poorly conceived following the set up. A great concept with poor follow through. I was left wanting more, but not in a good way, but in the way that I felt they would have to undo what they had done to answer things in a satisfying way. ",
        "upvotes": 70,
        "comments": 62,
        "media": null,
        "permalink": "/r/netflix/comments/1o1iob4/wayward_was_sooo_good_until_it_wasnt/"
    },
    {
        "id": "1o13lj2",
        "author": "BunnyBunny777",
        "title": "California bans loud commercials on Netflix (and others)",
        "content": "Newsom singed the bill effective 2026.  This should be a federal law.  Watching a show only to have a commercial suddenly start blaring 25 db louder is just menacing.  ",
        "upvotes": 99,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1o13lj2/california_bans_loud_commercials_on_netflix_and/"
    },
    {
        "id": "1o0zet1",
        "author": "Individual-Cut9977",
        "title": "Need new Netflix show recs that actually keep you hooked",
        "content": "I just finished my last series and now Im stuck scrolling for something good Everything either feels too slow or gets boring after a few episodes\n\nWhat are some shows on Netflix that pulled you in right away and actually stayed good till the end",
        "upvotes": 148,
        "comments": 345,
        "media": null,
        "permalink": "/r/netflix/comments/1o0zet1/need_new_netflix_show_recs_that_actually_keep_you/"
    },
    {
        "id": "1o1sum2",
        "author": "Byszer",
        "title": "Netflix house presale code?",
        "content": "Just wondering if anyone has a presale code they don’t need. I’m super excited to see the on in KOP open up in November. I live around the corner and am a huge one piece fan so when I saw that KOP would have One piece and Wednesday I was very happy!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o1sum2/netflix_house_presale_code/"
    },
    {
        "id": "1o1nlvw",
        "author": "cardsrealm",
        "title": "Mercy for None Review: Revenge and a Rare Glimpse into Korea",
        "content": "South Korea has captivated the world with its romantic dramas and the sound of K-pop. Yet **Mercy for None** reveals another side of the country, a darker one: the world of criminal factions.\n\nThe project originated from the webtoon **Plaza Wars** by Oh Se-hyung and Kim Kyun-tae, and was adapted for television by Choi Sung-eun and Yoo Ki-seong, who also wrote the screenplay. The series stars So Ji-seob as Nam Gi-joon, a former gangster, alongside Huh Joon-ho and Gong Myoung, who round out the main cast.",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o1nlvw/mercy_for_none_review_revenge_and_a_rare_glimpse/"
    },
    {
        "id": "1o1qhd5",
        "author": "_missEltorri_",
        "title": "Is Monster: The Ed Gein Story really that bad?",
        "content": "I'm on episode 4 atm, and I've seen a lot of people not like this season. I personally found it to be disturbing but in a way that's like \"you wanna look away but you can't.\" I don't see the show as trying to portray him to be sympathetic, I see what he's doing and what he's done. It's creepy as hell. And as disturbing as the previous 2 seasons were, I found them to be quite educational in a way. What signs to look out for, like it's teaching us what to be cautious of. I also heard that the next season has been green lit and will focus on a female killer which is kind of a relief in a way, cause I'd like to see how these people became who they are from both sides of the gender. But I get what others are saying about how Ryan Murphy is \"glorifying\" these people. Idk, I just wanna get other people's opinion on it.\n\nP.S. Forgot to mention that I love what they did with the correlation/motif &gt;!between Gein and the movie Psycho, I think it really brought it to life.!&lt;",
        "upvotes": 3,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1o1qhd5/is_monster_the_ed_gein_story_really_that_bad/"
    },
    {
        "id": "1o1beem",
        "author": "La_hOley",
        "title": "Did nobody in the town know that Ed Geins mother was dead in Monster?",
        "content": "Just couldn’t help but notice that even after she died he just kept referring to her as Mother as if she was still alive and the town didn’t seem to bat an eye. Wouldn’t the town of known in some way? It’s not like she died somewhere secluded and she had an actual funeral with her own gravestone. Is this a mistake or does this have any relevance to Ed Geins story?",
        "upvotes": 10,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1o1beem/did_nobody_in_the_town_know_that_ed_geins_mother/"
    },
    {
        "id": "1o1i7e2",
        "author": "Longjumping_Land_977",
        "title": "Real life recordings share the chilling actual voice Ed Gein had compared to the Netflix show",
        "content": "",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o1i7e2/real_life_recordings_share_the_chilling_actual/"
    },
    {
        "id": "1o1swbd",
        "author": "psyxech",
        "title": "only one movie won't play and the error code gives no results",
        "content": "so I was trying to rewatch kpop demon hunters (cringe I know, but let me enjoy things), but it keeps giving me the error code m7381 1204. looking it up both in the website and in google gives nothing. I use chrome and it's fully updated, restarted my laptop, changed profiles etc but it still wont work, and everything else plays just fine. does anyone know what could be happening?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o1swbd/only_one_movie_wont_play_and_the_error_code_gives/"
    },
    {
        "id": "1o1ncnz",
        "author": "kocainekaviar",
        "title": "Wayward",
        "content": "The plot was great but the acting really sucked . Every actor seemed like this was their first acting role . Daniel was the only good one and maybe Leila . Also gave off such genz vibes . Could’ve been under a teen drama if there wasn’t that awkward sex scene . Opinions ? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o1ncnz/wayward/"
    },
    {
        "id": "1o0s46h",
        "author": "Substantial_Copy_576",
        "title": "Anyone else stopped new TV shows until it has finished?",
        "content": "It’s not just Netflix but every single streaming platform out there are taking 2-3 years per season.\n\nIt’s super annoying, by the time the new season arrives, I barely remember anything about the show and all hype is long gone.\n\nHonestly, I’m skipping a lot of shows until it’s pretty much confirmed for final season or nearing it.\n\nAnd I definitely skip Netflix’s 2 part releases until they are all out. E.g. Wednesday season 2\n\n",
        "upvotes": 135,
        "comments": 58,
        "media": null,
        "permalink": "/r/netflix/comments/1o0s46h/anyone_else_stopped_new_tv_shows_until_it_has/"
    },
    {
        "id": "1o1fvdq",
        "author": "Sudden_Pop_2279",
        "title": "Alice In Borderland Achieves Rare Streaming Feat With Season 3",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o1fvdq/alice_in_borderland_achieves_rare_streaming_feat/"
    },
    {
        "id": "1o0w83p",
        "author": "sbailey7643",
        "title": "I actually enjoyed the Ed Gein Story",
        "content": "I have seen a lot of negative back lash regarding the series, but I actually enjoyed this season. \nFrom researching a bunch of the case, I find a lot of accuracy, and less inaccuracies. \nWhat are your thoughts?",
        "upvotes": 73,
        "comments": 87,
        "media": null,
        "permalink": "/r/netflix/comments/1o0w83p/i_actually_enjoyed_the_ed_gein_story/"
    },
    {
        "id": "1o1k8yb",
        "author": "SlateAlmond90",
        "title": "Has anyone else noticed that subtitles don't always show up?",
        "content": "I am on the last episode of the French series Nero the Assassin, and I noticed during several instances that part of the dialogue doesn't show up. I just noticed it again; where Nero says something that isn't translated, but then Hortense replies \"On the whole, no.\" But the thought occurred to me to rewind back to the start of the encounter, and the whole encounter seemed to translate with: \"Your father...\" Nero starts to say, \"Do you trust him?\" To which Hortense replies \"On the whole, no.\" Has anyone else noticed occasions like these when watching shows or movies that subtitled?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o1k8yb/has_anyone_else_noticed_that_subtitles_dont/"
    },
    {
        "id": "1o1pzl3",
        "author": "LadyLuckladyluck",
        "title": "My Life With The Walter Boys: Season 2 Wardrobe Design",
        "content": "I am almost through Season 2 of MLWTWB and I am *screaming* at the TV about the new costume designer's choices. \n\nShe dresses these high schoolers like they are in a nursing home. Not just like old people, but OLD PEOPLE. And I AM AN OLD PERSON. \n\nIt's getting so bad that at every scene change, I miss the first bit of dialogue because the costumes are just. so. bad. \n\nThe story in Season 2 isn't much better, but I think I could handle it better if the costume designer were in touch with what high school kids wear. (Hint: it ain't knit cardigans, lady!)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o1pzl3/my_life_with_the_walter_boys_season_2_wardrobe/"
    },
    {
        "id": "1o1e6di",
        "author": "Leo1951",
        "title": "New to Netflix",
        "content": "Yes, I'm old and only recently got rid of cable and started streaming. I just watched the first two seasons of The Way Home and really liked them. I know that I can purchase season 3 on Prime, but will it eventually be available on Netflix?",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1o1e6di/new_to_netflix/"
    },
    {
        "id": "1o1e0qd",
        "author": "Sad-Procedure-8160",
        "title": "Demon Slayer Age question",
        "content": "The Question:\nHey, I am 12 years old would yous any I could watch demon slayer or is it to violent? Also this question is related to guys who watched demon slayer. Also thanks if somebody of you helped me",
        "upvotes": 3,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1o1e0qd/demon_slayer_age_question/"
    },
    {
        "id": "1o1dxcz",
        "author": "JamieReleases",
        "title": "Train Dreams | Official Trailer",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o1dxcz/train_dreams_official_trailer/"
    },
    {
        "id": "1o1mtkz",
        "author": "InternationalRead840",
        "title": "[ESQUIRE] ‘Splinter Cell’ Returns: How the Stealth Game Was Resurrected for a Lethal TV Series",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o1mtkz/esquire_splinter_cell_returns_how_the_stealth/"
    },
    {
        "id": "1o1g0a8",
        "author": "ElLucifer666_",
        "title": "Black Rabbit RANT!",
        "content": "RANT! I only watched Black Rabbit because I saw reviews on here saying the ending was such a mind twist!\n\nFirst off the when I found out Jules had sexually assaulted Anna which - was ignored by Jake.WHO IS JULES. I literally had to restart all over from episode one to find out who Jules IS. There is no character build up. \n\nThis series is very vague and all over the place the only reason I kept watching was because users on here said the ending was a plot twist. Honestly the whole reason why I watched was waiting for this twist that never came. I was expecting some psychological thriller by the way people talked about it and this series was so BLAND. Waste of time. Not sure how this got any good reviews. ",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1o1g0a8/black_rabbit_rant/"
    },
    {
        "id": "1o0kro4",
        "author": "croissantdeprived",
        "title": "Finally, Nurse Jackie is on Netflix!",
        "content": "7 seasons, 80 episodes of absolutely bingeable, brilliant tv.\n\nI've been waiting forever for this to stream on a service with no ads.\n\nIf you haven't seen it, you should. Witty dialog, complex storylines, well developed characters. Amazing acting, especially by Edie Falco and Merritt Wever. ",
        "upvotes": 151,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1o0kro4/finally_nurse_jackie_is_on_netflix/"
    },
    {
        "id": "1o1m2rf",
        "author": "DollVexx",
        "title": "Is it a movie series?",
        "content": "Going through a difficult time and I need a distraction, recommend a movie or series that you have seen and can't believe that someone else hasn't seen it, something that you loved, I need one that captivates me, what would it be?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o1m2rf/is_it_a_movie_series/"
    },
    {
        "id": "1o1elk2",
        "author": "rohanad1986",
        "title": "First Festive Look at Rowan Atkinson in Netflix's 'Man vs Baby'",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o1elk2/first_festive_look_at_rowan_atkinson_in_netflixs/"
    },
    {
        "id": "1o1jatm",
        "author": "KaGuravv",
        "title": "Wolf king is basically game of thrones explained to a child",
        "content": "Blond and cruel, literally !Lion! rulers as the opposition. Wolfs as the other aka literally Starks and Lannisters lol. All this “remembering important people” training this maester guy does .  All these political themes turned into animal form and a bit lessened. Literally the prince being a blonde sadistic disaster as joffrey was. It gets better and better and I’m not complaining . Probably more similarities along the way , feel free to share lolz\n\nPs: now not to mention the girl from the basically “close to enemies” house being red-haired and berthroded to our Joffrey ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o1jatm/wolf_king_is_basically_game_of_thrones_explained/"
    },
    {
        "id": "1o1j7gi",
        "author": "isla-bonita",
        "title": "Ed Gien and Mind Hunters",
        "content": "Did anyone notice the part where the detectives from Mind Hunters, portrayed by the charter actors, appear in the last episode of Ed Gein? I am wondering how this is all connected and was Ryan Murphy apart of making Mind Hunters? I really loved that show and got disappointed when it seemed to be cancelled. ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1o1j7gi/ed_gien_and_mind_hunters/"
    },
    {
        "id": "1o118jb",
        "author": "No_Resolution315",
        "title": "\"Never Have I Ever\"- the only show where they show high school as it is?",
        "content": "As a fan of american teen dramas, i feel like \"Never have i ever\" is the only show where they show school like as it is. And where teenagers behave like teenagers not some 35 year olds with bunch of experience and shit. \n\nAlso, in this show, there are like class breaks, projects, extra credits and everything. And other shows be like girls trying hard to be the \"it\" girl. Cross-Sleeping with everyone in a particular gang. Drugs, bullying, and everything but actualy studying or schooling. \n\nOr does schools in america are actually like that? As an indian myself, \"Never have i ever\" was the only show that comes comparitively close to how we knew school as. ",
        "upvotes": 11,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1o118jb/never_have_i_ever_the_only_show_where_they_show/"
    },
    {
        "id": "1o1fa7g",
        "author": "ToonAdventure",
        "title": "The Bad Guys: Breaking In NEW SERIES Trailer | Netflix Family",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o1fa7g/the_bad_guys_breaking_in_new_series_trailer/"
    },
    {
        "id": "1o10vjr",
        "author": "NjXLoneWolf",
        "title": "The Ed Gein Story. Didn’t love it. Didn’t hate it.",
        "content": "I just finished the last episode, and I believe the show was intended to be more of a social commentary, almost borderline satire. I didn’t hate it but didn’t love it either. At first I was getting annoyed by the clear inaccuracies, or embellishments and what seemed like lazy writing. It feels more like the show was designed to critique modern fascination with blood lust, and the twisting of stories by the media, authors, writers, movies, etc. for entertainment. The girlfriend seemed more like a schizophrenic hallucination or possibly a symbol of a textbook female lover in a horror story. She didnt feel like a real character. Her dialogue was off, she was inconsistent, and unrealistic. I think that was the point. They didn’t want to spell the underlying message out for the viewers. \n\nNow with all that said, I wish they didn’t go about it this way. This show had real potential to be great. It was shot well, the music was good, good actors, interesting dialogue at times, the real story was crazy enough. But there were many scenes that were forced in there with no significance. Pulling you out of the story and into one of Ryan Murphy’s strange fantasies. Also the title is misleading, the title “The Ed Gein Story” gives the impression this is a somewhat accurate representation of the actual Ed Gein Story. It is far from that. While i finished the show, i lost interest halfway through episode 6. I honestly wouldn’t recommend it. Watch Mindhunter or American Primeval instead lol. \n",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o10vjr/the_ed_gein_story_didnt_love_it_didnt_hate_it/"
    }
]