[
    {
        "id": "1qarzcp",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 23,
        "comments": 8078,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qarzcp/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1qffoc2",
        "author": "scoreboard-app",
        "title": "Post-Match Thread: Real Madrid vs Levante UD | LaLiga 25/26 | Jan 17, 2026",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1qffoc2)",
        "upvotes": 47,
        "comments": 316,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qffoc2/postmatch_thread_real_madrid_vs_levante_ud_laliga/"
    },
    {
        "id": "1qg8q8a",
        "author": "AlekhineAl",
        "title": "Bernabeu was an absolute nightmare yesterday. Incredible scenes!",
        "content": "",
        "upvotes": 571,
        "comments": 87,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/lzf06gj024eg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qg8q8a/bernabeu_was_an_absolute_nightmare_yesterday/"
    },
    {
        "id": "1qgabw3",
        "author": "No-Independent2522",
        "title": "Militao turns 28 🎉 Happy Birthday 🎂",
        "content": "",
        "upvotes": 151,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0c33bcp5e4eg1.jpeg?auto=webp&amp;s=60ec60abfcda62e30aa100bda835e2436a919051"
        },
        "permalink": "/r/realmadrid/comments/1qgabw3/militao_turns_28_happy_birthday/"
    },
    {
        "id": "1qfqobv",
        "author": "AbuElKess",
        "title": "Real Madrid beat Schalke 5-4 on aggregate in the 14/15 UCL RO16. Ronaldo scored 3 and got 1 assist. Madrid lost the 2nd leg 4-3 at home. Ronaldo scored 2. He stood at the centre of Bernabèu and listened to the boos.",
        "content": "",
        "upvotes": 2799,
        "comments": 107,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/kf4uyo7pizdg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qfqobv/real_madrid_beat_schalke_54_on_aggregate_in_the/"
    },
    {
        "id": "1qg9b03",
        "author": "Ready_Ad_1353",
        "title": "Jose Mourinho when asked about a possible return to Real Madrid: “Don’t count me on for soap operas, There are good soap operas, but they are very long.” “If you miss 1 or 2 episodes, you lose track, Don’t count me on for soap operas, because I don’t watch soap operas.",
        "content": "",
        "upvotes": 149,
        "comments": 18,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/u91uri2h64eg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qg9b03/jose_mourinho_when_asked_about_a_possible_return/"
    },
    {
        "id": "1qfzxxd",
        "author": "TeacherNo8591",
        "title": "If the players are 'sad' about the whistles, wait until they hear how we feel about them forcing out a generational coach.",
        "content": "I saw the reports saying the board and players are \"surprised and disappointed\" by the whistles today. Honestly, it’s hilarious. They are surprised by the whistles, but were they surprised when they forced a generational coach like Xabi Alonso out?\n\nPeople love to call international fans \"glory hunters,\" but I’m here in Asia region waking up at 2:00 AM every single week to watch this mess. I don’t watch for the \"glory\" of the past, I watch because I love this club. But right now, the club doesn’t feel like it loves the fans back.\n\nHere is the reality the board needs to hear:\n\n• No Player is Above the Club: We watched a group of players create a mess, undermine a world-class coach, and ultimately get him sacked. Instead of holding the players accountable, the board backed them and is now trying to \"discipline\" the fans for reacting.\n\n• The \"Whistle\" is our Voice: If the board thinks they can use security cameras to monitor the Grada and stop the booing, they’ve lost the plot. The Bernabéu whistles because we demand excellence. If you don't want to be whistled, show the effort on the pitch.\n\n• We are willing to suffer, but not like this: Every club has bad seasons. We can handle losing if the team fights. What we can’t handle is a board that protects \"untouchable\" stars while threatening the fans who actually pay (and wake up at 2 AM) to support them.\n\nStop being \"disappointed\" in the stands and start being disappointed in the locker room. The badge comes first. Always.",
        "upvotes": 540,
        "comments": 65,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qfzxxd/if_the_players_are_sad_about_the_whistles_wait/"
    },
    {
        "id": "1qfvrcg",
        "author": "O333O",
        "title": "Best win percentage: Xabi Alonso",
        "content": "Thought this was interesting. Per last decade and who knows how it would have continued but on paper he really didn’t do bad at all. I don’t understand why you bring a coach in with a vision and then not allow him to do his thing. Give it time, understand that the divas in the dressing room will need to adjust but let’s see the vision in its entirety ",
        "upvotes": 718,
        "comments": 81,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/a7zsthb8m0eg1.jpeg?auto=webp&amp;s=830c94bbadd9afea2c65c82d8c1116371f2d4a5e"
        },
        "permalink": "/r/realmadrid/comments/1qfvrcg/best_win_percentage_xabi_alonso/"
    },
    {
        "id": "1qgaaok",
        "author": "DoriOli",
        "title": "Keeping our promises ⭐️",
        "content": "",
        "upvotes": 69,
        "comments": 5,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/lx4rllrsd4eg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qgaaok/keeping_our_promises/"
    },
    {
        "id": "1qg9mef",
        "author": "kenstarfighter1",
        "title": "Breaking: How Laporta conned Florentino Perez",
        "content": "&gt;The reason Joan Laporta is Barcelona's president today is DIRECTLY THANKS to Florentino Perez! During Barcelona's elections, Florentino directly called the Sabadell Bank, as Joan Laporta needed to deposit €124.6M into Barcelona's accounts and he didn't have it. Sabadell were very reluctant at first, because Barca were in a financial crisis and couldn't guarantee payment, but it was Florentino Perez that kept insisting so much that the bank ended up approving the payment. The reason Florentino did this is because he considered Laporta a Super League ally at the time, however, Barcelona have now left the Super League.\n\n&gt;Joan Laporta pushed for a change to Sports Laws in 2022. Spanish law used to say that boards in football clubs needed to deposit 15% of the club's budget in cash. Laporta was worried that he would start losing his own money and properties because of this law, so he asked for the law to change. Florentino Perez saw Laporta as his Super League ally, so he backed Laporta's request and also pushed for the law to be changed in Spanish Congress. With the law changed, and Barca's team rebuilt, Barcelona then left the left Super League and negotiated a return to UEFA\n\nThis is from El Confidencial. Basically, Barca's rise from the ashes, including their last 2 league titles, are thanks to Perez. \n\nOur squad planning and on field issues are on thing, but this right here is something else. This alone is ground for termination imo. ",
        "upvotes": 57,
        "comments": 27,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qg9mef/breaking_how_laporta_conned_florentino_perez/"
    },
    {
        "id": "1qfrpm8",
        "author": "asensia-kopfschmerz",
        "title": "Sadness, surprise and disappointment among the Real Madrid players and management after the historic booing at the Bernabéu. Neither the club nor the players expected such a protest from their fans. What happened against Levante has generated sadness, surprise, and disappointment.",
        "content": "",
        "upvotes": 893,
        "comments": 177,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Kll60YTvc89_w-xeg9tRyyU1ngqHnSe4j9Pqx3PGKnA.jpeg?auto=webp&amp;s=ed0232dc1def167d974bd7a62fd7f512d57e0d7f"
        },
        "permalink": "/r/realmadrid/comments/1qfrpm8/sadness_surprise_and_disappointment_among_the/"
    },
    {
        "id": "1qgcdue",
        "author": "vil727",
        "title": "How are rival fans saying THIS isn't a penalty?",
        "content": "",
        "upvotes": 39,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zbyufjxls4eg1.jpeg?auto=webp&amp;s=744d63236cde1ca81ff4acb21aa3c6c0fce8c50d"
        },
        "permalink": "/r/realmadrid/comments/1qgcdue/how_are_rival_fans_saying_this_isnt_a_penalty/"
    },
    {
        "id": "1qg8xmh",
        "author": "No-Independent2522",
        "title": "Anas Laghrari, a powerful financier without an official role, has become Florentino Pérez’s closest adviser. He is increasingly mentioned as a future candidate for chief executive officer in a new commercial structure the club intends to establish.",
        "content": "",
        "upvotes": 54,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sdmQWHGZ6IJVak6e3tnSB2LknBQWbn0Xwoh4Lte8cxE.jpeg?auto=webp&amp;s=2bf5714dcdd93424e126aa4dd073b49073bab3fe"
        },
        "permalink": "/r/realmadrid/comments/1qg8xmh/anas_laghrari_a_powerful_financier_without_an/"
    },
    {
        "id": "1qfdut2",
        "author": "No-Independent2522",
        "title": "Madrid players getting booed at half time in the Bernabéu",
        "content": "",
        "upvotes": 3193,
        "comments": 99,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9p4gt2f01xdg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qfdut2/madrid_players_getting_booed_at_half_time_in_the/"
    },
    {
        "id": "1qg4tpf",
        "author": "Bunchdawg",
        "title": "You guys will watch one of the best coaches in the world say this but pretend you know better",
        "content": "",
        "upvotes": 76,
        "comments": 88,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/glzo0k3yz2eg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qg4tpf/you_guys_will_watch_one_of_the_best_coaches_in/"
    },
    {
        "id": "1qfgmfq",
        "author": "OwnWitness2836",
        "title": "Vini went straight to the locker room and did not stay with the rest of the players to applaud the fans after the final whistle.",
        "content": "",
        "upvotes": 2042,
        "comments": 447,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/fgx2zkl0lxdg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qfgmfq/vini_went_straight_to_the_locker_room_and_did_not/"
    },
    {
        "id": "1qg1jcp",
        "author": "asensia-kopfschmerz",
        "title": "At the start of the match, the rest of the stadium protested when the Grada fans, the club’s organised fan group located behind one of the goals, cheered on the team. In the final minutes, the Grada fans chanted the new coach’s name, with some boos in response.",
        "content": "",
        "upvotes": 128,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TNLi489ZSWoWlo7DzTEjMKqCIjjEyISD-Rnq_gqcxAY.jpeg?auto=webp&amp;s=94b3c8e431c79413e8f686bedab4738a6fe3f8ea"
        },
        "permalink": "/r/realmadrid/comments/1qg1jcp/at_the_start_of_the_match_the_rest_of_the_stadium/"
    },
    {
        "id": "1qfwgwq",
        "author": "_thestarkboy",
        "title": "Dreaming is free! 10 year challenge?",
        "content": "",
        "upvotes": 177,
        "comments": 33,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ul1uilg3s0eg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qfwgwq/dreaming_is_free_10_year_challenge/"
    },
    {
        "id": "1qfhm4y",
        "author": "Scary-Procedure-6018",
        "title": "🚨🚨Breaking: Arbeloa's top aim is to strengthen his relationship with all the players and make them as comfortable and happy as possible",
        "content": "",
        "upvotes": 1105,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/6nqb4ryurxdg1.jpeg?auto=webp&amp;s=1d3f65bec82c9c45deba1c273520cbad96f453c7"
        },
        "permalink": "/r/realmadrid/comments/1qfhm4y/breaking_arbeloas_top_aim_is_to_strengthen_his/"
    },
    {
        "id": "1qgbp7c",
        "author": "Violet_Kitty_room319",
        "title": "Jude Bellingham Vs Xabi Alonso",
        "content": "I can't fathom why Jude is getting so much shit from fans over Xabi's sacking, even after [the statement](https://www.reddit.com/r/realmadrid/comments/1qbzwlz/jude_bellingham_calling_out_reports_that_he_had/) he put out. Valverde &amp; Vini had both made their feelings clear (to varying degrees) whilst Bellingham remained professional throughout. We have seen nothing negative, he's played where asked without complaint &amp; spoken highly of Xabi repeatedly. But the athletic said otherwise (without actually stating what Jude's issue was exactly) so that holds more weight? \n\nFor some reason fans have sided with the media over a player who has repeatedly expressed his love for &amp; shown respect to the club, whilst consistently working hard on the pitch. Even when he has an average game you can still see the effort he makes, how he gets frustrated with himself. For him to be booed like that over other players all because of 'reports' is fucked up. I can see how Vini made a rod for his back but Jude didn't.   \n  \nBe fickle in your support all you want but at least know the facts. Here are a few things Jude has said about Xabi:  \n\"*I’m still learning and I want to be better everyday, I still want to know more tactically about the game and he gives me a great chance of doing that with his knowledge of the game*\".   \n  \n\"*It's a good win, still not perfect, but the coaches' ideas are amazing, and we want to keep going.*\"   \n  \n\"*The manager's been great, I've personally got a great relationship with him, a lot of the lads do as well*\".  \n  \nOn his youtube (via his app) he said the opinion of the coach matters most to him (after teammates &amp; fans).  \n  \nOn RMTV's piece for his 100th game he said \"*It's different because every game I feel fortunate to be able to tactically analyze how I've played.*\" **He said this long before there was any talk of players not wanting to do video analysis.**  \n  \nBoth Xabi &amp; Jude said they talked everyday. In one of Xabi's press conferences he implied he had helped Jude with personal stuff (this was around the time there was news of his parents splitting &amp; the england noise), Jude also acknowledged that the season under Xabi was far from a disaster in the press conference he did for the super cup.   \n  \nI know people will trot out the usual 'PR' jab, but compare his words to how others spoke, a lot of what he said he didn't need to when you look at the full quotes. I think Jude made himself clear if you have the ability to comprehend.  \n   \nIn November in a press conference Xabi said \"*I have very good communication with Jude, a very good relationship. He's a lad who is already a world class player. but he has that hunger to improve, that desire to learn, to become more efficient with the huge potential he has. I love those kinds of players who have that curiosity &amp; take the initiative to come and ask \"what can we do better?*\" Does that sound like Jude was dismissive?  \n  \nI know posting this here is probably pissing in the wind but it needed to be said. Until something real comes out that proves otherwise I'll choose to believe Bellingham over the media &amp; bots.",
        "upvotes": 13,
        "comments": 53,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qgbp7c/jude_bellingham_vs_xabi_alonso/"
    },
    {
        "id": "1qg3s91",
        "author": "Bijay12356",
        "title": "Discussion about Arda",
        "content": "Arda Güler creates a chance every 25 minutes in La Liga this season. Should we start him in our next champions league game against AS Monaco? Earlier this season Mbappe and he were such a well clicked duo for us before Jude Bellingham came back from injury. Even in yesterday's match, he was the turning point for us.",
        "upvotes": 44,
        "comments": 51,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qg3s91/discussion_about_arda/"
    },
    {
        "id": "1qfq9kk",
        "author": "Downtown-Anything960",
        "title": "Arbeloa on Vinícius: I’m going to work on getting the best out of him. I’ll demand his teammates look for him and give him as many passes as possible. He’s one of the most decisive players in the world. I'm incredibly proud to be his coach",
        "content": "",
        "upvotes": 260,
        "comments": 156,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/91ghhm4mfzdg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qfq9kk/arbeloa_on_vinícius_im_going_to_work_on_getting/"
    },
    {
        "id": "1qfdfjj",
        "author": "No-Independent2522",
        "title": "[Mario Cortegana] The Santiago Bernabeu giving the whole team lots of whistles. The loudest against Vinicius and Bellingham. Mbappe hardly got any whistles.",
        "content": "",
        "upvotes": 1028,
        "comments": 102,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ic0fskzlxwdg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qfdfjj/mario_cortegana_the_santiago_bernabeu_giving_the/"
    },
    {
        "id": "1qfem2h",
        "author": "No-Independent2522",
        "title": "Asencio scores header from Gulers corner 2-0 Levante",
        "content": "",
        "upvotes": 733,
        "comments": 59,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/k38q8n9q6xdg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qfem2h/asencio_scores_header_from_gulers_corner_20/"
    },
    {
        "id": "1qfht94",
        "author": "AlekhineAl",
        "title": "Maybe Arda - Mbappe connection in the final third is just what we require this season.",
        "content": "",
        "upvotes": 481,
        "comments": 79,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/xtgmnvd7txdg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qfht94/maybe_arda_mbappe_connection_in_the_final_third/"
    },
    {
        "id": "1qflurp",
        "author": "goodarchitect",
        "title": "Arda Güler has created the most chances per 90 in Europe's top five leagues this season, with 3.68 in LaLiga",
        "content": "he needs to start every match as #10 ahead of jude",
        "upvotes": 293,
        "comments": 51,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jq09b94ujydg1.png?auto=webp&amp;s=91aeb831cbf6c48dae1e5e7b29457eafce3851e1"
        },
        "permalink": "/r/realmadrid/comments/1qflurp/arda_güler_has_created_the_most_chances_per_90_in/"
    },
    {
        "id": "1qfct3r",
        "author": "ace-s",
        "title": "Loudest boos have been towards Valverde and Vini rightfully so",
        "content": "Proud of our fans in the stadium, I hope they keep it up. Knowing Vini he will take it personally and blame everything but himself.\n\nAll these years never seen such spoiled players. They one trophies on the back of players like Kroos, Modric, benz and Tbo. \n\nI really hope this humbles them, \n\nThis is Real Madrid, no one is above the club. Not a single player.",
        "upvotes": 851,
        "comments": 116,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qfct3r/loudest_boos_have_been_towards_valverde_and_vini/"
    },
    {
        "id": "1qfd84v",
        "author": "OwnWitness2836",
        "title": "Real Madrid Fans At The Santiago Bernabeu are Chanting \"FLORENTINO, RESIGN! FLORENTINO, RESIGN!\"",
        "content": "",
        "upvotes": 793,
        "comments": 31,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/r5glc0rxvwdg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qfd84v/real_madrid_fans_at_the_santiago_bernabeu_are/"
    },
    {
        "id": "1qf8ahl",
        "author": "alexander_the_dead",
        "title": "This is the level of urgency we haven't seen in the last 2 seasons",
        "content": "",
        "upvotes": 1653,
        "comments": 99,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/s0wdb5h9ivdg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qf8ahl/this_is_the_level_of_urgency_we_havent_seen_in/"
    },
    {
        "id": "1qff3y2",
        "author": "AccomplishedWatch834",
        "title": "Arda deserves more game time",
        "content": "A MVP level performance from him, best creator of the game today and the ball coordination and play creation was on point as well🌟\n\nHopefully under the new manager he can become a regular starter because at the moment he’s the only link from the midfield to the attack in my opinion and i do believe he honestly gave his all to the badge too",
        "upvotes": 495,
        "comments": 227,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/o7anw1bfaxdg1.jpeg?auto=webp&amp;s=d171f53af790ffd860c837fa8ef416792605d95b"
        },
        "permalink": "/r/realmadrid/comments/1qff3y2/arda_deserves_more_game_time/"
    }
]