[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 496,
        "comments": 272,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 14,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jeot1i",
        "author": "flannel_flower",
        "title": "Why are so many missing the point of Adolescence?",
        "content": "There’s a lot of articles on Facebook about the new series Adolescence and the vast majority of people seem to have completely missed the point of the series and the message it’s trying to convey?                                                                   You have people asking whether Jamie really killed Katie, saying that it was left on a cliff hanger and there will be a series 2, that it was about bullying or knife crime. The series is clearly about toxic masculinity and how young boys are being brain washed by Andrew Tate and the likes. Jamie couldn’t handle being rejected by a “flat-chested” girl who was weak and vulnerable after her topless photos were circulated. He thought he was entitled to her, that he deserved her. She did ridicule him online with her comments on his Instagram which was a contributing factor but it really did come down to Jamie thinking he was entitled to Katie.",
        "upvotes": 85,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1jeot1i/why_are_so_many_missing_the_point_of_adolescence/"
    },
    {
        "id": "1jedgsd",
        "author": "S4v1r1enCh0r4k",
        "title": "‘Adolescence’ Becomes Netflix’s Most-Watched Show of the Week",
        "content": "",
        "upvotes": 337,
        "comments": 118,
        "media": null,
        "permalink": "/r/netflix/comments/1jedgsd/adolescence_becomes_netflixs_mostwatched_show_of/"
    },
    {
        "id": "1jebdhw",
        "author": "Greedy_Safety_4674",
        "title": "WATCH Adolescence!",
        "content": "Just finished Adolescence and wow. I’m not going to get into a long psychological analysis here. But, uh…let’s just say, I’m deeply disturbed by this show. I never thought I’d find a 13 year old scary. \n\nAfter ep. 3: hide your kids, hide your husband, and hide your wives (mm, the husbands may be safe though given his pathology).",
        "upvotes": 94,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1jebdhw/watch_adolescence/"
    },
    {
        "id": "1jekvw2",
        "author": "udar55",
        "title": "Feds Indict Director Who Allegedly Scammed Netflix Out Of Millions",
        "content": "",
        "upvotes": 24,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jekvw2/feds_indict_director_who_allegedly_scammed/"
    },
    {
        "id": "1jel31z",
        "author": "Deanno0",
        "title": "best series you’ve ever seen on Netflix . Go!",
        "content": "Post the best series you’ve ever seen ! So many options and shows aren’t what they used to be. Trying to find something worth binging. Post here or send me a private message of a list of them . Thanks!",
        "upvotes": 6,
        "comments": 129,
        "media": null,
        "permalink": "/r/netflix/comments/1jel31z/best_series_youve_ever_seen_on_netflix_go/"
    },
    {
        "id": "1jem7kh",
        "author": "Grouchy-Ad-1863",
        "title": "Adolescence - What's Your View?",
        "content": "Your View on Adolescence\n\nAs parents, teens, or kids, how do you view the message of Adolescence? I'd like to get different perspective on how different age groups grasp its message. \n\nI started overthinking about my child's future and how I am doing as a parent after seeing it. :( \n",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jem7kh/adolescence_whats_your_view/"
    },
    {
        "id": "1jernos",
        "author": "ThunderChild247",
        "title": "Netflix on Apple TV won’t play WWE content without re-installing app",
        "content": "Is anyone else having this issue?\n\nThis has been happening since WWE came to Netflix. Any time I try to watch Raw, Smackdown or NXT (replay or live), I have to uninstall and re-install the Netflix app. \n\nThe content shows in the menu, I have the “Play with adverts” button, but when I press it, nothing happens. \n\nThe app and the Apple TV is fully up to date. I can play the content on my account on my phone, iPad and TV, but not on the Apple TV. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jernos/netflix_on_apple_tv_wont_play_wwe_content_without/"
    },
    {
        "id": "1jescpd",
        "author": "Yogi8156",
        "title": "Unable to watch New movies",
        "content": "Can someone explain the Sony Netflix deal to me? Venom 3 came out, but I can't watch it on their plan with ads. I mean, would they make more money on the ad plan than with no ads? Will I ever be able to watch, or do I just have to upgrade my plan? I don't make that much money, so that's why I got the lowest plan, but this seems unfair.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jescpd/unable_to_watch_new_movies/"
    },
    {
        "id": "1jeoa1u",
        "author": "Steerpike58",
        "title": "Adolescence - Episode 3, rehearsals and acting question",
        "content": "I just finished Adolescence on Netflix and was pretty blown away by the acting, especially since they shot each episode in one continuous take.  Specifically, in Episode 3, there's a 45+ minute scene in which the young boy (Jamie) is in conversation with the clinical psychiatrist Briony.  \n\nMy question is, how did that young actor (Owen Cooper) pull it off? Did they do a ton of rehearsals? Did he ad-lib any of it?  Did they have his lines posted up on big boards that they hand-held for his use, which they somehow managed to keep out of sight of the (constantly moving) camera?  How many full takes did they do before they determined that they had what they needed? \n\nApparently he's an unknown actor and this was his first role. Even if he's older than 13 in real life, he's pretty darned young to be able to pull off such a performance. \n\nUPDATE - found this article - [Owen Cooper in Adolescence: is this the best child acting debut since Jodie Foster? | The Standard](https://www.standard.co.uk/culture/tvfilm/boy-adolescence-owen-cooper-b1217411.html)  \\- he was 14 at the time, and the 50+ minute episode took 3 weeks to film; 1 week of rehearsals, 1 week of 'tech' rehearsals, 1 week of final filming with 2 takes a day, roughly.  So maybe they did up to 10 takes and picked the best one? \n\nPretty amazing. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jeoa1u/adolescence_episode_3_rehearsals_and_acting/"
    },
    {
        "id": "1jem9o7",
        "author": "x-kraken",
        "title": "How can i get Subtitles downloaded with episodes im downloading?",
        "content": "Hi, When i watch a show or a movie online it have every languages for subtitle and Dub but when i download it i get only two languages, at least i want it to download german with it how can i do that? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jem9o7/how_can_i_get_subtitles_downloaded_with_episodes/"
    },
    {
        "id": "1jem9c4",
        "author": "MysteriousDelay6266",
        "title": "Karma | Official Trailer | Netflix | April 4",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jem9c4/karma_official_trailer_netflix_april_4/"
    },
    {
        "id": "1je98fh",
        "author": "Big-Acanthisitta8797",
        "title": "The Recruit",
        "content": "Who else is feeling bummed that there won’t be a Season 3? It’s disappointing when a great show ends too soon, leaving us wanting the next part of the story and characters!",
        "upvotes": 10,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1je98fh/the_recruit/"
    },
    {
        "id": "1jdh87u",
        "author": "yahooentertainment",
        "title": "The Terrifying Truth Behind Netflix’s ‘Adolescence’",
        "content": "**From The Wrap:**\n\nThe four-part Netflix series [“Adolescence”](https://thewrap.com/tag/adolescence/) is already making waves after its debut on Friday, with many wondering if the tale of a teen who has been accused of killing a female classmate is based on a true story.\n\nThe young boy, played by Owen Cooper, is quickly revealed to be guilty of the crime in the first episode, and the series begins a larger, steeper dive into incel culture and gender violence that has been promoted by influencers such as Andrew and Tristan Tate.\n\n“In the U.K., there’s a real problem with knife crime, certainly in the younger generation. There have been a series of of young boys who were killing young girls with knives, and it was really upsetting,” director Philip Barantini [told TheWrap](https://www.thewrap.com/adolescence-netflix-cast-creators-behind-the-scenes/) this month. “That was the seed that we wanted to explore, and send a bit of a message and maybe spark a bit of a conversation.”",
        "upvotes": 630,
        "comments": 168,
        "media": null,
        "permalink": "/r/netflix/comments/1jdh87u/the_terrifying_truth_behind_netflixs_adolescence/"
    },
    {
        "id": "1jen5px",
        "author": "Playful_Shake3651",
        "title": "Adolescence - Jamie Discussion",
        "content": "I just finished the show and loved it, especially the acting. There's alot I can and want to say about the show but to streamline this Jamie discussion I'll leave it at I loved the show and acting.\n\nAfter finishing I started scrolling through r/Netflix and the amount of threads and comments about how Jamie is a monster, he was a psychopath, etc... was shocking to me. \n\nYes what he did was horrible and the way he did it was clearly very brutal, but like wasn't the entire point of them constantly mentioning incels supposed to be a clear indication that Jamie was not actually a \"bad\" kid, but just a victim of this Andrew Tate anti-women movement? I thought it was so incredibly in your face the entire show that it would be impossible for anyone to not realize what the message of the show was, but like I said I found an astounding number of threads and comments completely ignoring that Jamie was molded into a monster, not born one.\n\nThe 4th episode is just the parents grieving about what they may have done wrong and they even literally talk about how they thought he was safe at home on his computer, how more obvious can the writers / directors make it? Yet somehow people came to the conclusion he was just born a psychopath and all he needed was a trigger?!?!?\n\nTLDR: This show is about how the incel / anti-women movement impacts our young men correct? Not about the next John Wayne Gacey getting caught early before he could do more harm? Its shocking how many people completely missed the purpose of the show and somehow came to the conclusion that Jamie was just a natural born psycho and nothing more.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jen5px/adolescence_jamie_discussion/"
    },
    {
        "id": "1je3tto",
        "author": "Robemilak",
        "title": "Happy Gilmore 2 | Official Teaser Trailer | Netflix",
        "content": "",
        "upvotes": 13,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1je3tto/happy_gilmore_2_official_teaser_trailer_netflix/"
    },
    {
        "id": "1jehljl",
        "author": "Ordinary_survival",
        "title": "Apple cider vinegar tv series",
        "content": "I watch a  lot of tv shows, but this one got me. I can not even imagine to con people that doesn’t have money, let alone people has any kind of illness. I feel we need an awakement to these kind of profiting! ,and unite against to  these people who think they can profit from sick people.\n\nIf you think it is ok to overlook, think twice. It might be your favourite neighbor, or a very nice neighbor you haven’t met yet. God forbid someone from tour family. So watch it, don’t fool for these “new” treatments. And hope you heal faster than you imagine 🙏🏻",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1jehljl/apple_cider_vinegar_tv_series/"
    },
    {
        "id": "1jemafs",
        "author": "StarPrincess101",
        "title": "Recommendations about movies/series that are horror, terror or mystery",
        "content": "Please, recommend movies or series about the following genres:\n\nHorror\nTerror\nMystery\nScifi\n\nI prefer more recommendations about movies. The newer the rec, the better.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jemafs/recommendations_about_moviesseries_that_are/"
    },
    {
        "id": "1jec36o",
        "author": "indiewire",
        "title": "Darren Aronofsky Circling to Direct Adaptation of Stephen King’s ‘Cujo’ for Netflix",
        "content": "",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jec36o/darren_aronofsky_circling_to_direct_adaptation_of/"
    },
    {
        "id": "1jdv0b6",
        "author": "gobsmacked247",
        "title": "I am only 20 minutes into Adolescence, episode one, and I already can’t breathe!!!!",
        "content": "This series is already breaking all the rules.  The acting and camera work is insane.  The story is making me want to scream.  I’m on the edge of my seat and I don’t even know why!!!",
        "upvotes": 52,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1jdv0b6/i_am_only_20_minutes_into_adolescence_episode_one/"
    },
    {
        "id": "1jehhv6",
        "author": "Brevvvv17",
        "title": "Anyone else HATE the ending for Prison Cell 211?",
        "content": "Now, for the beginning of the show, I loved it. I was ENGAGED to it, up until one VERY KEY FUCKING decision that I absolutely hated... Killing off Elena. This is just my opinion, but I absolutely hated this decision and I HATE when TV shows do this. Such a NEEDLESS FUCKING DEATH. I get the show is supposed to be emotional and stuff. But it's so dumb. I mean Juan wasn't even TRYING to do ANY of what he was doing. And then the fucking show has the audacity to give an absolute ass ending. \n\nI think I'm just in cope with Elena's death because I hate when TV shows or movies just kill off one of the very main roles just for the protagonist to have \"a redemption ark\" or some fucking shit like that. To me, instead of leading onto some sort of season 2 (which I honestly don't even want or need anymore because what would be the fucking point.) But I mean come on. It's so dumb. Please, please, PLEASE tell me SOME people agree with me on this. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jehhv6/anyone_else_hate_the_ending_for_prison_cell_211/"
    },
    {
        "id": "1jdaoaw",
        "author": "Afraid_Shape_1924",
        "title": "With Love, Meghan proves that no matter what you do people will find reasons to hate.",
        "content": "I would like to preface this by saying I’m no fan of Meghan (Sussex is it?). I did find her escapades during her stint with the royal family and after trying. \nBut the vitriol directed towards her in this show is excessive, inaccurate and unfair. \nThe show itself is charming. For those who say it’s “un-relatable” she never claimed to try to be. She’s doing her, and surprise, surprise she’s rich. Shocker. I don’t know how people are so offended by her choice of cookware, the fact that she has a large garden, time on her hands to harvest berries, and elaborate utensils when that’s literally her life. If you can’t relate have you considered that you’re not the target audience? I think it would be worlds more offensive if she tried showing people how to bargain hunt or use coupons to seem relatable when clearly that’s not her life. \n\nMeghan comes off as warm and genuine and you can tell the people in her life who she invites on genuinely care about her. The show is used to discuss their friendships and their lives and I don’t think it’s scripted to hype her up. The conversation goes both ways and it’s a show about connecting with people. \n\nShe clearly knows her food. It might not be to everyone’s taste but you can tell she derives genuine enjoyment out of food and preparing it. \nFolks mad that her recipes are not groundbreaking, guess what? None are. Even Pinterest regurgitates recipes that have been around for eons. She is just sharing what she likes. \n\nI think in the first episode she mentions that the kitchen she’s in is not hers, but there’s another main kitchen she cooks from for the majority of the show and that’s in her house, no? \n\nAnyway as much as I’ve never really liked the lady, the amount of vitriol she’s receiving for this show is unwarranted and unnecessary. ",
        "upvotes": 560,
        "comments": 568,
        "media": null,
        "permalink": "/r/netflix/comments/1jdaoaw/with_love_meghan_proves_that_no_matter_what_you/"
    },
    {
        "id": "1je8eqf",
        "author": "MysteriousDelay6266",
        "title": "The Glass Dome | Official Trailer | Netflix | April 15",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1je8eqf/the_glass_dome_official_trailer_netflix_april_15/"
    },
    {
        "id": "1jdxwqt",
        "author": "pielcomolamiel",
        "title": "Adolescence",
        "content": "Steven Graham, Ashley Walters, Erin Doherty omg and the greatest performance I have seen from a child in a VERY LONG TIME, Owen Cooper. GIVE THEM THE EMMY RIGHT NOW. GIVE THEM THE GOLDEN GLOBE, THE CRITICS CHOICE, THE SAG AWARD OMFG\n\nEACH EPISODE WAS RECORDED IN ONE SINGLE TAKE. And it is magical like, I am in awe.\n\nIf you like dramas, crime TV shows, and are into Psychology, This is an ABSOLUTE MUST WATCH. It's amazing especially considering how impressionable adolescents truly are, and how the influence of the internet and toxic masculinity continues to do so much damage to our kids, even when we try our best.\n\nIf you have watched already, what did you think? I want to discuss!",
        "upvotes": 14,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1jdxwqt/adolescence/"
    },
    {
        "id": "1jecmay",
        "author": "BradleyUppercrust",
        "title": "\"A new device is using your account\" error",
        "content": "Every time I start up the netflix app, it requires me to sign-in even though the \"remember me\" box is checked. Each time I sign-in, I get an email stating a new device is being used. When I go to \"manage access and devices,\" the list shows almost a hundred devices, but they're all just same device, same computer. It's like each sign-in creates a unique device ID. I tried deleting every device but list repopulates with each sign-in.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jecmay/a_new_device_is_using_your_account_error/"
    },
    {
        "id": "1je5un4",
        "author": "neodiodorus",
        "title": "How 'Adolescence' Filmed Those One Take Episodes",
        "content": "Very good analysis of the technical solutions and directing that made the realism of the show so hard-hitting. It is a rare case where technology is put entirely in the service of the story IMHO, without them losing themselves in gimmicky showing off.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1je5un4/how_adolescence_filmed_those_one_take_episodes/"
    },
    {
        "id": "1je9w6x",
        "author": "Timothymelz",
        "title": "account issues?",
        "content": "Soo I’ve randomly been signed out of my Netflix account,the phone number on the account had changed,my email was unverified and the profiles are in another language. The new profiles that have appeared have a watch history from months ago which doesn’t make sense as It’s only happened to my account recently,I’ve changed my password and signed everyone out but that hasn’t helped it kinda looks like my usual account was deleted and my email is being used for a random account but I’m still being charged for my usual account although it seems to be deleted,can anyone help me out?? I hope this makes sense lol",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1je9w6x/account_issues/"
    },
    {
        "id": "1je9mrx",
        "author": "CarolStott",
        "title": "'Your device isn't part of the Netflix household for this account' fix [UK]",
        "content": "I recently opened my android app to find a message saying 'Your device isn't part of the Netflix household for this account', even though it has worked for the past few years and I am on the same WiFi as the rest of my household. About 2 months ago I used my account in a hotel abroad, but that was via the hotel TV, which I verified via my phone - might that have something to do with it? The hack with turning airplane mode on and off seemed to work, but is there any long term solutions?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1je9mrx/your_device_isnt_part_of_the_netflix_household/"
    },
    {
        "id": "1jdllt3",
        "author": "blameitonbegoniaz",
        "title": "Adolescence",
        "content": "Owen Cooper might be the best actor I’ve ever seen. As a parent, this show has me completely and utterly fucked up. What a wild ride. I am blown away by the acting and can’t believe this is Owen’s first role. ",
        "upvotes": 48,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1jdllt3/adolescence/"
    },
    {
        "id": "1jdhfz5",
        "author": "Plane-Cloud-5837",
        "title": "Owen Cooper reveals which Adolescence moment was improvised",
        "content": "",
        "upvotes": 73,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jdhfz5/owen_cooper_reveals_which_adolescence_moment_was/"
    },
    {
        "id": "1jdcsgr",
        "author": "KnowNow101",
        "title": "Adolescence",
        "content": "I am completely blown away by the new addition to Netflix, Adolescence, the acting, the camera work, directing, the writing, everything was 10/10.  Its not very often i get emotional over a TV show but this is one of the best series I've seen. Now if only Netflix would fix their new horrible interface then i'd be happy.\n\n# ",
        "upvotes": 119,
        "comments": 68,
        "media": null,
        "permalink": "/r/netflix/comments/1jdcsgr/adolescence/"
    }
]