[
    {
        "id": "1l3ga00",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Dan Trachtenberg - Thursday 6/5 at 1:00 PM ET - Director of 'Prey', '10 Cloverfield Lane' and the upcoming 'Predator: Killer of Killers' and 'Predator: Badlands' (starring Elle Fanning). He's also directed episodes of 'The Boys', 'Black Mirror', and 'Stranger Things'.",
        "content": "",
        "upvotes": 35,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1xrf7nhk0z4f1.png?auto=webp&amp;s=58e10a96558e3f2c4078b52d39a0cf4703b6afd4"
        },
        "permalink": "/r/movies/comments/1l3ga00/amaqa_announcement_dan_trachtenberg_thursday_65/"
    },
    {
        "id": "1l352bo",
        "author": "IanAndRoss",
        "title": "Hi /r/movies! We're Ian Spendloff and Ross Wilkinson, the VFX team who brought Mr. Ring-A-Ding to life in Doctor Who Season 2: Lux. Other credits include Avengers: Infinity War, Ms. Marvel, The Marvels, Avatar: The Last Airbender, Black Mirror, and much more. Ask us anything!",
        "content": "Hey r/movies!\n\nWe're Ian Spendloff (Creative Director and Character Designer) and Ross Wilkinson (VFX Supervisor), the Framestore team who brought Mr. Ring-A-Ding to life in Doctor Who Season 2: Lux, from concept and design through to final pixel. Ian is an Emmy winner for his animated sequences on Ms. Marvel, and has also created standout work The Marvels, and the iconic Beats Pills campaign. Ross has worked on Avatar: The Last Airbender (S1) and Avengers: Infinity War. Ask us anything! \n\nWe’ll be back tomorrow (Wednesday 06/04) at 15:00 PM ET to answer your questions. Please feel free to ask away in the meantime.\n\nMore information:\n\nLed by Emmy-winning Creative Director Ian Spendloff and VFX Supervisor Ross Wilkinson, Framestore designed and animated Mr. Ring-A-Ding for Doctor Who Season 2: Lux, supported with visualisation by Framestore Preproduction Services (FPS).\n\nCrafted entirely in the UK, the team took the character from initial concept, design and previs, through to final pixel. Mr. Ring-A-Ding evolves over the episode, starting as a classic 1930s hand-drawn, frame-by-frame animation and transforming into a gruesome and realistic modern 3D character, seamlessly integrated into live-action footage.\n\nBehind-the-scenes \n\n[https://www.youtube.com/watch?v=5xuI5jP-xZQ](https://www.youtube.com/watch?v=5xuI5jP-xZQ)\n\nBios:\n\n**Ian** \\- Ian Spendloff is a highly experienced Director, Art Director and Designer, with a particular focus on character led projects. He has created concepts, narratives, characters &amp; creatures for a host of thrilling projects, spanning advertising, series and immersive entertainment.\n\nIan’s latest major project was a multi-million pound, fully CG theme park dark ride ‘Pearl Quest’, created for China’s Wanda Group. Framestore were lucky enough to be granted full directorial &amp; creative control of the project, which allowed  Ian’s talent in re-imagining a classic Chinese folklore to shine out over eleven large- scale installation screens. The project attracted a VES nomination for “Outstanding Visual Effects in a Special Venue Project”    \n\nIan was instrumental in the making of Tooned, an animated series crafted by Framestore in partnership with Formula 1 giant McLaren. Tooned was highly praised, winning the Gold Clio, Eurobest and Lovie Awards, with the special edition Tooned 50 landing Ian a place in the D&amp;AD book.\n\nIan also drove the iconic ‘Beats by Dre’ campaigns, providing the early concepts for the Pill characters right through to the animation. Ian has a  passion for capturing personality in his work, and a natural ability to add humour, emotion &amp; visual depth to any project, regardless of platform.\n\n**Ross** \\- Ross gained his first experience into visual effects during a modelling internship at Framestore in 2008. After a ten year stint at DNEG, he returned to Framestore in 2022 as a VFX Supervisor.\n\nRoss’s keen eye for detail has seen him work on a variety of projects spanning film, episodic and advertising. From Marvel Studios’ box-office smashing Avengers: Infinity War to season five of Black Mirror, as well as visits to the Wizarding World and The Hunger Games franchises. \n\nMore recently, Ross completed work on BBC documentary series Dinosaurs: The Final Day, with Sir David Attenborough. The documentary follows the final days of non-avian dinosaurs through the Cretaceous–Paleogene extinction event, and was a career highlight for Ross. \n\nAsk us anything! Back at 3 PM ET today to answer your questions.",
        "upvotes": 82,
        "comments": 83,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/08a8t9mmsw4f1.jpeg?auto=webp&amp;s=583ce97a65cd1549ae11f9965aa830fec626217f"
        },
        "permalink": "/r/movies/comments/1l352bo/hi_rmovies_were_ian_spendloff_and_ross_wilkinson/"
    },
    {
        "id": "1l3h220",
        "author": "indiewire",
        "title": "Wes Anderson Says Jodie Foster Has Turned Down Starring in at Least Three of His Films",
        "content": "",
        "upvotes": 4264,
        "comments": 528,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Qg2U1J4vxOoX4Sc85M3e1-eaU7eugxrK0y_pMkeJmR0.jpg?auto=webp&amp;s=c29f2119d523caa38cd57b4de85be4c4e18be416"
        },
        "permalink": "/r/movies/comments/1l3h220/wes_anderson_says_jodie_foster_has_turned_down/"
    },
    {
        "id": "1l3abba",
        "author": "BunyipPouch",
        "title": "First Image from Andy Serkis' George Orwell Adaptation 'Animal Farm' - Starring Seth Rogen, Steve Buscemi, Kieran Culkin, Woody Harrelson, Glenn Close, Andy Serkis, Gaten Matarazzo, Kathleen Turner, Laverne Cox, Jim Parsons, Iman Vellani.",
        "content": "",
        "upvotes": 7753,
        "comments": 1051,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/neaqyoepux4f1.jpeg?auto=webp&amp;s=eb511b23a8c99ee0ff9871d8b83bd0345a50c53c"
        },
        "permalink": "/r/movies/comments/1l3abba/first_image_from_andy_serkis_george_orwell/"
    },
    {
        "id": "1l3m7vg",
        "author": "DinoKYT",
        "title": "Wicked: For Good - Official Trailer",
        "content": "",
        "upvotes": 881,
        "comments": 326,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/p06koRAUYgYQGz4TxdSkWZjZGS-JoSY9CKtUNU803DI.jpg?auto=webp&amp;s=9b15201c759f573bc9b37af69b7854fdf87c8972"
        },
        "permalink": "/r/movies/comments/1l3m7vg/wicked_for_good_official_trailer/"
    },
    {
        "id": "1l35pkg",
        "author": "PM_Peartree",
        "title": "What ever happened to Liv Tyler? Her career seemed on a high after The Lord of the Rings and then, KAPUTT.",
        "content": "The only big thing she seemed to do in movies after the Tolkien trilogy was The Strangers which did well at the box-office but didn't appear to help Tyler's career out all that much. Jersey Girl flopped and The Incredible Hulk was the rare MCU under-performer. \n\nI remember Liv Tyler was like the next big thing: Armaggedon, Stealing Beauty, The Lord of the Rings, the Aerosmith music videos, she was everywhere. Just to give you an idea of how popular she was, her role as Arwen wasn't that big yet she always had her face in the movies' posters which shows how much of a star she was.",
        "upvotes": 5944,
        "comments": 1427,
        "media": null,
        "permalink": "/r/movies/comments/1l35pkg/what_ever_happened_to_liv_tyler_her_career_seemed/"
    },
    {
        "id": "1l36lvt",
        "author": "jimmyhoffasbrother",
        "title": "AMC to show even more ads in its theaters before the actual movie",
        "content": "",
        "upvotes": 3974,
        "comments": 893,
        "media": null,
        "permalink": "/r/movies/comments/1l36lvt/amc_to_show_even_more_ads_in_its_theaters_before/"
    },
    {
        "id": "1l3ch1d",
        "author": "AzureBluet",
        "title": "Master and Commander: The Far Side of the World coming to 4k UHD Blu-ray, genuinely surprised I didn't see this here first.",
        "content": "",
        "upvotes": 1147,
        "comments": 145,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lzWFu8slFFWz0wsa4yaIY_Ht8BVD7nYOJ4pFY4xpxNQ.jpg?auto=webp&amp;s=71ffa64c99814f0b6794f42fbf279d27fa3f862d"
        },
        "permalink": "/r/movies/comments/1l3ch1d/master_and_commander_the_far_side_of_the_world/"
    },
    {
        "id": "1l36ymg",
        "author": "akbanx",
        "title": "Hollywood Has Left LA",
        "content": "Worthwhile read for anyone working in the film industry or curious as to what has been going on with the lack of film production across the United States — and why so few movies and TV shows are able to film on location in Los Angeles. A lot of people are aware of this, but production across the US is at historically low levels, and this article addresses why this is happening. I’ll post a paywall free link in the comments! ",
        "upvotes": 2136,
        "comments": 404,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mJ44CMGGbyPIcxn3Pi68aR9Qjv3jsLRfhxcKCzyueFw.jpg?auto=webp&amp;s=719ed469cebdb38a31ec67a6bee2ac50da0ffb4b"
        },
        "permalink": "/r/movies/comments/1l36ymg/hollywood_has_left_la/"
    },
    {
        "id": "1l3fshe",
        "author": "NoCulture3505",
        "title": "Mikey Madison in Talks to Star in A24’s Out-There Reimagining of Edgar Allan Poe’s ‘Masque of the Red Death’",
        "content": "",
        "upvotes": 695,
        "comments": 59,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mfWMBK6OxSrQuiFKlctMNhqrKz-xs1MsOIHY0BrOeg4.jpg?auto=webp&amp;s=31b45521389ea50ad205f7eb18994fe17c6c9c46"
        },
        "permalink": "/r/movies/comments/1l3fshe/mikey_madison_in_talks_to_star_in_a24s_outthere/"
    },
    {
        "id": "1l37fpl",
        "author": "ChiefLeef22",
        "title": "Everyone In Hollywood Is Already Using AI (And Hiding It) | Lionsgate’s vice-chairman Michael Burns talks about how they’re considering using AI to change existing films into being more kid-friendly or animated",
        "content": "",
        "upvotes": 1878,
        "comments": 504,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nS0mOMXy8Cka3UB_2zBwOYgEuLT02s56h9cYVsttyY8.jpg?auto=webp&amp;s=13597d65e17721356d05d6e885205ad18673fcf2"
        },
        "permalink": "/r/movies/comments/1l37fpl/everyone_in_hollywood_is_already_using_ai_and/"
    },
    {
        "id": "1l3kvng",
        "author": "NoCulture3505",
        "title": "Mike Flanagan's 'Exorcist' Movie Removed From Universal's 2026 Slate, Replaced With Untitled Blumhouse Film",
        "content": "",
        "upvotes": 341,
        "comments": 56,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TFlD1tgxwO1rVWqqXOPn1p90C47MXhvLHiJlTKGLEJY.jpg?auto=webp&amp;s=d009b9bccde9c30e14d4853db94f4fb9ba73796b"
        },
        "permalink": "/r/movies/comments/1l3kvng/mike_flanagans_exorcist_movie_removed_from/"
    },
    {
        "id": "1l39hca",
        "author": "throw0101a",
        "title": "John Candy Documentary 'I Like Me' to Open 2025 Toronto Film Festival",
        "content": "",
        "upvotes": 1411,
        "comments": 77,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Ko5W0AQTXQVoe9o_cnEr3JmYTO-49xVuYOw2mIm7fwE.jpg?auto=webp&amp;s=aefb7d0cf4462935c27ff453b143122a97a37d10"
        },
        "permalink": "/r/movies/comments/1l39hca/john_candy_documentary_i_like_me_to_open_2025/"
    },
    {
        "id": "1l3khhd",
        "author": "MarvelsGrantMan136",
        "title": "Blumhouse Acquiring ‘Saw’ Rights From Twisted Pictures",
        "content": "",
        "upvotes": 242,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Z3DuhIH1dyRPTj2VWhnhbONNFSTbb5ogSRSF132bNdQ.jpg?auto=webp&amp;s=e20339d1e9645d37bf978b1fcb92ed10d1efaec7"
        },
        "permalink": "/r/movies/comments/1l3khhd/blumhouse_acquiring_saw_rights_from_twisted/"
    },
    {
        "id": "1l3hv7k",
        "author": "lawrencedun2002",
        "title": "‘One of Them Days’ Sequel With Keke Palmer and SZA in the Works at TriStar (EXCLUSIVE)",
        "content": "",
        "upvotes": 265,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ua-05tDqJTHLRjBvu1-U3f5mhWB4laJNkpuRSw9PvMs.jpg?auto=webp&amp;s=7f343701467010841d3b5e075eb7b9bf0be80102"
        },
        "permalink": "/r/movies/comments/1l3hv7k/one_of_them_days_sequel_with_keke_palmer_and_sza/"
    },
    {
        "id": "1l2qrut",
        "author": "StevenSanders90210",
        "title": "Warner Bros. Discovery Shareholders Vote Against CEO David Zaslav’s $52 Million Pay Package in a Symbolic Rebuke",
        "content": "",
        "upvotes": 26810,
        "comments": 636,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kYPVbW6t3_p5_6jXp0jNeAz-jU6IAcC3eMGrjENBOJY.jpg?auto=webp&amp;s=6ca8a5bd06ac43abcf15e80364113078b177ef4a"
        },
        "permalink": "/r/movies/comments/1l2qrut/warner_bros_discovery_shareholders_vote_against/"
    },
    {
        "id": "1l3n9ai",
        "author": "koalabat",
        "title": "Who are the two actors you thought were the same person until you realized they were not?",
        "content": "For me - it was Charlie Hunnam and Travis Fimmel.  I would always think that Jax from Sons of Anarchy was the same person as Ragnar from Vikings.  Similarly I would tell my friends that the Warcraft movie has the guy from Green Street Hooligans. I just always thought it was funny mixup but I'm sure there are others that I just never got around to even learning the actors name.",
        "upvotes": 103,
        "comments": 349,
        "media": null,
        "permalink": "/r/movies/comments/1l3n9ai/who_are_the_two_actors_you_thought_were_the_same/"
    },
    {
        "id": "1l37svw",
        "author": "Comic_Book_Reader",
        "title": "New poster for Wicked: For Good.",
        "content": "",
        "upvotes": 720,
        "comments": 235,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5pqi5rmhdx4f1.jpeg?auto=webp&amp;s=146b4a7a75b5c2b9935cb38fb5a28ef6f51f6cee"
        },
        "permalink": "/r/movies/comments/1l37svw/new_poster_for_wicked_for_good/"
    },
    {
        "id": "1l3ocvb",
        "author": "BalaBustaRhymes",
        "title": "The Iron Giant might be my favourite family film.",
        "content": "On my wife’s recommendation, we watched “The Iron Giant” with our six-year-old girl. She remembered enjoying it as a kid, so we gave it a try.\n\nMaybe this is just a recent bias, but this might be the best family film ever made.\n\nI really love how it’s both simple and complex. Sure, you can enjoy it as a “boy and his alien” story, but its commentary on Cold War paranoia is where it really shines . It’s masterful storytelling for sure.\n\nThe last act is just fantastic. It’s been a long time since a movie, animated or not, has made me feel so deeply. The last shot put the biggest smile on my face.\n\nI think this will become a favorite in our house. I’m a little upset it took me so long to see it, but better late than never.",
        "upvotes": 80,
        "comments": 22,
        "media": null,
        "permalink": "/r/movies/comments/1l3ocvb/the_iron_giant_might_be_my_favourite_family_film/"
    },
    {
        "id": "1l3ammf",
        "author": "ggroover97",
        "title": "Lionsgate is Hollywood’s most vulnerable studio",
        "content": "",
        "upvotes": 489,
        "comments": 79,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7lb-Tmq77h2Ac8S5FByC2H0nty6vOQc8Txdwv0k7gls.jpg?auto=webp&amp;s=fd8244a0a7a89371d86033ba5e73efb02e1fc1a8"
        },
        "permalink": "/r/movies/comments/1l3ammf/lionsgate_is_hollywoods_most_vulnerable_studio/"
    },
    {
        "id": "1l3890n",
        "author": "XumaOutIslander",
        "title": "Blade Runner – am I watching the same movie?",
        "content": "I rewatched Blade Runner recently, and I couldn’t get over the feeling that I was watching a very different film. It wasn’t that it was the latest in the umpteen cuts that have been released. And I hadn’t just forgotten the plot over the years. What got me for the first time was I wasn’t so sure Deckard was the good guy. Not even an antihero.\n\n&gt;!This growing unease really took root when Deckard kills Zhora. It brought to mind “Han Shot First”, but in this case there was no ambiguity. Deckard went to the nightclub with the intent of killing this woman and proceeded to do so by shooting her in the back as she tries to flee.!&lt;\n\n&gt;!I’m sitting upright and squinting at the screen trying to process this, when things go from bad to worse. In his apartment, Deckard is making unwanted advances as Rachel gets increasingly upset. She tries to leave, and he won’t let her, and then he proceeds to force himself on her. And I begin to feel insane. This is rape, but it never once occurred to me until that moment.!&lt;\n\n&gt;!The hits keep coming. When Pris is in her death throes it’s not just disturbing, it’s sad. All these replicants wanted was to live. They’re fighting to survive. And this culminates when Roy saves Deckard’s life when he had absolutely every reason to let him fall to his death. Was Roy the hero all along? Trying to save his friends and then proceeding to spare his nemesis’ life?!&lt;\n\nSo after I pull myself together, I do some digging. There are number of discussions out there on the very topic of Deckard’s character, including a piece by Eric Haywood, who had an extremely similar take. Has anyone else had this 180 experience? And if so, why? Is Blade Runner a litmus test for us and the world at large?\n\nI still believe it’s an amazing film. It’s aged certainly, but it has aged well. Matured into something that is still thought provoking and relevant. Just a bit more upsetting than I remembered.",
        "upvotes": 557,
        "comments": 581,
        "media": null,
        "permalink": "/r/movies/comments/1l3890n/blade_runner_am_i_watching_the_same_movie/"
    },
    {
        "id": "1l34zfe",
        "author": "MarvelsGrantMan136",
        "title": "New Character Posters for Danny Boyle's '28 Years Later'",
        "content": "",
        "upvotes": 819,
        "comments": 80,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/q4nl1rp5sw4f1.jpeg?auto=webp&amp;s=a8f80104d9848b2da8b85a90789ce92080667e7e"
        },
        "permalink": "/r/movies/comments/1l34zfe/new_character_posters_for_danny_boyles_28_years/"
    },
    {
        "id": "1l3jlae",
        "author": "joe-tomorrow",
        "title": "“I’m used to it with Yul” line in Once Upon a Time in Hollywood",
        "content": "i’ve been wondering about a line in Once Upon a Time in Hollywood. In the scene where Rick Dalton meets director Sam Wanamaker and they talk about the costume, Rick apologizes for his wet hand when they shook. Sam replies, “Don’t worry about it. I’m used to it with Yul.”\n\nI’m guessing “Yul” means Yul Brynner, but does anyone know if there’s a story or joke behind this? Like, was Yul Brynner known for sweaty or he was in wetty movie or something?\nmay be im totally wrong",
        "upvotes": 97,
        "comments": 20,
        "media": null,
        "permalink": "/r/movies/comments/1l3jlae/im_used_to_it_with_yul_line_in_once_upon_a_time/"
    },
    {
        "id": "1l39amz",
        "author": "Comic_Book_Reader",
        "title": "THE LIFE OF CHUCK - Official Trailer #2 - In Select Theaters 6.6, Everywhere 6.13",
        "content": "&gt;From the hearts and minds of Stephen King and Mike Flanagan comes THE LIFE OF CHUCK, the extraordinary story of an ordinary man. This unforgettable, genre-bending tale celebrates the life of Charles 'Chuck' Krantz as he experiences the wonder of love, the heartbreak of loss, and the multitudes contained in all of us. ",
        "upvotes": 318,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/tdOUE27MuJ-P9Qxicwc7PasQp9g0RfQJmvNrMYTLz8Y.jpg?auto=webp&amp;s=6ba2f7766b0a870d77b7e1d68fa5f16a54b11005"
        },
        "permalink": "/r/movies/comments/1l39amz/the_life_of_chuck_official_trailer_2_in_select/"
    },
    {
        "id": "1l3cepq",
        "author": "MarvelsGrantMan136",
        "title": "Octavia Spencer Returning For Blumhouse’s ‘Ma’ Sequel",
        "content": "",
        "upvotes": 214,
        "comments": 50,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/32Ilo3iEbjwMrVmPjPep0WpfMC8On0162WZcGUMM1JY.jpg?auto=webp&amp;s=9c810e73015d202248e05c78e74bac3668a01128"
        },
        "permalink": "/r/movies/comments/1l3cepq/octavia_spencer_returning_for_blumhouses_ma_sequel/"
    },
    {
        "id": "1l3e9b2",
        "author": "Gobiggs88",
        "title": "What’s the most uncomfortable feeling film ever?",
        "content": "I’m not talking about a film that is so bad it’s good and it’s uncomfortable or “cringe” because of the bad acting and writing. I’m talking about a film that is supposed to feel intentionally uncomfortable. A film that feels like being naked in front of everyone in your family. I really want to watch just an incredibly uncomfortable film, drop all the recommendations! ",
        "upvotes": 165,
        "comments": 743,
        "media": null,
        "permalink": "/r/movies/comments/1l3e9b2/whats_the_most_uncomfortable_feeling_film_ever/"
    },
    {
        "id": "1l3ie7h",
        "author": "MarvelsGrantMan136",
        "title": "Ballerina - Review Thread",
        "content": "**Ballerina - Review Thread**\n\n* [Rotten Tomatoes](https://www.rottentomatoes.com/m/ballerina_2024): 76% (59 Reviews)\n* [Metacritic](https://www.metacritic.com/movie/ballerina/): 62 (32 Reviews)\n\nReviews:\n\n[Hollywood Reporter](https://www.hollywoodreporter.com/movies/movie-reviews/from-the-world-of-john-wick-ballerina-review-ana-de-armas-1236255035/) (70):\n\n&gt;If the dizzying crescendo of intricately choreographed fight scenes is the main attraction in Ballerina, it’s those occasional moments of dry humor that make it a welcome extension of the John Wick universe.\n\n[Deadline](https://deadline.com/2025/06/ballerina-review-ana-de-armas-spinoff-john-wick-1236423083/)\n\n&gt;Part of the majesty behind the Wick franchise is attributable to its legacy. Stahelski knows his cinema and the series’ maximalism is in direct conversation with the silent slapstick stars of yesteryear as much as 1979’s The Warriors. It is, in other words, a unique blend of physical comedy and transcendental action. Ballerina very much continues that tradition, with several fights whose inspirations seem as disparate as Looney Tunes and Police Story. Beyond the usual fare of weaponry, there are inventive uses of restaurant cookery, ice skates as slicing nunchaku, and an entire section that feels as if the town from Beauty and the Beast was filled with highly trained killers.\n\n[Variety](https://variety.com/2025/film/reviews/ballerina-review-ana-de-armas-john-wick-1236416050/) (60):\n\n&gt;Ballerina is a worthy entry in the “John Wick” canon, though I say that as someone who doesn’t think the “John Wick” canon is all that. By the end, Ana de Armas has proved that fighting like a girl and fighting like a guy need not be appreciably different, especially if they’re all fighting like a video game.\n\n\n[The Wrap](https://www.thewrap.com/ana-de-armas-ballerina-john-wick-review/) (73):\n\n&gt;“Ballerina” is a cluttered mess with a boring storyline but the action is often amazing, and there’s a genuine sense of humor to all its weird duels to the death. That’s something that’s been absent from the self-serious “John Wick” movies for far too long — an acknowledgement of their own wackiness.\n\n[Entertainment Weekly](https://ew.com/ballerina-review-ana-de-armas-kills-busloads-people-orgy-violence-11747832) (58)\n\n&gt;Like dining at Burger King, it's undeniably enjoyable, but may leave you with a queasy feeling when it's all over.\n\n[Collider](https://collider.com/ballerina-review-john-wick-ana-de-armas/) (70):\n\n&gt;Ballerina gets off to a shaky start that almost feels like it misunderstands what has made the John Wick series so much fun for so long. Yet once the absurdity of the action takes hold, and Ana de Armas gets to prove herself as a fitting potential heir to this franchise, Ballerina captures the blunt, chaotic action that this series thrives on.\n\n[IGN](https://www.ign.com/articles/john-wick-ballerina-review-ana-de-armas-keanu-reeves) (80):\n\n&gt;It’s a spinoff that knows why the John Wick series has been so successful, and both effectively follows the rules while adding to the ever expanding world. While it takes a good portion of its screentime to find confident footing, when the second half gets moving, the energy is undeniable as Ballerina becomes one funny, bloody and creative fight scene after another. I’m hoping for an encore.\n\n[Rolling Stone](https://www.rollingstone.com/tv-movies/tv-movie-reviews/ballerina-review-john-wick-ana-de-armas-1235345736/) (50):\n\n&gt;At its best, this tale of a young female assassin seeking vengeance and wreaking havoc is one more chance to see expertly choreographed mayhem. At its worst, it plays like a Wick-ipedia sub-entry ambitiously pumped up to main-event status. Let’s just say the balance tilts toward the latter more than you’d like.\n\n\n[TotalFilm](https://www.gamesradar.com/entertainment/action-movies/from-the-world-of-john-wick-ballerina-review/) (70):\n\n&gt;It makes for a tonally consistent movie, though one that fails to deliver on a deeper emotional level... It's a shame, because the action really is brilliant, even if the plot gives you a sense of déjà vu. Whoa.\n\nDirected by Len Wiseman:\n\n&gt;Taking place between the events of John Wick: Chapter 3 – Parabellum and Chapter 4, Eve Macarro, a ballerina-assassin, begins to train in the assassin traditions of the Ruska Roma and sets out to exact revenge for her father's death.\n\nCast:\n\n* Ana de Armas as Eve Macarro\n* Anjelica Huston as the Director\n* Gabriel Byrne as the Chancellor\n* Lance Reddick as Charon\n* Norman Reedus as Daniel Pine\n* Ian McShane as Winston Scott\n* Keanu Reeves as John Wick",
        "upvotes": 89,
        "comments": 70,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/R9Qs2TYjein1N6aDQ5SZkDO1FX9MojGHMDJkds8n9hA.jpg?auto=webp&amp;s=8958aff9b5ff26eab7082b5a0fd119c64155db40"
        },
        "permalink": "/r/movies/comments/1l3ie7h/ballerina_review_thread/"
    },
    {
        "id": "1l3lmzj",
        "author": "ContinuumGuy",
        "title": "‘Attack Of The Killer Tomatoes: Organic Intelligence’: Cult Classic Reborn With David Koechner, Eric Roberts, Dan Bakkedahl, John Astin &amp; More",
        "content": "",
        "upvotes": 30,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NDYm7_cj7ylw2rBrIkDOu_ZYT1Iw9nVAhqgG0vlwBAk.jpg?auto=webp&amp;s=fb1d77ef9d680dc3477280b3f94d6741a664b1c5"
        },
        "permalink": "/r/movies/comments/1l3lmzj/attack_of_the_killer_tomatoes_organic/"
    },
    {
        "id": "1l2y9dj",
        "author": "fir_trader",
        "title": "Inception, was it all a dream? Don't look at the top, look at the children",
        "content": "I was randomly thinking about Inception today and am 99% confident the entire movie is a dream. While different actors, the clothing worn by his children in both the flashback and the end of the movie are nearly identical in addition to their location in the backyard. The girl is wearing a pink dress in the flashback and subsequently is wearing a pink dress over a white t-shirt. Similarly the boy is wearing a plaid shirt with shorts in both scenes. After not seeing his kids for \\~2 years, the chance that his kids are wearing nearly the same outfit and are in the same location in the backyard is nearly impossible.\n\nWith most directors I think you can let this slide, but Chris Nolan is particular about every detail of his movies. This was an intentional choice that is unlikely to happen in reality.\n\nPs. I think the totem was always a red herring and constructed to give the dreamer the outcome they want.\n\nEdit: The ring theory seems reasonable.  \n  \nNot to throw a grenade back into the discussion, but [this interview](https://youtu.be/3C-AzyS2lWQ?si=jrCCJPHFbChP1tnm&amp;t=83) (time stamp 1:23) with Nolan says he has an idea of how each movie plays out even if the final cut is intended to be ambiguous to the audience. The idea that Cobb doesn't care if it falls or not, isn't Nolan's idea, it's his wife's (Emma Thomas). All I'm saying is if I came home to nearly the exact same scene after two years away from my family, I'm pretty sure I'd be dreaming... but maybe in Inception its reality and the coincidence is there to facilitate the ambiguity.",
        "upvotes": 858,
        "comments": 368,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/UZPYrLd2t3yhQuOwJkE6rWgpyZKcdur9x25UMYC6N9k.jpg?auto=webp&amp;s=8268fd9dce8a87d0aab35106aacbe1423d411157"
        },
        "permalink": "/r/movies/comments/1l2y9dj/inception_was_it_all_a_dream_dont_look_at_the_top/"
    },
    {
        "id": "1l3qxoj",
        "author": "ChibiHedorah",
        "title": "Funny off-screen moments",
        "content": "What are some funny moments that, based events in a movie, we can deduce that they must happen, but aren't shown in the movie? For example, based on the scene in Star Wars (ep. 4) where Obi-Wan mind-tricks the stormtrooper at Mos Eisley, we can deduce that at some point off screen, that stormtrooper stops and thinks to himself- \"shitt... those probably WERE the droids we were looking for... why did I let that guy through?\"\nI'm looking for more of these kind of moments because it's really funny to me.",
        "upvotes": 8,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1l3qxoj/funny_offscreen_moments/"
    },
    {
        "id": "1l3p9z6",
        "author": "Soggy-Discipline5656",
        "title": "France is producing its first adaptation of the book The Phantom of the Opera by Gaston Leroux, with Deva Cassel, daughter of Vincent Cassel and Monica Bellucci",
        "content": "Deva Cassel (Netflix’s The Leopard), Julien De Saint Jean (The Count Of Monte Cristo) and Romain Duris (Heartbreaker) are set to co-star in a contemporary, French-language version of Gaston Leroux’s classic Paris-set novel The Phantom of the Opera, aimed at a young adult audience and taking its cue from the Twilight franchise.  \n\n\n\nSND, the film production, distribution and sales arm of French commercial free-to-air broadcaster M6, is co-producing and selling the ambitious project and will launch pre-sales at the EFM with a sizzle.\n\n\n\n\n\nFilming will begin this summer at the world famous Palais Garnier opera house, or Opéra Garnier, in Paris, against the backdrop of its theatre, backstage areas, domed roof and subterranean vaulted cistern, sometimes referred to as its lake.  \n\n\n\nThe production has also gathered a high-profile crew topped by cinematographer Nicolas Bolduc (The Count of Monte Cristo, The Three Musketeers 1 &amp; 2), production designer Clovis Weill (Marie Antoinette, Walking Dead: Daryl Dixon, A Breath Away), composer Dany Levy (I Lost My Body, Raw) and choreographer Marion Motin (The Substance, The last Call, Christine and the Queens, Stromae) \n\n\n\nLeroux’s original 1910 novel tells the story of a beautiful young soprano who becomes the obsession of a disfigured man living in the watery subterranean labyrinth under the Opéra Garnier but resists his advances.\n\n\n\nIn Castagnetti’s contemporary adaptation, Cassel will star as 18 year old Anastasia, who is newly-arrived in Paris and full of hopes and dreams as she takes up a position as a ballet dancer at the opera house. \n\n\n\nAmbitious artistic director, James Figueras (Duris), is reviving Orpheus, the mythic opera by Ernest Dupré, inspired by the Greek mythological figure of Orpheus and his journey into the underworld in search of his dead wife Euridice. \n\n\n\nOne night, Anastasia meets the opera house’s mythical phantom (Saint Jean) and they embark on an impossible love story. Meanwhile the prima ballerina, meant for the role of Euridice, barely escapes death and Anastasia lands the star role.  \n\n\n\n“It’s a modern re-reading of Gaston Leroux’s classic novel, which has inspired movies, series, graphic novels and musicals but amazingly has never been adapted as a French-language feature film,” said SND Director of International Sales and Distribution Ramy Nahas. \n\n\n\n“The film will mix themes and genres to create an ambitious romantic film set against the backdrop of Paris, with fantasy, period and thriller elements,” he continued.  \n\n\n\nNahas added that the $20M production’s tone and genre-mixing style takes inspiration from the Twilight movies, which SND released theatrically in France with success.  \n\nEmerging French-Italian actress and model Cassel made her big screen debut in Italian drama The Beautiful Summer and is soon to be seen in Netflix’s upcoming big-budget The Leopard reboot. \n\nSaint Jean recently appeared alongside Pierre Niney in French-language swashbuckler hit The Count Of Monte Cristo, in the role of Edmond Dantès’ protégé Andréa, who tragically seeks vengeance on the father who tried to kill him as child.   \n\nEstablished and popular actor Duris was seen most recently in A Missing Part, The Three Musketeers: Milady and The Animal Kingdom.  \n\nThey will be joined on set by members of the Opéra Garnier ballet company including its principal dancer Dorothée Gilbert, who will play the prima donna dancer in the film, Victoire Bellanger. \n\nSND is co-producing with Paris and L.A.-based production company FullDawa (Riddle of Fire, Uncorked), which has previously produced fiction films and documentaries set against the backdrop of the Opéra Garnier such as the 2020 Arte non-fiction work Building The Paris Opera.\n\n  \n[https://deadline.com/2025/02/deva-cassel-julien-de-saint-jean-romain-duris-phantom-of-the-opera-snd-efm-1236280339/](https://deadline.com/2025/02/deva-cassel-julien-de-saint-jean-romain-duris-phantom-of-the-opera-snd-efm-1236280339/)\n\n  \nI highly recommend watching the series The Leopard with Deva Cassel playing Angelica Sedara. She performs exceptionally well in this role in the new adaptation of Lampedusa's book.\n\n",
        "upvotes": 12,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ju-xTmJeUJlpWYTJXNpUKGynmJCeyxlbt_zlZijXAWE.jpg?auto=webp&amp;s=fea492d41e1020304b7717332b690943f4d21bbc"
        },
        "permalink": "/r/movies/comments/1l3p9z6/france_is_producing_its_first_adaptation_of_the/"
    },
    {
        "id": "1l2bf2c",
        "author": "KevinSmithAMA",
        "title": "Hey reddit, I'm Kevin Smith. I got the rights back to Dogma and I'm putting it out in theaters for a limited time for its 25th Anniversary starting Thursday June 5th. Ask me anything!",
        "content": "Hey reddit, I'm Kevin Smith. I got the rights back to Dogma and I'm putting it out in theaters for a limited time for its 25th Anniversary starting Thursday June 5th. Ask me anything!\n\nGive me your questions!!!\n\nDogma 25th anniversary trailer:\n\n[https://www.youtube.com/watch?v=rwSRribTgdA&amp;ab\\_channel=KevinSmith](https://www.youtube.com/watch?v=rwSRribTgdA&amp;ab_channel=KevinSmith)\n\nSynopsis:\n\nTwo fallen angels who were ejected from paradise find themselves banned in Wisconsin. They are now headed for New Jersey where they find a loophole that can get them back into heaven. The only catch is that it will destroy humanity. A group bands together to stop them.\n\nCast:\n\n* Ben Affleck\n* Matt Damon\n* Linda Fiorentino\n* Salma Hayek\n* Jason Lee\n* Jason Mewes\n* Alan Rickman\n* Chris Rock\n* Kevin Smith\n* George Carlin\n* Bud Cort\n* Alanis Morissette\n* Janeane Garfolo\n\nBack out in theaters starting June 5th.\n\nAsk me anything reddit. Back at 5 PM ET to chat with you all.\n\nOther/Bio:\n\nKevin Smith has been saying silly cinematic shit since 1994’s Clerks. He almost dropped dead of a massive heart attack in 2018 but then lived to make more useless media that only he loves. He also convinced someone to marry him and make him a Dad. Catch Dogma in theaters (again) starting June 5th.\n\nKevin Smith has directed Clerks I, II, III, Mallrats, Chasing Amy, Jay and Silent Bob Strike Back, Jersey Girl, Zack and Miri Make a Porno, Cop Out, Red State, Tusk, Yoga Hosers, Jay and Silent Bob Reboot, The 4:30 Movie.  \n\n",
        "upvotes": 43724,
        "comments": 4122,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/tnp4rodpnp4f1.png?auto=webp&amp;s=75af3e3dfecc7684022d98c22cdca16af4fdc94d"
        },
        "permalink": "/r/movies/comments/1l2bf2c/hey_reddit_im_kevin_smith_i_got_the_rights_back/"
    }
]