[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 42,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 12,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1q9n7yj",
        "author": "hasanahmad",
        "title": "Netflix is now the Walmart/Amazon of entertainment media",
        "content": "You can find a lot . You can find sporadic quality , a lot of trash but America is all over it everyday. It’s way too big to fail at this point after after the competitors came in and all have flatlined to be barely there or rarely competing ",
        "upvotes": 989,
        "comments": 134,
        "media": null,
        "permalink": "/r/netflix/comments/1q9n7yj/netflix_is_now_the_walmartamazon_of_entertainment/"
    },
    {
        "id": "1q9thpg",
        "author": "abriellecaton",
        "title": "His &amp; Hers",
        "content": "I had to write about this somewhere. This show is AMAZING!  If you love detective/crime WATCH THIS SHOW!  Plot twist and a good storyline with good actors and characters.  AMAZING. ",
        "upvotes": 40,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1q9thpg/his_hers/"
    },
    {
        "id": "1q9mjlu",
        "author": "Famous-Donut-2394",
        "title": "What was the WORST Ending to A Netflix Original Series??",
        "content": "Just throwing it out there, since I have seen people complain about many Netflix shows ending. Cancelled series do NOT count (ex. Lockwood &amp; Co.) Neither do unfinished series (Wednesday, OBX etc.)",
        "upvotes": 96,
        "comments": 213,
        "media": null,
        "permalink": "/r/netflix/comments/1q9mjlu/what_was_the_worst_ending_to_a_netflix_original/"
    },
    {
        "id": "1q9o2l9",
        "author": "NoEstablishment205",
        "title": "Homeland",
        "content": "How on earth am I just now watching Homeland!?! I have been hooked. I love Claire Danes anyways but wow. Great acting. Great plot. They don’t make shows like this anymore. ",
        "upvotes": 58,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1q9o2l9/homeland/"
    },
    {
        "id": "1q8z5px",
        "author": "Deadpool-fan-466",
        "title": "What was the point of casting Linda Hamilton in Stranger things S05?",
        "content": "When I first found out about it, I thought it's gonna be interesting. Either she's gonna be an important character, or Netflix wants star power (as usual) to hype up the final season.\n\nThen it became as bland as it could be: She's the new \"Papa\", trying to restore \"the program\". She even does exactly what was shown in the trailer, shooting at Eleven &amp; co.\n\nI know that being Sarah Connor in those 2 terminator movies is the only career highlight of her, but being in Stranger things doesn't change much either (for her &amp; the show)",
        "upvotes": 1078,
        "comments": 199,
        "media": null,
        "permalink": "/r/netflix/comments/1q8z5px/what_was_the_point_of_casting_linda_hamilton_in/"
    },
    {
        "id": "1q98hpp",
        "author": "OkCartographer4028",
        "title": "Just finished watching “Homeland”, now I don’t know what do with myself",
        "content": "I just finished watching Homeland and it’s honestly the best show I’ve seen in years. I looked forward to returning home everyday to continue watching it, I even stayed home at weekends to chill and enjoy the show. Captivating 8 seasons. Now it’s ended, I’m so sad. I can’t stop thinking about it, now I don’t know what to watch. \n\nCan someone recommend similar shows? Something as captivating ",
        "upvotes": 147,
        "comments": 127,
        "media": null,
        "permalink": "/r/netflix/comments/1q98hpp/just_finished_watching_homeland_now_i_dont_know/"
    },
    {
        "id": "1qa1x86",
        "author": "Hungry-Curve9612",
        "title": "I like asian series - Can you recommend a good Japanese or Korean?",
        "content": "Hi people, \n\nI like series like squit game or alice in borderland. Can you tell me another good asian series? Thanks a lot.\n\nIt should be a bit with action but psych is a lot of better....",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qa1x86/i_like_asian_series_can_you_recommend_a_good/"
    },
    {
        "id": "1q935t3",
        "author": "intelerks",
        "title": "Netflix pushes 'Wednesday' to 2027 as 'Bridgerton', 'One Piece', and 'The Witcher' line up for 2026",
        "content": "",
        "upvotes": 233,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1q935t3/netflix_pushes_wednesday_to_2027_as_bridgerton/"
    },
    {
        "id": "1q9v2mp",
        "author": "Blue-Sea2255",
        "title": "His &amp; Her (2026) Spoilers ahead.",
        "content": "It's not a review. It's a rant. Because I'm disappointed. \n\nI watched it mainly because it’s a limited series and because Jon Bernthal is in it. Even then, it was hard to push myself to finish it in one go. The ending was painfully bad, and the writing felt lazy.\n\nIt feels like the creators tried too hard to misdirect the audience by scattering half baked subplots everywhere, without committing to any of them properly.\n\nJack Harper is an especially poorly written detective. He’s introduced as a caring and sharp investigator, but from the very first crime scene he behaves like a clueless amateur. He’s a detective, yet when he clearly senses he’s in trouble, he doesn’t act like one at all.\n\nThere were several clues, like the phone, that ultimately went nowhere except for a confrontation with Duffie, which itself was a mess. A detective says “you’re under arrest,” the suspect runs away, and he just stands there doing nothing. That was the moment I completely lost interest. (I don't want to even get into the swab thing and ring lost scene)\n\nFrom then on, nothing felt even remotely believable.\nZoe tries to warn Jack, and he doesn’t even bother to consider what she’s saying. It’s unbelievable that, after two people close to his sister died, he still fails to see a pattern or ask her for any unknown stories.\n\nAny normal person would have connected the dots and at least listened to her. The Catherine to Lexy transformation was a stretch, but that can be excused for the sake of the story.\n\nFrom what I understood, Anna went to the cemetery in the first scene, saw them having sex, went back to Atlanta, decided to start over, and when she couldn’t get the job back, she used a hometown murder she saw on social media for field reporting so that she can go back to her town formally.\n\nEven then, the timeline makes no sense. Her disappearance was only for a year. What makes even less sense is why she married the brother of a former friend who watched and enjoyed while she was SA'd. She never tells him the truth and continues to live in the same town. None of this adds up.\n\nThe worst and most foolish twist was the mother’s revenge plot. It might have worked if it had been slowly spread into the story. Instead, it’s dumped on the audience in the final minutes through a letter voiceover, making it feel rushed and absurd.\n\nAnd Zoe’s murder, the complete absence of her daughter’s reaction or even her presence, and the fact that he does not bother to check on the daughter when he finds Zoe in the bathtub or even after the final headshot. and then in the final scene the daughter leaves flowers only for the infant. None of it makes any sense.\n\n",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1q9v2mp/his_her_2026_spoilers_ahead/"
    },
    {
        "id": "1q9yi25",
        "author": "Only-Author-7067",
        "title": "Best Netflix Shows of All Time",
        "content": "What’s the best Netflix show of all time that you’ve watched. \n\nI loved the crown, the bodyguard, the queen’s gambit, the night agent, one day and stranger things.  ",
        "upvotes": 3,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1q9yi25/best_netflix_shows_of_all_time/"
    },
    {
        "id": "1qa3dh2",
        "author": "Rednek233",
        "title": "When did Netflix get access to Cartoon Network shows and Sony movies??",
        "content": "I just hopped onto Netflix to put on The Smurfs for my kiddos and I saw that they have Teen Titans Go and Spider-Man: Into the Spiderverse now. I know Netflix recently made a deal with Nickelodeon, but when did they do deals with CN and Sony??",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qa3dh2/when_did_netflix_get_access_to_cartoon_network/"
    },
    {
        "id": "1q9r81c",
        "author": "Proud_Commercial5210",
        "title": "any good psychological show recommendations?",
        "content": "i tend to find myself picky about finding a new show or what to watch. i prefer shows over movies cause i like something that’ll take a while &amp; i can really get in to. im gonna add a list of shows i’ve already watched &amp; really enjoyed in hopes that someone can recommend something similar or just as enjoyable lol. \n\n\\- all of the Monsters series (jeffery dahmer, ed grin, &amp; the menendez brothers) i really enjoyed these\n\n\\- Untamed \n\n\\- Stranger Things\n\n\\- Haunting of Hill House one of my all time faves this show stuck with me for a long while after watching it (esp the vent neck lady) 😭\n\n\\- The Fall of the House of Usher also a really good watch the stuck with me i really liked how each episode was a different character in the spotlight \n\n\\- Sirens \n\n\\- Wayward loved each of the characters &amp; just the overall vibe &amp; themes of the show\n\n\\- Yellowjackets saved my favorite for last this show REALLY stuck with me &amp; i’ve been trying to find something just as thrilling &amp; satisfying to watch while we all long await the newest 4th season. \n\ni’ll take any recommendations preferably shows, not movies. but if you really think something is worth watching please lmk im not that hard to convince! lol thanks to whoever has anything to suggest!!",
        "upvotes": 5,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1q9r81c/any_good_psychological_show_recommendations/"
    },
    {
        "id": "1q9szc9",
        "author": "d_o_mino",
        "title": "Level out the sound please",
        "content": "Damn, NF, music and explosions are way too loud in comparison to dialogue. Is there a setting that I don’t know about? \n\nIt’s annoying to have to turn up volume so I can hear soft spoken words but then get my eardrums destroyed when music begins to play. ",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1q9szc9/level_out_the_sound_please/"
    },
    {
        "id": "1q9r60z",
        "author": "cl4udia_kincaiid",
        "title": "Run Away - terrible acting?",
        "content": "I just started Run Away and I’m so confused as to why the acting is so bad. I know some of these actors can act, I’ve seen them in other things. But in this they’re all wooden as hell, like they’re reading a script written by an amateur or from a teleprompter. My only theory is this is an example of Netflix shows beginning to write for “second screen viewing” knowing that a lot of people watch shows when on their phone so they have the characters say unnecessary dialogue to explain what’s going on. I’ve noticed a lot of that in the first episode alone. But the actors also seem to be getting zero direction and not knowing what to bring to their roles. It’s very weird.  ",
        "upvotes": 4,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1q9r60z/run_away_terrible_acting/"
    },
    {
        "id": "1q9yljb",
        "author": "PutridMasterpiece138",
        "title": "Why is quality so bad on pc?",
        "content": "I watch netflix on pc since on tablet the screen is smaller and I don't have or want a TV. \nMy internet speed is very good and my PC has good hardware. \n\nAnd yet netflix fails to deliver. Some movies like Spirit or spiderverse don't even show in 720p. It's much worse and basically unwatchable. Other stuff is at least 720p but that's not a quality I'd like to watch. My paying tier has HD so I want to watch it in HD...I don't know why netflix doesn't have a setting to force HD but my internet speed should be more than enough for HD. I've tried multiple browsers and the app but no use. What am I even paying for?\n\nI've tried other... services  and I can watch 4k there with no problem so it's not because of my computer. I guess it's time to cancel my netflix because rn I'm really paying for bad quality and a bunch of trouble shooting that breaks my brain. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q9yljb/why_is_quality_so_bad_on_pc/"
    },
    {
        "id": "1q9m25p",
        "author": "Spiritual-Honey-4587",
        "title": "His and Hers episode 4 ending",
        "content": "I know I’m behind, but I just finished episode 4, and the ending really bothered me. They just had the most cathartic moment- opening up about the mutual trauma around losing Charlotte. The sex scene in the back of the van feels unnatural. Maybe I’m from a different world, but how do you move from that powerful emotional moment to having sex in such a structured parallel to what happened with Rachel— another traumatic event they both shared. Am I the only one who finds that unrealistic?? ",
        "upvotes": 6,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1q9m25p/his_and_hers_episode_4_ending/"
    },
    {
        "id": "1q9vqyp",
        "author": "zargreet",
        "title": "Automatic trailers in Netflix?",
        "content": "I now get automatic trailers show up every time I check out a show I’m interested in. When exiting this, my search goes back to the beginning (home). It’s really annoying because I now have to find where I was when I am looking for something to watch. How do I exit, or turn off trailers? I hope I am explaining this ok.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q9vqyp/automatic_trailers_in_netflix/"
    },
    {
        "id": "1q9rmlo",
        "author": "FlyLikeDove",
        "title": "Has anyone seen \"Nobody's Home\"?",
        "content": "I'm talking about the 2024 movie where two couples end up in a home that neither of them owns. It's a pretty mid movie to be honest, but I'm really confused about the ending of it. Looking for some clarity if anyone has seen it?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q9rmlo/has_anyone_seen_nobodys_home/"
    },
    {
        "id": "1q97n3a",
        "author": "Strange_Light5219",
        "title": "Why Netflix?",
        "content": "Just finished watching Lockwood &amp; co and found out the show's not being renewed for season 2. \n\nI can definitely say it's one of the hidden gems and a nice thriller. It should have gotten more attention than it received as it is also has \"mostly liked\" tag.",
        "upvotes": 24,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1q97n3a/why_netflix/"
    },
    {
        "id": "1q9qagu",
        "author": "Key-Contribution985",
        "title": "I need help understanding Ballad of a Small Player",
        "content": "So, Dao-ming didn't help him during the heart attack—I got that part. But then, how does he suddenly end up on a boat alone? Also, where did he get all that money? I feel like I'm missing a huge piece of the puzzle and it's driving me crazy. Help me out!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q9qagu/i_need_help_understanding_ballad_of_a_small_player/"
    },
    {
        "id": "1q9olpp",
        "author": "sugar_peace",
        "title": "My korean boyfriend",
        "content": "Interesting show observing the cross cultural differences and i legit liked the 2 react episodes at the end - that was most entertaining. It was definitely the highlight of the show for me! I'm asian not sure if i could take the comments in if i heard it in person but I loved the reactions, so real, spontaneous and funny 😀 ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q9olpp/my_korean_boyfriend/"
    },
    {
        "id": "1q8c7eq",
        "author": "GiveMeSomeSunshine3",
        "title": "‘Black Mirror’ Renewed For Season 8 At Netflix",
        "content": "",
        "upvotes": 1309,
        "comments": 92,
        "media": null,
        "permalink": "/r/netflix/comments/1q8c7eq/black_mirror_renewed_for_season_8_at_netflix/"
    },
    {
        "id": "1q9we77",
        "author": "R4V3NMustang",
        "title": "Glitches trailers",
        "content": "Anyone else have glitches trailers? Searching says isles the sound settings but we don't have those options in this country on our menu so thats BS.\nIt's not our router. Resetting doesn't change anything. It's only Netflix that's glitches.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q9we77/glitches_trailers/"
    },
    {
        "id": "1q9vime",
        "author": "smakson11",
        "title": "A little spoiler nitpick I",
        "content": "I am rewatching Stranger Things from season 1. When I pause I see a character that isn’t introduced yet. \n\nWhen I see an ad I see ads with characters that haven’t been introduced yet. With characters I know doing things I never would have guessed they’d do. \n\nYou would think out of courtesy they could figure out how to not show stranger things season 5 things while watching season 1. \n\nThere are plenty of people just starting to watch now. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q9vime/a_little_spoiler_nitpick_i/"
    },
    {
        "id": "1q8yyqs",
        "author": "Unable-Youth",
        "title": "His &amp; Hers Had Potential",
        "content": "Spoiler Alert below.\n\nThis show had a lot of potential but was problematic and had loose ends:\n\n1. What’s the story with Anna’s tooth at the beginning and end? Does not serve a purpose.\n2. Why did Zoe hate Anna, if Anna was the rape victim? Zoe gives Anna the finger in one episode, and then she tries to warn Jack towards the end that “Anna isn’t who you think she is…”\n3. No explanation of why they were all friends then stopped being friends when they all seemed to watch Anna’s rape\n4. Why did Zoe stop being friends with Helen and Rachel if she was complicit in the rape?\n5. Why was Catherine trying to get back at Anna when it was Anna that was raped? What was with all the “murder” supplies she got Richard to buy\n6. Jack said Alice showed signs of dementia during the year Anna left. Was she premeditating that far in advance?\n\nFinally, how am I supposed to believe an old woman is capable of pulling off gruesome murders that require lots of physical strength as noted in one episode… I mean 40 stab wounds? Also, how did she get the friendship bracelets? Did Anna have them in her box I.e do we assume they all gave them back to her?\n\nWhat was the side story about the blackmail In Rachel’s phone when it came to their weird shit with Duffie?\n\nLazy ending and the show had more potential.",
        "upvotes": 37,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1q8yyqs/his_hers_had_potential/"
    },
    {
        "id": "1q9tr3r",
        "author": "No_Flatworm7586",
        "title": "did netflix edit out eyecatchers?",
        "content": "im rewatching demon slayer but this time im rewatching it on netflix and this just crossed my mind because i remember there being eyecatchers and a sword sound. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q9tr3r/did_netflix_edit_out_eyecatchers/"
    },
    {
        "id": "1q9o0sp",
        "author": "Abject-Pressure-2529",
        "title": "REQUEST: Binge worthy?",
        "content": "Binge Worthy\n\nRequest: Recently added Netflix at home. I looking for your top five binge worthy programs true crime/ serial killer. \nI've watched all the programs on ID Paramount and Peacock.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1q9o0sp/request_binge_worthy/"
    },
    {
        "id": "1q9cq0d",
        "author": "AggravatingCamp9315",
        "title": "Good night &amp; good luck",
        "content": "It took me a moment to get into this but it ended up being a really powerful show. I particularly liked the tie from mccarthy to current events ( which has not been lost on many of us for some time now.) Although the lighting was a bit dark for me at times, I really ended up with goosebumps at the end. History lesson and current event in one. \n\nI wish we had more filmed theatre on Netflix. ",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q9cq0d/good_night_good_luck/"
    }
]