[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 10,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 36,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1ksssyk",
        "author": "theoriginalshabang1",
        "title": "Liver King. Wtf did I just watch? Lots of spoilers because shame on Netflix for giving this guy more of a voice",
        "content": "It’s new &amp; I had never heard of this guy so I watched it last night. Why is Netflix is giving this guy more notoriety and why do we elevate ‘influencers’ like this??\n\nToxic &amp; cliche grifter promoting an ‘All Meat Primal’ and ‘natural’ lifestyle gets caught using steroids… a surprise to no one with eyeballs.  He walks around in no shirt and shorts all the time. Seriously - in public, at conventions, multiple clips of podcasts interviews, a Piers Morgan interview… there is literally 1 scene in the entire thing where he is wearing a shirt. It’s cringy af to watch.\n\nHe makes a ton of money off of selling supplements and making videos that this diet is healthy and his physique is all due to meat &amp; supplements - so Buy Now! It’s terrible advice, in no way healthy and can seriously harm people! If he possesses any qualifications for giving diet advice, or knowledge to create a supplement line (other than working at GNC when he was a teen), they sure don’t mention it.\n\nHe goes from ‘f you! It’s none of your business if I take steroids’ to ‘I’ll just lie again’ to an unapologetic apology to his fans saying he has self esteem issues because his dad died when he was a kid and steroids help. 🙄 Then admitting that he has been stealing &amp; grifting since he was 16 - even printing counterfeit money at one point! \nDude…. if that is true, prolly shouldn’t admit that on a Netflix special…\n\nHe and his “queen” kill a bull and make their kids eat its testicles while per-formatively thanking his “bull brother” and Earth for his gifts like he’s a character in Avatar. Yup, raw bull testicles just out in the middle of a field, still warm.  I mean, I’m not into hunting - not that you can call this hunting because it was a lone bull standing in a field that someone else shot for him  - but I get that some people are. You should not be eating raw animal organs! EVER!!! And you certainly should not be feeding it to your kids! I guess if this guy brings on a new pandemic or the zombie apocalypse, he’ll just bicep curl his way out of it.\n\nAfter taking mushrooms, a shaman shows up (?) for a sweat lodge and he has to think of his next move while of the mean things Internet people said to him are dubbed over the scene… Not his responsibility or fraud or lies or how his business partners were also screwed over with his fraud. \n\nBut, don’t worry because he realizes he should be eating fruit too (which he thanks before eating) and his new business plan is to open 302 resorts where people can pay to live like him and his family. His 9 Pillar Belief System has become 10 Pillars because he’s not giving up steroids, but he’s definitely done grifting, right guys?",
        "upvotes": 131,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1ksssyk/liver_king_wtf_did_i_just_watch_lots_of_spoilers/"
    },
    {
        "id": "1kspv45",
        "author": "New-Talk3039",
        "title": "Just started Breaking Bad — how is it overall? (No spoilers please)",
        "content": "Hey everyone,\n\nI just started watching Breaking Bad for the first time and I'm a couple of episodes in. I’ve heard a ton of praise about it over the years, and finally decided to see what the hype is about. So far, it’s definitely got me intrigued.\n\nFor those who’ve watched the whole thing — how did you find the overall experience? Does it live up to the reputation it has? I’d love to hear your thoughts (but please, no spoilers — I’m going in fresh!).\n\nThanks!",
        "upvotes": 166,
        "comments": 487,
        "media": null,
        "permalink": "/r/netflix/comments/1kspv45/just_started_breaking_bad_how_is_it_overall_no/"
    },
    {
        "id": "1ksndr7",
        "author": "Milk_Man9696",
        "title": "Is The Haunting of Hill House worth watching? (NO SPOILERS)",
        "content": "I’ve been hearing a lot about *The Haunting of Hill House* and wanted to ask if it’s worth the time. I enjoy horror, but not just jump scares. Please no spoilers in the replies—thanks!",
        "upvotes": 42,
        "comments": 68,
        "media": null,
        "permalink": "/r/netflix/comments/1ksndr7/is_the_haunting_of_hill_house_worth_watching_no/"
    },
    {
        "id": "1ksv5gh",
        "author": "ToonAdventure",
        "title": "KPop Demon Hunters | Official Trailer | Netflix",
        "content": "",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ksv5gh/kpop_demon_hunters_official_trailer_netflix/"
    },
    {
        "id": "1kstzs5",
        "author": "BunyipPouch",
        "title": "Jonathan Entwistle, the creator and director of Netflix series 'The End of the F***ing World' and 'I Am Not Okay With This' (along with Cobra Kai follow-up movie 'Karate Kid: Legends') is doing an AMA/Q&amp;A in /r/movies today. It's live now, and he'll be back for answers at 5 PM ET.",
        "content": "I organized an AMA/Q&amp;A with with Jonathan Entwistle. He is the director of the upcoming **Karate Kid: Legends**. He's also the creator and director of the Netflix series **The End of the F***** **ing World** and **I Am Not Okay With This**. It's just gone live in /r/movies. Please go to the /r/movies post to put questions/comments for him, I recommend as soon as possible, that's where he'll be seeing comments and answering questions:\n\nhttps://www.reddit.com/r/movies/comments/1ksr5yx/hey_rmovies_im_jonathan_entwistle_director_of_the/\n\nIt's live now, and he'll be back at 5 PM ET later today to answer things.\n\nAny question/comment is much appreciated.\n\nThank you :)\n\nHis verification photo:\n\nhttps://i.imgur.com/KGjSP9C.jpeg",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kstzs5/jonathan_entwistle_the_creator_and_director_of/"
    },
    {
        "id": "1ksnr04",
        "author": "liamkkkk",
        "title": "Love Death + Robots…?",
        "content": "Just finished watching the new season of LDR, and although the series seems to be made to make the viewer uncomfortable, one episode stands out to me. “The Screaming of the Tyrannosaur” features a death race partaken in by poorer people to appease rich upperclassmen, who drink the blood of dinosaurs to stay young. I might be overthinking things but I found it weird that Mr Beast of all people cameos as the host and commentator of this gladiatorial episode. Thoughts? ",
        "upvotes": 5,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1ksnr04/love_death_robots/"
    },
    {
        "id": "1ksbkz2",
        "author": "HP_sauce78",
        "title": "Watching worst roommate ever",
        "content": "I am so angry at the incompetence of police officers and the scary laws America has. As a British person, I’ve never heard a story where someone who moves into another persons home has more rights than they do???\n\nIt’s crazy what the hell. I’m talking specifically about ep3 (although I’m angry at all of them) and I hate how these victims have lost their homes due to stupid laws.\n\nFeel like I’m late to the story but I think it’s time Americans demand changes within the law ",
        "upvotes": 45,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1ksbkz2/watching_worst_roommate_ever/"
    },
    {
        "id": "1krxgf6",
        "author": "New-Entrepreneur4132",
        "title": "Untold the fall of Favre",
        "content": "What a hard one to watch. He did so much right. He also did so much wrong that is traceable and yet he still claims innocence. I don’t know how he lives with himself and looks in the mirror. Using welfare money from one of the poorest states in the US is a new bottom for any human. His sexual harassment is well-documented too. I hope they recover money for the people of Mississippi and I hope Favre acknowledges his wrongs and has regrets before Parkinson’s makes it hard for him to apologize. Greed is a horrible thing. ",
        "upvotes": 169,
        "comments": 112,
        "media": null,
        "permalink": "/r/netflix/comments/1krxgf6/untold_the_fall_of_favre/"
    },
    {
        "id": "1ksvkla",
        "author": "gamerjerome",
        "title": "Fixed the Netflix OceanGate trailer",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/hynx5y3g4d2f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1ksvkla/fixed_the_netflix_oceangate_trailer/"
    },
    {
        "id": "1ksttzn",
        "author": "Dazzling-Pace-677",
        "title": "Netflix Subscription Sharing india",
        "content": "Hey everyone,\nI'm looking for one spot in a Netflix Family 4K plan in India. If anyone has a slot available, I’d love to join and will pay my share accordingly on time.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ksttzn/netflix_subscription_sharing_india/"
    },
    {
        "id": "1ksqntq",
        "author": "Ok-Opportunity-9500",
        "title": "Netflix glitching in full screen",
        "content": "Hello hello, I tried today to watch netflix on my new laptop (had it for about a month) and when in full screen it keeps glitching, going up and down sort of. Tried on the website and on the app for windows, same thing. When it’s not on full screen it’s perfectly normal.\nI saw somewhere something about the screen cool off setting, I checked mine and it’s the recommended 120hz. I updated windows and it’s still glitching. Any idea would be greatly appreciated 🙏",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ksqntq/netflix_glitching_in_full_screen/"
    },
    {
        "id": "1ksm76q",
        "author": "PresentationJolly365",
        "title": "Looking for shows like Control Z or How to Sell Drugs Online (Fast) — teen drama, mystery, dark vibes?",
        "content": "Hey everyone!\nI recently rewatched Control Z and How to Sell Drugs Online (Fast) and loved their mix of teen drama, mystery, and dark humor.\n\nCan you recommend similar shows on Netflix with that kind of vibe? Doesn’t have to be exactly the same, but something with suspense, smart characters, and that edgy feel.\n\n\nAlso I don't want really long series with 8-10 seasons with each having 24 eps of 1 hr each\n\nWoukd like 3-5 seasons with episodes about 20-40 mins ?\n\nMaybe there are none based on so many restrictions LAWLLLLLL but kindly help or suggest \n\nThanks in advance!\n\n",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ksm76q/looking_for_shows_like_control_z_or_how_to_sell/"
    },
    {
        "id": "1ks6n78",
        "author": "LouisTully9000",
        "title": "Sneaky Links and the Death of Romance (as We Knew It)",
        "content": "At some point in the past five years; perhaps between the eighth season of Love Is Blind and the 437th rebranding of The Bachelor; televised dating quietly stopped being about dating. Instead, it became a parade of bronzed narcissists dry-humping on bean bags for the chance to sell flat tummy tea and boner pills to strangers on Instagram. Into this rich tradition steps Netflix’s latest entry, Sneaky Links: Dating After Dark, a show that dares to ask: What if your ex-booty call was also your soulmate? (And what if you were filmed trying to figure that out while shirtless, emotionally stunted, and surrounded by Ikea furniture?)\n\nIf you, like me, are 43 years old and unaware that “sneaky link” is Gen Alpha for “booty call,” you’re not alone. Apparently, the term “booty call” was too on-the-nose for a streaming platform that also produces prestige dramas about Elizabethan corsets and talking bears. Instead, we get “Sneaky Links,” a phrase that sounds like a sketchy URL you click by accident while searching for airfare.",
        "upvotes": 21,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1ks6n78/sneaky_links_and_the_death_of_romance_as_we_knew/"
    },
    {
        "id": "1kseg86",
        "author": "Objective-Shift7932",
        "title": "I am not okay with this season 2",
        "content": "Is there a chance for \"I am not okay with this\" to come back for season 2? I really loved the first season and it sucks that they left it on a cliffhanger. I was thinking that they might start working on it again after Stranger Things season 5 releases but I'm not sure.",
        "upvotes": 5,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1kseg86/i_am_not_okay_with_this_season_2/"
    },
    {
        "id": "1ks25hd",
        "author": "Accomplished-Snow727",
        "title": "The Residence",
        "content": "Just finished watching The residence on Netflix.. LOVED IT. Now i have a hankering for murder mysteries but not like dead serious a little quirky, like the residence, but not a movie - a tv series? Any suggestions? ",
        "upvotes": 31,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1ks25hd/the_residence/"
    },
    {
        "id": "1ksduiv",
        "author": "Shadowlab72",
        "title": "How to find independent movies on Netflix",
        "content": "Back in 2000 I started renting movies from Netflix and did so until about 2015. Netflix movies, mailed of course, had the best catalog of independent movies from anywhere. \n\nIf my local movie rental store didn't have an obscure title then I knew Netflix would. \nI know times have changed but I cannot seem to find many Independent films on Netflix streaming.\n\nI've tried the categories option but that's limited to drama comedy reality etc.. \n\nHas anybody found a way to find Independent films on the Netflix app?",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ksduiv/how_to_find_independent_movies_on_netflix/"
    },
    {
        "id": "1ksn2ko",
        "author": "worldhumanist",
        "title": "Has anyone been watching Legado on Netflix?",
        "content": "It's a Spanish series on Netflix.\nI think it's available in Europe. Not sure about the rest of the world.\n\nI have so many questions and have had so many wtf-moments while watching it.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ksn2ko/has_anyone_been_watching_legado_on_netflix/"
    },
    {
        "id": "1ksclig",
        "author": "loverules1221",
        "title": "Sneaky Links",
        "content": "Angelique and Colt look like brother and sister. They have the same lips and mouth. lol  They also just don’t care they are hurting the person they came with. Avery seems genuinely nice. ",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ksclig/sneaky_links/"
    },
    {
        "id": "1ksizbl",
        "author": "dapigtown",
        "title": "Netflix stuck at 540p everywhere on windows 11",
        "content": "For some reason Netflix on chrome, edge, and even the windows app are all stuck on 540p (960x540) when watching movies, and the weird thing is that this doesn't occur on TV shows (I get 1080p). I can confirm I've set playback settings to highest and my internet is more than sufficient at around 200 down. ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ksizbl/netflix_stuck_at_540p_everywhere_on_windows_11/"
    },
    {
        "id": "1ksehoe",
        "author": "UnequalHectare",
        "title": "American Civil War documentaries?",
        "content": "I just listened to a podcast about Robert E Lee and how much he sucked as a person and a general despite popular belief, and now I really want to find a decent documentary about the Civil War. I know Ken Burns’ is fantastic, but the only place I could find it was on YouTube for $40. Is there anything decent on Netflix? ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ksehoe/american_civil_war_documentaries/"
    },
    {
        "id": "1ksa84r",
        "author": "AwayRazzmatazz8937",
        "title": "Netflix show Bet",
        "content": "I really hope there's a season 2 of Bet. Miku Martineau Is absolutely beautiful. The show it's self if a pretty interesting concept and would love to see what they could do with more seasons.",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ksa84r/netflix_show_bet/"
    },
    {
        "id": "1ksg0hh",
        "author": "Only-File-6065",
        "title": "Secrets We Keep - Plot Hole?",
        "content": "In the beginning of the series after the police find ruby's passport, the detective goes to eat lunch in her car and then appears to throw away ruby's passport in a trash can along a beach. Why? I can't find any answers online, maybe I just saw the scene incorrectly but it's driving me crazy ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ksg0hh/secrets_we_keep_plot_hole/"
    },
    {
        "id": "1kso01t",
        "author": "BoredPandaOfficial",
        "title": "Netflix Star Exposes Bare Crotch At Cannes In Viral X-Rated Wardrobe Malfunction",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kso01t/netflix_star_exposes_bare_crotch_at_cannes_in/"
    },
    {
        "id": "1ks0qzn",
        "author": "Kindly_Dot_7006",
        "title": "Appropriate Adult?",
        "content": "Just started the Fred and Rose West documentary and they are describing the people at the police station including an “appropriate adult”. Assuming it’s a UK thing, but what does that mean? What is that person’s role supposed to be?",
        "upvotes": 5,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1ks0qzn/appropriate_adult/"
    },
    {
        "id": "1krz9u7",
        "author": "S4v1r1enCh0r4k",
        "title": "Carey Mulligan has been cast as Digory's mother in Greta Gerwig's Narnia movie",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1krz9u7/carey_mulligan_has_been_cast_as_digorys_mother_in/"
    },
    {
        "id": "1krstm5",
        "author": "surveypoodle",
        "title": "Just started watching Manifest and I'm loving it.",
        "content": "https://preview.redd.it/sw4almgyh32f1.jpg?width=426&amp;format=pjpg&amp;auto=webp&amp;s=6e6c2b2780cdb0f9df5f6d7f6ab446de46425956\n\nSo I randomly came across this show. Half way through the show I thought this was sci-fi and then it got weirder and weirder. I skipped through most of the family scenes  to save some time and I was mostly curious where they're going with this. Then came people dying mysteriously, cartoon villians from the government performing medical experiments on people searching for \"the Holy Grail\", \"The Major\" who's way up the ranks to conduct large operations that even the NSA is not aware of. The scientist who's there to explain shit to people with psychic powers called \"the calling\", things disappearing, symbols, egyptian mythology, dead people coming back to life, Noah's Ark, and other \"mysterious\" phenomenon.\n\nI got even more excited when I realized there's 4 seasons of this. I don't know how it was even possible to stretch this for that many seasons and this got my curiosity even more. Most of the time I'm just skipping through the episodes until I get to see Michaela's pretty face but everything's all connected. Wow.\n\nTwenty years from now, this is gonna be a cult classic. Calling it now.",
        "upvotes": 12,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1krstm5/just_started_watching_manifest_and_im_loving_it/"
    },
    {
        "id": "1krzegv",
        "author": "dhantantan",
        "title": "With Love Meghan - Looking for similar (better) shows",
        "content": "I enjoyed the calm, peaceful vibe, but the awkward abundance of self-congratulation was distracting. The lack of chemistry with guests was noticeable. Plus, sprinkling the dried flowers without consideration for the palate, 'the sweetness of the fruit is a real thing', detailed documentation of cooking process without recipes, etc 🧐\n\nI'd love to consume this genre done better - with an articulate and engaging host, where the guests radiate genuine fun.\n\nCulinary theme is appreciated, but not necessary.",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1krzegv/with_love_meghan_looking_for_similar_better_shows/"
    },
    {
        "id": "1ks9eb2",
        "author": "Joni005",
        "title": "Netflix video player problems",
        "content": "Hi guys, as you can see in the photo my video player is experiencing some problems, the episode im on dosent show and the buttons on the right side, next episode button and the one to show all episodes dont work, it works fine on an icognito browser. I have tried deleting browser data for netflix but it didnt help, any suggestions. Thanks in advance :)\n\nhttps://preview.redd.it/xm0o66l9b72f1.png?width=1916&amp;format=png&amp;auto=webp&amp;s=c9261890e6e4e39e9727224550b4f42cfbfe8278\n\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ks9eb2/netflix_video_player_problems/"
    },
    {
        "id": "1ks5hja",
        "author": "S4v1r1enCh0r4k",
        "title": "A new featurette for Season 2 of ‘Wednesday' has been released.",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/kqiugl9ej62f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1ks5hja/a_new_featurette_for_season_2_of_wednesday_has/"
    },
    {
        "id": "1ksijl6",
        "author": "Reba_2027",
        "title": "How do I remove non English movies From my Netflix",
        "content": "I'm so tired or poorly made movie's ani. Or dumb thing's I don't care about.\n\nOften me and the misses settle down to watch something that seems good OH WAIT THAT'S FRENCH IN ENGLISH DUB AND LIP SYNC'S AWFUL AND STUPID!\n\nI'm tired of scrolling through and it being no good movies or rather 0 good American non bs movies it's all Chinese Dog S- or French or etc.  \n\nI want them off my lists gone I DON'T WANT TO SEE EM!\n\nis their a setting to remove all trash movies/shows like this from my view..",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ksijl6/how_do_i_remove_non_english_movies_from_my_netflix/"
    }
]