[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 475,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1gsenwg",
        "author": "AutoModerator",
        "title": "JAKE PAUL v. MIKE TYSON Fight Megathread",
        "content": "&amp;#x200B;\n\nhttps://preview.redd.it/w8ywthvqp61e1.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=95e740ea33c09fcd4e8c898ea8b46958cd88635d",
        "upvotes": 113,
        "comments": 5784,
        "media": null,
        "permalink": "/r/netflix/comments/1gsenwg/jake_paul_v_mike_tyson_fight_megathread/"
    },
    {
        "id": "1gscas1",
        "author": "TheDean242",
        "title": "Crap quality for the fight ",
        "content": "Anyone else having this issue? I’m at 720 or worse. I have fiber and no one else is using my internet. I’m guessing the Netflix servers are overloaded. \n\nEdit: now the app is gaslighting me. It’s saying I have no internet connection. I do. I have great connection. \n\nEdit 2: now it shows me 15-20 seconds of the last round of the Taylor vs Serrano fight then tosses me out. It does this a few times then it starts me back at the beginning. I’m guessing the entire event is over at this point. I’m pissed. They have to do better. They have to make this right. I’m never watching a live stream on Netflix again.",
        "upvotes": 19393,
        "comments": 5752,
        "media": null,
        "permalink": "/r/netflix/comments/1gscas1/crap_quality_for_the_fight/"
    },
    {
        "id": "1gscer9",
        "author": "CurrentLeather6751",
        "title": "Fight buffering",
        "content": "Everyone was saying there wouldn’t be issues, and clearly they’re happening. The main fight is going to be so much worse. This is what happens when you monopolize a stream and only let one platform stream a giant event. ",
        "upvotes": 4098,
        "comments": 1516,
        "media": null,
        "permalink": "/r/netflix/comments/1gscer9/fight_buffering/"
    },
    {
        "id": "1gscowi",
        "author": "GlobalLifeguard8928",
        "title": "Netflix is not ready to stream live sports",
        "content": "The fight is rendered unwatchable due to all of the streaming problems I have been experiencing. What a bust. I see that I am not the only one. This is a bad start for Netflix.\n\nMaybe I am taking it all back, Barrios vs Ramos is very good. ",
        "upvotes": 2708,
        "comments": 316,
        "media": null,
        "permalink": "/r/netflix/comments/1gscowi/netflix_is_not_ready_to_stream_live_sports/"
    },
    {
        "id": "1gsgeon",
        "author": "Takasuya",
        "title": "This was the most dissapointing fight I had ever witnessed in my life.",
        "content": "Keep in mind I'm from Europe. So, before all the crap even occured, I had to stay up to 5 AM IN THE MORNING. \n\nFirst of all, worst streaming experience I had to endure. But the thing is, I was fighting to keep the stream back up for my life because I REALLY WANTED TO WATCH THIS FIGHT!\n\nAND THE FIGHT?!\n\nIT WAS MORE DISSAPOINTING THAN THE S$#T SHOW THAT WAS THE STREAM. THE MOST TIME-WASTEFUL,  BORING-ASS LET DOWN OF AN EVENT I HAD EVER SEEN. I'D GET MORE ACTION WATCHING WALL DRY. \n\nReality is often dissapointing. ",
        "upvotes": 965,
        "comments": 311,
        "media": null,
        "permalink": "/r/netflix/comments/1gsgeon/this_was_the_most_dissapointing_fight_i_had_ever/"
    },
    {
        "id": "1gscjg3",
        "author": "Bolt_McHardsteel",
        "title": "Worldwide buffering issues…",
        "content": "Three rounds into the first fight on the Tyson - Paul undercard and Netflix is having massive buffering issues everywhere it appears.\n\nThis could be a fail of epic proportions if they don’t figure this out very quickly. SMH. ",
        "upvotes": 1811,
        "comments": 962,
        "media": null,
        "permalink": "/r/netflix/comments/1gscjg3/worldwide_buffering_issues/"
    },
    {
        "id": "1gscloh",
        "author": "ThelastJasel",
        "title": "Booo Netflix boo",
        "content": "Get your shit together Netflix or refund this month. It is taking 7 min to load 3 seconds of fight that is two pixel blobs with zero human features. Boooooooo awful. \n\nEdit: Ok, it seems to be better now. I guess they heard with that overwhelming groundswell of 50 upvotes. \n\nEdit 2: I take my first edit back. Nonstop crashing awful quality. Boooooooo Netflix boo. Tried putting on something else perfect HD quality zero problems. Booo Netflix boo. Nonstop rate hikes and this is all you got? Refund the month, booo. \n\nEdit 3: Now you are lying to us by brining up screens that say it is our isp? Boooooooooooooooooooooooo! Lying and grifting. Refund the month. Booo Netflix booo. ",
        "upvotes": 1249,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1gscloh/booo_netflix_boo/"
    },
    {
        "id": "1gsbccr",
        "author": "Infinite_Scar_2797",
        "title": "Is Netflix Going to Crash?",
        "content": "Random question, but does anything think/has anyone wondered if Netflix is going to have trouble streaming the fight to over 250 million people? According to USA Today, \"Netflix will livestream it to 280 million viewers.\" I can't imagine their servers are prepared for that!\n\nEdit: Haha. Not surprised at all…",
        "upvotes": 1389,
        "comments": 907,
        "media": null,
        "permalink": "/r/netflix/comments/1gsbccr/is_netflix_going_to_crash/"
    },
    {
        "id": "1gsfb80",
        "author": "Hallowed21",
        "title": "Serrano vs Taylor",
        "content": "Can’t believe she got the win after playing so dirty. Literally leaning her head in grabbing her head butting her the whole fight. Legit so disappointing and can’t believe all 3 judges agreed on that. Gross fight.",
        "upvotes": 663,
        "comments": 249,
        "media": null,
        "permalink": "/r/netflix/comments/1gsfb80/serrano_vs_taylor/"
    },
    {
        "id": "1gsctdw",
        "author": "Altruistic_Pea7337",
        "title": "Not able to load Tyson fight ",
        "content": "Anybody else’s stream fine until the end of the first fight? Soon as it ended mine hasn’t been working. I’ve closed Netflix and relaunched the stream repeatedly and now I’m getting the pardon the interruption error \n\nHoly shit was that not worth it",
        "upvotes": 942,
        "comments": 1101,
        "media": null,
        "permalink": "/r/netflix/comments/1gsctdw/not_able_to_load_tyson_fight/"
    },
    {
        "id": "1gse6wc",
        "author": "Duffman4u",
        "title": "Jake Paul vs Mike Tyson Lag??",
        "content": "Hi Everyone,\n\nI hope this message finds you well.\n\nI wanted to check in to see if anyone else is experiencing issues with the stream. For context, I’m on a 1-gig fiber connection, which is usually extremely reliable and rarely gives me any trouble. However, I’ve found myself needing to refresh the stream on my PC several times to keep it running smoothly.\n\nWhile this isn’t a major issue for me personally, as refreshing on a computer is fairly quick and easy, I can’t help but think about viewers at home who might be watching the stream on their TVs. For those individuals, I imagine it could be quite inconvenient to have to interrupt their viewing experience, potentially get up, and troubleshoot or restart the stream multiple times.\n\nI wanted to bring this up not only to see if others are encountering similar problems but also in case this might be an issue worth investigating further on the technical side. If there’s a broader issue, it might be worth addressing sooner rather than later to ensure a seamless viewing experience for everyone.\n\nLooking forward to hearing if anyone else has noticed this or has insights to share.\n\nThanks!",
        "upvotes": 654,
        "comments": 851,
        "media": null,
        "permalink": "/r/netflix/comments/1gse6wc/jake_paul_vs_mike_tyson_lag/"
    },
    {
        "id": "1gsch4c",
        "author": "nxcl3",
        "title": "is anyone else lagging",
        "content": "i’m trying to watch the mike vs paul fight and my video is lagging , it either completely lags or says loading 99 percent, it’s been like this for several minutes, is anyone else experiencing lagging? this is crazy i really want to see the game i know there’s a lot of people watching but why do a live stream if the service can’t handle it ",
        "upvotes": 859,
        "comments": 352,
        "media": null,
        "permalink": "/r/netflix/comments/1gsch4c/is_anyone_else_lagging/"
    },
    {
        "id": "1gsda7r",
        "author": "John_In_Parts",
        "title": "Netflix needs to seriously re-think their choice of broadcast team.",
        "content": "Mauro Ranalo is the audio equivalent to a root canal with no anesthetic and won't shut up.  And the absolute cringe this guy gives bleeds thru the tv screen and makes the room uncomfortable.  And what the hell, Netflix?  Rosie Perez?  Click the Camera?  Seriously, this is the best you could find?  I mean, this is almost unwatchable to begin with, with your 720p like I'm watching a f'n Royal Rumble in 1995.  This is truly pathetic.",
        "upvotes": 759,
        "comments": 133,
        "media": null,
        "permalink": "/r/netflix/comments/1gsda7r/netflix_needs_to_seriously_rethink_their_choice/"
    },
    {
        "id": "1gse68p",
        "author": "JayHerd",
        "title": "It’s down.. the biggest event for Netflix crashed it!",
        "content": "Wow looks like they didn’t take notes while watching silicone valley on hbo max. Couldn’t scale and as hundreds of million people got online, it crashed and burned. ",
        "upvotes": 533,
        "comments": 199,
        "media": null,
        "permalink": "/r/netflix/comments/1gse68p/its_down_the_biggest_event_for_netflix_crashed_it/"
    },
    {
        "id": "1gsf9se",
        "author": "Minor-Annoyance",
        "title": "Katie Taylor and Amanda Serrano fight... WTF!!",
        "content": "what the fuck was with that call? Katie was running in for a hug head first the whole damn fight. some bullshit. just to add to the total bs of this shit show of a stream. ",
        "upvotes": 415,
        "comments": 237,
        "media": null,
        "permalink": "/r/netflix/comments/1gsf9se/katie_taylor_and_amanda_serrano_fight_wtf/"
    },
    {
        "id": "1gsesgj",
        "author": "tcjcky",
        "title": "The NFL games on Christmas Day are doomed",
        "content": "If tonight is any indication, so many TVs will get smashed out of frustration on Christmas Day if die-hard fans can’t watch the games. So be sure to put a TV on the list for Santa. ",
        "upvotes": 456,
        "comments": 108,
        "media": null,
        "permalink": "/r/netflix/comments/1gsesgj/the_nfl_games_on_christmas_day_are_doomed/"
    },
    {
        "id": "1gsgkex",
        "author": "Griswa",
        "title": "Netflix, you should ask Paul for 39.5 million back",
        "content": "This was the worst display of what anyone could call boxing. It was like watching kids spar in U10 ninja karate. I imagine if two drunk dudes fought in the middle of a quick mart in Oklahoma and filmed it, it would have been more entertaining. I would have rather watched  paint dry while eating uncooked hotdogs. Short of the fact I had to restart Netflix every 3 minutes to stop buffering my 800gb down speed internet. Now I am going to be exhausted. I hate you. ",
        "upvotes": 292,
        "comments": 107,
        "media": null,
        "permalink": "/r/netflix/comments/1gsgkex/netflix_you_should_ask_paul_for_395_million_back/"
    },
    {
        "id": "1gsf1w9",
        "author": "SableyeEyeThief",
        "title": "Amanda Serrano’s headbutt: nasty",
        "content": "This is some nasty stuff. Accidental or not, that’s a big gape! I was almost confident that they were going to stop the fight. It runs deep and puts her at a disadvantage because Katie will attack the eyebrow intently. I hope we get to see all of the rounds, bearing that the fighters are okay and ready to go. ",
        "upvotes": 377,
        "comments": 541,
        "media": null,
        "permalink": "/r/netflix/comments/1gsf1w9/amanda_serranos_headbutt_nasty/"
    },
    {
        "id": "1gsfao0",
        "author": "hawaiiscuba23",
        "title": "Streaming issues aside; let’s talk production ",
        "content": "Am I the only one cringing, and quite frankly, ready to slam my D in a door because of it? Netflix this is really embarrassing. Your commentators are so, so fake. Did you not test anything ahead of time? Run out of time? The switching, the communication between the teams? As they said “you’re better than that”. ",
        "upvotes": 343,
        "comments": 155,
        "media": null,
        "permalink": "/r/netflix/comments/1gsfao0/streaming_issues_aside_lets_talk_production/"
    },
    {
        "id": "1gsfsrd",
        "author": "TeddyPup19",
        "title": "Amanda Serranos won that fight",
        "content": "That was a bad call, Serranos won that fight, I don’t even think it was that close of a call. Katie did okay but her boxing was sloppy. The ref even told her to stop and she is better than that. I’m angry for Serranos, she deserved a better fight. But she is such a badass still. ",
        "upvotes": 308,
        "comments": 61,
        "media": null,
        "permalink": "/r/netflix/comments/1gsfsrd/amanda_serranos_won_that_fight/"
    },
    {
        "id": "1gsc19x",
        "author": "w1n5t0nM1k3y",
        "title": "What resolution are you getting for Tyson VS Paul? I'm at 720p",
        "content": "What resolutions is everyone else getting with the Tyson VS Paul fight? I'm watching on PC with a 1080P monitor and all I get is 720P. I tried with another show (Umbrella Academy) just to see if it was something wrong with my setup and I got 1080p on there. Not sure why the fight is showing in 720p. \n\nIs anybody else having issues or is it just me? You can type Ctrl+Alt+Shift+D to show the stats. look near the middle of the wall of text and it shows\n\nPlaying bitrate (a/v): 128 / 5000 (1280x720)\n",
        "upvotes": 513,
        "comments": 869,
        "media": null,
        "permalink": "/r/netflix/comments/1gsc19x/what_resolution_are_you_getting_for_tyson_vs_paul/"
    },
    {
        "id": "1gsemjy",
        "author": "infiniteoo1",
        "title": "Someone fax me the results in the morning",
        "content": "Dial up would be better. Heck. Pony express. Adjust my rabbit ears. Maybe send some smoke signals. They had months to get this right. Did they think to test it maybe even get a network guy involved instead of Bob the damn builder.  This reminds me of the early days of the internet. All hail AOL. ",
        "upvotes": 326,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1gsemjy/someone_fax_me_the_results_in_the_morning/"
    },
    {
        "id": "1gserrm",
        "author": "Jezahb",
        "title": "Anyone else having buffering issues for everything else on Netflix as well?",
        "content": "I mean I'm just trying to watch the trailer for the Martha Stewart documentary and I can't even get that to load in anything but potato quality. Is the bandwidth being used by the live event literally bogging down the entirety of Netflix? Anyone else having this issue?",
        "upvotes": 274,
        "comments": 115,
        "media": null,
        "permalink": "/r/netflix/comments/1gserrm/anyone_else_having_buffering_issues_for/"
    },
    {
        "id": "1gsgfaw",
        "author": "mythmm",
        "title": "Isn’t the fight just sad",
        "content": "I wanna hear your opinions Prime Mike was amazing speed power intuition everything was amazing and now watching him as a 60 year old barely walking to his corner it gives you a different perspective on life. I never had any respect for Jake Paul but why would you box a 60 year old and can.t do shit.\nOr maybe it’s rigged idk",
        "upvotes": 194,
        "comments": 154,
        "media": null,
        "permalink": "/r/netflix/comments/1gsgfaw/isnt_the_fight_just_sad/"
    },
    {
        "id": "1gsclg0",
        "author": "huskyfe450",
        "title": "Buffering - Tyson fight ?",
        "content": "Is anyone else out there experiencing buffering in this Tyson vs. Paul fight ?  Mine keeps freezing, forcing me to get out and come back in - and this is only the first fight.  I'm sure its gonna get worse as might goes on.  Just wondering if anyone else is have this issue ?",
        "upvotes": 360,
        "comments": 73,
        "media": null,
        "permalink": "/r/netflix/comments/1gsclg0/buffering_tyson_fight/"
    },
    {
        "id": "1gscw5q",
        "author": "AdventurousUsual9861",
        "title": "Tyson Paul Fight Netflix Bandwidth Problems ",
        "content": "With 700mb download speed the second fight hasn’t even started yet and I’ve already had to restart the fight 15 times. Plus, the issues with the announcers this is a pretty rough start. ",
        "upvotes": 322,
        "comments": 485,
        "media": null,
        "permalink": "/r/netflix/comments/1gscw5q/tyson_paul_fight_netflix_bandwidth_problems/"
    },
    {
        "id": "1gsit1i",
        "author": "RiekaNA",
        "title": "Mike Tyson vs Jake Paul fight sucked! Shame on Netflix for putting this on air!",
        "content": "I admit that I don't watch boxing nor do I know anything about it.. but I decided to give it a try anyways. It was terrible.. absolutete dreadful. Most of the fights between Mike Tyson vs Jake Paul were them hugging each other. I barely saw any actual punches other than a couple of times. I didn't see anyone get a nose bleed, nothing.  People who were there actually paid around $32,392 for floor seats on Vividseats (according to CBS).. I think they should be refunded their money because they didn't get their moneies worth.\n\nI honestly can't believe that Tyson just made 20 million dollars off of that fight while the other guy gets $40 million. There is something seriously wrong about that. There are Americans busting their asses off having 2+ more jobs struggling to put food on the table to feed their families yet 2 \"boxers\" who mostly spent time time hugging each other inside the ring gets millions of dollars for a short duration fight.",
        "upvotes": 99,
        "comments": 97,
        "media": null,
        "permalink": "/r/netflix/comments/1gsit1i/mike_tyson_vs_jake_paul_fight_sucked_shame_on/"
    },
    {
        "id": "1gseml2",
        "author": "TheDestressedMale",
        "title": "Graphics in 2024 be like:",
        "content": "Post your images of the fight, even the buffering",
        "upvotes": 228,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1gseml2/graphics_in_2024_be_like/"
    },
    {
        "id": "1gse413",
        "author": "Current_Jackfruit_62",
        "title": "Tyson vs Paul",
        "content": "Nice job Netflix. One of the largest boxing events in history. Constantly buffering. If it’s not freezing it’s got no audio. Big opportunity and a huge let down: this better be fixed by the main event..",
        "upvotes": 243,
        "comments": 88,
        "media": null,
        "permalink": "/r/netflix/comments/1gse413/tyson_vs_paul/"
    },
    {
        "id": "1gsdapv",
        "author": "sinlightened",
        "title": "Joined the sub just to say. ",
        "content": "I’ve had Netflix continuously since like the beginning.. 2007-2008.\n\nI’ve cancelled subs for other services over the years but kept Netflix. \n\nIf they continue messing up these fights tonight I will cancel it and go back to the high seas for everything.\n\nThis is unacceptable. The most expensive streaming service who constantly raises rates.\n\n$23/month for this 480p trash.",
        "upvotes": 260,
        "comments": 60,
        "media": null,
        "permalink": "/r/netflix/comments/1gsdapv/joined_the_sub_just_to_say/"
    },
    {
        "id": "1gseeob",
        "author": "Davis1891",
        "title": "What a terrible night.",
        "content": "Uninteresting commentary, buffering....buffering....buffering....back to menu --&gt; select fight, uninteresting commentary, buffering....buffering.... buffering....back to menu --&gt; select fight, more uninteresting commentary....\n\nJesus. Netflix has really outdone themselves this time.",
        "upvotes": 184,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1gseeob/what_a_terrible_night/"
    }
]