[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 12,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1odbsqb",
        "author": "Warm-Barracuda3302",
        "title": "‘I’ve been in tears’: Ajike Owens’ cousin opens up after ‘reliving’ her death in Netflix doc",
        "content": "",
        "upvotes": 17,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1odbsqb/ive_been_in_tears_ajike_owens_cousin_opens_up/"
    },
    {
        "id": "1ocvyvf",
        "author": "Legit_Train_Hopper",
        "title": "“Tell them You Love Me” documentary..",
        "content": "I seriously cannot express how angry, sad and generally appalled I feel after watching this, this is one of the most disturbing fucking documentaries I have *ever* seen. \n\nAnna stubble field is *the* true definition of the devil. \n\nShe left scars on DMan’s body. She, an able bodied woman, raped a disabled man. I’m so sick and angry after watching this.\n\nDaisy (DMan’s mom) said he now masturbates. She said he would’ve never had known about anything sexual if it weren’t for Anna showing it to him. \n\nAND THE WORST PART ABOUT ANY OF THIS is at the end she STILL doesn’t think she’s wrong for this oh.. my god…\n\nThis documentary I felt in my *soul*. ",
        "upvotes": 116,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1ocvyvf/tell_them_you_love_me_documentary/"
    },
    {
        "id": "1od007p",
        "author": "pandasoondubu",
        "title": "The Perfect Neighbor",
        "content": "Did Sue plan out how to get away with the murder?\n\nIt was briefly mentioned in the interrogation that she researched “stand you ground” laws before this all happened. Not sure if anyone has seen anything about this, but if that’s true it feels more calculated than a moment of anger.\n",
        "upvotes": 58,
        "comments": 105,
        "media": null,
        "permalink": "/r/netflix/comments/1od007p/the_perfect_neighbor/"
    },
    {
        "id": "1oda16w",
        "author": "Bubbly-Comparison-29",
        "title": "Boots is SO GOOD.",
        "content": "i just finished watching the last episode after binging it all in a couple of days. its AMAZINGGG it has great acting, great balance between comedy and seriousness and really makes you care about each character. guys give it a shot pleasee \n\n  \nalso on a side note max parker's eyes are absolutely gorgeous ",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oda16w/boots_is_so_good/"
    },
    {
        "id": "1od0r1z",
        "author": "MeanderFlanders",
        "title": "The Perfect Neighbor: Where was the tablet found?",
        "content": "Something that has been nagging me, was the location of the tablet, the cause of the last confrontation. I watched a bit of the trial when it occurred but didn’t catch that it was addressed. Wondering it was in her house, on her porch, etc. ",
        "upvotes": 16,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1od0r1z/the_perfect_neighbor_where_was_the_tablet_found/"
    },
    {
        "id": "1ocs7zs",
        "author": "DefiantRanger9",
        "title": "When rates of violence, shootings, and depression are high in this country, do we really need shows glamorizing serial killers?",
        "content": "When does gruesome and terrible become fantastical, to be viewed and enjoyed by others?\n\nAt what point do we say enough is enough. There are enough crazy people out there as it is. No need to bring attention to them (like putting someone’s name and mugshot in the news after they committed a crime). ",
        "upvotes": 29,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1ocs7zs/when_rates_of_violence_shootings_and_depression/"
    },
    {
        "id": "1od8kup",
        "author": "Hackedbytotalripoff",
        "title": "immersive  show  for Vision Pro on Netflix",
        "content": "After enjoying the immersive F1 trailer on my Apple Vision Pro, I'm ready to pay extra for Netflix shows produced for immersive films. When are they coming?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1od8kup/immersive_show_for_vision_pro_on_netflix/"
    },
    {
        "id": "1obzuh4",
        "author": "snowbugolaf",
        "title": "The Perfect Neighbor - innocent kids",
        "content": "It’s the way the children don’t speak the swear words when they’re quoting Susan 😥 They’re just literally so, so strikingly innocent, playing kid games in the vacant lot as kids do.",
        "upvotes": 1573,
        "comments": 702,
        "media": null,
        "permalink": "/r/netflix/comments/1obzuh4/the_perfect_neighbor_innocent_kids/"
    },
    {
        "id": "1oddfor",
        "author": "idlaughless",
        "title": "'Outer Banks' Director Jonas Pate Accused Of Grabbing and Shaking Production Assistant",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oddfor/outer_banks_director_jonas_pate_accused_of/"
    },
    {
        "id": "1odd6q1",
        "author": "Sudden_Pop_2279",
        "title": "After 18 weeks on Netflix, KPop Demon Hunters has surpassed 400 million views",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1odd6q1/after_18_weeks_on_netflix_kpop_demon_hunters_has/"
    },
    {
        "id": "1odc0yv",
        "author": "Affectionate-Pie8480",
        "title": "One Day",
        "content": "Just here to say I've just finished watching One Day and I'm unwell. This series will definitely be on the list of \"never watching it again\". \nDexter was definitely not the best guy ever, he fucked up multiple times and I wanted to punch him in the face so badly because of the way he treated Emma at the restaurant, but they were soulmates and they've been robbed of their future together. \nThis show has a moral: don't waste time confessing your feelings to the one you love, you might think you have all the time in the world but life is unpredictable and unfair.\n\nFuuuuck me, I'll never watch this show ever again.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1odc0yv/one_day/"
    },
    {
        "id": "1ocuekz",
        "author": "DrMantisToboggan45",
        "title": "Anyone else getting an error “ui-801-ps4000” on their PS5?",
        "content": "Turned on my ps5 after work and it said Netflix had an error and needed to be reinstalled. I did it and this error keeps popping up as soon as I click the app. Reinstalled again, re did the wifi and restarted the console. It’s working fine on my phone, anyone else experiencing this? ",
        "upvotes": 15,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1ocuekz/anyone_else_getting_an_error_ui801ps4000_on_their/"
    },
    {
        "id": "1oda673",
        "author": "Majestic-Ad-6485",
        "title": "AI in Entertainment: Netflix GenAI Plans &amp; YouTube Rolls Out Deepfake Detection Tool",
        "content": "\n* **Netflix** plans to use generative AI to augment content creation, improving creator efficiency without replacing humans.  \n* **YouTube** rolled out an AI likeness-detection tool that helps creators locate and request removal of unauthorized deep-fake videos.  \n* OpenAI is teaming up actor Brian Cranston to develop technologies to protect against deepfakes.  \n\nSources: https://aifeed.fyi/#topiccloud  \n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oda673/ai_in_entertainment_netflix_genai_plans_youtube/"
    },
    {
        "id": "1od2fla",
        "author": "ISRI999",
        "title": "Switching payment country",
        "content": "I moved from NL to Hungary recently and I want to switch my billing to a Hungarian card with the Hungarian cost of netflix. I currently pay the NL cost in my Hungarian card which is not cheap. What is the easiest way to do this without losing recommendations and accounts.\n\nI currently have the premium membership and I would be saving at least 5 euros a month with this change. My monthly payment is Oct 30. \n\nAny help is appreciated!",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1od2fla/switching_payment_country/"
    },
    {
        "id": "1obzpbu",
        "author": "Serious_Article1750",
        "title": "The one moment in The Perfect Neighbor when we witness the true Susan Lorincz:",
        "content": "“WAIT A MINUTE!!!”\n\nIt’s bone-chilling. She sounds like a monster. In this moment, she likely thought it was one of the neighbours knocking, not a police officer. She doesn’t have time to put on her “I’m just a sweet old lady” voice with her various sob stories.\n\nThis is the real Susan.",
        "upvotes": 707,
        "comments": 117,
        "media": null,
        "permalink": "/r/netflix/comments/1obzpbu/the_one_moment_in_the_perfect_neighbor_when_we/"
    },
    {
        "id": "1ocf3ez",
        "author": "dslryan",
        "title": "The Perfect Neighbor",
        "content": "This is INTENSE. It's such a fantastic documentary in the sense that it was all straight bodycam footage and no excess commentary. Heartbreaking story, especially when the officer asks the son \"Are you hurt?\" and he replies with \"No but my heart is broken.\"\n\nIncredibly well done documentary. I highly recommend watching it because of how it tells this story. Very sad, very gripping.",
        "upvotes": 47,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1ocf3ez/the_perfect_neighbor/"
    },
    {
        "id": "1od1hgr",
        "author": "FreeMagliettaCercasi",
        "title": "netflix error ui-801-ps4000",
        "content": "Yesterday I was stuck for over an hour, trying to turn my PS4 off and on again, continually installing and uninstalling Netflix, using two types of connections, Wi-Fi and my phone's hotspot, but nothing worked. I was disappointed by the support because even though I already mentioned these things before, they kept me hanging for an hour asking me if I had done them one by one! Useless support. Can you help me? I can't even see my profiles; when I log in, I just get an error: \"Netflix error UI-801-PS4000.\"",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1od1hgr/netflix_error_ui801ps4000/"
    },
    {
        "id": "1oct97g",
        "author": "Dmlandis59",
        "title": "how realistic is Boots?",
        "content": "is Boot camp really like that? Perhaps someone who was in the Marines in the 1990s could comment.  I do like how the use early 1990s technology / no cellphones but plenty of push button phones. And soundtrack is good /) ",
        "upvotes": 8,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1oct97g/how_realistic_is_boots/"
    },
    {
        "id": "1ocj398",
        "author": "Professional_Fig6820",
        "title": "What on earth happened to Season 3 of The Diplomat?",
        "content": "Is it just me or did Season 3 of *The Diplomat* suddenly forget how to be a good show? Zero tension, clumsy writing, and characters acting like parodies of themselves. Wild downgrade from the first two seasons?   \n",
        "upvotes": 19,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1ocj398/what_on_earth_happened_to_season_3_of_the_diplomat/"
    },
    {
        "id": "1oc11yy",
        "author": "misterDubzz",
        "title": "The Perfect Neighbor",
        "content": "This was an insanely emotional watch.  After them breaking the news about the mothers death, I found myself realizing. This is not something I feel comfortable having access to. What we saw was real unfiltered grief and pain in a very real situation. I don’t think I’ve seen something like that before.  The story is important and wow. What an impactful way to tell it. I feel like I don’t want to watch anything like this ever again. \n\nDid you enjoy it or did you feel it was too much? ",
        "upvotes": 220,
        "comments": 177,
        "media": null,
        "permalink": "/r/netflix/comments/1oc11yy/the_perfect_neighbor/"
    },
    {
        "id": "1ocxyit",
        "author": "buzz3456",
        "title": "Netflix 4K",
        "content": "I have 2 tvs, my old 2020 led 48 inch tv and my new 55 inch Sony OLED tv\n\nI had Netflix HD for a while now on my old tv and OLED but I got into Wednesday and I decided to switch to see if there really is a difference. And wow, the detail and picture really does improve. My Sony tv doesn't support Dolby vision through Apple TV but the OLED still makes it look amazing\n\nIf you have 5ghz Internet wireless or Ethernet and a stable connection then I recommend it. And if you can afford it, for 25$ a month and price rising like every month it all depends on ya love for quality.\n\nBut HD also looks good so you're not missing out a lot if you're just into the movies. And it's cheaper compared to 4K plan",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ocxyit/netflix_4k/"
    },
    {
        "id": "1ocmwhx",
        "author": "Les_Turbangs",
        "title": "*Who Killed The Montreal Expos” audio out of sync",
        "content": "Is anyone else having audio synchronization problems with the new doc \\*Who Killed The Montreal Expos\\*? I started watching it via the Netflix app on my Apple TV and quickly discovered that most of its clips are out of sync. It’s only this program: the audio on everything else on Netflix (and elsewhere) is in perfect sync.",
        "upvotes": 9,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1ocmwhx/who_killed_the_montreal_expos_audio_out_of_sync/"
    },
    {
        "id": "1oclout",
        "author": "tomaz1989",
        "title": "Shows like Adolescence?",
        "content": "Any good show like Adolescence  ?  already watched Mare of Easttown and The Night Of and Unbelievable  dont need to be netflix show\n\nthank you for answer ",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1oclout/shows_like_adolescence/"
    },
    {
        "id": "1octuxz",
        "author": "OhMyOhWhyOh",
        "title": "What do you think about a Love is Blind/Ultimatum crossover?",
        "content": "I think it could be really fun to have a season of The Ultimatum which consists of couples who met during Love is Blind. Obviously it would depend on if there's enough former Love is Blind couples to make it work, but with almost 10 season it seems like a possibility.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1octuxz/what_do_you_think_about_a_love_is_blindultimatum/"
    },
    {
        "id": "1octdwb",
        "author": "Greedy-Crab-4532",
        "title": "How do i remove this??",
        "content": "im watching tv and bumped into the remote and then this text showed up and i cant seem to remove it, i have tried going out of the show and hitting play again and this is the second episode and its still there? anyone know how to take it off ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1octdwb/how_do_i_remove_this/"
    },
    {
        "id": "1occvg8",
        "author": "Advanced_Bluebird925",
        "title": "Wayward, late to the party…",
        "content": "Just finished Wayward. 7/10. Immediately Googled “Wayward copied Midsommar” and found lots of discussion. Agree Wayward has “whiffs” of Midsommar as I saw it put in one post but what irked me the most was the inconsistency in talent/character development and the made-for-TV Hallmark Christmas  special feel that was so pervasive. Toni Collette is one of my fav actors (interesting she also starred in Hereditary, another Ari Aster film). \n\nThis was my introduction to Mae Martin and I fell a little in love with them! I read they not only directed the film but it’s based on both personal experience and a young friendship with someone sent to one of these “troubled teen” institutions. \n\nI would love to see a film length version as the series format felt watered down. More emphasis on Alex and Evelyn’s past could add more depth. Sydney Topliffe was really good but it didn’t feel like she had much to work with. I found Abbie’s story more interesting than Leila’s and if it were further developed, would have added depth to the character. Or maybe, just more character development in general would have made all of the roles more compelling if fleshed out. \n\nI guess it says something about the story itself that my main complaint is that I wanted more! Just felt thin to me which feels inexcusable for an 8 episode series, each around 45 min duration. \n\nHope not too harsh! I really did enjoy it and this is the first review I’ve ever contributed. Curious about similar (or not!) thoughts.  \n\n ",
        "upvotes": 8,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1occvg8/wayward_late_to_the_party/"
    },
    {
        "id": "1ocn4x9",
        "author": "MathematicianNew627",
        "title": "I'm Pissed at Pedro in Machos Alpha S3",
        "content": "I'm honestly so mad after finishing the latest season. What I liked about the show is it had a level of self awareness but with this latest season, it completely missed the mark. Pedro leaving Daniella IN LABOR to go to the premiere of his show, and facing no consequences. Luis not giving a F about his wife's dreams or ambitions. Raul and Santi are going through, to be fair. But in general I think those final plot points hindered the character growth most of the show has been about. But idk",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ocn4x9/im_pissed_at_pedro_in_machos_alpha_s3/"
    },
    {
        "id": "1ocspth",
        "author": "jmrxo",
        "title": "Series recommendations that are mysteries?",
        "content": " can anyone recommend netflix series that are mysteries? can anyone recommend netflix series that are mysteries? can anyone recommend netflix series that are mysteries?",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1ocspth/series_recommendations_that_are_mysteries/"
    }
]