[
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 76,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 22,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1ltdkl1",
        "author": "anonymous_teenage",
        "title": "The lincoln lawyer is sooooooo underrated!!!!!!!",
        "content": "Idk why people dont talk about this show its soo good. Like each season has its own crazy story and plotlinee like i cant believe the plot twist this show has. I want more people to talk about this show and i cant wait for s4 its such a long wait. ",
        "upvotes": 112,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1ltdkl1/the_lincoln_lawyer_is_sooooooo_underrated/"
    },
    {
        "id": "1ltl89p",
        "author": "Top-Three-USA",
        "title": "Netflix Says Over 50% of Global Users Watch Anime, Unveils Major New Slate at Anime Expo",
        "content": "",
        "upvotes": 33,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ltl89p/netflix_says_over_50_of_global_users_watch_anime/"
    },
    {
        "id": "1lti8gx",
        "author": "Mindless_Tax_4532",
        "title": "What are some good feel-good comfort shows?",
        "content": "I've been down lately and I'm looking for a good show to help cheer me up. I said \"feel-good comfort shows\" into the voice search on my remote and the first show it suggested was Dateline.... I think not lmao. So I thought I'd come here to ask for suggestions.\n\nNot much has been able to make me laugh lately, but in general I enjoy comedies, and especially musicals or musical comedies, but I am open to other suggestions. Just not anything that will make me even more depressed. Thanks!",
        "upvotes": 35,
        "comments": 79,
        "media": null,
        "permalink": "/r/netflix/comments/1lti8gx/what_are_some_good_feelgood_comfort_shows/"
    },
    {
        "id": "1lt3rus",
        "author": "NoWhereNorth-II",
        "title": "Sandman S2 is out - who remembers S1?",
        "content": "\nI have had enough with Netflix disappearing for years between seasons. The Sandman S2 is out approx 3 years after S1. I do not remember S1 and I have had enough rewatching old seasons. \n\nAnd Netflix cannot blame the pandemic, they have been releasing content throughout the past 3 years. \n\nI have made a vow never to watch a new season if it is too far out that I cannot recall the previous season. \n\nNetflix needs to reconsider how they prioritize their content investments. \n\nDo you feel the same?",
        "upvotes": 136,
        "comments": 95,
        "media": null,
        "permalink": "/r/netflix/comments/1lt3rus/sandman_s2_is_out_who_remembers_s1/"
    },
    {
        "id": "1ltkb81",
        "author": "FoggyMoonCove",
        "title": "Animal Kingdom",
        "content": "Awesome show. Watched the series several times through when it came out. Glad it’s on Netflix now. Favorite character? Best season? Best episode? Favorite heist/job pulled?",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ltkb81/animal_kingdom/"
    },
    {
        "id": "1ltmki7",
        "author": "Ona_WSB",
        "title": "Old Guard 1 or 2 which is better",
        "content": "I have now seen both films.. In my opinion I lived the first one and as for the second film I sort of found myself not caring for it as much. I felt the entire movie i was waiting for something to happen and comparing it to the first movie… The Old Guard is better. What are ur thoughts? ",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1ltmki7/old_guard_1_or_2_which_is_better/"
    },
    {
        "id": "1ltn0yf",
        "author": "Acceptable-Ad4374",
        "title": "Sneaky Pete",
        "content": "So many people are gonna be put on to Sneaky Pete for the first time when it comes to Netflix on Thursday. I remember watching it on Prime Video and being hooked. The story was so good and I loved the character development. Glad it’s gonna be exposed to a new audience who will get to experience it for the first time. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ltn0yf/sneaky_pete/"
    },
    {
        "id": "1lszllo",
        "author": "LeatherMiserable4414",
        "title": "Good true crime documentaries to watch?",
        "content": "Hello, i am just now trying to get into true crime. Although i dont really know where to start. Figured i would hop on here and then ask you guys.. Thank you!!!",
        "upvotes": 33,
        "comments": 72,
        "media": null,
        "permalink": "/r/netflix/comments/1lszllo/good_true_crime_documentaries_to_watch/"
    },
    {
        "id": "1ltnfdp",
        "author": "Agile-Aside1905",
        "title": "Friends and Mad Men are leaving Netflix on my country. Need more recommendations!",
        "content": "I am interested in show that’s about a group of people, it should be a ridiculous no-brainer, or something truly thought-provoking, no in-betweens. Not a fan of romance either, any suggestions? \n\n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ltnfdp/friends_and_mad_men_are_leaving_netflix_on_my/"
    },
    {
        "id": "1ltnd3v",
        "author": "chowdahhead13",
        "title": "Mr robot",
        "content": "Def seems like a good time for a rewatch especially in the climate we live in I wonder what would be evil corp irl? A lot of appropriate candidates for sure ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ltnd3v/mr_robot/"
    },
    {
        "id": "1ltgvag",
        "author": "lilweetz",
        "title": "What are some limited series like apple cider vinegar?",
        "content": "We absolutely loved this series, the storyline the acting, everything. We completed it in one day but haven’t found anything to match it since. Any suggestions ??!!! Something similar or just a good limited series in general ",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ltgvag/what_are_some_limited_series_like_apple_cider/"
    },
    {
        "id": "1lt9e25",
        "author": "natipali",
        "title": "Netflix shows like these?",
        "content": "Hi, can u guys recommend me Netflix show similar to these? I know Elite is not a really liked tv show, and honestly I stopped watching it after s5 I think, but I liked the...vibes/aesthetic in the beginning, but the amount of sex had me skipping a lot of scenes. \n\nBasically what I want is a good mystery show that has me guessing each episode who could be the hacker/killer/A 😂  ",
        "upvotes": 9,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1lt9e25/netflix_shows_like_these/"
    },
    {
        "id": "1ltmtla",
        "author": "Main_Citron_5908",
        "title": "Why can I not hear the episodes but hear everything else",
        "content": "When I open the app everything seems normal but when I click play on a episode it has no sound, this is happened on 2 different Roku sticks and I need help because I have no idea what’s going on.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ltmtla/why_can_i_not_hear_the_episodes_but_hear/"
    },
    {
        "id": "1lsxbuc",
        "author": "Natural_West4094",
        "title": "Where has all the good stuff gone?",
        "content": "This has probably been asked a thousand times already - is the netflix algorithm hiding all the good stuff or is netflix just shit now?\n\nThe algorithm is giving me more and more of the shit stuff that I don't like, and so I end up watching the least terrible thing I can find (or switching off) and I think this is reinforcing the shit stuff that is offered to me. And it seems to have gotten worse since the UI was updated. Or is there really nothing to watch on netflix?\n\nAnd its now always pushing for me to rewatch everything I've already watched, like just minutes after I've finished something it's the big main full screen suggestion. What's that about? Where's all the good stuff? Is there a way to game the algorithm so I can see the stuff it's not showing me? Or is Netflix really just Korean melodramas and 20 year old terrestrial TV dross.\n\nI'm using netflix so much less since the ui was updated that I'm starting to wonder if the algorithm is designed to find the sweet spot between keeping me paying but watching nothing. :(",
        "upvotes": 42,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1lsxbuc/where_has_all_the_good_stuff_gone/"
    },
    {
        "id": "1ltey4m",
        "author": "GothBootyWorshipper",
        "title": "Black screen on Samsung smart tv",
        "content": "I just keep getting black screen when I click on Netflix. I've removed the app and redownload it as it suggests on Netflix and it's still not working. I know it's not a connection issue as literally every other app is working fine it's just Netflix black screening. Any tips?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ltey4m/black_screen_on_samsung_smart_tv/"
    },
    {
        "id": "1ltju2n",
        "author": "Flat-Replacement544",
        "title": "Why is everyone in these teen series well groomed always and looking their best? Is it representative of reality?",
        "content": "Hi everyone. I'm bored so just wanted to share my thoughts on something I've realized. I am sharing this here because all of you guys watch netflix. I have watched alot of teen and young adult series on netflix and I realize that most persons look like they are models and they are always well groomed.\nIs this typical of high schoolers and college students in the US? Or is it because these shows are centered around rich areas so the characters are reflective of that? Or is it because they choose the best looking persons to cast and these persons fresh up before filming? The females are always hot and the males look like they go to the gym. \nWhereas from what I have seen in real life, most people are average looking. So is this a rich neighbourhood thing or what with these series. Please answer and be respectful. If this is not the place to have a discussion about this, let me know.",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ltju2n/why_is_everyone_in_these_teen_series_well_groomed/"
    },
    {
        "id": "1lsmlz5",
        "author": "Fragrant_Peanut_9661",
        "title": "Mr Robot",
        "content": "So I'm just about to start this. Mr Robot. I'm doing it based off recommendations from here. Is it really as good as I've heard? I'm like horror/thriller normally. But I've heard a fuck-ton of ranting and raving over it. So I'm gonna give it a shot! 🤞🏻📺",
        "upvotes": 121,
        "comments": 84,
        "media": null,
        "permalink": "/r/netflix/comments/1lsmlz5/mr_robot/"
    },
    {
        "id": "1lsts5i",
        "author": "Miserable_Spray6539",
        "title": "another mini-serie to binge watch?",
        "content": "i just finised Sirens in one night and I LOVEDDD IT !! seriously i would have never tought of that, after every episodes i wanted to know more. do u have something similar? i like drama/actions/suspense/murder themes 😍🤭 i watched perfect family this week too and liked it\n\nTIA",
        "upvotes": 29,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1lsts5i/another_miniserie_to_binge_watch/"
    },
    {
        "id": "1lsvsep",
        "author": "Airirazig",
        "title": "[Discussion] Dept. Q - Great Show",
        "content": "An absolutely riveting series with Matthew Goode as a detective assigned to the cold case files because he’s a pain in the butt to his department. The case is about a missing prosecutor who may or may not be dead but has disappeared. \nFrom a Polish (or German, I can’t remember which) series. It kept me glued to the set and the last two episodes are explosive with revelations and the ending had me crying with joy. Adapted by Scott Frank who did the same for The Queen’s Gambit, from the novel by Walter Tevis (small plug: Tevis was my college writing professor.)",
        "upvotes": 17,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lsvsep/discussion_dept_q_great_show/"
    },
    {
        "id": "1ltbbfi",
        "author": "Mikeyboy101591",
        "title": "WWE Raw Vault",
        "content": "Why aren’t all old school Raw episodes on Netflix, they are skipping episodes and all episodes from each year are not there. They literally went from 1993-2001 with not a whole lot of episodes, they skipped a big portion of years in 2002-2021 like when are they going to update and put more. With the WWE Network we got all of it and this is why I miss the Network even more it was easy to access them. Hopefully Netflix gets on the ball and adds more episodes from each year since Peacock got rid of them.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ltbbfi/wwe_raw_vault/"
    },
    {
        "id": "1lt2lij",
        "author": "spenceryahoo",
        "title": "Creeped Out",
        "content": "I feel as though this show has left most of our minds, it was AMAZING!! What the hell happened to it? Two short seasons and it was over, so upsetting. I rewatch it every couple of months and I’m always left begging for more. I personally think the acting and storylines in each episode are literally just perfect, and the reoccurring character of “The Curious” really just ties together the entire series!",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1lt2lij/creeped_out/"
    },
    {
        "id": "1lta4y7",
        "author": "muskann17",
        "title": "Nowhere movie on Netflix",
        "content": "I just watched the movie Nowhere on Netflix and like wtf I saw a reel about it on Instagram and ig they were praising the movie.. initially i liked the movie but slowly it became unrealistic.. \nI literally puked when I saw her eating the placenta like I know a person can eat anything when they are hungry but placenta???? Seriously? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lta4y7/nowhere_movie_on_netflix/"
    },
    {
        "id": "1lsyb6b",
        "author": "Automatic-Variety429",
        "title": "Weird Netflix Dolby Vision glitch",
        "content": "Hi everyone,\n\nApologies if this isn’t the right place—this issue relates to both Netflix and my TV, so I thought I’d start here.\n\nWhen watching Dolby Vision content on my LG M3 77”, I’ve noticed the overall picture appears quite dark. I understand this has been discussed before, and that the darker image is often a creative choice by the filmmakers rather than a technical limitation—especially with Dolby Vision, which isn’t always used to its full dynamic range. Even in daytime scenes, the average brightness tends to be much lower than standard SDR content.\n\nWhat puzzles me, though, is the contrast between the playback and the scene thumbnails. When scrubbing through scenes, the thumbnails appear much brighter and more vivid—more in line with what I’d expect from HDR content.\n\nHas anyone else experienced this? Is this behaviour down to Netflix, or something to do with how LG handles Dolby Vision?\n\nThank you!",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lsyb6b/weird_netflix_dolby_vision_glitch/"
    },
    {
        "id": "1lsie08",
        "author": "ToonAdventure",
        "title": "Cyberpunk: Edgerunners 2 | Official Teaser | Netflix",
        "content": "",
        "upvotes": 40,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lsie08/cyberpunk_edgerunners_2_official_teaser_netflix/"
    },
    {
        "id": "1ltifa0",
        "author": "Glittering_Mind6771",
        "title": "I want myself convinced to not buy Netflix.",
        "content": "I am trying to not buy Netflix because I have all of the major subscription like Hotstar(Disney plus and hulu), sony liv, Lionsgate Play, Crunchyroll, Prime Video, and so others. I haven't subscribed them individually, I got them with a curator app. Price was cheap. But netflix cost 650 rs/month. I can't find that much of shows or movies on Netflix which I can like sometimes. Just posting this, you can write whatever your opinion is....",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1ltifa0/i_want_myself_convinced_to_not_buy_netflix/"
    },
    {
        "id": "1lsxo9v",
        "author": "nao921",
        "title": "Netflix app on iOS 26 (cannot play title, AVF:11819)",
        "content": "anyone on iOS 26 having issue with Netflix streaming and downloaded title playback?\n\nI understand iOS 26 is still on developer preview and I tried to find a place to report this to Netflix, but all I got from the Netflix help page is to restart the iPhone and it will work.  However it is not the case. I tried to redownload the episode, remove the episode and just stream, it would regularly lead me to avf 11819.\n\nIs there anywhere that I can talk to someone from Netflix or send them details about the issue?\n\nThanks!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lsxo9v/netflix_app_on_ios_26_cannot_play_title_avf11819/"
    },
    {
        "id": "1lsox1p",
        "author": "ChipsnGiggles23",
        "title": "Show I can’t remember the name of",
        "content": "I’m pretty sure it was Netflix and this was years ago, but the scene that really stuck out to me was a husband and wife. We’re having a barbecue of some sort of possibly a birthday party for him and his wife goes to the trunk of his car and finds a second phone in the trunk and that their family friend is having an affair with him she is looking at the phone as well as all of the people in their lives at the party who knew about the affair",
        "upvotes": 8,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1lsox1p/show_i_cant_remember_the_name_of/"
    },
    {
        "id": "1lssn53",
        "author": "Constant_Deal8224",
        "title": "Series Missing!",
        "content": "I was watching supernatural, lost and prison break on netflix and now they are gone. What happened? I am from India . Anybody aware of what is going on?",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lssn53/series_missing/"
    },
    {
        "id": "1lsvmtq",
        "author": "S4v1r1enCh0r4k",
        "title": "'Cyberpunk: Edgerunners' Season 2 Production Confirmed With Haunting New Teaser",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lsvmtq/cyberpunk_edgerunners_season_2_production/"
    },
    {
        "id": "1lsqh19",
        "author": "Sea_Entrepreneur6204",
        "title": "The Last bullet trilogy",
        "content": "I feel this has been buried in Netflix and is a much better action film than the Old Guard. It's Fast and Furious if they stayed with practical stunts and a cops and robbers (vs global super spies) theme. \n\nThe stunt work in this is really so very good it deserves a wider audience and more marketing. ",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lsqh19/the_last_bullet_trilogy/"
    }
]