[
    {
        "id": "1idt8dy",
        "author": "-BVK",
        "title": "Hi /r/movies! We’re Ben Van Kleek, Alaina Huffman, Lincoln Huffman, Trevor Vandelac, and Josh Farnworth - the director, actors, writers, and producers of the movie Jonah. Ask us anything! Back at 5PM EST Friday, Jan 31st to answer your questions.",
        "content": "",
        "upvotes": 69,
        "comments": 110,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/falih1fk86ge1.jpeg?auto=webp&amp;s=e2991be210dc7c4b885413f123a11a767b61a32f"
        },
        "permalink": "/r/movies/comments/1idt8dy/hi_rmovies_were_ben_van_kleek_alaina_huffman/"
    },
    {
        "id": "1ie8p12",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Companion / Dog Man / Hard Truths / September 5)",
        "content": "# New Theatrical Releases\n\n[Companion](https://old.reddit.com/r/movies/comments/1ie56on/official_discussion_companion_spoilers/)\n\n[Dog Man](https://old.reddit.com/r/movies/comments/1ie56s0/official_discussion_dog_man_spoilers/)\n\n[Hard Truths](https://old.reddit.com/r/movies/comments/1ie56wb/official_discussion_hard_truths_spoilers/)\n\n[September 5](https://old.reddit.com/r/movies/comments/1ie56zi/official_discussion_september_5_spoilers/)\n\n[Star Trek: Section 31](https://old.reddit.com/r/movies/comments/1ie5769/official_discussion_star_trek_section_31_spoilers/)\n\n# Still in Theaters\n\n\n[Presence](https://old.reddit.com/r/movies/comments/1i8m8gp/official_discussion_presence_spoilers/?)\n\n[Flight Risk](https://old.reddit.com/r/movies/comments/1i8m8i2/official_discussion_flight_risk_spoilers/?)\n\n[Nickel Boys](https://old.reddit.com/r/movies/comments/1i8m8iz/official_discussion_nickel_boys_spoilers/?)\n\n[One of Them Days](https://old.reddit.com/r/movies/comments/1i36wmw/official_discussion_one_of_them_days_spoilers/?)\n\n[The Brutalist](https://old.reddit.com/r/movies/comments/1i37yra/official_discussion_the_brutalist_spoilers/?)\n\n# Oscar Rewind\n\n[Anora](https://old.reddit.com/r/movies/comments/1ggv4yg/official_discussion_anora_spoilers/)\n\n[A Complete Unknown](https://old.reddit.com/r/movies/comments/1hlsi27/official_discussion_a_complete_unknown_spoilers/)\n\n[The Brutalist](https://old.reddit.com/r/movies/comments/1i37yra/official_discussion_the_brutalist_spoilers/?)\n\n[Conclave](https://old.reddit.com/r/movies/comments/1gbjlm7/official_discussion_conclave_spoilers/)\n\n[Dune: Part Two](https://old.reddit.com/r/movies/comments/1b3jo9s/official_discussion_dune_part_two_spoilers/)\n\n[Emilia Perez](https://old.reddit.com/r/movies/comments/1grn0lz/official_discussion_emilia_p%C3%A9rez_spoilers/)\n\n[Nickel Boys](https://old.reddit.com/r/movies/comments/1i8m8iz/official_discussion_nickel_boys_spoilers/?)\n\n[The Substance](https://old.reddit.com/r/movies/comments/1fl1bpl/official_discussion_the_substance_spoilers/)\n\n[Wicked](https://old.reddit.com/r/movies/comments/1gwxxy1/official_discussion_wicked_part_i_spoilers/)",
        "upvotes": 23,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1ie8p12/official_discussion_megathread_companion_dog_man/"
    },
    {
        "id": "1ifwhft",
        "author": "MarvelsGrantMan136",
        "title": "New Posters for ‘Novocaine’ Starring Jack Quaid",
        "content": "",
        "upvotes": 1453,
        "comments": 279,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/fngmxtd52qge1.jpeg?auto=webp&amp;s=a00d98b6f6ab0cca7d804dc34ba81af6b6e2384c"
        },
        "permalink": "/r/movies/comments/1ifwhft/new_posters_for_novocaine_starring_jack_quaid/"
    },
    {
        "id": "1ifar2y",
        "author": "BunyipPouch",
        "title": "First Poster for Documentary 'Mr Nobody Against Putin' - Premiering to rave reviews this week at Sundance, a Russian teacher secretly documents his school's transformation into a war recruitment center during the Ukraine war, revealing the dilemmas educators face amid propaganda &amp; militarization.",
        "content": "",
        "upvotes": 13233,
        "comments": 266,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/fjipo5gh6kge1.jpeg?auto=webp&amp;s=1331bf6d01ba7510e1b69412333b6b7c7a50cb71"
        },
        "permalink": "/r/movies/comments/1ifar2y/first_poster_for_documentary_mr_nobody_against/"
    },
    {
        "id": "1ift7to",
        "author": "extraextramed",
        "title": "Who Framed Roger Rabbit is 1 of 1",
        "content": "I saw this movie in the theater when I was 7. I finally watched it again today at 42.  \n\nHow did this movie get made?! The talent and creativity in front of and behind the camera. The bravery of studio execs to allow adult themes, alcohol, smoking, sexually suggestive scenes. Inclusion of characters from competing studios/Intellectual properties.\n\nThe animation is art. It's perfectly imperfect. Today it would be CGI. Are there even living animators now who could do this or are these techniques lost to history?\n\nIs there anything else remotely like this? I can't think of anything. I'll be rewatching this tomorrow with my kids and they better damn like it ",
        "upvotes": 448,
        "comments": 144,
        "media": null,
        "permalink": "/r/movies/comments/1ift7to/who_framed_roger_rabbit_is_1_of_1/"
    },
    {
        "id": "1iftz5u",
        "author": "AwfyScunnert",
        "title": "Bourne's better without all the exposition",
        "content": "Excellent video essay from Danny Boyd (CinemaStix)",
        "upvotes": 348,
        "comments": 62,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/as8mlXwEwt3wQD6DlMqYbnOIgCFWQDSX1ry4AnkCrH0.jpg?auto=webp&amp;s=2e24a8c138bb115568910058ab518fd48cfcbd74"
        },
        "permalink": "/r/movies/comments/1iftz5u/bournes_better_without_all_the_exposition/"
    },
    {
        "id": "1ifa6lv",
        "author": "stroll_on",
        "title": "The 37 Best Anti-Fascist Films of All Time",
        "content": "",
        "upvotes": 2986,
        "comments": 233,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/e7lmFuejcHTWcOXdxNwmAgQkjhS-CkzSV0d2K3lh8JM.jpg?auto=webp&amp;s=1138a2578272f4972c9b65499f819213ded766b8"
        },
        "permalink": "/r/movies/comments/1ifa6lv/the_37_best_antifascist_films_of_all_time/"
    },
    {
        "id": "1ifilcv",
        "author": "MarvelsGrantMan136",
        "title": "‘Sleeping Dogs’ Movie Is In Development",
        "content": "",
        "upvotes": 888,
        "comments": 130,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Xi5o4cChPRY17GvwTQ-cFKjZHjwqzOXdHO1yBQzGWng.jpg?auto=webp&amp;s=6a0356c8dbc8b1a11fdc0bfd2cce84f47c42dadc"
        },
        "permalink": "/r/movies/comments/1ifilcv/sleeping_dogs_movie_is_in_development/"
    },
    {
        "id": "1ifpw48",
        "author": "SadAnimator1354",
        "title": "Which was the first movie you watched in theatres?",
        "content": "For me, it was 3 Idiots. Ironically I was three when I went to watch it with my family. It still has a special place in my heart and I can re-watch it any number of times. \n\nIt is one of the few Bollywood movies I actually like, even though I love in India.\n\nI was wondering which movie was your first theatre experience? \n\nDid you like it? Did you hate it? Or do you not remember which movie you watched first at all 😎?\n\nI was hoping if we could also discuss how OTT platforms have us being more selective about which movie we go to watch in theatres now.\n\nI'm really looking forward to hearing your experiences and views!\n\nPeace 🕊️",
        "upvotes": 181,
        "comments": 820,
        "media": null,
        "permalink": "/r/movies/comments/1ifpw48/which_was_the_first_movie_you_watched_in_theatres/"
    },
    {
        "id": "1ifrgtt",
        "author": "eyepatchplease",
        "title": "What movie used \"Other than that Mrs. Lincoln, how was the play?\"",
        "content": "I know this is a saying but I've heard it in a movie and I can not remember which one. I think it was used in response to someone's question—maybe as a non sequitur—but what movie it was in escapes me. I’ve looked online, even on IMDb, but I can’t locate it—probably because of the phrasing.\n\nAnd no, the answer isn't *Lincoln*.",
        "upvotes": 76,
        "comments": 28,
        "media": null,
        "permalink": "/r/movies/comments/1ifrgtt/what_movie_used_other_than_that_mrs_lincoln_how/"
    },
    {
        "id": "1if7crm",
        "author": "RandomConnections",
        "title": "Movies that teased sequels that never happened",
        "content": "Just watched Uncharted (2022) with Tom Holland and Mark Wahlberg.  It's total check-your-brain-at-the-door escapism.  I noticed that in the pre- and mid-credit scenes they teased more adventures for the characters, but as far as I know a sequel is not in the works for this movie based on a video game.\n\nThe same thing happened with The Man from U.N.C.L.E (2015) with Henry Cavill.  Further adventures were teased in the credits, but no sequel happened.\n\nI know there are multiple reasons why this happens.  The movie is a flop, or its stars movie on to bigger and better projects.  I'm just wondering what other movies teased sequels that just never happened.\n\nNOTE:  As many have mentioned, there is a sequel for Uncharted in the works that I somehow missed.  It sparked the initial question, which is still valid.",
        "upvotes": 1579,
        "comments": 1927,
        "media": null,
        "permalink": "/r/movies/comments/1if7crm/movies_that_teased_sequels_that_never_happened/"
    },
    {
        "id": "1ify9vx",
        "author": "LuinAelin",
        "title": "Do you feel sometimes movies try to over explain something?",
        "content": "I feel it's fairy common for movies to want to explain the source of something, explain why it's happening etc even in something that's supposed to be more fantastical.\n\nTake Groundhog Day. I think the movie is better because it doesn't tell us why he's stuck in the time loop. Because we don't need to know. And it's not the story.\n\nBut today they may show us the reason why he's stuck in the loop..",
        "upvotes": 20,
        "comments": 51,
        "media": null,
        "permalink": "/r/movies/comments/1ify9vx/do_you_feel_sometimes_movies_try_to_over_explain/"
    },
    {
        "id": "1ifcbc9",
        "author": "KillerCroc1234567",
        "title": "Dylan O’Brien Pic ‘Twinless’ Becomes Second Movie To Be Pulled From Sundance Streaming Site Due To Piracy",
        "content": "",
        "upvotes": 680,
        "comments": 64,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/o_pJw4nlx_aKf8aTJpylf8xr7-LIqyD3k7mKaJ5VhK0.jpg?auto=webp&amp;s=e459a2bd2d6f4420974a5578dcac0339843619ac"
        },
        "permalink": "/r/movies/comments/1ifcbc9/dylan_obrien_pic_twinless_becomes_second_movie_to/"
    },
    {
        "id": "1ifyq1v",
        "author": "MrNostaforta",
        "title": "I just finished watching 'Shoah' (1985). A special documentary recommendation.",
        "content": "Besides the things everyone who is familiar with this documentary knows, for example the editing style, Claude Lanzmann wanting to keep it as unedited as possible, pauses in sentences are still included, most of the time accompanied by footage of what the concentration camps look like 'now' (as in the time it was filmed).\n\nThe documentary was filmed in a course of 11 years, it was released in '85, meaning that probably the majority of the interviews take place in the '70's.\n\nThe documentary primarily consists of Claude Lanzmann asking the questions, the translator translating it to the people who are being asked these questions, in their own language, followed by the translator translating the answers to French so that Lanzmann can understand them.\n\nThe documentary shows a side of the Shoah which is not being teached in schools, not even where it all happened, which is Poland and countries surrounding it.\n\nSurvivors, train conductors, the people who ordered the trains, the people who organized it... even the SS officers are interviewed (in the case of the SS-officers, partially 'attempted' being interviewed') in this documentary.\n\nThe survivors, one of such cases being 'Richard Glazar', a Chzech-Jewish man who was part of the 'Sondercommando' in Trablinka, a concentration camp in Poland, described in detail what he had done there. After the documentary, Glazar ultimately committed suicide after his wife died.\n\nListening to these stories creates a motion picture in your mind, one which is, based on the details being told, way more graphic and terrifying than any story you hear in school, way more terrifying than can be told in movies, because these are the people that survived this, whom you are listening to.\n\nThe SS-officers are a hard pill to swallow too, knowing that these people did initially not know what would happen to the jews (being the volunteer officers in the concentration camps), one of whom is 'Franz Suchomel', who explains in detail what is role was, and what he had seen before, during and after the moments the jews were gassed.\n\nOne thing that stood out to me about 'Franz Suchomel', is that he deliberately asked Lanzmann not to use his full name in the documentary, though Lanzmann did, for 'Franz Suchomel' died in 1979, 6 years before the documentary was released, and 12 years after he was released from prison, due to accessory to murder.\n\nThere are more cases of unique stories in this 9' and a half hour documentary, which will bound to change your view of Shoah (the holocaust), no matter how much you think you know about it.",
        "upvotes": 12,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1ifyq1v/i_just_finished_watching_shoah_1985_a_special/"
    },
    {
        "id": "1ifvnm4",
        "author": "throwawabud",
        "title": "Mads Hedegaard Had to Invent New Languages for Stone Age Epic ‘Stranger’",
        "content": "",
        "upvotes": 16,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3EY3k2elAP2dZ0E-AJUyPr_qxI07016EwtZ20mygl1o.jpg?auto=webp&amp;s=c20cb578b5d1f617bec3f3b07a964959b3712469"
        },
        "permalink": "/r/movies/comments/1ifvnm4/mads_hedegaard_had_to_invent_new_languages_for/"
    },
    {
        "id": "1ifcitg",
        "author": "Chowdahead",
        "title": "How to watch all of the 2025 Best Picture Oscar nominees",
        "content": "I found this article pretty helpful, but at the same time it clearly demonstrates how frustrating it is to be a movie goer in the post-Covid, fragmented, cord-cutter world that we currently find ourselves living in.",
        "upvotes": 296,
        "comments": 42,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/K-UJCw6Bb0VeQaYlR4DB7H-rRdsr1zleEEi4Z84fuBw.jpg?auto=webp&amp;s=ec1c67dd380167c0b21a5295e4e86c8c22d2f14f"
        },
        "permalink": "/r/movies/comments/1ifcitg/how_to_watch_all_of_the_2025_best_picture_oscar/"
    },
    {
        "id": "1iexk7k",
        "author": "flashbang_out",
        "title": "Constantine [2005] Finally watched, holy shit was Peter Stormare amazing as Satan",
        "content": "The movie? It's good. Maybe even great. I definitely had a lot of fun watching it.I understand the complaints, sure, it's not perfect, but overall, it's a solid flick.\n\nWhat elevates it to amazing? Peter Stormare.\n\nHoly crap he gave the best satan performance I have ever seen. I was just completely glued to the TV the few minutes he was on screen. I don't know what it was, but something about him just gave off such an evil, conniving, terrifying monster vibe.",
        "upvotes": 3957,
        "comments": 383,
        "media": null,
        "permalink": "/r/movies/comments/1iexk7k/constantine_2005_finally_watched_holy_shit_was/"
    },
    {
        "id": "1if948n",
        "author": "TheKillingJoke1991",
        "title": "American Pie’s Understated Wholesomeness",
        "content": "Audiences have come to know the original American Pie series as an example of teen comedy revivalism that relies on crude humor to do most of the heavy lifting. I don’t really want to get into whether the humor or the manner of tackling certain subjects still holds up to this day. Personally I want to take this moment to highlight an ingredient which, in my humble opinion, is essential to the charm of the original series – I’m going to ignore the spin-offs here – and that is its subtle, but effective wholesomeness. \n\n Deep down American Pie 1 &amp; 2 in particular are movies about growing up, overcoming, learning and moving forward. The common thread throughout all of this is the search for and the preserving of a human connection, whether it’s a lifelong friendship or a family relationship. The characters, as immature as they may be, all stumble along the way but in the end find out that the world has other and better things in store for them than what they thought they were looking for in the beginning. It’s almost as if these movies when all is said and done do want to convey a message: you’re an ignorant kid who’s going to mess up and growing up you will continue to mess up, but you’ll learn and you’ll always have your friends and your family to learn from and they will always learn along with you.\n\n Adding to this is the fact that there seems to be a genuine chemistry between the cast members, which includes both the main as well as the side characters. To top it off the original movies serve up a nostalgic soundtrack that reminds me – and I do realize that I am showing my age here – of a time where the world at least seemed to be a much more hopeful and optimistic place. \n\n Maybe the jokes didn’t age well. Maybe the way these movies go about certain specific subjects didn’t age well. Be that as it may, there’s one thing to me that definitely does hold up. A quality that is missing from the vast majority of movies of that ilk which came out at the time: a nostalgic comforting heart. \n\n To the next step! ",
        "upvotes": 331,
        "comments": 151,
        "media": null,
        "permalink": "/r/movies/comments/1if948n/american_pies_understated_wholesomeness/"
    },
    {
        "id": "1if9s77",
        "author": "Extension_Debt_2944",
        "title": "Sophie Thatcher in Control: The ‘Yellowjackets’ Star on ‘Companion’ and How the Film’s Toxic Relationship Goes ‘Far Deeper Than I Ever Imagined’",
        "content": "Thought this interview was super interesting and got into the psyche of this excellent film. Particularly interested in this part about her m bringing her real life into it:\n\n“I think me being nervous about it all worked, because she was so eager, and I find myself in relationships that way. Watching it the first time I was embarrassed for myself, because the character just wants to be loved. It felt desperate in a way that I haven’t done before, but I always see myself in roles.”",
        "upvotes": 278,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zN4q3raP1TgGLk8I08Qo0WoYP_ECPsIdwj_ZA3YK66Y.jpg?auto=webp&amp;s=1da1f0a58ac6f01327ef4d0a1e06ed200255e96d"
        },
        "permalink": "/r/movies/comments/1if9s77/sophie_thatcher_in_control_the_yellowjackets_star/"
    },
    {
        "id": "1ifnpoa",
        "author": "LiteraryBoner",
        "title": "Official Discussion - You're Cordially Invited [SPOILERS]",
        "content": "#Poll\n\n**If you've seen the film, please rate it [at this poll](https://strawpoll.ai/poll/vote/aFt9Kvv0P1OW)**\n\n**If you haven't seen the film but would like to see the result of the poll [click here](https://strawpoll.ai/poll/results/aFt9Kvv0P1OW)**\n\n#Rankings\n\n[Click here](https://strawpoll.ai/list/ZPi3H5nAwrkj) to see the rankings of 2024 films\n\n[Click here](https://youpoll.me/list/4/) to see the rankings for every poll done\n\n---\n**Summary:**\n\nWhen two weddings are double-booked at the same venue, the father of one bride and the sister of the other bride try to preserve the wedding weekend.\n\n**Director:**\n\nNicholas Stoller\n\n**Writers:**\n\nNicholas Stoller\n\n**Cast:**\n\n* Will Ferrell as Jim\n* Reese Witherspoon as Margot\n* Geraldine Viswanathan as Jenni\n* Meredith Hagner as Neve\n* Jimmy Tatro as Dixon\n* Stony Blyden as Oliver\n\n**Rotten Tomatoes:** [47%](https://www.rottentomatoes.com/m/youre_cordially_invited)\n\n**Metacritic:** [52](https://www.metacritic.com/movie/youre-cordially-invited/)\n\n**VOD:** Amazon Prime",
        "upvotes": 26,
        "comments": 30,
        "media": null,
        "permalink": "/r/movies/comments/1ifnpoa/official_discussion_youre_cordially_invited/"
    },
    {
        "id": "1ifaojk",
        "author": "indiewire",
        "title": "Remember the Lighter Side of David Lynch with His Slapstick Short ‘The Cowboy and the Frenchman’",
        "content": "",
        "upvotes": 163,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fQjfddtfPzOEb_M4Vkk11TeTQY_BnEIUZLKkXFl93Lg.jpg?auto=webp&amp;s=edc5fe60640d119fa3f5aee0a6749ca8eb1259e4"
        },
        "permalink": "/r/movies/comments/1ifaojk/remember_the_lighter_side_of_david_lynch_with_his/"
    },
    {
        "id": "1ifu1qv",
        "author": "_Everythingisokay",
        "title": "I just finished minari...",
        "content": "It's so beautiful, I loved everything about it, and the quiet ending. I just feel like the ending leaves a lot to thought, and Jacob and David picking up the Minari was a quiet, short conclusion that speaks 1000 words. \n\nI randomly cried during the scene where David goes to his friends house and I thought it was gonna be a perfect environment and he'll want to stay there a while, an environment where the kid is spoilt, but the scene with the dad where he says \"tell mom I was home all night okay?\" Just meant so much behind everything.",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1ifu1qv/i_just_finished_minari/"
    },
    {
        "id": "1ig1hhp",
        "author": "Frank_and_Beanz",
        "title": "Question about the ending to Family Plot (1976).",
        "content": "So I just got done watching it. Pretty fun caper that started with more intrigue than I ended up caring for in the end really. But still entertaining.\n\nNow the final shot see's Barbara Harris' Blanche character break the fourth wall and wink to the camera after she miraculously finds the diamond in the house, with her partner exclaiming that she did it, she's indeed a real psychic!\n\nWhat is your takeaway from this? Is she winking because she knows she's always actually been psychic, or is she winking to us because she's not, and found out where it was by other means (perhaps overhearing the other two discussing it).\n\nI don't believe we're ever shown her finding out about it on screen, maybe I'm wrong and if so let me know. Otherwise those are the two options. Either way that wink is iconic for me and I loved Barbara's performance.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1ig1hhp/question_about_the_ending_to_family_plot_1976/"
    },
    {
        "id": "1iei652",
        "author": "BunyipPouch",
        "title": "Oscar Nominated Donald Trump Biopic 'The Apprentice' Returning To Theaters Starting February 7",
        "content": "",
        "upvotes": 9292,
        "comments": 494,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/tljalnNED5tZ-BO1SBL7KQTfdckiWlfAcCFEZuPY_z8.jpg?auto=webp&amp;s=08feba73e9a53aa4c51daba9972c69a6bb997ab7"
        },
        "permalink": "/r/movies/comments/1iei652/oscar_nominated_donald_trump_biopic_the/"
    },
    {
        "id": "1ig0xm9",
        "author": "One-Dragonfruit6496",
        "title": "The Letterboxd Oscars Indian Edition 2025",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rHXAZ0cI8M80uKT9uByEUFa83AgYG3wRNLtMaZ8UfmA.jpg?auto=webp&amp;s=844b685358ca2b40ad20fce31313f209fb89a770"
        },
        "permalink": "/r/movies/comments/1ig0xm9/the_letterboxd_oscars_indian_edition_2025/"
    },
    {
        "id": "1ig0ep9",
        "author": "Bennett1984",
        "title": "Batman Begins, V for Vendetta, Lady Vengeance and the Essential Action Movies of 2005",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zKz5WxrQNja2MaSWP4ABsNcLGwIr60X7vSwSQ2YPfzg.jpg?auto=webp&amp;s=7f988186703e7e1bb2bfb353bbdfea72495cafe9"
        },
        "permalink": "/r/movies/comments/1ig0ep9/batman_begins_v_for_vendetta_lady_vengeance_and/"
    },
    {
        "id": "1ifku45",
        "author": "Acceptable_Class_576",
        "title": "The (New) Dark Knight &amp; shared movie names",
        "content": "So Uwe Bol is making a new movie with Armie Hammer titled The Dark Knight. I've always found it strange when movies recycle names. So I decided to post a (nonexhaustive) list of famous movies that share a name with another major release that is not as well known. This is actually a phenomenom I've thought about alot over the years. \n\n1. Running Scared- Classic 80's comedy starring Billy Crystal and Gregory Hines vs. 2006 Paul Walker action movie.\n\n2. Gladiator- Early 90s boxing movie starring a young Cuba Gooding Jr vs. Russell Crowe's Oscar-winning sword and sandal epic.\n\n3. Catch Me if You Can- 80s B-movie about high school drag racer* vs. Steve Speilberg movie with Tom Hanks and Leonardo Dicaprio.\n\n4. Bad Boys- One of Sean Penns first starring roles vs Will Smith/Martin Lawrence franchise starter.\n\n5. Project X- Matthew Broadrick and Helen Hunt in a movie about the Air Force experimenting on chimps vs. A house party goes WAY overboard.\n\n6. The Rookie- Clint Eastwood, Charlie Sheen, Raul Julia cop movie vs. Dennis Quad baseball biopic. \n\n7. Man of the House- Chevy Chase comedy with JTT vs Tommy Lee Jones comedy.\n\n8. Bad Company- Sexy spy thriller with Lawrence Fishbourne and Ellen Barkin vs. Chris Rock CIA comedy.\n\n9. Crash- Controversial James Spader movie about car crash fetiches vs Controversial Oscar-winner about racism. \n\n10. Hot Pursuit- 80s John Cusack comedy with Ben Stiller and his father Jerry as villains vs. Reese Witherspoon/Sonia Vergara comedy.\n\n\nI know there are other examples of this. Any other ones that standout.\n\n*Not a major release but a movie I really loved as a kid.\n \n\n",
        "upvotes": 17,
        "comments": 23,
        "media": null,
        "permalink": "/r/movies/comments/1ifku45/the_new_dark_knight_shared_movie_names/"
    },
    {
        "id": "1ies02y",
        "author": "MarvelsGrantMan136",
        "title": "Himesh Patel, Elliot Page, Bill Irwin &amp; Samantha Morton Join Christopher Nolan’s ‘The Odyssey’",
        "content": "",
        "upvotes": 1806,
        "comments": 312,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kzkoiG6m0vOZfhnrJJCqt7k9plJY85-eWYtdpIDDtKA.jpg?auto=webp&amp;s=30d715db641127a38ab789ecf34545a50f973634"
        },
        "permalink": "/r/movies/comments/1ies02y/himesh_patel_elliot_page_bill_irwin_samantha/"
    },
    {
        "id": "1ifnjxb",
        "author": "Ok_Commercial_3759",
        "title": "Best horror/thriller shows to watch with my mom?",
        "content": "I’m 20 years old and my mom is 54, we both love watching horror movies and shows in fact we already got tickets to the new “Heart eyes” film coming out next week. She doesn’t like paranormal stuff other than classics like (ghostbusters, the shining, poltergeist) she is more into slasher, thriller type movies, and more supernatural alien stuff, (she loves alien/predator films as well) Are there any shows you’d recommend for us to watch? And yes we’ve seen the walking dead so many people recommend that and that’s I’ll I hear. She doesn’t have a problem with gore or anything as well. ",
        "upvotes": 10,
        "comments": 33,
        "media": null,
        "permalink": "/r/movies/comments/1ifnjxb/best_horrorthriller_shows_to_watch_with_my_mom/"
    },
    {
        "id": "1if75n8",
        "author": "infectiondepression",
        "title": "Your top 3 movies from 90’s &amp; early 00’s",
        "content": "I’d like to know your top 3 or recommendations for any genre, that is worth to watch.  \n\nI was a child in 90’s so I’m sure I have missed out on some hidden gems that are “must.. \n\nSome of my favs are things like Dogma, Clerks, The Crow, Blade, Chocolat, Fear and loathing in las vegas, Snatch, Airheads, American beauty, misery and much more.. \n\nGive me something good! \n\nThanks :) \n\nEdit:\nI was expecting 3-4 comments. But woa, I’ll have to create a list of movies I haven’t seen.  Thank you all! Great taste I have to say! ",
        "upvotes": 95,
        "comments": 284,
        "media": null,
        "permalink": "/r/movies/comments/1if75n8/your_top_3_movies_from_90s_early_00s/"
    },
    {
        "id": "1ifbbdz",
        "author": "Relevant-Chapter-571",
        "title": "House at the End of the World (2025) horror claymation",
        "content": "",
        "upvotes": 50,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TbSeVmcQXgYpIk9HTPIIsbT4cjklHWxPNVsqljRYmec.jpg?auto=webp&amp;s=d6a16ce87893fe80dff6bb9e066b7b92a1af29b7"
        },
        "permalink": "/r/movies/comments/1ifbbdz/house_at_the_end_of_the_world_2025_horror/"
    },
    {
        "id": "1iejjhk",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'The Monkey'",
        "content": "",
        "upvotes": 4164,
        "comments": 272,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/sh29f27u1dge1.jpeg?auto=webp&amp;s=f5b4738d92787a55c14a05adb0bda4bc9e304ec5"
        },
        "permalink": "/r/movies/comments/1iejjhk/new_poster_for_the_monkey/"
    }
]