[
    {
        "id": "1h6hgis",
        "author": "Werewolves-AMA",
        "title": "hi r/movies. I’m Steven C Miller and I directed WEREWOLVES from Briarcliff Entertainment, and starring Frank Grillo. It's out in theaters nationwide this weekend. I'll be back at 3PM PT/6 PM ET today to answer your questions. Ask me anything in the meantime!",
        "content": "",
        "upvotes": 105,
        "comments": 118,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/j7q3q4qteu4e1.png?auto=webp&amp;s=6012b27d5f2ab32b584a11bfe10b35b9d50adb20"
        },
        "permalink": "/r/movies/comments/1h6hgis/hi_rmovies_im_steven_c_miller_and_i_directed/"
    },
    {
        "id": "1h5qer4",
        "author": "BunyipPouch",
        "title": "Join us Thursday 12/5 at 3:00 PM ET for a live AMA/Q&amp;A with Kyle Mooney, director and writer of A24's upcoming comedy-horror 'Y2K' - On the last night of 1999, two high school juniors crash a New Year's Eve party, only to find themselves fighting for their lives when Y2K becomes a reality.",
        "content": "",
        "upvotes": 91,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/j3w2ujnimn4e1.png?auto=webp&amp;s=aacea9a11f96dac3412318e9824037399eecfa3a"
        },
        "permalink": "/r/movies/comments/1h5qer4/join_us_thursday_125_at_300_pm_et_for_a_live/"
    },
    {
        "id": "1h6xtok",
        "author": "PumpkinCarvingisFun",
        "title": "What's a role that rubbed off on an actor/actress and permanently changed their personality off screen?",
        "content": "For example, Kumail Nanjiani seems very different post Eternals. Someone pointed out in a different thread that Gary Sinise devoted a large part of his life to veterans after Forest Gump. Seems like some actors are changed by the experience of playing a role or potentially event the personality of the character they brought to life. ",
        "upvotes": 2652,
        "comments": 1204,
        "media": null,
        "permalink": "/r/movies/comments/1h6xtok/whats_a_role_that_rubbed_off_on_an_actoractress/"
    },
    {
        "id": "1h6gz1t",
        "author": "lawrencedun2002",
        "title": "Netflix Developing John Cena and Eric Andre Comedy Film ‘Little Brother’",
        "content": "",
        "upvotes": 4253,
        "comments": 259,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hs6Gf1AkmKDwFeCEDv-ahrAuumhZMl8X4XwW-7_ZF0Q.jpg?auto=webp&amp;s=67d729193c324b6b494ff08b5a61d26eff7b475e"
        },
        "permalink": "/r/movies/comments/1h6gz1t/netflix_developing_john_cena_and_eric_andre/"
    },
    {
        "id": "1h6qgaw",
        "author": "West_Conclusion_1239",
        "title": "Who do you think is the greatest living male actor working today under 65 years old??",
        "content": "If we remove from the conversation the usual candidates for the title.\n\nAnthony Hopkins (87 years)\n\nAl Pacino (84 years)\n\nRobert DeNiro (81 years)\n\nDenzel Washington (70 years)\n\nWillem Dafoe (69 years)\n\nTom Hanks (68 years)\n\nDaniel Day-Lewis (67 years)\n\nGary Oldman (66 years)\n\nWho do you think is the greatest living male actor working today under 65 years old??",
        "upvotes": 826,
        "comments": 1882,
        "media": null,
        "permalink": "/r/movies/comments/1h6qgaw/who_do_you_think_is_the_greatest_living_male/"
    },
    {
        "id": "1h6yxzc",
        "author": "misterdhm",
        "title": "What particularly violent scene from an already violent movie really messed you up, or stuck with you over the years?",
        "content": "Every now and then people talk about gnarly scenes that kind of come out of nowhere (like that one near the end of Bone Tomahawk) but what about scenes from movies that are already violent, but stand out anyway? For example, there's a brief bit in the Michael Bay movie 13 Hours where three dudes in a street get absolutely dismantled by a machine gun firing from the back of a pickup truck. It's quick, only about one second, but it stuck with me for a long time after watching the movie. Something about seeing those guys just fall apart has never really left my mind, even though the whole movie is pretty violent and has plenty of other gut-wrenching scenes. Another one that seems to be permanently implanted in my mind is in Saving Private Ryan, when they are storming the beach and a guy gets his entire face blown away. All that's left is a concave hole. Even in a movie as violent as SPR, that one brief bit has always stuck with me.\n\n\nI mean, I've seen lots of violent movies (including all the Saw films) but somehow there's scenes like this that really hit hard and I'm not sure why. Wondering if anyone else has anything similar.",
        "upvotes": 245,
        "comments": 858,
        "media": null,
        "permalink": "/r/movies/comments/1h6yxzc/what_particularly_violent_scene_from_an_already/"
    },
    {
        "id": "1h6su00",
        "author": "BunyipPouch",
        "title": "‘Being Maria’, Starring Matt Dillon as Marlon Brando During Controversial ‘Last Tango in Paris’ Film Shoot, Secures U.S. Distribution Deal With Kino Lorber - The movie charts the turbulent life and career of the late French actress Maria Schneider (played by Anamaria Vartolomei).",
        "content": "",
        "upvotes": 450,
        "comments": 42,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mgSIR11i0JrgFnoWU-Lbymd2bSdXGOtpoaM4MA26aaU.jpg?auto=webp&amp;s=127f26af0e57ad8c9a6af25ecfaade8ae36b13f0"
        },
        "permalink": "/r/movies/comments/1h6su00/being_maria_starring_matt_dillon_as_marlon_brando/"
    },
    {
        "id": "1h6rslg",
        "author": "NoCulture3505",
        "title": "Sam Richardson Latest To Join Apple’s Live-Action ‘Matchbox’ Movie",
        "content": "",
        "upvotes": 384,
        "comments": 74,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YsgzMNxERR19kI7EPkX5xj70-c8egBAv6lt2h_qTO7s.jpg?auto=webp&amp;s=209545d7ffaabf849fe3f4d4c715ae9f91113860"
        },
        "permalink": "/r/movies/comments/1h6rslg/sam_richardson_latest_to_join_apples_liveaction/"
    },
    {
        "id": "1h70ke1",
        "author": "DryTown",
        "title": "Gangs of New York revisted",
        "content": "I watched Gangs of New York tonight. I hadn’t seen this movie since it first came out in the theater 20+ years ago. Aside from a few stunning visual images, I didn’t remember anything about it.\n\nHoly hell, is this movie riveting. It really strikes me as a spiritual counterpart to the Departed. The tension the story builds about an imposter or infiltrator trying not to be discovered keeps you glued to the screen.\n\nLeonardo DiCaprio seems to thrive in that role - the infiltrator. Theres something about the  intensity of his eyes and face while taking orders - he listens intently while his body seems to be aching to lunge forward and attack.\n\nDaniel Day Lewis of course is Daniel Day Lewis. Bill the Butcher is one of the great bad guys in cinema. He portrays that character so well that he humanizes the nativist backlash and gives us tremendous empathy. But we also agree he needs to die.\n\nWe’ve all heard stories about DDL being very method, getting himself in a character and refusing to break it on set or during the duration of filming, often treating costars and crew members badly in the process. I normally think this kind of process is a bit excessive, but Bill the Butcher makes me think that sometimes, the ends justify the means and that a piece of art so enduring may warrant some temporary suffering.\n\nOne of his killings (and you’ll know it when you see it) gave me one of most audible gasps that I’ve ever had watching something. Maybe season 2 episode 1 of House of Cards came close).\n\nThe production design is incredible. As a history lover, seeing a pre-automobile major city brought to life is magical. I wish I could step into it and walk among the filthy streets.\n\nIf you have never seen this film, or, like me - haven’t seen it in years. Check it out. I’m interested i hearing what others think.",
        "upvotes": 112,
        "comments": 79,
        "media": null,
        "permalink": "/r/movies/comments/1h70ke1/gangs_of_new_york_revisted/"
    },
    {
        "id": "1h6r2v4",
        "author": "KillerCroc1234567",
        "title": "Sienna Miller Joins ‘Jack Ryan’ Movie at Amazon",
        "content": "",
        "upvotes": 403,
        "comments": 76,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/d8tv42CVmQdziS3edc970AbQdTW2fNAjr5x47uw8_oE.jpg?auto=webp&amp;s=cffa4fd66d397654bb979d1211cc6f2674fd6163"
        },
        "permalink": "/r/movies/comments/1h6r2v4/sienna_miller_joins_jack_ryan_movie_at_amazon/"
    },
    {
        "id": "1h6l2rc",
        "author": "MarvelsGrantMan136",
        "title": "Jorma Taccone To Direct 'DNA' Comedy For Searchlight Pictures Starring Ben Schwartz &amp; Sam Rockwell",
        "content": "",
        "upvotes": 505,
        "comments": 56,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FTqK_dlRWq3XxjJgZHm6p1Ne-HYGKH0yT-o4pYT3MUQ.jpg?auto=webp&amp;s=897f0355f48aa56f7a8aec249de532d08fcd36d6"
        },
        "permalink": "/r/movies/comments/1h6l2rc/jorma_taccone_to_direct_dna_comedy_for/"
    },
    {
        "id": "1h70ikk",
        "author": "swellfella",
        "title": "Dark comedy ‘A Different Man’ surprisingly triumphs at Gotham Awards",
        "content": "",
        "upvotes": 55,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/k07UPhw0e4VLizFjC5HCU8rw_UP6zoUhcstYTbdfEZY.jpg?auto=webp&amp;s=1c0d04679e5ec6ae53e673c764a19136abdfc2c4"
        },
        "permalink": "/r/movies/comments/1h70ikk/dark_comedy_a_different_man_surprisingly_triumphs/"
    },
    {
        "id": "1h6zkgj",
        "author": "goldentrunk",
        "title": "Can someone please give the vocabulary to express something that I've been observing in movies?",
        "content": "Hello! I'm gonna try to make this quick and express myself as clearly as possible. How come some movies (those that rely a lot on CGI and built sets) look gorgeous while others look horrendous, but it's not necessarily a case of the bad ones looking that unrealistic?\n\nFor example: Dune (both parts), Poor Things, the Lord Of The Rings trilogy, MCU pre-Age Of Ultron, etc, all fill me with a sense of wonder and awe, like I could actually go to those worlds and walk around there, while Disney's live-action remakes, Wicked (2024), Wonka (2023), MCU post-Age of Ultron, etc, all look plastic-y and border on uncanny valley. It's like they're rendered too colorful and too dull at the same time, making them lack life or something.\n\nWhat is that? Does anyone else get that feel? What are the words to describe this distinction? Because every time I talk about it I don't get the sense that people actually see what I mean, since I'm not solely talking about the cinematography, I don't think, it's more of a *feeling* of emptiness and fakeness.\n\nEdit: obviously \"give *me* the vocabulary,\" I typed out the title too fast",
        "upvotes": 47,
        "comments": 36,
        "media": null,
        "permalink": "/r/movies/comments/1h6zkgj/can_someone_please_give_the_vocabulary_to_express/"
    },
    {
        "id": "1h6py76",
        "author": "AvatarDang",
        "title": "What recent movies will be seen as must-watch classics 20-30 years from now?",
        "content": "Are there any movies from say…the last 10-15 years that have come out that you guys think will be considered must-watch classics 20ish years from now? Do you think that they’ll have the same rewatch-ability/lasting impact like movies in the past?\n\nI’m thinking of movies like Godfather, Titanic, Jurassic Park, Breakfast Club, Wizard of Oz, The Shining, etc etc. Movies that my parents would consider the best of the best of their generation. And most have had a lasting impact in cinema and stood the test of time. \n\nWe’ve had a lot of big titles that made a lot of money, but it has me wondering what will stay relevant years from now, movies that we show our kids and future generations will still love. ",
        "upvotes": 133,
        "comments": 471,
        "media": null,
        "permalink": "/r/movies/comments/1h6py76/what_recent_movies_will_be_seen_as_mustwatch/"
    },
    {
        "id": "1h6qeej",
        "author": "Plenty-Spell-3404",
        "title": "Which Robin Williams movies are your favourites?",
        "content": "In remembrance of Robin Williams, who departed from us 10 years ago, I’m interested to know which of his films are some of your personal favorites.   \n  \nHe had accomplished a great deal, including Jack, RV, Mrs. Doubtfire, Jumanji, Popeyes, Good Morning Vietnam and many more aside from those mentioned here.   \n  \nIf I had to choose one for myself, I truly appreciated his performance in Mrs. Doubtfire. There is no question he was legendary in that film. This is something I would watch again and again.   \n  \nWhat about the rest of you? Which Robin Williams films do you enjoy the most?",
        "upvotes": 124,
        "comments": 348,
        "media": null,
        "permalink": "/r/movies/comments/1h6qeej/which_robin_williams_movies_are_your_favourites/"
    },
    {
        "id": "1h6r6ru",
        "author": "indiewire",
        "title": "Amy Adams Talks 'Nightbitch' and Exploring Her Edge",
        "content": "",
        "upvotes": 102,
        "comments": 26,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fTRLJMdEKd6O5t5-Xoox-c4s4-n3d5NS1IsC5NeWV78.jpg?auto=webp&amp;s=0cac5ed96369374ceadd1ea244832efdf08c47d3"
        },
        "permalink": "/r/movies/comments/1h6r6ru/amy_adams_talks_nightbitch_and_exploring_her_edge/"
    },
    {
        "id": "1h6n4n9",
        "author": "Jamey4",
        "title": "Which Jeff Bridges movies are your favorites?",
        "content": "In honor of Jeff Bridges' 75th birthday today, I'm just curious to hear some of your personal favorite movies he has starred in. \n\nHe's done quite a lot over the *many* decades he's been in the movies. True Grit, Starman, Iron Man, Tron and Tron Legacy, Crazy Heart, The Big Lebowski, and so many more beyond just those listed here.\n\nIf I had to pick one personally, I really enjoyed his work in Tron: Legacy. He was no doubt iconic in The Big Lebowski of course, but I think his role as an older Kevin Flynn in Tron Legacy is something I always look forward to every single time I go and rewatch the movie.\n\nWhat about all of you? What are some of your favorite Jeff Bridges movies?",
        "upvotes": 125,
        "comments": 329,
        "media": null,
        "permalink": "/r/movies/comments/1h6n4n9/which_jeff_bridges_movies_are_your_favorites/"
    },
    {
        "id": "1h74fpu",
        "author": "outremer_empire",
        "title": "Hugh Grant &amp; Nicholas Hoult Reunite 21 Years After 'About a Boy' | Vanity Fair",
        "content": "",
        "upvotes": 11,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GTsyT_4GaNl703S1vmTul8vbpmUOPq-_HH-96Ka4488.jpg?auto=webp&amp;s=6998bd3d9f6d01c379050ead088b63ef46c231da"
        },
        "permalink": "/r/movies/comments/1h74fpu/hugh_grant_nicholas_hoult_reunite_21_years_after/"
    },
    {
        "id": "1h5x8cr",
        "author": "MarvelsGrantMan136",
        "title": "‘The Mandalorian &amp; Grogu’ Has Wrapped Filming, Releases May 2026",
        "content": "",
        "upvotes": 7255,
        "comments": 1097,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NEmIU0DRJWDIikGBUaSTXbrw3egmC5h5evBavuE8K_w.jpg?auto=webp&amp;s=ff79298ccb825b220fc57b30dae785d4b83d179b"
        },
        "permalink": "/r/movies/comments/1h5x8cr/the_mandalorian_grogu_has_wrapped_filming/"
    },
    {
        "id": "1h73vyc",
        "author": "AbyssalRaven_GaeAva",
        "title": "What is this movie called?",
        "content": "Hi, i remember watching this movie when I was younger and have been revisting old movies i watched, however though i don't remember the name and can't remember much on the plot. What i do remember is this; A family moves to the countryside , the brother is the protagonist, they move out to this out house in the middle of the woods, the house however had strange rocks lined up in a circle around the house. Over time, the family notices jars of honey to be missing or have eaten crackers. The brother eventually follows the trail and goes up, I think a freight elevator up to the attic. Surprisingly, the attic was a makeshift lab to previous owner with books of study and butterflies pinned to the walls. The brother who has a looking glass kind of item finds out that the person who was eating all the honey and crackers was a small little person barely any bigger than a rat who has anger issues. The entity was the roommate/pet to the previous owner and had a huge secret or something and so put up a protective ward (the circle of rocks) to prevent a troll king or something. That is all that i can remember. Please tell me the name if someone knows. ",
        "upvotes": 8,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1h73vyc/what_is_this_movie_called/"
    },
    {
        "id": "1h6by20",
        "author": "IamBecomeZen",
        "title": "How did Nice Guys (2016) make me nostalgic for a time when I wasn't even alive?",
        "content": "Just finished watching it and I loved it. I'm really puzzled how it didn't do so good at the box office and because of that didn't get a sequel. \n\nBut what really interests me the most is how in the heck did they manage to invoke the feeling of nostalgia for me? I'm not from LA and I was born in 99 (the movie is set in late 70s Los Angeles). \n\nYet throughout the entire movie I felt nostalgic?",
        "upvotes": 397,
        "comments": 109,
        "media": null,
        "permalink": "/r/movies/comments/1h6by20/how_did_nice_guys_2016_make_me_nostalgic_for_a/"
    },
    {
        "id": "1h63m2c",
        "author": "TJeffersonsBlackKid",
        "title": "Rewatching The Prestige and caught a few things I have never noticed before",
        "content": "Obviously, The Prestige is pretty much head and shoulders above anything else for re-watchability, due to the fact that there is ALWAYS something that I have not noticed before. For all the things I have picked up on after several viewings (the twist getting revealed in literally the first two shots, \"But where's his brother?\", etc, etc,), the most recent viewing showed me a couple more things that I missed.\n\n- Robert Angier hinting at being Lord Caldlow earlier in the film. When his wife suggests The Great Danton as his name, he mentions that he did not want to ever embarrass his family name. This seems to be a hint to her that he does not want to embarrass her but upon knowing the twist, you realize he is actually referring to the idea that he is Lord Caldlow and Robert Angier is just an alias.\n\n- Cutter mentions that Borden is a great magician but a dreadful showman. We see this in his laughably bad show at the pub as well as when he is doing The Transported Man for the first time. \"Just a rubber ball huh? Its not just a rubber ball. Its magic.\" But then we see later when he has Root strung up and lowers him onto Angier's stage, he puts on a masterfully dramatic show of \"There is just too much magic for my stage! PARDON MY INTRUSION! And go easy on the poor chap, he does try so very hard!\" At first glance it appears that he has just grown as a performer but upon knowing the twist, it makes more sense to see that there is two of them and one is much more charismatic than the other.\n\n- The influx of side characters: Cutter even just straight up says that having a pretty assistant is critical to misdirection. But while Olivia actually does play a part in the plot, there are several characters that get significant attention that do not take the plot anywhere, even though they are portrayed as having some deep importance. These would be Owens, the Judge, Aly (not sure how its spelled), even the dude at the hotel drops some intense false-tension (\"I don't think it was necessary to tell Edison's men about the box\"). For the most part, none of these people factor in at all. However, they all masterfully distract from the one side character that actually is the key to everything: Fallon. Even after seeing the film so many times, it is easy to straight up forget about Fallon when he is on screen. I think that the many side characters are there as a means of misdirection so that no one ever really pays any attention to the \"real\" prestige.\n\nGreat fucking movie. Any other things you have picked up on after the 12th time through or so?",
        "upvotes": 1704,
        "comments": 272,
        "media": null,
        "permalink": "/r/movies/comments/1h63m2c/rewatching_the_prestige_and_caught_a_few_things_i/"
    },
    {
        "id": "1h6nplm",
        "author": "ichuck1984",
        "title": "1993 was peak Spielberg. Has there been another year like it for anyone else?",
        "content": "Hi all,\n\nJust a random daydream earlier about how amazing 1993 was with both Jurassic Park and Schindler's List being directly by the same guy. Spielberg managed to drop two bangers in one year. I'm curious if anyone has examples of anyone else achieving something similar in another year. The best I can come up with would be Michael Crichton having a #1 book, movie, and tv show at the same time. Funny enough, it still involves Jurassic Park... but the book was written years earlier and the movie wasn't his direct product. Pretty everyone else I can think of at that level goes years between releases, even if most of them are solid hits (such as Cameron, Scorsese, Tarantino).\n\nThoughts?",
        "upvotes": 58,
        "comments": 147,
        "media": null,
        "permalink": "/r/movies/comments/1h6nplm/1993_was_peak_spielberg_has_there_been_another/"
    },
    {
        "id": "1h744am",
        "author": "Pretzelsareformen",
        "title": "Pleasantville Discussion",
        "content": "I just watched Pleasantville and I was blown away. The acting, editing, and cinematography were fantastic. The storyline was truly original, as I can’t think of many films (if any) like it.  It almost felt like watching Truman Show for the first time, which was a huge success at the box office and talked about often. I also felt like the message was so relatable, no matter your age. \n\n\nSo my question is this, why isn’t this film popular? At first glance, it appears it should have been a hit. I’m not saying you should necessarily compare it to the greatest dramas of all time, but it definitely deserves more recognition than it received. \n\nWhat am I missing? Why was this film a box office bomb? ",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/movies/comments/1h744am/pleasantville_discussion/"
    },
    {
        "id": "1h650kv",
        "author": "JohnBobbyJimJob",
        "title": "How in the world did neither of Dafoe or Pattinson not even get an Oscar nomination for The Lighthouse?",
        "content": "Just got done rewatching it and it has to be up there with one of the biggest snubs regarding Oscar nominations surely?\n\nBoth of them put in Oscar winning level performances and neither of them even managed a nomination \n\nEven The Lighthouse in general got snubbed massively, the same year that Green Book won best picture as well…",
        "upvotes": 1097,
        "comments": 285,
        "media": null,
        "permalink": "/r/movies/comments/1h650kv/how_in_the_world_did_neither_of_dafoe_or/"
    },
    {
        "id": "1h6nb9q",
        "author": "Shirowoh",
        "title": "Not really a movie recommendation but a family movie night recommendation. ",
        "content": "We have a teenage daughter and my wife and I love movies.we’ve seen countless and have have shown our daughter many, we have a family movie night, where we go to spin the wheel.com and each of us pick a movie for movie night, we spin the wheel, then watch whatever it lands on. Normally have conversation afterwards and rate the movie, the following week, the previous week’s winner sits out of the spin and it’s only 2 choices, the 3rd gets their pick on the 3rd week. It’s been great and it’s something we look forward to, my 13 year old has had some interesting choices. Anywho, just a suggestion to all the families of movie lovers.",
        "upvotes": 51,
        "comments": 46,
        "media": null,
        "permalink": "/r/movies/comments/1h6nb9q/not_really_a_movie_recommendation_but_a_family/"
    },
    {
        "id": "1h630kv",
        "author": "cmaia1503",
        "title": "Scott L. Schwartz Dies; Wrestler Best Known For Playing Bruiser in ‘Oceans’ Franchise Was 65",
        "content": "",
        "upvotes": 917,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Xw7xCcbdvtr6FqZ-2pOcdtp43qK-zZITcPBIgr_nd28.jpg?auto=webp&amp;s=2a1167b8585c13497c265bf79983808456c57513"
        },
        "permalink": "/r/movies/comments/1h630kv/scott_l_schwartz_dies_wrestler_best_known_for/"
    },
    {
        "id": "1h6b8k4",
        "author": "jakielim",
        "title": "Korean Film ′12.12: The Day′ Gains Renewed Attention Amid Martial Law Crisis",
        "content": "",
        "upvotes": 218,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OmT0nvrucYDV_azuwTtqX1d0WjwQh4ypGz-Cj9PoyXI.jpg?auto=webp&amp;s=ec972be26e76c00a15a712d8ba64341537b95aef"
        },
        "permalink": "/r/movies/comments/1h6b8k4/korean_film_1212_the_day_gains_renewed_attention/"
    },
    {
        "id": "1h6o4he",
        "author": "NoCulture3505",
        "title": "Keke Palmer &amp; SZA’s ‘One Of Them Days’ Shifts To MLK Weekend Debut",
        "content": "",
        "upvotes": 26,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Qe6ooi-IfradEDzndKZJUtH-FpyDOqRVuz8Vc0CYBEM.jpg?auto=webp&amp;s=ec4ffd517f1a23b7af0f760a728849e717f879c5"
        },
        "permalink": "/r/movies/comments/1h6o4he/keke_palmer_szas_one_of_them_days_shifts_to_mlk/"
    },
    {
        "id": "1h72qk6",
        "author": "ZzzzzPopPopPop",
        "title": "Recommendations for “film studies” movie write-ups?",
        "content": "I just grabbed The Godfather DVD at the thrift store and before watching it again I was wondering if there are any web sites that provide some “what to watch for” details about specific movies like you might get in a college film studies class. Things like interesting use of camera angles, recurring themes, innovative techniques, etc. Hoping to educate myself a bit and possibly gain a deeper appreciation for movie making as an art form. ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1h72qk6/recommendations_for_film_studies_movie_writeups/"
    },
    {
        "id": "1h6yu2a",
        "author": "Sea-Current-4361",
        "title": "Personal movies ",
        "content": "Some movies feel deeply personal to me, even if they aren't objectively great. There's something about them that resonates with me, often for reasons I can’t fully explain. It’s like they speak to a part of me I don’t entirely understand. For me, those movies are In Bruges, Big Fish, Naked (1993), and The Beach Bum. I'm interested to watch some of your personal movies",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/movies/comments/1h6yu2a/personal_movies/"
    },
    {
        "id": "1h6sfix",
        "author": "Odd_Advance_6438",
        "title": "I love the “Love is the Drug” scene from Sucker Punch where Oscar Isaac and Carla Gugino sing the song in an elaborate musical.",
        "content": "I unironically think it’s one of the best scenes Snyder has directed, and I legitimately think he should direct a flamboyant musical. It’s crazy this was cut out of the theatrical version\n\nIt’s just got so much style in that 4 minute sequence. Great choreography, costumes, and most of all, showmanship. The whole movie is pretty much Oscar Isaac auditioning for his later role in Ex Machina. He’s a hell of a dancer, and has a great voice during this scene.\n\nI recently learned that there was a lot of footage cut from this film that’s not even in the extended cut. According to the choreographer, this scene was a lot longer, and Oscar Isaac did stuff like jump onto the tables",
        "upvotes": 10,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1h6sfix/i_love_the_love_is_the_drug_scene_from_sucker/"
    }
]