[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 10,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 696,
        "comments": 5109,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1ntkjg0",
        "author": "jerkoff1610",
        "title": "An actual family member reveals six things Netflix’s House of Guinness gets wrong in the show",
        "content": "",
        "upvotes": 167,
        "comments": 56,
        "media": null,
        "permalink": "/r/netflix/comments/1ntkjg0/an_actual_family_member_reveals_six_things/"
    },
    {
        "id": "1nsrqsy",
        "author": "Ok_Kiwi_5692",
        "title": "I feel so bad for the dad in this show man",
        "content": "Adolescence (2025)",
        "upvotes": 1716,
        "comments": 327,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/95txb29ffxrf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1nsrqsy/i_feel_so_bad_for_the_dad_in_this_show_man/"
    },
    {
        "id": "1ntdvac",
        "author": "Prudent_Swimming_296",
        "title": "Wayward (SPOILERS)",
        "content": "Was left very underwhelmed. Honestly just poorly written and not well thought out.\n\nI didn’t buy Leila’s sudden change of heart in the end at all and I didn’t buy Abby and Rory’s romance.\n\nWhy was the kid in the beginning who got stabbed by Alex affected by Laura’s mumbling? No answers.\n\nWhat’s the significance of the toads? Never revisited.\n\nWhat happened to the other kids at Tall Pines? Did they escape? Wasn’t addressed.\n\nWTF was the point of that whole “ponderosa” corporation plot point if it played absolutely no role in the story? Never answered.\n\nThis show was full of sloppy writing, massive plot holes, underdeveloped characters, arcs that were started but never took off or finished, and an ending that just felt like a total cop out. Very unsatisfying and not very good.\n\nI’m praying they don’t make a second season but given how popular it is, it’s very much a possibility.",
        "upvotes": 27,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1ntdvac/wayward_spoilers/"
    },
    {
        "id": "1ntf7ev",
        "author": "Cold_Classroom_5655",
        "title": "Netflix’s ‘Wayward’ Was Inspired By A Real School For Troubled Teens",
        "content": "",
        "upvotes": 21,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1ntf7ev/netflixs_wayward_was_inspired_by_a_real_school/"
    },
    {
        "id": "1nu07wp",
        "author": "Pure-Art-6381",
        "title": "Kicked out of our account!",
        "content": "It’s ridiculous just a few hours ago. I was on Netflix and now we have been told that we can’t use our account so I guess they just implemented some sort of rule where if you’re not in the same area or the same state and you’re sharing an account that you can’t do that anymore. My mother lives in Chicago and we live in Indiana, which we’ve always used our accounts this way, but starting today probably like an hour or so ago we’ve been kicked out of Netflix because I’m guessing cause she uses it more often than we do that. They’re saying that she’s like the owner of the account and because we’re in a different area they’re stopping us from being able to login and use it in our home",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nu07wp/kicked_out_of_our_account/"
    },
    {
        "id": "1nu04ci",
        "author": "LifeUnfolding54",
        "title": "The Godfather: Coda",
        "content": "I am chilling on a Monday evening. I retired tomorrow. \n\nThis is a brilliant piece of Cinema. It continues on with the story, and through the use of CGI and a i, they actually put the face of the character from that., on to that face, from that. Brilliant. I'm not able to describe it, but I love this movie!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nu04ci/the_godfather_coda/"
    },
    {
        "id": "1ntubqs",
        "author": "LouisTully9000",
        "title": "Small Town, Big Cult Energy in Wayward",
        "content": "Just in time for the annual corporate-sanctioned month of fear, better known as October, Netflix has gifted us ***Wayward***, an eight-episode miniseries that manages to be equal parts horror, comedy, and “what the hell did I just watch?” The show arrives courtesy of Mae Martin, a Canadian stand-up comic whose ability to pivot from punchlines to existential dread proves that comedians, when they go dark, often out-horror the horror directors. (Think Jordan Peele, but with more maple syrup and self-deprecation.)\n\nLet’s be clear from the start. This is not ***Wayward Pines****.* No Shyamalan twists. No forest conspiracy cults. Instead, ***Wayward*** feels like what would happen if Ari Aster, yes, ***Hereditary*** Ari Aster, was handed a stack of Judy Blume novels and told to make them deeply upsetting. The setting is the suspiciously quaint Tall Pines, a town where everyone knows everyone, and everyone waves, and everyone would probably lend you sugar, before locking you in a basement and asking you to recite scripture backwards. Think Stars Hollow, if Stars Hollow had a headmaster played by Toni Collette and zero coffee shops...",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ntubqs/small_town_big_cult_energy_in_wayward/"
    },
    {
        "id": "1nt2mo2",
        "author": "Quiet-Example-8804",
        "title": "Haunting of hill house",
        "content": "This has to be one best Netflix series ever. I swear I’ve rewatch it a few times a year since it came out.. that’s all I had to say 😅 it’s just too good!! ",
        "upvotes": 111,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1nt2mo2/haunting_of_hill_house/"
    },
    {
        "id": "1ntw73y",
        "author": "Icy_Alfalfa1766",
        "title": "Black Rabbit potential S2(spoilers)",
        "content": "Okay so maybe I’m in the minority here, but I loved Black Rabbit. Maybe it just scratched that Ozark itch, and I love Jason Bateman. Part of me wishes they’d make another season and just resurrect Vince. I get alive-the-whole time is a shark jumpy trope, but…What if he didn’t call the police from Jake’s phone but called a fixer or the lawyer to help him fake his death(like the insurance guy when they burned the house down). I imagine even if he fell into a trash can or something from that height, he’d still probably die. I also realize that narratively, his death had to happen and was always going to happen. But Season 2 could follow Jake finding out Vince is alive in another country trying to protect him by faking his death and maybe they make a plea deal with the FBI to catch Mancuso. Wouldn’t make the most sense, but I just love Law and Bateman’s brotherly chemistry and want more of it!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ntw73y/black_rabbit_potential_s2spoilers/"
    },
    {
        "id": "1ntla8p",
        "author": "Lindsamanda12",
        "title": "Orphan Black vs Mr. Robot",
        "content": "I have 2 shows I think I want to try but I’m not sure which I should try first, I got around 30 mins into Orphan Black before I realized it’d likely be anxiety filled so I went to browse for something else interesting &amp; remembered I saw very high compliments on Mr. Robot, which one is better or at least which one should I watch first?",
        "upvotes": 3,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1ntla8p/orphan_black_vs_mr_robot/"
    },
    {
        "id": "1ntblds",
        "author": "GovernmentLess1991",
        "title": "What to watch on Netflix these days",
        "content": "I need some recommendations of what to watch on Netflix. These days, I have binged\n\n* Crime Scene Zero\n* Owning Manhattan\n* Cook at all costs\n* Sky Castle\n* Alice in Borderland\n* The Devil's Plan\n* Kian Bizarre B&amp;B\n* Bon Appetit Your Majesty\n* KPOP Demon Hunter\n* Easy Bake Battle\n* Next Gen Chef\n* Hell's Kitchen\n\nWell, yea I hope you could get a grasp of my watching style. No horror or thriller. Just lighthearted ones.\n\nSo recommend me some good shows please! I have run out of stuffs to watch.",
        "upvotes": 12,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1ntblds/what_to_watch_on_netflix_these_days/"
    },
    {
        "id": "1nt9cfm",
        "author": "ItsMe_Chloee",
        "title": "Should I watch Gilmore Girls?",
        "content": "Honestly, the first episode seems interesting enough. But I'm still hesitating whether I should watch it or not. I've seen posts on Instagram about Rory and something about her studying techniques or something? I don't remember, but I plan on watching it because I need some motivation for studying but I just want to watch the show generally, regardless of the reason. Is the show good enough for me to be motivated to do stuff or not? Is it generally a fun show to watch? Need opinions!\n\n",
        "upvotes": 16,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1nt9cfm/should_i_watch_gilmore_girls/"
    },
    {
        "id": "1ntrtzr",
        "author": "New-Talk3039",
        "title": "They deserved a hug at the end 😢💔",
        "content": "After everything Jesse and Walt went through, seeing them finally have even a moment of release would’ve meant the world. Jesse escaping, Walt facing his end — all that pain, loss, and betrayal… and yet, no hug, no closure between them.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ntrtzr/they_deserved_a_hug_at_the_end/"
    },
    {
        "id": "1nsw9v9",
        "author": "AccomplishedPut5175",
        "title": "Wayward",
        "content": "What did I just watch\nI didn't have great expectations, but this series is so strong, that I was left without text.\nIn fact the emotions were mixed, did I just watch a masterpiece or something else.\nIn fact, you can't stay immune to the emotions that lead you through this series.\nThe actors are so amazing as the action of the series.\nFrom me any recommendation, with a note that the series is not for everyone.\n",
        "upvotes": 83,
        "comments": 278,
        "media": null,
        "permalink": "/r/netflix/comments/1nsw9v9/wayward/"
    },
    {
        "id": "1nt2vc5",
        "author": "RiseDelicious3556",
        "title": "Is Wayward Worth Watching??",
        "content": "I watched the first two episodes and so far I'm not impressed, either by the acting or the plot. Just wondering if this thing picks up or stays the same. Reminds me of American Horror Story but with poorer acting.",
        "upvotes": 33,
        "comments": 99,
        "media": null,
        "permalink": "/r/netflix/comments/1nt2vc5/is_wayward_worth_watching/"
    },
    {
        "id": "1ntcsc5",
        "author": "Beginning_Success127",
        "title": "Con mum",
        "content": "Am I the only one who felt bad for graham? Yes I feel that he was horrible for leaving his wife for the first few months n acting all normal coming back. However, I feel really bad that he didn’t have a mum for 45 years and when he did, she scammed him and left him high and dry. The documentary also said that his father was abusive and idk maybe it’s just me but I actually feel bad for him.",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ntcsc5/con_mum/"
    },
    {
        "id": "1nt64sk",
        "author": "Loopy_Love",
        "title": "Need to laugh",
        "content": "What is the funniest movie you've ever seen? I really really could use a laugh so hard I cry movie. Netflix preferred but can be any streaming service. ",
        "upvotes": 14,
        "comments": 78,
        "media": null,
        "permalink": "/r/netflix/comments/1nt64sk/need_to_laugh/"
    },
    {
        "id": "1ntg924",
        "author": "DeathNeku",
        "title": "I see people posting screenshots of Netflix shows all the time while commenting about it, how do they do it (legally, at least), if Netflix blackens the screen when you do it?",
        "content": "For the record, I'm not asking for a way to bypass this restriction, just wanna know if it's actually possible to make screenshots of the shows in a way the service allows it",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ntg924/i_see_people_posting_screenshots_of_netflix_shows/"
    },
    {
        "id": "1ntrmqa",
        "author": "candycaneattack",
        "title": "Can't find the new show Wayward",
        "content": "I can't see the show Wayward on my TV. It doesn't exist there? I can see it on my tablet and phone, I even put it in my list, but when I go on my TV it doesn't show up anywhere. \n\nAnother weird thing is I can't watch it on my phone or tablet, it says its age restricted, even though I have my netflix set to let me watch any age restricted things as well as specifically putting this show into the exceptions.\n\nSo I have no way to watch this show, please help",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ntrmqa/cant_find_the_new_show_wayward/"
    },
    {
        "id": "1ntkw1o",
        "author": "Frequent_Anteater_16",
        "title": "Trailers/Reviews UK",
        "content": "Can anybody help? I no longer get the short little preview/trailer on shows as I'm browsing.  I always found this really useful and I miss it! For context I'm in the UK, and my Netflix is through a sky q box. Also there now seems to be a 20 second delay in playing next episodes, anybody else? If someone could solve these issues for me id be ever so grateful!😊",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ntkw1o/trailersreviews_uk/"
    },
    {
        "id": "1ntjbzp",
        "author": "oajvcl",
        "title": "Adding extra member stucked in loop",
        "content": "I'm on a premium plan and already have one extra member. Based on the plan, it allows 4 plus 2 (extra members), so we should be able to add another extra member, but every time I tried to add extra member, Netflix just redirected me to the account/home page stucking in loop, no any error or message, a very bad UX.\n\nHas anyone experienced the same or do you guys know how to solve this? Thank you!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ntjbzp/adding_extra_member_stucked_in_loop/"
    },
    {
        "id": "1nty00m",
        "author": "Sir_Goose_lll",
        "title": "Why are most shows you see online not on Netflix?",
        "content": "I’m not complaining or anything, I’m just curious as to why most shows don’t appear on Netflix and only appear on other streaming platforms like HBO or Peacock.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nty00m/why_are_most_shows_you_see_online_not_on_netflix/"
    },
    {
        "id": "1nthe22",
        "author": "KindlyAccountant616",
        "title": "Invented anna: neff is an hypocrite",
        "content": "I liked the show, is like easy to watch brainless show but neff was an hypocrite. Giving rachel shit for dumping anna after the moroccan hotel scandal while she dumped anna from moment she had to pay for a 1000 dollar dinner and the hotel bill was getting huge. Anna was giving her 100 dollar tips, paying for spa and dinners and clothes. How is she different from rachel? But from the moment anna paid her back she was like are we cool again but then give rachel shit. They are both toxic. I bet if she didnt paid neff back neff wouldnt be in court. Neff was a user too.",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1nthe22/invented_anna_neff_is_an_hypocrite/"
    },
    {
        "id": "1ntet5f",
        "author": "RedBunnyJumping",
        "title": "What do u think of this?",
        "content": "\"And you believe the word to be high? I believe the word of a mother. Mother. Mother. Mother. Mother. Mother\" Don't u think that gothic styling + that dry humor is *so* screenshot-worthy? \n\nWith digital glitches and gothic vibes is giving **peak Wednesday energy** ....  it's giving main character and feeling of  \"I'm better than everyone else\"",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ntet5f/what_do_u_think_of_this/"
    },
    {
        "id": "1nsrqxe",
        "author": "it-s-luminescent",
        "title": "Two men arrested after fight over Netflix account ends with gunfire",
        "content": "SAN ANTONIO - Two men have been arrested after a fight over a Netflix account ended with gunfire.\n\nBrian Travis Reynolds, 19, and Anthony Constante, 19, were taken into custody this week in connection with an incident outside a home on Calle Briseno, according to the Bexar County Sheriff’s Office.\n\nInvestigators said the confrontation started on September 23, after Reynolds changed the name on 20-year-old Vincent Munoz’s Netflix account to an insult. Munoz then agreed to fight Reynolds and Constante after feeling disrespected.\n\nWhen the pair showed up, they jumped a fence to get to Munoz. Reynolds had a handgun in his waistband, which he allegedly handed to Constante during the fight. At one point, Constante was seen on video striking Munoz repeatedly while holding the weapon, deputies said.\n\nThe fight continued after the gun was passed back to Reynolds. A shot was fired during the struggle, and Munoz was left bleeding from the head. It’s still unclear if he was struck by a bullet or injured another way.\n\nDeputies also noted the gun had been modified with an illegal device known as a “switch,” which turns it into a fully automatic weapon.\n\nReynolds and Constante were arrested.\n\n[Reynolds &amp; Constante: a cautionary tale in being careful re: sharing your Netflix password](https://preview.redd.it/ua398llofxrf1.jpg?width=1600&amp;format=pjpg&amp;auto=webp&amp;s=78e07955aabdf562b102294f9beeaff3b28df1ee)\n\n[news article link](https://foxsanantonio.com/newsletter-daily/two-men-arrested-after-fight-over-netflix-account-escalates-to-gunfire-gun-violence-switch-television)",
        "upvotes": 33,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1nsrqxe/two_men_arrested_after_fight_over_netflix_account/"
    },
    {
        "id": "1ntbatp",
        "author": "Which_Mammoth9402",
        "title": "Shows or movies shot in NYC that give this exact vibe?",
        "content": "Looking for shows or movies that makes you wanna drop everything and move to New york lol. I want to watch something with really good cinematography and scenes that mainly takes place in the city. \n\nAny recommendations? 🤍",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ntbatp/shows_or_movies_shot_in_nyc_that_give_this_exact/"
    },
    {
        "id": "1nt7az1",
        "author": "Comfortably_Numb_76",
        "title": "Question about Black Rabbit",
        "content": "In the last episode. Jake was attending the funeral and he  looked over at someone standing at a distance in the cemetery. Only showing the back of his head, standing by a headstone. Who was that? Anyone know? I'm sure I missed something. \n\nAbsolutely Loved this Series!! ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nt7az1/question_about_black_rabbit/"
    },
    {
        "id": "1ntb8r7",
        "author": "Winter_Emergency6179",
        "title": "On my third watch of Damsel, I noticed something.",
        "content": "When the queen takes Floria to throw her down, the prince refuses to let her cut his hand. She calls him weak and proceeds to cut Florias hand and her own hand. I'm unsure if it was intentional, but the queen cuts Florias hand a lot slower than she cuts her own. If it was intentional, she wanted to cause Floria more pain and herself less. And she had the audacity to call the prince \"weak\". It was just such a small detail that I noticed and really just shows how sick the queen is. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ntb8r7/on_my_third_watch_of_damsel_i_noticed_something/"
    }
]