[
    {
        "id": "1l1nioh",
        "author": "FeliciaDayAMA",
        "title": "Hi reddit! I'm Felicia Day. You might know me from things like The Guild, Dr. Horrible's Sing-Along Blog, Mystery Science Theater 3K, Tabletop, Supernatural, Critical Role, Eureka, and more. I'm also starring in a fun new sci-comedy (Tim Travers and the Time Traveler's Paradox). Ask me anything!",
        "content": "Hi reddit! I'm Felicia Day. You might know me from things like The Guild, Dr. Horrible's Sing-Along Blog, Mystery Science Theater 3K, Tabletop, Supernatural, Critical Role, Eureka, and more. I'm also starring in a fun new sci-comedy (Tim Travers and the Time Traveler's Paradox). Ask me anything!\n\nThe new film I'm in, Tim Travers and the Time Traveler's Paradox, is out now.\n\nTrailer:\n\n[https://www.youtube.com/watch?v=NMtLKYg6kYI&amp;pp=0gcJCdgAo7VqN5tD](https://www.youtube.com/watch?v=NMtLKYg6kYI&amp;pp=0gcJCdgAo7VqN5tD)\n\nSynopsis:\n\nA man travels back in time to kill his younger self to see if he can unmake reality. To everyone's surprise, the universe remains intact, and he instead finds the most horrible thing he can imagine -- himself.\n\nCast:\n\n\\-Samuel Dunning\n\n\\-Felicia Day\n\n\\-Danny Trejo\n\n\\-Joel McHale\n\n\\-Keith David\n\nAsk me anything! Back at 5 PM ET today.",
        "upvotes": 964,
        "comments": 243,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xmwsz3l4qj4f1.png?auto=webp&amp;s=06351f1fb5dc3648b7f800f075f44e2bc1b5fe15"
        },
        "permalink": "/r/movies/comments/1l1nioh/hi_reddit_im_felicia_day_you_might_know_me_from/"
    },
    {
        "id": "1l1we0q",
        "author": "SanderSo47",
        "title": "May 30-June 1 Box Office Recap – 'Lilo &amp; Stitch' crosses $600M worldwide, while 'Mission: Impossible – The Final Reckoning' crosses $350M worldwide. 'Karate Kid: Legends' and 'Bring Her Back' have solid debuts, while 'The Phoenician Scheme' opens with the best per-theater average ($93K) of the year.",
        "content": "https://preview.redd.it/di3ho2tpgl4f1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=186eb2a8aa82274d3e409f1cbf80eb70969bb9d5\n\nWithout much competition this weekend, ***Lilo &amp; Stitch*** and ***Mission: Impossible – The Final Reckoning*** kept the top two spots, even though both had rough drops. ***Karate Kid: Legends*** had an okay debut, even if it was less than half of the 2010 film. ***Bring Her Back*** was also off to a solid start. The weekend's story, however, was Wes Anderson's ***The Phoenician Scheme***, which earned the year's best per-theater average in 6 theaters.\n\nThe Top 10 earned a combined $144.8 million this weekend. That's up a massive 140% from last year, when ***The Garfield Movie*** topped the box office.\n\nDisney's ***Lilo &amp; Stitch*** stayed on top this weekend, adding $61.8 million this weekend. That's a rough 58% drop, which is a little worse than ***The Little Mermaid*** (56.7%). But that film had a megahit, ***Spider-Man: Across the Spider-Verse***, opening on its second weekend. Which makes ***Lilo &amp; Stitch***'s drop look worse.\n\nThrough 10 days, the film has made $278.9 million domestically. It already passed the original's lifetime ($145 million) last week, and it will eclipse its adjusted total ($283.7 million) today. Last week, I said that the film should easily gross past $500 million domestically. But based on this drop and family competition like ***How to Train Your Dragon*** coming up, there's a possibility that it misses that milestone. It will all depend on the next few weeks.\n\nStaying in second place, ***Mission: Impossible – The Final Reckoning*** added $27.1 million this weekend. That's a rough 57% drop. That's better than ***Dead Reckoning*** (64.6%), but it's still the second worst drop in the franchise. And that's despite the film keeping IMAX formats this weekend.\n\nThrough 10 days, the film has amassed $122.5 million. On Friday, it became Cruise's 21st film as leading star to hit $100 million milestone. The film is currently running ahead of ***Dead Reckoning***, but it's gonna have some tough competition coming up. Right now, it's very likely that ***The Final Reckoning*** misses $200 million domestically.\n\nIn third place, ***Karate Kid: Legends*** debuted with $20.3 million in 3,809 theaters. For reference, the 2010 version debuted with $55.6 million. Adjusted for inflation, this debut is barely ahead of the first film ($15.5 million), but lower than the second ($37 million) and third ($26.8 million).\n\nThe film cost just $45 million, so it's not really a failure. But it still feels like the film could've opened far higher than this. After all, the 2010 film was a huge hit and the franchise has stayed relevant with newer generations thanks to the series ***Cobra Kai***. So how did it open with barely $20 million? Well, competition with ***Lilo &amp; Stitch*** didn't help, as families are prioritizing that film over ***Legends***.\n\nPerhaps ***Cobra Kai*** was both its biggest strength and disadvantage. It kept audiences glued to the franchise, but in the process, it also made them picky over whether to pay a ticket price to watch this film in theaters. Maybe the ***Karate Kid*** franchise is now relegated to streaming? Cause even if getting Jackie Chan and Ralph Macchio back didn't propel much interest for this, then who knows what will. \n\nAccording to Sony, 59% of the audience was male, and 67% of the audience was 25 and over. While critics were mixed, the audience was a little more forgiving: they gave it a fine \"A–\" on CinemaScore. Regardless, there's tough family competition on its way with ***How to Train Your Dragon*** and ***Elio***. For now, it's very likely ***Karate Kid: Legends*** finishes with less than $60 million domestically. Whatever Sony has planned for the future of the franchise, that's up to anyone's guess.\n\nIn fourth place, ***Final Destination: Bloodlines*** dropped 44%, earning $10.9 million this weekend. The film has earned $111.8 million so far, and it looks like it will finish with around $140 million domestically.\n\nIn fifth place, A24's ***Bring Her Back*** debuted with $7 million in 2,449 theaters. That's not far off from ***Talk to Me*** ($10.4 million), and it was in the top 10 biggest debuts for the studio.\n\nA24 banked on the film solely on its directors, Danny and Michael Philippou, after seeing how big ***Talk to Me*** was back in 2023. All in all, this is a solid start. A24 financed the film for around $20 million, with foreign rights sold going to Sony for around $13 million. As for why the film debuted much lower than ***Talk to Me***? Simply put, there's some competition for horror right now. ***Final Destination: Bloodlines*** over-performed projections, ***Sinners*** is still going strong, and ***28 Years Later*** is coming up in a few weeks. Basically, it's tough to ask for much better numbers. Especially considering how the film is incredibly bleak.\n\nAccording to A24, 57% of the audience was male, and 70% were 25 and over. They gave it a solid \"B+\" on CinemaScore, which is the same grade as ***Talk to Me***. That's impressive, considering how bleak this film was. There's some competition coming up, but ***Bring Her Back*** should still get to over $20 million by the end of its run.\n\nIn sixth place, ***Sinners*** has yet to post a single bad drop. And this weekend won't be the first bad drop. It eased just 39%, adding $5.2 million this weekend. The film has earned $267.1 million so far, and it should get close to $290 million domestically. Incredible. Simply incredible.\n\nWell, it happened, pals. ***Thunderbolts*** is now losing to ***Sinners*** on weekends, and it's unlikely it will take the lead ever again. The film dropped a rough 51%, earning $4.7 million this weekend. The film's domestic total stands at $181.8 million, which is $4 million behind ***Captain America: Brave New World*** through the same point. Right now, it looks like the film will finish with around $195 million. Ouch.\n\nA24's ***Friendship*** added 238 theaters this weekend, although the film fell 51%, earning $2.5 million this weekend. The film has now earned $12.3 million so far. The film has performed very well so far, but it's clear there's a ceiling to its box office prospects.\n\nIn ninth place, Angel Studios' ***The Last Rodeo*** collapsed 60%, earning $2.1 million this weekend. The film has earned $10.7 million on its first 10 days, and it looks like it won't earn much higher than $15 million.\n\nRounding up the Top 10 was ***J-Hope Tour: Hope on Stage***, which earned $939,173 in 631 theaters. Not bad, considering this was a live concert.\n\nFocus Features released Wes Anderson's ***The Phoenician Scheme*** in 6 theaters, where it earned $560,499 this weekend. That's an incredible $93,417 per-theater average, which is the best of the year so far. Focus went all out on the limited rollout; the film played on all six screens at the Angelika Film Center in New York. It included a jazz band and film-themed merchandise and activations in the lobby and concessions, with higher ticket prices ($30 for standard and $60 for premium).  The film will expand into 1,500 theaters this weekend.\n\n#**OVERSEAS**\n\n***Lilo &amp; Stitch*** was still #1 in the rest of the world. It added $113.1 million overseas, taking its worldwide numbers to $609.6 million. Its best markets are Mexico ($45.9M), UK ($34.5M), France ($23.1M), Brazil ($21.6M) and Germany ($18.1M). It's still set to finish with over $1 billion worldwide.\n\n***Mission: Impossible – The Final Reckoning*** added $76.1 million overseas, for a $353.7 million worldwide total. It opened in China this weekend, earning $25.2 million this weekend. Its best markets are China ($25.2M), the UK ($22.3M), Japan ($18.5M), Korea ($17M) and France ($14.2M). The film is definitely hitting $550 million worldwide, and it could get close to $600 million depending on its drops.\n\n***Final Destination: Bloodlines*** is still going strong, adding $14.4 million overseas, for a $230 million worldwide total. The best markets are the UK ($12.5M), Mexico ($11.2M), India ($7.6M), Philippines ($6.9M) and France ($6.7M). The film is gonna finish with close to $300 million worldwide.\n\n***Karate Kid: Legends*** made its debut in more markets, after starting playing in Latin America a few weeks ago. It earned $12 million overseas, taking its worldwide total to $46.3 million. It had fine debuts in the UK ($3.4M) and Germany ($2.2M). There are still some more markets left, so we'll keep an eye on this one.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Until Dawn* | Apr/25 | Sony | $8,003,402 | $20,174,192 | $51,515,949 | $15M\n\n- Sony's ***Until Dawn*** has closed with $51 million worldwide. Pretty solid against its small $51 million, and despite mixed reviews. Not to mention the poor comparisons to the game, given that the film was considered an underwhelming adaptation of the game (director David F. Sandberg said it was more of a new installment rather than a full remake). But hey, it worked, I guess.\n\n#**THIS WEEKEND**\n\nWe've got a new wide release this weekend, though it remains a question mark if it will be strong enough to dethrone ***Stitch***.\n\nThat's Lionsgate's ***Ballerina*** (no, we ain't including that long ass title), a *John Wick* spin-off set between the events of the third and fourth films. It stars Ana de Armas as a ballerina-assassin who begins to train in the assassin traditions of the Ruska Roma and sets out to exact revenge for her father's death. Lionsgate has emphasized that Keanu Reeves is part of the film, putting him in all trailers and posters (even if his role is far smaller). The film underwent a very troubling production; it had 2-3 months of reshoots, refilming the majority of the film. The film is directed by Len Wiseman, but the reshoots were helmed by Chad Stahelski, with Wiseman not present on set. Will this save the film?\n\nAnd as previously mentioned, ***The Phoenician Scheme*** is hitting wide release this weekend. It's set for around 1,500 theaters, how close will it get to ***Asteroid City***'s wide debut ($9M)?\n\nIn limited release, Neon is releasing Mike Flanagan's ***The Life of Chuck***. Based on the 2020 novella by Stephen King, it stars Tom Hiddleston, Chiwetel Ejiofor, Karen Gillan, Jacob Tremblay, and Mark Hamill. It surprised many when it won the People's Choice Award at the Toronto Film Festival, as every winner since 2012 has always been nominated for an Oscar for Best Picture. Will it surprise?\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 5,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cmQxN9bw5ZtrdSNUdlpzO6btoZ0NzEVRgq2mK9Si1BE.png?auto=webp&amp;s=05dc5362b089b6ca84030e9f371a42c9c2b8a261"
        },
        "permalink": "/r/movies/comments/1l1we0q/may_30june_1_box_office_recap_lilo_stitch_crosses/"
    },
    {
        "id": "1l1lin2",
        "author": "MarvelsGrantMan136",
        "title": "Jonathan Joss, ‘King of the Hill’ Actor, Dies in Shooting at 59; Joss Also Appeared in 'True Grit' &amp; 'The Magnificent Seven'",
        "content": "",
        "upvotes": 3744,
        "comments": 447,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3fr9Hjkurfa1TboQ-bpl04KgoE4MfrtptZoC0HM7dlo.jpg?auto=webp&amp;s=828e9a7f05ee97ea079657a4eb5ff3fb6b00f05c"
        },
        "permalink": "/r/movies/comments/1l1lin2/jonathan_joss_king_of_the_hill_actor_dies_in/"
    },
    {
        "id": "1l1bibh",
        "author": "Chai_Lijiye",
        "title": "Daniel Craig's transformation into James Bond comes at the end of CASINO ROYALE. He dresses in the classic suit and brilliantly delivers 007's famous greeting.",
        "content": "",
        "upvotes": 15417,
        "comments": 866,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/66wf58gvqg4f1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1l1bibh/daniel_craigs_transformation_into_james_bond/"
    },
    {
        "id": "1l1fv4v",
        "author": "BunyipPouch",
        "title": "Donald Trump Biopic 'The Apprentice' (Starring Sebastian Stan &amp; Jeremy Strong) Sweeps 2025 Canadian Screen Awards Winning 5 Awards (Best Film, Best Lead Actor, Best Supporting Actor, Best Makeup, Best Hair)",
        "content": "",
        "upvotes": 3417,
        "comments": 147,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-YuNfwjXx1BEw_OQUmH1UlVUV2mmVvbo7UkWu8vVkFc.jpg?auto=webp&amp;s=69f8bac905a4076cc735c87dabf36d48c6b30cef"
        },
        "permalink": "/r/movies/comments/1l1fv4v/donald_trump_biopic_the_apprentice_starring/"
    },
    {
        "id": "1l1mkyy",
        "author": "MarvelsGrantMan136",
        "title": "Disney Laying Off Several Hundred In TV &amp; Film Entertainment, Corporate Finance",
        "content": "",
        "upvotes": 1062,
        "comments": 272,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dygWqUmPzo7PYYUZpdw0_uhP2gxx7eVEqcB0tdvSlEM.jpg?auto=webp&amp;s=96a1618d6e91bf0abbc55ee872dcc53c3637e617"
        },
        "permalink": "/r/movies/comments/1l1mkyy/disney_laying_off_several_hundred_in_tv_film/"
    },
    {
        "id": "1l1mqov",
        "author": "_ThugzZ_Bunny_",
        "title": "Anyone remember the marketing for Jarhead?",
        "content": "So I was 17 when this movie came out and I was hyped up by the trailer to see this war movie. They advertised it as an action packed war movie and the trailer went so hard with Jesus Walks playing and that baddass shots of them marching with the smoke and fires in the background. Flash forward to being in the theater thinking I'm about to get a war movie but turns out there is no war. I hated it. Flash forward again to YEARS later when I gave it another chance as an adult only to see the genius of the movie. Just like the trailer, the actual war itself was advertised as a war with lots of action. My experience as a teenager going to see this movie paralleled the experience of Gyllenhaal's character. I really just wanted to point out how genius the marketing was and also give props for having the balls to do that. There was a lot of backlash for the movie cause we all expected action. I legit hated the movie so I'm sure it had a huge negative affect overall. But damn that \"marketing\" ties in with the theme so perfectly. It's something that is missed for anyone that watches now without experiencing the trailers and marketing for the movie. ",
        "upvotes": 1000,
        "comments": 126,
        "media": null,
        "permalink": "/r/movies/comments/1l1mqov/anyone_remember_the_marketing_for_jarhead/"
    },
    {
        "id": "1l1m2ou",
        "author": "cmaia1503",
        "title": "Sydney Sweeney’s ‘Split Fiction’ Movie Lands at Amazon",
        "content": "",
        "upvotes": 1037,
        "comments": 168,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/UCowCxwwlo8BlkYRLeBSNc4pSwRA2_DO427Jw1A4uYA.jpg?auto=webp&amp;s=aee76f2395b5d5d33f66ff10cad25dedc3c027a2"
        },
        "permalink": "/r/movies/comments/1l1m2ou/sydney_sweeneys_split_fiction_movie_lands_at/"
    },
    {
        "id": "1l1vs9r",
        "author": "Professional_MaCaw60",
        "title": "What's That One Movie That You've Never Watched But The Entire World Has.",
        "content": "Okay so I love movies and would spend hours upon hours reading reviews and people's opinions about any and all movies, especially ones I have watched. But there always comes a time when there's a popular movie that everyone has seen, but you haven't. But you've actually read enough or heard enough from that movie to be able to discuss it when it pops up in conversation.\nFor me, the two most popular ones, and forgive me cause both have sequels and a great following, but I just can't get mysel to watch them.\nMission Impossible films and John Wick films......\nSo what's that one(or two) movie for you?",
        "upvotes": 330,
        "comments": 2019,
        "media": null,
        "permalink": "/r/movies/comments/1l1vs9r/whats_that_one_movie_that_youve_never_watched_but/"
    },
    {
        "id": "1l1b1s9",
        "author": "filmeswole",
        "title": "Did something happen to Wes Anderson films after Isle of Dogs that made them less appealing?",
        "content": "I used to get so excited for his movies, but ever since Isle of Dogs, I started to lose interest in his newer work. I can’t seem to really pinpoint why. Perhaps I’m fatigued on his style, but I feel something changed in his work that made them less exciting.  \n\nAnyone else experience a turning point around the same time? \n",
        "upvotes": 4071,
        "comments": 1079,
        "media": null,
        "permalink": "/r/movies/comments/1l1b1s9/did_something_happen_to_wes_anderson_films_after/"
    },
    {
        "id": "1l1xyaz",
        "author": "Amaruq93",
        "title": "George A. Romero's daughter Tina delivers a 'big gay glam-gore zombie movie' in \"Queens of the Dead\" (premiering June 7 at the Tribeca Film Festival)",
        "content": "",
        "upvotes": 151,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JKnPKlU1ruEFXeO1ZR1KQqYqfO7_auUu2hF1Lb0Nh18.jpg?auto=webp&amp;s=0395ce8a0980b322696fb659c556d176f5dafa4b"
        },
        "permalink": "/r/movies/comments/1l1xyaz/george_a_romeros_daughter_tina_delivers_a_big_gay/"
    },
    {
        "id": "1l1nb7k",
        "author": "CaptKarlanrik",
        "title": "James Cameron has purchased the rights to Joe Abercrombie's latest book, The Devils, Abercrombie will co-write the script with Cameron",
        "content": "",
        "upvotes": 543,
        "comments": 52,
        "media": null,
        "permalink": "/r/movies/comments/1l1nb7k/james_cameron_has_purchased_the_rights_to_joe/"
    },
    {
        "id": "1l1s3li",
        "author": "sammysoso",
        "title": "\"NO CGI\" is really just INVISIBLE CGI (5/5)",
        "content": "",
        "upvotes": 289,
        "comments": 66,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pEbviEbNgD80Ex5m4CT30qcclCf0vtQNIVCu1PEWAeM.jpg?auto=webp&amp;s=311c50054c5838e27d11cef547ba214fc3fda120"
        },
        "permalink": "/r/movies/comments/1l1s3li/no_cgi_is_really_just_invisible_cgi_55/"
    },
    {
        "id": "1l1xlj4",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for ‘Trust’ Starring Sophie Turner - Follows a Hollywood starlet who, after an unnamed scandal, retreats to a remote cabin — but she’s not alone. Betrayed by the man she trusted most, she’s trapped in a brutal game of survival",
        "content": "",
        "upvotes": 126,
        "comments": 55,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/79o92rumql4f1.jpeg?auto=webp&amp;s=ee482d85e425a8f53992ae50cbc270642f598699"
        },
        "permalink": "/r/movies/comments/1l1xlj4/official_poster_for_trust_starring_sophie_turner/"
    },
    {
        "id": "1l1kv3d",
        "author": "outremer_empire",
        "title": "Colin Farrell &amp; Danny DeVito | Actors on Actors",
        "content": "",
        "upvotes": 298,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0MaWjNB4anUqo_-hkLya5coDjCkK0nxB6-CcGAaZW0s.jpg?auto=webp&amp;s=3c31e35ec354263fa2b595bb65a9621307ab6529"
        },
        "permalink": "/r/movies/comments/1l1kv3d/colin_farrell_danny_devito_actors_on_actors/"
    },
    {
        "id": "1l1jyz8",
        "author": "cmaia1503",
        "title": "‘The Accountant 2’ Sets Prime Video Premiere Date, June 5th",
        "content": "",
        "upvotes": 314,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3sZe-k5t0LdQozAORE_2lZZC2_9Nl9XkcpknQHw-a1M.jpg?auto=webp&amp;s=1cd6ddc9d2160bff105730a47296d49e4043be2b"
        },
        "permalink": "/r/movies/comments/1l1jyz8/the_accountant_2_sets_prime_video_premiere_date/"
    },
    {
        "id": "1l16ku4",
        "author": "dannytrejostattoos",
        "title": "Can anyone think of a better example of an Oscar caliber actor starting his career in the dumbest movie on the planet more than Jake Gyllenhaal in Bubble Boy?",
        "content": "I think he's the best actor of our (I'm almost 40) generation and I haven't watched this since it came out but I just fired it up (streaming on Hulu) and in his first 10 minutes you can quickly see him putting way too much effort into the stupidest movie ever. I honestly can't think of a worse early role for a better actor. I'd love to hear other nominations.\n\nEdit: I fucking love this movie and I've been waiting for it to stream for a year+",
        "upvotes": 3148,
        "comments": 1106,
        "media": null,
        "permalink": "/r/movies/comments/1l16ku4/can_anyone_think_of_a_better_example_of_an_oscar/"
    },
    {
        "id": "1l1m2gd",
        "author": "Task_Force-191",
        "title": "Official poster for the 4K remaster of Hideaki Anno and Shinji Higuchi's SHIN GODZILLA in North American theatres starting August 14!",
        "content": "",
        "upvotes": 155,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/6qv9igt2gj4f1.jpeg?auto=webp&amp;s=a73f0032ee90338339c689cf6910d3f85528ccf3"
        },
        "permalink": "/r/movies/comments/1l1m2gd/official_poster_for_the_4k_remaster_of_hideaki/"
    },
    {
        "id": "1l1gqn7",
        "author": "KillerCroc1234567",
        "title": "Downton Abbey: The Grand Finale | Official Teaser Trailer",
        "content": "",
        "upvotes": 290,
        "comments": 108,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LH-aC2p5UOt8VHwWPWNokwJ7lo13ocotKgsrr3WrCQ4.jpg?auto=webp&amp;s=495a42f5e258ef4b7099619d7f47da9e907e738f"
        },
        "permalink": "/r/movies/comments/1l1gqn7/downton_abbey_the_grand_finale_official_teaser/"
    },
    {
        "id": "1l1kf7w",
        "author": "vilbo",
        "title": "'Shin Godzilla' North American Rights Acquired by Gkids",
        "content": "Pretty excited about this? I was a little skeptical about GKIDS being bought by Toho, but if it means we get GKIDS -style releases of movies like this one, I'm 100% here for it. ",
        "upvotes": 164,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5HyhQmMpDwsY6NW7eHh4vpqU9Nk5kLqJeUkE34FBXZs.jpg?auto=webp&amp;s=29c006485ee7798a4b046ef9a6b7c1de01051d3b"
        },
        "permalink": "/r/movies/comments/1l1kf7w/shin_godzilla_north_american_rights_acquired_by/"
    },
    {
        "id": "1l1pwwh",
        "author": "0ccurian",
        "title": "Cure (1997) - I haven't been this disturbed and unsettled in a while",
        "content": "I wasn't familiar with Kiyoshi Kurosawa's work and had no idea what to expect because I went in almost blind. I only read that it's a police procedural so I thought it'd be like Memories of Murder (which I love) but I didn't see the horror elements coming. \n\nThe muted, dark, almost grungy cinematography was fantastic. And the actor who played Mamiya really sold his role so well, I was clenching my jaw and holding my breath every time he was on screen. Long after it was over, I felt this weird emptiness I couldn't shake. Even now it feels like a fever dream and I don't think I've processed it all yet. \n\nHaving said that, this is my favorite kind of horror. The eerie, atmospheric, creeping existential dread, decent into madness type of deal. I'm definitely going to rewatch it at some point to see what I missed. The last time I felt this way was when I watched Picnic at Hanging Rock. \n\nDid anyone else have a similar experience? Which movie unexpectedly disturbed you to your core?",
        "upvotes": 58,
        "comments": 14,
        "media": null,
        "permalink": "/r/movies/comments/1l1pwwh/cure_1997_i_havent_been_this_disturbed_and/"
    },
    {
        "id": "1l0yfyt",
        "author": "indiewire",
        "title": "Tom Cruise Wrote Famous ‘Magnolia’ Monologue, Told Paul Thomas Anderson: This is Mackey to Me",
        "content": "",
        "upvotes": 3105,
        "comments": 319,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/A4KT7B-YdwPKeb5VpyOV6CdqK7A7hzAHp4W3rTBTlqM.jpg?auto=webp&amp;s=43f31d87ad3c11c62f2db9db3f149d303dde4f5b"
        },
        "permalink": "/r/movies/comments/1l0yfyt/tom_cruise_wrote_famous_magnolia_monologue_told/"
    },
    {
        "id": "1l1nmnm",
        "author": "nashamagirl99",
        "title": "Which wars need more movies? Which are overdone?",
        "content": "Going through the US wars:\n\nRevolutionary War - I always found this era cool and would say yes, needs more movies, especially The Patriot being the prime example for many despite its inaccuracy\n\nWar of 1812: Not a lot of film representation of this but yeah, there’s a reason. Some of the Andrew Jackson stuff could be interesting to see on film though. He was quite a character \n\nMexican American War: Weird land grab war, lots of local legends, needs more movies \n\nCivil War: Been there, done that. I don’t think this one needs more movies unless it can offer a fresh perspective \n\nSpanish American War: Absolutely needs more movies! Teddy Roosevelt and the rough riders, yellow journalism, we blamed the Maine on Spain but Spain didn’t do it! Lots going on\n\nWorld War 1: I remember thinking we needed more WW1 movies and then finally we got some. It would still be cool to have more though including the Harlem Hellfighters \n\nWorld War 2: Lots of movies on this one, always been very interested in the era but prefer non US perspectives that aren’t as widespread here (Come and See is one of the most brutally accurate depictions of war ever). I’d like to see more not from the US or Western Europe \n\nKorean War: Remarkably tense and brutal conflict and also the first war with a racially integrated US military. Definitely needs more movies\n\nVietnam War: Frankly we have enough \n\nGulf War: Meh, could probably use like one critically acclaimed one? \n\nWar in Afghanistan/Iraq: Yeah, I’m grouping it together cinematically. We have enough for the size of the conflicts\n\nWhat do you think? Feel free to add your country’s wars too \n\n",
        "upvotes": 56,
        "comments": 293,
        "media": null,
        "permalink": "/r/movies/comments/1l1nmnm/which_wars_need_more_movies_which_are_overdone/"
    },
    {
        "id": "1l13wld",
        "author": "NoCulture3505",
        "title": "Black Phone 2 - Official Trailer",
        "content": "",
        "upvotes": 1027,
        "comments": 216,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vhqnmESA7YuU6W9OaGt_c4Cq5cjtaWVOtampkYkOEGo.jpg?auto=webp&amp;s=f57d5345d7ed427f390e78f3ee4e2e2fd0d9857f"
        },
        "permalink": "/r/movies/comments/1l13wld/black_phone_2_official_trailer/"
    },
    {
        "id": "1l1miw7",
        "author": "indiewire",
        "title": "'Dogtooth' 4K Trailer: Yorgos Lanthimos' Thriller 15 Years Later",
        "content": "",
        "upvotes": 47,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9ENwShGSpMyij9Aj5HvwPIcRnfexgZ8xQn3GCteu6eU.jpg?auto=webp&amp;s=121cbe09356b09568519c8970a1c13979deb0e9e"
        },
        "permalink": "/r/movies/comments/1l1miw7/dogtooth_4k_trailer_yorgos_lanthimos_thriller_15/"
    },
    {
        "id": "1l1z1jl",
        "author": "nightpanda893",
        "title": "How Bring Her Back’s most stomach-churning shot happened",
        "content": "",
        "upvotes": 10,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6y42M_-jeILpuNH95tW74vuumOVAWBCYvppd9xiJBhU.jpg?auto=webp&amp;s=01f31aa3fdcbc64c2075e27b844dc412a6ad4df2"
        },
        "permalink": "/r/movies/comments/1l1z1jl/how_bring_her_backs_most_stomachchurning_shot/"
    },
    {
        "id": "1l1cpf0",
        "author": "StatisticianLevel796",
        "title": "How are intense scenes with child actors shot?",
        "content": "I have always wondered how filmmakers create scenes that contain emotional or verbal violence on children. Does the actor actually yell at that toddler? Is that baby pinched off-camera to deliver a genuine crying? Or they wait until it needs a diaper change? I suppose there are strict rules of child treatment on sets so I would appreciate to get some information about the tricks they use.",
        "upvotes": 196,
        "comments": 112,
        "media": null,
        "permalink": "/r/movies/comments/1l1cpf0/how_are_intense_scenes_with_child_actors_shot/"
    },
    {
        "id": "1l1vl9y",
        "author": "jakey_bake",
        "title": "FOUND FOOTAGE: THE MAKING OF THE PATTERSON PROJECT | Official Trailer",
        "content": "",
        "upvotes": 11,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/o30D39B7V0MR5b8EtrFhmsQR0t42ueeKOqEg3hOs1to.jpg?auto=webp&amp;s=4f2a196267216a00c96c524ca8785296450c6f72"
        },
        "permalink": "/r/movies/comments/1l1vl9y/found_footage_the_making_of_the_patterson_project/"
    },
    {
        "id": "1l1k9my",
        "author": "NoCulture3505",
        "title": "M3GAN 2.0 | Final Trailer",
        "content": "",
        "upvotes": 49,
        "comments": 97,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Z6BngTtmYHGkOqCFRKEysiWozwHi991Z86lFVHPZ4z8.jpg?auto=webp&amp;s=c3f24c29820a9139e0d86a74771d7a8d6b56cdbe"
        },
        "permalink": "/r/movies/comments/1l1k9my/m3gan_20_final_trailer/"
    },
    {
        "id": "1l1jqg6",
        "author": "GarfieldFunyCat",
        "title": "Are there any movie adaptations that you believe are better than the original source material?",
        "content": "I know the general consensus is that \"the book is always better\". But do you have any examples of when a movie is actually better than what it is adapting? This can go for any adaptation, not just books. Plays, comics, games are in the mix as well.\n\nI personally think that Stanley Kubrick's adaptation of A Clockwork Orange far exceeds the original novel, but that's just me.",
        "upvotes": 50,
        "comments": 389,
        "media": null,
        "permalink": "/r/movies/comments/1l1jqg6/are_there_any_movie_adaptations_that_you_believe/"
    },
    {
        "id": "1l1rh93",
        "author": "Bullingdon1973",
        "title": "Mohammed Lakhdar-Hamina obituary: The first Arab and African director to win Cannes’ Palme d’Or",
        "content": "",
        "upvotes": 22,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/INr4Vm42NsQT8cl-EQYeOWaoWdOeN4Eo3MIcbLqFC84.jpg?auto=webp&amp;s=3f96aec87524b71fc2efb58ee25ebe564530c636"
        },
        "permalink": "/r/movies/comments/1l1rh93/mohammed_lakhdarhamina_obituary_the_first_arab/"
    },
    {
        "id": "1l1mc44",
        "author": "BunyipPouch",
        "title": "'Tim Travers and the Time Traveler's Wife' - Official Trailer - Sci-Fi Comedy Starring Samuel Dunning, Joel McHale, Felicia Day, Danny Trejo, Keith David - A mad genius travels to the past to try to kill himself in order to solve the Time Traveler's Paradox.",
        "content": "",
        "upvotes": 33,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qHkDjUGiQNaxEWBrZmfddretSB4XfoykP7WfDmJT0lE.jpg?auto=webp&amp;s=d954e14396535dfb4fa8459623584303c9145a80"
        },
        "permalink": "/r/movies/comments/1l1mc44/tim_travers_and_the_time_travelers_wife_official/"
    }
]