[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 33,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 12,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pv1y5j",
        "author": "DiesIrae7",
        "title": "Anyone else open Netflix and immediately feel… stuck?",
        "content": "This happens to me more than I’d like to admit. I’ll open Netflix with time to watch something, scroll around for a bit, and then nothing really feels right. \n\nEven when Netflix is recommending stuff that seems like it should be up my alley, I still sometimes end up scrolling and not feeling great about any choice. \n\nI’m sure I’m not alone in this and depending on my mood at the time, end up feeling frustrated, overwhelmed, or even at times indifferent. Curious to know what usually goes through your head in that moment?",
        "upvotes": 273,
        "comments": 81,
        "media": null,
        "permalink": "/r/netflix/comments/1pv1y5j/anyone_else_open_netflix_and_immediately_feel/"
    },
    {
        "id": "1pv9fu9",
        "author": "Dex_Stlap",
        "title": "Peaky Blinders: The Immortal Man | Official Teaser | Netflix",
        "content": "Waiting for this masterpiece to come out \n\nBy the orders of peaky f\\*\\*\\*\\*\\*\\* blinders \n\nPeaky blinders immortal man  coming this march in selected cinemas &amp; Netflix \n\nVery excited ",
        "upvotes": 21,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1pv9fu9/peaky_blinders_the_immortal_man_official_teaser/"
    },
    {
        "id": "1pvdh9h",
        "author": "No-Actuary-8088",
        "title": "Is cinema dying?",
        "content": "I think yes, cinema is dying because people don't like to go there anymore, it doesn't resonate enough compared to the past. There are plenty of reasons, such as rising prices of tickets, streaming services, and more. But we still need to go to the theater for its collective experiences. The shared laugh and shocking factors motivate us to attend movie theaters despite their high ticket prices or simply to keep up the trend. According to history, cinema has provided a major dominance for media experiences; a big screen was an innovative thing for people to view. However, this doesn't resonate with our current status anymore. Everything is provided on screens with endless content, reinforcing the reason not to attend the cinema anymore. Streaming services provide comfort and even cheaper price than the cinema but endless comfort. From the perspective of Cinema, they are trying their best to operate the cinema to compete with streaming services such as ODEON, providing a monthly subscription with endless movies. Well, this strategy doesn’t seem as efficient as it thinks; people are still not attending movies as much as the cinema companies intended. Moreover, movies are not as entertaining as before because the film industries are making sequels to prequels to gain a safety net of profit in box office revenue. Hollywood is literally operated in risk reduction nowadays, to avoid risk as much as possible. This behavior creates a lack of original content that people are demanding. However, maybe we are seeing the fade of cinema as nostalgic sadness because it is full of memories. But why do we still need cinema? People still demand cinema, because of its collective experiences, just like people go to a restaurant.\n\nFor cinema to thrive again, it should reconsider its historical pattern of how cinema counterattacked and learn from its threats. First of all, the appearance of television in the 1940s was a major threat to the film industry, and cinema counter-responded with bigger screens and a spectacle experience, where it created IMAX and Dolby Atmos. For the home video era, the response was blockbusters to overcome the quality of home experiences and increase the need for cinema attendance. For the streaming age, the threat is major due to the unlimited content provided with matchable quality. The convenience and binge culture are major standouts for streaming to dominate the media culture. But how are cinema responding? They are trying to enhance and promote the theatrical experience as much as possible, but it is not as much. I believe there should be technological breakdowns, such as Virtual reality, Artificial Intelligence, and sensory technologies, equipped in theatrical experiences. Unless Cinema stands as a major cultural and technological dominance in the ever-growing competitive environment.\n\n",
        "upvotes": 5,
        "comments": 93,
        "media": null,
        "permalink": "/r/netflix/comments/1pvdh9h/is_cinema_dying/"
    },
    {
        "id": "1puvzld",
        "author": "Li3Ch33s3cak3",
        "title": "Best netflix shows to binge right now",
        "content": "I’m looking for some new shows to binge-watch on Netflix. I feel like I’ve seen most of the popular ones, but I’m still missing a few gems. What are some underrated shows that you think more people should check out? Or if there’s something new you’ve been watching that’s really hooked you, let me know!",
        "upvotes": 164,
        "comments": 258,
        "media": null,
        "permalink": "/r/netflix/comments/1puvzld/best_netflix_shows_to_binge_right_now/"
    },
    {
        "id": "1pvgpu2",
        "author": "Atlast_2091",
        "title": "Apex | Official Teaser | Netflix",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pvgpu2/apex_official_teaser_netflix/"
    },
    {
        "id": "1pv6ttp",
        "author": "ThreadAndSolve",
        "title": "Rewatching Stranger Things Season 4 made me realize that we lost the battle to win the war.",
        "content": "Most of us view the Season 4 finale as a tragedy. Max died (technically), the gates opened and Hawkins fell. It seemed like the heroes were finally outmatched. However, rewatching *The Piggyback* and *Papa* suggests that failure was actually a necessary setup. Season 4 served as a schematic of Vecna’s battery rather than just a horror story.\n\nThe most significant line in Season 4 came from Dr Brenner. When explaining Henry’s powers, he stated that Henry consumes his victims. They are not simply gone. They remain part of him.\n\nWe treated this as a throwaway horror line, but it is the key mechanic of the entire series. Vecna is absorbing consciousness to build a hive mind of souls. This means his greatest strength is also his fatal flaw. He has thousands of people trapped inside his head.\n\nIn the Season 4 finale, Eleven tried to save Max by piggybacking into her mind. She fought Vecna on his turf and fought defensively. She tried to be a shield. That failed because you cannot out-power Henry in his own domain.\n\nHowever, the loss established a crucial rule. Eleven can enter the mind of someone Vecna has consumed.\n\nThis brings us to Volume 2 and the confirmed episode title *Escape from Camazotz*.\n\nWe know from Volume 1 that Max and Holly are trapped in that mind-layer. Everyone worries about Eleven fighting her way in to get them. We might be looking at this backward. The Season 4 defeat placed a virus directly inside Vecna’s operating system.\n\nMax is not just a victim waiting to be saved. She is a bomb waiting to go off.\n\n*Running Up That Hill* became the anthem of the season for a specific reason. The lyrics speak about making a deal with God to swap places. This foreshadows the strategy for the finale.\n\nEleven and Max might need to switch roles. In the past, El protected Max physically. Now, Max is the one positioned to strike from the inside while El holds the line on the outside. The song told us the plan all along.\n\nThis leads to the letters. Max wrote letters to everyone, including Steve, Dustin and her mom, just in case. She never read them. Those letters are a weapon that has not been fired yet.\n\nIn Volume 2, those letters will likely serve as the totem that wakes Max up inside Vecna’s mind. Unlike Billy, who needed El to remind him of who he was, Max has her own anchor ready.\n\nSeason 4 had to end in defeat so that Max could be consumed. It was the only way to get an agent behind enemy lines. In the finale, El will likely not defeat Vecna with telekinesis alone. She will trigger the souls inside him to revolt. The piggyback was the rehearsal. The real plan is a mutiny from the inside out.",
        "upvotes": 20,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1pv6ttp/rewatching_stranger_things_season_4_made_me/"
    },
    {
        "id": "1pvhjde",
        "author": "LegitimateCurve8525",
        "title": "What references you guys spotted in this new teaser for January 7",
        "content": "I found the reference of Avatar, Chronicles of Narnia, maybe Alice of Borderland and Sesame Street. What did you guys picked up and what do you think will happen in this event?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pvhjde/what_references_you_guys_spotted_in_this_new/"
    },
    {
        "id": "1pvcpyk",
        "author": "443610",
        "title": "The Boyfriend Season 2 | Official Trailer",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pvcpyk/the_boyfriend_season_2_official_trailer/"
    },
    {
        "id": "1pvb0lg",
        "author": "fuckGasterThisMf",
        "title": "Help with error-100",
        "content": "Everytime I want to watch netflix, i get a text saying errro-100, Im on firefox so I updated it, de-activated the Netflux extention, de-activated DRM then re-activated it and I still get the error message. Is there any way to fix this, beside changing browser ?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pvb0lg/help_with_error100/"
    },
    {
        "id": "1pveadj",
        "author": "External_Memory_2844",
        "title": "Why does Netflix restrict certain shows to specific regions?",
        "content": "I’ve noticed that some shows and movies are available on Netflix in certain countries but completely unavailable in others. Even when you’re paying for the same subscription, the content library changes based on location.\nWhy does Netflix do this? Is it because of licensing, local laws, or something else? And is this likely to change in the future, or will region-based content always be a thing? What’s the point? ",
        "upvotes": 2,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1pveadj/why_does_netflix_restrict_certain_shows_to/"
    },
    {
        "id": "1pud2t0",
        "author": "Wonderful_Highway629",
        "title": "People with money can afford no ads so they are marketing products to people with no money",
        "content": "The pay more for no ads model makes no sense.  People without money buy the ad version of the streaming service while people with money do not.  Advertisers end up marketing their products to poor people who cannot afford their products anyway while people with more disposable income see no ads.  It’s a really dumb setup.",
        "upvotes": 468,
        "comments": 119,
        "media": null,
        "permalink": "/r/netflix/comments/1pud2t0/people_with_money_can_afford_no_ads_so_they_are/"
    },
    {
        "id": "1pvh9y2",
        "author": "CandidLiving5247",
        "title": "How can I watch football today without signing up and then canceling tomorrow?",
        "content": "NFL fan here.  Netflix has ruined a family tradition of watching football (just in the background really) on Christmas Day.  \n\nOther than signing up again (which I swore I’d never do) and then immediately calling up to cancel tomorrow - any other options?\n\nI’d hate to give them a month of money but I’m not sure what else to do (and it’s not a nice feeling)",
        "upvotes": 0,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1pvh9y2/how_can_i_watch_football_today_without_signing_up/"
    },
    {
        "id": "1pudpow",
        "author": "the_Snowmannn",
        "title": "A Man on the Inside",
        "content": "Seriously underrated show.  Ted Danson is awesome.  A couple Easter egg call outs in late season two, to another show he was in a few years ago (actor cameos/footage).\n\nFunny and emotional and pretty friggin great.",
        "upvotes": 142,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1pudpow/a_man_on_the_inside/"
    },
    {
        "id": "1puqopt",
        "author": "Maleficent-Term-126",
        "title": "Deleted Scenes For Guillermo del Toro's 'Frankenstein' Will Be Included in the Physical Release",
        "content": "",
        "upvotes": 12,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1puqopt/deleted_scenes_for_guillermo_del_toros/"
    },
    {
        "id": "1pv98j7",
        "author": "almour",
        "title": "Christmas",
        "content": "When do they get rid of Christmas movies and go back to normal movies?  Not a grinch,  but seems half of movies are Christmas movies! Happy Christmas everyone ",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1pv98j7/christmas/"
    },
    {
        "id": "1pv2o1q",
        "author": "madelinebuns30",
        "title": "Happy Merry Whatever",
        "content": "I love Happy Merry Whatever and wish there were more Christmas “shows”, there I said it. I love my Christmas movies don’t get me wrong but this format of a limited series around Christmas is gold and I have no idea why it’s more a more popular model. Ive done some light googling and haven’t come up with anything with similar vibes, can anyone make any recommendations?! ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pv2o1q/happy_merry_whatever/"
    },
    {
        "id": "1pv8ihu",
        "author": "Standard_Area10",
        "title": "The sandman ending rant *SPOILERS*",
        "content": "I have no one to vent this to. I am so upset about the plot twist in season 2 of the sandman. SPOILER. I am glad the show got canceled. When Dream dies and daniel is his replacement, i genuinely do not think i’d still enjoy the show knowing the main character who i’ve been attached to is dead, and in replace the new man character has only been on the show for one episode. that’s not enough for audiences to get to know and love the new main character. Although I admit there could have been many good outcomes of this, however I don’t think i would have liked the show as much as when Dream was the main character. I think it was a good time to end the show. I would not have watched further. Thoughts?  ",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1pv8ihu/the_sandman_ending_rant_spoilers/"
    },
    {
        "id": "1puwt0x",
        "author": "Legal-Boysenberry-38",
        "title": "Best Documentary/Short Movie?",
        "content": "I need a documentary or short movie to watch with family. Can be rated R if needed, in fact that may be betted. \n\nCan be on Amazon Video, or Netflix.\n\nWhats a must watch currently or what is underrated?",
        "upvotes": 1,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1puwt0x/best_documentaryshort_movie/"
    },
    {
        "id": "1puwh9h",
        "author": "Commercial-Ad-5723",
        "title": "Ripple",
        "content": "I watched episode one. Unsure if I want to proceed. Has anyone watched this series? If so, does it get any better? It seems a bit contrived in the attempt to intersect these people’s lives. ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1puwh9h/ripple/"
    },
    {
        "id": "1puf6cx",
        "author": "Secretly_Wealthy90",
        "title": "I highly recommend the Movie \"Relay\" on Netflix US",
        "content": "the movie \"Relay\" just dropped on Netflix in the U.S. it was in theaters this past August. fresh plot that many of you will enjoy. good plot twist in the end :)",
        "upvotes": 29,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1puf6cx/i_highly_recommend_the_movie_relay_on_netflix_us/"
    },
    {
        "id": "1pv8fe2",
        "author": "Legitimate-Coffee836",
        "title": "peacock premium",
        "content": "I have two 2 month free peacock premium codes and two 1 month free peacock premium codes, I’m not using them. if anyone wants it just send me a message. I’ll give it to whoever Venmo’s $10 for the 2 month sub or $5 for the 1 month sub, which is way less than what the subs would actually cost ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pv8fe2/peacock_premium/"
    },
    {
        "id": "1pun6tf",
        "author": "Available-Towel-8222",
        "title": "[US] Anyone else find the relationship dynamic on The Next Act uncomfortable to watch?",
        "content": "First of all, I will say the show is overall great. These young talents are adorable and I think something special will come from this journey they are on but what in the heck am I watching when it comes to Simon’s relationship with his wife?!\n\nThe way Simon Cowell’s relationship is showcased felt awkward, immature, and at times honestly uncomfortable to watch. There were moments where the dynamic came off as childish yet oddly overbearing, like a push-and-pull that never quite lands as playful or loving. Instead of feeling warm or endearing, it often felt tense and unsettling.\n\nWhat made it more jarring was the contrast, this is someone known for control, precision, and authority, yet the relationship on screen felt emotionally clumsy and strangely unbalanced. It didn’t read as healthy banter or confident love, but more like two people stuck in a loop of immaturity masked as affection.\n\nOf course, editing plays a role, and we never see the full picture. But what was shown felt surprisingly raw in a way that raised eyebrows, not because it was honest, but because it seemed normalized despite how uncomfortable it came across.\n\nCurious if anyone else felt the same watching it.",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1pun6tf/us_anyone_else_find_the_relationship_dynamic_on/"
    },
    {
        "id": "1pv8o3v",
        "author": "s_musaahmed",
        "title": "Netflix bruh",
        "content": "Netflix: helps you perfectly spell the movie name\n\nAlso Netflix: Nice try 😌 But you don’t have access to this title. Want to watch something else instead?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pv8o3v/netflix_bruh/"
    },
    {
        "id": "1puygi1",
        "author": "WorkerEfficient5622",
        "title": "Stranger things season 1",
        "content": "In stranger things 1 How does hopper finding out will’s body being found by state troopers as well as his autopsy being done by state, lead him to become suspicious they’re working for the lab and that the body was fake ?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1puygi1/stranger_things_season_1/"
    },
    {
        "id": "1pv7xmo",
        "author": "kingcreepr",
        "title": "I roughly described \"the package\" for a friend",
        "content": "So basically there on a hiking trip with friends and one of the characters accidentally cut off his dih so they put in ice and emts came and took him to the hospital then realized they took the wrong cooler but there like on a mountain and lose the ice (btw you need to put in ice then you have 12 hrs to reattach) anyway they go through alot of trouble like it getting bit by a snake then a guy having to suck out the venom ( it wasn't even venomous😭) they get to the hospital think they found him but it's really some redneck so then they have to rush to the hospital and save him.\n\n\nIs it good",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pv7xmo/i_roughly_described_the_package_for_a_friend/"
    },
    {
        "id": "1pv6kjm",
        "author": "Strange-Tap3241",
        "title": "Stranger things discrepancy; hospital name",
        "content": "Will sees Robin at the hospital while he's visiting Max with Lucas. Robin's there bc Vickie is a candy striper. Later, Robin and Will go back to this hospital to get benzos and the sign says \"Hawkins Memorial\". Later on in episode 4 Max says to Holly \"why am I not dead? Why am I in Hawkins General right now? Unless someone can tell me these are the same hospital... Idk",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pv6kjm/stranger_things_discrepancy_hospital_name/"
    },
    {
        "id": "1puwfz4",
        "author": "Calm_Highlight_9320",
        "title": "Tom Segura - Audio Sync Issues",
        "content": "Anyone seeing chronic lip sync issues with Tom Segura's new special?\n\nConfirmed on multiple devices - so not hardware related.\n\nHow is it possible these days to mess up something so basicl",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1puwfz4/tom_segura_audio_sync_issues/"
    },
    {
        "id": "1pv9d2l",
        "author": "Appropriate_Bed_5952",
        "title": "My Secret Santa (Netflix) - I'm furious",
        "content": "We all know Netflix make shows in 5 minutes but every time I see something like \"My Secret Santa\" I get furious how can we make it happen and give it a 5 or 6 rating on u/IMDB. Nothing on reddit also, noone is talking about how stupid it is!! CAn't believe I'm the only sane person left in the whole world! Come on we need to wake up ! Just watch and see there is no logic no emotional intelligence ! Peopleeeeee vjdlknhvfovhiapdf",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1pv9d2l/my_secret_santa_netflix_im_furious/"
    }
]