[
    {
        "id": "1rfqabp",
        "author": "AutoModerator",
        "title": "Netflix Declines to Raise Offer for Warner Bros.",
        "content": "",
        "upvotes": 290,
        "comments": 58,
        "media": null,
        "permalink": "/r/netflix/comments/1rfqabp/netflix_declines_to_raise_offer_for_warner_bros/"
    },
    {
        "id": "1rgt85m",
        "author": "Middle-Abalone-3142",
        "title": "Saddest Movie On Netflix…",
        "content": "I’ve been debating what the saddest/ most emotional movie I’ve see on Netflix was, but I want to know what you guys think. For me, the simple movie called Straw was so emotional and I loved the ending. A similar movie that just twisted me the wrong way was “In the Tall Grass”. I don’t know if I’d call it sad as much as I would call in unfortunate or confusing. But what do you guys think, what’s the saddest movie on Netflix??",
        "upvotes": 18,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1rgt85m/saddest_movie_on_netflix/"
    },
    {
        "id": "1rgsaq6",
        "author": "Middle-Abalone-3142",
        "title": "Emotionally Hooking Shows??",
        "content": "As you guys all probably know, Stranger Things ended just about 2 months ago and looking back at the 4 months I watched it in, those were some of the best days because a show can just leave that impact. Now, it wasn’t just the actual show that made it amazing, getting to watch it with my brothers and cousins, late night watches, and watch parties with some of my favorite people for S5 all contributed to making it my favorite show! Now I know I cannot replicate some of those factors, but an amazing, hooking, emotional show can help start the process of finding a show to cover up the sadness from ST being over. Please recommend a show you think I should watch that will start another stage of happiness and deep thoughts and conversations related to the show. Maybe a show that you just personally loved or even a show where you had a similar experience as I did! Anything, just please give recommendations for shows on Netflix that I will fall in love with. (Show could be on Disney +/Hulu as well)",
        "upvotes": 11,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1rgsaq6/emotionally_hooking_shows/"
    },
    {
        "id": "1rfwr79",
        "author": "CockroachPowerful387",
        "title": "being a college kid who uses netflix is infuriating.",
        "content": "I had a midterm today. and all i wanted to do when I got home was watch the new season of bridgerton. but I open the website only to be met with a message saying 'you're not on your home wifi (BECAUSE OF COURSE IM NOT) and we can send a code to your email for 14 days blah blah blah' and it makes me so so so mad because whenever im watching tv its at night after my mom has gone to sleep, so I cant call her and get the code. So here I am, my day ruined, because all I wanted to do was watch bridgerton. i sound dramatic I know but this is so infuriating",
        "upvotes": 761,
        "comments": 167,
        "media": null,
        "permalink": "/r/netflix/comments/1rfwr79/being_a_college_kid_who_uses_netflix_is/"
    },
    {
        "id": "1rgtgwe",
        "author": "Obvious-Cucumber1086",
        "title": "Just finished behind her eyes. Anything similar that’s good?",
        "content": "I really liked it especially with the plot twist at the end I had to go through the whole thing to make it make sense after lmao\n\nDo you know any other good movies that are around the same realm as this? I only have Netflix &amp; Amazon prime!",
        "upvotes": 7,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1rgtgwe/just_finished_behind_her_eyes_anything_similar/"
    },
    {
        "id": "1rgvctq",
        "author": "Ori_barttlet",
        "title": "Oigan, ¿alguien me explica el final de \"No vayas a casa\"?",
        "content": "El final me dejo loca, estaba al principio pensando que eran dos lineas temporales diferentes pero que Min y Varee fueran la misma me destrozo cualquier teoría anterior que tuviera.  \nTengo como 3 teorías, la primera es que sigue la linea sanguínea continua, y de alguna forma en este universo puede ser prácticamente idéntica a sí misma. Pero no cuadra ya que tienen el mismo ADN, así que en algún momento de otra L.T. (Linea temporal) antes de la muerte de la hija de Panida, se esfumo por las primeras rupturas temporales que experimento Panida, y la Varee de 2024 (En la L.T de la serie) la adopto, y en esa L.T. se quedo en búcle a razón de las rupturas temporales.\n\nPor el momento esa me convence, de ser otra resulta en un final incestuoso que continua con la nieta, bisnieta, tataranieta, etc. De Panida.  \nAunque el padre no sea el coronel, ya que el mismo lo admite, la panza de Varee-Min sigue ahí por lo tanto el incesto sigue presente. Okey, ya me volví a contradecir. Ya que Varee-Min tiene una panza de embarazada a menos que no sea, supongo que mi anterior teoría tiene sentido.\n\nEntonces.. que tal que haya tenido relaciones consigo misma con una Varee del 91 (pero hombre) que por las rupturas temporales (y lineales) vino a otra linea en el mismo tiempo y tuvo una hija con la Varee- Esto está muy revoltoso. (por no decir turbio)\n\nBueno.. ¿alguien tiene otra teoría o queda como paradoja o inconsistencia?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rgvctq/oigan_alguien_me_explica_el_final_de_no_vayas_a/"
    },
    {
        "id": "1rg9m4a",
        "author": "Similar_Designer_251",
        "title": "K-drama The Art of Sarah proves that, in Korea, luxury goods are ‘like an ID card’",
        "content": "",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1rg9m4a/kdrama_the_art_of_sarah_proves_that_in_korea/"
    },
    {
        "id": "1rgpk8r",
        "author": "LordSmokdMeatsNFishs",
        "title": "I binged Zelenskyy's \"Servant of the People\" before its leaving Netfix after Wednesday March 11 2026. Here are the essential episodes.",
        "content": "Essential episodes total ~5.5 hours.  Optional, + ~3.5 hours.  (IMO.)\n\n\nseason 1 episode 1 (premier, a double)\n\nseason 1 episode 15\n\nseason 1 episodes 23-24 (season finale)\n\nmovie \"Servant of the People 2\" (alternate tale of entire season 2)\n\nOPTIONAL: season 2 episodes 18-24 (unlike movie, what if: President Vasily resigns in defeat, triggers re-election of President, re-runs for Presidency (same outcome))\n\nseason 3 (all episodes 1-3, a futurama timejump)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rgpk8r/i_binged_zelenskyys_servant_of_the_people_before/"
    },
    {
        "id": "1rfj6s5",
        "author": "Ary1n_07",
        "title": "Midnight mass is netflix's best in horror",
        "content": "I know I am going to get toh of hate for this but hear me out .\nFrom the starting to the end , there are hardly any flaws in it .\nThe soundtrack, jumprsacres, character development are upto the mark .\nAnd the ending , it's one of the most beautiful (and hurtful) at the same time .\nI cried .\nStranger things is close for me , but midnight mass will always be the 1st .\n",
        "upvotes": 225,
        "comments": 68,
        "media": null,
        "permalink": "/r/netflix/comments/1rfj6s5/midnight_mass_is_netflixs_best_in_horror/"
    },
    {
        "id": "1rghjj4",
        "author": "Safe_Death2250",
        "title": "Bad video quality on SOME Netflix content issue",
        "content": "Hi, I have a very weird issue that I can’t seem to find anyone else reporting.\n\nDespite being on the standard plan (no ads, full HD), some content doesn’t play in full HD. More like 720 or 480.\n\nAnd this is despite them having HD badge on the info screen\n\nExamples include Prometheus and Ex Machina",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1rghjj4/bad_video_quality_on_some_netflix_content_issue/"
    },
    {
        "id": "1rg6c4u",
        "author": "Longjumping-Web-9808",
        "title": "Logged into a random family’s account",
        "content": "I logged in to use Netflix on my ps5 and all of the profiles are random names and the linked email isn’t mine. Pretty sure my family only has 1 Netflix account which is untouched on all my other devices. Is this some sort of weird bug? ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1rg6c4u/logged_into_a_random_familys_account/"
    },
    {
        "id": "1rgezu7",
        "author": "Kaskelontti",
        "title": "Korean series",
        "content": "Somebody out here that started to watch some random korean series and is now thinking that most of the american or european series are bit dull compared to korean series?",
        "upvotes": 1,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1rgezu7/korean_series/"
    },
    {
        "id": "1rgdzi8",
        "author": "michael-gary_scott",
        "title": "Need suggestions for thriller shows",
        "content": "Please suggest some good thrillers shows I can watch over the weekend. My fav thrillers are Breaking Bad, Money Heist, True Detective Season 1 and Narcos\n\nPlease don’t suggest anything below IMDB 8.0 ",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1rgdzi8/need_suggestions_for_thriller_shows/"
    },
    {
        "id": "1rgcoyf",
        "author": "v3xzz",
        "title": "Squidgame: USA",
        "content": "The US spin-off (not a remake) starts filming 26th february 2026. organization behind the project:\n\n\\- ​Director: David Fincher\n\n\\- Producers: Zeus Zamani, Rhett Giles\n\n\\- Executive Producer: Hwang-Dong-Hyuk (original creator of squidgame)\n\n\\- ​Dennis Kelly writes the script.\n\nWhat are you thoughts about an American version?",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1rgcoyf/squidgame_usa/"
    },
    {
        "id": "1rgbokg",
        "author": "Only-Standard445",
        "title": "Natasha arc in Accused",
        "content": "They started the whole Natasha’s arc in Dr. Geetika’s past, but let it completely unexplored and unexplained. Did anyone notice this?\n\nI thought they’ll reveal something in the end, but alas!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1rgbokg/natasha_arc_in_accused/"
    },
    {
        "id": "1rgq5cs",
        "author": "prefabsprout1",
        "title": "Why does Seinfeld look so bad?",
        "content": "Can someone explain why Seinfeld looks like such dog sh$&amp; on Netflix? It’s not because they blew up the 4 x 3 into a wide screen. I’ve seen plenty of shows that I’ve done that which looked fine. It’s like all the episodes were transferred at low compression or something? It’s all very blocky and just looks very low Rez. Other Netflix shows definitely don’t look like that.",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1rgq5cs/why_does_seinfeld_look_so_bad/"
    },
    {
        "id": "1rfuyz3",
        "author": "Ohi_111",
        "title": "Bridgerton season 4",
        "content": "I think season 4 of Bridgerton is the best season so far. Omg I really enjoyed this season. The chemistry Benedict and Sophie had was incredible and the storyline was 10/10. Felt like a love/romance fairytale happy ending I loved it.",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1rfuyz3/bridgerton_season_4/"
    },
    {
        "id": "1rg1g14",
        "author": "Appropriate_Gur7902",
        "title": "IF YOU LIKE K-DRAMAS LIKE MASK GIRL WATCH THE ART OF SARAH",
        "content": "If you like K-dramas that revolve around transformation or reinvention, whether it is physically or internally or both, definitely watch The Art of Sarah. It's thrilling, gripping, and the perfect amount of predictable. the show celebrity also has similar themes! ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1rg1g14/if_you_like_kdramas_like_mask_girl_watch_the_art/"
    },
    {
        "id": "1rff0nn",
        "author": "Outrageous-Baker5834",
        "title": "Apple and Netflix join forces to distribute F1 2026 content",
        "content": "",
        "upvotes": 37,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rff0nn/apple_and_netflix_join_forces_to_distribute_f1/"
    },
    {
        "id": "1rf9ft8",
        "author": "fraction00",
        "title": "Is House of Cards (U.S) worth watching?",
        "content": "I am thinking of watching House of Cards on Netflix. Since it’s 6 seasons long, It’s better to be worth my time. Can I watch it? Is it worth watching? I like political thrillers in general. I liked the Diplomat",
        "upvotes": 46,
        "comments": 89,
        "media": null,
        "permalink": "/r/netflix/comments/1rf9ft8/is_house_of_cards_us_worth_watching/"
    },
    {
        "id": "1rfla35",
        "author": "Specialist_Tone2797",
        "title": "Why do Netflix series feel the same?",
        "content": "Just watched some of their newer series like Beast in me, Black Rabbit and His and Hers. I have to say that Netflix original series are awful. They all feel recycled and it feels like they have no substance to them, just packaged nicely with good visuals and top tier actors, but the end product is mediocre at best. \n\nI know this has always been a criticism for Netflix but I can’t help but feel like it’s getting more prevalent. Don’t even get me started on their original movies, they’re even more awful. Why can’t they hire good writers for their scripts , because they end by being totally bland and repetitive. Why would they spend so much on actors and production but cheap out on hiring competent writers. ",
        "upvotes": 13,
        "comments": 86,
        "media": null,
        "permalink": "/r/netflix/comments/1rfla35/why_do_netflix_series_feel_the_same/"
    },
    {
        "id": "1rfsapy",
        "author": "muad_dib_the_maker",
        "title": "Why do you splat horrible imagery all over the app before signed in to a profile",
        "content": "My remote control has a Netflix button.\n\nI supervise my 4 year olds tv time other than when getting her a drink or plating up her dinner.\n\nYet for the 2nd time tonight she has been traumatised by god awful splashes for horror shows that are plastered all over the netflix home page since when you open the app it defaults to selecting the last used profile. \n\nWhy do I have to come back into the room to her crying in fear over that demon girl with the teeth. She doesnt use the remote to press the button. She leans on the remote and the Netflix button gets pressed.\n\nThis could be avoided by me being extra vigilant. Taking the remote with me at all times everywhere I go. Always ensuring that I dont leave it on my sofa. \n\nBut why the fuck should I, just dont advertise the shows until Im logged into a profile. Or give me the option to turn off this shit. \n\nIm an adult. I like scary stuff. My wife and daughter dont. \n\nStop forcing horrible, nightmare inducing images on kids. \n\nAnd I will try and duct tape my remote control to my leg in the meantime.\n",
        "upvotes": 6,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1rfsapy/why_do_you_splat_horrible_imagery_all_over_the/"
    },
    {
        "id": "1reng13",
        "author": "RiskAndReason",
        "title": "What’s that one Netflix show you think is an absolute must-watch?",
        "content": "The kind where you’d say, “I can’t believe you haven’t seen this yet.”\n\nLooking for something great to start next, classics or hidden gems both welcome.",
        "upvotes": 953,
        "comments": 1746,
        "media": null,
        "permalink": "/r/netflix/comments/1reng13/whats_that_one_netflix_show_you_think_is_an/"
    },
    {
        "id": "1rgcxu0",
        "author": "Fabulous-Drawing-875",
        "title": "Is March the biggest month Netflix has had in years?",
        "content": "I just looked at the lineup for next month and it's actually stacked.\n\nWe’re getting One Piece Season 2, the Peaky Blinders movie, and that new horror show Something Very Bad Is Going to Happen. Im lowkey most excited for the horror one since it’s produced by the Duffer Brothers and looks super atmospheric.\n\nIt feels like Netflix is finally moving away from the \"cheap\" look and actually putting money into stuff that looks like cinema again.\n\nWhat are you guys actually planning to watch next month?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1rgcxu0/is_march_the_biggest_month_netflix_has_had_in/"
    },
    {
        "id": "1rfwnxu",
        "author": "CodDefiant2710",
        "title": "Baki-Dou: The Invincible Samurai, on Netflix",
        "content": "[Miyamoto Musashi](https://en.wikipedia.org/wiki/Miyamoto_Musashi) was the greatest samurai of the Edo Era, who, according to legend, cut through the Shogunate’s enemies like butter during the Battle of Sekigahara. Much to his surprise, a cutting-edge cloning project reincarnates him (with a little magical help from a “medium”) to fight the worst scourge of the 21st Century: boredom. The cure is deadlier than the disease, but those are risks Baki Hanma’s fellow underground fighter colleagues willingly embrace in [**Baki-Dou: The Invincible Samurai**](https://www.imdb.com/title/tt38201910/?ref_=mv_close), the latest anime series adapted from Keisuke Itagaki’s [**Baki the Grappler**](https://kodama-tales.com/baki-the-grappler/) manga franchise, directed by Toshiki Hirano, which premieres today on Netflix.\n\n[https://cinemadailyus.com/reviews/baki-dou-the-invincible-samurai-on-netflix/](https://cinemadailyus.com/reviews/baki-dou-the-invincible-samurai-on-netflix/)",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1rfwnxu/bakidou_the_invincible_samurai_on_netflix/"
    },
    {
        "id": "1rflbxw",
        "author": "AConant",
        "title": "Recommendation for West Wing episode \"In Excelsis Deo\"",
        "content": "New to the forum.\n\nI was always told I would like West Wing, but I have only recently started binging it on Netflix.\n\nI just finished the episode \"In Excelsis Deo\" and it moved me to take the time to share this recommendation.\n\nThe episode can stand alone but there are multiple threads happening in the arc that you will miss...but the main story is about military service, and loss and the honor due and so often unpaid for their service.\n\nI'm 57 - never served myself, but my life was influenced by my father's Vietnam service, which has been a scar on his soul that also wounded us all.\n\nMy father had never seen the Vietnam Memorial and DC - he always wanted to but only got to see the small traveling version some years ago when it passed through his town.\n\nBoth my parents are getting near the end of their lives. I took my parents to DC so he could see it before it is too late. It was a dream of his since it was built.\n\nIt was powerful moment and life event for us all.\n\nI had been to DC but never seen the Korean memorial somehow. Didn't even know it existed which is a shame as it is very powerful.\n\nAfter we spent some time at the Vietnam Wall, we wandered through the park with no particular plan. We approached the Korean memorial without knowing it was there, and as we came up through the trees, the soldier statues appeared like phantoms emerging from the shade cast by the trees we walked through.\n\nIt was a powerful and eerie experience. Like ghosts emerging from the dark I was very impressed and now see that memorial as probably the most powerful in DC. I mention it because the episode features it in the story.\n\nAnyway, I have not often been moved to share something like this, but I thought it was worthy. I found the story moving and beautiful, and my friends were right - so far, it is an excellent show...made only more engaging and honestly, frustrating by the current state of the country.\n\nIt is hard to see a dramatic representation of the presidency and government that is at least somewhat reminiscent - and even, to some degree - honorific - compared to the current permanently stained version of the office. The contrast is actually quite sad, while also giving me some much-needed hope - if only a little bit - hope that maybe in the future we might see something closer to what we once thought of it.",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1rflbxw/recommendation_for_west_wing_episode_in_excelsis/"
    },
    {
        "id": "1rfw80n",
        "author": "katerinaa_petrova",
        "title": "This OP would very much like to know what the society thinks of our Bridgerton matches!?",
        "content": "Dearest gentle reader , \n\nAs the S4 is in gossip already, this OP likes to tell her audience that I very much liked beloved Sophie and benedict and the bond they harboured, heavens forbid , I even had a steady feeling that I MIGHT like them as much as I enjoyed Kate and Anthony. But , my dear reader , as the S4 progressed , I realised the love, the bond, the chemistry, everything Kate and Anthony had, bewitched my heart on a level that even though I loved Sophie and Benedict so much , it was impossible for op to love them like little edwand's parents. \n\nAs the season came to an end , I would like to admit that the show could've been a done a lot better if whistledown was still a mystery. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rfw80n/this_op_would_very_much_like_to_know_what_the/"
    },
    {
        "id": "1rfudzi",
        "author": "running2reddit",
        "title": "“Famous Last Words” editing approval?",
        "content": "Did Jane or Eric get to approve the show’s editing before they passed? I really love the idea of the show, but I think I can’t really have a full opinion until I know if they approved of the final cut. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1rfudzi/famous_last_words_editing_approval/"
    },
    {
        "id": "1rft47t",
        "author": "30DayRefund",
        "title": "Roku Tip for Netflix 5.1 Surround Sound",
        "content": "Recently I was struggling to get DTS 5.1 surround sound working on my Roku streaming box. Everyone online was saying how incredible the surround sound is with Stranger Things season 5, but I was only getting sound out of my front speakers. \n\nIt turns out there's a little known Roku setting called Volume Mode that disables 5.1 surround sound. Somehow my Roku was set to Volume Mode \"Leveling\". Once I changed that to \"Off\", I was able to watch Stranger Things in glorious room-shaking 5.1 surround sound.😁 I hope this tip helps someone.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rft47t/roku_tip_for_netflix_51_surround_sound/"
    },
    {
        "id": "1rfs03h",
        "author": "OnMyPhoneUndercover",
        "title": "Displayed Video Language",
        "content": "I am situated in Germany and watch Netflix from here. My system language, browser language and netflix's website language are all set to english.\n\n  \nSO why is it, that the video of the episode, for example with supernatural, which started with this BS at S6E1, display german texts. Usually it's \"The road so far\" and then a \"now\", but now it's \"das letzte jahr\" ( the previous year ) and \"heute\" (today). \n\nThis was an issue before but i didn't use netflix for a while, and i reeeeaaally HATE the fact that i get shown a different video, depending on my location. Put it in the subtitles and be done with it.\n\n  \nIs there any hidden setting or something i overlooked to fix this? Please please tell me there is.",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1rfs03h/displayed_video_language/"
    }
]