[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 8,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 96,
        "comments": 300,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mjzix1",
        "author": "LeonNeuton",
        "title": "\"The Internet tantrums have begun.\" -Thanks to Netflix's New split release model.",
        "content": "\nOne common point of contention among both critics and viewers of the new season of Wednesday is Netflix's decision to split the release into two parts. As the first four episodes set up a satisfying new mystery, many feel the mid-season cutoff is abrupt and disrupts the show's momentum, leaving viewers with an \"unsatisfying appetizer\" rather than a complete meal. \n\n\"Fans will have to wait until Wednesday, Sept. 3, for Wednesday Season 2, Part 2 – which will conclude with episodes five through eight.\"\n\nWith so many taking it to the Internet streets; Is the uproar warranted? Or are we just spoiled brats moonlighting as binge divas?",
        "upvotes": 137,
        "comments": 232,
        "media": null,
        "permalink": "/r/netflix/comments/1mjzix1/the_internet_tantrums_have_begun_thanks_to/"
    },
    {
        "id": "1mk7ukr",
        "author": "Dry_Resist8265",
        "title": "Need something new to watch … mystery, drama, rich people problems, good vibe shows?",
        "content": "I’m in a full-on show drought. \n\nJust need something with good story, nice visuals. Mystery or thriller is great, but not full horror. Thanks in advance! ",
        "upvotes": 35,
        "comments": 100,
        "media": null,
        "permalink": "/r/netflix/comments/1mk7ukr/need_something_new_to_watch_mystery_drama_rich/"
    },
    {
        "id": "1mkng3z",
        "author": "MoneyLibrarian9032",
        "title": "Michael Bay Exits Netflix’s Will Smith Action Film ‘Fast and Loose’",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mkng3z/michael_bay_exits_netflixs_will_smith_action_film/"
    },
    {
        "id": "1mjrwod",
        "author": "vladtud",
        "title": "Netflix beauty filter",
        "content": "I really dislike how most Netflix shows have a beauty filter on their female characters. It’s very obvious and distracting while watching. Not that it makes it ok for older characters but what wrinkles does Jenna Ortega even have to hide. Ridiculous! ",
        "upvotes": 166,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1mjrwod/netflix_beauty_filter/"
    },
    {
        "id": "1mk94dn",
        "author": "Similar-Car-3492",
        "title": "error -1000",
        "content": "my and my mother phone app won't open, it says there is a problem with (-1000) at the end, i can't find anything about it online, anyone here knows what does that mean?\ni forgot to add it does work on the tv \nwe are watching movie on it right now\nit returned to normal but i still have no idea what that -1000 means",
        "upvotes": 9,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1mk94dn/error_1000/"
    },
    {
        "id": "1mkjpcu",
        "author": "Southern-Brother5693",
        "title": "Continue Watching - Glitches",
        "content": "Is anyone facing this issue? My Continue Watching list from time to time suddenly includes all the previous titles I have watched. They disappear when I refresh the App but appear again suddenly.\n\nJust weird.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mkjpcu/continue_watching_glitches/"
    },
    {
        "id": "1mkf0fx",
        "author": "Key-Influence-8312",
        "title": "Netflix and Aspect Ratios",
        "content": "I'm planning on setting up a wide screen to watch Gladiator 2 and other wide screen movies. So I was wondering at what aspect ratio does Netflix stream wide screen movies. Any one have any idea? Gladiator 2 for example has a 2.39:1 aspect ratio. \n\n  \nThanks",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mkf0fx/netflix_and_aspect_ratios/"
    },
    {
        "id": "1mkjlrr",
        "author": "Junior_Ostrich_5951",
        "title": "What should I do?",
        "content": "I have the basic Netflix plan and the truth is that I use it at home less at night since I work and well sometimes in my free time I watch one or another series and does it tell me that I should improve the plan to be included in the home plan? How do I solve it, the truth is that it doesn't seem fair to me, I don't even see it with Wi-Fi, I use my mobile data",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mkjlrr/what_should_i_do/"
    },
    {
        "id": "1mkd79w",
        "author": "tinksabellx",
        "title": "Web of Make Believe: Death, Lies &amp; the Internet",
        "content": "Late to the party on this one, but just started watching Web of Make Believe and just finished episode 4: Sextortion.\n\nI’m sure you’re all like me and Google the names of the perpetrators to see where they’re at now….? No? Just me? Nahh I know you’re lying if you say you’ve never done it….\n\nAnyway…\n\nThis episode is based on around 23 girls (literal teenagers) who got a random friend request from a guy and started talking. It then became sexual on his part, and the girls did send some photos of themselves in various states of undress. \nHe then tried to extort them, saying he’ll release the images on the internet first everyone to see.\n\nFinally, after years of harassment, he was named - Ryan Vallee - arrested and charged. He pled guilty and got 8 years.\n\nHe was released in January 2022. So, natural I googled.\n\nOh and low and behold, he’s recently been arrested (this year, April 2025) for having:\n- 175 images\n- 11 video files\nOf child SA on his devices! \n\nNo court date as of yet. But, what a straight up piece of 💩!\n\n———\n\nArticles:\n\nhttps://indepthnh.org/2025/05/05/child-porn-convict-featured-in-netflix-sextortion-documentary/\n\nhttps://www.justice.gov/usao-nh/pr/harrisville-man-plead-guilty-possessing-child-sexual-abuse-material-while-federal",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mkd79w/web_of_make_believe_death_lies_the_internet/"
    },
    {
        "id": "1mkh7dk",
        "author": "Chris_Nexton",
        "title": "Your Avatar",
        "content": "Do you have any flexibility in your choice of avatar for Netflix? I’m presented with cartoonish characters and characters from shows I don’t watch, so can I put my photo there if I want? I see no way to do that, but thought I’d ask nonetheless.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mkh7dk/your_avatar/"
    },
    {
        "id": "1mjn139",
        "author": "pvpixelarts",
        "title": "Untamed is just so so",
        "content": "Just my personal opinion on Untamed series. \n\nIt was so much hyped up IMO. No depth in the story line and I could not keep myself engaged in the series at all. What you all think? ",
        "upvotes": 65,
        "comments": 66,
        "media": null,
        "permalink": "/r/netflix/comments/1mjn139/untamed_is_just_so_so/"
    },
    {
        "id": "1mk4rmd",
        "author": "EnvironmentalOne8630",
        "title": "Looking for tv series recommendations",
        "content": "I tend to like more realistic shows but an open to all genres for the most part just no anime or cheesy cliche written stories. My favorites include\n\nLost\nThe leftovers\nThe stand\nMr robot\nAmerican primeval \nThe man in the high castle\nMindhunter\nOzark\nBloodline\nThe crowded room (very insane)\nMobland \nThe last of us (season one only)\nWalking dead\n\nThat’s all I can come up with at the top of my head and I do like most of Tyler Sheridan shows except for lioness and landman was “ok” would have been better without the obnoxious ex wife and daughter. The ones listed above are generally the shows I tend to enjoy. \n",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1mk4rmd/looking_for_tv_series_recommendations/"
    },
    {
        "id": "1mk3ufm",
        "author": "ToonAdventure",
        "title": "The World of Dr.Seuss | Official Announcement | Netflix Jr",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mk3ufm/the_world_of_drseuss_official_announcement/"
    },
    {
        "id": "1mkf1f3",
        "author": "Single-Competition12",
        "title": "I’m looking for a really obscure show that was on Netflix. (Around 2019-2021)(Don’t know if it was exclusive to Canadian Netflix or not)",
        "content": "Hey everyone, I hope y’all are having a nice day.\n\nSo I’m looking for a 3d animated fantasy series that was based on a Korean Manga (I think). It had specifically only a Korean audio track but included English subtitles.\n\nI watched it a while ago so my summary might be unhelpful. So the show satirized RPGs and split its story between two groups of characters. A boy that just became an adventurer and a group of monsters (a bunny girl, a goblin and a slime I think, maybe more)\n\nThere’s then the evil/dark Lord who is actually just a good guy who became sympathetic to monsters, he looked like a very cartoony much and had a sea creature wife.\n\nThat’s pretty much all I remember from it. If someone finds any clues about it I’d be immensely grateful. Thx again.\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mkf1f3/im_looking_for_a_really_obscure_show_that_was_on/"
    },
    {
        "id": "1mkhx03",
        "author": "VermicelliUpbeat3008",
        "title": "Did ads always exist?",
        "content": "As title (I used to have a netflix subscription 1-2 years ago) and which subscription should I get if I want to purchase it for one month? With ads or without ads? I don't have a specific budget, but if possible, I want to save money. Also what is the frequency that the ads come on?\n\nWhy did I get downvoted? I'm genuinely confused",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1mkhx03/did_ads_always_exist/"
    },
    {
        "id": "1mk72jx",
        "author": "lightonscreen",
        "title": "issue with a show streaming",
        "content": "hey! I've had this issue for some time, but now I'm actually bothered by it. I'm using Netflix on my phone and tablet and I'm currently watching dexter. I don't know why, but this exact show is available on my phone, but not on my tablet. it's the same account, same everything. it was there before though. and Netflix support just isn't working, can someone please help?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mk72jx/issue_with_a_show_streaming/"
    },
    {
        "id": "1mjza1u",
        "author": "Nice_Pen_8054",
        "title": "Top action K-Drama series on Netflix?",
        "content": "Good afternoon,\n\nI am looking for K-Drama series.\n\nWhich are your top action K-Drama series on Netflix?\n\nI prefer action, adventure or horror.\n\nThank you.",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mjza1u/top_action_kdrama_series_on_netflix/"
    },
    {
        "id": "1mj4s0m",
        "author": "BadShi-6",
        "title": "What’s with every new series being split in to 2 parts?",
        "content": "I’ve just sat down to watch the new season of Wednesday — I’ve noticed yet again Netflix has split the season into part 1 and part 2. Why do they keep doing this?  It’s actually super annoying to me, long gone are the days you can just sit and binge a new series on your day off. \n\nDo you guys prefer them split into 2 parts? I lose interest waiting for the second part of anything.. is there specific reasons for this like stretching out views etc? I don’t think it builds suspense like Netflix thinks, it’s actually just annoying 😂 ",
        "upvotes": 131,
        "comments": 89,
        "media": null,
        "permalink": "/r/netflix/comments/1mj4s0m/whats_with_every_new_series_being_split_in_to_2/"
    },
    {
        "id": "1mjt3yx",
        "author": "BitResident",
        "title": "Show idea",
        "content": "Just had a cool idea with a friend of mine.\n\nImagine a medical drama, but set in a fantasy world like JK Rowling's Wizarding World or similar  \nwith a main character like this:\n\n[\\\\\"Accio Vicodin...\\\\\"](https://preview.redd.it/e8r54yurojhf1.png?width=638&amp;format=png&amp;auto=webp&amp;s=fa46d9ff9ee71564bed65854b4afb4339faf2d14)\n\nCan range from muggles accidentally unearthing cursed items.. to young witches/wizards making a badly brewed love potion with unexpected side effects... possibilities are endless.  \nHow about lingering side-effects on the brain from being charmed too many times??\n\nAll the while the main character is suffering from some kind of curse him/herself and tries to piece together the mystery of its origin...",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mjt3yx/show_idea/"
    },
    {
        "id": "1mk3rmw",
        "author": "grindingcoffeebean",
        "title": "TV Show: You (Potential Spoiler)",
        "content": "You can go ahead and spoil it for me (please!). \n\nMy partner started watching this tv show and I grab bits and pieces of the show but it’s freaky as hell. Every time I see the screen, there’s a new person in the glass cell. \n\nCan someone dumb it down for me and tell me what the show is about, I get trauma from watching bits and pieces of this show. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mk3rmw/tv_show_you_potential_spoiler/"
    },
    {
        "id": "1mjerre",
        "author": "randomboreduserrr",
        "title": "Wednesday season 2 is out, anyone watching?",
        "content": "I watched the first episode and it was okayish only, i am invested tho cuz i can't leave such a short series mid way (its only 4 eps till now). What do you like and dont like about it soo far??",
        "upvotes": 14,
        "comments": 56,
        "media": null,
        "permalink": "/r/netflix/comments/1mjerre/wednesday_season_2_is_out_anyone_watching/"
    },
    {
        "id": "1mjmhcj",
        "author": "Mountain-Bid4317",
        "title": "Netflix series 60+ minutes in length per episode.",
        "content": "Are most Netflix shows like this? I noticed Wednesday's current season so far every episode is exactly 60 minutes (plus or minus one minute). But is this the thing for Netflix series now. Stranger Things has movie length episodes now.",
        "upvotes": 5,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1mjmhcj/netflix_series_60_minutes_in_length_per_episode/"
    },
    {
        "id": "1mjkrm0",
        "author": "Emmazingx",
        "title": "How to secure my account against hackers?",
        "content": "Hi, first time poster here. I don't know if this is the right sub but I need help.\n\nI have a shared account with my mom and siblings, and I think it has been hacked. The language was changed to German today which is what alerted me, but it has probably been going on for a while because I saw that someone has accessed the account from Germany, Greece and Ghana, in the past days/weeks (I normally don't pay attention to these notification emails because it's usually just my siblings).\n\nI used my Netflix profile to watch a show this morning and everything seemed normal, but since then, the profile names have all been changed and the language and suggestions are completely different. This confuses me: how can the algorithm have changed completely in just half a day?\n\nAnyways, I logged into the account, changed the password, logged off from all devices. I enabled PIN verification for all profiles and verified email and phone number. What more can I do to ensure that these people can no longer access our account? Or should we delete the account altogether for safety and create another one with a different email adress?\n\n  \nThank you for your help! Any advice is appreciated.",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mjkrm0/how_to_secure_my_account_against_hackers/"
    },
    {
        "id": "1mj2tuw",
        "author": "intelerks",
        "title": "‘The Walking Dead’ Actress Kelley Mack Dies at 33",
        "content": "",
        "upvotes": 30,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mj2tuw/the_walking_dead_actress_kelley_mack_dies_at_33/"
    },
    {
        "id": "1mk3l8u",
        "author": "UnderstandingFew2905",
        "title": "Are we finally done watching shows just for famous faces?",
        "content": "Used to only click on shows if I knew the actor. Didn’t matter if the plot sucked at least I’d seen them somewhere.\n\nBut lately, not just with me, but my family too is hooked to these short micro-dramas on Bullet, Vertical TV, Flick Reels, even netflix, no celeb faces, tiny budgets, but addictive AF stories and acting.\n\nEnded up DMing the founder of Vertical TV on LinkedIn (turns out he’s from my college). Next thing i know, we’re on a call. He said most of their paying audience is from tier 2 cities Patna, Dehradun, Indore and those cities actually outperform metros in engagement.\n\nIf you are also into this, drop your fav shows…",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mk3l8u/are_we_finally_done_watching_shows_just_for/"
    },
    {
        "id": "1mizgyd",
        "author": "Sweaty-Toe-6211",
        "title": "‘KPop Demon Hunters’ Becomes Netflix’s No. 4 Most Popular English-Language Movie Ever",
        "content": "",
        "upvotes": 43,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1mizgyd/kpop_demon_hunters_becomes_netflixs_no_4_most/"
    },
    {
        "id": "1mjr83y",
        "author": "jaydey-waydey",
        "title": "how can i see how many times ive watched a show?",
        "content": "Me and my family always watch cobra kai most nights together, and it would be interesting to see just how many times we have watched it, how can I see that?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mjr83y/how_can_i_see_how_many_times_ive_watched_a_show/"
    },
    {
        "id": "1mjmjpv",
        "author": "Green-Direction-5458",
        "title": "Foreign documentaries",
        "content": "Anyone else tired of all of the foreign true crime docs and shows? The English dubbing is awful, most of the time the film quality is awful, grainy looking. Something looks interesting, I'll put it in without realizing, then I hear that's its dubbed, and I just cant continue watching. The voice actors are terrible, sound is bad. I have to assume Netflix gets these shows really cheap. Like cheap filler. There are so many now I feel like canceling ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mjmjpv/foreign_documentaries/"
    },
    {
        "id": "1mja0pi",
        "author": "False_Candle1666",
        "title": "Back to school",
        "content": "I feel like every year, all I have to watch when fall comes around is reruns of *Veronica Mars* and *Gilmore Girls*. Are there any other shows that give off the same vibe and are just as good?  \nI've already seen *Pretty Little Liars* and *Gossip Girl* — they’re okay, but I don’t love them as much.",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mja0pi/back_to_school/"
    },
    {
        "id": "1mj9oap",
        "author": "Legitimate_Dream9721",
        "title": "Can’t find show name - may be spoilers",
        "content": "I’m watching Surviving Summer again on Netflix (absolutely the show). However, my head is mixing it up with another show that I believe was also Netflix. Can anyone remember what this show was, I have added some facts I recall below - beware some may be spoilers but I can’t remember all details:\n\nDaughter/model sent to live with aunt in Australia after ruining a designers outfit.\n\nThere’s a girl called Coco and I think the uncle had recently died? Aunt and uncle were a surfing family - he had a shed to make surf boards in.\n\nI think there was a character Tom?\n\nDaughter makes friends, offends friends, then makes a fashion show of swim suits through the decades for an annual celebration on the beach.\n\n",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mj9oap/cant_find_show_name_may_be_spoilers/"
    }
]