[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 499,
        "comments": 276,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 20,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1k1o962",
        "author": "jayjaytlk",
        "title": "Netflix Earnings: Record Profits And Sales Send Stock To Nearly $1,000",
        "content": "",
        "upvotes": 83,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1k1o962/netflix_earnings_record_profits_and_sales_send/"
    },
    {
        "id": "1k1ejob",
        "author": "emmaemmaemma1",
        "title": "Does anyone else think that the new kid influencing docuseries is disgusting dramatic irony?",
        "content": "Netflix has released a new docuseries, \"Bad Influence\", about a kid who was exploited as a child influencer. Her mom posted her all over the internet as a kid with little / no regard for her safety, and made tons of money off of her.\n\nSo, Netflix are now using this kid's story to - you guessed it - make money off the documentary.\n\nHer full name is in it, her face is in it. I've watched the intro in which someone states \"predators were watching these videos\" AND IT SHOWS, with no censoring, the type of videos that predators would seek out - eg, of her dancing as a minor dressed in not a lot.\n\nThe real kicker is that this kid is STILL A KID. She's still 17. And even if she wasn't, I still feel this is exploitative. This is NOT the way to raise awareness of the dangers of child influencing.\n\nAlso - she's very active on social media and hasn't posted about the documentary, which makes me question whether this was even done with her consent. Imagine the mental toll this kind of thing would take on her. It seems to be an awful privacy violation for a child whose whole life has been a series of awful privacy violations. I hope she gets the help she needs and then sues the shit out of them.\n\nIt feels so disgustingly ironic to me. Gross on Netflix's part.\n\n(EDIT: I did watch an episode to make sure I was along the right lines after I posted this. just want to say I 100% agree with anyone saying that the other kids deserve to tell their stories, especially now they're adults. What an awful, disgusting situation all around. My heart breaks for all these kids. We must have better laws to protect our children from the internet. However, I do believe the publishing of the doc could make things worse for the \"main\" child in question, and I don't believe it was published with her best interests at heart. I'm also uncomfortable with Netflix monetising the situation. Thanks to everyone who's discussed this in the comments.)",
        "upvotes": 270,
        "comments": 88,
        "media": null,
        "permalink": "/r/netflix/comments/1k1ejob/does_anyone_else_think_that_the_new_kid/"
    },
    {
        "id": "1k1tpn8",
        "author": "The_Bird_Queen",
        "title": "Adolescence Poster [Fanart OC]",
        "content": "Watched Adolescence last week and it was phenomenal. Decided to draw some fanart!",
        "upvotes": 9,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k1tpn8/adolescence_poster_fanart_oc/"
    },
    {
        "id": "1k17l30",
        "author": "TheNobleKiwi",
        "title": "USA productions seem so fake now??!",
        "content": "Anyone else finding the vast majority of American, shows, movies etc just seem really surface level and cliche??? \n\nIt's like the recent political landscape has exposed all of the fake, plasticy, tacky plots, predictable character arcs and repeated formulae. As if the veil has been lifted and exposed the cheap souless centre?  I can't immerse myself anymore I can just see through everything now.\n\nWondering if anyone else is experiencing this or if it's just because we watched Twister and Madam Web. ",
        "upvotes": 202,
        "comments": 145,
        "media": null,
        "permalink": "/r/netflix/comments/1k17l30/usa_productions_seem_so_fake_now/"
    },
    {
        "id": "1k1nrqi",
        "author": "Alan_Stamm",
        "title": "Frank Bruni (NYT columnist) on 'Black Mirror,' briefly",
        "content": "From his weekly New York Times newsletter April 17:\n\n&gt;A new season of the Netflix series \"Black Mirror\" is upon us, and as in all the seasons before it, the quality of its episodes is erratic. Also per usual, different viewers and critics have very different opinions about which ones soar and which don't.  \n  \nSo I may be an outlier in my particular affection for the first episode, \"Common People.\" I like how its plot takes simultaneous swipes at the gig economy, the insidious omnipresence of advertising and — a particular fascination of mine — the relentless micro-tiering of every service in our lives.",
        "upvotes": 9,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k1nrqi/frank_bruni_nyt_columnist_on_black_mirror_briefly/"
    },
    {
        "id": "1k20b1x",
        "author": "Lord_AIZEN310",
        "title": "Does moonrise end on a cliffhanger?",
        "content": "Saw the trailer. Wit studio does some creative things with their animation.. Really want to know whether the show ends on a cliffhanger or is it a complete story? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k20b1x/does_moonrise_end_on_a_cliffhanger/"
    },
    {
        "id": "1k1vmhi",
        "author": "Striking-Border-3625",
        "title": "Seeing same language subtitles despite them being turned off",
        "content": "So I recently started rewatching Dr. House and the first 7 episodes I didnt have this problem but from one second to the next It started having subtitles. So I went to disable them but saw that it was already disabled. More Info: Im watching it in German and the subtitles were also german so it wasnt like a scene where someone spoke in a foreign language. I also checked other shows like Brooklyn 99 or movies like The Untouchables and both of those did not have this issue. Im using my Computer and havent tested it yet on my PS4. I restarted it and that also didnt help. Anyone knows what the issues is?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k1vmhi/seeing_same_language_subtitles_despite_them_being/"
    },
    {
        "id": "1k1z4gj",
        "author": "Yana123723",
        "title": "Why did Tiny Pretty Things had to be cancelled🙁",
        "content": "I go back to that show every single year basically torturing myself bc it was truly a good well paced show that I actually wanted to see the ending to but it was just a cliffhanger and was quietly cancelled 😭",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k1z4gj/why_did_tiny_pretty_things_had_to_be_cancelled/"
    },
    {
        "id": "1k1c8y9",
        "author": "johnppd",
        "title": "The Sandman: Season 2 | Date Announcement | Netflix | Volume 1 - July 3rd. Volume 2 - July 24th.",
        "content": "",
        "upvotes": 22,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1k1c8y9/the_sandman_season_2_date_announcement_netflix/"
    },
    {
        "id": "1k1x2h4",
        "author": "SunbroSteve",
        "title": "Video suddenly appering to be lower quality",
        "content": "Suddenly video quality on my PC seems to be lower than it used to be, and I haven't changed any settings, and I'm on a wired stable connection with higher than average speeds. Any ideas would be greatly appreciated, I would relaly just like to watch Pantheon and not have it look like crap. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k1x2h4/video_suddenly_appering_to_be_lower_quality/"
    },
    {
        "id": "1k1adij",
        "author": "dailystar_news",
        "title": "New Netflix series sheds new light on Britain's most notorious serial killers Fred and Rose West",
        "content": "",
        "upvotes": 22,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1k1adij/new_netflix_series_sheds_new_light_on_britains/"
    },
    {
        "id": "1k1j6gq",
        "author": "Historical-Phrase106",
        "title": "Ransom Canyon",
        "content": "Just released today… I’m loving it!  They do a great job of character development, it’s as if we’ve known these characters for some time.  Great cast… Josh Duhamel, James Brolin, Minka Kelly and many others.. ",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k1j6gq/ransom_canyon/"
    },
    {
        "id": "1k1tqzq",
        "author": "astraea_str",
        "title": "Not receiving one-time code for completing payment process on a new account",
        "content": "Does anyone know how to fix it? I tried other devices and numbers but still it’s not giving me any one-time code despite having strong signal. I thought it was just a problem with the bank but turns out it was not. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k1tqzq/not_receiving_onetime_code_for_completing_payment/"
    },
    {
        "id": "1k1hher",
        "author": "S4v1r1enCh0r4k",
        "title": "Camille Razat won't return for season 5 of Emily in Paris, season 5 production is now underway",
        "content": "",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1k1hher/camille_razat_wont_return_for_season_5_of_emily/"
    },
    {
        "id": "1k1zhtl",
        "author": "Free-Toe-3411",
        "title": "Netflix augmente généreusement ses tarifs en France : gare à votre prochaine facture",
        "content": "* Standard avec pub : 7,99 € (+2 €, anciennement 5,99 €)\n* Standard : 14,99 € (+1,5 €, anciennement 13,49 €)\n* Premium : 21,99 € (+2 €, anciennement 19,99 €)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k1zhtl/netflix_augmente_généreusement_ses_tarifs_en/"
    },
    {
        "id": "1k1dp9j",
        "author": "Atlast_2091",
        "title": "Ginny &amp; Georgia: Season 3 | Official Teaser | Welcome back to Wellsbury, Peaches! Here’s a peek at season 3 of Ginny &amp; Georgia, coming to Netflix June 5th",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k1dp9j/ginny_georgia_season_3_official_teaser_welcome/"
    },
    {
        "id": "1k1yvpb",
        "author": "lillie_connolly",
        "title": "Adolescence- what do you think the therapist thought of him at the end of e3",
        "content": "I just finished the show. I was wondering how the others read her thoughts and feelings at the end. \n\nDo you think she felt bad for him and cried because she wasn't able to offer him any comfort when he needed it so badly (of course, I understand why she had to behave the way she did.)\n\nOr, do you think she was more letting go of her fear and discomfort she felt when he was lashing out, and considers him dangerous?\n\n\nOr both?\n\nHow did others feel about him during that interview? \n\nI felt strong understanding and related to him during the outbursts, and that emotional  state and need reminded me of myself that age. How badly you can want validation, feel so insecure, and talking to someone who is withholding comfort, or not being able to understand what the other thinks of you and sees in you can be so frustrating and devastating in those moments. It actually reminded me of dramatic fights I used to have with my mom as a teenager. If the context of him stabbing a girl wasn't there, I wouldn't find his outbursts as anything psychotic, dangerous, or not understandable at all. I could completely feel how that felt. I wonder how others perceived that conversation.\n\n\nI also wonder what she saw in him and what her recommendations were in the end.",
        "upvotes": 0,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1k1yvpb/adolescence_what_do_you_think_the_therapist/"
    },
    {
        "id": "1k1nyoq",
        "author": "ICantDive",
        "title": "Sound issue",
        "content": "Hello, I just bought a TV. The sound works on all applications except netflix, it becomes delayed compared to the video itself and static sounding, so the mouth moves on characters but the sound comes after. \n\nI’ve tried resetting the TV, I checked my internet &amp; I’ve tried different hdmi outputs, could use some help thanks.\n\nIts a hitachi TV with google add on ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k1nyoq/sound_issue/"
    },
    {
        "id": "1k1lw0n",
        "author": "Eccentric1286",
        "title": "Bell notification only shows WWE, but nothing else, despite removing!",
        "content": "I've tried to remove it so many times but all I see is WWE in the notifications menu. I want to see other items. I checked another profile and it doesn't happen there. How do I make my notification menu show other things like last year?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1k1lw0n/bell_notification_only_shows_wwe_but_nothing_else/"
    },
    {
        "id": "1k0wj21",
        "author": "jgonzalez418",
        "title": "Anyone getting repeatedly kicked off of their Netflix for \"not being a part of the same household\" though I'm literally using my home wifi?",
        "content": "Every week or so I'm kicked off of my netflix because \"This device isn't a part of your household\" though I'm quite literally using my home wifi where the account was created and all of the users reside an use the account. Genuinely just considering canceling netflix at this point because this is ridiculous. Quickly became one of the most irritating streaming services to deal with, and customer support hasn't been of any help. I have the option to \"watch temporarily\" but then I need to deal with sending a confirmation email to the account owner, which I am not. Like I said, I'm still a part of the household and watching netflix physically in the same household, using the same wifi that the account owner is using. Is this happening to anyone else?",
        "upvotes": 51,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1k0wj21/anyone_getting_repeatedly_kicked_off_of_their/"
    },
    {
        "id": "1k1kita",
        "author": "AlexEW04",
        "title": "Netflix thumbnails will not load",
        "content": "For a couple of weeks now, my thumbnails have been completely black with a few exceptions. I am using my university's wifi. Whenever I turn on a hotspot, the thumbnails load back normally, but I do not have infinite money to spend to increase my hotspot duration lol. I do not have technical difficulties with any other streaming service.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1k1kita/netflix_thumbnails_will_not_load/"
    },
    {
        "id": "1k1kbiz",
        "author": "Xxherox",
        "title": "I am looking for movies or shows set in modern city full of towers",
        "content": "Hi , how are you guys ? I am looking for movies or shows that set in a modern city full of towers or skyscrapers , i prefer if they on netflix , and thank you ^_^",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k1kbiz/i_am_looking_for_movies_or_shows_set_in_modern/"
    },
    {
        "id": "1k1vm2y",
        "author": "calabazacabeza",
        "title": "Adolescence - Toxic masculinity not explored like I was expecting",
        "content": "I´m a middle school / high school teacher, and there was a lot of hype from my colleagues about how this show Adolescence should be shown in schools. I heard that the show explored incel/Andrew Tate culture and how toxic masculinity is prevailing online, so of course I was eager to see this show!\n\n&gt;!But I just finished the show and felt disappointed... yes the show touched upon the prominence of incel culture on social media. However, I felt that more than anything the show painted him as a narcissist/psychopath with clear neurological issues. This is shown clearly through his chilling lack of remorse and his denial of guilt amidst the clear evidence against him. !&lt;\n\n&gt;!Don´t get me wrong I think it´s an excellent show - the acting and the cinematography are clearly top notch. But the character Jamie says directly that he was not interested in the incel culture, and really the incel references from the Instagram messages come from Katie rather than Jamie. There´s definitely evidence in the show that Jamie was involved in some level of toxic masculinity on social media - the naked pictures of katie, the commenting on instagram accounts of other models/girls - but I can´t help but feel the show is more of a portrait of a 13 year old psychopath (that happened to be triggered by some toxic masculine ideas) and his family/community rather than a much needed examination of how toxic masculinity is prevailing online even amidst \"normal\" young boys. For me \"Don´t Worry Darling\" was more impactful in this sense. !&lt;\n\nJust wondering others thoughts on this! ",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1k1vm2y/adolescence_toxic_masculinity_not_explored_like_i/"
    },
    {
        "id": "1k1qt5r",
        "author": "LuckyGordon",
        "title": "How do I recover my account?",
        "content": "Someone changed my email.  I called customer service and after a few verifying questions, she transferred me to an automation.  It directed me to enter my entire credit card number.  I didn't do that.  I hung up.  Is this legit?  Please help. ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1k1qt5r/how_do_i_recover_my_account/"
    },
    {
        "id": "1k0ftjr",
        "author": "Sweaty-Toe-6211",
        "title": "‘Adolescence’ Becomes 3rd Most-Watched Netflix Show Ever, Beating ‘Dahmer’",
        "content": "",
        "upvotes": 291,
        "comments": 78,
        "media": null,
        "permalink": "/r/netflix/comments/1k0ftjr/adolescence_becomes_3rd_mostwatched_netflix_show/"
    },
    {
        "id": "1k1fvkb",
        "author": "Radiant_Alchemist",
        "title": "Now that Maestro in blue (seems to be) concluded, what's your overall impression?",
        "content": "I was a bit late on discovering Maestro in blue as season 2 was already out when I started to watch it. I have to admit that season 1 amazed me and especially the two boys (Spyros and Antonis). I felt so sad about what they want through it felt as if I was experiencing these events. Well.. there's an explanation to that because I'm gay myself and to an extent I have experienced similar situations.\n\nOverall, I liked season 1. Season 2 not so much but it deepened the characters which was necessary but unfortunately it felt like the plot had kinda frozen.\n\nAnd then season 3.. well I didn't enjoy it. It focused too much on Klelia and Orestis but I really don't know why this relationship mattered that much. it felt as if the writer who is also playing Orestis just wanted more screen time for himself. A murder had happened and they didn't seem to care. \n\nAnd most importantly I didn't understand why the two boys went to the police department. I mean what for? It's as if they cancelled all the efforts of seasons 2 and 3. It also never made sense to me why Maria (Spyros' mother) did not give him some good money so he could study along with Antonis but they returned to their broke state. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k1fvkb/now_that_maestro_in_blue_seems_to_be_concluded/"
    },
    {
        "id": "1k1apre",
        "author": "Hot_Narwhal_6038",
        "title": "The Residence : Lilly Schumacher",
        "content": "My wife and I just finished The Residence. From early on in the season, I said out loud that “I bet she did it”. \n\nI was pleasantly surprised by the finale, however, I want to know why I suspected her. I can’t put my finger on it, were there any telltale signs in the season or was my guess pure luck?\n",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1k1apre/the_residence_lilly_schumacher/"
    },
    {
        "id": "1k1727e",
        "author": "EricJackson94",
        "title": "Netflix will stream Samurai Jack creator’s raunchy dog comedy in August | Polygon",
        "content": "Who's happy for Genndy and his collaborators?",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1k1727e/netflix_will_stream_samurai_jack_creators_raunchy/"
    },
    {
        "id": "1k1isa9",
        "author": "ShowMeNourish",
        "title": "Black Mirror Season 7",
        "content": "Does anyone know why Season 7 of Black Mirror is showing up with the same episodes as Season 1? \n\nI began watching Season 7 and now it’s not there. All episodes are the same as Season 1. Anyone? ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1k1isa9/black_mirror_season_7/"
    },
    {
        "id": "1k1c9f1",
        "author": "jrjreeves",
        "title": "tvq-rnd-100",
        "content": "Hi all\n\nIn the last day or two, I've been getting error code tvq-rnd-100 when, on a series, selecting \"Episodes &amp; more\". I'm having no issues playing the latest episode of anything but yeah as soon as I try access previous episodes for example I'm getting that error code every time.\n\nI've reinstalled the app and still getting it. Works on other devices so why am I getting it all of a sudden on my TV?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1k1c9f1/tvqrnd100/"
    }
]