[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 46,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 17,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qohkbx",
        "author": "IncompleteBM",
        "title": "Which Netflix shows should’ve been cancelled earlier?",
        "content": "In contrast to the “which shows were killed too soon?” discussion.  \n\nI’ll say that:\n\n“You” - I thought it peaked at season 2. Season 3, ok fine. After that? Ridiculous. \n\n“Stranger things” - yeah, lots of hype. It’s been on way too long and is a shell of itself. \n\n“Emily in Paris” - “fun” escapist show for a couple seasons. Not sure what the point of it is now. \n\n“In the dark” - I know it wasn’t a Netflix produced show but it’s obviously had more viewership on there. It should’ve ended at season 3. \n",
        "upvotes": 200,
        "comments": 148,
        "media": null,
        "permalink": "/r/netflix/comments/1qohkbx/which_netflix_shows_shouldve_been_cancelled/"
    },
    {
        "id": "1qolg2p",
        "author": "cheno103",
        "title": "Love on the Spectrum quietly renewed for 5th season as producers make 3 big changes to Netflix reality show",
        "content": "",
        "upvotes": 84,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1qolg2p/love_on_the_spectrum_quietly_renewed_for_5th/"
    },
    {
        "id": "1qopzzl",
        "author": "No-Description-2138",
        "title": "‘Star Search’ Fails To Break Through For Netflix",
        "content": "",
        "upvotes": 45,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1qopzzl/star_search_fails_to_break_through_for_netflix/"
    },
    {
        "id": "1qoewi2",
        "author": "Deep20779",
        "title": "Which Netflix shows got cancelled way too early and were seriously underrated?",
        "content": "Netflix cancels a lot of stuff, but some shows really didn’t deserve it.\n\nFor me, it’s Locke &amp; Key — great concept, solid world-building, and it felt like it still had so much story left to tell.\n\nCurious what everyone else thinks — which cancelled Netflix show do you think was underrated and ended too soon?",
        "upvotes": 132,
        "comments": 589,
        "media": null,
        "permalink": "/r/netflix/comments/1qoewi2/which_netflix_shows_got_cancelled_way_too_early/"
    },
    {
        "id": "1qopf7k",
        "author": "No-Description-2138",
        "title": "Alex Honnold's Taipei 101 Climb Attracts 6.2M Views On Netflix",
        "content": "",
        "upvotes": 21,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1qopf7k/alex_honnolds_taipei_101_climb_attracts_62m_views/"
    },
    {
        "id": "1qo513x",
        "author": "Illrollonshabbos",
        "title": "Watch Secret Mall Apartment …",
        "content": "I went by this several times before I finally had to stop and see what it was about. The trailer doesn’t do it justice. Just when I think I’ve seen everything a gem like this appears. ",
        "upvotes": 297,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1qo513x/watch_secret_mall_apartment/"
    },
    {
        "id": "1qol58c",
        "author": "Lucariusssss96",
        "title": "What do you think of The OA?",
        "content": "I’ve always wanted to watch this show but I know that it’s been discontinued. \n\nIs it still worth watching despite it being cancelled?\n\nHow did you feel after watching the show? Do you think it’s life changing?? ",
        "upvotes": 25,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1qol58c/what_do_you_think_of_the_oa/"
    },
    {
        "id": "1qo6f7b",
        "author": "TriggeredEvil",
        "title": "How did you feel about His &amp; Hers?",
        "content": "Did anyone else feel kind of bored or confused at first watching His &amp; Hers?\nThe first couple episodes felt slow and a bit odd to me and I almost stopped watching, but I’m glad I didn’t because I actually really liked the ending. It was so unexpected.\nI just wish the earlier episodes had done more to keep my attention. Curious what everyone else thought about it.",
        "upvotes": 87,
        "comments": 120,
        "media": null,
        "permalink": "/r/netflix/comments/1qo6f7b/how_did_you_feel_about_his_hers/"
    },
    {
        "id": "1qoufk9",
        "author": "Scottishvillanelle",
        "title": "Internet gaslighting me!",
        "content": "The internet tells me ALL seasons of Good Doctor are on Netflix UK but i can only watch 1-5 ? Where are 6&amp;7? Help I just finished s5 and desperate to watch next two seasons. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qoufk9/internet_gaslighting_me/"
    },
    {
        "id": "1qoxf82",
        "author": "sweetmaggiesan",
        "title": "Netflix Animation Studios joins the Blender Development Fund as Corporate Patron",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qoxf82/netflix_animation_studios_joins_the_blender/"
    },
    {
        "id": "1qonj16",
        "author": "Lavender-Donut-",
        "title": "Run Away - what a mess?",
        "content": "I just finished the series, and it was such a mess. I don't even know how to describe the disappointment. It just felt a waste of time. \n\nDid anyone else feel the same? ",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1qonj16/run_away_what_a_mess/"
    },
    {
        "id": "1qow8c2",
        "author": "pottehd",
        "title": "Culinary Class Wars S2 — Talented ≠ Likeable? (No spoilers pls)",
        "content": "I’m still in the middle of Culinary Class Wars Season 2, so please no spoilers on the winner 🙏\n\nThat said… is it just me, or is there that one chef who is undeniably insanely talented but comes off way too arrogant? Like yes, the skills are there, the plates are clean, the concepts are strong — but the attitude toward teammates, judges, or even the process itself kinda ruins the experience for me.\n\nI get that confidence is important in a competition like this, but there’s a thin line between confidence and straight-up ego. Sometimes it feels less like passion and more like looking down on everyone else.\n\nCurious what you all think:\n\nDoes attitude matter to you in shows like this, or is skill everything?\n\nDo you think arrogance is just editing… or part of their real personality?\n\nHave you ever ended up rooting against someone despite their talent?\n\nAgain, no spoilers please, I’m still watching 😅",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qow8c2/culinary_class_wars_s2_talented_likeable_no/"
    },
    {
        "id": "1qow2ay",
        "author": "soundgeeza",
        "title": "Shameless UK not available on Netflix Aus despite adverts?",
        "content": "A photo advertising shameless UK appears when I open Netflix, but when searching for the show, only Shameless USA appears as an option.\n\nI'm currently watching from Australia with a Netflix Aus account.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qow2ay/shameless_uk_not_available_on_netflix_aus_despite/"
    },
    {
        "id": "1qo1zuo",
        "author": "Danaeger",
        "title": "Why are there never any subtitles when characters are speaking in foreign languages?",
        "content": "Watching Homeland right now and whenever anyone speaks Arabic zero subtitles.\n\nI suppose you’d expect this to be included in the original media, but still annoying as fuck.\n\nAlso for Homeland specifically, enabling subtitles changes the position depending on the scene.\n\nBottom left, bottom right, some text on the left and some text on the right? WTF?! Why not keep it centred?\n\nI would upload a photo but I can’t here.. check it out for yourselves.. strange as fuck.",
        "upvotes": 50,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1qo1zuo/why_are_there_never_any_subtitles_when_characters/"
    },
    {
        "id": "1qosywg",
        "author": "No_Pop7296",
        "title": "Companion website to Dark?",
        "content": "I’m giving Dark another shot. I don’t mind the subtitles at all, I love the Scandi murder mystery shows and the Korean romcom. I think it got too convoluted for me the first time around and I was having trouble keeping track of who’s who, especially since there are so many teens and flashbacks. Someone had posted a companion website that mapped out all the different characters and family lines. Can’t find it, can someone please repost? TIA ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qosywg/companion_website_to_dark/"
    },
    {
        "id": "1qnvoz0",
        "author": "Klutzy_Hand_132",
        "title": "Harlan Coben",
        "content": "Is anyone else obsessed with Harlan Coben.\nI watched all his Netflix series ...read his books.. and now im watching his new true crime series.\nLike I just cant get enuff\nI cant be the only one right ? ",
        "upvotes": 71,
        "comments": 173,
        "media": null,
        "permalink": "/r/netflix/comments/1qnvoz0/harlan_coben/"
    },
    {
        "id": "1qorxak",
        "author": "No-Dot-9610",
        "title": "The Boyfriend Saison 2",
        "content": "(POSITORY)\nI recently discovered this Japanese reality TV show and I wanted to talk about it!\n\nDo you have a favorite couple/character?\n\nNo, because at first I was a huge fan of William and Hiroya, but their interactions eventually got boring 😅 Way too repetitive...\n\nWhereas Huwei and Bomi, they make me swoon so much 😻. They're so cute. (I'm not just saying that because Huwei is my favorite character this season 😉!)\nAnyway, all these feelings are dreamy 🥰",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qorxak/the_boyfriend_saison_2/"
    },
    {
        "id": "1qop7nl",
        "author": "FrechesEinhorn",
        "title": "[FireTV] I can't watch the credits",
        "content": "Hey, the devs changed something, every time I want to watch the end credits and it ends.\n\nWhen the movie ends, do I get like 3 or 4 recommend movies/series at the bottom and I can move to the left top choosing between \\[||| credits \\] Or \\[← return\\] once I move up to watch the credits (because I love sometimes the funny animations or want to know the name of some actors or because some credits include bonus material), does it immediately stop.\n\n  \nThis changed like 2 or 3 months ago? I really don't understand why it is now impossible to watch the end of a movie :(\n\n  \nAnd no I don't talk about Autoplay, I choose on my own to click upward to choose the button to watch the credits.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qop7nl/firetv_i_cant_watch_the_credits/"
    },
    {
        "id": "1qohtuq",
        "author": "Silent_Wish7138",
        "title": "Coming Soon Missing",
        "content": "There used to be a “coming soon” section on the app to see what is going to be released soon. I feel like I’m going crazy and cannot find it on there now. Did they take it off the app? \n\nThat is how I selected what I was looking forward to watch that they were going to release. ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qohtuq/coming_soon_missing/"
    },
    {
        "id": "1qoswx0",
        "author": "Superb_Blue_Wren",
        "title": "Did Netflix change the brand sound 'DuhDuh' over the psychedelic N?",
        "content": "In s2 of Unreal. Or am I tripping? \nRelistened a few times and I'm confident it's different - more bass and a second, very fast beat.\nIt's late Jan, so I could be hallucinating.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qoswx0/did_netflix_change_the_brand_sound_duhduh_over/"
    },
    {
        "id": "1qoay4g",
        "author": "RosieTheFoxUwU",
        "title": "Why can’t i listen to the english dub?",
        "content": "Can anyone help me with this? I am finnish and located in Finland. I used to have no issues with netflix letting me choose the language of the dub. For some reason the same series i literally watched with english dub and subtitles last saturday is now only giving me the option of the finnish dub (which is kinda atrocious). Is this some sort of liscencing issue? It worked just fine less than a week ago. I’ve tried changing my account language and updating the app but it didn’t work. Any advice appericiated!",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qoay4g/why_cant_i_listen_to_the_english_dub/"
    },
    {
        "id": "1qnx9gm",
        "author": "healthy-outdoors-",
        "title": "Anyone have any good thriller/ action/ crime / mystery movies out right now? Even shows honestly.",
        "content": "What the title says struggling to find something good to watch lol. Any recommendations would be appreciated thank you. Could be a show or movie either one. ",
        "upvotes": 20,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1qnx9gm/anyone_have_any_good_thriller_action_crime/"
    },
    {
        "id": "1qogwf6",
        "author": "666dollarfootlong",
        "title": "Stuck on 540p, with audio issues, on Firefox after  a change in my audio setup.",
        "content": "I used to be able to watch in 1080p with a browser extension. After I purchased an Apple USB-C/3.5mm dongle, and installing EqualizerAPO on my Windows 11 PC, the video is stuck at 960x540 resolution, and only 5.1 audio-option works. I did some research and I think its a DRM handshake issue with my audio setup, and the only fix seems to be to install Dolby Access, however I can't afford that. Does anyone know how to fix this, or if it's a problem with either of my new audio changes (Apple dongle OR equalizerAPO).  Thanks! ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qogwf6/stuck_on_540p_with_audio_issues_on_firefox_after/"
    },
    {
        "id": "1qocssv",
        "author": "Nocturnal_Babe",
        "title": "Bingeworthy engrossing",
        "content": "Ok so currently waiting for Bridgerton… until then what to watch this week which is nice and bingeworthy plz suggest genre romance, true crime/ thriller…",
        "upvotes": 0,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1qocssv/bingeworthy_engrossing/"
    },
    {
        "id": "1qnd3j3",
        "author": "Global_Ninja_4485",
        "title": "Just watched a movie that actually hit me in the feels",
        "content": "I am not into anime but recently I watched \"Your Name\" on Netflix and ... wow. The story, the music, the way it captures connection- it stuck with me long after the credits. Rarely cry at movies, but this one got me.\n\nAny other Netflix gems that hit this hard emotionally?",
        "upvotes": 96,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1qnd3j3/just_watched_a_movie_that_actually_hit_me_in_the/"
    },
    {
        "id": "1qojv23",
        "author": "ateetzel9",
        "title": "Is Premium Netflix worth it?",
        "content": "I have recently purchased a 4K TV and was wondering if the difference between standard and premium would be worth it. I don’t have any special Dolby Atmos speakers or anything and typically listen through the TV speakers.",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1qojv23/is_premium_netflix_worth_it/"
    },
    {
        "id": "1qolke0",
        "author": "_zyx_716",
        "title": "Netflix cut off access to the account after canceling but continued to charge me?",
        "content": "I canceled netflix in December and was unable to watch anything afterwards, always being met with a \"renew subscription\" message. Fast forward to today and i see that i was still being charged for both last month and this one.\n\nI was completely unable to use the account on any of my devices during this time. I went to customer service only to find out that the original confirmation email was somehow missing and i was shit out of luck. \n\nThe original cancelation was because i could no longer afford it, and after being told that i needed to renew my subscription every time i opened it i figured that i was actually canceled.\n\n  \n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qolke0/netflix_cut_off_access_to_the_account_after/"
    },
    {
        "id": "1qo8cxu",
        "author": "Ashtxns",
        "title": "What is this bro",
        "content": "For some reason my netflix now has random letters bigger than others on all the stuff on there, Is anyone else's netflix doing this? I'm in Australia if that's relevant",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qo8cxu/what_is_this_bro/"
    }
]