[
    {
        "id": "1lpvbzw",
        "author": "HeadsOfStateAMA",
        "title": "Hello r/movies! Ilya Naishuller here. I'm the director of Hardcore Henry, Nobody and vocalist/guitarist in the indie rock band Biting Elbows. My new movie, Heads of State (starring John Cena, Idris Elba, Priyanka Chopra Jonas and Jack Quaid), is hitting Amazon Prime today. AMA!",
        "content": "Hello r/movies! Ilya Naishuller here. I'm the director of Hardcore Henry, Nobody and vocalist/guitarist in the indie rock band Biting Elbows. My new movie, Heads of State (starring John Cena, Idris Elba, Priyanka Chopra Jonas and Jack Quaid), is hitting Amazon Prime today. AMA! \n\nHere's the trailer:\n\n[https://www.youtube.com/watch?v=8J646zM7UM8](https://www.youtube.com/watch?v=8J646zM7UM8)\n\nSynopsis:\n\nU.S. President Will Derringer and British Prime Minister Sam Clarke have a not-so-friendly and very public rivalry. However, when Air Force One gets shot down over enemy territory, they find themselves on the run and working together to thwart a global conspiracy that threatens the entire free world.  \nIt'll be streaming on Prime Video starting today.\n\nI'll be back at 3 PM ET today to answer your questions. AMA!",
        "upvotes": 314,
        "comments": 230,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/o11cg0exlgaf1.png?auto=webp&amp;s=8127f9e4902b626ab117320d5e30dfc440c5f212"
        },
        "permalink": "/r/movies/comments/1lpvbzw/hello_rmovies_ilya_naishuller_here_im_the/"
    },
    {
        "id": "1lr61a7",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Jurassic World Rebirth / Heads of State / The Old Guard 2 / Ice Road: Vengeance) plus throwback discussions!",
        "content": "**New In Theaters**:\n\n* [Jurassic World Rebirth](https://old.reddit.com/r/movies/comments/1lqdtaw/official_discussion_jurassic_world_rebirth/)\n\n**25th Anniversary Throwback Discussion Threads**:\n\n* [The Perfect Storm](https://old.reddit.com/r/movies/comments/1lr5yfc/official_throwback_discussion_the_perfect_storm/?)\n* [The Patriot](https://old.reddit.com/r/movies/comments/1lr5ygy/official_throwback_discussion_the_patriot_spoilers/?)\n* [The Adventures of Rocky &amp; Bullwinkle](https://old.reddit.com/r/movies/comments/1lr5yi5/official_throwback_discussion_the_adventures_of/?)\n\n**Still In Theaters**:\n\n* [F1: The Movie](https://old.reddit.com/r/movies/comments/1lli8lz/official_discussion_f1_the_movie_spoilers/?)\n* [M3GAN 2.0](https://old.reddit.com/r/movies/comments/1lli8nm/official_discussion_m3gan_20_spoilers/?)\n* [28 Years Later](https://www.reddit.com/r/movies/comments/1lfsc91/official_discussion_28_years_later_spoilers/)\n* [Elio](https://www.reddit.com/r/movies/comments/1lfscb2/official_discussion_elio_spoilers/)\n* [The Life of Chuck](https://www.reddit.com/r/movies/comments/1la4c8g/official_discussion_the_life_of_chuck/)\n* [Materialists](https://www.reddit.com/r/movies/comments/1la4c8n/official_discussion_materialists/)\n* [How to Train Your Dragon](https://www.reddit.com/r/movies/comments/1la4c8v/official_discussion_how_to_train_your_dragon/)\n* [From the World of John Wick: Ballerina](https://old.reddit.com/r/movies/comments/1l4gwpn/official_discussion_from_the_world_of_john_wick/?)\n* [The Phoenecian Scheme](https://old.reddit.com/r/movies/comments/1l4gwrc/official_discussion_the_phoenecian_scheme_spoilers/?)\n\n\n**New On Streaming:**\n\n* [Heads of State](https://old.reddit.com/r/movies/comments/1lr5yb4/official_discussion_heads_of_state_spoilers/?)\n* [The Old Guard 2](https://old.reddit.com/r/movies/comments/1lr5ycn/official_discussion_the_old_guard_2_spoilers/?)\n* [Ice Road: Vengeance](https://old.reddit.com/r/movies/comments/1lr5ye1/official_discussion_ice_road_vengeance_spoilers/?)\n* [KPop Demon Hunters](https://www.reddit.com/r/movies/comments/1lghony/official_discussion_kpop_demon_hunters_spoilers/)\n* [Echo Valley](https://www.reddit.com/r/movies/comments/1lar0eb/official_discussion_echo_valley/) \n* [Deep Cover](https://www.reddit.com/r/movies/comments/1lar0ej/official_discussion_deep_cover/)",
        "upvotes": 39,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1lr61a7/official_discussion_megathread_jurassic_world/"
    },
    {
        "id": "1lt5rcj",
        "author": "ChiefLeef22",
        "title": "'Psycho' at 65: How Alfred Hitchcock revolutionised cinema start times | Before 'Psycho', it was fairly common for people to just “show up\" to movies halfway through a film, watch the second half and then stay for the first half of the next showing. Hitchcock insisted cinemas to become more strict",
        "content": "",
        "upvotes": 3220,
        "comments": 183,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/w59vi6gMRTe8CNuTl32zx3NNI3swHS5d5yIUzyqRE2Q.jpeg?auto=webp&amp;s=b8de22f4632549dbaa73811f96d6e234c7d71751"
        },
        "permalink": "/r/movies/comments/1lt5rcj/psycho_at_65_how_alfred_hitchcock_revolutionised/"
    },
    {
        "id": "1lt06s3",
        "author": "Infinite-Fold-1360",
        "title": "'Vietnam was insane, Apocalypse Now only slightly less so': The inside story of the wildest shoot in film history",
        "content": "A good read about Apocalypse now. Been over 15 years since I watched the movie. I knew it was a very difficult movie to make but this article made me realise that coppala had to overcome insurmountable barriers.\n\nMore than the oliver stone triology or full metal jacket, it is apocalypse now that probably resonates more with the Vietnam war. The entire setting makes you undergo that disturbing feeling of war. The fact that the entire cast and crew underwent similar territory as the soldiers, could probably be one of the reasons.",
        "upvotes": 2534,
        "comments": 125,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4O1LekHwTC8PrtW5KjARAZeJrPyXFpipRTEtqysGE5w.jpeg?auto=webp&amp;s=b98e81ff87d0228d6e1669b2a6075c91d30c8f8b"
        },
        "permalink": "/r/movies/comments/1lt06s3/vietnam_was_insane_apocalypse_now_only_slightly/"
    },
    {
        "id": "1lthzdy",
        "author": "dvsinla",
        "title": "Saw Spaceballs in 70mm last night... sound cut out, audience took over, it was amazing",
        "content": "Went to see Spaceballs in 70mm last night in Hollywood… part of a summer 70mm program.\n\nIt was packed.\n\nThe movie started great as usual... but right when Dark Helmet gets to Mr. Radar, the sound cuts out.\n\nSo we all end up watching in silence for about 5 minutes…\n\nBut the best part? Since most people there knew the movie by heart, they just started doing the dialogue out loud. It was hilarious. People were actually matching the lip movements on screen.\n\nEventually they had to cancel the screening, which was a bummer, but those 5 minutes were awesome. I would’ve honestly watched the whole thing that way. I know it by heart.",
        "upvotes": 200,
        "comments": 13,
        "media": null,
        "permalink": "/r/movies/comments/1lthzdy/saw_spaceballs_in_70mm_last_night_sound_cut_out/"
    },
    {
        "id": "1ltedg2",
        "author": "BunyipPouch",
        "title": "'Jaws' - Official 50th Anniversary IMAX Re-Release Trailer",
        "content": "",
        "upvotes": 257,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kms9gndI0SHCvkGtROkrWJghn-7tM2_A7oItVOkeUpQ.jpeg?auto=webp&amp;s=bfb07d744e89dbb43e4b8a322fd3875937b9289a"
        },
        "permalink": "/r/movies/comments/1ltedg2/jaws_official_50th_anniversary_imax_rerelease/"
    },
    {
        "id": "1lsw512",
        "author": "ChiefLeef22",
        "title": "The LA Philharmonic performs the ‘JAWS’ score live alongside the film at the Hollywood Bowl.",
        "content": "",
        "upvotes": 3559,
        "comments": 111,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ixvw1g7lq7bf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1lsw512/the_la_philharmonic_performs_the_jaws_score_live/"
    },
    {
        "id": "1lt2u5a",
        "author": "lockerbiestreet",
        "title": "Which movie completely surprised you — in a bad way?",
        "content": "There was a positive surprise thread yesterday that made me wonder what films have you been PUMPED to see only to be massively (or minimally) disappointed by the end product? \n\nFor me \"The Green Knight\" had a great trailer full of compelling visuals and I was excited to see Gawain get the big screen A24 treatment, but found the film to be a letdown. It's not that it's a bad film, it just was not what I expected. \n\nSequels:\n\nMission: Impossible - Dead Reckoning Part 1 was such a bummer after a franchise high with Fallout.\n\nThe Accountant 2 - buddy film molded into the world of \"The Accountant\". It didn't embrace what made the first one a sleeper hit.  \n\nJoker: Folie a Deux - amazing visuals in incredible promotional materials but such a slog. ",
        "upvotes": 1041,
        "comments": 1373,
        "media": null,
        "permalink": "/r/movies/comments/1lt2u5a/which_movie_completely_surprised_you_in_a_bad_way/"
    },
    {
        "id": "1lt7ays",
        "author": "Wonder-Lad-2Mad",
        "title": "I didn't know how bad I was aching for a chick flick until Kpop Demon Hunters (2025) satisfied that desire out of nowhere. What a kick ass movie from every angle.",
        "content": "This is just a spoiler free recommendation\n\nFirst and foremost, I don't like Kpop. Don't really listen to it. Not a pop person in general. Just listen to a few hits here or there, I'm saying this to highlight I'm not the targeted demographic for this flick. But despite that the premise of this movie, popstars Vs. Demons seemed really intresting to me. So I went in with doubts and walked out with my mind blown. This was one of the best things that came out this year and as far as animation goes, one of the best animated things I've seen in a long while.\n\nThat biggest thing that has floored me about this movie is just the sheer amount of outfits the characters change into. They fucking went HAM on their character designs. The quality and phenomenal taste of this animation is just top notch. Sakuga action scenes at every corner.\n\nI can't praise this movie enough. It's perfect from every angle. It's bursting with Korean culture. It's fucking hilarious, the comedy is on the spot. It's taking in aspects from K-movies, dramas, music, fashion. Everthing. The story is also fucking amazing with it's emotional peaks.\n\nThe biggest compliment I can give this movie is that it's like capturing those imaginary music videos we make in our heads when listening to music and animating it into an hour and a half montage.\n\nThe songs in this movie have potential to be \"Let It Go\" annoying with the overuse. Because they're catchy af.\n\nI didn't know how bad I was aching for a good ~~chick flick~~ (**EDIT**: ***Not*** a chick flick, my bad. I misinterpreted the term. I meant girl led action movie) until this satisfied that desire spontaneously. It brought back a sense of nostalgia for me of watching Totally Spies for some reason. It's the superhero/ teenager work, life balance vibes that they share.",
        "upvotes": 453,
        "comments": 98,
        "media": null,
        "permalink": "/r/movies/comments/1lt7ays/i_didnt_know_how_bad_i_was_aching_for_a_chick/"
    },
    {
        "id": "1lt2uss",
        "author": "Express_Classic_1569",
        "title": "The stained glass knight in Young Sherlock Holmes (1985) - The first fully CGI human character in a movie.",
        "content": "This groundbreaking scene, created by Lucasfilm’s Graphics Group (later Pixar), featured the first fully CGI human character in a live-action film: a knight made entirely of stained glass that steps out of a church window. A true milestone in visual effects history.",
        "upvotes": 770,
        "comments": 50,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rt_3trYFC6sN40WzyK6nQA5v3Kx30Pz3ntfOBb-ECLA.jpeg?auto=webp&amp;s=40d282456a6a6a93141f7b9fa1e6289279a1f0c7"
        },
        "permalink": "/r/movies/comments/1lt2uss/the_stained_glass_knight_in_young_sherlock_holmes/"
    },
    {
        "id": "1ltgnjg",
        "author": "thebigeverybody",
        "title": "Most distracting use of sound effects you've ever heard in a movie?",
        "content": "I used to do SFX and my first job out of university was a shock to me because I realized motorbikes and gunshots on screen didn't sound like actual motorbikes or gunshots. I suddenly realized the studio's collection of 100 000 sound effects was useless without the experience to know which 50 effects the audience had been conditioned to accept as authentic by other films. And then there as the foleying that I helped with, in which a man kneeing a watermelon doesn't sound like a Hollywood effect, a real punch to the face doesn't sound like a Hollywood effect, but a man kneeing a watermelon with olive oil on his leg sounded \"right\" for reasons I can't explain.\n\nSomething I appreciate in the filming of movies is when the actors are actually shouting in loud environments (nightclubs, windstorms) because they're recorded in silence and the music/wind is added later. What this usually results in is the audio being loud to establish it's loud, then the SFX editor has to radically drop the levels because the actors have been recorded talking in their normal voices. I appreciate it when the director gives them directions to act like they're in a loud place. I was on a set once where the director had the actors put earplugs in so they HAD to yell (everyone in the scene had long hair or were given weird hats to hide the ear plugs).\n\nAnyways, I'm watching Bullet Train Explosion right now and they just used the Wilhelm scream for a student getting punched. I had to burst out laughing because, well, it sounds right when someone falls off a cliff, not when someone falls over a train seat.\n\n\n\n",
        "upvotes": 115,
        "comments": 178,
        "media": null,
        "permalink": "/r/movies/comments/1ltgnjg/most_distracting_use_of_sound_effects_youve_ever/"
    },
    {
        "id": "1lte5b5",
        "author": "tonivesdream",
        "title": "The Story behind The Day After” (1983) - possibly the most important movie ever shown on TV. (OC)",
        "content": "I’ve been obsessed with the cultural shockwave that The Day After (1983) created for quite a while. \n\nA made-for-TV movie that somehow ended up scaring the hell out of hundreds of millions people and left Ronald Reagan “greatly depressed”, leading to him rethinking the nuclear arms race.\n\nAfter weeks of research, I was lucky enough to speak with director Nicholas Meyer himself, plus the PR mastermind behind the film, Josh Baran, who helped turn it into one of the most talked-about broadcasts in American history.\n\nIt feels like this story is somehow just as relevant now as it was back then. \n\nWould love to hear your thoughts and I hope you enjoy! ",
        "upvotes": 157,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1oU1slvMAbCrFRJ_sTJDrqVb4mRoCo0sCEbvjb0OvQ8.jpeg?auto=webp&amp;s=4ee14b592f8f4a59ae7bdd16ddb0513856a506c9"
        },
        "permalink": "/r/movies/comments/1lte5b5/the_story_behind_the_day_after_1983_possibly_the/"
    },
    {
        "id": "1lta9kb",
        "author": "indiewire",
        "title": "'Clueless': Unseen Footage Released for 30th Anniversary",
        "content": "",
        "upvotes": 249,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BQmFVyodlJPAWwAtWq1EmHsM6gtaZnhLaV_NMS5NmVs.jpeg?auto=webp&amp;s=980170375a2621b2e53507e8388a42ac52e495c0"
        },
        "permalink": "/r/movies/comments/1lta9kb/clueless_unseen_footage_released_for_30th/"
    },
    {
        "id": "1lt7ykd",
        "author": "BunyipPouch",
        "title": "'Hearts of Darkness: A Filmmaker's Apocalypse' - Official 4K Restoration Trailer - A documentary film about the production of 'Apocalypse Now', Francis Ford Coppola's 1979 Vietnam War masterpiece.",
        "content": "",
        "upvotes": 269,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zL4KnCB2nxz3G0lsbNjunCibdDhRGhb3f066RYTmZLs.jpeg?auto=webp&amp;s=58ab752612b59ad031a1ff62e73a56f466aa26b2"
        },
        "permalink": "/r/movies/comments/1lt7ykd/hearts_of_darkness_a_filmmakers_apocalypse/"
    },
    {
        "id": "1lsvrcm",
        "author": "Briggykins",
        "title": "The real Salt Path: how a blockbuster book and film were spun from lies, deceit, and deception",
        "content": "",
        "upvotes": 1464,
        "comments": 218,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QL7ex6fDsRqQZo0o3KHJ0GsK39pZ-TkAALBAGi2s-oI.jpeg?auto=webp&amp;s=4114d6757426f02dc9fa70316659b50111716da3"
        },
        "permalink": "/r/movies/comments/1lsvrcm/the_real_salt_path_how_a_blockbuster_book_and/"
    },
    {
        "id": "1ltb4ui",
        "author": "millamber",
        "title": "“I forgot my mantra” - Throwaway lines that stuck with you?",
        "content": "In almost every movie there is a random line or joke that isn’t necessarily there to add anything to the plot or character development but is just thrown in as filler. The one listed in the title is from Annie Hall, delivered by a then unknown Jeff Goldblum, speaking on a telephone as the main characters enter the building. Others that stick out to me:\n\n“I’ll have what she’s having” - When Harry Met Sally\n\n“Hey Malkovich,  think fast!” - Being John Malkovich\n\n“It’s not going to be a boring soup! Onions and carrots are just the base of a soup!” - Grosse Pointe Blank\n\nWhat other throwaway lines have stuck with you over the years?",
        "upvotes": 115,
        "comments": 197,
        "media": null,
        "permalink": "/r/movies/comments/1ltb4ui/i_forgot_my_mantra_throwaway_lines_that_stuck/"
    },
    {
        "id": "1lt283j",
        "author": "TruthInAnecdotes",
        "title": "Name a flick you liked so much that you had to rewatch immediately",
        "content": "I can only name a few but Avatar and Endgame come to mind.\n\nYesterday, I watched Sinners on max and was completely blown away.\n\nWatched it once and had to pay more attention the second time just so I can catch every foreshadowing and fine details of the movie.\n\nI've seen maybe hundreds of movies in my lifetime and these are the only three of recent memory that warranted an instant rewatch\n\nWhat's yours?\n",
        "upvotes": 277,
        "comments": 788,
        "media": null,
        "permalink": "/r/movies/comments/1lt283j/name_a_flick_you_liked_so_much_that_you_had_to/"
    },
    {
        "id": "1lt9ztf",
        "author": "NOWAY_YESWAY",
        "title": "I go to the movies for many reasons",
        "content": "That review of *Princess Mononoke* ([https://imgur.com/a/fro6OYr](https://imgur.com/a/fro6OYr)) really hit home for me, especially the beginning. It perfectly expresses how I see animation, far deeper and more meaningful than most people give it credit for. A lot of folks I know still think it's just for kids, but they're missing out! ",
        "upvotes": 60,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mIdLJ9UDmOEhTM4QNPE7OFu8IO1ZSUaVOv4mrpwleJ8.jpeg?auto=webp&amp;s=746c24968c0ae1c4b561d475fa66ae49254d228c"
        },
        "permalink": "/r/movies/comments/1lt9ztf/i_go_to_the_movies_for_many_reasons/"
    },
    {
        "id": "1ltavuu",
        "author": "Remarkable-Pea4889",
        "title": "What movie didn't end the way you expected it to?",
        "content": "I recently watched Robot Dreams and assumed it would have a &gt;!happy!&lt; ending but it didn't and it made me very angry. It didn't feel poignant to me, only wrong. I thought it was a kids' movie about friendship but it's actually an adult movie about romantic relationships. Because friends can have multiple friends and don't need to &gt;!move on!&lt; just because they haven't seen someone in a while.\n\nWhat's a movie you saw that had an unexpected ending? Did you like it or dislike it?",
        "upvotes": 35,
        "comments": 129,
        "media": null,
        "permalink": "/r/movies/comments/1ltavuu/what_movie_didnt_end_the_way_you_expected_it_to/"
    },
    {
        "id": "1lt2z26",
        "author": "Chim_Lee",
        "title": "Watching Capone (2020) felt like watching a feature-length version of one of those fake movies they make for real movies....Anyone else feel that way?",
        "content": "\nWeather playing on a TV in a room or showing at a movie theater or even taking a larger role within the actual movie. This felt like a prestige drama that belongs within a satire, where a well-known actor is playing a totally deranged role and everyone in-universe is pretending it’s Oscar-worthy. That’s the exact energy Capone gives off.\n\nIt didn’t hit me at first. I started off just kind of baffled, then hit the infamous diarrhea scenes—and that’s when I mentally broke. Not in a “this is bad” way, but in a “wait... this isn’t a real movie, this is a parody of a movie within a movie” kind of way.\n\nAfter that, I couldn’t unsee it. Tom Hardy isn’t playing Al Capone—he’s playing the role that some fictional actor takes on in a movie about Hollywood excess. You can just feel the scene where the camera pans behind the scenes and he’s like, totally serious about the role and the praise is pouring in. \n\nOnce I saw it that way, I weirdly started to appreciate it. I’d never watch it again, but it’s kind of brilliant as a fake movie that accidentally became real. Like an accidental Tropic Thunder moment, just played completely straight.\n\nDo you think they were trolling us?\n",
        "upvotes": 72,
        "comments": 22,
        "media": null,
        "permalink": "/r/movies/comments/1lt2z26/watching_capone_2020_felt_like_watching_a/"
    },
    {
        "id": "1lt3ltx",
        "author": "twinpeaks2112",
        "title": "Favorite Crime Comedy?",
        "content": "I love crime films and comedies. Guy Richie is a hero of mine of course. Would love to hear what some of your favorites are from this niche genre? \n\nSome of my favorites are -\n\nSnatch \n\nLock Stock &amp; 2 Smoking Barrels\n\nKiss Kiss Bang Bang \n\nSeven Psychopaths  \n\nBurn After Reading\n\nWhat are yours? Thanks!",
        "upvotes": 59,
        "comments": 247,
        "media": null,
        "permalink": "/r/movies/comments/1lt3ltx/favorite_crime_comedy/"
    },
    {
        "id": "1lthrjy",
        "author": "Minute-Necessary2393",
        "title": "Back to the Future.",
        "content": "Just finished watching Back To the Future, such a classic movie/sci-fi coming of age comedy that still holds up. The prime example of a simple, fun, and straight to the point premise down right.\n\nGreat music, great acting, great directing and writing, and a very great balance of tones. Not too mention, it ends with the kid literally creating himself a better living by helping his parents when they were younger. Also, Michael J Fox and Christopher Loyd are great as always.\n\nIts not just one of the best films ever made, buts its Robert Zemekis's best film in general. Yeah, I said it.\n\nEasy 10/10.",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1lthrjy/back_to_the_future/"
    },
    {
        "id": "1lsn3y9",
        "author": "Bootlebat",
        "title": "What's a plot hole (or something similar) from a movie that always really bothered you?",
        "content": "Here's a couple for me:\n\nStar Wars: How people in the Original Trilogy seem to think the Jedi were just a myth, even though they existed for thousands of years prior, and weren't wiped out until 20 years before, meaning there would be plenty of people still alive who had interacted with them. I've heard people suggest the Empire did a 1984-esque campaign to make people forget, but I'm just not buying it. It would be like if some evil dictator wiped out all Hindus, and 20 years later most people thought Hindus never existed, even though there would undoubtedly be people who had Hindu friends and acquaintances still around.\n\nSigns: How water is like acid to the aliens. You know, water, that liquid that covers three quarters of the planet? Imagine if you were looking for a planet to settle on, and found one that was three quarters covered in sulfuric acid, ,where it frequently rains acid, and where the inhabitants are mostly made of sulfuric acid. Do you try to colonize that planet? ",
        "upvotes": 965,
        "comments": 1570,
        "media": null,
        "permalink": "/r/movies/comments/1lsn3y9/whats_a_plot_hole_or_something_similar_from_a/"
    },
    {
        "id": "1ltgff8",
        "author": "turcois",
        "title": "Really well-made movies that have nothing to do with anything sad or traumatic, but you still hate for personal reasons",
        "content": "When people talk about movies they only would watch once, it's almost exclusively sad movies. Requiem for a Dream, 12 Years a Slave, Grave of the Fireflies, Dear Zachary - all these movies are really well made and people give them their flowers, but like no shit people only want to watch them once, they're emotionally devastating. \n  \nMeanwhile I think of Nomadland. Other than the main character's background of losing her things in a recession, the story isn't supposed to be sad. I mean, it's about a woman finding out what makes her happy and brings her joy and peace. And she finds a community of like-minded people. But man, it just instilled such an incredible sense of loneliness in me unlike anything else I've seen. And it came out right after the worst bout of depression I've ever had in my life, so I hate it because I felt like it found joy specifically where I had found misery.\n \nAnd this post was also inspired by how much I hated the new How to Train Your Dragon, which was also, technically, in theory, \"well made,\" but I hated because of its sheer and (other than 1998's Psycho) unprecedented lack of creativity, but unlike with Psycho which arguably made for an interesting artistic experiment, HTTYD was made exclusively for the sake of money and commercialism. Idc if money is the driving force behind your movie getting made, I just care that you're going to make something original\n  \nSo, other non-sad movies that you hate with a passion?",
        "upvotes": 9,
        "comments": 27,
        "media": null,
        "permalink": "/r/movies/comments/1ltgff8/really_wellmade_movies_that_have_nothing_to_do/"
    },
    {
        "id": "1lscso8",
        "author": "Drag-Upbeat",
        "title": "In Interstellar, why does Cooper seem deeply connected to his daughter Murph, yet shows noticeably less concern for his son Tom? Is there a deeper reason behind this emotional imbalance?",
        "content": "\"It’s ironic that in Interstellar, Cooper appears more emotionally invested in Murph, even though Tom is the one who consistently reaches out to him through video messages. \n\n\n\nTom stays loyal to the family, takes care of the farm, looks after their grandfather, and tries to preserve their way of life.\n\n\n\n Meanwhile, Murph, although brilliant, comes off as more self-centered—she cuts off communication for years and rarely even asks about her father.\n\n\n\n It’s as if the film romanticizes Murph's intellect and rebellion, while overlooking Tom’s quiet dedication and emotional resilience.\"",
        "upvotes": 3700,
        "comments": 643,
        "media": null,
        "permalink": "/r/movies/comments/1lscso8/in_interstellar_why_does_cooper_seem_deeply/"
    },
    {
        "id": "1ls8ww0",
        "author": "CrimsonKing1029",
        "title": "What's a scene in a film that is literally laugh until you cry funny?",
        "content": "Personally, I'd have to go with the hotel scene from Borat. It still gets me every time. There are many scenes from that movie one could choose, but that one really takes the cake. \n\nI'm having trouble remembering other scenes from a movie that are painfully funny. As a kid I always laughed at the news scene from Bruce Almighty. \n\nI'd love to hear your pick! \n\nEdit: Well, I certainly wasn't expecting this to blow up. Thanks everyone for your comments. There's a lot to watch!",
        "upvotes": 5527,
        "comments": 5606,
        "media": null,
        "permalink": "/r/movies/comments/1ls8ww0/whats_a_scene_in_a_film_that_is_literally_laugh/"
    },
    {
        "id": "1ltetwf",
        "author": "TabrisMerkaba",
        "title": "Movie(s) set and filmed in 1990s Asia",
        "content": "Preferably Chinese, though any great Asian film will do. I'm looking for movies that were both filmed and set in the '90s (not one or the other). I've looked up some lists and they're mostly populated with martial arts, horror, and/or cop/gang movies, but those arent quite what Im looking for. I'd really like something slice of life or dramatic that really captures the overall zeitgeist of the country in that decade. Any suggestions?",
        "upvotes": 7,
        "comments": 16,
        "media": null,
        "permalink": "/r/movies/comments/1ltetwf/movies_set_and_filmed_in_1990s_asia/"
    },
    {
        "id": "1lsx6as",
        "author": "Several-Tip1088",
        "title": "Looking for movies like Heretic (2024) that give you anxiety without being violent",
        "content": "I love movies that don't use jump scares to scare you and rather use atmosphere, dialogue delivery and ambience like Barabarian, Heretic, The Gift, Speak No evil, Don't Breathe, The Menu &amp; Midsommar.  \nI sadly feel that I might have already watched all the all stuff in this subgenre so I'm curious if anyone has recs for similar stuff. Thanks a ton in advance 🧡",
        "upvotes": 87,
        "comments": 120,
        "media": null,
        "permalink": "/r/movies/comments/1lsx6as/looking_for_movies_like_heretic_2024_that_give/"
    },
    {
        "id": "1ltg5nz",
        "author": "Tall_Training_8401",
        "title": "I want to see the Orange Girl!",
        "content": "When I was 12 years old (15 years ago) I saw a scene of this move, I don´t remember if it is french or german but it is definitively european, the problem here is that the movie is so rare, I have looking for it all of these years but I have never found it. It original name is \"Applesinpiken\" and it is based on a book with the same name, so, does anyone know where could I see it?\n\nhttps://preview.redd.it/jigt9qjvgcbf1.jpg?width=1000&amp;format=pjpg&amp;auto=webp&amp;s=479cc925ea5deb6bfc47dc79b33dd7bd6aacc1c8\n\n",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1ltg5nz/i_want_to_see_the_orange_girl/"
    },
    {
        "id": "1ltepi5",
        "author": "Stankassmfgorilla",
        "title": "Bad/mediocre movies with great performances hidden in them?",
        "content": "Movies that were absolute, total stinkers, or even painfully average, but had great performances they didn’t deserve. \n\nOne that comes to mind is Ewan McGregor as Obi Wan in the Star Wars Prequel Trilogy. These movies have a lot of problems, even though I enjoy them, but Ewan McGregor’s performance is the one of the things that is consistently good through all 3 movies. He brings a level of emotional depth and nuance to the character the script and direction doesn’t even call for. It’s a testament to how poor the direction is when there are so many other great actors who give awful, wooden performances in those films. Liam Neeson, Christopher Lee, and Ian McDiarmid all rise above the shitty script and direction as well, bringing life to their characters and chewing the scenery. \n\nAnother film is X Men Origins: Wolverine. Hugh Jackman gave his best performance as the title character up to that point, and it was completely wasted on the steaming pile of dogshit that was that movie. Liev Schreiber was also excellent in that film, bringing a charisma to Sabretooth that a less skilled actor would have lacked. \n\nMichael Fassbender in Prometheus comes to mind as well\n\nWhat are some other examples?\n ",
        "upvotes": 7,
        "comments": 64,
        "media": null,
        "permalink": "/r/movies/comments/1ltepi5/badmediocre_movies_with_great_performances_hidden/"
    },
    {
        "id": "1lt70c8",
        "author": "Icy-Management-9749",
        "title": "Isn’t it wild how something so small can live inside you forever",
        "content": "There’s this one scene from The Choice that’s etched into me. I must’ve watched it when I was 18 I guess, too young to understand the full weight of love and loss. But now I’m 29 and I still think about that scene almost every single day. And I honestly have no idea why.\n\nIt’s the part where Travis builds this little gazebo on the island the one where he and his wife Gabby had shared quiet moments before life got loud. After everything the accident, the heartbreak, the waiting he creates this simple, quiet space. Replaces the wind chimes. Waits with this kind of hope that love would find its way back. And somehow she comes back. Just a man building a place for love to come home to. And she does. \n\n I don’t know why that scene found a home inside me. Why over a decade later it still lingers. I think about that scene more often than I realize. Not because it’s overly dramatic or romantic in a predictable way but because something about it feels… familiar. The idea of building something with your own hands, out of love, out of waiting, out of pure, aching belief. Maybe it’s the metaphor I keep returning to. The hope. The stillness. The quiet, unwavering kind of love that doesn’t chase, it builds. And waits.\n\nTho still not sure why it haunts me gently the way it does, Sometimes I think we’re all carrying a little island inside us. A place where we hang our own wind chimes. A place where we wait not out of desperation, but out of love. Out of belief. Out of something softer than logic but stronger than time.\n\nIsn’t it wild how one quiet scene can take root in your heart and never leave?\n\n\n\n\n",
        "upvotes": 17,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1lt70c8/isnt_it_wild_how_something_so_small_can_live/"
    },
    {
        "id": "1lsakki",
        "author": "BunyipPouch",
        "title": "First Poster for Dystopian-Thriller 'The School Duel' - Starring Oscar Nunez ('The Office') and Kelsey Darragh - Set in near-future Florida, schoolchildren are recruited to take part in a deadly, statewide competition known as “The School Duel”, in order to try to curb the rise of school shootings.",
        "content": "",
        "upvotes": 2363,
        "comments": 291,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/aw47xl70b2bf1.jpeg?auto=webp&amp;s=4e30ea29e022e8d3ca3bd145f681df4ddec195e8"
        },
        "permalink": "/r/movies/comments/1lsakki/first_poster_for_dystopianthriller_the_school/"
    }
]