[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 482,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1haf6gm",
        "author": "netflix",
        "title": "Netflix received 36 Golden Globes nominations!\n\nCongratulations to Emilia Pérez, Nobody Wants This, Squid Game, Monsters: The Lyle and Erik Menendez Story, Maria, Ripley, Griselda, Black Doves, The Gentlemen, The Diplomat, A Man on the Inside, and Glen Powell who scored his first-ever nomination.",
        "content": "",
        "upvotes": 28,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1haf6gm/netflix_received_36_golden_globes_nominations/"
    },
    {
        "id": "1heesvy",
        "author": "Alarming-Ad-5955",
        "title": "Anyone can explain these scenes from Carry-On ",
        "content": "So Ethan switch cases. Red ribbon case is the bomb and bigger case is just some random case with some stranger’s belongings in it im assuming. \n\nNow the second picture shows the Traveler trying to fit the bigger case which he thinks is the bomb. When he couldn’t fit it in, the flight attendant asked him to check it in which he does because its a different case now. \n\nThen we find out later that the bigger case actually has the bomb in it ?? Did Ethan take the whole bomb and placed it in the bigger case ? I must’ve missed something but someone please clarify lol",
        "upvotes": 111,
        "comments": 91,
        "media": null,
        "permalink": "/r/netflix/comments/1heesvy/anyone_can_explain_these_scenes_from_carryon/"
    },
    {
        "id": "1hepyqp",
        "author": "Unusual-Base-4939",
        "title": "I was bored yesterday so I created a movie recommender.",
        "content": "Okay, so the other night me and a buddy were trying to pick a movie, and I swear we spent like 45 minutes just scrolling through Netflix, Prime, Hulu, etc., arguing about what to watch. By the time we agreed on something, I was like, “Dude, we basically wasted an entire evening doing nothing.” It was ridiculous.\n\nIn a fit of frustration, I threw together this weird little site: cineswipe[dot]com Think of it like swiping on Tinder, but instead of deciding if you like Becky or Brad, you’re deciding if you’d watch Jaws or some random French indie flick. You swipe left or right on whatever comes up, and hopefully land on something you both can actually get behind before your popcorn goes cold.\n\nI’m not selling anything, it’s just a random idea I had to fix a personal annoyance. Not saying it’s perfect—there’s probably some bizarre movies in there—but it might help break that cycle of “what do you wanna watch?” “I dunno, what do YOU wanna watch?” and so on, until the heat death of the universe.\n\nIf anyone tries it and has thoughts, I’m all ears. If not, that’s cool too. Just figured I’d share because it’s 100% better than staring blankly at endless streaming menus. Enjoy or ignore—no biggie.",
        "upvotes": 11,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hepyqp/i_was_bored_yesterday_so_i_created_a_movie/"
    },
    {
        "id": "1hew4nw",
        "author": "No_Leg_1116",
        "title": "looking for a tv show, i don't know if it exist",
        "content": "so, a murder detective show about a guy who killed someone, and he works as a murder detective so he can hide proof from the inside about his murder case, and he cant go to jail because someone depends on him, and its like a psychological drama, a murder solving crime psychological drama, and the story is about him, the one who is depended on him, and him solving crime out of just doing his job, no venging, or out of trying to deal with him murdering someone with catching other murderers, so, a murderer catching other murderers,  but not like how Hannibal did it, the protagonist is a good person, not bad, the audience knows that he is a murderer, but the one who depends on him or the other characters don't",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hew4nw/looking_for_a_tv_show_i_dont_know_if_it_exist/"
    },
    {
        "id": "1heny2u",
        "author": "m2knet",
        "title": "CIV VI Netflix game!!!",
        "content": "Not sure if anyone brought this up but NETFLIX now has civ 6 FREE as an iOS game. Amazing addition! Maybe not in your market?\n\nBut anyone notice this and are you happy? It’s nice when they actually give something of quality to us for free, isn’t it?",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1heny2u/civ_vi_netflix_game/"
    },
    {
        "id": "1he12y9",
        "author": "Whobitmyname",
        "title": "Netflix Says Shooting ‘One Hundred Years of Solitude’ Series In Colombia Delivered A $52 Million Boost To The Country’s Economy",
        "content": "",
        "upvotes": 289,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1he12y9/netflix_says_shooting_one_hundred_years_of/"
    },
    {
        "id": "1hedz5y",
        "author": "Bright-Tomatillo-391",
        "title": "Tv shows similar to Tulsa king/breaking bad/sons of anarchy?",
        "content": "Does anyone have any tips on any serie similar to to Tulsa king/breaking bad/sons of anarchy? A gangster/criminal serie that doesn’t play out in a big city but more like the countryside? \nPlease leave all your suggestions! 🙏🙏🙏",
        "upvotes": 23,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1hedz5y/tv_shows_similar_to_tulsa_kingbreaking_badsons_of/"
    },
    {
        "id": "1hek3ld",
        "author": "lollyfleur",
        "title": "No Good Deed",
        "content": "This show is a funky-mystery rollercoaster that should be experienced twice! It is silly, dark, random, FUNNY. There’s a moment - the scene where Luke Wilson plays the piano/sings “Your Song” to Lisa Kudrow - that made me love this cast of characters and all the small heartwarming moments of the show. I restarted the series and am finding it just as interesting, heartfelt &amp; wacky as the first round. \n\noh and…Ray Romano/Matt Rogers/Miss Squirrel in the coke episode was 👌 ",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hek3ld/no_good_deed/"
    },
    {
        "id": "1hegegw",
        "author": "villanelle1991",
        "title": "Any fans of Girls5Eva here? Let’s help them get a renewal",
        "content": "So it seems like Girls5Eva is cancelled based on Busy's podcast when she was asked by Danny Pellegrino about it since Netflix only signed up for 1 season, and it seems like they're not likely to renew it. We figured maybe we can do something to help.   \n  \nWhy not show Netflix how much we love this show by making some noise! Please sign our petition:\n\n[https://www.change.org/p/save-girls5eva](https://www.change.org/p/save-girls5eva)\n\nPlease help spread the word as well. Thank you!",
        "upvotes": 8,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hegegw/any_fans_of_girls5eva_here_lets_help_them_get_a/"
    },
    {
        "id": "1hegu1w",
        "author": "Present-Ferret5397",
        "title": "Help me find this show pls",
        "content": "I remember a tv show (I think) that's in Spanish (again, I think) I saw years ago on Netflix (possibly around 2018/19). It was a girl who was poor or bullied went to this school where a lot of them were rich. This guy (pretty sure he was blonde) secretly likes her, takes her on dates, etc... but doesn't want anyone to know. I wanna say she was a brunette if that helps.\nHe is insanely popular and rich (possibly royal) invites her to a vacation with his friends. But he rents out a separate place for her to sleep because he was to be able to secretly sneak in at night to stay with her. There was also a scene where she stops by his house to drop off a bag of candy or something and meets his family and realizes he's insanely rich or royal and eats dinner with his family.\nI can't find anything. It's also not Elite since that's the first thing that pops up every time.",
        "upvotes": 7,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hegu1w/help_me_find_this_show_pls/"
    },
    {
        "id": "1hefzh3",
        "author": "inter_stellaris",
        "title": "This Year’s Christmas Shows",
        "content": "I started this year‘s Christmas season with the Pentatonix promotion show „Meet me next Christmas“, but it was so bad, I had to quit after a couple of minutes. \n\nThen I switched to „Our little secret“. \n\nIt was slightly better, but I‘ve never seen so many plastic surgeried, botoxed and fillered faces in one spot.\n\nPlus the amount of orange and soft focus filters in their faces was hilarious. \n\nIn the last years I loved the „Home for Christmas series“, too bad it wasn’t continued. \n\n",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hefzh3/this_years_christmas_shows/"
    },
    {
        "id": "1he8fxi",
        "author": "zagbertrew",
        "title": "I want to mark a show as watched or disliked, either way, don't show me the show again.",
        "content": "We watch shows, we either like them or hated them, but either way, we are done with the show and don't want to see the show again. This could be done by setting a \"Hide\" flag attached to the entire show, it would apply to all shows in the series. For example, we watched all of \"Monk\", so we could set the \"Hide\" flag and we'd never see \"Monk\" again in any search, except a search for \"Hidden\" shows. The thumbs up and down would indicate why the show was hidden.\n\nThere are other shows that we start watching and do not like, will never like, and don't watch to be bothered with ever again. Usually, these are Hallmark movies, but could be anything for anybody. We would mark these as thumbs down and Hidden. Then we are never bothered again with the show. Again, if we change our minds, we can go to the \"Hidden Shows\" page and unhide anything we want.\n\n\\[Edit\\] Some people seem to misunderstand. First - this is a completely optional feature, if you don't mark something as \"hidden\", you would never know the feature exists. Second - filtering out \"hidden\" shows is the default, but can be disabled (un-checked) so all shows would appear if you are looking for something that might be hidden.\n\nOn Netflix's side, this is more data to evaluate user preferences. It will also reduce network data by reducing the results of any report, so should be cost savings after implentation.",
        "upvotes": 19,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1he8fxi/i_want_to_mark_a_show_as_watched_or_disliked/"
    },
    {
        "id": "1heeupx",
        "author": "TX3931FB",
        "title": "movie auto starts when reading synopsis",
        "content": "I want to turn off the auto start when reading a synopsis or audio language info. This is NOT the preview. When I'm trying to read about a movie or TV series, Netflix will auto start the show and remove the content I'm reading. It's very annoying. I have turned off the auto preview and auto start next episode. How do I turn off the auto show start? Thanks",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1heeupx/movie_auto_starts_when_reading_synopsis/"
    },
    {
        "id": "1hefy2e",
        "author": "Achenar459",
        "title": "How do I disable Games?",
        "content": "How do I disable Games? I just finished watching a good Anime on the Netflix website and decided to scroll to see what else to watch and there is a giant list of games I could play. I checked out the \"Manage profile and preferences\" and couldn't find a setting for it. I would very much appreciate to not have to scroll past Games and then again past \"Popular Mobile Games for You\" every time I am looking for a good TV show or movie to watch, since I'll never click on any of them. That list is definitely not for me. Am I missing seeing the setting somewhere?",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hefy2e/how_do_i_disable_games/"
    },
    {
        "id": "1hdxppq",
        "author": "MechanicalKiller",
        "title": "I think Carry On was amazing",
        "content": "They somehow made a movie about a TSA agent pretty entertaining. I thought it was similar to The Guilty starring Jake Gylenhall. \n\nJason Bateman is… Jason Bateman who basically plays himself a lot in these drama’s, similar to his role in Ozark.\n\nThe Car Action scene was so cool and well choreographed (camera work and fight)\n\nIf your looking for something entertaining tonight or over the weekend, I’d give it a shot.\n\n\n\n",
        "upvotes": 66,
        "comments": 71,
        "media": null,
        "permalink": "/r/netflix/comments/1hdxppq/i_think_carry_on_was_amazing/"
    },
    {
        "id": "1hemccf",
        "author": "PinataTimeToons",
        "title": "Show about guy trying to get back to his family after the rapture starts.",
        "content": "So about 10 years ago now, i remembered watching this show on Netflix. it was animated, but was more like a slide show of drawings. Not smooth movements. Had to do with a man who traveled away only for the rapture to start. He now must find a way back home after a majority of the population is gone. Thats all i remember, but i can't find it anywhere. Anyone know what i'm trying to find? Thanks.\n\n",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hemccf/show_about_guy_trying_to_get_back_to_his_family/"
    },
    {
        "id": "1hdz4b0",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix recently removed the \"Coming Soon\" label from the 'You' homepage leading to rumors that the season is delayed ",
        "content": "",
        "upvotes": 35,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1hdz4b0/netflix_recently_removed_the_coming_soon_label/"
    },
    {
        "id": "1hemcsa",
        "author": "bkingfilm",
        "title": "一口氣看完 中國式遊戲開發 全集 168分鐘 | BKinGfilm 遊戲紀錄片 Game Documentaries",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hemcsa/一口氣看完_中國式遊戲開發_全集_168分鐘_bkingfilm_遊戲紀錄片_game/"
    },
    {
        "id": "1he2bxp",
        "author": "AggressiveTraining78",
        "title": "Senna",
        "content": "Out of nowhere Senna went missing from my Netflix and i was in the third episode quite desperate as u all can see ... Please help me what hpnd why is it not shown suddenly",
        "upvotes": 8,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1he2bxp/senna/"
    },
    {
        "id": "1heabc4",
        "author": "AIexDeLarge",
        "title": "quality is bad on tv ",
        "content": "anyone else have this problem/know how to fix it? Basically netflix quality is great on my ipad and phone but as soon as i put it on my tv the quality is pretty terrible in comparison.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1heabc4/quality_is_bad_on_tv/"
    },
    {
        "id": "1hedy1r",
        "author": "Puzzleheaded_Sky8051",
        "title": "Error codes after update to Chrome 131.*",
        "content": "Things were fine until a couple of days ago and then my Chromebox got updated to Chrome 131.\\* and now Netflix keeps getting Error Code C7353-5101 (or sometimes C7361-1253) when I try to stream something.  (Other streaming sites work fine.)  The Netflix site doesn't have info on C7353-5101, but following the suggested tips for other x7353-5101 error codes was no help.  I've also tried logging out, then clearing all site data and cookies for Netflix and rebooting -- no improvement.  Netflix help (via chat), after making sure I'd tried all the things I'd already tried, said they'd escalate the problem.  I'm just wondering if anyone else is seeing issues after this latest Chrome update?  Or if anyone has any other suggestions on how to resolve this...",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hedy1r/error_codes_after_update_to_chrome_131/"
    },
    {
        "id": "1he3aq5",
        "author": "IMHBTR",
        "title": "Plan change affects existing log-ins?",
        "content": "I may not be asking my question properly.\nI purchased the top plan, ($22.99) for use by 2 elderly relatives.\nI very rarely watch anything on Netflix, they love it. They each have a Roku that I set up and logged them in to Netflix.\nMy question is this, if I switch to the basic plan, (ads, only 2 devices), will that switch require a new login on each device?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1he3aq5/plan_change_affects_existing_logins/"
    },
    {
        "id": "1he5k91",
        "author": "Potential-Plenty7318",
        "title": "[REQUEST] 10 Days Of A Curious Man (2024) - Need help to identify the name of the music/song",
        "content": "This song plays before Sadik breaks into the house of Yuksel Zinchirli.\n\nThe first words are sung when Yuksel is swimming in his pool.\n\nSong goes like \"I close my eyes And I turn to the sun. Brought to life at the touch of your hand.....\"\n\n\n\nSong ends when Sadik greets Yuksel.\n\n\n\nSong is quite catchy. Does anyone knows the title of the song/singer. Thank youuuuuuuuu",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1he5k91/request_10_days_of_a_curious_man_2024_need_help/"
    },
    {
        "id": "1he15le",
        "author": "FifiFoxy12",
        "title": "What to watch next ",
        "content": "I've just finished the finale of outer banks and looking for somting new to watch.\n\nPrevious shows I've watched:\n\nThe Rookie, Gilmore Girls, My life with the Walter boys and of course Outer Banks.\n\nAny and all suggestions welcome 💕",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1he15le/what_to_watch_next/"
    },
    {
        "id": "1hcrn8m",
        "author": "AccurateInflation167",
        "title": "Netflix ‘walking back’ one-year parental leave after too many workers take year off",
        "content": "",
        "upvotes": 5999,
        "comments": 544,
        "media": null,
        "permalink": "/r/netflix/comments/1hcrn8m/netflix_walking_back_oneyear_parental_leave_after/"
    },
    {
        "id": "1he5hvj",
        "author": "DelayDifficult3376",
        "title": "Slow dialogue ",
        "content": "When watching tv on screen. The dialogue is too low. I need to turn off my AC or fan so that I can understand the conversation. I have also my remote in my hands to add volume when dialogue is low sounding and when sound effects is too loud. I minus the volume. So annoying. Watching with phone is perfect but small screen... \n\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1he5hvj/slow_dialogue/"
    },
    {
        "id": "1hduasi",
        "author": "fyrefl1es",
        "title": "Netflix blocking: what does it look like?",
        "content": "Netflix mysteriously stopped working at my local gym. Its saying I'm not connected to a wifi but I am.  Fast, speedofme, etc shows 60down, 50up.  Youtube still works.  \n\nSo the questions ate: what does netflix do when a network blocks that app or parts of that app that allow streaming?  What does it look like when public wifi somehow triggers Netflix's safety measures?",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hduasi/netflix_blocking_what_does_it_look_like/"
    },
    {
        "id": "1hebo88",
        "author": "Angelinterviews",
        "title": "HELP ME FIND THIS ASIAN TV-SHOW",
        "content": "What's the name of this Netflix TV show about an Asian girl moving into a dorm and finding out it was also rented by the most popular girl in her school by mistake? It's a very cutesy kid-like show. ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hebo88/help_me_find_this_asian_tvshow/"
    },
    {
        "id": "1hduaf5",
        "author": "Rainbow_Vortexx",
        "title": "Cartoon Show Cars",
        "content": "i’m looking for a not toddler but younger cartoon show where the plot of the story is about people that control toy cars and this show was previously removed off of netflix.",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hduaf5/cartoon_show_cars/"
    },
    {
        "id": "1hecvqg",
        "author": "EggplantsAreBad",
        "title": "How to block Christian content from kids shows",
        "content": "Stealthy Christian shows are all over Netflix for kids. How can I block these from appearing to my child? We are not Christian and do NOT want to be proselytized to. These need to be in their own religious section that can be blocked if parents do not want to expose their children to this type of content.",
        "upvotes": 0,
        "comments": 99,
        "media": null,
        "permalink": "/r/netflix/comments/1hecvqg/how_to_block_christian_content_from_kids_shows/"
    },
    {
        "id": "1hdk455",
        "author": "mari_xoxo",
        "title": "Jentry Chau vs the Underworld | Official Trailer | Netflix",
        "content": "i just finished “jentry chau vs the underworld” it’s new to netflix , it’s sooo good if your looking for something new (and animated) to watch then watch jentry chau , \n\nit’s about a 16 year old chinese-american girl who lives in happily in seoul until she has to go back to her hometown where she once lived as a child , a small town in Texas because she is being hunted by demons. Now she has to balance highschool life , relationships , friendships while trying to stop the demon’s that’s coming after her “ all while having fire powers” i really recommend it! ",
        "upvotes": 14,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1hdk455/jentry_chau_vs_the_underworld_official_trailer/"
    }
]