[
    {
        "id": "1n8sw5t",
        "author": "mi-16evil",
        "title": "Official Discussion Megathread (The Conjuring: Last Rites, Hamilton) plus throwback discussions",
        "content": "**New In Theaters**:\n\n* [The Conjuring: Last Rites](https://www.reddit.com/r/movies/s/kqpgXYUJF3)\n* [Hamilton \\[2020\\] (Theatrical Release)](https://www.reddit.com/r/movies/comments/hkm7e5/official_discussion_hamilton_2020_spoilers/)\n\n**25th Anniversary Throwback Discussion Threads**:\n\n* [Highlander: Endgame](https://www.reddit.com/r/movies/s/McksjhzFbX)\n* [Whipped](https://www.reddit.com/r/movies/s/Shi0nfwGUC)\n\n**Still In Theaters**:\n\n* [The Toxic Avenger (2025)](https://old.reddit.com/r/movies/comments/1n2v42x/official_discussion_the_toxic_avenger_2025/?)\n* [Caught Stealing](https://old.reddit.com/r/movies/comments/1n2v46f/official_discussion_caught_stealing_spoilers/?)\n* [The Roses](https://old.reddit.com/r/movies/comments/1n2v49v/official_discussion_the_roses_spoilers/?)\n* [Nobody 2](https://old.reddit.com/r/movies/comments/1mqleeh/official_discussion_nobody_2_spoilers/?)\n* [Weapons](https://old.reddit.com/r/movies/comments/1mkiuk7/official_discussion_weapons_spoilers/?)\n* [Honey Don't!](https://www.reddit.com/r/movies/comments/1mwu2vw/official_discussion_honey_dont_spoilers/?)\n* [Primitive War](https://www.reddit.com/r/movies/comments/1mwu35t/official_discussion_primitive_war_spoilers/?)\n* [Ne Zha II](https://www.reddit.com/r/movies/comments/1j5dv7y/official_discussion_ne_zha_2_spoilers/)\n\n**New On Streaming:**\n\n\n* [Highest 2 Lowest](https://old.reddit.com/r/movies/comments/1n9h173/official_discussion_highest_2_lowest_spoilers/?)\n* [The Thursday Murder Club](https://old.reddit.com/r/movies/comments/1n5045m/official_discussion_the_thursday_murder_club/?)\n* [The Home](https://old.reddit.com/r/movies/comments/1n5046o/official_discussion_the_home_spoilers/?)\n* [Eenie Meanie](https://old.reddit.com/r/movies/comments/1n5043w/official_discussion_eenie_meanie_spoilers/?)\n* [Fixed](https://old.reddit.com/r/movies/comments/1ms61cu/official_discussion_fixed_spoilers/?)\n* [Night Always Comes](https://old.reddit.com/r/movies/comments/1ms61j7/official_discussion_night_always_comes_spoilers/?)\n* [War of the Worlds (2025)](https://old.reddit.com/r/movies/comments/1mek72y/official_discussion_war_of_the_worlds_spoilers/?)",
        "upvotes": 27,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1n8sw5t/official_discussion_megathread_the_conjuring_last/"
    },
    {
        "id": "1nc19o4",
        "author": "SanderSo47",
        "title": "September 5-7 Box Office Recap – 'The Conjuring: Last Rites' debuts with an incredible $84M domestically, the biggest horror debut of the year. Worldwide, it's even bigger, as it opens with $194M, the best ever for a horror.",
        "content": "https://preview.redd.it/pqt76tooj0of1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=5a4bfd493d30992841f5d09bd9155c8e8def4922\n\nHorror is alive, more than ever.\n\nLook no further than ***The Conjuring: Last Rites***, which not only achieved the biggest debut in the history of the franchise, but also managed to get the biggest worldwide debut for a horror film. Disney also released ***Hamilton*** in almost 2,000 theaters, and it also had a pretty strong debut. It all marked a damn great start to the post-summer slate.\n\nThe Top 10 earned a combined $116.7 million this weekend. That's down 17.3% from last year, when ***Beetlejuice Beetlejuice*** opened with a gigantic $111 million.\n\nDebuting at #1, Warner Bros.'s ***The Conjuring: Last Rites*** opened with an extraordinary $84 million domestically. That's easily the biggest debut in the franchise, and it was the fourth biggest September debut, just behind ***It*** ($123M), ***Beetlejuice Beetlejuice*** ($111M), and ***It: Chapter Two*** ($91M).\n\nAnother incredible stat: with this, WB now becomes the first studio to achieve 7 films to debut with at least $40 million in a row: the films are ***A Minecraft Movie*** ($162 million), ***Sinners*** ($48 million), ***Final Destination Bloodlines*** ($51.6 million), ***F1*** ($57 million), ***Superman*** ($125 million), ***Weapons*** ($43.5 million), and now ***The Conjuring: Last Rites***.\n\nHow could this open this high? Especially when none of the previous films opened higher than $60 million? Well, credit has to go to the \"finale factor\", as the film sold itself as \"the case that ended it all\". That, by itself, was a bit misleading; New Line Cinema simply said that this film would conclude the franchise's \"Phase One\" (whatever that means). But WB still marketed it as a finale, which was a smart choice here.\n\nIt's truly a testament to the strength of the franchise that it manages to stay this strong, while other franchises fade out. Even the film's weak reviews (56% on RT) didn't stop the momentum. The audience is truly invested in these characters, in ways very few horror films have achieved.\n\nAccording to WB, 51% of the audience was female, and 69% was in the 18-34 demographic. Its biggest demographic was Hispanics, who represented 43% of its audience. They gave it a middling \"B\" on CinemaScore, which is the lowest of the mainline ***Conjuring*** films. But at least it's better than the lame ***Nun*** films. Even if it's front-loaded, this should definitely hit $200 million domestically. Easily the biggest film in the franchise, even adjusted for inflation.\n\nDisney released their Disney+ exclusive ***Hamilton*** in 1,825 theaters. Even though it's been available on the service for 5 years, it still managed to earn a pretty great $10.1 million and getting to second place. It will keep adding more countries in the next few weeks.\n\nAfter topping the box office for most of August, ***Weapons*** was affected by the arrival of ***The Conjuring***. The film dropped 50%, its steepest drop so far, and earned $5.2 million this weekend. The film has made $142.9 million, and it should close with around $155 million domestically.\n\nIn fourth place, ***Freakier Friday*** dipped 43% and added $3.8 million this weekend. The film's domestic total stands at $87.8 million so far.\n\nSony's ***Caught Stealing*** had a soft debut last week and it didn't save face on its second weekend. It collapsed a steep 59%, earning just $3.1 million this weekend. This is somehow a worse drop than Darren Aronofsky's ***mother!*** (56.3%), which had the honor of getting the \"F\" on CinemaScore. It's also an incredibly low $890 per-theater average. Through 10 days, the film has made just $14.8 million, and it will close with less than $20 million if it loses so many screens.\n\n***The Fantastic Four: First Steps*** dropped 43%, earning $2.8 million. This allowed it to cross $270 million domestically.\n\nLike ***Caught Stealing***, Searchlight's ***The Roses*** had a very lukewarm debut and also had a steep drop this weekend. It collapsed 56%, quite rough for a comedy, and making just $2.7 million this weekend. Through 10 days, it has made just $12.2 million, and it will close with less than $20 million domestically.\n\n***The Bad Guys 2*** dropped 47% this weekend, grossing $2.5 million. The film has earned $77.7 million, and it will close with around $85 million.\n\nSalvation Pictures also released the animated bible film ***Light of the World*** in 2,075 theaters, but the film flopped with just $2.4 million this weekend. Even with some good word of mouth (\"A\" on CinemaScore), expect this to fall quickly.\n\nRounding out the Top 10 was ***Superman***, which had its steepest drop so far. It dropped 62%, earning $972,876. The film's domestic total stands at $353.2 million, and it's nearing the end of its run.\n\nAfter making its way to #2 last week, the 50th anniversary re-release of ***Jaws*** sank in the water. It collapsed a brutal 90%, making just $966,840. That took its lifetime total to $286 million.\n\nNeon expanded ***Splitsville*** to 800 theaters, although the film could only muster $800,741, which is barely a $1K per-theater average. That took its lifetime gross to $1.2 million.\n\n***The Toxic Avenger*** was also pretty much abandoned by audiences, given that it lost 1,289 theaters on its second weekend. As such, it collapsed an abysmal 86% and making just $240,265 this weekend. With $2.8 million domestically, it's set to close very soon.\n\n#**OVERSEAS**\n\n***The Conjuring: Last Rites*** opened with an incredible $110 million overseas, for an insane $194 million worldwide debut. This is the biggest debut in the history for a horror, overtaking ***It*** ($189.4 million). Unsurprisingly, the biggest market was Mexico, where horror (especially this franchise) is massively popular, debuting with a fantastic $13.3 million, a franchise record. Other strong markets include the UK ($8.8M), Brazil ($7.7M), India ($6.7M), Germany ($5.6M), Indonesia ($5.6M), Spain ($5.1M), Philippines ($4.5M), Italy ($4.3M), and Australia ($3.6M).\n\nIt has yet to release in some key markets like France and the Middle East, and it doesn't release in Japan until October 17. Based on these patterns, it's pretty much guaranteed to become the biggest film in the franchise. For now, it should easily pass $400 million (and that's a conservative estimate), which is just absurd.\n\n***The Bad Guys 2*** added $5.9 million overseas, taking its worldwide total to $191.5 million. The best markets are China ($25.1M), UK ($16.8M), France ($11.1M), Spain ($7.8M) and Mexico ($6.1M), and it will release soon in Australia.\n\n***The Roses*** added $5.8 million overseas, for a $32.1 million worldwide total. The best markets are the UK ($7.2M), Germany ($1.5M), Netherlands ($1.4M), France ($1.3M) and Australia ($1.1M).\n\nWith $4.1 million this weekend, ***Weapons*** has finally crossed $250 million worldwide.\n\n***Demon Slayer: Kimetsu no Yaiba – The Movie: Infinity Castle*** added $1.8 million in 9 markets overseen by Sony. Those markets represent $45 million, and the film as a whole has earned $282.6 million worldwide. This weekend, it reaches more big markets like North America and Latin America.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*How to Train Your Dragon* | Jun/13 | Universal | $84,633,315 | $262,958,100 | $632,137,100 | $150M\n\n- Universal/DreamWorks' live-action remake of ***How to Train Your Dragon*** has closed with $262 million domestically and $632 million worldwide. On both parts, it's the biggest film in the franchise. Clearly, Universal's decision to remake DreamWorks' animated films is off to a pretty good start and they won't waste a minute; a sequel is already set for June 2027. And it won't be the only live-action remake of DreamWorks' animated films. So it begins, for better or worse.\n\n#**THIS WEEKEND**\n\nThere's some new releases, but there's a film that will try to break some records on its debut.\n\nThat's ***Demon Slayer: Kimetsu no Yaiba – The Movie: Infinity Castle***, which makes its way to North America and other big markets. The film has already destroyed records in Asia, and it hopes to replicate that in the rest of the world. Fandango reported that the film was the service's biggest pre-sales for an anime film, which bodes insanely well for its prospects. Could it be, that after 26 years, an anime film will finally break ***Pokémon***'s records ($31M OW, $85M DOM) for the biggest debut and gross?\n\nFocus is also releasing ***Downton Abbey: The Grand Finale***, the final chapter in the ***Downton Abbey*** franchise. The film is going all out, bringing back everyone, including Paul Giamatti reprising his role from the TV series. While the second film lost half of its audience, perhaps the \"finale factor\" will raise curiosity for big fans of the franchise.\n\nLionsgate is also releasing ***The Long Walk***, the first adaptation of Stephen King's novel. The cast includes a lot of promising newcomers (Cooper Hoffman, David Jonsson, Charlie Plummer, Ben Wang, Roman Griffin Davis, etc.) and it also has Mark Hamill to play the Major. Although it doesn't help that ***The Conjuring*** will take away horror fans.\n\nAnd finally, there's something 41 years in the making. That's Bleecker Street's ***Spinal Tap II: The End Continues***, sequel to the 1984 original. Rob Reiner is back as director, and Christopher Guest, Michael McKean and Harry Shearer are all back to star and write the film. Decades-long sequels to comedy classics have been hit-and-miss (mostly the latter), and Reiner's recent output has left a lot to be desired. Will ***Spinal Tap II*** be any different?\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 34,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GIw4nAk8XSMaBHAEd1EZdYujFleHbMFX6xmlubWtbuk.png?auto=webp&amp;s=fcf8175fd931ea3d8c1d6b7ec7d623b6113e1d0e"
        },
        "permalink": "/r/movies/comments/1nc19o4/september_57_box_office_recap_the_conjuring_last/"
    },
    {
        "id": "1nc4od8",
        "author": "hotelrwandasykes",
        "title": "Dumb and Dumber (1994) was my favorite movie as a kid and it holds up better than I expected as an adult",
        "content": "I'm 35 now and rewatched it a couple weeks ago. I had categorized the movie in the \"dumb comedies for preteens\" bucket since I'd last watched it 20+ years ago, but now think that it's an all-time great comedy. Highlights:\n\n* They're dumb enough for great slapstick but not mentally challenged like they are in the sequels. For example, Lloyd's plot to make Seabass pay for their meals at the diner shows that he's competent enough to move the plot forward, instead of just being a passive imbecile. \n* Jeff Daniels was mainly a serious actor but took on a role opposite the funniest actor of his generation and made no effort to out-funny him. If he had, the chemistry would fail. Harry isn't quite a straight man, but he's competent enough to be a good foil to Lloyd. IMO this dynamic makes the romantic rivalry over Mary Swanson work better than if he had played either extreme.\n* Jim Carrey might be at his best in this movie. His ad-libs (\"big gulps huh?) are some of the most memorable lines and he doesn't go full cartoon character like he did in the Ace Ventura movies.\n* There's just enough sincerity to make it all come together. \"I'm sick and tired of eking my way through life\" is a great dramatic scene.\n* The writing is pretty damn smart in some scenes. When Harry learns that Lloyd had extra gloves that he wasn't sharing when the two were roughing it in the snow, he strangles him and Lloyd responds \"you're hands are freezing!\" It's a great exchange that I didn't catch as a kid.\n* There's a good mix of throwaway gags (\"we landed on the moon!\") and longer-form absurdity that relates directly to the plot, like the IOUs or selling a dead bird to a blind kid. \n* It's ultimately a movie about friendship. The resolution doesn't involve either of them shacking up with Mary Swanson, instead they just go on to new adventures, with fundamentally the same relationship that they'd had at the beginning. \n* Dumb and Dumber's soundtrack is one of the best compilations of rock-heavy 90's music that I've heard. Music is never overused, but it frames scenes perfectly. Boom Shackalack and Mary Moon are tied inextricably to those scenes in my mind.\n\nMore than anything it's just funny as hell in every way that it can be. What other comedies cover such a nice spectrum?",
        "upvotes": 1671,
        "comments": 370,
        "media": null,
        "permalink": "/r/movies/comments/1nc4od8/dumb_and_dumber_1994_was_my_favorite_movie_as_a/"
    },
    {
        "id": "1nbmvju",
        "author": "tylerthe-theatre",
        "title": "Yorgos Lanthimos, Olivia Colman, Ayo Edebiri and Josh O’Connor Among 1,200 Industry Names Pledging Not to Work With Israeli Film Institutions ‘Complicit in War Crimes’",
        "content": "",
        "upvotes": 22530,
        "comments": 242,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9CrkWjcnvcvLLNEOI3iaOCKt2aoLtAdjbswNn9-jCfU.jpeg?auto=webp&amp;s=3100d176203a644dce7a62e01ee447ae1e5b8dff"
        },
        "permalink": "/r/movies/comments/1nbmvju/yorgos_lanthimos_olivia_colman_ayo_edebiri_and/"
    },
    {
        "id": "1nbx379",
        "author": "ChiefLeef22",
        "title": "Aaron Taylor-Johnson says Robert Eggers' ‘Werwulf' begins production today. Also starring Willem Dafoe, Lily-Rose Depp",
        "content": "",
        "upvotes": 2467,
        "comments": 176,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fr0r1BPXuWc8dpP1O0GuETu9kJdu4HnmvEhWH18KObs.jpeg?auto=webp&amp;s=338f776c6ae13a25ce7f54e5c546628be4af0975"
        },
        "permalink": "/r/movies/comments/1nbx379/aaron_taylorjohnson_says_robert_eggers_werwulf/"
    },
    {
        "id": "1nbte9q",
        "author": "MarvelsGrantMan136",
        "title": "Official 20th Anniversary Poster for 'The Descent'",
        "content": "",
        "upvotes": 1662,
        "comments": 98,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ml9yaxly2znf1.jpeg?auto=webp&amp;s=bc472604cf7bdb45eff4891c516e4562018cf622"
        },
        "permalink": "/r/movies/comments/1nbte9q/official_20th_anniversary_poster_for_the_descent/"
    },
    {
        "id": "1nc71n9",
        "author": "alligator13_8",
        "title": "A $5 milkshake?!?        (Pulp Fiction, 1994)",
        "content": "Just FYI, Mia’s $5 ‘Martin &amp; Lewis’ milkshake from Jackrabbit Slim’s would now be **$11**.     \n\nStill no bourbon or nothin’; it’s a pretty goddamn good milkshake, but I dunno if I’d pay any five dollars.    Especially if served by Buscemi’s surly Buddy Holly.    \nI don’t know what that means, but I find myself thinking “what would that milkshake cost today?” way too often.        \nInflation’s a bitch. That is all. \n",
        "upvotes": 299,
        "comments": 90,
        "media": null,
        "permalink": "/r/movies/comments/1nc71n9/a_5_milkshake_pulp_fiction_1994/"
    },
    {
        "id": "1nbn39o",
        "author": "MarvelsGrantMan136",
        "title": "Wake Up Dead Man: A Knives Out Mystery | Official Teaser | Netflix",
        "content": "",
        "upvotes": 3461,
        "comments": 424,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FtK9cF5pC3zkLiDpHS1YjZcMZ9hCRcW7zszF6D_tRD8.jpeg?auto=webp&amp;s=c87f2b7bef9c1d464ba5f3dc57b091459e801663"
        },
        "permalink": "/r/movies/comments/1nbn39o/wake_up_dead_man_a_knives_out_mystery_official/"
    },
    {
        "id": "1nc6ksw",
        "author": "MarvelsGrantMan136",
        "title": "Guillermo Del Toro Teases Very Violent New Project ‘Fury’ With Oscar Isaac",
        "content": "",
        "upvotes": 286,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/RYqtpem6euw1ZhFIn07WRFwy5Nz_qRYqL1Dj4vOVIKA.jpeg?auto=webp&amp;s=44fa95bdcaec98cb9dcd90929a76cec26c0a9204"
        },
        "permalink": "/r/movies/comments/1nc6ksw/guillermo_del_toro_teases_very_violent_new/"
    },
    {
        "id": "1ncad8w",
        "author": "hominoid_in_NGC4594",
        "title": "\"Donnie Brasco\" is an extremely well-made movie that did a great job of deviating from the usual Hollywood glorification of the American Mob, and it belongs in the upper echelons of movies that are based off of real-life events.",
        "content": "Pretty much every other mob movie Hollywood puts out tries to glorify the hell out of the life mobsters live, Movies like \"GoodFellas\" and \"The Godfather\". But \"Donnie Brasco feels much more gritty, much more realistic and not nearly as glorified as other mob movies.  I love the scene of them all using hammers trying to break open all of those parking meters to steal the coins, showing how truly  desperate those mobsters were, and the lengths to which they would go, to get enough money each week to keep kicking up cash to their bosses to keep them happy, and thus keep their position in their respective crew secure.  Love, love the movie.",
        "upvotes": 145,
        "comments": 59,
        "media": null,
        "permalink": "/r/movies/comments/1ncad8w/donnie_brasco_is_an_extremely_wellmade_movie_that/"
    },
    {
        "id": "1nbm6pq",
        "author": "MoneyLibrarian9032",
        "title": "Warner Bros. makes Hollywood history with 7 consecutive movies opening above $40 million",
        "content": "",
        "upvotes": 3244,
        "comments": 230,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Pkt5kRtzHONypPeBpDrJ6gDaDGafNMNeiyrGNvqCE54.jpeg?auto=webp&amp;s=d3ce80dd7c1e69ad52111b9f32857a046bea0117"
        },
        "permalink": "/r/movies/comments/1nbm6pq/warner_bros_makes_hollywood_history_with_7/"
    },
    {
        "id": "1ncaier",
        "author": "jesepy",
        "title": "\"Children of Men\" aged well",
        "content": "Some movies get better with time, even decades later. Rewatched *Children of Men* over the weekend and it feels more relevant now than when it released. The cinematography, the themes: it feels so relevant and hitting hard today given that it came out in 2006... Just made me think about movies that were well done earlier on, but have since aged into masterpieces instead of fading into nostalgia.",
        "upvotes": 106,
        "comments": 35,
        "media": null,
        "permalink": "/r/movies/comments/1ncaier/children_of_men_aged_well/"
    },
    {
        "id": "1nbom10",
        "author": "BunyipPouch",
        "title": "First Poster for Horror-Thriller 'Dust Bunny' - Starring Mads Mikkelsen and Sigourney Weaver - An eight-year-old girl asks her scheming neighbor for help in killing the monster under her bed that she thinks ate her family.",
        "content": "",
        "upvotes": 1611,
        "comments": 145,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jvbly6om6ynf1.jpeg?auto=webp&amp;s=6cb074b559b383f573f034786baff02efba6a033"
        },
        "permalink": "/r/movies/comments/1nbom10/first_poster_for_horrorthriller_dust_bunny/"
    },
    {
        "id": "1nc3tlx",
        "author": "MarvelsGrantMan136",
        "title": "Stuart Craig Dies; Oscar-Winning Production Designer From 'Harry Potter' Franchise &amp; ‘The English Patient’ Was 83",
        "content": "",
        "upvotes": 211,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xxR4u34lo9BQoPoZsowPGau1ccY9pSnKoYymKlZG8mk.jpeg?auto=webp&amp;s=9a02cc1fab1ad305ff87bcaa644946a024ca6417"
        },
        "permalink": "/r/movies/comments/1nc3tlx/stuart_craig_dies_oscarwinning_production/"
    },
    {
        "id": "1nbv0yp",
        "author": "MarvelsGrantMan136",
        "title": "Lionsgate Sets ‘Last Witch Hunter’ Sequel With Vin Diesel &amp; Michael Caine Reprising",
        "content": "",
        "upvotes": 599,
        "comments": 212,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KhJulxrGWGccSr5se9RJsXrtjXwa24ilwpe8pqow2K0.png?auto=webp&amp;s=206f2cfe46d66f9635d6c539db3db421eb80b2fc"
        },
        "permalink": "/r/movies/comments/1nbv0yp/lionsgate_sets_last_witch_hunter_sequel_with_vin/"
    },
    {
        "id": "1nc38j8",
        "author": "EuphoricButterflyy",
        "title": "‘Cabaret’ (1972)- Sally (Liza Minnelli) performs “Maybe This Time”",
        "content": "",
        "upvotes": 218,
        "comments": 24,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/4kgv47hty0of1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1nc38j8/cabaret_1972_sally_liza_minnelli_performs_maybe/"
    },
    {
        "id": "1nbr0pr",
        "author": "depr4ved",
        "title": "What is the best unstoppable man action film",
        "content": "You know your John Wicks, James Bond, Mission Impossible, Jason Bourne type movies. One man taking out a bunch of bad guys and saving the day. Which is the best or your favorite film and why? Been on a kick for these type of action films recently and would love to hear some opinions. Thank you! P.s. unstoppable woman movies accepted too :D ",
        "upvotes": 914,
        "comments": 1625,
        "media": null,
        "permalink": "/r/movies/comments/1nbr0pr/what_is_the_best_unstoppable_man_action_film/"
    },
    {
        "id": "1nc4jjv",
        "author": "Restless_spirit88",
        "title": "John Candy: I Like Me | Official Trailer",
        "content": "Just heard about this. I adore John Candy. Planes, Trains, and Automobiles is one of the greatest comedies of all time. Candy himself was this incredibly rare combination of wholesomeness and humor. You typically get one or the other in entertainers. I like to say that he was basically the fun Uncle everyone had growing up. He left us too soon, way too soon.",
        "upvotes": 160,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LwvTc9H_631cxP9J1avlzdOR3OM5cADhhZ5A0iiBwck.jpeg?auto=webp&amp;s=0334f0ac158c403c7a999edc83e2abe276d92d89"
        },
        "permalink": "/r/movies/comments/1nc4jjv/john_candy_i_like_me_official_trailer/"
    },
    {
        "id": "1nbaoi2",
        "author": "MarvelsGrantMan136",
        "title": "‘Pee-wee As Himself’ Wins the 2025 Emmy for Outstanding Documentary",
        "content": "",
        "upvotes": 9327,
        "comments": 174,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MZ-p7zHF7dMJmV10o-d3vbC19CRrrISdIXKSmshlakw.jpeg?auto=webp&amp;s=a1ecaa5b4e9e9fbfbee083b66e0c8ad381d8f78d"
        },
        "permalink": "/r/movies/comments/1nbaoi2/peewee_as_himself_wins_the_2025_emmy_for/"
    },
    {
        "id": "1nbt0xx",
        "author": "MarvelsGrantMan136",
        "title": "‘The Smashing Machine’ Duo Benny Safdie &amp; Dwayne Johnson To Reteam On Hot Package ‘Lizard Music'",
        "content": "",
        "upvotes": 390,
        "comments": 72,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2olpP1xSdD-ALVC4PA849Ih0cezBneyWVURyaAUDHbo.jpeg?auto=webp&amp;s=9e81dbc62f5cb53d2e9df1ac234dbc4d2392c53d"
        },
        "permalink": "/r/movies/comments/1nbt0xx/the_smashing_machine_duo_benny_safdie_dwayne/"
    },
    {
        "id": "1nbs68j",
        "author": "jovenitto",
        "title": "What movies have the best intro?",
        "content": "A good movie often has a good intro. \n\nWhat are your favorites? \n\nTo kick things off, mine are Lord of The Rings (any of the 3 movies), that always gets under my skin, and Mark Renton's (Ewan Mcgregor) opening monologue to Trainspotting, \"Choose life\". \nAnother that comes to mind is Hans Landa, for Inglorious Basterds. ",
        "upvotes": 221,
        "comments": 647,
        "media": null,
        "permalink": "/r/movies/comments/1nbs68j/what_movies_have_the_best_intro/"
    },
    {
        "id": "1nbola1",
        "author": "BunyipPouch",
        "title": "'Dust Bunny' - Official Trailer - Starring Mads Mikkelsen &amp; Sigourney Weaver",
        "content": "",
        "upvotes": 326,
        "comments": 83,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xjZ4fKgE6ynnWFZ-GrMsK820F8p5_hQKkTbagQWa0iU.jpeg?auto=webp&amp;s=fdc92a4ef639dce171ae93001f43268d58e04f54"
        },
        "permalink": "/r/movies/comments/1nbola1/dust_bunny_official_trailer_starring_mads/"
    },
    {
        "id": "1nbtcnf",
        "author": "NoCulture3505",
        "title": "New Poster for the Re-Release of \"St. Elmo's Fire\"",
        "content": "",
        "upvotes": 181,
        "comments": 97,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/lknv1zsn2znf1.jpeg?auto=webp&amp;s=d96e1e2c5a5a8344023f1fd6128874842fdfa188"
        },
        "permalink": "/r/movies/comments/1nbtcnf/new_poster_for_the_rerelease_of_st_elmos_fire/"
    },
    {
        "id": "1nbulu0",
        "author": "Sea_Read8530",
        "title": "Midnight Run (1988) - one of the most overlooked comedies of all time!",
        "content": "I recently watched *Midnight Run* and it blew me away. This movie is pure **entertainment, entertainment, entertainment..** it just doesn’t let you get up from your chair.\n\nRobert De Niro is absolutely spectacular in this. His mix of comedy, timing, and intensity is on another level. Honestly, I don’t hear this film mentioned nearly as much as it deserves, especially compared to other De Niro performances. ",
        "upvotes": 105,
        "comments": 96,
        "media": null,
        "permalink": "/r/movies/comments/1nbulu0/midnight_run_1988_one_of_the_most_overlooked/"
    },
    {
        "id": "1ncbk26",
        "author": "Cartmantor1",
        "title": "What is a Direct to DVD sequel that you felt was underappreciated?",
        "content": "We all know the era of mass producing cost efficient sequels to theatrical movies with an established audience. Were there any direct to home video sequels that you felt were decent?\n\nIf not, was there a (direct to video) sequel that was a \"guilty pleasure\" you enjoy? Even if its not considered a \"good\" movie?",
        "upvotes": 11,
        "comments": 47,
        "media": null,
        "permalink": "/r/movies/comments/1ncbk26/what_is_a_direct_to_dvd_sequel_that_you_felt_was/"
    },
    {
        "id": "1nbyizv",
        "author": "indiewire",
        "title": "Aziz Ansari on How His Canceled ‘Being Mortal’ Led to ‘Good Fortune,’ and with Help from Angels Like Keanu Reeves and Seth Rogen",
        "content": "",
        "upvotes": 60,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/seGCPnTMMvYGKvfL8r2txYWee5c6SydPYq1u-SQtHHE.jpeg?auto=webp&amp;s=e160027b4b385478807af0c70967a3eb885e7cad"
        },
        "permalink": "/r/movies/comments/1nbyizv/aziz_ansari_on_how_his_canceled_being_mortal_led/"
    },
    {
        "id": "1nb4zby",
        "author": "EuphoricButterflyy",
        "title": "Patrick Wilson surprises fans at a ‘The Conjuring: Last Rites’ showing in Atlanta.",
        "content": "",
        "upvotes": 4003,
        "comments": 160,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/mfebfci26tnf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1nb4zby/patrick_wilson_surprises_fans_at_a_the_conjuring/"
    },
    {
        "id": "1nbsyiq",
        "author": "Bennett1984",
        "title": "Almost Famous at 25: The Story Behind Cameron Crowe's Coming-of-Age Cult Classic",
        "content": "",
        "upvotes": 100,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/w2EVjjAfhI4kbCbMjRYuhZB4RWyx8LkD3ke7zAP6Fgg.jpeg?auto=webp&amp;s=1308a27aadd7f14e617d7b2a3160f9e9f1a0628f"
        },
        "permalink": "/r/movies/comments/1nbsyiq/almost_famous_at_25_the_story_behind_cameron/"
    },
    {
        "id": "1nbwugj",
        "author": "CandidMushroom3712",
        "title": "What are your favorite film scores?",
        "content": "One of my favorites is \"Liz On Top of the World\" from Pride and Prejudice, I am going to have to incorporate that one into my wedding one day. I also get chills from \"Mountains\" by Hans Zimmer in Interstellar. \"Duel of the Fates\" is another classic. What are some of your favorites? I want to create a playlist with all of the best. ",
        "upvotes": 64,
        "comments": 147,
        "media": null,
        "permalink": "/r/movies/comments/1nbwugj/what_are_your_favorite_film_scores/"
    },
    {
        "id": "1nbrrbt",
        "author": "Sisiwakanamaru",
        "title": "Amazon Buying Female Action Movie 'Ballerina Overdrive'",
        "content": "&gt; Amazon MGM Studios is finalizing a U.S. deal we understand to be in the $11-12M range for buzzy action pic Ballerina Overdrive.\n\n&gt; The Witcher: Blood Origin director Vicky Jewson has directed the completed feature about a troupe of ballerinas who find themselves fighting for survival as they attempt to escape from a remote inn after their bus breaks down on the way to a dance competition. \n\n&gt; Lana Condor (To All The Boys franchise), Millicent Simmonds (A Quiet Place), Iris Apatow\n(The Hunger Games: Sunrise on the Reaping), Maddie Ziegler (West Side Story), Avantika (Senior Year), Uma Thurman (Kill Bill franchise) and Michael Culkin (The Nest) star.",
        "upvotes": 95,
        "comments": 67,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/adIyMWK-4NudlU6WiIXeyL8bKvpzk3pVh5U_eyPH4pM.jpeg?auto=webp&amp;s=2dc0f884e92fcdb4c4e6c31750ecd397ec9e6940"
        },
        "permalink": "/r/movies/comments/1nbrrbt/amazon_buying_female_action_movie_ballerina/"
    },
    {
        "id": "1nccg1n",
        "author": "90Hrm90",
        "title": "What film has touched you the most? Both positive and negative.",
        "content": "I would like you to tell me which scene in the film gave you that emotion and I would like you to explain what kind of emotion it gave you and whether you would watch that film again. Did it also arouse the same emotions in other people who were with you? Did you watch it again on your own? Did it make you feel the same way or not? ",
        "upvotes": 5,
        "comments": 13,
        "media": null,
        "permalink": "/r/movies/comments/1nccg1n/what_film_has_touched_you_the_most_both_positive/"
    },
    {
        "id": "1nc81zp",
        "author": "KrisSimsters",
        "title": "Rewatching Election",
        "content": "So, I don't know if it's just me, but I'm rewatch Election (great late 90s-early 00s movie BTW) and I'm just wondering if anybody else noticed how they glossed over the fact that Tracy Flick was s*xually assaulted by her teacher.\n\nI mean, yes it was introduced in the beginning and there were consequences for her actions, but it feels like it was glossed over. There was no reason for McAllistar (hoping I spelled it right) to really hate her. In fact, I feel bad for her. Maybe I'm missing something? Or should I read the book soon? Somebody help me out.",
        "upvotes": 10,
        "comments": 20,
        "media": null,
        "permalink": "/r/movies/comments/1nc81zp/rewatching_election/"
    }
]