[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1m77f2i",
        "author": "Legitimate_Ad3625",
        "title": "KPop Demon Hunters has made Netflix history by breaking an unlikely record 5 weeks after its release",
        "content": "",
        "upvotes": 787,
        "comments": 99,
        "media": null,
        "permalink": "/r/netflix/comments/1m77f2i/kpop_demon_hunters_has_made_netflix_history_by/"
    },
    {
        "id": "1m7yfl2",
        "author": "manzworld",
        "title": "Netflix urged to prepare for 'long and messy' Baby Reindeer legal battle\nThe woman who claims to be the real life Martha from the hit Netflix show Baby Reindeer is suing the streaming giant for $170 million, with a pretrial conference taking place",
        "content": "Article - A woman claiming to be the real life Martha from Baby Reindeer [is suing Netflix for $170 million](https://www.themirror.com/entertainment/celebrity-news/baby-reindeers-real-life-martha-524997) and one legal advisor has warned [the streaming giant](https://www.themirror.com/all-about/netflix) to expect a \"long\" court battle.\n\nFiona Harvey [filed a lawsuit against Netflix last year for defamation](https://www.themirror.com/entertainment/golden-globes-netflix-baby-reindeer-882144), intentional infliction of emotional distress, negligence and violation of her right of publicity, according to court documents obtained by The Mirror US. She alleged Netflix \"created an easily accessible road map to allow viewers to track her down in real life and connect the dots to her identity.\" In the show, the character Martha is played by Jessica Gunning.\n\nHarvey claimed she was \"tormented\" after [the show, in which she isn't named](https://www.themirror.com/entertainment/celebrity-news/baby-reindeers-richard-gadd-issues-462748), was released. She said she suffers from \"anxiety, nightmares, panic attacks, shame, depression, nervousness, stomach pains, loss of appetite and fear, extreme stress and sickness,\" according to the court documents. She's seeking $170 million in damages.\n\nA pretrial conference will be taking place in regards to the case today. Legal advisor James Pipe has spoken to The Mirror US and shared what he thinks Netflix could expect as the case begins.\n\nPipe told us, \"This lawsuit between Fiona Harvey and Netflix is already making headlines, and honestly, it's got all the ingredients of a long, messy legal battle. Harvey is suing for $170 million, claiming Baby Reindeer is basically a version of her life, and that Netflix defamed her, violated her privacy, and acted negligently by letting it air. But is she likely to win? That's not so easy to say.\"\n\nHe continued, \"First, she’ll need to prove that viewers could clearly tell she was the inspiration behind the character, and that what was shown was both false and harmful to her reputation. That's a tall order.\"\n\nThe expert explained, \"Netflix hasn't named her, and the show is billed as a dramatized 'true story', meaning some parts are based on real life, but others are fictionalized.\" When suggesting how Netflix will respond, Pipe said they will \"likely lean hard on freedom of speech.\"\n\nHe added, \"They'll argue that the show is protected artistic expression, that names and details were changed, and that no reasonable viewer would assume the character was a 100% accurate portrayal of a real person, especially someone never named.\"\n\nPipe also suggested Harvey might find it difficult to win the negligence parts of her case. \"They'll argue they didn’t act recklessly and took steps to fictionalize the story,\" he said.\n\nThe trial could be a long one, according to Pipe. \"With a claim this size and the level of media attention, we're probably looking at least a year or two before there's any final decision, unless they settle early, which can happen if both sides want to avoid a drawn-out court fight,\" he suggested.\n\nThe expert concluded, \"Bottom line: Harvey has a shot, but Netflix has deep pockets and strong legal arguments. It’s going to come down to whether the court sees this show as storytelling, or something more damaging.\"\n\nBaby Reindeer tells the dramatized story of comedian Richard Gadd's experience of being stalked, with the character Martha ending up with a nine-month jail sentence for her harassment against him. In a statement shared with The Mirror US, Harvey previously said, \"Earlier in 2024, Netflix released a program called 'Baby Reindeer', which they billed and marketed as a 'true story'. One of the two main characters, 'Martha', was clearly intended to be based on me.\"\n\nJames Pipe is a legal advisor who spoke with The Mirror US on behalf of [Free Grants For Felons](https://www.freegrantsforfelons.org).",
        "upvotes": 21,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m7yfl2/netflix_urged_to_prepare_for_long_and_messy_baby/"
    },
    {
        "id": "1m76lde",
        "author": "Double-Reputation151",
        "title": "so...just finished watching building the band",
        "content": "ngl im massively dissapointed that szn4 didnt win but ngl they also lowkey messed up in episode 10...\n\nidk why for episode 10, the performance to win it ALL, they chose to stay pretty static on stage :/ the song choice was just lackluster tbh I was pretty confused when they chose \"Human\" which is a pretty repetitive song that says the same phrase like 50 times. not the greatest choice for a competition to win 500k\n\nI already started to see szn4's loss coming as I watched episode 8 and 9 because they didn't choose great songs at all :/ believer didn't have enough vocal range and complexity to show the uniqueness of szn4 and I forgot what other song they sang (speaks volumes)\n\nits just so disappointing because earlier in the game, somebody that I used to know and sweet love ate SOOOOOO hard and listening to them sing those songs gave me goosebumps. they really missed the mark with song selection - don't get me wrong tho, they sounded great still and their uniqueness still makes them a superior band\\~\n\nmeanwhile 3quency definitely chose very fitting songs - they had dynamic choreo and they just looked and sounded like what someone would typically think of when you say \"girl group\" - the fact that they just fit the image probably played a role in their ultimate win",
        "upvotes": 165,
        "comments": 299,
        "media": null,
        "permalink": "/r/netflix/comments/1m76lde/sojust_finished_watching_building_the_band/"
    },
    {
        "id": "1m7lfgb",
        "author": "Mr-RedT",
        "title": "When Netflix almost got sold to Blockbuster",
        "content": "In 2000, Netflix offered to sell to Blockbuster for $50 million.\n\nBlockbuster said no. \n\nToday, Netflix is worth over $200 billion — and Blockbuster has one store left.",
        "upvotes": 24,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1m7lfgb/when_netflix_almost_got_sold_to_blockbuster/"
    },
    {
        "id": "1m7yngx",
        "author": "jerkoff1610",
        "title": "A full timeline of how Amy Bradley went missing from a Caribbean cruise in 1998",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m7yngx/a_full_timeline_of_how_amy_bradley_went_missing/"
    },
    {
        "id": "1m7ybka",
        "author": "begentlebutrough",
        "title": "Six feet under, underrated",
        "content": "Watch it right now if you haven’t. It’s about a family that owns a funeral home, and delves deep into basically any topic and experience you can imagine. The show is truly unique and made me cry more than I care to admit, especially the finale. \nThe sound track is beautiful, the characters are dynamic and you love and hate them, the cast is amazing. It’s real world, it’s an experience that I haven’t seen done so beautifully other than with this show. \nWatch it now \n",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m7ybka/six_feet_under_underrated/"
    },
    {
        "id": "1m7xb4y",
        "author": "HehroMaraFara",
        "title": "Critical: Between Life and Death",
        "content": "There’s a bunch of similar type shows, like Lennox Hill, that I really enjoyed. This one has its good moments, but I actually found it ended up being way too gratuitous than it ever had to be and lost the story pretty quickly along the way. \n\nIt’s almost more something you might expect to watch in a 2nd or 3rd year class in a pre-med program in college. I actually even enjoy good horror movies and I had to fast forward a ton because it ended up just being big stretches of watching the full on surgery and long shots of the injuries and wounds.\n\nWatch it if you really get off on fucked up injuries, I know some do, but skip it if you enjoy the stories and getting a vibe for what’s happening in a hospital the 99.99% of the time you aren’t there. Instead watch the aforementioned doc. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m7xb4y/critical_between_life_and_death/"
    },
    {
        "id": "1m7w6rm",
        "author": "Rushkovski",
        "title": "Next Zerocalcare series WHEN???!!!",
        "content": "Tear Along The Dotted Line was a masterpiece and so was This World Can't Tear Me Down...\n\nThe first two shows were two years apart, so I hope he was more in him to make and Netflix keeps ordering them because if they don't I *will* start a GD kickstarter.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m7w6rm/next_zerocalcare_series_when/"
    },
    {
        "id": "1m77eb5",
        "author": "Sadie_UK",
        "title": "With The Gentleman series 2 currently filming, which do you prefer? Movie or Series?",
        "content": "I love both, but I feel the movie is JUST a little better than the series. What do you think? I'd imagine we'd get a trailer after Christmas!",
        "upvotes": 45,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1m77eb5/with_the_gentleman_series_2_currently_filming/"
    },
    {
        "id": "1m7ysuy",
        "author": "whomda",
        "title": "Menu previews and sounds much louder than programs recently?",
        "content": "It seems a recent change on our system, that the audio is level is much louder when browsing titles in the menus then when playing a movie. This includes video previews and menu navigation sounds. Anyone else seen this or have advice?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m7ysuy/menu_previews_and_sounds_much_louder_than/"
    },
    {
        "id": "1m7wxo4",
        "author": "ace_loser_whitebeard",
        "title": "Cpop Satan hunters- Rice the pop (non-oc MV)",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m7wxo4/cpop_satan_hunters_rice_the_pop_nonoc_mv/"
    },
    {
        "id": "1m727zn",
        "author": "nickmillersmaid",
        "title": "Why are they rapid firing so many Trainwreck documentaries?",
        "content": "I loved Woodstock 99’. Since, I’ve watched Astroworld, Poop Cruise, and Balloon Boy. I love this style of documentaries, so I’m satisfied and entertained. I’m just wondering why they’re releasing so many all at once? When Woodstock 99’ came out, I was wondering why they wouldn’t continue the series (Like Monsters, the Jeffrey Dahmer series and later the Menéndez Brothers.) ",
        "upvotes": 78,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m727zn/why_are_they_rapid_firing_so_many_trainwreck/"
    },
    {
        "id": "1m7twy7",
        "author": "Mundane_Cause7049",
        "title": "who is your favorite character in animal kingdom",
        "content": "and why is it Pope.  i haven't been as obsessed with a character and their development since Pan in OUAT.  i have no one to talk about this with, if not Pope then why. spill all the beans ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m7twy7/who_is_your_favorite_character_in_animal_kingdom/"
    },
    {
        "id": "1m7ctuo",
        "author": "ladyaftermath",
        "title": "Finally watched a Deadly American Marriage - question about interviews",
        "content": "Why didn't the interviewers ask Molly more questions about her lying to people regarding how she knew the kids' birth mother or how she claimed to give birth to them? I'd be curious what her answer would be.",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m7ctuo/finally_watched_a_deadly_american_marriage/"
    },
    {
        "id": "1m7seae",
        "author": "Flat_Bookkeeper4850",
        "title": "Building the band should have broken up and rebuilt two bands (spoilers)",
        "content": "Hear me out. In episode 9 instead of sending Sweet Seduction home they should have told both bands they’re not working as groups (because they’re not) and give them a new option.\n\nThey have to form two new groups with the members from SS and MTM. \n\nThen they get an hour to learn a new song together and have to perform as their new group, and the stronger one gets to progress.\n\nIt still leaves the power and decision making with the singers but gives us an underdog to root for (because there isn’t really one now), brings some fresh energy, shows us another mixed group. \n\nAnd obviously the interpersonal dynamics (seeing who is quick to abandon their band, the Connor Allison thing, etc).\n\nThoughts? What would you change? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m7seae/building_the_band_should_have_broken_up_and/"
    },
    {
        "id": "1m70z0d",
        "author": "Atlast_2091",
        "title": "All of Us Are Dead | Season 2 Announcement | Netflix [ENG SUB]",
        "content": "",
        "upvotes": 39,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1m70z0d/all_of_us_are_dead_season_2_announcement_netflix/"
    },
    {
        "id": "1m7rb99",
        "author": "Tricky-Ebb9934",
        "title": "Gossip Girl and Riverdale",
        "content": "I'm a fourteen-year-old girl who has heard great things about both Riverdale and Gossip Girl, making me want to watch them badly. However, I'm worried I'm going to be uncomfortable with the content in the shows. I am completely ok if people in shows talk about sex, but I don't like seeing it, as I feel like it makes me lose my \"innocence\" more than I already have. Please let me know what you think I should do.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1m7rb99/gossip_girl_and_riverdale/"
    },
    {
        "id": "1m7qmoq",
        "author": "Mafesbfr7",
        "title": "Building the band",
        "content": "Anyone else get the feeling that it's completely scripted? I'm watching the judges' discussion and the acting is so bad...\nYou can see it's not natural at all.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m7qmoq/building_the_band/"
    },
    {
        "id": "1m7qln0",
        "author": "crosstheroom",
        "title": "Is Cabinet of Curiosities any good?",
        "content": "the first episode was okay, I still don't get why the old man was skipping outside the storage unit.\n\nThe second one with rats seemed stupid so I gave up\n\nare any others good? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m7qln0/is_cabinet_of_curiosities_any_good/"
    },
    {
        "id": "1m7uwfs",
        "author": "National_Tangerine72",
        "title": "I'm so excited!",
        "content": "Wow, can’t wait for Netflix’s Minecraft series… coming out right after the Sun dies in 5 billion years! This will be amazing! I can't wait! Pure joy 🙌🙄",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m7uwfs/im_so_excited/"
    },
    {
        "id": "1m7pw7p",
        "author": "Maximum_Pace885",
        "title": "Misinformation",
        "content": "Friday Night Lights says it's available in Dolby Vision but doesn't apply Dolby Vision when I click on it. I have the premium plan....and also tested other Dolby Vision content on Netflix to make sure my latest TV firmware update didn't result in a bug of some kind. So why would they list that if it shows in SDR? Not a big deal obviously. I just don't see the point of false advertising on their part. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m7pw7p/misinformation/"
    },
    {
        "id": "1m7pr16",
        "author": "Eyale111",
        "title": "Since the app change to edge microsoft i always have bugs like this.",
        "content": "Since the app change to edge microsoft i always have bugs like this.\n\nI already tried everything included their lame support.\n\n  \nI am here before i cancel netflix my membership.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m7pr16/since_the_app_change_to_edge_microsoft_i_always/"
    },
    {
        "id": "1m7pggh",
        "author": "Fuzzy_Dragonfruit504",
        "title": "Evil “Elton John” Movie",
        "content": "Does anyone know the name of a movie, I’m pretty sure it was on Netflix, but there was an actor that played like an evil villain Elton John. I watched it maybe a year or two ago.  Not rocketman. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m7pggh/evil_elton_john_movie/"
    },
    {
        "id": "1m7oufw",
        "author": "ZephyrosOmega",
        "title": "Screen now plays over UI, preventing me from fullscreening, pausing, or adding subtitles.",
        "content": "As said in the title, the actual UI with the progress bar, fullscreen  button, and subtitles button are all stuck under the video screen itself and can't b e interacted with. It was working just fine a couple days ago, I'm not sure what happened or how to fix it. I tried turning off hardware acceleration, refreshing, and resetting my computer. Help?\n\nhttps://preview.redd.it/2fgzus1ilpef1.png?width=4032&amp;format=png&amp;auto=webp&amp;s=2cf9874c65da4ca3385977de42d9d012d3a007be\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m7oufw/screen_now_plays_over_ui_preventing_me_from/"
    },
    {
        "id": "1m7nw6q",
        "author": "Sync_Sy",
        "title": "Zombie Recommendations UK",
        "content": "I’m using UK Netflix and I’ve watched loads of zombie series and movies just seeing if anyone knows any more that are good I’ve not watched. I’ll try list of the top of my head what I have watched - Done Z nation, black summer, #Alive, the Korean one when they’re in the school can’t remember the name, I’ve seen quite a lot so if anyone can recommend me anything you think I might not of seen that’s really good that would be great.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m7nw6q/zombie_recommendations_uk/"
    },
    {
        "id": "1m7nes5",
        "author": "The10thDoctorWhovian",
        "title": "Is there any way to remove the preview images that show up between episodes?",
        "content": "I was planning on introducing a show to someone, but I noticed the preview image that pops up between episodes contains a MASSIVE spoiler for one of the characters. Is there any way to change or remove the image? It pretty much makes it unwatchable on Netflix, since it literally pops up each time between episodes...",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m7nes5/is_there_any_way_to_remove_the_preview_images/"
    },
    {
        "id": "1m7mztm",
        "author": "ArtismFag",
        "title": "Laggy",
        "content": "Ive been binge watching this show called working moms all day and all of a sudden its laggy. I tried redownloading the app. I tried going on my mobile data instead. My internet is working fine. I dont really understand what's going on. Is anyone else experiencing this?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m7mztm/laggy/"
    },
    {
        "id": "1m6ln52",
        "author": "Due-Calendar-4256",
        "title": "What your top 3 all time favorites on Netflix",
        "content": "What your top 3 all time favorite shows on Netflix\nMine:\n#1 DARK (SIC MUNDUS CREATUS EST)\n#2 STRANGER THINGS (011)\n#3 MONEY HEIST (GOLD IS ILLUSION)\n\nI know all are populars show but maybe there exist a underrated gem that ranked for someone and I would love to know about it. So, consider sharing it.",
        "upvotes": 111,
        "comments": 211,
        "media": null,
        "permalink": "/r/netflix/comments/1m6ln52/what_your_top_3_all_time_favorites_on_netflix/"
    },
    {
        "id": "1m792zi",
        "author": "ToonAdventure",
        "title": "Netflix Renews ‘Wednesday’ for Season 3, Eyes Spinoff (Exclusive)",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m792zi/netflix_renews_wednesday_for_season_3_eyes/"
    },
    {
        "id": "1m7cdff",
        "author": "big14gangx",
        "title": "I couldn't decide what to watch for hours so I built a tool that gives you 3 movie recs based on your mood and I need some serious feedback",
        "content": "I was DOOM-scrolling on TikTok and Netflix looking for some good movies to watch but I couldn't find anything to match my mood.\n\nSo I built a quick tool that asks for your mood and gives you 3 movie recommendations that match what you're feeling thriller, depressed , heartbreak, action, whatever.\n\nYou can even choose moods like:\n\n“scary and funny\"\n\n“Adventurous”\n\n“Want to cry but in a good way”\n\nEach movie recommendation also includes a quick description so you can scan fast and decide.\n\nI'm also thinking of letting users leave their own reviews and rate each movie out of 5 stars so it feels more like a community-driven list, not just an algorithm.\n\nYou can try it here → [https://cypress-hide-0280.typedream.app](https://cypress-hide-0280.typedream.app/) \\---\n\nRight now I’m testing it and would genuinely love feedback:\n\nAre the recommendations good? I made sure it doesn't give just mainstream movies.\n\nDo the picks feel right for the mood you typed in? Or kinda off?\n\nDoes it feel like something you would actually use to look for a movie? if not why?\n\nPLSS tear it apart. I’m here to improve it.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m7cdff/i_couldnt_decide_what_to_watch_for_hours_so_i/"
    }
]