[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 11,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 667,
        "comments": 5004,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1nmfcbz",
        "author": "Sudden_Pop_2279",
        "title": "'Kpop Demon Hunters' first Netflix film to pass 300 million views",
        "content": "",
        "upvotes": 92,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nmfcbz/kpop_demon_hunters_first_netflix_film_to_pass_300/"
    },
    {
        "id": "1nm8fle",
        "author": "Trouserpants2011",
        "title": "Netflix screwed up my order in the worst way possible",
        "content": "Went from excited to owner of an unwearable hat. Quality control issue or is Netflix just…? Like who do I even talk to about this lol this has to be a mistake. A mistake which makes my hat unwearable ahead of my vacation trip yay ",
        "upvotes": 106,
        "comments": 23,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zvft8reeodqf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1nm8fle/netflix_screwed_up_my_order_in_the_worst_way/"
    },
    {
        "id": "1nmakbb",
        "author": "StopPlayingRoney",
        "title": "Black Rabbit is not good.",
        "content": "I miss the old days streaming. There was a time when Netflix was THE place to be for creative filmmakers  and experimental ideas. Now it seems like every new show that comes out is a remake of the last hit show. Netflix has become YouTube. \n\nBlack Rabbit is the latest Jason Bateman Netflix vehicle. Like Ozark, Jason Bateman directed a few episodes of Black Rabbit and even Laura Linney came back to helm an episode. The new series mostly looks great even if the Dolby Vision presentation is too dark at times. The writing however is abysmal. The writer Zach Baylin, wrote Will Smith’s Oscar winner King Richard and The Crow. \n\nBlack Rabbit is the story of two brothers. Jude Law’s character Jake operates a popular NYC restaurant while Jason Bateman portrays Vince, an addict that has a penchant for trouble. Vince is barely scraping by in Reno, NV when things take a horrible turn. Desperate, he calls his brother Jake for help and he secures a ticket to New York. We soon find out this is a habit for the brothers. Things take a turn for the worse when it’s revealed that Vince has an outstanding debt with a local mobster. \n\nOh and I forgot to mention, the show starts with the climax. You know, because there has to be a hook to grab the viewer. I guess competent plotting wasn’t an option here. \n\nOkay, here’s the problem. The characters make the most illogical choices over and over again. Just when you think they’ve got everything under control some new contrivance shows up out of nowhere and the characters make the wrong call yet again as if they do not know how to operate in their own world. Vince is a menace. A tornado destroying everything and everyone in his path, and not only does he take zero responsibility for his actions, but he blames it on the people trying to help him. Most of the characters are unlikable. Much like Ozark but this show is somehow more miserable. \n\nUnfortunately this show feels like a watered down version of Ozark which in itself was a flimsy knockoff of Breaking Bad. It even features the same style of title cards. I feel like I just watched this show. Successful family, seedy underbelly, and a secret. Last time it was called The Waterfront. Or Bloodline 10 years ago. Wait, has Netflix been doing this the entire time?",
        "upvotes": 51,
        "comments": 99,
        "media": null,
        "permalink": "/r/netflix/comments/1nmakbb/black_rabbit_is_not_good/"
    },
    {
        "id": "1nm11v6",
        "author": "Capital_Gate6718",
        "title": "Netflix may try to acquire Warner Bros.",
        "content": "",
        "upvotes": 83,
        "comments": 89,
        "media": null,
        "permalink": "/r/netflix/comments/1nm11v6/netflix_may_try_to_acquire_warner_bros/"
    },
    {
        "id": "1nmk3l4",
        "author": "nouvelle_tete",
        "title": "Any one have recommendations about tv series/ movies involving food?",
        "content": "I am currently watching *Bon Appétit your Majesty* and remembered that I really like movies/stories involving food. I've also enjoyed *The Cook of Castamar,* *Midnight Diner:Tokyo Series*, *Eat, Drink, Man Woman, Chef's Table* (all of them), *The Hundred-Foot Journey*. Can be animated , a documentary but can't be a contest or as anxiety inducing as *The Bear.* ",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1nmk3l4/any_one_have_recommendations_about_tv_series/"
    },
    {
        "id": "1nmkssd",
        "author": "StopPlayingRoney",
        "title": "28 Days To 28 Years Later…",
        "content": "A story about life, death, love, and the biggest penis you’ve ever seen!\n\nBefore we get to the latest film in the 28 franchise let’s talk about the original. When 28 Days Later released in 2002 it was a fresh take on zombie horror before The Walking Dead blew up the genre.\n\nI was excited to revisit the original on Netflix in HD over my old DVD for the visual upgrades. It. Looks. Terrible. Turns out the movie was deliberately shot on a low resolution digital camera to create a raw, gritty quality. Unfortunately the movie looks awful on modern 4K televisions. \n\nThe story begins with the animal to human transmission of a virus which immediately turns the infected into rabid monsters. 28 days later our protagonist Jim, played by a young Cillian Murphy, awakens from a coma to find that society has collapsed, his loved ones are gone, and his life no longer has meaning. His adventure leads to a batshit insane third act that almost seems to switch genres. I liked it, but not as much as I did two decades ago. \n\nA new creative team made a sequel in 2007 but it’s not on Netflix so I didn’t rewatch it. \n\nDirector Danny Boyle and writer Alex Garland, the original creative team, return to helm the latest in the franchise. In the 23 years since the original, the pair have made great films including Boyle’s Slumdog Millionaire, and Alex Garland’s Ex Machina.\n\n28 Years Later is absolutely GORGEOUS! The lush green hills of England (or Scotland?) are a sight to behold and a much needed contrast from the first film. I watched it in Dolby Vision on an LG OLED and it looks like a tech demo. \n\nA father played by Aaron Taylor-Johnson is teaching his son how to survive in this dangerous world. They live on a tidal island in a peaceful village with its own post fall culture. I enjoyed watching the two movies back to back because it increased my investment in this world. The added lore was fantastic, but they didn’t make the usual mistake of over explaining, and ruining the tension. The new threats are terrifying and succeed at keeping things interesting. Like the first film, 28 Years Later is an adventure that takes a turn in the third act but this time finishes with an even more batshit ending. I am usually not a fan of legacy sequels but 28 Days Later is excellent. With that said, there are strange Terrence Malick-esque dream sequences and images juxtaposed during the first act that confused the hell out of me. Initially perplexing these stylistic choices made sense over time. I think. During some scenes the cinematography looks and feels like a certain video game but that did not detract from my experience. I really like this movie! Check it out and let me know what you think. \n",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1nmkssd/28_days_to_28_years_later/"
    },
    {
        "id": "1nmk23d",
        "author": "Fit-Guidance-6743",
        "title": "How to change Netflix's language",
        "content": "Hello, I'm a languages student and I want to start listening to some films/series in foreign languages (French and Spanish). The problem is that I don't like watching movies or series, but I know it's a good way to learn new words. I like only few things and I wanted to rewatch some series that I've liked in a different language, but they're not available on Netflix. I've changed the application and the mobile's language but I still don't have the translation and I don't know what else to do. I wanted to watch Tokyo ghoul in French and Avatar (the anime) in Spanish. Is there a way to watch them in a foreign language on Netlifx? ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nmk23d/how_to_change_netflixs_language/"
    },
    {
        "id": "1nmmpx2",
        "author": "swaggy72",
        "title": "Black Rabbit is Phenomenal",
        "content": "I cannot believe I would get that much hooked on anything. The show is absolutely amazing and everyone should go and watch it. Every freaking moment had me on edge. Can't expect anything better.\n\nDon't listen to the people saying its no good. Trust me I have wasted a lot of time on shows that I leave halfway. This one will keep you hooked for all 8 hours.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nmmpx2/black_rabbit_is_phenomenal/"
    },
    {
        "id": "1nlz8tn",
        "author": "LyNx_Op_11",
        "title": "Today I learned Linux is outdated.",
        "content": "I recently bought the Premium Netflix subscription, and wanted to stream shows/movies in 4K from my browser. (Yes, I was just trying to use the thing which I paid for).\n\nBut apparently, since I'm using Linux, I'm unable do so.\n\nAll the content was tagged as HD and the video stats showed that I was streaming 720p content.\n\nSo, I reached out to customer support regarding streaming 4k content using the Netflix Web Application and their advice was to install Windows 11, since \"Linux is an outdated OS\" (as quoted by their customer support chat rep).\n\nI do admit my \"***lack of research\"*** for not reading the browser support for linux which is nested deep down inside 2 links in the Pricing page, but I told them to cancel my subscription and got a no questions asked refund immideately.\n\nIt is really frustrating that this is still an issue.",
        "upvotes": 21,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1nlz8tn/today_i_learned_linux_is_outdated/"
    },
    {
        "id": "1nmj1bl",
        "author": "bankster24",
        "title": "Next Gen Chef… the good and the bad",
        "content": "The good: I like all the contestants, very humble and they all have some serious skills for being under 30. I also like the emphasis on how they work in the kitchen and not just how their dishes turn out.\n\nThe bad: the host Olivia and judge Kelsey! The host was completely useless and had no food knowledge. All I learned from her was she cares too much about her looks and plastic surgery. Kelsey was so obnoxious the whole show, it seems like she had to always stand out as an alpha female. \n\nOverall I think the show has potential but they need better female host and judge selections next time if there’s a season 2.\n\nWhat are yalls thoughts?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nmj1bl/next_gen_chef_the_good_and_the_bad/"
    },
    {
        "id": "1nmi6xv",
        "author": "Even_Ad3458",
        "title": "Will my parents get an email if I chance the restrictions on my profile? Or if i delete the profile and make a new one?",
        "content": "Im 15 almost 16 and i still have a netflix kids account with only PG allowed. I love to watch kdramas and normal teenager shows so I want to change my profile to be at least tv-14 bc thats my age but im scared my dad will get an email about it or smth. Genuinely idk why im scared but i am and i just want to know if he will.",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1nmi6xv/will_my_parents_get_an_email_if_i_chance_the/"
    },
    {
        "id": "1nmh6b1",
        "author": "sofyuhh",
        "title": "Netflix freezing everytime i watch ads",
        "content": "Im watching netflix on my mac and everytime an ad starts it freezes and plays the ad and you would think that maybe when the ad would end it would unfreeze. it doesnt and i have to refresh the whole page. is anyone going through the same thing? ive tried resetting my mac and all the basics you would think of. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nmh6b1/netflix_freezing_everytime_i_watch_ads/"
    },
    {
        "id": "1nlzq1d",
        "author": "GRB787",
        "title": "Black Rabbit",
        "content": "Jason Bateman doesn’t miss!!!!\n10/10\n\nHonestly, I didn’t expect the series to be this good. I think I am on episode three and can’t wait to see how this finishes.",
        "upvotes": 11,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1nlzq1d/black_rabbit/"
    },
    {
        "id": "1nljpn6",
        "author": "something-um-bananas",
        "title": "Haunted Hotel on Netflix is seriously good! I just finished binge watching it",
        "content": "It’s really humorous and more or less light hearted (more, actually). The characters have their own quirks that they carry in every episode but it never feels overdone. I just really hope they don’t cancel this show as there’s huge scope for character development with more seasons. Overall it was very entertaining. \n\nReally good first season and I’m hoping there’s more. ",
        "upvotes": 133,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1nljpn6/haunted_hotel_on_netflix_is_seriously_good_i_just/"
    },
    {
        "id": "1nlkwl5",
        "author": "AnotherDarnDay",
        "title": "The Wrong Paris",
        "content": "Now, don't get me wrong I love box office hits as much as anyone but sometimes I need a little crappy made for TV movie to watch when I'm having a bad day. \n\nCheesy, predictable, over the top, horribly acted hallmark type movies. You can pop them like m&amp;ms.\n\nSo the wrong Paris definitely did it's job, it was all of the above and entertaining and some parts had me dealing with a bout of secondhand embarrassment. (Hello mechanical bull, I'm looking at you and one very icky rider)\n\nI also love movies that poke fun at those reality dating shows like the bachelor, so that was a nice topper. Over all I thought it was pretty good for one of those crappy made for Netflix type movies. I like christmas-y ones so this was a nice change. \n\nMy personal favorite is still love hard though and a Christmas prince. \n\n\nThoughts, did you enjoy? \nI don't want to say anything that might spoil it but it's so predictable that I don't think anything could tell you what you'd already figure out. \n",
        "upvotes": 85,
        "comments": 77,
        "media": null,
        "permalink": "/r/netflix/comments/1nlkwl5/the_wrong_paris/"
    },
    {
        "id": "1nl5mw2",
        "author": "HotComplaint1203",
        "title": "Just finished binging Black Rabbit and don't see anybody on here talking about it yet. I'm surprised.",
        "content": "Jason Bateman and Jude Law in a dark crime drama with gangster loan sharks, shady business dealings, extremely flawed to downright despicable characters, and an interesting look at familial relationships? I was signed up for it the instant I saw the trailer. How is this show not the talk of the town on the sub right now? Great acting, overall great story. It was a bit like The Bear meets Uncut Gems to me, and I thought it was absolutely great.\n\nIf you're into the genre, please check it out, because these are the exact type of shows I want Netflix to make more of!",
        "upvotes": 478,
        "comments": 494,
        "media": null,
        "permalink": "/r/netflix/comments/1nl5mw2/just_finished_binging_black_rabbit_and_dont_see/"
    },
    {
        "id": "1nlz7hg",
        "author": "fbutterfield96",
        "title": "Junichi Okada’s Epic Netflix Samurai Survival Drama Promises Blood, Honor and Hype",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nlz7hg/junichi_okadas_epic_netflix_samurai_survival/"
    },
    {
        "id": "1nmhc23",
        "author": "Cute_Tumbleweed3752",
        "title": "Fan AI made Storyline for Season 2 and 3 of 1899",
        "content": "What if 1899 had not been canceled?\nI asked an AI to step into the minds of Baran bo Odar and Jantje Friese, the creators of Dark and 1899, and imagine what Seasons 2 and 3 could have been if Netflix had not canceled it. The result feels like a continuation in the same spirit: layered, philosophical, filled with mysticism, physics, and heavy themes of trauma and reality.\n\n\n---\n\n🚢 Season 2: The Prison of the Mind\n\nSeason 2 begins with Maura waking up in the year 2099 on the spaceship Prometheus. All the passengers are in stasis pods, and the voyage on the Kerberos is revealed to have been just one level of a vast simulation. At first she believes she has finally escaped, but cracks start appearing. Characters repeat themselves, she sees déjà vu, and the environment glitches. The world feels too much like before.\n\nThe twist comes when she realizes that this “real world” is still another simulation. Her brother Ciarán appears as the Architect, calm and logical, insisting that humanity cannot face reality without these endless loops.\n\nThe triangle device is revealed to be more than a key. It acts like a command line to reality’s code. With it, Maura can freeze time, duplicate people, and even collapse entire spaces into raw geometry.\n\nThe passengers continue to be trapped in their trauma loops, but now they begin to see that their stories might not even belong to them. Their pain feels programmed, recycled endlessly across different scenarios.\n\nThe season ends with Maura pushing the triangle device to its limits. She breaks through the shell of the spaceship and steps into a world that looks like Earth. But when she looks up at the sky, it pixelates into code. She realizes she is standing in the middle of a simulation farm. There are countless worlds, looping forever.\n\n\n---\n\n🌌 Season 3: The Origin World\n\nSeason 3 takes Maura into the Origin Simulation. This is the first world ever created by her father Henry after the death of their mother. It was designed to trap grief and preserve a perfect reality, and every other simulation spiraled outward from it.\n\nThe passengers begin to remember fragments of past lives in other loops. Some recall ships, some recall cities, even entire centuries. They realize they have been recycled for ages as actors in a grand theater run by Ciarán. Their traumas were never entirely their own, but scripts written into the system.\n\nIn the heart of the Origin World stands the pyramid. It holds two commands. Collapse all simulations into nothingness, which would end the suffering but also erase every trace of life. Or merge all simulations into one final reality, a Garden World that would be imperfect but free of endless loops.\n\nCiarán argues for preservation. He believes illusion is mercy, that humanity would shatter if forced to face raw reality. Maura argues for freedom, even if it means imperfection. Without choice, she says, even life is only death repeated.\n\nIn the end Maura chooses to merge. The pyramid dissolves, the code collapses, and the passengers awaken one last time. They find themselves in a peaceful meadow. Their traumas are gone, their memories blurred. For the first time, there is peace.\n\nThe final shot lingers on Maura as she walks with her son. She smiles, but as the camera pans upward the sky flickers once, like a glitch. Then silence. Cut to black.\n\n\n---\n\n🎭 Core Themes\n\nSeason 2 is about illusion inside illusion, freedom that only turns out to be another cage.\nSeason 3 is about the origin of suffering, showing how every loop and every memory comes from grief.\nThe ending is left ambiguous. It could be a true rebirth, or it could be another illusion. The show would have closed on the same philosophical note as Dark, reminding us that healing and doubt often coexist.\n\n\n---\n\nI thought this continuation felt true to the spirit of the show. It gave closure while still leaving questions. Would you have wanted something like this, or would you have written it differently?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nmhc23/fan_ai_made_storyline_for_season_2_and_3_of_1899/"
    },
    {
        "id": "1nlhntr",
        "author": "Shot_psychology_5343",
        "title": "A little late but adolescence really messed me up.",
        "content": "It was great but like another redditor said, I’ve never wished I could unwatch something. Not like “oh haha I wish I could watch this again for the first time” no. I wish I had never watched it.\n\nI’m a 17 year old boy. I feel like an awful person saying this, but I relate to Jamie a lot. I unfortunately saw a lot of myself in Jamie. His outbursts, his overall personality and demeanor, the way he seemed to try to use people and shift the narrative in his favor, etc. I used to be a very aggressive and unpredictable person. I was angry, and even violent. When I would get into a rage, I wanted to hurt people. I’ve done a lot of work on myself, trying my hardest to be better. But watching this brought all of these feelings I thought I had overcome back. Feelings of self doubt. Am I a good person? Could that have been me? I was very manipulative, and I still have tendencies to use people to get what I want, even if not out of malice. It’s made me scared of myself. I always thought “I could never actually hurt someone. Kill someone. I have a conscience, I’m not that bad of a person. I’m not that angry.” But now I don’t know. I still have outbursts from time to time, and that makes me scared of what if one day I go too far? Am I capable of hurting someone in a rage? I take medicines, I see a therapist. I do everything I’m supposed to? \n\nBut should I even be thinking this? Is it concerning that these questions even enter my head? That I have to genuinely think about these things? I would like to say I am a kind, decent person, who has a good moral compass, but what if I’m just kidding myself? What if I’m just pretending? \n\nWhat do you think of my conundrum?\n\n(Ps, sorry if this is the wrong subreddit to discuss this, but I figured it was adequate as this has to do with a Netflix series.)",
        "upvotes": 50,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1nlhntr/a_little_late_but_adolescence_really_messed_me_up/"
    },
    {
        "id": "1nlff9a",
        "author": "Sudden_Pop_2279",
        "title": "'Wednesday' Season 2 Boots 'Stranger Things 3' Off Netflix's Most Popular TV List With 95.4 Million Views",
        "content": "",
        "upvotes": 26,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nlff9a/wednesday_season_2_boots_stranger_things_3_off/"
    },
    {
        "id": "1nlijj0",
        "author": "GWeronika",
        "title": "Black Rabbit Vince character is so irritating",
        "content": "I finished my binge of Black Rabbit and Vince's character irritates me so much. He's the older brother who takes no accountability for anything. It's somehow his brother's responsibility to fix everything he touches.  Jake allows him to do it, which is equally irritating. \n\n1) Vince takes out a lien on his mom's house with loansharks and doesn't pay it back. Somehow it's Jake's responsibility to pay it for him\n2) Vince puts his daughter in harm's way because of the loan and guilt trips Jake \"to think about his niece\" when he didn't give two shits about abandoning his daughter in the first place \n3)  Promises to repay the whole amount not communicating with his brother first about where the money has to be allocated first then gets mad about it\n4)  Agreed to watch the waitress around the predator and she ends up ODing, because he got sidetracked \n5)  Guilts his brother for having money after he worked his ass off at the restaurant. Vince just wants the easy way out everytime like a toxic leech\n\n\nIt's like watching a 50 year old toddler. ",
        "upvotes": 11,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1nlijj0/black_rabbit_vince_character_is_so_irritating/"
    },
    {
        "id": "1nm5tu2",
        "author": "TimesandSundayTimes",
        "title": "Heartstopper star Joe Locke: ‘I did half my A-levels drunk or hungover’",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nm5tu2/heartstopper_star_joe_locke_i_did_half_my_alevels/"
    },
    {
        "id": "1nlwolz",
        "author": "AgeOptimal7728",
        "title": "Any movie similar in artstyle to Mahavatar Narsimha?",
        "content": "I recently watched this movie Mahavatar Narsimha and it felt so unique in its artstyle. This doesn't look like disney nor sony animation style and felt like watching something new. \n\nIs there anything similar available. Doesn't matter if it's not english.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nlwolz/any_movie_similar_in_artstyle_to_mahavatar/"
    },
    {
        "id": "1nm9a6u",
        "author": "HoustonHoustonHous",
        "title": "Looking to resume my membership after a hiatus and I have a question",
        "content": "A couple of years ago the wife forced me to cancel and I’m looking to resume my membership. \n\nHow many DVDs are we allowed to rent these days at a time?",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1nm9a6u/looking_to_resume_my_membership_after_a_hiatus/"
    },
    {
        "id": "1nm0l6a",
        "author": "peoplemagazine",
        "title": "Love Is Blind’s Marissa Speaks Out Against Stephen’s Lawsuit Alleging Unpaid Wages and 'Inhumane Working Conditions' on the Show",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nm0l6a/love_is_blinds_marissa_speaks_out_against/"
    },
    {
        "id": "1nlasox",
        "author": "chungaroo2",
        "title": "Netflix has been killing it with new anime",
        "content": "I just wanted to point out how Netflix has been getting amazing studios and writers to make shows on there platform shout out to dandandan top tier and shout out to sakamoto days top tier. Honorable mentions record of ragnarok. I hope they keep supporting these amazing writers and extremely talented artists and push more amazing shows. ",
        "upvotes": 22,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1nlasox/netflix_has_been_killing_it_with_new_anime/"
    },
    {
        "id": "1nlpjj5",
        "author": "babyinatrenchcoat",
        "title": "“Untamed” Cake",
        "content": "Just finished this mini series and guess I’m the minority who loved it. Been bawling the last 3 episodes and didn’t catch any of the twists.\n\nBut I have a question- what’s up with cake? Every single episode features cake (different kinds) and I just cannot decipher what the underlying meaning is if there is one. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nlpjj5/untamed_cake/"
    },
    {
        "id": "1nmcw9u",
        "author": "fuelsfornerds",
        "title": "Adolescence sucks and here is a breakdown of it",
        "content": "There is a huge problem I see with this show. A very huge problem that majority of the people seem to have the same complaint as me and I generally think that’s why this show is terrible. And the reason is\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThere’s not enough episodes to love this masterpiece ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nmcw9u/adolescence_sucks_and_here_is_a_breakdown_of_it/"
    },
    {
        "id": "1nl8zzn",
        "author": "tinycitygirl",
        "title": "Black Rabbit",
        "content": "Jason Bateman is always great. Took me a min to recognize him! \nOzark feels for sure. Saw Laura Linney directed at least one episodes. \nRecommend for sure! ",
        "upvotes": 10,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nl8zzn/black_rabbit/"
    },
    {
        "id": "1nlq85b",
        "author": "Theangrybul",
        "title": "Help me find this show?",
        "content": "To be fair I have no idea if this was a dream or not but lately I've been wanting to watch a new show or movie and my mind made me remember this one trailer or something. Its about a teen I think trying to get his friend or childhood friend (maybe girlfriend?) To remember this show from their past? Maybe in like a dream hes been having recently? Sorry the details are a bit fuzzy. Any suggestions?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nlq85b/help_me_find_this_show/"
    }
]