[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 498,
        "comments": 273,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 18,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jnjybd",
        "author": "ShermyTheCat",
        "title": "Can we please be done with adolescence threads now",
        "content": "Everyone and their mum has had a go, can we please stop now or do a sticky thread or something? \n\nHere's some additional characters to hit the limit: Gandalf, Master Chief, Snape, Miss Frizzle, Yogi Bear, your mum ",
        "upvotes": 204,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1jnjybd/can_we_please_be_done_with_adolescence_threads_now/"
    },
    {
        "id": "1jnbnsh",
        "author": "South_East_Gun_Safes",
        "title": "Why is every documentary a 3-parter now? This new format of choice seems to stretch out ~1.5hrs of genuine content with repetition and filler.",
        "content": "I’ve watched so many 3 part Netflix docs now that I know the format and they’re far to drawn out to be enjoyable, so avoid them. But now it’s seemingly EVERY new doc!\n",
        "upvotes": 55,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1jnbnsh/why_is_every_documentary_a_3parter_now_this_new/"
    },
    {
        "id": "1jn5mnw",
        "author": "Baby_0il04",
        "title": "Adolescence, detective did what more parents should do.",
        "content": "The detective saw what was going on with Jamie, the incel and red pill stuff. Saw that his son knew about that stuff even though he’s younger than Jamie. We learn that his son has been distant from him. So the detective makes an effort to be closer to his son and be the role model he needs.\n\nHaven’t seen anyone talking about this, so I had to say something ",
        "upvotes": 87,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1jn5mnw/adolescence_detective_did_what_more_parents/"
    },
    {
        "id": "1jn0ega",
        "author": "deuxfleurs04",
        "title": "Adolescence",
        "content": "Obviously, I know I’m not the only one who’s really loved ‘Adolescence’, but I had to post here because wow. I cannot think of anything I’ve ever watched where the dialogue was both written and delivered by the actors in a way that felt so natural and hyper-realistic. Incredible work by the camera crew as well to get each episode in a single shot. Also I’m a social worker, and I cannot get over the scene with Jamie and the psychologist. It felt like a masterclass in appropriate/effective methods in evaluation and talk therapy. I am blown away by this show. I hope it gets many accolades come the next awards season.",
        "upvotes": 170,
        "comments": 113,
        "media": null,
        "permalink": "/r/netflix/comments/1jn0ega/adolescence/"
    },
    {
        "id": "1jnnmxm",
        "author": "Unprotectedtxt",
        "title": "Million dollar Secret",
        "content": "What happens if someone guesses the millionaire on say episode 2. (I just finished 1) does the person(s) who guesses the millionaire get any money for that? \n\nAlso wouldn’t it have been more engaging if we all (the audience at home) also had to guess and wonder throughout the season? Kinda like how engaging the White Lotus is because we are all guessing right up until the seas final. It keeps to so much more invested. \n\nWe could even all be discussing who we suspect right now. But we don’t cause we know who has the money. \n\n",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jnnmxm/million_dollar_secret/"
    },
    {
        "id": "1jnsatm",
        "author": "OppositeOctopi",
        "title": "The Walking Dead",
        "content": "Okay I know I'm very late to this party. But. I've been binge watching and I'm at season 3, episode 10. I DONT WANNA DO ANYTHING ELSE! So salty I have to go to work tomorrow so I have to make myself turn this off. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jnsatm/the_walking_dead/"
    },
    {
        "id": "1jns3i1",
        "author": "lydocia",
        "title": "Any series on Netflix that just leave you feeling really bad?",
        "content": "Looking for recommendations for series that just leave you feeling awful, like truly gut-wrenching, depressing, based-on-true-events kind of shows. The kind that aren’t just sad but actually make you sit in silence for a while after an episode ends, just processing everything.\n\nI’m talking about shows that cover real-world tragedies, injustices, or historical events in a way that really sticks with you. Stories that aren’t just entertainment but actually make you think about how messed up the world can be. I know *Dopesick* and *Apple Cider Vinegar* fall into this category, but I’m sure there are plenty of others out there.\n\nIdeally, I’d like something available on Netflix, but if there’s something really good on another platform, I’d still be interested in hearing about it. I just want something that’s powerful, disturbing, and leaves an impact.\n\nAny recommendations? Would love to hear what shows have left you completely drained after watching.",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1jns3i1/any_series_on_netflix_that_just_leave_you_feeling/"
    },
    {
        "id": "1jnge7i",
        "author": "indiewire",
        "title": "The 7 Best New Shows on Netflix in April",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jnge7i/the_7_best_new_shows_on_netflix_in_april/"
    },
    {
        "id": "1jnrhc8",
        "author": "Exkelsier",
        "title": "Wolf king",
        "content": "Why does it look stop motion using clay models? Its apparently all purely animated, however, the frames skip just like they would in a stop motion animation",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jnrhc8/wolf_king/"
    },
    {
        "id": "1jnnuci",
        "author": "smoosharella",
        "title": "Not allowing website use outside home?",
        "content": "Netflix just locked me out of my laptop for not being at home. This must be new since it always worked for me on laptop only. Genuinely what is the point of having an app and a website designed for use on laptops and mobile devices if you can’t be mobile?\n\nIs this new for everyone else, or was my account just one of the few that held on to the luxury of non-home website use for a bit longer?\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jnnuci/not_allowing_website_use_outside_home/"
    },
    {
        "id": "1jnigc9",
        "author": "seggsy_bimbvo",
        "title": "Asian romance movies",
        "content": "Any sad romance/ drama/ introspective asian movies from before 2012 available on Spain’s Netflix now?\n\nWong Kar-wai or Takashi Miike style?\n\nJust watched First Love: Litter on the Breeze and I’d like to find something similar there…",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jnigc9/asian_romance_movies/"
    },
    {
        "id": "1jmwlgn",
        "author": "Visual_Hyena7258",
        "title": "Con mum, is nobody else annoyed with the filmmakers?",
        "content": "I thought it was a good documentary for the most part. But what kind of lazy filmmakers make a documentary about a subject. And do zero research to find the truth? They could have tried to find out where this lady is actually from. Find other victims of hers throughout the years. It could have been multiple episodes about how vile this woman was. It seems to me that they found out about grahams story online somehow. And just found ppl that were scammed at the same time as he was. I just felt they could have done more work to show us who this horrible lady really was. I mean it seems like grahams wife did more research on her than the filmmakers. \n\nIs this just me and my weird self? Or does anybody else feel like this?",
        "upvotes": 90,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1jmwlgn/con_mum_is_nobody_else_annoyed_with_the_filmmakers/"
    },
    {
        "id": "1jni0oe",
        "author": "Intelligent_Layer219",
        "title": "Downloads not fully downloading?",
        "content": "Title. Episodes say they are fully downloaded (little check on the right of them), but only show 7mb or 12mb of entire show downloaded? It’s not just a visual glitch, viewing them offline only lets me watch like a minute of the show. Fix?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jni0oe/downloads_not_fully_downloading/"
    },
    {
        "id": "1jnlq81",
        "author": "Alexander_Crowe",
        "title": "How do the downloads work?",
        "content": "I'm trying to download the first season of the office which is six episodes. The app told me I have too much other stuff downloaded so I deleted three movies, the entire death note anime (32? Episodes) and a few episodes of other shows i downloaded. Right now i have about 30 Episodes total of a few shows and no movies downloaded\n\nBut the app still tells me that i cant download a single episode more. This isnt the first time this happened.\n\nI can delete like 30gb of content and a 60mb episode is suddenly too much to bare\n\nI dont know what to google or what to even call this problem. Im confused ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jnlq81/how_do_the_downloads_work/"
    },
    {
        "id": "1jnq2mk",
        "author": "6usu6rper6",
        "title": "Monitors blinking BLACK while Netflix app or browser is open",
        "content": "Worked fine until it didn't .\n\nTried:\nReseting app via windows settings\nRepairing app via windows settings\nUninstalling\nLogging out and in\nRestarting PC\n\nI also found an old reddit post where potential HDCP handshake issue was mentioned, along with instructions on tweaking certain Nvidia control panel setting which I do not have.\n\nMain monitor is connected via DP, the other two HDMI.\n\nAny help would be appreciated.",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/f6vdrdg2zwre1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1jnq2mk/monitors_blinking_black_while_netflix_app_or/"
    },
    {
        "id": "1jnhe5g",
        "author": "Josh_Eats",
        "title": "When will they add the rest of Regular Show",
        "content": "idk if it's just me or if it's a regional issue, but I only have access to three seasons of it.  i am a bit confused I have watched the entire series, but it's easier to watch it on netflix rather than on some shady website.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jnhe5g/when_will_they_add_the_rest_of_regular_show/"
    },
    {
        "id": "1jnm42b",
        "author": "massive_crew",
        "title": "Netflix at a second house...30 days?",
        "content": "I know they kick me out of my account at my second house after so many days.\n\nI thought it was 30 days, but it's apparently...not? Is it closer to 20-25 or is it more like \"a certain amount of time based on random factors such as...\"\n\nDoes anyone know for sure? I can't seem to find anything online.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jnm42b/netflix_at_a_second_house30_days/"
    },
    {
        "id": "1jngvlv",
        "author": "Godzy_BB",
        "title": "Netflix in Chrome Volume always at 100",
        "content": "Hi,\n\n  \nI'm watching Netflix in my Chrome browser on my Windows 10 PC. In Windows sound settings I have chrome set to 10% Volume. However, whenever I start watching Netflix, a second Chrome instance appears in Sound setting that is set to 100% Volume. It is really annoying. I already reinstalled Chrome and already disabled exclusive mode for my audio device. Anyone have any idea what I could try?\n\n  \nThanks!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jngvlv/netflix_in_chrome_volume_always_at_100/"
    },
    {
        "id": "1jnkp16",
        "author": "igotthepowah",
        "title": "Idea for a sports related reality show!!",
        "content": "A professional athlete in disguise walks up on a public court/field/etc asks to take the “winner” of an amateur player in a friendly game/race/match/etc. I think a lot of people are curious just how professional stack up to even the most skilled amateurs.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jnkp16/idea_for_a_sports_related_reality_show/"
    },
    {
        "id": "1jn0394",
        "author": "stellacampus",
        "title": "Talk to Me",
        "content": "This was a good movie that I came close to skipping over, so I thought I would wave a little bit of a flag for those who like horror.  Amazingly it has a 94% critic rating on Rotten Tomatoes.  I do recommend watching it in the original Strine language.",
        "upvotes": 18,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1jn0394/talk_to_me/"
    },
    {
        "id": "1jnpul6",
        "author": "Ireland2385",
        "title": "Did anyone think the school factor of Adolescence could of been developed more",
        "content": "To start I think the show is unbelievable and the message is powerful. But part of me feels the factor of the school students could of been developed more to show the outlook some students shared on the situation while simultaneously showcasing the dangerous influence of the likes of Tate ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jnpul6/did_anyone_think_the_school_factor_of_adolescence/"
    },
    {
        "id": "1jn2kcs",
        "author": "forkliftbuilder",
        "title": "The Residence finale: how can this be? (no whodunit spoiler)",
        "content": "Although I have  enjoyed The Residence, there's something I don't get. I'll explain without spoiling the whodunit. During the closed Congressional hearing (present day), we see in a flashback how Cordelia had confronted the killer(s) at the White House and had them arrested. After we return to the hearing, we learn that the committee members are still completely in the dark about the culprit(s) and have even written down their own wrong guesses. But how can this be? Surely the entire world (and especially said committee) would have been aware by now of any arrest(s) made in relation to a murder in the White House?",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jn2kcs/the_residence_finale_how_can_this_be_no_whodunit/"
    },
    {
        "id": "1jniky3",
        "author": "WarningShoddy5975",
        "title": "Has someone hacked my Netflix account?",
        "content": "Hello everyone, I have been experiencing a rather strange situation for some time: I preface my story by specifying that Netflix is ​​included in my box subscription. \nWhen my partner and I connect to our Netflix, we find ourselves on the account of a Hispanic couple: Carlos &amp; Catarina. The address associated with the account is that of Carlos. \nOur account is therefore systematic in Spanish, however our list of lists is indeed ours…. \nWe've never had the problem of a program shutting down because someone else is using our account...\nDo I have a squatter? Am I the squatter? \nHas anyone encountered this problem before? ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jniky3/has_someone_hacked_my_netflix_account/"
    },
    {
        "id": "1jnn5ei",
        "author": "PersianJerseyan78",
        "title": "Disappointed in Adolescence ending",
        "content": "I thought the show was good and an eye opener to parents. But I am disappointed that when the parents were discussing how they could have been better they never specifically mentioned that they should have checked his phone periodically. \nI thought the message was be aware of what your kids are doing. \nIt would have been a great message to make clear to viewers who are parents?\nAgree? ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1jnn5ei/disappointed_in_adolescence_ending/"
    },
    {
        "id": "1jmaee8",
        "author": "AggressiveGrocery773",
        "title": "Con Mum – Graham is not as great as people make him out to be.",
        "content": "It’s honestly wild how much praise this guy gets while his wife is vilified everywhere. People even started a whole Reddit post just to complain about her *vocal fry*—like, really? Meanwhile, Graham dipped right after his wife gave birth so he could drink champagne and eat at Michelin-starred restaurants in Switzerland with his \"*dying\"* mum. Let’s be real—if she wasn’t rich and he didn’t dream of inheriting millions, would he have been this devoted? Doubt it.\n\nThe audacity of this man to take money out of their *joint* account without telling his wife—all for his *rich* mum. And then he had the nerve to go into debt, dragging his wife's finances down with him, just so his mother could continue living this lavish lifestyle (which, let’s be honest, he enjoyed too). I could understand if she was struggling and he was helping with healthcare or basic needs, but no—this was pure greed, and his wife was left alone in a foreign country, raising a newborn with no support.\n\nI get that being abandoned as a kid messed him up, and getting his mum back was a big deal for him. But let’s not pretend her *money* wasn’t a huge factor in his decisions. And then at the end of the documentary, he had the nerve to say, *“My real family are my mates who stuck by me through my worst times.”* (that felt like a direct dig at his wife) Like… excuse me? The irony is unreal—he *didn’t* stick by his *own wife* when she was going through one of the most difficult times in her life. She just had a baby, was alone in a foreign country, and he was too busy chasing inheritance money to be there for her.\n\nJust embarrassing. Instead of taking accountability for how he failed her *and* their child, he basically just doubled down on his selfishness.",
        "upvotes": 395,
        "comments": 147,
        "media": null,
        "permalink": "/r/netflix/comments/1jmaee8/con_mum_graham_is_not_as_great_as_people_make_him/"
    },
    {
        "id": "1jndy6e",
        "author": "Independent-Dot-8349",
        "title": "I can't change my profile??? Help!",
        "content": "I can change to literally any other profile besides mine. Every time I try to switch to my profile I'd be forced into the last profile that was used. How do I fix this? Any help would be appreciated. ",
        "upvotes": 0,
        "comments": 5,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/tkv4pi2caure1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1jndy6e/i_cant_change_my_profile_help/"
    },
    {
        "id": "1jn85xm",
        "author": "BWCDaddy66",
        "title": "Anyone have a recommendation on what show to watch after Longest night and Cell 211?",
        "content": "Just finished Cell 211 and about to rewatch the Longest night. Anyone know of any other series or movie that have such intense edge of your seat scenes, like these two? Preferably series that are like 211 and Longest night?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jn85xm/anyone_have_a_recommendation_on_what_show_to/"
    },
    {
        "id": "1jndlox",
        "author": "Vladik1993",
        "title": "What happened to my Netflix?",
        "content": "I entered my usual user, but for some reason all the content that was before (like what I watched before, or was in the middle of watching) disappeared and replaced by content as if I was on Netflix kids 🤨",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jndlox/what_happened_to_my_netflix/"
    },
    {
        "id": "1jmdv3f",
        "author": "ludefisk",
        "title": "\"His name is Fgwlpskr Pif.\" - The Residence",
        "content": "I mean, stop. Just stop. This show takes the deadpan to a whole new level - everybody gives absolute knock-out performances, and the seriousness with which they deliver some of the best one-liners in Netflix history is just so fun to watch. I'm on episode 6 and I just got to Randall Park saying \"His name is Fgwlpskr Pif\" and I'm just losing it. I'm glad this isn't a background show for me because I know I'd be missing the point of it all ... a lot of the humor is nonverbal and in the pauses and cuts so it's been way better to watch it straight up. \n\nConsider giving this show a watch - it's been a real banger. Heck of a cast and they all seem to play well off of one another. ",
        "upvotes": 134,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1jmdv3f/his_name_is_fgwlpskr_pif_the_residence/"
    },
    {
        "id": "1jnjvk3",
        "author": "JakeSullysExtraFinge",
        "title": "Question about “Adolescence”: Are we supposed to view the dad as toxic or abusive?",
        "content": "... because I don't get that at all. Just seems like the average run of the mill blue collar overworked guy to me. Completely normal. I mean, I don't even see that much of a \"temper\". \n\nI guess that's one aspect of the show I don't quite get. Are people in the UK (I am American) looking at that family and saying \"yup, I can see how that kid turned out that way?\" \n\nI DON'T THINK that's what we're supposed to come away feeling but was curious what other's felt. \n\nYeah, he ain't perfect, he has some stuff he regrets (if you are a parent and are not thinking from time to time about times you fell short of expectations you are doing it wrong) but in the 3rd episode they really seem to be trying to link Jamie's attitude to his relations with his had and I just don't make much of a connection myself.\n\n[](https://www.reddit.com/r/netflix/?f=flair_name%3A%22Question%22)",
        "upvotes": 0,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1jnjvk3/question_about_adolescence_are_we_supposed_to/"
    }
]