[
    {
        "id": "1hmfpsf",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Nosferatu / a Complete Unknown / Babygirl / The Fire Inside / The Order)",
        "content": "# New Theatrical Releases\n\n[A Complete Unknown](https://old.reddit.com/r/movies/comments/1hlsi27/official_discussion_a_complete_unknown_spoilers/?)\n\n[The Fire Inside](https://old.reddit.com/r/movies/comments/1hlsi3n/official_discussion_the_fire_inside_spoilers/?)\n\n[Nosferatu](https://old.reddit.com/r/movies/comments/1hmffh4/official_discussion_nosferatu_2024_spoilers/?)\n\n[Babygirl](https://old.reddit.com/r/movies/comments/1hmffj8/official_discussion_babygirl_spoilers/?)\n\n# Streaming Releases\n\n[Nightbitch](https://old.reddit.com/r/movies/comments/1homiqy/official_discussion_nightbitch_spoilers/)\n\n[The Order](https://old.reddit.com/r/movies/comments/1hlsi4b/official_discussion_the_order_spoilers/?) on VOD\n\n[Juror #2](https://old.reddit.com/r/movies/comments/1hjiwvb/official_discussion_juror_2_spoilers/?) on MAX\n\n# Still in Theaters\n\n[Sonic the Hedgehog 3](https://old.reddit.com/r/movies/comments/1hiae45/official_discussion_sonic_the_hedgehog_3_spoilers/?)\n\n[Mufasa: The Lion King](https://old.reddit.com/r/movies/comments/1hiae58/official_discussion_mufasa_the_lion_king_spoilers/?)\n\n[Wicked: Part 1](https://old.reddit.com/r/movies/comments/1gwxxy1/official_discussion_wicked_part_i_spoilers/)\n\n[Moana 2](https://old.reddit.com/r/movies/comments/1h0uevk/official_discussion_moana_2_spoilers/)\n\n[Gladiator II](https://old.reddit.com/r/movies/comments/1gwxxwd/official_discussion_gladiator_ii_spoilers/)\n\n[Kraven the Hunter](https://old.reddit.com/r/movies/comments/1hd2v8v/official_discussion_kraven_the_hunter_spoilers/?)\n\n[The Lord of the Rings: The War of Rohirrim](https://old.reddit.com/r/movies/comments/1hd2vab/official_discussion_the_lord_of_the_rings_the_war/?)",
        "upvotes": 92,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1hmfpsf/official_discussion_megathread_nosferatu_a/"
    },
    {
        "id": "1hruk2x",
        "author": "ICumCoffee",
        "title": "What is the Best Film You Watched from 2024?",
        "content": "Happy New Year! /r/movies. A little bit of fun to start the year. **The way this works is that you post a review of the Best Film you watched from the past year, 2024.**\n\n**Here are some rules:**\n\n1.\t**Check to see if your favorite film from 2024 has been posted already.**\n2.\t**If not, Please post your favorite film released in 2024. \\[Limit to one Film only\\]**\n3.\t**Explain why you enjoyed your film.**\n4.\t**ALWAYS use SPOILER TAGS.**\n5.\t**The Best Films of 2024 will be chosen by UPVOTES. So if your film has been mentioned, upvote that comment and discuss in child comments.**\n6.\t**Someone already commented Dune: Part Two**",
        "upvotes": 581,
        "comments": 881,
        "media": null,
        "permalink": "/r/movies/comments/1hruk2x/what_is_the_best_film_you_watched_from_2024/"
    },
    {
        "id": "1hs6jew",
        "author": "Top_Use2413",
        "title": "Why Did The Nice Guys (2016) Not Become An Iconic Comedy?",
        "content": "The Nice Guys (2016) is by far the funniest movie I’ve seen released in the last 10 years. The movie is well reviewed, had an immensely popular lead (Gosling) along with a familiar Hollywood legend (Crowe) yet it doesn’t seem to have reached the fame or icon status of a Superbad or The Hangover. In fact, it sold so poorly that they didn’t even make a sequel. I guess my question is why? And is the transcendent, blockbuster comedy movie dead?",
        "upvotes": 7849,
        "comments": 1063,
        "media": null,
        "permalink": "/r/movies/comments/1hs6jew/why_did_the_nice_guys_2016_not_become_an_iconic/"
    },
    {
        "id": "1hsed0y",
        "author": "Nicole_Auriel",
        "title": "What happened to the Daniel Craig era James Bond series?",
        "content": "The general sentiment around the Craig era is that Casino Royale and Skyfall are masterpieces and the other films are either just \"okay\" or downright stupid/boring, definitely not must-rewatch material like the first and third.\n\nI couldn't help but notice that after Skyfall there seemed to be a misguided tonal shift. The first three movies definitely were trying to go for a more grounded-in-reality approach with real life stakes that felt relatable to our modern world (Terrorists/African warlords/Foreign coups). They definitely wanted to ditch the mustache-twirling evil-lair campiness of the earlier bond films in favor of making them as realistic as possible. They even hang a lampshade on this in Skyfall when Q says \"A gun and a radio. What were you expecting an exploding pen? We don't really go for that anymore.\"\n\nHowever in the last two films, they seem to ditch this attempt at over-realism and lean back into the campiness of the old era with notable silly/campy plot points such as the sinister shadowy men sitting around a giant golden table, or a killer nano-robot virus that targets DNA, or machines that can wipe your memories/mind-control you. The gadgets themselves also seem to have taken a 180. Despite them poking fun at the campiness of the older bond films with their high tech gadgets, they end up going back on it and added silly gadgets like the magical magnet balls that allow you float like in zero-gravity.\n\nKeep in mind there is nothing wrong with this approach if you wanted the whole franchise to be like this but the over-the-top campiness of the last two (and arguably bits of the third) definitely clash with the tone that was initially established in the first movie.\n\nThe later bond movies also seem to have an obsession with bond as a character with a sort of \"he's key to all of this\" approach whereas in the first couple movies Bond was just a normal expendable but highly-competent agent. They also pull the \"everything is connected\" card, and claim all the villains from the first movies were all secretly working together instead of just letting them stand on their own and have their own motivations.\n\nFor me personally, I got so attached to the way the first movie was presented that I just couldn't get on board with the last couple. I don't know how we went from targeting financial operations of terrorists to trying to stop killer micro robot infection missiles, and the jarring shift in tone is just too much for me to overlook as someone who prefers the more grounded movies.\n\nI still watch Casino Royale and Skyfall to this day, but I never had any desire to rewatch any of the others. Am I alone in this?",
        "upvotes": 1618,
        "comments": 594,
        "media": null,
        "permalink": "/r/movies/comments/1hsed0y/what_happened_to_the_daniel_craig_era_james_bond/"
    },
    {
        "id": "1hsd087",
        "author": "IDNMAN21",
        "title": "I finally watched JoJo Rabbit",
        "content": "Spoiler warning for those who haven't seen it. \n\n\n\nI knew about the scene that messed everyone up. I've only seen a screenshot prior to watching the movie. \n\nThe movie starts off suitable and fun, but when JoJo saw a certain someone hanging. Messed me up. I couldn't stop crying afterward. When that blue butterfly started flying over the hanging, the water works started flowing. \n\nJoJo and Yorki's friendship was awesome. No Matter JoJo says, Yorki got his back. \n\nI enjoyed the movie and I recommend others to watch it. ",
        "upvotes": 694,
        "comments": 178,
        "media": null,
        "permalink": "/r/movies/comments/1hsd087/i_finally_watched_jojo_rabbit/"
    },
    {
        "id": "1hsnwyr",
        "author": "Muscly_Legs",
        "title": "Are there any anti-coming of age movies?",
        "content": "Obviously there are many movies about young people experiencing personal growth that helps them develop into adulthood, but I was wondering if there are any movies about young characters who aren't able to overcome the challenges they face or are failed by their role models, leaving them unprepared for the adult world. \n\nThe only one I could think of was Barry Jenkins' Moonlight, but I feel like there have to be more.",
        "upvotes": 87,
        "comments": 187,
        "media": null,
        "permalink": "/r/movies/comments/1hsnwyr/are_there_any_anticoming_of_age_movies/"
    },
    {
        "id": "1hsn6ty",
        "author": "Sisiwakanamaru",
        "title": "2025 Movie Actress Roundtable: Angelina Jolie, Demi Moore, Zendaya, Zoe Saldaña, Mikey Madison &amp; Tilda Swinton",
        "content": "",
        "upvotes": 91,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BzIQkkQkqTnGi5AVXSm3KWAZDkBugVZRv5kGJzD4ovQ.jpg?auto=webp&amp;s=aa537e62670bebd85a074c2ead056fcfa56c0e4a"
        },
        "permalink": "/r/movies/comments/1hsn6ty/2025_movie_actress_roundtable_angelina_jolie_demi/"
    },
    {
        "id": "1hs5od7",
        "author": "BunyipPouch",
        "title": "First Poster for Crime-Thriller 'Night Call' - After responding to an emergency call from a mysterious woman, a young locksmith gets unwittingly caught in the crosshairs of a ruthless mob boss.",
        "content": "",
        "upvotes": 1724,
        "comments": 127,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/45es6fexjnae1.jpeg?auto=webp&amp;s=3e7ff695e2525e23a7596b602f884fdce4da6526"
        },
        "permalink": "/r/movies/comments/1hs5od7/first_poster_for_crimethriller_night_call_after/"
    },
    {
        "id": "1hsl77p",
        "author": "Fan387",
        "title": "Bengali film director Arun Roy dies at age 56",
        "content": "",
        "upvotes": 66,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pQvgJXmO3Q1QIxh2tSFGhgbuQtcq-c6cajF63P7_6-Y.jpg?auto=webp&amp;s=1e81483493236bfad483fd1571c953bf9852657e"
        },
        "permalink": "/r/movies/comments/1hsl77p/bengali_film_director_arun_roy_dies_at_age_56/"
    },
    {
        "id": "1hskw0n",
        "author": "Zaphoid411",
        "title": "The Remarkable Life of Ibelin was my top 2024 film",
        "content": "\"The Remarkable Life of Ibelin\" (or just \"Ibelin\" on IMDB) absolutely broke me. \n\nIt's a documentary about  Mats Steen, a Norwegian man who died in 2014 of a degenerative muscular disease. The disease was progressive and by his teens he was wheelchair bound, his condition just got worse from there. In his adult life he became engrossed in the online RPG World of Warcraft, which saddened his family as he withdrew from them. However, Mats left them his login info for the game when he died...\n\nHis parents decided to log in and post a message on his account about his passing... they were immediately flooded with Mats' online friends reaching out with their condolences and stories of online friendship. The family digs into his account and discovers that Mats was not simply gaming, but living a very rich and fulfilling life in the game where he was not limited by his condition. He made many friends, genuinely affected those he cared about and even found love. His online community mostly had no knowledge of his real life condition.\n\nI cried multiple times, but absolutely bawled at the end at his funeral when some of his guildmates attended his funeral and the woman that he had a genuine, loving and complicated relationship with was one of his pall barers.\n\n15/10 - cannot reccomend it enough.",
        "upvotes": 69,
        "comments": 11,
        "media": null,
        "permalink": "/r/movies/comments/1hskw0n/the_remarkable_life_of_ibelin_was_my_top_2024_film/"
    },
    {
        "id": "1hsd8do",
        "author": "artguydeluxe",
        "title": "What is the coolest movie of all time?",
        "content": "There may be better films (although The Matrix is fantastic), but I am hard pressed to find a film that is as cool as this one. The cinematography, actors, dialogue, costumes, action and the killer soundtrack, from the iconic songs to the otherworldly score by Don Davis, even down to the small props and overall production design makes it just the coolest thing I think I've ever seen. The pure style of it is just overwhelming. Watching it again last night clinches it. What else is there?\n\nhttps://preview.redd.it/uqjadhcv9pae1.jpg?width=1440&amp;format=pjpg&amp;auto=webp&amp;s=ea33ce2e90be9caeaca24ec6cdd6833e31367b53\n\n",
        "upvotes": 252,
        "comments": 606,
        "media": null,
        "permalink": "/r/movies/comments/1hsd8do/what_is_the_coolest_movie_of_all_time/"
    },
    {
        "id": "1hsbiua",
        "author": "Automatic-Fennel-847",
        "title": "If you could go back in time and show an audience from the 1800s one movie, what would it be?",
        "content": "I always think about how if could go back in time and show people from that period a movie, what would I show them? A historical movie so they can prevent an event from happening? Like Schindlers list. Or a scary movie to freak them out for fun like The Conjuring? Or a science fiction film to show them what the future holds like Interstellar. What would you show?",
        "upvotes": 295,
        "comments": 921,
        "media": null,
        "permalink": "/r/movies/comments/1hsbiua/if_you_could_go_back_in_time_and_show_an_audience/"
    },
    {
        "id": "1hsp914",
        "author": "Grem357",
        "title": "Requiem for a dream.. First watch... ",
        "content": "Heard about that movie for ages and always put it aside. Thought of it as one of those movies that is somehow talked about alot but does not deliver. \n\n... Just finished it and oh my... That was something. \n\nBrutal story... Goes deep into the darkness of drugs and leaves you there. Don't know what to think right now... But likely a movie that will stick for a while. \n\nDon't remember ever watching something close to it. \n\nEllen Burstyn was... phenomenal. So was the rest of the cast to be fair. \n\nWhat a movie. ",
        "upvotes": 26,
        "comments": 27,
        "media": null,
        "permalink": "/r/movies/comments/1hsp914/requiem_for_a_dream_first_watch/"
    },
    {
        "id": "1hsndds",
        "author": "outremer_empire",
        "title": "Michael Collins | Full Film by Neil Jordan | Warner Bros. Entertainment",
        "content": "",
        "upvotes": 30,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/RyOBQTna5eRGDU7JmB8BKgQhgnTe-1j823K0VWrr3OQ.jpg?auto=webp&amp;s=7c6f86fa49e81c3ca38c29ee864c7c780808aa86"
        },
        "permalink": "/r/movies/comments/1hsndds/michael_collins_full_film_by_neil_jordan_warner/"
    },
    {
        "id": "1hsj0kf",
        "author": "ItsAlmostShowtime",
        "title": "Unofficial Discussion - Wallace &amp; Gromit: Vengeance Most Fowl ",
        "content": "Streaming on Netflix\n\nSynopsis: Gromit's concern that Wallace has become over-dependent on his inventions proves justified, when Wallace invents a smart gnome that seems to develope a mind of its own.\n\nRotten Tomatoes score: 100%\n\nIMDB score: 7.9/10\n\nCast: Ben Whitehead, Peter Kay, Reece Shearsmith, Lenny Henry, Lauren Patel, Diane Morgan, Muzz Khan, Adjoa Andoh\n\nDirected by: Nick Park &amp; Merlin Crossingham",
        "upvotes": 70,
        "comments": 30,
        "media": null,
        "permalink": "/r/movies/comments/1hsj0kf/unofficial_discussion_wallace_gromit_vengeance/"
    },
    {
        "id": "1hsc1h0",
        "author": "joesen_one",
        "title": "Official poster of re-release of 'Sing Sing', in theaters January 17 - based on the true story of a group of Sing Sing inmates finding purpose through the prison's RTA (Rehabilitation Through the Arts) program",
        "content": "",
        "upvotes": 204,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/tems5704voae1.png?auto=webp&amp;s=56819d3d14e1d6be3a3943b72c6be924d5c5a4a0"
        },
        "permalink": "/r/movies/comments/1hsc1h0/official_poster_of_rerelease_of_sing_sing_in/"
    },
    {
        "id": "1hs0sv6",
        "author": "indiewire",
        "title": "Quentin Tarantino's Favorite Movies: 63 Films the Director Recommends",
        "content": "",
        "upvotes": 894,
        "comments": 217,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/u8stUkUGoO_HVMeQVzaLvB06H9t8DgJ_rotDLiNMGvI.jpg?auto=webp&amp;s=65d721754bd4c675b8cb62250962e6129d73a9b0"
        },
        "permalink": "/r/movies/comments/1hs0sv6/quentin_tarantinos_favorite_movies_63_films_the/"
    },
    {
        "id": "1hsoxfn",
        "author": "DemiFiendRSA",
        "title": "‘The Wild Robot’ Sets January 24 Streaming Release Date on Peacock",
        "content": "",
        "upvotes": 18,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Piy_Buc40rnyycEBHAaHYOluZgTr4mPkQcF-H-plLGY.jpg?auto=webp&amp;s=3aaa8aaec7740bf3617dfb45b0330e6c5c92d0db"
        },
        "permalink": "/r/movies/comments/1hsoxfn/the_wild_robot_sets_january_24_streaming_release/"
    },
    {
        "id": "1hs2pr3",
        "author": "TaibhseCairdiuil",
        "title": "How did True Grit get a PG-13?",
        "content": "I watched the Coen Brothers' version of True Grit last night, and it was great, but how did they manage to get a PG-13? The MPAA is pretty strict about showing gore in a PG-13 movie and this one's got brutal gunshots, severed fingers, graphic hangings, and a guy biting his tongue in half. I don't even think it deserves an R, it's just that movies this violent usually get one. ",
        "upvotes": 458,
        "comments": 303,
        "media": null,
        "permalink": "/r/movies/comments/1hs2pr3/how_did_true_grit_get_a_pg13/"
    },
    {
        "id": "1hs1lpa",
        "author": "JonasKahnwald11",
        "title": "New poster for Korean film 'The Priests 2: Dark Nuns'",
        "content": "",
        "upvotes": 463,
        "comments": 76,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/slcioyobqmae1.jpeg?auto=webp&amp;s=5b93c0015ecbdce95ed7bf35cc93cfbcdf02e078"
        },
        "permalink": "/r/movies/comments/1hs1lpa/new_poster_for_korean_film_the_priests_2_dark_nuns/"
    },
    {
        "id": "1hsdui5",
        "author": "pi__r__squared",
        "title": "Why did Queenan and Dignam say this to Billy in The Departed? ",
        "content": "“Do you want to be a cop, or do you want to appear to be a cop?”\n\n&amp;\n\n“What we do not deal with is self-deception….in five years you will not be a Massachusetts State Trooper.”\n\nBilly seemed like a genuinely moral and good person. Did they assume his violent tendencies from childhood would prevent him being successful as a cop, and then sought to use that weakness to their own advantage by having him go in with Costello? It is a noticeably violent environment, and surely a welcome challenge for someone as intelligent as Billy. Were they just setting him up for success in an unconventional way, while also making sure they benefitted from the arrangement? ",
        "upvotes": 80,
        "comments": 34,
        "media": null,
        "permalink": "/r/movies/comments/1hsdui5/why_did_queenan_and_dignam_say_this_to_billy_in/"
    },
    {
        "id": "1hsbsbj",
        "author": "BelonyInMyLeftPocket",
        "title": "What are other movies like Moneyball, where old ideologies are challenged?",
        "content": "Title. It doesn't even need to be sports related. My favorite part of Moneyball are the discussions had between Billy Beane (Brad Pitt) and the team's scouts and executives. Think of the infamous \"he gets on base\" scene. All these scouts and execs are flabbergasted that Beane wants to bring on players on his team with what they believe have major deficiencies, but Beane is simply going by analytics when it comes to his decision making. It ends up revolutionizing how players are evaluated in baseball. Analytics in general end up taking over in other sports as well. \n\nAre there other movies like this? In any industry or line of work?, where traditional methods of thinking and decision making get challenged by new tactics, and those new tactics end up changing the industry moving forward?",
        "upvotes": 85,
        "comments": 109,
        "media": null,
        "permalink": "/r/movies/comments/1hsbsbj/what_are_other_movies_like_moneyball_where_old/"
    },
    {
        "id": "1hrqfbt",
        "author": "Puzzled-Tap8042",
        "title": "John Capodice Dies: ‘Ace Ventura’ &amp; ‘General Hospital’ Actor Was 83\n",
        "content": "",
        "upvotes": 1435,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Z-yCC012gvnUett7SdbolciF7YvPSBzK9jlmV8AzTnw.jpg?auto=webp&amp;s=ebbef1229f27fdcc7ae1b58f8d98e8994c90f9b9"
        },
        "permalink": "/r/movies/comments/1hrqfbt/john_capodice_dies_ace_ventura_general_hospital/"
    },
    {
        "id": "1hscu1i",
        "author": "OkVermicelli3254",
        "title": "Mirror mask",
        "content": "There is a movie named mirror mask that I used to watch ALL THE TIME and I have never met anyone that knows about this god given movie written by Neil Gaiman and produced by Jim Henson Company. If you like Labyrinth, Coraline, or Alice in wonderland. You will LOVE the oddity in this movie. I need this movies fan base to grow \n ",
        "upvotes": 46,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hYnzIFDxgOqmW4EcJg4nEwI67hBi_FfIzfRx8YN_mW0.jpg?auto=webp&amp;s=e13d39be720a06fe635837546688bc6ae19e8b5b"
        },
        "permalink": "/r/movies/comments/1hscu1i/mirror_mask/"
    },
    {
        "id": "1hrl86l",
        "author": "Gurney_Hackman",
        "title": "There Is No Mary Problem in ‘It’s a Wonderful Life’",
        "content": "",
        "upvotes": 2990,
        "comments": 436,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WiiRMiKbUmUJzbOLqpFsHhfbqbMlLGM_RJetplg93xs.jpg?auto=webp&amp;s=04a6214c7c640046df5a04a81a49873aa682683f"
        },
        "permalink": "/r/movies/comments/1hrl86l/there_is_no_mary_problem_in_its_a_wonderful_life/"
    },
    {
        "id": "1hsql1c",
        "author": "Additional_Event_986",
        "title": "Watching 1 Per Day For The Whole Year of 2025",
        "content": "Hey everyone, I put this this question/recommendation out to the r/MovieSuggestions subreddit and while I was getting recommended movies, the moderators took down my post because they don’t allow people to ask for broad movies, only specific genres.\n\nI hope to make it work here and I want to see if you guys can recommend me some more movies. YOU CAN RECOMMEND LITERALLY ANYTHING, ANY TYPE OF MOVIE, GENRE, YEAR, ETC ALL IS OKAY!!! I want to hear your voices and I want to see everything there is to offer.\n\nI have the entirety of January planned out and most of February but obviously I need the rest of the year. So by the end of the year, I’ll have 365 movies watched or more, as I need at least one per day. \n\nThank you guys for your recommendations, I appreciate all of them.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1hsql1c/watching_1_per_day_for_the_whole_year_of_2025/"
    },
    {
        "id": "1hs7d0n",
        "author": "Icy_Ad4208",
        "title": "\"Flow\" is one of the best movies I have ever seen",
        "content": "I saw Flow yesterday since it just arrived in Mexico where I live. I loved it so much that I saw it again today. Maybe I'm biased since I have 3 cats, but the animation, score and camerawork were breathtaking. I've never seen a dialogue-free movie before but this movie captivated me more than any other film I've seen.\n\nHas anyone else seen it? What did you think? ",
        "upvotes": 61,
        "comments": 17,
        "media": null,
        "permalink": "/r/movies/comments/1hs7d0n/flow_is_one_of_the_best_movies_i_have_ever_seen/"
    },
    {
        "id": "1hsfp45",
        "author": "cretoset",
        "title": "Does anyone have any recommendations for movies like The Northman? ",
        "content": "I watched The Northman last night for the first time and fell in love with it. I have seen viking/norse movies before but none of which have struck me in the way The Northman did . \n\nA lot of viking movies are the same thing over and over again but the Northman felt very refreshing and new to me, although it shared a lot of the same structure as other viking movies.  \n\nAny recommendations would be appreciated. ",
        "upvotes": 14,
        "comments": 45,
        "media": null,
        "permalink": "/r/movies/comments/1hsfp45/does_anyone_have_any_recommendations_for_movies/"
    },
    {
        "id": "1hrzf2m",
        "author": "Odd_Advance_6438",
        "title": "Will we ever see Kung Fury 2?",
        "content": "Some of you may have heard of this by now, but the film was shot back in 2019. It has Arnold Schwarzenegger and Michael Fassbender. Based on the bts, it looks like there’s a lot of cool practical costumes\n\nSomehow it fell into a lawsuit a while back, delayed a bunch, and has no release date currently. Do you think we will ever be able to watch it?",
        "upvotes": 131,
        "comments": 43,
        "media": null,
        "permalink": "/r/movies/comments/1hrzf2m/will_we_ever_see_kung_fury_2/"
    },
    {
        "id": "1hsaqsl",
        "author": "satinsheetstolieon",
        "title": "Films about cooking, wine, restaurant life - both fictional and documentaries. Favorites?",
        "content": "Good evening!\n\nMy friend cooked the Timpanum from Big Night for new years, and the film was a great watch to pair. \n\nSome of my other favorites are Sideways and Bottle Shock- I’d love to hear from everyone here about their favorite or maybe under-the-radar movies about cooking, wine, and the culinary life. \n\nThank you! Can’t wait to spend this weekend on the couch enjoying your recommendations :)",
        "upvotes": 25,
        "comments": 95,
        "media": null,
        "permalink": "/r/movies/comments/1hsaqsl/films_about_cooking_wine_restaurant_life_both/"
    },
    {
        "id": "1hrabtn",
        "author": "MarvelsGrantMan136",
        "title": "Robert Eggers Confirms an Extended Cut of ‘Nosferatu’ Will Be Released on Blu-ray",
        "content": "",
        "upvotes": 6451,
        "comments": 597,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-VFlaNW1rto6QEYUoayKsUC5iBOZVI5r90bLb6S1XQg.jpg?auto=webp&amp;s=48cdeec5ff4541d3a42b6fd461373371ee98d720"
        },
        "permalink": "/r/movies/comments/1hrabtn/robert_eggers_confirms_an_extended_cut_of/"
    },
    {
        "id": "1hrbq24",
        "author": "indiewire",
        "title": "Guillermo del Toro is unpacking just how impactful “It’s a Wonderful Life” is on cinematic history.",
        "content": "",
        "upvotes": 4200,
        "comments": 268,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ZZhBF4haHNf6OMq8YnBj30JKE8lbHHKCziczmmqdjBk.jpg?auto=webp&amp;s=28645fdd55a310e2913c6f9cf4ff6b992d5d1128"
        },
        "permalink": "/r/movies/comments/1hrbq24/guillermo_del_toro_is_unpacking_just_how/"
    }
]