[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 12,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1q78fwu",
        "author": "Mountainfox1974",
        "title": "La mole, gennaio '26. E' vero che per i torinesi d.o.c. questo monumento non è il simbolo della città?",
        "content": "",
        "upvotes": 134,
        "comments": 105,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/03spvi8yr3cg1.jpeg?auto=webp&amp;s=1cb7901603824231b146d885617db20a3875b572"
        },
        "permalink": "/r/torino/comments/1q78fwu/la_mole_gennaio_26_e_vero_che_per_i_torinesi_doc/"
    },
    {
        "id": "1q76190",
        "author": "Few_Party395",
        "title": "GTT Merda",
        "content": "This might be the worst transportation system I ever used in my life",
        "upvotes": 65,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1q76190/gtt_merda/"
    },
    {
        "id": "1q7pxge",
        "author": "Overall_Task_2783",
        "title": "scippano ad un anziano in \"crocetta\"",
        "content": "Più o meno all'altezza di largo orbassano dove passa il 12, un anziano che conosco quando stava scendendo dall'auto per andare a lavoro gli hanno rubato la borsa, lui praticamente stava scendendo dalla macchina e aveva la borsa nel sedile accanto, arriva uno che gli chiede indicazioni e poi un altro gli apre lo sportello della macchina e prende la borsa scappando in monopattino, lui aveva già difficolta motorie quindi poteva farci poco niente, vi chiedo se anche voi è mai successa una cosa del genere se sì in che zona e come, e come si può combattere questa delinquenza",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1q7pxge/scippano_ad_un_anziano_in_crocetta/"
    },
    {
        "id": "1q79uh0",
        "author": "Avidey",
        "title": "Sono il fondatore di Ladalo, una nuova app di dating per chi cerca relazioni serie. Lancio il 18 gennaio in Piemonte. AMA",
        "content": "Ciao a tutti,  \nsono il fondatore di **Ladalo**, una nuova app di dating che lanceremo ufficialmente il **18 gennaio**, partendo dal **Piemonte** e poi con un’espansione graduale nel resto d’Italia nei mesi successivi.\n\nVi scrivo qui perché prima ancora del marketing mi interessa **parlare con persone vere**, raccogliere feedback e rispondere a domande senza filtri.\n\n# Cos’è Ladalo (in breve)\n\nLadalo è un’app di dating pensata **solo per chi cerca una relazione seria**.  \nNasce da una frustrazione molto semplice: le app di dating tradizionali funzionano benissimo per swipe, match e chat… ma **malissimo per creare relazioni che durano**.\n\nIl cuore dell’app è un **algoritmo di compatibilità** che non si basa solo su foto o interessi superficiali, ma soprattutto su:\n\n* valori personali\n* obiettivi di vita\n* visione della relazione\n\nL’idea è ridurre drasticamente:\n\n* match a caso\n* conversazioni vuote\n* perdita di tempo\n\ne aumentare la probabilità di incontrare qualcuno **davvero compatibile**, fin dall’inizio.\n\n# In cosa è diversa dalle altre app\n\n* Niente swipe compulsivo fine a sé stesso\n* Profilo più profondo (non solo foto e bio)\n* Algoritmo che privilegia **compatibilità valoriale e prospettive future**\n* Ambiente più ordinato e rispettoso (con filtri contro messaggi espliciti)\n* Funzioni pensate per chi non ha voglia di perdere mesi a chattare a vuoto\n\nNon è un’app “per tutti”, ed è una scelta voluta.\n\n  \nLadalo si differenzia dalle altre app perché utilizza un **questionario strutturato di 25 domande** che alimenta un **algoritmo proprietario di compatibilità**.  \nL’obiettivo non è abbinare le persone in base a gusti superficiali, ma **in base a valori e prospettive di vita**.\n\nLe domande sono state progettate per coprire diverse **aree valoriali e relazionali fondamentali** (modo di vivere le relazioni, visione del futuro, priorità personali, compromessi accettabili e non). Quando la percentuale di compatibilità è alta (70% o più), significa che due persone tendono a pensarla allo stesso modo su aspetti realmente importanti.\n\nQuesto serve a evitare una dinamica molto comune nelle app tradizionali: frequentarsi per mesi e scoprire solo dopo che su temi non negoziabili si è completamente incompatibili.  \nL’idea è **ridurre queste fratture a monte**, aumentando le probabilità di costruire relazioni più consapevoli, stabili e durature.\n\n# Lancio ed espansione\n\n* **18 gennaio**: lancio ufficiale in **Piemonte**\n* Nei mesi successivi: espansione graduale in altre regioni italiane L’espansione dipenderà molto dall’adozione e dal feedback degli utenti.\n\n# Perché scrivo qui\n\nNon sono qui a vendervi nulla.  \nSono qui perché:\n\n* voglio rispondere a dubbi, critiche e domande\n* mi interessa capire cosa funziona e cosa no\n* credo che un progetto del genere debba nascere dal confronto\n\n👉 **AMA – Ask Me Anything**  \nPotete chiedermi qualsiasi cosa: idea, algoritmo (nei limiti), modello, visione, problemi del dating oggi, scelte di prodotto, ecc.\n\n# Dove seguirci (se vi va)\n\nPer aggiornamenti sul lancio e sul progetto:\n\n* 🌐 Sito: [**https://www.ladalo.com/**](https://www.ladalo.com/)\n* 📸 Instagram: [https://www.instagram.com/ladalo\\_app/](https://www.instagram.com/ladalo_app/)\n* 🎵 TikTok: [**https://www.tiktok.com/@ladalo\\_app**](https://www.tiktok.com/@ladalo_app)\n\nGrazie a chi leggerà fino in fondo e a chi vorrà partecipare alla discussione.  \nSono qui.",
        "upvotes": 20,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KNhMf2iOnTKvffvV6ypFBRldxpNaY37Nao--29fYm5s.png?auto=webp&amp;s=8c20432a9fc03388a338d818d3118bd0e59938df"
        },
        "permalink": "/r/torino/comments/1q79uh0/sono_il_fondatore_di_ladalo_una_nuova_app_di/"
    },
    {
        "id": "1q7tg4m",
        "author": "blueseas2015",
        "title": "Vintage Cassette Players or Recorders",
        "content": "Ciao! Qualcuno sapete dove io posso comprare cassette-recorder antiche?\n\nHi! Does anyone know where I can buy vintage cassette players?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1q7tg4m/vintage_cassette_players_or_recorders/"
    },
    {
        "id": "1q7aqsf",
        "author": "NailMuted6705",
        "title": "Compagnia per librerie e musei",
        "content": "Ciao qui F20, cerco qualcuno interessato a visitare mostre e musei qui a Torino, al momento miro al MAO e al museo di Cesare Lombroso, ma qualsiasi altra mostra (soprattutto d'arte) va benissimo. \nAmo leggere, ascoltare musica, la cucina etnica, la montagna e la fotografia- che non pratico ma apprezzo da umile spettatrice ahahaha\nSe qualcuno (con interessi simili ma anche no) avesse voglia di fare amicizia, vedersi un museo o girare per le librerie mi faccia sapere :)\n\n\n",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1q7aqsf/compagnia_per_librerie_e_musei/"
    },
    {
        "id": "1q77pxq",
        "author": "KindheartednessRich1",
        "title": "Ma il mercato del lavoro di Torino fa così schifo?",
        "content": "Ciao a tutti, oggi vorrei capire quanto c'è di vero in questa affermazione che sento dire spesso, dato che a breve mi ritroverò a cercare un lavoro post laurea magistrale. \n\nInvito chi sta cercando un lavoro e chi invece ce lo ha già di raccontarmi la sua esperienza (in quanto tempo ha trovato lavoro, che ambito, se gli/le piace...). Grazie mille in anticipo! ",
        "upvotes": 11,
        "comments": 23,
        "media": null,
        "permalink": "/r/torino/comments/1q77pxq/ma_il_mercato_del_lavoro_di_torino_fa_così_schifo/"
    },
    {
        "id": "1q7r1cw",
        "author": "Famous-Print7360",
        "title": "Hai esperienza con Joivy?",
        "content": "Ciao a tutti,\nMi chiedevo: qual è la vostra esperienza con Joivy?\nHo trovato un post su Joivy di un anno fa in questo subreddit: le persone sembrano aver avuto un'esperienza davvero positiva. Tuttavia, la maggior parte delle recensioni recenti su Google sembrano essere negative.\n\nQuindi mi chiedevo: qualcuno ha prenotato di recente con Joivy e potrebbe condividere la sua esperienza?\nPosso fidarmi?\n\nVorrei prenotare una camera con loro per un periodo piuttosto lungo, quindi vorrei evitare brutte esperienze...\n\nGrazie!!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1q7r1cw/hai_esperienza_con_joivy/"
    },
    {
        "id": "1q7it59",
        "author": "Witty_Elk_9814",
        "title": "Ragazzi di san salvario?",
        "content": "Ciao, M17 di San Salvario sud, c'è qualche ragazzo/ragazza interessati a fare amicizia, magari uscire per andare a bere qualcosa.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1q7it59/ragazzi_di_san_salvario/"
    },
    {
        "id": "1q7heqo",
        "author": "quarta_g",
        "title": "la barriera di Trofarello fa pagare se esci a Santena?",
        "content": "oggi sono passato per la A55 ma alla barriera di Trofarello ho passato il bancomat e non mi ha addebitato nulla, è normale che non faccia pagare o è anomalo?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1q7heqo/la_barriera_di_trofarello_fa_pagare_se_esci_a/"
    },
    {
        "id": "1q7b2z2",
        "author": "AxelRowley",
        "title": "Cerco assemblaggio pc a torino",
        "content": "Ciao a tutti! Qualcuno saprebbe chi potrei contattare per assemblare un pc a domicilio? Possiedo già tutti i componenti necessari ma non ho possibilità di andare in un centro per procedere al montaggio.",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1q7b2z2/cerco_assemblaggio_pc_a_torino/"
    },
    {
        "id": "1q7gcgz",
        "author": "futureaddict8",
        "title": "nightlife",
        "content": "Ciao! I was interested in some information about Torino’s nightlife, basically i want to know if it is suitable for someone that is really social and enjoys a good nightlife(not something crazy like ibiza but still have choices and events to attend)",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1q7gcgz/nightlife/"
    },
    {
        "id": "1q76jqu",
        "author": "Extension-One-2771",
        "title": "Incontrare persone come un tedesco",
        "content": "Ciao a tutti,\n\n\nVolevo chiedere dove posso andare per incontrare gente italiana. Le persone che incontro al lavoro sono tutte molto gentili, ma purtroppo non hanno tempo libero. Domani vado a un piccolo concerto, quindi forse avrò un po' di fortuna. Sono tedesco, faccio molta musica, sono molto socievole e cerco persone rilassate 🫠 Ci sono piccoli locali per eventi organizzati da collettivi? Se sì, come ci arrivo?\n\n\nGrazie per i consigli!!",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1q76jqu/incontrare_persone_come_un_tedesco/"
    },
    {
        "id": "1q6rrtl",
        "author": "wherearemyburritos",
        "title": "Certificato medico per esame patente: medico di base o ASL?",
        "content": "Ciao a tutti!\n\nSpero che la domanda non sia stupida, ma avrei bisogno di un chiarimento.\n\nSto cercando di prenotare l’esame della patente in Motorizzazione e ho un dubbio sui documenti richiesti. In particolare sul certificato medico: non mi è chiaro se devo prima andare dal medico di base per la visita e poi effettuarne uno successivo all’ASL, oppure se basta fare solo uno dei due.\n\nQualcuno che ci è già passato può spiegarmi come funziona?\nGrazie mille a chi risponderà!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1q6rrtl/certificato_medico_per_esame_patente_medico_di/"
    },
    {
        "id": "1q6rfs5",
        "author": "gufhao",
        "title": "Terra Madre Slowfood Festival",
        "content": "Ciao a tutti! 😊\nSono di Berlino e vorrei andare con alcuni amici a fine settembre al *Terra Madre Salone del Gusto* a Torino.\n\nQualcuno ha consigli, raccomandazioni o esperienze da condividere?\n\nGrazie mille! ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1q6rfs5/terra_madre_slowfood_festival/"
    },
    {
        "id": "1q6ddpe",
        "author": "lllllloro",
        "title": "Non ricordo il nome",
        "content": "Tre o quattro anni fa mi avevano parlato di un associazione (credo) che si occupava di orientamento psicologico. Praticamente offrivano la possibilità di fare un colloquio di persona per indirizzare chi volesse iniziare un percorso verso uno specialista adatto alle sue esigenze ed ai suoi obbiettivi. Se non sbaglio ricevevano all’aula studio dei murazzi.\nQualcuno se ne ricorda e sa dirmi se esiste ancora?",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1q6ddpe/non_ricordo_il_nome/"
    },
    {
        "id": "1q61fmb",
        "author": "Juno_Panda",
        "title": "Consigli zona San Salvario",
        "content": "Sto cercando casa a Torino e ho ricevuto due proposte in zona San Salvario. Rispettivamente Via Ormea e Via Saluzzo. Nell’immagine ho indicato a che altezza sono le case. Tra le due, qual è la più sicura per muoversi e prendere la metro o i mezzi da sola? ",
        "upvotes": 5,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1q61fmb/consigli_zona_san_salvario/"
    },
    {
        "id": "1q63yfi",
        "author": "Ok_Benefit8726",
        "title": "👋Ti diamo il benvenuto su r/torino_climb_together - Per prima cosa, presentati e leggi le linee guida!",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1q63yfi/ti_diamo_il_benvenuto_su_rtorino_climb_together/"
    },
    {
        "id": "1q6l3p8",
        "author": "Overall_Task_2783",
        "title": "domanda per chi fa politecnico",
        "content": "Io che vorrei vedere magari un corso posso entrare e vedere lezioni a caso anche se non ho tessera o cose varie, tipo per vedere come è l'ambiente, di mia spontanea volotnà",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1q6l3p8/domanda_per_chi_fa_politecnico/"
    },
    {
        "id": "1q5wrnj",
        "author": "ChocolateSprinkles7",
        "title": "What's the best Sim card to but in Turin",
        "content": "Hey ya'll, I'm an international student here in Turin, I have an Iliad Sim card, but the internet speed is not it at all and in many places it goes to almost zero. I'm currently living in San Salvario area and I would like the best for a fast and reliable internet connection, many thanks. \n\nP.S: you guys have a beautiful city, I love it! (Except for the sidewalks full of dogs \"leftovers\") ",
        "upvotes": 4,
        "comments": 23,
        "media": null,
        "permalink": "/r/torino/comments/1q5wrnj/whats_the_best_sim_card_to_but_in_turin/"
    },
    {
        "id": "1q4s7k2",
        "author": "BrutalSock",
        "title": "Se sleghi il cane, non chiedere ad alti di gestire la situazione.",
        "content": "Scrivo questo post perché è la seconda volta che mi capita questa cazzata in pochi giorni ed evidentemente a molti non è chiaro come funziona questa roba:\n\nSe un cane libero (il vostro) si avvicina a un cane legato (il mio) é inutile che pretendiate che io “mi allontani” o “lo tenga”. Al di là della questione che il cane \\*\\*é vietato liberarlo fuori dalle aree cani\\*\\* (e che quindi non so cosa vogliate), se quello si avvicina io non posso più fare nulla, l’interazione a quel punto la gestisce completamente il vostro cane.\n\nSe io mi metto a tirare al guinzaglio non faccio che aumentare il rischio che si attacchino. Posso solo stare fermo.\n\nColgo anche l’occasione per dirvi che, sempre al di là del fatto che sarebbe vietato a prescindere, se sapete che il vostro cane litiga coi maschi forse sarebbe un motivo in più per non togliergli il guinzaglio.\n\nSaluti.",
        "upvotes": 295,
        "comments": 47,
        "media": null,
        "permalink": "/r/torino/comments/1q4s7k2/se_sleghi_il_cane_non_chiedere_ad_alti_di_gestire/"
    },
    {
        "id": "1q5gnzy",
        "author": "futureaddict8",
        "title": "university student life in torino",
        "content": "Ciao! As an international student currently considering the University of Torino for their economics and finance with data science program in english, i would like to ask for some information.\n1) How is Turin as a student city? Is the nightlife vibrant with events and clubbing, and are there many international students around?\n2) How easy would you say it is to socialise in Turin?\n3) Will the professors use Italian in class for discussions or english will be the only language used?",
        "upvotes": 11,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1q5gnzy/university_student_life_in_torino/"
    },
    {
        "id": "1q5syep",
        "author": "enoughtodo67",
        "title": "Qualcun* che ha difficoltà nel relazionarsi disponibile per amicizia?",
        "content": "Ciao popolo! 🫶🏻\nVolevo sapere se è possibile trovare su questa piattaforma nuova per me, persone che abbiano timidezza o problemi nel relazionarsi e le quali vorrebbero fare amicizia.\nC'è un ragazzo di 21 anni che vorrebbe conoscere nuove persone con le quali uscire, però è molto timido. ",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1q5syep/qualcun_che_ha_difficoltà_nel_relazionarsi/"
    },
    {
        "id": "1q5eams",
        "author": "emanueleoggiano",
        "title": "Shopping di qualità (vestiario) in alternativa a fast fashion (a Torino)",
        "content": "",
        "upvotes": 8,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1q5eams/shopping_di_qualità_vestiario_in_alternativa_a/"
    },
    {
        "id": "1q5euvi",
        "author": "vici0608",
        "title": "Italian course not too expensive?",
        "content": "Hi guys, I am currently learning Italian and I‘m at the Ciao Italy school here in Turin. Unfortunately, the courses are pretty expensive and idk if I can continue them with that price. Do you have any tips where I can find Italian courses that are not super expensive, or at least more affordable? Almost 400€ every 6-8 weeks is not possible :(\n\nRn I’m doing in person courses but I‘m also ok with online ",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1q5euvi/italian_course_not_too_expensive/"
    },
    {
        "id": "1q50cwl",
        "author": "_crisz",
        "title": "Per quale diavolo di motivo Arriva e l'SFM hanno gli stessi identici orari sia all'andata che al ritorno?",
        "content": "Abbiamo una ferrovia e abbiamo un'azienda privata che mette a disposizione pullman per l'aeroporto. È così difficile intervallare i passaggi? Non dico tanto per l'SFM che arriva da Fossano o da Alba e non ha questa flessibilità, ma un'azienda privata quanto ci metterebbe a controllare gli orari dei treni e accorgersi che sta facendo lo stesso giro praticamente in contemporanea? E non solo una, ma praticamente tutte sia all'andata che al ritorno dall'aeroporto. Poi nei festivi entrambi hanno un passaggio all'ora, lasciando quindi un buco di un'ora per poi passare insieme",
        "upvotes": 19,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9mty1ecvwlbg1.jpeg?auto=webp&amp;s=4acfe54be00ea73a85b642a3d19078ad06d6f099"
        },
        "permalink": "/r/torino/comments/1q50cwl/per_quale_diavolo_di_motivo_arriva_e_lsfm_hanno/"
    },
    {
        "id": "1q5efu3",
        "author": "nessunoste",
        "title": "Pareri sulle scuole primarie in zona piazza statuto.",
        "content": "Abitiamo nei dintorni di piazza statuto e a breve dovremo iscrivere nostro  figlio di 6 anni alla scuola elementare (primaria).\nAttualmente siamo molto indecisi tra la scuola Boncompagni (via vidua) e il Convitto Umberto I (via Bligny).\nQualcuno ha esperienze, pareri o consigli in merito?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1q5efu3/pareri_sulle_scuole_primarie_in_zona_piazza/"
    },
    {
        "id": "1q5h702",
        "author": "pietrosantoro13",
        "title": "Progetto Coabitazione",
        "content": "Salve a tt sto cercando delle persone con cui cercare una casa a Torino città, possibilmente con qualcuno con disponibilità economiche da lavoro avviato. contattatemi se siete interessati. Non so se il post concerne di più la bacheca degli annunci ma questultima mi sembra poco frequentata ed inutile\n\n  \nEDIT: mi trasferirei a fine Aprile",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1q5h702/progetto_coabitazione/"
    }
]