[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 46,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 15,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qm5a5m",
        "author": "LosJones",
        "title": "The commentary on this live stream is annoying",
        "content": "Can they shut up for twenty seconds? He's talking and they're just speaking right over him. It makes it almost unbearable to watch. \n\nI hope they learn from this if they ever do anything like this again",
        "upvotes": 168,
        "comments": 107,
        "media": null,
        "permalink": "/r/netflix/comments/1qm5a5m/the_commentary_on_this_live_stream_is_annoying/"
    },
    {
        "id": "1qm5w0n",
        "author": "bh4v1_",
        "title": "Netflix, you should have done better on skyscraper live",
        "content": "People inside the buildings coming up and waving, the constant commentary over Alex speaking, the unnecessary conversations with him while he’s over a building and getting the crowd to shout at him whilst he’s up there. Having his wife appear from inside - it’s like they’re doing everything they can to throw him off his game. \n\nI get it’s fun for the show, and looks cool, but the guy is climbing a skyscraper ffs. \nHe’s doing enough to get you your views, please just let us watch him climb and PLEASE LET US HEAR HIM. I’m so sick of the constant yapping from the panellists; it’s like they’ve been told not to come up for air! \n\nFeels really irresponsible of Netflix to allow this tbh; like the marvellousness of a free solo climb is just being made a mockery of tbh and this is a real person up there. A huge disservice to climbing, and to Alex.\n",
        "upvotes": 102,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1qm5w0n/netflix_you_should_have_done_better_on_skyscraper/"
    },
    {
        "id": "1qm64ef",
        "author": "steal_your_thread",
        "title": "Skyscraper Live is all wrong",
        "content": "Netflix have gotten this wildly wrong, they don't seem to remotely understand what we wanted from this. I straight up couldnt care less about this random commentator having a crack at a part of the climb, or a prerecorded clip of Alex talking about not wanting to die. \n\nWE WANT TO WATCH THE CLIMB.\n\nShut up, keep the climb on the large screen and put all your stupid nonsense filler in that mini screen, if on at all, and STOP TALKING OVER ALEX. They are adding absolutely nothing to this, no commentary at all would be significantly better than these terrible commentators saying how 'scary and dangerous' for the 100th time.",
        "upvotes": 35,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1qm64ef/skyscraper_live_is_all_wrong/"
    },
    {
        "id": "1qm38tl",
        "author": "Explosive_Doggo",
        "title": "Is \"skyscraper live\" really a live?",
        "content": "just sounds like a horrible idea to do a super life threatening challenge on live, and would be a giant detriment to Netflix's reputation if some accident happened, it just makes sense that they would record it before going \"live\" to make sure there's no complications ",
        "upvotes": 23,
        "comments": 108,
        "media": null,
        "permalink": "/r/netflix/comments/1qm38tl/is_skyscraper_live_really_a_live/"
    },
    {
        "id": "1ql4deb",
        "author": "Large-Cardiologist54",
        "title": "Does anyone else spend more time choosing than actually watching?",
        "content": "I don’t know how many times I open up Netflix, sit down with snacks ready… and some how 20 minutes later I am still scrolling lol.. \n\nI mean it’s not that there’s “nothing” to watch. It’s that everything feeling like a commitment nowadays…\n\nIt’s either too long, too heavy, or not the right mood. \n\nHalf the time I just give up and rewatch something I’ve already seen. \n\nIs this just me, or does choosing feel harder than watching 😩?\n\nWhat do you usually end up doing when this happens? ",
        "upvotes": 1001,
        "comments": 173,
        "media": null,
        "permalink": "/r/netflix/comments/1ql4deb/does_anyone_else_spend_more_time_choosing_than/"
    },
    {
        "id": "1qlg076",
        "author": "ashbat1994",
        "title": "Why can't I watch end credits on TV anymore?",
        "content": "I like to sit with the end credits for a while to absorb and contemplate what I've experienced. I've disabled autoplay but after finishing any movie or show I get a giant ad on what to watch next with the end credits being in a tiny box. \n\nEarlier I could go and choose to watch credits but now any any navigation remote button I press just completely stops it. It's been happening since the past week or so, completely frustrating and dampens the experience.",
        "upvotes": 168,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1qlg076/why_cant_i_watch_end_credits_on_tv_anymore/"
    },
    {
        "id": "1qlqlst",
        "author": "Imaginary-Shock4917",
        "title": "Social media has ruined this genre",
        "content": "My favourite movies are the ones with a crazy twist at the end, mainly because I’m really bad at guessing what’s about to happen so I suppose it’s a natural shock to me. Also, I absolutely hate spoilers so if I accidentally tly read a spoiler about a film or movie I was intending on watching , I don’t watch (eg Shutter Island 😤) Anyway, I was looking forward to watching the short series His and Hers, as I’d read that it was that type of film, but because I read one comment about how much of a crazy twist this series had, before I’d gotten around to watch it, I started to see other comments of a similar nature (social media feed for you). Although this isn’t a direct spoiler, I managed to guess what would happen early on and I suppose it ruined it slightly. Bear in mind , I’m usually crap at guessing stuff. Hey ho, maybe it was that type of film where it was easy to guess I suppose. ",
        "upvotes": 8,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1qlqlst/social_media_has_ruined_this_genre/"
    },
    {
        "id": "1qlv3c0",
        "author": "ankoch1119",
        "title": "No Titles Currently Streaming in 4K?",
        "content": "I have the Premium plan, and I used to be able to see what titles were 4K or HD. However, I no longer see those icons indicating video quality. I assumed it was just an issue with the UI of my 4K Smart TV's Netflix app. However, I've seen a couple other people complaining about something similar, and when I go into my desktop app, every title is showing HD as opposed to 4K. I've triple checked my plan to confirm that I do have Premium with 4K streaming capability.\n\nPlus, when I go onto Letterboxd, no Netflix titles are listed as being available in 4K. This includes brand new Netflix originals and movies that were absolutely in 4K recently. \n\n  \nAny idea what's happening?",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1qlv3c0/no_titles_currently_streaming_in_4k/"
    },
    {
        "id": "1qluo6u",
        "author": "seldom_r",
        "title": "Suggested shows starting at the last season instead of the first",
        "content": "Netflix keeps doing this. Displaying recommendations for a show and you click thru to watch it. After a while you realize you are missing something, some part of the story. You check and see they started you on Season 2 or 6 or whatever the last season was instead of the first.\n\nThis has been happening to me for years and it makes no sense that they can't figure this out already. It is their business.. how can they be so careless?\n\nThe UI is so stripped down that it is impossible to get show information without finessing it. A sentence or two description which usually isn't helpful and no ratings or reviews. \n\nThey want you to just click on thru from their suggested row without knowing anything and the one thing they have to do is start from the beginning. It really bothers me that such a huge company with ever increasing fees refuses to update the UI or fix major bugs. \n\nOther streamers have figured it out, why not Netflix? Am I missing something or am I the only one with this problem.\n\nI'm a browser user, not app or tv app, just the web browser. It can't be this hard.",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qluo6u/suggested_shows_starting_at_the_last_season/"
    },
    {
        "id": "1qlc7e3",
        "author": "worrynelly",
        "title": "Unpopular opinion (maybe?): Season 5 of Emily in Paris just didn’t hit the same 😬",
        "content": "&amp;#x200B;\n\nOkay, I went into Emily in Paris Season 5 ready for the cute outfits, chaotic love triangles, dreamy Europe vibes.. the usual comfort-watch formula.\n\nBut somehow? It felt a little flat.\n\nThe fashion was still fun, and Paris/Rome remain unreal, but the storylines felt recycled. Same relationship drama, same misunderstandings, same Emily making questionable decisions but somehow winning anyway. I kept waiting for a moment, a twist, growth, something,  and it never really came.\n\nAlso, does anyone else feel like the characters are kind of stuck? Like five seasons in and we’re still running in circles emotionally? I miss when the show felt light, surprising, and effortlessly charming instead of predictable.\n\nThat said, I didn’t hate it. It’s still an easy, colorful watch. Just not the binge obsession it used to be.\n\nCurious if it’s just me though 👀\n\nDid you love Season 5, or are you feeling the Emily-in-Paris fatigue too?",
        "upvotes": 40,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1qlc7e3/unpopular_opinion_maybe_season_5_of_emily_in/"
    },
    {
        "id": "1qlviyi",
        "author": "PainterStrong651",
        "title": "We need another season of the circle please",
        "content": "I have been watching all of the seasons do #thecircleUS and where is the 8th SEASON? Why aren’t we getting anymore info!!!! Please tell us something at least. I love this show more than anything else on Netflix ! ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qlviyi/we_need_another_season_of_the_circle_please/"
    },
    {
        "id": "1ql9nus",
        "author": "Top-Three-USA",
        "title": "Netflix Hits Pause on Alex Honnold’s Daring Taipei 101 Climb as Rain Forces Live Event Delay",
        "content": "",
        "upvotes": 48,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ql9nus/netflix_hits_pause_on_alex_honnolds_daring_taipei/"
    },
    {
        "id": "1ql7ttn",
        "author": "yuzusorbet",
        "title": "Is \"Skyscraper Live\" today (Friday) or tomorrow (Saturday)?",
        "content": "UPDATE: Netflix confirmed that it'll be postponed by a day due to the weather.  \n\"*Skyscraper Live was originally scheduled to air on January 23. Due to weather conditions, the live event is postponed, and will now stream on Saturday, January 24 at 8 PM ET / 5 PM PT.\"*\n\n\\--\n\nEDIT to add:\n\nThe weather forecast in Taipei for today is 15 - 20c, 80% chance of rain. Maybe this is why the date is shown as one day later. But I haven't seen any official announcements that they're postponing it.  \n\\---\n\nOriginal post:\n\nI'm in the West coast and it's 4:19pm PT, Jan 23 Friday.\n\nI thought it starts Friday 5pm PT, but why does my Netflix says Skyscraper Live is t**omorrow 5pm PT**?\n\nI can't paste a screenshot but wonder if others see the same?",
        "upvotes": 57,
        "comments": 61,
        "media": null,
        "permalink": "/r/netflix/comments/1ql7ttn/is_skyscraper_live_today_friday_or_tomorrow/"
    },
    {
        "id": "1qm0gcg",
        "author": "anbeasley",
        "title": "Still no play from the beginning button",
        "content": "It baffles my mind that I'm not able to play content from the beginning from the main menu regardless of which device I'm using. I always have to play the content and then drag my finger to the beginning of the seek timer on the buttom. Other services like Plex and Amazon prime video have a play from the beginning button. Is there some sort of patent that Netflix is not allowed to use as I feel like this is a pretty common UI feature amongst streaming platforms?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qm0gcg/still_no_play_from_the_beginning_button/"
    },
    {
        "id": "1qlmp7e",
        "author": "interseba5",
        "title": "Just finished Run Away, one question about a big plot hole",
        "content": "Just finished Run Away, a terrible series in every aspect. \n\nBut the single big thing that I cannot understand is how and why Cornelius finds the knife used by Ingrid to kill Aaron. Ingrid has planned the whole thing and cleaned up the crime scene. Why did she leave the damn murder weapon here?!?",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qlmp7e/just_finished_run_away_one_question_about_a_big/"
    },
    {
        "id": "1qltm2o",
        "author": "inkslinger24",
        "title": "Line Rigging/Rope Access/Safety for Netflix Reality Shows?",
        "content": "TLDR: Need recs for shows with climbing, jumping, falling, anything someone would be harnessed in for.\n\nDoes anyone know who does the line rigging/safety for Netflix's reality shows?  Or have any suggestions of other shows to watch that might have more ledes?\n\nI was watching Battle Camp, and was honestly stopped and a little confused by some of the line rigging, it really pulled me out of the experience, the belayers  almost dropped someone...But it got me wondering, who does the safety and line rigging for netflix's reality shows, the credits are super confusing maybe Nep UK and RT Group?\n\nI would appreciate some help internet detectives!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qltm2o/line_riggingrope_accesssafety_for_netflix_reality/"
    },
    {
        "id": "1qm4qhg",
        "author": "wh1tef3rrari",
        "title": "Why can’t we download anything on Windows laptop anymore??",
        "content": "there is a snow storm coming , and just in case i want to have some things on my laptop i can watch. i distinctly remember a year or two ago watching shows that i had downloaded when the power at my house went out. now, i can’t download anything? i searched it and apparently you can’t, but on my ipad i cant. but i prefer to have it on my laptop, why is this?? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qm4qhg/why_cant_we_download_anything_on_windows_laptop/"
    },
    {
        "id": "1qlygcr",
        "author": "Civil_Intention_3709",
        "title": "Netflix Analytics Engineer intern interview",
        "content": "I have an upcoming Analytics Engineer(AE) Intern interview at Netflix and wanted to understand the interview format and what is asked in different rounds\n\nI have heard they test SQL and Python — for Python, is it more LeetCode/DSA or data manipulation (pandas-style)? \n\nBeyond Python/SQL, what AE topics should I expect — data modeling, pipelines/ETL, experimentation, ML concepts, or business metrics?\n\nAny guide on how to prepare product sense type of questions (eg: give a new feature to increase the watch time on netflix and how will you measure success of this feature?)",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qlygcr/netflix_analytics_engineer_intern_interview/"
    },
    {
        "id": "1qlyg7f",
        "author": "ell_enne",
        "title": "SS: Single Salma",
        "content": "Let me start with a disclaimer,\n\nI love Huma Qureshi.\n\nShe is bold. She is beautiful.\n\nEver since I first saw her next to Madhuri in ***Dairh Ishqiya***, I was enamored by her sensuous charms.\n\nUntil I saw Single Salma.\n\nS ... \\*hit\n\nS ... Show\n\n81 minutes of utter and complete brain rot!\n\nI finished the movie and haven't left my spot since. My grey matter loss is so huge that my capacity for functioning seems compromised. No movie has ever done this to me before.\n\nI can see that at some stage, probably during the ideation phase, Single Salma intended to be an unconventional feminist movie. It had the right elements. But somehow along the way the writers switched their dealer perhaps, and then all those promising elements went up in flames of a dumpster fire. The film ended up losing the plot to a point that the feminist in me was left staring at this Huma Qureshi shaped train wreck moving in slow motion. Agonizing.\n\nYou see, the thing is it's infuriating to watch a supposedly feminist movie that mock the entire concept of feminism this remorselessly. Designed for an predominantly South Asian audience, the film uses infidelity, cheating, undressing in public as vehicles of a feminist narrative. I mean isn't this EXACTLY what \"***babban's***\" (the bleach head villian of the movie) of this world imply and insinuate as the only implication of women empowerment!\n\nThe film opens with a promise of connecting the dots between Salma - Sikandar's beloved from the past - and Sikandar's present day success. And the only triumph they ended up communicating is that Salma left the alter. Sikandar's success was in effect born out of his thankless, cheating bride running away for a modeling gig.\n\nEven if you never paid to watch this movie, it is still super costly because you'll be paying with a fried brain. Learn from my mistake. 🙏\n\nVerdict: Indian Judiciary should consider adding this to the jail time of inmates as their penal labour.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qlyg7f/ss_single_salma/"
    },
    {
        "id": "1qlkrad",
        "author": "travellernoob",
        "title": "What to watch",
        "content": "Hello, needing series you can recommend that are worth binging. I was really hooked on Younger. I also like shows with plot twist or ones that made you think. But also wanting those that are chick flick, romcom easy to watch.\n\n😊 thanks",
        "upvotes": 3,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1qlkrad/what_to_watch/"
    },
    {
        "id": "1qlvfdd",
        "author": "rjmclkne",
        "title": "\"The Society\" my opinion",
        "content": "Just watched this show, because people said it's insanely good.\n\nHonestly? It's not all that\n\nThe idea of teens being stuck in a parallel universe with no one else is cool and I love how the show demonstrates political conflicts between characters.\n\nIt's just that it's insanely boring to watch. The poster for the show with the flames in the back and the red coloring looks epic, but none of the scenes in the show actually look like that. It's just realistic scenery and outfits/hairstyles don't represent anything about the characters.\n\nThe show obviously is about the character and their relationships with each other and not about what is the parallel universe and it's mythology, but it's too much to the point where after months of being in New Ham, Kelly mentions the bus driver in the final episode and doesn't even address the fact that there are more of them and they're the ones who dropped them off in New Ham.\n\nIt just makes the characters really stupid. Also I hated all of the sex scenes, none of the ships/couples actually mattered to me.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qlvfdd/the_society_my_opinion/"
    },
    {
        "id": "1qlv6o7",
        "author": "kita_bug",
        "title": "Members Only: Palm Beach - Rosalyn",
        "content": "Rosalyn's hair - is that a wig? It always seems kinda glued to the sides of her face. She never pulls it back or styles it differently. I wish the wind would blow on one of these episodes. But seriously, I was so sad to see Gale make all those comments during the \"etiquette\" lesson with Ro-mina (Pakistan, go back to your country, etc) and Rosalyn just sitting there with that super fake perma-grin she always has plastered on her face.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qlv6o7/members_only_palm_beach_rosalyn/"
    },
    {
        "id": "1qkut4t",
        "author": "Fun_Molasses5215",
        "title": "Karamo Brown previously admitted he and Antoni had ‘extreme conflict’ during season one of Queer Eye and refused to talk to each other",
        "content": "",
        "upvotes": 129,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1qkut4t/karamo_brown_previously_admitted_he_and_antoni/"
    },
    {
        "id": "1qm3w9q",
        "author": "lolthatsembarrassing",
        "title": "his &amp;hers deflection?",
        "content": "why was jack deflecting so much. even with everything we come to know at the end, if you rewatch it, it makes less sense as to why he deflected SOOO much. yeah ok if he becomes a suspect it's going to look bad and Anna would find out he's cheating but is that it? you throw a whole investigation so that your Wife - who hasn't spoken to you in a year so you assumed doesn't care about you - MIGHT find out you've cheated on her? even at the end Priya says you jumped in front of Anna and you didn't know if the gun was loaded. he says don't worry about it. is that because he doesn't want to admit he did it to protect Anna? the same Anna he ends up impregnating a year later? come on. ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1qm3w9q/his_hers_deflection/"
    },
    {
        "id": "1qlg4u5",
        "author": "mm2444",
        "title": "Four seasons axe to grind",
        "content": "I know I’m late to the party watching this one, but did it bother anyone else that Nick basically “wins” by cheating, leaving his wife because she’s boring, and being a selfish narcissist ahole? Then he gets a happy life with a young hottie, and no consequences? Are we just ok with this? Not to mention, the ex wife doesn’t get invited on any of the friend trips and really gets the short end of the stick. I know the ending isn’t as great for him but there still aren’t any real consequences for his choices. It’s like moral of the story is just leave your boring old wife for something younger and you’ll finally get everything you want? ",
        "upvotes": 9,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1qlg4u5/four_seasons_axe_to_grind/"
    },
    {
        "id": "1qljzwv",
        "author": "noNudesPrettyPlease",
        "title": "Social Netflix feature idea",
        "content": "So my friends talk about content we've watched on Netflix. A lot of which we didn't know existed. \n\nI was wondering if there would be support for a feature to add something we really liked to a social favorites list. Then when we add one of our friends to our Netflix friends list, we would get to see each others favorite content.  \n\nOf course, this feature would only appear once you activate \"Netflix friends\" or whatever you want to call it. \n\nWhat do you think?",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1qljzwv/social_netflix_feature_idea/"
    },
    {
        "id": "1ql4f9l",
        "author": "AggressiveChange420",
        "title": "Live Event.Skyscraper Live tonight...Is it really live?",
        "content": "Been following Alex Honnold since he free soloed ElCapitan. The guy is what a normal person considers crazy. He has no fear, literally none.\n\nIs the tonight show Live or has a delay ? Reason I'm asking climbing Taipai 101 without rope or safety is a new level of insanity. As someone that actually went to the top on the structure (took the elevator) , I can tell you the building has a a very distinctive sway because of the strong winds.\n\nIf it's live I'll cancel plans for tonight to watch him..if delay or recorded i'll go about my routine and watch it at a later date",
        "upvotes": 25,
        "comments": 100,
        "media": null,
        "permalink": "/r/netflix/comments/1ql4f9l/live_eventskyscraper_live_tonightis_it_really_live/"
    },
    {
        "id": "1qlvco2",
        "author": "MasterChance8948",
        "title": "My Ideal Scenario if Japan's Biggest Netflix Series \"Alice in Borderland\" Was Not Cancelled (Not a Great Place to End the Show on By the Way)",
        "content": "I don't like a show that ends on a cliffhanger like season 3 did. I don't like shows that leave ends left undone as if on purpose (Ann in the mental institution and Yaba).\n\nI don't like a show ending where the main character is left on the lowest note of their entire narrative (Usagi).\n\nNor do I like the idea that the violent rapist character (Niragi) got better treatment in the end by the show than both Ann and Usagi.\n\nDespite justified criticisms of Season 3's direction (and I agree), a lot of people hoped that it was leading us to a final season and final redemption for these characters. Viewing figures were also still good despite the criticism.\n\nShinsuke Sato the Director was vocal in saying he would love to adapt the final manga connected to the series, \"Alice on Border Road\". This is not Arisu and Usagi's story but that of another character, a schoolgirl that we never met.\n\nHowever, Kento Yamazaki and Tao Tsuchiya both expressed interest in returning. Tao specificially put forward an idea that the focus of any continuation switches to their daughter who is a bit older. Some kind of protective arc might help to give Usagi the strong character back that we missed from Season 1 and 2.\n\nI mean...they made that baby a player for a reason right? Seemed like it's her destiny to finish the game. Just as Arisu said, he was afraid of naming her because a name dictates your destiny - her name is going to be \"Arisu\" no matter what.\n\nMaybe they could tie Border Road into their story either by meeting this new character or perhaps their daughter could be written as said schoolgirl from Border Road.\n\nAnd with Arisu and Usagi back, it would open the doors to see Ann back (and get her out of that mental institution), and Kuina and Chishiya too (I think those are the key people we need.)\n\nHave Netflix communicate clearly that this would be the final season as ALL the manga material is done after Border Road. Have the cast celebrated and go out on a high.\n\nThen after Alice in Borderland is completely done, have Shinuke Sato adapt Attack on Titan for live action and cast Tao and Kento as the main characters. For years people were saying that project would be perfect for them and it would be a great pivot after AIB.\n\nThey always worked so well together and had great chemistry, plus more action roles for them would satisfy a lot of fans.\n\nI have no idea why Netflix aren't rushing to make an Attack on Titan live action to be honest. Shinsuke Sato was given My Hero Academia to do instead.\n\nSo yeah...I'm very disappointed with the news and how everything is fading into oblivion when there was so much potential all round and with the ending we were left with, taking the plunge and risking one more season is worth it in my book.\n\nConsidering that this is probably Japan's biggest show on the platform, the dismissiveness that Netflix has handled this with is very problematic to me as is the fact they never made much effort to promote it since day 1 (with merch etc. included).\n\nIt just breaks my trust for investing in future shows like My Hero Academia etc.",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1qlvco2/my_ideal_scenario_if_japans_biggest_netflix/"
    }
]