[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 472,
        "comments": 250,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1gruz9u",
        "author": "2ForEachofYou",
        "title": "How come my Chromebook allowed me to use Netlflix while traveling but my wife's Chromebook did not work?",
        "content": "Wife and I are out of town.  I've never used my Chromebook before to watch Netflix.  Today I went to [netflix.com](http://netflix.com) on my browser, entered my username &amp; password and was able to stream shows right away, no strings attached and no hoops whatsoever. When my wife tried the same it did not work because when she went to [netflix.com](http://netflix.com) it informed here that her Chromebook is outdated.  So we downloaded the Netflix app on her Chromebook.  We were able to sign in. but after signing in it said \"your device isn't part of the netflix household for this account.\"  My question is why did she get that message but I didn't?  Is this a browser vs app thing, and if so, what's the reasoning behind it?  ",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gruz9u/how_come_my_chromebook_allowed_me_to_use_netlflix/"
    },
    {
        "id": "1grw3mv",
        "author": "celestialsexgoddess",
        "title": "My Netflix sub-account is on my ex-husband's family plan. How do I renew the Netflix subscription, keep my sub-account but not pay for everyone else on the plan?",
        "content": "What the title says. I have a sub-account on my ex's family plan where I've saved all my watch list and watch history. I want to keep my sub-account. But I also want to \"divorce\" my sub-account from my ex's family plan, which he may or may not want to continue. How do I do this?",
        "upvotes": 9,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1grw3mv/my_netflix_subaccount_is_on_my_exhusbands_family/"
    },
    {
        "id": "1gryvup",
        "author": "keiraols",
        "title": "christmas romcoms",
        "content": "hi! so i am trying to find some new christmas rom coms to watch. \n\ni know there is like 6826259 christmas movies on netflix but scrolling through, none of them are jumping out to me so i need some real people to tell me what’s good lol. \n\nmy absolute fav is “love hard”, so preferably something similar to that. i also just watched the lindsay lohan one where she gets amnesia (lol ik) and that was pretty good too. \n\nanyway, idk if this is a stupid question but i just really need some recommendations…\n\nthanks!! :)",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gryvup/christmas_romcoms/"
    },
    {
        "id": "1gry94w",
        "author": "PuzzleheadedAd4153",
        "title": "Best true crime shows? ",
        "content": "I came up with a list of the best true crime shows of all time and would like other suggestions in addition to these: [https://gamerant.com/best-true-crime-shows-series/](https://gamerant.com/best-true-crime-shows-series/) :) ",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1gry94w/best_true_crime_shows/"
    },
    {
        "id": "1gr6sha",
        "author": "peoplemagazine",
        "title": "Squid Game Creator Says He Lost '8 or 9' Teeth from 'Stress' of First Season but Season 2 Is Even More Taxing",
        "content": "",
        "upvotes": 125,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1gr6sha/squid_game_creator_says_he_lost_8_or_9_teeth_from/"
    },
    {
        "id": "1gs0nf6",
        "author": "Bananalando",
        "title": "Preview for multiple anime titles are in English, but when I try to watch, only Japanese audio is available - Canada",
        "content": "This is happening on a variety of shows, but not all of them.\n\nJust now, I tried to watch One Punch Man and no English audio was available but the teaser was in English. Multiple devices are affected (I.e. my android phone and a Chromecast). \n\nI verified that English and English (UK) are the only languages selected in my profile.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gs0nf6/preview_for_multiple_anime_titles_are_in_english/"
    },
    {
        "id": "1grjdno",
        "author": "Comfortable-Pace3132",
        "title": "Tell me I should carry on with The Diplomat ",
        "content": "I'm a few episodes into series 1 and think it's ok but it feels quite procedural. I get that there is more going on under the waterline that isn't showing itself yet but I just need to know if it 'gets going' so to speak  ",
        "upvotes": 23,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1grjdno/tell_me_i_should_carry_on_with_the_diplomat/"
    },
    {
        "id": "1grxvtt",
        "author": "TenaciousBloodlust",
        "title": "Same WiFi but not in household",
        "content": "What’s the fix here? We bought a new TV sometime last month and now it’s “not apart of the household”. Customer support says we need to go into the “main tv” and update it but we don’t have that tv anymore.\n\nNo I don’t have access to the email anymore.\nYes I’m on the same WiFi. \n\nThis is the most obnoxious thing Netflix has ever done. $22.99 for this garbage. \n\nThe only device I can get into Netflix from is my phone. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1grxvtt/same_wifi_but_not_in_household/"
    },
    {
        "id": "1grxdgm",
        "author": "KakoiKagakusha",
        "title": "\"Hot Frosty\" (2024) | Movie Discussion",
        "content": "It feels like **\"Hot Frosty\"** officially kicked off Netflix's *pseudo-Hallmark Christmas Movies* onslaught this year.  It's kind of a high-concept rom-com Christmas movie, basically \"what if *Frosty the Snowman* happened for a widower + Frosty is mad chiseled?\".\n\nOverall, I can't say I enjoyed it as much as I thought I would, so if you haven't seen it yet, temper your expectations.  Easily, Dustin Milligan is the standout.  I always liked him from Schitt's Creek, but he was just great in this role, balancing sweet/fish-out-of-water with sincere while pulling off the comedy aspects.  His interaction with Joe Lo Truglio was maybe my favorite part of the movie (probably tied with the 'pushing the woman's car' bit while shirtless + following scenes with the ladies friends were up there).\n\nMy biggest issue with the movie is unfortunately Lacey Chabert (as \"Kathy\").  I'll be honest, I haven't watched most of her Hallmark releases, but here, I just found her to be a surprisingly weak lead for what was a decently stacked cast.  The major problem is that for a movie called \"Hot Frosty\", I didn't feel any *heat* between Kathy and \"Jack\" (the snowman come to life).  Their lack of chemistry really sunk what could have been a much stronger rom-com (*see* **Nobody Wants This** for an example of rom-com leads with both romantic and comedic chemistry).  As a result, I found that my favorite parts of the movie were all scenes *without* her and I was never rooting for them to get together.\n\nNot as big a problem, but I really didn't like what they did for Craig Robinson as the antagonist sheriff.  He just came off as way too unlikable and not all that funny.  I think the character could have been written in a different way to still fulfill that role, but in a funnier/more enjoyable way.\n\nOn the other end of things, it took me a second to recognize Lauren Holly (I don't think I've seen her in much since the *Dumb and Dumber* days).  I was hoping for a reveal that &gt;!her husband also started out as a snowman!&lt;, but that never happened.  It's still my head-canon though.\n\nWhat we got was still enjoyable to a degree, but can't help feeling like this was a missed opportunity.  That said, I'm a 40+ dude, so not sure I'm the target audience haha.  Next on the list, hoping Lindsay Lohan's upcoming **\"Our Little Secret\"** ends up being a lot more fun!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1grxdgm/hot_frosty_2024_movie_discussion/"
    },
    {
        "id": "1gruurb",
        "author": "Thefearlessabsolayy",
        "title": "GTA Vice City download keeps repeating the last percentage of it ",
        "content": "I keep on trying to download GTA Vice City on my iPhone but once it gets to 100% in the app it goes back down to like 80-90% and keeps repeating that over and over",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gruurb/gta_vice_city_download_keeps_repeating_the_last/"
    },
    {
        "id": "1grnh2o",
        "author": "HeliumRhenium",
        "title": "netflix's new christmas movie: meet me next christmas",
        "content": "[spoiler maybe ???]\n\n\n\n\nis this just one big pentatonix commercial ?? lmfao I'm dying that they didn't recognize each other when it was revealed that he was her concierge\n\nwould you all go through all of this trouble for pentatonic tickets?? \n\nwhat do you all think of the movie??",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1grnh2o/netflixs_new_christmas_movie_meet_me_next/"
    },
    {
        "id": "1grqfgh",
        "author": "kadird",
        "title": "DRM, video quality and resolution issues on Netflix.",
        "content": "The situation that I first noticed with DRM on my mobile phone has now also occurred on my PC. My phone is Huawei P30 Lite and the DRM control application that I downloaded from the Appstore shows Widevine L1, but Netflix shows L3 and does not play Netflix content in HD. Now I have observed that the same thing is happening on my PC, the image quality is very low in both the Chrome browser and Netflix app under Windows, movies play in a garbage resolution like 576p. PC was not like this before. Why do we need to try to find a solution even though we are legal members of a paid platform? Where did this nonsense come from? While there are no restrictions if we watch from torrent or any other pirated platform, Netflix that we pay and subscribe to only works in full HD on my Xbox One and Xiaomi Mi Box, it is not certain that they will not close them soon, fuck drm and this illogical situation\n\nhttps://preview.redd.it/jtr0kvpti01e1.png?width=998&amp;format=png&amp;auto=webp&amp;s=02fcca63de599813a003073e5e88e9ad1742a955\n\n  \n",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1grqfgh/drm_video_quality_and_resolution_issues_on_netflix/"
    },
    {
        "id": "1grq04f",
        "author": "ProductNo0001",
        "title": "[Mobile, iOS) Every time there’s a sudden brightness/a flash the screen goes dark before going to normal. What’s causing this and how do I fix it?",
        "content": "It’s been happening with every show that has a flash effect, it’s not auto brightness nor Netflix’s in app user controlled brightness. It happens specifically when a flash or sudden brightness effect (lightsaber, gun shot, etc) occurs.\n\nAdditionally I only have HD video option in app, I’ve heard HDR being a possible cause but I don’t think I have access to it.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1grq04f/mobile_ios_every_time_theres_a_sudden_brightnessa/"
    },
    {
        "id": "1growym",
        "author": "Mak1612",
        "title": "Woman of the hour- no release in India? ",
        "content": "Same as title. Wanted to watch the movie for so long but can’t find it anywhere! Everywhere it keeps saying it released on 18.10.2024. I guess that was just for the US. :( ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1growym/woman_of_the_hour_no_release_in_india/"
    },
    {
        "id": "1grxx5r",
        "author": "VQQN",
        "title": "Will Netflix have buffering/overload issues during tonight’s livestream boxing match?",
        "content": "My Dad and brother are coming over to watch the fight…I’ve never watched a livestream on Netflix. But I anticipate millions of people watching the event. What are the chances Netflix will encounter issues trying to livestream to millions of people?\n\nDo you guys think they will have everything under control?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1grxx5r/will_netflix_have_bufferingoverload_issues_during/"
    },
    {
        "id": "1grxdxy",
        "author": "JamesCurtis24",
        "title": "With the 5.99 ads tier (Canada) would ads show up randomly? I.e  middle of a live fight?",
        "content": "I'm considering joining the $5.99 ads tier just for the fights tonight.\n\nI don't care if there are appropriately placed ads, as it's going to be an ad fest to begin with.\n\nMy main concern is the ads appearing randomly during a live fight, causing you to miss part of a live event. \n\nAre they smart enough to only run ads on live event in between the action? That's my only concern. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1grxdxy/with_the_599_ads_tier_canada_would_ads_show_up/"
    },
    {
        "id": "1grr28g",
        "author": "ninescomplement",
        "title": "Why does Netflix’s household policy not apply to the PC browser version?",
        "content": "I share an account with family and the primary household is set to their location. I can’t watch Netflix on any of my devices except PC (browser), no VPN. Why does the browser somehow avoid the same household rules?",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1grr28g/why_does_netflixs_household_policy_not_apply_to/"
    },
    {
        "id": "1grzjwn",
        "author": "OnAnIsland789",
        "title": "Tyson Paul - Main Event time tonight",
        "content": "Coverage begins at 8ET tonight, it looks like there are fights before hand? I've read that the Main Event is at 11ET, can anyone help to confirm this? TIA!!",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1grzjwn/tyson_paul_main_event_time_tonight/"
    },
    {
        "id": "1grmtmp",
        "author": "Stainlessgamer",
        "title": "How to transfer extra member profile back to original account?",
        "content": "For as long as I've had a netflix account, I shared it with my parents since I lived in their household.   Even when I moved out 12 years ago, I moved into a condo that they owned, and paid them rent.   They used to come out and stay with me for 3-4 months out of the year, until my father passed in 2020.   \n\nUntil recently I was traveling back and staying with my mother for 5-6 months each year, to help her out.   Last time I went back to my place, Netflix forced me to either have her locked out of her profile until I visited again, or I could pay for an extra member.   I did the latter.  \n\nAnd now I've moved back in with my mother, to help take care of things, and want to have her profile transfered back.   I've been told this is impossible, and the only options I have result in her profile getting deleted.   \n\nThat can't be right is it?   If an account can be transfered from one email to another, why can't it be transfered back?   Especially when, the uts the main account thats paying for everything and according to Netflix own rules, we're in the same household now!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1grmtmp/how_to_transfer_extra_member_profile_back_to/"
    },
    {
        "id": "1grp5m1",
        "author": "InevitableVoice5877",
        "title": "Black and white silly space drama",
        "content": "Hello! There was a movie that used to be on Netflix a few years back, like when Llamapocalypse was still on. I cannot die the life of me remember what it was called, but it was a silly space drama that looked like parts of it were filmed in maybe a hotel. And the female lead fainted a lot, which became one of the films jokes. Would anyone happen to know what I’m talking about?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1grp5m1/black_and_white_silly_space_drama/"
    },
    {
        "id": "1grxe7c",
        "author": "GeordieLord",
        "title": "Jake Paul Vs Mike Tyson was the slap staged ? ",
        "content": "Not sure if this was staged or made up? Your thoughts .. ",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/hhu9wmnxq21e1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1grxe7c/jake_paul_vs_mike_tyson_was_the_slap_staged/"
    },
    {
        "id": "1gqzgsf",
        "author": "Still_Boat_233",
        "title": "Lady Gaga Joins Wednesday Season 2 With Jenna Ortega in Undisclosed Role",
        "content": "",
        "upvotes": 46,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1gqzgsf/lady_gaga_joins_wednesday_season_2_with_jenna/"
    },
    {
        "id": "1grac7d",
        "author": "Pogrebnik",
        "title": "Netflix Plots Sequel to French Hit 'Under Paris' with Bérénice Bejo",
        "content": "",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1grac7d/netflix_plots_sequel_to_french_hit_under_paris/"
    },
    {
        "id": "1gr5inl",
        "author": "Kindly_Boysenberry47",
        "title": "Help me find a show! Pls",
        "content": "I cannot remember this show. It was just in the last few years I saw it on Netflix. It was a sci-fi series. There were representatives from a bunch of different countries that are on a space ship when a bunch of weird things start happening. If I remember correctly it starts happening after they collect some dirt samples.  I think they they're in an alternative universe? I remember a specific scene where someone's limb gets cut off but they're not in pain and there's no bleeding?? \n\nAlso at the same time one on Earth these spaceship/monoliths appear but they don't open until later on in the series. \n\nDoes anyone remember this show?",
        "upvotes": 8,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1gr5inl/help_me_find_a_show_pls/"
    },
    {
        "id": "1gr79zu",
        "author": "koalamomma85",
        "title": "What can I watch with my daughter ",
        "content": "Looking for shows to watch with my  daughters \nWe watched Wednesday, babysitters club, bean and ivy, don't remember what it was called but some gymnastics show, dance mom's, thr healing power of Duke,  So daughter are 8 and 15. My 8 yr old is into a little order stuff not 100% sure if she  understands half of what we watch or not but she pays attention. \nIt doesn't have to be on Netflix.  We have just about everything lol\n",
        "upvotes": 7,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1gr79zu/what_can_i_watch_with_my_daughter/"
    },
    {
        "id": "1gr6x1s",
        "author": "iPhone13pm",
        "title": "Back In Action | Official Teaser | Netflix",
        "content": "",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1gr6x1s/back_in_action_official_teaser_netflix/"
    },
    {
        "id": "1grswr2",
        "author": "TimesandSundayTimes",
        "title": "Mike Tyson’s comeback and the surreal build-up to Netflix fight",
        "content": "# Netflix could make 58-year-old Tyson's bout with Jake Paul one of the most watched of all time, yet bizarre build-up is failing to shift tickets in Texas.\n\nFull piece [here](https://www.thetimes.com/sport/boxing/article/why-mike-tyson-must-join-brain-study-that-can-save-boxing-from-itself-6fjrk2j9j)",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1grswr2/mike_tysons_comeback_and_the_surreal_buildup_to/"
    },
    {
        "id": "1gr6pan",
        "author": "fate763",
        "title": "Tv series ",
        "content": "With how well the reacher books have done being turned into a series on Prime I am amazed netflix hulu peacock or some other streaming service has not jumped on it. What book series would you like to see made into a TV show?\nIf they stuck to the source material I would love to see a Dresden files series. I know that a network made a season one of it some years ago, and while it wasn't terrible, it wasn't harry dresden.\nAnother would be The Deed Of Paksenarrion trilogy and books that followed. ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gr6pan/tv_series/"
    },
    {
        "id": "1gro8u0",
        "author": "Bomb_Dot_Com1",
        "title": "Please help ",
        "content": "Sorry if this is a duplicate post. But I think I just figured out how to include photos. Does anybody know how or why this pops up. It is the first time ever this has popped up. I've never created a pin and I tried all the pins I would have used if I made it in and it wasn't any of them. I don't know how to watch it.. \nAlso I asked my sister to try to watch the same movie and yes she lives in the same region. And it's not even on her netflix. There is no movie with that name on it.  Please any advice.   Thank you ",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1gro8u0/please_help/"
    },
    {
        "id": "1grpoyd",
        "author": "ChargeEnvironmental6",
        "title": "Is Jake vs Tyson 4k?",
        "content": "Is the fight with Jake paul and Mike tyson 4k or its fhd? Im wondering if to upgrade to the 4k plan to see the fight with better quality but im not sure if it would help at all cause it depends if they film the fight in 4k.",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1grpoyd/is_jake_vs_tyson_4k/"
    }
]