[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 5,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 52,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1l4tn78",
        "author": "Safe-Conversation770",
        "title": "Shows similar to Dept Q",
        "content": "As the title suggests, I am looking for recommendations for shows that have the same genre as Dept Q. I thoroughly enjoyed the series. Please help a girl out. ",
        "upvotes": 53,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1l4tn78/shows_similar_to_dept_q/"
    },
    {
        "id": "1l56wn6",
        "author": "Velron",
        "title": "It's literally easier to use your phone to stream to TV then using the new interface",
        "content": "Really; this so called \"new and innovative\" interface is so horrible that i rather use my phone or my tablet to stream to tv rather than using my tv-remote, because it's unusable there. It's clunky and showing more than 3-4 shows is now impossible. And it doesn't even have an new and upcoming section, instead a GAMING SECTOR THAT NO ONE WANTED AND WANTS. Please Netflix, stop trying to force worthless and funless smartphone-games into our face that no one wants. Or at least get some good games.  \n  \nBut hey, not everything is negative about it: now i know that the people who created the Windows 8 Start Menu finally found a new job!",
        "upvotes": 9,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1l56wn6/its_literally_easier_to_use_your_phone_to_stream/"
    },
    {
        "id": "1l4ya46",
        "author": "getthatbaguette",
        "title": "What does everyone think of the new UI?",
        "content": "I found the left-hand rail easier to access and navigate between screens/categories. Now I need to go all the way to the top just to navigate the categories. The new UI also takes was longer to scroll through titles given how big the titles are.\n\nI'll probably just get used to it, but curious how people feel about it. ",
        "upvotes": 20,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1l4ya46/what_does_everyone_think_of_the_new_ui/"
    },
    {
        "id": "1l55oki",
        "author": "AnagnorisisForMe",
        "title": "Are you enjoying Season 3 of Ginny and Georgia?",
        "content": "I really enjoyed the first two seasons of the Ginny and Georgia series. But Season 3 isn't doing it for me for some reason. What are your thoughts about S3?",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1l55oki/are_you_enjoying_season_3_of_ginny_and_georgia/"
    },
    {
        "id": "1l52pl5",
        "author": "JAXATOMIX",
        "title": "Why do people hate bet?",
        "content": "I just finished it and wow.. it was a ride.\n\nI honestly think that after watching the anime it was amazing.\n\nBut I honestly don’t get why people hate it. I get that it can be cringy and low quality at times but other than that it was amazing. \n\nLet me know why people hate it and tell me ur opinion.",
        "upvotes": 5,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1l52pl5/why_do_people_hate_bet/"
    },
    {
        "id": "1l4rh3h",
        "author": "Blessed3000",
        "title": "STRAW Last scene",
        "content": "Just watched this very moving and sad movie by Tyler Perry. The last scene shows Janiyah in the bank with the bank manager, and finally the FBI have turned her phone back on. She receives a call from her mother who is at home and the FBI are with her. She proceeds to tell Janiyah that her daughter has passed away. \n\nThis is followed by a series of what I assumed were flashbacks, but could have been hallucinations showing that she went to the school (because they asked her to come in) but the teacher tells her they didn’t call her. She then turns to look for her daughter and the hallway is empty with no sign of her daughter. (Was that real or hallucination?!) \n\nAlso she turns to the bank manager to tell her the news, and the bank manager says she already knew because she had been informed earlier. \n\nSo my questions are; did Janiyah’s daughter die a while back, hence causing her break down and the narrative about the school calling her in/ lunch money etc was a hallucination? Was the bank manager just playing along when she agreed to look after her daughter (in the event that Janiyah goes to jail)? \n\nOr did Janiyah’s daughter actually die the night before the hold up at the bank, and losing her job etc etc…  and she was not aware until that moment? \n\nJaniyah also hallucinates that the FBI throw a bomb into the bank and surround her and shoot her to death. But then back in reality she walks out with the bank manager in a state of trauma. \n\nThoughts? :-) any other views … ? ",
        "upvotes": 20,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1l4rh3h/straw_last_scene/"
    },
    {
        "id": "1l58guu",
        "author": "summerconcerts",
        "title": "Ginny&amp;Georgia season 3 who has watched?",
        "content": "I just finished the new season 3 on Netflix. Oh my goodness😳what now? What an ending Will there be another season in like 5 years? I knew they would end with a cliffhanger. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l58guu/ginnygeorgia_season_3_who_has_watched/"
    },
    {
        "id": "1l4ssm1",
        "author": "servalshark",
        "title": "Looking for a show for me and my mom!",
        "content": "Hi! Hopefully it’s cool that I post here. I very much would appreciate some show recommendations for me and my mom. She has mandatory down time for the foreseeable future and I need to keep her occupied. I’m going to try to get her into some puzzles or arts and crafts, but I’d also like a good show for us to watch together!\n\nFor her: she likes…cooking, the show Survivor, home renovation/HGTV, The Boys (weird outlier there but I thought I’d mention lol), some romance movies. \n\nI can do pretty much anything. I just want her to be happy and actually enjoy it. \n\nI was thinking of getting her to watch Nailed It! because it’s fun, but I think she’d find it too cheesy. I’ll look into anything you recommend though! Please refrain from including anything too dark or related to illness. Thanks! ",
        "upvotes": 12,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1l4ssm1/looking_for_a_show_for_me_and_my_mom/"
    },
    {
        "id": "1l56oq6",
        "author": "StringBBean",
        "title": "Straw (spoiler)",
        "content": "This post has spoilers. Keep scrolling if you don't want to know. You have been warned. I give the movie a 6.8. Best actor goes to Sherri Shepherd. \nDissociation premise. Audience is unaware until the last five minutes of the movie that main character was living in an alternate reality brought on by the death of her daughter the night before and at least 50% of the scenes never really happened. We have seen variations of this in movies before, only executed much , much, MUCH better.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l56oq6/straw_spoiler/"
    },
    {
        "id": "1l4i6xe",
        "author": "Merry_Little_Liberal",
        "title": "Tires Season 2 is FANTASTIC",
        "content": "I watched season 1, and enjoyed it, it was a 6/10 for me. \n\nI just binged the entire season 2, and I really enjoyed it. HUGE step up from season 1. \n\nThe character developments from Season 1 is fantasic. Kyla, Cal, Shane, Will, Dave,  new characters that will be main characters... really good development. \n\nBringing back side characters that were in Season 1 to reprise the role in season 2 was FANTASTIC. No Spoilers!!!  At least 3 primary side characters are back for season 2 with new side stories, like getting a \"Pontiac Bandit\" episode, I hope they continue it. \n\nReally good story development, already excited for Season 3. \n\n\nEpisodes had the same vibe as The Office jump from Season 1 to Season 2. \n\nIt is still very much \"guy humor\"... pussy jokes, and ragging on each other, sure.  But if you even remotely enjoyed Season 1, do not miss Season 2! \n\nI'm going 8.5/10! ",
        "upvotes": 69,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1l4i6xe/tires_season_2_is_fantastic/"
    },
    {
        "id": "1l57q1p",
        "author": "zalivom1s",
        "title": "Love Death + Robots Season 5 concept trailer",
        "content": "Created using Premiere Pro, Midjourney, Kling AI, Runway, and Elevenlabs.",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/rd9u3d3dee5f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1l57q1p/love_death_robots_season_5_concept_trailer/"
    },
    {
        "id": "1l4tgg9",
        "author": "theeleven1111",
        "title": "Finished Ginny and Georgia and so bored now. Any similar shows?",
        "content": "Whole package of teenage and adult drama, comedy, great music and colorful.\n\nPlease recommend some great shows and movies.  I loved the charector of Georgia ",
        "upvotes": 7,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1l4tgg9/finished_ginny_and_georgia_and_so_bored_now_any/"
    },
    {
        "id": "1l54ra1",
        "author": "FossilHunter99",
        "title": "I can't access Netflix on my laptop but I can on my Xbox One.",
        "content": "When I try to access Netflix on my personal computer (which I've had for six years now) it says that my device isn't part of the Netflix household for this account (which would be my mom). However, I can access the Netflix app on my Xbox One and watch shows without issue. What could be causing this?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l54ra1/i_cant_access_netflix_on_my_laptop_but_i_can_on/"
    },
    {
        "id": "1l47nn4",
        "author": "Sea-Guest-1299",
        "title": "Jibaro — The Most Perfect Episode in Love, Death &amp; Robots (IMO)",
        "content": "I haven’t gotten around to watching Season 4 yet, but having seen everything up to Season 3, I genuinely believe Jibaro is the most perfect episode in the entire Love, Death &amp; Robots anthology.\n\nYes, I know that’s a bold claim considering the heavy competition — Bad Travelling, Beyond the Aquila Rift, Zima Blue, and The Witness are all incredible in their own right. Everyone has their personal favorites depending on what they value most: hard sci-fi, suspense, animation style, or raw emotion.\n\nBut Jibaro hits different. For me, it’s one of the best modern folklore interpretations ever put on screen. It tells a deeply compelling, emotionally charged story — without a single word of dialogue — and still manages to feel more complete and immersive than most dialogue-heavy shorts. The animation is chaotic in the best way, the sound design is absolutely haunting, and the symbolism runs deep.\n\nIt’s beautiful, brutal, tragic, and strangely mesmerizing — a true S+ tier episode in my book. A masterclass in visual storytelling.\n\nCurious to know — where does Jibaro rank in your list?",
        "upvotes": 144,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1l47nn4/jibaro_the_most_perfect_episode_in_love_death/"
    },
    {
        "id": "1l58lsp",
        "author": "Interesting-Site-515",
        "title": "Bee movie top 10",
        "content": "Anyone else notice bee movie always seems to be in the top 10 watched movies list lol. I wonder if it’s mostly adults watching it for fun or kids actually watching. Either way it’s funny to think about.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1l58lsp/bee_movie_top_10/"
    },
    {
        "id": "1l4uulf",
        "author": "Cheap-Junket-5742",
        "title": "help",
        "content": "there was some deleted show on netflix about 2 kids where the parents were never shown, i think they were animals and there was a talking volcano and more stuff",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l4uulf/help/"
    },
    {
        "id": "1l4z35u",
        "author": "Calzonieman",
        "title": "Watching Dept Q and wondering whether Akram was one of the historic that you'd want covering you back, along with Quinn from Homeland, Oleg in The Americans, Ray Donovan and many others.",
        "content": "Thoughts?\n\nWho would you add to this list?\n\nSeriously, Akram is the unessential badass, but there are so many others in various series. I love how Akram's voice is so gentle, but it's a cover for a very difficult past, just like the other names I mentioned.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l4z35u/watching_dept_q_and_wondering_whether_akram_was/"
    },
    {
        "id": "1l538k1",
        "author": "indiewire",
        "title": "The 7 Best New Movies on Netflix in June 2025",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l538k1/the_7_best_new_movies_on_netflix_in_june_2025/"
    },
    {
        "id": "1l4x9rj",
        "author": "mariberries",
        "title": "Is Monsieur Spade worth watching?",
        "content": "After binging Dept Q, I went looking for a new detective show and saw Monsieur Spade is by the same writer, and stars Detective Sam Spade (classic detective from the Maltase Falcon). I only watched 1 ep, but this is really slow, much slower than Dept Q. So I am wondering for anyone that has watched it, is it worth it? Do you recommend?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l4x9rj/is_monsieur_spade_worth_watching/"
    },
    {
        "id": "1l55jdm",
        "author": "NothingIsACoolHand",
        "title": "Director Lesli Linka Glatter On Finding Truth In A Post Truth World In ‘Zero Day’",
        "content": "Interesting discussion about making this timely series...",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l55jdm/director_lesli_linka_glatter_on_finding_truth_in/"
    },
    {
        "id": "1l4hwe8",
        "author": "Ollies_Mama22",
        "title": "Ginny &amp; Georgia",
        "content": "Anyone else think Georgia is a fucking narcissist? Like I know she has good intentions. And I know her childhood trauma and all the terrible shit she went through throughout her life affects the way she goes about certain things. But omfg she is such a narcissist. She throws out such blatant narcissistic comments. It’s everyone’s fault but her own. If she’s confronted for her poor behavior, she starts crying “oh I’m a bad mom” blah blah blah. She does it to make her kids feel bad for her so they stop bringing shit up. It’s ridiculous.",
        "upvotes": 12,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1l4hwe8/ginny_georgia/"
    },
    {
        "id": "1l4w1yj",
        "author": "SkydiverDad",
        "title": "Netflix App Self Downloading?!",
        "content": "As of last week my phone started downloading what appear to be random shows and movies through the Netflix app under my profile. I immediately assumed someone had pirated my account, deleted the downloads, signed out all devices on my account and changed my password to a 15 digit secure password. I assumed this would solve the problem.  \nHowever, as of this morning my phone started randomly downloading Netflix shows again.\n\nWhat is causing this and how do I stop it? There is no way anyone has my new password as I havent used it on my PC or even my Roku since changing the password. Any help would be amazing.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l4w1yj/netflix_app_self_downloading/"
    },
    {
        "id": "1l4v7va",
        "author": "NextChard6264",
        "title": "BRIGHTNESS ISSUES I NEED HELP",
        "content": "OK so, i am having this issue in netflix where whenever I am watching a show, the brightness bar will be at full but the brightness will be very low. IF I manually drag the brightness bar down and back up, the brightness will be high for like a min before the brightness turns down again. Issue is that the brightness bar would still be at full and unless I am manually dragging the brightness bar down and back up again every min, the brightness remains low. \n\nThis issue is only happening on my phone, not on my laptop. The only thing I have really tried is seeing if I have my adaptive brightness off, which I do, and I can't figure out how to get rid of this CAUSE ITS ANNOYING AS SHIT. PLEASE HELP ME. \n\nP.S. my netflix used to work like normal until a few days ago and at this point I can't pin point what changed but please help.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l4v7va/brightness_issues_i_need_help/"
    },
    {
        "id": "1l551vv",
        "author": "Lifeloverme",
        "title": "stream video quality very bad in \"full HD 1080p\" resolution",
        "content": "i just wanted to watch a movie on netflix, and noticed it looked not like i remember  \ni checked my subscription and i should be able to stream in 1080p\n\n[here is a screenshot from the netflix stream](https://cdn.discordapp.com/attachments/1029158542277611603/1380667703882154175/image.png?ex=6844b680&amp;is=68436500&amp;hm=204c2b24403a1055bba27e22a3eeba6683a1e53595b1ab8ffa3bb07349b42506&amp;)\n\n  \n[and here a screenshot from a different 1080p stream](https://cdn.discordapp.com/attachments/1029158542277611603/1380667750304976916/image.png?ex=6844b68b&amp;is=6843650b&amp;hm=075240fc41c7297564e7f6a81af7b705344107810ad0589e07983917b59f447e&amp;)\n\nas you can maybe see, the second screenshot shows way more details, while the netflix one looks quite blurry, and this is the same for the whole movie\n\nhow can this be fixed?  \nthanks for any tips",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l551vv/stream_video_quality_very_bad_in_full_hd_1080p/"
    },
    {
        "id": "1l3ujxm",
        "author": "Curious_Natural_1111",
        "title": "Dept Q should be renewed for season 2",
        "content": "They need to wrap up who was the Leith park shooter!!!\nJust finished watching it I need to see Morck working on more cases \n\nStarted off slow but was engrossing in afterwards episodes with barely any fillers.\nThe chemistry between actors were great, loved Akram and Martin.\n",
        "upvotes": 218,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1l3ujxm/dept_q_should_be_renewed_for_season_2/"
    },
    {
        "id": "1l513sx",
        "author": "80410nf",
        "title": "I cannot find Ginny and Georgia",
        "content": "I blocked this from my account because people liked to get on my account and mess up my watch history so I blocked all the shows I wasn’t watching. I want to watch Ginny and Georgia so I looked it up and it won’t show up, I went to restrictions and the show wasn’t on there, and my account is set to all maturity levels. I went to another account where it isn’t blocked and looked it up and it shows up. Yes I could watch it on that account but it’s not my account so I’d be doing the same thing I got mad at someone else for.  MAIN POINTS, I can’t find a show in search, maturity levels are all allowed, the show is not showing up in restricted shows, and the show shows up on another account.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l513sx/i_cannot_find_ginny_and_georgia/"
    },
    {
        "id": "1l4qifb",
        "author": "cloudmountainio",
        "title": "Straw",
        "content": "Just finished watching…. \n\nI genuinely didn’t see that twist coming 😭 \n\nI don’t usually cry at films but this is one of those rare occasions. \n\nWhat did everyone else think of the film? ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1l4qifb/straw/"
    },
    {
        "id": "1l512f7",
        "author": "Excellent-Result-330",
        "title": "I wanted to see the first ever episode of regular show",
        "content": "So I was going to watch the first episode of regular show because is said season 1 but when I pressed on season 1 to see the first ever episode of regular show the episode was called the power but when I searched google it said the first ever episode of regular show was called first day why is Netflix showing me different things can someone tell me why",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/mcur0uqxxc5f1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1l512f7/i_wanted_to_see_the_first_ever_episode_of_regular/"
    },
    {
        "id": "1l4vi4d",
        "author": "asciikeyboard",
        "title": "Netflix App for MacBook",
        "content": "So am I the only one that would like to see Netflix on a MacBook? Pretty crazy to me that in 2025 weeks have AI, working robots yet no Netflix app for the MacBook. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l4vi4d/netflix_app_for_macbook/"
    },
    {
        "id": "1l4ox55",
        "author": "whenceareyou",
        "title": "Is Netflix content region standalone from platforms ?",
        "content": "I watch Netflix on my PS5. My PS account region is US, but I'm currently not in the US right now. Netflix shows content related to where I'm physically in although I downloaded the app from my PSN account (US). Maybe media apps content like YouTube, Netflix, Disney Plus has nothing to do with PSN region ?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l4ox55/is_netflix_content_region_standalone_from/"
    }
]