[
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 77,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 21,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1lqpcog",
        "author": "TudorNut",
        "title": "Netflix show you started with zero expectations but ended up loving?",
        "content": "When I clicked *The Queen’s Gambit*  out of curiosity&lt; didn't intent to watch to the end since I am not into chess. But I ended up completely hooked by the story, the acting, and how intense they made a quiet game feel. Totally surprised me!",
        "upvotes": 166,
        "comments": 158,
        "media": null,
        "permalink": "/r/netflix/comments/1lqpcog/netflix_show_you_started_with_zero_expectations/"
    },
    {
        "id": "1lqf06k",
        "author": "Spiritual_Kiwi_4521",
        "title": "I’m done starting new Netflix shows. They cancel everything good.",
        "content": "I just finished Insatiable and found out it was canceled after Season 2, with no proper ending. And for what? It was a hit show, it had a following, it wasn’t hidden in the depths of the platform. It could’ve grown even more if Netflix actually supported it.\n\nThis isn’t just about one show. This is about the pattern. They cancel everything good, especially original, weird, dark, or risky stuff, and replace it with endless reality shows or bland reboots.\n\nWhy do they think viewers will keep trusting them with our time and emotional investment if they pull this every time?\n\nIt’s like they only care about new signups, not long-term fans. They greenlight 100 shows and abandon 98 of them. How is that sustainable?\n\nI genuinely wish I could flood their inbox with 40,000 complaints, because clearly they’re not hearing how angry people are. There’s no point in starting new shows anymore if we know there’s no closure. Same with keeping a subscription. What a waste of a company they are. \n\nI hope I can get so many views on this post that Netflix sees this 😭  \n\nAnyone else feel like this?",
        "upvotes": 450,
        "comments": 155,
        "media": null,
        "permalink": "/r/netflix/comments/1lqf06k/im_done_starting_new_netflix_shows_they_cancel/"
    },
    {
        "id": "1lqtwej",
        "author": "murderedbyaname",
        "title": "The Residence cancelled after one season",
        "content": "",
        "upvotes": 11,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1lqtwej/the_residence_cancelled_after_one_season/"
    },
    {
        "id": "1lqqm2m",
        "author": "Dave_Boi_237",
        "title": "Anyone else disappointed by the Old Guard sequel?",
        "content": "Just finished The Old Guard 2, and while I didn’t quit halfway through (so it wasn’t completely unwatchable), I was definitely disappointed by how lazy and inconsistent the lore is. For a story about immortals from completely different parts of the world who are actively hiding from the rest of the world, it’s weirdly convenient that they all seem to find each other across centuries with no real explanation of how or why. Still with that alone I would have been ok after all they all have centuries to run into each other, right?\n\nWhat really broke it for me was the mentioned connection between the first and last immortal (further explained only by a birthmark they both have for some reason) as well as the whole “legend” about the last immortal which would be born with the power to remove or transfer immortality. A legend someone somehow formulated likely thousands of years before the last immortal was even close to existing. How can there be legends about someone completely unique among a group of already special people nobody should even know about in the first place? The writing just didn’t try at all to make the world feel coherent or believable, which is a shame because IMHO the premise definitely had some potential. If only they made the story based on a somewhat plausible lore (written first) rather than creating a garbage lore based on what they needed it to be to accomodate a raise of stakes for the sequel or whatever.\n\nAnyway what are your opinions random redditors?",
        "upvotes": 12,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1lqqm2m/anyone_else_disappointed_by_the_old_guard_sequel/"
    },
    {
        "id": "1lqo4h6",
        "author": "S4v1r1enCh0r4k",
        "title": "‘Squid Game’ Creator Says Shocking Finale Scene Wasn’t Written to Launch U.S. Spinoff",
        "content": "",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lqo4h6/squid_game_creator_says_shocking_finale_scene/"
    },
    {
        "id": "1lqfnyd",
        "author": "bongoverlander",
        "title": "Is it just me or did the last season of Squid Game completely lose the plot?",
        "content": "Okay, I just finished the latest season of Squid Game and… wow, what a letdown. I really wanted to like it, I tried to like it—but somewhere between the recycled plot points and painfully predictable twists, I felt like the magic of the first season just vanished.\n\nThe original had unpredictability, emotional stakes, and that gritty commentary on capitalism and human desperation. But this one? It felt like they were trying to shock us, but you could see it coming from a mile away. The tension just wasn’t there.\n\nAlso, character development took a nosedive. Instead of complex personalities making morally grey choices, we got caricatures running through a checklist of betrayals and “surprises” that weren’t surprising at all.\n\nEven the games lacked originality this time. One of them was so absurdly over-the-top that it felt more like a bad parody of Squid Game than the real thing.\n\nAnyone else feel this way? Was I expecting too much? Or has the show just become another victim of its own success?",
        "upvotes": 30,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1lqfnyd/is_it_just_me_or_did_the_last_season_of_squid/"
    },
    {
        "id": "1lqghyr",
        "author": "SFTHfan24",
        "title": "The Old Guard 2",
        "content": "I just finished watching the Old Guard 2 and to say I’m disappointed is a massive understatement. \n\nLike what was the point of this movie even? Barely anything happened. Little to no character development and a complete waste of my time and excitement for it. \nLiterally almost 2 hours of crap. \n\nI actually really loved the first movie and based on how it ended I was really excited to see what was going to happen next and the character development for Andy and Nile especially but we got nothing. ",
        "upvotes": 19,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1lqghyr/the_old_guard_2/"
    },
    {
        "id": "1lq7e24",
        "author": "ggroover97",
        "title": "Netflix Freshmen ‘Pulse’ &amp; ‘The Residence’ Canceled, ‘No Good Deed’ On Indefinite Pause",
        "content": "",
        "upvotes": 63,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1lq7e24/netflix_freshmen_pulse_the_residence_canceled_no/"
    },
    {
        "id": "1lqebzy",
        "author": "Sudden_Pop_2279",
        "title": "‘Squid Game’ Season 3 Becomes First Show To Debut No. 1 On Netflix Across 93 Countries With 60.1M Views",
        "content": "",
        "upvotes": 22,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lqebzy/squid_game_season_3_becomes_first_show_to_debut/"
    },
    {
        "id": "1lqr48b",
        "author": "Extension_Bit4323",
        "title": "Has anyone watched squid game conversation?",
        "content": " Where the director and the guys who play gi hun and the front man talk about season 2 and 3 and there's another one about series 1 where the director and the cast talk about it.\n\nIt's gives insight to the decisions the director made and how the cast thought about it. \n\nAlso I feel like I'm the only one that liked series 3. 😅",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lqr48b/has_anyone_watched_squid_game_conversation/"
    },
    {
        "id": "1lqexqo",
        "author": "cuckoocraftbyjam",
        "title": "Rumi of kpop demon hunters",
        "content": "Just finished making her pattern as well!! Had so much fun making and hoping to finish zoey and miras next!! Maybe I should do Jinu next or the derpy cat? What do you guys think?",
        "upvotes": 15,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lqexqo/rumi_of_kpop_demon_hunters/"
    },
    {
        "id": "1lqukf4",
        "author": "dumbiryaniiii",
        "title": "Did anyone else absolutely despise Sophia by Season 6 of The Royals?",
        "content": "Okay, so I’m on Season 6 and genuinely need to ask, **does Sophia seriously not end up with either of them?!** Because I hope to God she doesn’t. 💀\n\nShe’s been swinging back and forth between Ishaan and her co-founder Rohan, like she’s testing which startup pitch got more VC funding. 🙄And every time either of them tries to move on or do something ambitious, here she comes, emotionally confused, conveniently invested, and somehow still the centre of the plot.\n\nIshaan deserved way better than someone who couldn’t respect what he stood for, and Rohan deserved clarity, not a boardroom breakup every 10 episodes.\n\nHonestly, I just want to see both these men win in life, love, business, whatever, without her hanging around the background with that smug “I built this empire” face.\n\nCan anyone confirm if the series wraps that up the right way? No huge spoilers pls. Did Karma have a budget in the final season?\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lqukf4/did_anyone_else_absolutely_despise_sophia_by/"
    },
    {
        "id": "1lqthmc",
        "author": "MysteriousDelay6266",
        "title": "Catalog | Official Trailer | Netflix | July 17",
        "content": "**JULY 17 on Netflix.**\n\nIn this heartwarming and uplifting take on grief, a widowed father uses his late wife's online parenting tips to guide his many — many — parenting hiccups.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lqthmc/catalog_official_trailer_netflix_july_17/"
    },
    {
        "id": "1lqsxv6",
        "author": "reina_cutie",
        "title": "black screen on dolby vision shows on ipad",
        "content": "hi! do anyone experiences having black screens with audio and subs on shows with dolby vision? \n\ni have tried deleting and restarting my ipad however black screens only appears on shows with dolby vision, every other shows plays as usual. i've tried finding a way to \"turn off the dolby vision\" thing but i havent find a way till now. \n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lqsxv6/black_screen_on_dolby_vision_shows_on_ipad/"
    },
    {
        "id": "1lprd43",
        "author": "butterchickened",
        "title": "The Old Guard 2",
        "content": "Well, that sucked!\nIs it just me or did the sequel not live up to expectations? \nI was so hyped up but now I'm lying here in bed in utter disappointment. \nIs it just the sequel effect? Or was the movie genuinely bleh? \n\nBarely any Joe and Nicky screen time, no actual communication happening between people, Andy just looking away deeply at every moment, underwhelming fight scenes, a stupid ending. \nTo be fair, there were some good parts. I did like seeing Andy a little happier. I loved Quyns angst. Booker made me cry. But overall it was a disappointing sequel.\nI mean if you're going to take 467866 years to make it, at least get it right??\n",
        "upvotes": 182,
        "comments": 328,
        "media": null,
        "permalink": "/r/netflix/comments/1lprd43/the_old_guard_2/"
    },
    {
        "id": "1lqppc2",
        "author": "pokekenn",
        "title": "Can't watch credits on PS5",
        "content": "I think Netflix updated their app recently, and it completely stripped me of the option to watch end credits of TV Shows. As soon as the song starts, the episode minimises to the top left, pausing all music, and tells me to watch next. I try to click on the minimised thumbnail on top but it doesn't let me.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lqppc2/cant_watch_credits_on_ps5/"
    },
    {
        "id": "1lqdkho",
        "author": "kk_in_a_good_way",
        "title": "The Old Guard 2 makes no sense",
        "content": "The whole logic around Nile hurting Andy in the first movie and causing her to become mortal is false. Andy heals from the stab wood that Nile did in the desert. Meanwhile in 2, Booker doesn't heal from the very first cut cause my Nile.\n\nJust don't make sense",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lqdkho/the_old_guard_2_makes_no_sense/"
    },
    {
        "id": "1lqnpub",
        "author": "henswoe",
        "title": "Netflix romance about an American student falling in love with her Oxford professor 'obviously written by a visiting US-American and I mean that in a very derogatory way' - ouch! - is My Oxford Year really that bad?",
        "content": "",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lqnpub/netflix_romance_about_an_american_student_falling/"
    },
    {
        "id": "1lqniss",
        "author": "Wonderful_South_5249",
        "title": "Turning point: The bomb and the cold war",
        "content": "This is an eye opening documentary about the whole time from the end of ww2 to today brilliant watch, it was so in depth 👌 I loved it, it.shows every aspect of the cold war which to be honest has never ended",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lqniss/turning_point_the_bomb_and_the_cold_war/"
    },
    {
        "id": "1lqmobu",
        "author": "Humble_Dog_1644",
        "title": "Recommendations for a mini series preferably British, but I'm open to all recommendations.",
        "content": "Hey! I usually don't have a lot of time, but my girlfriend is currently pregnant and we're trying to slow down a bit and would like to start on a short series, but we have nooo idea where to begin? We watched the new *Department Q* on Netflix and enjoyed that a lot, so something similar to that if anyone can recommend something? \n\n\n\nthanks in advance!! :) ",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1lqmobu/recommendations_for_a_mini_series_preferably/"
    },
    {
        "id": "1lqkfrz",
        "author": "Artistic_Spinach_589",
        "title": "What are your favorite Netflix show characters?",
        "content": "BTW it's okay if you include characters from kids cartoons (like Gabby's Dollhouse and Word City)",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lqkfrz/what_are_your_favorite_netflix_show_characters/"
    },
    {
        "id": "1lqiu1k",
        "author": "hot_maria_clara",
        "title": "The Society Season 2 WHEN??",
        "content": "I hope they consider to continue and release even just another season. It's been years and I'm still waiting for it. They made this good cliffhanger and ends with. ++ why do Netflix keeps discontinuing good series like wtf?? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lqiu1k/the_society_season_2_when/"
    },
    {
        "id": "1lqexgg",
        "author": "Straight-Amphibian34",
        "title": "Old Guard 2 Loophole",
        "content": "Was eagerly looking forward to the sequel. 50 minutes in, severely underwhelmed.\n\nBut the part which infuriates me the most is the stupid story about immortality transfer, which is ridiculous in itself. How did the immortal die in the first movie, when Nile wasn't around then?\n\nI DNFd after this, because I have been burned by this before, and it can only get worse from here.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lqexgg/old_guard_2_loophole/"
    },
    {
        "id": "1lq398c",
        "author": "Familiar-Mammoth-753",
        "title": "Medical series recommendations?",
        "content": "I’ve noticed that house MD is more focused on actual medicine while on the other hand greys anatomy and Chicago med and more focused on drama rather than actual medicine,any good medical series?\nThanks!",
        "upvotes": 5,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1lq398c/medical_series_recommendations/"
    },
    {
        "id": "1lqetw4",
        "author": "slumper",
        "title": "Streaming quality",
        "content": "On the highest plan available but ever since Squid Games season came out my streams have been terrible in quality. They even start out perfect but then degrade. Nothing is wrong with my internet speed and other streaming services are fine. My theory is it’s related to a large number of other people using the service. Anyone else run into the issue?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lqetw4/streaming_quality/"
    },
    {
        "id": "1lqe2wp",
        "author": "Gitzburgle",
        "title": "Old Guard 2 Filming locations. House at 31:44",
        "content": "I think filming locations are some of the best bits of Old Guard and they seem to keep an eye out for singular locations like Casa Sperimentale. \n\nThere is a house that pops up when the are supposedly in Rimini Italy.  It seems as singular as other locations, abstract design like something out of Dr. Seuss, no straight walls round hobbit doors, but I can't find a name for it.\n\nBe glad to hear if anyone knows anything about it. Ariel shot at 31:44.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lqe2wp/old_guard_2_filming_locations_house_at_3144/"
    },
    {
        "id": "1lqoopj",
        "author": "H3win",
        "title": "Do Netflix have like TikTok so that you can scroll through trailers fast?",
        "content": "A learning algorithm that know what you like ofc then feed you fast trailers like shorts.\n\nA learning algorithm that know what you like ofc then feed you fast trailers like shorts.\n\nA learning algorithm that know what you like ofc then feed you fast trailers like shorts.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lqoopj/do_netflix_have_like_tiktok_so_that_you_can/"
    },
    {
        "id": "1lqivlh",
        "author": "LeeCheeRodriguez",
        "title": "Why do some movies on Netflix have scenes cut?",
        "content": "US based watcher (LA) Just re-watched Horrible Bosses, the \"Handies for the Three Musketeers\" scene has a few good lines removed.. kind of weird. I assume its not a censorship thing since the rest of the movie doesn't have much more raunchy stuff removed...",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lqivlh/why_do_some_movies_on_netflix_have_scenes_cut/"
    },
    {
        "id": "1lqbv9r",
        "author": "Iconclast1",
        "title": "A show i watched on Netflix a couple of years ago:Horror/Strange European/English/Celtic. Pale woman inherits families house (?) Finds recording equipment in basement, strange song keeps playing",
        "content": "Finds recording equipment in basement, strange song keeps playing\n\nThe song was very important to the story, i believe. Recording of ghosts? Fairies? Believe had little childrens voices in the song\n\nVery good cinematography. Very low key and mysterious rather than straight horror, if it you can even describe it as horror. Mystery?\n\nIt was perhaps even closer to a castle that they inherited. Lots of greenery and sunlight. More in line with spirits and the faye rather than monsters, i think",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lqbv9r/a_show_i_watched_on_netflix_a_couple_of_years/"
    },
    {
        "id": "1lqaxt7",
        "author": "GoldDerby",
        "title": "How the new season ‘Squid Game’ will impact its Emmy hopes for previous seasons:",
        "content": "",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lqaxt7/how_the_new_season_squid_game_will_impact_its/"
    }
]