[
    {
        "id": "1jyv6sq",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 46,
        "comments": 3575,
        "media": null,
        "permalink": "/r/realmadrid/comments/1jyv6sq/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1k0vj3d",
        "author": "scoreboard-app",
        "title": "[Post Match Thread] Real Madrid vs Arsenal, UCL round of 8 leg 2",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1k0vj3d)",
        "upvotes": 123,
        "comments": 1374,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k0vj3d/post_match_thread_real_madrid_vs_arsenal_ucl/"
    },
    {
        "id": "1k1d2zt",
        "author": "brimwithno",
        "title": "You expect me to not be pissed when a 40 years old runs more than our entire team! Look at the time!!",
        "content": "",
        "upvotes": 791,
        "comments": 131,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2dmtjs4dfeve1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k1d2zt/you_expect_me_to_not_be_pissed_when_a_40_years/"
    },
    {
        "id": "1k17w56",
        "author": "KabiX2",
        "title": "\"I know I gave you only a few minutes this season, but...\"",
        "content": "",
        "upvotes": 1407,
        "comments": 75,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8dq2f9xjwcve1.jpeg?auto=webp&amp;s=dfa3ef75250fa33e9bff400cc0ebfe6a105159be"
        },
        "permalink": "/r/realmadrid/comments/1k17w56/i_know_i_gave_you_only_a_few_minutes_this_season/"
    },
    {
        "id": "1k1bgym",
        "author": "BdBoss_777",
        "title": "Jude Bellingham on Instagram.",
        "content": "",
        "upvotes": 622,
        "comments": 77,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k1bgym/jude_bellingham_on_instagram/"
    },
    {
        "id": "1k1auih",
        "author": "Longjumping-Elk-7840",
        "title": "Carlo Ancelotti to leave Real Madrid after Champions League defeat to Arsenal",
        "content": "",
        "upvotes": 369,
        "comments": 132,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GBzLdVvjAa-yE17_YGhb53hEa-aJzQ2uC4Gd0C__6Vw.jpg?auto=webp&amp;s=0531c295a3dabe6d4057eebac3141f84dcb7f2e2"
        },
        "permalink": "/r/realmadrid/comments/1k1auih/carlo_ancelotti_to_leave_real_madrid_after/"
    },
    {
        "id": "1k14qyc",
        "author": "Ready_Ad_1353",
        "title": "Courtois: \"We put in a lot of crosses but this year we don't have a Joselu, a born striker up there. Sometimes you have to be self-critical. I feel that we have to make more team plays and not all individual, if they double-mark Vini or Kylian, a 1 vs. 2 maybe succeds out once but, not five times\".",
        "content": "Courtois: In the end, when they give you a penalty, if you save it, you keep believing. At the beginning, we created some danger, the fans pushed us, but Arsenal is a team that defends well, they're organized, the wingers and the striker come back... At halftime, we felt that if we scored the first goal, the tie would be open. In the end, they found the first goal, we tied it quickly. You keep believing, but we weren't successful up front. I don't think Raya had to make a single great save. We lost against a superior Arsenal team and we have to accept that.\" Shortly afterward, in the mixed zone, he tried to clarify his thoughts: \"We can't always expect the four up front to dribble past three players and score a great goal. As a team, we have to attack and defend better . \"",
        "upvotes": 697,
        "comments": 136,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k14qyc/courtois_we_put_in_a_lot_of_crosses_but_this_year/"
    },
    {
        "id": "1k1b66k",
        "author": "BdBoss_777",
        "title": "🚨 Carlo Ancelotti will NOT finish the season at Real Madrid. He will lead the team in the Copa del Rey final next week, then he'll immediately leave, and will NOT finish La Liga.",
        "content": "BREAKING: Carlo Ancelotti will NOT finish the season at Real Madrid.\n\nHe will lead the team in the Copa del Rey final next week, then he'll immediately leave, and will NOT finish La Liga. @SkySports",
        "upvotes": 183,
        "comments": 97,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0IxylENp3RSBECWOiKK7J0NsPejkVh5CipNiRVieEUY.jpg?auto=webp&amp;s=5867603ac1411f09e4ae0ab1d3f5d014589cd2b0"
        },
        "permalink": "/r/realmadrid/comments/1k1b66k/carlo_ancelotti_will_not_finish_the_season_at/"
    },
    {
        "id": "1k18vp7",
        "author": "fig966",
        "title": "Brace yourselves Arda Guler posts incoming",
        "content": "(Old post was deleted, wrong flair apparently 🤷‍♂️)",
        "upvotes": 195,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/g09qy9xm9dve1.png?auto=webp&amp;s=3eb08f80e2dbf7a87664bede53e1a2bfa29b34f6"
        },
        "permalink": "/r/realmadrid/comments/1k18vp7/brace_yourselves_arda_guler_posts_incoming/"
    },
    {
        "id": "1k0zjql",
        "author": "Ready_Ad_1353",
        "title": "Ancelotti: \"Arsenal deserved to go through and I hope the best for them... No excuses, in both games they were better. It can happen in football. We are upset of course. We had a lot of epic moments in the past and tonight we have to manage the setback.\"",
        "content": "",
        "upvotes": 1120,
        "comments": 155,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/lsphygiweave1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k0zjql/ancelotti_arsenal_deserved_to_go_through_and_i/"
    },
    {
        "id": "1k0yj7b",
        "author": "TestProfessional6716",
        "title": "\"Our front line should be destroying Europe\" is a stupid take",
        "content": "Tough defeat today, but I see this a lot in the threads :\n\n\"We have 3 nuclear weapons in the front and we don't know how to use them, it's coach's fault\"\n\nStupid take. That would be the case if you're playing FIFA on PS5. What you have is 3 fast right footed midgets, with brute force players in the midfield without a single one with decent build up quality to link defense and offense, and in the back, you have literally no fullbacks !\n\nThe front 3 is attractive, but not balanced ! Perez ruined a very good squad by buying a player we didn't fucking need and NOT replace 4 key players :\n\n1. Joselu, a tall cunt that wins most of his aerial duals and is always a threat in crosses. He was a downgrade of Benzema but thank god we had him to mix up our offense last season and he was VERY important !\n2. Kroos, a midfielder who has guaranteed &gt;90% pass accuracy,\n3. Nacho, a player who plays all positions in the defense\n4. Carvajal, our ONLY RB since 2014\n\nWatch the board buy another Brazilian midget by the end of the season !\n\nXabi Alonso, Klopp, Guardiola, Mourinho, none of them, separated or combined in any fucking way, will achieve shit with this squad either ! Easy to call out 'Carlo has no tactics' but you don't win chess games on high level with 6 bishops instead of the other pieces ! You need 2 Bishops, 2 Knights and 2 towers !\n\nCould Ancelotti have managed this season better ? Yes. Is he fully to blame ? Absolutely not and don't forget to shit on the board before shitting on the coach. Man asked for Harry Kane but got a CAM Bellingham so he switched the entire formation to fit him for a false 9 and it worked thanks to Vini wonder season.. So Perez decided to do this every fucking time because the next Brazilian midget he will buy will play as a left back because the board is to lazy to splash cash on an ACTUAL LB.\n\nY'all realize we have been playing for most of the season with 2 defenders in the 4 backline ? Tchou moved to CB and LV as RB are not their positions, Ancelotti's fuck up is not playing Asencio earlier, but it's sad to watch Alaba being average, then Fran comes in and he is just worse, together with Mendy's performances in this season. I don't need to talk about LV.\n\n3 Lewandowskis in the front won't work ! 3 Harry Kanes won't work ! 3 Sakas won't ! 3 Viniciuses won't work ! You need an actual number 9, an actual RW and an actual LW, but instead we have 3 LWs and people are like 'Any coach will destroy Europe with MVR' because they do in career mode on their PS5.\n\nWe can't win the UCL every season. Congratulations to Arsenal. Hala Madrid !",
        "upvotes": 693,
        "comments": 260,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k0yj7b/our_front_line_should_be_destroying_europe_is_a/"
    },
    {
        "id": "1k0u4og",
        "author": "Constant_Aspect_6632",
        "title": "Dani Carvajal and Saka had words at the end of the half.",
        "content": "",
        "upvotes": 1229,
        "comments": 224,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7z2687ey79ve1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k0u4og/dani_carvajal_and_saka_had_words_at_the_end_of/"
    },
    {
        "id": "1k17m1o",
        "author": "Emergency-Hornet-594",
        "title": "Fabrizio Romano om Facebook: Mikel Arteta: “Carlo Ancelotti told me that he HOPES Arsenal win the Champions League!”.",
        "content": "All the best to Arsenal and Barca. ",
        "upvotes": 112,
        "comments": 40,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/r1BHvoeoC_ZHm4AzOs0V29ozN7wVp52seaPby_usV2A.jpg?auto=webp&amp;s=5b47573d5e6c8781034fffdb3dbb8081a5063f03"
        },
        "permalink": "/r/realmadrid/comments/1k17m1o/fabrizio_romano_om_facebook_mikel_arteta_carlo/"
    },
    {
        "id": "1k0qzjo",
        "author": "[deleted]",
        "title": "Scenes outside Santiago Bernabéu",
        "content": "",
        "upvotes": 1407,
        "comments": 57,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/nr12sr1yk8ve1.jpeg?auto=webp&amp;s=93da6c9de9e15173da1a30ebb82b95feb7d8220c"
        },
        "permalink": "/r/realmadrid/comments/1k0qzjo/scenes_outside_santiago_bernabéu/"
    },
    {
        "id": "1k1fid2",
        "author": "Public_Swordfish_569",
        "title": "Lazy attitude by some players.",
        "content": "",
        "upvotes": 27,
        "comments": 12,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/azwdn8bwxeve1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k1fid2/lazy_attitude_by_some_players/"
    },
    {
        "id": "1k0su89",
        "author": "Constant_Aspect_6632",
        "title": "Courtois 🧱 saves the penalty",
        "content": "",
        "upvotes": 927,
        "comments": 52,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2at2ip3gy8ve1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k0su89/courtois_saves_the_penalty/"
    },
    {
        "id": "1k17nvw",
        "author": "busyblckboy",
        "title": "Vini plays better with Endrick than mbappe",
        "content": "Vini's game might actually synergize more effectively with Endrick. Perhaps Endrick's movement and willingness to occupy different spaces unlocks a different dimension for Vini, allowing him more freedom or creating unique attacking angles we haven't fully explored with Mbappé. What are your initial thoughts on this? Are we seeing a more natural understanding develop between Vini and Endrick, or is the established quality of the Vini-Mbappé duo still the superior combination? Let's hear your tactical breakdowns, observations, and any predictions for how these partnerships might evolve.\n\nMy evidence is when edrick came on vini was finding him with his crosses spot on. Endrick was just physically bullied and didn't convert. \n\n\nFull disclosure I actually think mbappe was horrendous. I liked him at first but after this season I'm not impressed in the least. ",
        "upvotes": 79,
        "comments": 83,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k17nvw/vini_plays_better_with_endrick_than_mbappe/"
    },
    {
        "id": "1k102aa",
        "author": "Danickcoolman",
        "title": "Football is played on the pitch, not on social media.",
        "content": "I’ve said it multiple times and I’m going to say it again: Carlo needs to leave. He needs to leave because a legendary manager cannot continue to tarnish his legacy by what was being displayed by his players and by himself. Today, 7 out of 42 crosses were successful, Vazquez was seemingly one of our best players and the attitude of some players that are supposed to be leaders was downright embarrassing. Just like the title says, you play on the pitch, not on social media. \n\nThis is a lesson for the Instagram warriors that are our players and the admin of the club’s account. For an entire week, we’ve heard them say “Remontada this, remontada that” or “we’re going to comeback” or even “remontada has been the most used word in the dressing room” when a remontada DOESN’T come out of thin air. 3-0 against Wolfsburg was thanks to a brilliant Cristiano Ronaldo, 3-1 against City in 2022 was thanks to a brilliant Rodrygo, Courtois and Benzema and etc. Do you guys see a pattern here? Every remontada has been thanks to players trying their hardest because they believe that they can do it and that they don’t need to talk on social media to play their football. But what about today? We had:\n\n- Rodrygo Silva de Goes who has been invisible, yet AGAIN. His last goal being against Atletico back in march. “Only idiots forget the R”. I know that he’s playing out of position, but Raphinha has been playing out of position since the beginning of the season and is at 50 G/A+. Great players should always perform even if they play out of position.\n\n- Kylian Mbappé Lottin who wants to play as a central midfielder instead of making runs in behind. “Adaptation period is over: I’m going to be the one deciding matches now”\n\n- Vinicius José Paixao de Oliveira Junior who, despite being the best out of the three tonight, has been seen hugging the touch line too much instead of exploiting the space centrally when Mbappe wasn’t there and playing with Alaba when he was overlapping in the first leg. “I’m going to do it 10x more, they are not ready.”\n\nWhat I hate the most in football are people who like to talk days before the actual game. We put out a disastrous performance in the first leg and you would think that the players and the coaching staff would learn from their mistakes and prepare at least **something** against Arsenal, am I right? I can understand that we’re playing against the best defence in the Premier League, but this doesn’t excuse the lack of solutions from Ancelotti. I mean, Courtois said in an interview that the players are doing what Ancelotti is telling them to do, they want to respect his wishes. Spamming crosses to nobody in the box or refusing to play out from the back isn’t how you’re going to win matches. Time and time again in today’s match, long balls were being spammed when we know that our front three has no aerial threat, so why are we doing that? And don’t get me started on David Alaba. He never should’ve started at LB.\n\nPutting the blame on the coach and the players is unfair, right? So, how about we talk about the so called “ruthless president” that is Perez and the idiots that run our board? It’s maddening how Perez thought that adding another left winger to a team that already has two was a great idea. Don’t get me wrong, Mbappé is a fantastic player, but he sure as hell **WASN’T** the player that Madrid needed. \n\nEveryone, Madridistas and neutrals, could see that Madrid needed a REAL number 9 to finally have the aerial threat that they had been lacking ever since Benzema left the club. Vini’s best season has been when he had a number 9 to rely on so what does Perez do after seeing that we need a number 9 and that Joselu has been a fantastic player when it comes to aerial threat despite being on loan? He buys another left winger because Galactico! The result is a disjointed attack with three guys that want to play on the left, leaving 34 years old Lucas Vazquez essentially playing as the RW and Valverde running from defence to attack just to cover the gaps left by Vazquez. But hey, the board is there to help, right? Of course not. We have bums that consider Eder Militao, 2 ACL injuries in two years by the way, the “signing” of next season. Bums who clearly see that we desperately need fullbacks but chose to renew Vazquez. Clueless idiots who will come out on an interview and say “we won two champions league, so everything will be okay” when we are getting outplayed by every big team either at home or away. When will this circus end? When will these human beings finally acknowledge that our squad depth is embarrassing and that spending 50 millions on Dean Huijsen who has been fantastic for Bournemouth and Spain isn’t something to be ashamed of? Is the club just a joke for them? I speak for every Madridista when I say that we love this club with passion and that we will continue supporting Real Madrid no matter what happens, but we are not idiots. We can see that the club is not going well and it is **INFURIATING** to see the people in power not doing a single thing to help this cause. Real Madrid is the greatest club in the world and a club with such a title should not be allowed to be so immature when it comes to transfers or squad depth. The board and Perez are supposed to be helping the manager with signings, so why aren’t they doing it?",
        "upvotes": 305,
        "comments": 86,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k102aa/football_is_played_on_the_pitch_not_on_social/"
    },
    {
        "id": "1k1btrn",
        "author": "ubebebebe",
        "title": "To my fellow Madridistas…",
        "content": "I know fans of other teams like to hate on us… calling us names etc etc\n\nBut can I just commend the REAL fans who are level-headed, mature, experienced, gracious, wise and kind.\n\nThank you for calling out those fans who say mean and disrespectful things (I’ve been called out a few times this past week… I was too emotional lol)… and for correcting some unacceptable fan behaviour. 👏🏼👏🏼 you are the real MVPs of this group.\n\nWe are such a big club (if not the biggest)… so it’s to be expected that we will have fans from all walks of life, from all ages, from all over the world, old and new. We can’t filter every fan… and we can’t control their every action or word. \n\nWe have been mocked and have been labelled all sorts of things, but what these haters (or fans of other clubs) don’t see are the number of mature fans in our group that are actually logical (not delusional), realistic, respectful, wise and kind. I have encountered more kind RM fans than mean ones on here… and in person too. \n\nMay this bring comfort to the whole fam. We are so much better than what the haters are trying to tell us. 🤍💜",
        "upvotes": 31,
        "comments": 13,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k1btrn/to_my_fellow_madridistas/"
    },
    {
        "id": "1k1g81b",
        "author": "sungod_10",
        "title": "The Nightmare of Europe- Real Madrid CF",
        "content": "One manager isn't enough anymore guys 😭😆",
        "upvotes": 15,
        "comments": 31,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/onmb27n73fve1.jpeg?auto=webp&amp;s=d9aecb384b02ede9542937215c06369155ef1173"
        },
        "permalink": "/r/realmadrid/comments/1k1g81b/the_nightmare_of_europe_real_madrid_cf/"
    },
    {
        "id": "1k0qmg4",
        "author": "Bexewa",
        "title": "You all ready for tonight?",
        "content": "",
        "upvotes": 791,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/payas4zdi8ve1.jpeg?auto=webp&amp;s=0b59a87f84d003fdc893742420de48010c1900e3"
        },
        "permalink": "/r/realmadrid/comments/1k0qmg4/you_all_ready_for_tonight/"
    },
    {
        "id": "1k1eiw9",
        "author": "CapNegative77",
        "title": "Jurgen Klopp as new manager?",
        "content": "With all respect to Carlo and everything he’s done for the club, all good things must come to and end. A shame we got knocked out by Arsenal but it was not our season with poor performances throughout. It may be stupid but can we see Klopp as a new manager at the end of the season? He did say he’s open to negotiate with Madrid.",
        "upvotes": 17,
        "comments": 74,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k1eiw9/jurgen_klopp_as_new_manager/"
    },
    {
        "id": "1k12ev9",
        "author": "LengthJunior9132",
        "title": "Fullbacks are the most underrated positions in modern football.",
        "content": "After watching almost every single game of this Madrid team, I am starting to appreciate good fullbacks. They are the ones who connect attack and defence, they does playmaking, should have incredible stamina and speed. Defend against wingers who are the most skilled players in a team. And then I look at our team's fullbacks....\nYes all the other players didn't play that well. But look at how other fullbacks just carry the ball, especially players like Nuno Mendes and Hakimi. These players even show up when their strikers are doing bad. \nNow at Madrid, we can see the CBs just passing the ball to each other. The fullbacks doesn't even care about dropping deep and collecting the balls sometimes. ",
        "upvotes": 120,
        "comments": 45,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k12ev9/fullbacks_are_the_most_underrated_positions_in/"
    },
    {
        "id": "1k16ya0",
        "author": "_yoshaaa_",
        "title": "Neither mad nor disappointed",
        "content": "People have a very inaccurate view of what happened today. I saw everyone at 100% the entire game. High intensity, high amounts of pressing, high willingness to win duels. Mbappe was trying. Rodrygo was trying. Asencio was trying, even with the penalty. Alaba was trying. Jude was trying. Courtois sure as fuck was trying.  I saw Lucas and Vinicius, possibly our two worst players in the last 1-2 months, giving it their all, taking on their man, and being aggressive. Yes, Lucas fouled today, but he showed a lot of heart. Nobody “ghosted.” \n\nThe simple fact is that they can try all they want, but with no tactics and no clue what to do, this effort will amount to nothing. \nYou can’t be mad at the players today. And you can’t be disappointed, either. Going into the second leg with a 0-3 deficit, with aforementioned zero tactics, you have the right to believe in a comeback. You have the right to expect a win. But you don’t have the right to, in the case that we lose (which we did), turn around and pretend like we fumbled today.\n\nThe only people you can be mad at are the board and to a reasonable extent Ancelotti. You cannot be mad at our players and you cannot be disappointed by our performance. \n\nThis was not the year sadly, and the signs were there for months. Next year, with Trent, with hopefully another defender, and with a new coach, things will be better.",
        "upvotes": 47,
        "comments": 31,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k16ya0/neither_mad_nor_disappointed/"
    },
    {
        "id": "1k1ebkc",
        "author": "blueXwho",
        "title": "Mbappé's job is to score goals and he is the top scorer",
        "content": "I keep reading the \"3 LW\" complaint over and over, saying Mbappé is the problem, that we didn't need him, and that we need a \"real\" striker. However, for what exactly do you want a \"real\" striker over Mbappé? So he can score goals, right? Guess what, Mbappé is the top scorer, fighting for the Pichichi, with more goals than anyone last season. He came to give us goals and he has delivered.\n\nDo we need an alternative, tall, expert header? Yes, of course, but Mbappé is still a great signing.\n\nPeople have told me \"but it's not about the goals\". Really? Football is not about scoring more goals than the opponent?\n\nMbappé is doing his job and he has scored great goals. He can do better, of course, I'm sure next season he'll be better adapted.\n\n\"But he doesn't press.\" No, he doesn't press as people would like, but that's the whole team. Ancelotti plays with a low block, so forwards cannot effectively press high. Pay attention to the games, see what's going on behind the forwards. When Vini, Mbappé, or Rodrygo press the defender, no one is pressing one on one behind them, which means the defender has two or three open passes (fullback, goalie, midfielder). Then, keep pressuring is just a waste of energy.\n\nWhen the whole team is pressing, usuallynwhen we're down, Mbappé runs for the keeper or the defender, but this team pressure doesn't happen often. So their job is to populate the center, to prevent passes through that hallway.\n\n\"But Kane...\" He has very similar stats and was knocked out in the same stage.\n\nAnyway, our problems have more to do with defense and the connection the midfield should establish than with having an elite player that has scored more goals than anyone in the team. ",
        "upvotes": 13,
        "comments": 35,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k1ebkc/mbappés_job_is_to_score_goals_and_he_is_the_top/"
    },
    {
        "id": "1k1fh4r",
        "author": "flstudiobeatmaker101",
        "title": "A true number 9 is not the problem.",
        "content": "An amazing example of this is current PSG. They are playing some of the best football in Europe right now, and have no trouble scoring any goals. Well, take a look at their attack. Dembele, a RW/LW. Barcola, Doué, and Kvaratskhelia, who are all LW's also! The difference is, they have good rotations and all work for each other. The only reason it looks like Madrid need a number 9, is because against Arsenal, all they did was cross balls into the box. PSG doesn't spam crosses to get goals, they know their strengths and find other ways to score. They rotate all over the pitch, and try and open up spaces for each other to get in 1v1 situations, and hopefully capitalize on them. How many times against Arsenal did we see Vinicius and Mbappe 1v1 with space to run into and finish? Zero. A new coach is really what is needed, one that can find the strengths of Mbappe, Vinicius, and Rodrygo. Most of Madrid's attacks are just Vinicius running down the wing and trying to cross the ball back, with someone rarely getting to it. Mbappe hardly gets involved in the attack, which forces him to drop deep to receive the ball, leaving the box empty. Another reason why PSG are so successful is because of their fullbacks getting forward, which is why I think Trent is an amazing transfer. A tall number 9 isn't needed whatsoever, a new coach with a better sense of managing the attack is what Real Madrid really need.",
        "upvotes": 10,
        "comments": 7,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k1fh4r/a_true_number_9_is_not_the_problem/"
    },
    {
        "id": "1k1c5la",
        "author": "UnderstandingBusy478",
        "title": "Why does real madrid have 3 of the top 5 left wingers in the world ?",
        "content": "Why on earth are vinicius, mbappe and rodrygo playing in the same team and AT ONCE ???\n\nVinicius is the team's attacking heartbeat for years now so no questions there. Rodrygo was a prodigy who was forced to get used to playing out of position due to his fellow prodigy vinicius, a tricky situation but it happens.\n\nMbappe. WHY the fuck did real madrid sign mbappe ??? and more importantly. Why the fuck did mbappe sign for madrid ?? Does neither mbappe nor mbappe's agent realize that he has nowhere to play in madrid ??\n\nEvery single time a coach has tried to play mbappe at ST they failed. Why did he and ancelotti and the everyone behind this signing think 27th time's the charm ? Or was the plan to rotate between him and vinicius ? the top 2 left wingers in the world fighting for 1 spot ? You already play a world class left winger out of position. now you have 2 playing out of position.\n\nThe fact that mbappe seems to actually be trying to play ST and isn't actively complaining makes me think he thought about this and thought he is gonna suddenly be a striker when he signs for madrid. But i think he is realizing day by day that won't happen. Or is very hard. Your natural position isn't something you can easily change at 26. Especially when you are the best in the world at it.\n\nImagine trying to play salah, the greatest right winger in PL history. as a striker or left winger even when he was 26 ? he'd be average at best. average as in mid to lower table level in the PL maximum.\n\nOr did ancellotti and everyone responsible for signings at madrid think they are playing fifa career mode ? i don't get it.\n\nThis reminds me of the coutinho signing for barcelona. They wanted a neymar replacement who could hug the touchline and provide width in the final third. They bought one of the best central playmakers in the premier league. absolute stupidity on both the player and the team's end. same thing here.",
        "upvotes": 16,
        "comments": 46,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k1c5la/why_does_real_madrid_have_3_of_the_top_5_left/"
    },
    {
        "id": "1k17p04",
        "author": "ace-s",
        "title": "The biggest shock for me this season is out per game distance travelled this season(Arsenal (231.5km) - Real Madrid (209.3km))",
        "content": "How would our new manager shift things up. Even henry talked about how this season Real Madrid has 3 players at the bottom 3 in distance travelled amongst forwards getting beaten by 30+ year olds. \n\n  \nThis frels clearly tactical. Mbappe maybe abit lazy in Work rate but Vini and Rodrygo have always been high work rate players. \n\n  \nIt feels like Carlo is making the midfielders do all the pressing and running. \n\nI still feel there is hope with a new coach. Barca has almost the same team as last year and look how things turned around. We need a coach that can bring back intensity to the team.",
        "upvotes": 34,
        "comments": 17,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k17p04/the_biggest_shock_for_me_this_season_is_out_per/"
    },
    {
        "id": "1k1dzmu",
        "author": "RonaldinhoTheBrazil",
        "title": "Would Flo give Xabi free rein?",
        "content": "I’m quite excited about the prospect of Xabi coming in and implementing his system but would Flo allow him to do this and make the signings he wants without pressure? It seems imperative at this point that we must adopt a footballing identity that isn’t based around splashing money on elite players and hoping they save us",
        "upvotes": 10,
        "comments": 19,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k1dzmu/would_flo_give_xabi_free_rein/"
    },
    {
        "id": "1k0qzfh",
        "author": "Charybd1ss",
        "title": "Real Madrid have arrived",
        "content": "",
        "upvotes": 332,
        "comments": 15,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/i9ytr0qsk8ve1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k0qzfh/real_madrid_have_arrived/"
    },
    {
        "id": "1k17yoe",
        "author": "ReplacementUnited740",
        "title": "Lack of player movement",
        "content": "I don't know why it's changed so much this year, but now players don't do anything when we're around the opposing defense. \nVinicius and Mbappe ask for the ball while standing still (they are the fastest players in the world, it's stupid)The midfielders never try to get out in front to receive the ball (except for Ceballos and Modric)It's just a totally crazy situation, players are thinking that staying still can seriously work.The absolute lack of character of many players is insane,With the exception of Rudiger valverde vasquez Ascensio and Bellingham few players have not the Real Madrid character (I don't know if the  translation is correct, but in my language, having character = refusing defeat)\nOur striker had the mentality of \"I can make the difference alone, I can save the team\" more than the character that refuses defeat. \nOur substitutes have more character than many of the starters, especially in midfield, the midfielders don't break any lines, they do what everyone criticized Tchouameni for. \nOf course I'm only talking about character in attack, the mentality in defense was very Madridista\nMaybe it's Carlos's fault, but the fact that Ceballos stands out naturally makes me wonder about the midfield. \n\n",
        "upvotes": 23,
        "comments": 34,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k17yoe/lack_of_player_movement/"
    },
    {
        "id": "1k0m66r",
        "author": "monerfinder",
        "title": "I’ve created a Real Madrid Pendant for the “Remontada”!!",
        "content": "Hello dear Madridistas!\n\nI made myself a Real Madrid Pendant with my 3D Printer and I want to share it with you. I made it as a charm to bring if possible some luck to our boys today!\n\nI made the 3D model myself and I posted in Makerworld for any of you that wants to print it for yourself 😊. I will post the link to the model in the comments.\n\nI wish you a really nice game day and I hope that we can manage to pass today 💪💪!!\n\nHala Madrid!!",
        "upvotes": 596,
        "comments": 62,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k0m66r/ive_created_a_real_madrid_pendant_for_the/"
    }
]