[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 510,
        "comments": 276,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 19,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jyfpgx",
        "author": "summeriswaytooshort",
        "title": "Bad Influence - $300K to 500K+ a month for years ???? where is all the money ????",
        "content": "Someone please explain if Piper is making $300K -500K a month per year, for years ( $6M a year) where is all the money? Yes I know living in LA is expensive but the house they were in wasn't at that level of income. In the beginning it sounds like they were renting in LA then at the end when they were filming the BF  on a super busy street - I guess it would make sense if it was an ocean front house.",
        "upvotes": 53,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1jyfpgx/bad_influence_300k_to_500k_a_month_for_years/"
    },
    {
        "id": "1jyllwx",
        "author": "Witty_Peace_9617",
        "title": "\"Bad influence, the dark side of kid-influencing\"",
        "content": "Hi all!! I recently watched \"bad influence the dark side of kid influencing\" and it absolutely blew my mind that someone from my childhood and then I watched every single day was getting treated like this. but the main thing I really wanted to ask is does anybody know anything that wasn't mentioned in the documentary because I tried to find things, but I think Tiffany has cleared out almost any evidence or proof of any other situation. i'm really just curious about this situation and want more insight into all of the things she did. if you know anything at all that wasnt mentioned in the documentary please comment!",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jyllwx/bad_influence_the_dark_side_of_kidinfluencing/"
    },
    {
        "id": "1jyn9au",
        "author": "Mountain-Bid4317",
        "title": "Ad tier= almost no ads?",
        "content": "Is this just what you watch, or does Netflix with ads have almost no ads? I only watch Inuyasha (2000 series) on there and will give me one 30 second ad per episode and most of the time not even that. There's been so many episodes with no ads whatsoever.  What about popular shows like Stranger Things and the super \"in demand\" titles?",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jyn9au/ad_tier_almost_no_ads/"
    },
    {
        "id": "1jyjnw1",
        "author": "RevolutionaryDig2304",
        "title": "North of North",
        "content": "I’m so sorry and correct me if I’m wrong but didn’t Siaja kiss her dad (Alister) in episode 1?!? I feel like we just jumped right over that and it’s making it hard to pay attention now 🥲😅",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jyjnw1/north_of_north/"
    },
    {
        "id": "1jyf9ox",
        "author": "Plane-Cloud-5837",
        "title": "Netflix shows with 100% on Rotten Tomatoes",
        "content": "",
        "upvotes": 7,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1jyf9ox/netflix_shows_with_100_on_rotten_tomatoes/"
    },
    {
        "id": "1jy42m6",
        "author": "Rude_Koty",
        "title": "Bad influence lawsuit settlement?",
        "content": "I just watched the whole documentary and it is horrible what happened to the kids behind their parents backs. This being said, the last part really confused me. The moms said the lawsuit was to go after Tiffany and not for the money, why then did they settle for the money? Their kids even said they do not care about the money. I am really appalled. Does anyone know why they did this?",
        "upvotes": 30,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1jy42m6/bad_influence_lawsuit_settlement/"
    },
    {
        "id": "1jybil0",
        "author": "Cold_Hat6785",
        "title": "i need help with fixing this download issue.",
        "content": "i get this error with my downloads, saying it hasnt downloaded fully, but it has?? how do i fix this? thanks in advance",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jybil0/i_need_help_with_fixing_this_download_issue/"
    },
    {
        "id": "1jykbjy",
        "author": "Aggressive_Flight145",
        "title": "Moritz&amp; friends relationship",
        "content": "I see Moritz is a bad friend and terrible person all over this sub. Now he is a bad friend but he has redeeming characteristics and moments. He truly does care for Lenny and I don’t know how he forgave Lisa for everything she did. \n\nDan and Moritz have a lot in common more than they realize. Lenny deserved better than both of them. \n\nLenny was a great friend to Moritz besides when he was considering cutting Moritz out of the 2%. And he didn’t tell Moritz about owning half the company. I was disappointed and shocked at that for Lenny. It felt out of character. \n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jykbjy/moritz_friends_relationship/"
    },
    {
        "id": "1jy2mtk",
        "author": "FirTrader",
        "title": "Best Show",
        "content": "I am ecstatic that Black Mirror released all of the season 7 episodes at once. Totally loving life, right now, as i’ve only finished 3 episodes. So far, the creators have done a great job of keeping this series fresh, interesting, and on-par with its incredible, previous seasons. ",
        "upvotes": 13,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jy2mtk/best_show/"
    },
    {
        "id": "1jycbc1",
        "author": "indiewire",
        "title": "All 33 'Black Mirror' Episodes Ranked",
        "content": "",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jycbc1/all_33_black_mirror_episodes_ranked/"
    },
    {
        "id": "1jyh9ca",
        "author": "NeighborhoodVandal",
        "title": "Three robots animated series.",
        "content": "Hi! A few years ago i saw an animated series on netflix about threee small aliens/robots. They were white and each one had a different shape. The animation was 3D but the background was or seemed real life b-roll. Kinda like the style used in gumball. Anyone remember the name?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jyh9ca/three_robots_animated_series/"
    },
    {
        "id": "1jyh5yg",
        "author": "justherelurking_",
        "title": "movie recommendations pls",
        "content": "hello!! please recommend some movies on netflix.\n\ni want something like final destination vibe or anything like mystery thriller, murder. please please im running out of movies 😔",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jyh5yg/movie_recommendations_pls/"
    },
    {
        "id": "1jygnel",
        "author": "redtimmy",
        "title": "Question About The Residence - SPOILER",
        "content": "Who were the two actors who played the gatecrasher couple? I can only find info about Timothy Hornor who played Patrick Doumbie (AKA \"the third man\"), who also, technically, crashed the party. My friend swears it's David Beckham, but his IMDB page is uncredited for this. \n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jygnel/question_about_the_residence_spoiler/"
    },
    {
        "id": "1jyg7gz",
        "author": "Pizzarepresent",
        "title": "Shows disappear when using my Starlink-based network but not other networks?",
        "content": "As the title says: Shows I was watching weirdly disappeared, not just foreign titles, but Netflix big shows like The Blacklist - just gone.\n\nHowever, when checking in at a restaurant, using their wi-fi, the shows were back. When at home, using cellular data, the shows were still back.\n\nHowever again, when I switched to my Starlink-based home network, the shows disappeared again. Switch to cellular, the shows are there. Switch to Starlink, the shows are gone.\n\nSo the key is my Starlink network. Why is netflix disappearing shows when I use Starlink to access them, but not other networks?\n\nIt's weird.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jyg7gz/shows_disappear_when_using_my_starlinkbased/"
    },
    {
        "id": "1jyg5fq",
        "author": "FriendlyRip6221",
        "title": "Any recommendations please",
        "content": "Hey all just making some dinner right now and was going to have a relaxing night watching shows/movies please can you leave any suggestions for me to watch I just finished the life list and it was amazing!",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1jyg5fq/any_recommendations_please/"
    },
    {
        "id": "1jyesjb",
        "author": "Damienisok",
        "title": "Wholesome shows",
        "content": "Stuff that gives you a warm feeling inside, that after finishing doesn't leave you with any anger or sadness, maybe something like xo, kitty or whatever it's called, I kinda liked the silly way they did things there, it was nice and sweet and personally didn't leave me feeling angry or sad, maybe a bit annoyed at most but that's it.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jyesjb/wholesome_shows/"
    },
    {
        "id": "1jyd1hi",
        "author": "S4v1r1enCh0r4k",
        "title": "Black Mirror creator reveals unmade Bandersnatch sequel Banderstruck he still wants to do: \"I might still revisit that well in some way\"",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jyd1hi/black_mirror_creator_reveals_unmade_bandersnatch/"
    },
    {
        "id": "1jya82x",
        "author": "ToonAdventure",
        "title": "Moonrise OP by Ryo Kawasaki | Netflix Anime",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jya82x/moonrise_op_by_ryo_kawasaki_netflix_anime/"
    },
    {
        "id": "1jxgd7w",
        "author": "Legitimate_Ad3625",
        "title": "‘They’ve Completely Got It Wrong’: Stephen Graham Speaks Out on Deliberate Misreadings of Adolescence",
        "content": "",
        "upvotes": 134,
        "comments": 90,
        "media": null,
        "permalink": "/r/netflix/comments/1jxgd7w/theyve_completely_got_it_wrong_stephen_graham/"
    },
    {
        "id": "1jy31dr",
        "author": "stormy_kaktus",
        "title": "On my profile it says “There is a problem connecting to Netflix.”",
        "content": "This only happens on my profile and not my moms or brothers. \nFor some context; I am out of the country so I can’t use another device to check if it’s bugging on that one too. I’m on iPhone if that helps ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jy31dr/on_my_profile_it_says_there_is_a_problem/"
    },
    {
        "id": "1jxv6dj",
        "author": "dcrad91",
        "title": "Just got an ad on ad free sub",
        "content": "Just had an uber eats ad pop up on my ad free sub of netflix that I've had for YEARS. Makes me never wanna use uber eats too. \n\n  \nAnyone else get any recently? ",
        "upvotes": 12,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1jxv6dj/just_got_an_ad_on_ad_free_sub/"
    },
    {
        "id": "1jxll0f",
        "author": "ThatLady0402",
        "title": "The Residence/I identified the murderer for a reason that was never mentioned!",
        "content": "SPOILER\n\nWhen everyone was finally allowed to leave the White House and Cordelia was walking through the crowd, everyone looked angry and gave her either a dirty look or at least an unhappy one. Of course they did, they were all tired and pissed that she’d kept them there so long. Only one person gave her a smile. That was the moment I put my money on the person.\n\nI waited for this to be part of the big reveal, but it never came!! \n\nAnyone else pick up on that too?",
        "upvotes": 29,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1jxll0f/the_residencei_identified_the_murderer_for_a/"
    },
    {
        "id": "1jx7q7s",
        "author": "starcityguy",
        "title": "Just finished Adolescence",
        "content": "Really was not sure what to make of the show at first.  Told my friend after two episodes it’s either the dullest thing I have seen or it’s brilliant.  I just wasn’t sure which, but I kept watching.  \n\nMidway through episode 4 it hit me that I was watching something closer to a play than a tv show.  A play with four acts.  Each act presented in one take.  And I decided it’s brilliant.  Not for everyone, but the end of episode 4 clinched it for me.  ",
        "upvotes": 356,
        "comments": 87,
        "media": null,
        "permalink": "/r/netflix/comments/1jx7q7s/just_finished_adolescence/"
    },
    {
        "id": "1jy93h3",
        "author": "starlightskater",
        "title": "Confused about streaming permissions",
        "content": "I just got off the phone with Netflix customer service and don't believe what she told me. Can someone please clarify how this works?\n\n**Scenario A:** I plan on signing up for Netflix Standard. This allows me to stream on two devices simultaneously from the same Household. I'm leaving soon for a summer internship that will be 3 months. How does this work with my \"Household\" account? \n\n**Scenario B:** same account, except I have a summer house in one state and a winter house in Florida. Would you have to \"reset\" your home address under your Netflix account in order to use both locations (at different times of the year)? \n\n**Scenario C:** same account, but I stay in a hotel overnight in a different city. The hotel has a smart TV and I can sign in with my Netflix account. Do they allow this? \n\nI'm trying to figure out what's changed since they cracked down on password sharing. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jy93h3/confused_about_streaming_permissions/"
    },
    {
        "id": "1jxp5fe",
        "author": "DaGroke",
        "title": "Just watched Million Dollar Secret — confused by the ending (spoilers)",
        "content": "Already posted this but it got removed for some reason.\n\nI just finished watching *Million Dollar Secret*, and the ending totally threw me off. Maybe I’m overthinking it, but I’d love someone to help clear it up.\n\nAt the end, only **Sam**, **Cara**, and **Correy** are left.  \n**Sam** doesn’t get to move any boxes, so she’s not important for this part.\n\n**Correy** thinks **Cara** has the money, but he wants to trick her into thinking he believes **Sam** has it.  \nSo when it's Correy’s turn to move the money, he moves it into **his own box**, thinking he successfully tricked Cara.\n\nThen it's **Cara’s** turn, and somehow she guesses correctly, moves the money back into **her** box, and wins.\n\nHere’s where I’m confused:\n\nIf Correy really thought he tricked Cara into thinking **he thought Sam had the money**, then he should’ve moved the money into **Sam’s box**. That way, if Cara believed the trick, she would’ve swapped **Correy’s** and **Sam’s** boxes — and Correy would end up with the money -- thinking she kept the money for herself (or she could have not moved the boxes at all). But instead, Correy moved the money into **his own box**, which only works if Cara *doesn’t* fall for the trick. So... mistake?\n\nBut Cara’s move doesn’t make perfect sense either.\n\nIf she truly thought Correy took the money from her, then logically, he would have put it into **Sam’s box**, she should’ve swapped **Sam’s** and **Correy’s** boxes — giving Correy the money.  \nInstead, she swapped **her** and **Correy’s** boxes, which happened to be the right move — but only if she thought Correy had the money in *his* box, not Sam’s.\n\nSo it seems like:\n\n* **Correy made a logic mistake** (he didn’t follow through with his own bluff properly).\n* **Cara may have made a mistake or just guessed right**, which canceled out Correy’s mistake and gave her the win.\n\nMy question is: how did *both* of them mess this up? These are smart people, and I get one of them making a mistake under pressure — but both? Were they overthinking it? Or was it possibly staged?\n\nIt’s been bothering me, so if I’m missing something or misunderstood their logic, please tell me.\n\n**TL;DR:**  \nCorrey tried to trick Cara but didn’t follow through on his own bluff properly. Cara made a move that only worked if Correy made a mistake — which he did. Somehow both of them made bad moves, but Cara still won. Did they both mess up, or was it staged?",
        "upvotes": 13,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1jxp5fe/just_watched_million_dollar_secret_confused_by/"
    },
    {
        "id": "1jy86yi",
        "author": "Pizzarepresent",
        "title": "Did Netflix just bounce a bunch of shows without warning?",
        "content": "I was working my way through The Blacklist; now, all of a sudden, it’s gone! No “Leaving Soon” warning…\n\nI was also watching/bookmarked some Japanese-language shows, and now they’re gone. Like, it was business-as-usual a few days ago, and now region-locked or gone entirely.\n\nWTF? Does this happen a lot for people?\n\n",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1jy86yi/did_netflix_just_bounce_a_bunch_of_shows_without/"
    },
    {
        "id": "1jxy7d9",
        "author": "Ok-Comfort-1700",
        "title": "What is that melody/song?",
        "content": "Does anybody know the name of the song/melody that plays during episode 7 of the “Greatest Events of WW2 in Color” between 25:40-28:02?  It’s very heroic and beautiful and they also play it around the end of the first episode, too.  But I can’t find it online and Shazam can’t read it.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jxy7d9/what_is_that_melodysong/"
    },
    {
        "id": "1jxj6q9",
        "author": "Ok-Data-7672",
        "title": "What are some German films on Netflix you would recommend I watch?",
        "content": "Hi everyone! I'm looking for German films—romantic, thriller, or adventure—that were released in the past two decades and truly left an impression on you. Any favorites you’d recommend? I’d really appreciate your suggestions. Thanks in advance!",
        "upvotes": 8,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1jxj6q9/what_are_some_german_films_on_netflix_you_would/"
    },
    {
        "id": "1jxpyoy",
        "author": "Optimal_Plum_1240",
        "title": "Need help finding title of a series",
        "content": "I remember watching it on netflix a couple years ago.\n\n\\- Its not in english but i feel like its european kinda sounded like polish but im not sure\n\n\\- Main character was a teenage boy in school\n\n\\- Something about a door in the ground leading to some other place\n\n\\- I think there was a girl later on\n\n\\- I think it was something about different dimensions which the door can lead to\n\nPlease help me find it.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jxpyoy/need_help_finding_title_of_a_series/"
    },
    {
        "id": "1jxcj0i",
        "author": "Due-Beginning-1443",
        "title": "Is that Pop a baloon some kind of joke?",
        "content": "Who are these men, I hoped it will be some kind of cool dating show but these men are horrible. Outfits, attitude. Women are constantly joking around and I feel like no one is really serious - it’s not funny, it’s not entertaining. ",
        "upvotes": 20,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1jxcj0i/is_that_pop_a_baloon_some_kind_of_joke/"
    }
]