[
    {
        "id": "1ius624",
        "author": "GrandTheftHamlet",
        "title": "Hi /r/movies! We’re Sam Crane, Pinny Grylls &amp; Mark Oosterveen, co-directors &amp; actor of Grand Theft Hamlet, streaming exclusively on MUBI. It's an award-winning documentary about attempting to stage a Shakespeare adaptation inside the chaotic world of Grand Theft Auto online. Ask us anything!",
        "content": "",
        "upvotes": 40,
        "comments": 90,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ydrdtl7p5ike1.png?auto=webp&amp;s=d2ab95e5f2af65d68da2535bea5bd3c646d88280"
        },
        "permalink": "/r/movies/comments/1ius624/hi_rmovies_were_sam_crane_pinny_grylls_mark/"
    },
    {
        "id": "1iuhgt8",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (The Monkey / The Gorge / Bridget Jones: Mad About the Boy)",
        "content": "# New Theatrical Releases\n\n[The Monkey](https://old.reddit.com/r/movies/comments/1iuh94f/official_discussion_the_monkey_spoilers/?)\n\n\n# Still in Theaters\n\n[Captain America: Brave New World](https://old.reddit.com/r/movies/comments/1ip0ump/official_discussion_captain_america_brave_new/?)\n\n[Paddington in Peru](https://old.reddit.com/r/movies/comments/1ip0uph/official_discussion_paddington_in_peru_spoilers/?)\n\n[Dog Man](https://old.reddit.com/r/movies/comments/1ie56s0/official_discussion_dog_man_spoilers/)\n\n[Love Hurts](https://old.reddit.com/r/movies/comments/1ijl8mc/official_discussion_love_hurts_spoilers/?)\n\n[Heart Eyes](https://old.reddit.com/r/movies/comments/1ijl8ob/official_discussion_heart_eyes_spoilers/?)\n\n\n# On Streaming\n\n[The Gorge](https://old.reddit.com/r/movies/comments/1iuhec9/official_discussion_the_gorge_spoilers/?)\n\n[Bridget Jones: Mad About the Boy](https://old.reddit.com/r/movies/comments/1iuhedf/official_discussion_bridget_jones_mad_about_the/?)\n\n# Oscar Rewind\n\n[Anora](https://old.reddit.com/r/movies/comments/1ggv4yg/official_discussion_anora_spoilers/)\n\n[A Complete Unknown](https://old.reddit.com/r/movies/comments/1hlsi27/official_discussion_a_complete_unknown_spoilers/)\n\n[The Brutalist](https://old.reddit.com/r/movies/comments/1i37yra/official_discussion_the_brutalist_spoilers/?)\n\n[Conclave](https://old.reddit.com/r/movies/comments/1gbjlm7/official_discussion_conclave_spoilers/)\n\n[Dune: Part Two](https://old.reddit.com/r/movies/comments/1b3jo9s/official_discussion_dune_part_two_spoilers/)\n\n[Emilia Perez](https://old.reddit.com/r/movies/comments/1grn0lz/official_discussion_emilia_p%C3%A9rez_spoilers/)\n\n[Nickel Boys](https://old.reddit.com/r/movies/comments/1i8m8iz/official_discussion_nickel_boys_spoilers/?)\n\n[The Substance](https://old.reddit.com/r/movies/comments/1fl1bpl/official_discussion_the_substance_spoilers/)\n\n[Wicked](https://old.reddit.com/r/movies/comments/1gwxxy1/official_discussion_wicked_part_i_spoilers/)",
        "upvotes": 17,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1iuhgt8/official_discussion_megathread_the_monkey_the/"
    },
    {
        "id": "1ivkq33",
        "author": "Sutech2301",
        "title": "Movies that no one else remembers that you regularly think about.",
        "content": "So, there is this 1991 romcom \"Defending your Life\" starring Meryl Streep and Albert Brooks, whose premise is two people meeting each other in some sort of purgatory after dying and falling in love.\n\nAnd i gotta tell you, this movie is neat af. Interesting concept of the afterlife and solid world building and it also has a bit of suspense, considering that they don't know what will happen to them because they are in purgatory.\n\nWell, this movie has obviously met the typical 1990s romcom fate and disappeared into oblivion, but for me personally, since i watched  \"Defending your Life\" in the early 2000s, to quote Citizen Kane's Mr. Bernstein, not a month has gone by, that i haven't thought about that movie.\n\n\nDo you have a movie that isn't very popular or maybe considered a generic mass product in the general popculture conscious, that stuck with you?",
        "upvotes": 4024,
        "comments": 4880,
        "media": null,
        "permalink": "/r/movies/comments/1ivkq33/movies_that_no_one_else_remembers_that_you/"
    },
    {
        "id": "1iviek1",
        "author": "NeverEat_Pears",
        "title": "Why did no one tell me Crank (2006) was such a crazy balls to wall movie? Jason Statham's greatest performance. Seriously under-hyped action-comedy.",
        "content": "Obviously, the title is slightly tongue in cheek, and Crank is a popular, well-known movie. I think it deserves to be seen as an action comedy classic and an archetype of how to make a great fast paced 90 min movie, however. The budget seems fairly mid-range with the various action sequences.\n\nThe movie is so frenetic from the very start.  Jason Statham is just goddamn marvelous in it. His greatest performance I have ever seen. \n\nI'd always thought Statham's best performance was in Snatch. That may be the best movie he's starred in - but Crank has to be the best performance for me. It seems like he's up for anything. It's a satirical self-deprecating Statham performance, like in Spy with Melissa McCarthy. Just really fun.\n\nThis movie starts with the foot on the accelerator and doesn't stop, getting more and more crazy as Chev (Statham) fights against the poison in his body - he has to keep his heart rate high to stop it from killing him. \n\nThe action is fun and the movie is very funny. It sort of feels like I am watching a movie version of GTA at times as Chev is just like one of their protagonists and causes utter carnage - I honestly think it must have been inspired by those games (with Sanandreas out a couple years prior). Statham bears a striking resemblance to the look and feel of characters from the later GTA games - so it may have worked both ways.\n\nAmy Smart is so utterly sexy as the girlfriend Eve. A scene stealing role. There's some funny scenes and hijinks where she's getting on with her normal life, lolling about in bed high, trying to fix the microwave clock, while all this crazy pandemonium is kicking off all around her. I love how this film doesn't take itself seriously but is also extremely unrelenting.\n \nThere's one uncomfortable scene with Chev and Eve which shows the film's age. &gt;!The public sex scene!&lt;. This scene kind of has a &gt;!rapey!&lt; moment that will have you squirming but then it relents and makes up for it with a very funny crazy sequence.\n\nI feel like this film doesn't get the recognition it deserves. I never knew it was so damn good and I'm a huge film fan. I always got the impression it was just a run of the mill noughties action movie.\n\nEdit: &gt;!Just got to the part where Chev and the bad guy fall out the helicopter and through the sky, and continue to argue and fight eachother. Then, after winning, Chev proceeds to make a phonecall while peacefully falling to his death. Again, so so funny.!&lt;",
        "upvotes": 1065,
        "comments": 225,
        "media": null,
        "permalink": "/r/movies/comments/1iviek1/why_did_no_one_tell_me_crank_2006_was_such_a/"
    },
    {
        "id": "1ivq7sx",
        "author": "GoldSteak7421",
        "title": "What movies have the worst Shaky cam?",
        "content": "I never been fan of shaky cams but when it's decent and serves well enough the purpose , i can tolerate it. You know, some Greengrass movies, Children of Men and such. But when it's bad, it's the worst shit ever, a clear sign of bad direction. Either i don't understand what the hell is going on, or it literally gives me headache (actually, most of times its both)\n\nSo yeah, whats your opinion on shaky cam? And what's the worst example of this filmmaking method for you?",
        "upvotes": 327,
        "comments": 532,
        "media": null,
        "permalink": "/r/movies/comments/1ivq7sx/what_movies_have_the_worst_shaky_cam/"
    },
    {
        "id": "1iv7cxh",
        "author": "JannTosh50",
        "title": "'Jupiter Ascending' came out 10 years ago, and we're still not sure how The Matrix creators' space opera went so wrong",
        "content": "",
        "upvotes": 7836,
        "comments": 1441,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4JixvbH-6GzSwBqnPXBGA7ftSDDXFA_4KE39231Ors0.jpg?auto=webp&amp;s=48272f93123f85edd61f2de05fa514d36be3cdc6"
        },
        "permalink": "/r/movies/comments/1iv7cxh/jupiter_ascending_came_out_10_years_ago_and_were/"
    },
    {
        "id": "1ivob70",
        "author": "theatlantic",
        "title": "“The Monkey” review, by David Sims",
        "content": "",
        "upvotes": 351,
        "comments": 76,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EK4Ikq2WmhCMookkG1jHMK3tQQ26kX0Q-GbinVPFsvs.jpg?auto=webp&amp;s=ed72fd88fa05e63f2043e0497d796ac2cc6920eb"
        },
        "permalink": "/r/movies/comments/1ivob70/the_monkey_review_by_david_sims/"
    },
    {
        "id": "1ivt3tz",
        "author": "herewego199209",
        "title": "I'm watching Source Code again and it made me wonder how is it that you get a director that makes inventive science fiction movies like Moon and Source Code and just cannot make another good movie again? I've seen this with many directors and I don't get it.",
        "content": "I legitimately thought when Duncan Jones made those two movies he was the Ridley Scott of that generation of directors. Just wildly entertaining but smart science fiction movies that were ridiculously tightly made. And after seeing Warcraft and Mute it just feels like a different filmmaker I've seen this happen with Neil Blompkamp who has had like 2 or 3 comeback attempts as well and it's not hitting. It's weird. ",
        "upvotes": 122,
        "comments": 85,
        "media": null,
        "permalink": "/r/movies/comments/1ivt3tz/im_watching_source_code_again_and_it_made_me/"
    },
    {
        "id": "1ivvj26",
        "author": "VanGoghEnjoyer",
        "title": "Carlos Diegues, Filmmaker Who Celebrated Brazil’s Diversity, Dies at 84",
        "content": "",
        "upvotes": 70,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bApzpWm90qJQjj7W-1FPDaED3ChClDcguDMbWzbrdZk.jpg?auto=webp&amp;s=9df30e16aec6c16915fd7b26306f428ee49b62a4"
        },
        "permalink": "/r/movies/comments/1ivvj26/carlos_diegues_filmmaker_who_celebrated_brazils/"
    },
    {
        "id": "1ivthtd",
        "author": "bpres08",
        "title": "Anyone remember Clockstoppers?",
        "content": "This movie just randomly popped up in my head. It’s super cheesy now but at the time Clockstoppers was *the coolest* movie I’d ever seen. It blew my 11-year-old mind. It was like I had just seen Inception or something. I walked out knowing my parents had just witnessed greatness with me.\n\nI’d love to watch it now just to see how much it’s aged. Anyone else see this one in theaters?",
        "upvotes": 74,
        "comments": 46,
        "media": null,
        "permalink": "/r/movies/comments/1ivthtd/anyone_remember_clockstoppers/"
    },
    {
        "id": "1ivwo3g",
        "author": "JohnRedcornXL",
        "title": "Movies with upsetting endings",
        "content": "I'm not going into detail with endings. Just asking for movie suggestions that leave you feeling upset. Not a happy ending. Just straight up slaps you around unexpectedly. \n\nI'm going to list examples of movies with this type of ending below that I have seen and absolutely loved - which is why I listed the spoiler warning. Heads up - they don't have the happiest of endings 🤷🏼‍♂️\n\nThe movies:\n- Memento \n- Upgrade \n- Ex Machina \n- The Prestige \n- Prisoners \n- Se7en \n- One Hour Photo \n- The Mist \n- Interstellar\n- The Butterfly Effect \n- The Bridge to Terabithia \n- The Boy in the Striped Pajamas \n\n\n",
        "upvotes": 42,
        "comments": 209,
        "media": null,
        "permalink": "/r/movies/comments/1ivwo3g/movies_with_upsetting_endings/"
    },
    {
        "id": "1ivx2ta",
        "author": "indiewire",
        "title": "‘Anora’ Wins the Spirit Award for Best Feature — See the Full Winners List",
        "content": "",
        "upvotes": 35,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0sK71oeXQieE7GlO2tXfKL8UYf2nDP_yOd-g3mVsppA.jpg?auto=webp&amp;s=50b38874db535fbc031e9296d63ba6388f1b51cf"
        },
        "permalink": "/r/movies/comments/1ivx2ta/anora_wins_the_spirit_award_for_best_feature_see/"
    },
    {
        "id": "1ivga4c",
        "author": "exally__",
        "title": "Unexpected movies that have an all-time cast",
        "content": "Unexpected movies that have an all-time cast\n\nWatching The Faculty (1998) after 22 years. The cast is crazy good. \n\nWas watching it and everyone of main cast and supporting actors are recognisable from other rolls.\n\nJon Stewart, Salma Hayek, Famke Jensen, Robert Patrick. Jordana Brewster, ... are just some of the ones I forgot about.\n\nCrazy good cast.\n\nSo what other movies cam you think of that just have an unexpected well rounded cast. \n\nNot talking about movies where a good ensemble is expected. Or even if the movie started the careers of a bunch of actors (LOTR for example).",
        "upvotes": 247,
        "comments": 229,
        "media": null,
        "permalink": "/r/movies/comments/1ivga4c/unexpected_movies_that_have_an_alltime_cast/"
    },
    {
        "id": "1ivui0p",
        "author": "MrGittz",
        "title": "What are some Legendary Deleted Scenes that have never been released that you’d LOVE to see? One that I can think of is the so called “Camelot” scene in Spielberg’s War of the Worlds. It was cut so late all the cgi had been finished.",
        "content": "I would LOVE to see this scene. It takes place late in the film, as Tom and his kids are travelling on foot, they encounter a tripod ripping people out of their homes. It was a late cut and so all the VFX by ILM had been completed. There’s a few pictures of it So why not include it on the dvd/blu ray?\nAnyway what are some other unreleased deleted scenes you would love to see?",
        "upvotes": 32,
        "comments": 76,
        "media": null,
        "permalink": "/r/movies/comments/1ivui0p/what_are_some_legendary_deleted_scenes_that_have/"
    },
    {
        "id": "1ivnvv2",
        "author": "fartatwork",
        "title": "What movie made you want to start working out?",
        "content": "I feel like a lot of people have a specific movie where the actor looks so in shape that it inspires you to start working out. For me I remember seeing Brad Pitt in Fight Club and thinking “Holy shit, that’s my goal” \nMore recently it was Jake Gyllenhaal in both Southpaw or Roadhouse. \n\nWhat movie made you feel this way?",
        "upvotes": 69,
        "comments": 260,
        "media": null,
        "permalink": "/r/movies/comments/1ivnvv2/what_movie_made_you_want_to_start_working_out/"
    },
    {
        "id": "1iv5x61",
        "author": "MarvelsGrantMan136",
        "title": "Tom Holland's 'Spider-Man 4' Delayed a Week to July 31, 2026",
        "content": "",
        "upvotes": 1655,
        "comments": 186,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0YuxiZRtfNYD0sCS_tujMVVI-g9iYdCB2penxvzS5gc.jpg?auto=webp&amp;s=a1490aebc0843a027636815cfa3febf6b949d8b5"
        },
        "permalink": "/r/movies/comments/1iv5x61/tom_hollands_spiderman_4_delayed_a_week_to_july/"
    },
    {
        "id": "1ivuu0s",
        "author": "Xruptor",
        "title": "sci-fi movie about terraformers leaving colony to find power and what happened to a colony that went silent?",
        "content": "I vaguely remember this movie about a terraforming colony (on a pretty forested planet) that loses power and some members go in search of restoring power by following these huge power line poles left by the original colony constructors.  They also want to know what happened to an old colony that went silent.  Only to find out some are still living there but were attacked.  As they follow the power lines they are being hunted by aliens (or people can't remember).  They come across this HUGE (human if I recall) derelict crashed ship  (near the power lines) and end up restoring the power (while fighting off aliens or those hunting them) through the ship to those lines to give power back to the colonies.  It takes place on another planet and it was a fairly recent movie.  I remember the town being pretty run down too.  Then again I could be going crazy and remembering this wrong.\n\nNo it's not Aliens, Prospect or The Colony ;)",
        "upvotes": 29,
        "comments": 38,
        "media": null,
        "permalink": "/r/movies/comments/1ivuu0s/scifi_movie_about_terraformers_leaving_colony_to/"
    },
    {
        "id": "1ivqh9v",
        "author": "BunyipPouch",
        "title": "Berlin Film Festival Winners: ‘Dreams (Sex Love)’ Wins Golden Bear for Best Film, Andrew Scott (Richard Linklater's 'Blue Moon') &amp; Rose Byrne (A24's 'If I Had Legs I’d Kick You) Take Acting Honors",
        "content": "",
        "upvotes": 30,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QJGwNkjZxxjr5ZoNPUvYY3LAyziQV5wz0vXb1SKqkq0.jpg?auto=webp&amp;s=e2e7bbb14a524a384b08908e4e28018c929a285a"
        },
        "permalink": "/r/movies/comments/1ivqh9v/berlin_film_festival_winners_dreams_sex_love_wins/"
    },
    {
        "id": "1iuqnxv",
        "author": "Robemilak",
        "title": "Nicole Kidman Worked With 19 Women Directors in Eight Years",
        "content": "",
        "upvotes": 9652,
        "comments": 569,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ncKi0eEpaFRjCm8K5enXQFaHT1yrQVsSuWzKvOgN7Kc.jpg?auto=webp&amp;s=945d11b4c7e41cee47a10e1e21e610c5ba3e818e"
        },
        "permalink": "/r/movies/comments/1iuqnxv/nicole_kidman_worked_with_19_women_directors_in/"
    },
    {
        "id": "1iv0ftu",
        "author": "cmaia1503",
        "title": "Groping Allegations Against Director Of Trump Film ‘The Apprentice’ Leads To Ali Abbasi Breakup With CAA, Entertainment 360 &amp; Law Firm",
        "content": "",
        "upvotes": 2133,
        "comments": 79,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-YqqskiiYkJ9YxUwrzEjIutQ_0FyTSms0lJzRb-VB7w.jpg?auto=webp&amp;s=413504c9f4b0284d1c5e165f7fa564c10cfecb79"
        },
        "permalink": "/r/movies/comments/1iv0ftu/groping_allegations_against_director_of_trump/"
    },
    {
        "id": "1ivya35",
        "author": "Apprehensive_Bee_175",
        "title": "The Crow (1994)",
        "content": "I just finished watching The Crow as it had been in my recommended for a few days now. As usual, within 10 mins of the movie I’m googling the cast and find out the actor died a year before the movie. The name still doesn’t tell me anything. Then i find out it’s Bruce Lee’s son. I remember ever reading about how he was killed by a prop gun wound a while back. Now when I’m done with the movie, i find he was killed during the shooting of that same movie. I am honestly so sad and can’t stop thinking about it. I’m reading a lot of stuff about that now and going down that rabbit hole. It was honestly a great movie, i loved it! Sadly very unfortunate. ",
        "upvotes": 8,
        "comments": 15,
        "media": null,
        "permalink": "/r/movies/comments/1ivya35/the_crow_1994/"
    },
    {
        "id": "1iv1y37",
        "author": "themaddogmax",
        "title": "‘Phantasm’ Star Reggie Bannister Enters Hospice Care; Fans Can Send Cards &amp; Letters to This Address",
        "content": "",
        "upvotes": 657,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/x_CqgpgxjE08Zas7f12W-ip7akxFFnLuVIA3H8-2aWE.jpg?auto=webp&amp;s=860f46113af5ded0dd695db473359b715044e5c9"
        },
        "permalink": "/r/movies/comments/1iv1y37/phantasm_star_reggie_bannister_enters_hospice/"
    },
    {
        "id": "1iuwc27",
        "author": "NoCulture3505",
        "title": "Delroy Lindo Joins Newest ‘Godzilla x Kong’ Movie",
        "content": "",
        "upvotes": 1103,
        "comments": 130,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8nFH2OSjLdXDFqd_OYCIWPS1lQ3CrKIKNcsC_suc49o.jpg?auto=webp&amp;s=35270a8eac8a716ba88b5f72ea28abe2781e3113"
        },
        "permalink": "/r/movies/comments/1iuwc27/delroy_lindo_joins_newest_godzilla_x_kong_movie/"
    },
    {
        "id": "1ivtcjh",
        "author": "ididntwantsalmon19",
        "title": "Are there any movies where the main characters don't have a falling out with each other?",
        "content": "To me it feels like almost every single movie we have the main characters, no matter how good of friends they are, at some point will have a conflict and get mad at each other for a certain period of time.\n\nAre there any movies where the main characters remain buddy buddy throughout, always having each other's backs?",
        "upvotes": 9,
        "comments": 64,
        "media": null,
        "permalink": "/r/movies/comments/1ivtcjh/are_there_any_movies_where_the_main_characters/"
    },
    {
        "id": "1iuwixd",
        "author": "MarvelsGrantMan136",
        "title": "DC’s ‘Clayface’ Lands ‘Speak No Evil’ Director James Watkins",
        "content": "",
        "upvotes": 891,
        "comments": 124,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EPMlIhZVnHbrhoWtVZQ0jh_RRTFiuYe4zNA3-xyAS30.jpg?auto=webp&amp;s=6499db8918dba4ac928d958cb413ea23453f8ad3"
        },
        "permalink": "/r/movies/comments/1iuwixd/dcs_clayface_lands_speak_no_evil_director_james/"
    },
    {
        "id": "1ivf8i9",
        "author": "Danielnrg",
        "title": "How do you feel about Bridge To Terabithia? It just about destroys me every time I watch it.",
        "content": "I think it's a good adaptation, all things considered. \n\nI mean, the point of the book was to make little kids cry, right? It's still making me cry 18 years later, so mission accomplished. Extra credit, as a matter of fact. \n\nThere's not much Bridge To Terabithia and Uncut Gems have in common, but they both make me question my willpower prior to watching them. And I'm never adequately prepared for either of them.",
        "upvotes": 27,
        "comments": 64,
        "media": null,
        "permalink": "/r/movies/comments/1ivf8i9/how_do_you_feel_about_bridge_to_terabithia_it/"
    },
    {
        "id": "1iuqls3",
        "author": "kabronski",
        "title": "Ever Watched a Movie on a Whim and Got Blown Away?",
        "content": "On two separate occasions, I found myself with unexpected free time while at the mall. With no prior knowledge—no trailers, no synopsis, not even having heard the titles before—I randomly picked a movie playing at the cinema just to pass the time. Both times, I walked in completely blind and ended up having an absolute blast!\n\n*Law Abiding Citizen*\n\n*John Wick*\n\n\n\nAnother time, a friend recommended *The Man from Earth*. I knew nothing about it going in, but the storytelling was so gripping that it became one of my most memorable movie experiences.\n\nHave you ever gone into a movie knowing absolutely nothing and walked out amazed? Share your stories!",
        "upvotes": 1178,
        "comments": 2412,
        "media": null,
        "permalink": "/r/movies/comments/1iuqls3/ever_watched_a_movie_on_a_whim_and_got_blown_away/"
    },
    {
        "id": "1iut7ml",
        "author": "indiewire",
        "title": "James Bond's Future: What Broccoli and Wilson's Departure Means",
        "content": "",
        "upvotes": 620,
        "comments": 328,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3_73PjimHnaBHGk9Wl1RAAamQuQPnyv8G8bI9vbezrQ.jpg?auto=webp&amp;s=a34b0dcd365b17df94b281eb6e4918b5d1ce593a"
        },
        "permalink": "/r/movies/comments/1iut7ml/james_bonds_future_what_broccoli_and_wilsons/"
    },
    {
        "id": "1ivys39",
        "author": "Every-Effective-6376",
        "title": "What is the title of this movie? I saw a movie on TV in the 1990s, but I can only vividly remember what happened in the movie.",
        "content": "I saw what I THINK was the intro scene to a movie, but I don't know for sure if it was the intro scene.\n\nIt might have just been introducing the villain.\n\nThe characters are caucasian, and I think the movie was filmed in the 1990s...possibly the late 1980s.\n\nThe setting is present day, in a big city. New York City or Los Angeles are best bets.\n\nThe scene:  &gt;!A tall, muscular man is walking alone at night. A pretty, young woman with curly, red-hair and a sparkling green dress walks up to him and asks \"Want a date?\" The next scene, the very next scene is the guy wiping his sweaty brow with her bloodied dress. It's heavily implied that he killed her off screen.!&lt;\n\nI'm assuming this is the introductory scene to the villain of the movie.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1ivys39/what_is_the_title_of_this_movie_i_saw_a_movie_on/"
    },
    {
        "id": "1iufdiy",
        "author": "Odd-Expert-7156",
        "title": "Can someone recommend me a not so popular comedy movie that you personally think is good? Going through a tough time right now and I just need a little laugh.",
        "content": "I've watched a lot of popular and good comedy movies, with my most recent and favorite being superbad. I want someone to recommend me an underrated comedy movie because it will probably be new to me, as long as it isn't in a \"can you recommend me a underrated comedy movie\" article or reddit post, I've probably never seen it before.  \n  \nI'm feeling down right now because my pet kitten (his name was link) recently died in a preventable death due to hypothermia, he was my first ever pet too. I've honestly been skipping school a bit so watching movies will be a nice way to pass time. \n\nI'll probably reply to the comments and just rate the movies you guys suggested me if anyone is even interested in that. Anyways thank you to anyone who reads this and gives me an recommendation, literally means the world to me right now.",
        "upvotes": 6612,
        "comments": 14172,
        "media": null,
        "permalink": "/r/movies/comments/1iufdiy/can_someone_recommend_me_a_not_so_popular_comedy/"
    },
    {
        "id": "1ivxpjq",
        "author": "TimeLordRohan",
        "title": "Should i watch the Kingdom of Heaven directors cut first?",
        "content": "I intend to watch both movies, mostly from a perspective of curiosity at how dramatically the directors cut changed the picture. If i watch the theatrical cut first, i think ill have a greater appreciation of how the directors cut changed the movie, but will have the plotpoints spoiled for my watch of the directors cut. What do you reccomend?",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/movies/comments/1ivxpjq/should_i_watch_the_kingdom_of_heaven_directors/"
    },
    {
        "id": "1iv5kmi",
        "author": "MarcoManatee",
        "title": "What are some of your favorite “shut your brain off” movies?",
        "content": "I feel like there haven’t been many of these that have come out in recent years except for Stavros’ movie Let’s Start a Cult\n\nPre pubescent me LOVED this genre. Sgaolin soccer, Kung pow, nacho libre, Napoleon dynamite, etc. What are some of your favorite so-stupid-that-this-shouldn’t-work-but-it-does movies?",
        "upvotes": 93,
        "comments": 338,
        "media": null,
        "permalink": "/r/movies/comments/1iv5kmi/what_are_some_of_your_favorite_shut_your_brain/"
    }
]