[
    {
        "id": "1jyv6sq",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 40,
        "comments": 3010,
        "media": null,
        "permalink": "/r/realmadrid/comments/1jyv6sq/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1k0vj3d",
        "author": "scoreboard-app",
        "title": "[Post Match Thread] Real Madrid vs Arsenal, UCL round of 8 leg 2",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1k0vj3d)",
        "upvotes": 115,
        "comments": 1318,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k0vj3d/post_match_thread_real_madrid_vs_arsenal_ucl/"
    },
    {
        "id": "1k14qyc",
        "author": "Ready_Ad_1353",
        "title": "Courtois: \"We put in a lot of crosses but this year we don't have a Joselu, a born striker up there. Sometimes you have to be self-critical. I feel that we have to make more team plays and not all individual, if they double-mark Vini or Kylian, a 1 vs. 2 maybe succeds out once but, not five times\".",
        "content": "Courtois: In the end, when they give you a penalty, if you save it, you keep believing. At the beginning, we created some danger, the fans pushed us, but Arsenal is a team that defends well, they're organized, the wingers and the striker come back... At halftime, we felt that if we scored the first goal, the tie would be open. In the end, they found the first goal, we tied it quickly. You keep believing, but we weren't successful up front. I don't think Raya had to make a single great save. We lost against a superior Arsenal team and we have to accept that.\" Shortly afterward, in the mixed zone, he tried to clarify his thoughts: \"We can't always expect the four up front to dribble past three players and score a great goal. As a team, we have to attack and defend better . \"",
        "upvotes": 355,
        "comments": 80,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k14qyc/courtois_we_put_in_a_lot_of_crosses_but_this_year/"
    },
    {
        "id": "1k0zjql",
        "author": "Ready_Ad_1353",
        "title": "Ancelotti: \"Arsenal deserved to go through and I hope the best for them... No excuses, in both games they were better. It can happen in football. We are upset of course. We had a lot of epic moments in the past and tonight we have to manage the setback.\"",
        "content": "",
        "upvotes": 828,
        "comments": 129,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/lsphygiweave1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k0zjql/ancelotti_arsenal_deserved_to_go_through_and_i/"
    },
    {
        "id": "1k17w56",
        "author": "KabiX2",
        "title": "\"I know I gave you only a few minutes this season, but...\"",
        "content": "",
        "upvotes": 124,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8dq2f9xjwcve1.jpeg?auto=webp&amp;s=dfa3ef75250fa33e9bff400cc0ebfe6a105159be"
        },
        "permalink": "/r/realmadrid/comments/1k17w56/i_know_i_gave_you_only_a_few_minutes_this_season/"
    },
    {
        "id": "1k0u4og",
        "author": "Constant_Aspect_6632",
        "title": "Dani Carvajal and Saka had words at the end of the half.",
        "content": "",
        "upvotes": 1006,
        "comments": 186,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7z2687ey79ve1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k0u4og/dani_carvajal_and_saka_had_words_at_the_end_of/"
    },
    {
        "id": "1k0yj7b",
        "author": "TestProfessional6716",
        "title": "\"Our front line should be destroying Europe\" is a stupid take",
        "content": "Tough defeat today, but I see this a lot in the threads :\n\n\"We have 3 nuclear weapons in the front and we don't know how to use them, it's coach's fault\"\n\nStupid take. That would be the case if you're playing FIFA on PS5. What you have is 3 fast right footed midgets, with brute force players in the midfield without a single one with decent build up quality to link defense and offense, and in the back, you have literally no fullbacks !\n\nThe front 3 is attractive, but not balanced ! Perez ruined a very good squad by buying a player we didn't fucking need and NOT replace 4 key players :\n\n1. Joselu, a tall cunt that wins most of his aerial duals and is always a threat in crosses. He was a downgrade of Benzema but thank god we had him to mix up our offense last season and he was VERY important !\n2. Kroos, a midfielder who has guaranteed &gt;90% pass accuracy,\n3. Nacho, a player who plays all positions in the defense\n4. Carvajal, our ONLY RB since 2014\n\nWatch the board buy another Brazilian midget by the end of the season !\n\nXabi Alonso, Klopp, Guardiola, Mourinho, none of them, separated or combined in any fucking way, will achieve shit with this squad either ! Easy to call out 'Carlo has no tactics' but you don't win chess games on high level with 6 bishops instead of the other pieces ! You need 2 Bishops, 2 Knights and 2 towers !\n\nCould Ancelotti have managed this season better ? Yes. Is he fully to blame ? Absolutely not and don't forget to shit on the board before shitting on the coach. Man asked for Harry Kane but got a CAM Bellingham so he switched the entire formation to fit him for a false 9 and it worked thanks to Vini wonder season.. So Perez decided to do this every fucking time because the next Brazilian midget he will buy will play as a left back because the board is to lazy to splash cash on an ACTUAL LB.\n\nY'all realize we have been playing for most of the season with 2 defenders in the 4 backline ? Tchou moved to CB and LV as RB are not their positions, Ancelotti's fuck up is not playing Asencio earlier, but it's sad to watch Alaba being average, then Fran comes in and he is just worse, together with Mendy's performances in this season. I don't need to talk about LV.\n\n3 Lewandowskis in the front won't work ! 3 Harry Kanes won't work ! 3 Sakas won't ! 3 Viniciuses won't work ! You need an actual number 9, an actual RW and an actual LW, but instead we have 3 LWs and people are like 'Any coach will destroy Europe with MVR' because they do in career mode on their PS5.\n\nWe can't win the UCL every season. Congratulations to Arsenal. Hala Madrid !",
        "upvotes": 543,
        "comments": 207,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k0yj7b/our_front_line_should_be_destroying_europe_is_a/"
    },
    {
        "id": "1k0qzjo",
        "author": "Equivalent_Hawk_6602",
        "title": "Scenes outside Santiago Bernabéu",
        "content": "",
        "upvotes": 1314,
        "comments": 51,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/nr12sr1yk8ve1.jpeg?auto=webp&amp;s=93da6c9de9e15173da1a30ebb82b95feb7d8220c"
        },
        "permalink": "/r/realmadrid/comments/1k0qzjo/scenes_outside_santiago_bernabéu/"
    },
    {
        "id": "1k0su89",
        "author": "Constant_Aspect_6632",
        "title": "Courtois 🧱 saves the penalty",
        "content": "",
        "upvotes": 842,
        "comments": 50,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2at2ip3gy8ve1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k0su89/courtois_saves_the_penalty/"
    },
    {
        "id": "1k102aa",
        "author": "Danickcoolman",
        "title": "Football is played on the pitch, not on social media.",
        "content": "I’ve said it multiple times and I’m going to say it again: Carlo needs to leave. He needs to leave because a legendary manager cannot continue to tarnish his legacy by what was being displayed by his players and by himself. Today, 7 out of 42 crosses were successful, Vazquez was seemingly one of our best players and the attitude of some players that are supposed to be leaders was downright embarrassing. Just like the title says, you play on the pitch, not on social media. \n\nThis is a lesson for the Instagram warriors that are our players and the admin of the club’s account. For an entire week, we’ve heard them say “Remontada this, remontada that” or “we’re going to comeback” or even “remontada has been the most used word in the dressing room” when a remontada DOESN’T come out of thin air. 3-0 against Wolfsburg was thanks to a brilliant Cristiano Ronaldo, 3-1 against City in 2022 was thanks to a brilliant Rodrygo, Courtois and Benzema and etc. Do you guys see a pattern here? Every remontada has been thanks to players trying their hardest because they believe that they can do it and that they don’t need to talk on social media to play their football. But what about today? We had:\n\n- Rodrygo Silva de Goes who has been invisible, yet AGAIN. His last goal being against Atletico back in march. “Only idiots forget the R”. I know that he’s playing out of position, but Raphinha has been playing out of position since the beginning of the season and is at 50 G/A+. Great players should always perform even if they play out of position.\n\n- Kylian Mbappé Lottin who wants to play as a central midfielder instead of making runs in behind. “Adaptation period is over: I’m going to be the one deciding matches now”\n\n- Vinicius José Paixao de Oliveira Junior who, despite being the best out of the three tonight, has been seen hugging the touch line too much instead of exploiting the space centrally when Mbappe wasn’t there and playing with Alaba when he was overlapping in the first leg. “I’m going to do it 10x more, they are not ready.”\n\nWhat I hate the most in football are people who like to talk days before the actual game. We put out a disastrous performance in the first leg and you would think that the players and the coaching staff would learn from their mistakes and prepare at least **something** against Arsenal, am I right? I can understand that we’re playing against the best defence in the Premier League, but this doesn’t excuse the lack of solutions from Ancelotti. I mean, Courtois said in an interview that the players are doing what Ancelotti is telling them to do, they want to respect his wishes. Spamming crosses to nobody in the box or refusing to play out from the back isn’t how you’re going to win matches. Time and time again in today’s match, long balls were being spammed when we know that our front three has no aerial threat, so why are we doing that? And don’t get me started on David Alaba. He never should’ve started at LB.\n\nPutting the blame on the coach and the players is unfair, right? So, how about we talk about the so called “ruthless president” that is Perez and the idiots that run our board? It’s maddening how Perez thought that adding another left winger to a team that already has two was a great idea. Don’t get me wrong, Mbappé is a fantastic player, but he sure as hell **WASN’T** the player that Madrid needed. \n\nEveryone, Madridistas and neutrals, could see that Madrid needed a REAL number 9 to finally have the aerial threat that they had been lacking ever since Benzema left the club. Vini’s best season has been when he had a number 9 to rely on so what does Perez do after seeing that we need a number 9 and that Joselu has been a fantastic player when it comes to aerial threat despite being on loan? He buys another left winger because Galactico! The result is a disjointed attack with three guys that want to play on the left, leaving 34 years old Lucas Vazquez essentially playing as the RW and Valverde running from defence to attack just to cover the gaps left by Vazquez. But hey, the board is there to help, right? Of course not. We have bums that consider Eder Militao, 2 ACL injuries in two years by the way, the “signing” of next season. Bums who clearly see that we desperately need fullbacks but chose to renew Vazquez. Clueless idiots who will come out on an interview and say “we won two champions league, so everything will be okay” when we are getting outplayed by every big team either at home or away. When will this circus end? When will these human beings finally acknowledge that our squad depth is embarrassing and that spending 50 millions on Dean Huijsen who has been fantastic for Bournemouth and Spain isn’t something to be ashamed of? Is the club just a joke for them? I speak for every Madridista when I say that we love this club with passion and that we will continue supporting Real Madrid no matter what happens, but we are not idiots. We can see that the club is not going well and it is **INFURIATING** to see the people in power not doing a single thing to help this cause. Real Madrid is the greatest club in the world and a club with such a title should not be allowed to be so immature when it comes to transfers or squad depth. The board and Perez are supposed to be helping the manager with signings, so why aren’t they doing it?",
        "upvotes": 226,
        "comments": 67,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k102aa/football_is_played_on_the_pitch_not_on_social/"
    },
    {
        "id": "1k0qmg4",
        "author": "Bexewa",
        "title": "You all ready for tonight?",
        "content": "",
        "upvotes": 738,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/payas4zdi8ve1.jpeg?auto=webp&amp;s=0b59a87f84d003fdc893742420de48010c1900e3"
        },
        "permalink": "/r/realmadrid/comments/1k0qmg4/you_all_ready_for_tonight/"
    },
    {
        "id": "1k12ev9",
        "author": "LengthJunior9132",
        "title": "Fullbacks are the most underrated positions in modern football.",
        "content": "After watching almost every single game of this Madrid team, I am starting to appreciate good fullbacks. They are the ones who connect attack and defence, they does playmaking, should have incredible stamina and speed. Defend against wingers who are the most skilled players in a team. And then I look at our team's fullbacks....\nYes all the other players didn't play that well. But look at how other fullbacks just carry the ball, especially players like Nuno Mendes and Hakimi. These players even show up when their strikers are doing bad. \nNow at Madrid, we can see the CBs just passing the ball to each other. The fullbacks doesn't even care about dropping deep and collecting the balls sometimes. ",
        "upvotes": 80,
        "comments": 30,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k12ev9/fullbacks_are_the_most_underrated_positions_in/"
    },
    {
        "id": "1k0m66r",
        "author": "monerfinder",
        "title": "I’ve created a Real Madrid Pendant for the “Remontada”!!",
        "content": "Hello dear Madridistas!\n\nI made myself a Real Madrid Pendant with my 3D Printer and I want to share it with you. I made it as a charm to bring if possible some luck to our boys today!\n\nI made the 3D model myself and I posted in Makerworld for any of you that wants to print it for yourself 😊. I will post the link to the model in the comments.\n\nI wish you a really nice game day and I hope that we can manage to pass today 💪💪!!\n\nHala Madrid!!",
        "upvotes": 571,
        "comments": 63,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k0m66r/ive_created_a_real_madrid_pendant_for_the/"
    },
    {
        "id": "1k0qzfh",
        "author": "Charybd1ss",
        "title": "Real Madrid have arrived",
        "content": "",
        "upvotes": 305,
        "comments": 14,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/i9ytr0qsk8ve1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k0qzfh/real_madrid_have_arrived/"
    },
    {
        "id": "1k1893h",
        "author": "fig966",
        "title": "Brace yourselves Arda Guler posts incoming",
        "content": "",
        "upvotes": 17,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/78r5vwdc1dve1.png?auto=webp&amp;s=e685439ebf26a726f5dce91686494fded8f67c9b"
        },
        "permalink": "/r/realmadrid/comments/1k1893h/brace_yourselves_arda_guler_posts_incoming/"
    },
    {
        "id": "1k0ti67",
        "author": "Short_Mousse_6812",
        "title": "Dumb hate against Madrid",
        "content": "Everyone complains about Madrid “robbing” or paying referees. But it is funny how they ignore when Madrid is done wrong by refereeing. Arsenal today wasn’t penalty, same as ours probably wasn’t in my own opinion. However everyone focuses on Madrid. If the penalty is given against Madrid then it is, “ cry Madrid you will lose”, but if it is in favor of Madrid then it is robbery. It is like being the best club makes people cry out since they have no other way of matching its greatness. ",
        "upvotes": 135,
        "comments": 134,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k0ti67/dumb_hate_against_madrid/"
    },
    {
        "id": "1k17nvw",
        "author": "busyblckboy",
        "title": "Vini plays better with Endrick than mbappe",
        "content": "Vini's game might actually synergize more effectively with Endrick. Perhaps Endrick's movement and willingness to occupy different spaces unlocks a different dimension for Vini, allowing him more freedom or creating unique attacking angles we haven't fully explored with Mbappé. What are your initial thoughts on this? Are we seeing a more natural understanding develop between Vini and Endrick, or is the established quality of the Vini-Mbappé duo still the superior combination? Let's hear your tactical breakdowns, observations, and any predictions for how these partnerships might evolve.\n\nMy evidence is when edrick came on vini was finding him with his crosses spot on. Endrick was just physically bullied and didn't convert. \n\n\nFull disclosure I actually think mbappe was horrendous. I liked him at first but after this season I'm not impressed in the least. ",
        "upvotes": 13,
        "comments": 27,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k17nvw/vini_plays_better_with_endrick_than_mbappe/"
    },
    {
        "id": "1k16zq5",
        "author": "Glitching_In_Void",
        "title": "Football isn't only about individual talents; Criticism isn’t disrespect",
        "content": "If football were only depends on individual talents, it wouldn’t have a managerial role. A manager can make an average player squad play good and win trophies. \n\nOur forwards have zero chemistry so far. Vini &amp; Mbappe hasn’t figured out how to play together, V-M-R isn’t working for so long, yet starting same format every match making same mistakes. \n\nWhen we say Ancelotti should leave, theres so many fans shouting about how he give us everything, how he is a legend. Those emotional fanbase don't understand that sacking or leaving is super normal in football. Managers come &amp; go, they have their limit and form. Carlo is a legend to me, he is just not working anymore with our squad. Most importantly we need changes, we need ideas to use those best in the world players to play together.\n\nWe’ve waited entire season, nothing changed, we got humiliated instead. We often say we don't have Kroos, Carvajal,  Nacho etc. Then what we have currently?  Do we have worst players in madrid then? I don’t think so, we need someone who can figured things out with current squad, who can try, who can give full potential to Arda Endrick &amp; rest of the team. \n\nWE DIDN’T LOSE, WE GOT HUMILIATED, so many time. We need an end to this. Also as a brazil fan, I want Carlo to go to Brazil. He deserve criticism for this season, which isn’t disrespect at all.\n\nHala madrid.",
        "upvotes": 14,
        "comments": 18,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k16zq5/football_isnt_only_about_individual_talents/"
    },
    {
        "id": "1k0hnzs",
        "author": "RogueHaven",
        "title": "It’s game day, people!",
        "content": "m",
        "upvotes": 595,
        "comments": 51,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/puo20gkgi6ve1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k0hnzs/its_game_day_people/"
    },
    {
        "id": "1k0pza8",
        "author": "xdjocko",
        "title": "Can we say Fran Garcia is done at Madrid?",
        "content": "Being the substitute for Mendy, one would think he would start in case Mendy is injured or unavailable.\n\nAncelotti has shown time and time again that he has no trust in Fran. Every big game there are talks that Fran is not trusted enough by Carlo to deal with X opponent. I am sure this takes a hit on Fran's confidence and actual will to play the game.\n\nAfter seeing today's starting eleven, where Alaba is again starting at left-back, can we say that Fran Garcia has no prospects at Real Madrid anymore?",
        "upvotes": 182,
        "comments": 73,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k0pza8/can_we_say_fran_garcia_is_done_at_madrid/"
    },
    {
        "id": "1k15qcr",
        "author": "KjOnReddit1010",
        "title": "Timing of Ancelotti departure and Xabi arrival.",
        "content": "I think majority of us agree that this is ancelotti's last season, but when exactly should he leave ? Tomorrow ? After CDR final ? After league ? After Club World Cup ?\n\nAfter the match Tibo made public comments about how he did not agree with the tactics of just crossing and no team play. Him saying this publicly means that even though players respect Ancelotti, they don't agree with his management anymore. Also when carlo was asked about his future, he said he does not know and that he does not want to know. So deep inside he also knows that its kinda over. At this point everyone knows that he will not be there next season, so I think the atmosphere with Carlo at dugout for the rest of the season could be awkward.\n\nBut the history carlo has with us, it would be awkard to sack him before the end of season. But I don't think Perez would be able to delay sacking much if we get embarrassed against barca in CDR again. Then there is another clasico 2 weeks after CDR, the league will depend on that. The only hope I have in league is barca dropping points around the semifinal with inter because of tired legs. And we winning against them because of the same reason. Its a long shot, but its possible.\n\nSome important dates\n\n* CDR final = 27 April\n* Barcelona Away (league) = 11th May\n* Bundesliga end (Xabi will be free for switch) = 17th May\n* La Liga end = 25th May.\n* Club world cup start = 16th June\n\nI don't think its a good idea at all to have carlo managing us for Club World Cup. The new manager should take over well before that, ideally he should get atleast 1 month before that.\n\nI think the best time for xabi to take over would be no later than 1st June. But it would be weird to have xabi in dugout for the last few games in league. So it can't be before 25th May.\n\nI think ancelotti should stay till CDR final. If we give a respectable fight, he should stay till end of season. If we get embarrassed again, he should leave and we should have an interim manager till 25th May.",
        "upvotes": 16,
        "comments": 38,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k15qcr/timing_of_ancelotti_departure_and_xabi_arrival/"
    },
    {
        "id": "1k0qo38",
        "author": "Onegoofylad",
        "title": "The ritual has begun",
        "content": "",
        "upvotes": 155,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/n1ki38cpi8ve1.jpeg?auto=webp&amp;s=6926773abc769605307f46c4e43088506bd5f96c"
        },
        "permalink": "/r/realmadrid/comments/1k0qo38/the_ritual_has_begun/"
    },
    {
        "id": "1k16ya0",
        "author": "_yoshaaa_",
        "title": "Neither mad nor disappointed",
        "content": "People have a very inaccurate view of what happened today. I saw everyone at 100% the entire game. High intensity, high amounts of pressing, high willingness to win duels. Mbappe was trying. Rodrygo was trying. Asencio was trying, even with the penalty. Alaba was trying. Jude was trying. Courtois sure as fuck was trying.  I saw Lucas and Vinicius, possibly our two worst players in the last 1-2 months, giving it their all, taking on their man, and being aggressive. Yes, Lucas fouled today, but he showed a lot of heart. Nobody “ghosted.” \n\nThe simple fact is that they can try all they want, but with no tactics and no clue what to do, this effort will amount to nothing. \nYou can’t be mad at the players today. And you can’t be disappointed, either. Going into the second leg with a 0-3 deficit, with aforementioned zero tactics, you have the right to believe in a comeback. You have the right to expect a win. But you don’t have the right to, in the case that we lose (which we did), turn around and pretend like we fumbled today.\n\nThe only people you can be mad at are the board and to a reasonable extent Ancelotti. You cannot be mad at our players and you cannot be disappointed by our performance. \n\nThis was not the year sadly, and the signs were there for months. Next year, with Trent, with hopefully another defender, and with a new coach, things will be better.",
        "upvotes": 12,
        "comments": 17,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k16ya0/neither_mad_nor_disappointed/"
    },
    {
        "id": "1k0k53h",
        "author": "skyejedi27",
        "title": "Tonight’s TIFO. Chessboard with City and Atleti knocked down, taking Arsenal. PERFECTION 😍",
        "content": "",
        "upvotes": 300,
        "comments": 47,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k0k53h/tonights_tifo_chessboard_with_city_and_atleti/"
    },
    {
        "id": "1k14l83",
        "author": "kurumi-2508",
        "title": "Opinions about match last night.",
        "content": "I want to know your opinion/thoughts about the match last night. \n\nMy opinion is we are not playing as a team.\nPoor defence \nPoor finishing by attackers\nMidfield not performing up to the mark.\n\nWe overhyped the team saying Remontada since the very next day on the 1st leg, just to cover the embarrassment of losing 3-0.\n\nVini jr. and Mbappé want to be the Cristiano Ronaldo of the team, sadly one has to be Benzema and there can never be another Ronaldo in the team. \n\nI believe Endrick had more shots on target than both mbappe and Vini.\n\nYes, Vini scored a goal. It doesn't change the fact that he played poor. \n\nPoor tactics and poor decision making by Ancelotti.\nWhat kind of lineup was that? \nStarting Alaba and LV? \n\nDespite the criticism on LV, he had us some good crosses but sadly we got 3LW's, that are playing as ST and RW, so no headers.\n\nAlaba (Alibaba) was utterly useless. \nJude was mid\nVini was bad as well as mbappe and rodrygo \nTchouameni looked good but shifting him to CB after subbing off Asencio made him look bad.\nCeballos looked decent so did Valverde\nCourtois performed well in the previous game but couldn't do it in this one. \nUnnecessary fouls committed by rudiger and asencio.\nOverall rating last night on performance was 2/10\n\nI am not a glory hunter, but this is just my way of telling my opinion since we are not playing as a team, individual gameplay, unsportsmanship conduct. \n\nWe chose to speak on social media and Arsenal chose to speak on the pitch, deserved. \n\nWe were only talking on social media, none of the players lived up to their words. \n\nYou are free to tell your opinion, can be anything. ",
        "upvotes": 16,
        "comments": 54,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k14l83/opinions_about_match_last_night/"
    },
    {
        "id": "1k0gzjd",
        "author": "Yenoon",
        "title": "My Legend, it’s today or never.",
        "content": "",
        "upvotes": 491,
        "comments": 40,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k0gzjd/my_legend_its_today_or_never/"
    },
    {
        "id": "1k0rgbk",
        "author": "Okforealtho",
        "title": "Those script writers sure know how to put on a show",
        "content": "#stolen",
        "upvotes": 109,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/geasa8nbo8ve1.jpeg?auto=webp&amp;s=5c262c54cc7b8929b53f79cfdda4e8cc018d6daa"
        },
        "permalink": "/r/realmadrid/comments/1k0rgbk/those_script_writers_sure_know_how_to_put_on_a/"
    },
    {
        "id": "1k0pl1a",
        "author": "basilkurian247",
        "title": "📋✅ Our Starting 𝗫𝗜 🆚 Arsenal",
        "content": "",
        "upvotes": 132,
        "comments": 394,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dh8N8483MV08bSPfMCHXGRESZOvBxM4X96YKPKPwM48.jpg?auto=webp&amp;s=09dcdf3ff395da9e4785fad01a7d47497147849f"
        },
        "permalink": "/r/realmadrid/comments/1k0pl1a/our_starting_𝗫𝗜_arsenal/"
    },
    {
        "id": "1k17m1o",
        "author": "Emergency-Hornet-594",
        "title": "Fabrizio Romano om Facebook: Mikel Arteta: “Carlo Ancelotti told me that he HOPES Arsenal win the Champions League!”.",
        "content": "All the best to Arsenal and Barca. ",
        "upvotes": 8,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/r1BHvoeoC_ZHm4AzOs0V29ozN7wVp52seaPby_usV2A.jpg?auto=webp&amp;s=5b47573d5e6c8781034fffdb3dbb8081a5063f03"
        },
        "permalink": "/r/realmadrid/comments/1k17m1o/fabrizio_romano_om_facebook_mikel_arteta_carlo/"
    },
    {
        "id": "1k0qywn",
        "author": "scoreboard-app",
        "title": "Match Thread: Real Madrid vs Arsenal FC Live Score | UEFA Champions League | Apr 16, 2025",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1k0qywn)",
        "upvotes": 104,
        "comments": 9094,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k0qywn/match_thread_real_madrid_vs_arsenal_fc_live_score/"
    },
    {
        "id": "1k0txkg",
        "author": "MHBosteer12",
        "title": "UEFA explains why penalty awarded to Real Madrid vs Arsenal was overturned after VAR review",
        "content": "",
        "upvotes": 63,
        "comments": 66,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/L_YQkuqGjMZrJn_88o8cxY7SiFUe82s2sHiOtOjBwFk.jpg?auto=webp&amp;s=62c5f79f32499708fa0265e15f889ef560976ac9"
        },
        "permalink": "/r/realmadrid/comments/1k0txkg/uefa_explains_why_penalty_awarded_to_real_madrid/"
    },
    {
        "id": "1k17yoe",
        "author": "ReplacementUnited740",
        "title": "Lack of player movement",
        "content": "I don't know why it's changed so much this year, but now players don't do anything when we're around the opposing defense. \nVinicius and Mbappe ask for the ball while standing still (they are the fastest players in the world, it's stupid)The midfielders never try to get out in front to receive the ball (except for Ceballos and Modric)It's just a totally crazy situation, players are thinking that staying still can seriously work.The absolute lack of character of many players is insane,With the exception of Rudiger valverde vasquez Ascensio and Bellingham few players have not the Real Madrid character (I don't know if the  translation is correct, but in my language, having character = refusing defeat)\nOur striker had the mentality of \"I can make the difference alone, I can save the team\" more than the character that refuses defeat. \nOur substitutes have more character than many of the starters, especially in midfield, the midfielders don't break any lines, they do what everyone criticized Tchouameni for. \nOf course I'm only talking about character in attack, the mentality in defense was very Madridista\nMaybe it's Carlos's fault, but the fact that Ceballos stands out naturally makes me wonder about the midfield. \n\n",
        "upvotes": 5,
        "comments": 17,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k17yoe/lack_of_player_movement/"
    }
]