[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 38,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 11,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1px7c2n",
        "author": "Tricky-Bat-2638",
        "title": "Anyone else Disappointed with season 5 of stranger things?",
        "content": "Finding it a little disappointing considering how amazing the first 4 seasons were. \n\nDustin’s character is starting to really grate on me and will has spend most of seasons 1-5 sleeping. Joyce’s voice has just got more irritating as the seasons have gone on. \n\nAnd Millie Bobby brows face barely moves. I’m not judging her for having work done to her face but I do feel like there should be rules in long term series about having a large amount of plastic surgery. Her top lip is huge and barely moves and there’s  minimal expression on her face due to Botox. Some dramatic scenes are ruined from the lack of movement &amp; expression in her face.\n\nOverall I’m a little disappointed",
        "upvotes": 466,
        "comments": 286,
        "media": null,
        "permalink": "/r/netflix/comments/1px7c2n/anyone_else_disappointed_with_season_5_of/"
    },
    {
        "id": "1pwqjqs",
        "author": "justameesa",
        "title": "Stranger Things might crash as hard as GOT",
        "content": "The writing is not doing any favors to the plot or the characters. At this point of time listing things from the 80s is the only \"appeal\" to this nostalgia driven show.\n\nD&amp;D curse much? ( Duffer and Duffer)",
        "upvotes": 1549,
        "comments": 870,
        "media": null,
        "permalink": "/r/netflix/comments/1pwqjqs/stranger_things_might_crash_as_hard_as_got/"
    },
    {
        "id": "1px8qwn",
        "author": "stroh_1002",
        "title": "Sadie Sink on her Stranger Things hair for season five: 'You have all this stuff in your cave, and you couldn’t find a hair tie or a hairbrush? It was a huge jump scare when I was watching the season for the first time'",
        "content": "",
        "upvotes": 48,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1px8qwn/sadie_sink_on_her_stranger_things_hair_for_season/"
    },
    {
        "id": "1pwzt7w",
        "author": "TurnipYadaYada6941",
        "title": "The new Netflix UI is atrocious!",
        "content": "Which idiot put the top level menu at the top, where you cannot reach it without scroll for eternity!\n\n  \nDid the same idiot make it impossible to filter films by genre easily?\n\nis there any way to get Netflix to provide a usable II?",
        "upvotes": 140,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1pwzt7w/the_new_netflix_ui_is_atrocious/"
    },
    {
        "id": "1pwtmvv",
        "author": "Normal_Comfort_5847",
        "title": "So we’re just supposed to know Stranger Things lore from a stage play (The First Shadow) now?",
        "content": "I get that Stranger Things: The First Shadow (Broadway / West End) is meant to deepen the lore, but honestly it feels like it introduces major information that should not be locked behind a stage play that most fans will never see.\n\nThere are things in the show that already felt like loose threads, and now it turns out they are “explained” in the play:\n\n1. Henry’s cave memory in Season 5, where he’s clearly interacting with / absorbing Mind Flayer-like particles. In the show, this is presented as something mysterious and significant… but never really followed up on in a satisfying way. Apparently the play adds context, but the series itself doesn’t.\n\n2. The Oklahoma poster in Max’s hand during one of Henry’s memories strongly suggests Joyce, Hopper, and Henry all went to school together. That’s a huge implication; yet across four seasons, Joyce and Hop never say a single word about knowing Henry Creel? Not even a hint?\n\n3. Henry’s early connection to the Upside Down, Brenner’s involvement, and the timeline of how everything starts are apparently much clearer in the play but on screen, it still feels incomplete or oddly rushed.\n\nThe problem isn’t expanded lore. It’s that the main TV series feels like it’s missing chapters unless you’ve seen a West End/ Broadway show that:\n\nA. isn’t accessible worldwide,\n\nB. isn’t cheap,\n\nC. and won’t be seen by the vast majority of viewers.\n\nAt this point, it feels like they should’ve done a limited prequel season or special between Season 4 and 5 to properly set this up. Relying on a stage production to carry essential canon just makes Season 4 feel retroactively unfinished.\n\nWith only one episode left, I’m worried the finale will have too much ground to cover, and that casual viewers will never even realize why certain things don’t quite add up.\n\nEnd rant. Curious if this bugs anyone else or if I’m just overthinking it. ",
        "upvotes": 312,
        "comments": 108,
        "media": null,
        "permalink": "/r/netflix/comments/1pwtmvv/so_were_just_supposed_to_know_stranger_things/"
    },
    {
        "id": "1pwtfiu",
        "author": "job_hunter101",
        "title": "Any one else hate these batch releases?",
        "content": "Either release it all at once so we can binge it, or release it weekly so people can enjoy discussing it each week. Instead, these batch releases make me hate it entirely. You usually wouldn’t know when these get released and sometimes it’ll be days before you even know it, unless you don’t have any life. \n\nIt’s bad enough as it is with the yearly gaps between each season and to add these batch releases to it just makes my interest go down the drain. ",
        "upvotes": 271,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1pwtfiu/any_one_else_hate_these_batch_releases/"
    },
    {
        "id": "1px72yu",
        "author": "SirLiftsalot0",
        "title": "Anyone else struggling to finish the new Stranger Things season?",
        "content": "I loved Stranger Things earlier, but honestly this season felt more like a task than something I wanted to watch.\nThe pacing was slow, the tension didn’t land, and a lot of the episodes felt stretched without real payoff.\n\nIt wasn’t exactly boring, but it definitely lacked the thrill and “can’t wait for the next episode” feeling the show used to have.\nCurious if I’m alone here or if others felt the same.",
        "upvotes": 25,
        "comments": 98,
        "media": null,
        "permalink": "/r/netflix/comments/1px72yu/anyone_else_struggling_to_finish_the_new_stranger/"
    },
    {
        "id": "1pxe1k7",
        "author": "ReneKiller",
        "title": "What are some good but lesser known shows?",
        "content": "What are some good but lesser known shows on Netflix, preferably with an actual ending or a confirmed continuation?\n\nI've just watched 1899, which I really liked, only to learn that season 1 ends in a massive cliffhanger and of course Netflix cancelled season 2.\n\nI don't really have a genre preference except I'm not really interested in romantic shows.",
        "upvotes": 3,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1pxe1k7/what_are_some_good_but_lesser_known_shows/"
    },
    {
        "id": "1pw29y9",
        "author": "Unlucky_Monitor_9644",
        "title": "Millie Bobby Brown",
        "content": "I’ve watched a lot of TV over the years and I’ve really enjoyed Stranger Things, but I do not understand how people laud MBB for this role. \n\nTo me the acting is as one dimensional as it comes and perhaps it’s the writing, but there doesn’t seem to be anything truly challenging about 11’s character. \n\nThe endless praise for MBB’s portrayal just doesn’t sit right with me. ",
        "upvotes": 2865,
        "comments": 624,
        "media": null,
        "permalink": "/r/netflix/comments/1pw29y9/millie_bobby_brown/"
    },
    {
        "id": "1pwyp4j",
        "author": "Glarms3",
        "title": "Need a long show to binge",
        "content": "I’m looking for a Netflix show with a lot of seasons, something I can stick with for weeks and not run out of episodes fast. I prefer serious shows with a good story, not something super light or random.\n\nI’ve already seen stuff like Breaking Bad and Ozark, and I liked that kind of vibe. Any good long-running shows you’d recommend right now? What kept you hooked for multiple seasons?",
        "upvotes": 18,
        "comments": 100,
        "media": null,
        "permalink": "/r/netflix/comments/1pwyp4j/need_a_long_show_to_binge/"
    },
    {
        "id": "1pxf4t7",
        "author": "birdwardicus",
        "title": "Circe’s Mar-a-Lago face is so distracting in The Abandons.",
        "content": "I’m less than 20 minutes in. Is it worth continuing?\n\nAnd, while we’re at it, Scully looks natural and lovely. If she’s had work done, bravo to whomever did it. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pxf4t7/circes_maralago_face_is_so_distracting_in_the/"
    },
    {
        "id": "1pwuz38",
        "author": "Strange_Light5219",
        "title": "Isn't Stranger Things missing the Ultimate Unbeatable villain?",
        "content": "If you think about it, the Mind Flayer does seem like this looming, unstoppable force compared to Vecna. Vecna's powerful, sure, but the Mind Flayer feels like this bigger, more all-encompassing threat. It's not just one dude with crazy powers—it’s this force that controls the entire Upside Down.\n\nIf Vecna had been taken out earlier, leaving the Mind Flayer as the final big bad, it could’ve made for an epic conclusion, especially with the whole \"creature from another dimension\" vibe. Plus, we’ve seen so much of Vecna already and defeated him once, so a new, final enemy could've really upped the tension.\n\nThe final season could've had a nice twist if they just focused on the Mind Flayer and made it a true battle for survival. I think it would've given the show even more of a chaotic, \"can they even win?\" energy. What do you think peeps?\n\n\n",
        "upvotes": 27,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1pwuz38/isnt_stranger_things_missing_the_ultimate/"
    },
    {
        "id": "1pxb53i",
        "author": "Sea_Committee9480",
        "title": "Elway",
        "content": "As a CO native who grew up adjacent to the Broncos and experienced all of the Super Bowl failures and victories first hand, I just wanted to say thank you for this documentary. Elway has always been a golden boy and he's a true Colorado treasure. Shout out to Steve Antonopulos for his cameo appearance, you're looking great Steve!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pxb53i/elway/"
    },
    {
        "id": "1px4ass",
        "author": "MamaMia1325",
        "title": "61st Street...hidden gem",
        "content": "61st Street...\n\nI never heard of it until my husband put it on last night and we are 5 episodes into season 1. This series is great and I never heard of it before. Holt McCallany is 1 of my favorite actors and he plays such a great bad guy in this. Who else has watched??",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1px4ass/61st_streethidden_gem/"
    },
    {
        "id": "1pwbsi3",
        "author": "entcanta333",
        "title": "How do you feel about the three-part release of Stranger Things?",
        "content": "I was so excited for this last season and after watching part 2, I feel like I've almost lost interest. I'm just in it to see the ending at this point, I don't feel emotionally invested in the show. ",
        "upvotes": 280,
        "comments": 262,
        "media": null,
        "permalink": "/r/netflix/comments/1pwbsi3/how_do_you_feel_about_the_threepart_release_of/"
    },
    {
        "id": "1pxe5lf",
        "author": "anuraginsg",
        "title": "Weekly Netflix Update Extension",
        "content": "Announcing \"Weekend Binge\": Your One-Stop Preview for Weekend Streaming.\n\nTired of jumping between Netflix, Hulu, Prime, and more to see what's new? Stop the scavenger hunt. Just install and pin the Weekend Binge Chrome Extension.\n\nGet a curated list of all the major movies and shows dropping this weekend—from every major platform—in one simple, elegant view. Your weekend watchlist just got effortless.\n\nhttps://chromewebstore.google.com/detail/weekend-binge/fojgkcahoooojplklelahpkolkjpcgia",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pxe5lf/weekly_netflix_update_extension/"
    },
    {
        "id": "1pwm44z",
        "author": "brianmcnail",
        "title": "Death By Lightning",
        "content": "Please don’t sleep on this show.  Netflix did an amazing job bringing this show to life yes there is A LOT of creative liberties, but this amazing and would love to see Netflix to take a stab at other lesser discussed moments from history.",
        "upvotes": 64,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1pwm44z/death_by_lightning/"
    },
    {
        "id": "1px6x1c",
        "author": "Melodic-Badger-4895",
        "title": "Dolby Vision stopped working",
        "content": "i have an OLED LG C5 TV, and was using Netflix TV app for a few months. Recently (a week ago) Dolby Vision playback stopped working in all titles. Plan is premium, all titles show 4K/Dolby Vision support but it only shows Dolby Atmos when you start playing. Other apps and videos from external drives work in DV as usual. Tried logging out, deleting app, everything that’s possible. Internet connection is also fine, playback quality set to high in settings, HDR is on.\nHas anyone got the same problem?\nAlso i’ve got a “you’re not a part of household” notification recently but chose to override it via travelling option. \nCould it be the cause?\nupd: just checked, for unknown reason playback is stuck on 1080p, 1-2 mbps.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1px6x1c/dolby_vision_stopped_working/"
    },
    {
        "id": "1pxabob",
        "author": "zer0-drunk0",
        "title": "anime suggestions like dorohedoro",
        "content": "hey, i’m looking to get into anime. i’ve watched the new chainsaw man movie and the series dorohedoro. any recommendations like these?? \n\navailable netflix uk please ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pxabob/anime_suggestions_like_dorohedoro/"
    },
    {
        "id": "1px92li",
        "author": "This-Host-1615",
        "title": "Black screen on laptop with sound",
        "content": "So I've been having this issue for like a year now, I can't watch Netflix on my Mac because the screen is black. I've tried everything. Different browsers, clearing my cache, updating my laptop and browsers, and it still won't work. I tried chatting with an employee to fix the issue but I was disconnected before he could even figure out why it isn't working. Does anyone else have this issue? I'm just really stumped and can't figure out what's causing this issue :/",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1px92li/black_screen_on_laptop_with_sound/"
    },
    {
        "id": "1px8v26",
        "author": "TeaCYPunk",
        "title": "My Netflix account is completely broken",
        "content": "My user is the main one that controls the account and we have 4 other profiles 1 for the wife and 3 for the kids. I noticed my account wouldn't go above 0.5mbps and thought everyones was the same, BOY was i wrong my wives profile goes to 18mbps and so do all the other profiles. So I've been watching shows basically at 720p on a 4k TV whilst my my children can watch the same show at 18 mbps on their profiles ON THE SAME TV!!!!! I've tested it on every device in house and it's the same everywhere, I've checked the account settings but there isnt a single option to nerf the quality. I did not change anything other than the profiles it was signed into and I'm majorly disappointed, I also tried changing my son's profile to an adult one and that immediately bricked that profile, I moved one of my daughters to age rating 15 and her quality wasn't effected.\n\nIve watched countless Netflix series squinting for no reason.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1px8v26/my_netflix_account_is_completely_broken/"
    },
    {
        "id": "1px38gd",
        "author": "Electronic_Chicken93",
        "title": "Any recommendations based on some Series I watched?",
        "content": "Started watching the more so popular TV shows on Netflix since last year, including Breaking Bad, El Camino, Better Call Saul, Dexter, Money Heist and some smaller series such as Adolescence, The Watcher and more. What should I watch next based on my likings?",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1px38gd/any_recommendations_based_on_some_series_i_watched/"
    },
    {
        "id": "1px86ef",
        "author": "zer0-drunk0",
        "title": "gore, horror, dark vibe, older kind of set, films",
        "content": "trying to find some films to watch, obviously available on netflix as why i’m posting it here, any suggestions appreciated! \n\nsome films i like are:\n- the cornetto trilogy\n- the black phone\n- frankenstein (2025 del toro) \n- the head hunter\n- interview with the vampire (1994)\n- the pale blue eye \n- underworld (2006) \n\n\n“older kind of set” - sorry i’m not great with words but like if you look at the list a lot of the movies are set in the past, and it just looks cool visually",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1px86ef/gore_horror_dark_vibe_older_kind_of_set_films/"
    },
    {
        "id": "1px7x8o",
        "author": "Tricky-Bat-2638",
        "title": "Any good recommendations?",
        "content": "Anyone got any good recommendations to watch on Netflix?\n\nI’m more of a series kind of girl than a movie so if you have any good recommendations I’d appreciate it! ",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1px7x8o/any_good_recommendations/"
    },
    {
        "id": "1pwa2j8",
        "author": "stroh_1002",
        "title": "Sadie Sink teases the Stranger Things series finale: 'It feels like a homecoming of sorts. It feels complete'",
        "content": "",
        "upvotes": 114,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1pwa2j8/sadie_sink_teases_the_stranger_things_series/"
    },
    {
        "id": "1px3gsm",
        "author": "YJoseph",
        "title": "Recommended docu series",
        "content": "I liked Beckham, Arnold, Kanye documentary etc. I liked the format, the multiple episodes, the high-profile vibe. What do you recommend? My interests go beyond celebrities ofcourse. Been wondering if  the Inside The World’s Toughest Prison series is something for me",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1px3gsm/recommended_docu_series/"
    },
    {
        "id": "1pwy3it",
        "author": "RudolfTheRedNosedRat",
        "title": "The decline of (mostly non-English) audio tracks on Netflix",
        "content": "I’ve noticed something that’s been bugging me lately: Netflix will still show a movie with localized artwork/title for my region, but then the expected audio tracks aren’t available anymore.\nAfter thinking this for the last months, I've seen it again today when trying to watch \"The Grinch Stole Christmas\" (Jim Carrey, 2000; Der Grinch in German). I’m in the German-speaking region and I’ve watched it in German on Netflix before. Now the German audio track is gone for us and I only get German subtitles.\n\nI understand licensing/rights are probably the reason (regional contracts, changing agreements, blablabla). But for a huge international company like Netflix, it feels like a quality issue when a title is clearly marketed locally and the obvious local language track just isn’t there, with no clear explanation.\nAnd it doesn’t feel like a one-off. I’ve had this impression more and more: Movies and series that used to have certain language tracks suddenly don’t.\nSometimes even the original language options feel inconsistent depending on the region, which feels especially weird to me. I fear it might get even worse, where I can't even watch English originals in English anymore (like it is on Sky/HBO and Amazon at times).\n\nHas anyone else seen this? Did you find other affected titles? What’s the best way to actually get Netflix to address this beyond contacting support?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pwy3it/the_decline_of_mostly_nonenglish_audio_tracks_on/"
    },
    {
        "id": "1px35p8",
        "author": "Unlucky-Bear0705",
        "title": "Questions- Stranger Things?",
        "content": "I have a few questions that went unanswered:\n\n1.\t⁠Why did the military guy pee on the wall? What did he know?\n\n2.\t⁠What was the Kryptonite exactly?\n\n3.\t⁠When Holly dived in the upside down from Dimension X, wouldn’t she have reached the upside down of Dimension X and not the one of Hawkins?\n\n4.\t⁠The entire season 4 Sullivan looked for Eleven thinking that she is the reason behind all that was happening in Hawkins and gave an order to “shoot-to-kill”. But he flipped 180 in season 5, he didn’t have any powers to call the shots anymore and now they wanted to create more Elevens, wth?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1px35p8/questions_stranger_things/"
    }
]