[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 8,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 133,
        "comments": 472,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mw700m",
        "author": "BlackDoom_26",
        "title": "The most binge worthy Netflix show or movie you’ve ever watched",
        "content": "You ever start a show or movie on Netflix thinking you’ll just watch one episode, then suddenly it’s 3am and you’ve watched the whole thing? Just curious what people’s recommendations are for ones that really had you hooked.",
        "upvotes": 144,
        "comments": 407,
        "media": null,
        "permalink": "/r/netflix/comments/1mw700m/the_most_binge_worthy_netflix_show_or_movie_youve/"
    },
    {
        "id": "1mvg1hu",
        "author": "SplitNational2929",
        "title": "Netflix’s KPop Demon Hunters Movie Theater Screenings Are Already Almost Sold Out",
        "content": "",
        "upvotes": 424,
        "comments": 71,
        "media": null,
        "permalink": "/r/netflix/comments/1mvg1hu/netflixs_kpop_demon_hunters_movie_theater/"
    },
    {
        "id": "1mwf05t",
        "author": "filterrcoffee",
        "title": "OC - Kdh fanart, happy with this one!",
        "content": "Loved the movie so spent a bit of time making some art. I imagined a poster ish layout for this one, swipe to see the sketch! I hope you like it! \nI've never listened to kpop before this movie and I must say, this ost has made a permanent stay in my daily rotation 😊",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mwf05t/oc_kdh_fanart_happy_with_this_one/"
    },
    {
        "id": "1mvyuz4",
        "author": "hfourm",
        "title": "New Netflix UI on Apple TV - Terrible",
        "content": "I have never been so insulted by an update in my life.\n\nThe arrogance of the product management and design teams to roll this out, is mind numbing.\n\nI literally can only see 3 and a half titles MAX at a time. I get motion sick trying to navigate through titles to find something interesting to watch.\n\nAm I going crazy?\n\nWhatever metrics they chose to A/B test this rollout goes to show you how even the smartest tech talent can succumb to feeling like they are innovating and reverse engineering the metrics to prove it.\n\nI cancelled my subscription. \n\nNetflix literally invented the user experience and mental model most of us expect for streaming apps. To take it in the direction they have is pure hubris.",
        "upvotes": 20,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1mvyuz4/new_netflix_ui_on_apple_tv_terrible/"
    },
    {
        "id": "1mvuj2m",
        "author": "iLikeDinosaursRoar",
        "title": "Dept. Q Renewed for a Second season",
        "content": "We did it guys!\n\nDept Q gets a second season. Let's just hope it's as good as the first season and we get more after this. \n\nhttps://www.bbc.com/news/articles/ckgj8xn9zx0o.amp\n",
        "upvotes": 36,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mvuj2m/dept_q_renewed_for_a_second_season/"
    },
    {
        "id": "1mwfbhc",
        "author": "Less_Manufacturer218",
        "title": "Excited for new show HOSTAGE-same actress from Dr. Foster!!!!",
        "content": "Just saw this new show hostage and has the foreign actress (I’m from the US) from Doctor Foster! Been waiting for something good with her in it and forgot about it and wham a pleasant surprise!!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mwfbhc/excited_for_new_show_hostagesame_actress_from_dr/"
    },
    {
        "id": "1mv1iic",
        "author": "Otherwise-Jump-4571",
        "title": "Had this gem of an interaction with a Netflix rep. I called for support and he ended up cancelling my account.",
        "content": "Some of the messages were cut out for privacy. If parts of the conversation doesn't make sense to you, it's not because of the cut out messages.\n\n\n\nHe did a really poor job explaining that whole new member thing (still don't understand it). He promised to resolve the issue but cancelled my account instead.\n\n  \nI asked for a transcript of the chat, and he said it will pop up if I closed the chat. Good thing I took screenshots. ",
        "upvotes": 1148,
        "comments": 200,
        "media": null,
        "permalink": "/r/netflix/comments/1mv1iic/had_this_gem_of_an_interaction_with_a_netflix_rep/"
    },
    {
        "id": "1mwe7u7",
        "author": "peoplemagazine",
        "title": "First Look at Emily in Paris Season 5 | 📷: Netflix",
        "content": "Netflix shared first-look images of the fifth season of 'Emily in Paris' on Wednesday, which sees the titular character, played by Lily Collins, continuing her journey in Venice, Italy — and the return of Lucas Bravo as Gabriel. More details [here](https://people.com/emily-in-paris-season-5-first-look-lily-collins-continues-italian-adventure-lucas-bravo-returns-11794241?utm_campaign=peoplemagazine&amp;utm_medium=social&amp;utm_source=reddit.com&amp;utm_content=post).",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mwe7u7/first_look_at_emily_in_paris_season_5_netflix/"
    },
    {
        "id": "1mwbv21",
        "author": "Apprehensive-Rip6960",
        "title": "what can 13 yr old boys watch?",
        "content": "we got netflix recently, and ive been trying to find some shows for my sibling. he's just been watching horrid henry and other sort of cartoonish shows, i was hoping by getting netflix there would be some more suitable shows but all of them have a lot of swearing - and other inappropriate stuff, maybe tv has changed a lot from when i was a kid - shows like victorious, good luck charlie were reasonable and enjoyable as we grew up. even shows on cbbc like so awkward, dumping ground \n\n  \nand a lot of the shows seem very female audience heavy - not sure if im looking in the wrong places or judging other shows - just want him to have a show to enjoy rather than younger kids shows. i feel like shows we used to watch were good for morals and growth, and were funny too! \n\nlet me know if there are any shows that might be worth a try\n\nfor reference, he enjoyed inbestigators which was on netflix, but can't find anything resembling that.",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1mwbv21/what_can_13_yr_old_boys_watch/"
    },
    {
        "id": "1mwdoad",
        "author": "punknatanke",
        "title": "Про кнопку выхода",
        "content": "Доброго дня! Нужно ли на Android TV выходить из приложения Netflix каждый раз по окончании просмотра, нажимая соответствующую кнопку Exit в меню? Многие говорят, что не нужно. Но для чего тогда она сделана?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mwdoad/про_кнопку_выхода/"
    },
    {
        "id": "1mw7xuv",
        "author": "Biggus_Dickkkus",
        "title": "Can't remember name of TV series?",
        "content": "I remember it's a couple and it shows the woman going to a restaurant with an old boyfriend, kissing him or having an affair and later that day the couple is watching TV about and it's everything she did that day Including the affair. Hope that is enough information. Please and ty.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mw7xuv/cant_remember_name_of_tv_series/"
    },
    {
        "id": "1mw7tsq",
        "author": "PrestigiousNet3834",
        "title": "Unknown Number: The High School Catfish-spoiler alert",
        "content": "Here comes some spoiler for this documentary: It´s the coach( mother of daughter behind it) Ray William Johnson made a great explanations on his tiktok, but why would she do it?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mw7tsq/unknown_number_the_high_school_catfishspoiler/"
    },
    {
        "id": "1mw1csa",
        "author": "OrangeBarcode",
        "title": "Netflix Subtitles on but setting off",
        "content": "If a movie comes with subtitles already on the screen for someone speaking a foreign language, I get a second set of netflix subtitles saying the same thing so I get double subtitles with no way to turn it off.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mw1csa/netflix_subtitles_on_but_setting_off/"
    },
    {
        "id": "1mvg8wo",
        "author": "MysteriousDelay6266",
        "title": "BLACK RABBIT | Official Trailer | Netflix | September 18",
        "content": "# BLACK RABBIT\n\nWhen the owner of NYC’s biggest hotspot (Jude Law) allows his troubled brother (Jason Bateman) to return to the family business, trouble multiplies.\n\n**Only on Netflix SEPTEMBER 18.**",
        "upvotes": 30,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1mvg8wo/black_rabbit_official_trailer_netflix_september_18/"
    },
    {
        "id": "1muzrde",
        "author": "Conscious-Quarter423",
        "title": "‘Wednesday’ Season 2 Gains 29.1 Million Views in Second Week on Netflix. That’s a 42% decrease from the week before.",
        "content": "",
        "upvotes": 275,
        "comments": 75,
        "media": null,
        "permalink": "/r/netflix/comments/1muzrde/wednesday_season_2_gains_291_million_views_in/"
    },
    {
        "id": "1muo4m8",
        "author": "Sweaty-Toe-6211",
        "title": "‘Dept. Q’ Renewed for Second Season at Netflix",
        "content": "",
        "upvotes": 708,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1muo4m8/dept_q_renewed_for_second_season_at_netflix/"
    },
    {
        "id": "1mvz9uz",
        "author": "tavernstories",
        "title": "Is there anyway to remove Netflix films off the menu",
        "content": "Respectfully, I just like all the movies that are Netflix films. I really only specifically like movies that aren’t made by Netflix or anyone affiliated with the production of Netflix ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1mvz9uz/is_there_anyway_to_remove_netflix_films_off_the/"
    },
    {
        "id": "1mvwz7y",
        "author": "issues_com",
        "title": "Weird email and card",
        "content": "I recently couldn't log into netflix on my laptop. I checked my phone and the email wasnt my email. It had my first name, but the rest was random letter. Well later in the day my tv said I needed to update my payment method. I went in to update it and it was a card number and name I have NEVER had or heard of before. I called netflix and they changed my email for me and I changed my card information. They told me \"maybe its an issue when you have the same emails linked to many thing\" like but the card?!?! Thats not mine?!?! Im so confused. I feel like i got help, but no answers? ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1mvwz7y/weird_email_and_card/"
    },
    {
        "id": "1mw5sbh",
        "author": "AdHot3508",
        "title": "Why Netflix need to make numbers public..",
        "content": "We can all name at least 3 GREAT shows on Netflix that were cancelled after the 1st or 2nd  season that just put us in disbelief thinking “were people really not watching this?” then you see the fanfare for it online (and yes I know social media is a bubble) and think no way this show had poor viewership. \n\nThen you see shows like NIGHT AGENT that has been renewed by Netflix for a third season (really not that good of a show as far as spy/espionage shows go) and think “no way people are watching this more than [insert show here]”. And it’s not just Night agent btw, there are others I could mention but I don’t want to cause an uproar and pull away from the main point, *cough* thursday *cough*. \n\nBut yeah, I think it’s more than just viewership. Because I honestly refuse to believe that some of the shows Netflix keep renewing are more viewed than some of the ones that were cancelled early. \n\nCan anyone in the industry or with knowledge in the industry speak to this?\n\n\n\n",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1mw5sbh/why_netflix_need_to_make_numbers_public/"
    },
    {
        "id": "1mvz1xs",
        "author": "Which-Holiday9957",
        "title": "Any Given Sunday using AI crowds for random scenes?",
        "content": "I could be wrong but I noticed definitely in episode 6. There are two scenes where the crowd looks fake or people in the background aren’t moving. \n\nIf that’s true it seems weird. It wasn’t for anything special. They didn’t need to do it. Are they just trying to sprinkle it in until we can’t tell the difference?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mvz1xs/any_given_sunday_using_ai_crowds_for_random_scenes/"
    },
    {
        "id": "1mvystz",
        "author": "JeffTheBrainBreaker",
        "title": "Netflix only gives me 540p on PC despite premium plan and HEVC hardware",
        "content": "🟥 Why is Netflix locking me to 540p on PC despite premium plan?\n\nI’m on Netflix’s Premium Ultra HD plan, using a PC with:\n\n• Intel i5-8600 + GTX 1080 Ti\n• 2K monitor (2560x1440)\n• HEVC codec installed\n• Edge browser + Netflix Windows App\n• Stable 100+ Mbps connection\n\n\nDespite meeting all technical requirements, Netflix limits my stream to 960x540 resolution—even for titles like Oppenheimer. No clear error, no explanation. Just low bitrate.\n\n---\n\n🔍 What’s going on?\n\n• Netflix doesn’t support 1440p as a stream tier.\n• DRM checks are overly strict and opaque.\n• DisplayPort connections may be misclassified.\n• Even Edge + Netflix App can fail to trigger HD.\n\n\nMeanwhile, the same hardware on a smart TV or Apple TV gets full 4K. So this isn’t a hardware issue, it’s platform discrimination.\n\n---\n\n⚠️ What I’m asking for:\n\n• Transparency on stream resolution logic\n• Fair treatment for PC users with capable hardware\n• Support for 1440p or better fallback when 4K isn’t available\n\n\nAnyone else stuck at 540p despite having a solid setup? Let’s push Netflix to fix this.\n\n#Netflix540p #PCstreaming #PremiumNotPremium #DRMmadness",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mvystz/netflix_only_gives_me_540p_on_pc_despite_premium/"
    },
    {
        "id": "1mvsjgz",
        "author": "YoonSnake",
        "title": "Netflix keeps showing me shows when I search for movies",
        "content": "We love Korean movies and never had problems watching them until recently. We used to be able to search \"Korean movies\" and the whole Netflix catalog of Korean movies would come out. Nowadays, when we search for the same thing, it's mostly K-dramas with very few Korean movies coming up on the search. What's going on? Is there any way to fix this?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mvsjgz/netflix_keeps_showing_me_shows_when_i_search_for/"
    },
    {
        "id": "1mupni5",
        "author": "veditafri",
        "title": "What's the Netflix show suprised you after starting it just for background noise?",
        "content": "What Netflix show suprised you the most? You started it with  low expectations, just to have something on - but  ended up binge-watching the whole thing instead?",
        "upvotes": 150,
        "comments": 275,
        "media": null,
        "permalink": "/r/netflix/comments/1mupni5/whats_the_netflix_show_suprised_you_after/"
    },
    {
        "id": "1mvalpf",
        "author": "Vivid-Relationship96",
        "title": "“MOST LIKED” shows",
        "content": "Since Netflix doesn’t provide a full list of shows with the “Most Liked” badge, why don’t we make a thread? \n\nDrop the series you’ve watched that had the “Most Liked” thumbs up!\n\n👇",
        "upvotes": 6,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1mvalpf/most_liked_shows/"
    },
    {
        "id": "1mvnyom",
        "author": "Kiskikena",
        "title": "Chat is unavailable",
        "content": "So, I have a Netflix account that I have been using for several years. \n\n  \nSuddenly, after putting balance for at least 6 months through gift cards, my membership was ended without giving me any explanation.\n\n  \nWhen I try to use the chat to contact an agent it always says \"Chat is unavailable\". \n\n  \nI have created a new account and loaded it with a small balance to test it out and when I try to open a chat with an agent, suddenly it works fine. \n\n  \nWhat is happening and how can I recover my account with my balance??",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mvnyom/chat_is_unavailable/"
    },
    {
        "id": "1mupavk",
        "author": "ex1stence",
        "title": "“Fit For TV” was a complete waste of time",
        "content": "How tf do \"documentaries\" like this even get made? Literally everything they mentioned in all three episodes was a complete nothingburger, and it was honestly sad to see how deep the producers were trying to dig to find anything even remotely interesting to put in the doc.\n\nDanny gaining the weight back after the show? Wow yeah, turns out people who have a bad relationship with food before the show didn't magically rewire their entire brains after leaving TBL. Not sure how that's NBC's fault or even a controversial thing, but man did they soak up about 20 minutes just repeating the same thing over and over again.\n\nBob said a mean thing to Joelle one time (which did inevitably get her to finish the 30-second treadmill run)? DUN DUN DUNNNN. Dramatic music and another 15 minutes over the fact that yes, every trainer yells at you when you try to give up during a workout because that's literally the job you are paying them to do.\n\nJillian gave....you guys it's so bad, it's terrible, I'm trembling and shaking even as I type this....CAFFEINE to contestants??? Holy shit ya'll, NBC is basically the devil incarnate let's spend another 20 minutes talking about it.\n\nThe whole thing was mining for any controversy it could possibly find and there just wasn't a damn thing to say. I'm a millennial and as someone who struggled with my weight at the time the show first aired, it was actually really inspiring to see how much diet and exercise was paying off for people who were way bigger than I was. While I may not be able to draw a direct line between TBL and my eventual love of exercise, I know that watching these people get on the treadmill and work their asses off (literally) gave me a model that I continue to follow to this day when it comes to my diet and how I take care of my body.\n\nThis wasn't a documentary about scandal or NBC doing anything wrong, it was just a drag on the most inconsequential events that when you pull back and look at what they actually said, sure as shit wasn't worth 120 minutes of my time.",
        "upvotes": 78,
        "comments": 84,
        "media": null,
        "permalink": "/r/netflix/comments/1mupavk/fit_for_tv_was_a_complete_waste_of_time/"
    },
    {
        "id": "1mvkvdx",
        "author": "SkelMaxim",
        "title": "Extant S1, Ep3 missing scene",
        "content": "Hello, so I was watching Extant Season 1,  Episode 3, when I noticed a 13 second time skip I cannot override. It appears as if Netflix cut a scene out, but from the context before and after, I don't understand why.\nIt was from 41:10 minutes remaining to 40:57 during a scene about losing a child.\nIt jumps from mentioning infertility to \"so that's how she lost the baby?\"\n\nCould someone please explain what happened in that scene and possibly if y'all know why it was cut?\n\nEDIT: Nevermind. I reloaded the show and it somehow reappeared... not sure how.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mvkvdx/extant_s1_ep3_missing_scene/"
    },
    {
        "id": "1mvkt36",
        "author": "Personal-Comfort-507",
        "title": "Have job postings for Fort Monmouth come out yet?",
        "content": "I live near Fort Monmouth, NJ, and recently graduated from a reputed BFA program for acting and film. I was wondering if anyone knows where to find job recruiting posts from Netflix where they post, apart from LinkedIn or something.\n\nThanks so much!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mvkt36/have_job_postings_for_fort_monmouth_come_out_yet/"
    },
    {
        "id": "1mvkc41",
        "author": "fish5056",
        "title": "ONLY arabic subtitles available on apothecary diaries?",
        "content": "i set my subtitle language to english and english UK (and I checked it multiple times) but sometimes when i want to watch something and I look at the subtitles, the only option is a random language that I didn't even select (and don't speak myself).\n\nfor example, I want to watch apothecary diaries but the ONLY available subtitle language for me is arabic.\n\nI tried to log in from the web, log in with wifi or mobile data, log in from the app on my phone, app on my ipad etc. and nothing changes. I tried to sign out and login again and nothing changes. please help me.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mvkc41/only_arabic_subtitles_available_on_apothecary/"
    },
    {
        "id": "1mv0yds",
        "author": "bobbaganush",
        "title": "Two-and-a-half years between first and second season…",
        "content": "I just looked to see when 3 Body Problem’s new season would be out. The first was dropped March of ‘24. Looks like the second will be sometime between October and December of ‘26. This seems to be a trend with a lot of their series nowadays. It’s ridiculous. Does anyone here have an idea as to why they do this?",
        "upvotes": 18,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1mv0yds/twoandahalf_years_between_first_and_second_season/"
    }
]