[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 490,
        "comments": 259,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1in0vfz",
        "author": "sweetpatata",
        "title": "Netflix's screensaver: \"Hey, I think you will love this show you've just finished yesterday.\"",
        "content": "Why the hell does Netflix recommend all the shows I'm either currently watching or have just recently finished watching?!\n\nLiterally happening currently. I've just finished watching Schitt's Creek and suddenly it appears on my Netflix's screensaver. I've just started watching Lost and suddenly it appears on the screensaver, too. It's so annoying!",
        "upvotes": 21,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1in0vfz/netflixs_screensaver_hey_i_think_you_will_love/"
    },
    {
        "id": "1imvlhz",
        "author": "Victor_the_historian",
        "title": "Watching the last season long after the rest of a show is terrible.",
        "content": "Not a problem of Netflix, but certainly a pity for us tv shows watchers.\n\nI've found myself in the same situation with two different shows (The Crown and The Good Doctor, if anyone is interested). Basically, when I watched these shows the last season hadn't come out yet, so I had to wait for it to come out after I had watched all the other season. That means I watched it with a considerable distance from the rest of the episodes. I also didn't have time to do a rewatch.\n\nIt just sucks. You aren't as attached to the characters anymore, and you struggle to remember events that are important to the plot.",
        "upvotes": 33,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1imvlhz/watching_the_last_season_long_after_the_rest_of_a/"
    },
    {
        "id": "1imnk5k",
        "author": "Yuck_Few",
        "title": "Black hawk down documentary",
        "content": "After watching the documentary is pretty clear that the movie was basically propaganda. You get a whole new perspective when you hear the somalis side of the story",
        "upvotes": 105,
        "comments": 120,
        "media": null,
        "permalink": "/r/netflix/comments/1imnk5k/black_hawk_down_documentary/"
    },
    {
        "id": "1in1iik",
        "author": "Pogrebnik",
        "title": "New Netflix K-Drama ‘Show Business’ Will Dive Into the 1960s and 80s Korean Music Scene",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1in1iik/new_netflix_kdrama_show_business_will_dive_into/"
    },
    {
        "id": "1imyoxa",
        "author": "LauraEats",
        "title": "Cameron Diaz Says She Was Shocked When She Learned That Netflix Has a Hotline to Report Misconduct on Set",
        "content": "",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1imyoxa/cameron_diaz_says_she_was_shocked_when_she/"
    },
    {
        "id": "1imjl2u",
        "author": "indiewire",
        "title": "‘Apple Cider Vinegar’: What Happened to Real-Life Scammer Belle Gibson? (Explained)",
        "content": "",
        "upvotes": 43,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1imjl2u/apple_cider_vinegar_what_happened_to_reallife/"
    },
    {
        "id": "1imt4dw",
        "author": "lovetoshop1x2x3",
        "title": "The Night Agent",
        "content": "I enjoyed season 1, and thought it was pretty enticing. \n\nHowever season 2 is a bit disappointing. I’m only on episode 4 and we all know everything that’s wrong with this season. I feel like Peter’s character is great, and the actor does a pretty good job - relatively. I think the writers need to kill Rose off, give Peter a new character arc, and explore different storylines for Peter. Also, I love the Noor storyline. She is a great actress and the storyline keeps me interested. \n\nIdk, excited to see where season 3 goes, if there is one. Really hope the writers read Reddit. ",
        "upvotes": 7,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1imt4dw/the_night_agent/"
    },
    {
        "id": "1imuumj",
        "author": "Whobitmyname",
        "title": "One Piece Season 2 Antagonist Teased By Star Joe Manganiello: \"Not That Much Different From Luffy”",
        "content": "",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1imuumj/one_piece_season_2_antagonist_teased_by_star_joe/"
    },
    {
        "id": "1in348c",
        "author": "JCB220685",
        "title": "Just finished watching Departure and Capture. Any recommendations for similar series?",
        "content": "What I liked about both is that they both felt very current and dealing with very real possibilities/ideas. Departure season 1 had an MH370 based storyline and found that very interesting, Capture has that Black Mirror feeling to it, especially season 2. Any suggestions would be appreciated, TIA. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1in348c/just_finished_watching_departure_and_capture_any/"
    },
    {
        "id": "1im280c",
        "author": "Sweaty-Toe-6211",
        "title": "Duffer Brothers Confirm No Spin-Offs: Stranger Things Characters Won’t Return After Season 5!",
        "content": "",
        "upvotes": 307,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1im280c/duffer_brothers_confirm_no_spinoffs_stranger/"
    },
    {
        "id": "1imqcb5",
        "author": "Same-Eggplant9942",
        "title": "Nearly the whole cast of Dance Academy is in new netflix series Apple Cider Vinegar",
        "content": "Exciting and hilarious to see. Only on episode 3 so far and Abigail, Kat, and Sammy have all been in it so far. Throwback for fans. Love to see them out here still working. Dance academy was one of my favorite shows growing up and Sammy’s death always had a huge impact on me. Love love love to see them ",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1imqcb5/nearly_the_whole_cast_of_dance_academy_is_in_new/"
    },
    {
        "id": "1in2bp0",
        "author": "Heartshapedbox77",
        "title": "Add to my Netflix Horror tv show list pls",
        "content": "The shows I’ve enjoyed:\n\nHaunting of Hill House\nHaunting of Bly Manor\nFall of the House of Usher\nMidnight Mass\nMidnight Club\nMarianne\n2 sentence horror stories\nRatchet\nFear street\n\n\nAny recommendations?? Preferably a series. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1in2bp0/add_to_my_netflix_horror_tv_show_list_pls/"
    },
    {
        "id": "1in0y0p",
        "author": "jackdempsy2345",
        "title": "Sick note netflix",
        "content": "Ive just started watching sick note on netflix and i like it so far but whats putting me off is how Dr glens wife treats him. Its really putting me off from continuing as i feel so bad for him.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1in0y0p/sick_note_netflix/"
    },
    {
        "id": "1imseso",
        "author": "iloverealitytv2020",
        "title": "Netflix not working",
        "content": "Hi, I’ve updated my laptop software (Apple), rebooted the internet, restarted my laptop and cleared cookies/cache. But, my Netflix isn’t working still, could anyone help? \n\nEdit: Looks like Netflix itself might actually be down \n",
        "upvotes": 4,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1imseso/netflix_not_working/"
    },
    {
        "id": "1imapxt",
        "author": "Scout1228",
        "title": "Anyone else hate this?",
        "content": "I am seriously getting traumatized by the booming noise that assaults me even when I click for more info on a movie. Why is this necessary? Anyone else hate this on Netflix?\n",
        "upvotes": 53,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1imapxt/anyone_else_hate_this/"
    },
    {
        "id": "1imxwge",
        "author": "zzubnik",
        "title": "Low FPS since Windows update",
        "content": "Since the latest Windows 11 update, Netflix has been low frame-rate (guessing 5 per second). It is the same on Firefox, Edge, and the netflix app. All non-Netflix video sites play just fine on the PC. \n\nMy PC is very much able to handle Netflix. Drivers updated, restarted over and over. \n\nIt seems to be only the DRM protected streams that are affected. It is driving me mad.\n\nAnybody got any clues what's happened, or what I can try?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1imxwge/low_fps_since_windows_update/"
    },
    {
        "id": "1imsri2",
        "author": "FitAd8822",
        "title": "Netflix app assistance",
        "content": "Hi so, I can’t get into Netflix app on my mobile, or the help centre. And the website isn’t working but it’s states there are not outages why won’t it work.\n\nWhen I try to log in it states \n\n“A server with the specified hostname could not be found”\n\nWebsite states the site can’t be reached \n\nCan someone help me",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1imsri2/netflix_app_assistance/"
    },
    {
        "id": "1imm2zv",
        "author": "CaliforniaMuscleGuy",
        "title": "3 Great Shows",
        "content": "These shows were so good, I binged watched them within a couple of days. \n\n1. The Accident: A tragic accident radically changes the lives of several families, triggering a spiral of guilt, resentment and violence that will lead them to explore the furthest limits of pain, resistance and pity. (Soooooooo damn good) \n2. Cassandra: A family moves into the oldest smart home in Germany, decades after the original owner dies; the AI household helper awakens, and is resolved to never be alone again. (Think Alexa with the heart of Chucky hehe) \n3. Apple Cider Vinegar: Two young women advocate for wellness remedies to cure deadly illnesses, unraveling their lives as they unknowingly - and knowingly - mislead the world. (This one had me floored 😳😳😳). ",
        "upvotes": 7,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1imm2zv/3_great_shows/"
    },
    {
        "id": "1imxyne",
        "author": "Sea_Stable_8657",
        "title": "Netflix household",
        "content": "So this is an annoying question but please bear with me. Im currently working abroad and has a family plan with my wife in our country. Last year I was locked out due to her connecting the account to a tv. I talked to an agent and it was fixed now.\n\nRecently she has acquired an android projector with a built in netflix, youtube and screenshare. she can share the screen no prob it doesn't share it when its on netflix. now she wants to connect the account to the projector. \n\nMy question is: Will the android projector activate the netflix household and force all of us to go where the projector wifi is? meaning I will be locked out of my account because I cannot go home to where the projector is?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1imxyne/netflix_household/"
    },
    {
        "id": "1im7ssh",
        "author": "meepmeepbinch",
        "title": "Why did Anna Delvey go to jail, but not Belle Gibson?",
        "content": "After watching these two Netflix shows, I wonder why didn't Belle Gibson get sent to jail, I feel like what she did in comparison to what Anna Delvey did was WAYYYY worse. What do you think? \n\nEdit for typo. ",
        "upvotes": 15,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1im7ssh/why_did_anna_delvey_go_to_jail_but_not_belle/"
    },
    {
        "id": "1imglee",
        "author": "ZealousidealFloor105",
        "title": "Show recommendations on Netflix",
        "content": "Okay so my last 2 years of Netflix has literally been me cycling between B99, The Good Place, and Superstore, and while I stand by the statement that the shows are amazing I want something new. I enjoyed the first few seasons of psych but hate the office. Idk what but there's just something about it I don't like. Other random shows I liked were the blacklist, final space, the man on the inside, suits and death note.\n\nThanks!",
        "upvotes": 3,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1imglee/show_recommendations_on_netflix/"
    },
    {
        "id": "1imqwju",
        "author": "Existing_Fortune45",
        "title": "Does anybody know this show?",
        "content": "I'm looking for a show I watched on Netflix about 10 or so years ago. It was an international drama and I'm not really sure what language it was in. There was this guy who worked for a radio station (I think). One day, he gets a knock at his apartment and there is a woman standing there claiming to be his daughter. She shows up with her son. The whole show he's trying to figure out whether or not she's just lying to him for his money or something. He ends up believing her. Anyway, let me know if you know this show or anyway I could find it. Thanks!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1imqwju/does_anybody_know_this_show/"
    },
    {
        "id": "1imoe64",
        "author": "External_Pear1639",
        "title": "Sweet Bobby: My Catfish Nightmare",
        "content": "Just finished this documentary. This was shocking and insane. 8 years?? MY GOD. \n\nBut anyways, what issue do you think Simran has? Why do you think she did it? What mental illness causes someone like Simran to be like this? What do you think? \n\nIt could be jealousy, bipolar disorder, depression, multiple personality disorder, etc…",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1imoe64/sweet_bobby_my_catfish_nightmare/"
    },
    {
        "id": "1ilv83j",
        "author": "VerdeAzul74",
        "title": "Best Netflix documentaries that I may have missed?",
        "content": "I’ve seen quite a few documentaries on Netflix and am looking for something recommended. What do you recommend based on what I’ve seen? Favorites are marked with a *\n\nAmerican Murder\n\nAmerican Nightmare*\n\nThe Deepest Breath*\n\nFyre\n\nGirl in the Picture\n\nInto the Deep*\n\nInto the Fire*\n\nThe Staircase\n\nSweet Bobby\n\nThe Tinder Swindler\n\n\nI’ve seen more but I’m drawing a black rn. Also tried Wild, Wild Country but the scenes of nudity were too much. Likewise, tried Don’t F with Cats and I can’t stand watching animals being harmed and the same would go for Blackfish.",
        "upvotes": 80,
        "comments": 154,
        "media": null,
        "permalink": "/r/netflix/comments/1ilv83j/best_netflix_documentaries_that_i_may_have_missed/"
    },
    {
        "id": "1imbvdz",
        "author": "wolfy1091",
        "title": "Temporary passcode",
        "content": "How many of these can you get? I’m visiting family out of state been away a month and a half plan on going back home in a few days. netflix on my iPad has been working all this time now suddenly I get this device is not apart of your house hold. I have family in my house that watch on my tv back home.\n\ndumb mod.  I’m not begging for access to accounts.  It’s my own Account.   Mine\n\n“Your post was begging for access to Netflix accounts. That is not permitted in this subreddit”",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1imbvdz/temporary_passcode/"
    },
    {
        "id": "1imducd",
        "author": "LetsGoForPlanB",
        "title": "Netflix EU new horrible UI",
        "content": "New UI is horrible. Can only see 3 titles at any given time on my TV while browsing Netflix. It's now worse than Prime and Disney.\n\nAny way to revert to an older version?",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1imducd/netflix_eu_new_horrible_ui/"
    },
    {
        "id": "1imci0i",
        "author": "Somethingman_121224",
        "title": "Joe Manganiello Teases Crocodile's Arc in Live-Action 'One Piece' Season 2",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1imci0i/joe_manganiello_teases_crocodiles_arc_in/"
    },
    {
        "id": "1imk7b2",
        "author": "_zyx_716",
        "title": "I have a question",
        "content": "I live back and forth between two different houses and I'm wondering if I paid for an account if I would only be able to use it at one of them because of the only on household rule",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1imk7b2/i_have_a_question/"
    },
    {
        "id": "1imopr1",
        "author": "RS_Phil",
        "title": "Why are games like Civ 6 all over my feed all of a sudden?",
        "content": "And how do I turn them off?\n\nI don't know what's changed but Civ 6 is now like 90% of the screen when I load the webpage up  - I am on PC if I wanted to play a game I'd use Steam or Epic fs.\n\n  \nHow do I get rid of this rubbish please?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1imopr1/why_are_games_like_civ_6_all_over_my_feed_all_of/"
    },
    {
        "id": "1im2yxv",
        "author": "S4v1r1enCh0r4k",
        "title": "Five Fast and Furious movies are leaving Netflix on February 12th, some of them will be available on Peacock",
        "content": "",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1im2yxv/five_fast_and_furious_movies_are_leaving_netflix/"
    }
]