[
    {
        "id": "1kl5818",
        "author": "SanderSo47",
        "title": "May 9-11 Box Office Recap – Despite staying at #1, 'Thunderbolts*' drops a rough 56.4% this weekend, and also drops 60% overseas. The film has earned $271M, and there's the possibility it could miss $400M worldwide. In some good news, A24's 'Friendship' has a fantastic debut in 6 theaters.",
        "content": "https://preview.redd.it/zy18hg9n9f0f1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=2dab97437ff88f2bc81c215ada160320fc6f9f18\n\nWithout any notable competition, ***Thunderbolts*** kept the #1 spot this weekend. There were three wide releases, yet they all made for a combined $7.6 million this weekend. The only bright spot was ***Clown in a Cornfield***, while ***Shadow Force*** and ***Fight or Flight*** had some of the worst debuts for films playing at over 2,000 theaters. The weekend's best news, however, was in limited release; A24's ***Friendship*** earned the year's best per-theater average.\n\nThe Top 10 earned a combined $79.6 million this weekend. That's down 12.7% from last year, when ***Kingdom of the Planet of the Apes*** debuted at #1.\n\nStating atop, Marvel Studios' ***Thunderbolts*** earned $32.3 million this weekend. That's off a rough 56.4% from last weekend, which was already a bit muted. That drop is better than ***Captain America: Brave New World*** (68.3%) earlier this year, but it feels like the film could've done a bit better than this. After all, it had a much more positive response and competition was almost non-existent this weekend.  Not to mention its new title change, [which was heavily promoted on social media.](https://variety.com/2025/film/news/thunderbolts-poster-the-new-avengers-title-change-1236386731/) But it looks like its \"A–\" on CinemaScore pretty much signaled that while word of mouth is good, it's not exceptional enough to convince those skeptical.\n\nThrough 10 days, the film has earned $127.7 million domestically. While the film is posting better daillies than ***Brave New World***, it's still $14 million behind that film through the same point. That film benefitted from lack of competition and a lot of under-performers. ***Thunderbolts***, on the other hand, is about to face more challenges. This weekend, it's losing PLF screens to ***Final Destination: Bloodlines***, which should dethrone it. And then it's gonna face a brutal Memorial Day Weekend with the arrival of ***Lilo &amp; Stitch* and *Mission: Impossible – The Final Reckoning***. What a contrast: a poorly received film with weak competition vs. a well received film with a lot of competition. Right now, it doesn't look like ***Thunderbolts*** will hit $200 million lifetime, which is quite concerning.\n\n***Sinners*** had its biggest drop this weekend. But when your biggest drop means just 33%, you know you're absolutely killing it. The film earned another $22.1 million this weekend, managing to add even more theaters on its fourth weekend. The film has earned an incredible $215.4 million, passing ***Captain America: Brave New World*** as the second biggest film of the year domestically. Depending on how it drops next weekend against ***Final Destination: Bloodlines***, we could be looking at a $270 million domestic total. And it can go higher!\n\n***A Minecraft Movie*** is still on the top 3. It dropped 44%, earning $7.6 million this weekend. The film has earned $408.6 million so far, and it's set to finish with a little below $430 million domestically.\n\nIn fourth place, ***The Accountant 2*** recovered from its rough drop. It eased just 29%, adding $6.7 million this weekend. The film has earned $51.5 million so far, and it should make a nice amount of money before facing brutal competition from ***Mission: Impossible – The Final Reckoning***.\n\n***Clown in a Cornfield*** debuted in fifth place, earning $3.6 million in 2,277 theaters. That's the best debut for Shudder/IFC, and they wisely spent very little on marketing (not even $10 million here). Although with a \"C+\" on CinemaScore and rough competition from ***Final Destination: Bloodlines*** next weekend might prevent it from hitting $10 million.\n\nLionsgate released ***Shadow Force*** in 2,170 theaters, but the film flopped with an abysmal $2.1 million this weekend. Considering the move was very last-minute, it's no surprise that the audience just didn't care for this. They gave it a middling \"B\" on CinemaScore, and with heavy competition on the coming weeks, it's unlikely it will stay long enough to hit $5 million domestically.\n\nVertical also released ***Fight or Flight*** on 2,153 theaters, but it flopped with just $2 million this weekend. Well, we can't really act surprised; this company hasn't been very successful in launching films on wide release. With a \"C+\" on CinemaScore, this is going to disappear quickly from theaters.\n\nIn eighth place, Sony's ***Until Dawn*** dropped 49% this weekend, adding $1.9 million this weekend. The film has earned just $17.9 million, and with ***Final Destination: Bloodlines*** coming up, it won't make it much further than $20 million domestically.\n\n20th Century Studios' ***The Amateur*** dropped a light 39%, earning $1.1 million. The film has amassed $39 million so far.\n\nRounding up the Top 10 was Angel Studios' ***The King of Kings***. It continued falling, now dropping 54% and adding $778,391 this weekend. The film's domestic total stands at $59.1 million so far.\n\nOkay, it was a lot of negativity this weekend, so let's go to the other bright spot of the weekend. A24's ***Friendship***, starring Tim Robinson and Paul Rudd, earned $451,904 in 6 theaters. That's an incredible $75,317 per-theater average, which is the best of the year so far.\n\nOf course, a fantastic performance in limited release does not guarantee a successful wide expansion (***Kinds of Kindness*** comes to mind). But who knows? Maybe Tim Robinson's fanbase could be bigger than expected.\n\n#**OVERSEAS**\n\nIf ***Thunderbolts*** is not lighting the domestic box office on fire, the overseas prospects are also looking quite bad.\n\nOn its second weekend, the film added $34 million overseas this weekend, taking its worldwide total to $271.4 million. That's a rough 60% drop from last weekend (even if we exclude the weekday holidays from last week, it's still a 52% drop), which is steeper than expected, and barely above ***Brave New World***'s second weekend ($35 million). The best markets are the UK ($15.5M), China ($13.8M), Mexico ($11.2M), France ($7.2M) and Australia ($6.4M). With drops like these and heavy competition on its way, there's a strong chance the film could miss $400 million. Considering the $180 million budget, that's flop territory. Damn, what does this mean for the MCU? \n\n***A Minecraft Movie*** added $12.5 million this weekend, taking its worldwide total to $909 million. The best markets are the UK ($71.2M), Germany ($37M), Australia ($34.2M), Mexico ($32M) and China ($28.4M). The billion milestone is starting to feel unlikely.\n\n***Sinners*** added $6.6 million this weekend. Its worldwide total is now $283 million, and should hit $300 million by Friday. The best markets are the UK ($17.4M), France ($8.1M), Australia ($5.5M), Mexico ($3.9M) and Germany ($3.1M).\n\n3 weeks ahead of its domestic debut, ***Karate Kid: Legends*** premiered in 12 markets in Latin America, debuting with $5.7 million. The best market was Mexico with $3 million, although this debut is lower than the 2010 version ($3.5 million). Other markets are Brazil ($860K), Peru ($415K) and Argentina ($320K). It won't hit more markets till the last weekend of May.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nNone.\n\n#**THIS WEEKEND**\n\nWe've got two wide releases, with one clear winner.\n\n***Final Destination: Bloodlines*** should easily win the top spot. It's the sixth installment in the iconic franchise, and follows a group who realizes Death is coming after them... because they should never have existed in the first place. Notably, it includes Tony Todd's final appearance in the franchise, having filmed all his scenes prior to his death in November 2024. This is one of the most iconic horror franchises of the century, with the past 5 films earning a combined $666 million worldwide (hey, that's cool). It's gonna have a pretty great opening. The question is how high can it go?\n\nAnother release is Trey Edward Schults' ***Hurry Up Tomorrow***, which is a companion piece to The Weeknd's album of the same name. It stars The Weeknd, Jenna Ortega, and Barry Keoghan, and follows a fictionalized version of the Weeknd, an insomniac musician on the verge of a mental breakdown who is pulled into an existential odyssey by a mysterious stranger. The Weeknd drew poor reviews for his performance in ***The Idol***, but at least he's working with a great filmmaker like Trey Edward Shults here. Although the film is probably going to be sold for Weeknd fans, and Weeknd fans only. Will the general audience care?\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 33,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pPf4xJiI5inZjzgbLYKRRLkKpABSsGohjJTfPok1EHc.png?auto=webp&amp;s=0a1c5ab0a2aca5bd7494d4c2af9d215d404bcc23"
        },
        "permalink": "/r/movies/comments/1kl5818/may_911_box_office_recap_despite_staying_at_1/"
    },
    {
        "id": "1kksi77",
        "author": "HenryJohnsonAMA",
        "title": "Hi /r/movies - We are David Mamet (director &amp; writer), Evan Jonigkeit (actor, 'X-Men', 'Bone Tomahawk'), Chris Bauer (actor, 'The Wire', 'Thunderbolts*'). Our new film, HENRY JOHNSON, is out now. David's previous work includes 'Glengarry Glen Ross', 'The Verdict', 'Hannibal', more. Ask us anything!",
        "content": "Hi r/movies \\- We are David Mamet (director &amp; writer), Evan Jonigkeit (actor, 'X-Men', 'Bone Tomahawk'), Chris Bauer (actor, 'The Wire', 'Thunderbolts\\*'). Our new film, HENRY JOHNSON, is out now. David's previous work includes 'Glengarry Glen Ross', 'The Verdict', 'Hannibal', more. Ask us anything!\n\nOur movie can be found at [henryjohnsonmovie.com](http://henryjohnsonmovie.com)\n\nHENRY JOHNSON also co-stars Shia LaBeouf.\n\nTrailer:\n\n[https://www.youtube.com/watch?v=\\_5u0INUpDBU&amp;pp=ygUVaGVucnkgam9obnNvbiB0cmFpbGVy](https://www.youtube.com/watch?v=_5u0INUpDBU&amp;pp=ygUVaGVucnkgam9obnNvbiB0cmFpbGVy)\n\nSynopsis:\n\nA man seeks his moral compass while meeting authority figures, including his future cellmate Gene.\n\nWe'll be back at 2 PM ET today to answer your questions. Ask us anything.",
        "upvotes": 89,
        "comments": 217,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/74thub0yqc0f1.png?auto=webp&amp;s=aed144b7b1105ba9009121abcf9678c2cbf46aa0"
        },
        "permalink": "/r/movies/comments/1kksi77/hi_rmovies_we_are_david_mamet_director_writer/"
    },
    {
        "id": "1kl0wm0",
        "author": "lionsgate",
        "title": "Hi! I'm Ana de Armas, star of the upcoming movie From the World of John Wick: Ballerina. Ask me anything!",
        "content": "Hi! I’m Ana de Armas, an actor, dog lover, and occasional stuntwoman. You might know me from Knives Out, Blonde, Knock Knock, or No Time to Die. I’ve been lucky to play a wide range of characters over the years, and I’m here to talk about all of it. From my first roles to what’s next, including From the World of John Wick: Ballerina, which hits theaters June 6. Ask me anything!",
        "upvotes": 9473,
        "comments": 2390,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8nnrisflde0f1.png?auto=webp&amp;s=1536a4a05d4e94b4febe2a311869257955e216f4"
        },
        "permalink": "/r/movies/comments/1kl0wm0/hi_im_ana_de_armas_star_of_the_upcoming_movie/"
    },
    {
        "id": "1kkz85q",
        "author": "MarvelsGrantMan136",
        "title": "Cannes Makes it Official: Nudity and “Voluminous Outfits” Are Banned on Red Carpet",
        "content": "",
        "upvotes": 5234,
        "comments": 416,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BxcRwlAJd9PE2912AmoEyT2qzGqAtzNCucLULq3jaXk.jpeg?auto=webp&amp;s=1af6befdd50fa2ab757b6f93e6d83284f1852470"
        },
        "permalink": "/r/movies/comments/1kkz85q/cannes_makes_it_official_nudity_and_voluminous/"
    },
    {
        "id": "1kl3wjh",
        "author": "fantasyfootballthrow",
        "title": "AMC to Slash Movie Ticket Prices by 50% on Wednesdays",
        "content": "",
        "upvotes": 1190,
        "comments": 89,
        "media": null,
        "permalink": "/r/movies/comments/1kl3wjh/amc_to_slash_movie_ticket_prices_by_50_on/"
    },
    {
        "id": "1kkon51",
        "author": "Sisiwakanamaru",
        "title": "YouTube Takes Further Action Against Fake Movie Trailer Channels After Deadline Investigations",
        "content": "",
        "upvotes": 11423,
        "comments": 703,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SKR7F-7UjbD2UvCrsJsJag9_U5LKnxDcVw6OJJbe4Vc.jpeg?auto=webp&amp;s=7d14bae6b33b6d0f3b611e406ec4ee0132743b02"
        },
        "permalink": "/r/movies/comments/1kkon51/youtube_takes_further_action_against_fake_movie/"
    },
    {
        "id": "1kkxtau",
        "author": "DemiFiendRSA",
        "title": "New image of Bob Odenkirk in 'Nobody 2'",
        "content": "",
        "upvotes": 1319,
        "comments": 115,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/g6b2yiabud0f1.jpeg?auto=webp&amp;s=3d1f36a1b04837e9e8d29f4c45d6ae06f5a60e48"
        },
        "permalink": "/r/movies/comments/1kkxtau/new_image_of_bob_odenkirk_in_nobody_2/"
    },
    {
        "id": "1kl0gtr",
        "author": "AMA_requester",
        "title": "Movie star alligator passes away; appeared in Happy Gilmore and the Alligator films",
        "content": "",
        "upvotes": 672,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7HP6ga0ChJEczRVReSjwyhi2vgcVUhttTFtgtnoKLBE.png?auto=webp&amp;s=989aace3dcfe3d36c7c16f7529a5ce4862e59027"
        },
        "permalink": "/r/movies/comments/1kl0gtr/movie_star_alligator_passes_away_appeared_in/"
    },
    {
        "id": "1kl1kiz",
        "author": "offline55555",
        "title": "What movie did you love as a child, only to find out that it's critically trashed?",
        "content": "Cat in the Hat. It's full of whimsy, with great set and costume design. I would’ve loved to visit a Cat in the Hat-themed park. Mike Myers delivered the perfect blend of quirky and weird—a weirdass giant cat wreaking havoc in a suburban house inhabited by two children.\n\n\nWhy did the critics hate this?\n\n\nI just looked it up, it said it was criticized for having adult humor. Good thing I didn't understand shit lol. Yeah, maybe don't put weird jokes on children's movies. The movie's critical and box office failure led to cancellation of all future live-action adaptations of Dr. Seuss works lmaooooo.\n",
        "upvotes": 336,
        "comments": 683,
        "media": null,
        "permalink": "/r/movies/comments/1kl1kiz/what_movie_did_you_love_as_a_child_only_to_find/"
    },
    {
        "id": "1kkii4y",
        "author": "DirePixel",
        "title": "KUNG FURY 2 Michael Fassbender, Schwarzenegger, David Hasselhoff",
        "content": "",
        "upvotes": 7339,
        "comments": 426,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zWTLO6O9W_PKj1jDrcRaQVkl9wBUkGUXWOV1C2xfX9w.jpeg?auto=webp&amp;s=3d2a1c6b7abea2e442ffc3a130f7c700398225c4"
        },
        "permalink": "/r/movies/comments/1kkii4y/kung_fury_2_michael_fassbender_schwarzenegger/"
    },
    {
        "id": "1kl4mdm",
        "author": "GarthDagless",
        "title": "The Total Recall movie fixed a huge dumb problem with the original short story",
        "content": "I've loved Total Recall for years so I wanted to finally read the short story it was based on, \"We Can Remember It For You Wholesale\" by Philip K Dick. And the short story is... kinda dumb, even compared to a Schwartzeneggar movie. Specifically this one aspect.\n\nThe story and movie are vastly different, but the setup is basically the same in both.\n\nStory and movie: An ordinary man is bored with his average life on earth and endlessly dreams of having adventures on Mars. He discovers a company called Rekal, which boasts it can implant 100% convincing false memories into your mind. He pays for the memory of an epic adventure on Mars in which he's a badass action hero spy. The procedure fails catastrophically because he actually IS a badass spy and just doesn't remember it.\n\nIn the movie, they made a very wise change. Rekal in the film makes sense as a business. Rekal is basically an entertainment company. You have a memory of a thrilling adventure, then it ends and you go back to your life. It's like a movie. You know it wasn't real and yet you have the satisfied feeling of coming home from an epic vacation, only with no personal risk and a lot less financial burden.\n\nHere's what immediately bugged me about the short story. In the story, Rekal is supposed to convince you that their fake memories are real. Period. They give you fake \"souvenirs\" from your adventure. They delete the last couple weeks of your real memories. They even delete your memories of coming to Rekal. You will just wake up at home after your \"adventure\" is over.\n\nMy issue: How is that supposed to work? They expect you to believe you're a spy assassin, but still show up for your shift at T Mobile? To just keep waiting on new orders from the agency that will never show up? What if you try to tell your wife? She'll correctly assume you're insane. What if you get mugged? You'll think you can do John Wick moves on the gunman and then get shot in the face. How can you live an ordinary life believing you're basically a superhero? Rekal is pretty much a company that charges you to ruin your life.",
        "upvotes": 214,
        "comments": 65,
        "media": null,
        "permalink": "/r/movies/comments/1kl4mdm/the_total_recall_movie_fixed_a_huge_dumb_problem/"
    },
    {
        "id": "1kkyspr",
        "author": "Idonteateggs",
        "title": "I have a deep love for the movie MONEYBALL. Here's why...",
        "content": "Moneyball is a 2011 film. It was directed by Bennett Miller and adapted by Steven Zaillian and Aaron Sorkin. \n\nI have seen the movie over 15 times. It took me a while to figure out why I am such a huge fan. Turns out quite a few people on reddit feel the same way. But I think most of the reviews actually miss why the movie resonates so deeply. Here is my theory. It comes down to four things: \n\n**1. It uses the subject of Baseball to show society's evolution into the digial/computer age.** Of course, this is never mentioned in the film. But the real underlying story is how computing technology will eventually disrupt our old way of life. And how some people will kick and scream to stop it, but it is inevitable. Those who identify it first will have the edge. Billy Beane and Pete represent the digital, new way of thinking. The manager and scouts represent the analog age. In a sense it is the most important issue of our time, and it tells it through baseball, America's most beloved, but aging institution...genius. \n\n**2. It is a love/hate letter to capitalism and therefore, America**. Again, never mentioned explicitly. But Moneyball is also a story about all the evil and beauty of capitalism. It is a story about how capitalism serves the ultra-wealthy and creates an unfair advantage for the few who hold the power and resources (\"there are rich teams, there are poor teams... there's fifty feet of shit, then there's us\"). The game is rigged in their favor.  But...capitalism also forces innovation, Billy's place at the bottom forced him to innovate. And in the end, it got baseball closer to a meritocracy, where individuals are accurately compensated for the value they create. For better or for worse, that is America. \n\n**3. The acting, directing and writing are all remarkable**. Bennett Miller came from a documentary background, so he captured the film in a way that felt like a documentary, using real footage in key moments and recreating it in others. But Aaron Sorkin's dialogue adds a pace and flavor that it unbeatable. And then of course, Pitt and Hill are remarkable. Excellent casting. Not to mention Phillip Seymour Hoffman. \n\n**4. Above all else, I believe this movie is about Leadership**. This is the most important one IMO. I don't think anyone watching the movie will realize it until they obsess over it like I did. But really this movie is about Billy Beane's leadership. Humans are addicted to effective leaders. Beane was faced with great adversity, he accurately identified the threat, came up with a solution and found a way to implement his vision, despite great resistance. He also lifted up those around him who believed in his vision, even though they were young and inexperienced. That is what great leaders do. And subconsciously, I think that is the real, strongest draw of the film. And it certainly helps that Pitt is the perfect casting for it. ",
        "upvotes": 389,
        "comments": 120,
        "media": null,
        "permalink": "/r/movies/comments/1kkyspr/i_have_a_deep_love_for_the_movie_moneyball_heres/"
    },
    {
        "id": "1kkrt6j",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'F1'",
        "content": "",
        "upvotes": 817,
        "comments": 275,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/e5fd1ad2mc0f1.jpeg?auto=webp&amp;s=592d1585e9349b615700c2f33ab6d5bd28477c93"
        },
        "permalink": "/r/movies/comments/1kkrt6j/new_poster_for_f1/"
    },
    {
        "id": "1kkrwqo",
        "author": "NoCulture3505",
        "title": "F1 — Official Trailer 2 | Apple TV+",
        "content": "",
        "upvotes": 695,
        "comments": 301,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XN93ksNRttIw5izhHsYL8F-40fP3zywgrI79-mHAaoM.jpeg?auto=webp&amp;s=7546ecb90d8523bfb0b29d48db6dd9fa442c70ac"
        },
        "permalink": "/r/movies/comments/1kkrwqo/f1_official_trailer_2_apple_tv/"
    },
    {
        "id": "1kl6iij",
        "author": "MarvelsGrantMan136",
        "title": "Alex Winter’s ‘FREAKED’ Is Finally Getting A 4K Restoration (Releases Fall 2025)",
        "content": "",
        "upvotes": 110,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FcfSjzdmRzlYM35PXPWR3yrK9nbsTCsTU_jcFCwmgBo.png?auto=webp&amp;s=c23c40c879852afcb097c9f8a0af282d72e1e621"
        },
        "permalink": "/r/movies/comments/1kl6iij/alex_winters_freaked_is_finally_getting_a_4k/"
    },
    {
        "id": "1kl15l7",
        "author": "GirlWhoLovesGod",
        "title": "If you haven't seen \"Batteries Not Included\" yet then I highly reccommend it. Total feel good 80s flick.",
        "content": "If you're into \"feel good\" scifi 80s movies then you should definitely watch \"Batteries Not Included.\" I recently watched it for the first time since my childhood and I loved it. I'm surprised that this movie doesn't get mentioned more often. In my opinion it is a totally underrated family movie that you can enjoy with your kids. ",
        "upvotes": 195,
        "comments": 38,
        "media": null,
        "permalink": "/r/movies/comments/1kl15l7/if_you_havent_seen_batteries_not_included_yet/"
    },
    {
        "id": "1kkzmuy",
        "author": "MarvelsGrantMan136",
        "title": "‘28 Days Later’ Returning to Theaters for One Night Only on May 21",
        "content": "",
        "upvotes": 206,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0vPSCGEgRrPGIwmjCJtG5TuBeNEk-DsR6Z-tq_2aqi0.jpeg?auto=webp&amp;s=6937e3544e064fcc76b984242941a0962e5bf8ab"
        },
        "permalink": "/r/movies/comments/1kkzmuy/28_days_later_returning_to_theaters_for_one_night/"
    },
    {
        "id": "1kkxubs",
        "author": "NoCulture3505",
        "title": "Kevin Costner’s ‘Horizon’ Sparks Sprawling Legal Battle",
        "content": "",
        "upvotes": 244,
        "comments": 73,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6gB2Lg3EHhBK6wMoGHE9pCwDS_50DRqC-AOWMGuV_Dc.jpeg?auto=webp&amp;s=b87cb1dc1f5b6e79285ea5a7dd9adebf3f155563"
        },
        "permalink": "/r/movies/comments/1kkxubs/kevin_costners_horizon_sparks_sprawling_legal/"
    },
    {
        "id": "1kktbgw",
        "author": "DemiFiendRSA",
        "title": "‘Megalopolis’ Making-Of Doc ‘Megadoc’ Lands at Utopia One Year After Francis Ford Coppola’s Self-Funded Epic Sent Cannes Into a Frenzy",
        "content": "",
        "upvotes": 313,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WG5_kMleIBrlOm8d2cJ5K8-r69WuZEsWjCKbfYUPBto.jpeg?auto=webp&amp;s=3f8703adc217be272e1e2272af3885a0e7c04ce4"
        },
        "permalink": "/r/movies/comments/1kktbgw/megalopolis_makingof_doc_megadoc_lands_at_utopia/"
    },
    {
        "id": "1kknfrh",
        "author": "GrueneWiese",
        "title": "Could it be true that George Lucas made and released several “secret films” that hardly anyone has seen?",
        "content": "I was talking to a movie nerd friend on the weekend who is currently working as a camera assistant in Hollywood. He told me that there's a rumor that George Lucas has shot and released two or three small art-house type movies since selling Lucasfilm. However, those were shot under pseudonyms and hard NDAs for everyone involved. Which is why hardly anyone has seen or noticed them?\n\nCan that really be the case?\n\n",
        "upvotes": 760,
        "comments": 249,
        "media": null,
        "permalink": "/r/movies/comments/1kknfrh/could_it_be_true_that_george_lucas_made_and/"
    },
    {
        "id": "1kkfu66",
        "author": "ImaVeganShishKebab",
        "title": "What's a movie scene that you've seen and knew immediately that it was clearly unnecessary and likely a kink belonging to the director?",
        "content": "Here's my provision to this question: the scene where a teenage Leonardo Dicaprio masturbates on top of a roof in Basketball Diaries, out of absolutely nowhere. Also the scene where him and Mark Wahlberg are playing basketball with their butt cheeks hanging out. I get the idea of being a youth, going crazy, and it's a rated R movie for the drugs, but this scene did not advance the plot forward and can be skipped over and you'd miss nothing.",
        "upvotes": 3018,
        "comments": 1615,
        "media": null,
        "permalink": "/r/movies/comments/1kkfu66/whats_a_movie_scene_that_youve_seen_and_knew/"
    },
    {
        "id": "1kkwlls",
        "author": "ChiefLeef22",
        "title": "‘Fury Road’ Co-Stars Zoë Kravitz And Nicholas Hoult Reuniting On David Leitch’s Next Film ‘How To Rob A Bank’ At Amazon MGM Studios",
        "content": "",
        "upvotes": 97,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/iO0s8HhoMqUo3IoB2UhO88pHORJyBrq4KCPoJfHUa4o.jpeg?auto=webp&amp;s=3654cae594838ec09395f0c5a8ef2ee6fbbb5033"
        },
        "permalink": "/r/movies/comments/1kkwlls/fury_road_costars_zoë_kravitz_and_nicholas_hoult/"
    },
    {
        "id": "1kl8x08",
        "author": "Nero3k",
        "title": "Aliens(1986) rewatch",
        "content": "Probably one of my top 3 movies.  Old enough to have seen it opening weekend when I was in HS.   Rewatching it again now.   It never occurred to me that the action really doesn’t start until 70 minutes in.  It was a slow build to stomach action that is just incredible.  \n\nI miss storytelling in movies.  The tension that is created is lost today.  I’ve tried showing my daughter, but she’s become so trained by the MCU era of movies, that the idea of plot building seems lost.  I’ll get off my old man screams at clouds soapbox now.  ",
        "upvotes": 12,
        "comments": 10,
        "media": null,
        "permalink": "/r/movies/comments/1kl8x08/aliens1986_rewatch/"
    },
    {
        "id": "1kks132",
        "author": "KillerCroc1234567",
        "title": "First Poster for ‘Alpha’, directed by Julia Ducournau",
        "content": "",
        "upvotes": 88,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mt3gPZ1BJaeoZS0ZcONZMPfoF9OaZSM34wXnx35dEHY.jpeg?auto=webp&amp;s=d59631f0f3b8f48e730849165f58c94c81d56f22"
        },
        "permalink": "/r/movies/comments/1kks132/first_poster_for_alpha_directed_by_julia_ducournau/"
    },
    {
        "id": "1kkx4ca",
        "author": "Comic_Book_Reader",
        "title": "Cannes: Neon Picks Up Sebastian Stan, Renate Reinsve-Starrer ‘Fjord’",
        "content": "&gt;The re-teaming of Stan and Reinsve, who co-starred in A Different Man, is a family drama focused on the Gheorghiu family, made up of a Romanian father (Stan) and a Norwegian mother (Reinsve), who relocate to a remote village in the mother’s homeland. They quickly form a close bond with the neighboring Halberg family. But when troubling allegations surface, the Gheorghius find themselves at the center of a small-town reckoning.\n\nThe movie is actually based on and inspired by real life events and stories.",
        "upvotes": 45,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wtOo5CYOHtamyXhLCTlNhX8b4dRO1_TaOgvFSIwCmHE.jpeg?auto=webp&amp;s=46fa3e717b6670ced4cc27faa4089ee454be4128"
        },
        "permalink": "/r/movies/comments/1kkx4ca/cannes_neon_picks_up_sebastian_stan_renate/"
    },
    {
        "id": "1kl4z4t",
        "author": "OscarFromSharkTales",
        "title": "Favorite movie so far in 2025?",
        "content": "Feel like movies have been stale recently. Went to see Sinners and Thunderbolts last week, they were both alright. I didn’t really get the hype with Sinners but it is still probably my favorite movie so far in 2025. Either that or Bring Them Down (US RELEASE). What is your favorite movie so far this year? Looking for something to watch after work.",
        "upvotes": 16,
        "comments": 74,
        "media": null,
        "permalink": "/r/movies/comments/1kl4z4t/favorite_movie_so_far_in_2025/"
    },
    {
        "id": "1kkupb0",
        "author": "Jazzlike-Camel-335",
        "title": "Color of Night (1994) - re:Visit",
        "content": "",
        "upvotes": 56,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cXBgcP3keVwuiJ8H_J278_Rh3Ost6xGN-rVgs0-kBZ0.jpeg?auto=webp&amp;s=1822a49bb928529eb5d9fad505c8c23fb1956aeb"
        },
        "permalink": "/r/movies/comments/1kkupb0/color_of_night_1994_revisit/"
    },
    {
        "id": "1kkorwz",
        "author": "FilmWaffle-FilmForum",
        "title": "What is your go-to comfort movie?",
        "content": "I’m pretty sure most people have a movie they watch whenever they need some comfort. It doesn’t necessarily have to be a “feel good” movie either, just something that helps you switch off and enjoy the moment. \n\nMine is far from perfect but Grown Ups (2010) has always been my go-to comfort movie. It’s cheesy but that’s part of what makes it so much fun. ",
        "upvotes": 120,
        "comments": 496,
        "media": null,
        "permalink": "/r/movies/comments/1kkorwz/what_is_your_goto_comfort_movie/"
    },
    {
        "id": "1kktsn8",
        "author": "FilmWaffle-FilmForum",
        "title": "What movies had the potential to be great but ended up falling short?",
        "content": "Prometheus always comes to mind whenever I think of a movie with wasted potential. The world building and cinematography are amazing. It’s let down by poor character development, a rushed story and frustrating character decisions.\n\nWhat other movies can you think of with high potential but poor execution?",
        "upvotes": 51,
        "comments": 144,
        "media": null,
        "permalink": "/r/movies/comments/1kktsn8/what_movies_had_the_potential_to_be_great_but/"
    },
    {
        "id": "1kl1vui",
        "author": "GeneralDoughnut4488",
        "title": "What quotes do you use as motivation?",
        "content": "Something to make yourself smile, hype yourself, hype someone else up or make your friends laugh. \n\nThe one I like to keep coming back to is from The Last Boy Scout after Hallenbeck gets in his car to go home.\n\n\"Nobody likes you. Everybody hates you. You're gonna lose. Smile you fuck.\" And naturally I smile.\n\nLately I've also been quoting alot of Glengarry Glen Ross. \"Fuck you! That's my name!\"",
        "upvotes": 20,
        "comments": 66,
        "media": null,
        "permalink": "/r/movies/comments/1kl1vui/what_quotes_do_you_use_as_motivation/"
    },
    {
        "id": "1kkiyxj",
        "author": "Waldropings",
        "title": "What's your favorite most random insult in a movie?",
        "content": "Mine is when Elliot where in E.T. the extraterrestrial,  he calls his older brother Micheal penis breath. It's always made me laugh and I've used that many times in random situations. Another favorite of mine is Arnold Schwarzenegger, in the Running Man calls Dynamo Light bulb head and Christmas tree. I've used those several times as well. What's yours and how do you use it? *Edit for grammar*",
        "upvotes": 298,
        "comments": 819,
        "media": null,
        "permalink": "/r/movies/comments/1kkiyxj/whats_your_favorite_most_random_insult_in_a_movie/"
    },
    {
        "id": "1kl62b9",
        "author": "Amaruq93",
        "title": "\"Crimson Tide\" at 30 | How the US Navy tried to influence a very different story for the 1995 blockbuster",
        "content": "",
        "upvotes": 11,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/iVf8d8-yX_ADajfDcRNSA0w7jQe2rBcdGNNwVrP1PKE.jpeg?auto=webp&amp;s=780ae4b82768c61e0b94706d37c1a48554c10885"
        },
        "permalink": "/r/movies/comments/1kl62b9/crimson_tide_at_30_how_the_us_navy_tried_to/"
    }
]