[
    {
        "id": "1mibi06",
        "author": "StrangeHarvestAMA",
        "title": "Hi, /r/movies! I am Stuart Ortiz writer/director of STRANGE HARVEST. The film follows two detectives as they investigate the reappearance of the elusive serial killer \"Mr. Shiny,\" who terrorized Southern California decades prior. Hitting theaters this Friday! AMA!",
        "content": "Hi, r/movies! I am Stuart Ortiz writer/director of STRANGE HARVEST. The film follows two detectives as they investigate the reappearance of the elusive serial killer \"Mr. Shiny,\" who terrorized Southern California decades prior. Hitting theaters this Friday! AMA!\n\n**Trailer:**\n\n[https://www.youtube.com/watch?v=tYyTpuk8Zuk&amp;pp=0gcJCfwAo7VqN5tD](https://www.youtube.com/watch?v=tYyTpuk8Zuk&amp;pp=0gcJCfwAo7VqN5tD)\n\n&gt;The film blends elements of [true crime](https://en.wikipedia.org/wiki/True_crime) and horror, following the resurgence of a serial killer known as \"Mr. Shiny\" after a 20-year absence. Set in the [Inland Empire](https://en.wikipedia.org/wiki/Inland_Empire) region of Southern California, the plot centers around a detective pair on the trail of the murderer, who leaves cryptic clues at the crime scenes.\n\nCurrently at [95% on Rotten Tomatoes](https://www.rottentomatoes.com/m/strange_harvest). out in theaters this weekend.\n\nI'll be back at 3 PM ET today to answer any questions. Ask me anything!",
        "upvotes": 1,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/pr29my0qs7hf1.png?auto=webp&amp;s=5eed4c33ec3a7212a66289d8c11e3479385f8f6e"
        },
        "permalink": "/r/movies/comments/1mibi06/hi_rmovies_i_am_stuart_ortiz_writerdirector_of/"
    },
    {
        "id": "1mek9va",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (The Naked Gun / The Bad Guys 2 / Oh, Hi!) Plus Throwback discussions",
        "content": "**New In Theaters**:\n\n* [The Naked Gun](https://old.reddit.com/r/movies/comments/1mek6y9/official_discussion_the_naked_gun_spoilers/?)\n* [The Bad Guys 2](https://old.reddit.com/r/movies/comments/1mek6zd/official_discussion_the_bad_guys_2_spoilers/?)\n* [Oh, Hi!](https://old.reddit.com/r/movies/comments/1mek716/official_discussion_oh_hi_spoilers/?)\n\n**25th Anniversary Throwback Discussion Threads**:\n\n* [The Nutty Professor II: The Klumps](https://old.reddit.com/r/movies/comments/1mek84u/official_throwback_discussion_the_nutty_professor/?)\n\n**Still In Theaters**:\n\n* [Together](https://old.reddit.com/r/movies/comments/1mcudby/official_discussion_together_spoilers/?)\n* [The Fantastic Four: First Steps](https://old.reddit.com/r/movies/comments/1m8n0ic/official_discussion_the_fantastic_four_first/?)\n* [Sorry, Baby](https://old.reddit.com/r/movies/comments/1m8n0k6/official_discussion_sorry_baby_spoilers/?)\n* [Eddington](https://old.reddit.com/r/movies/comments/1m2q3dy/official_discussion_eddington_spoilers/?)\n* [Superman (2025)](https://old.reddit.com/r/movies/comments/1lwutny/official_discussion_superman_2025_spoilers/?)\n\n\n**New On Streaming:**\n\n* [War of the Worlds (2025)](https://old.reddit.com/r/movies/comments/1mek72y/official_discussion_war_of_the_worlds_spoilers/?)\n* [Happy Gilmore 2](https://old.reddit.com/r/movies/comments/1m9hjw9/official_discussion_happy_gilmore_2_spoilers/?)\n* [Heads of State](https://old.reddit.com/r/movies/comments/1lr5yb4/official_discussion_heads_of_state_spoilers/?)\n* [The Old Guard 2](https://old.reddit.com/r/movies/comments/1lr5ycn/official_discussion_the_old_guard_2_spoilers/?)\n* [Ice Road: Vengeance](https://old.reddit.com/r/movies/comments/1lr5ye1/official_discussion_ice_road_vengeance_spoilers/?)\n* [KPop Demon Hunters](https://www.reddit.com/r/movies/comments/1lghony/official_discussion_kpop_demon_hunters_spoilers/)\n* [Echo Valley](https://www.reddit.com/r/movies/comments/1lar0eb/official_discussion_echo_valley/) \n* [Deep Cover](https://www.reddit.com/r/movies/comments/1lar0ej/official_discussion_deep_cover/)",
        "upvotes": 45,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1mek9va/official_discussion_megathread_the_naked_gun_the/"
    },
    {
        "id": "1mialx5",
        "author": "MarvelsGrantMan136",
        "title": "New Image of Alan Ritchson in 'Motor City' - When a 70s-era everyman is framed by a ruthless local gangster, he emerges from prison determined to reclaim his life by any means necessary.",
        "content": "",
        "upvotes": 1493,
        "comments": 311,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wnw3rco8n7hf1.jpeg?auto=webp&amp;s=488ea9737d232eeb466469e01e43f69b2e7c0f05"
        },
        "permalink": "/r/movies/comments/1mialx5/new_image_of_alan_ritchson_in_motor_city_when_a/"
    },
    {
        "id": "1mibkh4",
        "author": "MarvelsGrantMan136",
        "title": "RENTAL FAMILY | Official Trailer | Searchlight Pictures",
        "content": "",
        "upvotes": 857,
        "comments": 94,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VbHPHVN9WHpxxF-Ntmodbk0DrnMcBXP4laMQAiLwz5Y.jpeg?auto=webp&amp;s=317f90829833b75d9162ad16ccf0a7b8e95cfee2"
        },
        "permalink": "/r/movies/comments/1mibkh4/rental_family_official_trailer_searchlight/"
    },
    {
        "id": "1mi92h7",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'Cold Storage' Starring Joe Keery, Georgina Campbell &amp; Liam Neeson - When a mutating, highly contagious fungus escapes a sealed facility, two young employees - joined by a grizzled bioterror operative - must survive the wildest night shift ever to save humanity from extinction.",
        "content": "",
        "upvotes": 869,
        "comments": 117,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ahfje099c7hf1.jpeg?auto=webp&amp;s=ca68102bdf6904089057d349e1368fbbfdac26d6"
        },
        "permalink": "/r/movies/comments/1mi92h7/official_poster_for_cold_storage_starring_joe/"
    },
    {
        "id": "1midj8f",
        "author": "MarvelsGrantMan136",
        "title": "Spider-Punk Animated Feature From Daniel Kaluuya &amp; Ajon Singh In Development At Sony",
        "content": "",
        "upvotes": 484,
        "comments": 64,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pJExZf1JBEEeL0rmxONefUArYexmHdoeG7p-UvXDASE.jpeg?auto=webp&amp;s=6a69313648ea2b816473f3635e87faa31e94c177"
        },
        "permalink": "/r/movies/comments/1midj8f/spiderpunk_animated_feature_from_daniel_kaluuya/"
    },
    {
        "id": "1mhx8me",
        "author": "BunyipPouch",
        "title": "New Image of Dev Patel in Horror-Thriller 'Rabbit Trap' - A married couple of musicians move from London to a cottage in Wales to complete their new album. They accidentally record a mystical sound never heard before and gradually disconnect from reality.",
        "content": "",
        "upvotes": 3985,
        "comments": 178,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ax2zzmre34hf1.jpeg?auto=webp&amp;s=3d1ea816c0e14ec93d1fe08c9054c1212e2c25dd"
        },
        "permalink": "/r/movies/comments/1mhx8me/new_image_of_dev_patel_in_horrorthriller_rabbit/"
    },
    {
        "id": "1mi7w0g",
        "author": "BunyipPouch",
        "title": "First Poster for Psychological-Thriller 'Trust' - Starring Sophie Turner ('Games of Thrones') - A Hollywood actress hides in a remote cabin after a scandal, only to find herself betrayed and fighting for survival against someone she once trusted.",
        "content": "",
        "upvotes": 403,
        "comments": 117,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5rzzwkyy27hf1.jpeg?auto=webp&amp;s=6c0bb974219af2f02078e4224467d005b9e92b97"
        },
        "permalink": "/r/movies/comments/1mi7w0g/first_poster_for_psychologicalthriller_trust/"
    },
    {
        "id": "1mhhfx2",
        "author": "MarvelsGrantMan136",
        "title": "Official poster for Hikari's 'Rental Family' - A lonely American actor (Brendan Fraser) living in Tokyo starts working for a Japanese \"rental family\" company to play stand-in roles in other people's lives. Along the way, he finds surprising connections and unexpected joys within his built-in family.",
        "content": "",
        "upvotes": 11392,
        "comments": 255,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0dbsuebnz0hf1.jpeg?auto=webp&amp;s=79788da4f52b44dec8bbc13713ad978cbafe3f95"
        },
        "permalink": "/r/movies/comments/1mhhfx2/official_poster_for_hikaris_rental_family_a/"
    },
    {
        "id": "1mi9ztx",
        "author": "KillerCroc1234567",
        "title": "Jay Kelly | Official Teaser | Netflix",
        "content": "",
        "upvotes": 142,
        "comments": 81,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ZW9CsbJ8R8Vlyt4xZB6GDmlwLGHUgliR2MUiq7pwan0.jpeg?auto=webp&amp;s=7528cb1520b74be7c86e97dddc6448920e476ec8"
        },
        "permalink": "/r/movies/comments/1mi9ztx/jay_kelly_official_teaser_netflix/"
    },
    {
        "id": "1mhgtp1",
        "author": "CosmosisJones42",
        "title": "The Disney+ Curse: How the Streaming Service Hurt Marvel, Star Wars and Pixar Brands",
        "content": "",
        "upvotes": 8259,
        "comments": 1579,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OEfbcb8bwCMZ7M2v5knWu4jz2cCvn0TgGyl-13U_hqE.jpeg?auto=webp&amp;s=b09025c6edc8a8a2316fc710e83259785b48668c"
        },
        "permalink": "/r/movies/comments/1mhgtp1/the_disney_curse_how_the_streaming_service_hurt/"
    },
    {
        "id": "1mht1kb",
        "author": "ThinWhiteDuke00",
        "title": "James Cameron Reveals the Colossal Challenges of his Upcoming ‘Ghosts of Hiroshima’ Film",
        "content": "“This might be the most challenging film I ever make. I don’t 100% have my strategy fully in place [right now] for how I want to see it, for how I want to shield people from the horror, but still be honest. Also, for how I can find some kind of poetry, beauty, or spiritual epiphany in it somehow, which I know must be there. It’s there in every human story. So, it’s going to be very challenging. I might not even be up to the task, but that never stopped me before.”",
        "upvotes": 1331,
        "comments": 169,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6SiBmXL9CQwkU3ddecbPZOdvtO3aVN9s36k5mV0pNYI.jpeg?auto=webp&amp;s=22d2086b16ea77c28a63262f08b94a3f9a0a19a8"
        },
        "permalink": "/r/movies/comments/1mht1kb/james_cameron_reveals_the_colossal_challenges_of/"
    },
    {
        "id": "1mhywnn",
        "author": "Parking_Figure_7627",
        "title": "What's a movie you always assumed was considered good, only to find out much later it's largely considered terrible?",
        "content": "I know taste is subjective and whatnot, but I recently had this revelation with The Butterfly Effect (2004). I hadn't seen it in forever but at the time I thought it was fantastic. I had no idea critics hated it and was frequently ragged on (especially Ashton Kutcher) despite it being a commercial success. ",
        "upvotes": 574,
        "comments": 1121,
        "media": null,
        "permalink": "/r/movies/comments/1mhywnn/whats_a_movie_you_always_assumed_was_considered/"
    },
    {
        "id": "1miab84",
        "author": "Key_Clock1683",
        "title": "Kid'n Play celebrates 35 years of House party",
        "content": "",
        "upvotes": 75,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WLofulBSbgtet8rHdEImU0hvg5cJxMGcl8PaZ9DKF1w.jpeg?auto=webp&amp;s=f6a3bed8071cd347d51bd7d05fb9d96d1ff60780"
        },
        "permalink": "/r/movies/comments/1miab84/kidn_play_celebrates_35_years_of_house_party/"
    },
    {
        "id": "1mi6zpa",
        "author": "prolelol",
        "title": "I watched all 6 Sharknado movies, and here are my thoughts.",
        "content": "I always make sure to watch at least one dumb shark movie every summer, but since *Sharknado* has 6 movies in total,  it took me a few years to get ready,  and this summer, I finally gave them all a shot. Here are my thoughts on it.\n\n## **Sharknado (2013)**:\n\nBro thinks he's Mitch Buchannon. I think it’s pretty much what I expected: not good, but it does the job and is easy to sit through. I'm not trying to be ridiculous, but the quality felt more like a cancelled 90-minute TV pilot about some average Californian dude who thinks he can save the world.\n\nI wasn’t really a fan of the cast. Ian Ziering as Fin didn’t do a great job in the lead. He's just kind of blah. And Tara Reid mostly stood around looking like she was waiting for the paycheck.\n\nI think the first 20 minutes were probably my favorite part. It felt just chill until the CGI sharks crashed the party. And honestly, it just keeps getting worse from there. The CGI was ridiculously bad, but I didn’t mind it too much until the way it was executed made it kind of less watchable. I didn't find the final act satisfying, either.\n\nAll in all, I still enjoyed it. I just needed a bad shark movie to watch this summer, and this one was worth my time. I'll give it credit for that.\n\n## **Sharknado 2: The Second One (2014)**:\n\nIf I'm watching a disaster movie, I'd always prefer it to be set in NYC, but this one was, unfortunately, worse than the first one.\n\nThe first one was rough, sure, but I still expected at least some improvement for this one. It just didn't work. It has a lot of cringe dialogue, a script that sucks, and scenes so obviously staged that you can feel the set in the background. The Mayor of NYC and the fire chief literally wanted this one guy to deal with flying sharks in a tornado, like, they weren’t doing the jobs they were meant to do. That part was so bad it was hilariously cringe.\n\nThe acting was just so bad. Seriously, how did Vivica A. Fox go from being a badass in *Kill Bill: Vol. 1* to being annoying in some dumb shark sequel? At least Ian Ziering and Tara Reid were better in this one than in the first.\n\nAside from everything else, I enjoyed the last 10 minutes. Random people from the street battling sharks as they fall from the sky, a guy who thinks he is a hero riding a shark through a tornado, and the chainsaws as weapons. That whole sequence was great for a bad movie.\n\nOverall, I think it’s just marginally worse than the first, but still watchable if you’re in the mood for some dumb movies. There are a bunch of ridiculous moments you have to sit through, sure, but in the end, it’s just harmlessly dumb fun.\n\n## **Sharknado 3: Oh Hell No! (2015)**:\n\nNow, this definitely gives me \"*It’s all about family*\" vibes.\n\nI actually watched it, like, a decade ago. It was my first Sharknado, and I just happened to catch it on TV. I remember Frankie Muniz being in it… and it being terrible. Now that I was making my way through the entire Sharknado franchise, it felt definitely slightly better on a second viewing, but that’s not saying much. It’s still bad, cringey, and ridiculous, but also an easy watch.\n\nI still liked the first two movies better. This one just felt… kind of lazy, I guess. It’s definitely because I didn’t enjoy the Washington setting. The atmosphere felt cold, and the action started in less than 10 minutes, which made me think they were filming a Sharknado-style movie or something. Honestly, I wasn’t a fan of the film’s execution, but the second half was fun because it had a lot of ridiculous moments.\n\nNo surprise the acting was bad, but maybe I'm just such a *Baywatch* fan, I thought David Hasselhoff was definitely one of the best parts of the movie. I’m also a fan of *Malcolm in the Middle*, but Muniz’s performance was pretty forgettable.\n\nOverall, it’s definitely safe to say it's worse and dumber, but it’s still not completely terrible if you just want to sit down and continue watching something dumb.\n\n## **Sharknado 4: The 4th Awakens (2016)**:\n\n\"*It's a cow-nado!*\"\n\nIt's crazier, feels bigger, and is more ridiculous. It's honestly the best one since the first Sharknado. The franchise has just turned into something supernatural now, which makes it even more entertaining.\n\nI mean, the quality was still on the same level. It never tried to improve anyway. However, it's the execution that worked better than the last two movies. It has some fun ideas and a few especially surprising moments. I'm not trying to say it's a must-see. It's still a bad movie, but it's slightly better than the others and created some great \"so bad, it's good\" vibes.\n\nThe fact that Caroline Williams, the leading actress from *The Texas Chainsaw Massacre 2*, was in it as a worker in a chainsaw shop, and that I've just found out now that two actors who played Leatherfaces, especially the original, were also in it, may be one of the nicest surprises they have brought to the franchise. It's such a fun reference.\n\nI've mentioned before that I'm a *Baywatch* fan, so it was also really nice to see David Hasselhoff with the other two Baywatch stars in one scene together. Christine being credited as herself is ridiculous, too.\n\nOverall, it has some fun references, flying cows, a flying human-robot, and solid entertainment. There’s no reason to skip this one.\n\n## **Sharknado 5: Global Swarming (2017)**:\n\nIn my opinion, this was definitely the worst Sharknado so far. The previous one was entertaining enough, like, we had everything else, but this one is trying too hard to be cool. Honestly, after 5 bad movies in a row, I think it's just getting tired. Yes, the concept about the world being destroyed by a Sharknado sounds fun for people who enjoy bad movies, but the plot is just kind of boring once you get 5 movies in. I wasn't much of a fan of the London setting, either.\n\nThe fact that they cast a bunch of women with cosmetic plastic surgery and probably aren't even actors just makes it worse. I think the actors who play Fin and Nova do a good job for the most part, but Tara Reid’s acting was worse than anything else. She really couldn’t show any emotion, like, she just didn’t seem to be having fun acting, even since the first.\n\nThe last few minutes were actually the most fun part of the movie, especially the twist ending. I’m definitely looking forward to the next one because of it, but honestly, the next one being the last feels right at this point.\n\nOverall, it’s still not that bad as entertainment. It was fine. What matters is that the formula is almost exactly the same as the rest, which helped keep it still watchable. That was enough for me.\n\n## **The Last Sharknado: It’s About Time (2018)**:\n\nWell, let me guess... first it was just sharks in a tornado, and now we've got time travel, dinosaurs, a robotic shark, and a robot head that shoots lasers from its eyes. Man, this final ride was such a blast! It's weird to say that about a bad franchise.\n\nIt’s the last Sharknado, but it really belongs in my top 3. It was really dumb and all over the place, like they were prepared to make it as ridiculous as possible because it’s the ending, but it was such a fun movie. It even gave me the vibes of *Army of Darkness* and *Back to the Future 3*.\n\nOne of the most ridiculous things was when they brought back the original actor who played the son, after he had been replaced by someone else in the previous movies. Whether that was meant to be satire or not, it was great. The acting wasn’t terrible this time around. Vivica A. Fox was annoying in the second movie, but actually grew on me in this one.\n\nI really liked how they used the time machine to jump into the very first scene of the first movie. The final sequence was so absurd, but really kind of awesome. I feel the ending didn’t bother tying up everything, but I don’t mind. It’s a dumb franchise, and I’m just glad I saw it through.\n\nOverall, it's been a fun ride, I'll admit. I'm just glad all 6 movies stuck to pretty much the same formula. If you enjoyed the first one enough, you're safe to enjoy the rest too.\n\n**Finally, here's my ranking**:\n\n1. *Sharknado* (2013)\n\n2. *Sharknado: The 4th Awakens* (2016)\n\n3. *The Last Sharknado: It's About Time* (2018)\n\n4. *Sharknado 2: The Second One* (2014)\n\n5. *Sharknado 3: Oh Hell No!* (2015)\n\n6. *Sharknado 5: Global Swarming* (2017)\n\nI rated the first 3 three and a half out of five, and the last 3 three stars. Just wanted to add that [this shot](https://old.reddit.com/r/CineShots/comments/1mfa4lz/sharknado_3_oh_hell_no_2015/) from *Sharknado 3: Oh Hell No!* is my absolute favorite one, lol.",
        "upvotes": 108,
        "comments": 65,
        "media": null,
        "permalink": "/r/movies/comments/1mi6zpa/i_watched_all_6_sharknado_movies_and_here_are_my/"
    },
    {
        "id": "1mhnipu",
        "author": "ReztB",
        "title": "Name a movie where the supporting character completely steals the show from the main character",
        "content": "For me a clear example has to be [The Dark Knight](https://www.sceneit.app/movie/155). \n\nHeath Ledger's Joker steals the spotlight from Christian Bale's Batman. \n\nHe adds subtle little details, like the way he moves his tongue, that make the Joker impossible to forget. \n\nHe absolutely owns that movie! ",
        "upvotes": 2052,
        "comments": 1566,
        "media": null,
        "permalink": "/r/movies/comments/1mhnipu/name_a_movie_where_the_supporting_character/"
    },
    {
        "id": "1mi2pai",
        "author": "moal09",
        "title": "The 1994 Crow has one of the best and simplest setups for a revenge movie that I've seen",
        "content": "It opens with one of the most brutal home invasion scenes of the '90s, establishes all the villains as absolutely irredeemable scumbags and then sets an invincible protagonist on them.  It barely wastes any time before he's on the first dude.\n\nI know it's based on a comic, but it almost reminds me of a precursor to John Wick in some ways.  The way the audience can easily root for every single dude on his list to die a horrible death.  ",
        "upvotes": 178,
        "comments": 40,
        "media": null,
        "permalink": "/r/movies/comments/1mi2pai/the_1994_crow_has_one_of_the_best_and_simplest/"
    },
    {
        "id": "1mhirfe",
        "author": "Ultimater3333",
        "title": "Shelby Oaks - Official Redband Trailer",
        "content": "",
        "upvotes": 2620,
        "comments": 237,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BFqWqR3boMgsVlCAHgsJ5ulEXCZ0vSuXdOZVukPObrc.jpeg?auto=webp&amp;s=08c7d0342eecafebbf8b036d0b70d3350d8e13c5"
        },
        "permalink": "/r/movies/comments/1mhirfe/shelby_oaks_official_redband_trailer/"
    },
    {
        "id": "1micp38",
        "author": "t_huddleston",
        "title": "Master and Commander - let's have another one",
        "content": "This week sees the 4k re-release of one of my favorite films, Peter Weir's classic Master and Commander: The Far Side of the World. (In a just universe we'd have had a half-dozen of these instead of those Jack Sparrow movies, but anyway.)  This is one of those titles that maybe wasn't a box-office smash at the time, but it remains very highly regarded, and its reputation as the ultimate \"dad movie\" has only grown over the years. It's based on a long-running series of books, so the setup could clearly support an ongoing franchise if the box-office was there. Or even just a one-off \"Aubrey and Maturin's Last Adventure\" movie would be welcome.\n\nWe still have Crowe and Bettany. I know Weir's retired, but I could see a Villeneuve, or even a Robert Eggers with his devotion to historical accuracy, picking up the reins, if he wanted to take a break from horror movies. Anybody else up for a legasequel or two? I mean, why not? We've had multiple movies about a guy who can talk to ants, why not one more voyage with Captain Jack?",
        "upvotes": 38,
        "comments": 22,
        "media": null,
        "permalink": "/r/movies/comments/1micp38/master_and_commander_lets_have_another_one/"
    },
    {
        "id": "1mhn2h3",
        "author": "indiewire",
        "title": "Inside ‘The Naked Gun’ Scene Director Akiva Schaffer Had to Fight to Keep",
        "content": "",
        "upvotes": 1427,
        "comments": 142,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0uF-VnQBK5wJ2yWAq7cdQMuwM9wMfhs_J-qhnYqf3mY.jpeg?auto=webp&amp;s=ce5c164349fdbe13d001a0c53daa3136bbd01103"
        },
        "permalink": "/r/movies/comments/1mhn2h3/inside_the_naked_gun_scene_director_akiva/"
    },
    {
        "id": "1mhahw9",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for ‘The Toxic Avenger’",
        "content": "",
        "upvotes": 6743,
        "comments": 472,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8entwqvsjzgf1.jpeg?auto=webp&amp;s=eb1b528a9bcf1c36b26334faeecd1106ad44c024"
        },
        "permalink": "/r/movies/comments/1mhahw9/new_poster_for_the_toxic_avenger/"
    },
    {
        "id": "1mhhe8w",
        "author": "Comic_Book_Reader",
        "title": "SHELBY OAKS - Official Trailer - In Theaters October 3",
        "content": "",
        "upvotes": 2119,
        "comments": 219,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BFqWqR3boMgsVlCAHgsJ5ulEXCZ0vSuXdOZVukPObrc.jpeg?auto=webp&amp;s=08c7d0342eecafebbf8b036d0b70d3350d8e13c5"
        },
        "permalink": "/r/movies/comments/1mhhe8w/shelby_oaks_official_trailer_in_theaters_october_3/"
    },
    {
        "id": "1mhsreh",
        "author": "MarvelsGrantMan136",
        "title": "‘Greenland 2: Migration’ Sets January 9, 2026 Release Date From Lionsgate",
        "content": "",
        "upvotes": 495,
        "comments": 76,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/DUIwRsw_DkdSj04Z2Ic4avwfQI3VBTnky4VDHrGU9sU.jpeg?auto=webp&amp;s=5301fe7415797347d912098a352a0c7ddedba76e"
        },
        "permalink": "/r/movies/comments/1mhsreh/greenland_2_migration_sets_january_9_2026_release/"
    },
    {
        "id": "1mhpslq",
        "author": "Pleasant_Garlic8088",
        "title": "Who is the most believable married couple from a movie?",
        "content": "To my mind Roy Scheider and Lorraine Gary are entirely believable as Martin and Ellen Brody in \"Jaws.\"\n\nI'm not sure how much of the dialog and gestures and mannerisms between them were scripted or improvised, how many takes were shot to get everything right, etc.  But their chemistry and bond seem completely natural to me.",
        "upvotes": 664,
        "comments": 389,
        "media": null,
        "permalink": "/r/movies/comments/1mhpslq/who_is_the_most_believable_married_couple_from_a/"
    },
    {
        "id": "1mi7pgm",
        "author": "josephgordonreddit",
        "title": "THE CHORAL | Official Trailer (2025)",
        "content": "",
        "upvotes": 32,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ZrD8sr7hHxXIiMB4QA3DVQX3n6fJMEkr2owipJlG2pM.jpeg?auto=webp&amp;s=94eb0accd183d93b28cf7b7f6fe94b3c0703bfa4"
        },
        "permalink": "/r/movies/comments/1mi7pgm/the_choral_official_trailer_2025/"
    },
    {
        "id": "1mhg05g",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Mark Wahlberg and LaKeith Stanfield in Shane Black's 'Play Dirty' - Follows a thief and his crew who come across a major heist that pits them against a South American dictator, the New York mob and the world’s richest man.",
        "content": "",
        "upvotes": 1491,
        "comments": 608,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ec07300vp0hf1.jpeg?auto=webp&amp;s=acb41b27070242416440872de5978720bb189131"
        },
        "permalink": "/r/movies/comments/1mhg05g/first_image_of_mark_wahlberg_and_lakeith/"
    },
    {
        "id": "1midbxw",
        "author": "CdnDude",
        "title": "Mike Bigalow, director of deuce Bigalow: European gigolo",
        "content": "Anyone have anything on this guy? His IMDb is literally just that credit and nothing else. No interviews or other roles in the industry?  I feel like this is a fake person they made up. Sounds off in the comments below!! I'm obsessed to say the least \n\nhttps://www.imdb.com/name/nm1600805/?ref_=ext_shr",
        "upvotes": 14,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YJolf85vq6RUrTd2U94GkySkDfrAM6M_4RXVzKsSMpU.jpeg?auto=webp&amp;s=29d798b9cd42f67511cad6ce519eed03319005ab"
        },
        "permalink": "/r/movies/comments/1midbxw/mike_bigalow_director_of_deuce_bigalow_european/"
    },
    {
        "id": "1midbmz",
        "author": "Task_Force-191",
        "title": "Official Poster for 'The Choral' starring Ralph Fiennes - Set In 1916, Yorkshire, a choral society’s male members enlist in WW1, leaving the demanding Dr. Guthrie (Ralph Fiennes) to recruit youths. Together, they experience the joy of singing while the boys grapple with looming drafts into the army",
        "content": "",
        "upvotes": 14,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3gmgy9hx58hf1.jpeg?auto=webp&amp;s=f132a209db04d9deefacd0b8c42544a823336821"
        },
        "permalink": "/r/movies/comments/1midbmz/official_poster_for_the_choral_starring_ralph/"
    },
    {
        "id": "1mhcvzg",
        "author": "MarvelsGrantMan136",
        "title": "New Images from Noah Baumbach 'Jay Kelly' - Follows a friendship between a famous actor (George Clooney) and his manager (Adam Sandler) as they travel through Europe and reflect on their life choices, relationships, and legacies.",
        "content": "",
        "upvotes": 1884,
        "comments": 126,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zte7i3k740hf1.jpeg?auto=webp&amp;s=c53ec469fa483cf9289cc693a00e4d07fc0a3440"
        },
        "permalink": "/r/movies/comments/1mhcvzg/new_images_from_noah_baumbach_jay_kelly_follows_a/"
    },
    {
        "id": "1mhqmqa",
        "author": "SanderSo47",
        "title": "August 1-3 Box Office Recap – Despite staying at #1, 'The Fantastic Four: First Steps' collapses 67.2% domestically, the 7th worst drop in the MCU. It also collapses 60% overseas, earning $367M worldwide. 'The Bad Guys 2' and 'The Naked Gun' open solidly with $21.9M and $16.8M, respectively.",
        "content": "https://preview.redd.it/airvbn7ln2hf1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=a24f9ac3715eef6e282f1882ec272f5c6de39bfb\n\nWell, that wasn't really fantastic.\n\n***The Fantastic Four: First Steps*** easily topped the box office on its second weekend, but in the process, it posted one of the steepest second weekend drops in the whole MCU. Three newcomers arrived at the scene, but it was a mixed bag; ***The Bad Guys*** wasn't that far off from the original, ***The Naked Gun*** was off to a solid start, while ***Together*** over-performed projections.\n\nThe Top 10 earned a combined $118.4 million this weekend. That's down 28.9% from last year, when ***Deadpool &amp; Wolverine*** held the top spot against other newcomers like ***Trap*** and ***Harold and the Purple Crayon***.\n\n***The Fantastic Four: First Steps*** added $38.6 million this weekend. That's down a very poor 67.2% from last week, which is the seventh worst in the MCU. That drop is worse than ***Doctor Strange in the Multiverse of Madness*** (67.0%) and it's not far off from ***Thor: Love and Thunder*** (67.7%), ***Black Widow*** (67.8%), and ***Captain America: Brave New World*** (68.3%). It's even worse than the 2005 film (59.4%) and ***Rise of the Silver Surfer*** (65.5%), and it's incredibly close to ***Fant4stic*** (68.2%)\n\nEven compared to this year, it's a far larger drop than ***Superman*** (53.2%). This is a very brutal drop, especially considering the film had the best reception of the ***Fantastic Four*** films and it still had PLF screens. But considering that it was very front-loaded on its opening weekend (the worst internal multiplier in the MCU), it was clear that fan hype didn't translate into general audience's interest. Or that maybe word of mouth isn't as good as it appears.\n\nThrough 10 days, the film has earned $197.1 million domestically. It has already surpassed the lifetime gross of all ***Fantastic Four*** films, although that was expected already. The opening weekend was $7.3 million behind ***Superman***, and ***F4*** is now $39.1 million behind it through the same point. The film is losing its IMAX screens to ***Weapons*** and ***F1*** this weekend, which means it's heading for another rough drop this weekend. The film seemed like an easy $300 million grosser, but right now it seems like it will close with around $280 million. Which means the film will finish with just a little above what the 2005 film did in adjusted inflation ($272 million).\n\nIn second place, Universal/DreamWorks' ***The Bad Guys 2*** debuted with $21.9 million in 3,852 theaters. That's not far off from the original's debut ($23.9 million), which is honestly a good sign, considering sequels often drop big from the originals.\n\nOn its own, this is a solid start. But it still feels like the film could've done a bit better than this. After all, the original legged out pretty well and the sequel still retained much of its humor and tone. But especially considering animated films have been faring poorly this year, so there wasn't much competition. Perhaps it looks like there's a ceiling to ***The Bad Guys***, and even great reviews (86% on RT) won't change that.\n\nAccording to Universal, the audience was a 50/50 split between men and women, 29% were parents, and 35% were kids under 12. They gave it a great \"A\" on CinemaScore, which is the same grade as the original. There's basically no animated competition until ***Zootopia 2*** in November (***Ne Zha 2*** opens this month, but it's more niche than these titles in America). Based on this, the film should earn around $75 million domestically.\n\nIn third place, Paramount's ***The Naked Gun*** debuted with $16.8 million in 3,344 theaters. That's the second best debut in the franchise, behind ***The Naked Gun 2½: The Smell of Fear*** ($20.8 million), although in terms of inflation, it had the least attended opening of the franchise. At least, it had the best debut for director Akiva Schaffer, and it has already outgrossed ***Hot Rod*** ($13.9 million) and ***Popstar: Never Stop Never Stopping*** ($9.6 million). It was also Liam Neeson's biggest debut as leading man since ***Taken 3*** ($39.2 million).\n\nThis is a very solid debut, considering theatrical comedies have been very scarse lately. Paramount has tried to revive the brand for decades; one with Leslie Nielsen reprising it one last time, and then Ed Helms after Nielsen's death. But it didn't gain real buzz until 2021, when Seth MacFarlane joined as producer and decided that Liam Neeson should take the mantle. Then Akiva Schaffer was hired as director, and the film was finally moving forward it.\n\nCredit must go to an excellent marketing campaign: the teaser trailer was absolutely hilarious, confirming it would maintain the same spirit as the original films (the OJ joke was just cherry on top). This was followed by hilarious posters, which raised awareness. And turns out Schaffer knew what he was cooking: it's sitting at a fantastic 90% on RT, which is the best in the franchise.\n\nAccording to Paramount, 62% of the audience was male and 31% was 45 and over. While there's the belief that young audiences don't go to theaters, it seems like they made an exception for ***The Naked Gun***; 47% of the audience was in the 18-34 demographic, meaning that the film succeeded in attracting Millennials and Zoomers. This is very encouraging, suggesting there's still an audience for comedies. They gave it a very good \"A–\" on CinemaScore, which is the same grade as the original. The film should enjoy some good holds through a very weak August. Depending on how it holds next week, ***The Naked Gun*** could finish with over $50 million domestically.\n\n***Superman*** dropped 45%, adding $13.7 million this weekend. The film has amassed $316 million so far, and it's still set to finish with over $350 million domestically.\n\n***Jurassic World Rebirth*** earned $8.7 million this weekend, easing 34%. The film's domestic total stands at $317.6 million. Last week, it was $30.8 million behind ***Dominion***, and that gap has grown to $32.8 million. It officially has no shot in hitting $350 million.\n\nNeon's ***Together*** hit sixth place with $6.7 million ($10.8 million) in 2,302 theaters. That's a pretty great start, and it's even better than Neon's ***Cuckoo***, which flopped with just $6.2 million lifetime around this point last year.\n\nThe film has gained considerable buzz after its debut at Sundance, achieving a great 91% on RT. Even though it was also plagued with controversy over a plagiarism lawsuit, general audiences don't really care about that. They only care if the film looks intriguing. With ***I Know What You Did Last Summer*** failing to light the world on fire, this was a pretty good spot to open a buzzy horror title.\n\nAccording to Neon, 52% of the audience was male, and 77% was 35 and under. They gave it a weak \"C+\" on CinemaScore, which is not actually bad for a horror film. The film faces tough horror competition this week, as the buzzy ***Weapons*** is making its way to theaters. But ***Together*** has enough gas to hit $25 million, which is pretty good for a body horror.\n\n***F1*** continues holding well. It added $4.1 million, which is off just 34% from last week. The film has earned $173.3 million domestically, and it's gonna be re-released in some IMAX theaters this week. \n\n***I Know What You Did Last Summer*** fell a rough 50%, grossing $2.6 million this weekend. The film has amassed $29.3 million, and it's set to finish as the lowest grossing film in the franchise.\n\nWell, ***Smurfs*** are now bluer than usual this weekend. With heavy competition from ***The Bad Guys 2***, the film collapsed an abysmal 67%, earning just $1.8 million this weekend. The film has earned a poor $29.3 million, and it will vanish quickly from theaters.\n\nRounding up the Top 10 was Universal's ***How to Train Your Dragon***, which dropped 54% for a $1.3 million weekend. The film's domestic total stands at $260.3 million.\n\n#**OVERSEAS**\n\nYou thought America was the only place where ***Fantastic Four*** collapsed?\n\n***The Fantastic Four: First Steps*** earned $39.6 million overseas, for a $367 million worldwide total. Good news: it's already the biggest ***Fantastic Four*** film, passing the 2005 film ($333 million). Now the real bad news: that's a poor 60% drop from last week, which is larger than usual even for a superhero film. For contrast, ***Superman*** dropped 53% and had a higher second weekend overseas ($45 million).\n\nThe film pretty much died in Asia, seeing a steep drop in China (93% drop) and flopping in South Korea with just $4.3 million (where ***F1*** is stealing all its thunder). The film's best markets are the UK ($20.5M), Mexico ($20.4M), France ($10.2M), Brazil ($9.3M), Australia ($8.2M), Italy ($7.1M), Spain ($6.4M), Germany ($5.9M), and China ($5.5M). Based on its poor drops, it really looks like the film will struggle to hit $550 million worldwide. Given a very high budget (more than $200 million) and a very extensive marketing campaign, this definitely looks like another disappointment for the MCU.\n\nIn Japan, ***Demon Slayer: Kimetsu no Yaiba Infinity Castle*** earned $17.4 million on its third weekend, for a gigantic $121 million in the market. It's already the biggest film of the year in Japan and the 10th biggest ever.\n\n***F1*** is already surpassing ***Jurassic World*** and ***Superman*** in weekend grosses, even though it opened prior to both. The film added $17.2 million overseas, which is just 17% off from last weekend, and taking its worldwide total to a fantastic $546 million. With this, it's officially Brad Pitt's highest grossing film as leading man, surpassing ***World War Z*** ($540 million). Its best markets are China ($55.1M), the UK ($28M), France ($26.7M), South Korea ($24M), Mexico ($19.3M), Australia ($17.4M), Germany ($15.1M), Taiwan ($14.9M), India ($12.8M), Japan ($12.5M), UAE ($9.5M), and Spain ($9.3M). Not content with recouping its $200 million budget already, the film is now set to cross $600 million worldwide, an insane mark. Even crazier fact: it's going to outgross all MCU titles this year and it won't be far off from ***Superman***'s total.\n\n***The Bad Guys 2*** earned $16.3 million overseas ($22.3 million if we add last week's overseas debut), taking its worldwide total to $44.4 million. The best markets are the UK ($6.4M), France ($2.6M), Mexico ($1.8M), Spain ($1.4M) and South Korea ($1.3M). There's still a lot of markets left, and there's not much animated competition.\n\n***Jurassic World Rebirth*** added $16.2 million overseas, for a $766 million worldwide total. The best markets are China ($77.4M), the UK ($42.7M), Mexico ($34.2M), Germany ($28.4M) and France ($25.2M).\n\n***The Naked Gun*** debuted with $11.5 million overseas, for a $28.3 million worldwide start. The best markets are the UK ($2.3M), Germany ($2.3M), Mexico ($674K), Netherlands ($590K) and Austria ($430K). Comedies are tough overseas, even though the original ***Naked Gun*** were big hits outside America. But it's not a bad start for this film.\n\n***Superman*** added $11.2 million overseas, allowing it to cross $550 million worldwide. The best markets are the UK ($32.8M), Mexico ($21.8M), Brazil ($15.3M), Australia ($14.6M), France ($13.2M), China ($8.9M), Spain ($8.9M), India ($6.8M), Germany ($6.6M), Japan ($6.4M), South Korea ($6.3M), and Italy ($5.9M).\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*The Phoenician Scheme* | May/30 | Focus Features | $6,271,652 | $19,555,015 | $38,767,466 | $30M\n*The Life of Chuck* | Jun/6 | Neon | $2,314,949 | $6,712,602 | $7,996,206 | N/A\n*M3GAN 2.0* | Jun/27 | Universal | $10,201,625 | $24,101,280 | $39,035,507 | $25M\n\n- Wes Anderson's ***The Phoenician Scheme*** has closed with $38.7 million worldwide, against a $30 million budget. That's another box office dud in Anderson's filmography, but let's face it, he's not going to be affected in the slightest. Too big to fall (and with Steven Rales' help).\n\n- Here lies Chuck Krantz (? - 2025). Neon's ***The Life of Chuck*** has already ended its run domestically with just $6.7 million and just $7.9 million worldwide. The film surprised many by winning the People's Choice Award at TIFF, which is usually a sign that the film could gain Oscar buzz. But instead of capitalizing on it, Neon released it 9 months after its debut in the middle of a competitive summer season, letting buzz die down. A very disappointing performance.\n\n- Yes, you read it correctly. ***M3GAN 2.0*** has closed after just 5 weeks with a pathetic $24.1 million domestically and $39 million worldwide. That's an insane 78.6% drop from the original film, which is one of the steepest for a sequel. Whether it was the genre shift, audience disinterest or the film's reception, it was simply a case of so many dominoes falling. Blumhouse, however, is on a very bad spot. Once a reliable hitmaker, this year has been filled with pure flops in theaters, something that seemed impossible years ago for this studio.\n\n#**THIS WEEKEND**\n\n***Fantastic Four***'s reign ends after 2 weeks, and it's gonna be a fierce battle.\n\nFirst, there's Disney's ***Freakier Friday***, once again bringing Lindsay Lohan and Jamie Lee Curtis back into their roles from the 2003 film. The 2003 version earned $160 million worldwide and its popularity has continued thanks to cable and home media. Comedies have been hit-and-miss in theaters (mostly the latter), but maybe the film could still hit all the nostalgia angles needed to succeed.\n\nAnd there's WB's new release, Zach Cregger's ***Weapons***, which follows the case of 17 children from the same classroom who mysteriously run out of their homes towards an unknown target in the middle of the night. The marketing has been excellent, managing to offer an eerie and creepy atmosphere and explaining just pretty much enough about the film without really spoiling it. Cregger hit gold with ***Barbarian***, and perhaps the same could happen here.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 357,
        "comments": 257,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bqD8X692EC4aqs_MxwJozorBdrAIilxqYCGAbUDbrbk.png?auto=webp&amp;s=119da0ef6337796b1b48996d38730004f3874558"
        },
        "permalink": "/r/movies/comments/1mhqmqa/august_13_box_office_recap_despite_staying_at_1/"
    },
    {
        "id": "1mi75cl",
        "author": "joserooseveIt",
        "title": "best suicidal prevention movies?",
        "content": "i’m not suicidal or anything, just genuinely curious about what movies have helped people get through dark times. for me, it’s definitely interstellar (2014), gone girl (2014), and the substance (2024). i’m in the mood for films that hit deep, mess with your brain or make you feel alive. cinema heals.",
        "upvotes": 25,
        "comments": 92,
        "media": null,
        "permalink": "/r/movies/comments/1mi75cl/best_suicidal_prevention_movies/"
    },
    {
        "id": "1mhm6m5",
        "author": "bilhugs",
        "title": "IMDB is a swamp of advertising these days",
        "content": "IMDB is a swamp of advertising these days. I feel like it didn't used to be this bad. I used to be able to go to it as a source of information without having to play the stupid game of find-the-content. It's almost as bad as MSN for crying out loud. Do you think there's any hope for a return to functionality or... more realistically, that another service might pop-up and replace it at some point? Is there an app out there that I could use to look up movies by cast/crew and vice versa without subjecting myself to the parade of garbage?",
        "upvotes": 495,
        "comments": 126,
        "media": null,
        "permalink": "/r/movies/comments/1mhm6m5/imdb_is_a_swamp_of_advertising_these_days/"
    }
]