[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 6,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1nky1d3",
        "author": "FriendlyCrow97",
        "title": "Aiuto – davvero internet qui fa così schifo?",
        "content": "Ciao Torinesi! Sono un argentino appena sbarcato in questa bellissima città e c’è una cosa che non mi fa dormire: l’internet.\n\nSono arrivato un mese fa, affitto un bilocale in Crocetta e lavoro da remoto. L’affitto include le spese e pure INTERNET. Peccato che qui abbiamo un modem 5G che va talmente male che per le call di lavoro devo usare l’hotspot del telefono… una tragedia.\n\nIl proprietario dice che il palazzo è vecchissimo e che ha già provato a mettere la fibra, ma prima bisognerebbe fare un investimento gigante che nessun vicino vuole pagare.\n\nQuindi mi chiedo: è normale così a Torino o il padrone non vuole spendere per un internet decente?\n\nMi pare assurdo pensare che in una città grande non arrivi la fibra… e lo dico io che vengo dal “terzo mondo” eh! 😅",
        "upvotes": 4,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1nky1d3/aiuto_davvero_internet_qui_fa_così_schifo/"
    },
    {
        "id": "1nk1dri",
        "author": "Euphoric-Spare-2871",
        "title": "Vivere a Torino senza macchina: si può davvero?",
        "content": "Sto considerando di vendere l’auto, ma non so se sia fattibile. Mezzi pubblici, bici, monopattini, car sharing... secondo voi, si può vivere bene a Torino senza macchina? Anche girando di notte? In quali quartieri è più facile?",
        "upvotes": 106,
        "comments": 99,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mef5hbh3gvpf1.jpeg?auto=webp&amp;s=d6c122533d134518d3336fe934cede08bc9809cc"
        },
        "permalink": "/r/torino/comments/1nk1dri/vivere_a_torino_senza_macchina_si_può_davvero/"
    },
    {
        "id": "1nkxkhy",
        "author": "mreducazione",
        "title": "Posteggio scooter Aeroporto Caselle",
        "content": "Qualcuno sa un modo conveniente o gratuito per posteggiare scooter/moto all’aeroporto?\nLoro vogliono 5€ al giorno al coperto, i posteggi privati esterni che ho visto più o meno uguale. \nEsiste un’area vicino all’aeroporto dove sostare gratuitamente? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1nkxkhy/posteggio_scooter_aeroporto_caselle/"
    },
    {
        "id": "1nkipq1",
        "author": "fjdofhke",
        "title": "Torino to Dolomite weekend trip",
        "content": "Is it possible to do a weekend trip to the Dolomites with only public transit from Torino? I wanted to go now before it starts getting too cold, to do some hikes. But I’m not sure it’s possible to go in one weekend without a car, and if it is I’m not sure where in the Dolomites would be best as there seem to be so many amazing places. \n\nIt’s been my dream to see the Dolomites, any advice would be appreciated, thank you! ",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1nkipq1/torino_to_dolomite_weekend_trip/"
    },
    {
        "id": "1nkpqig",
        "author": "katemc333",
        "title": "Agrotourism? And itinerary help. :)",
        "content": "Salve! We are Americans visiting for the first time, and I'm hoping you locals can give some insight.  \n  \nI like the idea of staying at an agrotourism place in Turin or Alba, but I also like to walk where I want to go into the city/town. The agrotourism places seem far away... is the public transit into town reliable and frequent? Or will I be stranded without a car?  \n  \nThis is our plan but we haven't booked any hotels or bed and breakfasts. \n\nThank you! \n\nNov 1 Land at MXP  \nNov 2 Milan  \nNov 3 Milan  \nNov 4 Train to Turin  \nNov 4 Turin  \nNov 5 Turin (If we can find a wine tour maybe?)  \nNov 6 Train to Alba  \nNov 7 Alba (Private Truffle Hunt + possible wine tastings)  \nNov 8 Alba (Truffle Festival)  \nNov 9 Train back to Milan  \nNov 10 Depart MXP at 11:35",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nkpqig/agrotourism_and_itinerary_help/"
    },
    {
        "id": "1nk5fmh",
        "author": "TheShynola",
        "title": "Torino, dove preferiresti mangiare? Ho costruito qualcosa per voi.",
        "content": "Ciao,\n\nHo mappato la scena gastronomica di Torino nella mia app che si chiama Vota. L’idea è semplice: vedi due locali affiancati, scegli quello che preferisci, e la classifica si aggiorna all’istante. Più persone votano, più la lista diventa intelligente.\n\nPotresti confrontare, ad esempio, **Del Cambio** con **Tre Galli**. Esperienze totalmente diverse, ma col tempo anche posti molto differenti trovano naturalmente il loro livello nella classifica.\n\nNiente recensioni false. Niente influencer. Niente pubblicità. Niente testi generati dall’AI. Invece ottieni consigli da persone reali, locali. Niente rumore di Tripadvisor o Google. Solo semplice e diretto.\n\nL’app è gratuita, non richiede registrazione e non raccoglie dati personali. Ecco la versione iPhone:  \n[https://apps.apple.com/app/vota-restaurant-ratings/id6744969212](https://apps.apple.com/app/vota-restaurant-ratings/id6744969212)\n\nP.S. Non sono di Torino (vivo a Göteborg). Non raccolgo dati, non vendo nulla e non c’è contenuto generato dall’AI nell’app. I due posti di questo post, invece, li ho scelti con l’aiuto dell’AI. Voglio solo vedere come voi torinesi classifichereste la vostra scena gastronomica. Ho pubblicato anche in altre città, giusto per info 🙂",
        "upvotes": 11,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pUXl-zieNx-erUPEDAjjo74F7CO-oxA0hGpGug22OhQ.png?auto=webp&amp;s=f23f99578ac32984e73430d3b4cc487c95ccf17c"
        },
        "permalink": "/r/torino/comments/1nk5fmh/torino_dove_preferiresti_mangiare_ho_costruito/"
    },
    {
        "id": "1nk7fv9",
        "author": "Icy-Buddy8558",
        "title": "Che fine ha fatto Madame Mabel?",
        "content": "Sono passato con alcuni miei amici e l'ho trovato chiuso, eppure su maps indica che è attivo e ci sono anche delle recensioni recenti di 4/5 mesi fa\n\nVoi ne sapete qualcosa? E in alternativa riuscite a consigliare dei locali a tema esoterico a Torino?",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nk7fv9/che_fine_ha_fatto_madame_mabel/"
    },
    {
        "id": "1nk2ryx",
        "author": "Bruno_Barbiere",
        "title": "Vivreste in questa casa (acquistandola) pur di godere di questa bella vista sulla Mole Antonelliana?",
        "content": "",
        "upvotes": 16,
        "comments": 34,
        "media": null,
        "permalink": "/r/torino/comments/1nk2ryx/vivreste_in_questa_casa_acquistandola_pur_di/"
    },
    {
        "id": "1nkh4ku",
        "author": "Similar_Profit_7298",
        "title": "Palestre di Lotta Olimpica o Greco Romana?",
        "content": "Salve, sto cercando delle palestre di Lotta a Torino, per ora ho visto che ci sono solamente il CUS, la Greca Team e Sportforma in tutta la città che offrono dei corsi, conoscete altri posti? Cosa ne pensate dei 3 che ho citato, qualche feedback?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nkh4ku/palestre_di_lotta_olimpica_o_greco_romana/"
    },
    {
        "id": "1nk7cae",
        "author": "Last_Access2094",
        "title": "Anyone up for a Photo walk in Torino?",
        "content": "Ciao Everyone, Got back from home and I realised I have let my creative side take a hit, so brought back my camera with me this time. Anyone up for a photos clicking dump? I usually love when I am able to infuse natural light into architecture. ",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1nk7cae/anyone_up_for_a_photo_walk_in_torino/"
    },
    {
        "id": "1nki60w",
        "author": "InstanceOk2385",
        "title": "Miglior gestore router wi-fi portatile (saponetta)",
        "content": "Salve a tutti sono da qualche giorno a torino ed essendomi trasferito in un appartamento privo di collegamento cablato(né fibra né ADSL), necessito di un router di tipo portatile con conseguente tariffa dati.\nFacendo lo speed test da cellulare (iPhone 12 pro con 5G) i risultati sono veramente scandalosi con circa 10 Mbps in dowload. È possibile trovare qualche gestore che offra di meglio, al di là del fatto che questo sia uno speed test svolto da un cellulare e non con un router vero e proprio.\nP.s. Mi trovo abbastanza in centro città e la\ntacche di segnale erano al massimo\nGrazie mille!",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1nki60w/miglior_gestore_router_wifi_portatile_saponetta/"
    },
    {
        "id": "1nkhf1s",
        "author": "Unlucky_Winner_1187",
        "title": "Where to find second hand bikes",
        "content": "Where can i find a second hand bike shop with fair prices??",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1nkhf1s/where_to_find_second_hand_bikes/"
    },
    {
        "id": "1nkgoro",
        "author": "ImpactFlat1514",
        "title": "Amicizie",
        "content": "Ciao, sto cercando nuove amicizie tra i 20 e i 27 anni sia donne che uomini. Mi piace passare il tempo in modo tranquillo: mi piace andare ai musei, giocare ai giochi da tavolo, fare passeggiate, scoprire posti nuovi in città e anche uscire per un aperitivo o una serata in discoteca. Mi piacerebbe conoscere persone con interessi simili, con cui chiacchierare, ridere e condividere un po’ di tempo insieme. Se ti va, scrivimi.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1nkgoro/amicizie/"
    },
    {
        "id": "1nkggwo",
        "author": "ChillDudeTwenty2",
        "title": "Truffa soldi per benzina - Zona S. Rita",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1nkggwo/truffa_soldi_per_benzina_zona_s_rita/"
    },
    {
        "id": "1nket81",
        "author": "lospavaldo",
        "title": "gruppo per far amicizia",
        "content": "Sei appassionato di anime e manga, ma sei timido, introverso, hai ansia sociale e magari non esci di casa da giorni?\nVorresti socializzare, farti nuovi amici con la tua stessa passione, ma ti ritrovi sempre nei soliti gruppi online tossici, dove è impossibile creare legami veri.\n\nGli eventi dal vivo? Costano una fortuna (15–30€ solo per entrare), sono pieni di stand con prezzi gonfiati, gente ambigua e un affollamento assurdo.\nImmagino che anche tu ti sia rotto il cazzo di questa situazione, giusto?\n\nEcco la soluzione: La Toman Italiana.\nSiamo la community di anime e manga più grande d’Italia, con oltre 400 persone attive. Ai nostri eventi c’è un ambiente sano, sicuro e davvero pensato per stringere nuove amicizie.\n\n👉 Se vuoi davvero cambiare la tua vita, ricominciare a socializzare e vivere nuove esperienze con persone come te, entra subito nel nostro gruppo WhatsApp tramite questo link.\n\n\n https://chat.whatsapp.com/Bi3jTiiDIZOCJrA6ymFWdZ?mode=ems_copy_t",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nket81/gruppo_per_far_amicizia/"
    },
    {
        "id": "1nkdy3q",
        "author": "verautopya",
        "title": "Beyblade",
        "content": "Salve! \nNegli ultimi mesi, mi è tornata la passione per i beyblade e vorrei anche partecipare a qualche torneo. \nMi sono da poco iscritto a quello organizzato dalla fumetteria \"Jolly Joker\". \nMi chiedevo... ci sono altre persone o gruppetti qui a Torino che ogni tanto ci giocano? \n\nRingrazio in anticipo chi risponderà!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nkdy3q/beyblade/"
    },
    {
        "id": "1nkcxg4",
        "author": "Remarkable_State_474",
        "title": "Bravo oculista Torino Nord",
        "content": "Mia nonna ha parecchi problemi di vista da diversi anni, e adesso se ne è aggiunto uno nuovo: fino a poco fa vedeva delle macchie colorate, ora delle macchie nere, dei veri e propri buchi. L'oculista che la segue non ha notato nulla dal punto di vista ottico e idem il neurologo. Adesso stiamo cercando un nuovo oculista per avere un secondo parere. Avete qualche professionista valido da consigliare? Possibilmente in Barriera o comunque in zona nord.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1nkcxg4/bravo_oculista_torino_nord/"
    },
    {
        "id": "1nk383v",
        "author": "Curious-Fisherman-46",
        "title": "Fuorisede appena arrivato a Torino in cerca di amicizie",
        "content": "Ei sono un ragazzo di 19 anni appena arrivato a Torino per studiare, mi piacerebbe fare nuove conoscenze. Sono appassionato di cinema letteratura e videogiochi, c'è qualche gruppo whatsapp che organizza uscite, qualche club  o qualcuno alla ricerca di nuove conoscenze come me?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1nk383v/fuorisede_appena_arrivato_a_torino_in_cerca_di/"
    },
    {
        "id": "1nka5b5",
        "author": "ugly_mask_carnival",
        "title": "Calcetto a 5 venerdì 19 alle 19",
        "content": "Ragazzi per chi voglia passare un ora di calcio amichevole questo venerdì abbiamo un campo prenotato al cit di Torino alle 19 di sera \nServono 2 persone per arrivare a 10 \nGiochiamo per divertimento 😉\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nka5b5/calcetto_a_5_venerdì_19_alle_19/"
    },
    {
        "id": "1nk9jz9",
        "author": "PhilosopherFar9282",
        "title": "Project Affiti",
        "content": "Ciao, sono un dottorando straniero e al momento sto cercando un alloggio a Torino. Ho trovato questa agenzia, Project Affitti ([https://www.projectaffitti.it/](https://www.projectaffitti.it/)). Prima di firmare un contratto con loro e prenotare eventuali voli vorrei essere sicuro che siano affidabili. Qualcuno ha esperienza con questa agenzia?",
        "upvotes": 1,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GDE7-yNXBKNRKh9UamM-Dtj8I3CAddFlnO4du4ywrQ8.jpeg?auto=webp&amp;s=3747087f54f15856b4f323397c0d781ed1bf0c91"
        },
        "permalink": "/r/torino/comments/1nk9jz9/project_affiti/"
    },
    {
        "id": "1nknfh6",
        "author": "Substantial_Fail7046",
        "title": "Il Tradimento del Piemonte",
        "content": "Come l’Italia ha sepolto la lingua e l’anima dei suoi fondatori\n\nL’Italia non esisterebbe senza il Piemonte.\nTorino diede al Risorgimento il suo re, il suo denaro, la sua capitale, il suo esercito e il suo sangue. Cavour, piemontese, ne fu il cervello politico. I soldati piemontesi combatterono e morirono perché nascesse uno Stato chiamato “Italia”.\n\nE come ha ricambiato Roma? Con silenzio, cancellazione, umiliazione.\n\n\n\nUna lingua negata\n\nIl piemontese (piemontèis) non è un dialetto. È una lingua romanza con grammatica, letteratura e teatro propri. Più dolce e vicina al francese del toscano, è stata per secoli la voce di Torino, capitale europea.\n\nDopo il 1861 lo Stato lo ha bollato come “parlata contadina”. I bambini venivano puniti a scuola se lo usavano. Oggi la legge 482/1999 protegge decine di minoranze linguistiche (sardo, ladino, occitano…), ma non il piemontese. Nessun riconoscimento, nessun finanziamento, nessuna scuola.\nUNESCO ormai lo definisce “decisamente in pericolo”.\n\nRoma non ha dovuto vietarlo: è bastato lasciarlo morire nell’indifferenza.\n\n\n\nL’immagine rubata\n\nNel mondo “italiano” significa stereotipi: il meridionale rumoroso, il fiorentino sgarbato, il mafioso negli USA.\nIl piemontese avrebbe potuto essere l’immagine opposta: una voce colta, europea, elegante. Ma lo Stato ha cancellato questa possibilità.\n\nTorino poteva essere la Barcellona o l’Edimburgo d’Italia: una capitale fiera con una lingua propria. È stata ridotta a provincia dimenticata.\n\n\n\nContributi cancellati\n\nIl Piemonte ha dato all’Italia e al mondo:\n\nL’Unità stessa — senza Torino non ci sarebbe uno Stato italiano.\n\nIl cioccolato: gianduja, gianduiotti, la tradizione delle caffetterie.\n\nL’industria: FIAT, Olivetti, il triangolo industriale.\n\nIl design e l’architettura: palazzi barocchi, Mole Antonelliana, Politecnico di Torino.\n\nIl calcio: Juventus e Torino FC, due squadre storiche.\n\nFerrero: Nutella, Kinder, Ferrero Rocher, Tic Tac.\n\n\nEppure, quasi mai si nomina il Piemonte. Tutto viene assorbito in un generico “Italia”.\n\n\n\nUna gioventù silenziosa\n\nPerché non c’è stata reazione? Perché i giovani crescono senza vedere il piemontese a scuola, nei media, nello spazio pubblico. Deviano le loro energie su cause globali — Palestina, clima, femminismo — mentre la loro lingua muore.\n\nI siciliani e i sardi gridano e ottengono autonomia. I veneti e i lombardi rivendicano i soldi.\nI piemontesi, i più leali, tacciono. E il silenzio è ciò che Roma desiderava.\n\n\n\nUna questione di giustizia\n\nÈ giusto? Il Piemonte ha dato tutto per creare l’Italia. In cambio riceve solo oblio.\nSe un giorno i piemontesi chiedessero l’indipendenza, chi avrebbe il coraggio di dire di no?\n\n\n\nLa scelta\n\nIl Piemonte è a un bivio:\n\nContinuare a cedere, a parlare solo italiano, a dimenticare se stesso.\n\nOppure rialzare la testa, rendere il piemontese vivo, giovane, “cool”, e ricordare all’Italia (e al mondo) che Torino non è “una città qualsiasi”, ma il cuore che ha creato una nazione.\n\n\nQuanto ancora il Piemonte dovrà dare, mentre l’Italia continua a seppellirlo?",
        "upvotes": 0,
        "comments": 24,
        "media": null,
        "permalink": "/r/torino/comments/1nknfh6/il_tradimento_del_piemonte/"
    },
    {
        "id": "1njpg6s",
        "author": "Banzay_87",
        "title": "FIAT 1800 and FIAT G.91. Italy, 1960s",
        "content": "",
        "upvotes": 17,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/u4p3ydd4yrpf1.jpeg?auto=webp&amp;s=0156dc76addb9b22a4d770b3fa3c4dbfa80f8d9a"
        },
        "permalink": "/r/torino/comments/1njpg6s/fiat_1800_and_fiat_g91_italy_1960s/"
    },
    {
        "id": "1nk3a2u",
        "author": "al_amhara1987",
        "title": "Pendolarismo Torino - Chieri",
        "content": "Ciao a tutti, ho una amica che abita in zona Giardini della Clessidra (tra corso monte lungo e corso rosselli), ha trovato una offerta di lavoro a chieri centro, con quali mezzi si può spostare e quanto tempo può metterci? Io purtroppo non sono proprio pratico di mezzi. L'orario di lavoro è quello tipico da ufficio, inizia 8.30 finisce 17.30",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1nk3a2u/pendolarismo_torino_chieri/"
    },
    {
        "id": "1njzyog",
        "author": "Norand87",
        "title": "Lista gruppi e attività per socializzazione",
        "content": "Ciao a tutti, torinesi e non!\n\nMi sono appena trasferito a Torino (38M) e vorrei da una parte provare nuovi hobby e dall'altra conoscere nuove persone. Avete consigli su gruppi o attività particolari per socializzare? Cerco cose originali, non per forza le solite cene/aperitivi (anche se mi piacciono): ad esempio, sport, workshop culturali, hobbi originali, outdoor, volontariato, ecc.. qualsiasi spunto è benvenuto!\nGrazie",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1njzyog/lista_gruppi_e_attività_per_socializzazione/"
    },
    {
        "id": "1nj7hzq",
        "author": "Previous-Platform566",
        "title": "Parking ticket in Torino",
        "content": "I was paying for my parking with easypark app, and chose the option to pay for full day. Unfortunately it charged me for only 12 hours without me noticing it so I’ve got this parking ticket. Is there a way to appeal for it?",
        "upvotes": 39,
        "comments": 31,
        "media": null,
        "permalink": "/r/torino/comments/1nj7hzq/parking_ticket_in_torino/"
    },
    {
        "id": "1njec69",
        "author": "Intelligent-Bell-120",
        "title": "Ciao, Ci sono persone qui appassionate di techno rave e hard techno e hardcore? \nMi piacerebbe capire se c’è una community attiva in città che condivide questa scena?",
        "content": "",
        "upvotes": 8,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1njec69/ciao_ci_sono_persone_qui_appassionate_di_techno/"
    },
    {
        "id": "1njr354",
        "author": "Jolly-Parfait10",
        "title": "hard tehcno",
        "content": "who like's hard techno and hardcore party in Torino? send me message if you are interested to find more.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1njr354/hard_tehcno/"
    },
    {
        "id": "1nj9vaf",
        "author": "Minestrellow",
        "title": "Esperienze con ristoranti stellati a Torino?",
        "content": "",
        "upvotes": 7,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/f2sp02iqgppf1.jpeg?auto=webp&amp;s=6959ecebbc158959224cf4f7d09e4e3bdbd8bae9"
        },
        "permalink": "/r/torino/comments/1nj9vaf/esperienze_con_ristoranti_stellati_a_torino/"
    },
    {
        "id": "1njjv33",
        "author": "bohboh4",
        "title": "Cerco gruppo per D&amp;D (TORINO)",
        "content": "Salve cerco gruppo d&amp;d , sono abbastanza inesperto e nel caso posso ospitare a casa mia dato che vivo da solo (solo che ho la casa a Settimo Torinese) se qualcuno fosse interessato siete i benvenuti e scrivetemi vi lascerò un mio contatto. ",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1njjv33/cerco_gruppo_per_dd_torino/"
    },
    {
        "id": "1njppj7",
        "author": "ParticularCarob4820",
        "title": "Looking for a Place to Live in Turin",
        "content": "Hello. I have a scholarship at the University of Turin (Unito). The thing is, I contacted some real estate agencies, but I got scammed, and now I don’t have a place to live here. Could you please give me some suggestions or let me know if you know of any available apartments near the area? Low budget ",
        "upvotes": 1,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1njppj7/looking_for_a_place_to_live_in_turin/"
    }
]