[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 48,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 17,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qrdfop",
        "author": "phillygirllovesbagel",
        "title": "Catherine O'Hara Dead at 71",
        "content": "",
        "upvotes": 1125,
        "comments": 109,
        "media": null,
        "permalink": "/r/netflix/comments/1qrdfop/catherine_ohara_dead_at_71/"
    },
    {
        "id": "1qrip4p",
        "author": "Pawssabillitysawait",
        "title": "The end of the F***ing world.",
        "content": "I think this is one of my absolute all time netflix favs, and the second season is actually arguably better than the first, which is rare for television shows in my opinion. I never hear anyone talk about it, but i highly recommend it to everyone. It is amazing if you like coming of age/teen shows, that have a more serious theme.",
        "upvotes": 45,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1qrip4p/the_end_of_the_fing_world/"
    },
    {
        "id": "1qrf5r4",
        "author": "Less_Manufacturer218",
        "title": "Elizabeth Smart documentary, what a powerful family. Must watch",
        "content": "Just wanted to say how impressive the entire Smart family is. From Mary Katherine remembering and cracking the case, to her parents and uncles never giving up. And of course Elizabeth, a true survivor with incredible strength.\n\nWill make you cry. ",
        "upvotes": 37,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1qrf5r4/elizabeth_smart_documentary_what_a_powerful/"
    },
    {
        "id": "1qrkwrd",
        "author": "bradleyistheman",
        "title": "Ted Danson",
        "content": "Ted Danson stars in both \"A Man On The Inside\" and \"The Good Place.\" I just watched an episode of \"A Man On The Inside\" where one of the characters mentions that Charles (Danson's character) looks like a handsome devil. I wonder if that's an inside reference to his character on \"The Good Place.\"",
        "upvotes": 21,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1qrkwrd/ted_danson/"
    },
    {
        "id": "1qqm8bc",
        "author": "MattTheKing23",
        "title": "Netflix Had a Plan If Alex Honnold Died During Live Skyscraper Climb",
        "content": "",
        "upvotes": 1032,
        "comments": 174,
        "media": null,
        "permalink": "/r/netflix/comments/1qqm8bc/netflix_had_a_plan_if_alex_honnold_died_during/"
    },
    {
        "id": "1qqnyn5",
        "author": "Jumpy_Wing_7884",
        "title": "Anyone else feel sad when they outgrow a show? (me: Bridgerton)",
        "content": "I used to LOVE *Bridgerton*, but Season 4 just isn’t hitting for me anymore. Same thing happened with *You*. It’s not bad, I’m just… not as into it.\n\nKind of makes me sad because these used to be such comfort shows for me. 😅\n\nAnyone else go through this with shows they used to love?",
        "upvotes": 365,
        "comments": 134,
        "media": null,
        "permalink": "/r/netflix/comments/1qqnyn5/anyone_else_feel_sad_when_they_outgrow_a_show_me/"
    },
    {
        "id": "1qrged5",
        "author": "superfecta37",
        "title": "When life gives you tangerines is a masterpiece",
        "content": "I never watch kdramas, but decided to give this one a go, and I finished all 16 episodes in 2 days.\n\nWhat a masterpiece. Easily one of the best shows I've ever watched. Has anyone watched this?",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qrged5/when_life_gives_you_tangerines_is_a_masterpiece/"
    },
    {
        "id": "1qrlzai",
        "author": "Delicious_Mess7976",
        "title": "Problem with loading a series episode",
        "content": "I have already tried the common fixes online and none are working.\n\nI have finished Season 3, (Poldark) episode three, but instead of moving to episode four, it skips all the way to Season 4....\n\nI have tried a bunch of fixes (settings, turning off and on, disconnecting. etc.)\n\nI am in an AirBnb, and I watch on my laptop. Not having problems with any other shows.\n\nAny other suggestions?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qrlzai/problem_with_loading_a_series_episode/"
    },
    {
        "id": "1qrntjg",
        "author": "b33b0",
        "title": "Just a Dash / Emilia Fart",
        "content": "I just watched season 3 of Just a Dash having seen none of this guy's other videos or anything. I thought it was funny but not sure if he did the cooking in random places thing before? It gave me Emilia Fart vibes so hard, especially the plane episode. \n\nI miss her, she could've had an amazing Netflix show. Just wondering if anyone else out there happened to also watch this and have this thought. I might be the only one, but there's gotta be at least one other person out there right? \n\nThey're both Canadian, I have to wonder if he's ever seen her videos. Shes pretty iconic in the YouTube world which I think this guy Matty was also part of. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qrntjg/just_a_dash_emilia_fart/"
    },
    {
        "id": "1qqwy8g",
        "author": "NavinRJohnson121479",
        "title": "Podcasts",
        "content": "Am I the only one who feels weird ***watching*** podcasts?  I’ve always thought of a podcast as something you ***listen*** to.\n\nI’m finding it hard to bring myself to watch any of them. ",
        "upvotes": 30,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1qqwy8g/podcasts/"
    },
    {
        "id": "1qrm4dz",
        "author": "FrequentAd1540",
        "title": "For those of you who can not watch netflix in 4k on edge or the app",
        "content": "The troubleshooting steps you can find in other subreddits.\n\n  \nExcept this one: Once in a while it will stop working, all you need to do to fix is delete the browser data in edge and restart, and you are good to go.\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qrm4dz/for_those_of_you_who_can_not_watch_netflix_in_4k/"
    },
    {
        "id": "1qrm2rh",
        "author": "Tnynfox",
        "title": "How many of you download content in-app, and why?",
        "content": "On mobile you can temporarily save shows offline.  Personally I don't do so since it's more convenient to actually stream if I have the option.\n\nOne use case I could understand is if you have the ad tier: saving and watching an Amazon Prime show offline excluded ads, so in theory it should also work here too.  Don't ban me mods, I'm just discussing an official Netflix app feature with nothing third-party going on.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qrm2rh/how_many_of_you_download_content_inapp_and_why/"
    },
    {
        "id": "1qrlrjc",
        "author": "Tnynfox",
        "title": "Will we get automatic subtitle translations?",
        "content": "It would be nice to be able to install, say, a Google Translate file to translate subtitles fully on-device.  While I know there to be third-party browser extensions and desktop apps for this, these aren't an option for mobile users and receive no official support.\n\nCurrent subtitles may be region-locked or simply not available in the desired language, like what if I'm a wannabe legal subscriber who mostly knows some obscure African language.  It would also sidestep regional copyrights on the subtitles themselves as it is the end user generating them, not Netflix distributing existing copyrighted subtitles.\n\nI suspect there may be some reason Netflix isn't doing this, even if only because it's simply too niche; Netflix clearly trusts first-party subtitles enough to spend resources providing them in the first place.  However a third-party solution would be a nice fallback solution like an iPhone repair shop for those too far from the Genius Bar.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qrlrjc/will_we_get_automatic_subtitle_translations/"
    },
    {
        "id": "1qrk92t",
        "author": "freespiritrgi",
        "title": "Netflix audio - low troubleshoot",
        "content": "Hello,\n\nI recently noticed that Netflix volume is really low on my Sony TV, both through the TV speakers and my soundbar.\n\nI unpaired and repaired the devices, cleared caches, and uninstalled and reinstalled everything, but the issue is still there.\n\nAt full volume, it feels like it’s only about 50% of what it used to be, and it’s noticeably lower than other apps.\n\nAny idea why this might be happening? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qrk92t/netflix_audio_low_troubleshoot/"
    },
    {
        "id": "1qrij6p",
        "author": "CandyFalls",
        "title": "Another question about the Run Away",
        "content": "Can somebody explain to me the timeline around when Paige went to visit Sam at uni?\n\nIn my head it goes like this \n\nDay 1) Simon sees Paige playing guitar and is filmed beating up Aron\n\nDay 2) Aaron is killed \n\nAnd we know Paige must have gone to Sam after this as as he ended up with her guitar \n\nBUT in the final episode when she’s explaining where she was, she said she found Aaron the day after he was killed and the she went to the caravan, then to rehab.\n\nSo when did she visit Sam?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qrij6p/another_question_about_the_run_away/"
    },
    {
        "id": "1qr1e9q",
        "author": "CrazyCatLady483",
        "title": "Sorry but we had trouble logging you in",
        "content": "Hello, I am getting the above message and I do not know what more to do.  I have done a hard reset on my Apple TV. I deleted the app and reinstalled it.  Software on my Apple TV is up to date.  Speedtest shows wifi is working fine at over 50mbps (standard speeds here in Australia where the internet infrastructure is 20 years behind the times).  Netflix worked fine earlier today and still works fine on other devices but it’s not great for my whole family to try to crowd around an iPad or iPhone to watch a show.  Can anyone help me fix this?",
        "upvotes": 8,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1qr1e9q/sorry_but_we_had_trouble_logging_you_in/"
    },
    {
        "id": "1qqjrtn",
        "author": "Hefty_Shoe_7081",
        "title": "The Perfect Neighbor",
        "content": "I know this show has been talked about alot on this sub but I have some things I’d like to discussed that I don’t think have been discussed. \n1. Even if this lady was bothered by these kids (which believe me kids can be annoying especially in large groups) why did NO OTHER FAMILY had anything bad to say about these kids? These kids were playing, being kids, imagine what a miserable piece of garbage you have to be to be so bothered by children playing. \n2. Does anybody feel for her in the sense that mental health is something ignored in their country or was she just an awful person? (Was she schizophrenic, etc…) \n3. Why did it take somebody dying for something to happen? These cops had been here what, over 10 times? And nothing happened? \n",
        "upvotes": 74,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1qqjrtn/the_perfect_neighbor/"
    },
    {
        "id": "1qqoe1g",
        "author": "SugaryFlump",
        "title": "Sense8",
        "content": "Why was Sense8 never renewed for a third season? Just rewatched it all for a second time and I forgot just how brilliant it is! Wish they’d bring it back, I’d love to see them all these years later with a new storyline. ",
        "upvotes": 38,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1qqoe1g/sense8/"
    },
    {
        "id": "1qqxyex",
        "author": "IcyAssistance5535",
        "title": "WORST ROMMATE EVER DOC.",
        "content": "First off I just want to say these people are insane as fuck but what really made me want to come type on here was the last 2 episodes where they spoke on fucking Jamison Bachman, a serial squatter, he would find roommates to live with (eventually created a fake name Jed) and after a while stop helping with the rent. He was also very educated when it came to law stuff, so every time they wanted to have a protection order against him and things like that, he ALWAYS ALWAYS ALWAYS found a way to flip it on them, to the point where a couple of them would lose their own apartment to him!! Eventually he met his match and a girl had him sent to jail a couple times, his fucking brother bailed him out each time and I never knew why! Next thing you know, he kills his brother !! I think he had some sort of grudge or anger towards his brother, I’m not sure what it is I just know that his older brother became more successful then him. But he gets locked up for his murder, then fucking kills hangs him self before he really even got sentenced in 2017. He put these people through wayyyy too much to to sit there and cop out on life, he was evil as fuck . I usually don’t care too much when people kill themselves while waiting for their sentencing the way he did, but he was the lastttttt person to sit and have the opportunity to cop out on life the way he did. He was a smart psycho",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qqxyex/worst_rommate_ever_doc/"
    },
    {
        "id": "1qqqbmh",
        "author": "OrangeSpark16",
        "title": "Who is the most successful actor/actress to come from Netflix?",
        "content": "Reworded, who is the most successful actor/actress that got their break on Netflix? I saw a post about a new Noah Centineo movie and it got me thinking about this question. My first thought was Jacob Elordi coming from Kissing Booth. He's nominated for an Oscar this year, coincidentally because of his performance in a Netflix movie! I would also consider Millie Bobby Brown. While she's only been on Netflix shows/movies, it's undeniably given her a lot of fame. Do y'all agree/disagree?",
        "upvotes": 22,
        "comments": 68,
        "media": null,
        "permalink": "/r/netflix/comments/1qqqbmh/who_is_the_most_successful_actoractress_to_come/"
    },
    {
        "id": "1qram76",
        "author": "Sufficient-Curve2951",
        "title": "Bridgerton S4",
        "content": "Here's Justin Kamps talking about the music used in S4 Part 1\n\nAbsolutely loved the use of Taylor Swift's 'Enchanted' in Episode 2. This feels like Benophie song and the show delivered. Predictions/wishes about the pop covers we could get in Part 2?\n\n  \n[https://www.soapcentral.com/shows/bridgerton-season-4-part-1-soundtrack-guide-a-complete-list-music-netflix-drama-s-latest-chapter](https://www.soapcentral.com/shows/bridgerton-season-4-part-1-soundtrack-guide-a-complete-list-music-netflix-drama-s-latest-chapter)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qram76/bridgerton_s4/"
    },
    {
        "id": "1qr9sy2",
        "author": "invisibleryuna",
        "title": "Partial load with sound?",
        "content": "Can't attach a picture of course.\n\nEvery time I press play on a certain title, it loads at 82%, red spinning circle and you can hear the show but nothing else happens. I already reset netflix and my tv. Any other fix? Yesterday itnwas a different show. But i can play other shows just fine.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qr9sy2/partial_load_with_sound/"
    },
    {
        "id": "1qro9j0",
        "author": "Ok_Estimate_2089",
        "title": "Why is everything on Netflix only?",
        "content": "I've noticed alot of movies and shows that aired on TV are always exclusive to Netflix.\n\nThe Spiderman movies for example. Or lego ninjago. Or my little pony.\n\nAnd then half of them aren't even COMPLETE. And since these shows never got a DVD release for later seasons... finding and watching those seasons you saw but never finished on TV is hard.\n\nMy little pony and ninja go being the worst preserved. Thankfully mlp has a fanbase that actually tries to preserve any and all mlp media otherwise no one would be able to watch it or show their kids it.\n\nAnd why do companies even put it on Netflix exclusively? They should be aware how much Netflix takes from the cut to host it.which is why hasbro stuff is basically not on there since I noticed hasbro seems to be the ONLY company that notices or cares. Its why they never take down archives of all their shows. since they mainly care about preservation over profit in most cases. Obviously they still care about profit but I noticed they would rather make money by making their stuff easier to watch rather then paying a specific service to watch it. I think to hasbro they see the fanbase as a major point of profit. Basically meaning... by making these shows easier to access... they in turn generate bigger fanbases that are willing to pay for their things.\n\nAnyway... anyone know what is up with that Netflix stuff?",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1qro9j0/why_is_everything_on_netflix_only/"
    },
    {
        "id": "1qpx47n",
        "author": "Pawssabillitysawait",
        "title": "Anyone else like the show Derry Girls?",
        "content": "For some reason i never hear anyone ever talk about this show, it is hilarious and so well written (at least in my opinion) and i absolutely adore it. It’s a spectacular comedy show and am so bummed it’s only 3 seasons!",
        "upvotes": 460,
        "comments": 86,
        "media": null,
        "permalink": "/r/netflix/comments/1qpx47n/anyone_else_like_the_show_derry_girls/"
    },
    {
        "id": "1qqhpx5",
        "author": "Extro-shy1401",
        "title": "Grace &amp; Frankie",
        "content": "This has become my comfort show, i don’t rewatch anything so I really take them seriously &amp; miss them seasons before the final one.\n\nWell, this show has actually portrayed the importance of having genuine friends around you, more than importance it is about how lucky it is to have a grace or a frankie in life.\n\nIt has really shown me that sometimes there’s nothing wrong with a person but just the company. Everyone have their flaws &amp; pros but friends are people who just don’t care about your pros and flaws but only about your happiness. \n\nI loved the show for its quirkiness, rawness of being a human, being old, depiction of love that is unconditional, personalities such as grace &amp; brianna, i personally relate with them.\n\nGood show! Watching it feels like I’m close to my family when I’m far away. ",
        "upvotes": 23,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1qqhpx5/grace_frankie/"
    },
    {
        "id": "1qqdp9v",
        "author": "fuckindisturbed",
        "title": "Hidden gems of Netflix",
        "content": "Netflix has a short film called if anything happens, I love you, and it completely made me cry like UGLY cry I was going to continued and watch all the empty rooms but I don’t think my heart can take all of this. There are a lot of good short films on Netflix even if you don’t want to you should watch a few they might change your outlook on life love and whatever else. Just give it a change and you’ll come out a better person. ",
        "upvotes": 28,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1qqdp9v/hidden_gems_of_netflix/"
    },
    {
        "id": "1qqpi51",
        "author": "Prestigious-Back-981",
        "title": "Netflix Will Stream ‘The Secret Agent’ in Brazil, Opens New São Paulo Headquarters",
        "content": "&gt;“The opening of our new São Paulo office is a natural next step in the journey our local team has built over the past 15 years alongside Brazil’s creative community,” said Netflix co-CEO Greg Peters, who flew in for the opening ceremony. “We support Brazilian films in multiple ways because we want to be the best partners and stay flexible so local producers can decide the best way to bring their projects to life,” he said. “That’s why we were so excited to partner with ‘The Secret Agent’s’ producers to help fund the film and pre-license it for Netflix in Brazil.\"\n\n&gt;“The Secret Agent” garnered four Academy Awards nominations, including Best Film, Best International Film, Best Actor (Wagner Moura) and Best Casting. Moura has already won the distinction of being the first Brazilian thesp to win a Best Actor Golden Globe.",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qqpi51/netflix_will_stream_the_secret_agent_in_brazil/"
    },
    {
        "id": "1qqtzli",
        "author": "Longjumping_One_3079",
        "title": "Netflix recs?",
        "content": "I’ve been home a lot more these days because of remote work. I'm looking at some shows that I'm interested in. Any Netflix recommendations you’d say are truly worth watching? For reference, I recently enjoyed Love Is Blind and Emily in Paris :)",
        "upvotes": 2,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1qqtzli/netflix_recs/"
    }
]