[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 493,
        "comments": 270,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 10,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1j4nnle",
        "author": "Eeepp",
        "title": "'The Recruit' Canceled At Netflix After 2 Seasons",
        "content": "",
        "upvotes": 153,
        "comments": 93,
        "media": null,
        "permalink": "/r/netflix/comments/1j4nnle/the_recruit_canceled_at_netflix_after_2_seasons/"
    },
    {
        "id": "1j4ce5c",
        "author": "Few_Pumpkin3666",
        "title": "Doubting the authenticity of the \"Top 10\" list",
        "content": "I remember when 'Kinda Pregnant' with Amy Schumer released last month and for like two weeks straight it was showing as #1 on the trending movies and I just, straight up don't believe it. This isn't like some big takedown or the tired trope of \"Amy Schumer is horrible and no one likes women comedians\". Her movies aren't usually my cup of tea but I'm not here to hate. \n\nThis one though, I just cannot believe it was actually number one. Especially with the scene that auto plays when you stay on it too long. It's hard for me to even imagine a demographic that would see that and decide to spend the next hour and a half watching it. Let alone enough to make it #1 for 2 weeks straight. So I guess I'm asking if anyone else feels like they just lie about the numbers to push their newest originals? If they put it as #1 someone might at least give it a try. Or do y'all think I'm just way off base here and imagining things or out of touch. \n\nAgain to reiterate, I have a wide range of movies I'll watch and enjoy, even some of the Netflix original movie slop has its merrit for just turning your mind off and having a little fun. See 'Red Notice'. All this to see I don't just hate the actress or the genre, but still, this looks even worse than their normal original slop. ",
        "upvotes": 109,
        "comments": 60,
        "media": null,
        "permalink": "/r/netflix/comments/1j4ce5c/doubting_the_authenticity_of_the_top_10_list/"
    },
    {
        "id": "1j4mamm",
        "author": "deepsealazy",
        "title": "With Love, Ballerina Farm",
        "content": "I have always been a fan of Meghan (from her Suits days), but there's something so disingenuous about this show.\n\nFirst off, I was certain she was filming in her own kitchen... and maybe that was naive of me. During the first episode, when she's putting together those bath salts and preparing for her guest, I really believed she was hosting them in her home. \n\nThen I found out it was a set when she met Mindy, and suddenly everything felt staged. From every single ingredient being perfectly placed in mason jars to the bacon wrapped in brown paper. a perfectly curated homemade life. (and perhaps this is what she wanted? who knows?)\n\nThe whole vibe is weird, honestly. It's giving major Ballerina Farms energy, like she's trying to be the next big homestead influencer. I wouldn't be surprised if she came out with a cottagecore cookbook next.\n\nLook, I still love her and have always supported her and Harry, but this just feels so forced and It's like watching someone try to build a lifestyle brand instead of sharing their actual lifestyle.",
        "upvotes": 22,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1j4mamm/with_love_ballerina_farm/"
    },
    {
        "id": "1j44a6s",
        "author": "Pogrebnik",
        "title": "Millie Bobby Brown Confirms 'Enola Holmes 3' Filming Start Window",
        "content": "",
        "upvotes": 184,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1j44a6s/millie_bobby_brown_confirms_enola_holmes_3/"
    },
    {
        "id": "1j3z2f4",
        "author": "S4v1r1enCh0r4k",
        "title": "Ezra Edelman Slams Netflix for Scrapping His 9-Hour Prince Documentary. Says that Netflix and Prince's estate won't release it since it could \"do generational harm to Prince\"",
        "content": "",
        "upvotes": 228,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1j3z2f4/ezra_edelman_slams_netflix_for_scrapping_his/"
    },
    {
        "id": "1j3y8l9",
        "author": "AnagnorisisForMe",
        "title": "With Love Meghan thoughts...",
        "content": "Posting this with great trepidation as I am not a bot (and I'm really hoping I have enough karma points after all the downvotes that I don't get kicked off Reddit). I think there are good parts of the With Love Meghan series. The episode with Roy Choi is in particularly good as the Korean sauces and cooking techniques are interesting as is his brining technique. The series is not exactly Carl Sagan, but that it is not what the intention is. If you want light background entertainment, give With Love Meghan a chance.",
        "upvotes": 218,
        "comments": 136,
        "media": null,
        "permalink": "/r/netflix/comments/1j3y8l9/with_love_meghan_thoughts/"
    },
    {
        "id": "1j4jrrv",
        "author": "Necessary_Article410",
        "title": "“Murder doc”?",
        "content": "Does anyone know a good “murder” or kidnapping doc where the actual victim of the crime is in it? I have been searching around for one like that and cannot find it. I like the ones that have “American murder” or “cold case” but i just want to find one with 1st story accounts from the victim! please let me know if someone knows one.",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1j4jrrv/murder_doc/"
    },
    {
        "id": "1j4na94",
        "author": "Life-Aardvark-8262",
        "title": "Help with profile transfer?",
        "content": "Im still on my parents’ Netflix account and I live on my own as I’m out of college. Almost nightly, I am prompted to update our account’s household because my parent watch at their house and I watch at mine. Today, I went through the update household prompts which i normally have text a link to my phone. But not matter how many times I try, I did not receive a link to update the household. What is going on here? \n\nSeparately, I set myself up as an “extra member on my parents account, which allowed me to access the content, but not of the shows i have been watching pop up because it is a new profile. Is there a way to transfer my old profile data (shows, recommendations, etc) to my new “extra member” profile? ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j4na94/help_with_profile_transfer/"
    },
    {
        "id": "1j4iasz",
        "author": "Alan_Stamm",
        "title": "'The Leopard:' Lavish new series based on 1958 novel is 'a withering takedown of society's flaws and hypocrisies that still hits home today'",
        "content": "",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1j4iasz/the_leopard_lavish_new_series_based_on_1958_novel/"
    },
    {
        "id": "1j4esbn",
        "author": "renis_h",
        "title": "New addition to Netflix: The Leopard",
        "content": "Just wanting to shine a spotlight on a Netflix show that I really think deserves more eyes on it in The Leopard. For those that don't know, this is based on an Italian 1963 film of the same name, that more or less follows the story of the Italian uprising, and documents how the rich are able to hold onto their power and position even after large scale upheaval. \n\nThis is definitely worth the watch, and I am surprised that Netflix is just digging out these old films that no one expects them to remake and actually does a really good job of recreating them. While I have been in a slump with netflix at the moment, this is definitely a show that's worth the watch.",
        "upvotes": 9,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1j4esbn/new_addition_to_netflix_the_leopard/"
    },
    {
        "id": "1j4ix8x",
        "author": "Domino_USA",
        "title": "\"A Secret Love\" Netflix Documentary",
        "content": "Does anyone know if it is possible to purchase the Netflix documentary \"A Secret Love\" on DVD or is there a streaming service that carries this documentary that allows downloads for purchase, such as Amazon? I am having trouble finding a copy of the documentary available for purchase outside of streaming on Netflix.  *A Secret Love is* about a lesbian couple who kept their relationship private for nearly 70 years.  It is directed by  Chris Bolan and is a portrait of his great-aunt, Terry Donahue, and her relationship with her partner, Pat Henschel.  Henschel was also a member of the All American Girls Professional Baseball League Players Association which the movie \"A League of Their Own\" is based on.  The documentary is one hour and 20 minutes.  The couple were eventually married and one of them, if not both, have passed on now.  They faced anti-gay bigotry throughout their lives.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j4ix8x/a_secret_love_netflix_documentary/"
    },
    {
        "id": "1j4mhm6",
        "author": "RickGrimes30",
        "title": "Why is the aspect ratio of Escape from Pretoria so strange, the top bar is twice as thick as the bottom one..",
        "content": "I checked a couple of other movies and they look normal ",
        "upvotes": 2,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/yo69q9sspzme1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1j4mhm6/why_is_the_aspect_ratio_of_escape_from_pretoria/"
    },
    {
        "id": "1j4p6ed",
        "author": "lllynax",
        "title": "Has there ever been a movie on netflix with a fuggler looking thing as the cover? 😭",
        "content": "I remember when I was young there was this movie id watch on netflix all the time, but i distinctly remember the last time i ever watched it. it was because while i was trying to find it, i saw another movie with an animal creature plushie… thing, with realistic teeth, and it scared me so bad that i avoided going onto netflix at all costs after that. I just recently discovered the existence of “fugglers” and it took me back lol. does anyone remember a movie like that? its possible but unlikely that it could’ve been another streaming service, as i swear that i remember the netflix ui and the movie i wanted to watch was on netflix around the same timeframe.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j4p6ed/has_there_ever_been_a_movie_on_netflix_with_a/"
    },
    {
        "id": "1j4mmng",
        "author": "thomasa_starr86",
        "title": "Travel Option",
        "content": "I’m having trouble trying to send myself my travel code. When I get to the I’m traveling screen, it won’t let me click, SEND CODE. I’ve tried on a fire tv stick and Xbox, same issue! What is happening!?!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j4mmng/travel_option/"
    },
    {
        "id": "1j4mbf1",
        "author": "mybelovedkasa",
        "title": "help me find this series 😭",
        "content": "It was on Netflix Philippines. It wasn’t an American show. The dub was obvious. I think it’s from a Slavic country? The two main characters were two girls, they were in school. Can’t quite remember what level. There were also two love interests. One was a photographer. Can’t remember the other one though. There was a side character that one of the main female characters almost got with. He was a goth slash delinquent of some sort? There was a scene where her and the goth guy made out in a closet of some sort, then got an electric shock. I don’t think it’s from anything earlier than 2010s. I watched it around 2018-2020 i think? It was made for a young audience 😭 Pls help! I think one of the main characters was a fashion student?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j4mbf1/help_me_find_this_series/"
    },
    {
        "id": "1j41axh",
        "author": "Robemilak",
        "title": "'Bullet Train Explosion' Gets a Teaser Trailer, Releasing April 23",
        "content": "",
        "upvotes": 16,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j41axh/bullet_train_explosion_gets_a_teaser_trailer/"
    },
    {
        "id": "1j4c67u",
        "author": "S4v1r1enCh0r4k",
        "title": "Sam Worthington to Star in Netflix’s New Thriller 'I Will Find You'",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j4c67u/sam_worthington_to_star_in_netflixs_new_thriller/"
    },
    {
        "id": "1j4jvp2",
        "author": "Elborshooter",
        "title": "Student issues",
        "content": "I've seen lots of students on the sub being annoyed that they had trouble with watching netflix on their parents account while away.\n\nHere's my problem : I pay for my own account (way too much might I add), but this year I'm in a different country and coming back to the \"household\" is absolutely out of the question. I got a message saying I have 14 days to get back to the household if I want to be able to continue to watch netflix.\n\nWhat can I even do at this point ? (Apart from cancelling my subscription to what is slowly becoming a massive scam)",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j4jvp2/student_issues/"
    },
    {
        "id": "1j43viw",
        "author": "Atlast_2091",
        "title": "How to Sell Drugs Online (Fast): The Final Season | Official Trailer",
        "content": "",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j43viw/how_to_sell_drugs_online_fast_the_final_season/"
    },
    {
        "id": "1j47eaj",
        "author": "luvlils",
        "title": "Shows not showing up",
        "content": "Is anyone else experiencing shows are not showing up on my tv for Netflix where im not able to see gossip girl for example it shows as remind me but when I go into the app its there for me to watch. Its the same with switching profiles everything is there except for the shows on my profile",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j47eaj/shows_not_showing_up/"
    },
    {
        "id": "1j4gqdg",
        "author": "Kesonac",
        "title": "Next series for me and my parents ? :D",
        "content": "So far we watched prison break, money heist and the 100.\nMy dad and I would rank it like:\n1: The 100\n2: Prison break and Money heist\n\nWhereas my mom would rank it like\n1: money heist\n2: prison break\n3: the 100\n\nSo as you can see Im not sure which series could be a good middle ground for me/my dad and my mom :D We all 3 loved all 3 series, only the 100 was a tad too complicated for my mom sometimes, but she still loved it:D anyone got an idea? (Prime is also an option, hope its allowed to say here)",
        "upvotes": 2,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1j4gqdg/next_series_for_me_and_my_parents_d/"
    },
    {
        "id": "1j3hzk7",
        "author": "Neat_Panda9617",
        "title": "I HIGHLY recommend Toxic Town!",
        "content": "Typical British production with incredible actors, well-written script, and compelling story. Thought it might be too much of a bummer but then I saw who was in it and gave it a shot. Watched all four episodes yesterday and stood up cheering when it ended.",
        "upvotes": 156,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1j3hzk7/i_highly_recommend_toxic_town/"
    },
    {
        "id": "1j3r39q",
        "author": "No_Culture7573",
        "title": "STILL not over this…",
        "content": "Is anyone else still salty about the ANNE WITH AN E cancellation ordered “jointly” by CBC and Netflix in 2019 just ahead to its season 3 premiere? I have never seen such fierce retaliation and clap back from a fanbase after a series cancelation ever, with a change.org petition reading 1.5 MILLION signatures. Hello CBC and Netflix executives???? Still also salty about Netflix saving Manifest for 2 more seasons despide being originally cancelled. Who even asked for that? 😂 ",
        "upvotes": 37,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1j3r39q/still_not_over_this/"
    },
    {
        "id": "1j4idgm",
        "author": "cmlcgf",
        "title": "I need series recommendations!!!",
        "content": "Pode ser qualquer gênero, mas eu AMO romance e fantasia. Ter romance na série é essencial para mim (mesmo que sejam só migalhas kkkk 🥹)\n\nObs: EXCETO The Vampire Diaries, Teen Wolf, Stranger Things, The Witcher, Winx, Cidade Invisível, Mundo sombrio de Sabrina, Wandinha, Sandman... \n(Ou eu já assisti essas ou não gostei 🙁)\n\nEntão, qual série BOA nesse estilo vocês me recomendariam?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1j4idgm/i_need_series_recommendations/"
    },
    {
        "id": "1j3n6kb",
        "author": "ECO_FRIENDLY_BOT",
        "title": "American Primeval",
        "content": "Really enjoyed this latest Western from Netflix which was surprisingly good and was up there with Godless in terms of quality. It's a pity they didn't make it 8 episodes as it's a very interesting period in American history especially the evolution of the Mormons and their bloody past. The cast was excellent especially rhe always reliable Betty Gilpin and Taylor Kitsch who is good in most things despite some of the hate he gets from critics. Shea Whigham is impressive as always and must be one of the best character actors working today. Also nice performance from Dane Dehaan who always delivers a memorable performance and really should be a bigger name in Hollywood. A quality show that stands out amongst all the rubbish on Netflix.",
        "upvotes": 52,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1j3n6kb/american_primeval/"
    },
    {
        "id": "1j432e2",
        "author": "skidmarks731",
        "title": "Where did the download button go?",
        "content": "I usually watch content on my phone on my train ride in. The typical \"my Netflix\" does not have my downloaded content anymore and there's no more icons for downloading any show or movies. Did something happen? ",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1j432e2/where_did_the_download_button_go/"
    },
    {
        "id": "1j3xaww",
        "author": "AllisonBurgers_O",
        "title": "Guysss , Never Have I ever / Emily in Paris / Ginny and Georgia .. Which one would you recommend other than the two .",
        "content": "I just wanna chill in-between by Studies tbh .\nIf I kept studying I'd be drained .So which one of these is better to Relax and Enjoy at the same time ? Any Suggestions appreciated 👏 ❤️ !!!",
        "upvotes": 6,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1j3xaww/guysss_never_have_i_ever_emily_in_paris_ginny_and/"
    },
    {
        "id": "1j3zoh8",
        "author": "heachx",
        "title": "Movies/shows with jungle adventures",
        "content": "Please recommend movies/shows like Jumanji, Lara Croft, Uncharted, Indiana Jones, The Lost City.\n\nBasically everything with treasure hunt, jungles, action, comedy that is available on netflix. ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j3zoh8/moviesshows_with_jungle_adventures/"
    },
    {
        "id": "1j436b2",
        "author": "flydaychinatown1",
        "title": "Specific movie only available in HD on phone?",
        "content": "Im watching Netflix via the app on desktop and im able the watch shows/movies in HD except one which im able to get in HD on my phone but I want to watch it in HD on desktop. Any solution?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j436b2/specific_movie_only_available_in_hd_on_phone/"
    },
    {
        "id": "1j4a903",
        "author": "Blu-",
        "title": "More anime is being added but closed caption only subtitles is ruining it",
        "content": "I was excited to watch Frieren only to discover it only has CC subtitles. I just can't enjoy it that way. But other shows like Dandadan have normal subtitles?\n\nWhy is that? Why are some CC and some not?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j4a903/more_anime_is_being_added_but_closed_caption_only/"
    }
]