[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 10,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 477,
        "comments": 3409,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1nat1a2",
        "author": "TheMirrorUS",
        "title": "All the Netflix shows canceled after one season in 2025 including The Waterfront",
        "content": "",
        "upvotes": 24,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1nat1a2/all_the_netflix_shows_canceled_after_one_season/"
    },
    {
        "id": "1navlwb",
        "author": "Witty-Swing3196",
        "title": "give really good recommendations worth watching.",
        "content": "hey everyone,\ni just got a new netflix subscription and i wanna make the most out of it. can you all recommend me the must-watch movies and series (any genre) that i should definitely not miss? basically the ones worth the money and give the best value of the subscription. also, if there are some shows or movies that are considered “must watch in order” kinda stuff, let me know too. thanks.",
        "upvotes": 12,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1navlwb/give_really_good_recommendations_worth_watching/"
    },
    {
        "id": "1nam8vf",
        "author": "_PonchoMan_",
        "title": "I Know This Is a Bit Old, But I Hate The New Layout/Setup for Netflix.",
        "content": "The titles and covers are so much larger, and I can't see as many series and/or movies that I used to. Plus, instead of the handy way of just going to the left for the options like Shows, Movies, and Search, I got a scroll all the way back up to select it. It's just a bit annoying. Why did they even do this? Did they think it would be a good change? It was perfect as is 😭 they somehow managed to make it worse in most/all aspects.\n\nEdit: my stupid brain just figured out that using \"back\" auto selects the search bar for me. Still mad about the larger titles tho lmao",
        "upvotes": 45,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1nam8vf/i_know_this_is_a_bit_old_but_i_hate_the_new/"
    },
    {
        "id": "1nawp65",
        "author": "AlanisBeauty",
        "title": "I’ve lost three snacks, one sock, and approximately an hour of my soul scrolling Netflix.",
        "content": "I need a show or movie so addictive it’ll make me forget I have a job, friends, and basic human responsibilities. Something that pulls me in, traps me on my couch, and convinces me that showering and eating are optional. Give me the content that will ruin my productivity, devour my free time, and leave me questioning all my life choices—but in the best way possible.",
        "upvotes": 9,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1nawp65/ive_lost_three_snacks_one_sock_and_approximately/"
    },
    {
        "id": "1natg7s",
        "author": "PakistaniSenpai",
        "title": "Can't find One Piece (season 1) on Netflix Singapore?",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1natg7s/cant_find_one_piece_season_1_on_netflix_singapore/"
    },
    {
        "id": "1na08er",
        "author": "Putrid_Care_9888",
        "title": "wednesday jenna ortega portrait, by me",
        "content": "",
        "upvotes": 299,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1na08er/wednesday_jenna_ortega_portrait_by_me/"
    },
    {
        "id": "1napjqs",
        "author": "Financial-Nail3191",
        "title": "How do I remove a user without logging out everyone else?",
        "content": "Just found out my ex best friend has been leeching off my Netflix account for years and I’m pissed. She doesn’t have an account, she is logged in but watches stuff on my account (so the stuff she watches shows up on my account) I gave her the password in secret and I can’t tell my parents to disable/change the password because they would be pissed if they knew I gave the pass to other people. How do I boot her out? Any help appreciated, thanks.",
        "upvotes": 6,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1napjqs/how_do_i_remove_a_user_without_logging_out/"
    },
    {
        "id": "1na7bk1",
        "author": "SlowAerie3866",
        "title": "Good murder suspense, thriller shows to watch?",
        "content": "Recently watched the Residence, Dept Q, Untamed which were good shows. Any other shows like these? I also tried watching the hunting wives and that show was not good at all.\n\nThank you all for recommending great shows that i didn’t even know existed! ",
        "upvotes": 108,
        "comments": 170,
        "media": null,
        "permalink": "/r/netflix/comments/1na7bk1/good_murder_suspense_thriller_shows_to_watch/"
    },
    {
        "id": "1namn3x",
        "author": "RudeGate1791",
        "title": "Movies/Series to watch on a long flight!",
        "content": "hi! I have a flight of around 7 hours upcoming soon. \n\nI don't like long flights that much, and I can't sleep that well on flights so, can you guys please recommend some good movies or series that I can watch on flight?\n\nI like anime (slice of life, maybe a bit of romcom, action like DS, JJK..)...\n\nNormal movies/series which are interesting and can hook you from the beginning...(Not horror or tragedies please)\n\nThank you. ",
        "upvotes": 11,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1namn3x/moviesseries_to_watch_on_a_long_flight/"
    },
    {
        "id": "1nax2ld",
        "author": "LMysterio",
        "title": "Looking for a show I watched",
        "content": "Around 2018/2019 I watched a supernatural, eerie anime. I can't remember the name, but I know that there was a character who got crushed by a wooden panel with his dog and became half dog-half man. And some old guy who may have been an older version of a certain character that the mc kept meeting in a gas station store. There also may have been a gumball machine by a tree. On Netflix. Hope you can help.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nax2ld/looking_for_a_show_i_watched/"
    },
    {
        "id": "1nan50u",
        "author": "bingbongsf",
        "title": "The Residence: Bruce &amp; Elsyie",
        "content": "I may have been missing something, but in the final episode, just before Cupp could identify Lily as the killer, Lily spins a whole tale about protecting Bruce and Elsyie, wouldn’t Bruce &amp; Elsyie then immediately know she was the killer, as she was making up this story that they know is not true?",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nan50u/the_residence_bruce_elsyie/"
    },
    {
        "id": "1naicd5",
        "author": "Smooth-Extent3897",
        "title": "Does anyone else lock their profile because of their parents?",
        "content": "My parents frequently, I guess more specifically my dad, doesn't really care what profile he uses to watch his things, and because I have set up most of our streaming services for our house my profile comes up first. He frequently uses mine even when he has his own and it messes up my show and movie algorithm. I locked them. He can no longer access my profiles. He grumbled about it at first but accepted my reasoning surprisingly quick. It's not like we never use my account at all to watch things as a family but it was a little annoying that his movie suggestions took over my profile. ",
        "upvotes": 9,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1naicd5/does_anyone_else_lock_their_profile_because_of/"
    },
    {
        "id": "1narw7s",
        "author": "pika133",
        "title": "Bug involving content refusing to stream in Dolby Vision",
        "content": "Hey,\n\nI have an Apple 4K TV device that I use on my LG G4 TV.\n\nI think I stumbled on a bug:\n\nI watched Wednesday season 2 episode 5 and it was (as it should) in Dolby Vision.  \nRight after finishing episode 5 when I tried watching season 2 episode 6 it wasn't in Dolby Vision but in regular HDR.  \nStopped the episode, closed the app, reopened Netflix app and episode and it still was in HDR and not Dolby Vision.  \nAfter an Apple TV device restart the episode was in Dolby Vision again.\n\nAnyone else encountered the issue?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1narw7s/bug_involving_content_refusing_to_stream_in_dolby/"
    },
    {
        "id": "1napzey",
        "author": "IAmPookieHearMeRoar",
        "title": "Timely Basterds",
        "content": "Hello all,\n\nA long time ago I saw Tarantino’s *Inglorious Basterds* in the theater.  I saw it with a couple of buddies, and before we went we toked up a bit.  I kind of liked some of it but just thought it was mostly “meh.”  As time went on, the so-called cinephiles in my circle of friends consistently kept telling me how great it is.  And as a result, I’ve wanted to watch it again so I could at least explain to them why it wasn’t as great as they say.  \n\nIt just became available on Netflix in the US, not sure about other regionals.  I just finished watching it, and my god am I blown away.  I recommend anybody who has not seen it to give it a look.  The subject matter is VERY relevant to what’s going on in the world right now and Tarantino’s nasty and violent style makes it work even better in the year 2025.  That must’ve been some great weed back in 2009 cuz I didn’t remember a lot of it.  Woof, terrific movie. \n\nGive it a shot y’all.  You won’t regret it.  Cheers. ✌️",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1napzey/timely_basterds/"
    },
    {
        "id": "1naoqly",
        "author": "uchikanda",
        "title": "Why are Netflix ads so bad?",
        "content": "I have the standard with ads account in the UK and wondering why the ads are so terrible. Like there seems to be only 3 ads in total of all betting sites. So at every ad break I get the same 3 ads of betting companies. Is this the case for everyone?\n\nBear in mind never have I ever had the slightest interest around betting or sports. Surely this is just bad advertising and targeting lol. How is it so hard to at least show me something I might be slightly interested in",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1naoqly/why_are_netflix_ads_so_bad/"
    },
    {
        "id": "1n9xhl5",
        "author": "AppropriateAdagio972",
        "title": "Question about the Michigan High School Documentary",
        "content": "Did Kendra Licari get paid for her part in the documentary? Just curious because I watched when high and am genuinely curious. Hope anyone reading haves a good day!!",
        "upvotes": 47,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1n9xhl5/question_about_the_michigan_high_school/"
    },
    {
        "id": "1nac0nl",
        "author": "Ghostbuster004",
        "title": "Best comedy drama series to watch?",
        "content": "Somebody suggest me a best comedy drama series on Netflix which would relive any stress and bring laughter. I just finished never have I ever and I love it. I'd appreciate if it has a same vibe as never have I ever. ",
        "upvotes": 7,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1nac0nl/best_comedy_drama_series_to_watch/"
    },
    {
        "id": "1nan6ri",
        "author": "U196",
        "title": "How do you delete/clear the previously used icons on profiles?",
        "content": "When you go to Account Settings &gt; Manage Profiles &gt; Profile &gt; Edit Personal &amp; Contact Info &gt; Edit Profile Icon &gt; How do you delete/clear the previously used icons on there?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nan6ri/how_do_you_deleteclear_the_previously_used_icons/"
    },
    {
        "id": "1na30y8",
        "author": "Proper_Bridge_1638",
        "title": "Love Con Revenge - Question re. Dr. Wickerson",
        "content": "If you’ve watched Love Con Revenge and the episode “A Fraudster in the Family,” I can somewhat understand why there was nothing they could do about the money that was “stolen” from his wife. I assume she was investing in a business that she had ownership in and the money was used to pay for operating costs.\n\nHere is my question… Why didn’t the stepdaughter go after him for identity theft if he was taking out loans in her name? I wish they explored this more. The episode felt anti-climactic when they tracked him down, only to say nothing happened afterwards. \n\nWhat are your thoughts? 🕵️‍♀️🕵️‍♀️🕵️‍♀️",
        "upvotes": 16,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1na30y8/love_con_revenge_question_re_dr_wickerson/"
    },
    {
        "id": "1nalq1v",
        "author": "chefboyardank666",
        "title": "old(ish) alien/extraterrestrial show",
        "content": "so there used to be a show on netflix about declassified documents from the government about a lot of alien stuff and whatnot. \n\nthe intro claimed there were like 70,000 declassified documents they had \n\nthe documents were stored in some secret location \n\nnetflix only had one season for the longest time but i think weeks before they took it away there was a season 2 released \n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nalq1v/oldish_alienextraterrestrial_show/"
    },
    {
        "id": "1nagcn6",
        "author": "Eclipse8301",
        "title": "Account sharing question",
        "content": "I currently have my own account and would like a family member to add me on his account ($8.99). Should I cancel my account or will whatever my family member does overwrite and “update” my plan?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nagcn6/account_sharing_question/"
    },
    {
        "id": "1naakbl",
        "author": "Firm-Contact7808",
        "title": "Aaron from Love Con Revenge deserves Justice #LoveConRevenge",
        "content": "I just finished watching Love Con Revenge, which by the way lacks any type of flow or consistency between cases, and feels heavily scripted. But, anyway, I would like to highlight Aaron's case. He came across as such a sweetheart, and I cannot believe he has not gotten any justice. What is your thoughts?",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1naakbl/aaron_from_love_con_revenge_deserves_justice/"
    },
    {
        "id": "1na3cqv",
        "author": "Warm-Big1567",
        "title": "What Happened to The Summer Hikaru Died?",
        "content": "I was in the middle of watching this anime and when it was supposed to go to the next episode is wasn’t there. The info page then has no episodes listed, only teasers and more like this. I closed Netflix and reopened it but when I searched the show up again it wasn’t even there. \n\nWhat’s happening?",
        "upvotes": 10,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1na3cqv/what_happened_to_the_summer_hikaru_died/"
    },
    {
        "id": "1nad4qf",
        "author": "Rayne_FTW",
        "title": "Show that was similar to Friend request/Unfriended",
        "content": "My girlfriend and I have been looking for a show we watched a couple years ago that was similar to Friend Request and Unfriended. All I remember is that the premise is a bunch of new college kids are drinking at a party at the start of the show and then someone gets killed. Someone kept texting the characters about who will die and when. The dudes name always showed up as Monkey something? I cant remember. The end of the show takes place in like a skatepark underneath a bridge or something like that. I have been looking for over an hour to try to rewatch it. Does anyone remember any show that was like this? Thanks!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nad4qf/show_that_was_similar_to_friend_requestunfriended/"
    },
    {
        "id": "1naha68",
        "author": "sauceross24",
        "title": "Wrong Episode Order",
        "content": "I'm watching Franklin and Bash for the first time and I just got to season 2 and was very confused for the first few episodes and then got to supposed episode 4 and it seemed like a flashback episode so I googled it and it's not. It's actually supposed to be the first episode of the season!!\n\nI went through all of the seasons on Netflix and compared them to the IMDb list and a lot of episodes are out of order. Does anyone else have this issue? Who can I submit this issue to to get it fixed? It threw the whole show off for me now.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1naha68/wrong_episode_order/"
    },
    {
        "id": "1na8skx",
        "author": "Empty-Instruction282",
        "title": "New Netflix Rom Com movie French Lover starring Omar Sy official trailer.",
        "content": "talented actor Omar Sy stars in French Lover, a 2025 Netflix rom-com about a jaded actor falling for a waitress. Known for Netlfix Lupin hit serie and famous french movie Untouchables, Omar Sy’s charm shines. Directed by Lisa-Nina Rives, it premieres September 26 on Netflix. What is Omar Sy best movie and serie? top 5?\n\n* Lupin (2021–present)\n* Untouchables (2011)\n* Two Is a Family (2016)\n* The Takedown (2022)\n* Samba (2014)",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1na8skx/new_netflix_rom_com_movie_french_lover_starring/"
    },
    {
        "id": "1n9pu3u",
        "author": "ExpensiveOstrich3559",
        "title": "Katrina: Come Hell and High Water",
        "content": "One of the best modern day documentaries I’ve watched. Few documentaries have made me cry at the end of it, however my heart ached for the people of New Orleans. The Federal Government incompetence and lack of support made me angry as well. The interviewees were very good at helping you make sense of what really happened. I’ve heard that some people didn’t like the Spike Lee episode, but I loved it. The personality and culture of New Orleans shone through the people. It also that the aftermath of Katrina still has a major impact on Modern day New Orleans. Very well done Netflix.",
        "upvotes": 38,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1n9pu3u/katrina_come_hell_and_high_water/"
    },
    {
        "id": "1nadxbw",
        "author": "BearyBearBearBear",
        "title": "Netflix on Xbox series x",
        "content": "I’ve been watching Netflix on my Xbox for well over a year now but all of a sudden it does not want to display properly. The audio plays fine but the glitch is with the display. Either splits into four screens and only shows grey screens or just stuck on the title screen and audio keeps going.  It’s not the hdmi as YouTube and all the games work find. I’ve uninstalled and reinstalled Netflix but it hasn’t made a difference. It has become unusable on my xbox. Anyone have this happen to them or know of any solutions? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nadxbw/netflix_on_xbox_series_x/"
    },
    {
        "id": "1n9tcqi",
        "author": "ysleez",
        "title": "The Chestnut Man, a really engrossing Nordic thriller!",
        "content": "I really liked it. It's a great crime thriller with a ton of climax and tense atmosphere all around. The whole vibe is perfect, super dark, gloomy Scandinavia and I love the role the little chestnut mans play in it. The main detectives, Thulin and Hess, have that classic clashing-partners dynamic that totally work. The story may not make a lot of sense until you know the chain but it does well to ask you to just go with it. Also, a heads-up, it is quite graphic. Even with its flaws, it’s an awesome watch if you're looking for a dark, fast-paced thriller with some good twists and turns that'll keep you hooked, go for it!\n\nI'd give it a 7.8/10\n\nFlaws: some may feel its a bit predictable (I didn't feel that way) at the end and you have to suspend your beliefs about the killer's abilities lol.",
        "upvotes": 16,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n9tcqi/the_chestnut_man_a_really_engrossing_nordic/"
    },
    {
        "id": "1na2rfs",
        "author": "Training-Plastic1457",
        "title": "Rewatching Vampire Diaries",
        "content": "I have today started rewatching Vampire Diaries from season one. And I gotta say that Elena is as insufferable as ever. Good thing is I am still Team Damon. ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1na2rfs/rewatching_vampire_diaries/"
    }
]