[
    {
        "id": "1nnicpi",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 33,
        "comments": 6392,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nnicpi/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1nrzlx9",
        "author": "IcefoxX5",
        "title": "[Match Thread] Real Madrid Castilla - CD Tenerife | Primera Federación, Matchday 5",
        "content": "#FT: CASTILLA 1:3 TENERIFE\n\n&amp;#x200B;\n\n#1ª FEDERACIÓN\n\n&amp;#x200B;\n\n**Scorers/replays:** \n\n0:1 Jesús de Miguel 17'\n\n0:2 Álvaro González 37'\n\n0:3 Jesús de Miguel 44'\n\n1:3 Roberto Martín 68'\n\nSecond yellow card: Lamini Fati (Castilla) 90'+6\n\n&amp;#x200B;\n\n**match updates:** \n\n1' - kickoff, vamos\n\n7' - great free kick by Bruno Iglesias, but even better save to deny it\n\n⚽ 17' - goal for Tenerife - long kick by the keeper that Joan misjudges, leaving de Miguel free to convert 1v1 against Javi Navarro\n\n22' - big chance again after a long ball for de Miguel, but this time Javi Navarro makes a great 1v1 save\n\n⚽ 37 - corner for Tenerife, no one marks Álvaro González (ex Villarreal, Marseille...) so he can head it into the bottom corner with all his experience and physicality \n\n⚽ 44' - Tenerife are destroying Castilla like Atlético did with our first team - de Miguel toys with our defense on the box, Joan again looking awful, and curls it into the far corner \n\nHT - a horror first half against the best team in the division - this Castilla team is looking hopeless at the moment\n\n🔄 46' - 2nd half underway, Lamini and Roberto Martín on for Joan and Bruno Iglesias\n\n🔄 55' - Valdepeñas on for Manu Serrano \n\n🔄 67' - Dani Yáñez for Pol Fortuny, still no fight from this team... \n\n⚽ 68' - GOLLLL DEL CASTILLA - Roberto Martin loses the ball, but fights back and recovers it, and pulls the trigger immediately from outside the box to put it into the bottom right corner - this is the first final Tenerife have conceded this season \n\n73' - Castilla now really pushing, possibly the best minutes the team has played all season \n\n🔄 83' - last sub, Jacobo on for Manuel Ángel\n\n88' - incredibly save by the Tenerife keeper on a header by Jacobo. A potential foul afterwards in the box is challenged for review by Arbeloa\n\n90'+2 - after a very long review, the ref decides no penalty\n\n🟥 90'+6 - second yellow for Lamini who makes a stupid and unnecessary tactical foul while already on a yellow \n\nFT - a decent second half is too little after league leaders Tenerife had already decided the match in the first. A 1-3 loss against what is clearly the best team in the division is normally no shame, but with now 4 losses in a row and multiple players missing the next weeks due to the U20 World Cup + Fettal injured and Lamini now suspended, the situation is looking extremely dire and hopeless for Arbeloa's team. Solutions need to arrive quickly \n\n&amp;#x200B;\n\n**Kickoff:** 18:30 CET\n\n**Venue:** Estadio Alfredo di Stéfano, Madrid\n\n**Referee**: Gonzalo Romero Freixas\n\n**Competition:** Primera Federación, Grupo 1, Matchday 5\n\n**Viewing options:** \n[LaLiga+](https://www.laligaplus.laliga.com/) (subscription - 14.99€/month) (only available in Spain)\n\n&amp;#x200B;\n\n**Castilla XI** (5-2-3): Javi Navarro - Manu Serrano (55' Víctor Valdepeñas), Mario Rivas, Joan Martínez (46' Lamini Fati), David Jiménez - Jorge Cestero, Manuel Ángel (83' Jacobo Ortega), César Palacios - Bruno Iglesias (46' Roberto Martín), Loren Zúñiga, Pol Fortuny (67' Dani Yáñez) \n\nBench: Guille Súnico (GK), Alejandro Moya, Gabri Castrelo. \n\nUnavailable: Fran González (U20 World Cup), Sergio Mestre (first team call-up), Diego Aguado (U20 World Cup), Jesús Fortea (U20 World Cup), Cristian David (U20 World Cup), Hugo de Llanos (injury), Rachad Fettal (injury). \n\nCoach: Álvaro Arbeloa\n\n&amp;#x200B;\n\n**Castilla last five matches:** WWLLL\n\n**1ª RFEF stats:** 17th | 3pt | 1-0-3 | 2:4\n",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nrzlx9/match_thread_real_madrid_castilla_cd_tenerife/"
    },
    {
        "id": "1nsy4xr",
        "author": "willi7lol",
        "title": "When we were 2-0 down at Anfield. This is what we are missing.",
        "content": "We lack leaders. We lack grit. We lack calmness. We lack heart. We lack fight. \n\nNot being reactionary, ever since Benzema left, followed by Kroos, followed by Modric droppedbfrom the starting XI to be a rotation player. This has been going on ever since Kroos left. No leaders on the pitch. \n\nLook at how Modric and Benzema led the team when we were trailing in a big game. No panic and no heads down. Completely focused on the task at hand and focused on making the comeback. Fast foward 2 years later, when we are struggling and things aren't going our way, what do we do ? The leaders of the dressing room tries to hide and hang their heads rather than leading the team and motivating them to make a comeback.",
        "upvotes": 1307,
        "comments": 81,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/d39oz7p8pyrf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nsy4xr/when_we_were_20_down_at_anfield_this_is_what_we/"
    },
    {
        "id": "1nt3e53",
        "author": "faheemhassan",
        "title": "Real Madrid arriving at Almaty Hotel [OC]",
        "content": "",
        "upvotes": 187,
        "comments": 11,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/wc43n58ntzrf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nt3e53/real_madrid_arriving_at_almaty_hotel_oc/"
    },
    {
        "id": "1nspzth",
        "author": "killorbekilled_",
        "title": "Atlético used to be light work for us when we had HIM, miss the GOAT at our club everyday.",
        "content": "For some reason, he was always especially lethal against them. He's directly responsible for snatching away at least two to three Champions league trophy from them. \n\nSimeone has coached Atlético Madrid in over 800 games, and they've only conceded 4 hat-tricks, all to Cristiano Ronaldo. \n\nGames truly felt like we were starting 1-0, when we had him. No matter how bad it got, you always had this confidence, this belief that it would all be okay, because we still had him on the field, he'd get us the victory somehow, and he did. It was like we had a nuclear weapon in our team, we could turn to if all else failed.\nAnd he also, never looked as beautiful he did, except for when he was wearing the white.",
        "upvotes": 876,
        "comments": 49,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/pqcjhlb93xrf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nspzth/atlético_used_to_be_light_work_for_us_when_we_had/"
    },
    {
        "id": "1nsszqo",
        "author": "axhp",
        "title": "it’s Xabi Alonsover.",
        "content": "",
        "upvotes": 488,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/anhlm421pxrf1.jpeg?auto=webp&amp;s=e65da936f8312f93fa8bc8f297d05335a9ab5095"
        },
        "permalink": "/r/realmadrid/comments/1nsszqo/its_xabi_alonsover/"
    },
    {
        "id": "1nt8adw",
        "author": "ZebrawithStripe",
        "title": "Just an observation of the general state of this sub.",
        "content": "I swear I am not joking but most people in this sub literally wake up to just start doom posting whenever we lose 1 game after a 7 GAME WIN STREAK. Like cmon bro. And the fact that people are still trying to find a scapegoat is baffling honestly. WE DONT HAVE TIME FOR THIS. All we can do is reflect on this game, discuss mistakes and that's it. We can't change the outcome, we can't do what if's. We have another game that we have to focus on and it's on TUESDAY. We can't wallow like this. Some people posting and are talking about mentality, we can't have a mentality as a fanbase of pointing fingers and blaming one specific player or individual in this club. I'm not saying we can't point out mistakes, I'm saying that people are focusing too much on putting all the blame on one sole individual. \n\n  \nI was mad. I was frustrated. But I moved on. You people who haven't yet, should too. Just stop with the doomposting. The season just started ffs. ",
        "upvotes": 50,
        "comments": 37,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nt8adw/just_an_observation_of_the_general_state_of_this/"
    },
    {
        "id": "1nsny1w",
        "author": "ContextDry9672",
        "title": "players leaving to Kazakhstan, lol the loss look like its affected them this time hope its get better hala-madrid",
        "content": "",
        "upvotes": 715,
        "comments": 126,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zph12r6anwrf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nsny1w/players_leaving_to_kazakhstan_lol_the_loss_look/"
    },
    {
        "id": "1nt01wx",
        "author": "PlantComprehensive77",
        "title": "€1B squad that can’t defend crosses or score from crosses",
        "content": "It’s honestly impressive that we managed to build a €1B squad that literally cannot defend crosses or score from them. Doesn’t matter whether it’s high crosses for headers or low crosses for cutbacks. Mind you this is a club that was once feared in the entire football world for scoring from crosses with the likes of CR7, Ramos, Big Benz, etc. \n\nThis makes our attack so pathetically one-dimensional it’s hilarious. You got fans in this sub who think we’re going to win the league/CL by just having Guler spam a million through balls to Mbappe. Even Barcelona who has never been known for crossing the ball a lot, have an aerial threat in Lewandowski, and Raphinha is decent at scoring from crosses. \n\nOh, one more thing, can we sack our set piece coach asap? Atletico could have scored 3 goals from corners yesterday. Meanwhile, all our set pieces were absolute dogshit. ",
        "upvotes": 140,
        "comments": 37,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nt01wx/1b_squad_that_cant_defend_crosses_or_score_from/"
    },
    {
        "id": "1ntbeqe",
        "author": "Big-Swimmer7083",
        "title": "Bro y'all need to calm tf down",
        "content": "I know nobody likes a defeat, especially not by atletico and especially not by a margin of 3 goals, but calm down, xabi is new, he's only been here since august, and there has been a lot of improvements in the team since, I know it's nowhere near the best but it takes time, losses are a part of the game. I saw some people talking about benching or maybe even selling players like fede and jude and rodrygo. Jude came back from injury, yeah it was a bad decision for him to start, but we know the quality he brings to the team, he's a maestro on the ball, let's just give him some time to get adjusted again, and fede?? Holy, criticism is completely fair but this sub is filled with reactionary fans, what would happen to you if you supported your local team where they barely win anything.   \nI swear I'll lose my mind if I see another post on why some player should be benched or sold or that he's shit or doesn't fit the system, from what we know of xabi, he's not reluctant to change the system, he'll adapt with the players he has, you just gotta trust in him",
        "upvotes": 23,
        "comments": 17,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ntbeqe/bro_yall_need_to_calm_tf_down/"
    },
    {
        "id": "1ntbi7u",
        "author": "Small-Ideal-5839",
        "title": "The Never Ending Mbappe Problem",
        "content": "The Atlético match marked Xabi’s first loss of the season (excluding the Club World Cup).\nThis defeat made the issues in both our attack and defense painfully clear. One area of particular concern is our attack, which has noticeably declined since Mbappé joined the squad.\n\nTo be clear, Mbappé is an exceptional player and is giving his all on the pitch. However, the problem is more tactical in nature, specifically, the challenge of integrating both Mbappé and Vini into the same starting XI.\n\nIf you analyze our matches over the past year, it becomes evident that we’re doing very little in the most critical attacking area: Zone 14, the space just outside the opponent's penalty box. This zone is where elite attacking teams create their most dangerous chances, yet we’re almost completely ineffective there. The root of the issue is that we aren’t playing a true number 9. A traditional striker would occupy two defenders, make penetrating runs into the six-yard box, and thereby open up Zone 14 for attacking midfielders like Bellingham or Güler to exploit.\n\nCurrently, Mbappé is being deployed centrally, but as the game progresses, both he and Vini drift to the left. Even when Mbappé stays central, he tends to wait outside the box for cutbacks rather than making runs that disrupt defensive lines. As a result, no one is stretching the defense, and our attack becomes one-dimensional, predictable and easier to contain.\n\nUntil Mastantuono joined, the right wing was virtually non-existent. While he brings much-needed dynamism, he still needs a central player to link up with. A true striker holding a central position would allow for quick combinations, making us a threat from all three channels: left, right, and center.\n\nThese issues could potentially be addressed by starting Gonzalo, who appears to be the best option available for the number 9 role. However, the club continues to prioritize fitting both Vini and Mbappé into the lineup, a combination that, so far, has not yielded the desired balance. This setup may suffice against second-tier teams, but the moment we face sides with strong structure and intensity, we struggle significantly.\n\nLet’s hope Xabi can recalibrate after this setback. 🤞",
        "upvotes": 19,
        "comments": 18,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ntbi7u/the_never_ending_mbappe_problem/"
    },
    {
        "id": "1nsztm7",
        "author": "sufferorignite",
        "title": "Modric is still owning and playing more than 80 minutes",
        "content": "This post shows up after every Serie A matchday, but someone always brings up the same argument about his age and contribution, how he supposedly blocks a midfield spot and stops the growth of players like Arda.\n\nBut after today’s Napoli match, I don’t care about any of that.  \nWE NEEDED MODRIC, AND HE’S SHOWING MILAN EXACTLY WHAT HE BRINGS TO THE TEAM.\n\nIf Valverde, Bellingham, Arda, and Ceballos don’t have those qualities, then they need to step up their game because a 40-year-old is outshining them.",
        "upvotes": 88,
        "comments": 26,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nsztm7/modric_is_still_owning_and_playing_more_than_80/"
    },
    {
        "id": "1nsx84b",
        "author": "RM-PostMatchSurveys",
        "title": "[Post-Match Survey Results] Real Madrid 2-5 Atletico Madrid",
        "content": "",
        "upvotes": 109,
        "comments": 51,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/m7p5i4jsiyrf1.png?auto=webp&amp;s=315a69c1289fef482c21f5797db1a4cab6d797a6"
        },
        "permalink": "/r/realmadrid/comments/1nsx84b/postmatch_survey_results_real_madrid_25_atletico/"
    },
    {
        "id": "1nsbcmx",
        "author": "adnshrnly",
        "title": "idk man, Augsburg used to walk right into my system",
        "content": "",
        "upvotes": 2603,
        "comments": 123,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/iwqkaxjl1trf1.jpeg?auto=webp&amp;s=f8e41bffd6e70d687a5c65cd0f8e764310923bfc"
        },
        "permalink": "/r/realmadrid/comments/1nsbcmx/idk_man_augsburg_used_to_walk_right_into_my_system/"
    },
    {
        "id": "1nsmrn7",
        "author": "ViniciusFastAF",
        "title": "Which player would you choose if both were at their absolute peak, free of injuries, R9 or CR7 ?",
        "content": "",
        "upvotes": 293,
        "comments": 186,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/lu82p7kycwrf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nsmrn7/which_player_would_you_choose_if_both_were_at/"
    },
    {
        "id": "1nt0r8e",
        "author": "Kraphomus",
        "title": "Real Madrid submit Barca ex-presidrnts' confessions to the judge of the Negreira Case",
        "content": "",
        "upvotes": 51,
        "comments": 6,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nt0r8e/real_madrid_submit_barca_expresidrnts_confessions/"
    },
    {
        "id": "1nskwjd",
        "author": "redsenjui",
        "title": "Next month 😔 sorry Fede.....",
        "content": "",
        "upvotes": 339,
        "comments": 41,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/plc0499atvrf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nskwjd/next_month_sorry_fede/"
    },
    {
        "id": "1ntbydp",
        "author": "Thomas7Shelby",
        "title": "Xabi knew the problem… but didn’t fix it.",
        "content": "It still  hurts. The biggest reason for the defeat was predictability. Xabi himself said a few days ago that we need to be less predictable, but when it came to the match nothing really changed.\n\nAt Leverkusen, one thing I loved about him was how balanced the attack was. Around 33% down the left and through the center and  on the right. Here with us it’s always the same pattern everything goes through the left, we were successful in previous matches when doing this but we can leave the center empty, and the right side barely exists. Opponents know exactly what’s coming.\n\nIn previous matches, when Mastantuono was starting, we actually had some balance because the kid gave us a real threat on the right. But taking that option away made us repeat the same mistake from last season. Rushing Bellingham back and sacrificing the RW just made things worse and honestly felt like a rookie mistake.\n\nThen came the bad luck too. No Trent, and Carvajal’s injury took away the last bit of threat we had on the right. With both out, we were way too one-dimensional.\n\nIt's good this happened this early, We’ll bounce back. Xabi learns fast, and he will fix these mistakes.\n\nHala Madrid.",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ntbydp/xabi_knew_the_problem_but_didnt_fix_it/"
    },
    {
        "id": "1nsjv1r",
        "author": "Grouchy-Support-1019",
        "title": "Almost 75 years since...",
        "content": "",
        "upvotes": 296,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qwug83fbhvrf1.png?auto=webp&amp;s=786cdf62a6f99073c9df4e217cc56cdb421820f7"
        },
        "permalink": "/r/realmadrid/comments/1nsjv1r/almost_75_years_since/"
    },
    {
        "id": "1nt1c4e",
        "author": "Puzzleheaded_Tea8174",
        "title": "Simeone Just Tactically Dominated Alonso, Here’s How",
        "content": "",
        "upvotes": 22,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pmzT2lvdQqnAYMTBLS_YqhRqG0YL4P79maaEFBqc8ZE.jpeg?auto=webp&amp;s=bb121341bb323f6df88158de4bf184370d97795e"
        },
        "permalink": "/r/realmadrid/comments/1nt1c4e/simeone_just_tactically_dominated_alonso_heres_how/"
    },
    {
        "id": "1nsxk1b",
        "author": "Lekanswanson",
        "title": "Xabi Alonso cannot afford to be naive in the big games",
        "content": "Took a while to process the loss and I really had to try to not let it affect my whole weekend. In saying this, I fully blame the loss on Alonso because its obvious the team selection was dog shit and rushing back Bellingham even though we all are happy he's recovered from surgery but playing him in a match of that caliber was a huge mistake.\n\nI think what made it even more shocking was that Alonso has played in these derbies as a player and he should have 1000 percent know the type of intensity that simeone and Atletico were coming with and it seems he underestimated this and paid for it but ultimately defeats like this are totally unacceptable. If we had lost 3-2 it would have been a sad loss but an understandable one but a Madrid team should never lose any match against any team by more than a 2 goal margin. I don't care how good the team is, if we need to play Mourinho type football to get the win of stop the bleeding then the player should fucking do that.\n\nAlso why have we collectively as a club decided that Ceballos cannot be a regular for madrid, there seems to be this idea going on that he's not madrid quality but funnily enough I don't remember him ever playing and us losing by a huge margin and if places on the team are truly based on merit then he should be playing and deserves a chance to prove and cement his place in the starting lineup just like any other expensive signing.\n\nOverall, these humiliating defeats need to stop, losing is a part of the game that we can accept but losing 4 nil and 5-2 like this is just not acceptable for a club of this standard and we as a fanbase should not accept it because its a slippery slope.",
        "upvotes": 30,
        "comments": 28,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nsxk1b/xabi_alonso_cannot_afford_to_be_naive_in_the_big/"
    },
    {
        "id": "1nst4qe",
        "author": "Bunchdawg",
        "title": "Alright, we should build around Arda Guler..",
        "content": "For the rest of this season, our pieces on the field should be tailored to build on Guler’s strengths AND Weaknesses. Other players have had enough chance to make their marks in the mid, but what he’s shown with the limited time he’s had, has given him a head up to be our maestro. We have the pieces now to hide his defensive weaknesses and also to complement his strengths on offense. Xabi will have to make the call and get everyone on board sooner than later. Think early Messi or KDB. Passing geniuses who needed defensive help around them to keep their pocket open. He can have similar impact on the game if given the chance to control.  ",
        "upvotes": 36,
        "comments": 70,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nst4qe/alright_we_should_build_around_arda_guler/"
    },
    {
        "id": "1ns4ymk",
        "author": "FrrancondonaEra",
        "title": "U can't be a Real madrid player and do a pass like this its unacceptable",
        "content": "",
        "upvotes": 1437,
        "comments": 226,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/f9gyt8cwkrrf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ns4ymk/u_cant_be_a_real_madrid_player_and_do_a_pass_like/"
    },
    {
        "id": "1nt3ux6",
        "author": "roberty3k",
        "title": "Real Madrid vs Villarreal Match",
        "content": "Hi! \n\nI'm going to be in town on the 4th of October and am trying to get 2 tickets for the match.  I am a Madridista Premium, but I'm not sure I can get my hands on tickets by the time they go on sale later today.\n\n  \nHow many tickets can Madridista Premium purchase, and is it pretty much impossible to be able to get a couple via the website once we can purchase them?",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nt3ux6/real_madrid_vs_villarreal_match/"
    },
    {
        "id": "1nsj4bz",
        "author": "musecly_monkey",
        "title": "My thoughts about the loss",
        "content": "Not the result we wanted, but honestly, I don’t think this is the end of the world. Yes, we got humbled, but I can actually see some positives and lessons for the future. Here are my thoughts on where Xabi slipped up:\n\n1. **Jude starting** – Should’ve been used as a super sub. His impact off the bench could’ve flipped the game.\n2. **Arda being subbed off** – Huge mistake. The kid is our main playmaker, and pulling him killed our creative spark.\n3. **Aerial weakness** – With Rüdiger out, we had no presence in the air. Against Atleti, that’s a recipe for disaster.\n4. **Vini vs Rodrygo** – Rodrygo’s scoring record against Atleti speaks for itself. He should’ve replaced Vini.\n5. **Inexperience** – Dean, Carreras and others still don’t fully grasp the intensity and tactical grind of a derby. It showed.\n\nBut here’s the silver lining: this loss might be the best thing for us. The players won’t get carried away with confidence, and it gives them a reason to dig deeper, fight harder, and sharpen up before Barca. Better to take this lesson now than be exposed later.\n\nThe future still looks exciting. We’ve got a young core, a coach who’s learning, and a squad that will only get better from here.",
        "upvotes": 113,
        "comments": 55,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nsj4bz/my_thoughts_about_the_loss/"
    },
    {
        "id": "1ntcuhv",
        "author": "c-k-m",
        "title": "Why should we as a fan base lower expectations and be more understanding ?",
        "content": "I'm sorry is I offend people, but in my book, everyone saying \"this is one loss in september\" \"one loss is nothing\" \"I as a more smarter person than all of you have moved on so should you\" are dull and should not support Real Madrid. \n\nWe are the club that booed Casillas, CR7, KB9 and many others. THIS is the level of standards set for the club. \n\nLosing is part of the game of course. Taking the L against a team that outsmarted our team is quite normal and is frequently seen all around the world. \n\nBut losing EVERY SINGLE IMPORTANT MATCH, and by quite the margin seems to be normal and part of the process.. How can people think like that ? What process is that ? We, as supporters, are the ones to set the bar for standards. If losing by 5 in a derby normal, then we became supporters of a dull club. I am once again sorry, but we are not Dortmund Barca or Manchester United. We are a rich club, with large resources and an unbelievable squad. \n\nLosing by 5 in september is better than losing by 5 in March, this I can agree on. But losing by 5 and moving on is not a good state of mind. We, the club the coaches and the players should reflect more on what happened. This loss was not an accident, this loss was STUPID. I think everyone here can agree that upon seeing the midfield we were all like oh ow, jude fede and tchoua ? Arda on the right ? hmmm\n\nSo please, if you think that people ranting on this sub about the loss are crazy, think about it once again. \n\n  \n \n\n\n\n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ntcuhv/why_should_we_as_a_fan_base_lower_expectations/"
    },
    {
        "id": "1ns36kf",
        "author": "No-Independent2522",
        "title": "Once in a blue moon is fine but we are getting humiliated by Atletico and Barca oftenly now. The weeked just got worse 😪",
        "content": "",
        "upvotes": 1056,
        "comments": 48,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/pznhsnjz7rrf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ns36kf/once_in_a_blue_moon_is_fine_but_we_are_getting/"
    },
    {
        "id": "1nsos2a",
        "author": "Naive_Lingonberry_20",
        "title": "Is it time to admit that this is how its gonna be for a while?",
        "content": "I had a feeling when Kroos left that things wouldn’t be the same for a while, and I hate to admit it, but it seems to be true.\n\nWe’ve always had great players BUT we had leaders, in attack, in midfield, and in defense. Right now, there’s a lot of talent in the squad, but I don’t see anyone truly leading. It feels like eleven great players who don’t really know how to work together or who to look to in tough moments.\n\nMaybe with time they’ll grow into those roles, but for the next couple of years, I don’t see us winning anything major or competing with Europe’s best. The sooner we accept that and manage our expectations, the easier it’ll be for us as fans :)",
        "upvotes": 29,
        "comments": 46,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nsos2a/is_it_time_to_admit_that_this_is_how_its_gonna_be/"
    },
    {
        "id": "1nsn21z",
        "author": "More-Judgment-9253",
        "title": "The mentality of the players is probably going to be harder to fix than anything else",
        "content": "I genuinely can't remember the last time this team actually fought for a win like their lives depended on it. Look at how bad atleti wanted to beat us, and yet our players looked like they couldn't care less if we got hit 10-0. Observe how barca's mentality changed and how easy it is for them to make comebacks from being 2 or 3 goals down, we used to be like that as well but now it's not looking so good. I hope alonso could fix it because getting hammered 5-2 wouldn't be as bad if the players actually looked like they cared about anything",
        "upvotes": 33,
        "comments": 11,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nsn21z/the_mentality_of_the_players_is_probably_going_to/"
    },
    {
        "id": "1nrzsof",
        "author": "Finn_Madridista",
        "title": "We have failed the first litmus test (OC)",
        "content": "",
        "upvotes": 1232,
        "comments": 259,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ifid4xvpjqrf1.jpeg?auto=webp&amp;s=edee5a7f00bf109411c7a6564e39a3d1c06c09a8"
        },
        "permalink": "/r/realmadrid/comments/1nrzsof/we_have_failed_the_first_litmus_test_oc/"
    }
]