[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mb0szl",
        "author": "wayowayooo",
        "title": "Cruise director in Amy Bradley documentary receiving tons of backlash",
        "content": "Looks like Kirk Detweiler is getting tons backlash for his comments in the Amy Bradley is Missing documentary. He’s completely deleted his social media. I was surprised to see he didn’t express more empathy and remorse for how the situation has unfolded - so I think the criticism is deserved. What do you think?",
        "upvotes": 162,
        "comments": 67,
        "media": null,
        "permalink": "/r/netflix/comments/1mb0szl/cruise_director_in_amy_bradley_documentary/"
    },
    {
        "id": "1majx8l",
        "author": "K1mbacat",
        "title": "Netflix cancelling shows after one season is making me want to cancel my subscription",
        "content": "Is anyone else frustrated about this? I’ll watch a new show (released within the past few months), finish the season and get invested, only to find out they’ve cancelled it a month later. I’ve found articles saying it’s due to “low viewership”, but they didn’t even recommend the shows to me, no advertising, etc, and then cancel it shortly after, before most people have even heard of the series. I’m starting to consider cancelling my subscription because of this.",
        "upvotes": 539,
        "comments": 139,
        "media": null,
        "permalink": "/r/netflix/comments/1majx8l/netflix_cancelling_shows_after_one_season_is/"
    },
    {
        "id": "1mb3ksh",
        "author": "gena5445",
        "title": "Untamed",
        "content": "I felt this show was decent but one thing that really annoyed me was the trope of ‘character being saved at the last second’. This show did this literally 3 times! One character was being choked to death.. at the last second, he/she is saved. Another was trapped in a cave in the middle of nowhere. As water is pouring in,he/ she is saved. The last one, when a character was shot and the shooter was doing yet another annoying trope ( talking too much, it’s time for you to die etc), the good guy/girl was miraculously saved…By ANOTHER trope … you hear the gun shot…the victim looks pained. And wait what? The killer is shot instead!! And the ‘friend’ just happened to show up at ‘just the right time’ and in ‘just the right place’ so they can shoot the shooter! 🤦‍♀️🤦‍♀️\n\nOn another note~ Eric Bana is 🔥",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mb3ksh/untamed/"
    },
    {
        "id": "1mal9qz",
        "author": "Spirited-Region-2611",
        "title": "Did anyone else think Trainwreck: Astroworld, took forever to get to the point?",
        "content": "I found myself zoning out because, I’m aware it was telling a lot of peoples stories, but the documentary just wasn’t as captivating as the other ones. ",
        "upvotes": 48,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1mal9qz/did_anyone_else_think_trainwreck_astroworld_took/"
    },
    {
        "id": "1maqaq9",
        "author": "Electronic_Driver_78",
        "title": "Sandman Season 2: A Story Without Evil, Yet Full of Consequence",
        "content": "Just finished the last season of The Sandman, and something struck me that I can't stop thinking about: there’s no clear villain. Actually, there’s no real villain at all.\n\nSure, we have Lord Azazel arguably the closest candidate. But can you really call a demon a \"villain\" when evil is literally his nature? He’s doing what demons do. There's no moral twist, no manipulation, just raw, elemental ambition. Even Lucifer, who I fully expected to be the looming big bad this season, didn’t take that role. And honestly, I was a little disappointed she didn’t even show up at Morpheus’ funeral. I kept waiting for her to appear, one last move, one final word but no. Her absence almost said more than her presence could have.\n\nThe beauty of this season, I think, is how conflict arises from duty, grief, pride, and change rather than a singular evil force. Morpheus isn't fighting villains; he's navigating consequences. Everyone's following their nature, their role in the grand cosmic dance, even when it clashes with others. And that makes it all feel more... mythic? More tragic? Definitely more human.\n\nCurious if anyone else felt the same. Did you miss having a \"main antagonist\"? Or did the lack of one make the story hit harder?\n",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1maqaq9/sandman_season_2_a_story_without_evil_yet_full_of/"
    },
    {
        "id": "1mb40cx",
        "author": "canned_peaches99",
        "title": "Netflix is making me be a new member when I’m using the account within the household.",
        "content": "I moved out of my parent’s house about 4 years ago and since then Netflix changed its rules about being in the same household so I eventually got booted off on my laptop and phone. I recently moved back to my parents and now when I try to log into the Netflix account on those devices it tells me I need to be on a extra member account. They pay for premium. I just want to know if this is a glitch or if I actually have to do that. My parents are older and sometimes it’s hard to do the whole “sending verification code thing” 😭. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mb40cx/netflix_is_making_me_be_a_new_member_when_im/"
    },
    {
        "id": "1ma3fls",
        "author": "StreetFriendship1200",
        "title": "Binge-worthy limited series?",
        "content": "It’s Saturday afternoon. Hubby and I were planning to host some friends for cocktails and a lovely dinner, but they just called to cancel the last minute because they are sick and don’t wanna make us ill. So we have the night to ourselves, for date night. And some amazing cocktails, appetizers and a grilled porkchop dinner ahead of us. Don’t feel like inviting anyone else, so I’m currently searching for a good Netflix movie or limited series to watch tonight. Something good, like a thriller or action pack. Any suggestions welcome! I’m running out of patience scrolling aimlessly on damn Netflix and reading reviews 🙄",
        "upvotes": 224,
        "comments": 400,
        "media": null,
        "permalink": "/r/netflix/comments/1ma3fls/bingeworthy_limited_series/"
    },
    {
        "id": "1may80m",
        "author": "Fast_Bee_9759",
        "title": "Adolescence accents",
        "content": "Can anyone from the uk comment on the accents ? It seems that Eddie, Manda and Jamie have northern (i think) accents but their daughter,Lisa, does not. I know that northern accent can sometimes simboloze lower class/upper class but wanted to ask ?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1may80m/adolescence_accents/"
    },
    {
        "id": "1ma7qv2",
        "author": "kathyknitsalot",
        "title": "Untamed",
        "content": "Just finished watching this and I feel like something was off. I usually like Eric Bana and Sam Neill, and the story was interesting but I don’t know if it was the writing or acting.  It was hard to get into the characters.  Any of them. Anyone else have an opinion? ",
        "upvotes": 104,
        "comments": 139,
        "media": null,
        "permalink": "/r/netflix/comments/1ma7qv2/untamed/"
    },
    {
        "id": "1marwjt",
        "author": "luckygirl3434",
        "title": "Hunting Wives - Evan Jonigkeit makes my skin crawl",
        "content": "I’m only on Episode 3 and im really digging the show so far.\n\nBut every time Evan Jonigkeit is on screen, my skin just crawls. I thought he was Jason Hurst from Drop Dead Diva aged badly at first - then I realized he is a different person.\n\n",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1marwjt/hunting_wives_evan_jonigkeit_makes_my_skin_crawl/"
    },
    {
        "id": "1mb2hnp",
        "author": "Princess_Butterscoth",
        "title": "Building the Band; Kudos to the judges for ruling based on the purpose of the show",
        "content": "Just finished Building the Band and overall enjoyed the show and found the ending to be very satisfying. After the first few episodes my tops were 1)SZN4, 2) Soulidified, 3)3Quency and Sweet Seduction could have fought for 3 if not for Allison’s attitude cause they all really could sing. Overall I appreciated the judges eliminating bands based on chemistry and their overall blending. By the last episode though I loved the powerhouse voices of SZN4, I definitely believed they could have been more dynamic. I wanted to see a little 1,2 step. 3Quency brought we their voices, entertainment, and chemistry. They deserved the win.  \n\nIn comparison I think about Season 2 of Rhythm and Flow. Watching that felt so frustrating in comparisons. It felt like quite a few mediocre acts moved along too far in the competition. Why was the ultimate winner given kudos for getting the basics of his craft right while his opponent was giving A+ performances from day 1. The premise of the show was to find the best rapper, not go on potential. It felt like the judges were focused on their own preferences rather than what the premise of the show was based on. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mb2hnp/building_the_band_kudos_to_the_judges_for_ruling/"
    },
    {
        "id": "1mavdh6",
        "author": "infantile-eloquence",
        "title": "Subtitles changed format",
        "content": "Anyone found that the subtitles now move across the screen next to the person speaking instead of being central to the screen like always and everywhere else?\n\nIt's really distracting - currently watching the US office on UK Netflix if it matters.\n\n",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mavdh6/subtitles_changed_format/"
    },
    {
        "id": "1mb0jq1",
        "author": "Amazing_Package_5672",
        "title": "Can’t log into my added household account???",
        "content": "Family member just added me to their household on their netflix account. I got the invitation, accepted it, and created my new account. I went to log into it on my TV and it said my email didn’t exist in their system??? I got the confirmation email after I created my account so I’m confused what happened. I logged out on my computer to see if I could only have it on 1 device but now I can’t log back in at all. \nHas this happened to anyone else??? Is there some sort of waiting period or trick I need to do?? heeeellllpppp",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mb0jq1/cant_log_into_my_added_household_account/"
    },
    {
        "id": "1mb08ti",
        "author": "Meinov",
        "title": "Squid Game kinda lost its original theme in season 2 and season 3.",
        "content": "**A bit of context first:** I was one of those people who watched *Squid Game* as soon as it dropped back in October 2021. I was genuinely thrilled that the show was getting the attention it deserved, and I was really hyped for the upcoming seasons.\n\nThat said, I have to admit—I’m disappointed with how *Season 2* and *Season 3* turned out. Don’t get me wrong, I’m not saying they’re outright bad, but they lost the original theme and depth that made *Season 1* so impactful. The first season was a sharp commentary on Korean society, particularly capitalism. It portrayed a world where the lives of the poor were reduced to entertainment for the ultra-rich—a brutal but honest reflection of societal inequality.\n\nIf Netflix plans to create a U.S. spinoff—or one based in any other country—I hope they do more than just swap Korean actors for American ones. They need to research and present social commentary that fits that country’s context. Otherwise, it’ll just feel hollow.\n\n*Season 1* worked because it explored the darker side of capitalism and the widening gap between rich and poor. Even the twist with Player 001 being the mastermind added a layer of complexity that elevated the story. *Season 2* tried to pivot toward themes like democracy and how easily the masses can be manipulated when money is involved, which had potential, but the execution fell flat. By *Season 3*, the games didn’t feel as engaging, and the characters were far less memorable. It felt like people were dying left and right without much emotional weight.\n\nEven the subplot involving the soldier with PTSD, which initially added a sense of mystery, ended up being disappointing—especially when it turned out he was lying the whole time. The police officer, who had so much intrigue in the first season, felt completely useless across the next two. And Gi-hun’s death, all for the sake of the baby—only for him to never meet his daughter—felt like a bitter conclusion that didn’t land emotionally.\n\nNow there’s talk of a *Squid Game USA* and even a whole cinematic universe. Honestly, I think that’s a bad idea, especially considering how the quality dipped in *Season 2* and *3*. I don’t want this to turn into a franchise where the core idea becomes nothing more than “rich people watch poor people suffer,” stripped of any real message or nuance.\n\nI can talk about this more",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mb08ti/squid_game_kinda_lost_its_original_theme_in/"
    },
    {
        "id": "1mahwxl",
        "author": "Old_Customer_1894",
        "title": "Was it worth it, In-ho?",
        "content": "",
        "upvotes": 11,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/j4luf9fowdff1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1mahwxl/was_it_worth_it_inho/"
    },
    {
        "id": "1mb1nc5",
        "author": "sunshinepharaoh",
        "title": "strange visual error, how to fix?",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/pnf5rcdxaiff1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1mb1nc5/strange_visual_error_how_to_fix/"
    },
    {
        "id": "1mb141z",
        "author": "millielouie2025",
        "title": "TV's with built-in Netflix using old UI?",
        "content": "I did some traveling this weekend and I stayed at two different hotels; and both hotel rooms had Samsung TVs with I guess the Netflix built in and both of them had the old UI when I signed in. I even signed in and out a couple times to see if it would change and it did not. And I was too busy and apparently dumb to look at the TV model or serial number. \n\nMy question is, does anyone own any TVs with built-in Netflix that is still using the old user interface or any type of dongle or the like that has it? If so, please tell me so I can go purchase. Thank you. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mb141z/tvs_with_builtin_netflix_using_old_ui/"
    },
    {
        "id": "1mamroj",
        "author": "Additional_Key_8044",
        "title": "Mandala Murders Review: BALONEY!",
        "content": "",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mamroj/mandala_murders_review_baloney/"
    },
    {
        "id": "1mamjk5",
        "author": "Additional_Key_8044",
        "title": "Sarzameen Review: New Age Shakti",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mamjk5/sarzameen_review_new_age_shakti/"
    },
    {
        "id": "1mautri",
        "author": "Promisito",
        "title": "Best movies and series only available in the states",
        "content": "Yo, I need recommendations for movies or series only available on Netflix in the states. Genre: Sci-fi, Fantasy, action, Thriller and Superpowers. \n\nThink series like Arcane, The Boys (I know it's amazon), Umbrella Academy, One piece or Rookie ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mautri/best_movies_and_series_only_available_in_the/"
    },
    {
        "id": "1malfak",
        "author": "andropogon09",
        "title": "Does Hightown deserve a 4th season?",
        "content": "Hightown is another one of those shows (like Loudermilk or Resident Alien) first discovered by viewers when it appeared on Netflix. Should Netflix create a 4th season, or do you think most of the major issues were resolved in the series finale?",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1malfak/does_hightown_deserve_a_4th_season/"
    },
    {
        "id": "1mb22r5",
        "author": "Immediate_Zombie_682",
        "title": "Anyone know what show this is?",
        "content": "I saw a post on Instagram with a clip from a show and I can’t remember the name. It was a woman in a grocery store dressed like the 1950s maybe, and she overheard two women in the next aisle discussing that her husband was having an affair. She knocked over a tower of soup cans she was hiding behind. Anyone know what show this is, and is it worth watching? ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1mb22r5/anyone_know_what_show_this_is/"
    },
    {
        "id": "1mai1ir",
        "author": "atheniah",
        "title": "\"Not part of household\" but I'm the account owner",
        "content": "Wondering if anyone knows how I can fix this issue. Twice now Netflix has given me the \"your device is not part of the household\" thing, but I am the account holder. Its my account, with my email and login, which I am paying for. \n\nI've tried to figure out how to update the household so that it recognises me but I don't have a TV, only a laptop, and it says you don't have to do it for a laptop and there doesn't seem to be a way to do it. \n\nDoes anyone know a way to stop it doing this? If it happens again I'm probably just going to cancel my Netflix. ",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mai1ir/not_part_of_household_but_im_the_account_owner/"
    },
    {
        "id": "1majr6q",
        "author": "judoxing",
        "title": "Adolescents: red-pill culture and postmodernism",
        "content": "A key part of the series is Jamie’s stubborn pleas of innocence despite his murder of Katie being clearly captured on camera. \n\nHe’s so adamant that most people spend much of the series assuming there must be more to the murder than just Jamie doing it (there isn’t, as is clear is episode 1).\n\nA take I haven’t seen anywhere else is that Jamie’s pleas of innocence are another impact of his online incel/red pill exposure: fundamental to redpill, alt-right culture is a type of postmodernism. All mainstream narratives are false, institutions can’t be trusted and aim only to mislead and control the public, presumably a shadowy global organisation controls everything. This is epistemological framework is central to Andrew Tate’s shtick and all reactionary public intellectuals (like Bret and Eric Weinstein) who repeatedly refer to “they”.\n\nJamie is brain deep into this stuff and subsequently is effectively delusional when he comes crashing into reality after committing murder. When he’s saying he didn’t kill Katie, it’s not so much that he’s lying as that he genuinely doesn’t understand the typical concept of truth in which he’s being judged upon.\n\nThis theme is spelt out more clearly in the final episode when the youth who sells Eddie the paint confides that he’s a part of an online community who believes Jamie to have been framed by some conspiracy of “them” - he says something like “they didn’t even make the stab wound anatomically correct”\n\nThe final brilliance of the show is it manages to elicit this type of conspiratorial attitude from some section of the audience who feel it remains open by the end whether Jamie was the killer.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1majr6q/adolescents_redpill_culture_and_postmodernism/"
    },
    {
        "id": "1maumk7",
        "author": "percyhamagniv",
        "title": "netflix household as a college student",
        "content": "so, im a college student. my dorm has a tv on it with the netflix app, and my house has netflix too. now, we are 5 people in the family, so we took the family plan, of course. my dorm and college are really not that far from my house, so i come back home once a week, for a few days. until now everything worked ok but today netflix showed me for the first time the \"your tv isnt part of the netflix household for this account\" message. now, considering the situation, is there a way to use the account in the dorm as well? i really dont want to have to pay for another account if my father already pays for a family one.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1maumk7/netflix_household_as_a_college_student/"
    },
    {
        "id": "1mb1iic",
        "author": "iamANGRY_",
        "title": "Re: Amy Bradley Case - utilising Chat GPT to match the images - what do y'all think?",
        "content": "I used chat GPT 4.o to try and enhance the photos, and after that, I asked chat GPT if they looked the same to which it stated \"So yep, with the enhancements: **I’d lean toward yes, they could be the same person**, just at different points in life or very different looks.\" \n\nI will post this up on here - let me know what y'all think, and if you disagree, please let me know so respectfully. \n\nhttps://preview.redd.it/s4ox8qte9iff1.png?width=2070&amp;format=png&amp;auto=webp&amp;s=852db718fffbdb35297f639394190449bca0ff83\n\nhttps://preview.redd.it/f679mu2g9iff1.png?width=1926&amp;format=png&amp;auto=webp&amp;s=9fa706d81825a2a593d99eeb2eb5583dd6ce7c5c\n\nhttps://preview.redd.it/m3e652ki9iff1.png?width=2124&amp;format=png&amp;auto=webp&amp;s=4356148417e9917be404f1d309e8e0855b98fbb2\n\nhttps://preview.redd.it/8rl9vtgk9iff1.png?width=2092&amp;format=png&amp;auto=webp&amp;s=df737902ac5fb51dc6073d26b9ee5fa1db6978b6\n\n",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mb1iic/re_amy_bradley_case_utilising_chat_gpt_to_match/"
    },
    {
        "id": "1manori",
        "author": "fabdab501",
        "title": "Low quality on Netflix when using a playback speed extension",
        "content": "For some reason I get low quality on Netflix when using a playback speed extension. The extension is called \"Global Speed\". Anyone know a fix to the problem?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1manori/low_quality_on_netflix_when_using_a_playback/"
    },
    {
        "id": "1ma9zsb",
        "author": "Lilcommy",
        "title": "The new UI on the PS app is trash.",
        "content": "I personally fine this new UI completely trash. I can't find anything to watch. And I just log off and go to something else. Its cluttered and the auto playing of trailers is just a pain that takes up way to much of the screen. I don't understand always changing UIs that arnt broken or unusable. ",
        "upvotes": 10,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1ma9zsb/the_new_ui_on_the_ps_app_is_trash/"
    },
    {
        "id": "1mayvkx",
        "author": "UpperStudio6165",
        "title": "Kpop Demon Hunters could’ve been better",
        "content": "I usually don’t put my two cents out here on the internet but I really wanted to have a discussion about this.\nPersonally, I watched this movie a month after it was released. I had a good time, really enjoyed the animation and the songs like everybody else.\nBut the plot felt off to me. And after a few days of letting that marinate, I understand why I’m so frustrated with it.\n\n(This is a long rant so bare with me! No tldr because I’m shit at recapping things)\n\nFirst of all, I get that the run time was short. 1 hours to squeeze everything in, and they still managed to make a compelling and visually stunning movie. Thats very impressive.\n\nBut that doesn’t excuse the execution to me. The lack of time really flattens the message they wanted to achieve with this movie. It had its highs and lows. \nThe high would be Rumi’s crash out infront of her aunt. And also Jinu’s character writing, it was quite consistent imo (but I don’t like him, not as a character, but as a person.) \n\nThe low would be the end. The way both Jinu and Rumi’s big climax/resolution moment doesn’t have much substance to it. Jinu chosing to sacrifice himself while on the surface is like him chosing to no longer live selfishly, it is imo, the easy way out. I get that at that time there wasn’t anything else he could do to help out though. But if he had to go through the slow process of actually working through the guilt and shame, that would’ve felt more satisfying. I guess that’s the tragic part of Jinu’s story.\n\nNow Rumi’s whole turnaround arc feels very disjointed to me personally. Especially from the point where she went “if this is how the Honmoon is, I want it destroyed” then suddenly she’s at the stadium singing her fight song, rebuilding the Honmoon again. I get that she wants the foundation of perfectionism the Honmoon is built on destroyed, not the Honmon itself. But we never get to see her actually have a cathartic breaking moment. The actual ugly but necessary part of healing where you go scorch earth on the thing hurting you before actually replanting the seeds.\n\nShe sings perfectly, her friends join her, and they get their power ups (very predictably). What really gets on my nerve is that we don’t see the difficult conversation afterwards. The girls literally turned on Rumi, and they themselves felt betrayed too. That should’ve been explored more. Atleast just through a quick montage at the end showing all three of them slowly working through it, talking through it, being honest with each other about their feelings.\nBut no it again, hard cuts to them hanging out like nothings happened. Its like this movie gives us all the positive side of healing but never show the ugly and hard side of it. Healing takes time, that kind of bone deep shame and guilt from childhood takes so much time to heal.\n\nI wouldn’t have a problem with it if this didn’t cause problems but imo it is harmful. Even if unintentionally, the message you get out of that ending is that healing happens in one glorious moment. While in reality, it doesn’t. And this disparity causes people to feel ashamed for not fixing their problem as quickly as the character they see on screen. \nAnd when I say people I mean kids too, I’ve seen people say that this is a kids movie so it doesn’t have to be that deep but I think thats just so stupid. \nWe’ve seen so many movies with that same kind of surface level fight song endings that left you feeling good in the moment but ultimately didn’t teach you much. \n\nAnd the fact that this movie came out in 2025, after the media has been saturated with that kind of cheese, is unacceptable. Kids deserve better, hell, everyone deserves better. Why are we still calling this deep when its barely taking any steps forward? \n\n\nSorry for the rant, I know I’m a month late to the party but I really want to know what others think of this movie and the message behind it. \nThings can be fun for funs sake but I personally think we should hold fun things to higher standards if they’re trying to deliver a message about something as real as the struggle of living with guilt and shame. \n\n\nAlso feel free to argue with me, thats the point of this post lol. Come at me with your opinions, I’d love to hear them. \n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mayvkx/kpop_demon_hunters_couldve_been_better/"
    },
    {
        "id": "1majjlh",
        "author": "Ok-Echidna9086",
        "title": "Netflix bugging my monitors only when I’m playing a game",
        "content": "Been playing like this for months and I didn’t update anything or change any cables but this started happening right when I have a game open and Netflix at the same time. Does anyone have a fix for this?",
        "upvotes": 0,
        "comments": 3,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zcmk8ekxeeff1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1majjlh/netflix_bugging_my_monitors_only_when_im_playing/"
    }
]