[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 10,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 41,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1kvqy5w",
        "author": "Busy_bee7",
        "title": "Secrets that we keep!",
        "content": "This show is a must watch! Definitely screamed “the perfect couple” vibes of a rich family on Netflix . Where are they from? Missed that. Anyway this show was hard to watch but also weirdly realistic in a very weird way. Like what in the world would so many of us do in this situation?? It’s that insane. If we found out our nanny was dealing with our child in this fashion. I don’t have words.\n\nIn addition there is so much going on. So many different dynamic characters and the scenery. Loved Cecille. You can tell she’s independent of her husband (her office is literally on the water or wherever she works) and i just had the vibes of how he never talks back to her (I know men who think their better then their wives). Aka that beautiful house is 100% half hers and well earned. I’m convinced she makes more than the lawyer husband. Again, she didn’t say it outright but she mentioned the neighbor is his biggest client and looked completely un phased like the true queen she is. Every woman that makes their own money (usually more) knows this discussion well with their man. And it shows. \n\nHave yall watched this on Netflix? Thoughts?",
        "upvotes": 31,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1kvqy5w/secrets_that_we_keep/"
    },
    {
        "id": "1kw15hs",
        "author": "S4v1r1enCh0r4k",
        "title": "‘Mercy for None’ Trailer Has been released, K-Drama will premiere on June 6.",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kw15hs/mercy_for_none_trailer_has_been_released_kdrama/"
    },
    {
        "id": "1kwb7gs",
        "author": "Jason13v2",
        "title": "How does Netflix’s buffer work nowadays?",
        "content": "I’ve noticed something curious with Netflix lately: sometimes, when my internet isn’t performing very well, the quality of what I’m watching drops—sure. What’s curious is that the quality drops by shot. For example, in a scene with two people talking, where each person has their own camera shot, the quality only drops in one of the shots (one person), while the other remains in HD. Even when the shots alternate several times, the person shown in HD stays in HD, and the person shown in lower quality stays in lower quality. It’s quite strange, and I’d like to know why that happens—I had never seen Netflix do that until this year.\n\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kwb7gs/how_does_netflixs_buffer_work_nowadays/"
    },
    {
        "id": "1kwalvz",
        "author": "hi_im_stupid_help",
        "title": "Dexter",
        "content": "Dexter was adopted by Harry, his Mother died when he was 3. Why Didn’t Joe Driscoll, Dexter’s Bio dad take him ? Did his mother and Joe divorce ? If this question contains spoilers, please tell me if it does because I’m only on S1 EP12",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kwalvz/dexter/"
    },
    {
        "id": "1kwakb3",
        "author": "ladeepurple",
        "title": "The Four Seasons (finally came around to watching it)",
        "content": "I watched the series a few weeks ago and just finished the film. Overall, it stayed pretty true to the original, with most changes feeling purposeful — except for &gt;!Nick’s death.!&lt;\n\nWhat bothered me in both versions was Ginny’s lack of self-awareness — and how no one really calls her out on it. In the series, Anne makes it clear how out of place it would’ve been for Ginny to speak at &gt;!Nick’s memorial,!&lt; especially in front of friends and family who’ve known him for decades, primarily as Anne’s husband. Outside of that, no one makes a peep. \n\nI hate when characters are expected to take the high road just to accommodate a specific circumstance or someone else’s mess and that's *exactly* what happens.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kwakb3/the_four_seasons_finally_came_around_to_watching/"
    },
    {
        "id": "1kw9a10",
        "author": "backinblack1313",
        "title": "How many times can I use the travel code?",
        "content": "I am a grad student in a different state than my parents so I cannot connect to the home WiFi. It didn’t let me watch Netflix, unless I said I was traveling. Then they sent a code to the account holder email and I was able to watch. It says it lasts for 14 days. I’m wondering if I can say I’m traveling again and get another code when this one expires, or if it’s a one time thing.\n\nIf any one has an answer please let me know!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kw9a10/how_many_times_can_i_use_the_travel_code/"
    },
    {
        "id": "1kvp1e4",
        "author": "Informal_Extent5834",
        "title": "Sirens",
        "content": "!!!Spoilers for Sirens!!!\n\nOkay I just finished Sirens and I need to rant (I apologize this is long)\n\nI hate Devon. Like with a burning passion.\n\nShe called her sister a wh\\*re for sending fruit then sucks a guy off because she can't smoke??? And then licks the guy who drives her to a hotel???? Goes to a bar want just wanting to f\\*ck?? Then f\\*cks a gardner. And not to mention she's been sleeping with a married man. Pot is calling the kettle black here.\n\nShows up to her sister's work and threatens to basically cause trouble for her instead of just waiting later to talk like her sister asked.\n\nIs rude to her sister's boss before even really knowing her and then says that she should have been told her sister got a nose job as if Simone isn't an adult and can make her own choices.\n\nDemands her sister move back and help with their father. I get siblings should but she offered to help with money which would be good cause it sounds like he needs a home nurse or go to a place where they can take care of him full time or someone who can take care of him full time. Either sibling spending all their time taking care of a parent is not it. And let's not forget the dad neglected and abused Simone, so why would she want to help in the first place.\n\nSays personal stuff about their life to random people SHE DOESN'T EVEN KNOW!!!!\n\nGoes to the party after Simone told her to stay in the house until she was done with work and she shows up causing problems. No respect for Simone at all.\n\nThey give her money to take care of her dad because Simone doesn't want her there and demands her sister come home???? Like what. She clearly doesn't want to go. A sibling showing up to their siblings work and demanding their grown adult sibling to go home with them when it's clear the sibling doesn't want to is beyond wild.\n\nTalks about how her boss is controlling AS IF DEVON ISN'T. Girl is trying to force her sister home to take care of their dad because she doesn't want to do it alone and thinks Simone's owes her and wants her on meds. Says \"You're going to buffalo with me\" like huh?!?! How is that not controlling?\n\nBelieved strangers about gossip and ran with it. Gossip she heard in jail by a drunk lady who couldn't even remember Devon's name.\n\nSimone doesn't owe her anything. Simone was in an abusive environment before Devon come back and when her sister was somewhere else she shows up demanding she return home to help take care of their dad. And tries to guilt her into coming back when she refuses multiple times. What person wants to help someone who neglected and abused them and furthered their trauma?? And even says \"You don't feel any responsibility for him?\" um no. Since when are children supposed to be indebted to their abusers. And then she tries to tell her \"You sound like a b\\*tch off your meds\". You mean her anxiety meds? The ones her doctor told her she doesn't need to take because you can heal from it. Then says \"you are only alive because of me\", and that means she owes you? She then left her to be abused/neglected and are actively trying to manipulate her, she owes her nothing. And then storms away saying \"You don't need me anymore well good f\\*cken luck\" as if Simone hasn't been doing things on her own for 10 years!!!! Like dear lord.\n\nLater kinda blames her drinking and DUI on someone else as if they forced her to. Like you chose to drink he just drank with you. And got mad when he offered her a drink, which is what she normally does and she yells at him. He didn't even know she was sober when she yelled at him!! Like girl you are the problem.\n\nSimone isn't a saint at all but dear god why is Devon so insufferable. The ultimate victim mentality. I get she's mad and has trauma but dear lord above.\n\nAnd honestly I don't see how Peter is a monster either. The ending seems like Devon and Michaela are calling him one. But like what did he do that's monstrous? Sure he lied about going to see his son and grandchild, not exactly a terrible thing and completely understandable. Yes he kissed Simone and it wasn't right but neither pursued it after until Michaela fired her. And Michaela then fires her knowing what the job means to her and lies about it because she wants to get the upper hand on Peter or to keep her marriage that isn't exactly working anyway cause neither are very happy (wasn't very clear to me). Like no one in this situation is really a monster or all that terrible. Honestly the worst people to me are Devon and Ethan. Devon for all the reasons above and Ethan cause man over stepped his bounds  and didn't respect her privacy then acted like a man child and wouldn't take no for an answer at first then was being a jerk.\n\nEnd of rant.",
        "upvotes": 19,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1kvp1e4/sirens/"
    },
    {
        "id": "1kw2ysx",
        "author": "StructureCool8338",
        "title": "Next episode won’t play?",
        "content": "So Everytime I watch “love death and robots”, I stop prematurely cause I get annoyed Everytime an episode ends, it shows me other recommendations rather than just going to the next episode. So I’ll have to go back to the title screen, choose the season I was on, and scroll down to episode. That’s not even accounting for the fact I have to scroll back to the beginning everytime.\n\nIs there a way to fix this?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kw2ysx/next_episode_wont_play/"
    },
    {
        "id": "1kv1862",
        "author": "adobongmelk",
        "title": "what's a movie/series on netflix that you've ignored for a long time but ended up being very good when you watched it?",
        "content": "i've been doomscrolling on netflix all day looking for something good to watch but i just can't seem to like anything. i end up just rewatching my favorite movies lol.",
        "upvotes": 556,
        "comments": 847,
        "media": null,
        "permalink": "/r/netflix/comments/1kv1862/whats_a_movieseries_on_netflix_that_youve_ignored/"
    },
    {
        "id": "1kw7ja7",
        "author": "ZinChao",
        "title": "Recommend me a show based in my interest [Action, Thriller, Comedy]",
        "content": "For more context, my favorite shows that I’ve ever watched are the following: Blacklist, The Office, Dark, Black Mirror, Love Death &amp; Robots, Narcos, Ozark (up until S2), One Body Problem",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1kw7ja7/recommend_me_a_show_based_in_my_interest_action/"
    },
    {
        "id": "1kvua9q",
        "author": "PerfectHippo3700",
        "title": "Teenage Bounty Hunters",
        "content": "I just stumbled upon teenage bounty hunters since i just want something to watch and it's actually really good! so sad that it will not have a season 2 😭😭😭😭 even tho it actually concluded well but still it will be so good to have another season to have some closures or anything ☹️",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kvua9q/teenage_bounty_hunters/"
    },
    {
        "id": "1kvl0ry",
        "author": "toadetteinatree",
        "title": "The new Fear Street",
        "content": "I adored the trilogy, it’s become one of my favorite horror movie franchises. I saw that a new one came out but that everyone hated it. Is it bad? What does everyone think?",
        "upvotes": 13,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1kvl0ry/the_new_fear_street/"
    },
    {
        "id": "1kvznsk",
        "author": "ChampionshipMain7912",
        "title": "Connection issues",
        "content": "Hi, everyone has like me some issue in the connection (very slow buffering and totally no hd)?\n\nIt happens only when I’m in Wi-Fi, with the hotspot seems fine.\n\nIt never did like this (it starts yesterday), and it’s only doing with Netflix.\n\nPs: I have a very good internet connection, like 1.2 gbps\n\nCan someone help me?\n\nThanks",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kvznsk/connection_issues/"
    },
    {
        "id": "1kvyuwk",
        "author": "eecmidford",
        "title": "Error code d7307-1105",
        "content": "I've been having this issue for the past 3 or so months. When it happens it makes shows borderline unwatchable because every 5ish minutes it will buffer for a long time and then this error code will pop up. I googled it but can't find any answers; it looks like Netflix is still investigating it? But I was hoping someone else was having the same problem and had maybe figured out the cause or a solution. Thanks!\n\n(What I've tried so far: Restarting computer, clearing cache, using a different browser. Tried all multiple times and none have helped. My internet is stable so I know it isn't that.)",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kvyuwk/error_code_d73071105/"
    },
    {
        "id": "1kvxs0h",
        "author": "marie_g10",
        "title": "Future \"Fear Street\" Installments???",
        "content": "If Netflix is still planning to make future installments, will they be about the following stories:\n\n* 1904 - Grifter Guts Girls\n* 1922 - Billy Barker Murders\n* 1935 - Humpty-Dumpty Killer\n* 1950 - Milkman Murders\n* 1965 - Ruby Lane Murders",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kvxs0h/future_fear_street_installments/"
    },
    {
        "id": "1kvwfb4",
        "author": "chiefdave74",
        "title": "Foreign subtitles on English text when watching in English",
        "content": "I've got the weirdest problem and an hour on google &amp; reddit hasn't helped. When I'm watching shows in English any text on screen in English, signs, text messages etc, has subtitles in a foreign language. \n\nI don't know why this has started and can't find any way to turn it off. I've checked every device I use Netflix on and they're all set to audio English and subtitles off. \n\nCan't be the only one who has had this, how do I make it stop?\n\nEdit: so if someone speaks a foreign language on screen I get the same thing, the subtitles are in another language when they should be in English. However if I skip back 10 or 20 seconds and the subtitles automatically come on for the time I’ve skipped back they’re all in English ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kvwfb4/foreign_subtitles_on_english_text_when_watching/"
    },
    {
        "id": "1kvno4w",
        "author": "Comprehensive-Way482",
        "title": "“A web of secrets and lies”: Jamie Dornan's Netflix crime drama The Undertow is the ultimate tale of deception",
        "content": "Jamie Dornan plays identical twins in Netflix's \"mind-blowing\" crime drama.\n\n“A web of secrets and lies”: Jamie Dornan's Netflix crime drama The Undertow is the ultimate tale of deception\n\n",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kvno4w/a_web_of_secrets_and_lies_jamie_dornans_netflix/"
    },
    {
        "id": "1kvcffe",
        "author": "Pessimistic_Gemini",
        "title": "It baffles me how Netflix never improves the inaccurate subtitles for a lot of their foreign content at all.",
        "content": "I just saw my mother watching some foreign nonsense called The Sea Beyond earlier today. Not sure what it's all about, didn't really give a dang to find out. All I know about it was that it's another random foreign show Netflix has in its catalog, and it is one with horrid translation issues. And with this one, it's the worst I've ever seen with any of them as the subtitles were on as she watched it and literally NOTHING was matching what the actors, or rathe yet the DUBBED actors, were reciting or saying AT ALL!\n\nThat's been a major issue I've had with Neflix for years now when it comes to how they handle captions and subtitles for foreign shows and here, it's far more worse than any other one I've seen. I don't know why they never fixed that issue, but when it comes to the hard of hearing, it really does them a disservice more when they don't realize what they're reading doesn't match of to what they're watching.\n\nEspecially when they're charging nearly thirty bucks a month for the bloody thing. With all that they could've been able afford to improve their subtitle tech. Use AI on that for improved accuracies or something , if they want. ",
        "upvotes": 15,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1kvcffe/it_baffles_me_how_netflix_never_improves_the/"
    },
    {
        "id": "1kw4vtu",
        "author": "hi_im_stupid_help",
        "title": "Dexter",
        "content": "I can’t comment on r/dexter yet, but I gotta get this out my system. I HATE Cody, that little shit stain with no care for anything related to his own mother Rita. instead he loves his crackhead, wife beater, rapist husband. I Do NOT care if he is 5 years old with no sense of this topic, I just hate his guts. For the record I’m on S1 EP11, and I just hate him. Especially the way he always says “My Dad” when talking about Paul, Looking from the family’s perspective, Dexter is just better than Paul, I was so happy that Dexter dosed him up with heroin to be locked up, but at the same time he should have killed him. And this little shit has the nerve to say that it’s Rita’s fault for Paul being in prison. I just HATE CODY, and I feel disgusted to share the same name with this kid. I do not care if it’s a fictional character, it’s not my fault is a hateable character, BECAUSE HE IS.\t",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kw4vtu/dexter/"
    },
    {
        "id": "1kvqb6d",
        "author": "Leather_Pin555",
        "title": "Crime series with romance between the leads recommendations?",
        "content": "Please suggest good crime drama series on Netflix where the lead characters (investigators for instance) have a tensed relationship that blooms into romance eventually.\n\nAny language is fine, I actually prefer foreign shows.\n\nJust finished Deadwind and looking for something like that.\n\nThx",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kvqb6d/crime_series_with_romance_between_the_leads/"
    },
    {
        "id": "1kvzpkn",
        "author": "NikosSpeedballing",
        "title": "Netflix gift cards",
        "content": "Is there any way I can get cheap gift cards for Netflix  in Europe? Greece\nI found a 50euro gift card on play Asia for 45 but there should be another site to find it Even cheaper\nUnfortunately  paxful doesn't work anymore, i would rather pay 70% of something  in crypto if something  like this is possible ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kvzpkn/netflix_gift_cards/"
    },
    {
        "id": "1kvpoo3",
        "author": "Olijke_Poffer",
        "title": "Dolby surround",
        "content": "Does de standard subscription also support Dolby surround?\nI have a 4K TV and a Dolby Surround set but no Dolby Atmos. 4K is nice but to be honest, I do not see much difference 1080p or 4K on my Sony TV. Perhaps because of the viewing distance. 46 inch on 3mtr. \n\nI now have the premium subscription but I’m in doubt to switch back to standard. \n\nAny info on this. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kvpoo3/dolby_surround/"
    },
    {
        "id": "1kv5jpt",
        "author": "dicedtomatoes55",
        "title": "Director Behind Feel-Good Netflix Hit 'Nonnas' Also Created a Super-Dark Apocalypse Series 20 Years Ago",
        "content": "",
        "upvotes": 23,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1kv5jpt/director_behind_feelgood_netflix_hit_nonnas_also/"
    },
    {
        "id": "1kvcbcx",
        "author": "Scherzi_00",
        "title": "Im searching for a film",
        "content": "Hey guys i am searching for the name of a film that im pretty sure i‘ve watched on netflix. It was like a horror movie that played in a like summer camp with a group of friends i think. I think it played in the 80s-90s. And there was a murderer with all black clothes i think. After and after the murderer gets on of the kids till no one is left over. The acting was like simmiliar to a scary movie film (horror with a little bit of comedy i think) i rember an exact scene where the murderer put a guy with a black leather jacket in an oven.",
        "upvotes": 10,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1kvcbcx/im_searching_for_a_film/"
    },
    {
        "id": "1kv94cl",
        "author": "No-Repair-8176",
        "title": "Changing Netflix Plan",
        "content": "Hey. Does anyone have the 7.99 monthly plan? How frequent are the ads and how good is the picture? I’ve had Netflix since 2016 and I’m thinking of changing the plan. I currently have the 24.99/month subscription. Thanks",
        "upvotes": 9,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1kv94cl/changing_netflix_plan/"
    },
    {
        "id": "1kvn6m5",
        "author": "EmptyPocketsXotics",
        "title": "A Deadly American Marriage",
        "content": "I'm not sure it was ever discussed in the documentary, and I think It's a valid point to the whole of the entire case, but why were Holly Martens parents in the house to begin with? Did they live there? Were the visiting? Did they just happen to be in the house when Jason supposedly \"attacked\" his wife?",
        "upvotes": 0,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1kvn6m5/a_deadly_american_marriage/"
    },
    {
        "id": "1kvwqem",
        "author": "NikonD3X1985",
        "title": "Netflix household workarounds? I have an Nvidia Shield (2017).",
        "content": "My parents and I share a Netflix account in the UK. When I update the household and start watching something, it works fine. But when my parents try to watch, it asks them to update the household too—it's like there's no grace period between switching households anymore. Oddly, Netflix works fine on my phone at home, but my Nvidia Shield won’t play anything. Is there a workaround for the Shield? Would taking it to my parents’ house and watching something for 10 minutes help?\n\nThanks in advance for any help with this 🙏🏻",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kvwqem/netflix_household_workarounds_i_have_an_nvidia/"
    },
    {
        "id": "1kvkvob",
        "author": "Dry_Imagination_9474",
        "title": "I am on the same Wi-Fi as my Netflix household, yet it says that I am not part of the household.",
        "content": "The post is self-explanatory. I am connected to the same wifi and have tried on different browsers, and I've tried disconnecting and reconnecting to wifi.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kvkvob/i_am_on_the_same_wifi_as_my_netflix_household_yet/"
    },
    {
        "id": "1kvq9ez",
        "author": "S4v1r1enCh0r4k",
        "title": "‘Squid Game’ Creator &amp; Stars Say Some Season 3 Fan Theories Are Actually Right",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kvq9ez/squid_game_creator_stars_say_some_season_3_fan/"
    },
    {
        "id": "1kvibfh",
        "author": "9kLevix",
        "title": "Total amount of seasons of Total Drama? (CANADA)",
        "content": "Remembered about a few months ago I saw that total drama had all of the seasons available on Netflix, I recently checked and saw that it only has season 1. In short, how many seasons of total drama are available of Netflix for Canadian users, I’ve seen people say Canada should have all of the seasons and perhaps there could be a glitch with mine.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kvibfh/total_amount_of_seasons_of_total_drama_canada/"
    }
]