[
    {
        "id": "1n1jiha",
        "author": "DoNotOpenAMA",
        "title": "Hey r/movies, I’m Brian, filmmaker of Do Not Open, with Noëlle in her 1st role. We made a self-financed tech psychological-thriller in Sweden during the pandemic. Not horror, a psychological trap where technology pulls the strings. Mixed reactions, big conversations. We stand by it, ask us anything!",
        "content": "Hey r/movies, I’m Brian, filmmaker of Do Not Open, with Noëlle in her 1st role. We made a self-financed tech psychological-thriller in Sweden during the pandemic. Not horror, a psychological trap where technology pulls the strings. Mixed reactions, big conversations. We stand by it, ask us anything!\n\n**Here's our trailer:**\n\n[https://www.youtube.com/watch?v=947I6zKNVfI](https://www.youtube.com/watch?v=947I6zKNVfI)\n\n**Synopsis:**\n\nAfter arguing with her parents a distraught teen opens an email promising acceptance, but what the message delivers infects the whole family.\n\nAsk us anything! We'll be back tomorrow Thursday 8/28 at 5 PM ET to answer any questions.\n\n",
        "upvotes": 43,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/szcyjxphnklf1.png?auto=webp&amp;s=0d615076e913443dc6aa32c27b191d3db983c20f"
        },
        "permalink": "/r/movies/comments/1n1jiha/hey_rmovies_im_brian_filmmaker_of_do_not_open/"
    },
    {
        "id": "1n1hwf8",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Elijah Wood - Thursday 8/28 at 3:00 PM ET - Actor in 'Lord of the Rings', 'The Toxic Avenger', 'Wilfred', 'Eternal Sunshine of the Spotless Mind', 'Dirk Gently's Holistic Detective Agency', and lots more.",
        "content": "",
        "upvotes": 235,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ac69k57whklf1.png?auto=webp&amp;s=d4fca40b7efd3574a23fa1a2745c25f118a1ab1c"
        },
        "permalink": "/r/movies/comments/1n1hwf8/amaqa_announcement_elijah_wood_thursday_828_at/"
    },
    {
        "id": "1n1pxtz",
        "author": "MarvelsGrantMan136",
        "title": "'Elden Ring' Superfan Alex Garland Put Together a 160-Page Draft Script – With 40 Extra Pages of Images – to Convince FromSoftware President Hidetaka Miyazaki to Let Him Direct the Movie",
        "content": "",
        "upvotes": 4515,
        "comments": 368,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/F4G4g3UA20lQi07eIHgFlbPiszxyGR-er6CChm1wJYk.jpeg?auto=webp&amp;s=3e62b4ab4be2681eb6c05530f2e5a92a4b3e3dfa"
        },
        "permalink": "/r/movies/comments/1n1pxtz/elden_ring_superfan_alex_garland_put_together_a/"
    },
    {
        "id": "1n1gsac",
        "author": "BunyipPouch",
        "title": "Brad Pitt, Joaquin Phoenix, Jonathan Glazer Join Gaza Drama ‘The Voice of Hind Rajab’ as Executive Producers - It follows the killing of Hind Rajab, a five-year-old Palestinian girl who lived in the Gaza Strip and was killed by Israeli forces during the ongoing Israeli invasion of Gaza.",
        "content": "",
        "upvotes": 16112,
        "comments": 1306,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pkkwxnA8F2Pse_DxGsnSUexn0E7eFCw-1F3sgbUY_Wo.jpeg?auto=webp&amp;s=770e88c9b5543d2ccdae3e93e29885b16f06d47e"
        },
        "permalink": "/r/movies/comments/1n1gsac/brad_pitt_joaquin_phoenix_jonathan_glazer_join/"
    },
    {
        "id": "1n1vjn5",
        "author": "TheWor1dsFinest",
        "title": "Actors you generally cannot stand and the one movie that you actually love them in that is the exception to the rule.",
        "content": "I’ve never liked Sandra Bullock. I remember watching Speed when it came out and thinking she was super obnoxious. That general sentiment has stuck with me through the decades anytime I’ve watched a movie with her in it. But damn it, I love her in Demolition Man. Don’t know why, but I think she’s absolutely charming and adorable in that one. ",
        "upvotes": 1088,
        "comments": 2214,
        "media": null,
        "permalink": "/r/movies/comments/1n1vjn5/actors_you_generally_cannot_stand_and_the_one/"
    },
    {
        "id": "1n1n9c1",
        "author": "Knightbear49",
        "title": "‘The Toxic Avenger’ Partners With Undue Medical Debt to Erase at Least $5 Million in Medical Debt",
        "content": "",
        "upvotes": 2173,
        "comments": 48,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0njrnxkoY81aH4oxMJMSlyDBLknjZGK2100qLYYi-cc.jpeg?auto=webp&amp;s=9b93ac6dd4323b827084afb2ee34124b3e44c90d"
        },
        "permalink": "/r/movies/comments/1n1n9c1/the_toxic_avenger_partners_with_undue_medical/"
    },
    {
        "id": "1n1jp9h",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Jude Law as Vladimir Putin in Olivier Assayas' 'The Wizard of the Kremlin' - The film charts the Russian leader’s ascent to power amid post-Soviet chaos, aided by versatile spin doctor Vadim Baranov (Paul Dano), a fictional character inspired by real-life fixer, Vladislav Sourkov",
        "content": "",
        "upvotes": 2606,
        "comments": 177,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/di08ev3rvklf1.jpeg?auto=webp&amp;s=1417625d308138753dc9a0542e01fd0a865bffb1"
        },
        "permalink": "/r/movies/comments/1n1jp9h/first_image_of_jude_law_as_vladimir_putin_in/"
    },
    {
        "id": "1n1jhqg",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Yorgos Lanthimos’ ‘Bugonia' Starring Emma Stone &amp; Jesse Plemons - Two conspiracy-obsessed young men kidnap the high-powered CEO of a major company, convinced that she is an alien intent on destroying planet Earth.",
        "content": "",
        "upvotes": 2189,
        "comments": 151,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/du8hq59cuklf1.jpeg?auto=webp&amp;s=e78dcaca955573780f4b471b779561d521807c77"
        },
        "permalink": "/r/movies/comments/1n1jhqg/official_poster_for_yorgos_lanthimos_bugonia/"
    },
    {
        "id": "1n20qs4",
        "author": "putinmaycry",
        "title": "Super Troopers Opening",
        "content": "I’m re-watching Super Troopers for maybe the fifth time and I realized that the opening is nearly flawless and what I mean by that is, I laughed uncontrollably for most of it. The set piece with the three stoners on the side of the road and then the car chase ending at the bar, it’s perfectly brilliant IMHO.\n\n\nI’m wondering if anyone else has any examples of perfect comedic openings from comedy movies. ",
        "upvotes": 246,
        "comments": 147,
        "media": null,
        "permalink": "/r/movies/comments/1n20qs4/super_troopers_opening/"
    },
    {
        "id": "1n1l5m7",
        "author": "SanderSo47",
        "title": "Darren Aronofsky's 'Caught Stealing' Review Thread",
        "content": "[Rotten Tomatoes](https://www.rottentomatoes.com/m/caught_stealing): 87% (from 55 reviews) with 6.70 average rating\n\n[Metacritic](https://www.metacritic.com/movie/caught-stealing/): 69/100 (19 critics)\n\nAs with other movies, the scores are set to change as time passes. Meanwhile, I'll post some short reviews on the movie. It's structured like this: **quote first, source second.** Beware, some contain spoilers.\n\n&gt; Despite all the bloody violence, there is a buoyant feel to the film. Matthew Libatique, Aronofsky’s constant and brilliant cinematographer, makes the city glittery bright outside and the look is vibrant even in the dingy bar. Caught Stealing is an anomaly, a dark soap bubble of an entertainment. And that weirdness makes this unlikely film sparkle.\n\n-[Caryn James, The Hollywood Reporter](https://www.hollywoodreporter.com/movies/movie-reviews/caught-stealing-review-austin-butler-darren-aronofsky-1236353041/)\n\n&gt; Mostly, the tension between the film’s increasingly dark story and its love of rudimentary gags — wouldn’t it be so funny if this guy who mostly subsists on booze physically couldn’t drink anymore? — doesn’t abate until the film’s final act. That’s when things click into place, when the big swings come together, and “Caught Stealing” nearly finds its way to (insert your favorite positive baseball metaphor here). A wild card? Not wild enough, really.\n\n-[Kate Erbland, IndieWire](https://www.indiewire.com/criticism/movies/caught-stealing-review-darren-aronofsky-austin-butler-1235147500/): C+\n\n&gt; “Caught Stealing” might feel like a break from the “Pi” director’s intensely subjective character portraits, which range from “The Wrestler” to “The Whale,” but in fact, Aronofsky brings us as close to Hank as he has to any of his other characters. For Butler, it’s not as flashy a role as the ones he played in “Elvis” or “Dune,” and yet, seeing the actor stripped down to his heather gray undies, his stardom is all but undeniable.\n\n-[Peter Debruge, Variety](https://variety.com/2025/film/reviews/caught-stealing-review-austin-butler-1236496926/)\n\n&gt; At one stage, Hank hits a few balls and instantly a crowd of people gather round, awed – and an old-timer tells him he has “one hell of a swing”. The film has it too.\n\n-[Peter Bradshaw, The Guardian](https://www.theguardian.com/film/2025/aug/27/caught-stealing-review-darren-aronofsky-mother-the-whale-baseball): 4/5\n\n&gt; Some part of Aronofsky may want to evoke the darkly funny mishaps of a vintage crime comedy, but something else keeps coaxing him halfway down dark alleyways, before the movie scrambles back into more comic-adjacent urgency. It’s that run-and-stop-short rhythm that makes Caught Stealing feel more like a fraught, imperfect recovery than a Requiem-style spiral into hell, and an unusually balanced New York portrait. The city of Aronofsky’s early career is neither a paradise lost to gentrification nor a metropolis of the damned. It’s just a bustling microcosm of a pitiless world with plenty of places to hide.\n\n-[Jesse Hassenger, The A.V. Club](https://www.avclub.com/caught-stealing-review): B\n\n&gt; For as much good as there is in \"Caught Stealing,\" there's never that moment where it somehow rises from good to great — but hey, that's okay. It's just good and stays good until the credits roll, which is more than enough. Not every new movie needs to be an event. Sometimes, you just want to watch a handsome guy try to get out of trouble while taking care of an ornery, fluffy cat. We could use more modern movies like \"Caught Stealing.\" \n\n-[Ryan Scott, /Film](https://www.slashfilm.com/1944676/caught-stealing-austin-butler-movie-review/): 7.5/10\n\n&gt; The result is a movie that’s very fun, but weirdly unambitious for Aronofsky. If any up-and-coming director made this movie, it’d be seen as a promising breakthrough. For the guy known for Requiem for a Dream, Black Swan, Mother! and The Whale, it feels like he’s slumming a bit. In a way, though, it’s refreshing to see an Aronofsky movie that, for once, isn’t bursting with more ideas than it can reasonably contain. It would still be nice in this instance to have a thematic through-line that wasn’t just based in nostalgia for a bygone New York. It’s doubtful Caught Stealing will make the same impression its director’s other films have. Fortunately, though, its rewatchability factor is just as high.\n\n-[Abby Olcese, Paste](https://www.pastemagazine.com/movies/caught-stealing/caught-stealing-review-darren-aronofsky-austin-butler-matt-smith-crime-plot): 7.5/10\n\n&gt; As much as the film is Aronofsky’s least characteristic to date, with its Guy Ritchie-esque rogues gallery of crooks and killers and Coen-esque bursts of wry violence, it’s Butler’s performance that makes it feel of a piece with the director’s other work. There are few filmmakers more interested in putting their characters in a vice grip, so as to bring them someplace where their physical traumas become a way for them to know themselves beyond the limits of the body.\n\n-[Rocco T. Thompson, Slant](https://www.slantmagazine.com/film/caught-stealing-review-austin-butler-darren-aronofsky/): 2.5/4\n\n&gt; It’s thin material for such an impressive cast to be working with, and even Butler, who’s made all the right choices post-Elvis when it comes to compelling and varied work, can’t really imagine Hank beyond the mould of tender-hearted victim. He takes all the beatings – and there are a lot of them, which is where Aronofsky’s taste for the brutal slips in – with a noble tear in his eye, haunted as he is by a traumatic accident in his youth that put an end to his baseball career.\n\n-[Clarisse Loughrey, The Independent](https://www.the-independent.com/arts-entertainment/films/reviews/caught-stealing-review-austin-butler-b2814868.html): 2/5\n\n&gt; For the most part, Caught Stealing is a riotous, rollicking ride studded with New York’s concrete grit — but its sharper edges prove more difficult to endure.\n\n-[Ben Travis, Empire](https://www.empireonline.com/movies/reviews/caught-stealing/): 3/5\n\n____________________________________________________________________________________________\n\n**PLOT**\n\nHank Thompson was a high-school baseball phenom who can't play anymore, but everything else is going okay. He's got a great girl, tends bar at a New York dive, and his favorite team is making an underdog run at the pennant. When his punk-rock neighbor Russ asks him to take care of his cat for a few days, Hank suddenly finds himself caught in the middle of a motley crew of threatening gangsters.\n\n**DIRECTOR** \n\nDarren Aronofsky\n\n**WRITER**\n\nCharlie Huston (based on his novel)\n\n**MUSIC**\n\nRob Simonsen\n\n**CINEMATOGRAPHY**\n\nMatthew Libatique\n\n**EDITOR**\n\nAndrew Weisblum\n\n**RELEASE DATE** \n\nAugust 29, 2025\n\n**RUNTIME**\n\n107 minutes\n\n**STARRING**\n\n- Austin Butler as Henry \"Hank\" Thompson\n\n- Regina King as Detective Roman\n\n- Zoë Kravitz as Yvonne\n\n- Matt Smith as Russ\n\n- Liev Schreiber as Lipa\n\n- Vincent D'Onofrio as Shmully\n\n- Griffin Dunne as Paul\n\n- Benito A Martínez Ocasio as Colorado\n\n- Carol Kane as Bubbe",
        "upvotes": 1291,
        "comments": 165,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/e9H3YFyDEK-gCriTUn6wEtLz_itO2vEcTgQ7TEfQC-E.jpeg?auto=webp&amp;s=e9c7227f30b1b868ff571b410e747851ac1d0534"
        },
        "permalink": "/r/movies/comments/1n1l5m7/darren_aronofskys_caught_stealing_review_thread/"
    },
    {
        "id": "1n1sra2",
        "author": "BunyipPouch",
        "title": "'Jacob's Ladder' - 4K Restoration Trailer",
        "content": "",
        "upvotes": 466,
        "comments": 74,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aED3owWdM7YkXqnF-IoLuE02b392o_I04KEpHXwDrsI.jpeg?auto=webp&amp;s=19376d250ed4124f63fdf3e33bd31e80bee02b6e"
        },
        "permalink": "/r/movies/comments/1n1sra2/jacobs_ladder_4k_restoration_trailer/"
    },
    {
        "id": "1n1cyak",
        "author": "mpocFr",
        "title": "In Dune movies, it seems to me Paul never voluntarily touches water, and it makes total sense !",
        "content": "On Arrakis, water is both scarce and sacred, deeply tied to Fremen culture. I get the feeling Paul avoids it completely until he starts embracing his Fremen identity—he never drinks on screen, and when he does interact with it, it’s always symbolic (like the water of life).\n\nMeanwhile, the Harkonnens are shown drinking, sweating, bathing ;wasting water like it's nothing, highlights their disconnect Arrakis.\n\nI think that subtle contrast makes so much sense!",
        "upvotes": 3159,
        "comments": 140,
        "media": null,
        "permalink": "/r/movies/comments/1n1cyak/in_dune_movies_it_seems_to_me_paul_never/"
    },
    {
        "id": "1n1idav",
        "author": "keepfighting90",
        "title": "Anyone else feel a little underwhelmed with Mission Impossible: The Final Reckoning?",
        "content": "Mission Impossible has long been one of the best, most consistent series of Hollywood blockbusters. The first \"trilogy\" was pretty solid, and the 2nd run of Ghost Protocol/Rogue Nation/Fallout is legitimately some of the greatest action movie filmmaking ever. Dead Reckoning was good enough but didn't really hit the same highs - although maybe COVID is to blame for that.\n\nI was pretty excited for Final Reckoning given that it's the closing chapter of this generally awesome series, and it's almost 3 hours long - couldn't wait to see all the amazing stunts and set pieces we'd be getting, considering this is the end and the amount of time Christopher Macquarrie has to play with.\n\nIn reality though, I was pretty underwhelmed with what the movie delivered. The pacing is seriously wonky - it starts off very slowly and the first 40-45 minutes is all exposition and flashbacks...but it also feels like it resolves way too quickly at the end. The editing seemed a little off too, with scenes jumping from one another with some rather choppy transitions.\n\nI'm somewhat mixed on the action set pieces we got. The 2 big ones - Ethan's exploration of the downed submarine and the aerial chase at the end - are both really good in a vacuum. The sub escape goes beyond even the level of disbelief you need for these movies though, especially near the end with Ethan swimming like 300m through freezing cold water without a gas mask. And the plane chase felt too reminiscent of the climax in Fallout although admittedly it was way more intense and edge of your seat with Tom Cruise hanging off the planes themselves. \n\nOutside of these 2 though, the movie felt oddly free of the excitement and intensity the MI series typically has. It's weird but it felt almost kind of small considering the stakes were end-of-the-world? Like it didn't really give off \"closing chapter\" vibes to me. And I actually think we could've done with one or two more big set pieces. They kinda did Gabriel dirty as the final big bad too. He was menacing and sinister in Dead Reckoning but he came off as a Looney Tunes cartoon villain here and &gt;!his death scene was ridiculous.!&lt;\n\nIt was still fairly enjoyable but maybe I just expected more considering the high bar movies 4-6 set, as well as this being the final chapter of the series.",
        "upvotes": 852,
        "comments": 668,
        "media": null,
        "permalink": "/r/movies/comments/1n1idav/anyone_else_feel_a_little_underwhelmed_with/"
    },
    {
        "id": "1n1lavs",
        "author": "KillerCroc1234567",
        "title": "Todd Haynes’ Previously Shuttered Gay Romance ‘De Noche’ Being Revived With Pedro Pascal Circling",
        "content": "",
        "upvotes": 485,
        "comments": 84,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gLcDKZLKssqpihORqD0IPBdUcn3uJgkA_PkNZcn-NYU.jpeg?auto=webp&amp;s=a729114e29820f59b8be1623a785b523c6cb2918"
        },
        "permalink": "/r/movies/comments/1n1lavs/todd_haynes_previously_shuttered_gay_romance_de/"
    },
    {
        "id": "1n1ngne",
        "author": "Zhukov-74",
        "title": "Nuremberg | Official Teaser #2",
        "content": "",
        "upvotes": 333,
        "comments": 104,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FHyGAUFggdXkd-Z6O4HcJvrOxHGERWTZNnFv8LoVJC4.jpeg?auto=webp&amp;s=2cb7f556fd1aff1bab7c5936e3d5cfbf6a3e7ef8"
        },
        "permalink": "/r/movies/comments/1n1ngne/nuremberg_official_teaser_2/"
    },
    {
        "id": "1n1o6vs",
        "author": "MoneyLibrarian9032",
        "title": "New poster for ‘THE LONG WALK’ The film follows a contest where 50 young men have to walk without stopping &amp; are killed if they pause for too long.",
        "content": "",
        "upvotes": 225,
        "comments": 84,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/48z0ucphpllf1.jpeg?auto=webp&amp;s=db9a0ec968822d0231a351ff2f57ffe704bb269b"
        },
        "permalink": "/r/movies/comments/1n1o6vs/new_poster_for_the_long_walk_the_film_follows_a/"
    },
    {
        "id": "1n1xx3p",
        "author": "BunyipPouch",
        "title": "First Poster for Documentary 'Chain Reactions' - The Texas Chainsaw Massacre's impact on 5 artists - Patton Oswalt, Takashi Miike, Alexandra Heller-Nicholas, Stephen King, Karyn Kusama - through interviews, outtakes, exploring how it shaped their art, psyche from childhood trauma.",
        "content": "",
        "upvotes": 69,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zurwhfkrmnlf1.jpeg?auto=webp&amp;s=834bfbfd053788048f7f796e075d424c7da37f0c"
        },
        "permalink": "/r/movies/comments/1n1xx3p/first_poster_for_documentary_chain_reactions_the/"
    },
    {
        "id": "1n1hwaq",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'Sisu: Road to Revenge'",
        "content": "",
        "upvotes": 402,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/bpkblh1ejklf1.jpeg?auto=webp&amp;s=2104bec5fa95bd9a3dca48063588b2c53ed67dc8"
        },
        "permalink": "/r/movies/comments/1n1hwaq/new_poster_for_sisu_road_to_revenge/"
    },
    {
        "id": "1n0ulu3",
        "author": "MarvelsGrantMan136",
        "title": "‘KPop Demon Hunters’ Is Netflix’s Most-Watched Movie Ever With 236 Million Views, Beating ‘Red Notice’",
        "content": "",
        "upvotes": 22272,
        "comments": 2282,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KKBb_pchk089bp3Hxz0l6b5RJiWri6p90RJIc_TzgUc.jpeg?auto=webp&amp;s=68d8a1a2844cba5c599775111361b4c422514160"
        },
        "permalink": "/r/movies/comments/1n0ulu3/kpop_demon_hunters_is_netflixs_mostwatched_movie/"
    },
    {
        "id": "1n1c73o",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for ‘Sisu: Road to Revenge’",
        "content": "",
        "upvotes": 823,
        "comments": 102,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ij1kpyt45jlf1.jpeg?auto=webp&amp;s=315939102f22e745912b11579738c6857d100bba"
        },
        "permalink": "/r/movies/comments/1n1c73o/official_poster_for_sisu_road_to_revenge/"
    },
    {
        "id": "1n1aoni",
        "author": "omgitsdemi",
        "title": "I just need to cry — what movies will wreck me?",
        "content": "I lost my mum very suddenly in June, and honestly I think I just need a really good cry. Some days it feels like I’m holding everything in, and I’d love some movie recommendations that can help me let the emotions out. Doesn’t matter if it’s heartbreaking, bittersweet, or just quietly emotional — I just want something that will move me.\n\nWhat are the movies that always make you cry?\n",
        "upvotes": 1100,
        "comments": 2876,
        "media": null,
        "permalink": "/r/movies/comments/1n1aoni/i_just_need_to_cry_what_movies_will_wreck_me/"
    },
    {
        "id": "1n1jsts",
        "author": "KillerCroc1234567",
        "title": "Deathstalker - Exclusive Red Band Trailer (2025)",
        "content": "",
        "upvotes": 214,
        "comments": 79,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/emz6-5T7xmW4EJiqvGWhio6yqNljwiOtAwawtiBGx8U.jpeg?auto=webp&amp;s=d8add09776b1bdcb9694fdfe1e3c99ac0308ff16"
        },
        "permalink": "/r/movies/comments/1n1jsts/deathstalker_exclusive_red_band_trailer_2025/"
    },
    {
        "id": "1n1hvnx",
        "author": "MarvelsGrantMan136",
        "title": "Sisu: Road to Revenge - Exclusive Red Band Trailer",
        "content": "",
        "upvotes": 252,
        "comments": 77,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/b46kZ0p6sIRh7NKga5q9o7cb2r7-ShjT3n267DdiM90.jpeg?auto=webp&amp;s=6e7f9985e9d3f1693b9cd99de43fb9c533517635"
        },
        "permalink": "/r/movies/comments/1n1hvnx/sisu_road_to_revenge_exclusive_red_band_trailer/"
    },
    {
        "id": "1n247uj",
        "author": "Chance-Whole4916",
        "title": "'Papa Buka' By Dr. Biju, Starring Ritabhari Chakraborty, Becomes PNG’s Official Oscars Entry",
        "content": "",
        "upvotes": 10,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/N7h8FjHQr4s4PUuD3EBn3xdY6szg2SJ32J7cM3FOrjs.jpeg?auto=webp&amp;s=d5f5bbca469f75dd6584f4cdd2dfa77e2c03d720"
        },
        "permalink": "/r/movies/comments/1n247uj/papa_buka_by_dr_biju_starring_ritabhari/"
    },
    {
        "id": "1n1zyt3",
        "author": "fenix_br100",
        "title": "Time travel movies",
        "content": "Since I was a kid, this has been one of my favorite genres, and I think I've watched pretty much all the mainstream ones, I consider time loops such as groundhog day time travel as well.\nTo sum it up I'm looking for the less seen time travel  movies and I think this is the best place to look for them, if anyone can help me I'll be thankful",
        "upvotes": 26,
        "comments": 156,
        "media": null,
        "permalink": "/r/movies/comments/1n1zyt3/time_travel_movies/"
    },
    {
        "id": "1n1he3w",
        "author": "iamchristian1129",
        "title": "Are there any Disney movies you can think of that have really messed-up storylines?",
        "content": "I feel like there’s one that many never think about, it’s The Parent Trap, I mean they met on a cruise ship, fell in love and got married in a week, then they both have twins, get a divorce and they each decide to take sole custody of their own daughters and they never mention to them that they are twins and the parents act like the other twin doesn’t exist so that they don’t have to see each other again",
        "upvotes": 245,
        "comments": 343,
        "media": null,
        "permalink": "/r/movies/comments/1n1he3w/are_there_any_disney_movies_you_can_think_of_that/"
    },
    {
        "id": "1n26gor",
        "author": "Martipar",
        "title": "I can't believe it's not..... Films with directorial characteristics of a director who had nothing to do with the film.",
        "content": "I watched Battleship a few years ago, i was at my mum's, she suggested watching it so we did. I was convinced if was a Michael Bay film, but only bus the trailers i'd seen beforehand but also during the film it just felt like one. I was amazed when his name was absent from the credits either as a director or producer. \n\nQuite a few people are still surprised when they learn that Tim Burton didn't direct The Addams Family or it's sequel. That was the excellent Barry Sonnenfeld who went on to do Men in Black. What other films are there that feel like one directors work but is actually by another?",
        "upvotes": 9,
        "comments": 16,
        "media": null,
        "permalink": "/r/movies/comments/1n26gor/i_cant_believe_its_not_films_with_directorial/"
    },
    {
        "id": "1n1mm0u",
        "author": "LaserDiscCurious",
        "title": "Bowfinger (1999) will have you on the floor. So funny, so correct about Hollywood. Not one single flaw in sight.",
        "content": "I miss comedies that are genuinely funny. This being, in my opinion, Eddie Murphy's funniest movie ever. From its acidic take on Hollywood and the movie business, OTT characters, Murphy's versatility as he goes from the narcissistic paranoid movie star Kit Ramsey to his dorky brother, Jiff. The highway scene is one for the books. \n\nSteve Martin's writing gives us plenty of zingers that are genuinely funny, Heather Grahame is likably dumb as an aspiring actress willing to do anything to get ahead, Christine Baranski is hilarious as an aging actress who can't wait to get into Kit's pants and Robert Downey Jr in a small but instantly cameo as a movie executive. \n\nI don't know this isn't referenced just as much as Tropic of Thunder. It's so much wittier. \n\nAlso, Chubby Rain, or the fact that the movie project's plot would probably be greenlit today.",
        "upvotes": 129,
        "comments": 80,
        "media": null,
        "permalink": "/r/movies/comments/1n1mm0u/bowfinger_1999_will_have_you_on_the_floor_so/"
    },
    {
        "id": "1n1lph8",
        "author": "cyPersimmon9",
        "title": "When Roger Ebert spoke about the power of animation",
        "content": "It's a shame that so many people still deride the medium of animation. But Roger Ebert was ahead of his time. He said: \"Every time an animated film is successful, you have to read all over again about how animation isn't 'just for children' but 'for the whole family,' and 'even for adults going on their own.' No kidding!\"\n\n\nFrom his review of Miyazaki's Princess Mononoke: **\"I go to the movies for many reasons. Here is one of them. I want to see wondrous sights not available in the real world, in stories where myth and dreams are set free to play. Animation opens that possibility, because it is freed from gravity and the chains of the possible. Realistic films show the physical world; animation shows its essence. Animated films are not copies of 'real movies,' are not shadows of reality, but create a new existence in their own right.\"**",
        "upvotes": 133,
        "comments": 23,
        "media": null,
        "permalink": "/r/movies/comments/1n1lph8/when_roger_ebert_spoke_about_the_power_of/"
    },
    {
        "id": "1n1i755",
        "author": "DemiFiendRSA",
        "title": "As ‘The Dark Crystal’ Returns to Theaters on October 12 and 13, Brian Henson Shares Memories from the Epic Fantasy",
        "content": "",
        "upvotes": 175,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NzXvNaKXVomdnq4--uYNBUboIxmHyI0q49mLHT17ix8.jpeg?auto=webp&amp;s=682466bfe3352d14b7a87375072f9a02f094794f"
        },
        "permalink": "/r/movies/comments/1n1i755/as_the_dark_crystal_returns_to_theaters_on/"
    },
    {
        "id": "1n1jys2",
        "author": "NoCulture3505",
        "title": "Official Poster for \"All of You\"",
        "content": "",
        "upvotes": 133,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qdjayqkfxklf1.jpeg?auto=webp&amp;s=a7d134a3e2f2de9ac856c180ddeaf43f3e93eb89"
        },
        "permalink": "/r/movies/comments/1n1jys2/official_poster_for_all_of_you/"
    },
    {
        "id": "1n21s00",
        "author": "ProfessorTremendous",
        "title": "Emotional Movies that you can't watch around people",
        "content": "What movie or movies are ones that you have to watch by yourself because you know how it can make you ugly cry? I understand trying not to cry in front of family and friends watching emotional movies, but trying to see from movie watchers what movies do that to you. Whether its a sports movie, romance, war, true stories. ",
        "upvotes": 16,
        "comments": 32,
        "media": null,
        "permalink": "/r/movies/comments/1n21s00/emotional_movies_that_you_cant_watch_around_people/"
    }
]