[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 42,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 14,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1q9n7yj",
        "author": "hasanahmad",
        "title": "Netflix is now the Walmart/Amazon of entertainment media",
        "content": "You can find a lot . You can find sporadic quality , a lot of trash but America is all over it everyday. It’s way too big to fail at this point after after the competitors came in and all have flatlined to be barely there or rarely competing ",
        "upvotes": 686,
        "comments": 98,
        "media": null,
        "permalink": "/r/netflix/comments/1q9n7yj/netflix_is_now_the_walmartamazon_of_entertainment/"
    },
    {
        "id": "1q9o2l9",
        "author": "NoEstablishment205",
        "title": "Homeland",
        "content": "How on earth am I just now watching Homeland!?! I have been hooked. I love Claire Danes anyways but wow. Great acting. Great plot. They don’t make shows like this anymore. ",
        "upvotes": 50,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1q9o2l9/homeland/"
    },
    {
        "id": "1q8z5px",
        "author": "Deadpool-fan-466",
        "title": "What was the point of casting Linda Hamilton in Stranger things S05?",
        "content": "When I first found out about it, I thought it's gonna be interesting. Either she's gonna be an important character, or Netflix wants star power (as usual) to hype up the final season.\n\nThen it became as bland as it could be: She's the new \"Papa\", trying to restore \"the program\". She even does exactly what was shown in the trailer, shooting at Eleven &amp; co.\n\nI know that being Sarah Connor in those 2 terminator movies is the only career highlight of her, but being in Stranger things doesn't change much either (for her &amp; the show)",
        "upvotes": 1039,
        "comments": 195,
        "media": null,
        "permalink": "/r/netflix/comments/1q8z5px/what_was_the_point_of_casting_linda_hamilton_in/"
    },
    {
        "id": "1q9mjlu",
        "author": "Famous-Donut-2394",
        "title": "What was the WORST Ending to A Netflix Original Series??",
        "content": "Just throwing it out there, since I have seen people complain about many Netflix shows ending. Cancelled series do NOT count (ex. Lockwood &amp; Co.) Neither do unfinished series (Wednesday, OBX etc.)",
        "upvotes": 35,
        "comments": 95,
        "media": null,
        "permalink": "/r/netflix/comments/1q9mjlu/what_was_the_worst_ending_to_a_netflix_original/"
    },
    {
        "id": "1q98hpp",
        "author": "OkCartographer4028",
        "title": "Just finished watching “Homeland”, now I don’t know what do with myself",
        "content": "I just finished watching Homeland and it’s honestly the best show I’ve seen in years. I looked forward to returning home everyday to continue watching it, I even stayed home at weekends to chill and enjoy the show. Captivating 8 seasons. Now it’s ended, I’m so sad. I can’t stop thinking about it, now I don’t know what to watch. \n\nCan someone recommend similar shows? Something as captivating ",
        "upvotes": 132,
        "comments": 124,
        "media": null,
        "permalink": "/r/netflix/comments/1q98hpp/just_finished_watching_homeland_now_i_dont_know/"
    },
    {
        "id": "1q935t3",
        "author": "intelerks",
        "title": "Netflix pushes 'Wednesday' to 2027 as 'Bridgerton', 'One Piece', and 'The Witcher' line up for 2026",
        "content": "",
        "upvotes": 201,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1q935t3/netflix_pushes_wednesday_to_2027_as_bridgerton/"
    },
    {
        "id": "1q9szc9",
        "author": "d_o_mino",
        "title": "Level out the sound please",
        "content": "Damn, NF, music and explosions are way too loud in comparison to dialogue. Is there a setting that I don’t know about? \n\nIt’s annoying to have to turn up volume so I can hear soft spoken words but then get my eardrums destroyed when music begins to play. ",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q9szc9/level_out_the_sound_please/"
    },
    {
        "id": "1q9r60z",
        "author": "cl4udia_kincaiid",
        "title": "Run Away - terrible acting?",
        "content": "I just started Run Away and I’m so confused as to why the acting is so bad. I know some of these actors can act, I’ve seen them in other things. But in this they’re all wooden as hell, like they’re reading a script written by an amateur or from a teleprompter. My only theory is this is an example of Netflix shows beginning to write for “second screen viewing” knowing that a lot of people watch shows when on their phone so they have the characters say unnecessary dialogue to explain what’s going on. I’ve noticed a lot of that in the first episode alone. But the actors also seem to be getting zero direction and not knowing what to bring to their roles. It’s very weird.  ",
        "upvotes": 5,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1q9r60z/run_away_terrible_acting/"
    },
    {
        "id": "1q9thpg",
        "author": "abriellecaton",
        "title": "His &amp; Hers",
        "content": "I had to write about this somewhere. This show is AMAZING!  If you love detective/crime WATCH THIS SHOW!  Plot twist and a good storyline with good actors and characters.  AMAZING. ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q9thpg/his_hers/"
    },
    {
        "id": "1q9r81c",
        "author": "Proud_Commercial5210",
        "title": "any good psychological show recommendations?",
        "content": "i tend to find myself picky about finding a new show or what to watch. i prefer shows over movies cause i like something that’ll take a while &amp; i can really get in to. im gonna add a list of shows i’ve already watched &amp; really enjoyed in hopes that someone can recommend something similar or just as enjoyable lol. \n\n\\- all of the Monsters series (jeffery dahmer, ed grin, &amp; the menendez brothers) i really enjoyed these\n\n\\- Untamed \n\n\\- Stranger Things\n\n\\- Haunting of Hill House one of my all time faves this show stuck with me for a long while after watching it (esp the vent neck lady) 😭\n\n\\- The Fall of the House of Usher also a really good watch the stuck with me i really liked how each episode was a different character in the spotlight \n\n\\- Sirens \n\n\\- Wayward loved each of the characters &amp; just the overall vibe &amp; themes of the show\n\n\\- Yellowjackets saved my favorite for last this show REALLY stuck with me &amp; i’ve been trying to find something just as thrilling &amp; satisfying to watch while we all long await the newest 4th season. \n\ni’ll take any recommendations preferably shows, not movies. but if you really think something is worth watching please lmk im not that hard to convince! lol thanks to whoever has anything to suggest!!",
        "upvotes": 4,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1q9r81c/any_good_psychological_show_recommendations/"
    },
    {
        "id": "1q9m25p",
        "author": "Spiritual-Honey-4587",
        "title": "His and Hers episode 4 ending",
        "content": "I know I’m behind, but I just finished episode 4, and the ending really bothered me. They just had the most cathartic moment- opening up about the mutual trauma around losing Charlotte. The sex scene in the back of the van feels unnatural. Maybe I’m from a different world, but how do you move from that powerful emotional moment to having sex in such a structured parallel to what happened with Rachel— another traumatic event they both shared. Am I the only one who finds that unrealistic?? ",
        "upvotes": 7,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1q9m25p/his_and_hers_episode_4_ending/"
    },
    {
        "id": "1q9rmlo",
        "author": "FlyLikeDove",
        "title": "Has anyone seen \"Nobody's Home\"?",
        "content": "I'm talking about the 2024 movie where two couples end up in a home that neither of them owns. It's a pretty mid movie to be honest, but I'm really confused about the ending of it. Looking for some clarity if anyone has seen it?",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q9rmlo/has_anyone_seen_nobodys_home/"
    },
    {
        "id": "1q97n3a",
        "author": "Strange_Light5219",
        "title": "Why Netflix?",
        "content": "Just finished watching Lockwood &amp; co and found out the show's not being renewed for season 2. \n\nI can definitely say it's one of the hidden gems and a nice thriller. It should have gotten more attention than it received as it is also has \"mostly liked\" tag.",
        "upvotes": 23,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1q97n3a/why_netflix/"
    },
    {
        "id": "1q9qagu",
        "author": "Key-Contribution985",
        "title": "I need help understanding Ballad of a Small Player",
        "content": "So, Dao-ming didn't help him during the heart attack—I got that part. But then, how does he suddenly end up on a boat alone? Also, where did he get all that money? I feel like I'm missing a huge piece of the puzzle and it's driving me crazy. Help me out!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q9qagu/i_need_help_understanding_ballad_of_a_small_player/"
    },
    {
        "id": "1q9tr3r",
        "author": "No_Flatworm7586",
        "title": "did netflix edit out eyecatchers?",
        "content": "im rewatching demon slayer but this time im rewatching it on netflix and this just crossed my mind because i remember there being eyecatchers and a sword sound. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q9tr3r/did_netflix_edit_out_eyecatchers/"
    },
    {
        "id": "1q9olpp",
        "author": "sugar_peace",
        "title": "My korean boyfriend",
        "content": "Interesting show observing the cross cultural differences and i legit liked the 2 react episodes at the end - that was most entertaining. It was definitely the highlight of the show for me! I'm asian not sure if i could take the comments in if i heard it in person but I loved the reactions, so real, spontaneous and funny 😀 ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q9olpp/my_korean_boyfriend/"
    },
    {
        "id": "1q8c7eq",
        "author": "GiveMeSomeSunshine3",
        "title": "‘Black Mirror’ Renewed For Season 8 At Netflix",
        "content": "",
        "upvotes": 1287,
        "comments": 92,
        "media": null,
        "permalink": "/r/netflix/comments/1q8c7eq/black_mirror_renewed_for_season_8_at_netflix/"
    },
    {
        "id": "1q8yyqs",
        "author": "Unable-Youth",
        "title": "His &amp; Hers Had Potential",
        "content": "Spoiler Alert below.\n\nThis show had a lot of potential but was problematic and had loose ends:\n\n1. What’s the story with Anna’s tooth at the beginning and end? Does not serve a purpose.\n2. Why did Zoe hate Anna, if Anna was the rape victim? Zoe gives Anna the finger in one episode, and then she tries to warn Jack towards the end that “Anna isn’t who you think she is…”\n3. No explanation of why they were all friends then stopped being friends when they all seemed to watch Anna’s rape\n4. Why did Zoe stop being friends with Helen and Rachel if she was complicit in the rape?\n5. Why was Catherine trying to get back at Anna when it was Anna that was raped? What was with all the “murder” supplies she got Richard to buy\n6. Jack said Alice showed signs of dementia during the year Anna left. Was she premeditating that far in advance?\n\nFinally, how am I supposed to believe an old woman is capable of pulling off gruesome murders that require lots of physical strength as noted in one episode… I mean 40 stab wounds? Also, how did she get the friendship bracelets? Did Anna have them in her box I.e do we assume they all gave them back to her?\n\nWhat was the side story about the blackmail In Rachel’s phone when it came to their weird shit with Duffie?\n\nLazy ending and the show had more potential.",
        "upvotes": 32,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1q8yyqs/his_hers_had_potential/"
    },
    {
        "id": "1q9o0sp",
        "author": "Abject-Pressure-2529",
        "title": "REQUEST: Binge worthy?",
        "content": "Binge Worthy\n\nRequest: Recently added Netflix at home. I looking for your top five binge worthy programs true crime/ serial killer. \nI've watched all the programs on ID Paramount and Peacock.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1q9o0sp/request_binge_worthy/"
    },
    {
        "id": "1q9lzaf",
        "author": "ybutton",
        "title": "I need help finding a coming of age/teen Nordic or Central European show I watched sometime in the last year",
        "content": "The show was about a ND teenage girl and her childhood friend who go on a vacation together with their parents, and is centered around the girl trying/wanting to make a short film for something college related, with her friend’s help. There is some conflict around her wanting to have sex with him and him not wanting to (i think because he’s gay) and she/they eventually end up finding another guy to also star in the film/play the romantic part. I hope that’s enough info. thanks",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q9lzaf/i_need_help_finding_a_coming_of_ageteen_nordic_or/"
    },
    {
        "id": "1q9cq0d",
        "author": "AggravatingCamp9315",
        "title": "Good night &amp; good luck",
        "content": "It took me a moment to get into this but it ended up being a really powerful show. I particularly liked the tie from mccarthy to current events ( which has not been lost on many of us for some time now.) Although the lighting was a bit dark for me at times, I really ended up with goosebumps at the end. History lesson and current event in one. \n\nI wish we had more filmed theatre on Netflix. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q9cq0d/good_night_good_luck/"
    },
    {
        "id": "1q9c81c",
        "author": "NatrenSR1",
        "title": "IOS app not working?",
        "content": "For a while now I’ve had an issue with the iPhone app where it always gives me a network error as soon as I open it. I figured that it was due to my phone needing to be updated, but even after updating (and holy hell the new IOS is ugly) it persists. I’ve tried it over WiFi and cellular and still it doesn’t work. Is this a known issue, and how do I fix it?",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q9c81c/ios_app_not_working/"
    },
    {
        "id": "1q91d49",
        "author": "abitworndown",
        "title": "Netflix double subtitles",
        "content": "This is driving me crazy. I have toggled subtitles off and on but nothing seems to fix the issue. If there are english subtitles built into a show or movie, even with subtitles off Netflix adds their own subtitles and puts them on top of the built in subtitles. I wanted to add a picture of the issue but I dont think this subreddit allows it. \n\nI can see that the subtitle option is obviously turned off since the subtitles only happen when a language other than English is spoken. Its impossible to read what's on the screen which can affect the plot of what I'm watching. I've tried to find solutions but haven't had any luck. \n\nhttps://imgur.com/a/4W8QtEo",
        "upvotes": 14,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1q91d49/netflix_double_subtitles/"
    },
    {
        "id": "1q8hpk0",
        "author": "FunRealistic7609",
        "title": "Scrolling Netflix for 30 mins. Still haven't picked anything",
        "content": "Please suggest a really good show or movie that’s genuinely worth watching. Any genre works drama, romance, thriller, comedy, or even something underrated that surprised you. I’m in the mood to binge or just relax and enjoy a good story. Drop your best Netflix recommendations and save me from endless scrolling.",
        "upvotes": 200,
        "comments": 282,
        "media": null,
        "permalink": "/r/netflix/comments/1q8hpk0/scrolling_netflix_for_30_mins_still_havent_picked/"
    },
    {
        "id": "1q96x1s",
        "author": "Low-Collection3307",
        "title": "Looking for thriller show :)",
        "content": "Hey !!\n\nI would like some recommendation on shows to watch.\n\nRecently I loved :\n\nThe Beast In Me\nApple Cider Vinegar\nAdolescence\nInventing Anna\nDon’t fuck with cats (doc) \n\nThank you 🙏 ",
        "upvotes": 4,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1q96x1s/looking_for_thriller_show/"
    },
    {
        "id": "1q8svwg",
        "author": "FluidModeNetwork",
        "title": "Isn't netflix wrong about stranger things?",
        "content": "if dustin, will, lucas, max, and mike all started high school in 1985, how did they graduate in 1987? Wasn't there 3 and a half years that passed in season 5 alone?\n\nWhy is netflix's merch say graduating class of 87?",
        "upvotes": 46,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1q8svwg/isnt_netflix_wrong_about_stranger_things/"
    },
    {
        "id": "1q9a4s8",
        "author": "Highly_Dumb",
        "title": "People We Met on Vacations (Movie)",
        "content": "I just wanted to ask about what's your perspective on Sarah in general,like how would you view Poppy and Alex as her? As someone who is in a long relationship but also has really meaningful friendships I really wanna know varied opinions",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q9a4s8/people_we_met_on_vacations_movie/"
    },
    {
        "id": "1q9ik6w",
        "author": "urmommy6942032",
        "title": "Btightness issues",
        "content": "Idk what happened, i never messed with the settings at all since i started using the app, but for some apparent reason it seems like my brightness is locked at around 70-80% brightness? Everytime i mess with the brightness and move it up and down it seems like theres no difference between 70-100. On my PC it works fine but not for my phone, im using an S24 FE if that helps.\n\nThanks in advance!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q9ik6w/btightness_issues/"
    }
]