[
    {
        "id": "1o8qqox",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Black Phone 2 / Good Fortune / Kiss of the Spider Woman / The Lost Bus) plus throwbacks",
        "content": "**New In Theaters**:\n\n* [Black Phone 2](https://old.reddit.com/r/movies/comments/1o8p3a4/official_discussion_black_phone_2_spoilers/?)\n* [Good Fortune](https://old.reddit.com/r/movies/comments/1o8p3c9/official_discussion_good_fortune_spoilers/?)\n* [After the Hunt](https://old.reddit.com/r/movies/comments/1o8p3g3/official_discussion_after_the_hunt_spoilers/?)\n* [Kiss of the Spider Woman](https://old.reddit.com/r/movies/comments/1o8p3ha/official_discussion_kiss_of_the_spider_woman/?)\n\n**25th Anniversary Throwback Discussion Threads**:\n\n* [The Ladies Man](https://old.reddit.com/r/movies/comments/1o8p3kd/official_throwback_discussion_the_ladies_man/?)\n* [Dr. T and the Women](https://old.reddit.com/r/movies/comments/1o8p3lm/official_throwback_discussion_dr_t_and_the_women/?)\n* [Billy Elliot](https://old.reddit.com/r/movies/comments/1o8p3np/official_throwback_discussion_billy_elliot/?)\n\n**Still In Theaters**:\n\n* [Tron: Ares](https://old.reddit.com/r/movies/comments/1o2okpk/official_discussion_tron_ares_spoilers/)\n* [Roofman](https://old.reddit.com/r/movies/comments/1o2okr6/official_discussion_roofman_spoilers/?)\n* [Anemone](https://old.reddit.com/r/movies/comments/1o2oksd/official_discussion_anemone_spoilers/?)\n* [The Smashing Machine](https://old.reddit.com/r/movies/comments/1nwmw7l/official_discussion_the_smashing_machine_spoilers/?)\n* [Good Boy](https://old.reddit.com/r/movies/comments/1nwmw8p/official_discussion_good_boy_spoilers/?)\n* [One Battle After Another](https://old.reddit.com/r/movies/comments/1nqpegf/official_discussion_one_battle_after_another/?)\n\n\n**New On Streaming:**\n\n* [The Twits](https://www.reddit.com/r/movies/comments/1oae8r7/official_discussion_the_twits_spoilers/?)\n* [I Like Me](https://www.reddit.com/r/movies/comments/1oae8u5/official_discussion_i_like_me_spoilers/?)\n* [The Lost Bus](https://old.reddit.com/r/movies/comments/1o8p3is/official_discussion_the_lost_bus_spoilers/?)\n* [Play Dirty](https://old.reddit.com/r/movies/comments/1ny4mel/official_discussion_play_dirty_spoilers/?)\n* [Steve](https://old.reddit.com/r/movies/comments/1ny4mgo/official_discussion_steve_spoilers/?)\n* [Swiped](https://www.reddit.com/r/movies/comments/1nsy3bh/official_discussion_swiped_spoilers/?)\n* [The Man in My Basement](https://www.reddit.com/r/movies/comments/1nsy3dw/official_discussion_the_man_in_my_basement/?)\n* [Highest 2 Lowest](https://old.reddit.com/r/movies/comments/1n9h173/official_discussion_highest_2_lowest_spoilers/?)\n\n**Discussions Coming Soon**\n\n* If I Had Legs I'd Kick You\n* House of Dynamite",
        "upvotes": 22,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1o8qqox/official_discussion_megathread_black_phone_2_good/"
    },
    {
        "id": "1ob91qk",
        "author": "Kimosabae",
        "title": "Finally Saw 28 Years Later... and Discussions about the Ending Has Me Wondering if I'm Brain Damaged.",
        "content": "The Movie itself is pretty good. Not without some issues, but I really appreciate this thing swinging for the fences. One of the most legitimately beautiful films I've seen in some time with some strange editing choices that can't all be easily explained away as stylistic.\n\nIt's divisive for a reason.\n\nThat said... the ending should be one of the least controversial aspects of the film and online criticisms in spaces like this have me wondering if my whole face should be wrapped in a strait jacket.\n\nVAGUE SPOILERS\n\nIf you didn't know that there's supposed to be a follow up film... *maybe* I could understand having pure tonal whiplash. But even then... it's clear the Power Rangers montage wasn't the ending. This was more of a post-credits scene further expanding the world.\n\nBut even in the context of the film alone; it earns this supposedly hysterical idea. It's evident from the film itself that there are disperse communities in this post-apocalyptic UK and segregation would engender sociological differences in how they adapt to this hostile world.\n\nThis is Mad Max, post-apocalyptic world-building 101.\n\nThis particular band of roving, Sentai-simulating crazies isn't any more outlandish than an isolated doctor making a tower of babel out of human skulls.\n\nFinding the tone off-putting is one thing (it would likely have worked better as a post-credits scene overall) but I've seen many occasions of people stating that the scene put them off the film and the sequel completely, which I find to be mental.\n\nBut maybe it's just me. \n\nDownvote away.",
        "upvotes": 803,
        "comments": 319,
        "media": null,
        "permalink": "/r/movies/comments/1ob91qk/finally_saw_28_years_later_and_discussions_about/"
    },
    {
        "id": "1ob8go5",
        "author": "TheWor1dsFinest",
        "title": "What do you think is Netflix’s best movie so far?",
        "content": "Got to thinking about this because I just got done watching K-pop Demon Hunters for the first time (as fantastic as everyone said). \n\nMy vote would be for The King (2019). I don’t understand how it continues to fly under the radar. 2019 was absolutely stacked with great films (Parasite, Midsommar, Little Women, Once Upon a Time in Hollywood, etc.). and this was right up there with any of them to me. The screenplay and cinematography are fantastic, the performances are great (though I think Robert Pattinson might have been a miscast), and it’s Timothee Chalamet’s best role to date in my opinion.",
        "upvotes": 691,
        "comments": 636,
        "media": null,
        "permalink": "/r/movies/comments/1ob8go5/what_do_you_think_is_netflixs_best_movie_so_far/"
    },
    {
        "id": "1oaoxy8",
        "author": "Amaruq93",
        "title": "Behind the Scenes footage from the making of \"Van Helsing\" (2004)",
        "content": "",
        "upvotes": 8201,
        "comments": 361,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/1mlqn1vtf2wf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1oaoxy8/behind_the_scenes_footage_from_the_making_of_van/"
    },
    {
        "id": "1ob40ll",
        "author": "Amaruq93",
        "title": "\"Re-Animator\" at 40 | A famously lurid horror movie turned Jeffrey Combs into a genre all-star",
        "content": "",
        "upvotes": 534,
        "comments": 44,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5GZHSefpwgjpIkyFHtqXqltpqdSWH2cjNKAf08zaMgM.jpeg?auto=webp&amp;s=c715aa68412931c2009f7672b4bdcaadaca445f4"
        },
        "permalink": "/r/movies/comments/1ob40ll/reanimator_at_40_a_famously_lurid_horror_movie/"
    },
    {
        "id": "1oaunvh",
        "author": "Slight-Response-6613",
        "title": "Romeo + Juliet (1996) absolutely rules",
        "content": "I have no idea why this movie isn’t considered a classic. It is one of the most stylistically interesting and entertaining movies I have seen a while - and I’m not just talking about Shakespeare adaptations here, I mean literally out of all movies.\n\nIt oozes phrenetic energy, swagger and sheer style in every single frame. The costumes, the sets, the lighting, the editing - you feel like watching an explosion of overconfident late 90s aura that’s injected directly into your eyeballs.\n\nAnd the acting? I’m just gonna say every single actor knew exactly what kind of film they were in and they deliver appropriately scene chewing performances. With young Leo dicaprio at the height of his twink fame, as well as Claire Danes as Juliet (who we all know has insane chops from her TV outings) - their chemistry is just fantastic. Everyone else in this movie is fantastic too (shout out to Mercurio).\n\nLike this movie might have been seen as over the top when it first came out, but I’m not gonna lie it aged like a fine wine. I feel like it is probably more in tune with pop culture nowadays than it was even in the 90s (I literally wanna wear every single outfit from this movie).\n\nNot to say it’s all just bombastic silliness - some scenes, like the balcony scene, feel genuinely sweet, and oddly ethereal. This movie has such a unique vibe (I honestly feel that euphoria was kinda inspired by it in terms of the atmosphere it manages to create).",
        "upvotes": 771,
        "comments": 185,
        "media": null,
        "permalink": "/r/movies/comments/1oaunvh/romeo_juliet_1996_absolutely_rules/"
    },
    {
        "id": "1obabwz",
        "author": "vrschikasanaa",
        "title": "What is the most well-executed and/or memorable jump scare you've ever seen in a movie/show?",
        "content": "What is the one scene that stuck with you to this day and scared the hell out of you?\n\nI think mine would probably be in Hereditary when there's a certain someone sawing away....I was already so tense from the very beginning of that scene, I remember having such a visceral reaction to even the sounds the wire was making.",
        "upvotes": 94,
        "comments": 298,
        "media": null,
        "permalink": "/r/movies/comments/1obabwz/what_is_the_most_wellexecuted_andor_memorable/"
    },
    {
        "id": "1oaxq6q",
        "author": "LiteraryBoner",
        "title": "Snake Eyes (1998, dir. Brian De Palma) Detective Santoro questions the boxer. Featuring Nicolas Cage and Stan Shaw",
        "content": "",
        "upvotes": 496,
        "comments": 44,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/o0z28m3674wf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1oaxq6q/snake_eyes_1998_dir_brian_de_palma_detective/"
    },
    {
        "id": "1oaxwpk",
        "author": "Myhole567",
        "title": "Times when an actor did Deja-Vu, where they went to the same location twice in 2 unrelated projects.",
        "content": "For example,\n\nClint Eastwood went to Alcatraz twice. The first time, he went over for a bit in 'The Enforcer' (1976). Then he was there as a prisoner for the entire movie in 'Escape From Alcatraz' (1979). \n\nAnother example,\n\nWoody Harrelson sat in the Jeopardy game show audience twice. First time was in Cheers s8 e14 (1990), where Cliff was competing on it and Woody and Norm were sitting in the audience. The second time was in 'White Men Can't Jump' (1992), where Woody's girlfriend Rosie Perez is competing, and Woody is sitting in the audience again with Wesley Snipes. It was the same host Alex Trebek both times.\n\nSo some real Deja Vu stuff.\n\nAny more like these?",
        "upvotes": 361,
        "comments": 143,
        "media": null,
        "permalink": "/r/movies/comments/1oaxwpk/times_when_an_actor_did_dejavu_where_they_went_to/"
    },
    {
        "id": "1oaxgjq",
        "author": "Miserable_Golf6542",
        "title": "Berry Gordy's 'The Last Dragon' Returns to Celebrate 40th...",
        "content": "",
        "upvotes": 240,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Iaf1G4Nd9WB7orsVEpptbNYd3cBHi-kOlMJIIre8wB8.jpeg?auto=webp&amp;s=f559f3a5d698acdf9ce7d3eef033f97c7ed1ddcb"
        },
        "permalink": "/r/movies/comments/1oaxgjq/berry_gordys_the_last_dragon_returns_to_celebrate/"
    },
    {
        "id": "1ob70je",
        "author": "WaltzGrouchy2511",
        "title": "How would you describe Ridley Scott's legacy?",
        "content": "With Scott's upcoming film, **The Dog Stars**, set to be released in theaters on March 2026, it will be the 30th film of his illustrious 49 year career, going all the way back to 1977. Ever since his directorial debut with **The Duelist**, he has directed some of the most memorable films in history. From the ambitious **Blade Runner** to the terrifying **Alien** to the Oscar-winning **Gladiator**, he has some truly great films in his belt. But ever since the Oscar-winning success of Gladiator, his filmography has been up-and-down. He has directed 18 films in 25 years since Gladiator, which is honestly really impressive, and while some have been good, others have not. **The Martian**, **Kingdom of Heaven** (director's cut), **The Last Duel**, and **Prometheus** (despite fans being divided of the movie) have been some of his best work, showing he has no intention of slowing down, even if he's reaching 90. But throughout that great work, there have been some divisive films at best and downright awful films at worst. **Exodus Gods and Kings** was a whitewashed, historically innacurate mess which fumbles its massive potential of retelling one of the most important stories in history. Same with **Napoleon**, and while it's miles better than Exodus, in terms of basically everything lol (expect accuracy, which Napoleon does a bit better, but it isn't saying much), it really didn't live up to expectations as an epic historical biopic about the French commander. And some others like **Robin Hood**, **The House of Gucci**, ect.\n\nI'm a big fan of his work, and I'm sure a lot of you guys are as well, and there will always be his critics. And the criticism he receives is valid, because every filmmaker isn't perfect. That being said, his legacy is undeniable, having redefined the sci-fi genre with Alien and Blade Runner and the attention to detail in his visual style being influential to a new generation of filmmakers who want to approach that same visual style as Scott. But what do you think? ",
        "upvotes": 63,
        "comments": 178,
        "media": null,
        "permalink": "/r/movies/comments/1ob70je/how_would_you_describe_ridley_scotts_legacy/"
    },
    {
        "id": "1ob7xtg",
        "author": "FakeRedditRedditor",
        "title": "Actors your can’t take your eyes off of",
        "content": "\nI’m watching Unlawful Entry with Ray Liotta and Kurt Russell, and I can’t take my eyes off the screen. I’ve never seen it before, but these two are just incredible. There’s a scene where Ray Liotta just stares, and I’m completely locked in — it’s magnetic.\n\nIt’s kind of like walking through a subway station and stumbling across a street musician who’s so good you stop whatever you’re doing just to listen. You can’t help it — they’re that good.\n\nWatching this made me realize how rare that kind of acting feels today. Back then, you had performers who were so captivating you couldn’t look away. Nowadays, it’s like that magic’s gone missing. There is a pedigree of performer that is missing from the American actor. \n\nCan anyone name some recent films or actors who still have that kind of power — that “you can’t look away” energy?\n",
        "upvotes": 39,
        "comments": 119,
        "media": null,
        "permalink": "/r/movies/comments/1ob7xtg/actors_your_cant_take_your_eyes_off_of/"
    },
    {
        "id": "1oabbtx",
        "author": "disablednerd",
        "title": "What’s your under 20% on Rotten Tomatoes “hear me out?”",
        "content": "I’m not talking about your Hooks or Bullet Trains, I’m looking for the hottest of hot takes. \n\nI just watched Ghost Rider: Spirit of Vengeance and I thought it was actually kind of kick ass despite the 18% on Rotten Tomatoes. Nic Cage is suitably unhinged, and the action scenes and production design are manic and over-the-top in a fun way. Directed by the people who brought the Crank movies, if you watched the behind the scenes they put their lives on the line to pull off the stunts. The story is whatever, but are you there for that or to see Ghost Rider piss fire? The only thing missing was a hard R rating but I was entertained and it didn’t overstay its welcome \n",
        "upvotes": 5073,
        "comments": 4429,
        "media": null,
        "permalink": "/r/movies/comments/1oabbtx/whats_your_under_20_on_rotten_tomatoes_hear_me_out/"
    },
    {
        "id": "1oaq6t4",
        "author": "Sabledude",
        "title": "Movies that answer the “money isn’t everything” plot the best?",
        "content": "Recently went to watch the new Keanu reeves movie Good Fortune. For me it was largely a hilarious comedy that had my theater cackling. But the big plot of the movie I can tell that by the end they did not know how to answer the “why would he give up the money” question. Even in the trailer Keanu says “I gave him money and it solved most of his problems” \n\nThen started thinking about how so many movies cannot land that answer. Another one was the movie the materialists. To make it rational to the viewers why she would choose her broke ex over the rich guy they show like 2 scenes of him being mean to her after like 10 scenes of them going to different high end restaurants having an amazing time.\n\nAny movies you guys think answer the question “money isn’t everything question” ",
        "upvotes": 196,
        "comments": 296,
        "media": null,
        "permalink": "/r/movies/comments/1oaq6t4/movies_that_answer_the_money_isnt_everything_plot/"
    },
    {
        "id": "1obaq6w",
        "author": "CosmosisJones42",
        "title": "What’s one tiny behind the scenes thing that completely changed movie history?",
        "content": "i’ve been thinking about how one tiny decision can flip movie history. like how pulp fiction only exists because tarantino’s first idea for true romance 2 got rejected, or how toy story 2 was almost deleted entirely when someone hit the wrong key, and a backup on one animator’s home computer literally saved it.\n\nstar wars almost fell apart when fox slashed the budget and rushed the schedule, but all those limitations ended up forcing lucas to get creative with models and editing, which gave it that rough, lived-in feel everyone loved. and titanic nearly got shut down halfway through filming because of cost overruns, but cameron gambled everything and pushed through, and it became the biggest movie ever.\n\nit’s wild how much of film history just comes down to luck, chaos, or someone refusing to quit. what’s your favorite little behind-the-scenes thing that ended up changing everything?",
        "upvotes": 13,
        "comments": 62,
        "media": null,
        "permalink": "/r/movies/comments/1obaq6w/whats_one_tiny_behind_the_scenes_thing_that/"
    },
    {
        "id": "1oabtxv",
        "author": "MarvelsGrantMan136",
        "title": "Simu Liu Reveals a Draft of the Script for the ‘Sleeping Dogs’ Movie is Finished",
        "content": "",
        "upvotes": 1639,
        "comments": 155,
        "media": null,
        "permalink": "/r/movies/comments/1oabtxv/simu_liu_reveals_a_draft_of_the_script_for_the/"
    },
    {
        "id": "1oav9pa",
        "author": "SarcasticOptimist",
        "title": "Steve Eisman (who was played by Steve Carrell) discussing The Big Short",
        "content": "",
        "upvotes": 72,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gJ2lO9TO-H3wHVMZjqN2CR6BFxB3-NtZzFcAwqT8cHs.jpeg?auto=webp&amp;s=30ed1de24bbf9fcebf8dea268c0ee7c399d12544"
        },
        "permalink": "/r/movies/comments/1oav9pa/steve_eisman_who_was_played_by_steve_carrell/"
    },
    {
        "id": "1oa7h3i",
        "author": "SanderSo47",
        "title": "Little Miss Sunshine (2006, dir. Jonathan Dayton &amp; Valerie Faris) – Dwayne's breakdown.",
        "content": "",
        "upvotes": 2758,
        "comments": 220,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/78xntjgrqxvf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1oa7h3i/little_miss_sunshine_2006_dir_jonathan_dayton/"
    },
    {
        "id": "1oawu84",
        "author": "Roasted_Newbest_Proe",
        "title": "Best product placement in movies?",
        "content": "Watching Back to the Future for the nth time, and I hadn't noticed the amount of product placement there is, just the way it's so natural. Toyota, Texaco, Pepsi, Adidas, and more. And it got me thinking, what other movies have this type of well-done product placement?\n\nThere's of course Wayne's World, which is the blueprint for comedy product placemente. Kingsman also does agreat job with it\n\nWhat are your opinions on it?",
        "upvotes": 55,
        "comments": 249,
        "media": null,
        "permalink": "/r/movies/comments/1oawu84/best_product_placement_in_movies/"
    },
    {
        "id": "1oam269",
        "author": "LaserDiscCurious",
        "title": "A.I Artificial Intelligence (2001): Was the mother (Frances O'Connor) the biggest villain in the movie?",
        "content": "I know the movie is set up like this moving story about a android  boy looking for the mother he lost after he was abandoned but the whole narrative was based on a lie. \n\nThe reality is David was used by two grieving parents whose own son was in a coma and when the son revived, David became of no use to them. \n\nWhat pissed me off the most was the mother, Monica (Frances O'Connor). She purposefully made David into a self-aware sentient being instead of the dutiful robot he was which then led him to become attached to her. And then, when her son revived and the brat started bullying David and then causing him to \"misbehave\", the dad was quick to decide in deactivating David. \n\nI'm of the belief David should have been deactivated all along. It was of no use to keep David \"alive\". For what? So he could spend years and years by himself, looking for a mother who never really loved him. Oh sure, she cared enough about David to not have him go to the factory but it was her conscience because she knew it was her own fault, not because she loved this android boy. \n\nIt's such a sad, tragic movie. I felt bad for David but it was a hopeless endeavor. The dream of him playing with Monica comforted him but it was all for nothing. \n\nThe brat human son had the family David never had.",
        "upvotes": 196,
        "comments": 89,
        "media": null,
        "permalink": "/r/movies/comments/1oam269/ai_artificial_intelligence_2001_was_the_mother/"
    },
    {
        "id": "1ob1ozn",
        "author": "TheHowlingMan20",
        "title": "The Old Dark House (1932): James Whale’s Hidden Classic",
        "content": "",
        "upvotes": 17,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cA1dldlrqEQp1A8bL4-Ev5HkEG6-j6nwaq-hPyXERXc.jpeg?auto=webp&amp;s=9222d7dbf4e0ab2cdc83fc90142cda8508c058f0"
        },
        "permalink": "/r/movies/comments/1ob1ozn/the_old_dark_house_1932_james_whales_hidden/"
    },
    {
        "id": "1o9s9mi",
        "author": "EuphoricButterflyy",
        "title": "New IMAX poster of Frankenstein",
        "content": "",
        "upvotes": 13243,
        "comments": 405,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vz55mdlkkuvf1.jpeg?auto=webp&amp;s=b49838691df8664ea754bbf6e729667e2df6083e"
        },
        "permalink": "/r/movies/comments/1o9s9mi/new_imax_poster_of_frankenstein/"
    },
    {
        "id": "1oan3hn",
        "author": "AporiaParadox",
        "title": "Abbott and Costello Meet Frankenstein, and how old comedies differ from newer ones",
        "content": "So I recently watched Abbott and Costello Meet Frankenstein for the first time as part of a Universal Monster movie watch party, and was surprised that it wasn't what I expected. I expected a spoof that made a bunch of jokes at the monsters' expense similar to modern horror comedy movies, instead I noticed that the scenes with the monsters were all treated seriously and played completely straight like they were from any of the previous Universal Monster movies. Only Abbott and Costello's scenes had any comedy, if they weren't on screen there were no jokes, and even when they were on screen, the monsters and other characters were still meant to be serious and/or scary. \n\nThis got me thinking, I admittedly haven't seen that many old comedy movies, but most of the ones I've seen (especially Marx Brothers movies) are similar in that regard. They feel like most of the characters are acting like they're in a normal movie, but then these comedic actors come in and make a lot of jokes. Basically, it seems to me that what sets apart old comedy movies to modern comedy movies, is that in older comedies only a few characters were meant to be funny, while in modern comedies everyone is meant to be funny.\n\nWhy were older comedies like this? What changed? When did this change happen? Or am I completely wrong and making assumptions and the old comedies I've seen aren't representative of everything?",
        "upvotes": 95,
        "comments": 53,
        "media": null,
        "permalink": "/r/movies/comments/1oan3hn/abbott_and_costello_meet_frankenstein_and_how_old/"
    },
    {
        "id": "1ob8s23",
        "author": "johntynes",
        "title": "1999: My Year in Movies",
        "content": "So I’ve heard for years, and agreed, that 1999 was an amazing year for movies.\n\nWell, back in 1999 I kept track of every film I watched, both new and old, and wrote capsule reviews of them like the old Leonard Maltin Movie Guide that I obsessed over as a kid.\n\nI saw 161 movies that year because that was how I rolled back then. I think it’s fun to look at this old article from my very old website, and I thought anyone interested in that landmark year of film might enjoy it too.\n\nDid I miss any legends?\n\nhttps://johntynes.com/revland2000/rl_161in1999.html\n\np.s. please enjoy my circa 2000 edgelord website design which is still live and working because it’s nothing but static HTML files.",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1ob8s23/1999_my_year_in_movies/"
    },
    {
        "id": "1oaj7d4",
        "author": "EuphoricButterflyy",
        "title": "Which movie did you see way too young?",
        "content": "I was allowed to watch horror films and slasher films at a pretty young age. When I was 12 I watched American Pie at a friends house. I also watched American Psycho at 13. That same year I watched Boogie Nights at a friends house. \n\nWhen I was 9 I was at a friends house and his mom let us watch Showgirls. Yes, that Showgirls. I’m now wondering what was up with that. ",
        "upvotes": 157,
        "comments": 824,
        "media": null,
        "permalink": "/r/movies/comments/1oaj7d4/which_movie_did_you_see_way_too_young/"
    },
    {
        "id": "1oaaba0",
        "author": "modooff",
        "title": "Lilo &amp; Stitch's deleted scene: \"The untimely death of Pudge the fish\"",
        "content": "",
        "upvotes": 679,
        "comments": 63,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/wqvwtc0qcyvf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1oaaba0/lilo_stitchs_deleted_scene_the_untimely_death_of/"
    },
    {
        "id": "1oa0fhw",
        "author": "Neo2199",
        "title": "Michael Mann Says 'Heat 2' Will Likely Use AI for Aging and De-Aging: He also confirmed the movie will be released theatrically, in the United States, in about 4,000 cinemas",
        "content": "",
        "upvotes": 2112,
        "comments": 539,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/e9-T_XcXxTPBcInNqgviHMrT7BU0Opb48V597qrCLJY.jpeg?auto=webp&amp;s=81f90f1cb56a9397d2a69bf484e43c3088d7e4c3"
        },
        "permalink": "/r/movies/comments/1oa0fhw/michael_mann_says_heat_2_will_likely_use_ai_for/"
    },
    {
        "id": "1obcdfa",
        "author": "Dog-LoverAlways",
        "title": "Ordinary People",
        "content": "Ordinary People is my favorite movie. Directed by Robert Redford, it swept the Academy awards! Starring Donald Sutherland, Mary Tyler Moore, Timothy Hutton and Judd Hirsch. It’s amazing!\n\nTimothy Hutton won an Oscar for his performance. Robert Redford won an Oscar for Best Director. Mary Tyler Moore won an Oscar too.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/movies/comments/1obcdfa/ordinary_people/"
    },
    {
        "id": "1obefud",
        "author": "SavageMell",
        "title": "Best 0% Movie?",
        "content": "Obviously going off RT but other metrics are welcome. \n\nI only learned today Death Wish V currently sits at 0. To me this is hilarious as I literally consider hundreds of movies worse. It's forgettable and by a margin the worst in the franchise but 0 is a whole other level. \n\nHowever it only has 7 reviews and all films listed on Wikipedia have 20 as the baseline. That makes sense as it gives more credence to universal derision. \n\nBut for this discussion I would use 5 reviews as a minimum. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/movies/comments/1obefud/best_0_movie/"
    },
    {
        "id": "1oafblr",
        "author": "BunyipPouch",
        "title": "Dr. Jane Goodall-Narrated Short Film ‘anyone lived in a pretty how town’ To Debut At SCAD Savannah Film Festival",
        "content": "",
        "upvotes": 192,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NgsCIQDiLpoMM3ddw5mN73GObYjtpe_rZb6aD-n3Q8w.jpeg?auto=webp&amp;s=e22335881f5ccc343535c1f9adb3eb60e6d61bf5"
        },
        "permalink": "/r/movies/comments/1oafblr/dr_jane_goodallnarrated_short_film_anyone_lived/"
    }
]