[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 6,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1np87wo",
        "author": "ImpressionOk8195",
        "title": "ennesimo post dell'ennesima persona che non ha conoscenze a torino, qualcuno che abbai voglia di far qualcosa venerdi o sabato sera? aperitivo ignorante?",
        "content": "m31  \nappassionato di musica in generale techno, metal, punk sopratutto  \n\n\n",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1np87wo/ennesimo_post_dellennesima_persona_che_non_ha/"
    },
    {
        "id": "1npc8wj",
        "author": "redproteico",
        "title": "Pub aperti fino a tardi",
        "content": "Amici torinesi come da titolo volevo sapere se aveste posti carini da condividere in zona S.paolo/cenisia/Parella aperto fino a tardi, magari un posto dove vedere partite nel fine settimana e bere qualche birra in compagnia 🍻 grazie in anticipo per i consiglii",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1npc8wj/pub_aperti_fino_a_tardi/"
    },
    {
        "id": "1npbtqu",
        "author": "GuardGreat2724",
        "title": "Hackathon a Torino dal 17 al 19 ottobre!",
        "content": "Ciao a tutti, se siete degli appassionati di spazio, a breve ci sarà l'EUDIS Hackathon, 17-19 ottobre, con premi fino a €2500, sia in presenza (Torino) che online. L'iniziativa è promossa dalla Commissione Europea e organizzata dalla Fondazione dell'Agenzia Spaziale Italiana. Qui le info: [https://taikai.network/en/eudisITALY/hackathons/italy](https://taikai.network/en/eudisITALY/hackathons/italy)",
        "upvotes": 2,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VSIYLU_iO8BCcTzy0Jsb7JQ2a1oQogtFkKYd9OlG6js.jpeg?auto=webp&amp;s=f445c216100cdff871c1c4dac52d8d01734eb063"
        },
        "permalink": "/r/torino/comments/1npbtqu/hackathon_a_torino_dal_17_al_19_ottobre/"
    },
    {
        "id": "1nphkqo",
        "author": "toradol_",
        "title": "Sgombero divano",
        "content": "Buonasera a tutti,\n\nDovrei necessariamente sbarazzarmi di un vecchio divano che ho nel mio appartamento (al quarto piano senza ascensore, ahimè) entro venerdì 3 p.v., giornata di consegna del letto che lo dovrebbe sostituire. Il negozio non effettua il ritiro dell'usato, pertanto chiedo se conoscete qualcuno che effettua un servizio di sgombero. Abito in circoscrizione 7.\n\nRingrazio fin d'ora per le Vostre risposte. Un saluto.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nphkqo/sgombero_divano/"
    },
    {
        "id": "1np9pfu",
        "author": "Fine_Increase_5758",
        "title": "University Of Torino Enrolment",
        "content": "EU equated Prospective Applicant to Economics and Finance with Data Science from UniTo\nAlmost lost the seat of another university because I couldn't upload CIMEA docs because of tight deadlines\n\nBut found this on the UniTo website\n\"If you have correctly followed the enrolment procedure within the given deadlines but you are not yet in possession of some documents required for the enrolment (e.g. apostile/legalization, final diploma..), you will have time until January 16 to provide them to us and pay the first instalment.\nTherefore, if you are a non-EU citizen residing abroad, you have followed all steps within the deadlines, but you cannot arrive in Italy by October 20, you will have time until January 16, 2026 to arrive in Turin, submit the residence permit request, visa, tax code and pay the first instalment to complete the enrolment.\"\n\nThis felt like God sent\n\nAnybody struggling with my situation waiting for cimea docs",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1np9pfu/university_of_torino_enrolment/"
    },
    {
        "id": "1npcj73",
        "author": "Flashy-Ostrich-8673",
        "title": "Visiting Torino in a month - how cold will it be??",
        "content": "I'm coming to Torino at the end of October / start of November for C2C and just wondering how cold it will be in the city - I've googled but got mixed answers! I just want to know what to pack :)",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1npcj73/visiting_torino_in_a_month_how_cold_will_it_be/"
    },
    {
        "id": "1npc12m",
        "author": "Appropriate-Net-6030",
        "title": "Affitto disperato",
        "content": "Ciao a tutti, io e mio fratello siamo studenti universitari e dobbiamo iniziare a cercare una doppia in affitto zona San salvario (o comunque non a più di 30 m a piedi dalla zona universitaria). Siamo attualmente in una situazione difficile quindi volevo chiedervi da dove iniziare, agenzia o privato? A cosa stare attenti quando si va a vedere un appartamento? Ogni consiglio che dareste a vostro figlio se vi chiedessero stessa cosa, grazie budget 500±100 ",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1npc12m/affitto_disperato/"
    },
    {
        "id": "1np7lki",
        "author": "davivesp",
        "title": "Auito per salire mobile in appartamento",
        "content": "Ciao a tutti, sto aspettando che mi venga consegnato un mobile e avrei bisogno di una mano per salirlo fino al quinto piano di un palazzo senza ascensore (borgo vittoria).  \nIl pacco misura 160x175x45 e pesa circa 50kg, ogni mezzo piano ci sono dei pianerottoli dove poter fare una breve sosta.  \nDOVREBBE arrivarmi sabato 27, non so ancora a che ora.  \nPer salirlo saremo in due, il problema non è tanto il peso ma il fatto che è molto ingombrante, facendo un pò di attenzione per le scale dovrebbe passare.\n\nC'è qualcuno che abbia voglia di darmi una mano previo compenso economico?",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1np7lki/auito_per_salire_mobile_in_appartamento/"
    },
    {
        "id": "1np49pj",
        "author": "NotANpc_271k",
        "title": "Thrifting di vestiti?",
        "content": "Non riesco a trovare questi tipi di negozi di vestiti. Qualcuno ne conosce uno?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1np49pj/thrifting_di_vestiti/"
    },
    {
        "id": "1noqje6",
        "author": "ScholarRepulsive1030",
        "title": "Domenica 28",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3h4cjr22syqf1.jpeg?auto=webp&amp;s=734561f2ded45bd39ae875643f5df491c102e11a"
        },
        "permalink": "/r/torino/comments/1noqje6/domenica_28/"
    },
    {
        "id": "1nokd8t",
        "author": "Hot_Score3868",
        "title": "Cos'è il Balon?",
        "content": "Salve, voglio visitare per la prima volta Torino e qui ho visto dei post parlare del Balon. Ma cos'è? Un posto interessante?",
        "upvotes": 4,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1nokd8t/cosè_il_balon/"
    },
    {
        "id": "1no8nef",
        "author": "NervousDependent177",
        "title": "Dolce casa di Torino corso vittorio 260 euro per nulla!!!",
        "content": "Si tratta di una vera truffa paghi per non avere nulla .non cascateci",
        "upvotes": 25,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1no8nef/dolce_casa_di_torino_corso_vittorio_260_euro_per/"
    },
    {
        "id": "1noobat",
        "author": "Regular-Type843",
        "title": "Vivere nei dintorni di Torino",
        "content": "Ragazzi ho bisogno di aiuto! Sto valutando il trasferimento per lavoro a Torino e dintorni, il problema è che vorrei trovare un posto che abbia caratteristiche simili a quello da dove vengo . Sto a 30 minuti da Roma e dal mare, un'ora e mezza dalla montagna e 10 minuti dai laghi, ed è pieno di paesini abbastanza vivaci, boschi e colline. Qualche consiglio? Grazie!",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1noobat/vivere_nei_dintorni_di_torino/"
    },
    {
        "id": "1nofwfn",
        "author": "Professional_Law28",
        "title": "Stampa 3d al dettaglio?",
        "content": "Conoscete una tipografia o uno studio che si occupa parzialmente o interamente di stampa 3d al dettaglio? O magari siete voi degli stampatori 3d? Esistono dei servizi online affidabili? Ho provato fiverr e altri servizi simili ma la maggior parte ti fa anche il design, cosa di cui non ho bisogno, che gonfia un botto il prezzo. Devo stampare in linea di massima solo 4-5 master per dei dadi. Grazie a tutti per l'aiuto. ",
        "upvotes": 6,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1nofwfn/stampa_3d_al_dettaglio/"
    },
    {
        "id": "1nod6fm",
        "author": "Charming_Egg_5299",
        "title": "Consigli ristorante proposta matrimonio",
        "content": "Questa settimana vorrei fare la proposta alla mia ragazza e sto cercando un ristorante a Torino o zone limitrofe con una bella atmosfera/vista e buon cibo. Insomma, qualcosa che lasci un bel ricordo. Qualcuno ha consigli? ",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1nod6fm/consigli_ristorante_proposta_matrimonio/"
    },
    {
        "id": "1noh3e4",
        "author": "FelipeMestre",
        "title": "Trip to Turim",
        "content": "Hi,  \nMy name is Felipe and I’ll be visiting Turin in February 2026 on my first trip to Europe.  \nIt’s a business trip, but I’ll have plenty of time for leisure, so I’m hoping to experience some of the local cuisine, attractions, and the everyday things people who live there actually do — not just the overpriced tourist stuff.  \n\nIf you have any recommendations for parties, restaurants, cafés, museums, shops, etc., they would be greatly appreciated!",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1noh3e4/trip_to_turim/"
    },
    {
        "id": "1nodcy5",
        "author": "Ibrahimt51",
        "title": "Cheapest place to buy from",
        "content": "Hey, I am a student and I should arrive in Turin next week, as most students I'm on a budget and I would like to know the cheapest places to get food and all different groceries from, preferably from stores near Porta Nuova/San Salvario area, thank you! ",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1nodcy5/cheapest_place_to_buy_from/"
    },
    {
        "id": "1no5tzf",
        "author": "Phanetis",
        "title": "Casa Mirafiori nord, lezioni Palazzo Nuovo",
        "content": "Ho preso una stanza in zona Mirafiori nord, ma ho lezione a Palazzo Nuovo. Scelta poco avveduta data la distanza, ma dopo settimane di ricerca ho colto la prima occasione che sembrava finalmente concretarsi, perché sfinita dalle inconcludenti situazioni in cui mi sono trovata ormai innumerevoli volte. \nOra, quale sarebbe il modo più semplice e veloce per raggiungere l’università dalla mia zona (restringo il campo: dalle parti di Piazza Pitagora)? \nOgni aiuto è apprezzato, grazie!! ",
        "upvotes": 4,
        "comments": 40,
        "media": null,
        "permalink": "/r/torino/comments/1no5tzf/casa_mirafiori_nord_lezioni_palazzo_nuovo/"
    },
    {
        "id": "1nnxsms",
        "author": "fede2409",
        "title": "Cerco opportunità per conoscere nuove persone a Torino",
        "content": "Ciao,\nAbito a Torino da 35 anni e negli ultimi 4 anni ho viaggiato assiduamente per l'Europa per cui ho perso molti contatti a Torino e molte amicizie si sono trasferite all'estero nel frattempo.\nContinuo a viaggiare spesso e trovo particolarmente difficile conoscere nuove persone in questa città.\nConoscete eventi/serate/gruppi/siti dove fare nuove conoscenze (no intendo tinder, o siti di incontri)?\n\nGrazie!\n",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nnxsms/cerco_opportunità_per_conoscere_nuove_persone_a/"
    },
    {
        "id": "1noaa90",
        "author": "ImpressedGuy95",
        "title": "Corsi Scuola Holden",
        "content": "Ciao! Qualcuno di voi potrebbe darmi dei pareri sui corsi della Scuola Holden? In.modo particolare un corso di sue giorni intitolato \"Meditazione e creatività, Mente, corpo, cuore.\"\n\nHo sentito molti parrei contrastanti e vorrei capire se qualcuno che ha avuto esperienza con questo tipo di corsi saprebbe dirmi se è interessante o un corso fuffa.  \n",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1noaa90/corsi_scuola_holden/"
    },
    {
        "id": "1no8qkg",
        "author": "Pretend_Steak_4210",
        "title": "Accomodation Near ESCP Turin",
        "content": "Hi , I am from India and i will be visiting Turin for Spring semester next Year. Can Someone tell me good places near ESCP turin for accomodation costing about 400-500 Euro. Also How can i Book these apartments( I dont have card to make payments in Euro right now)",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1no8qkg/accomodation_near_escp_turin/"
    },
    {
        "id": "1nnqgnz",
        "author": "_L_-",
        "title": "La metro sta scioperando?",
        "content": "La metro sta scioperando? C'è ancora bordello in giro? Tra poco dovrei attraversare Torino e volevo capire la situazione ",
        "upvotes": 11,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1nnqgnz/la_metro_sta_scioperando/"
    },
    {
        "id": "1nnj8fm",
        "author": "SamSamuele",
        "title": "Gli affitti per studenti hanno rotto il cazzo",
        "content": "",
        "upvotes": 21,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1nnj8fm/gli_affitti_per_studenti_hanno_rotto_il_cazzo/"
    },
    {
        "id": "1nnnyeu",
        "author": "Murky_Giraffe8700",
        "title": "Non esiste un'app per segnalare i veicoli che commettono infrazioni?",
        "content": "Da dove vengo io, abbiamo un'applicazione che permette di scattare una foto di un'auto e inviarla alle autorità competenti affinché intervengano.\n\nEsiste qualcosa di simile qui?   \n  \nSe non esistesse, inizierò a crearlo",
        "upvotes": 9,
        "comments": 77,
        "media": null,
        "permalink": "/r/torino/comments/1nnnyeu/non_esiste_unapp_per_segnalare_i_veicoli_che/"
    },
    {
        "id": "1no29ps",
        "author": "glorious-ahole",
        "title": "Do they allow you to cycle on old lingotto factory?",
        "content": "Hey guys, i am new to turin and I'm very much into cycling. So i was looking for some places where they only allow cycles. No pedestrians or cars. I found they have opened the old fiat lingotto factory's racecourse to people. So i was wondering if they allow you to cycle there",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1no29ps/do_they_allow_you_to_cycle_on_old_lingotto_factory/"
    },
    {
        "id": "1nnherx",
        "author": "Subject-Store-1982",
        "title": "Vorrei trasferirmi in una città più grande",
        "content": "Ciao sono un ragazzo di 20 anni e abito in un piccolo paese in provincia di Bergamo e vorrei trasferirmi in una città più grande, \nPer avere più opportunità lavorative, di svago e servizi ma comunque stare in una città dove senza fare troppa strada posso raggiungere la montagna o comunque posti in mezzo alla natura dato che ogni tanto mi piace stare in mezzo a verde.\nVoi cosa mi consigliate? Dove abitate e consigliereste la vostra città?\nScrivetemi i vari pro e contro della vostra città\n(Ovviamente se abitate in una città grande ) \nMilano la scarto a prescindere perché troppo costosa e non me la potrei permettere, volevo anche evitare Bergamo città perché volevo spostarmi un po' dalla mia zona, e stavo pensando a Torino.\nSento tanta gente che ne parla e tanta che ne parla male soprattutto sento chiunque dire che Torino è bella ma  la gente che ci vive non lo è, e non so se è così in tutta l'Italia o solo li.\nDatemi per favore la vostra opinione ed esperienza.\nGrazie mille ",
        "upvotes": 14,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1nnherx/vorrei_trasferirmi_in_una_città_più_grande/"
    },
    {
        "id": "1nnkvxt",
        "author": "Omyrr",
        "title": "Need a lawyer",
        "content": "Hello everyone, I am an international student in Torino and I need a lawyer for both commercial and civil cases. Do anyone of you know a lawyer who help students with very affordable prices or a hardcore leftist who won’t charge a penny for racist issues. ",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nnkvxt/need_a_lawyer/"
    },
    {
        "id": "1nnygek",
        "author": "Cultural_Raisin_260",
        "title": "Dj neofiti/emergenti o anche esperti di torino. aiuto!!!!",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nnygek/dj_neofitiemergenti_o_anche_esperti_di_torino/"
    },
    {
        "id": "1nnx6my",
        "author": "No-Disaster-2966",
        "title": "Valutazione collana di corallo",
        "content": "Ciao a tutti!\nHo una vecchia e grossa collana di corallo antica e vorrei farla valutare. Ha la chiusura d'oro 18 carati ed è abbastanza antica. Conoscete qualche negozio di Torino che tratta questo genere di articoli? \nGrazieee",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1nnx6my/valutazione_collana_di_corallo/"
    },
    {
        "id": "1nmxx01",
        "author": "Murky_Giraffe8700",
        "title": "Violenza al Balon",
        "content": "Oggi al Balon (3PM) ho vissuto una situazione assurda e frustrante. \n\nUn uomo nordafricano, completamente ubriaco, ci ha urlato contro solo perché stavamo passando, cercando persino di spingerci e colpirci.\n\nIn più, poco distante, due ragazzi marocchini gridavano alle donne che entravano al Balon dalla parte di Barriera.\n\nMa dove sono la polizia o comunque delle misure di sicurezza che possano garantire un minimo di tranquillità?\n\nÈ inaccettabile che scene del genere siano ormai “normali” per tutti\n\nNon riesco a immaginare di essere donna e passare davanti di qui sola da notte",
        "upvotes": 111,
        "comments": 181,
        "media": null,
        "permalink": "/r/torino/comments/1nmxx01/violenza_al_balon/"
    }
]