[
    {
        "id": "1kvqnp4",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 21,
        "comments": 1924,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kvqnp4/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1kxn2ak",
        "author": "IcefoxX5",
        "title": "[Match Thread] Real Madrid Juvenil 'A' - Valencia CF Juvenil 'A' | Copa de Campeones, Final Four, Semi-Final",
        "content": "#FT: JUVENIL A 1:2 VALENCIA\n\n&amp;#x200B;\n\n#COPA DE CAMPEONES\n\n&amp;#x200B;\n\n**Scorers/replays:**\n\n0:1 Aimar Blázquez (p) 55'\n\n1:1 Jaime Barroso (p) 84'\n\n1:2 David Otorbi 90'+5\n\n&amp;#x200B;\n\n**match updates:** \n\n1' - kickoff, vamos! \n\n16' - Fortea is through on goal after a long ball, gets pulled to the floor with force by the Valencia player, red card, yellow at the minimum, the referee doesn't even give a foul however... \n\n40' - Our boys are pushing hard for the opener now, the Valencia keeper can first save a rebound by Pitarch after a cross from the left, then he makes a good save on a shot from distance by Roberto Martín\n\n44' - Yáñez shot from the edge of the box is saved easily by the Valencia keeper, then moments later, on the other side of the pitch, Javi Navarro can save a one on one with the Valencia attacker to prevent their lead\n\nHT - 0:0 after an even first half with both teams having had chances to potentially take the lead. Juvenil A started gaining more control as the half went on, and Valencia could or should've already received a red card \n\n46' - 2nd half underway\n\n49' - biggest chance for Juvenil A so far after Cestero puts through Yáñez, but the goalkeeper makes a great save to deny his shot into the bottom left corner\n\n53' - penalty for Valencia, Liberto was holding on to the Valencia players shirt, but another Valencia player had already shot the ball way out of bounds - another very controversial call... \n\n⚽ 55' - Blázquez steps up and converts... \n\n🔄 58' - Barroso for Rivera \n\n60' - the team has been extremely dominant in this second half so far, with multiple situations of chaos in Valencias box, where our boys missed the chance to finish the situation off\n\n🔄 80' - Pol Durán for Liberto \n\n83' - penalty for Juvenil A after Cestero is pulled in the box - unlike the penalty Valencia got, the cross was actually headed for our player\n\n⚽ 84' - GOLLLLLL DEL JUVENIL A - Barroso converts! \n\n⚽ 90'+5 - Otorbi scores for Valencia - how can you defend like that in added time? Fortea is nowhere to be seen as Valencia attack over the left side - Lamini can clear, but the ball gets cleared out to the left again - Lezcano has to step out because Fortea is still gone, the cross comes in, Navarro can't catch it and Aguado is left against two opponents at the far post, where Otorbi nods it into the net\n\nFT - Arbeloa's career as Juvenil A's coach ends with the textbook template of the Juvenil A matches of the past years, superior, dominant, countless opportunities to win the match, and in the end we get scored on with their first chance in the entire half due  to laziness and naivety tracking back - Valencia go to the final against Betis or Deportivo, and all in all, it was a pretty disappointing season for Juvenil A \n\n&amp;#x200B;\n\n**Kickoff:** 20:00 CET\n\n**Venue:** Estadio Municipal de Toralín, Ponferrada\n\n**Referee:** Alexandre López Vila\n\n**Competition:** Copa de Campeones, Final Four, Semi-Final\n\n**Viewing options:** [YouTube RFEF](https://www.youtube.com/live/I-5RxqVfWAs?si=xSflicQju-Rq20bh), [RMTV/RM PLAY](https://play.realmadrid.com/home)\n\n&amp;#x200B;\n\n**Juvenil A XI (4-3-3):** Javi Navarro - Diego Aguado, Lamini Fati, Álvaro Lezcano, Jesús Fortea - Jorge Cestero, Thiago Pitarch, Roberto Martín - Liberto Navascués (80' Pol Durán), Pol Rivera (58' Jaime Barroso), Dani Yáñez\n\nBench: Álvaro González (GK), Diego Arroyo (GK), Roi Torres, Óscar Mesa, Mario Rivas, Izan Regueira, Marco Company, Pablo Montero, Aimar Santiago. \n\nCoach: Álvaro Arbeloa\n",
        "upvotes": 13,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1pUHgBhUvgDgRTblvLytGIDVh6PCXcgPYiJEknj5EBg.jpg?auto=webp&amp;s=07b1baadbe60f745523844164290ef4584fe6df3"
        },
        "permalink": "/r/realmadrid/comments/1kxn2ak/match_thread_real_madrid_juvenil_a_valencia_cf/"
    },
    {
        "id": "1kyanzv",
        "author": "TimothyX7",
        "title": "Real Madrid closes the deals for Alvaro Carreras and Trent Alexander Arnold. When all the paperwork is signed, their signings will be announced shortly.",
        "content": "",
        "upvotes": 491,
        "comments": 53,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hKt6VhsTDzVAV-fsPoCHgCdCD24aK7f_kzThDM7_KkY.jpg?auto=webp&amp;s=41d051cf1c32b80ecf3f284f36744fbdd72ee107"
        },
        "permalink": "/r/realmadrid/comments/1kyanzv/real_madrid_closes_the_deals_for_alvaro_carreras/"
    },
    {
        "id": "1kyc088",
        "author": "Main_Rhubarb_3592",
        "title": "WILL MISS U THREPEAT GOATQUEZ 🥲🥲",
        "content": "",
        "upvotes": 141,
        "comments": 11,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/5u0e2tyncq3f1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kyc088/will_miss_u_threpeat_goatquez/"
    },
    {
        "id": "1kyblj0",
        "author": "ranger_ronaldo",
        "title": "Ronaldo and Real Madrid devided my heart",
        "content": "I have a genuine question there are rumors that Ronaldo might join Al Hilal before the CWC and our opening game is against Al Hilal, whom you support I know the club is always bigger than any player and I’ve been a Real Madrid fan for years but if we end up beating Al Hilal it would genuinely break my heart to see Ronaldo lose, call me a fake fan or whatever but \"love has no amount\" I love both Ronaldo and Real Madrid and watching him lose against us would be one of the hardest moments of my life\n\nplease make it easy for me and don't be too harsh I honestly posted what I feels may he it looks childish  but this is what I feels\n\nAgain don't be harsh in comments 😭🙏",
        "upvotes": 138,
        "comments": 22,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kyblj0/ronaldo_and_real_madrid_devided_my_heart/"
    },
    {
        "id": "1ky8zbg",
        "author": "94Temimi",
        "title": "[Ramón Álvarez] The signing of Carreras is now pending a medical examination.",
        "content": "",
        "upvotes": 159,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pv_lppF4dJK0GUTrXG2ycN3pLzk4bmS3x51E3Z0T1eY.jpg?auto=webp&amp;s=2f0c2653a4d1d53317cfca066e91801060183274"
        },
        "permalink": "/r/realmadrid/comments/1ky8zbg/ramón_álvarez_the_signing_of_carreras_is_now/"
    },
    {
        "id": "1ky9asp",
        "author": "SDTRRDTS",
        "title": "Xabi Alonso era must take at least 5 years.",
        "content": "The man radiates with ideas and his love for a system approach to everything he does. I don’t expect titles to be honest, but it doesn’t mean I don’t have positive feelings about Xabi. Perez should let him cook, I’m very certain he will build the strongest team we’ve seen in years. We should hold in mind that Barcelona under Flick’s management will continue(mostly probably) to grow and they will became stronger too. Xabi is our weapon. There will be mistakes of course and maybe painful mistakes too. But the upcoming era has loads of potential.\nI’m very glad I don’t see any of scepticism in the sub, mostly we’re all on the same frequency about Xabi and team.\nHala Madrid.",
        "upvotes": 137,
        "comments": 79,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ky9asp/xabi_alonso_era_must_take_at_least_5_years/"
    },
    {
        "id": "1kydxah",
        "author": "RM-PM-Surveys",
        "title": "[Post Match Survey Results] Real Madrid 2-0 Real Sociedad",
        "content": "",
        "upvotes": 65,
        "comments": 3,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kydxah/post_match_survey_results_real_madrid_20_real/"
    },
    {
        "id": "1ky5w05",
        "author": "Ruben12ES",
        "title": "Real Madrid Femenino - Olga Carmona: \"Real is the club of my life and has given me everything over the last five years. I've felt at home there, and I still consider it that way. I think everyone knows I'm a Real Madrid fan, and that won't change no matter where I play\"",
        "content": "",
        "upvotes": 157,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/lr9hdrrypo3f1.jpeg?auto=webp&amp;s=e389894c73488755b23b9907318a2efd22c8a64c"
        },
        "permalink": "/r/realmadrid/comments/1ky5w05/real_madrid_femenino_olga_carmona_real_is_the/"
    },
    {
        "id": "1kxoo8m",
        "author": "ranger_ronaldo",
        "title": "THE GREATEST PERFORMANCE BY A GOALKEEPER IN A CHAMPIONS LEAGUE FINAL BY FAR",
        "content": "",
        "upvotes": 2069,
        "comments": 66,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kxoo8m/the_greatest_performance_by_a_goalkeeper_in_a/"
    },
    {
        "id": "1ky8qmm",
        "author": "Pebbledthoughts",
        "title": "Arda Güler - All 17 Goals &amp; Assists (2024/25) in 2900 minutes played",
        "content": "",
        "upvotes": 55,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Z7mKJU_WLpiviFnUM1NiJQCLUgVgRlCJy0hn0b1OjVA.jpg?auto=webp&amp;s=e336064ea9310cafed74980858863e359a6ccc3c"
        },
        "permalink": "/r/realmadrid/comments/1ky8qmm/arda_güler_all_17_goals_assists_202425_in_2900/"
    },
    {
        "id": "1kxspjh",
        "author": "Dued_Plays",
        "title": "The Spanish Dominance comes to an end.",
        "content": "Might as well kick off again with the ucl next year 😉.",
        "upvotes": 730,
        "comments": 56,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kxspjh/the_spanish_dominance_comes_to_an_end/"
    },
    {
        "id": "1kxysss",
        "author": "besourosuco3",
        "title": "Vini e Ancelloti se reencontraram hoje no Maracanã no jogo do flamengo pela libertadores da América.",
        "content": "",
        "upvotes": 303,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qw1rs3w9mm3f1.jpeg?auto=webp&amp;s=d1fb133469a5d3b3cce9d279a547b9ac28ac0e0f"
        },
        "permalink": "/r/realmadrid/comments/1kxysss/vini_e_ancelloti_se_reencontraram_hoje_no/"
    },
    {
        "id": "1ky85ca",
        "author": "Sl_PROXY",
        "title": "Real Madrid Castilla: 2024/25 Season Review",
        "content": "",
        "upvotes": 38,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/c2Abu4f3MQtqzbmJS4Sw6npHMAVh07Grc0EfH4xwCfU.jpg?auto=webp&amp;s=1448d3253095dffe691bf8158d24cdb0b920a64e"
        },
        "permalink": "/r/realmadrid/comments/1ky85ca/real_madrid_castilla_202425_season_review/"
    },
    {
        "id": "1kyblrw",
        "author": "Total_Escape_9778",
        "title": "How are so many midfielders (+more potential midfielders) gonna be managed in our squad?",
        "content": "The current real madrid team already has some of the best midfielders in the world like jude bellingham and federico valverde. We have so many more great midfielders like aurélien tchouaméni, eduardo camavinga, dani ceballos and a potential rising star in the form of arda guler. Moreover there are talks abt buying nico paz back from como (who had an incredible breakthrough season winning the best u-23 player award) plus angelo stiller who absolutely balled this season and was recommended by toni kroos himself.\n\nNow I know that lots of our discussion will depend upon xabi alonso's tactics and future signings but still I think over team we would need to be selling some of these players and some might wanna leave on their own when they don't get enough playing time (cz its impossible to give everyone the adequate playing time when we have such a start-studded squad)\n\nI think there's no doubt that bellingham, valverde and tchouameni are here to stay. Camavinga has been a bit injured due to which his form this season was poor compared to his prvs standards. Ceballos had a great few seasons but he has always been inconsistent throughout his madrid career and sadly since coming back from his injury he hasn't been the same for us like he was during his purple patch. Arda guler had limited opportunites to prove himself but he did have a great game vs barcelona.\n\nThat said we definitely need a tempo-setter and the best possible option for that wuld be angelo stiller. Arda culd be our creative midfielder under a proper coach and he has the potential as we all culd see. Imo we wuld need to get rid of ceballos sooner or later and let nico paz still develop for now (or if the board wants use him instead of arda guler cz he has actually proven himself that too while playing for a midtable team. He has 6 goals and 8 assists this season for Como). \n\nIn the next few transfer windows we wuld need to totally revamp this squad especially our defense and in that we wuld need to get rid of all the wealkings. For now if we can get carreras and stiller along with taa and huijsen it wuld be an incredible transfer window.",
        "upvotes": 14,
        "comments": 42,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kyblrw/how_are_so_many_midfielders_more_potential/"
    },
    {
        "id": "1kxo802",
        "author": "redondo-inOldTraford",
        "title": "Why Stiller would be a incredibly good addition to our squad?",
        "content": "o, there has been a bit of debate in the sub about the necessity of Stiller.\n\nWithout entering into the need for a midfielder or not (and I believe we definitely need one to go into the season calm and assured that injuries cannot derail our season), this is a good image of the qualities Angelo Stiller displays.\n\nHere are all the European under-24 midfielders, and you can check his numbers in winning duels % and successful progressive passes.\n\nAs you can see, he is elite in both categories at the same time. You can see in the photo Pedri, Camavinga, Marc Casado, and also, if you are interested, see the big lie that Gavi is.\n\nAnother player I like is Adrian Bernabe, but Stiller is much better.\n\nHere, we cannot see the comparison with Tchouameni because he is over 24, but I think this is a good display of why this player caught the eye of Alonso and Real Madrid.\n\nThe guy is elite at bringing the ball forward, and that will help us to quickly bypass the high press of Arsenal and Barça, bringing the ball to Vini and Mbappé in an advantageous position.\n\nThis guy, together with Trent, is exactly the piece we need to break those teams' high pressure that was so difficult to handle this year.",
        "upvotes": 345,
        "comments": 69,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/151wwdt4dk3f1.png?auto=webp&amp;s=96e1de705ece74bb5fab28cf2d2993ceed4d18fa"
        },
        "permalink": "/r/realmadrid/comments/1kxo802/why_stiller_would_be_a_incredibly_good_addition/"
    },
    {
        "id": "1kxdvws",
        "author": "94Temimi",
        "title": "Official: Kylian Mbappé is Real Madrid Player of the Season",
        "content": "",
        "upvotes": 1329,
        "comments": 74,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4Zi0mI0v73EJmHIlWbfMqlHxLRsIoY-o32oej3ZXmgY.jpg?auto=webp&amp;s=0891e8870e335090d2fd54d1b59c5784bb406ee8"
        },
        "permalink": "/r/realmadrid/comments/1kxdvws/official_kylian_mbappé_is_real_madrid_player_of/"
    },
    {
        "id": "1kxb2dq",
        "author": "Efficient-Growth-390",
        "title": "Fede Valverde's goal catalogue this season is insane.",
        "content": "",
        "upvotes": 1909,
        "comments": 59,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/fhe1ar6v6h3f1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kxb2dq/fede_valverdes_goal_catalogue_this_season_is/"
    },
    {
        "id": "1kxg3cv",
        "author": "94Temimi",
        "title": "[Nicolò Schira] Agreement in principle between Real Madrid and Angelo Stiller for a contract until 2030. Real Madrid are now working to reach a deal with Stuttgart. Talks in progress.",
        "content": "",
        "upvotes": 425,
        "comments": 104,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dJmNRn_lnQ2QRghXDMtph0II67TH0Cyz8UAKKAlbo7g.jpg?auto=webp&amp;s=cd6434e882795fc130d7ae5b7848f5350387bd79"
        },
        "permalink": "/r/realmadrid/comments/1kxg3cv/nicolò_schira_agreement_in_principle_between_real/"
    },
    {
        "id": "1kxers6",
        "author": "muaazmuaaz123",
        "title": "All of Kylian's Goals this season",
        "content": "",
        "upvotes": 479,
        "comments": 18,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/amc34p09ei3f1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kxers6/all_of_kylians_goals_this_season/"
    },
    {
        "id": "1kxngwd",
        "author": "Thunder_trade",
        "title": "Stats comparison between kroos , lukitha and stillar .",
        "content": "\n- Toni Kroos: (Real Madrid, 23/24)\n- Luka Modric: (Real Madrid, 24/25)\n- Angelo Stiller (Stuttgart, 24/25).\n\n—Stillar is the best option for us rn I think , he have done great in bundesliga and also kroos have  recommended him to Real Madrid . He can play those passes which we lack in the midfield .",
        "upvotes": 153,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ariacij88k3f1.jpeg?auto=webp&amp;s=730e17805add9d25f1b93c6151481d53b71ba35e"
        },
        "permalink": "/r/realmadrid/comments/1kxngwd/stats_comparison_between_kroos_lukitha_and_stillar/"
    },
    {
        "id": "1kxbvdd",
        "author": "94Temimi",
        "title": "On this day, Real Madrid won the 3rd, 11th and 14th Champions League titles",
        "content": "",
        "upvotes": 796,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7ftv2xujgh3f1.png?auto=webp&amp;s=d4227e3f45c23c977393540fe54e8023427df26b"
        },
        "permalink": "/r/realmadrid/comments/1kxbvdd/on_this_day_real_madrid_won_the_3rd_11th_and_14th/"
    },
    {
        "id": "1kx5ptv",
        "author": "WhySoWeirdUsername",
        "title": "On this day 8 years ago, Zidane won his first Champions League as Real Madrid manager. The beginning of a three-peat.",
        "content": "",
        "upvotes": 2392,
        "comments": 71,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/wy1fec1cnf3f1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kx5ptv/on_this_day_8_years_ago_zidane_won_his_first/"
    },
    {
        "id": "1kxeg1b",
        "author": "94Temimi",
        "title": "Comunicado Oficial: Arbeloa appointed as Real Madrid Castilla's manager",
        "content": "",
        "upvotes": 421,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4Zi0mI0v73EJmHIlWbfMqlHxLRsIoY-o32oej3ZXmgY.jpg?auto=webp&amp;s=0891e8870e335090d2fd54d1b59c5784bb406ee8"
        },
        "permalink": "/r/realmadrid/comments/1kxeg1b/comunicado_oficial_arbeloa_appointed_as_real/"
    },
    {
        "id": "1kxausq",
        "author": "94Temimi",
        "title": "Every goal Luka scored in La Liga",
        "content": "Bangers Galore",
        "upvotes": 827,
        "comments": 16,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/wkgkhuc44h3f1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kxausq/every_goal_luka_scored_in_la_liga/"
    },
    {
        "id": "1kxedha",
        "author": "At_Ma_Na",
        "title": "[Onefootball] Real Madrid’s interest in Bundesliga star Angelo Stiller is ‘growing’",
        "content": "",
        "upvotes": 176,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hAkA_Qj9A8nIRo-CQOXeaRjzWl0yCQjA1P_yx0TT0hA.jpg?auto=webp&amp;s=cabbc9be6a1f191236f7d0eb63935bdc890dc852"
        },
        "permalink": "/r/realmadrid/comments/1kxedha/onefootball_real_madrids_interest_in_bundesliga/"
    },
    {
        "id": "1kxnoh6",
        "author": "ManuMora98",
        "title": "[Fem - Official] Alberto Toril is no longer the coach of the team",
        "content": "",
        "upvotes": 46,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4Zi0mI0v73EJmHIlWbfMqlHxLRsIoY-o32oej3ZXmgY.jpg?auto=webp&amp;s=0891e8870e335090d2fd54d1b59c5784bb406ee8"
        },
        "permalink": "/r/realmadrid/comments/1kxnoh6/fem_official_alberto_toril_is_no_longer_the_coach/"
    },
    {
        "id": "1kxqo47",
        "author": "IcefoxX5",
        "title": "Real Madrid Juvenil 'A' [1]-1 Valencia Juvenil 'A' - Jaime Barroso penalty 84' | Copa de Campeones, Semi-Final",
        "content": "",
        "upvotes": 32,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/jqkqr3btuk3f1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kxqo47/real_madrid_juvenil_a_11_valencia_juvenil_a_jaime/"
    },
    {
        "id": "1kxmxpi",
        "author": "Miserable-Subject-87",
        "title": "Is now the right time to bring Nico Paz back from Como?",
        "content": "There’s been some talk about Nico Paz possibly returning to Madrid.\n\nPersonally I’d love to see a homegrown player in the squad, Nico has really impressed with his development. But it feels like we already have a similar profile in the team, and many of us agree that another season at Como might be the best move for his growth.\n\nThat said, with Bellingham set to miss around three months due to shoulder surgery, Nico could be a perfect solution to fill that role, but then what? \nReports from Spain suggest he’s not coming back just to sit on the bench, if he returns it’s to compete for real minutes, which is exactly why he left in the first place.\n\nNow personally, I’d still love to see us bring in Angelo Stiller to add more control and creativity in midfield, like Kroos used to provide. Or who knows, maybe Alonso will find his flow without that. \nBut let’s be honest, we’re already overloaded in that position and Ceballos probably needs to go.\n\nAll this midfield talk is stressing me out, not gonna lie, I want them all in the squad.\n\nWhat do you all think?\n• Is it worth bringing Nico back for the Club World Cup and the start of the season?\n• Do you see him getting meaningful minutes?\n• Could he even jump ahead of Güler in the pecking order?\n",
        "upvotes": 49,
        "comments": 53,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kxmxpi/is_now_the_right_time_to_bring_nico_paz_back_from/"
    },
    {
        "id": "1kx9qgw",
        "author": "cyrusmancub",
        "title": "Real Madrid have now made official club-to-club contact with Benfica for Carreras, deal could be done soon. Talks are now underway, and agreement has already been reached with the player.",
        "content": "Real Madrid have now made official club to club contact with Benfica for Álvaro Carreras, deal could be done soon!\n\nTalks are now underway. Agreement already done with the player on personal terms.\n\nExcellent relationship between Benfica and Real. -",
        "upvotes": 333,
        "comments": 51,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fyanJvYDtKZyNsP3Qzgubo7WzER7A6RRDaWo98jt5C4.jpg?auto=webp&amp;s=9384e08bea6d1ed364b83e8863b12c0d6a7e5777"
        },
        "permalink": "/r/realmadrid/comments/1kx9qgw/real_madrid_have_now_made_official_clubtoclub/"
    },
    {
        "id": "1kx9dvw",
        "author": "Pebbledthoughts",
        "title": "Real Madrid's Arda Guler features in the La LIGA TOTW for the fourth time in Six Weeks | UNTOUCHABLE",
        "content": "",
        "upvotes": 343,
        "comments": 31,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/kezlltc7ng3f1.jpeg?auto=webp&amp;s=437144b615e9098993b67544036bf9b340b9a7b6"
        },
        "permalink": "/r/realmadrid/comments/1kx9dvw/real_madrids_arda_guler_features_in_the_la_liga/"
    },
    {
        "id": "1ky2uhq",
        "author": "No-Tank6971",
        "title": "SOS BOYFRIEND BDAY GIFT",
        "content": "So my boyfriend’s birthday is coming soon and I need some gift ideas.. I already got him a video from Iker Casillas saying happy birthday to him and I want to complete that with a jersey from the time when Casillas and CR7 were together. I was planning on the one with the dragon from 14/15 or the one used when they won “La Décima” Or the one from 11/12 that has gold stripes…\n\nAny ideas?",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ky2uhq/sos_boyfriend_bday_gift/"
    }
]