[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 38,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 11,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pz3051",
        "author": "McNasty420",
        "title": "\"Emily In Paris\" goes beyond hate watching.  This show is  offensive and lazy",
        "content": "Is this what passes as a show now?  This is bad, like \"Sex and the city 2\" bad. The acting.  Jfc.  I've never felt bad for actors before.  What is the point of this?  To anger people? So basically, people just hate watch this show?  How exactly do the pitch meetings go?  \"Let's disgust people!\"",
        "upvotes": 119,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1pz3051/emily_in_paris_goes_beyond_hate_watching_this/"
    },
    {
        "id": "1pz07wg",
        "author": "No_Newspaper4989",
        "title": "Suggest a movie that will help me cry my heart out.",
        "content": "Tried searching for a movies that I can watch to cry my heart out, on chatgpt and other platforms, but could not really figure out which are actually worth watching. If you could share some good names that will help me cry, it would a huge help for me. Thanks",
        "upvotes": 32,
        "comments": 218,
        "media": null,
        "permalink": "/r/netflix/comments/1pz07wg/suggest_a_movie_that_will_help_me_cry_my_heart_out/"
    },
    {
        "id": "1pz3kur",
        "author": "ILoveSteelPanther",
        "title": "Since when has this been a thing?",
        "content": "I've just noticed that certain shows on Netflix can only be watched if you subscribe to their ad-free plan. This is in the UK so not sure if it's worldwide.\n\nIt has a padlock and says \"unavailable on advert-supported plan\"",
        "upvotes": 10,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1pz3kur/since_when_has_this_been_a_thing/"
    },
    {
        "id": "1pyfw6q",
        "author": "WillyBeShreddin",
        "title": "What about Barb?",
        "content": "This has bothered me forever. Everyone seems to be taken for a purpose. The Demigorgons even dodge some characters. When someone dies, they are mourned for episodes or even seasons. Unless you are innocently sitting on a diving board, taken to the underground, and forgotten forever. Why did they do Barb so dirty? What about Barb?",
        "upvotes": 218,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1pyfw6q/what_about_barb/"
    },
    {
        "id": "1pykvny",
        "author": "Infinite-Albatross44",
        "title": "Stephen King’s 11.22.63 coming to Netflix on January 7",
        "content": "This used to be on Tubi and Hulu  (not anymore 😒), but Netflix finally picked it up only about ten years late. Fantastic series and a total hidden gem if you’re into period pieces and time travel shows.\n\nJames Franco freaking kills this and the historical production design is really amazing. ",
        "upvotes": 55,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1pykvny/stephen_kings_112263_coming_to_netflix_on_january/"
    },
    {
        "id": "1pz4ppk",
        "author": "Greenfrog2023",
        "title": "Members Only: Palm Beach",
        "content": "What on earth..... Has anyone watched this yet? I will reserve judgement until the end (if I make it through) but first episode has me thinking these women are diabolical and gross. ",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pz4ppk/members_only_palm_beach/"
    },
    {
        "id": "1pz3k07",
        "author": "Pixxel_Wizzard",
        "title": "Stranger Things Season 5 is Exactly What I Wanted (spoiler free)",
        "content": "The plot is great, of course, but the characters developing and interacting is what makes a show or movie great for me.  I love these characters, and to see them go through their emotional journeys together is exactly what I wanted.  And the performances are fantastic.  Caleb as Lucas was amazing.  Gaten as Dustin was so good, too.  They both wrecked me.  So excited for #8, got my ticket and am anxiously waiting.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pz3k07/stranger_things_season_5_is_exactly_what_i_wanted/"
    },
    {
        "id": "1pz4kou",
        "author": "Ok-Crazy-5162",
        "title": "Can anyone help with this?",
        "content": "Ok so this new thing Netflix house the commercial shows this snail like thing that makes a weird noise until the guy takes the thing off his back what show is this from? Thanks",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pz4kou/can_anyone_help_with_this/"
    },
    {
        "id": "1pz4bvp",
        "author": "MamaMia1325",
        "title": "The Best You Can...",
        "content": "This is a really cute movie. I've been on a Kyra Sedgwick kick lately and I saw the preview for this. It didn't get GREAT reviews but I love that Kyra and Kevin are married in real life and are the 2 leads. And it's great to see Judd Hirsch in something.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pz4bvp/the_best_you_can/"
    },
    {
        "id": "1pz395f",
        "author": "masae34",
        "title": "TEN on TWO",
        "content": "I just watched MAID ep1 and got a question.  \nAlex had 18 dollars in the first place, and she told a gas station cashier \"TEN on TWO\" which I thought was meaning \"ten dollars on pump #2\".  \nBut then I saw her cash balance at the top-right corner of the screen saying 12.35, not 8.(Why did she spend only 5.65 dollars, not 10?)  \nHow does that come?? Am I missing something???",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pz395f/ten_on_two/"
    },
    {
        "id": "1pynsbu",
        "author": "Sakura_Kagayaki",
        "title": "Single papa on Netflix is one of the best series &amp; must watch",
        "content": "Just finished Single papa on Netflix. Couldn’t finish in one go. Initially it took time to strike a chord but once started, u ought to finish it. It offers alternate display of masculinity which is pleasant to watch. Manny played by Daya was a pleasant surprise. ITV is filled with female centric cringe show. But Single papa takes unique stance about how divorced man-child develop parental instinct, apply for adoption. We get overall info about Indian adoption system. It’s a must watch show for all men &amp; women. ",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pynsbu/single_papa_on_netflix_is_one_of_the_best_series/"
    },
    {
        "id": "1pxmcdo",
        "author": "akssh_art",
        "title": "“Stranger Things is just supposed to be a fun sci-fi show” cannot be an excuse for Season 5’s mediocre writing",
        "content": "There’s a part of the fandom that’s using the argument that Stranger Things is just supposed to be a fun sci-fi, with fun cast and emotions, but this does not sit right with me at all. \n\nThe show not only has taken so long to finish, but has also been (I think?) Netflix’s biggest show till date, bringing in a new Sci-Fi IP which demands quality in its storytelling given its scale. Till Season 4, I thoroughly enjoyed the lore of the universe. I felt like the sci-fi elements were the priority (if there was any) and the “fun” stuff was sort of secondary. Season 5 feels like the writers turned into a bunch of teenagers and wrote up some BS to finish the plot.\n\nThe only thing I have liked is the Upside Down being a wormhole. Apart from that, from The Crawl to The Bridge, almost all elements of the lore have insane number of loopholes. Plus, the actors have such cringe dialogues. This wasn’t the show I fell in love with.\n\nSaying “this is just supposed to be a fun sci-fi” screams of calling a superhero movie “just a fun movie” or a shonen anime “just a shonen.”\n\nThe world you build has to make sense, the rules you establish have to matter, and the way you make these stories into a reality has to be upto the mark man. \n",
        "upvotes": 1327,
        "comments": 489,
        "media": null,
        "permalink": "/r/netflix/comments/1pxmcdo/stranger_things_is_just_supposed_to_be_a_fun/"
    },
    {
        "id": "1pz14q8",
        "author": "SueaPeek",
        "title": "Anyone buy anything from the Netflix shop recently?",
        "content": "I was curious if anyone else has had any problems with the Netflix shop, because I've been trying to buy a gift card and it won't let me complete the payment. I tried everything suggested for troubleshooting, nor can I get in touch with anyone via chat, phone or email, and I had opened a customer service ticket a week ago. So yeah, just wondering about anyone else's recent experiences.\n\nI'm kind of hesitant to buy a gift card anyway if the recipient could have just as much trouble, but Netflix is such a juggernaut of a company now, the technical difficulties and radio silence seem like they'd be a fluke??? It was supposed to be part of a friend's Xmas present since they love KPDH but I'm thinking I'll need a plan B.",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1pz14q8/anyone_buy_anything_from_the_netflix_shop_recently/"
    },
    {
        "id": "1pxzsjl",
        "author": "Able_Milk521",
        "title": "Enjoying Stranger Things Season 5",
        "content": "Just countering all the hate online for the new season. It's a show. Not real life. \n\nBut like real life sometimes it's more about the journey than the destination. ",
        "upvotes": 155,
        "comments": 141,
        "media": null,
        "permalink": "/r/netflix/comments/1pxzsjl/enjoying_stranger_things_season_5/"
    },
    {
        "id": "1py8zyt",
        "author": "Mandingy",
        "title": "Recommendations Terrible",
        "content": "Why does Netflix recommend things I’ve already watched or rated? Especially things I just watched. They have a huge catalog but I feel like I only see so little for seeing the same things over and over.",
        "upvotes": 40,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1py8zyt/recommendations_terrible/"
    },
    {
        "id": "1pz2q70",
        "author": "Isoldey",
        "title": "Questions for Mr Mercedes",
        "content": "1. Could a car like that rip people in two. Seems like the physics are a little off. \n2. Is it because of ADHD that I can’t keep up with all the new characters every episode? Who is Holly?\n3. Is this a book?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pz2q70/questions_for_mr_mercedes/"
    },
    {
        "id": "1pyq7jp",
        "author": "Selection-123",
        "title": "What happens to gift card balance",
        "content": "I subscribed to a $17 plan with a $25 gift card what will happen the second month.I subscribed to a $17 plan with a $25 gift card what will happen the second month.\n\n\n\nWill they keep my account open or steal the money and close it?",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pyq7jp/what_happens_to_gift_card_balance/"
    },
    {
        "id": "1pyq12y",
        "author": "sharmarohan136",
        "title": "Series name?",
        "content": "I am trying to recognise the name of the Show from which this character is in . I probably have watched it in the past but don’t remember it. Do you which tv show is this?",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1pyq12y/series_name/"
    },
    {
        "id": "1pyvj2z",
        "author": "junveld",
        "title": "Can't watch netflix E100",
        "content": "I kinda don't understand if. I literally can't watch netflix because of the weird issues.\n\n  \nI recently registered on Netflix and have my subscription attached. Opening any title/movie/series just gives me error screens.\n\n\"Pardon the interruption This title is not available to watch instantly. Please try another title. - 1044 Error Code E100\"\n\n\"Pardon the interruption Sorry,we're having trouble with your request. Error Code UI3012\"\n\nLiterally can't watch netflix.\n\n  \n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pyvj2z/cant_watch_netflix_e100/"
    },
    {
        "id": "1pythse",
        "author": "Younessb_",
        "title": "Sudden loss of 4K on Netflix (PC / Edge / Netflix App)",
        "content": "Hello everyone,\n\nI’ll start by saying that I’m sorry if a similar topic has already been discussed; I’m not very comfortable using Reddit. I should also mention that I’m currently using ChatGPT to translate, as I’m French.\n\nMy problem can be summed up very simply: I no longer have Netflix in 4K.\n\nI’ll immediately answer the various questions you might want to ask to help solve my issue:\n\n* Yes, I do have the 4K Premium subscription;\n* Yes, I have purchased and downloaded the HEVC Codec from the Windows Store;\n* Yes, I am using Edge (more specifically, the Netflix app, which is basically Edge);\n* Yes, I have tested with Edge directly and without the app;\n* Yes, I have turned off my second monitor;\n* Yes, I have disabled NVIDIA Instant Replay.\n\nI’ve been watching my 4K-available series and movies on Netflix since 2022, and I’ve never had any issues until now. I’ve always managed to find the solution on my own whenever 4K stopped working (disabling NVIDIA Replay, turning off my second monitor, etc.). But this time, honestly, I’m stuck. I don’t understand why, all of a sudden, I no longer see 4K displayed when I press CTRL + ALT + Shift + D. It shows 1080p instead, even though I haven’t changed anything and this happened overnight.\n\nI should still point out one thing: I’m used to what 4K looks like and what 1080p looks like, and honestly… it doesn’t feel like I’m watching my movies and series in 1080p, despite what CTRL + ALT + Shift + D indicates. Maybe it says 1080p but it’s an error. Just in case, you’ll find the bitrate shown in the screenshot below.\n\n[https://prnt.sc/9f1A7PSXMvMD](https://prnt.sc/9f1A7PSXMvMD)\n\nThanks in advance for your help.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pythse/sudden_loss_of_4k_on_netflix_pc_edge_netflix_app/"
    },
    {
        "id": "1pyta7m",
        "author": "MasoX_69",
        "title": "Sean combs the reckoning",
        "content": "Well i got a question there it comes\nIn episode 3 at 35:10 a song starts to appear in the background where a guy is telling story how Diddy instruct his girl to do something can you tell me name of the track or is it a song because I can't find it in the official soundtrack from the series ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pyta7m/sean_combs_the_reckoning/"
    },
    {
        "id": "1pyaqrp",
        "author": "YesterdayHiccup",
        "title": "Pause screen block by ads.",
        "content": "Sometimes I pause to check the text and other small details in the scenes. It's really bother some that screen gets blocked by ad when I do this. I don't mind seeing ads every 20 to 30 minutes, but blocking pause screen is really annoying. I guess there are no chance that they will stop this?",
        "upvotes": 10,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1pyaqrp/pause_screen_block_by_ads/"
    },
    {
        "id": "1pz0ut5",
        "author": "RiseDelicious3556",
        "title": "Netflix's Red Rocket: My Review.",
        "content": "Red Rocket is over two hours long. During those two hours, I learned an important lesson. When a movie seems like it sucks, then continues to suck, then sucks some more, do not see that as a sign that something monumentally worthwhile must be coming in the form of an artful and mind-blowing ending.                                                                                                     If it sucks, then continues to suck, and then sucks some more, you're just wasting time till you reach the suckiest ending to a meaningless plot.                  This 'film' which I watched in the living room of my Philly town home not only consumed over two hours of my life which I will never get back, but also constituted the first time Philadelphia has been bombed since 1776.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pz0ut5/netflixs_red_rocket_my_review/"
    },
    {
        "id": "1px7c2n",
        "author": "Tricky-Bat-2638",
        "title": "Anyone else Disappointed with season 5 of stranger things?",
        "content": "Finding it a little disappointing considering how amazing the first 4 seasons were. \n\nDustin’s character is starting to really grate on me and will has spend most of seasons 1-5 sleeping. Joyce’s voice has just got more irritating as the seasons have gone on. \n\nAnd Millie Bobby brows face barely moves. I’m not judging her for having work done to her face but I do feel like there should be rules in long term series about having a large amount of plastic surgery. Her top lip is huge and barely moves and there’s  minimal expression on her face due to Botox. Some dramatic scenes are ruined from the lack of movement &amp; expression in her face.\n\nOverall I’m a little disappointed",
        "upvotes": 1727,
        "comments": 849,
        "media": null,
        "permalink": "/r/netflix/comments/1px7c2n/anyone_else_disappointed_with_season_5_of/"
    },
    {
        "id": "1pykovj",
        "author": "HelloW0rldBye",
        "title": "Watching Parish, seriously you won't put subtitles for foreign speech if I turn off subtitles?",
        "content": "I really hate this \"feature\" I don't want to watch all the English spoken words on the bottom of the screen distracting me from the show. But when I turn it off I do expect any foreign language to be written on the screen otherwise what I'm expected to learn every language on earth just to enjoy your shows? \n\n",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pykovj/watching_parish_seriously_you_wont_put_subtitles/"
    },
    {
        "id": "1pynujd",
        "author": "NocerinoCarmine",
        "title": "Film simili a Shutter Island: cosa guardare se ami i thriller psicologici con colpo di scena",
        "content": "Se *Shutter Island* ti ha lasciato con quella sensazione scomoda — il dubbio costante su cosa sia reale e cosa no — allora sai già che non stavi guardando solo un thriller. Stavi entrando nella mente di un personaggio… e forse anche nella tua.  \nSe cerchi **film simili a Shutter Island**, preparati a storie fatte di memoria difettosa, identità frammentate e finali che ribaltano tutto quello che credevi di aver capito.\n\nQui trovi una selezione di pellicole **perfette per chi ama i thriller psicologici intensi**, ordinate per affinità tematica e livello di “inganno mentale”.\n\n# Perché questi film sono simili a Shutter Island\n\nI film simili a *Shutter Island* condividono alcuni elementi chiave:\n\n* **Protagonisti inaffidabili**\n* **Memoria alterata o negazione della realtà**\n* **Indagini che diventano viaggi interiori**\n* **Twist finali che cambiano il significato di tutto**\n\nNon sono semplici gialli: sono **thriller introspettivi**, dove la mente è il vero luogo del mistero.\n\n[https://www.cinefatti.it/film-simili-a-shutter-island-cosa-guardare-se-ami-i-thriller-psicologici-con-colpo-di-scena/](https://www.cinefatti.it/film-simili-a-shutter-island-cosa-guardare-se-ami-i-thriller-psicologici-con-colpo-di-scena/)",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pynujd/film_simili_a_shutter_island_cosa_guardare_se_ami/"
    },
    {
        "id": "1pyillt",
        "author": "strawberry_corpse",
        "title": "Lupita’s ending in “The Accident” doesn’t make sense",
        "content": "I finished the second season of “The Accident” just now and there is one thing I felt to not really be logical. So, everything was going ‘well’ up until Yola visits Lupita in jail and gives her poisoned candy. Alright that, even though, in my opinion, that is also not as logical (even though I get the reference to Moncho’s death and that it was supposed to be ironic) as Yola’s, even if lied, words that she would much rather Lupita rot in prison for all those years. Wouldn’t that give Yola more satisfaction rather than an easy way out for Lupita? It just genuinely didn’t make sense to me, even though I get what the show was trying to do, again, with the irony of Lupita ending up the same way as her victim but at the hands of the victim’s wife’s hands, I get it. But at the same time I don’t find it the logical outcome for the show. \n\nNext, and this is honestly my main point about this, why the hell would Lupita, who poisoned multiple people herself in such a way, eat this candy given to her by someone who has exceptional hatred against her no less? It leads me to believe that she knew the candy would be poisoned and just wanted to use it to commit suicide. I can not explain it in any other way. There is no way she ate that candy, really believing Yola’s words that the candy isn’t poisoned. If that IS what happened then that does not make any damn sense and is downright stupid. \n\nWhat did you guys think of this part? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pyillt/lupitas_ending_in_the_accident_doesnt_make_sense/"
    },
    {
        "id": "1pyeqbw",
        "author": "Levarator_01",
        "title": "A weird issue(nw 3-6)with Netflix on Smart TV",
        "content": "Is it me or anyone facing problem to turn on Netflix while connecting tv to personal hotspot of iphone and showing the error nw 3-6. Tried everything but couldn't find any solution. But the same problem doesn't occur when connecting to android phone with the same carrier?\n\nAnyone has solution to this problem.😐 ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pyeqbw/a_weird_issuenw_36with_netflix_on_smart_tv/"
    }
]