[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 494,
        "comments": 270,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1iz1co8",
        "author": "anonRedd",
        "title": "What We Watched the Second Half of 2024",
        "content": "",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iz1co8/what_we_watched_the_second_half_of_2024/"
    },
    {
        "id": "1izf0wa",
        "author": "Sweaty-Toe-6211",
        "title": "Millie Bobby Brown Urges Fans to 'Be Patient' for Final Season of “Stranger Things”: 'It Is Worth It, I Promise'",
        "content": "",
        "upvotes": 94,
        "comments": 123,
        "media": null,
        "permalink": "/r/netflix/comments/1izf0wa/millie_bobby_brown_urges_fans_to_be_patient_for/"
    },
    {
        "id": "1iz3un2",
        "author": "ECO_FRIENDLY_BOT",
        "title": "Zero Day is so poor",
        "content": "Just finished Zero Day and it was excruciating. Apart from the terrible plot and hammy dialogue most of the actors looked like they were phoning it in apart from Jesse Plemons. Netflix has been in decline for years now and while it still produces a good show now and again the overall output has been horrendous. I know De Niro has a lot of alimony to pay but it's sad to see him in sub par tv shows like this.",
        "upvotes": 133,
        "comments": 110,
        "media": null,
        "permalink": "/r/netflix/comments/1iz3un2/zero_day_is_so_poor/"
    },
    {
        "id": "1iyt6v9",
        "author": "Flat-Creek93",
        "title": "The Woman in the House Across the Street from the Girl in the Window",
        "content": "I’m going preface this by saying I’m a complete moron. I had no clue this was satire until like the last or second to last episode. In my defense, I knew nothing about this show when I clicked on it and was slightly preoccupied when I watched it. But OMG looking back on it, there’s so much dumb stuff I missed that’s absolutely hilarious. I might have to watch it again.",
        "upvotes": 369,
        "comments": 75,
        "media": null,
        "permalink": "/r/netflix/comments/1iyt6v9/the_woman_in_the_house_across_the_street_from_the/"
    },
    {
        "id": "1izif1m",
        "author": "Leading-Bug-Bite",
        "title": "The Way Havana Syndrome Was Brought To Life in Zero Day",
        "content": "Tell me it's Havana Syndrome without telling me it's Havana Syndrome was a subtle and brilliant move by Netflix in Zero Day. It was very interesting to see that they dared bring this sensitive topic to life as the US government finally admitted that there is indeed such a thing and it's officially referred to as anomalous health incidents (AHI).\n\nTo the naked eye, viewers who aren't really in the know would see the symptoms as something related to more exposed mental issues such as Dementia, Alzheimers or even Schizophrenia. Netflix did a great job there. The alternative of directly confirming that it was Havana Syndrome would have been terrifying for inquiring minds. Leaving the culprit to the viewers's interpretation was mindful. The thought of goverments having the capability to remotely mess with people's brains is best left in the Sci-Fi, Horror or Dystopian genres. \n\nIn general Zero Day and the topics discussed are beyond most people's comprehension of possibilities and capabilities meeting real-life. There were obvious political points that distract viewers from the overall themes given our current political climate. This will obviously lead to negative reviews from those who are too passionate about their political affiliations to see the series as anything other that political propaganda pushing conspiracy theories. A risk that Netflix willingly took for the greater good?\n\nThere were some things that were the product of a bit of research and imagination. Other things were clear political warnings of the IFs.\n\nIn the end, I sincerely wondered who the real consultants for Zero Day were. Some things in Zero Day were too real for comfort. ",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1izif1m/the_way_havana_syndrome_was_brought_to_life_in/"
    },
    {
        "id": "1izgpuv",
        "author": "Pogrebnik",
        "title": "'Pokémon Concierge' Season 2 Will Debut in September on Netflix",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1izgpuv/pokémon_concierge_season_2_will_debut_in/"
    },
    {
        "id": "1izgp3i",
        "author": "Yuck_Few",
        "title": "Cassandra",
        "content": "For the love of Glob, just push the robot over and then smash the control panel in the basement \nOr just don't pay the electric bill?\nNothing about that story made any sense",
        "upvotes": 4,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1izgp3i/cassandra/"
    },
    {
        "id": "1iza29u",
        "author": "MrHaZeYo",
        "title": "I wish streaming services had options to make your own like TV station.",
        "content": "This applies to all of the big ones (hulu, Disney, Netflix, max, etc)\n\nSo what I mean is:\n\nSay I want to pick 10 TV shows and put them in a queue of sorts. The service plays 1-3 episodes of show A, then auto changes to show B, then C, etc. \n\nIt'd be cool to be able to also have an app that has all of the services your paying for all in one. The services still get your money, and you get everything from one app.",
        "upvotes": 9,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1iza29u/i_wish_streaming_services_had_options_to_make/"
    },
    {
        "id": "1izf1r9",
        "author": "L-E-G-O-S",
        "title": "What's happening to netflix?",
        "content": "My profile is almost completely reset. My list only has one show, my profile picture is reset, and I can't find the shows I'm trying to watch. This happened first on pc, but my phone and ps5 netflix were completely fine. But now It's happening on my ps5 too",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1izf1r9/whats_happening_to_netflix/"
    },
    {
        "id": "1izga6c",
        "author": "EthanWilliams_TG",
        "title": "Netflix’s Latest Engagement Report Shows What’s Truly Driving Views",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1izga6c/netflixs_latest_engagement_report_shows_whats/"
    },
    {
        "id": "1izjxco",
        "author": "Sudden_Pop_2279",
        "title": "Squid Game' Season 2 was the most-watched show on Netflix in Q2 2024, in only 5 days",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1izjxco/squid_game_season_2_was_the_mostwatched_show_on/"
    },
    {
        "id": "1izbj82",
        "author": "Morganbanefort",
        "title": "CHAOS: The Manson Murders | Official Trailer | Netflix",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1izbj82/chaos_the_manson_murders_official_trailer_netflix/"
    },
    {
        "id": "1izg5rl",
        "author": "brokenheartedmonkeys",
        "title": "Gears Of War",
        "content": "Netflix Dave Batista is the only valid choice to play the role of Marcus Fenix in the Live action adaptation of Gears.\n\nIf you are a true fan of the franchise and understand that Dave Batista is Marcus Fenix please sign below and share with your friends and family. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1izg5rl/gears_of_war/"
    },
    {
        "id": "1iynxln",
        "author": "Sweaty-Toe-6211",
        "title": "Netflix CEO Ted Sarandos Explains Why Traditional Sitcoms Like 'The Big Bang Theory' Are Still Big Business",
        "content": "",
        "upvotes": 78,
        "comments": 58,
        "media": null,
        "permalink": "/r/netflix/comments/1iynxln/netflix_ceo_ted_sarandos_explains_why_traditional/"
    },
    {
        "id": "1izenua",
        "author": "777NightFury77",
        "title": "People of reddit I am working on a research paper, I’d love to hear your thoughts on OTT platforms and how they’ve changed the way you watch content. This short survey (just a few minutes!) will help me understand what drives people to choose streaming services over traditional TV.",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1izenua/people_of_reddit_i_am_working_on_a_research_paper/"
    },
    {
        "id": "1izb8jv",
        "author": "Ryoga476ad",
        "title": "Android Emulator to run Netflix",
        "content": "Hi, I am often travelling by plane and I used to watch Netflix while flying with my PC.  \nas you know, it's not possible anymore so I have to settle for a lesser experience on my phone.  \nWondering, is anyone using an Android emulator that allows you to download the movies/episodes to watch them offline?",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1izb8jv/android_emulator_to_run_netflix/"
    },
    {
        "id": "1ize6s2",
        "author": "reapercrewsamcro",
        "title": "Netflix frame hopping Iag",
        "content": "I’ve been trying to watch breaking bad lately but out of no where the picture will freeze up and skip like a scratched dvd, my internet connection is really good and I’m wired in so I’m not sure if this is my tv itself or Netflix is bugging out, this started about a month ago. is this happening to anyone else please help. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ize6s2/netflix_frame_hopping_iag/"
    },
    {
        "id": "1iyoes0",
        "author": "nycsbestkeptsecret",
        "title": "This season is bad ? (The Night Agent )",
        "content": "I really just couldn’t get behind this season. This romance between Peter and Rose just doesn’t give me life. She also doesn’t have any sex appeal as well (as does Peter), the storyline between the US and Middle East is a bit redundant. \n\nNoors character got on my nerves (&amp; and man her brother same ) .\n\nI’m sorry for all the negativity, but I just couldn’t stand it. \n\nDoes anyone else feel this way ?! ",
        "upvotes": 38,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1iyoes0/this_season_is_bad_the_night_agent/"
    },
    {
        "id": "1iyrd7j",
        "author": "MysteriousDelay6266",
        "title": "HAVOC | Official Teaser | Netflix",
        "content": "",
        "upvotes": 18,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1iyrd7j/havoc_official_teaser_netflix/"
    },
    {
        "id": "1iz4oxq",
        "author": "Ambitious-Parking-33",
        "title": "Netflix speed watch option",
        "content": "Does anyone here watch Netflix shows or movies at 1.25x or 1.5x speed? I know I do it on social media, but it feels different when it comes to streaming. Also, has anyone ever watched at 0.5x or 0.75x speed? If so, why?",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iz4oxq/netflix_speed_watch_option/"
    },
    {
        "id": "1izaj4f",
        "author": "MrDannn",
        "title": "What is with the Alpha Males (Macho Alphas) rip-off?",
        "content": "I saw one (Shafted) from France that got the same premise but at least some slight deviation from the originals. The Rooster that just show up is just so shameless in copying the premise/characters 100%. Did the producers of Macho Alphas sell the rights to adaptation to other studios? Do we have another \"Perfect stranger\" situation on our hand?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1izaj4f/what_is_with_the_alpha_males_macho_alphas_ripoff/"
    },
    {
        "id": "1izhuiu",
        "author": "laurie-tommy",
        "title": "Would anyone be a doll and tell me if these shows are on the $7.99 Netflix plan?",
        "content": "- Better Call Saul \n- Money Heist\n- Dynasty\n- You\n- Love is Blind\n- The Witcher \n- Squid Games \n- Stranger Things \n\nI want to know if it is worth it to buy my own plan now that they won’t allow sharing anymore. ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1izhuiu/would_anyone_be_a_doll_and_tell_me_if_these_shows/"
    },
    {
        "id": "1iyn6tg",
        "author": "Robemilak",
        "title": "'Zero Day' Ranks as Second Most Watched Netflix TV Shows This Week (Worldwide)",
        "content": "",
        "upvotes": 26,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1iyn6tg/zero_day_ranks_as_second_most_watched_netflix_tv/"
    },
    {
        "id": "1iyr6sh",
        "author": "mad_max_mb",
        "title": "What’s the Best Show or Movie You’ve Watched on Netflix?",
        "content": "With so many options on Netflix, it’s hard to pick what to watch next. From intense thrillers to heartwarming dramas, the platform has something for everyone.\n\nFor me, \"Money Heist\" was an absolute game-changer—the tension, the characters, and that iconic Bella Ciao just made it unforgettable!\n\nWhat’s your top Netflix recommendation? A hidden gem, a must-watch series, or a recent favorite? Let’s share our best picks!",
        "upvotes": 11,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1iyr6sh/whats_the_best_show_or_movie_youve_watched_on/"
    },
    {
        "id": "1iypg9a",
        "author": "Internal-Bed-3150",
        "title": "Netflix begins adapting the best season of Avatar: The Last Airbender to live-action",
        "content": "",
        "upvotes": 10,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1iypg9a/netflix_begins_adapting_the_best_season_of_avatar/"
    },
    {
        "id": "1iz6qw7",
        "author": "Matthewp7819",
        "title": "How would Walter White and Jesse Pinkman fare if they did business in Baltimore and became business partners with The Greek, Proposition Joe or Marlo Stanfield?",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iz6qw7/how_would_walter_white_and_jesse_pinkman_fare_if/"
    },
    {
        "id": "1iz4ucg",
        "author": "aceofhearts__",
        "title": "Confused about Remind Me on removed Originals, specifically Dreamworks Netflix Originals.",
        "content": "So I’ll preface this with the fact that my dog and I LOVED watching the Dreamworks Netflix originals, specifically The Mr Peabody and Sherman Show and Home: Adventures with Tip and Oh. We’d watch them to fall asleep and I’d put it on for her while I did my studying, and she would legitimately watch it, which I always found funny. She’d get excited when I turned it on and would snuggle me and watch the show. So, occasionally, I check and see where to watch it in hopes that they’ll get added to a service that we already pay for. \n\nImagine my shock today when I looked up the Mr Peabody and Sherman Show and there was an official Netflix page that lead me to the app where I could push the remind me button. I was ecstatic! My girl and I could watch our silly cartoons again! Until I looked closer and found zero other information on these shows coming back online. \n\nDoes this mean that the show is coming back or have I been bamboozled? It also shows up for Home: Adventures with Tip and Oh and Turbo Fast, but again, I have found no other information. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iz4ucg/confused_about_remind_me_on_removed_originals/"
    },
    {
        "id": "1iyzmes",
        "author": "TheLakeGuardian",
        "title": "Kaiju movies in Netflix",
        "content": "Are there any kaiju movies on Netflix? (Excluding any Godzilla film and Love and Monsters, as I've already watched those). Shows such as Gamera Rebirth don't count because I want a film to watch. Kaiju movies are my favourite genre, so I'm looking forwards to seeing if there's any. Thanks in advance! ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iyzmes/kaiju_movies_in_netflix/"
    },
    {
        "id": "1izck21",
        "author": "observant_asian",
        "title": "Everything is so wrong about the series 'Cassandra'.",
        "content": "Although very unique, the storyline gets forward just because of the dumb reactions of characters as if they all know their part in a schoolplay.\n\nFirst comes the husband. God Damn it, atleast for once listen to your wife if she's saying the robot is unusual. My wife would have divorced if I acted such dumb and narssicist towards her that too for a fuckin machine.\n\nTheir retarted child 'judo'. Seriously ? Is that how you make a decision in your family for your retarted kid? Just because she had a chance to laugh with that robot you left her with it even the women knew everything about it couldn't do anything because her husband is a dumb person who just want things to be normal no matter how it happens. For a kid that age parents need to be strict af to guide them in life till the point they become sane minded to overcome problems.\n\nThat gay boy. Felt so good when his friend smacked the shit out of him when somebody entered the room while they were making out (honestly had to fast forward it, it was so uncomfortable till he started bleeding from that punch)\n\nOverall I didn't understand 100% rotten tomatoe Rating and a 6.6 on IMDB. Honestly it was 3.5, 20% \n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1izck21/everything_is_so_wrong_about_the_series_cassandra/"
    },
    {
        "id": "1iypadu",
        "author": "Somethingman_121224",
        "title": "Hayden Schlossberg Reveals His Top Five Fighters in 'Cobra Kai'",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iypadu/hayden_schlossberg_reveals_his_top_five_fighters/"
    },
    {
        "id": "1ize9kr",
        "author": "Bulky_Suggestion3108",
        "title": "Trigger warning missing",
        "content": "Apple Cider vinegar \nEpisode 3 \n\nIt should have a trigger warning for people who have had later term pregnancy losses.  The scene when she lost her baby at 23 weeks. I wish I didn’t have to see it on tv or the show had a ‼️ ‼️ warning",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ize9kr/trigger_warning_missing/"
    }
]