[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 7,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 150,
        "comments": 537,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1n0czgr",
        "author": "SoftPois0n",
        "title": "‘The Waterfront’ Canceled By Netflix After 1 Season",
        "content": "",
        "upvotes": 54,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1n0czgr/the_waterfront_canceled_by_netflix_after_1_season/"
    },
    {
        "id": "1n011sr",
        "author": "shedevil_99",
        "title": "Any of you guys watched Mr. Robot?",
        "content": "Im debating whether to finish this series or not. I like the original concept of it, but find the schizo random episodes off putting. To me, they are very unnecessary and very confusing. It ruins the show. One minute he’s paranoid about getting caught hacking and the next he’s hearing voices that aren’t there? Like why? The last straw was the opening of Episode 6. He (i guess) imagined being in a sitcom. Why couldn’t they continue with the hacking greedy corporations storyline without the dad being an imaginative character in Elliot’s head? Like i said, i enjoyed the original concept and am thinking about finishing it but idk? Have any of you finished it? Is it worth it? It just annoys me when writers try so hard to be clever and eccentric with these shows ultimately losing the plot &amp; ruining a good show. ",
        "upvotes": 56,
        "comments": 74,
        "media": null,
        "permalink": "/r/netflix/comments/1n011sr/any_of_you_guys_watched_mr_robot/"
    },
    {
        "id": "1n0cqp8",
        "author": "Celestialey",
        "title": "The gang members in 'Money Heist' seem like they all came from a mental asylum",
        "content": "I want to say, who needs a villain or an enemy if you have such members in your gang. Professor himself was a dumb person for recruiting this exact set of dumb pieces. \n\n1. Proudly broke the first rule of 'Having no relationship'. \n\n2. Rio and Denver both talked to female hostages like taking a walk in the park and trusting them like highschool mates. \n\n3. These guys kept talking and discussing about personal matters at the most critical moments when they were required to focus on enemy and making sure they got out. \n\n4. All the gang members casually sitting in different places in the building and carelessly having the chit chat of their life without anyone really looking after the hostages. \n\n5. The entire gang was on hostages' mercy that they didn't try to run away. \n\n6. Shouting, abusing and pointing gun towards own gang member and the incharge, and trying to kill them too. \n\n7. Professor getting beaten and tied by a pregnant lady risking the entire heist. \n\n8. No plan on how to get the gang out of the bank. And neither anyone caring about it. ",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1n0cqp8/the_gang_members_in_money_heist_seem_like_they/"
    },
    {
        "id": "1n00nno",
        "author": "L0v3_1s_War",
        "title": "First Netflix House opens its doors on November 12th. The Philly house will be followed by Netflix House Dallas on December 11th.",
        "content": "",
        "upvotes": 20,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n00nno/first_netflix_house_opens_its_doors_on_november/"
    },
    {
        "id": "1n075x3",
        "author": "The_LawBorn",
        "title": "Looking for something to watch.",
        "content": "I’ve been looking for something new to watch for awhile, particularly where the main character is the strongest in the show. They don’t have to be overpowered, do everything without a struggle, or be a Mary sue or Gary Stu. I’m just looking for a show where they’re already the strongest or become the strongest. Please let me know if any of you have a good recommendation, anything is greatly appreciated. ",
        "upvotes": 8,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1n075x3/looking_for_something_to_watch/"
    },
    {
        "id": "1n0dm6o",
        "author": "armie",
        "title": "Received an email saying that I subscribed but I haven't",
        "content": "Title really; I've received an email saying I subscribed to Netflix but I haven't.  Trying to change Netflix password gives me an error: Sorry, something went wrong. Please try again later.\n\nMy email account doesn't have any unrecognized sessions and 2FA is on.\n\nWhat might this be? I can't seem to find a way to contact Netflix about it.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n0dm6o/received_an_email_saying_that_i_subscribed_but_i/"
    },
    {
        "id": "1n0gtd0",
        "author": "aaryan_pathak",
        "title": "Netflix glitching?",
        "content": "2 shows on my watchlist, one a TV series and the other an anime. Both of them are available on my iPhone app, but when I open Netflix on the browser, neither is available. Even when I try to check from my viewing history, it only shows that they have 'trailers' available. What's going on? It's not region locked because Im watching it on my phone and TV",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n0gtd0/netflix_glitching/"
    },
    {
        "id": "1n0grfz",
        "author": "Sweaty-Toe-6211",
        "title": "Netflix Lands Matthew McConaughey, Cole Hauser, Nic Pizzolatto Show in Bidding War",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n0grfz/netflix_lands_matthew_mcconaughey_cole_hauser_nic/"
    },
    {
        "id": "1n0gbfq",
        "author": "Hero-Firefighter-24",
        "title": "What future Monster series should be about?",
        "content": "I’ve been following the Monster franchise since Jeffrey Dahmer, watched both Dahmer and the Menendez Brothers, and I’m looking foward to the Season 3 about Ed Gein and Season 4 on Lizzie Borden.\n\nBut what should Season 5 be about? Personally, I’m hesitating between Gerard Schaefer and George Tiaffay.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n0gbfq/what_future_monster_series_should_be_about/"
    },
    {
        "id": "1n0g1nc",
        "author": "therealgale65",
        "title": "When a download is expiring on a certain date, what time does it expire?",
        "content": "I downloaded some shows to watch on a flight but my earphones didn't work so I wasn't able to watch. So now they expire on the exact day I'm flying back home. Do they expire at the end of the day? Thank you ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n0g1nc/when_a_download_is_expiring_on_a_certain_date/"
    },
    {
        "id": "1n0flwk",
        "author": "Happy_Tx24b",
        "title": "Usefull feature or random add ?",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n0flwk/usefull_feature_or_random_add/"
    },
    {
        "id": "1n0bohx",
        "author": "Terzinho",
        "title": "Warrior 2019-2013",
        "content": "I just finished watching 3 seasons of warrior tv show. It's one of the best shows I've watched ever and I hope Netflix continues to run it one day. It would be a shame if it ended unfinished. Rarely today I find great shows like this hidden gem. It was originally Bruce Lee's idea to make it but he passed away, so they used his writings to create the plot. It would be nice in his memory to finish Warrior one day... Hopefully.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n0bohx/warrior_20192013/"
    },
    {
        "id": "1n0bgf0",
        "author": "evecatherine",
        "title": "Thoughts on Sirens",
        "content": "This might be a controversial take: I don't blame Simone for doing whatever it takes to avoid revisting her trauma, especially when her dad said \"It's gonna be you and me again.\" Like Jesus Christ. First, her mother nearly kills her. Then her dad neglects her to the point where she's starving. THEN she gets taken into foster care and is sexually abused there. \"Stealing\" someone's husband is one of the lesser evils she could have committed given her awful circumstances. It's immoral, of course, but desperation will lead to desperate measures.\n\nDevin is alright. She's had it pretty tough, but Simone arguably had it even worse. Given what we know now, I'm surprised she wasn't a bit more sympathetic towards Simone for not wanting to come home. I don't have too many thoughts on her. \n\nMichaela is fabulous! No notes. Prime example of how \"powerful\" women, or women with a strong presence, are villainized or even suspected to be \"witches\" (the series tricked us into going along with that narrative, when it was Peter pulling the strings all along). \n\nIMO, the main villains are Peter and Bruce (the dad). One intentionally manipulates and tricks people (Peter), and the other was just a neglectful parent who caused irreparable trauma to both his daughters. The main characters are just products of their circumstances. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n0bgf0/thoughts_on_sirens/"
    },
    {
        "id": "1n0ea5o",
        "author": "FireReaper52",
        "title": "Does anyone know what’s happening with Neal Shusterman’s game changer?",
        "content": "It feels like a while ago that they teased the production of a series for it but I haven’t seen any updates on it. Has it been cancelled or is it still in production? If so is there an eta on when it will release?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n0ea5o/does_anyone_know_whats_happening_with_neal/"
    },
    {
        "id": "1n032bq",
        "author": "Cultural_Lead_5395",
        "title": "Will they continue to make new episodes of Trainwreck??",
        "content": "I’ve love every episode that they’ve made and I would love if they had more episodes made, or if anyone knows a YouTube channel that covers similar topics PLEASE let me know",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n032bq/will_they_continue_to_make_new_episodes_of/"
    },
    {
        "id": "1mz7z78",
        "author": "L0v3_1s_War",
        "title": "Box Office: ‘KPop Demon Hunters’ Sings to $18M-$20M in First Theatrical Win Ever for Netflix",
        "content": "",
        "upvotes": 248,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1mz7z78/box_office_kpop_demon_hunters_sings_to_18m20m_in/"
    },
    {
        "id": "1mzca04",
        "author": "f00dl3",
        "title": "3 minute ads, wtf?",
        "content": "Just got hit with my first 3 mimute ad while watching Netflix. I get 30 second ads, but come on - this stuff ain't free - I still pay a monthly subscription!",
        "upvotes": 87,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1mzca04/3_minute_ads_wtf/"
    },
    {
        "id": "1n05ak3",
        "author": "Hefty-Ad-317",
        "title": "After changing ISS Netflix is just broken",
        "content": "So I had 50mbps net from an ISS and I changed it today to 200 mbps from some other ISS and now netflix looks like this how can I solve this  ?\n\nhttps://preview.redd.it/g1q2ra2yv8lf1.png?width=1836&amp;format=png&amp;auto=webp&amp;s=115697b1e7d9006d4801b79e370484490f583355\n\n",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1n05ak3/after_changing_iss_netflix_is_just_broken/"
    },
    {
        "id": "1n04xvy",
        "author": "danny_dumbo",
        "title": "CaptionMax subtitles showed up at end of an episode",
        "content": "https://preview.redd.it/9phipzt8t8lf1.png?width=5120&amp;format=png&amp;auto=webp&amp;s=1c03723df608e324a0dfd4cc8fb6f6202309decc\n\nI was watching Dexter S3E2, and during the end I saw the credit for CaptionMax appear.\n\nCaption max is 3Play Media now and their MO is following\n\n3Play Media provides closed captioning, transcription, and audio description services to make video accessibility easy. We are based in Boston, MA and have been operating since 2008.\n\nI am pretty sure they are using AI in the background, but didn't expect it to show up in the stream.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n04xvy/captionmax_subtitles_showed_up_at_end_of_an/"
    },
    {
        "id": "1mzc0et",
        "author": "Gray3706",
        "title": "Why do some of the korean shows make no sense?",
        "content": "My first example is from the new show Trigger. A man nearly rapes a woman, and the main character (an officer) arrives just in time to stop it. He checks the perimeter and leaves his partner to look at the man’s ankle monitor. The man then tries to kill the partner, but the MC stops him just in time. And guess what happens next? The MC slams him to the ground, then he and his partner just walk away—leaving a man who just attempted sexual assault and murder completely free.\n\nAnother example is in Alice in Borderland. There’s a recurring character who repeatedly tries to rape people, and the group has multiple chances to get rid of him. I don’t remember every detail, but one scene had the main character strangling this guy after he tried to assault what seemed to be his love interest. Yet, instead of finishing it, he just lets him live…\n\nI honestly don’t get what kind of message the writers are trying to send here, but it feels like it completely falls flat. Why are they portraying rape like it’s something that can just go unpunished?\n",
        "upvotes": 50,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1mzc0et/why_do_some_of_the_korean_shows_make_no_sense/"
    },
    {
        "id": "1n02og6",
        "author": "407ThroatChamp",
        "title": "Slowwwww",
        "content": "Hi I have a rather old TCL smart TV, circa black Friday 2021. I am experiencing VERY SLOW action within the Netflix app. My only reason for thinking it's an Netflix issue and not the TV is because other apps (hulu, paramount+, peacock) work just fine. \nAnybody else experiencing slowness specifically when using Netflix?!?!? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n02og6/slowwwww/"
    },
    {
        "id": "1n01jwh",
        "author": "Viper_Four4",
        "title": "How do I fix a very low bitrate with fast internet on PC?",
        "content": "I have recently been getting extremely low bitrates of around 100 to 300 kbps (checked with Ctrl + Shift + Alt + D shortcut) while running Netflix in the PC app with a 1440p resolution in HDR 10 (with the required subscription for 4k). The resulting artefacts make it pretty much unwatchable. Some shows seem to be better than others, but I can't seem to figure out how to actually get them to stream in good quality consistently across all shows. I have tried adjusting the playback setting to maximum instead of auto, but it makes no difference since my internet is not the bottleneck and is capable of streaming 4k 60 fps on YouTube. I have not been able to find any solutions that I have not tried already (Windows app and quality settings).",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n01jwh/how_do_i_fix_a_very_low_bitrate_with_fast/"
    },
    {
        "id": "1n06zas",
        "author": "kurtstoys",
        "title": "Repeating ads",
        "content": "Watching raw, and it keeps repeating ads. It will show 2 seconds of wrestling, then bam, another 3 minutes of the same ads! From ads to sound issues... whats going on with netflix live?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1n06zas/repeating_ads/"
    },
    {
        "id": "1n06a8i",
        "author": "_zyx_716",
        "title": "Question about living in two different homes?",
        "content": "I used to be able to connect the account by using Netflix on my phone at the main households wifi and then connect to the wifi at the second house with my phone later. But now it says that my phone isn't a part of the household. Any way to do this still or am I just screwed? If I can't even use my phone to watch it on the go anymore the app feels kind of useless overall.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n06a8i/question_about_living_in_two_different_homes/"
    },
    {
        "id": "1mzzzkj",
        "author": "Pntrdm",
        "title": "I'm tired of all Production Companies for their inconsistent work.",
        "content": "On half it's my fault as well because I promised myself a long time ago that I wouldn’t start a new series without making sure it’s well-finished and not ending on a cliff-hanger.\n\nBUT...\n\n  \nI sometimes feel like I'm being punished because all the series I've watched so far became my favourites, I could relate them, all them have a unique, strong story that kept me glued to the screen from the beginning, but then its too late when I realise I won't see the end of this story, only can feel a gap inside me caused by the lack of sequel.\n\nBy Netflix: Travelers, Archive 81, The OA, The society\n\nBy Fox: Wayward Pines (yes its in Disney's hand now and they could had finished it if they'd had cared at all but no)\n\n  \nI know the sad reality that in this greedy capitalist world is all about the money how much they can take, but in the end of the day always the fans get the short end of the stick. When we read the news about the series being cancelled, what the first line tells about most of the time? The viewership has drastically decreased. I'm asking you that whose fault is that? \n\nIt's on me or on you who actually enjoyed the series and wanted more, or it's on the directors, creators, producers, executive producers, the very people whose job it is to specialize in this industry and create works that can stand the test of time in front of a wide audience without having to abandon them at the first bump in the road? In a normal parallel universe, they wouldn’t just give up but would find a solution to the problem.\n\nI understand it’s not easy to satisfy millions of people unilaterally according to your own vision, especially when it comes to film/TV production, but I don’t think the solution is to throw all that work in the trash and never look back. That’s not how you grow or learn. Instead, if everyone sat down and carefully discussed what could be done differently, how to carry the storyline forward in a way that brings viewers back, or even gains new ones, it would elevate them to a higher pedestal for being able to rise above and set aside their grievances. \n\nIn the long run, this would pay off, not only financially (for their own pockets), but professionally as well.  \nYes, I know there are numerous other factors why a show could be dropped. *The Society* and a few others were left hanging due to COVID-19. But that was years ago, then why haven’t they picked it back up since then? Is it because these shows are too unique, and they prefer mass-producing cookie-cutter content that doesn’t require much thought or effort? That’s part of it.\n\nIf they stopped the mass production machine and quit churning out the same series every year with a different coat of paint, new actors, and new locations, and instead went back to the roots to fix their mistakes, they could actually finish the abandoned shows. And there are plenty of them.\n\nI'm asking you reader if you've watched these series I mentioned above, how did you like it? How'd you feel when you found out there won't be a sequel?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1mzzzkj/im_tired_of_all_production_companies_for_their/"
    },
    {
        "id": "1mzebeq",
        "author": "Holiday_Hamster3022",
        "title": "Binge recs please",
        "content": "I’m going through a rough time, my significant partner just passed and I need something to watch. I have no motivation to do anything so I figured maybe watching a show will help. Just want something lighthearted &amp; funny to keep me distracted. ",
        "upvotes": 23,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1mzebeq/binge_recs_please/"
    },
    {
        "id": "1mzxrmv",
        "author": "Fit-Bend5910",
        "title": "When they do the Jake Haro doc…",
        "content": "I hope when Netflix finally does the Jake Haro documentary they take a real deep dive into his childhood and teenage years. Same for Rebecca too. I need to see what kinda past creates monsters like them or if was just a “nature”  situation like with Ted Bundy who was born messed up. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mzxrmv/when_they_do_the_jake_haro_doc/"
    },
    {
        "id": "1mzfhux",
        "author": "Afraid_Fishing_3694",
        "title": "A Deadly American Marriage - Can someone explain what’s happening in this photo of Molly and her dad?",
        "content": "",
        "upvotes": 15,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1mzfhux/a_deadly_american_marriage_can_someone_explain/"
    }
]