[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 50,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 16,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1reng13",
        "author": "RiskAndReason",
        "title": "What’s that one Netflix show you think is an absolute must-watch?",
        "content": "The kind where you’d say, “I can’t believe you haven’t seen this yet.”\n\nLooking for something great to start next, classics or hidden gems both welcome.",
        "upvotes": 654,
        "comments": 1172,
        "media": null,
        "permalink": "/r/netflix/comments/1reng13/whats_that_one_netflix_show_you_think_is_an/"
    },
    {
        "id": "1rf9ft8",
        "author": "fraction00",
        "title": "Is House of Cards (U.S) worth watching?",
        "content": "I am thinking of watching House of Cards on Netflix. Since it’s 6 seasons long, It’s better to be worth my time. Can I watch it? Is it worth watching? I like political thrillers in general. I liked the Diplomat",
        "upvotes": 19,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1rf9ft8/is_house_of_cards_us_worth_watching/"
    },
    {
        "id": "1rff0nn",
        "author": "Outrageous-Baker5834",
        "title": "Apple and Netflix join forces to distribute F1 2026 content",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rff0nn/apple_and_netflix_join_forces_to_distribute_f1/"
    },
    {
        "id": "1rfegej",
        "author": "airup_official",
        "title": "Why do some shows feel “too much” at first… and then become cultural obsessions?",
        "content": "When Bridgerton first came out, I remember a lot of people saying it was “too dramatic,” “too colorful,” “too unrealistic.”\n\nAnd then somehow… it became everywhere.\n\nThe fashion, the music covers, the aesthetic, the slow-burn romance, it turned into a full-blown cultural moment.\n\nWhat do you think makes that switch happen?\n\nWhy do some shows go from “this is a bit much” to “I can’t stop watching this”?\n\nCurious how you experienced it when it first dropped!",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1rfegej/why_do_some_shows_feel_too_much_at_first_and_then/"
    },
    {
        "id": "1rfed7n",
        "author": "MiBareBear",
        "title": "Eric Dane - FLW",
        "content": "wow, just wow. you wouldn't finish this without crying. the messaging and how he conveyed it was so powerful. the host really did an amazing job in asking the right questions.. So yeah, we really have to live here NOW.😭",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rfed7n/eric_dane_flw/"
    },
    {
        "id": "1rf4cux",
        "author": "DaGeoffro",
        "title": "Has anyone seen the Russian show Better Than Us?",
        "content": "I don't feel like this show gets talked about enough, it's honestly one of my favorite sci-fi/futuristic offerings on the platform. I enjoy every storyline, which I can't say about a lot of shows where each character is off doing their own thing. They really managed to connect everything in a way that I found satisfying. And while it has a pretty run-of-the-mill take on life in the future, with some sillier elements like transparent smart phones, I do like that it takes place in the NEAR future (2029,) as opposed to 2058 or 2082 or something like that. And you can't mention Better Than Us without mentioning Arisa, the main character of the show who, despite being a robot, ends up being one of the most likeable and emotionally complex characters out of everyone.  \n  \nI'd definitely recommend checking it out if you're into sci-fi or robots. The story is definitely more of a slow burn, so if that isn't your thing you may not like it. There was never a season 2 unfortunately (but the first season has quite a few episodes). I heard something about another company renewing it for a second season but I'm not sure if anything ever came of that.",
        "upvotes": 7,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1rf4cux/has_anyone_seen_the_russian_show_better_than_us/"
    },
    {
        "id": "1recvyj",
        "author": "monroe099",
        "title": "Is there any way to hide movies that I already watched?",
        "content": "Netflix needs to stop recommending me the same movies I’ve already watched like I don’t pay a subscription to discover something new 😭 Is there any way to stop seeing these on my main page please ?  It takes me longer to find something to watch than to actually watch a movie.",
        "upvotes": 201,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1recvyj/is_there_any_way_to_hide_movies_that_i_already/"
    },
    {
        "id": "1rff9wg",
        "author": "RollerSkatingHamster",
        "title": "My mum used our account while abroad and the rest of our profiles have disappeared",
        "content": "I take it that this is because of the one household rule. It's such an annoying policy! I know there is a way around it but right now I'm too pissed off to start looking at solutions haha.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rff9wg/my_mum_used_our_account_while_abroad_and_the_rest/"
    },
    {
        "id": "1ren0gz",
        "author": "anjilleea",
        "title": "How to get to heaven from Belfast",
        "content": "Just finished this mini series and LOVED it. It was oddball quirky in all the right ways. Created by the same woman who made Derry Girls which I also loved (maybe I’m just a sucker for N Irish accents and humour?!?). ",
        "upvotes": 45,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1ren0gz/how_to_get_to_heaven_from_belfast/"
    },
    {
        "id": "1retwvf",
        "author": "onlysummerxoxo",
        "title": "I just finished Night Agent, anyone have anymore good recommendations?",
        "content": "I’ve seen all the super popular shows like Waterfront , Lincoln Lawyer &amp;&amp; His &amp;&amp; Hers. I was just wondering if anyone had anymore recommendations. I need something binge worthy lol.",
        "upvotes": 21,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1retwvf/i_just_finished_night_agent_anyone_have_anymore/"
    },
    {
        "id": "1rekvop",
        "author": "Zutara764",
        "title": "Why does Netflix time their ads SO BADLY",
        "content": "I'm rewatching Grey's, and it’s WILD that the ads aren’t just placed where the original commercial breaks were. Like the early seasons were made for cable, so they have obvious cuts to commercials, and Netflix just decides to throw them in whenever the hell they feel like it.   \nEven watching Love is Blind, they cut to ads literally in the middle of conversations all the time. Once it even happened in the middle of a sentence. \n\nLike was there not a single thought put towards when an ad should be played???",
        "upvotes": 46,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1rekvop/why_does_netflix_time_their_ads_so_badly/"
    },
    {
        "id": "1reylt7",
        "author": "TheOttomanJanissary",
        "title": "Hot take: Marco Polo walked so Shōgun could run. Agree or disagree?",
        "content": "I rewatched it and honestly the production value was insane. Mongol Empire politics, brutal battles, massive sets. But it got cancelled after 2 seasons. With how well historical epics are doing now (like Shōgun), do you think Marco Polo would survive if it dropped today? Or was it just not that good? Curious what people think did it deserve to be cancelled? ",
        "upvotes": 8,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1reylt7/hot_take_marco_polo_walked_so_shōgun_could_run/"
    },
    {
        "id": "1rfekj2",
        "author": "rrsafety",
        "title": "Should my wife and I continue with His &amp; Hers?",
        "content": "My wife and I watched episode 1 of His &amp; Hers and were disappointed.  I guess we are more  interested in watching a mystery/thriller (like The Beast in Me or Run Away) rather than what appeared to be  more of sex drama. Should we continue? ",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1rfekj2/should_my_wife_and_i_continue_with_his_hers/"
    },
    {
        "id": "1rf89hp",
        "author": "SenseiShivam",
        "title": "Curious Query",
        "content": "Guys i mean I loved to play rdr 1 I mean what other AAA games coming here with Storyline \n\nI mean I heard about gta IV (is it true) \n\n\nAfter all if y'all know what games are coming \n\nTell me. \nI'd like to know\n\n\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rf89hp/curious_query/"
    },
    {
        "id": "1rf75ij",
        "author": "roastofthemonth",
        "title": "The flash post season 3",
        "content": "Anyone else wished the flash season 2 ended differently? &gt;!Like after season 2 the whole plotline got MESSED up and changed all because of barry's stupid decision to save his mother. Also the storyline characters got wierd as frick, like bro what is the point bruv? !&lt;im not tryna suggest nothing but im just unhappy with the later storyline",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1rf75ij/the_flash_post_season_3/"
    },
    {
        "id": "1remzk1",
        "author": "tigercat300",
        "title": "What show would you bring back to Netflix?",
        "content": "There are so many great shows on Netflix that got canceled too soon. If you could bring any show back for another season or even a full reboot, what would it be? I’ve been thinking about *The OA,* I feel like it had so much potential that we’ll never get to see! What’s your pick, and why?",
        "upvotes": 9,
        "comments": 131,
        "media": null,
        "permalink": "/r/netflix/comments/1remzk1/what_show_would_you_bring_back_to_netflix/"
    },
    {
        "id": "1rf9il8",
        "author": "muchtoomuch123",
        "title": "What was your first Netflix show?",
        "content": "What was your first Netflix show ? Mine was 13\n\nReasons why and I still remember the trauma i got after watching it. It was so traumatising and heartbreaking. ",
        "upvotes": 0,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1rf9il8/what_was_your_first_netflix_show/"
    },
    {
        "id": "1rewowh",
        "author": "azaman92x",
        "title": "Show suggestions",
        "content": "Hey all, hope you’re all well!\n\nI finished watching season 3 of the night agent on Netflix a few days ago. I’m looking for any recommendations of shows similar to this please? \n\nThankyou in advance ☺️",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1rewowh/show_suggestions/"
    },
    {
        "id": "1rf99wq",
        "author": "Specialist-Cup-5062",
        "title": "Az eszközöd nem része a Netflix háztartásnak ehhez a fiókhoz.",
        "content": "A netflix maximum 14 napig engedi, hogy a laptopomon filmet vagy sorozatot nézzek mert nem része a háztartásnak szerinte. Olvastam hogy ugyanazon a hálózaton kell lenni, viszont a netflix appnál nem volt eddig probléma, sőt több városban használjuk gépen, tv-n és másoknál nincs ilyen probléma csak az én laptopomon. még akkor sem problémázik ha a család egyik tagja külföldön nézi webes böngészőből. Lehet ezzel valamit kezdeni, hogy ne kelljen 2 hetente kód a belépéshez?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1rf99wq/az_eszközöd_nem_része_a_netflix_háztartásnak/"
    },
    {
        "id": "1reo88t",
        "author": "IndicaOatmeal",
        "title": "Hans Niemann says Netflix Untold documentary will “shift the narrative” about his chess cheating scandal",
        "content": "",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1reo88t/hans_niemann_says_netflix_untold_documentary_will/"
    },
    {
        "id": "1rezdy4",
        "author": "EttaJamesKitty",
        "title": "Netflix says I've watched episodes I haven't.",
        "content": "Say there is a show with 10 episodes.  I will watch episodes 1, 2 &amp; 3 and log off.  Next time I go back, Netflix will show episodes 4, 5 &amp; 6 watched too, even though I never watched them, and start me on episode 7.  \n\nThis has been a problem for a while.  Happens regardless of platform (laptop vs my tv). I'm the only person on my account.  \n\nAny idea what is going on?  \n\n",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1rezdy4/netflix_says_ive_watched_episodes_i_havent/"
    },
    {
        "id": "1reqdfo",
        "author": "jackie_tequilla",
        "title": "The Watcher is very hard to watch. Spoilers.",
        "content": "Maybe unpopular opinion but a family of 4 don’t need that stupendous house especially when you can’t really afford it and have to make sacrifices elsewhere. But hey I’m not an American. I don’t have this mentality of bigger, better, more, more, more. \n\nThe husband said they needed their kids to have rheir oen room and outside space, of course there were smaller cheaper options elsewhere. \n\nDid they buy it fully furnished? Or their furniture just fits there perfectly?\n\nAlso only 6 weeks lead time? Is it that quick in the US? Didn’t they need to sell their previous house for cash to contribute to the new mortgage or deposit? \n\nThe idea of getting rid of authentic expensive marble kitchen tops because of spaguetti tomato sauce is ludicrous. The kitchen looks brand new. Why buy something so expensive just to refurb it? \n\nAlso they new that one set of neighbours seem to be crazy and the other unfriendly and rude. But no, no investigation, nothing. Talk about impulse buying. \n\nAlso who buys a fucking ferret for a pet? Buy a dog or a cat, you have the space now. \n\nAnd who is doing all the cleaning? \n\nI’m just coming at the end of E1. I hated this thing from the beginning and nearly gave up but after reading so many bad comments I am going to see how much I can endure. ",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1reqdfo/the_watcher_is_very_hard_to_watch_spoilers/"
    },
    {
        "id": "1relgoe",
        "author": "MovieFan1984",
        "title": "Netflix Originals on Disc (DVD, Blu-ray, 4K)",
        "content": "Is there a way to keep track of what Netflix originals are getting disc releases?  \nI have Stranger Things S1-2, the Target exclusive DVD/Blu-ray releases.  \nI know The Umbrella Academy S1-2 also saw a disc release.  \nThe two \"Haunting of\" miniseries saw a disc release.  \nI can keep listing, but you get the idea. Sometimes, Netflix does drop a disc release.  \nIs there any way to keep track, or just keep checking [Blu-ray.com](http://Blu-ray.com) every so often?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1relgoe/netflix_originals_on_disc_dvd_bluray_4k/"
    },
    {
        "id": "1rdub1c",
        "author": "Wonderful-Refuse642",
        "title": "‘The Night Agent’ Season 3 Viewership Down Up To 59% on Prior Seasons In Opening Week",
        "content": "",
        "upvotes": 78,
        "comments": 89,
        "media": null,
        "permalink": "/r/netflix/comments/1rdub1c/the_night_agent_season_3_viewership_down_up_to_59/"
    },
    {
        "id": "1renwn7",
        "author": "Blood_donut",
        "title": "HELP!  Why is my screen so dark in the Netflix app?",
        "content": "I wonder if anyone else has this issue, or even found a way to fix it with settings or something..  I have an iPhone 17 now, but I had the same issue when I had the 13.  My brightness is all the way up, true tone and auto brightness are both off.  Even when it is a light scene, it still seems dark.  It only happens in the Netflix app.  Hulu and Prime are both bright enough.  Maybe I am going crazy.",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1renwn7/help_why_is_my_screen_so_dark_in_the_netflix_app/"
    },
    {
        "id": "1rdcfs5",
        "author": "[deleted]",
        "title": "Why are all the shows made for 20 year olds? I mean, as the older bill payer of the house, I can't find anything new to watch.",
        "content": "Just saying... Every new series is... absolutely rubbish... Wouldn't hurt to try and appeal to demographics of all ages. \n\nPlease don't suggest K Pop demon Hunters to me...",
        "upvotes": 299,
        "comments": 322,
        "media": null,
        "permalink": "/r/netflix/comments/1rdcfs5/why_are_all_the_shows_made_for_20_year_olds_i/"
    },
    {
        "id": "1reo8zw",
        "author": "Lack_Potential",
        "title": "What does season 2 of season 3 mean?",
        "content": "Looking at a few shows but most recently Pokémon Horizons, they split season 3 (Rising Hope) into seasons. This isn’t the first time I’ve seen this happen. I’m just a little confused why they didn’t just call Rising Hope an arc.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1reo8zw/what_does_season_2_of_season_3_mean/"
    },
    {
        "id": "1reguxy",
        "author": "Worldly-Ebb-7891",
        "title": "What do you think about Netflix recommendation system?",
        "content": "I think it is using ML behind the system for personalization, just wondering what others think about it. Like good or bad or your thoughts. Pros and cons.   \nSorry for bad grammar, English is not my first language :}",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1reguxy/what_do_you_think_about_netflix_recommendation/"
    }
]