[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 12,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1orin66",
        "author": "Budget_Lavishness707",
        "title": "Guillermo Del Toro Frankenstein",
        "content": "I just finished watching Del Toro’s Frankenstein adaptation. The monster is one of my most beloved OG horror characters, so I consume ALL the things related to said subject. So I was looking forward to this movie release for quite some time. And I have thoughts…\n  My husband fell asleep after an hour due to the slow pace of the story 😂, &amp; now I have no one to currently talk me through thoughts &amp; opinions I have.\n   Has anyone else watched this?",
        "upvotes": 97,
        "comments": 72,
        "media": null,
        "permalink": "/r/netflix/comments/1orin66/guillermo_del_toro_frankenstein/"
    },
    {
        "id": "1oqxuou",
        "author": "Jet_Jirohai",
        "title": "Why does it seem like Netflix is the only streaming service that knows how to make a functional user experience?",
        "content": "My main 3 streaming services are HBO, Hulu and Netflix(and YouTube premium, but that's a whole different beast), but I've used others before. I'm not talking about the content on these services or how any company manages their original content, etc. This is specifically about the UI and user experience\n\nWhen I boot up Netflix, it's always snappy, it's always easy to find what shows I've been watching and continue, the app lets me go to a series page BEFORE loading an episode, it's the best about knowing I want to restart a movie/show when the progress bar is near the end, the \"are you still watching?\" prompt is actually consistent. Nearly all of this stuff is either worse or non-existent on the other streaming services I use. Hulu makes me jump through hoops to get to a series page. HBO Max will throw up huge show banner ads I have to scroll through before I can start looking at my library\n\nMaybe there's other streaming services that compete with Netflix more in this regard, but it's something that's really been bothering me lately. If I'm bored and don't know what to watch, I'll boot up Netflix 95% of the time because browsing it feels good compared to my other options.\n\nDoes anyone else here share this opinion? I've tried googling it, but all the Reddit posts are complaining about what shows are available or just complaining about streaming in general",
        "upvotes": 469,
        "comments": 255,
        "media": null,
        "permalink": "/r/netflix/comments/1oqxuou/why_does_it_seem_like_netflix_is_the_only/"
    },
    {
        "id": "1or4cc0",
        "author": "Repulsive_Knee9258",
        "title": "Frankenstein was beautiful",
        "content": "I won’t spoil anything but it was a truly beautiful movie, I love how they showed both perspectives of the story telling Victor’s and Frankenstein’s. The visuals in this movie were just amazing, you can tell Netflix spent a lot on this movie. I think this movie might be the best film I’ve seen come out on Netflix this year. Guillermo del Toro once again has proven he’s the best director for the dark fantasy genre of our generation. Highly recommend this film. Loved the acting of Oscar Isaac, Christoph Waltz and Jacob Elordi. excellent casting as well. I can see this even getting some Oscar nominations. 5/5 for me. ",
        "upvotes": 219,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1or4cc0/frankenstein_was_beautiful/"
    },
    {
        "id": "1ordwpl",
        "author": "Hopeful74",
        "title": "Greiving KAOS",
        "content": "I know I am late in the game, but this was such an intelligent, soulful piece of entertainment.  Not a weak acting performance, amazing retelling of Greek Mythology.  I am so disappointed this show was cancelled, only found out just now upon finishing the series.  It is probably too late now to collect all of the amazing talent that made this happen, but I wish so much they would, or a different production company would.  Do you all think that is at all possible at this point?  One year out?  So often it takes series to become successful after 1 - 2 years into it… such an incredible shame to not have faith in this series, we need it now more than ever.\n\nI guess I just wish I understood the industry more than I do.  In my ignorant mind, I would think an old school, heavy clout, heavily connected actor like Jeff Goldblum, or any of the other high tier actors on the show, could call up Amblin Entertainment and the like and get it produced somewhere else if Netflix insisted on canceling it.  But again, I am ignorant to the entertainment industry and the way it works.",
        "upvotes": 33,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ordwpl/greiving_kaos/"
    },
    {
        "id": "1ortt2g",
        "author": "bottlecoco",
        "title": "Looking for dark, dank, adult comedy movies &amp; shows",
        "content": "Hey guys,\nI’m in the mood for some good dark, twisted, adult humor — something that’s not your typical mainstream comedy. I love stuff that’s a bit edgy, sarcastic, or morally questionable but still hilarious.\nCan you recommend some movies or TV shows in that vibe?",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1ortt2g/looking_for_dark_dank_adult_comedy_movies_shows/"
    },
    {
        "id": "1oqw0hh",
        "author": "Fun_Molasses5215",
        "title": "Chrishell Stause officially announces she's quitting Selling Sunset after nine seasons on the show",
        "content": "",
        "upvotes": 239,
        "comments": 85,
        "media": null,
        "permalink": "/r/netflix/comments/1oqw0hh/chrishell_stause_officially_announces_shes/"
    },
    {
        "id": "1orlrc9",
        "author": "AtomixMaster25",
        "title": "I need some series recommendation",
        "content": "I am bored and want some recommendations,I don't like very like heavy series I enjoyed watching young Sheldon,bbt,Kim's Convenience,suits etc. \n\nI also like basketball series \n\nJust told all this so that u guys can help🙏\n\nAlso I live in India so some shows might not be available.\n\nThanks ",
        "upvotes": 3,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1orlrc9/i_need_some_series_recommendation/"
    },
    {
        "id": "1orngg6",
        "author": "mugiwara_no_Soissie",
        "title": "Anyone else tired of shows not having the right language.",
        "content": "Like im dutch, and about 90% of the anime they have on Netflix has languages as german and Japanese, and subtitles as only german, which would be nice if we spoke german here... instead we speak Dutch lol.\n\nAnd im not talking about obscure stuff, im talking about shit like demon slayer, which is one of the most popular anime of the last decade.\n\nIt actually happens so often that we dont even have English subs, in a country which is known for having a very large bilingual population...",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1orngg6/anyone_else_tired_of_shows_not_having_the_right/"
    },
    {
        "id": "1orgvn8",
        "author": "crooked_smile_49",
        "title": "Anyone Notice this?",
        "content": "I noticed how Ginny and Georgia already started filming after taking 1-1.2 year(s) to release other seasons, and Wednesday will start filming first quarter of next year after taking 3 years to release season 2. \n\nSo was Stranger Things slowing everything down? Which could be the reason they started leaning more into reality tv? (waste of money, leave it to peacock) \n\nHopefully this means they’ll stop turning in all these pasta noodle craft assignments labeling them series and actually produce SHOWS. #grandarmy #KAOS \n",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1orgvn8/anyone_notice_this/"
    },
    {
        "id": "1ork4b4",
        "author": "Arbegia",
        "title": "how do I permanently hide the Netflix interface when watching Fullscreen? (PC)",
        "content": "**FOUND THE SOLUTION**. **1). Download the Chrome addon Stylus. 2). add the script below to Stylus, then hit save. 3). Restart your browser**\n\n^(/\\* Netflix \\*/)\n\n^(:fullscreen .watch-video--back-container,)\n\n^(:fullscreen .watch-video--flag-container {)\n\n^(display: none !important;)\n\n^(})\n\n^(:fullscreen .watch-video--bottom-controls-container:hover {)\n\n^(cursor: auto !important;)\n\n^(})\n\n^(:fullscreen .watch-video--bottom-controls-container:not(:hover) {)\n\n^(opacity: 0 !important;)\n\n^(})",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ork4b4/how_do_i_permanently_hide_the_netflix_interface/"
    },
    {
        "id": "1orjaen",
        "author": "yippeee1999",
        "title": "GLOW (Gorgeous Ladies of Wrestling)",
        "content": "So I'm now watching GLOW and am well into Season Two.  Just before creating this particular post, I searched to see if there was already a GLOW discussion, and I saw some from discussions from...over 7 years ago??  Is it possible the series is that old?  And if so, maybe it means that Netflix periodically re-releases or puts certain shows (like GLOW) back in the queue for re-watching?  I say this because...I'd never heard of this show until recently, and likely it's because when I signed into Netflix one day...a few months ago...that GLOW appeared at the top of my feed, and so I naturally assumed it was new.\n\nAnyway, for those not familiar, while a show about female wrestling sounds tacky, they've really done a great job with the show...the cast (particularly the female leads, as well as Marc Maron - who is fantastic in his role) is great.  The show is clever...well-executed.\n\nFor those who've already seen the show, I'm curious if, like me, you had assumed that Season 2, Episode 7 was going to be the series finale?  (That was the episode that included a...er...broken ankle - I don't want to give too much away ...any spoilers.... )  Considering that episode, and the way that episode closed out, I actually think it would have been a perfect way to end the series.  So imagine my surprise when I saw 'Next Episode' loading up on my screen.\n\nEither way, if you've not yet watched GLOW, I highly recommend it.\n\nAlso....Hot Spot (with Japanese subtitles) and Pernille (Norwegian subtitles).",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1orjaen/glow_gorgeous_ladies_of_wrestling/"
    },
    {
        "id": "1ormk9w",
        "author": "Iazysude",
        "title": "what will be the top global show of this week?",
        "content": "so im into prediction market and i wanna bet on which show is going to be top global show of this week and polymarket where i bet is showing 84% chance of witcher s4 but i dont think, So can we have discussion?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ormk9w/what_will_be_the_top_global_show_of_this_week/"
    },
    {
        "id": "1orfxz5",
        "author": "EverySingleMinute",
        "title": "Can Netflix and every other streaming service, stop playing a preview of a show when my cursor is on the thumbnail for more than a second?",
        "content": "It is so irritating when I am trying to read about the show and suddenly it starts playing the preview.  If I want to watch a preview, I will click on it to play the preview.  \n\n",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1orfxz5/can_netflix_and_every_other_streaming_service/"
    },
    {
        "id": "1or3vqq",
        "author": "[deleted]",
        "title": "'KPop Demon Hunters' Get 3 Grammy Nominations for 'Golden'",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1or3vqq/kpop_demon_hunters_get_3_grammy_nominations_for/"
    },
    {
        "id": "1org7tg",
        "author": "haydenclaireheroes",
        "title": "Should You Watch The Diplomat?",
        "content": "",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1org7tg/should_you_watch_the_diplomat/"
    },
    {
        "id": "1oqittg",
        "author": "potatoMan8111",
        "title": "My biggest pet peeve with netflix…",
        "content": "Why oh why can they just not show the trailer of the movie or season of the show when you are looking around what to watch?!? I dont want to see some random 30-60 second clip of a random part of the movie or show!!! \n\nThey do sometimes but it’s definitely like 85% just a random scene.",
        "upvotes": 88,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1oqittg/my_biggest_pet_peeve_with_netflix/"
    },
    {
        "id": "1oqy3hq",
        "author": "misterpopculture",
        "title": "Netflix Announces New Competition Series Turning Retail Into a Shopping Frenzy",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oqy3hq/netflix_announces_new_competition_series_turning/"
    },
    {
        "id": "1orfz55",
        "author": "ex1stence",
        "title": "Ugh, Frankenstein looks like THAT",
        "content": "Fine movie, didn't mind the sets or the acting or the music. Tells an old familiar story but with a new angle, fine fine fine.\n\nAnd that's what the cinematography was...fine. Just fine. Kinda like I was watching Mary Shelley's Stranger Things.\n\nIf there's one thing that gets to me about Netflix projects these days, it's the oppressive flattening of all editors, colorists, cinematographers, and directors into a focus group-tested, phone-friendly 21:9 box.\n\nGuillermo Del Toro's movies have, at least until now, always had a *look* to them. Hard to put on paper but if I had to try I'd say it's almost like opening a storybook with wilted pages. Like everything you're seeing is through the lens of dust and water logged spines. The fantastical, whimsical nature of his characters and stories demanded an almost painterly kind of approach, and from Pan's Labyrinth to The Shape of Water there was always a distinct sense that what we were watching was pulled from a fable, or comic, or storybook. But not a copy that was particularly well-taken care of, if that makes sense?\n\nBut Frankenstein is just...yeah, the \"Netflix style\". I could be watching one of his movies, or any other director, and on a blind reveal there's no way I would know the difference.\n\nDirection is supposed to be about that \"stamp\", that thing that's ineffable but still lets everyone know you're watching a Tarintino film, or Scorcese, or Toro. An angle, a color palette, a way of framing the scene. These distinct, inescapable elements of flavor and talent that drip from every frame put to film by the greats of our time.\n\nNot here, though. Frankenstein might as well be a big-budget episode of Wednesday as far as my eyes can tell. Not much difference to be found.\n\nI wonder if it's bad for us, tbh. To have every show and movie we watch compressed into a streamer-friendly, phone-ready format that pulls every imperfection off the screen in favor of streamlined choices that retain subscriber interest, and therefore, shareholder value.\n\nNo difference in vision, no change in shots. Colors, same. Vision, same. Palette, same.\n\nUgh. I miss the old studio system sometimes.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1orfz55/ugh_frankenstein_looks_like_that/"
    },
    {
        "id": "1oq6qz5",
        "author": "Significant-Fun-4235",
        "title": "'Monster' Season 4: Sarah Paulson to Play Aileen Wuornos (EXCLUSIVE)",
        "content": "",
        "upvotes": 63,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1oq6qz5/monster_season_4_sarah_paulson_to_play_aileen/"
    },
    {
        "id": "1oql52r",
        "author": "junewick",
        "title": "Soulmates on Netflix - Episode 2 is an insane opposite of Promising Young Woman",
        "content": "Netflix is suggesting the show Soulmates now, so for some reason I’m watching it five years late. But Episode 2 is just wild. I hate watching episodes like this because it always makes me think the writers are sexual predators. Like this is not a real story, some poor professor is super innocent and all these young girls keep throwing themselves at him and his life gets ruined because someone takes revenge. This is the myth that predators hide behind.\n\nThis is the exact plot of Promising Young Woman in reverse, that also came out in 2020. When I was watching it, I thought Soulmates was recent so I was shocked. But knowing it’s from 2020 too makes more sense, I don’t think it would have been produced in a post-Promising Young Woman world. ",
        "upvotes": 8,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1oql52r/soulmates_on_netflix_episode_2_is_an_insane/"
    },
    {
        "id": "1or20hh",
        "author": "Darky1324",
        "title": "Netflix don't wanna download anything",
        "content": "So as the title says my netflix literally refuses to download anything  \ni did everything what i can turn off the wifi and turn it back on  \nrestart the download  \nclean the caches of it  \nbut it just get there in to the downloads and exist there  \ncan't even cancel it can't even start it  \nand my netflix is up to date if someone ask me   \nso i just dont know whats happening to my netflix like it worked before but it just died for some reason  \nany help?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1or20hh/netflix_dont_wanna_download_anything/"
    },
    {
        "id": "1oqb4ea",
        "author": "Zehealingman",
        "title": "What did Inside Job do wrong?",
        "content": "I‘m being serious and hoping to gain external input to balance out my own perception and biases.\n\nIt feels like in a vacuum, Inside Job had everything it needed to at least finish the story it tried to tell.\n\nIt had a, in my opinion, highly differentiated setting that was directly connected to the current cultural zeitgeist with its focus on conspiracy theories and media manipulation. \n\nThrough that setting, it had touchpoints with „older“ generations (Moon landing conspiracies, JFK), younger generations (Social Media and media in general) and everything in between with stuff like the Illuminati. \n\nIt had two main characters that had tangible growth and a supporting cast that had its moments.\n\nIt had personal storytelling which included parenthood and trauma.\n\nIt feels like all of the above could be attributed to shows like Hazbin or Southpark which are going strong. \n\nI know media is more complex than being a checklist. But what happened? Did Netflix calculate KPIs that were too unrealistic? Did it not resonate?",
        "upvotes": 15,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1oqb4ea/what_did_inside_job_do_wrong/"
    },
    {
        "id": "1oqflkd",
        "author": "OpeningFull6575",
        "title": "Are there any good anime live action adaptations?",
        "content": "So my mum hates anime, she thinks its weird and claims it is all pornagraphic. However she quite enjoys the Avatar Netflix live action show and we have bonded over Alice in borderland. Because of that I'm thinking of watching some live action anime addiptations with her. My current plans are:\n\n1. The zom 100 movie\n2. The one piece liveaction show (I've never watched the anime so I wouldnt have the issue to comparing them)\n3. Maybe one of the kakegurui liveactions. I adore the anime so I'm scared of how bad they'll be, but I don't wanna write them off\n\nI have most streaming services, though I don't have crunchyroll.",
        "upvotes": 5,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1oqflkd/are_there_any_good_anime_live_action_adaptations/"
    },
    {
        "id": "1oq3bpq",
        "author": "Goooooogol",
        "title": "What does everybody think of netflixes UI?",
        "content": "What i mean by this is the rows of shows you see on the homescreen.\n\nI personally hate how my List just moves seemingly at random when it should stay in a findable place, because it is difficult to remember what shows i wanted to watch if my list keeps moving locations. I know there is a button for it, but its easy to forget it’s there.\n\nI do think the Continue Watching and Watch List rows should stay at the top of the screen, and i have no idea why netflix makes finding them difficult from time to time.",
        "upvotes": 21,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1oq3bpq/what_does_everybody_think_of_netflixes_ui/"
    },
    {
        "id": "1orc52e",
        "author": "Classic_Actuary8275",
        "title": "The perfect neighbor-I feel bad for her",
        "content": "I have to tell you, I am 15 1/2 minutes in and that is it. And I feel bad for the neighbor lady. The one who ends up losing her mind on these kids. I think they really were driving her crazy. I’m empathetic to her because When I was pregnant and postpartum, I lived in an apartment that had really bad noise insulation and I literally lost my mind. Because I had different noises from every direction and kids were screaming outside all the time right outside my window. It was crazy and I had intrusive thoughts about shooting up to my neighbor. Postpartum is a really odd time so just know you could never understand it if you haven’t been through it. I never had any plan to do it, it was an intrusive thought that would come into my brain that I didn’t want there. But I really lost my mind from lack of sleep from the noise and lack of peace. Does anyone else feel for her? Maybe something else happens later on that I haven’t seen yet that will change my mind.",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1orc52e/the_perfect_neighbori_feel_bad_for_her/"
    },
    {
        "id": "1oqogpn",
        "author": "GenTrapstar",
        "title": "Vince Staples Show",
        "content": "Just finished season 2 and enjoyed it. Hopefully we get a season 3. I can’t truly remember the first season except for the mascot guy and was wondering if he would get an appearance in season 2. He probably died in the first season and don’t even remember if he did. Anyways I enjoyed the second season. The show seems simple but they do it right in my eyes. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oqogpn/vince_staples_show/"
    },
    {
        "id": "1opwhdu",
        "author": "Immediate_Strike7720",
        "title": "Alice in Borderland 3",
        "content": "Has anyone watched this and felt like this season was a massive letdown? I feel like if they had stopped at 2 seasons it could’ve been great, personally I feel season 3 was all over the place ",
        "upvotes": 33,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1opwhdu/alice_in_borderland_3/"
    },
    {
        "id": "1oqlz6i",
        "author": "Specialist-Change-86",
        "title": "Finally have the release schedule for Stranger Things Season 5",
        "content": "I honestly kind of forgot about the fifth season. The fourth season was a long, long time ago,  when AI did not boot me off my job. Found a helpful release schedule for the final season:\n\n[https://www.soapcentral.com/shows/stranger-things-season-5-release-schedule-here-s-streaming-guide-netflix-sci-fi-horror-drama-s-final-chapter](https://www.soapcentral.com/shows/stranger-things-season-5-release-schedule-here-s-streaming-guide-netflix-sci-fi-horror-drama-s-final-chapter)",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oqlz6i/finally_have_the_release_schedule_for_stranger/"
    }
]