[
    {
        "id": "1mfcgko",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Monday 8/4 at 12:00 PM ET - All 4 Teenage Mutant Ninja Turtles from the 1990 film (!!!) - Josh Pais (Raphael), Michelan Sisti (Michelangelo), Dave Forman (Leonardo) &amp; Leif Tilden (Donatello)",
        "content": "",
        "upvotes": 72,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5ckzpd5zzhgf1.jpeg?auto=webp&amp;s=cb770170cd8f9661ce252e74c7f5f8041dfa04b0"
        },
        "permalink": "/r/movies/comments/1mfcgko/amaqa_announcement_monday_84_at_1200_pm_et_all_4/"
    },
    {
        "id": "1mek9va",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (The Naked Gun / The Bad Guys 2 / Oh, Hi!) Plus Throwback discussions",
        "content": "**New In Theaters**:\n\n* [The Naked Gun](https://old.reddit.com/r/movies/comments/1mek6y9/official_discussion_the_naked_gun_spoilers/?)\n* [The Bad Guys 2](https://old.reddit.com/r/movies/comments/1mek6zd/official_discussion_the_bad_guys_2_spoilers/?)\n* [Oh, Hi!](https://old.reddit.com/r/movies/comments/1mek716/official_discussion_oh_hi_spoilers/?)\n\n**25th Anniversary Throwback Discussion Threads**:\n\n* [The Nutty Professor II: The Klumps](https://old.reddit.com/r/movies/comments/1mek84u/official_throwback_discussion_the_nutty_professor/?)\n\n**Still In Theaters**:\n\n* [Together](https://old.reddit.com/r/movies/comments/1mcudby/official_discussion_together_spoilers/?)\n* [The Fantastic Four: First Steps](https://old.reddit.com/r/movies/comments/1m8n0ic/official_discussion_the_fantastic_four_first/?)\n* [Sorry, Baby](https://old.reddit.com/r/movies/comments/1m8n0k6/official_discussion_sorry_baby_spoilers/?)\n* [Eddington](https://old.reddit.com/r/movies/comments/1m2q3dy/official_discussion_eddington_spoilers/?)\n* [Superman (2025)](https://old.reddit.com/r/movies/comments/1lwutny/official_discussion_superman_2025_spoilers/?)\n\n\n**New On Streaming:**\n\n* [War of the Worlds (2025)](https://old.reddit.com/r/movies/comments/1mek72y/official_discussion_war_of_the_worlds_spoilers/?)\n* [Happy Gilmore 2](https://old.reddit.com/r/movies/comments/1m9hjw9/official_discussion_happy_gilmore_2_spoilers/?)\n* [Heads of State](https://old.reddit.com/r/movies/comments/1lr5yb4/official_discussion_heads_of_state_spoilers/?)\n* [The Old Guard 2](https://old.reddit.com/r/movies/comments/1lr5ycn/official_discussion_the_old_guard_2_spoilers/?)\n* [Ice Road: Vengeance](https://old.reddit.com/r/movies/comments/1lr5ye1/official_discussion_ice_road_vengeance_spoilers/?)\n* [KPop Demon Hunters](https://www.reddit.com/r/movies/comments/1lghony/official_discussion_kpop_demon_hunters_spoilers/)\n* [Echo Valley](https://www.reddit.com/r/movies/comments/1lar0eb/official_discussion_echo_valley/) \n* [Deep Cover](https://www.reddit.com/r/movies/comments/1lar0ej/official_discussion_deep_cover/)",
        "upvotes": 28,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1mek9va/official_discussion_megathread_the_naked_gun_the/"
    },
    {
        "id": "1mfk256",
        "author": "1961Deckard",
        "title": "Buster Keaton and Sybil Seely as newlyweds building a mail order home.. from the silent short comedy \"One Week\" 1920",
        "content": "",
        "upvotes": 1348,
        "comments": 41,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/g629f5dx0kgf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1mfk256/buster_keaton_and_sybil_seely_as_newlyweds/"
    },
    {
        "id": "1mf7z4v",
        "author": "MarvelsGrantMan136",
        "title": "Mark Ruffalo Returning as the Hulk for ‘Spider-Man: Brand New Day'",
        "content": "",
        "upvotes": 10423,
        "comments": 878,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1t-VkfYfWE8-ZlYlRqmX-Hw28GqwuOJ-oc7yawugznE.jpeg?auto=webp&amp;s=af44c3e57776d99cb6bf9bafeb104d25ee544dcd"
        },
        "permalink": "/r/movies/comments/1mf7z4v/mark_ruffalo_returning_as_the_hulk_for_spiderman/"
    },
    {
        "id": "1mfa9z4",
        "author": "MarvelsGrantMan136",
        "title": "Margot Robbie Eyed to Star in Tim Burton’s ‘Attack of the Fifty Foot Woman’ With LuckyChap in Talks to Produce",
        "content": "",
        "upvotes": 2867,
        "comments": 201,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/apcQLlyEhiw1818voEeaf7mX4dgN8cG4FLcH17xhBxs.jpeg?auto=webp&amp;s=5ead23b54a0b503ae3ca6c2faa6b90da00ffe3b6"
        },
        "permalink": "/r/movies/comments/1mfa9z4/margot_robbie_eyed_to_star_in_tim_burtons_attack/"
    },
    {
        "id": "1meztk3",
        "author": "MarvelsGrantMan136",
        "title": "‘Star Wars: A New Hope’ Will Get 50th Anniversary Theatrical Re-Release on April 30, 2027",
        "content": "",
        "upvotes": 5445,
        "comments": 707,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vtRyQplo638cY9t-VdNeg-L4QpPsHk20VbMDd7849lU.jpeg?auto=webp&amp;s=586bae2bed755dfc9ce608c0930c6568ab8878a9"
        },
        "permalink": "/r/movies/comments/1meztk3/star_wars_a_new_hope_will_get_50th_anniversary/"
    },
    {
        "id": "1mf1ibo",
        "author": "indiewire",
        "title": "It's Not Too Late for the Movies to Reject AI",
        "content": "",
        "upvotes": 2486,
        "comments": 439,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S95hNBtUSdlQudmzbS_4Exl49sAcziNzZ9NXnv2ZaNU.jpeg?auto=webp&amp;s=421524954f4d5cdb9d797cd36f00c6ed1fd08a76"
        },
        "permalink": "/r/movies/comments/1mf1ibo/its_not_too_late_for_the_movies_to_reject_ai/"
    },
    {
        "id": "1mf32fh",
        "author": "MarvelsGrantMan136",
        "title": "‘A Quiet Place Part III’: John Krasinski Returning To Direct, Write &amp; Produce, Sets July 9, 2027 Release",
        "content": "",
        "upvotes": 1361,
        "comments": 234,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7f2NMelF0SepV7DbwokCqncDF5RbzNxqtwudyN38JQs.jpeg?auto=webp&amp;s=b0bb281a3b4b909f082c1d72be32d8e552f9189f"
        },
        "permalink": "/r/movies/comments/1mf32fh/a_quiet_place_part_iii_john_krasinski_returning/"
    },
    {
        "id": "1mf2rgd",
        "author": "NoCulture3505",
        "title": "Liam Neeson Talks 'Naked Gun' Reboot and Ending His Action Star Era (New Interview)",
        "content": "",
        "upvotes": 1409,
        "comments": 102,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HHHkWHeNECupRHuLOYhZqtkZw_HCrQCf8XMmYCA5vk8.jpeg?auto=webp&amp;s=2e1a9e306264691d44337c4a77f27a1e80cf181b"
        },
        "permalink": "/r/movies/comments/1mf2rgd/liam_neeson_talks_naked_gun_reboot_and_ending_his/"
    },
    {
        "id": "1meva0k",
        "author": "MarvelsGrantMan136",
        "title": "Tim Burton’s ‘Batman’ and ‘Batman Returns’ are returning to theaters for one night only on August 25",
        "content": "",
        "upvotes": 2849,
        "comments": 184,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3OzuBFZzyro9d9nZek7_kqVLCfV4nQkqF64N83iXPAw.jpeg?auto=webp&amp;s=1639628276920fa3b45bf4e0351ad98a288f7bf0"
        },
        "permalink": "/r/movies/comments/1meva0k/tim_burtons_batman_and_batman_returns_are/"
    },
    {
        "id": "1mfc42v",
        "author": "Square-Resolution561",
        "title": "Speed Racer 2008 is visually unique, creative, crazy, and heartfelt, it's one of my favorite movies that I feel doesn't get appreciated as much as it should.",
        "content": "I absolutely love Speed Racer 2008 and I find it incredibly creative and unique. I still haven't seen anything truly like it since then. First off, wow is this movie visually unique, and in my opinion visually stunning. It looks like a moving comic book, a live action cartoon or anime. It doesn't just look like one either, everything is very heightened and stylistic, the way characters talk, the cinematography, and all the vibrant colors make it look and feel like a live action cartoon/anime. Another thing the action and racing scenes are crazy, you've got races on hot wheels meets wacky races meets fever dream race tracks, cars can defy the laws of physics and do so constantly, but it's so frenetic yet so smooth and fluid/slick looking. There's this one shot towards the end with speed slickly maneuvered down the track, and there's a split second close up of the 6 on the side of the car. Man, I love shit like that, it's badass and creative to me. Not to mention there is both car fu with cars literally bonking into each other and doing a car version of pro wrestling, there's actual kung fu as well, with full on martial arts scenes.\n\nDespite all the chaos, there is genuine sincerity and it has a heart, and even something to say. It has an anti mega corporation and corruption message, themes about standing up for what's right and what you believe in, and it owns that message. Another nice detail is the family genuinely cares about each other and helps each other through hard times, which I find kinda rare to see done so sincerely in a family movie like this. Also racer X is awesome, and like a batman and daredevil hybrid. Speed is awesome too and just a genuine good person, at least from what I remember. Finally, this movie is just fun man, it's energetic and has good vibes for me. Probably helped I saw it in theaters as a kid, so childhood memories and nostalgia kinda drive it, pun intended, but what do you guys think? Is it underrated? A cult classic? Rightfully rated? Let me know, I'm curious on differing opinions.",
        "upvotes": 351,
        "comments": 123,
        "media": null,
        "permalink": "/r/movies/comments/1mfc42v/speed_racer_2008_is_visually_unique_creative/"
    },
    {
        "id": "1mf6xak",
        "author": "onii-piece17",
        "title": "Pokémon the Movie 2000 is temporarily Free on YouTube",
        "content": "",
        "upvotes": 605,
        "comments": 40,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wP3cHra4x8gox-1sN7jW-aXAjrsKHHpV3pEYsLOLvBk.jpeg?auto=webp&amp;s=0d44a1a748f7bf0c1671c5185de05195aa99042c"
        },
        "permalink": "/r/movies/comments/1mf6xak/pokémon_the_movie_2000_is_temporarily_free_on/"
    },
    {
        "id": "1meytyg",
        "author": "MarvelsGrantMan136",
        "title": "Moviefone Phone Line Reconnected for First Time in 10 Years for ‘The Toxic Avenger'",
        "content": "",
        "upvotes": 1086,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/f0dGm8hMjL-NnDyW2y4NIkPEpbyrjXXKVYoduTAFdmI.png?auto=webp&amp;s=84914e302d9b19c9d16743e4d0b9796991cb9df6"
        },
        "permalink": "/r/movies/comments/1meytyg/moviefone_phone_line_reconnected_for_first_time/"
    },
    {
        "id": "1mf3kvt",
        "author": "TerrifierBlood",
        "title": "'Whalefall' - Survival Movie About a Dude Trapped Inside a Whale Hits Theaters in October 2026",
        "content": "",
        "upvotes": 569,
        "comments": 72,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/uYQPQB5OajI1wzYVxl4KkvWBNWBmuYDi-Zyo4zihKyk.jpeg?auto=webp&amp;s=8d1dc7ba067ca6d48532b6b8d27cd3ba9f795747"
        },
        "permalink": "/r/movies/comments/1mf3kvt/whalefall_survival_movie_about_a_dude_trapped/"
    },
    {
        "id": "1mf233m",
        "author": "KillerCroc1234567",
        "title": "New poster for \"Casper\", returning to theaters on October 3rd",
        "content": "",
        "upvotes": 653,
        "comments": 164,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9llj3fqkwfgf1.jpeg?auto=webp&amp;s=503a5dcd771b0527758885ddf2883d6adc6b0e79"
        },
        "permalink": "/r/movies/comments/1mf233m/new_poster_for_casper_returning_to_theaters_on/"
    },
    {
        "id": "1mfgbnm",
        "author": "Massive-Night",
        "title": "Kubo and the Two Strings — Beautiful Movie, But That Ending Didn’t Sit Right With Me",
        "content": "I just finished watching Kubo and the Two Strings — and don’t get me wrong, it’s absolutely beautiful. The animation, the music, the emotion, the mythology — it’s one of the most visually and emotionally compelling animated films I’ve seen.\n\nBut I need to be honest: the ending deeply bothered me.\n\nLet’s be real here:\nThe Moon King is the root of all the tragedy in this story. He tried to steal Kubo’s eyes, destroyed his own daughter for loving a mortal, manipulated his other daughters into becoming assassins, and was indirectly responsible for the death of Kubo’s father and mother. He shattered his family. He burned everything.\n\nAnd in the end… he loses his memory. The villagers, unknowingly, lie to him — tell him he’s always been kind, good, noble. They basically gaslight him into believing he’s someone else entirely.\n\nMeanwhile, Kubo is alone. His parents are gone. His only family left is the man who ruined his entire life — and that man gets to live on, apparently innocent, surrounded by people who praise a version of him that never existed.\n\nForgiveness doesn’t mean suppression.\nAnd kindness without justice is incomplete.\n\nI get what the film was trying to say — that violence didn’t work, that maybe kindness could lead to healing. But kindness without memory? Without accountability? That’s not healing — that’s amnesia. That’s ignorance.\n\nWhat bothered me most is that Kubo knows who the Moon King really was. He carries all that pain. But he’s forced to just… let it go. There’s no reckoning. No moment of justice. The very person who destroyed everything lives on with a clean slate, while those who were good and loving are gone forever.\n\nWhy is it that the only person who survives the story is the one who caused all the harm?\n\nAnd honestly, what if he starts to remember? What if, like Kubo’s father, he begins to recall the past? There’s no reason to assume he wouldn’t go back to being who he was. And even if he doesn’t — that’s not justice. That’s a soft reset the story didn’t earn.\n\nThis isn’t me hating on the movie. I loved so much of it.\nBut the ending? It felt off. It felt like the wrong person got to live, and the right people didn’t. That’s not a satisfying ending. That’s a morally confusing one.\n\nWould love to hear how others felt about this.\n",
        "upvotes": 87,
        "comments": 36,
        "media": null,
        "permalink": "/r/movies/comments/1mfgbnm/kubo_and_the_two_strings_beautiful_movie_but_that/"
    },
    {
        "id": "1mf90ex",
        "author": "ultimate_bromance_69",
        "title": "What do you think is a great performance by an otherwise “average” actor?",
        "content": "Not to diminish anyone’s talents but sometimes actors known for being “average” or “just ok” have a surprisingly great performance. Either due to the role, writing, or direction, it’s always exciting to see someone shine in their performances. \n\nI was recently watching “Being John Malkovich” and was pleasantly surprised by Cameron Diaz. I think this and Bad Teacher are her best performances. \n\nSimilarly, I don’t think Megan Fox is renown for her acting chops but she was amazing in Jennifer’s Body. \n\nWho else would you consider “average” and what role did they really shine in?",
        "upvotes": 231,
        "comments": 741,
        "media": null,
        "permalink": "/r/movies/comments/1mf90ex/what_do_you_think_is_a_great_performance_by_an/"
    },
    {
        "id": "1mfdne5",
        "author": "AKL_wino",
        "title": "The enduring brilliance of Peter Sellers: ‘There’s never been a better comic actor’",
        "content": "The actor was born 100 years ago – and his performances still induce hysteria today. Fans and collaborators like Michael Palin, Woody Allen and Lesley Anne-Down explain why\n\nAndrew Pulver\n‘He made me so happy I forgot about my spots’\nMichael Palin\n\nAlong with Spike Milligan, Peter Sellers lit up my teenage years. I knew that Connie Francis would never return my love, but Spike and Peter delivered something almost as good – and that was deep, satisfying and highly contagious laughter. Laughter that made me so happy I forgot about my spots.\n\nSpike was the imaginative genius who wrote The Goon Show but it was Sellers who brought me to tears with his gallery of unforgettable characters: Major Bloodnok, Bluebottle, Henry Crun, Hercules Grytpype-Thynne.\n\nHe was my hero long before I knew what he looked like. On my first day at Oxford university, I made a lifetime friendship founded on a mutual adoration of the album Songs for Swingin Sellers (with a pair of legs swinging from a branch on the cover). Sellers was not just a man of many voices, he was a gifted actor, and each voice came with a character. The more I heard him the more I wanted to be like him. He showed me there was something far more important than sport and girls and modern history class, and that was making people laugh.\n\n‘His funniness was just magically there’\nWoody Allen\n\nAll I can say about Peter was that apart from all his character skills and voices and technical brilliance, he had a built-in funny quality and made you laugh the minute he appeared on screen. It’s nothing you can learn and very few even successful comics have it. I’m sure there was nothing he could do to produce it or understand it himself. It was just magically there, that funniness.\n\n‘I remember thinking: “Is it­ ­possible to die from laughing?”’\nSanjeev Bhaskar\n\nWhen I was a kid, my parents and their friends would have these dinner parties, for want of a better term, where the children were all fed first and then shoved into a room with the telly. One night, a film called The Party came on the TV, the one where Sellers plays an Indian actor. I watched it and I remember thinking: “Is it possible to die from laughing?” Because I was laughing so much I was in pain.\n\nIt’s a controversial film now but I still love it, in the same way that I always defend It Ain’t Half Hot Mum. We’re living in a time where people strip things of context, and either celebrate or denigrate things. But for me his performance was so funny and it was so deftly done. Given its time, I don’t find anything offensive about it. I think, crucially, he wasn’t trying to be offensive. He had already played an Indian character in The Millionairess with Sophia Loren and that was why I suggested their song title, Goodness Gracious Me, for our sketch show, because it’s reclaiming it. It sounds more grand than it really was, but we were trying to suggest a changing of the guard. But again, I wasn’t offended as a child and I’m not offended as an adult. I think it’s of its time. You wouldn’t do that now – you’d find a good Asian actor to play the part – but I always had an affection for him.\n\n‘It’s controversial now, but I still love it’ … Peter Sellers in The Party.\n‘It’s controversial now, but I still love it’ … Peter Sellers in The Party. Photograph: Cine Text/Sportsphoto/Allstar\nI think of the 10 years after The Ladykillers (1955) as peak Sellers, until Dr Strangelove (1964) – a work of genius. That period includes the first two Pink Panther films, The Pink Panther (1963) and A Shot in the Dark (1964), which is, I think, my favourite Clouseau. His brilliance until then is to do with the precision of his performances in terms of character, of vocalising and comic timing. Maybe he was trying to prove himself – his Fred Kite in I’m All Right Jack is a performance without ego. Then he suddenly became a global star, and I think that status meant he became less precise in his performances – until we get to Being There which was him back to his best: a really precise, detailed performance.\n\nThere is a lot that has been written and said about Sellers and what always stuck with me was that his big fear was if you stripped away his characters you wouldn’t find anything there. Blake Edwards said he had the best working times ever with him – and the worst. So I think that he was obviously a complicated person but when you look at it in terms of sheer talent, he was blessed. I don’t think there’s ever been a better comic actor.\n\n‘I met him for dinner – it was like going to meet the queen’\nLesley-Anne Down\n\nMy father, like the rest of the country, absolutely adored The Goon Show, and I grew up listening to it. When I did The Pink Panther Strikes Again in 1976, I was working with an icon – I mean, not even human, he was like a god. The first time I met him was in Munich. The publicist on the movie said Peter wants to have dinner with you, and I remember they were really tense about it. They said: don’t do this, and don’t say that, and, you know, just be a certain way. It was like going to meet the queen. It made me very tense as well, but within five minutes we just hit it off. Obviously I was a bit younger than he was, he was my dad’s age, but we got on exceptionally well. And unlike any amount of men that I have worked with or come into contact with on both sides of the camera, he was a total gentleman for the entire shoot.\n\nAnd it was a very long shoot. Today it would have taken about three weeks, but because it was Peter it was 14 weeks. He’d just be laughing and playing jokes and tricks all day long, sometimes we never actually got a shot completed. We hung out basically day and night for 14 weeks. The crew was huge. It must have cost a fortune but everyone was on board with it, it was like being at a comedy show. Everybody laughing, everybody having fun. I mean, it really was an amazing experience.\n\nSellers and Lesley-Anne Down in The Pink Panther Strikes Again.\nSellers and Lesley-Anne Down in The Pink Panther Strikes Again. Photograph: United Artists/Kobal/Shutterstock\nHe didn’t sleep very much, he liked to stay up all night and end up in the clubs. He loved [vocal ensemble] The Manhattan Transfer, which at the time was a great sound. He smoked a bit of dope, too. I don’t think Peter really liked himself particularly, but a lot of comedians are that way. They’re depressed and they cover it up with laughter. He was always searching for happiness, and people didn’t take tremendous care of themselves back then. Nobody said, I’ve got to go to the gym or the treadmill; people just ate and drank what they wanted and did what they wanted.\n\nI knew there was a side of Peter that could be difficult or disruptive. I had been told about it, but I don’t remember any of that. I think there was one day that Peter and Blake [Edwards] were sitting in their chairs on set, and they were a little bit tense and not talking to each other. I don’t know what that was about, I wasn’t privy to it. But that was the only time that I ever saw anything. I didn’t see Peter being cross or upset or nasty or anything. I only saw his funny, jolly, kind side. We got on like a house on fire. He was a genius. Seriously, what a career.\n\n‘When he did films for directors that knew enough to give him freedom, the results were great’\nChristopher Guest\n\nI met Peter Sellers once. The cast of Beyond the Fringe stayed with my family in New York, and I had the effrontery to ask Jonathan Miller if I could be his assistant. So I went to London and worked on his BBC film of Alice in Wonderland. We were doing some recording at Shepperton studios, and Sellers stopped by. It’s hard to believe I did this, as I was 19, but I thought it was a good idea to start doing a voice that I thought he should hear. He didn’t say anything: he just looked at me and nodded.\n\nI had seen everything he’d done, heard most of what he’d done; he was a very important person for me in the beginning of my career. I guess I fancied that I could do the same thing, like doing different voices. You see, I can do a voice, but Sellers was embedded in those characters, and that commitment made it very different. Obviously he was funny, but he did something that no one else was doing.\n\nSellers in Dr Strangelove or: How I Learned to Stop Worrying and Love the Bomb, directed by Stanley Kubrick.\nSellers in Dr Strangelove or: How I Learned to Stop Worrying and Love the Bomb, directed by Stanley Kubrick. Photograph: Photo 12/Alamy\nHis early films are fantastic, including the ones where he has smaller parts. Obviously the Kubrick stuff is surreal in many ways, he was given the freedom to do what he did. People just didn’t work that way and when he did films for directors that knew enough to let him do that, the results were great. Blake Edwards is not a great comedy director but he was smart enough to let Sellers take off and do what he did.\n\nThis is a little embarrassing, but I remember when he had his first big heart attack in the 60s. I heard about it on the radio. I remember getting extremely upset and actually praying. I had never prayed in my life, and I haven’t since. But I thought, please, to just whoever, I prayed that he would not die.\n\n‘If he was on, it would be like a raging bushfire’\nGeoffrey Rush\n\nI remember seeing Tom Thumb when I was seven – a studio picture, but Sellers was still a Goon. At that stage, he hadn’t decided to make a jump for film stardom. Because at the time, being a Goon was a privileged position. He had a 10-year contract, he and Spike were absurdists and were jazz guys. They put that into their comedy.\n\nWhen I played him [in 2004’s The Life and Death of Peter Sellers], I researched the role for the picture, and I found a copy of almost every Sellers film that existed. You can see the sense of adventure that he had with the early films: Carlton-Browne of the FO, I’m All Right Jack, The Mouse That Roared. I asked everyone if they’d met him. My publicist in the US was a young man who once had to go around to his house and shift some furniture. He said Sellers was very brusque and had no truck with some nobody from some agency. I found that quite interesting. I also met Marty Baum at [talent agency] CAA who handled a lot of Sellers’ contracts in the 70s. Marty said: a lot of people thought Sellers was complicated, a mess and whatever, but I only ever saw an erudite, very polite, very articulate, very intelligent gentleman opposite me at my desk. These are the some of the mosaic bits that we put together to make a biographical film.\n\nSellers, front centre, in I’m All Right Jack.\nSellers, front centre, in I’m All Right Jack. Photograph: Studiocanal Films Ltd/Alamy\nWe wanted to take on the complexity of egomania, super talent, genius. Sellers would have been around so many buzzy, brilliant actors in his career, but unlike him they all didn’t know how to define themselves. People often asked me how I related to him; and I would say: I went in every day and every day in front of the mirror I played somebody else. I think there would be some psychic wear and tear from that. There was something in his personality that was very self-regarding but I would imagine he could have been absolutely hilarious to be with. If he was on, it would have been like a raging bushfire.\n\nAnd ultimately, when he gets to Being There (1979), that performance is as subtle as the greatest Chekhovian performance in a theatre. The thing I remember is his little round dark eyes being so childlike, his skin being so pink and papery from being hidden away from the world. I regard that as the work of a truly great performer.\n\n‘I heard The Goons and it was like a curtain had been drawn back’\nMichael McKean\n\nWe had never heard of Peter Sellers in the US until a flurry in the early 60s. All of a sudden we had Tom Thumb, The Mouse That Roared, The Naked Truth, Two Way Stretch and I’m All Right Jack, which I didn’t quite understand because, at 12, I wasn’t a union member. He was just a brilliant actor and, of course, in The Mouse That Roared he played three really distinct characters. I found the whole thing thrilling.\n\nAnd then I had a friend who said, “Hey, have you ever heard of The Goon Show?” I think they were on WQXR and, my God, it was like a curtain had been drawn back. It was very well crafted anarchy and lunacy. And later he was so brilliant in Lolita and Dr Strangelove; there was a kind of an anarchic quality to what he was doing, but it was never out of control. It was being done by an artist, clearly, and not a clown. I was aware that a lot of the people who made me laugh or who thrilled me as actors were British; Alec Guinness, Stan Laurel and Boris Karloff. So anyway, I had my eyes wide open for good stuff, no matter who was purveying it.\n\nThe Goons … from left, Harry Secombe, Michael Bentine, Spike Milligan and Sellers.\nThe Goons … from left, Harry Secombe, Michael Bentine, Spike Milligan and Sellers. Photograph: Allstar\nI must have seen Dr Strangelove a dozen times and in one viewing I just concentrated on Sellers and watched the small work he was doing as Group Captain Lionel Mandrake. What I love about his work is the little stuff. I didn’t really hear about his private life until well afterwards. And still it is, to me, less interesting than his work. I remember reading Being There and then two years later seeing the film and I’m thinking: he gets this character better than the writer Jerzy Kosinski did. Sellers took this character and made his simplicity so complicated. I think that’s what’s so great about that performance. He was never a stick figure, and he was never just there for the comedy.\n\n‘I was knocked out by the sheer exuberance and the talent’\nPaul Merton\n\nI was slightly too young for The Goons when they were being broadcast, so the biggest impact on me was the 50th anniversary Last Goon Show of All in 1972, which was released as an LP. I was so knocked out by the sheer exuberance and the talent, and I used to listen to the records and practice until I could do the same impressions. I just loved the sort of films Sellers was in, things like I’m All Right Jack and The Wrong Arm of the Law, which is absolutely astonishing. So I became a bit of a Peter Sellers obsessive. My favourite film of his is one that’s quite obscure, The Magic Christian, which is normally mentioned as “other disappointments”. But what other film has both Michael Aspel and Roman Polanski in it?\n\nThe thing about Sellers is that he made more bad films than any other major star. You can look at his career in simplistic terms as being before the heart attack and after. He had the good fortune to be living half an hour from the planet’s best heart hospital in Los Angeles, otherwise we would have been talking about him in the same breath as someone like James Dean. Graham Stark, who knew Sellers longer than most people, said that after the heart attack, he became a completely different person.\n\nSellers, centre, with his son, Michael, left, and Ringo Starr, right, during filming of The Magic Christian in 1969.\nSellers, centre, with his son, Michael, left, and Ringo Starr, right, during filming of The Magic Christian in 1969. Photograph: AP\nThe string of films he made in Britain have all got merit, but things got awkward after he went to Hollywood. In the UK, he was a big fish in a small pond, and he could bend people to his will, but he couldn’t do that in Hollywood. One of the reasons he never won an Oscar was that he just really upset people in the US. He was nominated for Dr Strangelove but he lost to Rex Harrison in My Fair Lady; what a kick in the teeth that must have been. He’d made so many enemies in Hollywood at that point. He wasn’t kissing anybody’s arse.\n\nIn the past three years, I’ve been watching his films in sequence, and Being There comes as like a great beacon of joy towards the end of a miserable run of movies. It shows that he hadn’t lost his talent, he had just been in so many awful films. On Being There, he didn’t have any arguments with anybody, he admired the director, Hal Ashby, there were no tantrums. It was clearly a film that he wanted to do and that one still stands up, particularly in the age of Trump, where somebody can be misunderstood as a potential presidential candidate.\n\n‘He could be eccentric, unpredictable and maddening’\nDick Clement\n\nMy generation viewed listening to The Goon Show as a holy ritual. In school we imitated all the voices. Our parents could not understand our obsession, a generational thing. I worked only once with Peter on a forgettable movie: The Prisoner of Zenda. He played two parts, but I think he got bored. Blake Edwards, who directed him in The Pink Panther said that it was vital to capture him at the right moment, rather like the “magic hour” that film crews call dawn or dusk.\n\nOn location in Vienna, Ian la Frenais and I quickly discovered that he was nostalgic about the old days. The Goons of course, but he liked to delve even further back to his time on the music hall circuit, long before fame. He thought ventriloquists, “vents” for short, were especially crazy. One called Jimmy Tattersall used several dummies in his act, and the climax involved a life-sized old lady operated by remote control, who appeared from the wings while he was singing My Old Dutch. On numerous occasions the old lady malfunctioned, took a savage left turn and ended in the orchestra pit. Peter loved that story.\n\nHe could be eccentric, unpredictable and maddening, but there was never any doubt of his extraordinary talent.\n\n‘He was like a musician nailing every beat’\nStephen Wight\n\nPeter Sellers was a chameleon, one I learned a lot about playing his role in the original stage production of The Ladykillers. These days we associate physical transformation with huge weight loss or gain. Getting ripped for a role so our performer can be an action hero. Sellers saw physical transformation beyond the “outer” and embodied his choices with wondrous results. Some were subtle, some were extreme, but always believable and real. In The Pink Panther Strikes Again there is this wonderful taut and uptight nature to Clouseau which creates a tension and fragility that provides such a glorious platform from the comedy to spring from or break into.\n\nThe juxtaposition of his arrogant, savoir faire vocal performance paired with the chaotic and clownish physicality of character is amazing. His mastery of “playing it straight” yet just on the edge of complete absurdism is nothing short of genius. The scene in which he arrives at the house to interrogate the staff is theatrical farce at its best captured on film. Sellers is like a dancer waltzing between characters and objects, like a musician nailing every beat and flowing with the rhythm of it all. The scene crackles with a sense of everyone on the verge of corpsing. He was funny as hell and made it look effortless. Sellers achieved something every actor strives for but thinks probably doesn’t exist … perfection.\n\nA Peter Sellers season runs at the BFI Southbank, London, from 2-30 August, and Two Way Stretch and Heavens Above are released on 4 August on Blu-ray.",
        "upvotes": 100,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/AYlt20SLkB0uEe3wvIc1B49cK-7gBUjfsXl1HuTqVMI.jpeg?auto=webp&amp;s=b6aac54b1effa1865c975f19a6ad6c94594fa113"
        },
        "permalink": "/r/movies/comments/1mfdne5/the_enduring_brilliance_of_peter_sellers_theres/"
    },
    {
        "id": "1mfa9rh",
        "author": "Bitter-Canary-6578",
        "title": "Just watched Before Sunrise… and I think it became my whole identity",
        "content": "I just watched Before Sunrise for the first time, and I genuinely can’t get over it. It felt like someone took a piece of my soul and put it on screen. The conversations, the silences, the way they saw each other- it was everything I’ve ever longed for but never really found.\n\nOne line that completely melted me:\n“I like to feel his eyes on me when I look away.”\nAs a hopeless romantic… that line is pure magic. It’s not loud or dramatic, but it says so much. That quiet kind of yearning, the unspoken pull… ugh, I felt it in my bones.\n\nAnd this one:\n“If there’s any kind of magic in this world… it must be in the attempt of understanding someone.”\nThat’s exactly how I feel about conversations. Like raw, meandering, unfiltered ones that make you feel seen. Like those rare moments when someone gets you without needing everything explained.\n\nThis film felt like a memory I never had but always wanted. It left something behind in me. Before this, Under the Tuscan Sun ☀️ had a similar effect- sunny, soul-searching, beautifully bittersweet. \n\nBut Before Sunrise? This one quietly became my whole personality ❤️🦋\n\nWould love to hear how it shaped your view growing up or how it changed the way you see things after watching it.\n\nCurrently binging summer movies that make you feel things. Gimme your perfect summer recommendations!\n\nEdit: I’m exactly in my mid-twenties, and honestly, I can’t stop thinking how amazing it would’ve been to experience the trilogy in real-time, every 9 years. What a journey that would’ve been 😭\n",
        "upvotes": 122,
        "comments": 31,
        "media": null,
        "permalink": "/r/movies/comments/1mfa9rh/just_watched_before_sunrise_and_i_think_it_became/"
    },
    {
        "id": "1mexvy9",
        "author": "keepfighting90",
        "title": "'Dark City' (1998) - The Matrix's weirder, more mysterious older brother",
        "content": "Dark City seems to have been somewhat forgotten in the wake of The Matrix's sheer cultural presence and overwhelming popularity. It's easy to see why they're compared so often - both feature a lost, directionless protagonist adrift in a seemingly mundane world that hides the \"real\" world, and deals with a narrative where said protagonist uncovers what lies behind the curtain. \n\nDark City really needs to be seen and experienced though, as aside from these superficial similarities, it's very much its own unique beast and not just a proto-Matrix. \n\nWhat really sets Dark City apart are two things - the visual design and narrative direction. This is an absolutely *incredible* looking movie. The set design, the use of lighting and shadows, and the general ambiance is almost tangible and creates a surreal, dreamlike atmosphere. There's an almost organic, gothic feel in its aesthetics. It really succeeds in making you feel as lost and directionless as John Murdoch. \n\nThe overall story is really compelling as well, and I love the way it goes from a mystery to a sci-fi thriller and damn near cosmic horror at the end when we realize the true nature of the City and the strangers. Alex Proyas wisely keeps the lore rather mysterious and hazy - we never really know who the Strangers truly are, and their objective of understanding human souls is rather nebulous. But it works, and it adds to the hazy, dream logic feel of the movie. \n\nI do have some issues with it though. The characters are fairly dull and one-dimensional - but I guess since they're literally a different person every night or so, it makes sense kind of lol. Still, it's hard to actually care what's happening to them. I also wasn't a big fan of either Rufus Sewell or Kiefer Sutherland's performances. Rufus Sewell felt very stiff and wooden, and Kiefer's performance was just really wacky. The action scenes also feel rather stilted and clumsy, with the final telekinetic battle being the worst culprit.\n\nWith that being said, this movie is worth watching simply because of the vibes, and acts as a moodier, stranger relative to The Matrix if you're into these kinds of narratives.",
        "upvotes": 368,
        "comments": 132,
        "media": null,
        "permalink": "/r/movies/comments/1mexvy9/dark_city_1998_the_matrixs_weirder_more/"
    },
    {
        "id": "1melfib",
        "author": "MoneyLibrarian9032",
        "title": "New 70th anniversary poster for Godzilla.",
        "content": "",
        "upvotes": 2515,
        "comments": 81,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/el9f5e94qbgf1.jpeg?auto=webp&amp;s=e3d9b4f158aa1dce99e99931240d2127ec249b12"
        },
        "permalink": "/r/movies/comments/1melfib/new_70th_anniversary_poster_for_godzilla/"
    },
    {
        "id": "1mf9yv1",
        "author": "Top_Report_4895",
        "title": "The Naked Gun: From the Files of Police Squad! - The Sound of Relief",
        "content": "",
        "upvotes": 64,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/T254YcHzgs3cFiJ_XD1FyYqyhRCsT7yao6zq5Hkq6ZY.jpeg?auto=webp&amp;s=1deade57d986759c5c781734d3446728e66038e2"
        },
        "permalink": "/r/movies/comments/1mf9yv1/the_naked_gun_from_the_files_of_police_squad_the/"
    },
    {
        "id": "1mewlzv",
        "author": "tinoy1989",
        "title": "Which movie ending still haunts you years later?",
        "content": "For me it's The Green Mile (1999). \nWatching the miraculous John Coffey walk to the electric chair knowing he’s innocent, and even welcoming death because of how cruel the world is… it’s unbearable. \nThe worst part? Paul lives on, burdened with the memory and guilt of what they did to a man who showed him love and healing.",
        "upvotes": 274,
        "comments": 338,
        "media": null,
        "permalink": "/r/movies/comments/1mewlzv/which_movie_ending_still_haunts_you_years_later/"
    },
    {
        "id": "1mez9l8",
        "author": "BunyipPouch",
        "title": "New Poster for Psychological-Horror 'Bone Lake' - When two young couples are mistakenly double-booked into the same vacation rental, their romantic weekend becomes a twisted maze of sex, lies, and survival.",
        "content": "",
        "upvotes": 192,
        "comments": 57,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3y1xy2egdfgf1.jpeg?auto=webp&amp;s=fd4abda285a3a842251ec6012f8ee8956cf8cedb"
        },
        "permalink": "/r/movies/comments/1mez9l8/new_poster_for_psychologicalhorror_bone_lake_when/"
    },
    {
        "id": "1mexi0p",
        "author": "indiewire",
        "title": "Eddie Huang Claims Mubi Shelved ‘Vice Is Broke’ After Criticism of Its Investor Ties to Israeli Defense Industry, Mubi Denies Charge",
        "content": "",
        "upvotes": 215,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BpyPRJYFw-K0NhvSIqUULYrEZIEQHTXv9RMziO6AKiA.jpeg?auto=webp&amp;s=0dd8536fdb9e09f442fdddb8bf52a9d64a9ca9a5"
        },
        "permalink": "/r/movies/comments/1mexi0p/eddie_huang_claims_mubi_shelved_vice_is_broke/"
    },
    {
        "id": "1mfebzp",
        "author": "Boo_Brock",
        "title": "What did y’all think about Boyhood?",
        "content": "I remember watching this movie with my dad as we also watched The Grand Budapest hotel, Whiplash, and Birdman when HBO did a buy the Oscar nominee movie promo for the 2015 Oscars. I think it was HBO at least. I was convinced that the Grand Budapest would win (it was in my opinion the best film of the year) but I wanted Boyhood to win. The amount of emotion this movie brought with it, was astounding. I was 16 at the time and I couldn’t believe that this is the movie that brought my dad to tears. I loved this movie and just wanted to see what the general consensus was.",
        "upvotes": 24,
        "comments": 53,
        "media": null,
        "permalink": "/r/movies/comments/1mfebzp/what_did_yall_think_about_boyhood/"
    },
    {
        "id": "1mfd6mi",
        "author": "Longjumping-Salad484",
        "title": "Godzilla: Final Wars (2004)",
        "content": "Ryuhei Kitamura directed. Masahiro Matasuoko as Shinichi Ozaki is pretty cool, I guess. mma legend Don Frye also stars.\n\noverall, the blend of martial arts, ill tempered kaijus, and special effects couldn't save this film. \n\nthe story/premise was good. it just lacked the emotional content I expect from a Godzilla movie, especially one that's 50 yrs in the making.\n\nand I'm not alone. released in 2004, 12 yrs passed before the release of Shin Godzilla in 2016.\n\nGodzilla is more popular than James Bond. but for how much longer? did Godzilla: Final Wars predict it's own demise?\n\nby the numbers:\n\nacting: 8/10\nstory: 7/10\nkaijus featured: 10/10\naction sequences: -14/10\n\ntldr: I expect more from a Godzilla movie. more action. more suspense.  I want to see Godzilla get emotional. I want to cry with Godzilla. this movie fell short of that",
        "upvotes": 28,
        "comments": 29,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/x155p3eg6igf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1mfd6mi/godzilla_final_wars_2004/"
    },
    {
        "id": "1mfiotv",
        "author": "novemberchild71",
        "title": "Memorable Fightscene with a female Protagonist?",
        "content": "Looking for fightscenes where a female protagonist fights hostiles in close quarter combat. \n\nTwo Rules:\n\n* Only real weapons (or weaponized objects)!\n* No defying Reality. At least not on the protagonist's side. That means: No Superpowers. No Mutations. No Magic. No reality defying Equipment and, I should really not have to point this out: Gravity is a law, not an option!\n\n\n\nMy personal hitlist that I hope to expand:\n\n* Kick Ass - Hitgirl versus a corridor full of henchmen.\n* Birds of Prey - Harley Quinn's brilliant Bat-Control while springing Cassandra. \n* Gunpowder Milkshake - Samantha versus the three Boneheads on the Bowling Alley.\n\n\n\n\n\n\n\n",
        "upvotes": 10,
        "comments": 60,
        "media": null,
        "permalink": "/r/movies/comments/1mfiotv/memorable_fightscene_with_a_female_protagonist/"
    },
    {
        "id": "1mea3rz",
        "author": "RgObese",
        "title": "Is there a name for this annoying movie trope?",
        "content": "I HATE when the protagonist is pinned to the ground and being choked out and manages to grab a conveniently placed item like a rock, a knife, or a wine bottle opener and kill or knock out the assailant. It’s my biggest movie pet peeve and instantly ruins the experience for me. Is there a name for this trope?\n\nEdit: I personally think this does not fall under deus ex machina because it’s still somewhat realistic to use an improvised weapon in a fight but it’s definitely similiar to deus ex machina and feels like lazy writing to me\n\nEdit 2: It’s apparently called ”Within arm’s reach” but I like the term ”convenient cudgel” invented by the comments better :)",
        "upvotes": 7016,
        "comments": 817,
        "media": null,
        "permalink": "/r/movies/comments/1mea3rz/is_there_a_name_for_this_annoying_movie_trope/"
    },
    {
        "id": "1mfhzqw",
        "author": "Mhulz",
        "title": "Do you have recommendations for movies about small people, e.g Indian in the Cupboard, Small Soldiers, The Borrowers, etc.",
        "content": "I feel like there was a slew of movies about miniature people during the 90s. Most of them were kids movies, with some kind of messaging behind them. The only examples that I can remember are mentioned in the title, although there must be more. \n\nWhat was happening at the time in pop culture that led to so many movies of this type? I was a child at the time, so I just watched what I was given, but it was certainly a little weird.",
        "upvotes": 12,
        "comments": 19,
        "media": null,
        "permalink": "/r/movies/comments/1mfhzqw/do_you_have_recommendations_for_movies_about/"
    },
    {
        "id": "1mf77uv",
        "author": "MarvelsGrantMan136",
        "title": "Danny Boyle’s Criterion Closet Picks",
        "content": "",
        "upvotes": 54,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/36ZwCQnT1reWd31RUe5nEu5iH9L6qN5b4E2SGQLS3-Y.jpeg?auto=webp&amp;s=36ecba78ad64e014aa86949d4fff12adc37d1083"
        },
        "permalink": "/r/movies/comments/1mf77uv/danny_boyles_criterion_closet_picks/"
    },
    {
        "id": "1met54s",
        "author": "animus437",
        "title": "Casablanca is just that good",
        "content": "I recently rewatched Casablanca, the 1942 classic, and I appreciated it even more this time around. It's a highly entertaining, humorous, and overtly anti-fascist film (so much so that, in today’s political climate, it might even be labeled “woke”). The characters go through compelling and complete arcs, and the ending is perfectly suited to the story. On a technical level, the lighting, sound, and cinematography are exceptional, especially for the time period. It’s no coincidence that it is considered one of the greatest and most influential films ever made, and rightfully so IMO. ",
        "upvotes": 295,
        "comments": 55,
        "media": null,
        "permalink": "/r/movies/comments/1met54s/casablanca_is_just_that_good/"
    }
]