[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 38,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 10,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pmuo0i",
        "author": "EgoExplicit",
        "title": "Cancelled after being told Netflix can’t be used while traveling",
        "content": "I’ve been a Netflix customer since the early days. I travel frequently for work and usually bring a Roku stick to use in hotels.\n\nThis week I couldn’t log in, so I contacted Netflix support. I was told that my subscription is intended for use at my home location and that I can’t use it while traveling.\n\nWhat’s frustrating is that I’m on a plan with a 4-device limit and I stay within it. I’m not sharing my account with anyone outside my household — I’m just logging in from a different location while traveling.\n\nIt feels like Netflix has shifted from enforcing device limits to enforcing location, which is a big change in how the service works, especially for people who travel often. Streaming on a phone or laptop seems to work, but devices like Roku or Apple TV are where the problems show up.\n\nThe policy itself was disappointing, but what really pushed me to cancel was how little concern there was about losing a long-time customer. The response was essentially “that’s just how it is.”\n\nIf you travel often and rely on streaming devices, this is something to be aware of.",
        "upvotes": 2175,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/1pmuo0i/cancelled_after_being_told_netflix_cant_be_used/"
    },
    {
        "id": "1pmpu37",
        "author": "bottlecoco",
        "title": "need a ONE-SEASON banger Netflix show",
        "content": "Hey guys,\n\nI’m begging at this point. I don’t want a slow burn. I don’t want “it gets good in season 3.”\nI want a ONE-SEASON show on Netflix that just hits from start to finish.\n\nSomething so good I finish it in one sitting, stare at the wall afterward, and rethink my existence.\nNo fillers. No dragging. Just straight banger energy.\n\nAny genre is fine — thriller, mystery, drama, sci-fi — as long as it’s elite.\nPlease save me from scrolling Netflix for 40 minutes and watching nothing 🙏\n\nDrop your best recommendations ⬇️",
        "upvotes": 527,
        "comments": 986,
        "media": null,
        "permalink": "/r/netflix/comments/1pmpu37/need_a_oneseason_banger_netflix_show/"
    },
    {
        "id": "1pn8q0l",
        "author": "moal09",
        "title": "Flanderization in Scott Pilgrim Takes Off",
        "content": "Flanderizarion in the Netflix cartoon\n\nIt's a fun little \"what if\" series, but a lot of characters feel like extremely one dimensional  versions of themselves.\n\nLucas Lee in particular feels like he was done dirty.  The whole point of his character is that his self important douchebag persona isn't the real him, and that he's actually a decent guy who had his heart broken and used the former as a sort of coping mechanism.  \n\nWallace also went from snarky dick who cares to just a dick.  Neil went from naive and a bit silly to just being a full on moron.\n\nRamona also patches things up with her exes without really growing in any way on her part or realizing how badly she hurt people and how she's largely responsible for a lot of their douchebaggery to begin with.\n\nI feel like the show had to move so quickly, it didnt have a chance to actually have any proper characterization.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pn8q0l/flanderization_in_scott_pilgrim_takes_off/"
    },
    {
        "id": "1pmkt4e",
        "author": "SnooSprouts2672",
        "title": "How would you rank the Knives Out movies?",
        "content": "  \nMy personal take below:\n\n1. Knives out (won by a mile for me)\n2. Wake up dead man\n3. Glass onion\n\nUnlike most people who watched 1 and 2 first. 1 never watched a Knives out movie before. So i watched 2 then 3. And lastly 1. I didnt enjoy Glass Onion but the ending with explosions was spectacular. Loved WUDM but to me the Knives Out 2019 was the perfect movie for me.\n\n\n\n  \n",
        "upvotes": 121,
        "comments": 103,
        "media": null,
        "permalink": "/r/netflix/comments/1pmkt4e/how_would_you_rank_the_knives_out_movies/"
    },
    {
        "id": "1pnasge",
        "author": "ElBeh",
        "title": "Netflix paid $55 million for a 'visionary' sci-fi epic that was never finished. We saw a glimpse of it at director Carl Rinsch's criminal trial.",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pnasge/netflix_paid_55_million_for_a_visionary_scifi/"
    },
    {
        "id": "1pn5bdc",
        "author": "FlynnSanOne201",
        "title": "Black mirror - Mazey day",
        "content": "I thought I had seen every episode but HOLY SHIT.. I did not expect it to go down like that! Went from 0 - 100 real quick. A werewolf wow. Insane what a great episode. I'm curious to know how everyone interpret this episode? It obviously is about the paparazzi but Black mirror seems to always have deeper meanings to each episode. Is there more to this episode? Please help me understand if so. If not I apologise and will delete. Thanks! ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pn5bdc/black_mirror_mazey_day/"
    },
    {
        "id": "1pn97p0",
        "author": "ThalloAuxoKarpo",
        "title": "What to watch on Netflix",
        "content": "Hi! \n\nI was given a Netflix gift card for one month. So I’m planning to watch some movies and eventually short series over the holidays. I canceled Netflix about 3 years ago, so is there any new content, I missed out on in the past years? Can you recommend something? \n\nI’m already planning to watch: \n\nTrain Dreams\n\nThe Beast in Me\n\nThe new Knives Out movie, eventually.\n\nPlease no Series with more than 2 Seasons. Thanks a lot! ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1pn97p0/what_to_watch_on_netflix/"
    },
    {
        "id": "1pmz5j7",
        "author": "AccomplishedPut5175",
        "title": "Wake Up Dead Man:A knives Out Mystery",
        "content": " i just finished watching this movie, and... I watched, if I can say, the first parts of this film as well, and while each part stands on its own, honestly, this third part of the sequel seems the weakest to me. The cast is perfect, but I prefer the stories from the earlier parts, especially the first part of this film saga.",
        "upvotes": 5,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1pmz5j7/wake_up_dead_mana_knives_out_mystery/"
    },
    {
        "id": "1pmhlht",
        "author": "Dariusgamer2007",
        "title": "Why is my ‘Your next watch’ 95% things I’ve already watched?",
        "content": "I’m really confused because Netflix for a few months now has been recommending me nothing but series and movies I’ve already watched. What’s going on? How do I stop this? ",
        "upvotes": 53,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1pmhlht/why_is_my_your_next_watch_95_things_ive_already/"
    },
    {
        "id": "1pn6ey4",
        "author": "mgsgamer1",
        "title": "The Dragon Prince - I really REALLY like this show, but the majority of the accents are ass",
        "content": "That's all. Some of the accents drive me nuts with how obviously fake they sound.\n\nConsidering it's a fantasy show, one could just chalk the accents up to \"inspired by\" and not \"representative of\", but the bad ones are so grating on my ears.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pn6ey4/the_dragon_prince_i_really_really_like_this_show/"
    },
    {
        "id": "1pn47kz",
        "author": "Mountain-Bid4317",
        "title": "40S325 Roku TV (2019) has had a lot of issues with this app",
        "content": "Anybody else run into this? It feels like every other app runs smoothly except for Netflix. Maybe because the TV is older and Netflix is constantly making updates, my older TV cannot keep Anyone else have this?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pn47kz/40s325_roku_tv_2019_has_had_a_lot_of_issues_with/"
    },
    {
        "id": "1pn3kge",
        "author": "Thingthecat",
        "title": "Is there a way to prevent my elderly dad accidentally buying films etc?",
        "content": "Dad is 95 and not great with modern technology.. is there a way to set things up so he can only watch free things? He was running up large bills so it had to be stopped. Same with Amazon prime.\n",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1pn3kge/is_there_a_way_to_prevent_my_elderly_dad/"
    },
    {
        "id": "1pn7wrx",
        "author": "user189271831",
        "title": "Your ad supported plan is not available in this region",
        "content": "Travelling to my home country and I'm met with this. I can't use Netflix here. Is there a workaround for this because I'm about to just cancel my netflix plan altogether.\n\nEdit: I was so annoyed that I just canceled my plan. Bye bye Netflix, you suck",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pn7wrx/your_ad_supported_plan_is_not_available_in_this/"
    },
    {
        "id": "1pm0zc2",
        "author": "Fit_Possession_5545",
        "title": "The Beast in Me",
        "content": "Claire Danes in The Beast in Me is such a good actor. The lighting, the musical scoring, the characters all complemented the plot. Never a boring moment.\n\nMust watch.",
        "upvotes": 158,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1pm0zc2/the_beast_in_me/"
    },
    {
        "id": "1pmy0wg",
        "author": "shinyhpno",
        "title": "Anything that can keep a kid's attention?",
        "content": "Preferably animated for my sake, but this is a kid who needs action and dialogue only when it's funny. Rango, Godzilla: KOTM, Karate Kid: Legends are some of the recent ones we've enjoyed.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pmy0wg/anything_that_can_keep_a_kids_attention/"
    },
    {
        "id": "1pmx3mg",
        "author": "harpreetthind",
        "title": "Question about movies on TV show",
        "content": "Currently watching orange is the new black finished watching the beast in me and the haunting of Hill House and the haunting of Bly Manor and midnight mass what else does everybody recommend watching? Thanks for the suggestions",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pmx3mg/question_about_movies_on_tv_show/"
    },
    {
        "id": "1pmu7aw",
        "author": "NoBeing3286",
        "title": "Wayward- why Alex makes weird choices",
        "content": "Because he’s a sub and he is Laura’s. \nThe sex scene is important to the plot. \n\nLaura says something like “he is all mine\nThe sex scene also tells us that Laura is not how she looks, she takes control- later becomes cult leader. \nAlex belongs to Laura- he depends on her emotionally, he doesn't know how to not live in Laura’s world (almost like Leila). ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pmu7aw/wayward_why_alex_makes_weird_choices/"
    },
    {
        "id": "1plwvm6",
        "author": "Jumpy-Weekend-1223",
        "title": "Why is the volume so inconsistent when watching Netflix",
        "content": "most of the dialogue is barely audible, but during intense scenes the volume suddenly becomes extremely loud...the awful volume swings is just diagusting\n",
        "upvotes": 146,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1plwvm6/why_is_the_volume_so_inconsistent_when_watching/"
    },
    {
        "id": "1pmk8yp",
        "author": "harrietrosie",
        "title": "Best true crime docs 2024-2025",
        "content": "I've just got netflix again, haven't had it since 2023. Can anyone recommend some good true crime docs that I've missed in that time? I'm not really interested in heist/fraud etc.",
        "upvotes": 5,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1pmk8yp/best_true_crime_docs_20242025/"
    },
    {
        "id": "1plvc58",
        "author": "Less_Manufacturer218",
        "title": "Wake Up Dead Man, I really liked it!",
        "content": "It’s a very entertaining movie with a lot of underlying messages. The characters were great in their roles. The whole movie has a fantasy aspect to it that is also great and keeps you engaged!",
        "upvotes": 111,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1plvc58/wake_up_dead_man_i_really_liked_it/"
    },
    {
        "id": "1pmkwnx",
        "author": "Expert_Dealer_4439",
        "title": "Robby Hoffman special",
        "content": "Curious everyone else’s take. I watched this morning n felt pretty 😬 about the begining MEN/pedo jokes. The middle got better but overall I wasn’t super into it. Maybe I just prefer her podcast vibes. But curious what other fans thought.",
        "upvotes": 1,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1pmkwnx/robby_hoffman_special/"
    },
    {
        "id": "1pmptn0",
        "author": "azaman92x",
        "title": "Recommendations please",
        "content": "I watched both seasons of the Night Agent and really enjoyed them (I know some people didn’t like the writing/plots but I did) and I hear there is a third season coming out soon, (no date released for the UK yet?) so I’m looking for recommendations on what to watch in the meantime please? TIA",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pmptn0/recommendations_please/"
    },
    {
        "id": "1pmurbz",
        "author": "fromindia1",
        "title": "Owning Manhattan got me wondering about realtors",
        "content": "Watching the show and seeing the agents that are selling multimillion dollar properties with huge egos. \n\nWhat is it that drives them to work for a broker instead of being on their own? They work as independent contractors, not employees. They bring their own business. They have their own teams, etc. Ravi has been mentioned a few times, but for some reason has not been on the show directly. \n\n\nWhat is it that Serhant offers these guys that they could not do on their own? \n\nI can see new agents depending on a firm to bring in listings, provide advertising, etc. but what’s in it for the experienced ones? The likes of Peter “Rabbit”, Jordan, etc.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pmurbz/owning_manhattan_got_me_wondering_about_realtors/"
    },
    {
        "id": "1pm0rj2",
        "author": "Wonderful_ion",
        "title": "What should I watch that is of substance on Netflix?",
        "content": "I’m open to either a show or a film and pretty flexible about genre. Curious what you’d recommend.\n\nThe last three I watched were Before Sunrise, The Talented Mr. Ripley, and The Virgin Suicides. All three had that very ’90s sense of longing and identity, more atmospheric than plot-driven, and they really lingered after.",
        "upvotes": 29,
        "comments": 112,
        "media": null,
        "permalink": "/r/netflix/comments/1pm0rj2/what_should_i_watch_that_is_of_substance_on/"
    },
    {
        "id": "1plbq9a",
        "author": "arkelangel",
        "title": "I'm done.",
        "content": "I'm done. Years of subscriptions. Netflix has decided to remove casting. My tvs using chrome cast. I don't have a Netflix ap on my tv. I don't want to buy a new tv. I want to be able to cast when I go to friends houses, or when I'm in a hotel. Like.... This was a great feature. Netflix isn't useful to be if i can't watch it on my tv. I'm just so frustrated. I know it isn't customer services fault but omg ....",
        "upvotes": 1201,
        "comments": 230,
        "media": null,
        "permalink": "/r/netflix/comments/1plbq9a/im_done/"
    },
    {
        "id": "1pmkagx",
        "author": "nivz17",
        "title": "Netflix talkback issue",
        "content": "Randomly netflix on my phillips tv has started to talkback fulltime. Everything is disabled on the tv and the only app talkingback is netflix. I cant disable it. Any ideas?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pmkagx/netflix_talkback_issue/"
    },
    {
        "id": "1pmk4mo",
        "author": "Sufficient-Curve2951",
        "title": "Had I Not Seen the Sun",
        "content": "The way Part 1 left things off, I felt Part 2 would feature a twist angle or some redemption for Jen-yao. But the Tien-cheng and Hsiao-tung reveal was kinda underwhelming for me. Does anybody else feel that way?\n\n[https://www.soapcentral.com/shows/had-i-not-seen-sun-part-2-ending-explained-pin-yu-s-real-identity-revealed-jen-yao-faces-consequences](https://www.soapcentral.com/shows/had-i-not-seen-sun-part-2-ending-explained-pin-yu-s-real-identity-revealed-jen-yao-faces-consequences)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pmk4mo/had_i_not_seen_the_sun/"
    },
    {
        "id": "1pmjcbc",
        "author": "chumba170",
        "title": "“Next Episode” showing up way before episode ends",
        "content": "Seems to only be on the website version but I’ve been rewatching Spartacus on Netflix via my pc and several times I’ve had the “next episode” and “watch credits” tabs pop up well before the episode ends (sometimes halfway through). I already disabled auto play so I’m not sure how to fix this. Any advice would be appreciated! ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pmjcbc/next_episode_showing_up_way_before_episode_ends/"
    }
]