[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 7,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 160,
        "comments": 568,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1n2q9f9",
        "author": "BrettJoz",
        "title": "We’re getting another series based on a serial killer apart of the Monster series.",
        "content": "As a huge fan of the Monster Series, I’m glad they’re making another one based on Ed Gein.\n\nFor those who don’t know who Ed Gein is, he’s a serial killer who would skin his victims &amp; wear their skin as a mask. \n\nFun fact: Leatherface is actually based on Ed Gein",
        "upvotes": 88,
        "comments": 66,
        "media": null,
        "permalink": "/r/netflix/comments/1n2q9f9/were_getting_another_series_based_on_a_serial/"
    },
    {
        "id": "1n226i0",
        "author": "Street_Firefighter_7",
        "title": "The gabby petito story was removed off Netflix",
        "content": "I noticed that the movie is now removed after only being on the platform for less than 24 hrs. I paused it and came back to watch it and now it’s gone and I’m even getting errors whenever I click on the Netflix link for the movie. Anyone know why it was removed? ",
        "upvotes": 560,
        "comments": 218,
        "media": null,
        "permalink": "/r/netflix/comments/1n226i0/the_gabby_petito_story_was_removed_off_netflix/"
    },
    {
        "id": "1n2izkg",
        "author": "peoplemagazine",
        "title": "Netflix Star Verónica Echegui Dies at 42 After Secret Cancer Diagnosis",
        "content": "",
        "upvotes": 44,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1n2izkg/netflix_star_verónica_echegui_dies_at_42_after/"
    },
    {
        "id": "1n20z4c",
        "author": "A-Dog22",
        "title": "Sony sold Netflix the rights to ‘KPop Demon Hunters’ in a pandemic-era safety play—and now it’s Netflix’s biggest movie ever",
        "content": "",
        "upvotes": 553,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1n20z4c/sony_sold_netflix_the_rights_to_kpop_demon/"
    },
    {
        "id": "1n2uv12",
        "author": "CriticalSmile5943",
        "title": "Horror movie suggestions",
        "content": "I need a good horror movie or series to watch… tell me of one that is a little obscure that maybe i haven’t seen that is currently available to watch.\n\nCan someone help me find something good to watch??",
        "upvotes": 5,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1n2uv12/horror_movie_suggestions/"
    },
    {
        "id": "1n2x7ts",
        "author": "BlahblahblahLG",
        "title": "Why was the Gabby Petito Story removed from Netflix?",
        "content": "Does anyone know?\n\nI was watching it and had to pause and do something then when I came back to finish it, it had been removed!! I tried to Google what happened, but haven't found anything about it. Does anyone know? ",
        "upvotes": 2,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1n2x7ts/why_was_the_gabby_petito_story_removed_from/"
    },
    {
        "id": "1n2yvon",
        "author": "Southern-Brother5693",
        "title": "My Continue Watching List - Glitches",
        "content": "For the past month, my Continue Watching list keeps including titles I have already watched. They appear and disappear suddenly. Informed Netflix about this but there has been little change.\n\nAnyone facing the same issue?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n2yvon/my_continue_watching_list_glitches/"
    },
    {
        "id": "1n2ar5g",
        "author": "FlareGamer64",
        "title": "Series recommendations with episodes that are specifically 20-35 minutes long?",
        "content": "Most shows I've watched on Netflix are 40-50 minutes long (Breaking Bad, Better Call Saul, Resident Alien, Untamed) which is fine but sometimes I need something a bit shorter before I go out. The Thin Blue Line has been perfect for this purpose but I'm almost done with it. I don't care if it's a drama or a animated show, just give me those recommendations.",
        "upvotes": 40,
        "comments": 138,
        "media": null,
        "permalink": "/r/netflix/comments/1n2ar5g/series_recommendations_with_episodes_that_are/"
    },
    {
        "id": "1n2va3r",
        "author": "ninjascotsman",
        "title": "Wayward Trailer",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n2va3r/wayward_trailer/"
    },
    {
        "id": "1n30h4z",
        "author": "akay92",
        "title": "Scandal &amp; Grey's Anatomy disappeared from my Indian netflix account. Just me?",
        "content": "Apparently  Scandal returned to Netflix after 5 years this June. So not sure what's happening. I had just started S2 and now it's nowhere to be found. Logged out and logged in again already so any other solution is welcome :)\n\nAnyone else facing this? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n30h4z/scandal_greys_anatomy_disappeared_from_my_indian/"
    },
    {
        "id": "1n2zrd4",
        "author": "GenTrapstar",
        "title": "Not Under the Same Household Options",
        "content": "Right now while on my lunch break I get the notification that my account isn’t under the same roof. It’s just be and my mom on this account. We live under the same roof. For the past I don’t kno how many years on my lunch break I watch an episode of something. For the last two years it has been the same phone at the same place and same time. Now all of a sudden I’m getting this message. Is it possible to fix this or am I stuck to watching Netflix just at home? Also wonder if it matters that I only view Netflix on my phone away from home. I use Netflix on my Xbox at home so I guess since it hasn’t seen my phone signed into Netflix at home on the network it thinks it’s not under the same roof. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n2zrd4/not_under_the_same_household_options/"
    },
    {
        "id": "1n2zqum",
        "author": "ConnectionStrong8385",
        "title": "'My Life With the Walter Boys' Star Carson MacCormac on Joining the Cast for Season 2, Playing Zach and that Hallway Scene with Corey Fogelmanis.",
        "content": "Exclusive 'My Life With the Walter Boys' Interview with Carson MacCormac on Playing Zach, Joining the cast for Season 2, his creative process, favourite sequence, that Hallway Scene with Corey Fogelmanis and more!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n2zqum/my_life_with_the_walter_boys_star_carson/"
    },
    {
        "id": "1n292d8",
        "author": "BossJosh74",
        "title": "Thursday Murder Club is great!",
        "content": "I dont want to rush through the series of books, but Chris Columbus, this cast, this crew, during Christmas would be absolutely CINEMA. netflix plz more.",
        "upvotes": 33,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1n292d8/thursday_murder_club_is_great/"
    },
    {
        "id": "1n2twvb",
        "author": "AccomplishedPut5175",
        "title": "Suburræterna any news for S2?",
        "content": "Any news for this show on S2?\nI try to find some news but nothing!\nIf somebody know please tell us.\nWho like Gomora tv shows,must watch this.\nGod bless you all☘️☘️",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n2twvb/suburræterna_any_news_for_s2/"
    },
    {
        "id": "1n2nmgs",
        "author": "Individual-Gas5276",
        "title": "Anyone else getting these Netflix “account suspended” messages?",
        "content": "I’ve been getting these weird messages saying my Netflix account is suspended and I need to “log in” to fix it. The page even has a “Continue with Facebook” button. Feels super sketchy. Is this a new scam? Anyone else seeing this?",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1n2nmgs/anyone_else_getting_these_netflix_account/"
    },
    {
        "id": "1n28v3l",
        "author": "nemopost",
        "title": "Have 20 or so years I have downgraded my Netflix plan.",
        "content": "I went from the top tier 4k plan to 1080p with commercials.  We watch netflix less now and don’t see a reason why we should be paying $30 for one service when we used to pay $50 for many back in the day on cable tv.  Now I hear the prices are going up again.  Something had to give. The new shows are less intriguing than they were, its just not worth it anymore. ",
        "upvotes": 12,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1n28v3l/have_20_or_so_years_i_have_downgraded_my_netflix/"
    },
    {
        "id": "1n1t6ji",
        "author": "AztecTimber",
        "title": "I love foreign language shows and here are my favorites",
        "content": "Do you have any to add? I am particularly interested in German shows because I think it helps me speak it just a bit better. Plus I love the euro city settings. ",
        "upvotes": 116,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1n1t6ji/i_love_foreign_language_shows_and_here_are_my/"
    },
    {
        "id": "1n2p74f",
        "author": "bestcmw",
        "title": "Anybody know what is going on with the loading logo?",
        "content": "Yellow graphic with negative space asterisk. I thought imagined it. Theres an image just before the Netflix logo appears. Probably nothing, but I have never seen it before. Anyone else seeing it when opening the app?",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/rkwyoz7iytlf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1n2p74f/anybody_know_what_is_going_on_with_the_loading/"
    },
    {
        "id": "1n2dend",
        "author": "fergrim85",
        "title": "Million Dollar Secret - i know I'm a bit behind the times here, but did anyone else notice Cara's clearly fabricated claims about her father's illness?",
        "content": "She claimed he had \"lymphoma, melanoma and leukemia\" which is nearly a statistical impossibility. (it's not impossible but the odds are astronomically low)\n\nAnd I mean, that's fine, the show is about lying liars who are lying.  But what made it bizarre is it wasn't something she talked about with fellow contestants, but in confessionals, \n\nAnd what made it even stranger to me is that the edit never keyed in on the magnitude of that particular lie.\n\nLying about a family member having a life threatening illness is tasteless and arguably immoral, but lying about it in such an exaggerated fashion is...a sign of severe issues working things out with reality.  It's the sort of thing someone with schizophrenia might say.\n\nAnyway I was just surprised not to see a single mini article mention it, or to see anyone mention it in the breakdown threads after her win.  Given it was such a gimme and an obvious WTF moment as she said it.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n2dend/million_dollar_secret_i_know_im_a_bit_behind_the/"
    },
    {
        "id": "1n2zrco",
        "author": "RecentlyDeaf",
        "title": "Am I the only one cancelling?",
        "content": "I haven't found much to watch on Netflix lately? Is it me? I've always found something, but lately it's been disappointing. Is there anything worth watching before cancelling?",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1n2zrco/am_i_the_only_one_cancelling/"
    },
    {
        "id": "1n2xxph",
        "author": "GrayNOIEN",
        "title": "Who's realistically winning in a fight?",
        "content": "",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1n2xxph/whos_realistically_winning_in_a_fight/"
    },
    {
        "id": "1n2ylkr",
        "author": "Calm_Salamander_1367",
        "title": "Is Netflix down for anybody else?",
        "content": "Body text\n\nBody text\n\nBody text\n\nBody text\n\nBody text\n\nBody text\n\nBody text\n\nBody text\n\nBody text\n\nBody text\n\nBody text\n\nBody text\n\nBody text \n\nBody text\n\nBody text\n\nBody text ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1n2ylkr/is_netflix_down_for_anybody_else/"
    },
    {
        "id": "1n2e0iq",
        "author": "keepitwildinwyo",
        "title": "Movie night for kids ages 4-9",
        "content": "I’m hosting a popcorn, pizza, and movie night at my house and want to have a fun movie for both groups, but maybe not something they’ve seen or popular at the moment. Any ideas/recs? ",
        "upvotes": 2,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1n2e0iq/movie_night_for_kids_ages_49/"
    },
    {
        "id": "1n2h6o9",
        "author": "Ok-Box9760",
        "title": "First Netflix content filtering browser extension",
        "content": "Hi.\n\nI built the first Netflix content filtering browser extension that allows you to filter content you have watched or rated on Netflix.\n\nI am currently in the testing phase of the extension and I invite you to join the testing group. Once you join the group the download link will be active.\n\nCurrently the first version is unstable but I will soon release a much more stable version 0.2\n\nhttps://groups.google.com/g/advanced-netflix-filter?pli=1",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n2h6o9/first_netflix_content_filtering_browser_extension/"
    },
    {
        "id": "1n2fba6",
        "author": "Coolme_pro",
        "title": "Netflix profile icons",
        "content": "hi, is there any way to remove the profile icons from my history? some of the pictures are lowk bad to look at because my sibling was trying to disturb me 😭 \n\nalso, does that affect the algorithm of profile icons recommended to me?\n\nfinally, I noticed that every profile has different icons, what should I do if I want a certain one (e.g. arcane) but I don't have it in my options ? (it's available on my other family member's account)\n\nthank you in advance:)",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1n2fba6/netflix_profile_icons/"
    },
    {
        "id": "1n2f1oq",
        "author": "potassiumnadilaw",
        "title": "Any good architecture stuff on Netflix?",
        "content": "Can you recommend some architecture-related shows on Netflix that are worth watching for someone in the field? Whether it’s a reality show, documentary, movie, or series, I’m open to anything. I just want to widen my perception of architecture.\n\nThanks in advanceee!",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1n2f1oq/any_good_architecture_stuff_on_netflix/"
    },
    {
        "id": "1n25oao",
        "author": "St3lla_0nR3dd1t",
        "title": "Does the Netflix algorithm suit you or do you have to search for good tv",
        "content": "https://www.theguardian.com/media/2025/aug/28/bland-easy-to-follow-for-fans-of-everything-what-has-the-netflix-algorithm-done-to-our-films\n\nIs it just me but do you get the feeling that Netflix films are not challenging enough and produced to a quota rather than to quality. \n\nWould you pay more for better films?",
        "upvotes": 5,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1n25oao/does_the_netflix_algorithm_suit_you_or_do_you/"
    },
    {
        "id": "1n1krle",
        "author": "Glum_Reputation_9845",
        "title": "Rewatching The Social Dilemma and realizing it wasn’t even the half of it",
        "content": "When I first saw it, I thought it was shocking that apps manipulate us with notifications and algorithms. But the more I’ve learned since then, the scarier part isn’t just the manipulation and it's all about the data that's everywhere.  \n  \nYour phone number, your email, even your address history  all of it is floating around. The Social Dilemma scratched the surface because I feel it's much scarier real life. (that thing about what google knows about you is actually terrifying). I can’t help but think a real sequel would be less about screen addiction and more about how our entire identities are already being bought and sold in the background.  \n  \nHas anyone else felt that paranoia spike after realizing the real problem isn’t the apps on your phone, it’s the invisible network of companies that already own your information?",
        "upvotes": 65,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1n1krle/rewatching_the_social_dilemma_and_realizing_it/"
    },
    {
        "id": "1n2bhd8",
        "author": "blueberrman2",
        "title": "How do I disable netflix showing what I watch to other users?",
        "content": "My family has the basic netflix plan, where you can only watch from one device at a time, and if there's someone already watching and you try to watch something, it displays who is watching at that time, on what device they're watching on, and what they're watching. Is there a way to turn this off?",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1n2bhd8/how_do_i_disable_netflix_showing_what_i_watch_to/"
    },
    {
        "id": "1n10zec",
        "author": "AverageCowboyCentaur",
        "title": "Anyone else having trouble navigating Netflix?",
        "content": "some shows work and some shows don't even load the episode grid. It's like they play from the preview. The whole service just seems to be melting down and degrading. anybody else?",
        "upvotes": 1030,
        "comments": 790,
        "media": null,
        "permalink": "/r/netflix/comments/1n10zec/anyone_else_having_trouble_navigating_netflix/"
    }
]