[
    {
        "id": "1p0u2nq",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Hikari - Wednesday 11/19 at 5:00 PM ET - Director of 'Rental Family' (Starring Brendan Fraser, In Theaters Friday 11/21)",
        "content": "",
        "upvotes": 177,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/czgda59z742g1.png?auto=webp&amp;s=ef6184c5da4bd489c3587ef741b7d7900307365f"
        },
        "permalink": "/r/movies/comments/1p0u2nq/amaqa_announcement_hikari_wednesday_1119_at_500/"
    },
    {
        "id": "1p0v9h0",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Sarah Botstein &amp; David Schmidt - Wednesday 11/19 at 3:00 PM - Co-Directors (alongside Ken Burns) of PBS' New Docu-Series 'The American Revolution'",
        "content": "",
        "upvotes": 180,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/pplxyddoh42g1.jpeg?auto=webp&amp;s=fbe2469d2534012253f3616ebb699e72b11ce386"
        },
        "permalink": "/r/movies/comments/1p0v9h0/amaqa_announcement_sarah_botstein_david_schmidt/"
    },
    {
        "id": "1p18hex",
        "author": "MarvelsGrantMan136",
        "title": "First Image from 'Jumanji 3'",
        "content": "",
        "upvotes": 3295,
        "comments": 995,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7886gn82082g1.jpeg?auto=webp&amp;s=e82cb433941e8c18b8ae7d5815982b65373a36ed"
        },
        "permalink": "/r/movies/comments/1p18hex/first_image_from_jumanji_3/"
    },
    {
        "id": "1p18iq1",
        "author": "MarvelsGrantMan136",
        "title": "New Image from 'Toy Story 5'",
        "content": "",
        "upvotes": 753,
        "comments": 142,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9olryvjd082g1.jpeg?auto=webp&amp;s=f24bec1cddddc5f230cb501bf63de6f236a4c5a4"
        },
        "permalink": "/r/movies/comments/1p18iq1/new_image_from_toy_story_5/"
    },
    {
        "id": "1p16nd4",
        "author": "HikariAMA",
        "title": "Hi reddit! I'm Hikari, writer, director and producer of RENTAL FAMILY, a film set in Japan starring Brendan Fraser. It's out in theaters nationwide on November 21 via Searchlight Pictures. Ask me anything!",
        "content": "Hi reddit! I'm Hikari, I wrote, directed, and produced RENTAL FAMILY.\n\nIt stars Brendan Fraser, Takehiro Hira, Mari Yamamoto, Shannon Mahina Gorman, and Akira Emoto. \n\nIt had its premiere at TIFF in September and will be released in theaters nationwide this Friday via Searchlight Pictures. \n\n**Synopsis**:\n\nStruggling to find purpose, an American actor lands an unusual gig with a Japanese agency to play stand-in roles for strangers. As he immerses himself in his clients' worlds, he begins to form genuine bonds that blur the lines between performance and reality. Confronting the moral complexities of his work, he soon rediscovers purpose, belonging, and the quiet beauty of human connection.\n\n**Trailer:**\n\n[https://www.youtube.com/watch?v=n0pqP6ClcE8](https://www.youtube.com/watch?v=n0pqP6ClcE8)\n\nI've also directed several episodes of BEEF and TOKYO VICE.\n\nAsk me anything! I'll be back today (Wednesday 11/19) at 5 PM ET to answer your questions.\n\n",
        "upvotes": 792,
        "comments": 64,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0zaylvmjl72g1.png?auto=webp&amp;s=0afa6d3482ffe734052c8028a5d1fab1eb283537"
        },
        "permalink": "/r/movies/comments/1p16nd4/hi_reddit_im_hikari_writer_director_and_producer/"
    },
    {
        "id": "1p1biqq",
        "author": "MarvelsGrantMan136",
        "title": "New Image from 'Coyote vs. Acme'",
        "content": "",
        "upvotes": 295,
        "comments": 55,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ygq27rv8l82g1.jpeg?auto=webp&amp;s=49ba5fed642c7f1b8f9c0f34489c822800523867"
        },
        "permalink": "/r/movies/comments/1p1biqq/new_image_from_coyote_vs_acme/"
    },
    {
        "id": "1p0w0d6",
        "author": "Odd_Distribution1430",
        "title": "What movie did you see in theaters that had the most ‘alive’ audience?",
        "content": "People cheering, yelling, leaping out of chairs, throwing their popcorn into the air, etc.. What movie(s) did you all see in theaters that had the most alive audience?\n\nMy answer is probably Avengers: Endgame. I remember that I was called out of school early by my parents to watch the movie the day it came out in theaters, and we didn’t want to get held up by crowds and get good seats. It was insane how reactive the audience was in my theater, it was fun. A good chunk of them simultaneously cried too.\n\nA close second is Deadpool and Wolverine; some simultaneous laughter and gasps, but mainly cheering and clapping at the surprise character entrances. The theater erupted with excited yelling and clapping when Blade and Gambit entered, my friend (who doesn’t really watch Marvel movies) was so lost it was kinda funny lol.",
        "upvotes": 1074,
        "comments": 2801,
        "media": null,
        "permalink": "/r/movies/comments/1p0w0d6/what_movie_did_you_see_in_theaters_that_had_the/"
    },
    {
        "id": "1p0azt0",
        "author": "DamnThatsInsaneLol",
        "title": "Just found out that Eric Roberts holds the record for most screen credits for a living Hollywood actor (800) &amp; he has 94 upcoming projects. In 2017 alone, he acted in 74 films. This year he was in 38 projects. That's crazy",
        "content": "",
        "upvotes": 23646,
        "comments": 1579,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Jwd4IiqJ3q-sUTydO0D7zpxudYgxwTr7z1sPvJvOH5Q.jpeg?auto=webp&amp;s=3df2acb5b01ed77644f687a2c3bbe48b074e10d4"
        },
        "permalink": "/r/movies/comments/1p0azt0/just_found_out_that_eric_roberts_holds_the_record/"
    },
    {
        "id": "1p0nypn",
        "author": "ChiefLeef22",
        "title": "The Official Trailer For Christopher Nolan's 'The Odyssey' Is Reported To Be Attached To Next Month's Screenings Of 'Avatar: Fire &amp; Ash'",
        "content": "",
        "upvotes": 2507,
        "comments": 195,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/C4RmFQk0Nwz-1YLZC5EP3rCsuw-0McI3y7QcS7N4HGA.jpeg?auto=webp&amp;s=8d7c07d320eab1e4c70cbec4bc6835599b7f7e6e"
        },
        "permalink": "/r/movies/comments/1p0nypn/the_official_trailer_for_christopher_nolans_the/"
    },
    {
        "id": "1p0pi45",
        "author": "Sufficient_Duck7715",
        "title": "Paramount Denies Warner Bros. Discovery Bid Involves Arab Wealth Funds",
        "content": "",
        "upvotes": 1791,
        "comments": 102,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qr7I8sO6EslX9grVT3qPrVQxUw7XhiZ2q3Nx7CtLp5I.jpeg?auto=webp&amp;s=f35b07a451d2001b3d1fda9026bda5a57c73a8c9"
        },
        "permalink": "/r/movies/comments/1p0pi45/paramount_denies_warner_bros_discovery_bid/"
    },
    {
        "id": "1p1b3ns",
        "author": "adelyade83",
        "title": "'Rental Family' is a heartwarming home run for Brendan Fraser – Review",
        "content": "He's such a good guy.  It's so good to see him finding success and healing.  ",
        "upvotes": 56,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Gtjyd6dr6sAiC_WtCWiaT6ZxCT5lbVGtj1szY9UMPL0.jpeg?auto=webp&amp;s=ee3f05d83fc3070b6254431aa62032190627a859"
        },
        "permalink": "/r/movies/comments/1p1b3ns/rental_family_is_a_heartwarming_home_run_for/"
    },
    {
        "id": "1p19nay",
        "author": "SarahAndDavidAMA",
        "title": "Hi r/movies! We’re Sarah Botstein &amp; David Schmidt, co-directors of the new PBS series The American Revolution &amp; longtime collaborators at Florentine Films (co-founded by Ken Burns). We've worked on other docs like Jazz, The War, Prohibition, The Vietnam War, Hemingway, and more. Ask us anything!",
        "content": "Hi [r/movies](https://www.reddit.com/r/movies/)! We’re Sarah Botstein &amp; David Schmidt, co-directors of the new PBS series The American Revolution &amp; longtime collaborators at Florentine Films (co-founded by Ken Burns). We've worked on other docs like Jazz, The War, Prohibition, The Vietnam War, Hemingway, and more. Ask us anything!\n\nHere are the first 10 minutes of our new docuseries, The American Revolution:\n\n[https://www.youtube.com/watch?v=-1o8FTXQuzo](https://www.youtube.com/watch?v=-1o8FTXQuzo)\n\nAll episodes are now streaming!\n\n&gt;Thirteen American colonies unite in rebellion, win an eight-year war to secure their independence, and establish a new form of government that would inspire democratic movements at home and around the globe. What begins as a political clash between colonists and the British government grows into a bloody struggle that will engage more than two dozen nations and forever change the world.\n\n**Sarah's Bio:**\n\nSarah Botstein has produced some of the most popular and acclaimed documentaries on PBS. She is currently producing and co-directing The American Revolution along with Ken Burns and David Schmidt. Her previous work includes Jazz, The War, Prohibition, The Vietnam War, College Behind Bars, and Hemingway. The U.S. and the Holocaust marked Botstein's debut as a co-director. Botstein works closely with PBS LearningMedia to develop educational materials as part of the Ken Burns Classroom, and she was an original contributor to Ken Burns's UNUM. In addition to The American Revolution, Botstein is working on a three-part series about Lyndon B. Johnson and the Great Society.\n\n**David's Bio:**\n\nDavid Schmidt is the producer and co-director, along with Ken Burns and Sarah Botstein, of The American Revolution, a six-part, 12-hour series premiering on PBS in the fall of 2025. Schmidt began working with Florentine Films as a researcher and apprentice editor for The Roosevelts (2014), while also supervising the documentary’s seven-episode script. His research on The Vietnam War (2017) won him the Jane Mercer Footage Researcher of the Year award, and he also worked closely on that project with writer Geoffrey C. Ward and helped coordinate postproduction. With Burns, Schmidt also produced the two-part biography Benjamin Franklin (2022) for PBS. A graduate of Dartmouth College with a degree in history, Schmidt grew up on the Virginia Peninsula within the Historic Triangle of Jamestown, Williamsburg, and Yorktown—each site only minutes from his childhood home. He spent his summers working in the living history museum in Colonial Williamsburg and on the archaeological dig at Historic Jamestown. Those childhood experiences led him to pursue a career telling American history.\n\nAsk us anything! We'll be back today Wednesday at 3:00 PM ET to answer your questions :)",
        "upvotes": 42,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/p1mpnm41882g1.png?auto=webp&amp;s=073ce3e114c2911c8110f28c664e0c853c27bd63"
        },
        "permalink": "/r/movies/comments/1p19nay/hi_rmovies_were_sarah_botstein_david_schmidt/"
    },
    {
        "id": "1p0cog0",
        "author": "MarvelsGrantMan136",
        "title": "Project Hail Mary | Official Trailer 2",
        "content": "",
        "upvotes": 3399,
        "comments": 960,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/RkjgpHa04pgtD5UreOPtySebYixz3aYPj-z7b6Zp1iI.jpeg?auto=webp&amp;s=e6bb7f4c0910f358499dd9766377abaa7c36b8da"
        },
        "permalink": "/r/movies/comments/1p0cog0/project_hail_mary_official_trailer_2/"
    },
    {
        "id": "1p1b03s",
        "author": "Bennett1984",
        "title": "Paul Thomas Anderson's Boogie Nights is coming to 4K Ultra HD",
        "content": "",
        "upvotes": 31,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8vQ8Si_QBPKJI1gPt6HLYAI5mCk1U88v7-RP_ccZTfc.jpeg?auto=webp&amp;s=506aef1b17e71a15b71c01cb7b0a993dca0b5ff4"
        },
        "permalink": "/r/movies/comments/1p1b03s/paul_thomas_andersons_boogie_nights_is_coming_to/"
    },
    {
        "id": "1p0vew4",
        "author": "Kraqrjack",
        "title": "Name the oldest movie you actually like.",
        "content": "I had to look at my collection to determine this. I am an old dude compared to most reddit users. The oldest movie that I like and have in my collection is Mr. Smith Goes to Washington (1939). Not my favorite movie, just the oldest that I enjoy.  James Stewart was the shit back then. Next oldest movie for me is Double Indemnity (1944) I love Barbara Stanwick. ",
        "upvotes": 202,
        "comments": 1183,
        "media": null,
        "permalink": "/r/movies/comments/1p0vew4/name_the_oldest_movie_you_actually_like/"
    },
    {
        "id": "1p0h8vy",
        "author": "ChiefLeef22",
        "title": "'Wicked: For Good' - Review Thread",
        "content": "*Now demonized as the Wicked Witch of the West, Elphaba lives in exile in the Ozian forest, while Glinda resides at the palace in Emerald City, reveling in the perks of fame and popularity. As an angry mob rises against the Wicked Witch, she'll need to reunite with Glinda to transform herself, and all of Oz, for good.*\n\nDirector: John M. Chu\n\nCast: Cynthia Erivo, Ariana Grande, , Jonathan Bailey, Ethan Slater, Marissa Bode, Jeff Goldblum, Michelle Yeoh, Colman Domingo, Peter Dinklage, Bowen Yang\n\n**Rotten Tomatoes:** [72%](https://www.rottentomatoes.com/m/wicked_for_good)\n\n**Metacritic:** [61 / 100](https://www.metacritic.com/movie/wicked-for-good/)\n\nSome Reviews:\n\n[Next Best Picture - Lauren LaMagna](https://nextbestpicture.com/wicked-for-good/) \\- 7 / 10\n\n&gt;The cast, led by the phenomenal Cynthia Erivo and Ariana Grande, still deliver fantastic work that is supported by excellent crafts from all departments of production. But the source material is inherently weaker than the first, making this a less fulfilling entry as a standalone, even if it compliments Part One as a whole. The additional scenes are not necessary and only exist for the material to be long enough to qualify its own feature film, which also results in pacing issues.\n\n[BBC - Caryn James](https://www.bbc.com/culture/article/20251118-wicked-for-good-review) \\- 4 / 5\n\n&gt;Let's be clear: the Wicked films are the definition of preaching to the choir. They aren't likely to win over anyone sceptical of candy-coloured spectacle and overt sentimentality presented in Broadway show-stopping fashion. Wicked is what it is. But if you're fine with that, this latest instalment is more captivating than the last and enjoyable to watch throughout.\n\n[DEADLINE - Pete Hammond](https://deadline.com/2025/11/wicked-for-good-review-jon-chus-part-2-musical-adaptation-1236620980/)\n\n&gt;What can we say about the performances that hasn’t already been said? Both Erivo and Grande could not be better, and in fact Grande really gets a chance to shine here and runs away with the picture whenever she is on screen. Erivo’s Elphaba remains the juiciest role and she defines it with the mortality only movies can bring. Bailey is terrific again, and Goldblum’s Wizard really comes into deep focus now and he’s got it going on. Marissa Bode’s wheelchair-bound Nessarose is given some key screen time and delivers in a piece of casting that is as inspiring as the character she plays. Nathan Crowley outdoes his Oscar winning production design this time around, as does Paul Tazewell’s Oscared Costumes. The visual effects are first rate. So is this whole splendidly realized and cinematic musical adaptation which if you add up the running times of both films comes in just two minutes shy of 5(!) hours. To be honest I wanted *more.*\n\n[The Telegraph - Robbie Collin](https://www.telegraph.co.uk/films/2025/11/18/wicked-for-good-review-second-part-fails-to-take-flight/) \\- 1 / 5\n\n&gt;Ariana Grande is painfully wooden in Wicked’s irritating sequel. What makes it so frustrating is that director Jon M Chu is an established musicals master; his In the Heights is a modern classic of the form. But the corporate stretch-it-out-and-wring-it-dry approach here has been deadening. Even the staunchest defenders of Wicked, the stage musical about the tragic origins of The Wizard of Oz’s Witch of the West, would have to concede that it peaks just before the interval...\n\n[Slant Magazine - Dan Rubins](https://www.slantmagazine.com/film/wicked-for-good-review-cynthia-erivo-ariana-grande-jonathan-bailey/) \\- 2.5 / 5\n\n&gt;But for as sharp as it may sometimes be, *For Good* is stretched out, breathless, and never really emotionally affecting, even on the level of nostalgia. (However bloated, the first film, to quote one of Glinda’s malapropisms, is thrillifying.) It may transport audiences, especially younger ones, to the colorful Oz for the bulk of an afternoon, but it also serves as a reminder that only in its tauter, wrenching stage form can *Wicked*, like a handprint on your heart, really leave you changed for good.\n\n[Loud and Clear - Joseph Tomastik](https://loudandclearreviews.com/wicked-for-good-film-review/)\n\n&gt;*Wicked: For Good* takes many huge swings but misses in baffling fashion, making for a technically impressive but disappointing conclusion to the *Wicked* story. By all accounts, this is the much more difficult half of the story to pull off, as it’s where the musical in particular gets much denser and incorporates many more direct elements from *The Wizard of Oz*. Unfortunately, that difficulty rears its ugly head in *Wicked: For Good*. As ambitious as this movie is for tackling already-unwieldy source material, those ambitions ultimately don’t pay off.\n\n[RogerEbert - Christy Lemire](https://www.rogerebert.com/reviews/wicked-2-for-good-film-review-2025) \\- 3 / 4\n\n&gt;If it sounds like this second half is darker than the first, it is, but it’s also more effective in its consistency of tone. “Wicked” was all fun and games until it wasn’t, and that sudden shift was jarring. In “For Good,” we know from the start that we’re in more serious territory with the deep strings of John Powell’s score as Ozian workers build the Yellow Brick Road. Erivo and Grande find just the right amount of tenderness and sadness with “For Good,” and that bond between them shines bright once more. Poignant and intimate, it’s a legitimate tearjerker. Bring tissues. \n\n[AwardsWatch - Sophia Ciminello](https://awardswatch.com/wicked-for-good-review-jon-m-chu-fails-to-cast-a-spell-with-bloated-fan-service-filled-finale-c/) \\- 'C-'\n\n&gt;Despite stellar work from Erivo and Grande, *Wicked: For Good* can’t justify its existence as its own separate outing. Even with a pair of new songs and a deeper exploration of some of the musical’s beloved characters, the runtime feels bloated and bogged down by Chu’s constant attempts to make this a movie of the moment and to remind audiences of the connection they had to the first film. Simply put, Chu does not add enough new material to make this film feel like much more than a studio cash grab. There’s certainly still magic to be found in the movie for those who are seeking it, but when the credits finally roll, it’s difficult to say that Chu’s additions to this film have changed the world of *Wicked* for the better.\n\n[The Guardian - Peter Bradshaw](https://www.theguardian.com/film/2025/nov/18/wicked-for-good-review-cynthia-erivo-ariana-grande-jeff-goldblum) \\- 4 / 5\n\n&gt;It’s tangled and a bit bewildering; but then so is the original film, in which we never know whether to believe in the Wizard’s final benediction. But what a performance from Erivo; it is genuinely moving when the Prince has to convince Elphaba what we, the audience, have always known: that she is beautiful.\n\n[FilmHounds - Paul Klein](https://filmhounds.co.uk/2025/11/wicked-for-good-film-review/)\n\n&gt;Erivo, Grande and Bailey are all fantastic once again, and allowed to deepen the characters more and show the complexities of them, while also remaining true to why people love them so much. It's a shame that the rest of the cast are given short shrift. Ethan Slater and Marissa Bode have the rumblings of a more interesting subplot that doesn't really go anywhere as much as it should. Even so, and despite its more frantic nature, *Wicked: For Good* continues to lovingly taking a look at what it means to be a rebel against dictatorships, how people will lie to you to get what they want, and how you must remain true to yourself at all times. It's not so much that the film is disappointing, that would be too harsh a criticism. It's that the film is merely as good as it could be, given what the stage show offers. It wraps things up, but there's no feeling of cohesion – something that was never going to be in Chu's hands, and for what he has, he excels at.\n\n[Independent - Clarisse Loughrey](https://www.the-independent.com/arts-entertainment/films/reviews/wicked-for-good-review-sequel-b2866672.html) \\- 2 / 5\n\n&gt;For Good has little sense of movement, literally or emotionally – no profound revelations, no wonder or spectacle. All that’s to be done now is for each character to process, via standardised ballad, what they’ve learned.",
        "upvotes": 1102,
        "comments": 363,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_g-FZfk0LZonE_DiW5HKlhy_JNoapEM-8AIq0zZzh-Y.jpeg?auto=webp&amp;s=2f74edf1345e5706eae1372991d36c507668950e"
        },
        "permalink": "/r/movies/comments/1p0h8vy/wicked_for_good_review_thread/"
    },
    {
        "id": "1p0fw05",
        "author": "Task_Force-191",
        "title": "Official Poster for \"Is this Thing On?\" Starring Will Arnett and Laura Dern",
        "content": "",
        "upvotes": 1168,
        "comments": 114,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2nnluimgh12g1.jpeg?auto=webp&amp;s=ebaeb9e52aea42a0ce9213a641c1be78745a7b09"
        },
        "permalink": "/r/movies/comments/1p0fw05/official_poster_for_is_this_thing_on_starring/"
    },
    {
        "id": "1p16weo",
        "author": "sloaches",
        "title": "What is a movie you like watching, but has at least one scene that makes you roll your eyes in disbelief?",
        "content": "For example-\n\nThe film A League Of Their Own is one that I've enjoyed watching pretty much since it was released back in the '90s. However, one scene that has always bothered me was the Telegram Delivery scene in the locker room. While it was probably included to remind the audience that the film takes place during WWII and wartime casualties were to be expected, it didn't seem necessary to make the delivery guy such an insensitive jerk.",
        "upvotes": 27,
        "comments": 177,
        "media": null,
        "permalink": "/r/movies/comments/1p16weo/what_is_a_movie_you_like_watching_but_has_at/"
    },
    {
        "id": "1p0lkiu",
        "author": "Task_Force-191",
        "title": "New Posters for ‘The Thing With Feathers’ - After the unexpected death of his wife, a father (Benedict Cumberbatch) begins to slip into a fog of grief as a towering, birdlike presence—blurring the line between hallucination and haunting—slowly invades his home, Crow",
        "content": "",
        "upvotes": 506,
        "comments": 133,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gbqdftmsi22g1.jpeg?auto=webp&amp;s=edfe4d8d97e74609f467f2c132a16443f5f31662"
        },
        "permalink": "/r/movies/comments/1p0lkiu/new_posters_for_the_thing_with_feathers_after_the/"
    },
    {
        "id": "1p0g5jb",
        "author": "Bullingdon1973",
        "title": "A.I. Video Is Threatening Our Ability to Trust Documentaries",
        "content": "\"Documentaries fundamentally traffic in issues of truth, transparency and trust. If they use so-called synthetic materials but present them as if they’re “real,” it’s not just a betrayal of the tacit contract between filmmaker and audience. The implications are far broader, and far more serious: a century of shared history is in jeopardy.\"",
        "upvotes": 726,
        "comments": 136,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Bwvwl8NVvlGKWSK2Y1fV45ro7NKtOJpo2RRgWx9XgpE.jpeg?auto=webp&amp;s=54176c81b6887341401eac8ef70527d5f9c8824b"
        },
        "permalink": "/r/movies/comments/1p0g5jb/ai_video_is_threatening_our_ability_to_trust/"
    },
    {
        "id": "1p08z9h",
        "author": "NoCulture3505",
        "title": "Official Poster for ‘Magellan’",
        "content": "",
        "upvotes": 1563,
        "comments": 168,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7uskikbdyz1g1.jpeg?auto=webp&amp;s=5562744c25ab851d36e837a1a878871d67ce5110"
        },
        "permalink": "/r/movies/comments/1p08z9h/official_poster_for_magellan/"
    },
    {
        "id": "1p0crpj",
        "author": "SarahSchachnerAMA",
        "title": "Hey /r/movies, I’m Sarah Schachner, composer of PREDATOR: BADLANDS (in theaters now). I’ve also scored PREY and many video games in the Assassin's Creed and Call of Duty series. Ask me anything!",
        "content": "Hey r/movies, I’m Sarah Schachner, composer of PREDATOR: BADLANDS (in theaters now). I’ve also scored PREY and many video games in the Assassin's Creed and Call of Duty series. Ask me anything!\n\nBio:\n\nIn addition to co-composing Predator: Badlands, I scored Dan Trachtenberg’s 2022 film Prey. You may have heard my music in video games like Assassin’s Creed: Valhalla, Origins, Unity, Call of Duty: Modern Warfare (2019), Modern Warfare II (2022), Infinite Warfare, Anthem, and others.\n\nBeyond film and games, I’ve composed music for NASA’s Cassini mission to Saturn and created an immersive sound installation for NASA’s Jet Propulsion Laboratory Mission Control. I’ve also written and produced with artists like 070 Shake, Christine and the Queens, Mike Dean, and Travis Scott.\n\nPREDATOR: BADLANDS is out in theaters worldwide now.\n\n&gt;Cast out from its clan, an alien hunter and an unlikely ally embark on a treacherous journey in search of the ultimate adversary.\n\nTrailer:\n\n[https://www.youtube.com/watch?v=43R9l7EkJwE](https://www.youtube.com/watch?v=43R9l7EkJwE)\n\nAsk me anything! I'll be back later today (Tuesday 11/18) at 3 PM ET to answer questions.\n\n\\------\n\nEDIT (10pm PST)\n\nThanks for all your questions! That's it for tonight, but I might have some time in the morning to answer a few more.\n\n\\- Sarah",
        "upvotes": 816,
        "comments": 315,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qfiaqnbul02g1.png?auto=webp&amp;s=6838621ed2ac8ecdfc5f7551612b4bee65867eb2"
        },
        "permalink": "/r/movies/comments/1p0crpj/hey_rmovies_im_sarah_schachner_composer_of/"
    },
    {
        "id": "1p10d9i",
        "author": "benitosballs",
        "title": "Adam Sandler’s Eight Crazy Nights (2002)",
        "content": "Some of you may or may not be familiar with this movie, but I am. The few reviews I see/read about it tend to dog on it to no end, but it really holds a special place in my heart. Some of the humor might be crude and childish (as Sandler films can be) but this one in particular is really underrated IMO. There’s really a heart driven story and development with all characters and how they grow through the film. As a 24 year old Jewish guy in south Louisiana, it’s hard to fit in, and there’s not many Jewish films relating to Hannukah. I love the animation, the story, and genuinely reminds me of a good time. I love this movie and don’t care what anyone thinks. Am I just crazy or am I the only person that actually likes this film? lol",
        "upvotes": 37,
        "comments": 48,
        "media": null,
        "permalink": "/r/movies/comments/1p10d9i/adam_sandlers_eight_crazy_nights_2002/"
    },
    {
        "id": "1p06m6i",
        "author": "The_Iceman2288",
        "title": "Deadline: Sadie Sink joins Avengers: Secret Wars",
        "content": "",
        "upvotes": 2066,
        "comments": 347,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1Kx0KD5U7XTAPDpNHIwWRUaHhB8xPZkoxa_veVlqacY.jpeg?auto=webp&amp;s=9343024b71dc0cafc70d59d64169d7087eb3df5c"
        },
        "permalink": "/r/movies/comments/1p06m6i/deadline_sadie_sink_joins_avengers_secret_wars/"
    },
    {
        "id": "1ozsysh",
        "author": "ChiefLeef22",
        "title": "New Image from 'Project Hail Mary'",
        "content": "shared by the man himself, Andy Weir - [https://www.reddit.com/r/ProjectHailMary/comments/1ozk3hg/teaser/](https://www.reddit.com/r/ProjectHailMary/comments/1ozk3hg/teaser/)",
        "upvotes": 23202,
        "comments": 1997,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/djgt76bmxv1g1.jpeg?auto=webp&amp;s=5f43f93125f9f12f6e1d3c3767056a4320b16cff"
        },
        "permalink": "/r/movies/comments/1ozsysh/new_image_from_project_hail_mary/"
    },
    {
        "id": "1p0cwza",
        "author": "Task_Force-191",
        "title": "MAGELLAN - Official Trailer",
        "content": "",
        "upvotes": 581,
        "comments": 130,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bcEBn1uqOM7NCuXCtBmq3uWwo0DM6C0-zeRL1_1pzoo.jpeg?auto=webp&amp;s=f4196ac2ce4f74a78386aac5cff35cdf3f4b5c28"
        },
        "permalink": "/r/movies/comments/1p0cwza/magellan_official_trailer/"
    },
    {
        "id": "1p0n3of",
        "author": "_Laszlo_Cravensworth",
        "title": "Westwood’s Village Theater to be run by American Cinematheque upon 2027 reopening",
        "content": "",
        "upvotes": 149,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Ii6XggV2nKJttmlX2wHs4N0Q1C9p6FUecFP4-JyleE4.jpeg?auto=webp&amp;s=61b585d963f83d8f1c5a80fa4963a1de07c0db06"
        },
        "permalink": "/r/movies/comments/1p0n3of/westwoods_village_theater_to_be_run_by_american/"
    },
    {
        "id": "1p0hxgw",
        "author": "Sirerf",
        "title": "I created an interactive map that lets you explore movies(among other things) based on where and when their stories take place; and what historical events were happening at the same time!",
        "content": "I built **StoryTerra**, an interactive world map where you can explore movies, books, games, and TV shows based on where and when their stories take place, and see what real historical events were unfolding at the same time.\n\nThe platform brings together over **120,000 titles**, all tagged with their narrative time periods and real-world (or closest fictional) locations. You can click on cities, regions, or countries, then use a time slider to browse across centuries, decades, or individual years.\n\nOnce you set a time, the entire map shifts to that era, so you can freely travel the world and see what stories, and real history, were happening everywhere during that time.\n\nYou can also create and share your own lists of stories!\n\nIt's a new way to discovering how fiction and real history intersect.\n\nWould love to have some feedback, I’m always looking to improve it!",
        "upvotes": 249,
        "comments": 29,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/0qt9ok0qu12g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1p0hxgw/i_created_an_interactive_map_that_lets_you/"
    },
    {
        "id": "1p13wuu",
        "author": "BigBossSnake",
        "title": "A Quiet Place (2018) was my most unique cinema experience",
        "content": "Inspired by another recent post with the audience being \"alive\".\n\nMost of the time when you watch a movie you'll have patrons chatting, whispering, laughing, checking phone etc.\n\nBut my experience with the original A Quiet Place was very special and I still think about it from time to time.\n\nThe audience was in total silence for the movie. It was surreal.\n\nMost likely I got lucky and there was a decent size crowd. It just seemed like collectively the audience agreed no one was allowed to make noise. \n\nEven at scary parts, people just seemed to hold their breath and not vocally react. \n\nAnyways, was a fun couple hours.",
        "upvotes": 7,
        "comments": 26,
        "media": null,
        "permalink": "/r/movies/comments/1p13wuu/a_quiet_place_2018_was_my_most_unique_cinema/"
    },
    {
        "id": "1p0vsog",
        "author": "Sweet-Lady-H",
        "title": "What is one of your favorite movies that you feel hardly anyone knows about or has seen?",
        "content": "For me, one of the first to come to mind is The Final Cut with the late, great, Mr. Robin Williams.\n\nI feel like hardly anyone I know has seen it and it just blows my mind since it is such a solid film and an outstanding performance by Robin Williams.\n\nOn the opposite end of the spectrum, Pulse with Kristin Bell is so terrible but I love it so much.",
        "upvotes": 41,
        "comments": 277,
        "media": null,
        "permalink": "/r/movies/comments/1p0vsog/what_is_one_of_your_favorite_movies_that_you_feel/"
    }
]