[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 10,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 43,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1kxprxj",
        "author": "GrouchyElephant7926",
        "title": "We’ve misunderstood the Tylenol Killer for 40 years. It wasn’t chaos or conspiracy. It was a cold, invisible psychopath.",
        "content": "Just watched the Netflix doc, and here’s what struck me: we’ve been looking at this case completely wrong.\n\nThe doc lays out the usual theories: some random madman, or a corporate cover-up involving J&amp;J. But the details of the crime don’t actually support either. What they show is planning, precision, and restraint.\n\nThis wasn’t some unstable lunatic. This was a disciplined, high-functioning psychopath. Likely a man in his 40s, with a background in chemical engineering, pharma manufacturing, or industrial supply chain. Someone who understood how cyanide worked, how packaging could be tampered with undetected, and how quickly product moves off retail shelves.\n\nHe didn’t guess, it was calculated. Multiple bottles, different stores, narrow time window. He knew people would die, and he knew they wouldn’t trace it back to him. That’s not chaos. That’s a controlled system breach.\n\nIf this was revenge, Tylenol wasn’t random. It was J&amp;J’s flagship product. He may have been fired, humiliated, or quietly discarded. And this was his response: not a manifesto, not a demand, just destruction. That silence wasn’t humility, it was the result of years of feeling invisible. No one ever saw him, so why would he need to speak now?\n\nBut even if it wasn’t about J&amp;J, the profile still holds. The murders may have been the point. A final act of control by someone who felt powerless. Either way, this man was a loner. No family to warn. No friends to confide in. No one close enough to notice. That’s why no one came forward. That’s why no one remembers him.\n\nHe might not have been from Chicago at all, just passed through, executed the plan, and vanished.\n\nAnd here’s the part everyone misses: he never did it again. Not because he lost interest. Because it was done. The plan worked. Or maybe because he knew one more move would get him caught.\n\nThis was a smart, self-contained psychopath who saw himself as nothing, and built a crime that finally proved he was something. Then he disappeared the same way he lived: completely unseen.\n\nWe’ve been looking for the wrong kind of monster this whole time. Maybe someone remembers the right one.",
        "upvotes": 111,
        "comments": 129,
        "media": null,
        "permalink": "/r/netflix/comments/1kxprxj/weve_misunderstood_the_tylenol_killer_for_40/"
    },
    {
        "id": "1kxx2qz",
        "author": "stellacampus",
        "title": "Yes I know \"Pig\" sounds insane, but if you haven't seen it you really should.",
        "content": "Yes, Nic is way over the top, but it somehow works here - I think this has to be considered one of his best performances.  The story line does not sound like something anyone would be interested in, and yet it ends up being fairly compelling.  It's a really good, odd little movie that you might like if you give it a chance.",
        "upvotes": 32,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1kxx2qz/yes_i_know_pig_sounds_insane_but_if_you_havent/"
    },
    {
        "id": "1kxwgqn",
        "author": "EmptyPocketsXotics",
        "title": "A Deadly American Marriage",
        "content": "I'm finishing up watching this documentary and came across an interesting tidbit. At 1:06:00, Molly is talking about having voice activated recording devices in different parts of the house, including one behind the headboard in the bedroom. How is it this was conveniently not brought up during any part of the trial? Does anyone have any info on this?",
        "upvotes": 25,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1kxwgqn/a_deadly_american_marriage/"
    },
    {
        "id": "1kxp7zz",
        "author": "Internal-Bed-3150",
        "title": "The Gentlemen season 2: Netflix confirms production is underway",
        "content": "",
        "upvotes": 52,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kxp7zz/the_gentlemen_season_2_netflix_confirms/"
    },
    {
        "id": "1ky0txe",
        "author": "Comprehensive-Way482",
        "title": "Netflix's New Crime Thriller Show 'Secrets We Keep' Is For 'Big Little Lies' Lovers",
        "content": "",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ky0txe/netflixs_new_crime_thriller_show_secrets_we_keep/"
    },
    {
        "id": "1ky0lri",
        "author": "Emirates_aviationer",
        "title": "My opinion on the Sweet Tooth ending",
        "content": "Day 1 watcher here! My dad and I have always loved watching shows as a kid together. We watched all the Star Wars shows and movies, marvel movies and shows, stranger things, and a bunch of Netflix/Paramount shows. Sweet Tooth was probably the only show that him and I watched each season on day 1. We were so hooked on S1 that we kept watching on every launch day. Now we weren’t able to find time to watch the last season but the past 2 days we watched a bunch of episodes and I’m going to say this. The ending made me cry. I have never cried for a show before but it just made me feel different about my whole life ahead of me (I’m 15 currently). I just thought that how Gus expressed on how all things have an ending in a beautiful way was so touching and inspirational. I’m not going to spoil it for people who haven’t watched but I’ll give an actor review. I HATED Dr. Singh and Mrs. Zhang. The actors did very well on making me hate them which is actually a great thing as they acted amazing. The guy that Becky killed in the beast also made me pissed off. Overall I loved Sweet Tooth and I suggest you watch it if you haven’t. Best show I’ve watched in a long time.",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ky0lri/my_opinion_on_the_sweet_tooth_ending/"
    },
    {
        "id": "1ky2qy7",
        "author": "Quail-Fancy",
        "title": "Netflix updated its menu and I hate it..",
        "content": "How do I undo this new menu format and go back to the old one?\nI'm using a like 6 year old lg smart TV with an Amazon firestick.\nI've tried opting out of the update on their site.\nI uninstalled the app and reinstalled it.\nTried clearing cache and clearing data.\nNone of these have done anything.\n\nMy TV downstairs in my living room has not switched to this new menu yet and I'm really trying to divert that from happening there too. \n\nAny help is greatly appreciated as this new menu is super annoying to navigate and makes the ease of selecting more of a hassle.. bad move Netflix.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ky2qy7/netflix_updated_its_menu_and_i_hate_it/"
    },
    {
        "id": "1ky4f3e",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix Drops Cryptic Teaser for 'Wake Up Dead Man: A Knives Out Mystery'",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ky4f3e/netflix_drops_cryptic_teaser_for_wake_up_dead_man/"
    },
    {
        "id": "1ky5jlo",
        "author": "Away-Sample-1662",
        "title": "Breaking bad and better call saul don’t have ads?",
        "content": "Every other show/film on my watchlist has ads aside from these two from what I can see? What is going on? Is it because they are “netflix originals” what am I missing?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ky5jlo/breaking_bad_and_better_call_saul_dont_have_ads/"
    },
    {
        "id": "1kxz4o3",
        "author": "BobDeenghus",
        "title": "My list in new TV app interface",
        "content": "My TV app updated today. Does anyone know how I can expand “My List” section to see all the movies and shows I’ve got stored there? Or do I have to spend half an hour on scrolling to the right in My List row view? I’ve got tons of shows saved there that I watch gradually but today it took a lot of time to scroll to “that movie” with “that actor” that I saved for later. I tried going to “My Netflix” section but the My List is also in a row view. ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kxz4o3/my_list_in_new_tv_app_interface/"
    },
    {
        "id": "1ky4sjz",
        "author": "DJSpadge",
        "title": "A couple of questions",
        "content": "A family member (Same house) just got the standard (No advert) plan.\n\nIt says watch on 2 devices at once.\n\nIs that the same movie/tv or different ones on each device?\n\nAlso it's unclear how the second user accesses Netflix, Is it the same Email/PW as the primary user? or...\n\n\n Cheers.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ky4sjz/a_couple_of_questions/"
    },
    {
        "id": "1kxyflm",
        "author": "coffee_and-cats",
        "title": "Sirens",
        "content": "Should I continue watching?\n\nOn episode 3. Finding it drawn out and boring. Does it get better?\n\n\nI've purposely not read any other threads. I don't want spoilers in case its worth watching.\n",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1kxyflm/sirens/"
    },
    {
        "id": "1kxh8bq",
        "author": "boobooball5",
        "title": "New show suggestions please",
        "content": "\nMy fav genres are crime, psychological thrillers, a bit of teen drama and romance, witty humor, steamy shows are my guilty pleasures! I enjoy shows like YOU, Handmaids Tale, The diplomat, ginny and Georgia , Virgin River, Marvelous Mrs Maisel, Fleabag, Elite, Bridgerton, The Empress, Behind her eyes, obsession, unbelievable, White Lotus, Normal People, The Bold Type , Gilmore Girls, Modern Family, classics like Vampire Diaries!\n\nPlease help a bored girl out! Thanks in advance ",
        "upvotes": 23,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1kxh8bq/new_show_suggestions_please/"
    },
    {
        "id": "1kxyhtl",
        "author": "dailystar_news",
        "title": "'House of Horrors' fiend Rose West changes name in prison but still 'has no friends'",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kxyhtl/house_of_horrors_fiend_rose_west_changes_name_in/"
    },
    {
        "id": "1kxamzx",
        "author": "bitchandmoan69",
        "title": "Its really fucking annoying that the starter of the binge streaming model of TV keeps interrupting me to ask if I'm watching.",
        "content": "At least rate limit it to 2 hours or something, dont do it by episode count because short episode things like Love Death and Robots exists. I had it ask me if I'm still watching twice in one hour, very annoying.",
        "upvotes": 40,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1kxamzx/its_really_fucking_annoying_that_the_starter_of/"
    },
    {
        "id": "1kxkzn3",
        "author": "Same_Cat6189",
        "title": "Is Pernille worth sticking with? I’m on S2 and struggling with how much of a pushover she is…",
        "content": "I’m on Season 2 of Pernille and I’m torn. The acting and writing are excellent, and I want to keep watching—but it’s getting exhausting seeing the main character constantly swallow her feelings and let everyone, especially her daughters, walk all over her.\n\nIt’s hard to watch someone be emotionally bullied over and over without advocacy. Do characters eventually show growth?\n\nI want to stick with it if there’s a character arc, but if the whole show is just pain with no change, I might have to tap out.\n\n",
        "upvotes": 8,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kxkzn3/is_pernille_worth_sticking_with_im_on_s2_and/"
    },
    {
        "id": "1kxfnoo",
        "author": "ValuableExact4899",
        "title": "shows to watch",
        "content": "just finished rewatching breaking bad and dexter and i need a new show to watch! i love the vibes of breaking bad and dexter, and i like the crime and gore and stuff that they have. \n\nive seen people recommend Ozark so i may start watching that. does anyone recommend this? \n\nany other great shows i can watch that give these vibes??? ",
        "upvotes": 13,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1kxfnoo/shows_to_watch/"
    },
    {
        "id": "1kxtl5o",
        "author": "anandasheela5",
        "title": "Nonlinear storytelling shows or movies ?",
        "content": "I just finished Thank you, next - I liked the plot and the narrative.. Is there any other shows or movies that you would recommend with nonlinear storytelling ? \n",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1kxtl5o/nonlinear_storytelling_shows_or_movies/"
    },
    {
        "id": "1kxsgx6",
        "author": "Dark-N1ghtmar3",
        "title": "Can’t revert back to original design",
        "content": "Just got the new update for the redesign, and it is horrible. I had the “ do not test” set to off for beta tests. I logged out and cleared the date cache, and now it won’t revert back to the original design. Am I screwed, or is this permanent?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kxsgx6/cant_revert_back_to_original_design/"
    },
    {
        "id": "1kxq1er",
        "author": "MaikyTheory",
        "title": "Is The Flash series Dubbed?",
        "content": "I Wonder if the flash series is transleted to czech cause I dont have netflix yet and I wanted to buy it because it has the flash series but I want it in czech dabing so could anyone tell me if it is? I really need to know thanks.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kxq1er/is_the_flash_series_dubbed/"
    },
    {
        "id": "1kx8cey",
        "author": "temeria_123",
        "title": "Just discovered Obliterated, why was this cancelled?",
        "content": "What the hell Netflix, you cancelled one of the most fun shows ever. Alright, this is no \"White Lotus\" or \"Severance\" or whatever, and the best part is...it never tries to be. This is one of those cheesy, over-the-top, brainless action shows that is sexy, funny and addictive. It's a throwback to shows I watched as a kid, Airwolf, Miami Vice, Knight Rider...the 80s baby. And c'mon, it's better than the shitty movies Netflix puts out like Red Notice, Old Guard, Extraction and those 100 generic Ryan Reynolds movies. The cast is hot, doing hot things, while saving U.S. from a nuclear detonation. What's more American than that? The storyline is cliche, but still decent, Russians are bad (of course), but rather than pitting them against another foreign power, there are rogue U.S. ex-military operatives vying for the bomb. There are some genuine twists (don't expect Sixth Sense/Fight Club level twists), that I found good. There are a lot of zingers in the dialogue, c'mon references to Rambo and Mission Impossible (\"fuck, we've been Ghost Protocol-ed\" had me lmao). There were even some deep philosophical shit, like the Gremlin representing Paul's inner demons, fantastic.  Characters, Ava, McKnight, Trunky, Tech Chick, Haggerty, Paul, Gomez were all likeable af, and the cast really delivered. Does help that everyone is hot, yes even Tech Chick. I didn't want any of them to die (which is unusual, there is normally always that 1 person). And Gremlin, voiced by B-99's Jason Mantzoukas, epic. Some people say this show was too raunchy, but nothing a generation that grew up watching American Pie and Hangover would find shocking. And the action was a blast, there are car chases, car crashes, helicopter chases, guns, physical fights, knife fights hell yeah. So imo, this show has a lot of gas left in the tank, they can make 1 season every couple of years (ala Witcher) set in different locations and different \"missions\". Then I found out it was canned....wtf. I really think the reception of the show would have turned out very differently if:\n\n1. Change the fucking title to something easier to remember. I found this show when I accidentally pressed \"O\" in the search bar. And it took me a while to remember the name.\n2. Have a token A-lister in the cast. Shows like Hangover and Bullet Train would've been duds if it wasn't for Bradley Cooper or Brad Pitt - just sayin'. It's not fair to the cast because they were great, it's just Hollywood economics.\n\nSo...when S2?",
        "upvotes": 15,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kx8cey/just_discovered_obliterated_why_was_this_cancelled/"
    },
    {
        "id": "1kxnjuk",
        "author": "MysticCrest1830",
        "title": "'Wednesday' creators preview a darker season 2 (exclusive)",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kxnjuk/wednesday_creators_preview_a_darker_season_2/"
    },
    {
        "id": "1kwwrqc",
        "author": "Selena_beauregard",
        "title": "Sirens Opinion - I don’t get why people don’t like this character",
        "content": "So, I have watched Sirens and, on online discussions, a lot of people seem to hate Devon “for being manipulative of Simone” and love Simone for “leaving and going after a better life”.\n\nFor me, Simone was in fact in danger. Is really clear though the show that she 1. Is not taking her med and is an emocional mess, 2. Being groomed by Micaela and very vulnerable, 3. In the end, she is just trying to survive and ends up in the worst spot she could: in the hands of a very wealthy older man who has all the power in the relationship and a history of disregard for his wives.\n\nIn the end, Devon actually lets Simone go when she realizes that 1. Simone will be as auto destructive as she was because it’s her life, and Devon will drown with her if she keeps trying to save her, and 2. Devon realizes she doesn’t know Simone that well too. Also, it is very clear Devon has a lot of mental issues and doesn’t got the money for treatment (thus the affairs with a lot of guys, impulsive decisions and emotional outbursts).\n\nAnd yes, she was not right to expect Simone to take care of their father, but it makes sense she did. Devon was not expected to take care of Simone either, she was not responsible for her and yet she took that role. In her mind, at the start of the show, she thought that she was obligated to take care of Simone because they were family, and that’s the same reason she takes care of the dad and why she thinks Simone should too. In the end, she realizes that taking care of family was a choice and one she was very happy and proud to make.\n\nI really liked Devon actually, because by the end she finally finds a “light” and starts to follow a good path. I don’t get the hate.",
        "upvotes": 42,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1kwwrqc/sirens_opinion_i_dont_get_why_people_dont_like/"
    },
    {
        "id": "1kxk64q",
        "author": "Shot_Tough_1232",
        "title": "Hi I need a bit of help",
        "content": "Basically I’m asking that do I need to watch the other fear street trilogy first or prom queen first before them or is it meant to be a standalone movie that has no connection to the trilogy and just the name ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kxk64q/hi_i_need_a_bit_of_help/"
    },
    {
        "id": "1kxjuzs",
        "author": "Technical-River-772",
        "title": "Not part of Netflix household but I'm in the house on Wifi",
        "content": "I was trying to open Netflix, but now it says that my device isn't part of the Netflix household. I used it the other day no problem. I'm a college student but I'm home for summer break and I'm on my house's internet right now. The device limit thing has never seemed to be an issue for me or my family before, and it's always recognized my computer. Most advice I saw about this was to connect to the known network, but I'm on it.  My dad owns the account so I'm not 100% sure, but I'm pretty sure we have the standard plan. I'm the only one home, and my dad is working, so I know nobody else is using it right now. I'm just mainly confused as to why this is happening now of all times. Any advice or ways to fix this?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kxjuzs/not_part_of_netflix_household_but_im_in_the_house/"
    },
    {
        "id": "1kx39uo",
        "author": "CryptographerAny7171",
        "title": "Looking for reality show recommendations!",
        "content": "I love the intensity and drama of Hell’s Kitchen, Culinary Class Wars, Single’s Inferno, Love Island, Love is Blind, Squid Game The Challenge, and Physical: 100. Got any suggestions with a similar feel?",
        "upvotes": 13,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1kx39uo/looking_for_reality_show_recommendations/"
    },
    {
        "id": "1kxap5w",
        "author": "Ihadtosubscribe",
        "title": "Weird glitching on PC while fullscreen",
        "content": "Using the official app from the Microsoft Store. Tried disabling all Edge extensions, didn’t help. Doesn’t happen of Firefox for some reason (no, I don’t wanna use Firefox because it won’t go above 1080p and also no HDR). The glitching stops when I move the mouse and the overlay with controls comes up. It doesn’t seem to happen with every show, just with those who have a 16:9 aspect ratio. It happens even when the show is paused, as long as there isn’t the overlay as I said earlier. Anybody had the same issue?",
        "upvotes": 3,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/a0ose6ta2h3f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1kxap5w/weird_glitching_on_pc_while_fullscreen/"
    },
    {
        "id": "1kwyqlt",
        "author": "Xrusha_001",
        "title": "Favorite Shows - Neurodivergent/Highly Sensitive/Mental Health related",
        "content": "- Atypical \n- Fern Brady, Autistic Bikini Queen\n- North of North \n- Maid\n- Nobody Wants This\n- Never Have I Ever\n- The Queen's Gambit\n- Running Point\n- Crazy Ex Girlfriend (sadly no longer on Netflix)",
        "upvotes": 9,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1kwyqlt/favorite_shows_neurodivergenthighly/"
    },
    {
        "id": "1kxui7g",
        "author": "MaxPayneGriddying",
        "title": "Ripoff",
        "content": "Netflix is such a bad streaming service and so expensive i believe that everyone should cancel netflix and get a dodgy firestick it has way more stuff and is cheaper",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1kxui7g/ripoff/"
    },
    {
        "id": "1kxh1qz",
        "author": "adwcta",
        "title": "Peppa Pig S7 languages",
        "content": "Season 7 just released, and the entire show is in English only (even subs are English only), whereas for prior seasons there's a whole bunch of other languages available.\n\nDoes anyone know if/when Netflix will be adding the dubs for the other languages?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kxh1qz/peppa_pig_s7_languages/"
    }
]