[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 8,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 92,
        "comments": 275,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mj4s0m",
        "author": "BadShi-6",
        "title": "What’s with every new series being split in to 2 parts?",
        "content": "I’ve just sat down to watch the new season of Wednesday — I’ve noticed yet again Netflix has split the season into part 1 and part 2. Why do they keep doing this?  It’s actually super annoying to me, long gone are the days you can just sit and binge a new series on your day off. \n\nDo you guys prefer them split into 2 parts? I lose interest waiting for the second part of anything.. is there specific reasons for this like stretching out views etc? I don’t think it builds suspense like Netflix thinks, it’s actually just annoying 😂 ",
        "upvotes": 24,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1mj4s0m/whats_with_every_new_series_being_split_in_to_2/"
    },
    {
        "id": "1mja9b7",
        "author": "ComfortableWage",
        "title": "Anyone else getting tired of good series getting cancelled to the point you're just reading books more instead?",
        "content": "To be honest, that's where I'm at. And this doesn't just apply to Netflix, but Amazon and other streaming services as well. I'm tired of them pumping out series like candy, some of which in my opinion are really good, only for them to eventually get cancelled often times after just one or two seasons.\n\nIt's annoying. It's a disservice to subscribers. And frankly, I've been reading books of any series I find online now instead anyways because I've been so conditioned to just assume anything I like will eventually get cancelled anyways. \n\nAnd honestly? The books have been offering me a much better experience overall. I feel better, even if I spend all day reading a book or two, than I would've had I spent it binging a show. I also have the added confidence knowing that I'll be able to finish the series without getting pissed off after wasting so much time watching it only to find out it's cancelled later.\n\nSo yeah... books for the win! Depending on how into books I go I may honestly just get rid of my Netflix subscription altogether.",
        "upvotes": 7,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1mja9b7/anyone_else_getting_tired_of_good_series_getting/"
    },
    {
        "id": "1mizgyd",
        "author": "Sweaty-Toe-6211",
        "title": "‘KPop Demon Hunters’ Becomes Netflix’s No. 4 Most Popular English-Language Movie Ever",
        "content": "",
        "upvotes": 29,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1mizgyd/kpop_demon_hunters_becomes_netflixs_no_4_most/"
    },
    {
        "id": "1mj2tuw",
        "author": "intelerks",
        "title": "‘The Walking Dead’ Actress Kelley Mack Dies at 33",
        "content": "",
        "upvotes": 16,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mj2tuw/the_walking_dead_actress_kelley_mack_dies_at_33/"
    },
    {
        "id": "1mii95w",
        "author": "MoneyLibrarian9032",
        "title": "‘KPop Demon Hunters’ Becomes Netflix’s No. 4 Most Popular English-Language Movie Ever",
        "content": "",
        "upvotes": 135,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1mii95w/kpop_demon_hunters_becomes_netflixs_no_4_most/"
    },
    {
        "id": "1mj9oap",
        "author": "Legitimate_Dream9721",
        "title": "Can’t find show name - may be spoilers",
        "content": "I’m watching Surviving Summer again on Netflix (absolutely the show). However, my head is mixing it up with another show that I believe was also Netflix. Can anyone remember what this show was, I have added some facts I recall below - beware some may be spoilers but I can’t remember all details:\n\nDaughter/model sent to live with aunt in Australia after ruining a designers outfit.\n\nThere’s a girl called Coco and I think the uncle had recently died? Aunt and uncle were a surfing family - he had a shed to make surf boards in.\n\nI think there was a character Tom?\n\nDaughter makes friends, offends friends, then makes a fashion show of swim suits through the decades for an annual celebration on the beach.\n\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mj9oap/cant_find_show_name_may_be_spoilers/"
    },
    {
        "id": "1mja0pi",
        "author": "False_Candle1666",
        "title": "Back to school",
        "content": "I feel like every year, all I have to watch when fall comes around is reruns of *Veronica Mars* and *Gilmore Girls*. Are there any other shows that give off the same vibe and are just as good?  \nI've already seen *Pretty Little Liars* and *Gossip Girl* — they’re okay, but I don’t love them as much.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mja0pi/back_to_school/"
    },
    {
        "id": "1mj8vtt",
        "author": "indiewire",
        "title": "Hunter Doohan on 'Wednesday' Season 2 and His 'Even More Deranged Arc'",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mj8vtt/hunter_doohan_on_wednesday_season_2_and_his_even/"
    },
    {
        "id": "1mj8vqs",
        "author": "scottishdrunkard",
        "title": "Netflix won’t play the credits…",
        "content": "So, I’m watching Netflix and on every show, it will not play the credits. And I’m one of the few people who likes credits, they have nice music. You know that tiny screen it turns into when the credits play and asks if you wanna skip to the next episode? Doesn’t play the credits. Highlighting that window just plays the episode over.\n\nThe Netflix is hooked up to the Sky Box, and the Sky Box has two other slave boxes connected to it. When you play Netflix on those TVs, the credits play. It’s just the main box that doesn’t play them. I was at one point told to turn the Sky Box off and on again to reset it, I even did a hard reset where I cut the power, and rebooted it, but nothing. No change. \n\nCan you help me fix it? Wednesday just started, and I like clicking my fingers at the end…",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mj8vqs/netflix_wont_play_the_credits/"
    },
    {
        "id": "1mj6ep9",
        "author": "139nn1_si3",
        "title": "Is riverdle worth watching???",
        "content": "I’m only deciding to watch this because Camila Mendes is my fav actress. But I saw the trailer and I don’t feel like I’m gonna like it cuz I’m not really into oh people die what a mystery kind of thing lol. A saw that they have so many seasons there might be other situations as well right? So without the spoilers tell me what kind of story it is😊",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1mj6ep9/is_riverdle_worth_watching/"
    },
    {
        "id": "1mj57fc",
        "author": "Equivalent_Parking_8",
        "title": "Just switched to Standard from ad supported (UK)",
        "content": "I have switched my membership to standard for two reasons, one it doesn't work in Finland with ads and I travel there often, and I wanted to watch community which netflix told me was only available on the ad free service. \n\nHowever as soon as i switched it tells me community isn't available.  I know I need it to watch It's always sunny which should drop soon so I'm not too mad, but wondering what other films and shows are available on the higher priced service. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mj57fc/just_switched_to_standard_from_ad_supported_uk/"
    },
    {
        "id": "1mihl0d",
        "author": "-AI3x",
        "title": "What Should I Watch On Netflix?",
        "content": "I’m currently looking for something to watch on Netflix as I’m Quite Bored.\n\nI used to watch a lot of Horror Movies, Thrillers, Detective. Action and Comedy movies.\n\nSo something with those genres would be great. ",
        "upvotes": 31,
        "comments": 213,
        "media": null,
        "permalink": "/r/netflix/comments/1mihl0d/what_should_i_watch_on_netflix/"
    },
    {
        "id": "1mivxh6",
        "author": "youdontgetityet",
        "title": "i’m starting to get the hype…",
        "content": "i normally stray away from mainstream shows because most of the time they’re cringey, predictable, or downright stupid. i finally gave in and watched the summer i turned pretty, i hate to say how much i loved it. i was SOOOO engrossed with the characters and i binged it in just one night. have i been wrong all this time?!? WHAT HAVE I MISSED? someone pls recommend your favorite mainstream shows!!!",
        "upvotes": 4,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1mivxh6/im_starting_to_get_the_hype/"
    },
    {
        "id": "1mhzsi2",
        "author": "Friendxx",
        "title": "K POP Demon Hunters is INCREDIBLE!",
        "content": "I’m an adult male and I never listen to K POP or watch animation, yet I’m totally hooked on this movie, I’ve seen it like three times already. I got the sound track playing on my Spotify every day, such a catchy song, Golden, is amazing. Everyone I know is totally hooked on this movie. Sony did an incredible job with this movie. Glad it’s on Netflix and I can watch it anytime I want!",
        "upvotes": 370,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1mhzsi2/k_pop_demon_hunters_is_incredible/"
    },
    {
        "id": "1mj0oco",
        "author": "Cor3nd",
        "title": "Ghosts s02?",
        "content": "I recently watched the series Ghosts on Netflix and really enjoyed it. The characters and story were great, and the tone was both funny and touching. Does anyone know if there’s a season 2 planned or in production? I’d love to see what happens next. S01 was in 2022. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mj0oco/ghosts_s02/"
    },
    {
        "id": "1mj7tks",
        "author": "TimesandSundayTimes",
        "title": "Wednesday is back – but is the second series worth watching?",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mj7tks/wednesday_is_back_but_is_the_second_series_worth/"
    },
    {
        "id": "1mis6et",
        "author": "Lostmyoldname1111",
        "title": "My Oxford Year",
        "content": "Stumbled on My Oxford Year and so far, so good. I’m particularly enjoying that the male lead is the actor that played young King George in the Queen Charlotte mini-series. Looks like it’s going to be decent.",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1mis6et/my_oxford_year/"
    },
    {
        "id": "1mixn9w",
        "author": "Lonely_Holiday9034",
        "title": "Bad Sport",
        "content": "Okay I just started watching this show and it’s so good!! Although I knew to some extent sports (basically anything) can be rigged, it’s crazy how greed can really ruin your life even when you have it all. Has anyone else watched it? If so, what are your thoughts/ favorite episodes? I watched Hoop Schemes (basketball) Gold War (figure skating) and Need for Weed (racing) so far.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mixn9w/bad_sport/"
    },
    {
        "id": "1miuyqh",
        "author": "Impossible_Owl_5284",
        "title": "Netflix Household Issue",
        "content": "I'm pulling my hair out since this new Netflix Household concept went into effect.  My main TV is on a LAN line and the rest of our TVs, phones, tablets are using the WiFi on the same network.  I looked up the IP addresses and they are different after the 2nd \".\"  So last 5 digits are different for the router vs the LAN connection.\n\nIs there any solution to this?  Netflix has no technical support and I'm literally having to re-verify my devices from one episode of a show to another.   Needless to say,  extremely frustrating.\n\nAnyone has a similar setup and a solution for this?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1miuyqh/netflix_household_issue/"
    },
    {
        "id": "1migzz8",
        "author": "tamlee00",
        "title": "Series recommendations for me and my girlfriend?",
        "content": "Me and my girlfriend are looking to start a new series, any recommendations?\n\nPrevious serious on Netflix that we have watched and enjoyed - Prison Break, Peaky Blinders, Power…. Just to give an idea of things we’ve previously watched\n\nAny recommendations appreciated👍🏼",
        "upvotes": 6,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1migzz8/series_recommendations_for_me_and_my_girlfriend/"
    },
    {
        "id": "1mipdrt",
        "author": "Suspicious-Job-8815",
        "title": "Untamed Moral(?)Opinion",
        "content": "Spoilers if you haven’t watched \n\n\n\n\nIn untamed, it’s revealed that Jill paid Shane to take out Sanderson for what he did to Caleb. \n\nFor me personally, (someone who’s thankfully never been in that situation) I’d much rather see him be sent to prison &amp; shamed as a child rapist &amp; killer. Sandersons family still see him as a good person who went missing in the park &amp; will likely get a fat payout from the lawsuit. Wouldn’t it be better if he was publicly shamed &amp; sent to prison where I’m sure pedophiles do not have a good time. I do get that Jill didn’t want to listen to his voe in court &amp; Kyle wanted to be sure. But they literally had a video of them together.\n\n Obviously I know it’s just a show, but just a hypothetical. ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mipdrt/untamed_moralopinion/"
    },
    {
        "id": "1mil7gy",
        "author": "GucciDLuffy",
        "title": "continue watching problem",
        "content": "for like a week my continue watching row has been full of movies and shows that i've ALREADY COMPLETED. when i click remove from row they just pop right back up when i sign back in. don't see this happening to anyone else so wtf did i do wrong?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mil7gy/continue_watching_problem/"
    },
    {
        "id": "1mj29tz",
        "author": "Jdontgo",
        "title": "Dept Q",
        "content": "Ok I kept being like HOW DID THEY MISS THIS SHIT?!\n\nlike they LOOKED at that family... they should have seen the logo and SOS business FAR way back… because that would have been actual thorough research IF they were looking into them.\n\nTHEN…. omg… HOW THE HELL did they have a plot hole about the fake call being from a supposed daughter who NO ONE CHECKED UP ON AT ALL like WTF. this was beyond suspension of disbelief. honestly… I wanted to like this show. I watched the whole thing even… AFTER all that… but I couldn’t enjoy it. I wanted to throw my TV out and felt my brain rotting and intelligence insulted. like WTF.\n\nalso the Psychologist? very unrealistic and I HATED it… dear god just… no.  \n  \nand then at the end he just blackmails that guy? yeah no. this show disappointed me. it was also too long and could have used more editing. \n\nOK I just needed to scream into the void about my frustration here. \\*sighs\\*",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1mj29tz/dept_q/"
    },
    {
        "id": "1miikw5",
        "author": "MoneyLibrarian9032",
        "title": "Netflix Unveils Full Cast for ‘The Twits’ Movie, Original Songs by David Byrne and Hayley Williams",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1miikw5/netflix_unveils_full_cast_for_the_twits_movie/"
    },
    {
        "id": "1mitabs",
        "author": "gipaaa",
        "title": "Is it possible to add custom subtitle on iphone netflix?",
        "content": "I'm living abroad and not quite understand local language. Many local movies on netflix doesn't have english subtitle. So is there a way to add custom subtitle on netflix on iphone? I knew it's possible on PC browser with extension.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mitabs/is_it_possible_to_add_custom_subtitle_on_iphone/"
    },
    {
        "id": "1mhh8le",
        "author": "Longjumping_Land_977",
        "title": "Amy Bradley case has a number of ‘new tips’ following ‘incredible’ response to Netflix series",
        "content": "",
        "upvotes": 591,
        "comments": 360,
        "media": null,
        "permalink": "/r/netflix/comments/1mhh8le/amy_bradley_case_has_a_number_of_new_tips/"
    },
    {
        "id": "1miseb6",
        "author": "skumfuck69",
        "title": "Titans: The Rise of Hollywood is over-narrated and underwritten.",
        "content": "What could certainly make for a compelling story has been rendered entirely as summary. The narrator rarely lets ten seconds pass without commenting.\n\nIt's the strangest thing because there are actors acting out a story (albeit a rushed one), but rather than letting the actors speak to eachother, the actors are mostly quiet while the narrator tells the audience who they are and what they said to eachother. \n\nI'm guessing that the studio companies enforced a strict script and the \"writers\" weren't allowed to veer from telling the exact story provided, but even so it just seems so awkward.\n\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1miseb6/titans_the_rise_of_hollywood_is_overnarrated_and/"
    },
    {
        "id": "1mis4hw",
        "author": "Hefty-Grand3184",
        "title": "Traveling for work",
        "content": "I travel all over for work and can't watch Netflix so im thinking another canceling any tips for how to fix the whole outside the household thing before I do",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mis4hw/traveling_for_work/"
    },
    {
        "id": "1mi5oyn",
        "author": "clueless_212",
        "title": "what are some interesting documentaries/docu series?",
        "content": "i usually watch true crime so would love more suggestions for those, but if any other that are interesting lmkk xxx \n\npls send ones only on netflix as that is all i have thx  ",
        "upvotes": 14,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1mi5oyn/what_are_some_interesting_documentariesdocu_series/"
    },
    {
        "id": "1mikd83",
        "author": "Appropriate_Catch860",
        "title": "Best thriller and crime web series or films to watch",
        "content": "I am in searching best thriller movie to watch. I hope you will help me. Now I don’t know what to write more, it is feeling like I am writing an essay. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mikd83/best_thriller_and_crime_web_series_or_films_to/"
    }
]