[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 36,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 12,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1q0xodo",
        "author": "Naive_Fee258",
        "title": "Thoughts on the Stranger Things final episode?",
        "content": "Thoughts/concerns/questions\n\nThe ending was amazing and Holly was my favorite character this season!!\n\nI don't have a favorite season I like them all for different reasons but I think the final  ending was 🤯🤯.\n\nA lot of people were divided about this season.",
        "upvotes": 107,
        "comments": 397,
        "media": null,
        "permalink": "/r/netflix/comments/1q0xodo/thoughts_on_the_stranger_things_final_episode/"
    },
    {
        "id": "1q1671g",
        "author": "OdiseoX2",
        "title": "Regarding Kali in Stranger things (spoilers)",
        "content": "I just feel they did Kali’s character dirty this season. The only two reasons i can think of that they brought her back was to kill someone so they wouldn’t have to kill anyone from the main group, and to close the gap about what happened to her after the show ended. ",
        "upvotes": 17,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1q1671g/regarding_kali_in_stranger_things_spoilers/"
    },
    {
        "id": "1q16vhz",
        "author": "Zedaso",
        "title": "Stranger things finale, big moments and big questions. I can't stop thinking about what WASN'T in the finale.",
        "content": "This is far longer than expected. I'll put a TL;DR at the bottom.\n\nOverall, I enjoyed the finale, have to say Jamie as Henry/Vecna stood out, he absolutely killed it. There were a lot of amazing moments, but I can't shake the feeling that a lot was missing, it even felt rushed in some places and I'm left with a lot of questions.\n\nWe saw zero demogorgons, demodogs or demobats in the finale, weird from a show that started with the demogorgon. \n\nWe didn't see the \"army\" Vecna showed Nancy in Season 4 and she talked about. I remember her speech: \"Vecna showed me so many terrible things. This giant creature with a gaping mouth, and this creature wasn't alone, there was so many monsters. An army, and they were coming into Hawkins. Into our homes.\" \n\nVecna had no defence, yet he knew Eleven and the gang would be coming, he even saw into her mind, he knew all their plans.\n\nThe military did nothing to the gang and just let them go after the crimes they committed, murdering their soldiers etc? They even let Hopper who had a fight with Dr. Kay become chief of police again?\n\nVecna was impaled and decapitated, the mind flayer was shot and burned yet Will felt nothing when he was right there? What happened to the hive mind? Not long before the big fight we see him reacting to when Henry felt pain from his memory of being shot in the cave as a kid. I thought he would have been seriously hurt or even killed being right near the hive mind when they were attacking the mind flayer and Vecna.\n\nVecna and the mind flayer were these otherwordly eldritch horrors with god-like powers and they were defeated so easily with not much loss for the gang.\n\nThis part is a bit too sci-fi for me and I love this sort of stuff, I'm just not smart enough to understand it, but: The whole blowing up the wormhole at the lab with the C4 at the dark matter seemed off. It completely wipes out all of the upside down, and probably the other dimension, but leaves Hawkins at the gate completely fine where we see \"Eleven\" standing to be killed? Would it not have also wiped out Hawkins, or at least done some damage?\n\nI understand the idea behind the Eleven ending, it was a smart idea in theory, but I don't think they pulled it off too well. Maybe I missed something, but she was right next to Mike in the truck right as they exit the gate, all of the El-Jammers were pointed at her and normally she's crippled and can't do anything but she manages to then escape the truck and get to the gate. Maybe it was an illusion like Mike later says, but she wasn't at the truck part from what I can see, and then how did Mike know about Kali? He never met her. He never witnessed what happened to her.\n\nThere was an 18 month time skip before Mike plays D&amp;D with the gang and tells them about El? Why do Hopper and Joyce not get told anything?\n\nFinally, where is Suzie? I thought Dustin and Suzie were together, we didn't see her at all. Also Vickie? Wasn't Robin going to take Vickie out?\n\nHonestly, not trying to hate on the finale, I love Stranger Things, but as mentioned I was left with a lot of questions. I'm interested in how others interpreted all this or if anyone can explain any of it.\n\n  \n**TL;DR:**  \nI enjoyed the finale, but it felt rushed and oddly incomplete. Key things set up earlier never paid off (no demogorgons/monster army, no real Vecna defence, hive mind inconsistencies with Will). Vecna and the Mind Flayer felt underpowered for supposedly god-like threats. The military’s response made no sense, the wormhole/C4 resolution felt inconsistent, and the Eleven ending was confusing (illusion logic, Kali reference, escape). Several characters/subplots (Suzie, Vickie, Hopper/Joyce learning about El) were just dropped. I love Stranger Things, but the finale left me with more questions than answers and I’m curious how others interpreted it.\n\n",
        "upvotes": 14,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1q16vhz/stranger_things_finale_big_moments_and_big/"
    },
    {
        "id": "1q12s2s",
        "author": "Itzsuvo",
        "title": "Kali (spoilers)",
        "content": "The entire fandom owes an apology to Kali, ever since she appeared on screen people started LOATHING her, like since s2, the hate for her in s5 was insane, people were like shes with mind flayer, shes a traitor and blah blah.\n\nShe played the most important role in the season, not only she saved max and the kids, she always stood for the truth, she knew only if she and el died it would be possible for El's friends and family to live, she was ready to sacrifice herself, and she did but hop changed her mind and made her realise her death can make El live, so she sacrificed herself and came up with the greatest mastermind plan while bleeding to death and moments away from dying, she used her powers to save El while dying, goodness gracious! she is the real hero of the season, will and el together killed one but she single handedly saved the protagonist of the show from death with her life, she died so El could live, she is the hero the fandom never deserved. She definitely wasn't on Vecna and El's level on power but her powers were beyond them, Kali the reality manipulator. She has my respect and she is definitely my fav s5 character.\n\n",
        "upvotes": 11,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1q12s2s/kali_spoilers/"
    },
    {
        "id": "1q17wlz",
        "author": "Boring_Ant_1677",
        "title": "Gaten Matarazzo: “I don’t think I ever really want to put Stranger Things behind me”",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q17wlz/gaten_matarazzo_i_dont_think_i_ever_really_want/"
    },
    {
        "id": "1q0gmea",
        "author": "DetectiveHot2071",
        "title": "The Evil Influencer completely leaves out Jodi and Ruby’s secret ‘intimate relationship’",
        "content": "",
        "upvotes": 286,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1q0gmea/the_evil_influencer_completely_leaves_out_jodi/"
    },
    {
        "id": "1q0hhi8",
        "author": "CrimsonSigh",
        "title": "What’s one Netflix show you wish you could watch again for the first time?",
        "content": "Looking for recs and curious what really stuck with people.\n\nWhat’s that one show that ruined other shows for you because it was that good?\n\nFeels like I spend more time choosing than actually watching.\n\nWhat are you currently watching that’s actually worth starting?",
        "upvotes": 141,
        "comments": 635,
        "media": null,
        "permalink": "/r/netflix/comments/1q0hhi8/whats_one_netflix_show_you_wish_you_could_watch/"
    },
    {
        "id": "1q0zc4s",
        "author": "HehroMaraFara",
        "title": "Was “What’s in the Box?” A fake game show?",
        "content": "Something felt a bit off about it. The dynamics, the personalities and the prizes were too perfect. \n\nThen I see that the Laith(sp?) guy was an actor in the Stranger Things series finale, but a bit part where it wouldn’t be too obvious. I’m guessing all the other contestants have some connection to show biz in some way. So was it just a contrived 6 episode fake game show used as filler content and a promotion for multiple Netflix programs?",
        "upvotes": 8,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1q0zc4s/was_whats_in_the_box_a_fake_game_show/"
    },
    {
        "id": "1q17kzk",
        "author": "krikond",
        "title": "Running out of good shows to watch",
        "content": "I feel like I’ve hit that point where Netflix just keeps recommending the same stuff over and over. I scroll for 20 minutes, add things to my list, and still end up rewatching an old show.\n\nWhat’s the best series you’ve watched recently that actually hooked you fast? And do you usually trust Netflix recommendations or find shows another way?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q17kzk/running_out_of_good_shows_to_watch/"
    },
    {
        "id": "1q16m3x",
        "author": "Kshiti_salman",
        "title": "Audio description turned on while watching netflix shows?",
        "content": "Am I the only one who actually keeps audio description (narrator saying characters actions before they do it) on while watching any netflix show. Ik it isn't that much difference but just curious as to if you guys do it too????",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q16m3x/audio_description_turned_on_while_watching/"
    },
    {
        "id": "1q168q8",
        "author": "Drendari",
        "title": "Watch while traveling gone.",
        "content": "Is there any way around this?\nI'm currently on France and I can't use Netflix at all.\nIt doesn't show the option of being traveling, only one to change your house or some like that. Something I refuse to do because I don't live here.\nIs it the only way?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q168q8/watch_while_traveling_gone/"
    },
    {
        "id": "1q15rk9",
        "author": "OriginalRequirement6",
        "title": "Members Only: Palm Beach",
        "content": "Gale is a racist uneducated xenophobe. I don't care about anyone's opinions of Romina but the fact that this woman couldn't understand her country of origin (kept saying Pakistan instead of Uzbekistan) THREE TIMES, criticized her cultural way of eating and then said in interviews she needs to go back to her country is wild. Like this is straight up xenophobic.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1q15rk9/members_only_palm_beach/"
    },
    {
        "id": "1q0o221",
        "author": "SheisBeloved",
        "title": "Looking for more psychological shows",
        "content": "Absentia especially the first season really got me hooked. Just finished Behind Her Eyes and the Beast in Me. Anything that has a really good twist and plot. Any recommendations for more thriller/psychological shows these? Open to movies too, but really like the suspense and draw out of shows!",
        "upvotes": 17,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1q0o221/looking_for_more_psychological_shows/"
    },
    {
        "id": "1q0zodu",
        "author": "Gauchensama",
        "title": "My Netflix is constantly reloading in the Browser",
        "content": "I tried to reactivate my Netflix and after I tried to open it up after I reset everything up its just been constantly loading and canceling itself and loading again (over and over). Ive tried force closing my browser and I've tried resetting my PC but its just stuck reloading over and over.. Help?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q0zodu/my_netflix_is_constantly_reloading_in_the_browser/"
    },
    {
        "id": "1q175wf",
        "author": "loqiloki",
        "title": "Spoiler Alert Stranger Things",
        "content": "I think Mike knows for sure that El is dead, and he made that theory not to cope, but to say that she’s finally free—metaphorically.\n\nspecially since hopper said that he should accept it, and i think he really just did.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q175wf/spoiler_alert_stranger_things/"
    },
    {
        "id": "1q12d77",
        "author": "StellarQuill",
        "title": "Netflix black screen",
        "content": "Has anyone else encountered the same issue on Android? There is sound and subtitles, but the screen is completely black while the video is playing. I’ve already tried clearing the cache and storage, force stopping the app, and restarting my tablet, but nothing works. Does anyone know how to fix this or what might be causing the issue?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q12d77/netflix_black_screen/"
    },
    {
        "id": "1q11co4",
        "author": "Prestigious-Play8863",
        "title": "Stranger Things finale felt… surprisingly calm (no spoilers)",
        "content": "While most people were celebrating New Year’s, ST fans were up and about waiting for Episode 8. I started it the moment it dropped.\n\nI expected tears. I had the tissue box ready. I barely needed it.\n\nThe finale isn’t bad at all, but it feels gentler and easier than I expected after ten years of buildup. \n\nCurious how others felt. Did the calm ending work for you, or were you expecting something heavier?\n\nHere's a Link to full spoiler-light thoughts - https://medium.com/@fbgmb/spoiler-alert-9bbccf39f57c\n",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1q11co4/stranger_things_finale_felt_surprisingly_calm_no/"
    },
    {
        "id": "1q17151",
        "author": "u-a-brazy-mf",
        "title": "The problems with S5 E8 and S5 in general. We waited so many years and it felt so rushed.",
        "content": "**1. Vecna and the Mind Flayer were defeated way too easily. The kids and the military had a more difficult time with a pack of demogorgons and demo dogs than the 2 main bad guys.**\n\nSpeaking of demogorgons and demo dogs... where were they? My 9 year old son asked me where they were during the fight and I was like... oh yeah... what the hell? If he could figure it out right away why didn't the Duffers?\n\nDid they run out of budget or something? They could've had the rest of the gang fighting them while El and Vecna did their thing.\n\n**2. The focus on S5 in general was too much on new characters or characters that weren't important. We want to see the main gang.**\n\nEl, Mike, Will, Lucas, Dustin, Max, Jonathan, Nancy, Steve, Robin, Joyce and Hop and even Erica.\n\nThese characters should've gotten the most screen time. It was a travesty that a lot of it went to Holly... someone who was inconsequential for the entire previous 4 seasons became one of the most important characters.\n\n**3. The Duffer brothers chose an ending that wasn't satisfying for me personally. I wish Jonathan and Nancy got together. I wish El and Mike got together. El's ending was not only unsatisfying but just lame overall. The only real good relationships throughout the entire show were Max and Lucas followed by Joyce and Hop.**\n\nI don't know if MBB did something to piss off the Duffers but her ending was so underwhelming for not only how magical she was but how magical the entire show was in S1.\n\nThe scene on the rooftop with Jonathan, Nancy, Robin and Steve was just cringe. Why are these people in their early 20's acting like they're in their 30s?\n\nMy boy Steve deserved a better ending than just naming some random chick who didn't even show up on camera that he was going to be with.\n\n**4. The elephant in the room is Will's whole coming out thing. S5 E7 focused way too much on his sexuality for some reason?**\n\nWhy the hell was it relevant? Oh because Vecna was gonna use it against him... blah blah blah. Oh please. It was on par for a Netflix show to somehow insert this subject matter out of nowhere. It was wholesome if it wasn't Stranger Things but it didn't fit a show about kids defeating a space wizard and his spider overlord boss. Like come on. Also, it's hilarious how anyone who thought this was weird automatically gets labeled as a \"phobe\" of some sort. People aren't allowed to speak up even when something is just so out of place these days.\n\n**5. Did you guys notice how much sitting around and talking there was going on this season? Literally just people standing around yapping.**\n\nA great example was when Max decided to blab on non stop to Holly when she saw the portal away from her own body.\n\nSeriously, go watch the other seasons. The dialogue to actually doing something ratio was vastly different than S5 where every other scene is someone doing a speech about something.\n\n**6. This is a hot take but why did they make Robin absolutely insufferable?**\n\nEvery time she was on screen explaining something or trying to be whimsical it just became so tiring very quickly. Every time she began to blab at a million miles an hour about something I just looked away and focused on something else.\n\n**7. Kali.**\n\nUseless and lame character from the first to the last episode she was in.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1q17151/the_problems_with_s5_e8_and_s5_in_general_we/"
    },
    {
        "id": "1q0ur5g",
        "author": "Notoriously_So",
        "title": "[SPOILER] I've had my doubts about Season 5, but that finale was solid",
        "content": "They played it completely safe this whole season, but that's just fine. They didn't do anything major or shake up any storylines and the ending was solid.\n\nThe season stalled with the release of the second volume, but this finale made it all worthwhile. Finally, we got to see the final battle and they even fought The Mind Flayer. It was really a movie-worthy spectacle. The songs they used were all bangers and there were surprisingly many of them when there was so few in the middle episodes. Overall one of the best episodes of Stranger Things and a GOOD ending, just what we wanted, not like so many other popular shows that decide to make it a bittersweet / bad ending that ultimately falls flat.  \n\nAlso, major bonus points for Joyce's arc this season. Winona Ryder and David Harbour completely knocked it out of the park.  \n\nA 10/10 episode and finale in an otherwise uneven season. 👍",
        "upvotes": 2,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1q0ur5g/spoiler_ive_had_my_doubts_about_season_5_but_that/"
    },
    {
        "id": "1q0tnvp",
        "author": "JennaBraze",
        "title": "New seasons/eps not showing in continue watching?",
        "content": "Why is it that every time a show you are caught up on releases a new episode/season it doesnt pop up on continue watching? Nobody wants this comes back, doesnt show up there, same with any other show with a new season.  I got fully caught up with Stranger Things earlier today, the finale hit netflix at 8 and didnt show up there. Whyyyyyy? Its like they dont want people to watch things? ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q0tnvp/new_seasonseps_not_showing_in_continue_watching/"
    },
    {
        "id": "1q0zal4",
        "author": "Hot-Slide-7305",
        "title": "New years Day celebration and who with?",
        "content": "If you could spend your New year's Day with any 1 character from Stranger Things who would it be and why ?\nWhat would you also lose like to do?\nYour choice.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q0zal4/new_years_day_celebration_and_who_with/"
    },
    {
        "id": "1q0rjrg",
        "author": "haihukkuhaihai",
        "title": "Better Call Saul could also be renamed to \"Kim's Convenience\"",
        "content": "If there was a quiz to match the name of a series with another series, then Better Call Saul series could be matched with \"Kim's Convenience\" most accurately",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q0rjrg/better_call_saul_could_also_be_renamed_to_kims/"
    },
    {
        "id": "1q0xoz9",
        "author": "Jolly_Knee5732",
        "title": "Pervasive \"Next episode\" popup help?",
        "content": "Can someone pretty please tell me about this popup? Unfortunately images are not allowed, so I will do my best to describe it. \n\nIt's large. It appears in the bottom right 1/9th of the screen. It's SUPPOSED to appear if you mouse over the ⏭️ \"next\" button. The text at the top reads \"Next episode\" and it contains a thumbnail of the next episode and a short block of text describing the next episode's events.  \n  \nThis gloriously unhelpful popup is always active. It appears instantly when I start the application, and can *sometimes* close, if I mouse over it for a while. However, it always returns on its own after about 4 or 5 minutes without my even touching the mouse and it takes up a disruptive portion of the screen and sometimes covers subtitles which affects my ability to use the service.\n\nI am using the browser version, and the browser I use is Firefox, updated this morning. I have turned off \"Autoplay next\" in settings, which mysteriously worked for a while, and then just as mysteriously, stopped working the next time I used the application. \n\nThank you to anyone in advance!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q0xoz9/pervasive_next_episode_popup_help/"
    },
    {
        "id": "1pzz9da",
        "author": "UnsleekGeek",
        "title": "I have watched the entire run of Ozark twice now and now I'm certain it's my all-time favorite show.",
        "content": "Prior to Ozark, Breaking Bad was my all-time favorite show (yeah there are definite thematic similarities). The suspense, pacing, and stylistic elements of this show were amazing, perhaps only outdone by the production and the acting.  I've never watched an entire run of any show until Ozark (for context I did wait a couple of years before I watched it again).  Seriously, watch this show.  It's a gem.  ",
        "upvotes": 220,
        "comments": 149,
        "media": null,
        "permalink": "/r/netflix/comments/1pzz9da/i_have_watched_the_entire_run_of_ozark_twice_now/"
    },
    {
        "id": "1q0qnvh",
        "author": "Ktriney",
        "title": "Suggestions for boomer parents.",
        "content": "My boomer parents have recently discovered Netflix and are looking for a show that they would both like. So far, they have watched Grace and Frankie and loved it. Any suggestions for what they should watch next? Thank you!",
        "upvotes": 2,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1q0qnvh/suggestions_for_boomer_parents/"
    },
    {
        "id": "1q15dmj",
        "author": "rulesoptions",
        "title": "Stranger things plot holes",
        "content": "\nWhy did Henry want the briefcase ? Did he know the briefcase had powers? \nWhere the stone came from? \nWhy the liquid stop melting in jancy scene ?\nHow vecna didn’t know max was in the hospital for 2 years ?\nWhere is max’s mother ?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1q15dmj/stranger_things_plot_holes/"
    },
    {
        "id": "1q12all",
        "author": "theheckisthisworld",
        "title": "Nostalagia!suck my big fat one🖕",
        "content": "\n\nDamnn ittt stranger things you have created a black hole inside my heart😭.watching the end has made me feel things things that I hate and also love.its the feelings of nostalgia cuz I relate to it.i have moved on even in my life.i am now in college ,I have left my hometown and all those feelings came back rushing back in.\nThe ending brings you back to reality a world where the monsters are no longer there and each one of them go their own seperate ways and it sucks to not see them together.One kinda wishes that maybe the last gate remains open .\n\nThis is what I feel happens to all of us we cry for those times when people seemed much happier and together when doors of adulthood did not seperate us.the world where we live has made us against each other Repeating dustin words we need to banish these boundaries that exists against us why we are so job and money crazy when we know and feel that we are truly  happy when our surroundings are happy and and when the ones you love are together.robin and Steve they worked together on crazy ass jobs yeah small ones but that didn't seem to matter when the world had another big problems but all I felt now was that the monsters were gone how depressing it would be to get back to reality and face the things which u did earlier but there is no longer that happiness the feeling that when Robin and Steve were both together.\n\nIt's just my crazy ass refusing that I have to move on as well and leave things and I hate hate the feelings of adulthood where u have to be competitive all the time.i like studying but I wish the noise with it disappears and someday I be like dustin (he seems happy and gives no fuck about the future and just does what he likes)\n\nYEAH so my new years resolution is gonna be TO\nBE LIKE MY DUSTY BUNNS.\n\nenjoy the life and enjoy what it offers to meee and truly go all in the things I like and give no fucks about others .💋♥️",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q12all/nostalagiasuck_my_big_fat_one/"
    },
    {
        "id": "1q0mkmz",
        "author": "Mucek121",
        "title": "My Mom is looking for new show is anything from this list good ?",
        "content": "What should she watch next from this list ?\n\n\\- The Crown\n\n\\- House of Cards\n\n\\- Broadchurch\n\n\\- Dead to Me\n\n\\- Outlander\n\n\\- Bridgerton\n\n\\- One Day\n\n\\- The Diplomat\n\n\\- After Life\n\n\\- Virgin River\n\n\\- Behind Her Eyes\n\n\\- Sense8",
        "upvotes": 6,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1q0mkmz/my_mom_is_looking_for_new_show_is_anything_from/"
    }
]