[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 7,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1o3vhhr",
        "author": "giggi1276",
        "title": "Foresteria a Torino",
        "content": "Ciao, tra due mesi dovrò andare a Torino per lavoro per qualche tempo, diciamo tra i due e i quattro mesi. Dovrò organizzarmi da solo la sistemazione. Che voi sappiate esiste qualcosa tipo foresteria? Airbnb spenderei troppo, affitti penso nessuno mi affitterebbe per così poco. La zona dovre dovrei lavorare è lingotto, ma penso di portarmi la macchina quindi potrei anche spostarmi a sud verso Moncalieri (non conosco la città non so quanto spostandosi fuori sia più facile trovare). Altre idee? Grazie mille",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o3vhhr/foresteria_a_torino/"
    },
    {
        "id": "1o2vxi5",
        "author": "happy_arounding15",
        "title": "Il Valentino è il parco più bello d'Italia. Change my mind",
        "content": "",
        "upvotes": 170,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/e5nuraw939uf1.png?auto=webp&amp;s=13c5b942be5eeff09a2018cc78b076cd16e33d87"
        },
        "permalink": "/r/torino/comments/1o2vxi5/il_valentino_è_il_parco_più_bello_ditalia_change/"
    },
    {
        "id": "1o3crwo",
        "author": "Bimba_Italiana",
        "title": "A favore o contro il ritrasferimento a Torino?",
        "content": "Buongiorno a tutti, il mio Italiano non è così buono quindi abbiate pazienza mentre spiego.\nSono una studentessa (22F) all’università in Canada, studio educazione per diventare una maestra di scuola. Mi laureo nella primavera del 2027 e sto pensando di ritornare a Torino per insegnare per un paio di anni. Prima di prendere una decisione, vorrei sapere se l’Italia, e Torino in particolare, sono ancora ambienti accoglienti per stranieri di colore. (Mi considero straniera, anche se sono nata e cresciuta li, ma era solo per circa 11 anni.)\nHo dei bei ricordi della mia infanzia lì, ma sono preoccupata di poter aver difficoltà a reintegrarmi da adulta. Non del tutto, ma in parte a causa del governo in carico e dell primo ministro, Georgia Melone che fa parte del gruppo politico conservatore di Fratelli d’Italia. No ho sentito tante opinioni positive e farò più ricerche online ma voglio sapere da persone presente nel paese.",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1o3crwo/a_favore_o_contro_il_ritrasferimento_a_torino/"
    },
    {
        "id": "1o3qkb2",
        "author": "Vegetable-Tie-944",
        "title": "Pranzo all'aperto!",
        "content": "Ciao!  \nconsigli su ristorantini, piole, cascine in cui pranzare in mezzo a un po' di verde (fiume, parchi, collina) o comunque con una bella vista o giardino all'aperto e non in mezzo alla strada?   \nAnche nei dintorni di Torino.  \nGrazie!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o3qkb2/pranzo_allaperto/"
    },
    {
        "id": "1o3r6ca",
        "author": "freddyravioli",
        "title": "In arrivo a Torino per un weekend - cerco un po’ di buona compagnia 🇮🇹🍷✨",
        "content": "Ciao Torino,\n\nI’ll be visiting your beautiful city from October 23-27 and would love to find a bit of buona compagnia while I’m there.\n\nI’m a woman in my mid-30s, petite, olive skin, brunette, brown eyes, slender. I’m smart, accomplished, well-travelled, and a genuinely good conversationalist. Fluent in Italian, so no worries — we can switch between English and Italian senza problemi.\n\nI enjoy wandering through new cities, admiring architecture, and getting lost in museums.\n\nI’ll be staying in the city centre and would love to share some good food, great wine, and fun conversation with a local who knows all the best hidden gems and wants to show me around - or just join me over a meal or spontaneous adventure.\n\nNo pressure, no expectations — just due persone simpatiche enjoying a beautiful weekend in Turin.\n\nIf this sounds like your kind of vibe, send me a message and tell me your favourite spot in the city.\n\nA presto, x",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1o3r6ca/in_arrivo_a_torino_per_un_weekend_cerco_un_po_di/"
    },
    {
        "id": "1o3blxd",
        "author": "Virtual-Marzipan9664",
        "title": "amic* a Torinoo",
        "content": "Ciao! Ho 21 anni e mi sono appena trasferita a Torino per studiare. Non conosco ancora nessuno qui, quindi mi farebbe un sacco piacere fare nuove amicizie. Se vi va di uscire, prendere un caffè o una birra, fare una passeggiata, andare al mercato... scrivetemi! ",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1o3blxd/amic_a_torinoo/"
    },
    {
        "id": "1o2w3xf",
        "author": "Dontcallmebaby2",
        "title": "Esiste un qualche libro, una guida, su tutte le insegne e attività commerciali storiche di Torino?",
        "content": "",
        "upvotes": 13,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8uh46b8959uf1.jpeg?auto=webp&amp;s=3578ded6affa2d629c92d599c009c26c746446b9"
        },
        "permalink": "/r/torino/comments/1o2w3xf/esiste_un_qualche_libro_una_guida_su_tutte_le/"
    },
    {
        "id": "1o2yp9h",
        "author": "Proof_Afternoon_5370",
        "title": "A Torino nasce la nuova casa per l'Intelligenza Artificiale - Un Centro innovativo, primo in Italia: ecco il progetto - TorinoNews24 - Notizie da Torino",
        "content": "",
        "upvotes": 8,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/__QqIDb5oVkYVnOqy7dqkUbv9X2Onh9bvi0Wj6r5Qq0.jpeg?auto=webp&amp;s=03d6734725a14981d9d5beceee4384a427297177"
        },
        "permalink": "/r/torino/comments/1o2yp9h/a_torino_nasce_la_nuova_casa_per_lintelligenza/"
    },
    {
        "id": "1o2w9hf",
        "author": "Subject-Store-1982",
        "title": "Pro e contro di vivere a Torino?",
        "content": "Ciao ragazzi io sto valutando alcune città in cui trasferirmi, e tra queste c'è anche Torino.\nVolevo chiedere a chi abita a Torino se mi può dire i suoi pro e contro nel vivere a Torino.\nPremetto che sono un ragazzo giovane quindi sono interessato al fatto che ci siano eventi/feste nella città. E anche come valutate il mondo lavorativo a Torino.\nLa consiglieresti?e  se ci abitate vorresti andarvene e se si perché?\nGrazie mille ",
        "upvotes": 12,
        "comments": 42,
        "media": null,
        "permalink": "/r/torino/comments/1o2w9hf/pro_e_contro_di_vivere_a_torino/"
    },
    {
        "id": "1o37mvk",
        "author": "eddz_",
        "title": "Trying to buy furniture. Need help",
        "content": "Hello so I am rather new living in turin and I am looking to buy furniture specifically a desk and a chair for studying. Can someone advice me like a good store that has cheap prices as I dont really know any to be honest.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o37mvk/trying_to_buy_furniture_need_help/"
    },
    {
        "id": "1o30spj",
        "author": "verdemanzia",
        "title": "Shoegaze e amici",
        "content": "C’è qualcuno qui che adora lo shoegaze? Mi piacerebbe fare amicizia con appassionati del genere che magari sappiano anche suonare qualche strumento per tirare su un gruppetto! ",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1o30spj/shoegaze_e_amici/"
    },
    {
        "id": "1o35ltx",
        "author": "PlanetMars0118",
        "title": "Elettricista",
        "content": "Ciao a tutti, \n\nIo e il mio ragazzo avremmo bisogno di spostare una presa elettrica: ovvero, nella stanza matrimoniale è presente una presa che si ritroverebbe dietro il letto ma vorremmo ricavarne due che andrebbero ai lati per i comodini. \nSi tratterebbe di spaccare il muro, lavorare con i cavi e poi ristuccare. \nConoscete elettricisti di fiducia? Solitamente gli elettricisti si occupano anche di stuccare (chiedo nella mia ignoranza)? \n\nGrazie in anticipo ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1o35ltx/elettricista/"
    },
    {
        "id": "1o21zjd",
        "author": "Jess_in_Peace",
        "title": "Non sono di TO, ma la Libreria Luxemburg è uno dei miei luoghi del cuore nel mondo. Con tristezza ho appreso la notizia che avrebbe cambiato location. È già avvenuto? Dove andrà?",
        "content": "",
        "upvotes": 66,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/j4k48oxl82uf1.jpeg?auto=webp&amp;s=a4281ac7db0e84190d838b6af34902e03821973c"
        },
        "permalink": "/r/torino/comments/1o21zjd/non_sono_di_to_ma_la_libreria_luxemburg_è_uno_dei/"
    },
    {
        "id": "1o2bfeb",
        "author": "Worried_Childhood_67",
        "title": "Medico di base per malattia",
        "content": "Ciao a tutti, sto cercando disperatamente un medico di base da cui non sia un inferno prendere una malattia quando non si può andare a lavoro. Non mi riferisco a \"finte malattie\" ma fin'ora ne ho provati due che:\n\n-una è impossibile da contattare, ti dà appuntamento due settimane dopo costringendoti ad andare in guardia medica la sera. \n-uno riceve senza appuntamento ma ogni volta ci sono venti vecchietti in fila e in meno di tre ore non si fa nulla. \n\nIl sogno sarebbe un medico che mi dia il protocollo al telefono senza visita, ma anche uno con visite organizzate in modo decente andrebbe bene. \n\nSono in zona Vanchiglietta ma sono disposto a spostarmi per inseguire questa utopia. \n\nGrazie a tutti. ",
        "upvotes": 15,
        "comments": 25,
        "media": null,
        "permalink": "/r/torino/comments/1o2bfeb/medico_di_base_per_malattia/"
    },
    {
        "id": "1o23oex",
        "author": "CriticismOk9306",
        "title": "Salsicce di pollo ma non c'è il pollo dentro.",
        "content": "Da Ekom vendono queste salsicce di pollo fresche, (che fresche non sono, visto che poi sono uscite da confezioni enormi e non fatte al momento) chiedo per curiosità gli ingredienti visto che le ho viste particolarmente rosa, e l'inserviente legge molto impaurito gli ingredienti, saltandoli.   \n  \nAlla fine mi sono fatta dare la confezione (fresche? mhh) con l'etichetta sopra e gli ingredienti delle SALSICCE DI POLLO erano:  \n27% tacchino 50% PANCETTA DI MAIALE, rimanente fibre vegetali come piselli e bambù, sale e poi additivi vari.\n\nQueste sarebbero le \"salsicce i pollo\" vendute da EKOM.\n\nLeggete sempre le etichette con gli ingredienti prima di comprare, anche se vengono venduti nel banco \"fresco\".",
        "upvotes": 29,
        "comments": 46,
        "media": null,
        "permalink": "/r/torino/comments/1o23oex/salsicce_di_pollo_ma_non_cè_il_pollo_dentro/"
    },
    {
        "id": "1o2s5vi",
        "author": "Old_Contribution9362",
        "title": "permesso di soggiorno studente",
        "content": "ciao a tutti\nse manderò il kit per il rinnovo a 1 novembre qualcuno sa più o meno quando nel senso qualcuno ha mandato i kit in questi giorni per sapere la data più o meno che avrò\nURGENTE ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o2s5vi/permesso_di_soggiorno_studente/"
    },
    {
        "id": "1o26ohf",
        "author": "pas_me",
        "title": "Fare amicizia a Torino?",
        "content": "Ciao! \nSono una ragazza di 25 anni e vivo a Torino da circa un anno. Lavoro e studio nel campo IT, ma purtroppo finora non ho avuto molte occasioni di stringere nuove amicizie.\n\nMi piacerebbe conoscere persone queer o LGBT+ friendly con cui uscire, chiacchierare, giocare insieme o semplicemente condividere interessi.\nMi piacciono i giochi da tavolo (anche se non sono particolarmente esperta), i videogiochi quando ho tempo, e in generale provare cose nuove e passare del tempo in compagnia.\n\nSe vi va di bere qualcosa, organizzare una serata giochi o anche solo fare due chiacchiere, scrivetemi pure!",
        "upvotes": 10,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1o26ohf/fare_amicizia_a_torino/"
    },
    {
        "id": "1o2lczt",
        "author": "Liffo92",
        "title": "Condividere x Buonissima - brunch 25 ottobre ore 11",
        "content": "Ciao a tutti! Se qualcuno fosse interessato ho riservato un tavolo per 4/5 persone per giorno e ora di cui sopra, per il brunch da Condividere a cui parteciperanno Yannick Alleno e Fabrizio Fiorani, oltre ad esserci i cocktail del Connaught bar di Londra. Al momento ho 3/4 posti liberi!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o2lczt/condividere_x_buonissima_brunch_25_ottobre_ore_11/"
    },
    {
        "id": "1o2ubff",
        "author": "ioanna_ch",
        "title": "Gruppi pro-pal",
        "content": "Ciao tutt*. Considerata la grande mobilitazione degli ultimi tempi a favore della Palestina, mi chiedo se sapete gruppi e comitati che stanno attivamente organizzando eventi, mobilitazioni e altro. Sto cercando un gruppo aperto e attivo.grazie!",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1o2ubff/gruppi_propal/"
    },
    {
        "id": "1o28r3d",
        "author": "Current-Remote8989",
        "title": "Phone Number Change in Residence Permit Application",
        "content": "How can I possibly change the phone number I provided in the residence permit application? The office helping asked me the number and K provided them but turns out I gave another number not related to me. How can I fix this, or does it matter if number isn’t corrected until the fingerprint appointment where I can tell the questura to correct it. Will I be receiving any important sms until fingerprint appointment? I obviously know the appointment date from the receipt I received when submitting the application. Thanks all. ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o28r3d/phone_number_change_in_residence_permit/"
    },
    {
        "id": "1o2ajk6",
        "author": "mimi0-03",
        "title": "Japanese study buddies",
        "content": "Hi! I am searching somebody to practice/study japanese with (online and in person), send me a message if you are studying the language too :)\n\nCiao! Sto cercando qualcuno con cui fare pratica di giapponese (online e di persona), se stai studiando la lingua scrivimi un messaggio, se vuoi :)\n\nまたねー",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o2ajk6/japanese_study_buddies/"
    },
    {
        "id": "1o26vfd",
        "author": "Afraid-Pie-5290",
        "title": "Permanente riccia donna",
        "content": "Buondì. Sto cercando un parrucchiere a Torino che sia bravo a fare le permanenti ricce / mosse e che faccia dei trattamenti con buoni risultati senza distruggere il capelli.  \nNon ho mai fatto in vita mia la permanente quindi non sono pratica di quali siano le diverse tipologie di trattamento, quindi faccio fatica a selezionare un parrucchiere di cui fidarsi.\n\nPer altro, non ho mai fatto la permanente riccia / mossa. E' una buona idea?  \nGrazie a chi avrà voglia di raccontarmi la sua esperienza : ) ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o26vfd/permanente_riccia_donna/"
    },
    {
        "id": "1o29dx0",
        "author": "Similar_Profit_7298",
        "title": "Lavorare come rider",
        "content": "Stavo cercando un lavoro part time da fare nel weekend insieme agli studi, sarebbe possibile ,secondo voi, lavorare tutti i weekend come rider e puntare a portarsi a casa circa 400/500€ al mese? Quante ore dovrei lavorare? Come funziona? Perché con una veloce ricerca su Google ho visto che la paga sarebbe di 10€ lordi all'ora, che sulla carta mi sembrano veramente un paradiso(la ristorazione ha ridotto di molto le mie aspettative), il che vorrebbe dire che lavorando circa 12 ore a settimana raggiungerei il mio obiettivo(contando che su paghe così basse si paga nulla o quasi di tasse). Dov'è la fregatura? Mi basta veramente salire in sella alla mia bici elettrica e sono apposto?",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1o29dx0/lavorare_come_rider/"
    },
    {
        "id": "1o1zdol",
        "author": "hasumo",
        "title": "Travel from Milano Bergamo Airport to Turin",
        "content": "Hi, I am planning to travel to Turin. My flight is going to the Milano Bergamo Airport at 13th of October. How should ı transfer Milano Bergamo Airport to Turin?",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1o1zdol/travel_from_milano_bergamo_airport_to_turin/"
    },
    {
        "id": "1o1beah",
        "author": "Hyzev_",
        "title": "Ristoranti buoni ma economici",
        "content": "Ciao ragazzi, potete indicarmi dei ristoranti buoni ma economici dove andare a cena? Pensavo a qualcosa tipo 40€ a testa, meglio se piemontese ",
        "upvotes": 12,
        "comments": 27,
        "media": null,
        "permalink": "/r/torino/comments/1o1beah/ristoranti_buoni_ma_economici/"
    },
    {
        "id": "1o1jbby",
        "author": "_tarassaco",
        "title": "lavoro",
        "content": "ciaooo, qualcuno che ha lavorato o lavora nella ristorazione può consigliarmi ristoranti/pizzerie/bar dove passare a chiedere se hanno bisogno di qualcuno in più in sala? sono qua da poco quindi non ho conoscenze, ho trovato un ristorante dove mi hanno presa in prova ma pagano sei euro all'ora, diciamo che mi servirebbe qualcosa in più e per evitare di trovarmi in altre situazioni simili e ho pensato di chiedere qui...",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o1jbby/lavoro/"
    },
    {
        "id": "1o16mzv",
        "author": "Euphoric-Spare-2871",
        "title": "Pensate che negli ultimissimi anni (dal Covid a oggi) Torino stia cambiando in meglio o in peggio?",
        "content": "",
        "upvotes": 19,
        "comments": 32,
        "media": null,
        "permalink": "/r/torino/comments/1o16mzv/pensate_che_negli_ultimissimi_anni_dal_covid_a/"
    },
    {
        "id": "1o1k5a7",
        "author": "Sorry_Carrot7537",
        "title": "Nuove conoscenze",
        "content": "Ciao a tutti, sono un giovincello di 20 anni (siciliano), tra qualche giorno mi trasferisco a Torino per lavoro, e nulla, volevo fare nuove amicizie. Ho già qualche amico, ma volevo ampliare un po' le mie conoscenze. Nel tempo libero faccio calisthenics, mi piacciono i videogiochi, le lunghe passeggiate e tutto ciò che riguarda i motori. Sono una persona piuttosto accollativa, non sono bravissimo a descrivermi nel dettaglio ma ci ho provato!!\nquindi se vi va di fare due chiacchiere e/o magari fare una nuova conoscenza io ci sono, scrivetemi pure. ",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1o1k5a7/nuove_conoscenze/"
    }
]