[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 51,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 16,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1rbrv9l",
        "author": "StunningComment6064",
        "title": "Guys, can you recommend a comedy show on Netflix that’s actually funny?",
        "content": "It’s very difficult to find a comedy TV show that makes me laugh. I mean, new TV shows seem to be running out of ideas. So could you recommend some comedy shows that you actually find funny? ",
        "upvotes": 96,
        "comments": 503,
        "media": null,
        "permalink": "/r/netflix/comments/1rbrv9l/guys_can_you_recommend_a_comedy_show_on_netflix/"
    },
    {
        "id": "1rc1mfu",
        "author": "Acceptable_Sell3455",
        "title": "Animal Kingdom",
        "content": "I discovered this series only recently and binged through all 6 seasons in under 2 weeks. Best series I've watched in ages. The characters were not all great, but my favourite was poor psycho Pope, the jobs were carried out fantastically, Mother a true horror show, on the whole much of it rather unrealistic, but I didn't care, I loved it.\n\nAnd yet ... no-one seems to speak of it. \n\nWhy? \n\nWas it not popular? ",
        "upvotes": 29,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1rc1mfu/animal_kingdom/"
    },
    {
        "id": "1rbq6wm",
        "author": "DeputyDawe",
        "title": "Stranger Things",
        "content": "Just started watching Stranger Things on Netflix and I’m really enjoying it. I love anything set in the nineteen eighties because that was when I just came into my teenage years so the music, the fashions, even the rotary phone on the wall brings back some wonderful memories of a bygone time. The kids are really likeable and goofy much like the kids I grew up with. Would definitely recommend it to anyone who hasn’t already stumbled upon it ",
        "upvotes": 32,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1rbq6wm/stranger_things/"
    },
    {
        "id": "1rbrypo",
        "author": "ekat12",
        "title": "Account hacked—for what goal?",
        "content": "It appears my Netflix account got hacked about 4 days ago at 2am. No one else has access to my account. \n\nGot an email from Netflix confirming my email address change &amp; that I would receive no more emails at that address. Called Netflix, they confirmed someone changed both the email AND credit card billing—to what end? Why would they not just use the credit card that I had stored?\n\nAlso odd (and frustrating), tech support asked to confirm the payment method I’ve been using for that account in order to verify my identity since name &amp; everything else was changed, and they can’t find any record of billing with that credit card. I’m sitting here staring at my credit card statement with 5+ years of Netflix payments on it.\n\n \n\nThey weren’t able to give me my account back since I “couldn’t confirm” my payment method, so now they’ve just cancelled the account &amp; I have to make a new one. Went ahead &amp; changed my password on that email &amp; ordered a new credit card number.\n\nAnything else I need to do? What was the point of hacking my account just to enter their own payment info? ",
        "upvotes": 26,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1rbrypo/account_hackedfor_what_goal/"
    },
    {
        "id": "1rccrm5",
        "author": "Own_Paper3871",
        "title": "Windows 11 Netflix stuck on AVC for 1080p SDR despite HEVC/AV1 support",
        "content": "Hi everyone,\n\nI’ve been trying to understand how Netflix classifies Windows devices and chooses codecs, and I’m hoping someone here might have deeper insight into what’s happening.\n\nSystem:\n\nASUS VivoBook X515EA\n\ni3-1115G4 (Intel UHD / Xe-LP, Gen 12)\n\n8GB RAM\n\nWindows 11\n\nInternal 1920×1080 panel (~200 nits)\n\n200 Mbps internet\n\nMicrosoft Edge (latest stable)\n\n\n\n---\n\nBackground (briefly)\n\nInitially I experimented quite a bit trying to get Netflix to stream 4K to my 1080p panel for the higher bitrate and let it downscale. I now understand that without a certified 4K HDCP 2.2 display attached, Netflix won’t send the UHD ladder. I’ve accepted that and moved on.\n\nDuring that process I also tried various “Netflix 4K” / codec-related browser extensions and other tweaks. None of them changed the actual codec ladder being served.\n\nAt this point I’m not chasing 4K anymore.\n\n\n---\n\nCurrent goal: HEVC or AV1 for 1080p SDR\n\nWhat I’m trying to achieve now is much simpler:\n\nI just want Netflix to use HEVC or AV1 for 1080p SDR instead of AVC (H.264).\n\nHere’s the consistent behavior:\n\nHDR OFF → always avc1 (H.264), ~3 Mbps at 1920×1080\n\nHDR ON → switches to HEVC (Main10 HDR ladder works correctly)\n\n\nSo clearly:\n\nHEVC decoding works on this system\n\nAV1 decoding is supported (confirmed in edge://gpu)\n\nHardware video decode is active\n\nPlayback is smooth, no dropped frames\n\n\nHowever, in SDR mode Netflix never selects HEVC or AV1. It always falls back to AVC.\n\n\n---\n\nDRM detail (important part)\n\nFrom the Netflix debug overlay:\n\nIn SDR mode → KeySystem: com.widevine.alpha.SW_SECURE_DECODE\n\nPlayReady Hardware DRM is not disabled, but SDR sessions appear to use Widevine software secure decode.\n\n\nThis makes me wonder whether the codec ladder selection is tied to DRM path classification.\n\nWhen HDR is enabled, the ladder changes and HEVC is used.\nWhen HDR is disabled, it falls back to Widevine SW secure decode + AVC.\n\n\n---\n\nWhat I’ve verified\n\nHardware acceleration enabled in Edge\n\nHEVC and AV1 decode supported by GPU\n\nVideo decode shows as hardware accelerated\n\nPlayReady not disabled\n\nOnly internal display active\n\nVirtual display drivers removed (used earlier while experimenting with 4K)\n\nClean system state\n\nTested multiple recent Netflix originals\n\n\nStill locked to AVC for 1080p SDR.\n\n\n---\n\nWhat I’m trying to understand\n\nIs Netflix assigning certain Windows laptop device classes to an “HD SDR AVC” tier regardless of decode capability?\n\nEven if the GPU supports HEVC and AV1, does server-side device classification override that and force AVC for SDR under Widevine SW secure decode?\n\nHas anyone with a similar Intel Gen 11 UHD system managed to get HEVC or AV1 for 1080p SDR on Windows?\n\nI’m trying to determine whether this is:\n\nA configurable limitation\n\nA DRM / pipeline limitation\n\nOr purely server-side policy\n\n\nAny technical insight would be appreciated.\n\nAnd yes, I did use AI to get this post written since I’ve been troubleshooting this for a while and wanted to present the details clearly. At this point I’m just hoping someone here might have insight I’ve missed.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rccrm5/windows_11_netflix_stuck_on_avc_for_1080p_sdr/"
    },
    {
        "id": "1rc3ad8",
        "author": "BlackHole2048",
        "title": "There was a horror series I saw like 5-6 years ago. I thought it was goosebumps but apparently not. Does anyone remember what it is? Description of the first episode below",
        "content": "The first episode were these 2 high school boys who investigated their school mascot (which kinda looked like big bird, just big and yellow but I don’t remember if it was actually a bird). Turns out it was a living thing. At one point they ended up trapped in the basement, almost gassed, and they escaped to the gymnasium. Somehow they looked into the mascots mouth and it ate them, and the episode ended with them trapped in its stomach. Sounds like a fever dream now that I think about it.",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1rc3ad8/there_was_a_horror_series_i_saw_like_56_years_ago/"
    },
    {
        "id": "1rbxrds",
        "author": "CelticsWolfsBanesss",
        "title": "I sincerely want to know what in God's name happended to Season 3 of Ragnarok?",
        "content": "I seriously want to know why did the people behind the show think it was an amazing idea to dedicate Season 3 to making Thor in Magnes head? It was seriously one of the worst decisions next to canceling Cursed and replacing Henry Cavill as Geralt.\n\nSeason 1 and 2\nWere so amazing with beautiful character development and filled with amazing ideas and then all of a sudden they decide it's nothing more than a figment of Magnes imagination it truly made no sense to me whatsoever.\n\nCan anyone\nHelp me understand why this decision was made?",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1rbxrds/i_sincerely_want_to_know_what_in_gods_name/"
    },
    {
        "id": "1rcb3zf",
        "author": "daizeefli22",
        "title": "Museum of Innocence - there's a REAL museum!!",
        "content": "I learned this from a Turkish friend.. there is an actual museum filled with the items from the book. The author collected them before writing the book. I think it's so cool!! ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rcb3zf/museum_of_innocence_theres_a_real_museum/"
    },
    {
        "id": "1rcax8a",
        "author": "Inthetreesinpnw",
        "title": "Any see “Playing Gracie Darling” ?",
        "content": "Just finished the series. Not a bad show and interesting concept. Anyone else see it, thoughts ? I never see it mentioned anywhere for discussion. It’s Australian series. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rcax8a/any_see_playing_gracie_darling/"
    },
    {
        "id": "1rbunt2",
        "author": "AvyannaViolet",
        "title": "The Hunting Party",
        "content": "This show seemed to have a lot of potential, but it is getting a little too “Hollywood” for me. I was hoping this would be more akin to Mind Hunters. I’m on episode 3. Does this get any better? It’s currently ranked #4 for TV shows. ",
        "upvotes": 10,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1rbunt2/the_hunting_party/"
    },
    {
        "id": "1rbb27k",
        "author": "Honest1824",
        "title": "Next Top Model - those poor girls",
        "content": "Watching Netflix's doc on America's Next Top Model is so depressing. Those poor girls did not feel like they could say \"no\" to the abuse, even with all those people and cameras around. \n\nIt really makes me feel even worse for the poor girls that Epstein and his friends abused. Imagine how powerless they must have felt alone with those rich, entitled old men? ",
        "upvotes": 114,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1rbb27k/next_top_model_those_poor_girls/"
    },
    {
        "id": "1rc8hm3",
        "author": "Brimoe18",
        "title": "Screensaver options",
        "content": "It’s 2026, is there FINALLY options for the screensaver?? It drives me absolutely nuts that it turns on after just five minutes, and then quickly flashes through promos for other shows the whole time. Plus it being three buttons to get back to playing my show once I’m ready. As someone that hates flashing images (especially in the background) and pauses frequently, it gets very annoying so I thought I’d finally ask. I tried to look for settings within the Netflix app on my tv, but there’s nothing there. Perhaps I need to gain access to a desktop computer if there’s a setting to change it there? ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1rc8hm3/screensaver_options/"
    },
    {
        "id": "1rc377w",
        "author": "Stoneyowl0",
        "title": "Bridgerton part 2 release date???",
        "content": "Am I losing it or was Bridgerton S4 Part 2 originally rumored/advertised as coming out on the 22nd? Netflix now says the 26th and I swear I didn’t make that up. ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1rc377w/bridgerton_part_2_release_date/"
    },
    {
        "id": "1razodx",
        "author": "TinyResponsibility11",
        "title": "Stargate SG-1 on Netflix is unwatchable due to very bad image quality",
        "content": "This week Netflix added all seasons of Stargate SG-1 in Europe. I was really looking forward to watching it. Unfortunately the video quality is very poor and often time blurry and pixelated. I understand that it is an older tv show, but still the video quality shouldn't be this low.The resolution is 432p and the video has 0.20 Mbps ! bandwidth, that is an extremely low bandwidth for even SD tv shows, it’s usually between 2.5 to 3.0 Mbps. \n\nWith the current picture quality the show is basically unwatchable on Netflix and I advise people who want to watch it to look for the DVD or blu ray release. Those versions are of much higher quality.",
        "upvotes": 192,
        "comments": 57,
        "media": null,
        "permalink": "/r/netflix/comments/1razodx/stargate_sg1_on_netflix_is_unwatchable_due_to/"
    },
    {
        "id": "1rc131s",
        "author": "paintballguy32",
        "title": "NOS4A2",
        "content": "I just watched all 20 episodes of this in 2 days. What are everybody's thoughts on it? I thought it was pretty dam good not binge watched a series like this since LOST!",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1rc131s/nos4a2/"
    },
    {
        "id": "1rbee4z",
        "author": "kattt1109",
        "title": "Watching the ANTM Documentary",
        "content": "I was probably about 8 or 9 when I started watching America’s Next Top Model, honestly, loved it, that time the drama was really everything!\n\nWatching this documentary however at the age of 28, I’m like dammmmn some of this stuff was rough. I kind of switch it off sometimes because my eyes cannot believe what I’m seeing. And yes it was a different time, and the fashion industry was very different, but some of the things are just crazy, especially personal experiences the girls had where there was not really much help provided for them",
        "upvotes": 21,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1rbee4z/watching_the_antm_documentary/"
    },
    {
        "id": "1rbwpkm",
        "author": "Assface_Mcghee",
        "title": "Proxy Error Message",
        "content": "Has anybody else been getting Proxy Error messages whilst watching Netflix lately ? It’s getting frustrating because i’ve never used a proxy yet somehow i keep getting the error message\n\nHopefully this is just somehow a bug on Netflix’s end ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1rbwpkm/proxy_error_message/"
    },
    {
        "id": "1rc27jh",
        "author": "LaughsInDisarray",
        "title": "Hidden Gems",
        "content": "I’m Looking for recommendations for a good series or movies. I love  Sci Fi, thrillers, and drama. I watch many of the popular ones. Any hidden gems? thanks😊",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1rc27jh/hidden_gems/"
    },
    {
        "id": "1rbpedp",
        "author": "joeblob5150",
        "title": "Am I insane?",
        "content": "A preview for a movie popped up in my feed Friday. the synopsis said it was about a group of friends that are trying to hide a body. the clip showed a group of 4 guys in an apartment chatting. The main character had long brown hair and a goatee, then an old Chinese lady comes in for a visit. she is the main character's neighbor. It is a comedy and appeared to be a new release. We went to watch it. but we can't find it anywhere. it's like it never existed.\n\nany help would be appreciated.",
        "upvotes": 1,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1rbpedp/am_i_insane/"
    },
    {
        "id": "1rb5hre",
        "author": "Orangeandjasmine777",
        "title": "The Middle on netflix",
        "content": "There is an American sitcom about a working class family with funny exaggerated everyday family calamities. It's new to Netflix UK. \nIf you've seen it. What are your thoughts? ",
        "upvotes": 37,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1rb5hre/the_middle_on_netflix/"
    },
    {
        "id": "1rbtj40",
        "author": "jersey7d",
        "title": "Many web series feature numerous stars and lead actors, but the role Floki played in Vikings is an emotional chapter of the series that will stay in the hearts of fans forever .",
        "content": "That scene in Vikings where Ragnar Lothbrok approaches Floki and says, \"I love you,\" and Floki responds with, \"I love you too, Ragnar,\" perfectly sums their entire friendship throughout the series.",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1rbtj40/many_web_series_feature_numerous_stars_and_lead/"
    },
    {
        "id": "1ranxe7",
        "author": "CHEZ0673",
        "title": "ANTM",
        "content": "Shandi was date raped and they made her look like a cheater instead of giving her the support she needed or even stopping it before it  happened. Tyra saying she isn't part of production but then playing along and bringing up cheating is appalling. \nShandi was raped and then made to look like the one at fault, fucking disgusting 🫣 ",
        "upvotes": 339,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1ranxe7/antm/"
    },
    {
        "id": "1rb8n0c",
        "author": "Middle-Abalone-3142",
        "title": "Most Impactful Movie on Netflix",
        "content": "Which movie on Netflix made you feel the most emotions. Whether it was a sad death, a crazy storyline, intense scenes or something else which movie on Netflix had your emotions spiking? Please comment the craziest movie on Netflix that is filled with emotions and stressful intense scenes!",
        "upvotes": 19,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1rb8n0c/most_impactful_movie_on_netflix/"
    },
    {
        "id": "1rbphhm",
        "author": "Bright-Pangolin7261",
        "title": "Perfect neighbor production",
        "content": "Does anyone know how the body cam footage was obtained, was it through subpoenas or FOIA what?\n\nI’m wondering how footage like this is obtained by documentary producers.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1rbphhm/perfect_neighbor_production/"
    },
    {
        "id": "1rbjtss",
        "author": "Left_Actuary_7890",
        "title": "Mainly looking for limited tv series and shorter tv series",
        "content": "So my goal is mainly to get over the shorter more binge-able tv shows first then move onto the bigger shows. I’m open to anything whether it’s a movie or tv show, whether it’s animated or live action. My latest watches include:\n\nThe Night agent\n\nThe art of Sarah\n\nArcane\n\nWayward\n\nAvatar the last airbender\n\nLost in starlight \n\nTwilight of the gods\n\nA knight of the seven kingdoms \n\nHis and hers\n\nPluribus\n\nThe beast in me\n\n ",
        "upvotes": 1,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1rbjtss/mainly_looking_for_limited_tv_series_and_shorter/"
    },
    {
        "id": "1rbjil0",
        "author": "seedramidoriya",
        "title": "Netflix wont play shameless",
        "content": "im trying to watch my show shameless but netflix keeps telling me \"error cannot play title\" anyone know why? i live in uae if that plays a role, i cant really find a fix anywhere, i watch on mobile",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1rbjil0/netflix_wont_play_shameless/"
    },
    {
        "id": "1rc1t59",
        "author": "aubreyisreal",
        "title": "TATBILB movies",
        "content": "i recently finished watching all the movies (i watched ps i still love you and always and forever in one day while sick and had watched the first movie four days ago) and theyre SO good, i love lara jean and peter's relationship and i'm glad they're endgame, and honestly my bf and i remind me of lara jean and peter :p",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1rc1t59/tatbilb_movies/"
    },
    {
        "id": "1rc2x3w",
        "author": "StandAloneWolf",
        "title": "Alright Netflix, where's the Epstein files documentary?",
        "content": "We know you're working on it. Just go ahead and drop the news. You've already done serial killers, you've already done Diddy, and we know you're infatuated with the romanticization of people doing terrible things. \n\nJust go ahead and drop it.  \nWe don't mind. Just compile all the most heinous, but important things to be aware of in the 4 hour documentary.\n\nAnd if it's a reenactment, and you're casting people, try to avoid painting Epstein out as being a misunderstood soul.\n\nJust...\n\nRelease the Epstein files documentary Netflix.",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1rc2x3w/alright_netflix_wheres_the_epstein_files/"
    }
]