[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 8,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 128,
        "comments": 409,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mv1iic",
        "author": "Otherwise-Jump-4571",
        "title": "Had this gem of an interaction with a Netflix rep. I called for support and he ended up cancelling my account.",
        "content": "Some of the messages were cut out for privacy. If parts of the conversation doesn't make sense to you, it's not because of the cut out messages.\n\n\n\nHe did a really poor job explaining that whole new member thing (still don't understand it). He promised to resolve the issue but cancelled my account instead.\n\n  \nI asked for a transcript of the chat, and he said it will pop up if I closed the chat. Good thing I took screenshots. ",
        "upvotes": 610,
        "comments": 119,
        "media": null,
        "permalink": "/r/netflix/comments/1mv1iic/had_this_gem_of_an_interaction_with_a_netflix_rep/"
    },
    {
        "id": "1muzrde",
        "author": "Conscious-Quarter423",
        "title": "‘Wednesday’ Season 2 Gains 29.1 Million Views in Second Week on Netflix. That’s a 42% decrease from the week before.",
        "content": "",
        "upvotes": 181,
        "comments": 60,
        "media": null,
        "permalink": "/r/netflix/comments/1muzrde/wednesday_season_2_gains_291_million_views_in/"
    },
    {
        "id": "1muo4m8",
        "author": "Sweaty-Toe-6211",
        "title": "‘Dept. Q’ Renewed for Second Season at Netflix",
        "content": "",
        "upvotes": 630,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1muo4m8/dept_q_renewed_for_second_season_at_netflix/"
    },
    {
        "id": "1mvg1hu",
        "author": "SplitNational2929",
        "title": "Netflix’s KPop Demon Hunters Movie Theater Screenings Are Already Almost Sold Out",
        "content": "",
        "upvotes": 9,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mvg1hu/netflixs_kpop_demon_hunters_movie_theater/"
    },
    {
        "id": "1mvg8wo",
        "author": "MysteriousDelay6266",
        "title": "BLACK RABBIT | Official Trailer | Netflix | September 18",
        "content": "# BLACK RABBIT\n\nWhen the owner of NYC’s biggest hotspot (Jude Law) allows his troubled brother (Jason Bateman) to return to the family business, trouble multiplies.\n\n**Only on Netflix SEPTEMBER 18.**",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mvg8wo/black_rabbit_official_trailer_netflix_september_18/"
    },
    {
        "id": "1mvalpf",
        "author": "Vivid-Relationship96",
        "title": "“MOST LIKED” shows",
        "content": "Since Netflix doesn’t provide a full list of shows with the “Most Liked” badge, why don’t we make a thread? \n\nDrop the series you’ve watched that had the “Most Liked” thumbs up!\n\n👇",
        "upvotes": 6,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1mvalpf/most_liked_shows/"
    },
    {
        "id": "1mupni5",
        "author": "veditafri",
        "title": "What's the Netflix show suprised you after starting it just for background noise?",
        "content": "What Netflix show suprised you the most? You started it with  low expectations, just to have something on - but  ended up binge-watching the whole thing instead?",
        "upvotes": 112,
        "comments": 218,
        "media": null,
        "permalink": "/r/netflix/comments/1mupni5/whats_the_netflix_show_suprised_you_after/"
    },
    {
        "id": "1mvjcit",
        "author": "OriginalChri",
        "title": "‘Stranger Things’ Creators Matt and Ross Duffer Sign Paramount Deal",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mvjcit/stranger_things_creators_matt_and_ross_duffer/"
    },
    {
        "id": "1mvifsw",
        "author": "M_Long1984",
        "title": "Question I can’t find the answer to!!!",
        "content": "Okay, so when Netflix starts playing an episode in a season (any show), it either gives the option to “Skip Intro,” or not. I’m assuming this is based on the length of the intro, in seconds. I think it’s safe to say that’s a fair assumption! I just want to know what the time requirement/allotment is set to before Netflix gives the option to “Skip Intro.” I’ve looked it up in every different way of phrasing this question I can possibly think of, *except here*! I can’t find the answer or even anything that has made me feel like I’m on the path to finding it (maybe a lot of people aren’t asking? Lol)! And I’m not satisfied with a stopwatch, or just counting the seconds (it always varies by a few, obviously, depending on the show). If I could read the fine print in Netflix’s EULA, that’d be fantastic! But I’d really just settle on knowing the answer and *where it was found*! Does ANYONE know??!!",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mvifsw/question_i_cant_find_the_answer_to/"
    },
    {
        "id": "1mupavk",
        "author": "ex1stence",
        "title": "“Fit For TV” was a complete waste of time",
        "content": "How tf do \"documentaries\" like this even get made? Literally everything they mentioned in all three episodes was a complete nothingburger, and it was honestly sad to see how deep the producers were trying to dig to find anything even remotely interesting to put in the doc.\n\nDanny gaining the weight back after the show? Wow yeah, turns out people who have a bad relationship with food before the show didn't magically rewire their entire brains after leaving TBL. Not sure how that's NBC's fault or even a controversial thing, but man did they soak up about 20 minutes just repeating the same thing over and over again.\n\nBob said a mean thing to Joelle one time (which did inevitably get her to finish the 30-second treadmill run)? DUN DUN DUNNNN. Dramatic music and another 15 minutes over the fact that yes, every trainer yells at you when you try to give up during a workout because that's literally the job you are paying them to do.\n\nJillian gave....you guys it's so bad, it's terrible, I'm trembling and shaking even as I type this....CAFFEINE to contestants??? Holy shit ya'll, NBC is basically the devil incarnate let's spend another 20 minutes talking about it.\n\nThe whole thing was mining for any controversy it could possibly find and there just wasn't a damn thing to say. I'm a millennial and as someone who struggled with my weight at the time the show first aired, it was actually really inspiring to see how much diet and exercise was paying off for people who were way bigger than I was. While I may not be able to draw a direct line between TBL and my eventual love of exercise, I know that watching these people get on the treadmill and work their asses off (literally) gave me a model that I continue to follow to this day when it comes to my diet and how I take care of my body.\n\nThis wasn't a documentary about scandal or NBC doing anything wrong, it was just a drag on the most inconsequential events that when you pull back and look at what they actually said, sure as shit wasn't worth 120 minutes of my time.",
        "upvotes": 59,
        "comments": 61,
        "media": null,
        "permalink": "/r/netflix/comments/1mupavk/fit_for_tv_was_a_complete_waste_of_time/"
    },
    {
        "id": "1mvcml2",
        "author": "UntypicalOps88",
        "title": "Netflix says my Nvidia Shield is “not optimized (-14)” even though it’s Widevine L1 certified",
        "content": "Hey folks,  \nI just hit the weirdest problem and wanted to see if anyone else is in the same boat.\n\n* Device: **Nvidia Shield TV Pro (2019)**\n* Netflix App: [**com.netflix.ninja**](http://com.netflix.ninja)**, v11.0.12 build 19894**\n* DRM: **Widevine L1 confirmed**\n* Shield firmware: **latest (2025 build)**\n* Play Store: **device certified**\n\nDespite all that, Netflix throws me a **“This device is not optimized for Netflix (-14)”** error and only plays pixelated SD. YouTube, Prime Video, Disney+ all run in 4K HDR with no problem.\n\nI called Netflix support and they confirmed it’s a **certification issue on their end** — not a geo restriction, not my internet, not DRM. But instead of fixing it, they literally asked me to **mail them(not even email)** for escalation. Seriously? This is one of the most popular Android TV devices, and Netflix just drops certification like this?\n\nSo:\n\n* Why is the Shield (2019) suddenly *not certified* anymore?\n* Why is Netflix pushing the burden to the customer to “write a letter” when it’s clearly a backend whitelist/ESN problem?\n* Anyone else running into the same error?\n\nThis feels like something that should be viral. Customers with perfectly capable, certified devices are being told their hardware is “not optimized” because Netflix won’t update their certification database.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mvcml2/netflix_says_my_nvidia_shield_is_not_optimized_14/"
    },
    {
        "id": "1mv0yds",
        "author": "bobbaganush",
        "title": "Two-and-a-half years between first and second season…",
        "content": "I just looked to see when 3 Body Problem’s new season would be out. The first was dropped March of ‘24. Looks like the second will be sometime between October and December of ‘26. This seems to be a trend with a lot of their series nowadays. It’s ridiculous. Does anyone here have an idea as to why they do this?",
        "upvotes": 13,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1mv0yds/twoandahalf_years_between_first_and_second_season/"
    },
    {
        "id": "1mvh48d",
        "author": "kayakvibes",
        "title": "Netflix quality....help!!",
        "content": "Nothing I do resolves the VHS quality I have with Netflix.  I have gigabit internet.  I switched to Wifi 7 inside.  I have a mesh network and placed pucks in close locations.  I'm using Apple TV 4K as the source.  Lost as to where to go.  It's so bad I can hardly make out faces. ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mvh48d/netflix_qualityhelp/"
    },
    {
        "id": "1mvgx20",
        "author": "driftingPiscean",
        "title": "How to enable the old layout?",
        "content": "I do not like the new layout. I like the menus on left. Also the new layout does not have information on upcoming shows based on this week/upcoming week, which I really miss!..",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mvgx20/how_to_enable_the_old_layout/"
    },
    {
        "id": "1mv0zqe",
        "author": "LeeleeLola",
        "title": "Animal Kingdom",
        "content": "Just discovered this show about 3 weeks ago and I've been binge-watching it nonstop!! I'm now at the end of S5. Such a great show! Every character is so well-acted. I ended up really hating Smurf and wasn't sad at all at her exit!I also thought the Nicky character was completely unnecessary, but I guess they needed her to get to the father's storyline. I just love Pope. He was so cringey in the beginning and now I just want to give him a big hug. Shawn Hatosy is an incredible actor! Thoughts? Like the show?Who is your favorite character?",
        "upvotes": 11,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1mv0zqe/animal_kingdom/"
    },
    {
        "id": "1mvdp8h",
        "author": "Even_Battle3402",
        "title": "How was Niro affected using Proteus in Zero Day?",
        "content": "In Zero Day Robert De Niro was suspected to be affected with Proteus, a neurological weapon. This explains his state of mind. But how was this weapon delivered to him? Did they explain how did the hacker implant this neurological weapon in Niros mind? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mvdp8h/how_was_niro_affected_using_proteus_in_zero_day/"
    },
    {
        "id": "1mvdc4a",
        "author": "whateven12346",
        "title": "My netflix Breaking Bad’s subtitles are a couple of seconds slow. How do i fix it?",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6cd26cgr36kf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1mvdc4a/my_netflix_breaking_bads_subtitles_are_a_couple/"
    },
    {
        "id": "1mvcl9z",
        "author": "uns3en",
        "title": "Anyone else experiencing this?",
        "content": "As of this morning, I keep getting signed out whenever I'm switching to a secondary profile. Tried clearing cache, a different browser, and even reset the password thinking someone managed to get in. Login works just fine, but when I try to switch to any profile other than the main, I'm kicked back out to the login screen.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mvcl9z/anyone_else_experiencing_this/"
    },
    {
        "id": "1mv0zjn",
        "author": "QualityOdd6492",
        "title": "The Diplomat",
        "content": "I finished the whole 2 seasons....now what? Is there anything that is nearly as good?  I don't do horror, or gore, please. And I can't stand futuristic or animation. But The Diplomat really held my attention, and it has surprises! Help me please find a series I can look forward to turning on for 1, 2, or 3 episodes at a time.",
        "upvotes": 7,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1mv0zjn/the_diplomat/"
    },
    {
        "id": "1mvbeaf",
        "author": "Big_Personality_5080",
        "title": "Forgot the name of this Limited Series, and I can't find it.",
        "content": "Basically, the first episode of the series is there's a mafia boss or a kingpin, or a conman who has to pay one of his trusted clients a large amount of money. He has this money encrypted in this vintage looking portable computer briefcase, but it gets stolen by his accountant to take him the mob boss down. An undercover agent or police officer agrees to meet with the accountant in a hotel. The husband decided to call his tech-nerdy girlfriend through a video call to have her look at it. She was fascinated with the outdated technology. Then a woman with a blonde wig and dressed like a prostitute, breaks into the room and kills both of them. The wife witnessed it, and starts freaking out. Anyways, the husband had met with gun for hire of the mob boss, which is how he got in contact with the accountant, and even took a picture of his face in case he tries to betray him. The wife goes to their apartment snooping around for answers as to why this happened to her husband, and that's when the mob boss' daughter and his bodyguard show up to the apartment to kill her, but the gun for hire ends up killing his boss' daughter. To get rid of the evidence, he makes it seem that the dead body was the wife, and faked her death by burning the daughter's body in the wife's car. The series was on Netflix, and I swear it wasn't in English. PLEASE help me.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mvbeaf/forgot_the_name_of_this_limited_series_and_i_cant/"
    },
    {
        "id": "1muwuwf",
        "author": "ToonAdventure",
        "title": "Netflix Top 10 Report: Fixed and Night Always Comes Struggle, While KPop Demon Hunters Poised to Surpass Red Notice Next Week",
        "content": "",
        "upvotes": 10,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1muwuwf/netflix_top_10_report_fixed_and_night_always/"
    },
    {
        "id": "1muy67l",
        "author": "Narrow_Sail_6448",
        "title": "Need a recommendation for what show to watch on my plane",
        "content": "Have a 14hr flight coming up which I’m absolutely dreading. I’m looking to start a show to pass time. A show that isn’t slow to start but gets your interest within the first 2 to 3 episodes. Just need 1 recommendation of something that is currently on Netflix so I can download season 1. The shows I’ve watched in the past and really enjoyed (no order): breaking bad, better call Saul, ozark, prison break, suits, money heist. Thank you in advance ",
        "upvotes": 8,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1muy67l/need_a_recommendation_for_what_show_to_watch_on/"
    },
    {
        "id": "1mux02n",
        "author": "YouOdd9569",
        "title": "Recommend series with good background soundtracks/music",
        "content": "I really enjoy series especially with killer soundtracks and songs that create more emotion in the show. What netflix shows has this? For reference, im into adventure/drama and sometimes comedy.",
        "upvotes": 7,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1mux02n/recommend_series_with_good_background/"
    },
    {
        "id": "1mv9y78",
        "author": "Questionabletrade",
        "title": "Not a netflix guy, is there a series that has short duration of episodes? (30mins or so)",
        "content": "Netflix is my wife's favorite activity, i don't watch tv at all, however, its something that she wants me to do wtih her. i figured maybe a short episode would be a good start, anything you can recommend? every series i saw there has episodes of 60min or more in duration",
        "upvotes": 0,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1mv9y78/not_a_netflix_guy_is_there_a_series_that_has/"
    },
    {
        "id": "1muhlo8",
        "author": "CouchPilot3000",
        "title": "How likely is Dexter to get caught with today’s tech?",
        "content": "I was watching a.k.a binging Dexter and couldn’t help thinking how impossible it would be for him to pull that off today. Back in the early 2000s he’s wiping blood with bleach, keeping trophies, and somehow dodging every camera in Miami.\n\nFast forward to now and it feels like the walls would close in almost instantly. Between license plate scanners, smart cameras on every block, DNA databases growing by the day, and even random smart devices recording in the background, I don’t know how someone could live that double life. Even his “burner phones” would leave a trail with tower pings and data brokers selling location info. ",
        "upvotes": 44,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1muhlo8/how_likely_is_dexter_to_get_caught_with_todays/"
    },
    {
        "id": "1mv95ba",
        "author": "gluhmy",
        "title": "Question about Households when using Mesh WiFi System -",
        "content": "Is there a way to stop Netflix from asking for a code when an actual person in my actual household is trying to log in?\n\n  \n\n\nBasically, there's 2-3 devices using Netflix, all connected to a different mesh thingy/access point, but all is connected to ONE Router. (We have dead spots so we set up a mesh system)  \n  \n\n\n* 1st device is the TV downstairs that connects to the router \n* 2nd device is my fiancé's PC, connected to 1 node via LAN that's connected to the router downstairs\n* 3rd device is my PC, connect to another node via LAN that's ALSO connected to the router downstairs\n\n\n\nSince I am the primary account holder, I am the one receiving the codes via email. And I have to confirm EVERY TIME someone wants to watch on the TV, or when my fiancé wants to watch on his PC.\n\n\n\nSometimes, I watch on my tablet, which is connected to the access point from the node connected to my PC. And that doesn't ask for a code, maybe because it's in the same network as my PC. BUT TECHNICALLY, everything is in the same network, just in different nodes. \n\n\n\n  \nIt's getting annoying...how are they unable to recognize 1 mesh system as the same household? How can I prevent this?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mv95ba/question_about_households_when_using_mesh_wifi/"
    },
    {
        "id": "1mv1pnt",
        "author": "wiffle_ball_",
        "title": "Show recommendation!",
        "content": "We just started watching The Lazarus Project today &amp; binged to episode 5. Oh my goodness, it is SO GOOD! \n\nIf you like thriller shows involving time travel, with emotional storylines &amp; excellent character development, this is for you.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mv1pnt/show_recommendation/"
    },
    {
        "id": "1mtlxtl",
        "author": "SplitNational2929",
        "title": "KPop Demon Hunters Is About to Become Netflix’s Biggest Movie of All Time",
        "content": "",
        "upvotes": 1976,
        "comments": 207,
        "media": null,
        "permalink": "/r/netflix/comments/1mtlxtl/kpop_demon_hunters_is_about_to_become_netflixs/"
    },
    {
        "id": "1mtzjia",
        "author": "Intro-Nimbus",
        "title": "What happened to Wednesday?",
        "content": "It's so.. off.  \nIt's completely lost the vibe of the old series and the movie. Gomez is the worst cast I've seen in a long time, Morticia is completely at odds with her mother and daughter.  \nThey're a school of misfits, yet everyone seem to react just like normies to things like eyeballs and murder - Fester thankfully being his old self is the exception.  \nWe have completely ridiculous subplots with competitions vs scouts acting like a parody of marines, that seem to be written for an audience of 4-year olds. There are numerous silly subplots that go literally nowhere.\n\nI fell like I'm watching random scenes from kids movies about summer camp and school, except the dialogue was better in the shows that focused on 7-year olds.\n\nThe dialogue is terrible, it's convoluted and everyone talks like a try-hard emo.\n\nNot to mention the constant exposition, is the target audience persons suffering from loss of short-term memory?\n\nIt is atrocious, I want to like it but it is a burning file of poo.",
        "upvotes": 371,
        "comments": 118,
        "media": null,
        "permalink": "/r/netflix/comments/1mtzjia/what_happened_to_wednesday/"
    },
    {
        "id": "1mutrnc",
        "author": "Informal_Mouse_4305",
        "title": "My List vs \"Another Season Is Coming\"",
        "content": "Sometimes it is clearly officially announced that another season is coming. Sometimes there are rumours and the series isn't officially completed or cancelled.   \n  \nFor the shows where you've watched all episodes, do you keep them in your list or do you remove them? I really want to be notified by Netflix when a new season is released so I currently keep all of them.  But that clutters my list considerably over the years... I have so many shows there that I want to ignore until the new season is available.   \n  \nI wish there was a way to move them from \"My List\" to a \"Remind Me List\" or at least push them to the very bottom of the list...  What's your approach/tips on this?",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1mutrnc/my_list_vs_another_season_is_coming/"
    }
]