[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 484,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1hwh37q",
        "author": "Robemilak",
        "title": "‘Squid Game’ Season 2 earns 126.2M views from its first 11 days on Netflix. Faster than any series ever on the platform.\n",
        "content": "",
        "upvotes": 28,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hwh37q/squid_game_season_2_earns_1262m_views_from_its/"
    },
    {
        "id": "1hvlmba",
        "author": "EthanWilliams_TG",
        "title": "Watch Hulk Hogan Get Booed by Fans During WWE's Netflix Debut",
        "content": "",
        "upvotes": 3004,
        "comments": 393,
        "media": null,
        "permalink": "/r/netflix/comments/1hvlmba/watch_hulk_hogan_get_booed_by_fans_during_wwes/"
    },
    {
        "id": "1hwkzv9",
        "author": "S4v1r1enCh0r4k",
        "title": "New teaser for Mo Season 2 just dropped",
        "content": "",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hwkzv9/new_teaser_for_mo_season_2_just_dropped/"
    },
    {
        "id": "1hwhkek",
        "author": "Pogrebnik",
        "title": "Netflix's Top 10 Most Watched Movies of All Time: Some New Arrivals Made The Cut",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hwhkek/netflixs_top_10_most_watched_movies_of_all_time/"
    },
    {
        "id": "1hw2xuq",
        "author": "Ill_Dependent1389",
        "title": "Love these BTS Squid Game 2 🫰",
        "content": "",
        "upvotes": 59,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hw2xuq/love_these_bts_squid_game_2/"
    },
    {
        "id": "1hwch45",
        "author": "amandaasous",
        "title": "Netflix “set household” can’t stream while traveling for work",
        "content": "I read an old post when searching for this subject but my situation is different from most of the replies and the post itself. I’ve contacted Netflix support twice today and a few other times in the past about this dumb household limitations. You can only request a vacation code in advance and only a few times a year. I travel for work often and Netflix ALWAYS force closes every minute in all  hotels. At first I thought it was Marriott hotels all having shitty TVs but finally caught onto the pattern that it is a NETFLIX issue. Prime and Max work perfectly fine in all my hotels. But I cannot use Netflix in my hotel rooms while my husband uses it at home. (I pay for more than 1 screen btw.) even if my husband is not at home and I log out of every single device and only log into my mobile phone and the hotel tv, Netflix still force closes every minute on the tv. There’s no option to update household on the TV Netflix. It just doesn’t exist. Does ANYONE have anything they’ve done that has helped with this or advice? Do I just cancel Netflix atp?\n\nTL;DR Netflix “set household” isn’t an option on my hotel tv, I cannot stream Netflix while I travel for work, and I travel often. Any tips/advice?",
        "upvotes": 10,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1hwch45/netflix_set_household_cant_stream_while_traveling/"
    },
    {
        "id": "1hwnbva",
        "author": "Atlast_2091",
        "title": "Prison Cell 211 | Official Trailer | Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hwnbva/prison_cell_211_official_trailer_netflix/"
    },
    {
        "id": "1hwn7w1",
        "author": "S4v1r1enCh0r4k",
        "title": " New Jerry Springer docuseries discovers some shocking stuff about the show, some of which we could already assume, apparently the producers went as far as to blackmail poor guests if they thought about not showing up for the final show panel ",
        "content": "",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hwn7w1/new_jerry_springer_docuseries_discovers_some/"
    },
    {
        "id": "1hwlwtb",
        "author": "jilldxasd35",
        "title": "Transferring profile ",
        "content": "Transferring profile\n\nTwo separate households, ip addresses. \n\nI had been logging in and watching a few minutes of something while at household 1’s (my dad) house once a week and still watching at household 2’s (my) house. Every so often we both would get the message about adding an account but could still watch. \n\nThough we decided to add me onto my dad’s account. He enabled profile transfers instantly. I entered in an email to be invited but never received an email. Later I did get a text, my dad must have done something. \n\nI tried to do a profile transfer while on his account at his house but it needed an existing account. \n\nI clicked the link in the text and created an account. \n\nNow when I get on his account at his house to transfer a profile it brings up this page after I have used my log in. What does this mean, and how can I get a profile to transfer? When I log in to Netflix with my account info I don’t have any of my old profile, nothings been transferred. \n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hwlwtb/transferring_profile/"
    },
    {
        "id": "1hwlrsj",
        "author": "PimlicoPotluck",
        "title": "Having trouble pausing",
        "content": "Previously, if you clicked anywhere on the screen or pressed space, netflix would pause, but that no longer happens. Now i need to click the pause button in the bottom left and its really triggering.\n\nanybody else having this issue?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hwlrsj/having_trouble_pausing/"
    },
    {
        "id": "1hvtr13",
        "author": "anonymous-user1234",
        "title": "Why wasn't Steve Wilkos brought up on Netflix Jerry Springer documentary?",
        "content": "Title says it all. Just finished the Netlix documentary and not sure why such an integral aspect and figurehead of the show wasn't mentioned once. Weird. ",
        "upvotes": 73,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1hvtr13/why_wasnt_steve_wilkos_brought_up_on_netflix/"
    },
    {
        "id": "1hwktiw",
        "author": "Flimsy_Task_3540",
        "title": "Surveys about  Hometown Chachacha and Physical 100",
        "content": "Hi! I'm a university student in Italy, I'm graduating in arts management. My research is focused on the succes and impact of Physical 100 and Hometown Chachacha, I've prepared a survey for each show and I'll link them below for anyone Interested. Thanks for the support !   \nHometown Chachacha : [https://docs.google.com/forms/d/e/1FAIpQLSeMxXggNbtOcFxHGhp\\_66581NIxUl6HV6Syq7eP\\_eF1upC7xA/viewform?usp=sf\\_link](https://docs.google.com/forms/d/e/1FAIpQLSeMxXggNbtOcFxHGhp_66581NIxUl6HV6Syq7eP_eF1upC7xA/viewform?usp=sf_link)\n\nPhysical 100 : [https://docs.google.com/forms/d/e/1FAIpQLSfS-c-ZAJCKJ1sW6357SOQigivCTyMkH1C-beDKNTivMbcgcQ/viewform?usp=sf\\_link](https://docs.google.com/forms/d/e/1FAIpQLSfS-c-ZAJCKJ1sW6357SOQigivCTyMkH1C-beDKNTivMbcgcQ/viewform?usp=sf_link)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hwktiw/surveys_about_hometown_chachacha_and_physical_100/"
    },
    {
        "id": "1hwjk2m",
        "author": "gameofsloanes",
        "title": "Netflix keeps losing sound",
        "content": "Brand new tv and every other app works fine but Netflix randomly has no sound. It comes back on occasion but for the most part I get nothing. Anyone else had this issue?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hwjk2m/netflix_keeps_losing_sound/"
    },
    {
        "id": "1hwecpk",
        "author": "kitanaaaa26",
        "title": "Can i use netflix on holiday?",
        "content": "I have a netflix account that my family use, i am going away next month and want to watch netflix while im there, can i login on a new TV in a completely different city? I know you cant share accounts but i still want to use it while im away.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hwecpk/can_i_use_netflix_on_holiday/"
    },
    {
        "id": "1hvvtl5",
        "author": "daily_mirror",
        "title": "Netflix's Squid Game fans debunk viral theory linking Front Man to surprise character",
        "content": "",
        "upvotes": 29,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hvvtl5/netflixs_squid_game_fans_debunk_viral_theory/"
    },
    {
        "id": "1hwhc3n",
        "author": "Hairy_Promotion_2782",
        "title": "Is there a Squid Game map ? (s1 or s2) ",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hwhc3n/is_there_a_squid_game_map_s1_or_s2/"
    },
    {
        "id": "1hw62aq",
        "author": "RockyPS2Glitches",
        "title": "Gabriel Iglesias: Legend of Fluffy",
        "content": "Just got done watching Gabriel Iglesias' new Netflix special, \"Legend of Fluffy\", and as someone who was a big fan of Gabe in the past, this special was so disappointing. Outside of the usual \"thank you\" and \"name drop shout outs\" he gives, he had a few jokes that went on for way too long (the gun shop bit with Jim), along with some recycled jokes from past specials, like the themed weeks and Krispy Kreme jokes, as well as the story about how he flashed the old couple.\n\nPlus not to mention the constant bragging about having fans, being famous, being rich. Like, we get it, dude. I swear, it seems like his material hasn't been interesting since he got the divorce and Frankie moved out, and I think plenty of people probably feel the same way also. And the crowd got annoying at times during the special too. Like almost ever word he said evoked an applause from the audience, and I think he got more cheers than laughs that night there were so many!",
        "upvotes": 6,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1hw62aq/gabriel_iglesias_legend_of_fluffy/"
    },
    {
        "id": "1hvp43v",
        "author": "MonkeyTacoBreath",
        "title": "So this may just be a personal pet peeve, but the show/movie playing when you just want to read the description bugs the heck out of me.",
        "content": "My main issue is that because the show/movie started playing as I read the description, even if I back out 3 seconds later, that title is now in my continue watching tab. And I have to manually go remove it. \n\nI have auto play trailers and shows turned off. This happens on all platforms that I have access to, Xbox, PC, and Android.\n\nAnyone else get bugged by this \"feature\" or some other pet peeve?",
        "upvotes": 55,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1hvp43v/so_this_may_just_be_a_personal_pet_peeve_but_the/"
    },
    {
        "id": "1hw8upz",
        "author": "Internal_King_9747",
        "title": "Parenthood look a like?",
        "content": "How did I just found Parenhood on Netflix? Im in Canada. Was it on before? Found it just this week. Never actually heard of it before!\n\nThats such a good show!\n\nAny show that looks like it?\n\nI love when there are lots of seasons too! ",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hw8upz/parenthood_look_a_like/"
    },
    {
        "id": "1hwbpy7",
        "author": "RealCanadianDragon",
        "title": "Downgrade plan?",
        "content": "I have the standard ad free tier in Canada for $16.50 and after comparing it to the standard with ads (I think its about $6?), I don't believe there's a huge difference seeing as the stuff I'm watching isn't impacted by the ad vs no ad tiers\n\n\nWith that said, given I just signed up for the ad free tier a few days ago, can I downgrade to the ad tier and get my money back pro rated to the date of the change, or will I still be on the hook for the entire month of the ad free tier I signed up for?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hwbpy7/downgrade_plan/"
    },
    {
        "id": "1hw24x9",
        "author": "Intotheparadigmshift",
        "title": "Jerry Springer Documentary",
        "content": "For almost 25 years, Jerry springer aired and entertained me as a child and I loved it! I was in for it. I’ve been having Netflix since when it came out. And I am in absolute love with Netflix documentaries. But damn did they do a horrible job on this documentary. I mean everyone on this project has to be fired it was horrible.\nFor 25 years all they got was, JS in a 3sum, a murder that took place after the show and criticism of hate about the show for cancellation. That’s it!? That’s all this crew got? Disrespectful. Shameful. I disliked this documentary and Netflix was like whaaaaaat? You disliked this doc? lol cause it wasn’t saving my dislike. Jerry springer episode was more interesting than this trash of a documentary. I have bad taste?\n• into the fire\n•don’t fuck with cats\n•marduagh murder\n• I am a killer\n• Last Chance U\n• The disappearance of Madelienne McCann\n• The Trial of Gabriel Fernandez\n• American Nightmare\n• Tiger King\n• Chefs Table\n• the Last Dance\n• The Nightcrawler\n• American Murder\n• The Tinder Swindler\n• The Hatchet Wielding Hitchhiker\n• Bitconned\n•Our Father\n• How to Rob a Bank\n• Why Did You Kill Me\n• Athlete A\n• Long shot\n• The 3 deaths of Marisela Escobedo\n• Tupelo\n\n\nJust a bit to reference off of so yall know what kind I like and watch. ",
        "upvotes": 3,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1hw24x9/jerry_springer_documentary/"
    },
    {
        "id": "1hvxlsm",
        "author": "indiewire",
        "title": "The 7 Best New Shows on Netflix in January",
        "content": "",
        "upvotes": 9,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hvxlsm/the_7_best_new_shows_on_netflix_in_january/"
    },
    {
        "id": "1hvmdi7",
        "author": "Robemilak",
        "title": "Hwang Dong-hyuk praises T.O.P's performance in ‘SQUID GAME’ Season 2 after the actor got no work in the Korean entertainment industry for 9 years after he was arrested for smoking weed. ",
        "content": "",
        "upvotes": 44,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hvmdi7/hwang_donghyuk_praises_tops_performance_in_squid/"
    },
    {
        "id": "1hvt0cj",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix’s Terrifying German AI Horror Show 'Cassandra' sets February 6 release date and showcases new teaser",
        "content": "",
        "upvotes": 12,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hvt0cj/netflixs_terrifying_german_ai_horror_show/"
    },
    {
        "id": "1hwb2vo",
        "author": "SolidStep4016",
        "title": "Jerry Springer Doc",
        "content": "I loved this documentary becauseI grew up watchingthe Springer show. When I would stay home from school sick this show and the Price is Right were my go tos.\n\nNetflix should air all the episodes of the Springer show uncensored. ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hwb2vo/jerry_springer_doc/"
    },
    {
        "id": "1hwciq1",
        "author": "coolkid3621",
        "title": "Non-Wrestling fans: how many of you watched WWE for the first time this week?",
        "content": "With WWE finally moving to Netflix &amp; heavily promoting it, I’m wondering how many new people actually watched wrestling for the first time this week &amp; if this was your first time, what did you make of it?",
        "upvotes": 0,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1hwciq1/nonwrestling_fans_how_many_of_you_watched_wwe_for/"
    },
    {
        "id": "1hw81jw",
        "author": "amigoreview",
        "title": "Netflix Ultra HD - Australia: question",
        "content": "Anyone in Australia using Netflix’s Ultra HD plan? \n\nAre you experiencing resolution issues with 4K content? Dolby Vision isn’t kicking in for me… it’s stuck in HD SDR for 4 days now. My devices are fine.\n\nCould anyone confirm (check playback info for Dolby Vision or HDR, if your TV has no DV) if they’re facing the same?\n\nThanks!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hw81jw/netflix_ultra_hd_australia_question/"
    },
    {
        "id": "1hwk4ii",
        "author": "iridescentlion",
        "title": "What If Zendaya Played Summer Field in \"Time Cut\" (2024)? Let's Discuss the Potential Impact!",
        "content": "  Imagine the buzz if Netflix had cast Zendaya as Summer Field, the sister of Lucy Field, in \"Time Cut\" (2024). With Lucy traveling back from 2024 to 2003 to stop a serial killer, Zendaya's role would have been pivotal! Her star power and resemblance to Madison Baily (who plays Lucy) would have made them the perfect on-screen sister duo. It’s like they were meant to play siblings or even twins. Think of the hype and increased viewership this would generate! But with her salary being around $2 million for big roles like \"Dune 2,\" would it be worth the investment for Netflix? How do you think this casting choice could have shaped the film's popularity and viewer experience?\n\n Let's dive into this casting \"what if\" and its potential impact on views, buzz, and the movie itself. All thoughts are welcome. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hwk4ii/what_if_zendaya_played_summer_field_in_time_cut/"
    },
    {
        "id": "1hvwshq",
        "author": "pennywise1988",
        "title": "Strangest thing ever",
        "content": "Since the start of the new year I started binge watching Schitt's Creek on my German Netflix. I got to the beginning of season 4. All of a sudden, last night, on the app on my Smart TV the card for Schitt's Creek is there, but it says \"Remind me when it is released\" and I no longer can play it. I checked and the same happened now with Young Sheldon.\n\nAre the rights disputes and they removed shows just as they were added to German Netflix??",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hvwshq/strangest_thing_ever/"
    },
    {
        "id": "1hwbqkm",
        "author": "Miserable-Tax3192",
        "title": "Someone help me find this movie",
        "content": "Does anyone remember a cheesy coming of age movie about a boy who’s in his senior year? He starts a trend online or it has something to do with the internet. It starts a huge movement. He has the news at his house. He was being pressured to get into good colleges by his parents. He meets a blonde girl and they go to the beach with her friends. It’s based in california. She wants to be a model. The movie ends with him following her to europe as she’s trying to become a model. It was on netflix maybe a few years ago. I feel like the front cover of the movie was of him with like a bright aqua light blue background. It was super underground but i’ve been looking for it everywhere and want to make sure i’m not crazy.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hwbqkm/someone_help_me_find_this_movie/"
    }
]