[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 29,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pgdmxt",
        "author": "Swamp_Hawk420",
        "title": "Canceling my subscription, this is too ridiculous",
        "content": "I’m traveling right now about a thousand miles from home. It’s late, I can’t sleep, tried to throw on a movie, and got notified that Netflix has decided that I’m trying to commit fraud by watching tv outside of my house. The account is linked to my wife’s email so I can’t get the temporary password. The fact that they treat us like we’re trying to steal from them after paying so much is just a bridge too far. ",
        "upvotes": 2024,
        "comments": 181,
        "media": null,
        "permalink": "/r/netflix/comments/1pgdmxt/canceling_my_subscription_this_is_too_ridiculous/"
    },
    {
        "id": "1pgdpxe",
        "author": "Supermacropenis",
        "title": "The beast in me",
        "content": "Would it be wrong to suggest that the majority of the main events in this series were set in motion due to the fact that Nile Jarvis wanted a jogging path?",
        "upvotes": 13,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pgdpxe/the_beast_in_me/"
    },
    {
        "id": "1pfrgbk",
        "author": "Large-Weight6213",
        "title": "Most pointless update ever: casting",
        "content": "Netflix has removed the ability to cast from our devices to our TV. I'm actually raging and wondering if this is just a trial, because even if this was a cash grab it does not even make sense.\n\nCasting is the only way I can watch shows with my partner. What is the point of even having a subscription in this case?",
        "upvotes": 215,
        "comments": 83,
        "media": null,
        "permalink": "/r/netflix/comments/1pfrgbk/most_pointless_update_ever_casting/"
    },
    {
        "id": "1pfzosx",
        "author": "Odd_Campaign_2031",
        "title": "Diddy documentary- US jury system?",
        "content": "I’m watching the last episode of the Diddy doc and as someone not from the US, I’m quite confused by the whole jury thing.\n\nMy countrys legal system does not have juries, so to me it seems weird that 12 random people decided on Diddys fate and this case. Is there not a judge present or a team of judges that gets to decide the final verdict?\n\nI find the two jurors in the episode don’t seem that smart and like they could easily be coerced/ that their subjective values played a huge role in their decision. I always thought that the foundation of a solid legal system is that we have highly intelligent professionals who have been trained and educated for years, who chose to dedicate their lives to upholding the law, and have gone through a rigorous process to become a judge, making important decisions over people’s lives. So I’m quite shocked by the idea of just choosing random people from the general population, to make decisions like this..\n\nBut maybe someone can explain more about the legal side of how the jury system works and why it is in place in the US.",
        "upvotes": 48,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1pfzosx/diddy_documentary_us_jury_system/"
    },
    {
        "id": "1pfphza",
        "author": "perpetualsadnes1",
        "title": "Sean Combs: The Reckoning Documentary",
        "content": "What was your take on the documentary?\n\nWas anyone else absolutely livid at the jurors for what they were saying? I dont think justice was served at all.",
        "upvotes": 152,
        "comments": 163,
        "media": null,
        "permalink": "/r/netflix/comments/1pfphza/sean_combs_the_reckoning_documentary/"
    },
    {
        "id": "1pggxjv",
        "author": "Bippy73",
        "title": "Jay Kelly (Spoilers)",
        "content": "This was easily one of my favorite movies this year.  Surprised at how much I enjoyed it. The acting was top-notch across the board, Clooney was brilliant, only I found Dern's constant complaining tiresome.  The sub plot between her and Sandler was unexpected, but definitely helped to really hammer home the theme of the movie.\n\nIn scrolling through some comments, I was wondering if we had watched the same movie. I think for some, if it is not an action-packed thriller, or maybe if you're younger, they can't stick with it. Curious to see if others see what I saw-  to me, this was a universal theme of looking back on life and assessing profound regret of choices made or the hand you are dealt.\n\nI think it was even more.  I took it that it is just fundamentally the human condition to not be happy.  Crudup, who is excellent, is the opposite side of the same coin as Clooney.  He has everything Clooney does not, yet Crudup is obviously filled with anger and regret.  Sandler &amp; Dern clearly regret their choices, despite saying otherwise.\n\nSaw some reviews talking about how this was too inside baseball of the movie industry.  To me, it's a universal theme that is so often the case in many people's lives. Anyone who travels for work, or is always at their home, but is absent either by constantly being at the office, whether mentally or physically.  Not showing up for family or friends in the sense of being truly present. You don't have to be a movie star millionaire to see money does not solve everything.  In fact, this movie proves it is just the opposite. You can have what everyone presumes is having won the lottery, but be profoundly lonely.\n\nIt is, at the end of the day, a sad movie.  Life is a game of choices, and it seems that everyone in this movie regrets theirs. So many people cannot reverse course.\n\nI said it's the movie version of the song Cat's in the Cradle.  I do think, though, it asks the question, if you did change course in life, would you really be happy?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pggxjv/jay_kelly_spoilers/"
    },
    {
        "id": "1pfy1qj",
        "author": "LilNello1",
        "title": "Jay Kelly",
        "content": "I ended up watching last night the new Jay Kelly movie starring George Clooney and Adam Sandler and really enjoyed it a lot.  Easily among my favorite movies of the year and both George as Jay Kelly and Adam Sandler as his manager Ron were absolutely brilliant in it.  Clooney was tailor made for Kelly and I don’t think anyone else could have played him as brilliantly as he did.  The movie itself is such a fun rollercoaster ride of emotions and depth that nearly brought me to tears towards the ending.  I think partially cause of how many of my own memories are tied to movies throughout the years and how film and/or movies were a big part of mine and my Dad’s (R.I.P. 🙏🏼) relationship over the years prior to his unfortunate passing a little over 5 1/2 years ago.  Without giving away too many spoilers, if any, for those who have not watched it yet.  What are people who have seen its thoughts on the movie and what did you like or not like about it?",
        "upvotes": 27,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1pfy1qj/jay_kelly/"
    },
    {
        "id": "1pgieng",
        "author": "Mucek121",
        "title": "Is The Crown and House of Cards  good shows ?",
        "content": "I need something to watch i think about  The Crown or House of Cards are   good shows ? anyone can give me mini review about this shows\n\n  \nThank you for answer",
        "upvotes": 0,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1pgieng/is_the_crown_and_house_of_cards_good_shows/"
    },
    {
        "id": "1pgiako",
        "author": "rln12280",
        "title": "Finished Queens Gambit-what next?",
        "content": "I watched Queens Gambit &amp; LOVED IT. I have always said I didn’t like period pieces. I guess I was wrong. So can you give me any other suggestions? I have not seen any period peices series. Would like a longer series if possible. Thanks \n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pgiako/finished_queens_gambitwhat_next/"
    },
    {
        "id": "1pg0ryb",
        "author": "Global-Citron-56",
        "title": "Is \"THE NIGHT AGENT\" the most compulsive Netflix series in a long time?",
        "content": "began with \"one episode\" and ended up halfway through the season 😅  \nEvery episode makes you click \"Next\" because of its quick plot, lack of filler, and constant tension.  \n  \nHave you also binge-watched it?  \nWhich other Netflix series made you want to watch \"just one more episode\"?",
        "upvotes": 16,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1pg0ryb/is_the_night_agent_the_most_compulsive_netflix/"
    },
    {
        "id": "1pggs10",
        "author": "MangaMax115",
        "title": "Looking for specific shows",
        "content": "Me and my girlfriend love the korean dating shows with a panel of hosts to sometimes give insight or their opinion, we found 3 :\n\n- Singles Inferno\n- 19/20\n- Better late than Single\n\nDo you guys know of more shows that are like These? \n\nOr other international dating shows worth watching?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pggs10/looking_for_specific_shows/"
    },
    {
        "id": "1pg7835",
        "author": "bunnylover50",
        "title": "What are your favourite shows? I need recommendations since I just finished stranger things lol",
        "content": "My favourite show is stranger things and I want to find a show similar to stranger things since I just finished it lol. I’m looking to find a horror themed show to watch any recommendations will be appreciated!",
        "upvotes": 4,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1pg7835/what_are_your_favourite_shows_i_need/"
    },
    {
        "id": "1pglt7z",
        "author": "sneakyslitherysnack",
        "title": "Blink Twice reference in Sean Combs The Reckoning",
        "content": "58 minutes into episode 4 “Blink again” Kirk Burrowes comments on how Diddy has shown violent behaviour since the 1992.\n\nHe goes on to say “it seems to be all of a sudden with Sean, and it isn’t. Some of it happened before our eyes. We blinked twice, and then we blinked again and were like “okay, I guess this is cool now.”\n\nIt struck me while watching it and reminded me of the movie Blink Twice, and how when it first came out there were conspiracies about it being loosely based around Diddy and/or Epstein.\n\nAfter seeing the series, and hearing ‘blink twice’ in an episode called blink again, I can’t help but think it was intentional to call attention to it and inadvertently confirm the conspiracy.\n\nDid anyone else pick up on this? I know I could be reading into it too much but 50 cent is his biggest hater and it wouldn’t suprise me if he would take the opportunity to throw shade wherever he can.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pglt7z/blink_twice_reference_in_sean_combs_the_reckoning/"
    },
    {
        "id": "1pgicee",
        "author": "Next-Talk825",
        "title": "Did anyone else catch the very blatant similarity between concepts in Stranger things season 5 VS harry potter?",
        "content": "- Going in Vecnas Memories as an observer\n- Will feeling something when Vecna is near\n- a) Getting flashes of scenes and b) later piecing together that it was from the mind of the demogorogon c) that was actually controlled by vecna  \n",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pgicee/did_anyone_else_catch_the_very_blatant_similarity/"
    },
    {
        "id": "1pgee5g",
        "author": "tomaz1989",
        "title": "Any grat show like Mare of Easttown/Unbelievable/Queen's Gambit",
        "content": "Any grat show like Mare of Easttown/Unbelievable/Queen's Gambit\n\nMy mom really liked this shows\n\n( dont need to be netflix show)\n\n  \nthank you for answer",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pgee5g/any_grat_show_like_mare_of/"
    },
    {
        "id": "1pgaqgl",
        "author": "Cool_Class657",
        "title": "Why am i getting no ads with the ads plan?",
        "content": "Im not complaining about getting no ads, it's just that im confused since i usually never get this ever on netflix since my subscription, is it because of the month or is it just like that?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pgaqgl/why_am_i_getting_no_ads_with_the_ads_plan/"
    },
    {
        "id": "1pghji1",
        "author": "AggravatingShow2028",
        "title": "What are your favorite Christmas RomComs at the moment?",
        "content": "I love this time of year Because all the sappy romcoms are on. I’m off today so I’m going to stay in my pajamas and watch movies and picture myself having a meet cute this holiday…I need inspiration! Best Christmas/holiday romcom?",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1pghji1/what_are_your_favorite_christmas_romcoms_at_the/"
    },
    {
        "id": "1pg82wr",
        "author": "MamaMia1325",
        "title": "Brockmire...",
        "content": "Is it worth watching? I'm a huge baseball fan and I'm halfway through the 1st episode. I like it so far. Who has watched this and would you recommend? Hank Azaria has been great in everything I've seen him in.",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1pg82wr/brockmire/"
    },
    {
        "id": "1pgaldh",
        "author": "legacykollection",
        "title": "Maybe Netflix releases Batgirl and Batman Forever: Schumacher Cut",
        "content": "I'll 100% support that deal if they do it. Not sure who exactly holds the rights of the latter, but something could be done I'm sure. A little victory for the common people and fans lol",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pgaldh/maybe_netflix_releases_batgirl_and_batman_forever/"
    },
    {
        "id": "1pgaif7",
        "author": "No_Calligrapher2005",
        "title": "Jay Kelly",
        "content": "Recently read a short article written by Lia Beck, Cosmopolitan and the article discussed the last line that Jay Kelly recited ….  “Then, looking directly in the camera, he says, \"Can we go again?\" Lia stated that “Obviously, this time it’s about his actual life. Oof!” The quotes were taken from Lia’s article.\n\nI thought his realization was the opposite of Lia’s. I thought as he looked around, although he saw family’s faces in the audience, I think he was more enamored with the fact of the adoration of him as an actor. Although affected by his family, I think he realized in the end his familial attachment was not as important to him as the adoration of him being one of the last “Clark Gable”\nmovie stars &amp; that was his gotcha moment. Am I totally off base? ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pgaif7/jay_kelly/"
    },
    {
        "id": "1pfqxdk",
        "author": "No-Tooth-1882",
        "title": "Sean combs documentary and the spiritual side of things",
        "content": "\nDiddy  continued to sacrifice people around him. He SAd people, drugged people, attempted to kill people, never paid people, his very \n, over the top LUSTFUL mindset. \n\nAnd i  just wanna know spiritually did no one feel his dark energy?\nDid no body connect the dots to him being  connected to something demonic?\n\nThis man had no humanity. And i hated how he read the bible and listened to sermons even after doing all of that \n\nHis whole life is a display of mocking god\nWith his “god complex” with his “I’m above everyone” mind set. With doing evil things and doing it in the name of god. It’s disgusting \n",
        "upvotes": 17,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1pfqxdk/sean_combs_documentary_and_the_spiritual_side_of/"
    },
    {
        "id": "1pg9ntm",
        "author": "fredyouareaturtle",
        "title": "What's your favorite storyline in Love Actually?",
        "content": "After about 20 years of re-watching every Christmas, I have come to the conclusion that my favorite storyline is the couple who meets while they're working as stand-ins for a sex scene in a movie. They  have such a great connection, and of course, it's so funny that they are naked and simulating sex while casually chatting about traffic, etc.  I just found them really sweet. \n\nWhich storyline or couple is your favorite?",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1pg9ntm/whats_your_favorite_storyline_in_love_actually/"
    },
    {
        "id": "1pg8odr",
        "author": "Shiny_Mewtwo_Fart",
        "title": "How to holster your weapon on red dead redemption?",
        "content": "I can’t find any options to holster my weapons. Sometimes the game will automatically holster sometimes not. I don’t want to just draw my weapon all the time to be killed by others? Also couldn’t find my inventory either. \n\niOS 17 pro max ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pg8odr/how_to_holster_your_weapon_on_red_dead_redemption/"
    },
    {
        "id": "1pfxqfe",
        "author": "Salem1690s",
        "title": "This show never got a fair chance",
        "content": "",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pfxqfe/this_show_never_got_a_fair_chance/"
    },
    {
        "id": "1pfrd99",
        "author": "Timewilltell755",
        "title": "I wanted to like Jay Kelly?",
        "content": "But the dialogue was just not natural.  I didn’t feel much chemistry with between anyone.  The dialogue between Adam Sandler and Laura Dern about her leaving him at the Eiffel Tower 19 years ago was just so contrived and kind of ridiculous.  ",
        "upvotes": 10,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1pfrd99/i_wanted_to_like_jay_kelly/"
    },
    {
        "id": "1pfrbx8",
        "author": "Li3Ch33s3cak3",
        "title": "Looking for long medical shows like grey’s anatomy",
        "content": "I’ve already seen Grey’s Anatomy, Dr. House, and The Good Doctor, but I’m in the mood for another long medical show. I love getting invested in the characters and the drama, especially when there’s a bit of real medical content mixed in.\n\nAny recommendations for shows that dive deep into medicine and have lots of seasons to keep me hooked?",
        "upvotes": 9,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1pfrbx8/looking_for_long_medical_shows_like_greys_anatomy/"
    },
    {
        "id": "1pfstlt",
        "author": "Due_Lock_4967",
        "title": "Looking for a good movie for a family movie night",
        "content": "I’m trying to find a movie that everyone in my family will enjoy. The age range is from 15 to 48, so it’s a bit tricky to find something that appeals to everyone. We like a mix of genres, but nothing too heavy or too childish.\n\nAny suggestions for a great family movie on Netflix that hits the sweet spot for all ages?",
        "upvotes": 7,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1pfstlt/looking_for_a_good_movie_for_a_family_movie_night/"
    },
    {
        "id": "1pg6h7f",
        "author": "xLUNCHTREYx",
        "title": "Netflix on Xfinity Flex Box Won’t Show 4K — Only HD Even With Premium Plan",
        "content": "I’m having an annoying issue with Netflix on my Xfinity Flex box and I’m hoping someone here has run into this before.\n\nI’m paying for the Netflix Premium plan, which includes 4K streaming, but on the Flex box Netflix only shows content as HD, not 4K/UHD. No “Ultra HD” tags show up anywhere.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pg6h7f/netflix_on_xfinity_flex_box_wont_show_4k_only_hd/"
    }
]