[
    {
        "id": "1if0swi",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://t.me/+K_tQ4Zzi0S80YjFk): Gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g30QJSClHjRAUvFBqKJa-Re4duFBniS6HkLBoJRdgOQ.jpg?auto=webp&amp;s=2c44cf9a902b77de7dce3b5cad542f22791fb32e"
        },
        "permalink": "/r/torino/comments/1if0swi/la_piola_friends_meetup/"
    },
    {
        "id": "1if0swb",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram group for apartment hunting: https://t.me/CaseStudentiTorino\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1if0swb/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1iuo9m5",
        "author": "aranor01",
        "title": "Easy Riders - pedalata 23 febbraio",
        "content": "https://forms.gle/JR3JExxQc1ejvnGW7",
        "upvotes": 6,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/akcuqy754hke1.jpeg?auto=webp&amp;s=093a8e7dd6135156c0076b455fdc763cb0f69099"
        },
        "permalink": "/r/torino/comments/1iuo9m5/easy_riders_pedalata_23_febbraio/"
    },
    {
        "id": "1ius689",
        "author": "wilco67italy",
        "title": "Book2book",
        "content": "Ciao\nQualcuno usa questa piattaforma per scambiare libri o solamente per noleggiare? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ius689/book2book/"
    },
    {
        "id": "1ium4d0",
        "author": "topherette",
        "title": "Quali soprannomi avete sentito per i luoghi di Torino e dintorni?",
        "content": "Chiedo per un progetto linguistico su questo argomento!\n\n(Un esempio potrebbe essere 'Niche Beach')\n\n",
        "upvotes": 6,
        "comments": 28,
        "media": null,
        "permalink": "/r/torino/comments/1ium4d0/quali_soprannomi_avete_sentito_per_i_luoghi_di/"
    },
    {
        "id": "1iu72ps",
        "author": "The_Glass_Zoo",
        "title": "Suggerimento ristorante vegano o con opzioni valide per vegani",
        "content": "Devo organizzare un pranzo in quel di torino ma nel gruppo ci sono un paio di vegani.\n\nOk che tutti i ristoranti (tranne quelli specializzati in certi tipi di cucine) se avvisati per tempo possono proporre valide opzioni ma stiamo valutando di optare per un pranzo totalmente vegano e in tal caso vorremmo andare in un ristorante dove ci siano proposte interessanti.  \nAvete suggerimenti?",
        "upvotes": 7,
        "comments": 20,
        "media": null,
        "permalink": "/r/torino/comments/1iu72ps/suggerimento_ristorante_vegano_o_con_opzioni/"
    },
    {
        "id": "1iu1cw3",
        "author": "festo_10",
        "title": "Da 1 a 10, quanto consigliate trasferirsi/vivere a Torino?",
        "content": "Bilancio qualità/costo della vita e opportunità che la città offre a un giovane. \n\nEdit: vi leggo tutti, grazie per i pareri e le argomentazioni",
        "upvotes": 14,
        "comments": 42,
        "media": null,
        "permalink": "/r/torino/comments/1iu1cw3/da_1_a_10_quanto_consigliate_trasferirsivivere_a/"
    },
    {
        "id": "1iu2sxd",
        "author": "ConTemporary-Machine",
        "title": "Zona piazza Baldissera e Ka del 2008",
        "content": "Utenti, vi chiedo aiuto un'altra volta.\nHo una Ka del 2008, devo fare questo percorso e nessuno sul sito del comune si spreca a scrivere chiaramente se posso o non posso andarci, mia madre dice di no, io dico che le regole possono essere piegate dal mio vecchio bolide rotondeggiante. Chi ha ragione? ",
        "upvotes": 3,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/c8sofv8bobke1.png?auto=webp&amp;s=de8c56a68500be1518a6136a374b0379ae393718"
        },
        "permalink": "/r/torino/comments/1iu2sxd/zona_piazza_baldissera_e_ka_del_2008/"
    },
    {
        "id": "1iub6my",
        "author": "FatinaRosa",
        "title": "DENTISTA TORINO",
        "content": "Buonasera,\nsto cercando un dentista su Torino e cercando nella mia zona ho trovato il Centro Dentistico Tassoni.\nQualcuno ha avuto qualche esperienza lì?\n\n\nGrazie",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1iub6my/dentista_torino/"
    },
    {
        "id": "1iu4qyz",
        "author": "FartestButt",
        "title": "Acquisto proteggi tavolo",
        "content": "Ciao a tutti, vorrei comprare uno di quei teli stoffa da un lato e gomma/plastica dall'altro, spesso, bianco e morbido, che si mettono sotto la tovaglia per proteggere il tavolo quando si rovesciano liquidi e dai segni dell'uso. Qualcuno lo chiama \"mollettone\". Avete idea di dove si possa trovare, possibilmente in centro? \n\nGrazie! ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1iu4qyz/acquisto_proteggi_tavolo/"
    },
    {
        "id": "1itwlqw",
        "author": "mutantgenes",
        "title": "Bloodwork",
        "content": "Where can i do an STD test in torino ? Preferably a private lab for a fast appointment and fast results. Thank you",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1itwlqw/bloodwork/"
    },
    {
        "id": "1itpluz",
        "author": "Diecast_5682",
        "title": "Vino esclusivo a Torino",
        "content": "Ciao a tutti. Sarò in visita tra qualche mese. Vorrei riportare una bottiglia di vino esclusiva di Torino o del Piemonte che non è disponibile da nessun'altra parte. Qualcuno ha qualche suggerimento? Grazie!",
        "upvotes": 5,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1itpluz/vino_esclusivo_a_torino/"
    },
    {
        "id": "1itzlim",
        "author": "Embarrassed_Major247",
        "title": "Dove fare graffiti murales?",
        "content": "cerco un posto in cui iniziare e per questo non so nemmeno se si possa senza commettere illecito o senza dover pagare qualcosa. Nel caso si potesse dove potrei recarmi?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1itzlim/dove_fare_graffiti_murales/"
    },
    {
        "id": "1itfmeg",
        "author": "chiaralupo",
        "title": "Non trovo nessun lavoro a Torino e soldi quasi finiti per vivere, non c'è economicamente più speranza?",
        "content": "",
        "upvotes": 6,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1itfmeg/non_trovo_nessun_lavoro_a_torino_e_soldi_quasi/"
    },
    {
        "id": "1itgyf8",
        "author": "Top-Text-7727",
        "title": "Posto con più NPC di Torino",
        "content": "Secondo me INS di Corso Regina Margherita ",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1itgyf8/posto_con_più_npc_di_torino/"
    },
    {
        "id": "1it25s8",
        "author": "Professional_Law28",
        "title": "Quanto sono vecchi gli alberi dei viali?",
        "content": "Sapete se c'è un sito, una mappa, un link, un qualunque ahahah per sapere quando sono stati piantati gli alberoni dei vari viali e corsi della città? \nCamminando per il mercato di corso Svizzera con mia nonna, lei mi ha chiesto da quanto potessero essere lì e sinceramente non ho saputo risponderle 😅 qualcuno può chiarirci questo dubbio? \nSu Google l'unica cosa che ho trovato è che in corso Svizzera il mercato c'è dal 1930 e già allora era alberato, ma saranno gli stessi alberi?\nGrazie a tutti",
        "upvotes": 11,
        "comments": 17,
        "media": null,
        "permalink": "/r/torino/comments/1it25s8/quanto_sono_vecchi_gli_alberi_dei_viali/"
    },
    {
        "id": "1itb5zr",
        "author": "PinoLG01",
        "title": "Dove comprare Jalapenos",
        "content": "Ciao, vorrei preparare delle ricette che prevedono gli jalapenos freschi (tipo gli jalapeno poppers) in cui difficilmente possono essere sostituiti con altro. Contando che ho girato vari supermercati e mercati rionali e non li ho mai trovati, se qualcuno li ha comprati sa indicarmi dove? Specifico che mi servono freschi e interi visto che all'esselunga li vendono in salamoia.",
        "upvotes": 1,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1itb5zr/dove_comprare_jalapenos/"
    },
    {
        "id": "1isdwbt",
        "author": "Nice_Project9383",
        "title": "Nuove amicizie a Torino (parte 2)",
        "content": "Ciao a tutti, avevo già scritto 3 mesi fa un post e da quello siamo riusciti a creare un gruppo whatsapp ed organizzare qualche uscita. Il gruppo ad oggi è composto da persone che vanno dai 20 ai 33 anni. (circa, non ricordo bene 😅).  Se qualcuno volesse aggiungersi, mi scriva in privato che gli passo il link, o comunque s qualcuno ha voglia di uscire a fare un giro sono disponibile :) \n\nAggiungo una mia breve bio, così almeno capite subito se vi sto sul cazzo 😂: ho 26 anni, mi piace andare al cinema, uscire per una chiacchierata o fare qualche gioco da tavolo (anche se ne conosco 3 in croce 🥲). Non sono un videogiocatore, ogni tanto faccio qualche partita a smash, ma non ho switch con me (e comunque sono scarso lol)",
        "upvotes": 17,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1isdwbt/nuove_amicizie_a_torino_parte_2/"
    },
    {
        "id": "1is8489",
        "author": "geralthawke",
        "title": "Cerco qualcuno che abbia voglia di venire al concerto degli Oasis con me!",
        "content": "\nCiao a tutti!\n\nSono M, ho 35 anni e vivo in Italia da 7 anni, ma vengo dal Sud-est asiatico.\n\nHo esaurito tutta la mia fortuna riuscendo a prendere due biglietti per la reunion degli Oasis, che sarà il 4 luglio a Cardiff, in Galles.\n\nInizialmente dovevo andare con un’amica, ma per motivi familiari ha dovuto rinunciare al suo biglietto.\nScrivo qui perché mi piacerebbe trovare qualcuno che ami i Gallagher tanto quanto me a Torino! \n\nSarebbe bello scambiare due chiacchiere prima di organizzare il viaggio per Cardiff insieme—giusto per capire se siamo compatibili (e che tu non sia un razzista o uno/a stronzo/a! Hahaha).\n\nIl biglietto del concerto ovviamente si paga e costa 125 euro! Poi infine, Mi piacerebbe arrivare un giorno prima e restare anche il giorno dopo, così possiamo scoprire insieme cosa ha da offrire la città!\n\nQuindi, cerco qualcuno con cui vivere il concerto al massimo, cantando insieme le loro canzoni (prima che si litighino di nuovo! Hahaha). \n\nDo la priorità a chi non ha mai visto gli Oasis dal vivo come me!\n\nGrazie mille e Live Forever! ✌🏾",
        "upvotes": 10,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1is8489/cerco_qualcuno_che_abbia_voglia_di_venire_al/"
    },
    {
        "id": "1isn0dq",
        "author": "NerveIntelligent4185",
        "title": "Dove conviene prendere casa?",
        "content": "Ciao a tutti!\n\nSono uno studente in scambio e, come molti, sto cercando un appartamento a Torino per un solo semestre. Per motivi di budget e comodità del contratto, stavo per scegliere una stanza in Lungo Dora Napoli (numero 2 sulla mappa), ma da quello che ho letto sembra che la zona non sia tra le più sicure.\n\nLe altre opzioni che sto considerando sono segnate sulla mappa. So che Porta Palazzo ha una certa reputazione, ma le zone che sto valutando sono altrettanto problematiche o ce n’è una che risulta un po’ più sicura?\n\nOgni consiglio è ben accetto. Grazie mille! 😊\n\nhttps://preview.redd.it/julmh55wkyje1.png?width=564&amp;format=png&amp;auto=webp&amp;s=4f612abc803d4ffb072e4ab16f854b7d1868a57f\n\n",
        "upvotes": 1,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1isn0dq/dove_conviene_prendere_casa/"
    },
    {
        "id": "1is0u6v",
        "author": "daenaerys97",
        "title": "Amicizie che abbiano una malattia reumatica come me 🤞",
        "content": "Ciao! Questa è decisamente una domanda strana, ma nasce da una sensazione di solitudine relativa al sentirsi poco compresi nell'essere giovani e vivere una malattia invalidante e cronica. Premessa: F 27 anni.\nHo da poco ricevuto diagnosi di spondilite anchilosante, una malattia reumatica autoimmune che danneggia varie articolazioni, muscoli, tendini e varie cose in giro per il corpo.\nPer avere questa diagnosi ho visto tantissimi medici nell'arco di più di un anno, di cui 3 reumatologi, un immunologo e 2 neurologi a Torino, ma nessuno di loro ci ha capito nulla (mi hanno fatto diagnosi sbagliate o hanno candidamente ammesso di non sapere dove mettere mani). Quindi sono dovuta andare fuori regione. È una cosa tristissima che la mia amata città, tutt'altro che terzo mondo, non abbia nessun medico competente in questa e in tutte le altre mie malattie ahahaha.\n\nDetto ciò, mi farebbe piacere conoscere (anche solo online) persone di Torino o provincia che abbiano la stessa patologia o simili (spondiloartriti e artriti sieronegative) per scambiare consigli, esperienze, sfoghi e contatti di medici magari qui in piemonte così da non dover spendere centinaia di euro per i viaggi della speranza e relativi b&amp;b, oltre ovviamente alle centinaia di euro per le visite ed esami che l'ssn non mi ha gentilmente concesso.\nPer sentirsi meno soli ma anche darsi una mano concreta.\nPS: Soffro anche di endometriosi ed altre cose, se ti va di parlare scrivimi anche solo in DM.\nCiao!",
        "upvotes": 28,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1is0u6v/amicizie_che_abbiano_una_malattia_reumatica_come/"
    },
    {
        "id": "1isk3wr",
        "author": "7seasnail",
        "title": "venerdì centralino",
        "content": "ragazzi vorrei andare venerdì 21 al centralino x la serata between, ma nessuno dei miei amici ci vuole andare, c'è qualcuno che va a cui mi posso aggregare??",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1isk3wr/venerdì_centralino/"
    },
    {
        "id": "1irq3s8",
        "author": "Lagikrus",
        "title": "Giochi da tavolo rubati",
        "content": "Ciao a tutti,\nTra venerdì sera e domenica mattina mi è stata aperta la macchina, tra corso Francia e Via Cibrario direzione piazza Statuto.\nAll'interno non avevo nulla di valore, ma una grossa busta della spesa (della LIDL, gialla) con tutti i miei giochi da tavolo che, oltre ad essere una mia passione, erano anni e anni di regali ricevuti e ci tenevo sentimentalmente.\n\nPubblico qua la lista in speranza di non so che cosa onestamente, sia mai che è stata poi buttata in giro o che qualcuno li trovi nei vari mercatini. Giusto per togliermi il pensiero di averci provato.\n\nDorfromantik\nFlamecraft\nBetrayal At house on the hill 3°edizione\nBang! Pallottolone\nNome in codice 18+\nVudhulu\nDobble\nBang! Gioco di Dadi\nWilderfeast techniques deck",
        "upvotes": 60,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1irq3s8/giochi_da_tavolo_rubati/"
    },
    {
        "id": "1irwb6c",
        "author": "art-a77ack",
        "title": "Richiesta bizzarra: nessuna firma, timbro di “Ferrua belle arti” sulla cornice, titolo “Night club”, 1975, nessun altro indizio…qualcuno riconosce il tratto di qualche pittore torinese? Ben potrebbe essere uno studente o un amatoriale. Grazie a chi saprà darmi info",
        "content": "La richiesta può apparire insolita ed improbabile… ed infatti lo è. Possiedo questa tela e vorrei capire chi ne è l’autore. Ho già chiesto a Ferrua belle arti, ma negli anni la proprietà è cambiata e pertanto non riescono a fornirmi alcuno spunto.",
        "upvotes": 13,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1irwb6c/richiesta_bizzarra_nessuna_firma_timbro_di_ferrua/"
    },
    {
        "id": "1is9wdq",
        "author": "ProgressSad6238",
        "title": "Rent apartment",
        "content": "I came to Torino for one month for internship and I want to rent apartment for one month with documentation? How to do this?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1is9wdq/rent_apartment/"
    },
    {
        "id": "1is8j5m",
        "author": "Realistic_Exam_6242",
        "title": "Kill Team a Torino",
        "content": "Ciao! Qualche giocatore di Kill Team a Torino? ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1is8j5m/kill_team_a_torino/"
    },
    {
        "id": "1irrajk",
        "author": "SonKagito",
        "title": "Buying Lavazza coffee",
        "content": "Hi,\nDoes anyone know any shops that sell lavazza coffee as i really like it and though maybe to bring like a pack (100,200 mg) with me back to my own country. I saw theres a lavazza museum but idk whether you can buy there...\nThank you !!!",
        "upvotes": 2,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1irrajk/buying_lavazza_coffee/"
    },
    {
        "id": "1irhogu",
        "author": "return0000",
        "title": "Posto bici condominiale",
        "content": "Ciao! C’è qualcuno che ha un posto bici condominiale e vorrebbe condividerlo con un totale sconosciuto (me) ?\n\nSì, se suona come richiesta stramba, lo è. Il problema è che uso la bici per andare a lavoro e nel mio condominio, da regola, non si possono tenere le bici nel cortile 😄\n\nZona: mcfit porta susa \n\nPer chi vorrebbe offrirsi sentiamoci in PM per non dare ai quattro venti più info\n\nGrazie!",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1irhogu/posto_bici_condominiale/"
    },
    {
        "id": "1irh2un",
        "author": "InnamoratoPazzo",
        "title": "Via Giordano Bruno - rumore treni",
        "content": "Ciao a tutti, \n\nnella mia estenuante ricerca di una nuova casa in affitto sto valutando una soluzione all'inizio di via Giordano Bruno. \n\nLa casa mia piace molto, costa un po' cara rispetto al mio budget ma sono fortemente tentato di prenderla, perché sto cercando una casa dove passare 4 anni sapendo di poterci stare bene. \n\nC'è però una questione su cui non sono del tutto convinto: la casa affaccia proprio su via Bruno, che è vicinissima ai binari del treno della linea Lingotto - Porta Nuova. L'agente dice che grazie ad infissi ecc non si sente nulla, ma può essere davvero così? I binari mi sembrano troppo vicini per non sentire nulla. Poi con la finestre aperte d'estate il rumore lo do per certo, ma fortunatamente la casa ha l'aria condizionata quindi di notte non avrei bisogno di tenere aperto.\n\nC'è qualcuno che ha esperienza di quella zona che potrebbe darmi qualche consiglio?\n\nGrazie",
        "upvotes": 4,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1irh2un/via_giordano_bruno_rumore_treni/"
    },
    {
        "id": "1irgs4j",
        "author": "JimmyAngel5",
        "title": "Graduatoria Professioni Sanitarie 2024 Torino",
        "content": "Buongiorno,\n\nCome da titolo, vorrei recuperare la graduatoria dell'anno scorso di UNITO per conoscere il punteggio minimo per entrare a fisioterapia. \n\nSul sito dell'Università riesco a trovare solamente il bando, mentre la graduatoria non è più disponibile.\n\nQualcuno per caso che ha partecipato o è entrato potrebbe aiutarmi? \n\nGrazie! ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1irgs4j/graduatoria_professioni_sanitarie_2024_torino/"
    },
    {
        "id": "1irfrf3",
        "author": "Formal_Health_3674",
        "title": "Are There Chances of Admission in the Second Call for Master's Applications?",
        "content": "Hey everyone,\n\nI'm planning to apply for a Master's program in POLITO during the second call (or second round) of applications. I was wondering if anyone has experience with this—are the chances of getting in significantly lower compared to the first call?\n\nSome universities mention that fewer spots are available in later rounds, but I’m curious to know if anyone has successfully gotten in or if it’s generally much harder. Also, do funding opportunities and scholarships become more limited?\n\nWould love to hear your thoughts and experiences. Thanks!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1irfrf3/are_there_chances_of_admission_in_the_second_call/"
    },
    {
        "id": "1irfnkj",
        "author": "alikocbaskan",
        "title": "Trams",
        "content": "I dont know if its just me but since saturday trams feel significantly faster to me (10,15,16) is  \nit possible gtt pushed boundaries to keep up with demand or im just having a psyhcosis?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1irfnkj/trams/"
    }
]