[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1o8cfa4",
        "author": "RoutineCherry3027",
        "title": "first day in torino",
        "content": "",
        "upvotes": 511,
        "comments": 49,
        "media": null,
        "permalink": "/r/torino/comments/1o8cfa4/first_day_in_torino/"
    },
    {
        "id": "1o8wf41",
        "author": "Bruno_Barbiere",
        "title": "Si sta finalmente prendendo provvedimenti verso il modello Airbnb spietato? Non lo so Rick, mi sembra falso... Voi che dite?",
        "content": "",
        "upvotes": 14,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/z4o807wp1nvf1.png?auto=webp&amp;s=c6e46cabc718af5231100482873cb0e5bcbea5d6"
        },
        "permalink": "/r/torino/comments/1o8wf41/si_sta_finalmente_prendendo_provvedimenti_verso/"
    },
    {
        "id": "1o8yva6",
        "author": "PolThePine",
        "title": "Odore persistente di \"bruciato\" in vanchiglietta, da dove arriva?",
        "content": "Buongiorno a tutti gli abitanti di Torino, vivo in vanchiglietta ormai da un anno e non ho potuto fare a meno di notare che spesso entrando in vanchiglietta o uscendo di casa io trovi un odore di bruciato non piacevolissimo, l'odore è sempre lo stesso, un po' acidulo e forse dolciastro e affumicato.\n\nNon mi sono ancora messo a segnarmi i giorni e gli orari in cui lo sento, né ho la più pallida idea di cosa possa causarlo, mi chiedevo però se qualcuno qui ne sapesse qualcosa.\n",
        "upvotes": 7,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gjzt2veprnvf1.jpeg?auto=webp&amp;s=462858df6d858c8fc935e8f30337b06a9dbab024"
        },
        "permalink": "/r/torino/comments/1o8yva6/odore_persistente_di_bruciato_in_vanchiglietta_da/"
    },
    {
        "id": "1o978k4",
        "author": "TM_NewJob",
        "title": "Cercasi persone con cui giocare a pallavolo",
        "content": "Ciaooo a tutti, mi sono trasferito da poco a torino e vorrei giocare un po’ a pallavolo, senza iscrivermi da qualche parte. C’è qualcuno con cui poter giocare partite affittando campi o giocando così giusto per? Anche sapere solo le basi può andare più che bene. ^^",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o978k4/cercasi_persone_con_cui_giocare_a_pallavolo/"
    },
    {
        "id": "1o96rmk",
        "author": "lauraddd16",
        "title": "Here for Techno Party, need help :)",
        "content": "Hi, tourist staying here for the weekend. Any idea where I could buy some stuff to party? Any plugs available? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o96rmk/here_for_techno_party_need_help/"
    },
    {
        "id": "1o8x0hp",
        "author": "blub_bub",
        "title": "Attraversare Barriera con Gtt per lavoro. Quanto è sicuro la sera?",
        "content": "Ho ricevuto un’offerta di lavoro che si troverebbe nei pressi di Piazza Derna, tra corso Giulio Cesare e Corso Vercelli, e per raggiungerlo dovrei attraversare tutta Barriera di Milano con i mezzi. Le linee per me comode sono il 18 (con qualche minuto a piedi) e il 4.\n\nLa domanda sorge perché potrei avere turni di apertura dalle 7.00 e/o turni di chiusura fino alle 23.00. Sia weekend che giorni feriali.\n\nBarriera non l’ho mai frequentata e volevo sapere se per una ragazza sulla ventina queste linee potessero essere così pericolose come fanno passare i notiziari, sopratutto la sera. Inoltre vorrei sapere quante volte potrebbero capitare situazioni spiacevoli causate dai ritardi di GTT in quella zona (tipo rimanere a piedi la sera).\n\nRingrazio di cuore per chi risponderà!",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1o8x0hp/attraversare_barriera_con_gtt_per_lavoro_quanto_è/"
    },
    {
        "id": "1o9182t",
        "author": "Aggravating_Team5186",
        "title": "primo lavoro",
        "content": "Ciao, vengo dal Brasile e ho già la cittadinanza italiana. Andrò a vivere a Torino in una stanza e ho soldi per otto mesi.\n\nLa mia conoscenza della lingua è base e ho 36 anni.\n\nChe tipo di lavoro è più comune per chi arriva senza esperienza in nessuna funzione ma vorrebbe lavorare il più velocemente possibile?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o9182t/primo_lavoro/"
    },
    {
        "id": "1o904j3",
        "author": "ladythemacbeth",
        "title": "Tennis practice wall",
        "content": "Hello, can anyone recommend a tennis practice wall in the city? I currently don’t have a partner and I want to practice by myself until I find one but couldn’t find any practice walls via research. So, any help would be appreciated, thanks! ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o904j3/tennis_practice_wall/"
    },
    {
        "id": "1o8zv07",
        "author": "Odd-Carrot-998",
        "title": "Is my SAT score enough to apply Politecnico di Torino?",
        "content": "Currently I have a score of 1300 on SAT(600 in English/700 in Math). So I was wondering if it is enough to apply to mechanical engineering in Politecnico di Torino. I couldn't find the exact SAT requirements from the website so im clueless if I should take another SAT exam. Other than SAT my IELTS score is 8.0 so im not really worried about that part, but I would appreciate it if someone can inform me.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1o8zv07/is_my_sat_score_enough_to_apply_politecnico_di/"
    },
    {
        "id": "1o8xqhy",
        "author": "Motor-Upstairs6089",
        "title": "Bazar cinesi",
        "content": "Ciao a tutti, abito in zona porta susa e siccome ho difficolta a trovare negozi bazar cinesi (che vendano un po di tutto insomma) nelle vicinanze, volevo chiedervi se sapete indicarmene uno (raggiungibile anche in metro nelle fermate vicine). Avrei bisogno di un tritaspezie/grinder/macinino. \n\n\nGrazie in anticipo",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1o8xqhy/bazar_cinesi/"
    },
    {
        "id": "1o8wbki",
        "author": "Available-Bridge-280",
        "title": "Cerco calcetto (5 o 8) zona Politecnico/Borgo San Paolo/Santa Rita/Cit Turin – Torino Ovest",
        "content": "Ciao! Sto cercando partite di calcetto (5 o 8) nel lato ovest di Torino: Politecnico, Borgo San Paolo, Santa Rita, Cit Turin.  \nHo provato Fubles, ma al momento non trovo molto.   \n  \nSe organizzate o partecipate e vi manca qualcuno per fare numero, scrivetemi in privato: vi lascio volentieri il mio numero.  \n  \nDisponibile la sera e nel weekend. \n\nGrazie!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o8wbki/cerco_calcetto_5_o_8_zona_politecnicoborgo_san/"
    },
    {
        "id": "1o8w7vd",
        "author": "Green_Engineer1631",
        "title": "Opinioni su Aurora, Barriera di Milano, Regio Parco e San Donato per acquisto appartamento",
        "content": "Ciao a tutti,\n\nsto valutando l’acquisto di un appartamento a Torino e ho visto diverse opzioni nelle zone di **Aurora, Barriera di Milano, Regio Parco e San Donato**.\n\nVorrei chiedere alla community:\n\n* Com’è la vita quotidiana in questi quartieri (servizi, sicurezza, collegamenti, atmosfera)?\n* C’è qualcuno che abita già lì e può condividere un’esperienza diretta?\n* Avete avuto esperienze (positive o negative) con agenzie immobiliari a Torino? Quali consigliereste o sconsigliereste?\n\nOgni consiglio o opinione personale è super benvenuto. 🙏 Grazie mille in anticipo!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o8w7vd/opinioni_su_aurora_barriera_di_milano_regio_parco/"
    },
    {
        "id": "1o8vqqr",
        "author": "_L_-",
        "title": "Massaggi muscolari",
        "content": "Sapete consigliarmi un posto per massaggi muscolari a non troppo? \n\nNo happy ending o cazzate ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o8vqqr/massaggi_muscolari/"
    },
    {
        "id": "1o80g60",
        "author": "AbbiAbbiDoo",
        "title": "Vi è già capitato di prendere il bus con guida autonoma senza conducente? Com'è stata l'esperienza? Pensate cambierà in meglio o in peggio il trasporto pubblico torinese?",
        "content": "",
        "upvotes": 35,
        "comments": 86,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/68v6b66omfvf1.png?auto=webp&amp;s=ce25dfb29ffaf0a30baed26493bf1769d7673058"
        },
        "permalink": "/r/torino/comments/1o80g60/vi_è_già_capitato_di_prendere_il_bus_con_guida/"
    },
    {
        "id": "1o8yyun",
        "author": "Practical_Tune_1505",
        "title": "Alloggi mini per 2 euro all'ora a Torino",
        "content": "Ciao a tutti, stavo pensando ad un nuovo progetto di business e mi farebbe piacere sapere la vostra. Tempo fa, mentre cercavo una stanza in cui dormire a Torino, mi sono accorto dei prezzi esorbitanti per un alloggio. Non voglio vivere in un dormitorio con altre persone, ma la stanza singola più economica che ho trovato era a 60 euro. Così mi è venuta un'idea: degli alloggi mini a 15 ore a notte. Sarebbero degli alloggi 3 metri x 3 con all'interno solo:\n-1 letto a livello suolo\n-1 presa elettrica\n-1 interruttore per accendere e spegnere la luce\n\nIn teoria stavo pensando di affittare queste camere per 2 euro all'ora. \n\nI costi fissi di manutenzione sarebbero molto esigui. Sarebbe bello costruire degli alloggi simili vicino stazioni e aereoporti.. cosa ne pesante?",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1o8yyun/alloggi_mini_per_2_euro_allora_a_torino/"
    },
    {
        "id": "1o87eq0",
        "author": "Organic-Log9485",
        "title": "Just moved to Torino, need advice",
        "content": "As the title says, I just moved to Torino for several months and don't speak Italian yet. I am 28 years old and my apartment is in Cenisia. I would need some help with settling in and since I don't have any friends here I'm turning my hopes to internet strangers. So I have some questions:\n\n1. How do I get internet in my apartment? I had a look online and wanted to use Fastweb but they require italian phone number, is there any way to get internet connection without getting an italian number? If no, what is the cheapest provider? I will use SIM card from my home country so I only need it to be able to setup my internet so the cheapest possible option will be enough.\n\n2. I will need to travel to work to Rivoli, where do I go to buy monthly pass for public transport? What do I need to bring?\n\n3. Is Cenisia safe? I am thinking about bringing my car here next time I go home and wonder if it is safe to park on the streets with foreign license plate or not. If not I might have to look for a garage to rent but that means more expenses.\n\n4. Where is the best place to buy home essentials like pillows, blankets, mattress covers, etc..\n\n5. Where could I buy some cheap furniture, I'm fine with buying used, I'm just wondering if there is a cheaper way to get some than ikea.\n\nThanks a lot for any help and advice\n ",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1o87eq0/just_moved_to_torino_need_advice/"
    },
    {
        "id": "1o8ifp6",
        "author": "AlternativeRace2501",
        "title": "Piazza sabotino o zona le panche?",
        "content": "La domanda è: dove preferireste vivere? \n\n",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1o8ifp6/piazza_sabotino_o_zona_le_panche/"
    },
    {
        "id": "1o8fsqq",
        "author": "Astanxzy420",
        "title": "Sale per feste private in città?",
        "content": "Io e il mio gruppetto di amici, tutti universitari, stiamo cercando sale o piccole venue per organizzare una festa tra di noi(una cinquantina di persone), in tranquillità, con un po' di musica e belle vibes per halloween, abbiamo contattato la maggior parte dei risultati su Google senza successo, avete conoscenze di location che affittano salette o cose simili? Possibilmente rimanendo in città(metà di noi sta al poli e l'altra metà a vanchiglia) \n\nGrazie in anticipo :)\n\n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o8fsqq/sale_per_feste_private_in_città/"
    },
    {
        "id": "1o84v8s",
        "author": "Kokabiele",
        "title": "Aiuto affitto Torino",
        "content": "Buongiorno a tutti sto attualmente cercando affitto a Torino per motivi lavorativi (avrò un contratto a tempo indeterminato) spero che qualcuno possa aiutarmi in questa mia ricerca, inoltre mi sono imbattuto in certe \"agenzie\" che non si dichiarano tali ma più come dei mediatori che richiedono dei soldi per poter essere messi in contatto con il proprietario, volevo sapere se sono tutte truffe o se alcune di queste realtà sono davvero funzionali",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1o84v8s/aiuto_affitto_torino/"
    },
    {
        "id": "1o8bj7s",
        "author": "pizza-ai-funghi",
        "title": "Mezzi pubblici la sera",
        "content": "Settimana prossima sarò a Torino per un paio di giorni. Arriverò in stazione Torino Porta Nuova intorno alle 22 e dovrò raggiungere l'albergo in zona Stadio Juventus. \nNon conosco per niente la città, ho visto che a quell'ora la metropolitana sarà già chiusa. Ho visto che c'è un bus sostitutivo, é affidabile? Sapete darmi soluzioni migliori, o é meglio prendere direttamente un taxi?\n",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1o8bj7s/mezzi_pubblici_la_sera/"
    },
    {
        "id": "1o8ap20",
        "author": "guigbd",
        "title": "Events for Expat students in Turin",
        "content": "Hey pirates!\n\nSome of you already know me, but for those who don’t — here’s a quick intro. I’m one of the organizers at **TripMatch**, where we host events, workshops, and fun activities for newly arrived students.\n\n\n\nNext week, on **October 23rd**, we’re organizing an event designed to help students who are finishing or have just finished their studies find a job. We know it’s not easy to stand out among the hundreds of new graduates each year.\n\n\n\nThat’s where **personal branding** comes into play — it’s the authentic and consistent perception of who you are and the value you bring, and it’s what makes you stand out in a world where people choose *who you are* before *what you do*. It’s the key to making your résumé rise above the hundreds that companies receive every day.\n\n\n\nWe’ve invited **Mattia Morgut** to lead a workshop on how to leverage **AI** to build your personal brand on **LinkedIn**.\n\nThe event will be divided into three parts: an introductory theory session, a hands-on practice session where we’ll apply what we’ve learned together, and finally, an **Italian-style aperitivo**, because learning is great — but so are relaxed moments shared together.\n\n\n\nYou’ll find all the event links in the first comment!\n\nHope to see many of you there.\n\n\n\nSee you soon!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o8ap20/events_for_expat_students_in_turin/"
    },
    {
        "id": "1o83fg6",
        "author": "BoldJaguar99",
        "title": "Tessera BIP GTT",
        "content": "Salve a tutti,  \ndovrei acquistare la tessera BIP per sottoscrivere un abbonamento mensile. Non risiedo a Torino e, da quanto ho capito, l’unico modo per ottenerla è recarmi presso il Centro Servizi Clienti GTT di Porta Nuova.\n\nAlcune domande: \n\n1. Sarà disponibile davvero dopo 3 gg lavorativi? Dovrei salire per un giorno a Torino settimana prossima, e vorrei sapere se acquistandola oggi sarà disponibile davvero per mercoledì circa.\n2. Bisogna prendere appuntamento o è sufficiente presentarsi direttamente al centro? Sul sito dice senza appuntamento, ma non so se fidarmi.\n\n",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1o83fg6/tessera_bip_gtt/"
    },
    {
        "id": "1o7bqyy",
        "author": "Iaco_V8",
        "title": "Qualcuno di voi sa cosa sono questi \"cerchi di vetro\" in via Pietro Micca?",
        "content": "Passo spesso sotto i portici di via Pietro Micca e noto che molti bambini saltano sopra questi cerchi di vetro per divertimento. \nOra sono curioso di sapere cosa siano esattamente",
        "upvotes": 65,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/y05iouwg7avf1.jpeg?auto=webp&amp;s=deee826dcf109ba813be2c74e0777913377b8ec2"
        },
        "permalink": "/r/torino/comments/1o7bqyy/qualcuno_di_voi_sa_cosa_sono_questi_cerchi_di/"
    },
    {
        "id": "1o7z3ld",
        "author": "redproteico",
        "title": "Pareri su isef di piazza Bernini",
        "content": "Come da titolo, ci passo spesso e ho sempre notato il centro isef in piazza Bernini e dato che al momento cerco palestre in zona san paolo/cit turin mi chiedevo come fosse realmente all'interno, perché non conosco nessuno che lo ha frequentato.\nSarei interessato alla sala pesi o al limite al training boxe se ben strutturato, però sul sito non riesco a capire i prezzi e se può convenire o meno?\n\nQualcuno di voi saprebbe darmi qualche info a proposito?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o7z3ld/pareri_su_isef_di_piazza_bernini/"
    },
    {
        "id": "1o83wdx",
        "author": "illumence",
        "title": "Hiking near Torino in late October",
        "content": "Hello everyone! I'm visiting Turin from October 28 to November 2 and would love to do some hiking. I’m looking for scenic trails with mountain views, reachable by train or bus from Turin (1–1.5 hours away). Ideally, they should be short (up to 10–12 km) and doable in late October/early November. Thanks in advance!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o83wdx/hiking_near_torino_in_late_october/"
    },
    {
        "id": "1o83al6",
        "author": "rinorii1",
        "title": "Torino Visit Once Again",
        "content": "Hi guys, I am planning to visit Torino around December (beginning), and this will be my third time visiting in 2 years. My visit will be short, around 2 days (weekend,) but just looking for anything fun or any good places I have missed visiting.\n\nI have been around mostly all the museums in the city, visited Superga and Venaria, so I would love any new recommendations. The only museum I have missed is Officina della Scrittura, but it looks like it's closed on weekends.\n\nSince it is around Christmas time, maybe there is a new activity to do. Though just wandering around the city is totally okay, as I love Torino.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1o83al6/torino_visit_once_again/"
    },
    {
        "id": "1o7pxiz",
        "author": "sugar_kookie",
        "title": "Redditors di Torino, ma una camera ad ore no?",
        "content": "Vi prego qualcuno me ne consigli una a bassi prezzi pls :)",
        "upvotes": 7,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1o7pxiz/redditors_di_torino_ma_una_camera_ad_ore_no/"
    },
    {
        "id": "1o758xb",
        "author": "Bruno_Barbiere",
        "title": "Ma è vero che la situazione al Bar Casablanca è diventata così ingestibile? Qualcuno ha avuto esperienze lì?",
        "content": "",
        "upvotes": 25,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ygzhan2ci8vf1.jpeg?auto=webp&amp;s=8b8d46044ec724abc4bf2fb856b97ac6ad6c5845"
        },
        "permalink": "/r/torino/comments/1o758xb/ma_è_vero_che_la_situazione_al_bar_casablanca_è/"
    }
]