[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1ojz3ig",
        "author": "darth_vader39",
        "title": "Stranger Things 5 | Official Trailer | Netflix",
        "content": "",
        "upvotes": 119,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1ojz3ig/stranger_things_5_official_trailer_netflix/"
    },
    {
        "id": "1ojzvfb",
        "author": "Nook_6",
        "title": "Go watch Dark (no spoilers)",
        "content": "I don’t know what you’re watching right now, but Dark *must* be the next thing. \n\nOne of the best things I’ve seen on screen in my life. \n\nCome prepared for an epic and unbelievable ride, and concentrate. It’s a complicated series with exactly zero comic reliefs.\n\nI will not say anything in case I make spoilers.\nYou will not regret this, trust me.",
        "upvotes": 82,
        "comments": 73,
        "media": null,
        "permalink": "/r/netflix/comments/1ojzvfb/go_watch_dark_no_spoilers/"
    },
    {
        "id": "1ok41d3",
        "author": "Sweet_Background362",
        "title": "Midnight mass worth watching?",
        "content": "Sister said it was a vampire show. Did she spoil it for me, or is this show worth watching? I’ve watched hill house, which was amazing, and the fall of user. \n\nPlease don’t spoil the show ",
        "upvotes": 15,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1ok41d3/midnight_mass_worth_watching/"
    },
    {
        "id": "1ok3rk0",
        "author": "CosmicCricket13",
        "title": "Watching Lupin makes me want to learn how to disappear from the internet too",
        "content": "I started watching Lupin again and forgot how GOOD it is!! Assane is just so calm and clever, always thinking five steps ahead without breaking a sweat. He doesn’t fight his way out of trouble, he just outsmarts everyone. One second he’s a janitor, the next he’s walking out like a millionaire, and nobody even realizes what happened.  \nWhat I love most is how he uses information. It’s not about hacking or gadgets, it’s about reading people, noticing the small things, knowing how systems work. He uses the kind of details most of us give away every day without thinking twice. That’s what makes it feel so real.\n\nIt kind of made me think about how hard it is to stay invisible in real life now. Cameras everywhere, online tracking, data leaks all the time. He’s changing disguises and I’m just trying to figure out how to stop apps from following me around. Privacy feels like the real superpower now.  \nAnyway, I loved this season and I’m curious if others did too. Did you like how they wrapped things up? Or did it feel a little too over the top?",
        "upvotes": 14,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1ok3rk0/watching_lupin_makes_me_want_to_learn_how_to/"
    },
    {
        "id": "1ojz6n9",
        "author": "Neurotoxin23",
        "title": "Closed captions",
        "content": "While watching the Witcher Season 4 episode 2 I started getting closed captions that I cannot turn off.  \nAudio is set to English \\[Original\\] and subtitles are OFF.\n\nDoesnt anyone know how to get rid of them?",
        "upvotes": 13,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1ojz6n9/closed_captions/"
    },
    {
        "id": "1ok4kl1",
        "author": "Dave_B001",
        "title": "Losing interest in originally great series.",
        "content": "Hey everyone, is anyone else like me losing interest in once amazingly fun Netflix shows over their wild release schedules?\n\nThe two that have annoyed me the most are Stranger Things and Cobra Kai. their releases and mini series are all over the place. Even Wednesday being split randomly into two. Just release it weekly. \n\nI jus hope we don't have to wait so long for ONE PIECE Series 3 part 4. over 6 years. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ok4kl1/losing_interest_in_originally_great_series/"
    },
    {
        "id": "1oj9qs2",
        "author": "Independent-One-5164",
        "title": "what are some docs like dont fck with cats?",
        "content": "i am looking for some really disturbing docs from netflix.. i am curious person  and i am looking for docs. or even movies,...  can someone suggest me some true crime docs? i would really appreciate it ",
        "upvotes": 146,
        "comments": 212,
        "media": null,
        "permalink": "/r/netflix/comments/1oj9qs2/what_are_some_docs_like_dont_fck_with_cats/"
    },
    {
        "id": "1ok4u3g",
        "author": "No_Bar_8333",
        "title": "What’s the obsession with ending every show after 4–5 seasons?",
        "content": "Lately, it feels like every new TV or Netflix show barely makes it past season 5 — even the good ones.\nI keep wondering why that is.\n\nWhat happened to the long-running series era? Shows like Two and a Half Men, The Big Bang Theory, How I Met Your Mother, Friends, The Office, etc. all ran for 8, 9, even 12 seasons.\n\nNow it feels like writers and studios purposely wrap things up early — either because of budgets, viewership drops, or fear of “dragging it out.”\nBut honestly, some stories deserve more time to grow.\n\nIs it a creative choice? A streaming-era issue?\nOr did long-running sitcoms just belong to another time?\n\nCurious what everyone thinks — are shorter runs better storytelling, or do you miss the 9+ season classics too?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ok4u3g/whats_the_obsession_with_ending_every_show_after/"
    },
    {
        "id": "1ok4i1e",
        "author": "Melodic_Elephant9130",
        "title": "Is Sony the New Disney?",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ok4i1e/is_sony_the_new_disney/"
    },
    {
        "id": "1oja4nx",
        "author": "Objective-Move25",
        "title": "Drop your comfort shows.",
        "content": "The title, please drop your comfort shows. I can never re-watch something no matter how much I love it, so I'm running out of shows here, and I could use some easy to watch comfort shows for the fall and winter. I usually go for Killing Eve (not on Netflix), Brooklyn Nine Nine, The Lincoln Lawyer, sometimes Gilmore Girls, then stop after 3-5 minutes cause I can quote them line to line from the first watch. Up for new suggestions, give me anything.",
        "upvotes": 69,
        "comments": 256,
        "media": null,
        "permalink": "/r/netflix/comments/1oja4nx/drop_your_comfort_shows/"
    },
    {
        "id": "1ojoxrb",
        "author": "MsSamm",
        "title": "Nailed It! should be a permanent Netflix staple.",
        "content": "Somehow I found Nailed It episodes I hadn't seen. I laugh so much at this show that my face hurts. They need to bring it back with the full cast. Too much Nailed It! is never enough",
        "upvotes": 9,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ojoxrb/nailed_it_should_be_a_permanent_netflix_staple/"
    },
    {
        "id": "1ok1dmi",
        "author": "gobbolin_",
        "title": "Unknown Number: The Small Town Of It All",
        "content": "A lot of people have discussed this documentary already, but I just got around to watching it. Aside from all the insane criminal activity, I think people ignore the behaviour of other people in the documentary because they do not know what it was like to live in a small town and the type of behaviours that arise.\n\n\nFirst of all, any speculation that Lauryn was involved clearly comes from this weird ingroup thing small towns do. You're telling me that in the opening of the documentary they talk about how everyone knows everyone but Lauryn isn't invited to this huge annual Halloween party?\n\n\nSpeaking more on the party, it was a party for children and adults which is strange, and Lauryn was in grade eight or maybe even grade seven when she wasn't invited. That's just disturbing.\n\n\nIn the documentary we hear testimony from Khloe and Khloe's friends and Owen and all their parents and it seems to me that they are a very weird type of clique that is never fully acknowledged. They say everyone knows everyone, imply Lauryn is a vapid sociopath with no emotion, and deny bullying some other girl.\n\n\n\nWhen we hear from Lauryn and Owen's cousin, we can see that they are more reserved and in the cousins case not as conventionally attractive. I feel like the culture of this town was brushed over. I grew up in a small town myself and everything was an exact dead ringer for what I experienced.\n\n\nA final anecdote: there is no way Lauryn has recovered from this situation. She was already \"weird\" to these people and this is just another thing they're going to pin on her and alienate her for. I truly hope she can move somewhere else and live a happier life.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ok1dmi/unknown_number_the_small_town_of_it_all/"
    },
    {
        "id": "1ojzmpz",
        "author": "sadox55",
        "title": "Subtitles for other languages in movies?",
        "content": "Why many Netflix movies when they speak another language, the subtitles don't translate that language into english?\n\nI have noticed that happdning in movies and even series where they speak sometimes russian or french in an english movie and the subtitles don't translate what they are saying. \n\nIs this an oversight from Netflix? Was it intended?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ojzmpz/subtitles_for_other_languages_in_movies/"
    },
    {
        "id": "1ojd0qc",
        "author": "neoprenewedgie",
        "title": "Plot question for House of Dynamite (not about the ending, spoilers inside)",
        "content": "&gt;!Why was the president pressured to make an immediate decision about a counter-strike?!&lt;\n\nI learned everything about Global Thermo Nuclear War from that great 80s documentary, War Games. The counter-strike dilemma was that if the US didn't launch its own nuclear weapons, the missile silos would be destroyed by the incoming attack. In House of Dynamite, that is not an issue. There was only one incoming missile, which might malfunction. The president still had no idea who launched the attack. And even if Chicago got nuked, the president would still have the full arsenal of missiles to launch 15 minutes later, an hour later, or two days later.\n\nIt felt like it was an artificial and unnecessary deadline to create tension, but maybe I missed something that explained it. If this was Independence Day I would just brush it off but Dynamite is (generally) a smart film. Any insights?",
        "upvotes": 23,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1ojd0qc/plot_question_for_house_of_dynamite_not_about_the/"
    },
    {
        "id": "1oiuegs",
        "author": "Action_Jackson_777",
        "title": "A House of Dynamite…🤦🏻",
        "content": "What are we doing here honestly? When you really sit back and think about it, this was a movie about nothing. No it is not a psychological, open-ended thriller that is meant to leave you guessing and interpret your own meaning. We didn’t need that many angles, that many countdowns and that many different perspectives. To each their own but the entire time I was DYING to know who sent the missile and what the appropriate response would be. We were given none of this. It’s like eating your veggies expecting a steak will come later and then it never comes. I don’t know about you but a movie like this is essentially pointless if we don’t at least get some sort of simulation as to what would happen next. Not to mention, they never even actually confirmed or denied that the missile made impact! What?!? This movie was all suspense, all buildup and no drop. Disagree all you want, after all it’s just an opinion but this left me dissatisfied and disappointed. 👎🏻",
        "upvotes": 381,
        "comments": 378,
        "media": null,
        "permalink": "/r/netflix/comments/1oiuegs/a_house_of_dynamite/"
    },
    {
        "id": "1ojxafr",
        "author": "CanElectrical4016",
        "title": "Old 2015-2018 serie",
        "content": "Hey guys, does anyone remember an old show that took place around 10 years ago, I remember as about two brothers, one who hated the animals and the second one which had a pet gorilla and his whole animal protection organization, does anyone remember something about it??",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ojxafr/old_20152018_serie/"
    },
    {
        "id": "1ojwhtu",
        "author": "Sufficient-Curve2951",
        "title": "What do we think about this latest recasting in Running Point Season 2? I think Isla is in good hands in S2",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ojwhtu/what_do_we_think_about_this_latest_recasting_in/"
    },
    {
        "id": "1ojw6x0",
        "author": "Specialist-Change-86",
        "title": "While it doesn't look interesting I do love the filming locations",
        "content": "While I am not a fan of the recasting, I do love the locations where the fourth season was filmed:\n\n[https://www.soapcentral.com/shows/where-the-witcher-season-4-shot-revisiting-key-filming-locations-netflix-fantasy-series-latest-chapter](https://www.soapcentral.com/shows/where-the-witcher-season-4-shot-revisiting-key-filming-locations-netflix-fantasy-series-latest-chapter)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ojw6x0/while_it_doesnt_look_interesting_i_do_love_the/"
    },
    {
        "id": "1oj46rl",
        "author": "GRILT_CHEESE",
        "title": "The Asset on Netflix, really enjoyed this, it's a Danish crime thriller",
        "content": "The Asset , Danish title is Legenden and it was released just the other day,  I binged the whole thing\n\nWhen I say crime thriller, there's not a lot of violence or anything, but it's about an undercover cop who poses as a jeweler to befriend the rich wife of a big drug dealer and then it goes from there. It's well-acted, well-shot, good production values, and you get a full story from 6 episodes with a nice pathway for a season 2 at the very end.\n\nHighly recommend it!",
        "upvotes": 44,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1oj46rl/the_asset_on_netflix_really_enjoyed_this_its_a/"
    },
    {
        "id": "1ojhxs5",
        "author": "Embarrassed_Dish_672",
        "title": "Looking for something good to binge watch !",
        "content": "I’m looking for something to binge I loved orange is the new black shameless workin moms good girls dead to me Ginny and Georgia never have I ever  … etc lol those are my all time favs .. what is just as good !? ty!!! ",
        "upvotes": 6,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1ojhxs5/looking_for_something_good_to_binge_watch/"
    },
    {
        "id": "1ojlzm7",
        "author": "PossibleFlamingo3269",
        "title": "What shows/movies are unavailable with the ads plan? (US)",
        "content": "Looking to change my Netflix plan, and thinking about the cheapest option, but it says some content might be locked. Can I get some examples about what’s locked? I’m in the US. ",
        "upvotes": 5,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ojlzm7/what_showsmovies_are_unavailable_with_the_ads/"
    },
    {
        "id": "1ojtz26",
        "author": "ventinove_dodici",
        "title": "Sense 8",
        "content": "After several years I am reviewing Sense8. To be honest, the first time I saw it I wasn't thrilled. Too full of intertwining stories and an initial mystery that stuck with me because I didn't know how to place it in the unfolding plot. That feeling is still there but I remain impressed by how our life can itself be a sense 8 because I have often wanted to see people from the past again, I wanted them to manifest themselves and live a moment of my life with me.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ojtz26/sense_8/"
    },
    {
        "id": "1ojq9w3",
        "author": "hybrid889",
        "title": "PC streaming issues chrome\\netflix video pauses and audio continues to play",
        "content": "9950x3d, 5080, 64gb of ram, hardware isn't the issue afaik, new build, no other issues other than this one. Fresh install of windows.  \nMultiple monitor set up, I have chrome running with netflix, periodically, could be in 5m or 50m, the video will freeze and audio keeps playing, after 10-20s all 3 monitors go black for a second and come back and i have to refresh the chrome tab with netflix to get it to play again. This ONLY happens with netflix, not hulu, peacock, etc.\n\nIs this just a netflix bug, I can't imagine i'm the only one here. No issues playing graphic demanding games, no issues with GPU that I'm aware of. I've installed multiple version of and latest graphic drivers. I'm ready to just unsubscribe to netflix.\n\nI do have hardware acceleration turned on in Chrome, don't really want to turn it off, everything performs better and more fluid with it on.\n\nAnyone else run into this and know how to fix it?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ojq9w3/pc_streaming_issues_chromenetflix_video_pauses/"
    },
    {
        "id": "1ojzpv9",
        "author": "wiredmagazine",
        "title": "If You Hated ‘A House of Dynamite,’ Watch This Classic Nuclear Thriller Instead",
        "content": "",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1ojzpv9/if_you_hated_a_house_of_dynamite_watch_this/"
    },
    {
        "id": "1ojr9df",
        "author": "WelcomeEven567",
        "title": "Taken in Plain Sight - how is this on the top 10 movies?!",
        "content": "I felt like the movie was very fact paced and the acting was not very good. The mother constantly looks distressed, which made the acting seem even more inauthentic. I saw the ending coming from a mile away and it was very anti-climactic.. she struggles with the kidnapper for not even a minute before running off to the kids. Also, i felt we didn’t get much of an explanation at the end. i had high expectation for this movie after seeing it reach #3 for the top 10 movies but it was just a disappointment. all in all, the movie had mediocre acting (at best) and the storyline just wasn’t great. it never deserved to be in the top 10 movies.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ojr9df/taken_in_plain_sight_how_is_this_on_the_top_10/"
    },
    {
        "id": "1ojp6ll",
        "author": "Gloomy_Key_7320",
        "title": "is the mobile subscription (480p) good for netflix? or is the quality bad?",
        "content": "im planning to buy the mobile subscription for netflix tho the resolution is 480p. so idk if i should get that one or not. its the cheapest one and im thw only one who will be using it ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ojp6ll/is_the_mobile_subscription_480p_good_for_netflix/"
    },
    {
        "id": "1ojyrt1",
        "author": "McGrufNStuf",
        "title": "House of Dynamite….definitely better than War of the Worlds remake…",
        "content": "So I made a comment on the post that called this movie “The worst produced movie ever” that mildly blew up. Instead of responding to that comment, I figured I’d might as well post my feedback now that I’ve watched it. \n\nI enjoyed House of Dynamite. I thought it was one of the more entertaining movies of this year. I can definitely see why some wouldn’t but I did. I watch a movie with two things in mind. (1) Is it entertaining? (2) Is it good?\n\nI’ve watched many movies that were entertaining but not good and many that were really good but not very entertaining. I thought it was definitely entertaining. I loved the dynamic changes in how each primary group handled the tension in this three acts. I thought a couple of the performances were just standout performances a the overall cast was really good. I liked how the whole movie happens on some random day without a cinematic or “blockbuster” type build up feel. \n\nIs it good? Idk yet. I’ll need another rewatch. For those unaware, our nuclear arsenal (and supporting infrastructure) is extremely outdated. However, our missile defense system could pick a gnat off a dogs ass from a 100 yards out. Focusing only on the one GBI (from a realism standpoint) would throw me out of the movie if I was super focused on that. \n\nOverall, I can see why some people wouldn’t like it. I definitely do not agree that it’s “the worst movie of the year” or “worst produced movie”. It’s just a movie that was made in a manner that won’t appeal to everyone and that’s okay. \n\nWhat do I know though? I’m also a huge fan of VelociPastor. ",
        "upvotes": 0,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1ojyrt1/house_of_dynamitedefinitely_better_than_war_of/"
    },
    {
        "id": "1ojoccl",
        "author": "elonthegenerous",
        "title": "Get Help to sign out??",
        "content": "It took me so long to figure out how to sign out of my Netflix account on my TV. It turns out it’s in the Get Help menu? How does that make sense? I feel like this UX needs to be revisited ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ojoccl/get_help_to_sign_out/"
    }
]