[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 484,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1haf6gm",
        "author": "netflix",
        "title": "Netflix received 36 Golden Globes nominations!\n\nCongratulations to Emilia Pérez, Nobody Wants This, Squid Game, Monsters: The Lyle and Erik Menendez Story, Maria, Ripley, Griselda, Black Doves, The Gentlemen, The Diplomat, A Man on the Inside, and Glen Powell who scored his first-ever nomination.",
        "content": "",
        "upvotes": 28,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1haf6gm/netflix_received_36_golden_globes_nominations/"
    },
    {
        "id": "1higu49",
        "author": "Whobitmyname",
        "title": "‘Dan Da Dan’ Season 2 Coming to Netflix in July 2025",
        "content": "",
        "upvotes": 46,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1higu49/dan_da_dan_season_2_coming_to_netflix_in_july_2025/"
    },
    {
        "id": "1hibqk2",
        "author": "Pep_Baldiola",
        "title": "Netflix is leaning hard into the 'Squid Game' universe. Its creator said he's 'sick' of working on it.",
        "content": "",
        "upvotes": 105,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1hibqk2/netflix_is_leaning_hard_into_the_squid_game/"
    },
    {
        "id": "1himfkk",
        "author": "misana123",
        "title": "Netflix snaps up US broadcast rights for Women’s World Cup in ‘landmark deal’",
        "content": "",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1himfkk/netflix_snaps_up_us_broadcast_rights_for_womens/"
    },
    {
        "id": "1hikvqi",
        "author": "Wall_of_Wolf_Street",
        "title": "Christmas recommendations ",
        "content": "Im a 27yo and I’ve watched almost all of Netflix’s top content (minus Arcane because having a hard time keeping up) looking for the best christmas movies/series recommendations here. Doesnt have to be romcoms just need winter/murder/thriller vibes.",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hikvqi/christmas_recommendations/"
    },
    {
        "id": "1hhwt5i",
        "author": "SoftPois0n",
        "title": "First poster for the final season of ‘YOU’ - Releasing in 2025 on Netflix.",
        "content": "",
        "upvotes": 283,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1hhwt5i/first_poster_for_the_final_season_of_you/"
    },
    {
        "id": "1hi641z",
        "author": "indiewire",
        "title": "What's Coming to Netflix in January 2025",
        "content": "",
        "upvotes": 34,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1hi641z/whats_coming_to_netflix_in_january_2025/"
    },
    {
        "id": "1hikb3g",
        "author": "Robemilak",
        "title": "Google Launches ‘Squid Game’ Browser Game You Can Play on Google Search",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hikb3g/google_launches_squid_game_browser_game_you_can/"
    },
    {
        "id": "1hi98g0",
        "author": "deeznuttingtons",
        "title": "King of Tupelo - Possibly the goat netflix doc. ",
        "content": "I normally don't gas up shows that I enjoyed watching like this but holy shit King of Tupelo had me crying laughing and dropping my jaws in awe at just how insane the story is. The production cooked; shooting and editing were elite. One reason that I found it so entertaining was that the first two episodes set up such a satisfying twist in the last episode.\n\nKC and Everett are hysterical foils of each other, not to mention they're both absolutely fucked as individuals. Everyone interviewed are such good storytellers, having a certain southern style humor/charm that doesn't get old quickly. The ending is so good too; there's a feeling of a hero's redemption with KC which ties the story very nicely. All in all, super impressed and grateful to see Netflix invest in this show. What a treat.",
        "upvotes": 14,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hi98g0/king_of_tupelo_possibly_the_goat_netflix_doc/"
    },
    {
        "id": "1hinkvh",
        "author": "1cockeyedoptimist",
        "title": "Younger coming to Netflix",
        "content": "January 7 if you're looking for a light, quirky comedy created by Darren Star. Great cast includes Hillary Duff, Sutton Foster, Debi Mazar, Peter Hermann).\n\nAfter being mistaken for younger than she really is, a single mother decides to take the chance to reboot her career and her love life as a 26-year old.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hinkvh/younger_coming_to_netflix/"
    },
    {
        "id": "1hiiuy5",
        "author": "yutgoj",
        "title": "Netflix is not auto-playing the next episode on mobile data (iPhone)",
        "content": "Basically summed up on the main text, it auto-plays on my iPad w hotspot. Wifi works in autoplaying, i've tried turning on and off the autoplay settings, sign-out and sign-in, and force reset, none of them worked. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hiiuy5/netflix_is_not_autoplaying_the_next_episode_on/"
    },
    {
        "id": "1hii1r2",
        "author": "Mysterious_County154",
        "title": "Netflix only showing originals on one profile while connected to home wifi, does this eventually go away?",
        "content": "Non original Show errored out mid watch yesterday and after reloading Netflix I could only see originals. I can see non originals on my profile if I switch to my mobile data but also on my home wifi if I use another profile (on the same account). The only thing I can think of it is that might have flagged something is I have a different country sim card as well in my phone and I used it to watch a show on Netflix a couple weeks ago, though I find it weird the limit would've only happened yesterday. Netflix support wasn't helpful at all",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hii1r2/netflix_only_showing_originals_on_one_profile/"
    },
    {
        "id": "1hhsfhw",
        "author": "Robemilak",
        "title": "Netflix Is Reportedly Making an Adaptation of the S.T.A.L.K.E.R. Video Game Series",
        "content": "",
        "upvotes": 112,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1hhsfhw/netflix_is_reportedly_making_an_adaptation_of_the/"
    },
    {
        "id": "1hidjdi",
        "author": "JemJemIsHerName",
        "title": "Prison Break, now on Netflix ",
        "content": "I watched at least the 1st 3 seasons when it orriganly aired in 2005. I’ve been binging it on Netflix and on season 5 now. I have a love/hate with this show. The original plan to break out was so premeditated and thought out with like contingency’s on contingency for the original subsequent prison break. After that additional prison breaks and heists are like ok, I guess? I am really enjoying it but also I constantly yell at the TV “it looks like it’s time for another prison break!” ",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hidjdi/prison_break_now_on_netflix/"
    },
    {
        "id": "1hihwsb",
        "author": "thernker",
        "title": "Shows like Murder Mindfully",
        "content": "So just finished watching Murder Mindfully with subtitles and loved the concept and the show. I would request any recommendations for similar shows in any language. ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hihwsb/shows_like_murder_mindfully/"
    },
    {
        "id": "1hi8uo7",
        "author": "tablefortress",
        "title": "Shows to Watch with a 6-Year-Old",
        "content": "My daughter (almost 6) and I have been watching Junior Bake Off together, and it's been so cozy. What other wholesome, NOT scary shows do you recommend that are interesting for both the kids AND adults watching?",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hi8uo7/shows_to_watch_with_a_6yearold/"
    },
    {
        "id": "1hi2gre",
        "author": "iirison1",
        "title": "Shows to watch with my dad",
        "content": "I’m a 17 years old girl, who wants to bond with my dad, who’s currently on sick leave from work (that he loves dearly) and has been struggling a lot. I want to find a show with a bunch of seasons to watch with my dad to spend some time with him, but I can’t seem to find any.",
        "upvotes": 15,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1hi2gre/shows_to_watch_with_my_dad/"
    },
    {
        "id": "1hhymeb",
        "author": "StEvUgnIn",
        "title": "You Season 5 - Did you figure out the secret code?",
        "content": "",
        "upvotes": 19,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hhymeb/you_season_5_did_you_figure_out_the_secret_code/"
    },
    {
        "id": "1hi460r",
        "author": "Interesting-Wait-591",
        "title": "High school TV shows recommendations ",
        "content": "Does anyone have like TV shows like outer banks, stranger things and like Riverdale S1, like high school adventurous kinda of TV show, I mean I am currently watching Riverdale and I really liked season 1 it is like the kind of TV shows that I like but after season 1 it starts getting bad, so does anybody have good TV shows in that genre??",
        "upvotes": 8,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1hi460r/high_school_tv_shows_recommendations/"
    },
    {
        "id": "1hiit8e",
        "author": "dingdongwashboard",
        "title": "How does Netflix decide which movies are streamed in 4K and which are not?",
        "content": "Dune 2 recently dropped here in Australia on Netflix. I recently upgraded my plan to include 4K streaming, but to my incredible surprise, Dune 2 is capped at 1080P? Surely not? They have plenty of shitty romcoms on here that show at 4K with Dolby Atmos, but one of the most visually stunning movies released in recent years can’t get a 4K drop? This is just confusing on so many levels. And I’m not normally one to complain too much about quality, but especially in a film like this it just looks so compressed for some reason running at 1080P.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hiit8e/how_does_netflix_decide_which_movies_are_streamed/"
    },
    {
        "id": "1hin1ma",
        "author": "ArkhamGeneral92",
        "title": "So, The Batman just got uploaded..... in 1080p. Why is this scumpany so cheap?",
        "content": "I literally own the 4K HDR blu ray so they can't run with some BS stating that it's only available in 1080 when physical media and literally any other streaming service its been on has it in 4k. The absolutely absurd extra amount that I pay for the 4k package and this scumpany isn't even adding new movies *in* 4k ffs. Absolutely disgusting ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hin1ma/so_the_batman_just_got_uploaded_in_1080p_why_is/"
    },
    {
        "id": "1hicndy",
        "author": "dangibby",
        "title": "Purple hearts problems ",
        "content": "I feel like I’m the only person who noticed cassie was rather mean and a bitch in purple hearts, did anyone else notice she wasn’t the nicest of people, in some ways this made for a more unique film having one of the leads be a bit  unlikeable and not the nicest of people \nI had no issues with her standing up for what was right and I enjoyed the film, but I did think she treated Luke not the nicest of ways and was a bit bitchy and mean to him ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hicndy/purple_hearts_problems/"
    },
    {
        "id": "1hic42j",
        "author": "Zejjs",
        "title": "Netflix Household BS",
        "content": "My mobile devices just started complaining that they're not part of my household. The issue is I do not own a TV, and have not the slightest idea what network my household is supposed to be. I checked my signed in devices and it's only shown me the usual culprits (PC, iPad, phone). I called the Netflix support line and they advised me I buy a TV to fix this. This is such absolute nonsense. Has anyone ran into something like this and found a workaround better than inputting a code on every device 2 weeks? Would closing and re-opening my account help?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hic42j/netflix_household_bs/"
    },
    {
        "id": "1hhtyb1",
        "author": "xantub",
        "title": "TV comedies to watch with grandma (84)",
        "content": "I'm looking for shows to watch with grandma in Netflix (or Max for that matter). I'm staying with her for a month so looking for stuff to watch with her a couple of episodes a day (30 min, or one episode for 1-hour shows).  Some of the requirements are:  \n - No sex or nudity.  \n - No violence, blood.  \n - Not much drama.  \n - No \"smart\" comedy, just for reference I finished Man on the Inside with her and still had to explain things here and there.  \n - Preferably more \"wholesome\" upbeat series where good things happen.",
        "upvotes": 13,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1hhtyb1/tv_comedies_to_watch_with_grandma_84/"
    },
    {
        "id": "1hi62fq",
        "author": "Difficult_Most_8032",
        "title": "Good physiological thriller options? ",
        "content": "I love shows like Behind Her Eyes, all the shows by that director that did Fool Me Once, loved Perfect Couple. \n\nAny other good shows that kinda fuck with your head and keep you guessing? ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hi62fq/good_physiological_thriller_options/"
    },
    {
        "id": "1hhjdin",
        "author": "yesidkwhat1",
        "title": "La Palma and Carry-On",
        "content": "By far some of THE most insane unrealistic pieces of media I’ve ever consumed, not a single thing made any sense and I loved every bit of all of it. Merry Christmas! ",
        "upvotes": 73,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1hhjdin/la_palma_and_carryon/"
    },
    {
        "id": "1hhshy9",
        "author": "Robemilak",
        "title": "'La Palma' - super unrealistic, but still enjoyable and bingable?",
        "content": "Some scenes were super unrealistic. Also, the plot and acting were kinda meh. Still, it was super entertaining to watch! I binged it easily. Kinda reminds me of 2022's 'Watcher.' There were a lot of cons, but easily one of the best binges of the year (speaking of 'Watcher'). What do you think?",
        "upvotes": 10,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1hhshy9/la_palma_super_unrealistic_but_still_enjoyable/"
    },
    {
        "id": "1hi6jd4",
        "author": "Character-Ad-7000",
        "title": "Sorry if it’s a stupid question ",
        "content": "I’m currently watching one piece and I’ve noticed there is a big jump between episodes so I was wondering if Netflix has a schedule to when they’ll add the one piece episodes that are currently missing ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hi6jd4/sorry_if_its_a_stupid_question/"
    },
    {
        "id": "1hhzx90",
        "author": "AlexAwesome1124",
        "title": "Question About Streaming on an International Flight",
        "content": "On Christmas day, I will be flying from the US to an international destination. I want to watch Netflix while in the air. More specifically, I want to watch the live NFL broadcast of the Kansas City Chiefs vs the Pittsburgh Steelers. I am, of course, willing to pay for the in-flight WiFi, but I wanted to ask how that works with streaming Netflix -- in particular, streaming live.\n\n  \nI know that sometimes on American Airlines flights, they will have live television that you can watch on the seat-back screens, but since this game isn't aired on television and is a Netflix exclusive, I just wanted to check.\n\n\n\nI know the game will be available both to US and international audiences on Netflix, but I don't know how it will work with live streaming in the air and leaving the US.\n\n  \nDo you think I will be able to watch the game? If so, do you think just buying the in-flight WiFi and then loading Netflix up on my phone would work? \n\nThank you!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hhzx90/question_about_streaming_on_an_international/"
    },
    {
        "id": "1hhxlbr",
        "author": "ixam1802",
        "title": "Search Bar doesn‘t work?",
        "content": "So I was trying to watch Batman the caped crusader on my pc because I saw it on the Netflix app on my phone today. If I search for Batman on my phone it shows most movies, but if I search for it on PC, it won’t pop up",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hhxlbr/search_bar_doesnt_work/"
    },
    {
        "id": "1hhhi5g",
        "author": "Mu5hroomHead",
        "title": "Every American should watch “If Anything Happens I Love You”",
        "content": "America probably has the highest number of school shootings in the whole world. And every time a school shooting happens, it’s all over the news. It ignites conversations about gun control, etc. But in the end, nothing changes.\n\nThis short film portrays the devastation left behind after everyone forgets and moves on. It beautifully shows the destruction left behind. It’s personal, and it’s raw.\n\nI think everybody should watch this short film, especially Americans. Put yourselves in the situation of the parents…",
        "upvotes": 29,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hhhi5g/every_american_should_watch_if_anything_happens_i/"
    }
]