[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 6,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 5,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1o5zhf8",
        "author": "LessImportance2881",
        "title": "Come si vive in zona metro Dante a Torino?",
        "content": "Buongiorno, dovrei trasferirmi a Torino a fine mese con la mia ragazza? Ho letto tanto sulla zona di San Salvario ma non ho capito se tutto il quartiere è da non considerare oppure se ci sono zone più tranquille. Ho letto di problemi di spaccio ma che comunque non è nulla di eccessivamente pesante per chi ci vive, vorrei comunque evitare ci fosse in quella zona.\nSe riusciste a dare feedback anche sulla fermata della metro ve ne sarei grato ♥️",
        "upvotes": 10,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/s6tw8gkqoyuf1.jpeg?auto=webp&amp;s=cea2e315510b1c35fcb01e1ae29a3e5d3ec6ca35"
        },
        "permalink": "/r/torino/comments/1o5zhf8/come_si_vive_in_zona_metro_dante_a_torino/"
    },
    {
        "id": "1o68qak",
        "author": "IndependentLove3789",
        "title": "Com'è il c2c Torino?",
        "content": "Ci andrò il 1 novembre per la prima volta. Per chi ci fosse già stato com'è il festival? È tanto affollato? I prezzi dei cibo/bere sono tanto alti? Invece la scaletta con gli orari dei cantanti dove posso trovarla? non c'è da nessuna parte. Graziee ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o68qak/comè_il_c2c_torino/"
    },
    {
        "id": "1o67kr5",
        "author": "MildlyRadioactive",
        "title": "Aiuto urgente – amica bloccata dopo il rilascio del visto ma senza possibilità di immatricolazione finale (UniTo – Business &amp; Management)",
        "content": "Ciao a tutti,  \nScrivo per conto di una mia amica che si trova in una situazione davvero frustrante e avrebbe bisogno di qualche consiglio.\n\nHa completato le scuole superiori qui in Pakistan e ha fatto domanda all’**Università di Torino** (UniTo) per il corso di **Laurea in Business and Management**. È andato tutto bene — è stata accettata, ha ricevuto la **lettera di idoneità**, ha completato la procedura su Universitaly, e le è stato anche **rilasciato il visto**.\n\nIl problema è sorto al momento dell’immatricolazione finale.  \nAveva sostenuto il test **TOLC-E**, che all’inizio dell’anno era accettato per questo corso. Tuttavia, UniTo ha improvvisamente aggiornato i requisiti, rendendo il **SAT obbligatorio** per gli studenti non-UE. Lei non era stata informata di questo cambiamento in tempo e, quando l’ha scoperto, **la scadenza per l’immatricolazione era già passata**.\n\nHa contattato l’università, che le ha confermato che **non può immatricolarsi ora**, e che dovrà **rifare domanda l’anno prossimo**, **dopo aver sostenuto il SAT**.\n\nOvviamente, non vuole perdere un intero anno solo ad aspettare.\n\nSta pensando di cambiare corso di laurea (scegliendone uno **che non richieda il SAT**), oppure di iscriversi a un **Foundation Year**. Ma ci siamo bloccati in alcuni punti, e avremmo davvero bisogno di aiuto.\n\n\n\n# ❓ Le nostre domande:\n\n1. Il suo **visto è ancora valido**, ma l’università dice che è **legato al corso specifico per cui ha fatto domanda**. È vero che **non può cambiare corso** e che dovrebbe **fare domanda per un nuovo visto**, anche se quello attuale è ancora valido?\n2. Se fosse vero, **come si fa a richiedere un nuovo visto se si ha già un visto valido** per diversi mesi?\n3. I corsi di Foundation Year in Italia (ad esempio a UniTo o in altre università) **richiedono il SAT** o no? Potrebbe essere una soluzione valida per lei?\n\n\n\nSe qualcuno ha vissuto una situazione simile — o conosce qualcuno che ci è passato — saremmo davvero grati per qualsiasi consiglio, anche solo per sapere a chi rivolgerci o quale ufficio contattare.\n\nGrazie mille in anticipo 🙏",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o67kr5/aiuto_urgente_amica_bloccata_dopo_il_rilascio_del/"
    },
    {
        "id": "1o5f383",
        "author": "happy_arounding15",
        "title": "La pace di Borgo Dora al mattino presto",
        "content": "",
        "upvotes": 60,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3sxsyo3uluuf1.jpeg?auto=webp&amp;s=877355468e71c0b77d5e868f5f6dbb7d97dd9fd2"
        },
        "permalink": "/r/torino/comments/1o5f383/la_pace_di_borgo_dora_al_mattino_presto/"
    },
    {
        "id": "1o68l11",
        "author": "Outrageous_Lab_7106",
        "title": "Consigli zone torino",
        "content": "Cerco una stanza per l'uni, com'è San Salvario? All'altezza della metro Nizza. Ho letto che la parte alta vicino la stazione è molto sconsigliata... A me starebbe comoda e non mi sembra lontana dal centro...\nIn generale che zone sconsigliate per vivere? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o68l11/consigli_zone_torino/"
    },
    {
        "id": "1o5tlsr",
        "author": "Specialist-Cold-1459",
        "title": "Asili nido privati in zona Corso Dante?",
        "content": "Un noto nido di Torino mi ha dato un pacco clamoroso scrivendomi stasera che non apriranno (bambino iscritto a Maggio...)\n\nQuindi sono alla disperata ricerca di un posto nido. Se sentite qualcosa mi fate un favore grazie!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o5tlsr/asili_nido_privati_in_zona_corso_dante/"
    },
    {
        "id": "1o5pp38",
        "author": "Wide_Web_7435",
        "title": "I want apply to politicnico di turinu engineering, sat math section 650 ,english 500 ilets score 7.5 this enough for direct apply or still need TIL-I exam",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o5pp38/i_want_apply_to_politicnico_di_turinu_engineering/"
    },
    {
        "id": "1o5e76r",
        "author": "dieselNoodle",
        "title": "posti dove sedersi e programmare?",
        "content": "avrei necessità di un posto tranquillo munito di presa di corrente e sedia non eccessivamente scomoda dove possa rimanere qualche ora per programmare. avevo pensato a una biblioteca ma non sono universitaria quindi non so se (e in quali) posso andare, o se avete un bar da consigliarmi dove posso fermarmi per un po', cose così\n\nthanks in advance, ho proprio bisogno di togliermi di casa",
        "upvotes": 8,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1o5e76r/posti_dove_sedersi_e_programmare/"
    },
    {
        "id": "1o5v1iw",
        "author": "Practical_Tune_1505",
        "title": "Cercasi friendss",
        "content": "Ciao sono un ragazzo di 28 anni e sono da poco a Torino, sto cercando nuove amicizie. Il mio prototipo di amico è qualcuno con cui suonare, cantare, bere e fare casino. Per lo più grunge. Ex pallavolista e programmatore, sono appassionato di startup e vado pazzo per Elon musk (👀 non trump). L'imprenditoria è la mia passione insomma. Sono imbattibile a biliardino. Come ultima spiaggia, quando proprio non ho niente da fare mi faccio una partita a league of legends. Persone simili a me ne abbiamo a Torino? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o5v1iw/cercasi_friendss/"
    },
    {
        "id": "1o5u6pk",
        "author": "ArtistaFortunato",
        "title": "Bacaro senza alcol bar storici",
        "content": "Avete mai passato un giorno girando tutti i bar e locali storici? Io lo ho fatto un giorno ed è stato fighissimo",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o5u6pk/bacaro_senza_alcol_bar_storici/"
    },
    {
        "id": "1o5j5v8",
        "author": "FESB_Racing",
        "title": "Box per prepare moto",
        "content": "Ciao — siamo una squadra (tecnica + meccanici) e abbiamo bisogno di un box / posto coperto stasera per preparare alcune moto prima di una gara. Abbiamo attrezzi e tecnici, servono solo presa elettrica (220V) e accesso per qualche ora / overnight. È possibile affittare uno spazio per stasera? Prezzo e orari? Grazie!🥰 \nFESB racing team 🇭🇷🏍️",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o5j5v8/box_per_prepare_moto/"
    },
    {
        "id": "1o5fjut",
        "author": "FESB_Racing",
        "title": "Cro Motostudent team looking for a workspace",
        "content": "Hey everyone! 👋\n\nWe're a Motostudent team from Split, Croatia on our way to the Motostudent competition in Aragon, Spain. We'll be staying in Turin tonight and we are looking for a possible workspace, garage or any place where we could work on our motorbike for one night.\n\nWe've got the necessary materials and tools - we just need a space to work on the bike.\n\nIf you know someone or are someone who could help us, we'd really appreciate it!🙏\n\nThanks in advance🥰\n- FESB racing team 🇭🇷🏍️",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o5fjut/cro_motostudent_team_looking_for_a_workspace/"
    },
    {
        "id": "1o5lb4x",
        "author": "violecarra1",
        "title": "Gruppo di paddle a Torino?",
        "content": "Sono una ragazza con livello intermedio appena trasferita a Torino ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o5lb4x/gruppo_di_paddle_a_torino/"
    },
    {
        "id": "1o5gmls",
        "author": "Nutsyblazzer",
        "title": "Opinioni per favore, bici elettrica",
        "content": "Sto per comprare una bici elettrica. Qualcuno ha provato a comprarle su AliExpress? Per quanto ho visto, i prezzi su AliExpress sono più bassi, ma non so se poi mi inchioderanno con delle tasse per farla entrare in Italia. Non lo so. Altrimenti, considero anche di comprare da Decathlon.",
        "upvotes": 0,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3d4dgyk42vuf1.jpeg?auto=webp&amp;s=fbbc1d4850d550b7ab2fe0318c5cfe78e44f3be5"
        },
        "permalink": "/r/torino/comments/1o5gmls/opinioni_per_favore_bici_elettrica/"
    },
    {
        "id": "1o5cpo3",
        "author": "Zzzzzzzzzzzcc",
        "title": "Project about Cycling safety in Torino",
        "content": "Hello guy. I’m doing a uni project about cycling safety in Torino and I was wondering if you guys could fill this google forms, it would be much appreciated!",
        "upvotes": 3,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dzWXRfJrdB_22WT-5A39ch_jRIw_mBgIe_iIky5qk4c.png?auto=webp&amp;s=33957a77fffa0cfdf1aa1ab9394af6c5604aa920"
        },
        "permalink": "/r/torino/comments/1o5cpo3/project_about_cycling_safety_in_torino/"
    },
    {
        "id": "1o5c1vb",
        "author": "aaronrandomguy",
        "title": "CAF",
        "content": "Buongiorno, avreste un CAF da consigliare? Meglio se in zona lingotto/borgo Filadelfia ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o5c1vb/caf/"
    },
    {
        "id": "1o5189k",
        "author": "17ace",
        "title": "viaggio a torino - luoghi alternativi/giovani/underground da frequentare, negozi dell'usato, consigli locali",
        "content": "ciao !\n\nIl prossimo fine settimana andremo a visitare Torino con la mia ragazza, siamo entrambi ventenni e alloggiamo a San Salvario. Vorremmo suggerimenti su luoghi frequentati dai giovani, bar alternativi e magari anche discoteche.\n\nNon sono un grande fan dell'elettronica o della techno, ma non mi dispiace provarci, penso che ci sia una grande scena a Torino.\n\nPer i negozi dell'usato non importa se si tratta di una selezione specializzata o di qualcosa di più grande e un po' lontano, come possiamo vedere per gli enti di beneficenza.\n\nHo trovato alcuni nomi qui, ma i post sono un po' datati, quindi se ci sono cose da aggiungere o togliere dalla lista, non esitate!\n\nLuoghi e bar: Largo Saluzzo e San Salvario (all'incirca), le vie intorno a Piazza Santa Giulia, Carmen e Panche\n\nClub: Audiodrome, Ziggy, 211, Bunker\n\nNegozi dell'usato: Humana, Cambiamenti, Mercantino Piccolo Antico\n\nGrazie per le vostre risposte e non vedo l'ora di visitarvi!",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o5189k/viaggio_a_torino_luoghi/"
    },
    {
        "id": "1o54dzc",
        "author": "goblinlancieredipane",
        "title": "amicizie dai",
        "content": "Ciao a tutti! 👋\nHo 23 anni e vivo a Torino. Sto cercando di ampliare un po’ il giro di amici in città (e dintorni) per condividere qualche uscita, chiacchiere e interessi comuni.\n\nCerco persone tranquille e simpatiche, più per amicizia vera che per conoscenze superficiali.\n\nSe vi va, scrivetemi pure.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o54dzc/amicizie_dai/"
    },
    {
        "id": "1o4nvse",
        "author": "Terrible-Ice4984",
        "title": "Tessera GTT",
        "content": "Buongiorno, che qualcuno sappia c'è un metodo - che sia tramite App o sito - per poter usare la tessera bip GTT da cellulare, senza averla fisica?",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o4nvse/tessera_gtt/"
    },
    {
        "id": "1o4vpdm",
        "author": "FreeAd8663",
        "title": "Imperdibile concerto Progressive Metal, giovedì 16 ottobre ore 21.30 presso Il Maglio di Torino!",
        "content": "Giovedì 16 ottobre dalle ore 21.30 presso \"Il Maglio\" di Torino ci sarà un evento imperdibile, per tutti gli appassionati di musica live!\n\nCosa troverete? Un menù semplice ma appagante, due giovanissime band, un genere musicale fra i più difficili ma anche fra i più apprezzati dai musicisti, tanta passione e voglia di trasmettere sensazioni ed emozioni. Il tutto rigorosamente live. \n\nApriranno i talentuosissimi Wild Cats da Savona che (https://www.instagram.com/wild._cats?igsh=MWFraXlmaDg2cGFzNg==) con il loro singolo Envy e con altri brani Progressive vi infiammeranno a dovere, in attesa del piatto forte della serata... cioè la Only One Black band (https://www.instagram.com/onlyoneblack.band?igsh=bWNuemF2azg0dzE3) che presenterà in anteprima assoluta l'album Set Me Free, 10 brani Progressive Metal che vi stupiranno!\nSe non avete ancora avuto la possibilità di ascoltarli, specie dal vivo, vi assicuro che non resterete minimamente delusi dallo spettacolo che vi proporranno, non aggiungo altro per non rovinarvi la sorpresa perché, ne sono certo, sarete sorpresi da come e quanto ca*** suona questa band!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/srsu1nv7ypuf1.jpeg?auto=webp&amp;s=936e15bbf138b95eb776a92f07677270a44bb808"
        },
        "permalink": "/r/torino/comments/1o4vpdm/imperdibile_concerto_progressive_metal_giovedì_16/"
    },
    {
        "id": "1o4oudw",
        "author": "fuckyoualess",
        "title": "Accademia Albertina di Torino",
        "content": "Ciao, per caso qualcuno qui studia all’accademia Albertina? ho qualche domanda, in particolare sul corso di cinema, fotografia e audiovisivo",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o4oudw/accademia_albertina_di_torino/"
    },
    {
        "id": "1o4nf5c",
        "author": "Appropriate-Net-6030",
        "title": "Trasporti",
        "content": "Ciao la faccio breve, da buono studente under 26 ho fatto l'abbonamento gratuito ai mezzi e richiesto la carta bip senza particolare attenzione e con abbastanza fretta. Fattostà che, pare che l'isee della mia famiglia potrebbe sforare gli 85000 e ieri, facendo la stessa procedura per mio fratello ho notato che ce scritto che dichiarare il falso è reato (per carità potevo immaginarlo ma pensavo che il programma controllasse automaticamente prima di accettare la richiesta o comunque che ti avrebbe annullato la carta al primo controllo) e quindi che ci saranno sanzioni se fai ciò. Io ho eliminato il mio account bip ma non so se basta. Cosa posso fare? (Tranne prendermela nel culo)",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o4nf5c/trasporti/"
    },
    {
        "id": "1o407e4",
        "author": "Iaco_V8",
        "title": "Ma perché i giardini della cavallerizza sono chiusi da così tanti anni?",
        "content": "Da piccolo, non ricordo se fosse alle elementari o alle medie, ero stato ai Giardini Reali e avevo trovato chiuso il ponticello su viale Primo Maggio, quello che collega i Giardini della Cavallerizza con il resto dei giardini reali alti. \nPensavo che l'avrebbero riaperto presto.  \n\nOra che frequento le superiori proprio lì vicino, vedo che è ancora tutto chiuso.  \nSapete cosa stanno facendo? Lo riapriranno prima o poi?  \n\nHo notato che ci sono dei lavori in corso e ho sentito dire che vogliono collegare i Giardini Reali alti con quelli bassi.\nPotrebbero forse collegarli dai Giardini della Cavallerizza?\nIn effetti, ho visto un sentiero che parte dalla casetta del Circolo degli Artisti e si dirige proprio da quella parte...",
        "upvotes": 59,
        "comments": 48,
        "media": null,
        "permalink": "/r/torino/comments/1o407e4/ma_perché_i_giardini_della_cavallerizza_sono/"
    },
    {
        "id": "1o4lw5q",
        "author": "gufoscientifico",
        "title": "Negozio di modellismo gunpla",
        "content": "Salve, mi sono trasferito a torino da poco più di una settimana e sto cercando un negozio di modellismo che venda gunpla (modellini di plastica assemblabili senza colla che non sono da pitturare) ma su maps mi sembra di vedere solo negozi di modellismo statico tradizionale.\nQualcuno sa consigliarmi un negozio o devo rassegnarmi a comprare online?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o4lw5q/negozio_di_modellismo_gunpla/"
    },
    {
        "id": "1o4q0eo",
        "author": "Magnoliavecchia",
        "title": "Restaurant in Torino",
        "content": "Ciao Tutti,\nVorrei andare a Torino per qualche giorni . Conoscete buoni ristoranti con buoni tipici piati Piemonte e una tipica  atmosfera italiana.?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o4q0eo/restaurant_in_torino/"
    },
    {
        "id": "1o4puyo",
        "author": "Similar_Profit_7298",
        "title": "ToMove",
        "content": "Salve, anche voi avete problemi con l'app ToMove di GTT? Non riesco né a bippare il biglietto e né a fare la autoconvalida, per la prima semplicemente la macchineta per bippare non rileva nulla e nel secondo caso mi dice che \"si è verificato un errore\". È mai successo anche a voi?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o4puyo/tomove/"
    },
    {
        "id": "1o4otp5",
        "author": "DANKLEBERG_66",
        "title": "Cerco un ostello economico per un gruppo di 30 giovani",
        "content": "Ciao tutti,\n\nDevo organizzare un viaggio all’estero per 30 persone e ho bisogno di capire cosa sia fattibile. Abbiamo un budget di circa 15-30 euro a notte a persona per l’alloggio, ma non riesco a trovare nulla di simile a Torino. Forse avete dei consigli o raccomandi?",
        "upvotes": 1,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1o4otp5/cerco_un_ostello_economico_per_un_gruppo_di_30/"
    },
    {
        "id": "1o4cqwo",
        "author": "Illustrious_Rule_593",
        "title": "Convertire permesso di soggiorno per studenti in permesso di soggiorno per lavoro",
        "content": "Ciao ragazzi, qualcuno ha esperienza nella conversione del permesso di soggiorno per studi in permesso di soggiorno per lavoro? Qual è il vostro suggerimento per chi volesse farlo?\n\nin generale quale strada suggerisci? \n1) permesso di soggiorno per studio -&gt; permesso di soggiorno per lavoro\n2) permesso di soggiorno studi -&gt; permesso cerco lavoro -&gt; permesso dí soggiorno per lavoro",
        "upvotes": 7,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1o4cqwo/convertire_permesso_di_soggiorno_per_studenti_in/"
    }
]