[
    {
        "id": "1i3qboh",
        "author": "BunyipPouch",
        "title": "Join us Friday 1/24 at 3 PM ET for a live AMA/Q&amp;A with Brady Corbet, director of A24's 'The Brutalist'. It stars Adrien Brody, Felicity Jones, and Guy Pearce. The 3h35 epic-drama was recently nominated for 7 Golden Globes and is releasing nationwide next week.",
        "content": "",
        "upvotes": 82,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zkllw8td9mde1.jpeg?auto=webp&amp;s=e2ff5e06beea46e0088a96cabed5015e2326a2cd"
        },
        "permalink": "/r/movies/comments/1i3qboh/join_us_friday_124_at_3_pm_et_for_a_live_amaqa/"
    },
    {
        "id": "1i36zgg",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Wolf Man / One of Them Days / The Last Showgirl / The Brutalist)",
        "content": "# New Theatrical Releases\n\n[Wolf Man](https://old.reddit.com/r/movies/comments/1i36wh1/official_discussion_wolf_man_spoilers/?)\n\n[One of Them Days](https://old.reddit.com/r/movies/comments/1i36wmw/official_discussion_one_of_them_days_spoilers/?)\n\n[The Last Showgirl](https://old.reddit.com/r/movies/comments/1i36wob/official_discussion_the_last_showgirl_spoilers/?)\n\n[The Brutalist](https://old.reddit.com/r/movies/comments/1i37yra/official_discussion_the_brutalist_spoilers/?)\n\n# Streaming Releases\n\n[Wallace &amp; Gromit: Vengeance Most Fowl](https://old.reddit.com/r/movies/comments/1hsvowt/official_discussion_wallace_gromit_vengeance_most/?)\n\n# Still in Theaters\n\n[Den of Thieves 2: Pantera](https://old.reddit.com/r/movies/comments/1hxuwnk/official_discussion_den_of_thieves_2_pantera/?)\n\n[Better Man](https://old.reddit.com/r/movies/comments/1hxuwpf/official_discussion_better_man_spoilers/?)\n\n[A Complete Unknown](https://old.reddit.com/r/movies/comments/1hlsi27/official_discussion_a_complete_unknown_spoilers/?)\n\n[The Fire Inside](https://old.reddit.com/r/movies/comments/1hlsi3n/official_discussion_the_fire_inside_spoilers/?)\n\n[Nosferatu](https://old.reddit.com/r/movies/comments/1hmffh4/official_discussion_nosferatu_2024_spoilers/?)\n\n[Babygirl](https://old.reddit.com/r/movies/comments/1hmffj8/official_discussion_babygirl_spoilers/?)",
        "upvotes": 36,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1i36zgg/official_discussion_megathread_wolf_man_one_of/"
    },
    {
        "id": "1i6avyg",
        "author": "DanGleenutz",
        "title": "Let's talk about \"Children of Men\"...",
        "content": "Seriously, how good was this movie? Twenty years later, it still holds up. Their depiction of 2027 didn't have flying cars or any crazy shit like that, in fact, it seems pretty spot on in terms of how the world actually looks from a technological standpoint. Less people glued to their phones, but perhaps the director was more optimistic than the movie let on.\n\nThat said, the film certainly did have its own flavour. The  shaky cam shots and tracking sequences were just as cool and engaging as the first time I'd seen the movie 15 years ago and brought about a sense of realism. True to this theme, the characters were human through and through, flawed, likeable, and relatable.\n\nClive Owen is a cynical alcoholic with a sad past, but as we see, is incapable of being anything short of a good man. His pot head friend in Michael Caine is similar in this regard. Serving both as comedic relief and the voice of reason despite being a stoner who lives in the woods. Kee, the first mother in over 18 years, is a far-cry from the Virgin Mary. Not only does she not know who the father is, she doesn't know \"who any of the wankers were.\"\n\nThen we have that ceasefire scene where we see the human side of a government that is initially portrayed as inhumanly cruel and oppressive. For as long as it lasts, it's a touching moment (and one of many scenes that makes great use of contrast -- the bombing at the beginning, Julie Anne-Moore being killed out of nowhere... there was never a moment where you could allow yourself to relax).\n\nI'm gonna leave the depictions of anti-immigrant sentiments alone, but you're free to discuss the relevance of that part amongst yourself.\n\nAnyways, what did you think of *Children of Men*?",
        "upvotes": 457,
        "comments": 123,
        "media": null,
        "permalink": "/r/movies/comments/1i6avyg/lets_talk_about_children_of_men/"
    },
    {
        "id": "1i65nb5",
        "author": "BunyipPouch",
        "title": "First Image for Dark-Comedy Thriller 'No Other Choice' - Directed by Park Chan-wook ('Oldboy', 'The Handmaiden', 'Decision to Leave') - After being unemployed for several years, a man devises a unique plan to secure a new job: eliminate his competition.",
        "content": "",
        "upvotes": 928,
        "comments": 48,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2ymvwa34q8ee1.png?auto=webp&amp;s=a146d4a860a2b03c2c6a3b5d2decce99fb695292"
        },
        "permalink": "/r/movies/comments/1i65nb5/first_image_for_darkcomedy_thriller_no_other/"
    },
    {
        "id": "1i62608",
        "author": "BunyipPouch",
        "title": "John David Washington &amp; Malcolm Washington Visit the Criterion Closet",
        "content": "",
        "upvotes": 846,
        "comments": 90,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pOGMuERQkdRi-FyLAnMO0o2dUyldtX8ysBSdwAV1uOs.jpg?auto=webp&amp;s=715527db3251ef5130ad52e1551b935281773f52"
        },
        "permalink": "/r/movies/comments/1i62608/john_david_washington_malcolm_washington_visit/"
    },
    {
        "id": "1i5t7eg",
        "author": "BunyipPouch",
        "title": "First Poster for House-Invasion Thriller 'Cold Wallet' - A team of Redditors lose everything after a cryptocurrency scam. This leads them to plot to kidnap the \"financial influencer\" who screwed them over.",
        "content": "",
        "upvotes": 1892,
        "comments": 388,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/cnlw7w2q66ee1.jpeg?auto=webp&amp;s=997e7864e328c2f9991fbae734db324cc42d6f5f"
        },
        "permalink": "/r/movies/comments/1i5t7eg/first_poster_for_houseinvasion_thriller_cold/"
    },
    {
        "id": "1i5wmv5",
        "author": "bankerizz",
        "title": "The Death of Stalin appreciation ",
        "content": "Bit late to the party but finally watched this wild piece of satire. A (horrifying + hilarious) comedic telling of the power vacuum and struggle that followed in the hours and days after the death of Russian leader Joseph Stalin. Imho it is the epitome of “truth is stranger than fiction” cuz it’s crazy to see so many big names from history books behaving like, well, idiotic, greedy children. How could one even underestimate Armando Iannucci, a legend for his political satire in Veep and Thick of It. The greatest choice the movie makes is to let all the actors keep their native accents, which sometimes makes this feel like watching an early Guy Ritchie movie set in Russia and if that isn’t a compliment then I don’t know what is.",
        "upvotes": 742,
        "comments": 105,
        "media": null,
        "permalink": "/r/movies/comments/1i5wmv5/the_death_of_stalin_appreciation/"
    },
    {
        "id": "1i60uz8",
        "author": "Davis_Crawfish",
        "title": "\"Twin Peaks: Fire Walk with Me\": David Lynch's often maligned film turns out to be a genuinely moving and tragic Horror exploration of the smalltown girl trapped in a nightmare",
        "content": "Sheryl Lee's performance is still among the greatest performances I've ever seen from an actress in Modern American Cinema. It should be as revered as Isabelle Adjani in \"Possession\". \n\nThe TV show never gave us a fully fledged portrait of Laura Palmer but in \"Fire Walk with Me\", we get to see who she is, how she lived in a constant state of panic, fear and brooding resignation. Her self-destruction through a promiscuous life was her way of escaping from the abuse inflicted in her home and the conflicted emotions she had for her abuser. \n\nLaura didn't want to live, death was her way of wanting to escape, wanting the angel to save her from BOB and all the pain and anger inflicted on her. Not even the love she got from James and Donna was enough. \n\nI absolutely adore this movie by David Lynch. I even think Moira Kelly was a better Donna than Lara Flynn Boyle (whom I always found to be miscast).",
        "upvotes": 410,
        "comments": 91,
        "media": null,
        "permalink": "/r/movies/comments/1i60uz8/twin_peaks_fire_walk_with_me_david_lynchs_often/"
    },
    {
        "id": "1i64cgq",
        "author": "Plasma-fanatic",
        "title": "Blazing Saddles original casting...",
        "content": "I think by now it's common knowledge that Richard Pryor (who was a co-writer from the start) was Mel Brooks' first choice to play Bart - the role that went to Cleavon Little. The money weasels claimed that Pryor's drug convictions made him uninsurable...\n\nWhat fascinates me more however is the fact that Books seems to have really wanted an older actor to play the Gene Wilder part - the Waco Kid. His top choice was John Wayne, who declined but said he'd be first in line to see it. Next he wanted Dan Dailey, whose film credits begin in 1940. Finally they tried Gig Young (b. 1913), who collapsed on the first day of shooting from alcohol withdrawal (*he* was insurable?). That's when they finally said screw it and flew in Gene, nobody's choice but available *and* insurable.\n\nThink about how different Blazing Saddles would have been with Brooks' first choices in the main roles! It's comical to even think about, which might have been Brooks' intention all along. It's a little nugget of humor buried in the back story of the film itself, a lasting legacy.",
        "upvotes": 211,
        "comments": 55,
        "media": null,
        "permalink": "/r/movies/comments/1i64cgq/blazing_saddles_original_casting/"
    },
    {
        "id": "1i5toc5",
        "author": "Hermit0fAlbion",
        "title": "The Food of the Lord of the Rings (and its significance) by kaptainkristian",
        "content": "",
        "upvotes": 637,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/r1NP3UvhYApTJweYFadGao09DwgMBTXT2j9CGiwdFdE.jpg?auto=webp&amp;s=c8e278a27a711c9516f1db4675868cd022b875e4"
        },
        "permalink": "/r/movies/comments/1i5toc5/the_food_of_the_lord_of_the_rings_and_its/"
    },
    {
        "id": "1i5o6g3",
        "author": "johnydarko",
        "title": "What movies can you think of that use the Picard Priciple - the characters do everything they can to the best of their ability, make all the right moves... but still end up losing?",
        "content": "I think this is such a great concept for a bleak film,  but I just can't think of many that take advantage of it. I'm sure there are a bunch of horror films, but I really struggle to think of any other films that play this completely straight -  usually if it ends with the protagonist losing then they made a mistake somewhere along the line.\n\nI'd exclude biopics and movies in series from this as they are part of a larger story (eg: Empire Strikes Back ends with Han being frozen and Luke losing to Vader, but you know it's only the middle of the story) \n\nI'm sure I'm missing obvious ones but one of the only examples I can think of is actually Don't Look Up, where the main characters are correct, try to warn everyone, do it as well as they can... but it doesn't make any difference.",
        "upvotes": 1105,
        "comments": 549,
        "media": null,
        "permalink": "/r/movies/comments/1i5o6g3/what_movies_can_you_think_of_that_use_the_picard/"
    },
    {
        "id": "1i5sut5",
        "author": "Puzzled-Tap8042",
        "title": "Lynne Taylor-Corbett Dies: Choreographer For Hollywood’s ‘Footloose’",
        "content": "",
        "upvotes": 514,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sxvAHrEPvygctb66E1DVicW_SXyp29kCCI_KVjNBvj4.jpg?auto=webp&amp;s=73bfa8cfb4a17fb0c2655df5b378557818039330"
        },
        "permalink": "/r/movies/comments/1i5sut5/lynne_taylorcorbett_dies_choreographer_for/"
    },
    {
        "id": "1i5gax3",
        "author": "ToranjaNuclear",
        "title": "What are the most dangerous documentaries ever made? As in, where the crew exposed themselves to dangers of all sorts to film it?",
        "content": "Somehow I thought this would be a very easy thing to find, I would look it up on google and find dozens of lists but...somehow I couldn't? I did find [one list](https://www.gamesradar.com/10-dangerous-documentaries/), but it seems to list documentaries about dangerous things rather than the filming itself being dangerous for the most part.\n\nI guess I wanted the equivalent of [Roar](https://en.wikipedia.org/wiki/Roar_(film)) or [Aguirre](https://en.wikipedia.org/wiki/Aguirre,_the_Wrath_of_God), but as a documentary. Something like [The Act of Killing](https://en.wikipedia.org/wiki/The_Act_of_Killing), or a youtube documentary I saw years ago of a guy that went to live among the cartel.",
        "upvotes": 5205,
        "comments": 1180,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/P7XDJ9yrtW94yx8TfWYZbJkdjTJWUgbWOdqQ602lzoA.jpg?auto=webp&amp;s=dbe22dcf8e127421ae0ee835015254b8e2045060"
        },
        "permalink": "/r/movies/comments/1i5gax3/what_are_the_most_dangerous_documentaries_ever/"
    },
    {
        "id": "1i62j01",
        "author": "Alternative-Cake-833",
        "title": "How did the 3D experience die out?",
        "content": "Apparently, I was just thinking about a while back how 3D was big for a while before dying out. We had 3D Blu-ray's, 3D movies, 3D TV's and 3D channels for a time. But this is where I found out that 3D was such a gimmick to audiences.\n\n&gt;The post-credits scene for Thor was originally filmed with 3D cameras, and it was created by The Avengers director Joss Whedon. Originally intended as a test to determine whether The Avengers would be shot in 3D, it resulted in Kevin Feige being discouraged from the process entirely moving forward. It was so difficult, that it was described as \"being an abysmal experience.\"\n\n&gt;The post-credits scene was a roughly 90-second clip and consists of little more than the meeting of Samuel Jackson's Nick Fury and Stellan Skarsgård's Erik Selvig setting up the MCU's future. However, despite the seeming simplicity of the scene, the decision to shoot it with 3D cameras caused the filming process to be unnecessarily long. Jeremy Latcham, an executive producer on The Avengers, described the tedious shoot. He said, \"It took so long to change a lens that it was truly awful. It was the longest day to shoot that tiny, tiny scene.\"\n\n&gt;Stellan Skarsgård's experience filming the post-credits scene caused him to ask Jeremy Latcham whether this would be how the next film was shot, and if it were so, then he would not be starring in it. Luckily, he was able to appear in The Avengers because they didn't shoot the movie in 3D.\n\nI think that the problem was that it was a gimmick to the audience, it was expensive and the novelty would wear out after a while. Plus, a lot of the 3D conversions were terrible (e.g. Clash of the Titans and any movie that had its 3D conversion rushed to cash-in on the success of Avatar). Look at 2010 where 60% of Shrek: Forever After's opening weekend came from 3D sales post-Avatar and by 2011, 40% of Kung Fu Panda 2's opening weekend came from 3D sales. That is a noticeable decline\n\nDon't get me wrong, there are still 3D movies being released but not as often as they were 5-10 years ago (Captain America: Brave New World is getting a 3D release next month). I just think the problem with 3D was that it proved to be a gimmick with audiences and the good 3D conversions were the ones shot in 3D like Avatar and stuff like that.",
        "upvotes": 129,
        "comments": 287,
        "media": null,
        "permalink": "/r/movies/comments/1i62j01/how_did_the_3d_experience_die_out/"
    },
    {
        "id": "1i5q9bj",
        "author": "Paxtnn",
        "title": "The Blair Witch Project - Extended Sight Cut (3hrs long extended cut)",
        "content": "",
        "upvotes": 584,
        "comments": 146,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/62cJTZPozehObNE2zAGJ1iqNz5IjnmSqf6RqHdWnnXc.jpg?auto=webp&amp;s=fd6fd8ae12cf894685c68f1959c7ca8b0793ac5c"
        },
        "permalink": "/r/movies/comments/1i5q9bj/the_blair_witch_project_extended_sight_cut_3hrs/"
    },
    {
        "id": "1i5u0vk",
        "author": "PrithvinathReddy",
        "title": "If you could recommend one lesser-known film that everyone should see, what would it be?",
        "content": "\"Sometimes the best stories are the ones that aren't told as loudly, but quietly linger in your heart long after the credits roll.\"\n. \nI'm curating a list on Letterboxd featuring lesser-known films that deserve more attention. These could be hidden gems from any genre, whether they're overlooked indie films, cult classics, or movies that simply flew under the radar. The goal is to uncover films that have a unique storytelling, strong performances, or interesting direction etc but didn't get the widespread acclaim they should have. ",
        "upvotes": 275,
        "comments": 1351,
        "media": null,
        "permalink": "/r/movies/comments/1i5u0vk/if_you_could_recommend_one_lesserknown_film_that/"
    },
    {
        "id": "1i5lj3l",
        "author": "UnderstandingFun8976",
        "title": "What is the hardest you’ve ever cried in a movie?",
        "content": "I’m a massive movie crier so I’ve cried during a LOT of movies. However, I’ll never forget the first time I watched Aftersun. As soon as the Under Pressure scene began and I realised what was implied, I felt like I’d been hit by a truck and cried for hours lol.\n\nIs there a movie that hit you so hard you’ll never forget the emotions you felt while watching it?\n\n***Edit:*** *Wow I didn't expect this amount of comments! Thanks for sharing your recommendations and stories - I love hearing about people's personal experiences with movies. What a beautiful artform &lt;3*",
        "upvotes": 771,
        "comments": 2455,
        "media": null,
        "permalink": "/r/movies/comments/1i5lj3l/what_is_the_hardest_youve_ever_cried_in_a_movie/"
    },
    {
        "id": "1i6ahg5",
        "author": "Jondev1",
        "title": "Billy Wilder Essentials?",
        "content": "I saw the apartment for the first time recently and absolutely loved it. Was not familiar with Billy Wilder before but it has got me wanting to see more of his movies. From a brief look into what appears most notable, I've got Sunset Boulevard, Some Like it Hot, and Double Indemnity on my list. Anything else I should add?",
        "upvotes": 20,
        "comments": 18,
        "media": null,
        "permalink": "/r/movies/comments/1i6ahg5/billy_wilder_essentials/"
    },
    {
        "id": "1i5zpx0",
        "author": "ddm92392",
        "title": "Who are some actor and director duos you consider cinematic soul mates?",
        "content": "I was recently watching an old interview with Tony Scott and Denzel Washington for *Man on Fire* on YouTube. In the comment section, someone mentioned that they felt Tony and Denzel were cinematic soulmates, that no one could direct Denzel in an action thriller like Tony Scott, and the two just understood each other.\n\n**Who are some other pairs that you would consider cinematic soul mates?**",
        "upvotes": 70,
        "comments": 162,
        "media": null,
        "permalink": "/r/movies/comments/1i5zpx0/who_are_some_actor_and_director_duos_you_consider/"
    },
    {
        "id": "1i5h7vr",
        "author": "CalSwete",
        "title": "Movies to make 11 year old cry ",
        "content": "Hello,\n\nMy daughter (11f) and her friend (11f) are having a sleepover. They want to watch a movie to make them cry. So far we have tried A walk to Remember, Bridge to Terebithia, Titantic, the notebook, Marley and Me. No tears or anything. Just laughter. I think these girls have no souls. Any suggestions? We have to keep it pg-13 and below. Thanks! \nEdit for movies I forgot she watched at a different time:\n\n\nForgot they have seen most Disney movies prior- not Fox and the hound so will tell them that. \n\nHave also watched My girl with no tears \n\n\nSecond update: they have decided on Old Yeller. I will let you know. Also I made a mistake and my daughter’s friend cried at the end of A wall to Remember- so it’s just my daughter who has problems. \n\nThird update: they tried old Yeller but couldn’t get into it. Her friend hasn’t seen My girl and my daughter saw it a while ago so they are giving that a shot. \n\nWe watched the preview to Stepmom on Amazon and it wasn’t a real trailer so I couldn’t sell it. \n\nShe also got mad at me because I rounded her up to 11 and she is actually 10.8 years old and wants accurate recommendations based on her correct age. \n\n4th update. They finished my girl. Her friend cried. My daughter said she just couldn’t cry  she wanted to share this picture for all the my girl fans [https://imgur.com/a/dwobAmV](https://imgur.com/a/dwobAmV). Her friend is still crying from it and started crying when she read the speech. So there is hope for her. \n\nI just want to say my daughter has a dark sense of humor and loves to laugh but she is the sweetest kid. She is the first to offer help. Shes very kind and sweet. She helps her teacher during lunch. She also has a strong moral compass and compassion to animals and people. She stands up for her friends and her beliefs and is just a generally a great kid. I’m sure in a few years so will be a crier like me. Thank you all for your suggestions. We will make our way through a lot of these. \n\nI think tomorrow we will do a Schindler’s list family movie night. My husband is thrilled..\n\nI think we will have to do grave of the fireflies tomorrow as well. Lots of suggestions. I haven’t heard of it. ",
        "upvotes": 1365,
        "comments": 2605,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/30ToaVLV-n7TsjRkXp4hd-voX7pbxrh9eJy6jM140x4.jpg?auto=webp&amp;s=37cf99d38bc6a3c9c4e454312a68ab1d2d472936"
        },
        "permalink": "/r/movies/comments/1i5h7vr/movies_to_make_11_year_old_cry/"
    },
    {
        "id": "1i66c6u",
        "author": "racerx2oo3",
        "title": "A question about Furiosa: A Mad Max Saga",
        "content": "I know that there is often a bit of additional detail that gets generated surrounding the larger Mad Max universe that exists outside of just the movies themselves. Does anyone know if it’s ever explained how Dementus’s manages to keep an entire biker horde running without a clear source of guzzaline? While guzzaline is fairly common at the Citadel thanks to the proximity of gas town, Dementus and his horde appear to be unfamiliar with the existan e of either until they meet the war boy in the wasteland. \n\nJust wondering if this is covered anywhere? It’s bugged me since watching the movie. ",
        "upvotes": 23,
        "comments": 20,
        "media": null,
        "permalink": "/r/movies/comments/1i66c6u/a_question_about_furiosa_a_mad_max_saga/"
    },
    {
        "id": "1i5mqx1",
        "author": "StarWeaver84",
        "title": "I wish the next \"Big Thing\" in American cinema would be sci fi movies",
        "content": "Like a lot of others I was a fan of Marvel since 2008's \"Iron Man\" and Captain America: Brave New World looks good but recently I have lost a bit of enthusiasm for Marvel.\n\nI wish something new would become the next \"Big Thing\" in American cinema and I would prefer it to be sci fi movies.\n\nI think it would be awesome if we were living in a world where movie goers were excited to see a movie based on James S.A. Corey's \"Leviathan Wakes\" or something like it which warned against having corporations and governments gaining too much power and were inspired to put humanity on a brighter path.\n\nThere is an excellent TV show that was on Syfy but cancelled and then saved by Amazon called \"The Expanse\" but a movie would probably reach a bigger and wider mainstream audience.\n\nI think it would be cool if we were living in a world where the Mass Effect trilogy was getting a series of good big screen adaptations and were blowing people away with the new sci fi universe, aliens, and spaceships and showed people that \"Space Opera\" isn't just Star Wars or Star Trek.\n\nI think it would be cool to have Iain M. Banks's vision of the future, \"The Culture\" realized on the big screen.\n\nHopefully the success of the new Dune movies make Hollywood seriously think about giving us new sci fi movies.",
        "upvotes": 299,
        "comments": 205,
        "media": null,
        "permalink": "/r/movies/comments/1i5mqx1/i_wish_the_next_big_thing_in_american_cinema/"
    },
    {
        "id": "1i6bkvs",
        "author": "DivinesOmen",
        "title": "Year of Nolan 2025",
        "content": "Hey Everyone\n\nOver on r/ChristopherNolan and r/Nolan, we’re going to be doing a rewatch of every Chris Nolan movie, one for each month! So feel free to join us over there each month for discussions, letterboxd reviews, and Mount Rushmore’s. And needless to say we’re all excited for the Odyssey. Hope to see everyone over there!  \n\nJanuary - Following\n\nFebruary - Memento \n\nMarch - Insomnia \n\nApril  - Batman Begins \n\nMay - The Prestige  \n\nJune - The Dark Knight \n\nJuly - Inception \n\nAugust - The Dark Knight Rises \n\nSeptember - Interstellar \n\nOctober - Dunkirk \n\nNovember - Tenet \n\nDecember - Oppenheimer \n",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1i6bkvs/year_of_nolan_2025/"
    },
    {
        "id": "1i6cqfo",
        "author": "TumToes",
        "title": "Super good movies that don't show up in top lists?",
        "content": "Basically looking for movies that are a great watch, but didn't get super high ratings for whatever reason. And those type of movies your dad or something recommend that actually sucked you in more than you thought it would. I know it's very general, but that's what I want, thanks for any suggestions!",
        "upvotes": 4,
        "comments": 69,
        "media": null,
        "permalink": "/r/movies/comments/1i6cqfo/super_good_movies_that_dont_show_up_in_top_lists/"
    },
    {
        "id": "1i5w0kj",
        "author": "Skylinneas",
        "title": "One detail I really love about Speed Racer (2008)",
        "content": "To explain briefly, [Speed Racer (2008)](https://en.wikipedia.org/wiki/Speed_Racer_(film)) is a racing film directed by the Wachowskis (The Matrix, Cloud Atlas) and is an adaptation based on [a classic manga series of the same name](https://en.wikipedia.org/wiki/Speed_Racer) by Tatsuo Yoshida. It's a somewhat wacky movie with live-action anime/cartoon physics and over-the-top characters and action, but if you could look past all the silliness, there's actually a decent story that deals with corporate corruption, idealism versus pragmatism, a close family bond that can help one overcome any odds however impossible it seems to be, and a willingness to stand up and fight for what you believe in.\n\nWhich brings us to the titular Speed Racer himself. Speed (yes, that's his actual name) is an extremely skilled racer who over the course of the film has participated in four races. He won three out of these four races, but only the last one is the one that he *truly* won in my opinion.\n\nNow, we'll go into SPOILER territory:\n\nThe first race, the opening race at Thunderhead Raceway, has Speed pretty much *dominating* the competition and nobody really gives him a real challenge, except he's *not* racing against them: he's racing against the *ghost* of his late brother Rex, who was killed years ago and was Speed's idol who inspired him to become a racer. Up until the last part of the race, Speed almost managed to beat Rex's record, but that record was all that remained of Rex's memory, so Speed decided to slow down and let \"Rex\" win, thus keeping Rex's record as it is. Though he technically won the race, Speed still \"lost\" to Rex because he just didn't have it in his heart to erase his brother's memory away.\n\nIn the second race at Fuji Raceway, Speed Racer outright lost due to the machinations of Arnold Royalton, a corrupt corporate tycoon who fixed the race by paying other racers to take out Speed before he could reach the finish line. Pretty straightforward, this one is.\n\nThe third race is the infamous Casa Cristo 5000 rally, the race in which Rex was supposedly killed years ago. Speed went through so much trouble through this race, even facing his deep fear that he'd end up dead just like his brother, and finally managed to help his team to victory. However, his team partner - Taejo - was actually manipulating Speed and his family into helping him secure Taejo's father's company financially and he had never intended to help Speed and his allies bring Royalton to justice. So, while Speed technically did win the Casa Cristo race, he failed to achieve his long-term goal of taking down Royalton, and now Speed's own family is on the brink of being forced to go out of business.\n\nWhich finally brings us to the fourth and final climatic race, the Grand Prix. Taejo's sister - remorseful over what her brother and father did to Speed's family - decided to help Speed enter the Grand Prix at the last second, much to Royalton's fury. Speed Racer then singlehandedly took on *all the racers* on the racing roster who were tempted by Royalton's bounty on Speed's head. Against all odds, Speed won the race fair and square after a spectacular last lap, revealing that Royalton was crooked in the process. He finally achieved his hard-earned victory and changed the entire racing world for the better.\n\nBy holding off Speed's one genuine win for last, the movie makes Speed and his family's ultimate victory *very* cathartic after everything they've been through over the course of the film. In previous races, Speed is held back by various setbacks both personally and from outside factors, so even if he won some of the races technically, they didn't really feel like a \"win\".\n\nIt was not until the final race that there was nothing that held Speed back anymore, and Speed was free to give it his everything and quite literally fight the entire racing world to earn that victory. The entire last five minutes with all the flashbacks and characters motivating Speed as he gets back into the race after a temporary car breakdown and Michael Giacchino's soundtrack (God, that man's a genius at uplifting soundtracks) all emphasize how crucial a moment this is for Speed - how it's not only about him defeating Royalton and his corrupt company, but it's about overcoming every inner demons that plagued his mind up to that point.\n\nMaybe I'm looking too much into this for a movie that has a pretty mixed reception by critics, but as a fan of racing movies that don't really come by often, Speed Racer is admittedly one of my favorite movies growing up and the more I go back to see it, the more I feel how *genuine* the emotional elements in the movie is, and that's the reason why I decided to write this entire essay lol. Would love to know what fellow Speed Racer fans (however many of them there are lol) think about all this as well. :)",
        "upvotes": 49,
        "comments": 45,
        "media": null,
        "permalink": "/r/movies/comments/1i5w0kj/one_detail_i_really_love_about_speed_racer_2008/"
    },
    {
        "id": "1i5iegl",
        "author": "LollipopChainsawZz",
        "title": "How Greta Gerwig and IMAX Got Netflix to Flinch on ‘Narnia’ Release",
        "content": "",
        "upvotes": 523,
        "comments": 79,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XlWyn-t8einw7RBEnbFzw2_Lv-f0reU4Dg9OSREnk14.jpg?auto=webp&amp;s=72c795e0eb519639f82c665fdefa470d7df70a2d"
        },
        "permalink": "/r/movies/comments/1i5iegl/how_greta_gerwig_and_imax_got_netflix_to_flinch/"
    },
    {
        "id": "1i523bl",
        "author": "MarvelsGrantMan136",
        "title": "‘Moana 2’ Passes $1 Billion Globally",
        "content": "",
        "upvotes": 5139,
        "comments": 830,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nqnzC5tMGea2KEcZQ8qqRPc-vfyFufSvcbAZeZhnOF0.jpg?auto=webp&amp;s=733db49829f67b2691a27cf0ea42c331cbf00ea0"
        },
        "permalink": "/r/movies/comments/1i523bl/moana_2_passes_1_billion_globally/"
    },
    {
        "id": "1i5lrxl",
        "author": "Trufflesniffers",
        "title": "What was in John Matrix sandwich in the film Commando? ",
        "content": "Jenny serves him a sandwich and he asks what's in it when she replies \"you don't want to know\"\n\nWas she pranking him? ",
        "upvotes": 228,
        "comments": 152,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hBkY8Y5hj5p2xZH63GuS3ALrdjMRWDFqoitzWI8Gw60.jpg?auto=webp&amp;s=801050863fe2c22e1172d5d313b5743da3cd700e"
        },
        "permalink": "/r/movies/comments/1i5lrxl/what_was_in_john_matrix_sandwich_in_the_film/"
    },
    {
        "id": "1i5pttz",
        "author": "Foreign_Caregiver",
        "title": "What’s a movie you’ve watched that completely changed your perspective on life?",
        "content": "We all have that one movie that hits us on a deeper level and makes us rethink things. For me, it was Eternal Sunshine of the Spotless Mind. The way it explores love, memory, and the pain of loss left me thinking about my relationships in a different light.\n\nWhat’s a movie that had a similar impact on you? And why? I’m looking to expand my watchlist with films that resonate on a deeper level.",
        "upvotes": 72,
        "comments": 180,
        "media": null,
        "permalink": "/r/movies/comments/1i5pttz/whats_a_movie_youve_watched_that_completely/"
    },
    {
        "id": "1i6c9ar",
        "author": "InexperiencedCoconut",
        "title": "What is the deal with September 5? Postponed release dates and no showings to be found ",
        "content": "Saw the preview several months ago at the theater, which had a release date of November 29th. Well that day comes around and I want to see it, apparently they changed the date to December 13th. December comes around, I want to see it, turns out they made it a limited release and the rest of the world is January 17th. Now, it’s January, and I can’t find it showing ANYWHERE? What is the deal with this dang movie?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1i6c9ar/what_is_the_deal_with_september_5_postponed/"
    },
    {
        "id": "1i64msa",
        "author": "BringTheMilkDarling",
        "title": "Where my Jenkheads at?\n",
        "content": "Richard Jenkins is one of those actors who’s always great, no matter what he’s in. From playing Nathaniel Fisher on *Six Feet Under* to his hilarious turn in *Step Brothers*, he’s done it all: comedy, drama, you name it. His ability to bring depth to any role, big or small, is just incredible. Whether it's something weird like *The Cabin in the Woods* or intense like *Bone Tomahawk*, Richard nails it every time.\n\nSo, which of Richard Jenkins' roles do you think shows off his talent the best? Or is there a movie you love him in that no one talks about enough? Let’s get the conversation going, Jenkheads!",
        "upvotes": 10,
        "comments": 10,
        "media": null,
        "permalink": "/r/movies/comments/1i64msa/where_my_jenkheads_at/"
    },
    {
        "id": "1i5re2o",
        "author": "joesen_one",
        "title": "THR Writers Roundtable 2025 - Halina Reijn, James Mangold, Jason Reitman, Jesse Eisenberg, Justin Kuritzkes and Payal Kapadia",
        "content": "",
        "upvotes": 44,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/i20YUOQFMZIHCsmxjdidNxjgT3yp2_DoEH0YirT4SrI.jpg?auto=webp&amp;s=3c03513782529512f5208649c18e3222d1992130"
        },
        "permalink": "/r/movies/comments/1i5re2o/thr_writers_roundtable_2025_halina_reijn_james/"
    }
]