[
    {
        "id": "1myuw3q",
        "author": "lionsgate",
        "title": "Hey /r/movies, I’m Stephen King! Ask me anything about The Long Walk book or movie.",
        "content": "Hey r/movies, I’m Stephen King. You might know me from Stand By Me, It, or Shawshank Redemption, but my latest project is actually the first book I ever wrote. The Long Walk hits theaters on September 12. Ask me anything about the book or movie. \n\n**Trailer:**\n\n[https://www.youtube.com/watch?v=vAtUHeMQ1F8](https://www.youtube.com/watch?v=vAtUHeMQ1F8)\n\n&gt;In a dystopian United States ruled by a totalitarian regime, a group of young men enter an annual walking contest in which they must maintain a speed of at least three miles per hour or risk execution. The contest ends when only one walker remains alive.\n\nIt stars Cooper Hoffman, David Jonsson, Ben Wang, Charlie Plummer, Roman Griffin Davis, Garrett Wareing, Joshua Odjick, Tut Nyuot, Mark Hamill, Judy Greer, and Josh Hamilton. \n\nI'll be back on Wednesday 8/27 at 12:00 PM ET to answer your questions.\n\n",
        "upvotes": 45120,
        "comments": 7075,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/f0jbdlbzsvkf1.jpeg?auto=webp&amp;s=994a7d31fceff32a2f3fdb62f59b362dca6da8a7"
        },
        "permalink": "/r/movies/comments/1myuw3q/hey_rmovies_im_stephen_king_ask_me_anything_about/"
    },
    {
        "id": "1n03f21",
        "author": "SanderSo47",
        "title": "August 22-24 Box Office Recap – 'KPop Demon Hunters' makes history by debuting at #1 with $19.2M, the first Netflix film to achieve it. 'Honey Don't!' and 'Eden' disappoint in their debuts. 'F1' and 'Superman' cross $600M worldwide.",
        "content": "https://preview.redd.it/1h05hcmbi8lf1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=882372efef206439b03c971b604e3c84e25ca93f\n\nShowing that audiences will want to watch streaming films in theaters, ***KPop Demon Hunters*** managed to take the top spot at the box office, despite its very limited release. There were newcomers this week, but they all failed to make a single good impression, with ***Honey Don't***, ***Relay*** and ***Eden*** all disappointing. And A24's re-release of ***Ne Zha 2*** domestically massively flopped. It was also a big week to hit milestones, as both ***Superman*** and ***F1*** have crossed $600 million worldwide.\n\nThe Top 10 earned a combined $68.9 million this weekend. That's down 16.3% from last year, when ***Deadpool &amp; Wolverine*** stayed at #1, and stuff like ***Blink Twice*** and ***The Crow*** failed to impress.\n\n***KPop Demon Hunters*** managed to hit #1 with a pretty great $19.2 million. This is a very impressive result, considering it's been on Netflix for two months, it was playing in just 1,700 theaters (none of which includes AMC), and the film was only available for two days on theaters. It made history as the first Netflix Original to hit #1.\n\nThe film achieved this because it simply became a worldwide phenomenon. Who knows what were the expectations for this before it debuted, but not only did it become the most watched animated film in Netflix's history, but it has become the second most watched English-language film in the platform, being viewed 184.6 million times in the eight weeks following its premiere. And the music has also become massively popular, with \"Golden\" reaching #1 at the Billboard Top 100. All this popularity successfully convinced Netflix in launching sing-along screenings.\n\nYep, a fantastic result. But let's get something out of the way: Netflix is not gonna make this a norm. They refused to show actuals for this, so the figures had to be provided by other trade sources. And they're clearly content with leaving money on the table for theaters: the sing-along version is already available on Netflix today. Upcoming films like ***Frankenstein*** and ***Jay Kelly***? Only a few screenings before they hit Netflix and nothing else. It is what it is.\n\nWhile it had to cede the top spot, ***Weapons*** is still holding incredibly well. It eased just 37%, earning a further $15.4 million. The film has now earned $115.6 million domestically, and it still has one last week left before facing direct horror competition in ***The Conjuring: Last Rites***.\n\n***Freakier Friday*** eased just 38% and earned $8.8 million this weekend. The film has made $70.2 million, and it should benefit from Labor Day next week.\n\nIn fifth place, ***The Bad Guys 2*** dipped just 32%, earning $5.1 million. The film has amassed $66.1 million, and it's running eerily on par with the original through the same point. It should have another great hold next week thanks to Labor Day.\n\nAfter its very soft debut, ***Nobody 2*** appears to be fizzling out. It collapsed a very poor 60%, earning just $3.7 million this weekend. That drop is worse than the original, which dropped 56% on its second weekend. Through 10 days, it has made just $16.5 million, and it's now guaranteed to finish below the original's $27.5 million domestic total.\n\n***Superman*** eased 35%, for a $3.4 million weekend. The film's domestic total stands at $346.9 million, and it will cross the $350 million milestone by next week.\n\nIt's not until eighth place where we find another newcomer this week. That's Focus Features' release of Ethan Coen's ***Honey Don't***, which flopped with just $3 million in 1,317 theaters. That's above Coen's ***Drive-Away Dolls*** ($2.4 million), and that film had the advantage of opening in 2,280 theaters. But ***Honey Don't*** has the disadvantage of costing a hefty $20 million budget, which doesn't bode well for its profitability prospects.\n\nThe film lost so much buzz after its premiere in Cannes, where the film failed to impress critics. Reviews haven't really improved; it's sitting at a very weak 45% on RT. In order to get a chance, films like these need very strong reviews. It was reported that 54% of the audience was female. No CinemaScore, but the film had a horrible 1 1/2 stars and 28% definite recommend on PostTrak. Given that ***Drive-Away Dolls*** faded quickly, expect the same to happen to ***Honey Don't***. It'd be a surprise if it made anything past $7 million domestically.\n\n***The Naked Gun*** dropped just 39%, adding $2.9 million this weekend. The film has earned $47.6 million, and it should hit the $50 million milestone by next week.\n\nRounding out the Top 10 was ***Jurassic World Rebirth***, which dropped just 29% and added $2.1 million this weekend. The film's domestic total stands at $335.5 million.\n\nBleecker Street released ***Relay*** in 1,483 theaters, but the film flopped with just $1.9 million.\n\n***F1*** continues having great legs. It eased just 35% and added $1.7 million this weekend. The film has earned $185.8 million, and it will finish with around $190 million domestically.\n\nA24 decided to release an English-dubbed version of ***Ne Zha 2*** in 2,228 theaters. The subtitled film already made $17 million domestically, despite never playing in more than 800 theaters. But audiences were practically uninterested in this version, as the film flopped with just $1.7 million. That's one of the worst debuts for a film playing at 2,000 theaters, and translates to a paltry $695 per-theater average. It will disappear quickly from theaters.\n\nBut wait, there's actually another newcomer! That was Ron Howard's ***Eden***, which starred Jude Law, Ana de Armas, Vanessa Kirby, Sydney Sweeney, Daniel Brühl. Vertical released it in just 664 theaters, and so the film flopped with just $1 million. Nowhere close to its $50 million budget. It also achieved the absolute worst debut in Ron Howard's career, and that's just unadjusted.\n\nThe result is unsurprising. The film premiered back in TIFF, but it earned mixed reviews and struggled to find a distributor. Vertical only bought it a few months ago, but the marketing was very limited and the reviews (56% on RT) never moved the needle. Don't expect this to last long in theaters.\n\nNeon's ***Splitsville*** debuted in 5 theaters, earning $108,315 this weekend. That translates to an okay $21,663 per-theater average. Neon will expand it to wide release in September 5.\n\n#**OVERSEAS**\n\n***Demon Slayer: Kimetsu no Yaiba Infinity Castle*** added $32.5 million, taking its overseas run to a fantastic $242.5 million. The film made a killer debut in South Korea with a pretty great $12.6 million this weekend. It will continue adding more markets in the next few weeks.\n\n***Weapons*** added $13.2 million overseas, taking the worldwide total to $199.6 million. The best markets are the UK ($11.6M), Mexico ($7.5M), Spain ($5.7M), France ($5.6M) and Australia ($5.1M). Today, it will finally cross $200 million.\n\n***The Bad Guys 2*** added $12 million, for a $149.8 million worldwide total. It had a very good hold in China ($4.5M, just 32% off) and had a solid debut in Italy ($1.7M). The best markets are China ($16.4M), UK ($13.7M), France ($8.7M), Spain ($6.2M) and Mexico ($5.5M), and it has so many markets left.\n\n3 months after it released in practically everywhere, ***Final Destination: Bloodlines*** finally hit its... final destination, China, despite not a single film in the franchise playing in theaters there. It over-performed projections, opening with a pretty good $8.2 million. And that took its worldwide total to $295.5 million. After getting so close, the film will finally hit the $300 million milestone in the next few days.\n\n***Jurassic World Rebirth*** added $6.2 million overseas, for a $844.5 million worldwide total. The best markets are China ($79M), the UK ($47.3M), Mexico ($36.4M), Germany ($32.6M) and France ($28.4M).\n\n***Freakier Friday*** added $6.2 million, taking the worldwide total to $113.1 million. The best markets are the UK ($7.9M), Mexico ($7.6M), Australia ($3.3M), Argentina ($2.3M) and Colombia ($2.2M).\n\n***Materialists*** continues its great run overseas. This weekend, it added $6.2 million, allowing it to cross $85 million worldwide. It's already A24's fourth biggest ever worldwide, and it will cross the $100 million milestone eventually.\n\nWith $6.1 million this weekend, ***F1*** has officially crossed $600 million, tripling its budget. The best markets are China ($59.2M), South Korea ($35.2M), France ($30M), the UK ($29.7M) and Mexico ($19.9M). With exceptional holds, it still has a lot of gas left in the tank. In the next few days, it will pass ***Superman*** to become the sixth biggest film of the year.\n\n***The Fantastic Four: First Steps*** hit $5.8 million, taking its worldwide total to $490.5 million. The best markets are the UK ($29.5M), Mexico ($27.4M), France ($15.4M), Brazil ($13.5M) and Australia ($11.1M). It will pass $500 million next week, but it doesn't much left in the tank.\n\nWith $1.8 million overseas, ***Superman*** has finally crossed the $600 million milestone. Its worldwide total stands at $604.4 million.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nNone.\n\n#**THIS WEEKEND**\n\nThere's three newcomers opening, so it'll be a tight battle for #1, hoping to dethrone ***Weapons***.\n\nThe most likely will be Sony's release of Darren Aronofsky's ***Caught Stealing***, which stars Austin Butler, Regina King, Zoë Kravitz, Matt Smith, Liev Schreiber, Vincent D'Onofrio, Griffin Dunne, Bad Bunny, and Carol Kane. Aronofsky has been inconsistent at the box office, but this film is sold mostly as a crime with some comedy. Perhaps that will convince people to check it out.\n\nThere's also Searchlight's ***The Roses***, a new version of ***The War of the Roses***, now starring Benedict Cumberbatch and Olivia Colman. The 1989 film was a big hit, earning $160 million worldwide. But this is not getting to those numbers. Reviews aren't glowing (61% on RT), so there's gonna be a big battle for this to break out.\n\nAnd finally, there's Cineverse's ***The Toxic Avenger***, a new reboot of the franchise starring Peter Dinklage in the title role. The film premiered in festivals 2 years ago, but it struggled to find a distributor to its graphic content. Finally, Cineverse bought the film, promising to release it unrated in theaters. They've hit gold with the ***Terrifier*** franchise, but can they also succeed in resurrecting ***The Toxic Avenger***?",
        "upvotes": 164,
        "comments": 67,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6Tjs5HHRF3ye1X6RBGW7Bt-XRHOArhyrEGGeShCy1co.png?auto=webp&amp;s=6b1737fc9dd40edd9effe0de22059e933ffb71f5"
        },
        "permalink": "/r/movies/comments/1n03f21/august_2224_box_office_recap_kpop_demon_hunters/"
    },
    {
        "id": "1n04ceq",
        "author": "MarvelsGrantMan136",
        "title": "You Don’t Actually Own That Movie You Just “Bought.” A New Class Action Lawsuit Targets Amazon for Deceptive Practices",
        "content": "",
        "upvotes": 7520,
        "comments": 367,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VOCggGyEHOEJqYJawsw1oym8uz_z86jWSSsqCsPMCNI.jpeg?auto=webp&amp;s=dd118c6d0c5c14e2b013ee8e8825f5d673c3b4be"
        },
        "permalink": "/r/movies/comments/1n04ceq/you_dont_actually_own_that_movie_you_just_bought/"
    },
    {
        "id": "1mzxvy4",
        "author": "MarvelsGrantMan136",
        "title": "New Image of Mads Mikkelsen in Bryan Fuller's 'Dust Bunny' - Follows an eight-year-old girl who asks her neighbor (Mikkelsen) for help to kill the monster under her bed who ate her family.",
        "content": "",
        "upvotes": 15512,
        "comments": 375,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/tocs7v0wg7lf1.jpeg?auto=webp&amp;s=1f53d87d4574f622ce5fc5b31a7357b465cd8fe5"
        },
        "permalink": "/r/movies/comments/1mzxvy4/new_image_of_mads_mikkelsen_in_bryan_fullers_dust/"
    },
    {
        "id": "1mzua9j",
        "author": "MarvelsGrantMan136",
        "title": "‘The 40-Year-Old Virgin’ Turns 20: Judd Apatow on Controversial Scenes and the Studio Shutting Down Production",
        "content": "",
        "upvotes": 4768,
        "comments": 604,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/DVTJS-UzHG86kRHYtQiaCjbiqttPBKj9X9LbatHekoQ.jpeg?auto=webp&amp;s=a32fb1f465ece87e673fb7ccb7192b614ad3c9b4"
        },
        "permalink": "/r/movies/comments/1mzua9j/the_40yearold_virgin_turns_20_judd_apatow_on/"
    },
    {
        "id": "1mzw8iy",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'The Long Walk' - In a dystopian United States ruled by a totalitarian regime, a group of young men enter an annual walking contest in which they must maintain a speed of at least three miles per hour or risk execution. The contest ends when only one walker remains alive.",
        "content": "",
        "upvotes": 2616,
        "comments": 530,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1mn7reb067lf1.jpeg?auto=webp&amp;s=3e757ce6ea68285499ed5075097d085cff6379c1"
        },
        "permalink": "/r/movies/comments/1mzw8iy/new_poster_for_the_long_walk_in_a_dystopian/"
    },
    {
        "id": "1n0ckz0",
        "author": "HapaHawaii",
        "title": "Scene from \"There Will Be Blood\". Most realistic representation of a malignant narcissist I've ever seen. The side of their personality only those in their most intimate circle have to endure.",
        "content": "https://youtu.be/BtFp_teUWr8?si=DDHud5ut7Aad7W-d\n\nThis side comes out worse when they have driven everyone away and are throwing daggers at those where they no longer have power.\n\nMany get deep into alcohol and it just intensifies everything. \n\nStating the obvious that Daniel Day Lewis is amazing. I know there was a novel, but Jesus, how did he channel this character and his destruction so perfectly. \n\nWas watching videos of Tarantino talking about this movie and his love and respect for it. Watched this scene with fresh eyes and it just reminds me of the few but deranged narcissists I've had in my life. \n\nPerfect scene of a narcissist in full abuse mode.\n\nAlso, the end of that scene where Daniel is fatherly, and they have a close relationship is what makes a relationship with a malignant narcissist so painful. \n\nThere were good times. There were great times. But the narcissists are programmed to discard, and those in their wrath and path are made to feel like actual garbage that can be thrown away. \n\nIts confusing. Lewis just nails it",
        "upvotes": 213,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0z9bgCRau1xbqargY_ITN-khRi-gaCFJSrFrFDdrErQ.jpeg?auto=webp&amp;s=e917a994009bec1664d4fe0240b725e52ae9fc8a"
        },
        "permalink": "/r/movies/comments/1n0ckz0/scene_from_there_will_be_blood_most_realistic/"
    },
    {
        "id": "1mzqo8t",
        "author": "BunyipPouch",
        "title": "New Poster for Dark Comedy-Thriller 'No Other Choice' - Directed by Park Chan-Wook ('Oldboy', 'The Handmaiden', 'Decision to Leave') - After being unemployed for several years, a man devises a unique plan to secure a new job: eliminate his competition.",
        "content": "",
        "upvotes": 2887,
        "comments": 96,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hn5gooaq46lf1.jpeg?auto=webp&amp;s=deeb7de6b6420c4ee2585bfe76bbdffef3c48578"
        },
        "permalink": "/r/movies/comments/1mzqo8t/new_poster_for_dark_comedythriller_no_other/"
    },
    {
        "id": "1n00baf",
        "author": "Amaruq93",
        "title": "\"Desperado\" at 30: Robert Rodriguez's hybrid of Western tropes and Hong Kong action sensibilities makes it surprisingly timeless",
        "content": "",
        "upvotes": 722,
        "comments": 53,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Z4UeQUQ5urnDJZqLt5Sk-KGUZ4evD1QbXfHYQeNNBGE.jpeg?auto=webp&amp;s=dca7d33b795d1fabc32a8da2f49fcaac5e6675b8"
        },
        "permalink": "/r/movies/comments/1n00baf/desperado_at_30_robert_rodriguezs_hybrid_of/"
    },
    {
        "id": "1n0ebmr",
        "author": "cat-pernicus",
        "title": "Which actor was so good at being a villain you still don’t like them",
        "content": "Spin off the post that talks about which villain almost made you root for them , which actor was just sooooo very good at doing his job that you can’t just see them as that first character and you still hate them for it\n\nJoaquin Phoenix with his thumb down in Gladiator, to this day, can’t see him as a good guy, ugh\n\n",
        "upvotes": 69,
        "comments": 261,
        "media": null,
        "permalink": "/r/movies/comments/1n0ebmr/which_actor_was_so_good_at_being_a_villain_you/"
    },
    {
        "id": "1n083j6",
        "author": "EntertainmentQuick47",
        "title": "Weirdest actor pairings in movies?",
        "content": "As in: films that contained two actors who you would never imagine working together\n\nFor example, Red Heat starring Jim Belushi and Arnold Schwarzenegger. Even for the 80s that does not sound like a real movie.\n\nAnother buddy cop comedy: 2002’s Bad Company with Chris Rock and Anthony Hopkins. If someone told me that an actor from Grown Ups stared alongside the star of Hannibal. \n\nOf course there’s the late Gene Hackman’s final film, Welcome to Mooseport. Staring Hackman with…Ray Romano? What?\n\nAlso seeing Margaret Qualley in Happy Gilmore 2 was something I would’ve never guessed. Also Jack Nicholson and John C Riley both being in Adam Sandler’s Anger Management seems random as hell. \n\nAnd as much as I love Captain America: The Winter Soldier, having Robert Redford in a Marvel movie with Chris Evans is pretty weird. Almost as weird as Edward Norton being in Sausage Party along with Seth Rogen, Kristen Wiig, Michael Cera and others. ",
        "upvotes": 140,
        "comments": 210,
        "media": null,
        "permalink": "/r/movies/comments/1n083j6/weirdest_actor_pairings_in_movies/"
    },
    {
        "id": "1mzo9y8",
        "author": "BunyipPouch",
        "title": "New Poster for Psychological-Horror 'Bone Lake' - When two young couples are mistakenly double-booked into the same vacation rental, their romantic weekend becomes a twisted maze of sex, lies, and survival.",
        "content": "",
        "upvotes": 1100,
        "comments": 253,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/tz4iza4qk5lf1.jpeg?auto=webp&amp;s=7f0691583a6319df466dc14c2fafbf97e71b77c4"
        },
        "permalink": "/r/movies/comments/1mzo9y8/new_poster_for_psychologicalhorror_bone_lake_when/"
    },
    {
        "id": "1n090zp",
        "author": "SeanSpawn23",
        "title": "Which directors have a filmography where all movies have the same vibe?",
        "content": "Pretty self-explanatory, I'm looking for directors who maintain the same vibe in all of their films. The genre doesn't matter. I'm not savvy on the subject so I can't provide any examples. I want to watch a directors filmography and have the same sort of experience with all of the films. I don't know if this is realistic or not, please help! Edit: by \"vibe\" I mean the same kinda cinematography and story-telling or character development ",
        "upvotes": 75,
        "comments": 285,
        "media": null,
        "permalink": "/r/movies/comments/1n090zp/which_directors_have_a_filmography_where_all/"
    },
    {
        "id": "1mzqvvq",
        "author": "kel89",
        "title": "What Movie Would You Show To A Class of 15-16 Year Old Boys That Demonstrates The Hero’s Journey In A Way That Is Teachable?",
        "content": "I’m teaching a group of 15-16 year old boys this year and I am doing a Film Studies Module. I have decided to focus on the Hero’s Journey as a theme and am looking for recommendations.\n\nThe first that come to mind are Star Wars, Karate Kid, Moana. I would be interested to hear ideas I haven’t thought of, that are both appropriate and engaging enough for them to stay interested.\n\nThanks!",
        "upvotes": 683,
        "comments": 1419,
        "media": null,
        "permalink": "/r/movies/comments/1mzqvvq/what_movie_would_you_show_to_a_class_of_1516_year/"
    },
    {
        "id": "1n05ix9",
        "author": "Loose-Tangelo",
        "title": "Watching Master &amp; Commander is like catching up with old friends",
        "content": "I remember watching an interview with Tarantino a while ago and he talks about how whenever he watches Dazed &amp; Confused for him it's like catching up with old friends, which got me thinking about what film that is for me. I can firmly say that nothing beats hitting play and watching those opening words \"Oceans are Now Battlefields\" and then spending the next 2 hours with Lucky Jack and the rest of the gang.",
        "upvotes": 117,
        "comments": 33,
        "media": null,
        "permalink": "/r/movies/comments/1n05ix9/watching_master_commander_is_like_catching_up/"
    },
    {
        "id": "1mznouj",
        "author": "Fragrant-Baby-2277",
        "title": "Official poster for The Cabinet of Dr. Caligari (1920)",
        "content": "The Cabinet of Dr. Caligari (German: Das Cabinet des Dr. Caligari) is a 1920 German silent horror film directed by Robert Wiene and written by Hans Janowitz and Carl Mayer. The quintessential work of early German Expressionist cinema, it tells the story of a hypnotist (Werner Krauss) who uses a somnambulist (Conrad Veidt) to commit murders.",
        "upvotes": 863,
        "comments": 53,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/lxs91kd8g5lf1.jpeg?auto=webp&amp;s=1e59981fce7f74e870371b3e82ffbc8b23e59db5"
        },
        "permalink": "/r/movies/comments/1mznouj/official_poster_for_the_cabinet_of_dr_caligari/"
    },
    {
        "id": "1n052de",
        "author": "ChangeUsername220",
        "title": "20 Days in Mariupol - Full Documentary (Academy Award Winner)",
        "content": "",
        "upvotes": 99,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IBMAjYrJ8CRxZso4_VAlg04pDHTWnUxsC8ynudafJbA.jpeg?auto=webp&amp;s=e446ed379f033086324566f08b7ccd87909cca28"
        },
        "permalink": "/r/movies/comments/1n052de/20_days_in_mariupol_full_documentary_academy/"
    },
    {
        "id": "1mznt8z",
        "author": "darth_vader39",
        "title": "Francis Ford Coppola Set to Honor Warner Herzog During Venice Film Festival Opening Ceremony",
        "content": "",
        "upvotes": 750,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/x-CwmjPFacaB_GBwCu-VZhGtPIt4_hhnAIYtvonU8P0.jpeg?auto=webp&amp;s=e174dfe06e90f606d7834532df1be1d9f4bfcb07"
        },
        "permalink": "/r/movies/comments/1mznt8z/francis_ford_coppola_set_to_honor_warner_herzog/"
    },
    {
        "id": "1n05clk",
        "author": "Immediate-River-874",
        "title": "Richard E Grant in Withnail and I - “What a piece of work is a man”",
        "content": "",
        "upvotes": 70,
        "comments": 27,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/94snfh15w8lf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1n05clk/richard_e_grant_in_withnail_and_i_what_a_piece_of/"
    },
    {
        "id": "1n0dfvh",
        "author": "jesepy",
        "title": "Which villain was so well written you almost rooted for them?",
        "content": "I was watching a movie recently and caught myself almost rooting for the villain. Not that they were cool but bc their motives and perspective felt so believable and real. It got me thinking some of the best villains aren’t just evil, they’re complex enough to make us question whose side we’re on. Which movie villain was written so well that you found yourself empathizing with them, even just for a moment?",
        "upvotes": 18,
        "comments": 111,
        "media": null,
        "permalink": "/r/movies/comments/1n0dfvh/which_villain_was_so_well_written_you_almost/"
    },
    {
        "id": "1mzsudl",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Shane Black's 'Play Dirty' - Follows a thief and his crew who come across a major heist that pits them against a South American dictator, the New York mob and the world’s richest man.",
        "content": "",
        "upvotes": 190,
        "comments": 147,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0y8gzi55k6lf1.jpeg?auto=webp&amp;s=f7ad3e81bb802952b2e7782b4889bbe51f82c447"
        },
        "permalink": "/r/movies/comments/1mzsudl/official_poster_for_shane_blacks_play_dirty/"
    },
    {
        "id": "1mztcur",
        "author": "NoCulture3505",
        "title": "Bone Lake - Official Trailer (2025)",
        "content": "",
        "upvotes": 147,
        "comments": 56,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/W4nJO0rs8Ha3M6rsWOp96zHDHHfqlYSXLdtsn0xop9I.jpeg?auto=webp&amp;s=711f68031047975a1db91dd3b888ba01cf1adf99"
        },
        "permalink": "/r/movies/comments/1mztcur/bone_lake_official_trailer_2025/"
    },
    {
        "id": "1n0g95e",
        "author": "LurkerBigBangFan",
        "title": "What’s your favorite movie that was ruined by bad casting?",
        "content": "There are a lot of movies that might not have been great to begin with, but were pushed over the edge by miscasting. Sometimes all it takes is one role that doesn’t fit.\n\nFor me, Gangs of New York is a big one. And surprisingly, Terminator Genisys too. It might have been a bad (or even average) movie on its own, but casting Jai Courtney as Kyle Reese, a character meant to be a hardened survivor, just killed it completely. \n\nWhat movies do you think were ruined by casting choices?",
        "upvotes": 4,
        "comments": 11,
        "media": null,
        "permalink": "/r/movies/comments/1n0g95e/whats_your_favorite_movie_that_was_ruined_by_bad/"
    },
    {
        "id": "1mz3kxn",
        "author": "MarvelsGrantMan136",
        "title": "First Image from ‘The Dink’ - Jake Johnson stars as a washed-up tennis pro who, desperate to save a struggling club and earn his father’s respect, is compelled to break a sacred vow and do the unthinkable: play pickleball",
        "content": "",
        "upvotes": 3763,
        "comments": 306,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gl9oja9lh0lf1.jpeg?auto=webp&amp;s=6c8c6ceb699cd8a108c954982a4f5b507f820a3d"
        },
        "permalink": "/r/movies/comments/1mz3kxn/first_image_from_the_dink_jake_johnson_stars_as_a/"
    },
    {
        "id": "1mz14py",
        "author": "paxinfernum",
        "title": "For 25 Years, No One Has Dared Do Serial Killer Movies Like The Cell",
        "content": "",
        "upvotes": 4650,
        "comments": 468,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pa15QW_a55KqM5TD04dCQfJcgLMcaGRwM08kkFAxY0U.jpeg?auto=webp&amp;s=83cf371915a70d998695e65879b70cc17c447b4f"
        },
        "permalink": "/r/movies/comments/1mz14py/for_25_years_no_one_has_dared_do_serial_killer/"
    },
    {
        "id": "1mzpwf8",
        "author": "redditvlli",
        "title": "Kontroll (2003) - The Rail Run",
        "content": "",
        "upvotes": 98,
        "comments": 113,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/sedvdwavy5lf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1mzpwf8/kontroll_2003_the_rail_run/"
    },
    {
        "id": "1mzslj1",
        "author": "BunyipPouch",
        "title": "Dragon Studios, Home To ‘Willow’ &amp; ‘Havoc’ Shoots, Facing Closure Threat Over Unpaid Tax Bill",
        "content": "",
        "upvotes": 65,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rzyKFQUI1h8Q9X2UKAiK6gByyIW8gnn-LMQBJLigbMI.jpeg?auto=webp&amp;s=1e04ff73b5a3beaa3e80b5620d7c8885cd047e92"
        },
        "permalink": "/r/movies/comments/1mzslj1/dragon_studios_home_to_willow_havoc_shoots_facing/"
    },
    {
        "id": "1mzgqzu",
        "author": "MoneyLibrarian9032",
        "title": "‘Sinners’ Director Ryan Coogler and Artist Mary Corse to Be Honored at LACMA Art+Film",
        "content": "",
        "upvotes": 428,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/oLN6fSrtZzTmSdBrbZCdX_FMjgAtLj7iwK58i5CiAQY.jpeg?auto=webp&amp;s=cee89bc5ebb202e5d69a4fa4c33b7d605bbe4126"
        },
        "permalink": "/r/movies/comments/1mzgqzu/sinners_director_ryan_coogler_and_artist_mary/"
    },
    {
        "id": "1n0brj8",
        "author": "van_0270",
        "title": "Visuals - F1 (2025) | IMAX",
        "content": "",
        "upvotes": 5,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BGgFO3bh8YqUtIIy6_eQZah505FwSFjvyxGBH8Jngbw.jpeg?auto=webp&amp;s=d863f5c0d81c07d97beae601ce907d4d28d15a7c"
        },
        "permalink": "/r/movies/comments/1n0brj8/visuals_f1_2025_imax/"
    },
    {
        "id": "1mzw0nz",
        "author": "MoneyLibrarian9032",
        "title": "First trailer for ‘100 NIGHTS OF HERO’, starring Maika Monroe, Emma Corrin, Nicholas Galitzine, Felicity Jones and Charli XCX The film follows a guest who arrives at a castle &amp; makes chaos between a neglectful husband, his bride and their devoted maid.",
        "content": "",
        "upvotes": 37,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pVrSQpQ_239JgnOeiDrPZ2iNn6egOaLLMjk_mn9lLtg.jpeg?auto=webp&amp;s=6bf430b02da8e03a3a1e028a9c9c6bc351a4245a"
        },
        "permalink": "/r/movies/comments/1mzw0nz/first_trailer_for_100_nights_of_hero_starring/"
    }
]