[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 493,
        "comments": 258,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1ih14np",
        "author": "HarperLovey",
        "title": "Any one else canceling due to price increases?",
        "content": "Had to cancel this month as rate went up to just shy of $30/mo (with taxes added in)!  I remember paying something like $12.99/mo.  Even that was a stretch back then. I've always enjoyed Netflix programming, but just can't justify the price anymore. $300/year is just not realistic. ",
        "upvotes": 135,
        "comments": 112,
        "media": null,
        "permalink": "/r/netflix/comments/1ih14np/any_one_else_canceling_due_to_price_increases/"
    },
    {
        "id": "1igr62h",
        "author": "DemiFiendRSA",
        "title": "Cobra Kai: Season 6 Part 3 | Final Trailer | Netflix",
        "content": "",
        "upvotes": 64,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1igr62h/cobra_kai_season_6_part_3_final_trailer_netflix/"
    },
    {
        "id": "1ih4yl9",
        "author": "Wonderful_Act3430",
        "title": "This is ridiculous",
        "content": "Me and my mom are away from home. She’s at a work thing and I’m watching Netflix out of nowhere in the middle of my show. It tells me that the TV is a part of the Netflix household is now telling me to pay more or make a new account and pay. What is this bull ",
        "upvotes": 10,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1ih4yl9/this_is_ridiculous/"
    },
    {
        "id": "1ih07ip",
        "author": "lazybearcreations",
        "title": "Anyone else feeling that the new UI is terrible?",
        "content": "I was using Netflix on the TV with the options positioned on the left side of the screen, showing categories and everything I needed to find what I want to watch.\nNow I open the app in the last few days and the options have moved to the top of the screen and the categories are gone.\nSearch is there but just not really that helpful if you want to discover new things.\nScrolling endlessly through nearly full screen sections is quite frustrating when none of them are really what I am looking for.\nI am feeling like it is a mis-step but I am open to hear if I am just not seeing the benefits here…",
        "upvotes": 12,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ih07ip/anyone_else_feeling_that_the_new_ui_is_terrible/"
    },
    {
        "id": "1ihc1gf",
        "author": "psuitable_pseudonym",
        "title": "New category \"Swipe Left\"",
        "content": "So swiping left on dating apps means not interested and funny enough it's shit I had/have zero interest in watching or things I watched but didn't thumbs up or double thumb.\n\nWhy would they...  what were they thinking?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ihc1gf/new_category_swipe_left/"
    },
    {
        "id": "1ihbq0y",
        "author": "forevony_0904",
        "title": "Recommendations",
        "content": "\n\n\n\nCan anyone recommend series for me that depict mental health. I have seen shows like \nAnd autism representation \n\n\nSpinning out,\nGinny and Georgia,.\nSkins,\nNever have I ever,\nHeartbreak high\nAtypical \n\n\nEtc. .  Anyone see series like that that I can watch about mental health representation....any recommendations would be greatly appreciated ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ihbq0y/recommendations/"
    },
    {
        "id": "1ihdc7a",
        "author": "Moon_Frost",
        "title": "Still no way to easily restart a series?",
        "content": "It's been years... Is the only way really for me to go on my computer and log in and browse through settings to try to do it that way? I'm just trying to re-watch all of Love, Death, Robots on my tv. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ihdc7a/still_no_way_to_easily_restart_a_series/"
    },
    {
        "id": "1ihadzp",
        "author": "IcyOutside4567",
        "title": "I’m an added member but won’t let me watch",
        "content": "I use my sisters Netflix and I’m at a different address/wifi so I pay $9 a month on her account to be able to use it at my house. When I went to watch Netflix tonight it says my device isn’t part of the Netflix household. I double checked the account and I’m still the recipient of the extra member spot. How can I fix this? \n\nThere’s nothing to click on the screen other than to login to another account or to update the household",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1ihadzp/im_an_added_member_but_wont_let_me_watch/"
    },
    {
        "id": "1igpkrg",
        "author": "pontiuspilate01",
        "title": "The Night Agent – Great Writing, Wooden Acting?",
        "content": "I’m currently on Season 1, Episode 7, and I’m still trying to understand the hype. The writing is slightly engaging—it knows how to keep you hooked with well-paced cliffhangers. But the acting? Yikes. It feels wooden, overly staged, and completely devoid of nuance, like a table read that somehow made it to the final cut. Some scenes are so stiff it’s almost impressive.\n\nI’m pushing through because I want to see if there’s a real payoff, but so far, it feels like a show that succeeds despite its cast rather than because of it. \n\nDoes it get better, or is this just what I signed up for?",
        "upvotes": 13,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1igpkrg/the_night_agent_great_writing_wooden_acting/"
    },
    {
        "id": "1ih3otz",
        "author": "Daxel79",
        "title": "Need some new movie recommendations please?",
        "content": "We like thrillers, psychological thrillers, comedies,raunchy comedies, or just flat out weird movies please. We don’t watch kids or SciFi movies. Thanks in advance for any recommendations!!!😁😁😁",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ih3otz/need_some_new_movie_recommendations_please/"
    },
    {
        "id": "1ih7n1d",
        "author": "Biolore",
        "title": "Recommendations from wrong profile",
        "content": "Today when I opened Netflix the recommendations were loaded with kdramas, which I don't watch amany of but my wife does. There was even a \"Because you watched Litte Women\", which I confirmed is not in my viewing history. Nor are there any kdramas in my viewing history in the past year.\n\nWhat gives?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ih7n1d/recommendations_from_wrong_profile/"
    },
    {
        "id": "1ih7mx4",
        "author": "Countrygalsy",
        "title": "WWE on Netflix - anyone else notice the glitches on the interviews in-between the matches?",
        "content": "During CM punk interview with one of the side girls the screen kept flickering. Don't know if that was Netflix. And it just did it during the women's fight too. Seems like they r having trouble tonight might be the cuz they are in Cleveland yet could be anything. ",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1ih7mx4/wwe_on_netflix_anyone_else_notice_the_glitches_on/"
    },
    {
        "id": "1ih1ksi",
        "author": "no_more_muffins",
        "title": "Any way to force the new UI for Netflix?",
        "content": "Hello,\n\n  \nI am watching Netflix with an Android TV box and I would like to use the new UI. Is there any way to force this update? I have not opted out from the beta program so I was expecting the get the new UI eventually but it seems not to happen.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ih1ksi/any_way_to_force_the_new_ui_for_netflix/"
    },
    {
        "id": "1ih6kk7",
        "author": "jeanettiotato",
        "title": "Please help me find this song",
        "content": "The movie is Dog Gone Trouble. The scene is right in the beginning, the first song that plays during the montage where Trouble greets his owner/companion every morning. I literally typed in the lyrics word for word on Google from the subtitles on this movie and it’s like it doesn’t exist???! I liked the song and it got stuck in my head every time my kids watched it and now it’s just bothering me at this point. Pleeeeease someone help! \n\nLyrics if this helps:\n\nI’ve got a pep in my step\nFrom the way that you hold me\nIf this is love, well nobody told me\nIt was so\nMm, mm, mm, so\n\nAnd it’s all about us\nWe do whatever we want\nSo good, we’re finally finding the love\n\nI wanted to walk by your side, walk by your side\nWalk with me, cause it’s all about is\nI wanted to walk by your side, walk by your side\nWalk with me, cause it’s all about us\n\nIt’s all about us, whoo-ooh,\nIt’s all about us \n\nEtc. \n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ih6kk7/please_help_me_find_this_song/"
    },
    {
        "id": "1igzc0d",
        "author": "Celebril63",
        "title": "Netflix only got the first season of Find Me In Paris?  How did that even happen?",
        "content": "My wife found the first season adorable.  However, Netflix only got the first season.  If I had to describe it in 25 words or less, it be \"What if Glee and Dr. Who has a love child?\"\n\nWhat I'd really like to know is how they even managed to get season 1?  The show is actually a Disney+ / Hulu production.  This just doesn't make any sense.  ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1igzc0d/netflix_only_got_the_first_season_of_find_me_in/"
    },
    {
        "id": "1igvq72",
        "author": "J-20-7000",
        "title": "Where is the Chinese audio option?",
        "content": "I'm learning Chinese and it would help greatly to watch my favourite shows in Chinese audio. But for some reason this language isn't on Netflix for what I've found. Why is this and am I wrong that it's not on the site? I know that I can change the interface but that doesn't change the audio.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1igvq72/where_is_the_chinese_audio_option/"
    },
    {
        "id": "1ifxqvy",
        "author": "dailystar_news",
        "title": "Squid Game star Lee Joo Sil dies in hospital after cancer battle as tributes paid to actress",
        "content": "https://www.dailystar.co.uk/showbiz/breaking-squid-game-star-dies-34599173",
        "upvotes": 539,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1ifxqvy/squid_game_star_lee_joo_sil_dies_in_hospital/"
    },
    {
        "id": "1ih3v6x",
        "author": "maqjoujou7",
        "title": "I wish they would change the subtitles..",
        "content": "Mostly, it’s fine. But when I’m watching a show in another language and need subtitles, I cannot read em AT ALL. White on white isn’t exactly something I can see very clearly….",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ih3v6x/i_wish_they_would_change_the_subtitles/"
    },
    {
        "id": "1ih8iwl",
        "author": "ThinParfait7236",
        "title": "Netflix pricing plans need an addon",
        "content": "Netflix's success stems from its strong content library, user-friendly interface, and effective recommendation system. However, as the platform continues to grow and pass on rising costs to subscribers, it should consider making its live streaming service an optional add-on. This would prevent the price of live streaming from being unfairly imposed on all users.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ih8iwl/netflix_pricing_plans_need_an_addon/"
    },
    {
        "id": "1ihbd4y",
        "author": "Electronic-Host-6306",
        "title": "Cobra Kai part 3 reaction and review . Please check it out 🙏🙏",
        "content": "If u like it please subscribe !!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ihbd4y/cobra_kai_part_3_reaction_and_review_please_check/"
    },
    {
        "id": "1igl9aw",
        "author": "Royal-Emu5226",
        "title": "Logged Out Due to Diff IP Address. Any Similar Issues Here?",
        "content": "Our Netflix account was locked out due while attempting to update the Netflix Household. The account was accessed from a different IP address and we couldn’t proceed to making the update despite going through multiple SMS approvals (see attached screenshots). Note that despite many approvals via SMS, we were not able to make any changes to the said account. We also indicated that we’re “traveling” \n\nHas anyone had any similar experiences? May I ask how you resolved the issue? Thanks",
        "upvotes": 9,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1igl9aw/logged_out_due_to_diff_ip_address_any_similar/"
    },
    {
        "id": "1igz829",
        "author": "Diligent_Lemon21",
        "title": "Just me or are the subtitles for Perfect Match not making sense?",
        "content": "Honestly despite watching until episode 19 now, I feel like I’m missing something. It’s confusing sometimes, the subtitles feels off and doesn’t make sense. Overall, I get the plot but… I don’t know is it just me or anyone else struggling to understand the drama because of the subtitles on Netflix?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1igz829/just_me_or_are_the_subtitles_for_perfect_match/"
    },
    {
        "id": "1igsu03",
        "author": "Zdog54",
        "title": "No audio on all Netflix content?",
        "content": "For whatever reason last night the audio on Netflix just completely stopped working. I've tried restarting the TV, uninstall and re-download Netflix and it still has zero audio for some reason. Can't figure it out for the life of me. I went into Netflix through the PS5 and the audio works perfectly fine so something is wrong with the TV netflix app. If anyone can help with this I would greatly appreciate it!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1igsu03/no_audio_on_all_netflix_content/"
    },
    {
        "id": "1igx95r",
        "author": "Any-Razzmatazz-8285",
        "title": "Why did these roomates in “Worst Roomate Ever” stay so long?!",
        "content": "I’m watching “Worst Roomate Ever” on Netflix, episode “Roomate Wanted Part 2”. And I can’t help but think HOW do these people put up with these crazy roomates for so long. The one episode *spoiler* said the FIRST night mans moved in he slept with his dead dog? Why didn’t that lady kick that psycho out that day or move out that day?! She proceeded to let him stay and he proceeded to *spoiler* unalive her dogs. I would never in a million years let someone sleep with their dead animal in a house I was also sleeping in WTF?! Then the episode I’m watching now, this lady is throwing a party to make her roommate “uncomfortable” in hopes he will leave… girl if you don’t call yo homeboys or cousins to come drag this mans out… she extra asl having people loud partying and blowing cigarette smoke under his door.. like poor me please leave. Hell no girl that’s YOUR house and ur just sitting around hoping he gone leave? I’d drag a mf out physically and yes I know some of the roomates are murderers that’s why I said bring yo peoples to help you. It’s just crazy what these people allow and put up with.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1igx95r/why_did_these_roomates_in_worst_roomate_ever_stay/"
    },
    {
        "id": "1iggrok",
        "author": "Pll_dangerzone",
        "title": "A Good Girls Guide to Murder is a pretty decent Murder Mystery",
        "content": "I gave this a shot as it was a short series and I was pleasantly surprised. It could have played it safe and cookie cutter but there were some real shocks and it did not shy away from touching on some pretty mature subject matter. These kids are supposedly in high school man. The acting was all excellent, with the main girl a real standout. Only annoying bit was in the last few episodes that girls self preservation went out the window. Never read the books and don’t know where the story goes from here but I hope it gets a season 2",
        "upvotes": 16,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1iggrok/a_good_girls_guide_to_murder_is_a_pretty_decent/"
    },
    {
        "id": "1igfkt2",
        "author": "flyingrummy",
        "title": "How do you find new shows to watch on Netflix?",
        "content": "I check Netflix once month maybe (I don't pay that bill since I cover other bills.) for something new and maybe find one show I want to watch on there a year. How do you find new random stuff to watch? Aside from finishing shows I didn't finish when I had cable in the early 2000s, everything else just seems to be a cheaply made cookie cutter clone of an idea done to death (Magic academy for kids, detective with a weird quirk, special ops guy beats up street criminals, foreign soap opera.) The homepage shows the same shows/movies in 6 different categories, and pretty much after 2 hours of browsing I just end up putting on a documentary I half-watch while browsing reddit.\n\nTLDR: Any tips on how to navigate Netflix and find new stuff? It really seems designed layout-wise to advertise a small selection of shows Netflix wants you to watch instead of letting me discover something truly new to watch.",
        "upvotes": 17,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1igfkt2/how_do_you_find_new_shows_to_watch_on_netflix/"
    },
    {
        "id": "1ifkjbm",
        "author": "Thin-Plantain4721",
        "title": "Netflix has seriously harmed it's reputation with how often it is now cancelling shows",
        "content": "Netflix has seriously harmed it's reputation with how often it is now cancelling shows. What used to be seen as the go-to service for saving cancelled shows, has now become the very thing it swore to destroy {Hello There Obi-Wan Kenobi reference). Netflix likes to repeat it's standard line that they have never cancelled a successful show, but they conveniently never tell us how they measure success, because this doesn't ring true with their shows like Lockwood &amp; Co and Shadow &amp; Bone, that got to both Number 1 and Number 2 respectively in Netflix's own published streaming charts, and that still wasn't enough to save those shows from cancellation. Also Netflix clearly has favourites in terms of marketing, for example I enjoyed the show Everything Now, but you've probably never heard of it, and I searched Facebook - Netflix did one post about it when they dropped the trailer 3 weeks before it's worldwide release, and that was it; but other shows like Bridgerton, you can't fail to know it's there because they post daily about it on their socials for weeks up to and including release and for weeks after too. You even have actors in a new show saying they have to search their show to find it so they can watch and it's not even advertised on Netflix's own home screen, let alone anywhere else, so no wonder these shows get cancelled as they are never given a fair shot to succeed.\n\nIt seems unless you go viral or break Netflix's own streaming records, like Stranger Things or Wednesday, then even getting the number one or number two spot is not good enough to save a program from cancellation. Netflix needs to remember that not all releases are an overwhelming overnight success - even some of the best and most popular shows took a while to find their audience, like Breaking Bad, Game of Thrones, The West Wing, The Sopranos, but then when they did find their audience they became what everyone was talking about, and people who had never seen the show, still knew about them from it's impact on the cultural audience. Somebody else said, and I truly believe it, that if Netflix had made Breaking Bad today, they would have cancelled it after two seasons, and then think what great storytelling we would have missed out on, all because the show wasn't a record hit in it's opening week.\n\nAnd now Netflix finds itself in a self-fullfilling loop where they have now trained their audience to not try new shows and get attached as they'll likely be cancelled. Think about it, how many new shows can you think of on Netflix that got renewed last year. It only seems to be people will tune in for shows like Bridgerton, Emily in Paris, Outer Banks, as they have had time to grow with the characters, so now Netflix has got themselves in to a model where customers don't try a new show, like KAOS or Everything Now, and they'll wait and see if it's renewed, and when after only a month since it's release, it does indeed get cancelled, the consumer hasn't wasted time getting invested in a show &amp; characters that get cut short, especially nowadays when there is so much to watch across traditional TV and now streaming services too, that just because the audience doesn't come running to watch as soon as it drops, doesn't mean it's not there or interested.\n\n2025 see's the return of some of Netflix's biggest shows like Squid Game, Wednesday and Stranger Things, but 2 out of those 3 also end this year too and then what shows will be left that are associated with the Netflix brand - they had Stranger Things, House of Cards, Orange Is The New Black when Netflix first got going, it'll be hard to say by the end of this year what big shows Netflix will have left to draw customers in\n\nUnless Netflix, and the wider industry, change their perception to not only see massive, viral numbers as success and that shows with strong-moderate success are allowed to grow and widen their audience, then there will eventually reach a tipping point where they will cancel one show too many that either customers leave their service, or creatives will decide that Netflix isn't a good partner to work with where you put years of work in writing, filming, producing, editing a project just for it to be cancelled a month after it's release, so if you have a story that needs more than one film or a one and done series to tell it in, then Netflix probably isn't your best bet any longer.\n",
        "upvotes": 2274,
        "comments": 404,
        "media": null,
        "permalink": "/r/netflix/comments/1ifkjbm/netflix_has_seriously_harmed_its_reputation_with/"
    },
    {
        "id": "1igsw01",
        "author": "Responsible-Clue1262",
        "title": "Changing profile icon changes parental settings",
        "content": "We just discovered that if our daughter changes her profile icon it unlocks the parental settings and makes the profile unrestricted. Has anyone else noticed this?? Clearly it’s a glitch. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1igsw01/changing_profile_icon_changes_parental_settings/"
    },
    {
        "id": "1ih2ead",
        "author": "ImThawn3",
        "title": "Is there a possibility of Netflix reviving and renewing a second season for \"I Am Not Okay with This\"?",
        "content": "Since Its Showrunner Jonathan Entwistle is also the Director of the Upcoming Karate Kid Legends Movie, do you think that there is a possibility of Netflix renewing a season two if KKL is a smash hit? or is it just a stretch?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ih2ead/is_there_a_possibility_of_netflix_reviving_and/"
    },
    {
        "id": "1ig8pzm",
        "author": "Nastia_dream",
        "title": "Is Ginny&amp; Georgia worth watching ?",
        "content": "I haven't heard anything about this show before and since next season is coming out in June, is this show worth the watch ? As I understand it's a teen drama and I'm not really into teen shows these days. Would you still recommend it as a one time watch on the weekend for example ? ",
        "upvotes": 19,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1ig8pzm/is_ginny_georgia_worth_watching/"
    }
]