[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 7,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 166,
        "comments": 580,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1n4s7vw",
        "author": "Emmarrrrawr",
        "title": "Strangest part in unknown number high school catfish..",
        "content": "The strangest part for me was when the police go to Kendra’s house and say they’ve tracked the IP address back to this house. When the police call Lauryn inside the house and tells her what’s been going on she doesn’t really seem shocked. She doesn’t confront her mom at all. She doesn’t say anything! \n\nThen the dad is told to come over by the police, outside the police explains what has happened and that Kendra has also lied about having a job.\n\nWhen the dad goes inside he’s only bothered about when Kendra was laid off her job, he doesn’t mention anything at all about the fact Lauryn’s mom has been aggressively cyber bullying their daughter for over a year! \n\nI don’t know it’s just strange none of them seem remotely surprised about the cyber bullying.\n",
        "upvotes": 164,
        "comments": 107,
        "media": null,
        "permalink": "/r/netflix/comments/1n4s7vw/strangest_part_in_unknown_number_high_school/"
    },
    {
        "id": "1n4c5f3",
        "author": "WebConsistent3251",
        "title": "Unknown Number the Highschool Catfish- I'm sorry did I just watch Netflix give a platform to a predator completely glossing over the fact that she was sexually aggressive with minors?",
        "content": "She's a pedophile and a predator. I'm disgusted. She took no accountability and Netflix tried giving her some sympathetic image? Gross. Her daughter needs tons of therapy\n",
        "upvotes": 501,
        "comments": 259,
        "media": null,
        "permalink": "/r/netflix/comments/1n4c5f3/unknown_number_the_highschool_catfish_im_sorry/"
    },
    {
        "id": "1n4kcw0",
        "author": "lululegume",
        "title": "Unknown Number: The HS Catfish",
        "content": "Can someone explain why Khloe’s dad was talking about Kendra being untrustworthy at 1:29:40….but then her mom pipes in and blames Lauryn and her dad Shawn, like they were in on it?   \n\nI need more details about this case. I need to know more about what kind of messages Owen was getting, we mostly only saw Lauryn’s. I need to know why Chloe‘s parents would suspect Shawn and Lauren were going to claim to be a victims? I am left with so many questions and I also feel disgusted at the same time.",
        "upvotes": 87,
        "comments": 95,
        "media": null,
        "permalink": "/r/netflix/comments/1n4kcw0/unknown_number_the_hs_catfish/"
    },
    {
        "id": "1n4mfqz",
        "author": "Glass_Addiction",
        "title": "The Thursday Murder Club’s ending made me so mad",
        "content": "I was really enjoying the movie and the comedy until the end. It was so bad, I kept expecting a last minute reveal but there was none. So this whole time you have Elizabeth, this former MI6 agent investigating four murders, and then she finally cracks them, and despite their morally ambiguous nature she takes them to the police anyway. Like Penny killed a man for a woman who would never get justice in the courts. Totally valid in my opinion! There was no justice for women in that day. And then you have Penny’s husband killing a piece of trash businessman to protect his wife. Again, I personally wouldn’t complain. But instead of understanding and saying “hm maybe we should not pursue this mystery” she confronts the husband which leads him to killing himself and his wife. And of course this is expected, because jail at that age?? Meanwhile, she lets a crime boss who cut off people’s fingers, steals people’s passports, and is essentially facilitating modern slavery live his life as a floralist because she wants the retirement home to stay open. Talk about double standards?! She has a moral superiority complex for sure. And the Polish guy, Bogdan, was literally just trying to escape what was essentially slavery to see his dying mother, and yet his story is ended when he’s arrested as well. It left such a sour taste in my mouth. These people, who had good reasons to do what they did, got arrested and a crime lord didn’t? And that’s just the end of the movie and Elizabeth gets to dance and pretend like she didn’t ruin three peoples lives? Like WTF??\n\nAlso what is it with everyone confessing to their crimes?? There was no evidence to prove Penny and her husband did anything, but he just admits to it with the slightest pressure. He would’ve been fine otherwise. And Bogdan telling Elizabeth’s husband even though he also had no evidence? Come on, lazy way to conclude the story.\n\nAnyway, TLDR it had so much potential but the ending ruined it",
        "upvotes": 40,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1n4mfqz/the_thursday_murder_clubs_ending_made_me_so_mad/"
    },
    {
        "id": "1n4bv7m",
        "author": "Agitated_Fix_3677",
        "title": "Unknown number: The high school catfish…",
        "content": "This foolishness and fuckery in retrospect. First tf off… WHY TF DID NETFLIX CENTER THE OFFENDER. Kendra didn’t deserve to make this all about her and her story. This is about Owen, Khloe, his mother, Kendra’s husband and Lauryn. This should have been about the victims. They should have highlighted everything Kendra took from Shawn (Kendra’s husband.) Kendra is literally a family annihilator without the redrum. \n\nWhy didn’t Netflix put more emphasis on the sexual messages to minors??? Why did Netflix make a mockery of this situation??? Why didn’t they center the other parents? Why platform a literal abuser??\n\n\nY’all might drag me for this but I feel like Lauryn’s reactions are odd. Like I didn’t see any shock or surprise or even anger. I’m extremely surprised that the fact that Lauryn stayed in constant contact with her mother. It almost seems… dismissive of the whole ordeal. \n\nShawn and Lauryn lost EVERYTHING and Kendra is making it seem cool. I’m just appalled. ",
        "upvotes": 146,
        "comments": 164,
        "media": null,
        "permalink": "/r/netflix/comments/1n4bv7m/unknown_number_the_high_school_catfish/"
    },
    {
        "id": "1n4nkb3",
        "author": "Unable-Youth",
        "title": "Unknown Number poorly directed - more questions than answers.",
        "content": "This was a very misleading documentary.\n\nThe emphasis was on all the wrong places - it would even lead some to question if she was the only culprit or if her daughter was involved.\n\nThere was no explanation as to how some of the details in the messages (that contained information that only the close groups of students would be privy to) would be open knowledge to Kendra.\n\nRather then answering the loose ends, or asking Kendra the right questions, they actually gave Kendra a narrative to run with - “ I was raped and wanted to control the outcome for my daughter, and protect her”… by you know, telling her to kill herself?\n\nBased on the way this whole story was documented, I’d (potentially incorrectly) infer from this that the mother AND daughter had something to do with this. The mother obviously got caught - hence why the daughter is so forgiving and willing to reconcile. This also explains her lack of reaction when the police tell her this information. The mother was less concerned about her daughter finding out in that moment then the others at the school…\n\nIf this was directed a bit better and answered the important questions - and also maybe emphasized that this woman, if she did act alone - correctly portrayed that she was a predator, obsessed with her daughters boyfriend and jealous of her own daughter… then I think this whole documentary would have made more sense.\n\nThis leaves a lot more questions than answers, and unfortunately, might leave some (like me) with the potentially wrong impression that the daughter and mother were both in on this. ",
        "upvotes": 15,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1n4nkb3/unknown_number_poorly_directed_more_questions/"
    },
    {
        "id": "1n43e24",
        "author": "Interesting_Slide554",
        "title": "Unknown number The high school catfish",
        "content": "Brooooo when Kendra says “ i know a lot of us made mistakes and broke the law but didnt get caught”, BYE, this is not a mistake this is a deliberate decision that she made over and over. This wasnt a OOPSIE moment. And no Kendra, we have not all broke the law but got away with it, and certainly not to this level. Please, the rationalization of it all. People try to logically rationalize their actions as if it makes them understandable. Girl, Hitler had his reasons too, and was very convincing in his rationale, he still was a monster. That woman gives me chills. I have strong reasons to believe her daughter will cut her off way later in life, when she is going to become more aware. At the moment, she’s too young to fully process it and have perspective. She’s in a bubble. She clearly doesnt seem to fully understand.",
        "upvotes": 242,
        "comments": 92,
        "media": null,
        "permalink": "/r/netflix/comments/1n43e24/unknown_number_the_high_school_catfish/"
    },
    {
        "id": "1n4fsxh",
        "author": "Aapeso4444",
        "title": "Unknown Number documentary",
        "content": "This lady is absolutely insane like insane . I can’t even believe a mother would do something this drastic to their own child I mean being a teen is already so much &amp; to think that you would do something so drastic . Telling her to off herself like that is crazy &amp; her playing the hero is what she was doing that is a real mental issue. Also this woman is a predator I mean all the messages of her talking about creaming &amp; sexual acts is just disgusting . I believe she was getting off on those messages which is more crazy because at that time that boy was sooo young. I knew from the beginning something was off about her she just looked off. But I was not thinking to this extent. I couldn’t imagine putting my son through something like that. It can really mess with someone’s mental health. What a disgusting human in my opinion she should have been registered as a sx offender I just can’t get past the fact that she said all of those things to her daughters boyfriend 🤮🤮🤮",
        "upvotes": 39,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1n4fsxh/unknown_number_documentary/"
    },
    {
        "id": "1n48twd",
        "author": "Camp_Arkham",
        "title": "Hate weekly drop shows",
        "content": "Really disappointed to see Netflix starting to go to the “Weekly drop” model of series shows. I wish they would just drop their new series all at one time and allow the viewer to decide how and when they want to watch ( or binge watch). \nFor me, having entire shows dropped at one time, differentiated Netflix from a lot of other services and was somethingI valued. \nI’m I alone here?\n\n",
        "upvotes": 97,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1n48twd/hate_weekly_drop_shows/"
    },
    {
        "id": "1n4x495",
        "author": "Historical_Champion5",
        "title": "How was Highschool Catfish even possible to film?",
        "content": "My husband and I just watched the documentary and I keep wondering how was it even possible to interview these people for millions of us around the world to see them? How will they be able to go back to their normal life after this? All of these teenagers are still so young, I am not even sure that all of them were above 18. I wonder if it needed to be a Netflix show - maybe it would have been better for this to die down as a local news story, to protect everyone involved’s sanity. \n\nOn a bright side, I wonder if the attention to this might lead to more checks so that what all of us noticed - it was a sexual harassment of minors rather than just catfishing - gets properly investigated and hopefully leads to either more jail time or stricter consequences. ",
        "upvotes": 1,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1n4x495/how_was_highschool_catfish_even_possible_to_film/"
    },
    {
        "id": "1n46g5m",
        "author": "ohmyhellions",
        "title": "Unknown number unpopular opinions",
        "content": "Reading the comments here, most people agree Kendra is a psychopath and pedophile, which: yes absolutely. And I agree she needs to be locked away for a much longer time (and studied).  But there are some other takes I had that I don’t see reflected. What do you think, and what unpopular opinions do you have? Please share:\n\n1. Yes, obviously Kendra was fixated on Owen, even when he was still a little prepubescent boy (sick). And she was jealous of Lauryn for being with him. That’s all the comments I’ve read. But I believe it went much deeper than that. She was also deeply jealous that her daughter was growing into a pretty teenager who had her whole life ahead of her and hadn’t fucked up her marriage, finances and life like Kendra had. Owen was the target of her fixation but It wasn’t only about Owen. There’s a lot more going on. \n\n2. I’m sorry but Owen’s parents/mother are not the heroes people are making them out to be. Why in the free world would they not take the kid’s phone away? He was being harassed into a place of suicidal ideation. They are terrible parents for letting him just deal with it while the mom pranced around pretending she was a star on Law &amp;\nOrder \n\n3. Lauryn’s dad was an incompetent father. I believe Kendra is a master manipulator but what the hell must he have been doing to not see signs that something was terribly wrong? I think he was having affairs/a double life or at the very least was willfully burying his head in the sand. What do you mean you trusted your wife to handle your daughter’s severe sexual harassment and abuse? You didn’t think you should help? You didn’t think the situation warranted all hands on deck? Where the hell were you the whole time? And all he could say about Lauryn now is that she’s “growing” and will be a “beautiful woman.”  Something is also off with him. \n\n4. Regarding Lauryn's non-emotional reaction to what her mom did to her: Lauryn never had close friends and was always quiet and withdrawn, per all her peers. Owen said she was trying to isolate him from his friends so it was just “the two of us”. As far as we saw, Kendra was her primary parent, with barely any paternal involvement. Kendra’s sociopathic ways are normal to Lauryn because it’s all she knows. (I hope she gets a lifetime of therapy.) During the confession conversation, either she was in shock and, as any\n15 year old child would be, confused and unable to process the emotions on the spot (and also focused on following an authority figure’s directions to call her dad) …or she knew or suspected her mom was behind this.",
        "upvotes": 90,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1n46g5m/unknown_number_unpopular_opinions/"
    },
    {
        "id": "1n4zxvi",
        "author": "eccentlumier",
        "title": "I think 13 Reasons Why is one of those shows which had the most talented bunch of actors who were done dirty by Netflix",
        "content": "https://preview.redd.it/5cos5w9vydmf1.jpg?width=1200&amp;format=pjpg&amp;auto=webp&amp;s=7fa409e94d56a7c2fa10bc8e08c9c6bbc819515b\n\nNow my opinion is entirely based on season 1 and I didn't bother watching the rest because I think after s1 everything was utterly disrespectful to whatever the show stood for. I didn't love the show and I was deeply affected by the depiction of rape and suicide (I saw it when it came out and I was 15 so you can imagine, it was uncensored) but I think everyone quite literally embodied their characters very well, especially Dylan and Katherine, which is probably the reason why people were able to invest in this show in the first place. I remember tearing up after Clay's tape and the last 3 episodes just ripped my heart out, but I feel bad for these actors because most of them (especially Katherine) aren't seen much after this and it might be because of type casting or the bad reputation this show got.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n4zxvi/i_think_13_reasons_why_is_one_of_those_shows/"
    },
    {
        "id": "1n4zfij",
        "author": "punknatanke",
        "title": "Не грузятся заставки",
        "content": "Внезапно перестали загружаться фирменные заставки в приложении для Андройд ТВ, которые с логотипом Нетфликс, которые воспроизводились перед началом просмотра и после финальных титров. Телевизор перезагружал, роутер перезагружал, данные и кэш приложения Нетфликс удалял, приложение Нетфликс переустанавливал - ничего не помогло. Что делать?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n4zfij/не_грузятся_заставки/"
    },
    {
        "id": "1n4m8v7",
        "author": "cenxxv",
        "title": "Unknown Number High-School Catfish",
        "content": "Does anyone have any theories about Khloes parents and their end of show interview where the mom said \"Shawn and Lauryn will act like th victims in this\". What does that even mean? How are they not the victims? Do Khloes parents know something about them that points to them having some part in this whole thing? So strange to me.",
        "upvotes": 6,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1n4m8v7/unknown_number_highschool_catfish/"
    },
    {
        "id": "1n42bwu",
        "author": "ciscnzhnrq",
        "title": "Katrina - Come Hell or High Water",
        "content": "This documentary produced by Spike Lee was very informative and really well done. What a complete tragedy to the people and community. Everyone needs to watch this. ",
        "upvotes": 91,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1n42bwu/katrina_come_hell_or_high_water/"
    },
    {
        "id": "1n4vv1t",
        "author": "Sky-Pink-",
        "title": "So The Residence &amp; Kaos don’t get a second season, but My Life With The Walter Boys did?!",
        "content": "So I’m halfway through S2 of My Life With The Walter Boys and it has just made me so much more aghast that this show got a second season, yet masterpieces like *frickin emmy nominated* The Residence and Kaos didn’t?!?! \n\nI liked MLWTWB’s first season - nothing amazing but an easy enjoyable watch. But this season has so far been meh. \nAnd now, currently on the big scene at the house and just… the acting is awful, the premise is stupid… \n\nAnd it’s enraged me! Incredible shows getting cancelled when stuff like this gets the greenlight?! \n\nWhen do we boycott and show netflix that this is not ok/ find a way for other services to take on shows &amp;actually continue them even if they don’t get binged &amp; no. 1 in 30 countries the first week they’re out?!? \n\nHonestly, when do we all boycott netflix for serving us shows that are pretty trash over genuinely amazingly crafted, acted &amp; executed productions?!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n4vv1t/so_the_residence_kaos_dont_get_a_second_season/"
    },
    {
        "id": "1n4vshz",
        "author": "da-real-boi",
        "title": "Netflix on PS5?",
        "content": "Hey! So, I've bought myself the Netflix subscription service for 5 € (with ads) on my PS5. On it Netflix works flawlessly but when I try to log in on my phone I can enter my email and password correctly but get send to the payment page of registration on Netflix.\n\nThis is where I'm lost. Why am I getting sent to the payment page when I obviously already have a plan and just try to log in on another device? How can I log in on my phone? I did not even want to watch something on my phone, I just wanted to browse Netflix to see what I'd want to watch in the evening.  \n\nThanks in advance! :)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n4vshz/netflix_on_ps5/"
    },
    {
        "id": "1n4uz9a",
        "author": "MountainEmployer7052",
        "title": "Unknown Number - Original Messages?",
        "content": "Who sent the original text messages?? I know Laurens' mom at the beginning says that she did not send the messages, so who did? Did Khloe really send the ones at the beginning? ",
        "upvotes": 0,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1n4uz9a/unknown_number_original_messages/"
    },
    {
        "id": "1n4u960",
        "author": "unfiltered_12345",
        "title": "Comedy movie recs",
        "content": "A movie u watch to get that laugh \nLike a comfort movie \nI haven't watched a movie that made me laugh \nRecommend your best comedy movie \nSomething like the murder mystery or hangover  \n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n4u960/comedy_movie_recs/"
    },
    {
        "id": "1n4j223",
        "author": "historyinprogress",
        "title": "Unknown Number - They didn’t know Kendra’s job situation?",
        "content": "I get it, her husband let her take care of the bills so he didn’t know things weren’t getting paid, but your wife supposedly has TWO jobs, how do you not see with your eyes you’re living on a one person salary? I don’t know how much Michigan pays, as a tech worker in Zone B, I know Zone D is significantly less, however it’s not $10k a year. We’re talking 6 figures for tech professionals. And she was doing two jobs? Her husband did not notice this woman was not contributing ANY money? And he looked blue collar. Their last house looked like a trailer home. How do you not know your wife doesn’t have one job, much less 2? Who was filling out these rental applications?\n\nThis whole story was weird. But that one part I major side eyed because it made no sense. You can’t really hide whole ass salaries like that. ",
        "upvotes": 7,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1n4j223/unknown_number_they_didnt_know_kendras_job/"
    },
    {
        "id": "1n4tbbo",
        "author": "gowriarun",
        "title": "Give me recomendations",
        "content": "I liked :  \nInside job, q-force, disenchanment, arcane, rick and morty,blue eye samurai, archer, captain fall, castlevania\n\nI also like sitcoms a lot, long shows etc",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n4tbbo/give_me_recomendations/"
    },
    {
        "id": "1n3oyim",
        "author": "AnotherDarnDay",
        "title": "Unknown Number High-school Catfish",
        "content": "What the hell did I just watch? And what the hell was this person thinking?\n\nI'm in shock that someone would do such a thing to their own child. And that she doesn't seem to have any focus on what she actually did. \n\nThe daughter didn't seem to grasp what her mother did when they told her but the father acted on it right away. \n\nWas she totally jealous of her own daughter? ",
        "upvotes": 625,
        "comments": 785,
        "media": null,
        "permalink": "/r/netflix/comments/1n3oyim/unknown_number_highschool_catfish/"
    },
    {
        "id": "1n4fqa5",
        "author": "TeaRemote258",
        "title": "I JUST found The OA",
        "content": "And I’m utterly disappointed there isn’t a season 3+. How can I reach out to Netflix to show my support for additional seasons? Assuming they can get the cast back together? I know the creators + Jason Isaacs are still in favor of additional work to conclude the series. ",
        "upvotes": 8,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1n4fqa5/i_just_found_the_oa/"
    },
    {
        "id": "1n4yxa6",
        "author": "HoldYoBreath",
        "title": "My Issues With Adolescence",
        "content": "Overall I think its thought provoking and is starting conversations that need to be had about social media, bullying, toxic masculinity, manosphere, echo chambers, mental health and the lack of understanding between generations. \n\n  \nMy main issue is the style of it being a single take: Its impressive technically speaking and of course requires perfect acting but it also leads to slow moments that drag on and were filler. It felt forced and drawn out. I think this ended up taking away from the experience more than it added.\n\nThe accents were thick and difficult to understand. This made it challenging to get invested in alot of the dialogue.\n\n\n\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n4yxa6/my_issues_with_adolescence/"
    },
    {
        "id": "1n4dcws",
        "author": "FaceElectronic768",
        "title": "( unknown number-high school catfish ) is anyone else confused by the picture?",
        "content": "who sent the picture of owen and his new phone case from inside his house? if owen and lauryn were broken up by then kendra wouldn’t be at their house i wouldn’t think? i’m so confused by how many things kendra knew about even owen’s new gf? how was she getting all this info and pics? idk if i missed something! ",
        "upvotes": 9,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1n4dcws/unknown_numberhigh_school_catfish_is_anyone_else/"
    },
    {
        "id": "1n4d7sq",
        "author": "CllrHood",
        "title": "Unknown number, Chloe’s mum comment",
        "content": "What did Chloe’s mom mean when she said, ‘I told someone that Shaun and Lauryn were going to come off looking like the victims.’ She says this towards the end of the program. Was she suggesting they were all in it together, ie Kendra, Shaun and Lauryn? ",
        "upvotes": 10,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1n4d7sq/unknown_number_chloes_mum_comment/"
    },
    {
        "id": "1n4qucs",
        "author": "DiligentCockroach700",
        "title": "Thursday Murder Club",
        "content": "Watched this on Thursday! I've read all the books as well. Although it doesn't stick strictly to the book, it is nonetheless an excellent production with great actors.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n4qucs/thursday_murder_club/"
    },
    {
        "id": "1n4qn2v",
        "author": "Quick_Dot_9660",
        "title": "Can someone explain the Killtony thing to me?",
        "content": "I'd seen a couple of clips of the show in smaller venues so when I saw it on Netflix I thought I'd check it out. I watched the first hour and the whole thing just felt uncomfortable and not fun. The main guy trying to control a baying crowd who booed literally everyone, the banter 'interview' stage was really forced and then that just seemed to be the conceit of the show, is it just comedians doing 5 minute sets for two and a half hours with ring girls? ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1n4qn2v/can_someone_explain_the_killtony_thing_to_me/"
    },
    {
        "id": "1n3og0r",
        "author": "Ok-You-5930",
        "title": "Unknown Number: What mental illness does Catfish Mom, Kendra Licari have? I have questions..",
        "content": "SPOILER ALERT: first, I’m really curious as to what mental illness Kendra Licari has. I have several family members with severe mental illness but I can’t figure this out… \n\nIt was so disturbing to learn what she did to her innocent daughter and her friends. But she was also obsessed with the boyfriend! And then we learn that she lied about having a job! And then we hear her skirt accountability blaming it on her trauma, and then we see how manipulative she is at every level. Like… I have questions. Weigh in on any:\n\n1. WTF did we just watch?\n2. What mentally illness do you think she has? And what makes you think that?\n3. Why was she fired?? We need a follow up on this. Sounds like Casey Anthony at Universal Studios..\n4. We’re all in agreement that she was obsessed with Owen right? \n5. HOW DID THIS PSYCHOPATH GET FREE IN 18 MONTHS?",
        "upvotes": 423,
        "comments": 892,
        "media": null,
        "permalink": "/r/netflix/comments/1n3og0r/unknown_number_what_mental_illness_does_catfish/"
    },
    {
        "id": "1n4eu1e",
        "author": "ReasonableGlove816",
        "title": "SPOILERS!!! Unknown Number - Netflix",
        "content": "i KNOW everyone is posting about this atm but i have to say something!!!!\ni've just finished watching the new netflix documentary Unknown Number and HO-LY SHIT.\ni have not been that SAT watching a documentary for AGES. i genuinely had no idea which way the story would go and when the perpetrator was caught - jaw to the FLOOR.\n\nSPOILERS BELOW!!!\nlauryn's mum is fucking insane. a literal psychopath. i hate hate the fact that at the end they made it seem as though it was a trauma response. it wasn't. she was jealous of her daughter, and more importantly, INFATUATED with owen (a teenager). the sexual comments she made, everytime the word 'creamy' was used i felt sick, even before finding our who it was. these were 13 year old children it was disgusting they were receiving those messages, let alone from her own mother???\nalso there is absolutely no way it wasn't kendra from the get go. the message layouts and language used were FAR too similar from both periods of time.\nmore importantly, i can't believe owen's parents didn't press for her to be put on the sex offenders register?? she was literally in love with that child, thinking about doing the most HEINOUS things to him🤮🤮\nshe is vile and i truly hope as lauren gets older she realises how spiteful and truly disgusting her mother is. those poor poor kids💔",
        "upvotes": 7,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1n4eu1e/spoilers_unknown_number_netflix/"
    }
]