[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 36,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 9,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pqb7hx",
        "author": "Notoriously_So",
        "title": "‘Last Samurai Standing’ Renewed for Season 2 at Netflix",
        "content": "",
        "upvotes": 154,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1pqb7hx/last_samurai_standing_renewed_for_season_2_at/"
    },
    {
        "id": "1pqpo4u",
        "author": "ConversationHairy606",
        "title": "Looking for Netflix recommendations around crime, cybercrime, or privacy",
        "content": "I have been on a bit of a kick watching shows and documentaries about crime, cybercrime, hacking, data leaks, and privacy related topics.\n\nI have already seen a lot of the obvious ones, so I am hoping to find things that might be a bit less mainstream. Could be documentaries, docuseries, or even fictional shows that feel grounded in reality. Anything that explores how data is abused, how scams work, or how technology intersects with crime would be great.\n\nWhat are some good Netflix titles that fit that space",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pqpo4u/looking_for_netflix_recommendations_around_crime/"
    },
    {
        "id": "1ppykae",
        "author": "Alternative-Gear3945",
        "title": "Mindhunter",
        "content": "I genuinely feel Mindhunter is such a well put show with the right story and the right pace. I don’t understand why the show was cancelled. If there is anyone from Netflix reading this please get the show back!!!!",
        "upvotes": 233,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1ppykae/mindhunter/"
    },
    {
        "id": "1pq00zv",
        "author": "IntelligentYinzer",
        "title": "First Look at Sarah Paulson as Serial Killer Aileen Wuornos in 'Monster' Season 4",
        "content": "",
        "upvotes": 98,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1pq00zv/first_look_at_sarah_paulson_as_serial_killer/"
    },
    {
        "id": "1pq9o2x",
        "author": "CalebOnPoint",
        "title": "Netflix running ads on Reddit that spoil 2025 movies in a montage?",
        "content": "Has anybody seen the new ads on Reddit (might be other places too) where Netflix spoils all the movies from 2025? It's like a one minute spoil montage that's I guess trying to be funny or cool? What's your opinion on that? IMO seems kind of disrespectful but might just be me.",
        "upvotes": 25,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1pq9o2x/netflix_running_ads_on_reddit_that_spoil_2025/"
    },
    {
        "id": "1pqnllf",
        "author": "Queasy-Cantaloupe783",
        "title": "Forgot the plot of night agent",
        "content": "Just heard s3 is premiering in febuary and now i just realised i don’t remember what happened in the show  because i was watching tons of other shows at the same time 😔",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pqnllf/forgot_the_plot_of_night_agent/"
    },
    {
        "id": "1pq7tkg",
        "author": "GlumBodybuilder4395",
        "title": "Why Did They Stop Doing Production For Nailed It??",
        "content": "Nailed it is one of my favorite comfort shows of all time what the hell happened?? Like why did they stop making new seasons was it a budget issue? I watched other baking shows but none of them hit the same like nailed it did.",
        "upvotes": 23,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1pq7tkg/why_did_they_stop_doing_production_for_nailed_it/"
    },
    {
        "id": "1pq5xra",
        "author": "moviefullfrontal",
        "title": "I love the Anthony Jeselnik standup comedy specials on Netflix.",
        "content": "Anthony Jeselnik is a funny controversial comedian who has no filter. It reminds me of Mad Tv and how Mad Tv was so great because no joke was off limits.  \n\nI watched the other comedy specials too, Anthony Jeselnik is the best edgiest most savvy savage in my opinion.",
        "upvotes": 28,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1pq5xra/i_love_the_anthony_jeselnik_standup_comedy/"
    },
    {
        "id": "1ppp9um",
        "author": "Fun_Molasses5215",
        "title": "Simon Cowell’s new boyband December 10 faces heated legal battle over name",
        "content": "",
        "upvotes": 228,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1ppp9um/simon_cowells_new_boyband_december_10_faces/"
    },
    {
        "id": "1pqqli8",
        "author": "ThreadAndSolve",
        "title": "Netflix is using the Stranger Things finale to test a radical new business model starting this Christmas",
        "content": "We are exactly one week away from Volume 2 dropping on December 25 and it is clear that Netflix is treating this release differently from anything they have done before. While most shows get a single drop, Netflix has carved Season 5 into three deliberate peaks to dominate the entire holiday season.\n\nHere is why this strategy represents a massive shift for the platform.\n\n**The Theatrical Experiment for a Series Finale.** For the first time in the company's history, Netflix is releasing the series finale, The Rightside Up, in over 500 theaters across the US and Canada on December 31. This is a direct response to the Nolan effect, proving that certain events demand a big screen and a crowd. By doing this, they are effectively turning the 2 hour and 5 minute finale into a New Year's Eve blockbuster that competes directly with theatrical films.\n\n**The Holiday Cultural Hijacking.** Look at the dates. Volume 1 hit on Thanksgiving, Volume 2 drops on Christmas and the Finale lands on New Year’s Eve. Netflix is ensuring that for three straight months, Stranger Things is the primary topic of conversation during the biggest family gathering windows of the year. It is a masterclass in sustained engagement compared to the usual one week binge and forget cycle.\n\n**The Return of the Feature Length Episode.** The runtimes for Volume 2, which covers episodes 5 through 7, are essentially three back to back movies.\n\n* Chapter 5: Shock Jock is 1 hour 17 minutes.\n* Chapter 6: Escape from Camazotz is about 1 hour.\n* Chapter 7: The Bridge is 1 hour 37 minutes.\n* The Finale is 2 hours 5 minutes.\n\nNetflix is betting that we will not mind the wait if every episode feels like a cinematic event.\n\nDo you think this Volume release strategy is the future for Netflix’s big budget hits like Wednesday or Squid Game, or is this a one time deal because it is the end of an era? \n\nI think the theatrical finale is a huge win for fans, but it might be the start of Netflix moving away from the all at once binge model for good.\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pqqli8/netflix_is_using_the_stranger_things_finale_to/"
    },
    {
        "id": "1pq8mu9",
        "author": "Upstairs-Brain1987",
        "title": "Do I need to watch Knives out Glass onion before Wake up Dead Man?",
        "content": "Me and my girlfriend were in for a movie night. I have already watched knives out and knives out glass onion before but my girlfriend has only watched the 1st movie. I am thinking that she should watch it in the order it was released ( Thats just how I prefer to watch movies in general) but I also realllly want to watch the third one. She doesnt really care about the order as long as its not heavily dependent. So to my original question. Does it matter?\n\n\nUpdate: Watched “Wake up Dead man”. Both of us absolutely loved it.",
        "upvotes": 16,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1pq8mu9/do_i_need_to_watch_knives_out_glass_onion_before/"
    },
    {
        "id": "1pqp0iy",
        "author": "Juneau173451",
        "title": "Squid Game's Season 2 Soundtrack is an Absolute Masterpiece",
        "content": "As we approach the 1 year anniversary of Squid Game 2, I would like to point out something: the soundtrack was AMAZING. \n\nWhile a lot of people may argue that season 1 has the best OST, I would argue that the season 2 ones were just on a different level. It perfectly buttresses the triumph, energy, and hope that characterized season 2 through remixing season 1 songs and introducing some newer, iconic tunes.\n\n***Way Forward*** is the obvious MVP here. Being a more hopeful, triumphant version of the iconic *Way Back Then*, it sends a wave of nostalgia and goosebumps reminding us of the magic that we witnessed with season 1 in 2021. The song then develops into a more darker and mature tone, making us wonder how the season is going to unfold or whether or not Gihun will succeed in his mission to end the games once and for all.\n\n***No Way Back*** also is a great remix of *Way Back Then* at the beginning of the season, setting the stage for Gihun's revenge.\n\nWe get a ***Fly Me to the Moon*** and some pink solider theme song remixes during the first game.\n\n***A Five People Game*** was a goofy little edition to the pentathelon games really making it feel like a children's game. But more importantly, during the pentathelon ***We're Together*** made all of us cry tears of joy when Hyun-ju's team became the first successful pentathelon team to survive before streamlining the hype into the episode 5 title sequence.\n\n***To You*** which played during Gihun's pentathelon team game was also perfect, being an energetic and hype song that yet again builds onto the season's core theme of hope.\n\nThen there are soundtracks like ***Vote I, Vote II (Vote I remastered),*** and the 5 ***Round the Circle*** music which perfectly depict and heighten the tensions between players during the voting scene and the frantic fight for survival during the games.\n\nWe can't forget about ***Let's Go Out!*** which is yet another *Way Back Then* remix, this time with an awesome electric guitar cover. It bolsters a sense of hope and spirit at the start of the rebellion.\n\nOf course, there is the mingle song which honestly isn't the best but catchy regardless.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pqp0iy/squid_games_season_2_soundtrack_is_an_absolute/"
    },
    {
        "id": "1pqjp7q",
        "author": "Additional_Key_8044",
        "title": "Emily in Paris 5 Review: Same Old, Same Old",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pqjp7q/emily_in_paris_5_review_same_old_same_old/"
    },
    {
        "id": "1pqot1c",
        "author": "Thin_Customer_6409",
        "title": "Recommedation for Family movie night",
        "content": "Can I please have recommendations for very good family movies I can watch with my kids on movie night. We recently watched Man and Bee and Man and Baby and I am looking for something like that... funny and enjoyable to all. Thanks\n\n",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pqot1c/recommedation_for_family_movie_night/"
    },
    {
        "id": "1pqorst",
        "author": "Odd_Dragonfly_1834",
        "title": "Netflix Live technical issues solved?",
        "content": "Last time I watched the Jake Paul vs Mike Tyson event the stream quality was pretty terrible with constant buffering issues.\n\nHas it improved since then? Or should I just skip watching it live?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pqorst/netflix_live_technical_issues_solved/"
    },
    {
        "id": "1pqmi1i",
        "author": "K7BASJD67",
        "title": "What other fights are featured on the Paul vs Joshua Fight I’m trying to figure out what other fights are scheduled for tonight but I can’t find anything on the card other than the main event itself does anybody know by any chance?",
        "content": "By any chance does anybody know what other fights are scheduled down for tonight it says the entire event is 4 hours long including the main event but I’ve been trying to figure out what other fights are happening does anybody know? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pqmi1i/what_other_fights_are_featured_on_the_paul_vs/"
    },
    {
        "id": "1pqjyls",
        "author": "OverallLemon3537",
        "title": "Sign out all devices",
        "content": "I want to sign out of all devices on my Netflix account because some of them are unknown to me. I’ve already been trying for about an hour, but Netflix keeps saying, \"Something went wrong. Please try again later\"\n\nDoes anyone know how to fix this? I also tried signing out of the devices one by one, but I get the same error message every time",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pqjyls/sign_out_all_devices/"
    },
    {
        "id": "1pq7dfa",
        "author": "ImportanceForsaken85",
        "title": "question about the ad supported subscription",
        "content": "we’re on the ad supported subscription and i kinda stopped using netflix when they got ads but i’m watching the walking dead (for the first time who jealous) and i haven’t gotten a single ad while watching, and when i was watching the new episodes of stranger things i got about 3 ads per episode. so do some shows just not have ads ? i’m just confused but hell i’m not complaining ",
        "upvotes": 7,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1pq7dfa/question_about_the_ad_supported_subscription/"
    },
    {
        "id": "1pqjf0d",
        "author": "Weary-Series6364",
        "title": "Best films on Netflix",
        "content": "Anyone recommend the best film they have seen Netflix as I can’t be asked to look and if I look it up it recommends me all the Netflix made films which arnt that good or I’ve already seen ",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1pqjf0d/best_films_on_netflix/"
    },
    {
        "id": "1pq8932",
        "author": "madamprizident",
        "title": "What’s in the box ?",
        "content": "I just watched this game show hosted by Neil Patrick Harris. As entertaining as the show was, I can’t help but wonder, how exactly can anyone trust that whatever is going on behind the “numbers” is locked in and cannot be rigged to accommodate a more favorable outcome or favorite pair to win ?",
        "upvotes": 6,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1pq8932/whats_in_the_box/"
    },
    {
        "id": "1pqitcu",
        "author": "Additional_Key_8044",
        "title": "Raat Akeli Hai: The Bansal Murders Review: Watchable",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pqitcu/raat_akeli_hai_the_bansal_murders_review_watchable/"
    },
    {
        "id": "1pq8e75",
        "author": "Hells-Kitchen646",
        "title": "Please give us season 2 of THE ASSET!",
        "content": "Not fair leaving us with cliffhangers. The acting is great, the story lines are good! Production costs can't be that high—they deserve another season at least to tie up the story!\n\n",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pq8e75/please_give_us_season_2_of_the_asset/"
    },
    {
        "id": "1ppr8q1",
        "author": "cmcb4",
        "title": "So, I was searching for Rob Reiner movies last night, specifically The Sure Thing and Stand By Me.",
        "content": "Another evening of struggling to decide on what to watch. I searched for Rob Reiner movies last night, specifically The Sure Thing and Stand By Me. We have the lowest cost ad version, so some movies have a lock symbol on them (upgrade $ required)ok fine. Only Stand By Me came up, (no lock symbol) so told my wife, let’s watch this. I was about to select it and right before our eyes the lock symbol popped up on it. Uhhgg..sob’s. ",
        "upvotes": 18,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1ppr8q1/so_i_was_searching_for_rob_reiner_movies_last/"
    },
    {
        "id": "1pqfvj0",
        "author": "Advanced_Note_7542",
        "title": "plus d'image sur l'application sur mon tel portable",
        "content": "Je ne sais pas comment faire. Avez-vous déjà eu ce problème?\n\nJ'ai déjà essayé de désinstaller l'application et de la remettre mais ça fait pareil. Je précise que je peux accéder à l'appli, je peux choisir quelque chose à regarder, mais dès que je lance, j'ai que le son et pas d'image.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pqfvj0/plus_dimage_sur_lapplication_sur_mon_tel_portable/"
    },
    {
        "id": "1ppnrgj",
        "author": "AssociateLittle1487",
        "title": "Netflix to launch FIFA World Cup video game",
        "content": "",
        "upvotes": 22,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1ppnrgj/netflix_to_launch_fifa_world_cup_video_game/"
    },
    {
        "id": "1pq3ge4",
        "author": "Li3Ch33s3cak3",
        "title": "looking for tv shows with supernatural creatures like TVD",
        "content": "I’ve watched all the big ones like The Vampire Diaries, The Originals, Legacies, and Teen Wolf, but I’m looking for more long-running TV shows with supernatural creatures. Something with vampires, werewolves, witches, or even more obscure creatures would be awesome.\n\nWhat other shows fit this vibe that have multiple seasons? I’m in the mood for something that’s not too short but still has a good plot and character development.",
        "upvotes": 2,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1pq3ge4/looking_for_tv_shows_with_supernatural_creatures/"
    },
    {
        "id": "1ppqz69",
        "author": "CyberNeko97",
        "title": "Netflix Partners With FIFA For A New Era Of Digital Football Games",
        "content": "",
        "upvotes": 10,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ppqz69/netflix_partners_with_fifa_for_a_new_era_of/"
    },
    {
        "id": "1ppiotz",
        "author": "starmaxeros",
        "title": "Warner CEO Zaslav giving Netflix CEOs a tour of their newly acquired studio",
        "content": "",
        "upvotes": 40,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1ppiotz/warner_ceo_zaslav_giving_netflix_ceos_a_tour_of/"
    }
]