[
    {
        "id": "1pn8e8n",
        "author": "TestamentOfAnnLeeAMA",
        "title": "Hi /r/movies! I'm Thomasin McKenzie. You might know me from Jojo Rabbit, Last Night In Soho, Leave No Trace, Old, Eileen, Fackham Hall, and The Power of the Dog. My next movie, The Testament of Ann Lee, premiered at Venice and is out in theaters next week. Ask me anything!",
        "content": "Hi reddit! I'm Thomasin McKenzie, here to answer your questions.\n\nYou might know me from **Jojo Rabbit**, **Last Night In Soho**, **Leave No Trace**, **Eileen**, **Fackham Hall**, **The Power of the Dog**, **Pantheon**, **Old**, **The King**, and **True History of the Kelly Gang**.\n\nMy next movie is **The Testament of Ann Lee**, out in theaters Christmas.\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\n**The Testament of Ann Lee,** is out in theaters nationwide starting December 25 via Searchlight Pictures. It's directed and co-written by Mona Fastvold. Score by Daniel Blumberg.\n\nIt also stars Amanda Seyfried, Lewis Pullman, Tim Blake Nelson, Christopher Abbott, Stacy Martin, Matthew Beard, Scott Handy, Viola Prettejohn, Jamie Bogyo, and David Cale.\n\n*Synopsis:*\n\nAnn Lee, the founding leader of the Shaker Movement, proclaimed as the female Christ by her followers. Depicts her establishment of a utopian society and the Shakers' worship through song and dance, based on real events.\n\n*Trailer:*\n\n[https://www.youtube.com/watch?v=-zK\\_nzG36mk](https://www.youtube.com/watch?v=-zK_nzG36mk)\n\nAsk me anything! I'll be back today Monday 12/15 at around 4:30 PM ET to answer your questions.",
        "upvotes": 1575,
        "comments": 244,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/z7rja9ak0d7g1.png?auto=webp&amp;s=c6f32f181c59ea6fcb98491e729977ac5acd4978"
        },
        "permalink": "/r/movies/comments/1pn8e8n/hi_rmovies_im_thomasin_mckenzie_you_might_know_me/"
    },
    {
        "id": "1pnilaf",
        "author": "APnews",
        "title": "Hi, we're Lindsey Bahr and Jake Coyle, The Associated Press' film reporters and critics. We published our list of the best movies of 2025 and are here to chat about the year in film. Ask us anything!",
        "content": "The Associated Press’ Film Writers [Lindsey Bahr](https://apnews.com/author/lindsey-bahr) and [Jake Coyle](https://apnews.com/author/jake-coyle) cover all things movies, including breaking news, film industry, awards season and film festivals. 2025 was the year in which audiences showed that they still crave the theatrical experience, whether it was to shout [“chicken jockey”](https://apnews.com/article/minecraft-movie-sequel-6e64f8bbb388979102281ec7c31a2a16) at the screen or, despite all [logic and polling](https://apnews.com/article/poll-movies-streaming-theaters-tickets-a1b6b6d48f47389f422ab7299c4e3e74) otherwise, help “KPop Demon Hunters” unofficially[ top the box office charts](https://apnews.com/article/box-office-kpop-demon-hunters-netflix-1646037b37d3018a0c827a3a674daf02) two months after hitting Netflix.\n\n[Bahr](https://apnews.com/author/lindsey-bahr) and[ Coyle](https://apnews.com/author/jake-coyle) ranked the [best movies of 2025](https://apnews.com/article/best-movies-of-2025-0e3047cba5c7c61cf9660d9d1878249d). Some of their picks include “One Battle After Another,” \"Sinners\" and “Wake Up Dead Man: A Knives Out Mystery.\" They're here to discuss the year in movies and their top picks.\n\nAsk them anything and let us know your 2025 movie takes! **We'll be back on Tuesday, Dec. 16 at 3 p.m. ET to answer questions.**  \nHere's the panel:  \nLindsey Bahr has been a film writer and critic for AP since 2014. Her latest bylines and interviews:\n\n* [Sundance 2026 lineup unveiled: Charli XCX, Olivia Wilde, Brittney Griner and more](https://apnews.com/article/sundance-film-festival-2026-movies-20700b9e2897709a2d5dfc0f890f4e10)\n* [In ‘The Chronology of Water,’ Imogen Poots found a great role, and a best friend in Kristen Stewart](https://apnews.com/article/imogen-poots-chronology-of-water-kristen-stewart-7d17c77e2605a20a89e7d8f8f52fa985)\n* [‘This is Spinal Tap,’ ‘The Princess Bride’ and more: Rob Reiner’s best films and where to watch them](https://apnews.com/article/rob-reiner-iconic-films-where-to-watch-c54d8d585105414cc6af2e2e25163b7b)\n* Jake Coyle has been a film critic and covered the movie industry for AP since 2013. His latest bylines and interviews:\n   * [A string of awards makes it clear: ‘One Battle After Another’ is the Oscar front-runner](https://apnews.com/article/one-battle-after-another-awards-frontrunner-163e8acc1c5b9730d09801272ed154f3)\n   * [How Jessie Buckley and Paul Mescal found the emotional power of ‘Hamnet’](https://apnews.com/article/hamnet-jessie-buckley-paul-mescal-5a20cfb59d10ff70e644269344bbb7c0)\n   * [The greatest mystery of Rian Johnson’s ‘Knives Out’ movies? Daniel Craig’s Benoit Blanc](https://apnews.com/article/daniel-craig-wake-up-dead-man-knives-out-4d86076b881488ca85423c91ef528c0f)\n   * [Adam Driver on Jarmusch, ‘Star Wars’ and putting filmmakers first](https://apnews.com/article/adam-driver-star-wars-soderbergh-jarmusch-4e08164d0419759f1b5b50d69864975d)",
        "upvotes": 10,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/is3diqhijf7g1.png?auto=webp&amp;s=f1008b5b745a1cf8357e9daf50250ba4e45ea549"
        },
        "permalink": "/r/movies/comments/1pnilaf/hi_were_lindsey_bahr_and_jake_coyle_the/"
    },
    {
        "id": "1pnpspz",
        "author": "BunyipPouch",
        "title": "First Image of John Turturro in 'The Only Living Pickpocket in New York' - When a theft goes awry, a veteran pickpocket is sent on a mission through New York to reclaim the stolen goods.",
        "content": "",
        "upvotes": 3305,
        "comments": 128,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/51ruk8fh3h7g1.jpeg?auto=webp&amp;s=088da642a584c1451265a0d36d258b05d592ca59"
        },
        "permalink": "/r/movies/comments/1pnpspz/first_image_of_john_turturro_in_the_only_living/"
    },
    {
        "id": "1pngtgd",
        "author": "MoviesMod",
        "title": "Rob Reiner Appreciation: A Really Good Man And A Great Director",
        "content": "",
        "upvotes": 9908,
        "comments": 184,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vzLVUaaEQSkWhH9OcaTEeUqeRDZcmVg0_pdwPKYBLMA.jpeg?auto=webp&amp;s=8afd63d4c53b678f0908b7f5f0bf9f72174ceeb5"
        },
        "permalink": "/r/movies/comments/1pngtgd/rob_reiner_appreciation_a_really_good_man_and_a/"
    },
    {
        "id": "1pnlpt6",
        "author": "MarvelsGrantMan136",
        "title": "Neon Invites All Fortune 500 CEOs to a Special Screening of ‘No Other Choice’ to Face Toxic Culture They’ve Created",
        "content": "",
        "upvotes": 2379,
        "comments": 78,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/klGHPkKWE_RX3MgQFO1_34FAv4WR-hIw8ajRNg6m8rk.jpeg?auto=webp&amp;s=e44a9b793b071f8368609c9028c410109e11debd"
        },
        "permalink": "/r/movies/comments/1pnlpt6/neon_invites_all_fortune_500_ceos_to_a_special/"
    },
    {
        "id": "1pn6k8q",
        "author": "BunyipPouch",
        "title": "Physical Media Is Becoming Cool Again - Consumers of all ages are looking to discs to get offline and away from algorithms, and for a younger generation, it’s seen as “vintage.”",
        "content": "",
        "upvotes": 14771,
        "comments": 1199,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Svg0KEx2GcQNczzRGHFb6T_GD95a5ISnwhmMjyFso3w.jpeg?auto=webp&amp;s=1a8c65c08e1667703371f57d2fa52d8bc3afcc62"
        },
        "permalink": "/r/movies/comments/1pn6k8q/physical_media_is_becoming_cool_again_consumers/"
    },
    {
        "id": "1pnthxt",
        "author": "KevDeBruyne",
        "title": "Scorsese’s awareness that De Niro is not really Italian is charming",
        "content": "Robert De Niro is, of course, a legendary American actor who’s played a large variety of roles across many decades in the film business.\n\nWhile De Niro has played everything from a Spanish missionary to a WASPy CIA agent, he is often associated with Italian-American characters in movies like The Godfather Part II, The Untouchables, and the Analyze This series. There is a popular image of him as one of the prototypical Italian gangster types of U.S. cinema.\n\nDe Niro has a recognizably Italian name, which adds to this perception. But he is only a quarter Italian-American. Most of his family comes from Northern European countries including Ireland, England, Germany, and the Netherlands.\n\nDe Niro’s famous collaborator Martin Scorsese seems keenly aware of this and has made a point of casting De Niro in roles where his lack of full Italian heritage is built into the plot. In each of Goodfellas, Casino, and The Irishman, De Niro’s character is a notably non-Italian person navigating the Italian mafia environment while surrounded by Italian-Americans who don’t recognize him as one of their own.\n\nMaybe I’m exaggerating this a little bit? Scorsese did cast De Niro as Italians in his early film Mean Streets (alongside fellow non-Italian Harvey Keitel) and in biopic Raging Bull, playing the boxer Jake LaMotta.\n\nBut I don’t know. There’s something I just enjoy about the idea that the someone as extremely knowledgeable about human culture and Italian culture in particular as Scorsese - fully Sicilian, once married to Roberto Rossellini‘s daughter, director of a film called Italianamerican - looks at De Niro, commonly stereotyped as a quintessential Italian, and recognizes that he is not that.\n\nScorsese has also cast De Niro in various Anglo, Irish and ethnically miscellaneous roles over the decades. Meanwhile he has never cast Joe Pesci in a role that is not specifically Italian-American.\n\nLeonardo DiCaprio, who like De Niro is only a quarter Italian-American but with a recognizably Italian name, has never played an Italian character in a Scorsese movie.",
        "upvotes": 474,
        "comments": 95,
        "media": null,
        "permalink": "/r/movies/comments/1pnthxt/scorseses_awareness_that_de_niro_is_not_really/"
    },
    {
        "id": "1pndpn2",
        "author": "Nervous_Designer_894",
        "title": "I re-watched The Arrival (2016), and it's probably the most meaninfull movie I've ever watched.",
        "content": "I re-watched The Arrival (2016), and it’s probably the most meaningful movie I’ve ever watched. Now in my late 30s, it sounds cliche, but it hits with a different weight compared to when I first watched it 10 years ago.\n\n*Arrival* is one of the rare science-fiction films that treats intelligence, empathy, and restraint as its true spectacles. Beneath its fucking amazing and moody visuals and measured pacing lies a meditation on language as a technology, one capable of reshaping not just communication but cognition itself. Villeneuve avoids the genre’s usual obsession with conquest or catastrophe, grounding the encounter instead in linguistics, uncertainty, love, and grief.\n\nThat idea mirrors real life as you age. By this point, you’ve learned that understanding does not come without cost. The film’s most unsettling truth is not that the visitors are unknowable, but that truly understanding them permanently alters how time, choice, and loss are experienced. At this point in life, you recognise these patterns in your own life, relationships, careers, and love. You see how earlier decisions quietly encoded both joy and pain, and how awareness doesn’t free you from consequence, it deepens it.\n\nIn that sense, *Arrival* is less about extraterrestrials than about maturity. It asks whether knowledge, love, and connection are still worth pursuing when you can already foresee their endings. The film’s answer feels profoundly adult: meaning isn’t found in avoiding loss, but in choosing fully, consciously, even when the outcome is known.",
        "upvotes": 3309,
        "comments": 444,
        "media": null,
        "permalink": "/r/movies/comments/1pndpn2/i_rewatched_the_arrival_2016_and_its_probably_the/"
    },
    {
        "id": "1pnnh2t",
        "author": "JorReno",
        "title": "John Carpenter's The Thing(1982) is a Christmas movie.",
        "content": "Every year, I hear the same debate; is Die Hard a Christmas movie? But what I don't hear is the debate about whether The Thing is a Christmas movie. \n\n\nThe evidence:\n\n\n*Takes place in the snow\n\n\n*most of the scenes take place at night, and the thing usually comes out at night just like santa on christmas\n\n\n*There's the same amount of characters as there is days of Christmas; 12\n\n\n*The plot of the film involves a bearded man figuring out who is naughty and who is nice\n\n\n*Kurt Russell's character is one of the only survivors. But he is stuck in the snow. This could possibly be a prequel to the film he plays Santa; The Christmas Chronicles(2018)\n\n\n*A lot of red glowing light in the film akin to Rudolph's red nose\n\n\n*Was filmed in December\n\n\n*late actor Donald Moffat was born on December 26th, one day after Christmas\n\n\n*MacReady's drink of choice is J&amp;B whisky. J&amp;B stand for Jingle Bells. It's also a green bottle with red font; two of the primary colors associated with Christmas.\n\n*Movie ends with the true meaning of Christmas; putting aside your differences and peace on Earth(since the thing has been stopped)\n\n\n*Thing is an anagram for Night. as in Silent Night. As it tries to take people out quietly. \n\n\n\nSo now you've heard the evidence... is it a Christmas movie or not?",
        "upvotes": 946,
        "comments": 186,
        "media": null,
        "permalink": "/r/movies/comments/1pnnh2t/john_carpenters_the_thing1982_is_a_christmas_movie/"
    },
    {
        "id": "1pn9lq2",
        "author": "MarvelsGrantMan136",
        "title": "Paul Thomas Anderson's 'One Battle After Another' Sets HBO Max Release Date - December 19",
        "content": "",
        "upvotes": 3949,
        "comments": 247,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LREZW9OsJjnP7saBSJviFGnx1--L_HDtXSX9zvur2Ho.jpeg?auto=webp&amp;s=5a430b48b71cbce0ce471505f4693e49eb12350c"
        },
        "permalink": "/r/movies/comments/1pn9lq2/paul_thomas_andersons_one_battle_after_another/"
    },
    {
        "id": "1pnj8qy",
        "author": "imgurofficial",
        "title": "What are some examples of times you don't believe the leading man should have \"gotten the girl\"?",
        "content": "My (hot?) take is that Jack Nicholson's character in As Good As it Gets should not have managed to land Helen Hunt at the end. As we went through the third act of that film I thought the lesson was going to be that some relationships work better as friendships than romantic partnerships, and that Nicholson, Hunt, and Kinnear were going to form an oddball friend group after Nicholson realized it's just not meant to be. I was FLOORED when he tried one more time at the end and it worked.\n\nAnyways, other examples?",
        "upvotes": 1150,
        "comments": 1104,
        "media": null,
        "permalink": "/r/movies/comments/1pnj8qy/what_are_some_examples_of_times_you_dont_believe/"
    },
    {
        "id": "1pnozd0",
        "author": "Automaticalee",
        "title": "Assassin (2023) - Bruce Willis' last scene in the final movie of his career before retiring due to being diagnosed with aphasia.",
        "content": "",
        "upvotes": 344,
        "comments": 59,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/5u4wnysfwg7g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1pnozd0/assassin_2023_bruce_willis_last_scene_in_the/"
    },
    {
        "id": "1pmxczv",
        "author": "MoviesMod",
        "title": "Legendary Director Rob Reiner ('This Is Spinal Tap', 'The Princess Bride') &amp; Wife Michele Singer Found Dead in LA Home in Apparent Homicide",
        "content": "",
        "upvotes": 36198,
        "comments": 2769,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qW4I05XEdXEwIfR4E_1wn6koxsUK6UmTRPVvSwPdObQ.jpeg?auto=webp&amp;s=d2f80b755ee53c9dc212905a0713791545cbff53"
        },
        "permalink": "/r/movies/comments/1pmxczv/legendary_director_rob_reiner_this_is_spinal_tap/"
    },
    {
        "id": "1pnfv94",
        "author": "SanderSo47",
        "title": "The Criterion Collection’s March 2026 Lineup Features Martin Scorsese's 'Killers of the Flower Moon' on 4K",
        "content": "",
        "upvotes": 746,
        "comments": 69,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/e8YZNWX65cnp-zwA-R36UZ3dCJPLI5jn9ECkmbtRtLA.jpeg?auto=webp&amp;s=b2afd5d96e207d2fd62f8b10c51aa6aa0a680065"
        },
        "permalink": "/r/movies/comments/1pnfv94/the_criterion_collections_march_2026_lineup/"
    },
    {
        "id": "1pndweo",
        "author": "ChiefLeef22",
        "title": "'Heat 2' is expected to begin production in August 2026, per producer Jerry Bruckheimer. Dion Beebe ('Collateral') is serving as the cinematographer",
        "content": "",
        "upvotes": 735,
        "comments": 69,
        "media": null,
        "permalink": "/r/movies/comments/1pndweo/heat_2_is_expected_to_begin_production_in_august/"
    },
    {
        "id": "1pnlg5n",
        "author": "57829",
        "title": "New Trailer for Jim Henson's 'Labyrinth' 40th Anniversary Re-Release",
        "content": "",
        "upvotes": 246,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MU2LX1CRGvODspFtQDIF_8y04htXvs6klDMD59aawnk.jpeg?auto=webp&amp;s=59245e7cff0feec3417a19c7371ef3b7de254db4"
        },
        "permalink": "/r/movies/comments/1pnlg5n/new_trailer_for_jim_hensons_labyrinth_40th/"
    },
    {
        "id": "1pnaxsf",
        "author": "ICumCoffee",
        "title": "Heat at 30: Michael Mann’s Electric Crime Thriller is a Film of Fire and Sadness",
        "content": "",
        "upvotes": 826,
        "comments": 104,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sHrGpx5H-i8YQABsOMO9r4JSLk_dpzoI4FRSlTImkCI.jpeg?auto=webp&amp;s=d24a5b6562b68cbf6a8ae7bd4f07e382451a33e3"
        },
        "permalink": "/r/movies/comments/1pnaxsf/heat_at_30_michael_manns_electric_crime_thriller/"
    },
    {
        "id": "1pnt8s5",
        "author": "No_Trick_8017",
        "title": "What’s the best romantic movie of all time, in your opinion?",
        "content": "I’m looking for romance movie recommendations and wanted to hear other people’s opinions. I really love The Notebook and the kind of romance it shows — emotional, passionate, and unforgettable. I like movies that make you feel deeply connected to the characters and their relationship, whether the story is happy, sad, or bittersweet. What I enjoy most is strong chemistry, meaningful moments, and a love story that actually sticks with you after the movie ends.\n\nI’m mostly interested in more modern romance movies rather than very old or classic films. I don’t mind if the movie is dramatic or even a little heartbreaking, as long as the romance feels genuine and well written. Movies where the relationship feels real, intense, or complicated usually stand out to me more than light or overly cheesy romances.\n\nI’m open to different styles of romance — slow burns, emotional love stories, realistic relationships, or even romances mixed with other genres like drama or thriller — but the love story should still be a big part of the movie. I also appreciate good acting and dialogue that makes the emotions feel believable.\n\nIn your opinion, what is the best romantic movie of all time that isn’t too old? If you also like The Notebook, what other movies gave you a similar emotional experience? I’d love to know your recommendations and why those movies stood out to you.",
        "upvotes": 61,
        "comments": 229,
        "media": null,
        "permalink": "/r/movies/comments/1pnt8s5/whats_the_best_romantic_movie_of_all_time_in_your/"
    },
    {
        "id": "1pn9ha4",
        "author": "Comic_Book_Reader",
        "title": "Normal - Official Teaser Trailer | Bob Odenkirk, Henry Winkler, Lena Headey | In Theaters April 17",
        "content": "&gt;For Sheriff Ulysses (Bob Odenkirk), his provisional posting to the quaint Midwestern American town of Normal was meant to be a welcome respite from both his marital woes and recent moral injuries in the line of duty. But when a botched bank robbery interrupts the municipality’s tranquil pace, a sordid secret is inadvertently exposed and Ulysses learns that the town is anything but its namesake. Suddenly everyone is trying to shoot the sheriff, even his own deputies, and our put-upon policeman must rely on his affable mettle and some motley crooks if he is to survive the night. (And that's all before the Yakuza show up).",
        "upvotes": 673,
        "comments": 182,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/CI_VUJu7rbHo-8lm1BMv8I6L37kqRJw5bIZAb2hFsvA.jpeg?auto=webp&amp;s=c7dab9a4f99a9fe1b30a4843a6c4d3521c13039d"
        },
        "permalink": "/r/movies/comments/1pn9ha4/normal_official_teaser_trailer_bob_odenkirk_henry/"
    },
    {
        "id": "1pnlun4",
        "author": "gamersecret2",
        "title": "A movie you watched at the wrong time in your life.",
        "content": "Some movies are not bad when you first see them. You are just not ready for them yet. Life has not given you the context they need. \n\nI watched Lost in Translation when I was younger and felt bored. Later, after feeling stuck and disconnected myself, the silence and distance in the film made sense.\n\nManchester by the Sea felt like nonstop sadness the first time. Watching it later, I understood it was really about living with grief, not fixing it.\n\nThese films taught me that timing matters as much as taste.\n\nWhich movie did you watch at the wrong time, only to understand it better later?\n\nThank you.",
        "upvotes": 132,
        "comments": 236,
        "media": null,
        "permalink": "/r/movies/comments/1pnlun4/a_movie_you_watched_at_the_wrong_time_in_your_life/"
    },
    {
        "id": "1pnh38o",
        "author": "NimdokBennyandAM",
        "title": "T'is the season to watch Klaus (2019) if you haven't yet, because it's Yuletide perfection.",
        "content": "This is one of those movies I watch and rewatch and love more each time. I sometimes watch this in the dead middle of summer because it's such a good pick-me-up. It's one of my favorite movies of all time, not just Christmas movies.\n\n\nExcellent cast, including Norm Macdonald playing a lovably irascible skiff captain and JK Simmons as the big red man himself. Will Sasso and Joan Cusack as the heads of rival families locked in a multi-generational war. Jason Schwartzman as a postman sent to get an icy hellscape ready for postal service (against his will), and Rashida Jones as the local school teacher who catches his eye.\n\nThe movie has a wry sense of humor that never becomes cynical and, in fact, is a sort of cure for cynicism: it shows what it looks like to overcome cynicism and find hope, or connection.\n\n\nWatch it if you haven't; rewatch it if you have. This one's a keeper, y'all.",
        "upvotes": 234,
        "comments": 29,
        "media": null,
        "permalink": "/r/movies/comments/1pnh38o/tis_the_season_to_watch_klaus_2019_if_you_havent/"
    },
    {
        "id": "1pn78s6",
        "author": "Amaruq93",
        "title": "A blooper reel of Robin Williams, from the making of \"Jumanji\" (released 30 years ago on Dec 15th, 1995)",
        "content": "",
        "upvotes": 744,
        "comments": 42,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/qwwbm0ak5d7g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1pn78s6/a_blooper_reel_of_robin_williams_from_the_making/"
    },
    {
        "id": "1pnex9j",
        "author": "Hyooz",
        "title": "Speed Racer (2008) is an all-time great film and it needs to be talked about",
        "content": "Disclaimer: I am 100% biased as this is in my top 3 favorite movies of all time but good lord the sheer craftsmanship of this film gets buried beneath the goofy tone and anime aesthetic way too much. \n\nSeriously, just go watch the first 15 minutes of this movie and tell me it doesn't pack an absurd amount of exposition, emotion, and character building into that time while managing to keep it tense and exciting. The opening race tells you everything you need to know about pretty much every character. \n\nSpeed is the best of the best but loves his older brother so much he'll slow down so as not to beat his record. Trixie loves Speed for who he is, even if who he is is an oddball kid who is so into racing that she's a (very close) number 2 in the loves of his life. Ma Racer is simultaneously scared shitless and entirely in awe by what her sons can accomplish but absolutely, totally loves her family no matter what. Pa Racer is principled, has capital-O Opinions about racing and how to do it \"right\" but still torments himself about how things went down with Rex. Rex WAS the best of the best, but gave it up for... something we don't know yet, and it destroyed him.\n\nIn 15 minutes we know more about 5 characters than most movies manage to tell in their entire runtime - all while a visually stunning and exciting race is going down.\n\nAnd it's not like the movie slows down from there. It's never boring, consistently funny, and the finale race is one of the single best things ever put to film. The Wachowski sisters peaked here. I mean it.\n\nWatch this god damned movie",
        "upvotes": 263,
        "comments": 167,
        "media": null,
        "permalink": "/r/movies/comments/1pnex9j/speed_racer_2008_is_an_alltime_great_film_and_it/"
    },
    {
        "id": "1png6mb",
        "author": "BunyipPouch",
        "title": "Announcement: Today's AMA/Q&amp;A with Zazie Beetz has been postponed. New date to be announced.",
        "content": "",
        "upvotes": 212,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/37xg5v3a3f7g1.png?auto=webp&amp;s=589fe2f950b8c94ac0f80b2effd8ae9128dc46ab"
        },
        "permalink": "/r/movies/comments/1png6mb/announcement_todays_amaqa_with_zazie_beetz_has/"
    },
    {
        "id": "1pn54ow",
        "author": "FudgeAllOfYous",
        "title": "The Other Guys (2010) Song Filled with Rich History",
        "content": "",
        "upvotes": 678,
        "comments": 135,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/C07mZs7bqj0q-ylfz8RbZr94YXUd75lYWDLzBKC3S-I.jpeg?auto=webp&amp;s=f4784bbc7acc1c7249c6064e702c3af442428c65"
        },
        "permalink": "/r/movies/comments/1pn54ow/the_other_guys_2010_song_filled_with_rich_history/"
    },
    {
        "id": "1pnlf7s",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Jon Heder - Wednesday 12/17 at 3:00 PM ET - Actor in 'Napoleon Dynamite', 'Blades of Glory', 'The Benchwarmers', 'Mama's Boy', 'Tapawingo', and lots more.",
        "content": "",
        "upvotes": 78,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/m21lmhcr4g7g1.png?auto=webp&amp;s=cf7a66f1788324a03bf23ca3960c4b19b9c39256"
        },
        "permalink": "/r/movies/comments/1pnlf7s/amaqa_announcement_jon_heder_wednesday_1217_at/"
    },
    {
        "id": "1pn10xi",
        "author": "cosmiq_teapot",
        "title": "I finally understood Blade Runner yesterday",
        "content": "Over the years I've watched Blade Runner a couple of times, but it never sat right with me. I kind of understood why it is considered a masterpiece, but I also kind of didn't.\n\nI watched it again yesterday, and it finally clicked and I also know why: I watched the theatrical version for the first time. The one with Deckard's voice-overs. I don't remember ever having voice-overs in this movie, so it must be that before I've always watched Ridley Scott's Director's Cut or the Final Cut.\n\nI now understand that what I was missing was context. Blade Runner has always been awing me with its imagery and music, but I also found the dialogues to be on the philosophical rather than the logical side and I didn't understand why certain things were happening as they were. This took me out of the movie pretty early, thus I couldn't really appreciate what I was seeing. Now, with Deckard's voice-overs, I do. And the film finally works for me. And it makes me happy, because I too can now fully appreciate a milestone of filmmaking as much as so many other people do.\n\nEDIT: Based on some comments below, I'd like to add that I'm not claiming the voice-over version of the movie is better than the later cuts. I am just glad to now have the context that is given in the voice-overs. Now that I have this context, I will probably watch the \"purer\" Director's Cut or the Final Cut again in the future. I wouldn't be surprised if I prefer them over the theatrical, too. I just needed to context given in the theatrical to better understand the movie in general.\n\nEDIT #2: This blew up much more than I anticipated. I will try to reply to every reasonable comment, but I can't promise.",
        "upvotes": 1306,
        "comments": 305,
        "media": null,
        "permalink": "/r/movies/comments/1pn10xi/i_finally_understood_blade_runner_yesterday/"
    },
    {
        "id": "1pncmx5",
        "author": "MarvelsGrantMan136",
        "title": "HOKUM - Official Teaser Trailer - In Theaters May 1",
        "content": "",
        "upvotes": 199,
        "comments": 42,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/l45BHwWz_BvJ-AUuTUHxiPngn1TRAhfWN8KmB6J0-do.jpeg?auto=webp&amp;s=a32f4cc364b0473eba637a1da865d0abfc0b87a3"
        },
        "permalink": "/r/movies/comments/1pncmx5/hokum_official_teaser_trailer_in_theaters_may_1/"
    },
    {
        "id": "1pn54o6",
        "author": "YourChopperPilotTTV",
        "title": "The Last Action Hero (1993) Directed by John McTiernan - Hamlet (Arnold Schwarzenegger)",
        "content": "",
        "upvotes": 520,
        "comments": 87,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/38z1mofqsc7g1/CMAF_270.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1pn54o6/the_last_action_hero_1993_directed_by_john/"
    },
    {
        "id": "1pnx3yj",
        "author": "MenuSad",
        "title": "River Phoenix Stand by Me",
        "content": "I just watched Stand by me for the first time, and after watching I wondered who played chris chambers as I was absolutely dumbfounded by his performance. I cannot fathom the tears I shed when I found out it was River Phoenix, as when I googled the cast I thought “ huh, wonder who played chambers bc my god that was an impressive performance, i’m sure he has many other great movies”. Just want to appreciate river as a whole, bc we really did lose one in a million",
        "upvotes": 8,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1pnx3yj/river_phoenix_stand_by_me/"
    }
]