[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 11,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 712,
        "comments": 5196,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1nyv5v2",
        "author": "DMFD_x_Gamer",
        "title": "Just found a relic in a packed away box.",
        "content": "Still has a CD in it. Not sure what the movie is though. The envelope is sealed. I dont even have a DVD player anymore so im in no real hurry to see what's inside. Still a cool find. ",
        "upvotes": 964,
        "comments": 112,
        "media": null,
        "permalink": "/r/netflix/comments/1nyv5v2/just_found_a_relic_in_a_packed_away_box/"
    },
    {
        "id": "1nz263e",
        "author": "no_tengas_miedo",
        "title": "Ed Gein is pretty bad",
        "content": "At first I thought it was going to be good. Especially the first 2 chapters, I liked them a lot, but throughout the series my desire to watch it disappears. It all consists of telling stories about psychosis actors, the Texas massacre, film producers who were inspired by him, and above all, romances they have had and experiences that are not real or are still theories.\nI thought I was going to see how Ed Gein acted, the things he did, what he did with corpses, everything. But instead I find that shit. \nI had a lot of hype for this season, I thought it would be good and above all that it would be the creepiest of all. But it feels pretty bad. It's morbid of me to want to see more of what the crimes were like and how he really acted, but damn, that's better than wanting to see stories that never happened about his life.",
        "upvotes": 269,
        "comments": 232,
        "media": null,
        "permalink": "/r/netflix/comments/1nz263e/ed_gein_is_pretty_bad/"
    },
    {
        "id": "1nytmw9",
        "author": "Last-Upstairs1387",
        "title": "What is a Netflix show you think deserved way more attention",
        "content": "I just finished watching The OA and honestly I cannot stop thinking about it. I had heard about it years ago but never got around to watching it until now. And wow. It was so different from anything I have seen before. Strange, emotional, and full of mystery. The way the story was told kept pulling me in. I kept wondering what would happen next.\n\nAfter I finished I looked it up and saw it had a lot of praise but was cancelled after only two seasons. That made me kind of sad because I really feel like it could have gone somewhere even bigger if it had more time. Netflix has so many shows that end up disappearing under the radar, even when they are really good.\n\nSo I wanted to throw this out to the community. What is a Netflix show you think deserved way more attention? Not the big ones everyone talks about, but those hidden gems that maybe only a small group of people know about.\n\nFor me The OA will stick with me for a long time. I keep thinking about its ending and the questions it leaves open. I wish more people had seen it so we could talk about it.\n\nI would love to hear your picks. Is there a show you watched on Netflix that surprised you and deserved more love? Something you wish had gotten more seasons or more people watching? I feel like this could turn into a great list of hidden gems we all need to check out.\n\n",
        "upvotes": 522,
        "comments": 759,
        "media": null,
        "permalink": "/r/netflix/comments/1nytmw9/what_is_a_netflix_show_you_think_deserved_way/"
    },
    {
        "id": "1nzjp0v",
        "author": "Sweaty-Toe-6211",
        "title": "Ginny &amp; Georgia S4 Is Now In Production! It'll Run Through To Late February.",
        "content": "",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nzjp0v/ginny_georgia_s4_is_now_in_production_itll_run/"
    },
    {
        "id": "1nzi0n3",
        "author": "rainj97",
        "title": "What Ed Gein and the real life characters in controversial Monster series actually looked like",
        "content": "",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nzi0n3/what_ed_gein_and_the_real_life_characters_in/"
    },
    {
        "id": "1nznsru",
        "author": "skawngurr__",
        "title": "in dire need of series/movie recs",
        "content": "for context: i j finished watching the **ed gein series on netflix.** as controversial as it is i loved that series, think it was a well-made dramatization. i love true crime podcasts, and other true crime stuff. i love **severance** too. \n\nalso love a lot of **nolan's films, thrillers, mind-bendy, plot twisty films and series.** also finished watching  **the pitt**, which i absolutely loved and binged in a night. i also finished watching **the girlfriend** recently and loved it too. lately its been quite difficult for me to get so hooked on a series or a movie coz i have shit attention span, so i need something out of the ordinary super good that's gona keep me hooked and hyperfixated for a while. and i don't mean good good i mean out of this world crazy good.\n\nplease and thanks!",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1nznsru/in_dire_need_of_seriesmovie_recs/"
    },
    {
        "id": "1nzgjcw",
        "author": "sadpengolin",
        "title": "Useless help",
        "content": "I messaged help to let them know a main movie wasn't showing subtitles (mainly blocked audio for me) and they just wanted to know my name and area. If I can't hear and therefore can't read it, who cares? I reset my device and checked all the settings but I guess it's just me?\n\nPs don't watch any ghost movies if hard of hearing",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nzgjcw/useless_help/"
    },
    {
        "id": "1nz5cy6",
        "author": "Lifesabitch59",
        "title": "Ed gein",
        "content": "Why couldn't they stick to just the facts of this case! That is enough to be a great series. All the fake storylines just take away from the series imo",
        "upvotes": 22,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1nz5cy6/ed_gein/"
    },
    {
        "id": "1nzo7i6",
        "author": "Odd_Negotiation5318",
        "title": "Made a tool to learn English while binge-watching Netflix - thought you might like it",
        "content": "Netflix addict here 🍿\n\nRealized I was watching hours of English content but not really learning. So I built a Chrome extension that lets you:\n\n✓ Click words in subtitles to save them\n\n✓ Get AI flashcards based on the show you're watching \n\n✓ Actually remember vocabulary from your favorite series\n\n**Perfect for:**\n\n\\- Non-native speakers improving English\n\n\\- Students preparing for TOEFL/IELTS\n\n\\- Anyone who wants to learn while watching Stranger Things for the 10th time 😅\n\n**Free version**:  50 words + basic flashcards\n\n**Premium:** Unlimited everything ($4.99/month)\n\n[https://chromewebstore.google.com/detail/ihpcbahpgelkeebgolejlpipcogffacd?utm\\_source=item-share-cb](https://chromewebstore.google.com/detail/ihpcbahpgelkeebgolejlpipcogffacd?utm_source=item-share-cb)\n\n\\[Demo video\\]\n\n[https://youtu.be/NEXclpKPMYw?si=lMkNtxXJVfKd0QLX](https://youtu.be/NEXclpKPMYw?si=lMkNtxXJVfKd0QLX)\n\nBeen using it myself for 6 months - my English vocabulary doubled!\n\nHappy to answer questions 👇\n\nFlair : Discussion",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nzo7i6/made_a_tool_to_learn_english_while_bingewatching/"
    },
    {
        "id": "1nzmi8g",
        "author": "eeejit075",
        "title": "House of Guinness",
        "content": "Is anyone watching this?  My wife recommended it to me (mainly because years ago I used to drink a lot of Guinness) but lately she’s been watching it, and what little I’ve seen and heard sounds really confusing, jarring and violent. Thoughts?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nzmi8g/house_of_guinness/"
    },
    {
        "id": "1nzlmyr",
        "author": "Onedeadchild",
        "title": "Not Part Of The Netflix Household",
        "content": "I don't have a photo of what I'm talking about but anyone who is struggling with figuring how to get around Netflix trying to get around not being on the same wifi just turn your device on airplain mode then open Netflix and sign in once in the show selection then just turn airplane mode off, it's the quiest and easiest solution. If anyone has any better ways please let me know I'm a broke college kid trying to mooch off my mom still.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nzlmyr/not_part_of_the_netflix_household/"
    },
    {
        "id": "1nzk4fq",
        "author": "ToonAdventure",
        "title": "The Twits | Official Trailer | Netflix",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nzk4fq/the_twits_official_trailer_netflix/"
    },
    {
        "id": "1nybuog",
        "author": "TheCruelHand",
        "title": "What the hell did they do to the Ed Gein story?",
        "content": "I get taking some creative liberties, but holy shit did they do everything they could make stuff up. \n\nIt will take any common person two seconds of research to learn that this isn’t how his life really was. \n\nIt is a major known fact that after his mother died, he boarded up her room and left it the way it was the day she died. And that he never dug his mother up. \n\nBut somehow here that’s exactly what’s happened?\n\nIt’s known he made furniture, bowls and a skin suit out of the people he dug up. \n\nI’m only on episode 4 and it’s like pulling teeth trying to watch this show at this point. \n\nAlso what with parallel story about Alfred Hitchcock that wasn’t shown at all in the trailers?\n\nRyan Murphy should not be allowed to make shows anymore.  \n\n\nUpdate - I’ve been corrected, he turned one of his victims into his “mother” and put his mother’s clothes on her. That is my mistake \n",
        "upvotes": 777,
        "comments": 497,
        "media": null,
        "permalink": "/r/netflix/comments/1nybuog/what_the_hell_did_they_do_to_the_ed_gein_story/"
    },
    {
        "id": "1nz2i0y",
        "author": "DefiantRanger9",
        "title": "Any suggestions for a cute, fun series",
        "content": "With 20-30 minute episodes? Some shows I’ve enjoyed so far were Kim’s Convenience, Good Girls, Weeds, Schitts Creek, Reba and Seinfeld (rewatch), Workin Moms was hilarious, and Shameless (even if the episodes were a bit longer). Oh, Younger was kind of cute too. ",
        "upvotes": 18,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1nz2i0y/any_suggestions_for_a_cute_fun_series/"
    },
    {
        "id": "1nziie8",
        "author": "Spiritual_String_778",
        "title": "dads netflix account has been hacked. What to do?",
        "content": "So backstory, my dad was logged out of his netflix account and to his surprise, the password has been changed as well as his phone number(not sure about his email). He tried contacting customer service and to his surprise nothing was working. It was just showing up error messages or either too many attempt messages. When he tried logging onto his computer it has been found that his password was in a data breach. What to do?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nziie8/dads_netflix_account_has_been_hacked_what_to_do/"
    },
    {
        "id": "1nzhtg6",
        "author": "Longjumping_Land_977",
        "title": "Real life recordings share the chilling actual voice Ed Gein had compared to the Netflix show",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nzhtg6/real_life_recordings_share_the_chilling_actual/"
    },
    {
        "id": "1nznkbb",
        "author": "AgnosticDeist0229",
        "title": "The Ed Gein Show Was Like the Best Canned Baked Beans Ad for Me, and I am Wondering How A Weirdo Got To Get Girls Way Out of His League",
        "content": "After seeing Ed Gein opening up lots of canned baked beans, I suddenly started going to Costco and bought like 5 dozens of canned baked beans for my pantry lol! \n\nSecondly, I am wondering how a guy who's like a major odd ball could get some girls who are way out of his league, but I just remembered that the series is either just highly fictionalized or some of those romantic scenes were just some of his schizophrenic hallucinations; or perhaps because it was just a small town with no social media back then, so women didn't have much options and had no unrealistic expectations unlike today's modern world.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nznkbb/the_ed_gein_show_was_like_the_best_canned_baked/"
    },
    {
        "id": "1nzhcri",
        "author": "sadpengolin",
        "title": "Casper vs wrath of becky",
        "content": "So how come I can watch the wrath of becky with closed captions but not Casper with no closed captions? One is known and one is a filler (pick your choice) but I guess a Christina Ricci fan, I'd go with the latter. Help told me it's my fault. I've watched thousands of eps or movies just fine but now it's my fault? Please explain ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nzhcri/casper_vs_wrath_of_becky/"
    },
    {
        "id": "1nzh5zv",
        "author": "LADbible",
        "title": "‘Lost’ tape shows Ed Gein’s real voice as Netflix fans slam Charlie Hunnam for accent",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nzh5zv/lost_tape_shows_ed_geins_real_voice_as_netflix/"
    },
    {
        "id": "1nz2bvd",
        "author": "itsmebroskies",
        "title": "Wayward and Mae’s acting (spoilers)",
        "content": "I literally spent the whole first episode repeatedly questioning who would cast Mae for a role in this show, and a lead role none the less, just for the episode to end and Mae’s name being cited as the creator and (sometimes) writer. Their acting was so incredibly horrible, it felt like a self insert fan fiction where they could be the “good” guy and wear tank tops that show off their biceps, and then occasionally take it off to show their tattoos and muscles. They’re so flat and lack any genuine emotion or expressions and should have never been given a lead role, even if they created it, was the director not doing their job? Why’re they being out acted by literally EVERY character and child in the show. Even that little cute kid that won the mountain episode was amazing despite barely having any speaking lines. I think they were out of their depth and should’ve stayed as a creator but had the self awareness to understand that they weren’t fit for this job.\n\nThe show itself was really interesting and had a lot of potential, however, there were some confusing plot lines. Honestly, for the most part, it seems like the “therapy” they do actually helps the kids confront their issues in a way? But then Abbie told Leila that it was just Evelyn messing with her head and that her original memories were actually true. This was kind of confusing because it seemed like blocked trauma coming out but if they meant for it to be just a manipulation of Evelyn then I think it didn’t translate fully for me. Of course this isn’t to say that everything happening at the school wasn’t fully insane. The ending also didn’t sit right, specifically Alex’s character arc. How does the character who is constantly trying to do good end up staying through that? Is it because he keeps violently hurting people over and over again so now he feels connected to her because “awe babe we’re both murderers &lt;3)? He pissed me off so much every time he would hurt someone because, for example, with that one dad whose house he went to, he could’ve fully stopped him and told him that he wasn’t a spy, but he chose to beat his ass till he was half dead? If they meant to show that Evelyn was right because he repeated the patterns of his fathers violence even while actively trying to be different then that would make sense, but I think the way they wrote the story, and once again, Mae’s HORRENDOUS acting, it didn’t translate well. I suppose it would also make sense why he chose to stay given Evelyn’s scene telling them that he doesn’t love his wife and he just loves the idea of the family she can give him, but I think these thoughts and emotions should’ve been expressed in a better way, because with Alex’s constant flat tone and facial expressions regardless of what’s happening in the scene, you’d think there were pebbles up there.\n\nAlso, a little note of appreciation for the actress who played Evelyn, she was AMAZING, her character deserved a bigger, better show.\n\nWhat do you guys think? I think writing all of this down helped me understand some decisions that I hadn’t considered.",
        "upvotes": 13,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1nz2bvd/wayward_and_maes_acting_spoilers/"
    },
    {
        "id": "1nzlgwn",
        "author": "rainj97",
        "title": "What Ed Gein's voice actually sounded like after Monsters fans make same point",
        "content": "So many people said it sounded like winnie the pooh lol",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nzlgwn/what_ed_geins_voice_actually_sounded_like_after/"
    },
    {
        "id": "1nz782s",
        "author": "kasey1017",
        "title": "Need something to keep me HOOKED",
        "content": "M/29. Favorite shows \n\nOZARK\nTEHRAN \nFAUDA\nTHE FAMILY MAN\nBODYGUARD\nTHE NIGHT AGENT \n\nNeed a show similar. Keeps me guessing and wanting more. Twist and turns. Obviously love anything political , FBI , police , espionage, Terrorism, and more. \n\nCan we name some ???\n\nThank you! \n\n",
        "upvotes": 5,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1nz782s/need_something_to_keep_me_hooked/"
    },
    {
        "id": "1nzg0fz",
        "author": "jerkoff1610",
        "title": "The truth about Adeline Watkins and whether she really was Ed Gein’s girlfriend for 20 years",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nzg0fz/the_truth_about_adeline_watkins_and_whether_she/"
    },
    {
        "id": "1nz4q41",
        "author": "OhMySullivan",
        "title": "Any Netflix suggestions I should watch before I cancel?",
        "content": "I really don't support a lot of things Netflix does but they have some good shows that are Netflix exclusive so I subscribed so I could catch up but then I'm gonna cancel and move on to a different streaming service so I'm not paying for multiple services at once. Before I cancel, what should I watch?",
        "upvotes": 8,
        "comments": 78,
        "media": null,
        "permalink": "/r/netflix/comments/1nz4q41/any_netflix_suggestions_i_should_watch_before_i/"
    },
    {
        "id": "1nz3ch9",
        "author": "nayandnem",
        "title": "Just a question about Wayward and Mae Martin",
        "content": "So I know they said that the show was based on their friend’s experiences in a Troubled Teen institution but from interviews, it seems like their friend was there for conversion therapy. \n\nWhen watching this show I was kind of taken aback by how accepting everyone was of a transman in 2003 and was confused about the camp not being homophobic, again in 2003. \n\nDidn’t most of these schools have conversion therapy, at least back then? Mae’s character Alex even hinted at it when talking to one of Laura’s ex classmates. \n\nI wonder if this was a choice by Mae because they were planning to play the main character? So it would be normalized in the show and it wouldn’t be odd that the town just accepted and respected a transman? \n\nIt just feels disingenuous to the time, but I was a kid and living in the bible belt so maybe my memory is skewed. \n\nI think it should have been a plot point to be honest, it would add more to the story. ",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nz3ch9/just_a_question_about_wayward_and_mae_martin/"
    },
    {
        "id": "1nzdqu1",
        "author": "ChampionChimp69",
        "title": "Ed Gein - Thoughts",
        "content": "I binged this show within a day of its release and wanted to voice my thoughts somewhere so please forgive the potential ramblings here. \n\nAs someone who’s morbidly curious, Gein was the first figure I had a fascination with going back as young as 10 years old having seen Texas Chainsaw Massacre far too young. I like many others fell into the online rabbit hole and have a decent understanding of his story. When this season was announced I was slightly hesitant as I felt the first season ‘Dahmer’ was a perfect encapsulation of him. His portrayal was how I imagined him and liked that it took place in black and white to emphasise the older time period. The way his crimes were showcased felt short and concise so was more than happy if they left things there along with Gacy who I felt they sensationalised with the whole murdering in his Pogo the clown getup. Regardless, I was on board and when Hunnam was cast I was looking forward to him hopefully changing my mind on how I rate him as an actor. (not the biggest fan)\n\nWith Hunnam I thought his portrayal was decent but a lot of the time I was frustrated with some of the choices that were made. To start, his voice just didn’t work for me, his accent sounded Irish at times and I found it too distracting. He took a big swing and I would have to disagree with the people saying that’s how he sounded. I’ve listened to the audio tapes and wholeheartedly disagree. Perhaps he decided to do it to further emphasise his creepiness but instead I thought it contributed toward another issue I had with how simple they made him seem. From what I gather, while Gein wasn’t the brightest bulb, he wasn’t Simple Jack levels of stupid which he came across as in the series. The constant ‘Mother’ that Hunnam was repeating throughout the show just reminded me of Freddie Highmore in Bates Motel. I wish this season didn’t come across at times like it was influenced by media like Psycho, when in fact Gein was meant to be the one that was the inspiration behind it.\n\nI didn’t think they emphasised the loneliness Gein experienced due to the inclusion of Adeline. I was hoping they’d pull a Joker and have her be a figment of his imagination but unfortunately not. I wish they used her sparingly or just didn’t include her at all, at times it felt like they were leaning too far into a romantic subplot instead of focussing on Gein’s isolation after the death of his mother.\n\nThe deaths of both his brother and mother happened far too quickly for an 8 episode series. They needed to establish these relationships better especially with his brother who gets murdered almost as soon as he appears. With his death being suspicious and not as a confirmed kill by Ed they really should’ve focussed on how the narrative we follow isn’t necessarily a reliable one due to his mental illness. They could’ve portrayed two outcomes and not make clear which one was real. The same applies to the sequences with Evelyn Hartley. Instead they frame it as if he definitely murdered them. I thought it was especially distasteful in the portrayal of Bernice Worden and the consensual relationship they had in the show which I don’t believe ever took place.\n\nA lot of my gripes fall into how they exaggerated Geins story, I understand a lot of things are up in the air and some parts undocumented but it’s a dangerous path potentially feeding wider audiences with false narratives.\n\nThe final episode was a massive eyeroll from me. Seeing Murphy basically do a serial killer MCU and even including knockoff Mindhunter characters just made my worst fears for this series come true. Having been a fan of early American Horror Story, every season felt like diminishing returns to the point it felt cringey and almost like a parody with the inclusion of actual real life serial killers in later seasons. Unfortunately the finale of Gein just reminded me of this. Each person that Gein comes face to face with in this weird glorification segment of famous killers just felt so tacky with dialogue written by some edgy fanfic writer. Atleast with Dahmer, while you could argue wasn’t a correct account atleast attempted to be somewhat accurate. With Gein it’s like they gave up midway after prematurely glazing over key moments in his story that they then decided to shift focus onto things that never happened. If there wasn’t enough documented material to make 8 episodes then just make it shorter instead of painting Gein out as some Hannibal Lecter type who helped catch killers like Bundy. From what I gather this is so far from the truth.\n\nTo end I just want to say that I rate the production design and enjoyed seeing the recreation of iconic movie sets and scenes that Gein inspired but this series overall was a complete mess and exactly the kind of thing I had reservations about. Atleast with next seasons Lizzie Borden it takes place in a time slightly more distant from ours so it allows for more artistic interpretation. I really wanted to enjoy this and was hoping it would rival Dahmer which I rewatch and think is solid. I even thought this would leap frog the Menendez series which I found a chore to get through but I can’t even say that this was better than that.\n\nIf you managed to read this all then thanks for your time and if you wanna comment I’d love to have discourse about the show as I don’t have anyone really to discuss my thoughts with. Thanks.\n\n",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1nzdqu1/ed_gein_thoughts/"
    },
    {
        "id": "1nzdmyc",
        "author": "random3382",
        "title": "Has Netflix  Reduced their Bitrates?",
        "content": "I was watching a show on crunchy-roll and then on Netflix and i noticed quite a difference in colour quality and contrast, i heard Netflix reduced their bitrates after covid but is that true, or is it just lesser than crunchy-roll and the other platforms and if yes then by how much",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nzdmyc/has_netflix_reduced_their_bitrates/"
    },
    {
        "id": "1nzk789",
        "author": "Most_Swordfish364",
        "title": "Too many commercials",
        "content": "Literally. I'm watching Wayward and trying to get into it but there's a commercial break every minute and half. What is Netflix thinking? It's ruining the show. ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1nzk789/too_many_commercials/"
    }
]