[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 14,
        "comments": 97,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 69,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1lmozcm",
        "author": "Batrah",
        "title": "Are the english people in season 3 of squid game dubbed?",
        "content": "\n\nIt's really hard to listen to them speaking. It's sounds so.. forced, dubbed or whatever and bad acting\n\nThe asian woman speaking english sounds the worst. Like the way she speaks doesn't fit her\n\nAm i the only one?",
        "upvotes": 3,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1lmozcm/are_the_english_people_in_season_3_of_squid_game/"
    },
    {
        "id": "1lmqwg9",
        "author": "MaraxtheMeeper",
        "title": "Headcanon generator",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lmqwg9/headcanon_generator/"
    },
    {
        "id": "1lmqt2i",
        "author": "Specialist_Track_897",
        "title": "17 Best Squid Game Season 3 Quotes That Are Worth Reading - Upgrading Oneself",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lmqt2i/17_best_squid_game_season_3_quotes_that_are_worth/"
    },
    {
        "id": "1lm0e0r",
        "author": "Medical_Neat5037",
        "title": "Looking for a new show to binge",
        "content": "I'm looking for something new and interesting, paranormal or funny would be best. Some recent ones I finished are Evil, Lucifer, The Good Place, Supernatural, and A Man On the Inside. Bonus if there are several seasons.",
        "upvotes": 58,
        "comments": 126,
        "media": null,
        "permalink": "/r/netflix/comments/1lm0e0r/looking_for_a_new_show_to_binge/"
    },
    {
        "id": "1lmc27m",
        "author": "graceandspark",
        "title": "I can only access on my phone!",
        "content": "I just came home and tried to open Netflix. I got the \"Your device isn’t part of the Netflix Household for this account\" - which is fine. I had been sharing an account. So, I texted my friend who has the account...and she gets the same message.\n\nI tried my phone and IT worked.\n\nI have no problem paying for an extra user (I didn't realize there wasn't one already) but my phone and my computer are on the same WiFi network. It seems to be treating my phone and my computer as two users and I don't know how to fix it. I don't want to pay for two separate users when it should just be one.\n\nThoughts?",
        "upvotes": 9,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lmc27m/i_can_only_access_on_my_phone/"
    },
    {
        "id": "1lmppmq",
        "author": "Adam_FTF",
        "title": "When will they let my account die?",
        "content": "I only use Netflix sporadically.  I buy myself a Netflix gift card and then sign up for a while when there are a bunch of shows on there that I know I want to watch (I do the same with other services.  I bought myself a short span of Disney+ when I wanted to watch Doctor Who.  I plan on doing the same with Paramount+ when the new season of Star Trek: Strange New Worlds comes out).  Then I let the card run out figuring they'll just cancel for me it when the money runs out.  But now I keep getting e-mails saying that my Netflix is on hold and that I desperately need to update my payment information.  I thought about signing back in  and then canceling, but that would require giving them that payment information first, which seems counter to the plan.\n\nI'm definitely not paying for more streaming subscriptions than I need.  The only ones I keep around are Crunchyroll (which I can always find something to watch on) and Amazon Prime (which serves other purposes).  I know they'll get tired eventually, but it's getting annoying.  Maybe I should just block their e-mails.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lmppmq/when_will_they_let_my_account_die/"
    },
    {
        "id": "1lm5vqj",
        "author": "Sudden_Pop_2279",
        "title": "Squid Game season 3 made me feel like I wasted so much of my life",
        "content": "Where... do we even begin. At this rate, I would've preferred if Gi-hun just got on that plane in season 1's ending. I find it insane the cast all agreed this was the best possible ending.\n\nSo many characters wasted and built-up for nothing.\n\nJun-ho? He's a terrible Dora the Explorer. All this searching for the island across 2 seasons, WASTED. He doesn't even TALK to his brother. How in the hell is him just being sent the baby and money a satisfying conclusion for his character?\n\nDae-ho is another example. All this mystery of whether he's a fake marine or lying. It seems like he has an abusive dad, always changing the subject whenever he's brought up. You think we're going to get some story of him being traumatized right? NOPE! He's literally just a fake marine, he goes crazy and then he dies, murdered by Gi-hun.\n\nThe mother and son were an exact copy of the wife and husband. Grandma gives the inspiring speech... and then just kills herself.\n\nThe season is described as \"forgiveness\" by Lee Jung-jae. What forgiveness? I didn't see ANY of that.\n\nAnd MG Coin? This season basically just proved Thanos was right. Throughout the first 5 episodes, he's a genuinely well-written morally gray character... and then the finale throws it ALL out the window in lightning speed. He goes from protecting Gi-hun and the baby to suddenly trying to murder both. Right after asking if the baby is okay.\n\nThe writer/director claims he wasn't supposed to be a one dimensional villain but rather make \"human/realistic decisions\" but NONE of that was it. He just turned cartoonishly evil in the blink of an eye. A worse Sang-woo, at least his turn was gradual.\n\nAnd the ending doesn't even feel like a proper conclusion, just a set-up for the sequel's. I don't even need to get into the VIP's.",
        "upvotes": 27,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1lm5vqj/squid_game_season_3_made_me_feel_like_i_wasted_so/"
    },
    {
        "id": "1lmd42f",
        "author": "pxydustdreamz",
        "title": "What happened?!",
        "content": "This update is absolutely atrocious. Not user friendly, and there’s only ONE show in “continuing watching”???? And where the hell is The Office?!!! I didn’t see any warnings about shows being removed. Did I miss something?",
        "upvotes": 9,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lmd42f/what_happened/"
    },
    {
        "id": "1lmjzlf",
        "author": "CableBeautiful4316",
        "title": "Most practical shows based on money and power",
        "content": "I loved house of cards, succession and billions, but now i don't think there are more shows like these 3, all others are soap operas and sitcoms.\n\n\n\nI loved yellowstone and its spinoffs and all shows by taylor sheridan.\n\n\n\nWatched all flanagan shows too, also watched the white lotus.\n\n\n\nIndustry 2020 is below average, watched money heist and berlin.\n\n\n\n  \n\nIs there any other show which is serious and protagonists are ruthless and powerful??",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lmjzlf/most_practical_shows_based_on_money_and_power/"
    },
    {
        "id": "1lmll04",
        "author": "adobongmelk",
        "title": "What did you think about Squid Game Season 3?",
        "content": "I think it was a little bit rushed. I hated it when they killed off my favorite character, lol.  (It was expected anyway but still) The new games were awesomeee. I also hated the VIP's acting, they sound AI.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lmll04/what_did_you_think_about_squid_game_season_3/"
    },
    {
        "id": "1lmhs0t",
        "author": "kanks_06",
        "title": "Watched season 3 of squid game and here are my two cents.",
        "content": "I’m disappointed to say the least. The ending was so meh. I had such high expectations from this season considering it was gonna be the last but it seemed as though the creators wanted to quickly finish it. They couldn’t have chosen worst actors to play the Vips because the dialogue delivery was so terrible especially the woman vips’. I get that gi hun’s spirit was crushed and he didn’t have anything to say but they could have added some more dialogues. He seemed disinterested which I get but it was boring because he’s my fav character. Also Hwang not believing woo that captain park was playing them was so annoying, woo was his teammate and him choosing to believe the captain was just😖. The ending they gave to the mother son duo too was quite anticlimactic. So many characters died very quickly in the hide and seek game, I couldn’t understand who died and how (player 44 seon and dae ho) I wish they added something more to Dae ho’s storyline instead of killing him right away. In the end, I kinda expected gi hun to kill himself but the way he fought player 333 and protected the baby I wish he died once he was out of the game. I was also at some point hoping he’d give the baby to that North Korean guard with a daughter in china. Seeing Cate Blanchett in the end was unexpected and it felt like an advertisement. When gi hun meets the front man and he takes off his mask I was kinda hoping they’d share a passionate kiss even tho gi hun was fuming with anger and was astonished. The kiss would have made up for the plot they tried to sell and made my 6hrs worth it. I liked how the entire island blew up and all the guards running around to escape it. That and the front man almost tearing up seeing gi hun muster the courage to kill all the other players was peak squid game moment for me. All in all I’d give it a 6/10. (This is my first review that I’ve ever written so if my writing style was not on point or too casual please don’t mind)",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lmhs0t/watched_season_3_of_squid_game_and_here_are_my/"
    },
    {
        "id": "1llkgpq",
        "author": "BrianLevre",
        "title": "What was the hardest thing to stomach when you watched Trainwreck Poop Cruise? SPOILER",
        "content": "For me, it's too close to call between three things:\n\n1) The sewage everywhere.\n\n2)  The completely irrational fear so many people had of pooping in a bag.\n\n3)  The women that were there having the bachelorette party.\n\nBacked up toilets making people walk through sewage... that's pretty messed up.  I don't want to imagine the smell or the illnesses people got because of it, but it's not going to last forever.  People have had to put up with worse.\n\nPooping in a bag... It beats pooping on the floor.  It's a logical measure to take when the sewage system stops working.  Poop in bags, it can all be collected, and it can be placed and contained in an appropriate area.  Truck drivers and van lifers poop in bags all the time.  It's no big deal.\n\nThose three women...  So many things about those women...\n\nFirst, the bride-to-be seemed like she was the inspiration for Kristen Wiig's role in The Californians on SNL...she was dripping with an abundance of unnecessary drama.  \"Why isn't the bar open???\"  Then taking the Imodium, doubling down on her fear of pooping without a toilet, and complaining about a soggy lettuce sandwich when there could have been zero food at all.\n\nThen the group talking about peeing in the shower.  It's like they were clueless about the fact they were born as human animals with biologic processes.  They seemed to not have an idea about how they could squat to pee in a shower.  They were disgusted with having to do it, needing a shower after.  Jeez ladies, it's just pee... ever been camping?",
        "upvotes": 305,
        "comments": 265,
        "media": null,
        "permalink": "/r/netflix/comments/1llkgpq/what_was_the_hardest_thing_to_stomach_when_you/"
    },
    {
        "id": "1lmk0he",
        "author": "---1---1---",
        "title": "Should I upgrade my subscription when I go on holiday?",
        "content": "I’ve got the basic subscription (UK- like £4.99 or smth) and I get on pretty well with it, but I can only have so many offline downloads. I am going to Germany for about 3 weeks with limited WiFi whilst out and about with my friend whom I share a subscription with. Would it be worth it to upgrade to an add free plan, would me and my friend both get unlimited downloads? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lmk0he/should_i_upgrade_my_subscription_when_i_go_on/"
    },
    {
        "id": "1lmei3r",
        "author": "Conscious_Sign7378",
        "title": "Similar to - The Quilters",
        "content": "I watched the quilters and rlly enjoyed it. The short nature of it and the heartfelt documentary style where you get to explore different peoples lives. Wondering if there were any recommendations for something similar to it?\n\n",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lmei3r/similar_to_the_quilters/"
    },
    {
        "id": "1lmj77b",
        "author": "UncloudedLensPH",
        "title": "Squid Game's Ending was Bleak—and Brilliant",
        "content": "I understand why people did not like the final season. It was anti-climactic, the characterizations felt off, and there was no *big* showdown. Ironically, I think these are exactly what made the ending exceptional. It didn't appeal to hopes or expectations, and instead, we were given a bleak conclusion, which aligns with the main theme of the show—oppression. No matter how righteous your intentions are, like Gi-hun, you cannot defeat a powerful entity with bare fists. He was *extremely* lucky, but he had no chance of defeating The Frontman. In the end, the powerful entity wins.\n\nMost did not like how certain characters were killed off early and the shifts in their behavior. But that's the point. The entire game was a matter of life or death, and it shouldn't be any wonder why people change from it. Hyun-ju and Jun-jee were likeable characters—we rooted for them. But oppression makes no exceptions.\n\nGeum-ja's suicide was no doubt a shock—many criticized it for being an act she would never do. But is that really the case? We witnessed her kill her own son. In season 2, she once said that if her son died, she would lose any reason for living. Sure, she had Jun-hee and her baby to care for, but try to think of her headspace. Her son was a loser. She witnessed him grow up wallowing in self-hatred after continuously being trampled on by everyone in his vicinity, to the point that he nearly killed himself. Now, how could a mother continue living after bearing that kind of burden? It's through oppression and self-preservation that her son was forced into trying to kill Jun-hee, and it was also its influence that made Geum-ja kill her son. Once again, oppression took victory.\n\nAnother thing that fans criticized was Dae-ho's transformation into an antagonist—many said that it did not fit his character. However, it makes sense. Dae-ho may have appeared enthusiastic, prideful, or \"tough,\" but in reality he was a coward, and oppression only worsened his state. An oppressive entity destroys a person's determination. Resilience is something you cannot easily obtain—this is especially true in the case of Dae-ho. Witnessing hundreds of people die and knowing that you *may* be next won't always be enough to make you stand up courageously. A coward like Dae-ho had no heart to be a hero, so in the end, he failed to assist them in their revolt and dropped all the blame on Gi-hun.\n\nSomething I found jarring this season is the lack of dialogue, especially on Gi-hun's part, but I think that's intentional. Last season, we anticipated him to be the hero to save the day. When his plans failed, that's when everything sunk in. Oppression to such a large degree as this fails to empower. Not only does it make a person physically unable to stand up and fight but also fail to speak up. His silence was a sign of defeat.\n\n*\"We are not horses. We are humans. And humans are...\"*\n\nHe did not get to finish his sentence. Most of us might have expected a powerful speech filled with emotion. But even before he jumped off to meet his demise, his feelings were already killed. There was nothing else to say. It was pointless.\n\nThe players saw the cruel aspects of humanity. No-eul, a soldier, saw its compassionate side. She was a North Korean refugee—she had lived through cruelty, and being a soldier in these games, she witnessed humanity at its worst. However, a part of her still had an inch of mercy and made the effort to save Gyeong-seok, the father of Na-yeon, a young cancer patient. After successfully fulfilling her plans and discovering that her daughter had \"died,\" she was about to shoot herself. But seeing Gi-hun sacrifice his life to save the baby changed her decision. When she met the father months later, she discovered that people donated for his daughter's treatment, showing humanity's empathetic side. Later on, the broker she spoke to last season eventually helped her track down her daughter. As grim as the themes are about society, you can't disregard its strengths, and the series showed that side in these instances—ironically from the perspective of one of the guards.\n\nFinally, everyone expected one big fight between Jun-ho and his brother. But that never came, and when he did meet his brother, he barely did anything. His lack of action is due to the fact that he was an outsider. Gi-hun returned because he experienced the oppression, and it inspired in him a sense of justice—that's why he planned the revolt. Jun-ho never knew its entirety. The main motive why he put so much effort into finding the island in the first place was to see his brother and know why he joined. When he finally got the chance to see him, he begged desperately. I think at this point he realized the futility in what he was doing—his brother was in too deep. There was also no use fighting him—that's not what he was there for.\n\nThis final season had its flaws, but it tied everything together surprisingly well—in a way that didn't give in to clichés. It was unpredictable and painfully bleak, which complemented the message. Most of us might have the optimistic notion of oppression as a requisite to justice—too often, media portrays oppression as a force that can be toppled through righteousness. But in reality, there will be instances when it's the complete opposite.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lmj77b/squid_games_ending_was_bleakand_brilliant/"
    },
    {
        "id": "1lmct9y",
        "author": "zu_matski1",
        "title": "I hate netflix household",
        "content": "I genuinely do not get it. My TV is connected via Ethernet, so I'm puzzled about how to log in to Netflix through my computer and phone. Is Netflix this stingy??? I've been struggling for hours, and I've even tried calling Netflix themselves, but they keep giving me bs. ",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lmct9y/i_hate_netflix_household/"
    },
    {
        "id": "1lm9cb8",
        "author": "Lord_Explosion",
        "title": "Why do I have to sign in on the TV in order to cast from my phone?",
        "content": "I travel between houses and am unable to watch Netflix on my TV even when I try to cast from my phone because there is no I’m traveling option. The I’m traveling option used to exist on the Samsung TV app, but it doesn’t anymore.  I tried to cast from my iPhone, but it still won’t let me watch on the TV despite having an active account on my phone. The house I’m currently at is not the primary Netflix household. I also don’t want to add this house to my household because I am not here often enough to necessitate in an extra $7 a month.",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lm9cb8/why_do_i_have_to_sign_in_on_the_tv_in_order_to/"
    },
    {
        "id": "1lmelwn",
        "author": "Ok_Help_9964",
        "title": "Best scary movie?",
        "content": "I rarely watch movies (maybe once a year) but finally got around to getting Netflix. I usually like scary movies, and was curious what everybody here thinks is the best scary movie up to date.Thoughts?",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lmelwn/best_scary_movie/"
    },
    {
        "id": "1lmh6uo",
        "author": "lostinthesauce1200",
        "title": "Logging out a device",
        "content": "If I log a device out of my Netflix account, will it take them to the login page immediately even if they are actively watching something on said device? Or will they still be able to watch until they close the app then try to open Netflix again on the device. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lmh6uo/logging_out_a_device/"
    },
    {
        "id": "1llsq0m",
        "author": "Ok_Resolution_9218",
        "title": "Netflix incognito mode",
        "content": "\nJust an idea: I think Netflix should add an incognito mode feature to the app! Sometimes users just want to watch something without it affecting their recommendations or appearing in their viewing history. This would be really helpful for people who share accounts, or even just for times when you’re watching something different from your usual preferences—like a kid’s movie, a guilty pleasure show, or a documentary for school.\n\nAdding incognito mode would allow users to explore more content freely, without worrying about Netflix’s algorithm messing up their suggestions. People use incognito mode in web browsers all the time for similar reasons—why not bring that privacy option to streaming too?\n\nAlso, I noticed a small typo in the original idea—“incognito mouse” was probably meant to say “incognito mode.” But hey, imagine a sneaky little mouse sneaking around Netflix too! 😄\n\nOverall, I think this feature could attract a lot more users and keep current ones happier.\n",
        "upvotes": 33,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1llsq0m/netflix_incognito_mode/"
    },
    {
        "id": "1lmddtc",
        "author": "gauravbais",
        "title": "Does Netflix egypt has 30 days geo lock?",
        "content": "Netflix increases prices again in my country, so looking for another option. Just want to know if anyone knows whether Netflix Egypt has 30 days GeoLock?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lmddtc/does_netflix_egypt_has_30_days_geo_lock/"
    },
    {
        "id": "1lmczvv",
        "author": "pixie_dust216",
        "title": "Question about Kpop Demon Hunter Lore",
        "content": "Just for the record, I love the movie and am currently writing fanfiction about it. My take was that each generation of hunters created the Golden Honmoon and with the new generation it needs to be restored. But my sister said that only the girls created the golden Honmoon. I need this knowledge pleaseee\n\n  \nEdit: Also, can only Gwi-Ma make deals with humans to take their souls? Or can other demons do that too? Because if so, then I want Jinu to have been the ones to make the Saja boys demons (I headcanon that they were the band in the picture at the shady tonic doctors office and Jinu offered to make them the most popular band in the world)",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lmczvv/question_about_kpop_demon_hunter_lore/"
    },
    {
        "id": "1lm820t",
        "author": "hazentheamazing",
        "title": "I will say that the last kids on earth is pretty underrated and not talked about as much",
        "content": "I’m on on book 2 episode 6 right now and I can confidently say that this is one of my favourite shows (not like a top ten or even top 15 but still)\n\nBut what I will say is that, the story is great, the plot is great, the characters are great, the Animation is more then great, the dialogue, the first episode was a great way of to start off the entire series and the episode is about an 1 hour and 6 minutes long (which is rare since the rest of the show and most animation shows only have like at most 20 minutes maybe 50 minutes of episodes), and this is better then the typical shitty shows Netflix put on here (looking at you big mouth)",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lm820t/i_will_say_that_the_last_kids_on_earth_is_pretty/"
    },
    {
        "id": "1lmf7r4",
        "author": "Suspicious_Rip_1410",
        "title": "Black Mirror: Bandersnatch is gone?",
        "content": "Checked a couple times in this last week to find this movie again. Loved the idea of interactive movies, and I had watched it before on my xbox. For some reason, it looks like Netflix removed it, or at least removed it from Netflix on the xbox. Anyone know what might be happening or another place I could look to watch it? ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lmf7r4/black_mirror_bandersnatch_is_gone/"
    },
    {
        "id": "1lmiv4o",
        "author": "Taotao83465",
        "title": "I'm in USA, it says there's season 3 of squid games but I don't see any season 3 episodes on Netflix,why am I not seeing any season three episodes on Netflix?",
        "content": "I'm in USA, it says there's season 3 of squid games but I don't see any season 3 episodes on Netflix,why am I not seeing any season three episodes on Netflix?",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1lmiv4o/im_in_usa_it_says_theres_season_3_of_squid_games/"
    },
    {
        "id": "1lmd3jv",
        "author": "ExistentiallyFlayed",
        "title": "English subs on entire ESL shows?",
        "content": "I watch everything with English subtitles, and I watch a ton of foreign language shows on many platforms. \n\nNetflix seems to be the only one where English subs are only on the parts of shows that aren’t in English instead of the whole show. La Palma for example, switches between multiple languages. English subs show for all the non-English parts, then shut off for the English speaking parts. \n\nI’ve tried to google and play with the settings- am I missing something or is this just how the subs are set for shows that have multiple languages with one being English?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lmd3jv/english_subs_on_entire_esl_shows/"
    },
    {
        "id": "1lm3ryu",
        "author": "im_not_creative123",
        "title": "Trying to log in on my pc, but the website looks like this (default font, cant interact with anything) and when i click the sign in button, the login page is a white screen",
        "content": "I have tried it on multiple devices (laptop and phone as well) and a different browser, but the results are the same. Anyone having issues as well? This is my first time trying to log in on my computer, my smart tv works fine.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lm3ryu/trying_to_log_in_on_my_pc_but_the_website_looks/"
    },
    {
        "id": "1lmfdbr",
        "author": "Fearless_Total_9727",
        "title": "Which hide and seek game do you think was more sadder?",
        "content": "",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1lmfdbr/which_hide_and_seek_game_do_you_think_was_more/"
    },
    {
        "id": "1lmavyz",
        "author": "Emile_the_rat",
        "title": "Stranger Things season 1 HDR",
        "content": "\n\n\nI know season 1 originally was made and released in SDR.\n\nBut I’ve started rewarching the show now, and my TV gets a HDR signal when playing season 1.\n\nHDR seems on point too. I tried to search online, but can’t find any official announcement from Netflix on this. So seems like Netflix in silence remastered season 1 for HDR. Don’t mind, HDR looks great, hard to see the difference between HDR in season 1 and 2. so they did a great job.\n\nThe scene in byers house when the Demogorgon enter through the ceiling and all the christmas lights are flashing looks insane in the HDR remaster.\n\nSame with the school scene were El destroys the Demogorgon and all the lights are flickering. \n\nThese two scenes looks brilliant in HDR.\n\nQuestion is, have anyone else noticed this? When did it happen, season 1 was SDR last time I watched it, 2 years ago.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lmavyz/stranger_things_season_1_hdr/"
    },
    {
        "id": "1lmj9li",
        "author": "Antique_Law5151",
        "title": "Favourite Creeped Out Plot Twist?",
        "content": "I Added Some Examples Of Cool Plot Twists From The Show “Creeped Out”. So Far From The Show. The Twists Are Shocking At Least Best Plot Twists From Worst Plot Twists",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lmj9li/favourite_creeped_out_plot_twist/"
    }
]