[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1oqxuou",
        "author": "Jet_Jirohai",
        "title": "Why does it seem like Netflix is the only streaming service that knows how to make a functional user experience?",
        "content": "My main 3 streaming services are HBO, Hulu and Netflix(and YouTube premium, but that's a whole different beast), but I've used others before. I'm not talking about the content on these services or how any company manages their original content, etc. This is specifically about the UI and user experience\n\nWhen I boot up Netflix, it's always snappy, it's always easy to find what shows I've been watching and continue, the app lets me go to a series page BEFORE loading an episode, it's the best about knowing I want to restart a movie/show when the progress bar is near the end, the \"are you still watching?\" prompt is actually consistent. Nearly all of this stuff is either worse or non-existent on the other streaming services I use. Hulu makes me jump through hoops to get to a series page. HBO Max will throw up huge show banner ads I have to scroll through before I can start looking at my library\n\nMaybe there's other streaming services that compete with Netflix more in this regard, but it's something that's really been bothering me lately. If I'm bored and don't know what to watch, I'll boot up Netflix 95% of the time because browsing it feels good compared to my other options.\n\nDoes anyone else here share this opinion? I've tried googling it, but all the Reddit posts are complaining about what shows are available or just complaining about streaming in general",
        "upvotes": 207,
        "comments": 162,
        "media": null,
        "permalink": "/r/netflix/comments/1oqxuou/why_does_it_seem_like_netflix_is_the_only/"
    },
    {
        "id": "1oqw0hh",
        "author": "Fun_Molasses5215",
        "title": "Chrishell Stause officially announces she's quitting Selling Sunset after nine seasons on the show",
        "content": "",
        "upvotes": 167,
        "comments": 66,
        "media": null,
        "permalink": "/r/netflix/comments/1oqw0hh/chrishell_stause_officially_announces_shes/"
    },
    {
        "id": "1or4cc0",
        "author": "Repulsive_Knee9258",
        "title": "Frankenstein was beautiful",
        "content": "I won’t spoil anything but it was a truly beautiful movie, I love how they showed both perspectives of the story telling Victor’s and Frankenstein’s. The visuals in this movie were just amazing, you can tell Netflix spent a lot on this movie. I think this movie might be the best film I’ve seen come out on Netflix this year. Guillermo del Toro once again has proven he’s the best director for the dark fantasy genre of our generation. Highly recommend this film. Loved the acting of Oscar Isaac, Christoph Waltz and Jacob Elordi. excellent casting as well. I can see this even getting some Oscar nominations. 5/5 for me. ",
        "upvotes": 32,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1or4cc0/frankenstein_was_beautiful/"
    },
    {
        "id": "1oqittg",
        "author": "potatoMan8111",
        "title": "My biggest pet peeve with netflix…",
        "content": "Why oh why can they just not show the trailer of the movie or season of the show when you are looking around what to watch?!? I dont want to see some random 30-60 second clip of a random part of the movie or show!!! \n\nThey do sometimes but it’s definitely like 85% just a random scene.",
        "upvotes": 75,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1oqittg/my_biggest_pet_peeve_with_netflix/"
    },
    {
        "id": "1or3vqq",
        "author": "LandscapeNarrow5352",
        "title": "'KPop Demon Hunters' Get 3 Grammy Nominations for 'Golden'",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1or3vqq/kpop_demon_hunters_get_3_grammy_nominations_for/"
    },
    {
        "id": "1oqy3hq",
        "author": "misterpopculture",
        "title": "Netflix Announces New Competition Series Turning Retail Into a Shopping Frenzy",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oqy3hq/netflix_announces_new_competition_series_turning/"
    },
    {
        "id": "1oq6qz5",
        "author": "Significant-Fun-4235",
        "title": "'Monster' Season 4: Sarah Paulson to Play Aileen Wuornos (EXCLUSIVE)",
        "content": "",
        "upvotes": 50,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1oq6qz5/monster_season_4_sarah_paulson_to_play_aileen/"
    },
    {
        "id": "1or20hh",
        "author": "Darky1324",
        "title": "Netflix don't wanna download anything",
        "content": "So as the title says my netflix literally refuses to download anything  \ni did everything what i can turn off the wifi and turn it back on  \nrestart the download  \nclean the caches of it  \nbut it just get there in to the downloads and exist there  \ncan't even cancel it can't even start it  \nand my netflix is up to date if someone ask me   \nso i just dont know whats happening to my netflix like it worked before but it just died for some reason  \nany help?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1or20hh/netflix_dont_wanna_download_anything/"
    },
    {
        "id": "1orc52e",
        "author": "Classic_Actuary8275",
        "title": "The perfect neighbor-I feel bad for her",
        "content": "I have to tell you, I am 15 1/2 minutes in and that is it. And I feel bad for the neighbor lady. The one who ends up losing her mind on these kids. I think they really were driving her crazy. I’m empathetic to her because When I was pregnant and postpartum, I lived in an apartment that had really bad noise insulation and I literally lost my mind. Because I had different noises from every direction and kids were screaming outside all the time right outside my window. It was crazy and I had intrusive thoughts about shooting up to my neighbor. Postpartum is a really odd time so just know you could never understand it if you haven’t been through it. I never had any plan to do it, it was an intrusive thought that would come into my brain that I didn’t want there. But I really lost my mind from lack of sleep from the noise and lack of peace. Does anyone else feel for her? Maybe something else happens later on that I haven’t seen yet that will change my mind.",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1orc52e/the_perfect_neighbori_feel_bad_for_her/"
    },
    {
        "id": "1oql52r",
        "author": "junewick",
        "title": "Soulmates on Netflix - Episode 2 is an insane opposite of Promising Young Woman",
        "content": "Netflix is suggesting the show Soulmates now, so for some reason I’m watching it five years late. But Episode 2 is just wild. I hate watching episodes like this because it always makes me think the writers are sexual predators. Like this is not a real story, some poor professor is super innocent and all these young girls keep throwing themselves at him and his life gets ruined because someone takes revenge. This is the myth that predators hide behind.\n\nThis is the exact plot of Promising Young Woman in reverse, that also came out in 2020. When I was watching it, I thought Soulmates was recent so I was shocked. But knowing it’s from 2020 too makes more sense, I don’t think it would have been produced in a post-Promising Young Woman world. ",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1oql52r/soulmates_on_netflix_episode_2_is_an_insane/"
    },
    {
        "id": "1oqflkd",
        "author": "OpeningFull6575",
        "title": "Are there any good anime live action adaptations?",
        "content": "So my mum hates anime, she thinks its weird and claims it is all pornagraphic. However she quite enjoys the Avatar Netflix live action show and we have bonded over Alice in borderland. Because of that I'm thinking of watching some live action anime addiptations with her. My current plans are:\n\n1. The zom 100 movie\n2. The one piece liveaction show (I've never watched the anime so I wouldnt have the issue to comparing them)\n3. Maybe one of the kakegurui liveactions. I adore the anime so I'm scared of how bad they'll be, but I don't wanna write them off\n\nI have most streaming services, though I don't have crunchyroll.",
        "upvotes": 5,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1oqflkd/are_there_any_good_anime_live_action_adaptations/"
    },
    {
        "id": "1oqb4ea",
        "author": "Zehealingman",
        "title": "What did Inside Job do wrong?",
        "content": "I‘m being serious and hoping to gain external input to balance out my own perception and biases.\n\nIt feels like in a vacuum, Inside Job had everything it needed to at least finish the story it tried to tell.\n\nIt had a, in my opinion, highly differentiated setting that was directly connected to the current cultural zeitgeist with its focus on conspiracy theories and media manipulation. \n\nThrough that setting, it had touchpoints with „older“ generations (Moon landing conspiracies, JFK), younger generations (Social Media and media in general) and everything in between with stuff like the Illuminati. \n\nIt had two main characters that had tangible growth and a supporting cast that had its moments.\n\nIt had personal storytelling which included parenthood and trauma.\n\nIt feels like all of the above could be attributed to shows like Hazbin or Southpark which are going strong. \n\nI know media is more complex than being a checklist. But what happened? Did Netflix calculate KPIs that were too unrealistic? Did it not resonate?",
        "upvotes": 9,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1oqb4ea/what_did_inside_job_do_wrong/"
    },
    {
        "id": "1oq3bpq",
        "author": "Goooooogol",
        "title": "What does everybody think of netflixes UI?",
        "content": "What i mean by this is the rows of shows you see on the homescreen.\n\nI personally hate how my List just moves seemingly at random when it should stay in a findable place, because it is difficult to remember what shows i wanted to watch if my list keeps moving locations. I know there is a button for it, but its easy to forget it’s there.\n\nI do think the Continue Watching and Watch List rows should stay at the top of the screen, and i have no idea why netflix makes finding them difficult from time to time.",
        "upvotes": 21,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1oq3bpq/what_does_everybody_think_of_netflixes_ui/"
    },
    {
        "id": "1oqogpn",
        "author": "GenTrapstar",
        "title": "Vince Staples Show",
        "content": "Just finished season 2 and enjoyed it. Hopefully we get a season 3. I can’t truly remember the first season except for the mascot guy and was wondering if he would get an appearance in season 2. He probably died in the first season and don’t even remember if he did. Anyways I enjoyed the second season. The show seems simple but they do it right in my eyes. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oqogpn/vince_staples_show/"
    },
    {
        "id": "1opwhdu",
        "author": "Immediate_Strike7720",
        "title": "Alice in Borderland 3",
        "content": "Has anyone watched this and felt like this season was a massive letdown? I feel like if they had stopped at 2 seasons it could’ve been great, personally I feel season 3 was all over the place ",
        "upvotes": 31,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1opwhdu/alice_in_borderland_3/"
    },
    {
        "id": "1oqlz6i",
        "author": "Specialist-Change-86",
        "title": "Finally have the release schedule for Stranger Things Season 5",
        "content": "I honestly kind of forgot about the fifth season. The fourth season was a long, long time ago,  when AI did not boot me off my job. Found a helpful release schedule for the final season:\n\n[https://www.soapcentral.com/shows/stranger-things-season-5-release-schedule-here-s-streaming-guide-netflix-sci-fi-horror-drama-s-final-chapter](https://www.soapcentral.com/shows/stranger-things-season-5-release-schedule-here-s-streaming-guide-netflix-sci-fi-horror-drama-s-final-chapter)",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oqlz6i/finally_have_the_release_schedule_for_stranger/"
    },
    {
        "id": "1opx9wa",
        "author": "Sufficient-Curve2951",
        "title": "Lena Heady and Gillian Anderson in a Western drama!!???",
        "content": "As a Gillian Anderson fan, I am so excited to see her in The Abandons. Two brilliant actresses butting heads on-screen and finally a Western with two strong female characters. WOWW The cast also looks stacked!!",
        "upvotes": 19,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1opx9wa/lena_heady_and_gillian_anderson_in_a_western_drama/"
    },
    {
        "id": "1oqs82n",
        "author": "SherbertKey5847",
        "title": "Stranger Things - The Vanishing of ----- -----",
        "content": "Duffer brothers have went complete GOT in this season Damn \nI just heard from my mate's friend who worked with the writera team of this show\nI can't wait to share this with y'all \n\nSpoilerS AHEADDDD!!\n\nEpisode 2 is titled “The Vanishing of Henry Creel,” and it’s said to be one of the most important episodes of the entire series. It goes deep into Henry’s backstory, his disappearance after the Season 4 events, and how his connection to the Upside Down is tied to Hawkins in ways we never imagined.\n\nThe craziest twist? Karen Wheeler (Mike’s mom) is revealed to be Henry Creel’s cousin on his mother’s side. That small family link suddenly explains why the Wheelers have always been subtly connected to everything weird in Hawkins — and this season, the focus really shifts to them. It’s practically a Wheeler family arc from here on out.\n\nMike and Nancy both uncover the truth about their family’s connection to the Upside Down, and for the first time, Mr. Wheeler actually steps up. You’ll finally see him in action — not just sitting in his chair, but actively involved in the fight. Apparently, he has one of the most surprising character moments in the whole show.\n\nNow for the heavy part — there are some huge deaths this season:\n\nErica, Max, and Will don’t make it through. Each of their deaths plays a key emotional and story-driven role, pushing Eleven and the others toward their final confrontation.\n\nVecna is destroyed by Eleven, in a massive showdown that’s described as one of the most cinematic moments the show’s ever done.\n\nBut right after Vecna’s defeat, the Mind Flayer reawakens, pulls everyone back into its shadow world, and then goes back into a kind of deep sleep — leaving Hawkins completely changed.\n\nAnd no, I’m not revealing everything. There’s one major detail I’ve intentionally left out — something BIG happens at the end.\n\nJust wait till the end of this month you’ll see what I mean.",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1oqs82n/stranger_things_the_vanishing_of/"
    },
    {
        "id": "1oqr3hj",
        "author": "AstraeaMoonrise",
        "title": "Netflix deleted my account",
        "content": "Hi all, I want to renew my old Netflix subscription after a break trying to reduce monthly outgoings etc last year, I had decided to cancel some streaming services with the view of restarting them later.\n\nMy last month was August 2024 so over a year ago. \n\nI understand after googling that they do indeed delete accounts after inactivity of 10 months.\n\nMy question is if I create my account again on the same email as before will all my past watch history be gone? If that’s the case I find that really unfortunate and probably won’t renew at all.\n\nI was surprised by the account deletion as there was no warning or notice that would happen. I might’ve renewed it sooner if I’d known because my viewing history is useful for me and losing it sucks. Of course they can’t store data for millions of customers indefinitely though, I just didn’t realize. Wish I’d known!\n\nThanks!\n",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1oqr3hj/netflix_deleted_my_account/"
    },
    {
        "id": "1opyw3e",
        "author": "sonofanadultfilmstar",
        "title": "The Blacklist",
        "content": "This came  up on my “things you may like” section. It looks like a show I would definitely enjoy. And love James Spader.\n\nI wanted to ask though - is this a show that’s like CSI or Law and Order where each episode is different or is it like Breaking Bad/Prison Break where the episodes do go together throughout each season? ",
        "upvotes": 8,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1opyw3e/the_blacklist/"
    },
    {
        "id": "1oqrk6d",
        "author": "intelerks",
        "title": "Millie Bobby Brown stuns in sheer Rodarte gown at ‘Stranger Things 5’ premiere",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oqrk6d/millie_bobby_brown_stuns_in_sheer_rodarte_gown_at/"
    },
    {
        "id": "1oq2skp",
        "author": "LandscapeNarrow5352",
        "title": "Stranger Things: Tales From ‘85 | Official Announcement | Netflix",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oq2skp/stranger_things_tales_from_85_official/"
    },
    {
        "id": "1op5qxs",
        "author": "EchoNarwhal812",
        "title": "Which actor completely carried a Netflix show",
        "content": "For me it has to be Rami Malek in Mr. Robot. Even though it originally aired elsewhere, watching it on Netflix now just hits different. The way he plays Elliot awkward, brilliant, paranoid, and somehow still relatable makes the whole show work. Without him, it wouldn’t be half as powerful.\n\nYeah I know it might not be a real \"Netflix\" show but it is on Netflix. What really stuck with me wasn’t just the story, but how real the underlying themes felt. The hacking, the data breaches, the constant sense that someone’s always watching it all got under my skin. I ended up going down a massive rabbit hole learning about cybersecurity, privacy tools, and how vulnerable most people really are online.\n\nNow I actually use different VPNs depending on what I’m doing, run privacy tools to wipe old data, and even started monitoring data leaks with cloaked just to see how often our information ends up exposed. It’s wild how a show meant for entertainment can completely change how you see technology and the world around you.",
        "upvotes": 255,
        "comments": 136,
        "media": null,
        "permalink": "/r/netflix/comments/1op5qxs/which_actor_completely_carried_a_netflix_show/"
    },
    {
        "id": "1oqb8xd",
        "author": "Puzzleheaded-Wear381",
        "title": "The Witcher S4",
        "content": "How much did it affect you to see another actor in the role?\n\nAlthough I must say that Liam Hemsworth often made me confuse him with Henry, I'm left wondering if he was trying so hard to be the witcher or to be Henry's witcher...",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oqb8xd/the_witcher_s4/"
    },
    {
        "id": "1ope43t",
        "author": "BrideofBazza",
        "title": "Cancel for elderly parents",
        "content": "My parents have moved into assisted living and are no longer using their Netflix account.  Their tv is gone so do t have access. I have no idea what email/phone they used to set it up. \nThey are being charged $24.99/month and I have no idea how to stop it. Any suggestions? \n\n",
        "upvotes": 95,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1ope43t/cancel_for_elderly_parents/"
    },
    {
        "id": "1oqakj5",
        "author": "Unusual_Oil_9106",
        "title": "Why can't I watch lord of war in Canada?",
        "content": "I searched Lord of War in google and the description says it isn't available in my country but when I click on it it says it isn't available because of licensing restrictions on a non-ad free plan. Which is it? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oqakj5/why_cant_i_watch_lord_of_war_in_canada/"
    },
    {
        "id": "1oqix0a",
        "author": "merepuppy",
        "title": "Why is Netflix the only service I have so many buffering problems on?",
        "content": "My internet connection is normally rock solid. 100/10 Mbps. I have no issues with YouTube, Peacock, or any other service. But Netflix, the OG of movie streaming, has to constantly have loading/buffering issues. Surely I'm not the only one? And no, my ISP does not throttle. \n\nI just want to watch my KPop Demon Hunters. 😭",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1oqix0a/why_is_netflix_the_only_service_i_have_so_many/"
    },
    {
        "id": "1oq7l69",
        "author": "AdPrestigious7952",
        "title": "Apple TV Netflix “Not Part of Household”",
        "content": "I’ve been having ongoing issues with Netflix showing the message: “This device isn’t part of your household.”\nMy household and I are the only ones using our devices, but this message keeps coming up. I have several Apple TVs, and some are on different internet providers (for example, at a cabin or secondary location). On Apple TV, it doesn’t even give me the option to send a code — it only lets me “switch households” or “update the household,” depending on the language.\nHas anyone else run into this or found a fix? I’m starting to think something’s messed up with how Netflix is detecting my devices. Any troubleshooting tips or settings I can try before I give up and cancel would be appreciated.\n",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1oq7l69/apple_tv_netflix_not_part_of_household/"
    }
]