[
    {
        "id": "1rfqabp",
        "author": "AutoModerator",
        "title": "Netflix Declines to Raise Offer for Warner Bros.",
        "content": "",
        "upvotes": 302,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1rfqabp/netflix_declines_to_raise_offer_for_warner_bros/"
    },
    {
        "id": "1rilfcy",
        "author": "NeuroSeg",
        "title": "Is Netflix down for you?",
        "content": "Southeast US here. on the Netflix app my wife and I keep getting an error saying something like \"can't connect to netflix... retry\"\n\nwe will use the retry feature and the library will load but won't play anything. tried downloading as well, to no avail.\n\non Android.",
        "upvotes": 15,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1rilfcy/is_netflix_down_for_you/"
    },
    {
        "id": "1rii9bp",
        "author": "anishkaagarwal",
        "title": "Watching THE DICTATOR on Netflix right now and is this like the best time to watch this movie or what",
        "content": "Literally during the ww3 predictions, it just fits the situation, aladeen roaming around in the streets of America and then falling for joey...it's the cutest and story is hilarious with all kinds of political and controversial jokes lol",
        "upvotes": 23,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1rii9bp/watching_the_dictator_on_netflix_right_now_and_is/"
    },
    {
        "id": "1rie1de",
        "author": "K_N1NE_",
        "title": "The Recruit",
        "content": "With the recent release of the The Night Agent season 3 I can’t help but wonder why The Recruit was cancelled all this time after the fact.\n\nIt was such a great show with great actors, there’s really no other show like it. Very original and fun show. \n\nI get that it was probably cancelled due to the poor writing of season 2 but I don’t feel like it was any worse than a show like Night Agent. \n\nI really feel like Netflix didn’t give it a fair chance at all and it’s super frustrating. All they would need for a successful 3rd season is just reveal that Max never died and bam viewership would be through the roof.\n\nWhat do you think? Did the weird second season warrant cancellation?",
        "upvotes": 34,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1rie1de/the_recruit/"
    },
    {
        "id": "1ribb2u",
        "author": "Southern-Brother5693",
        "title": "Ted Sarandos \"Unlikely\" To Attempt Another Netflix M&amp;A",
        "content": "",
        "upvotes": 15,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ribb2u/ted_sarandos_unlikely_to_attempt_another_netflix/"
    },
    {
        "id": "1rig4re",
        "author": "harpreetthind",
        "title": "Need recommendations",
        "content": "Almost done watching never have I ever what else does everybody recommend watching?\n\nAlso watching the good Dr, thanks for all the recommendations\n\nThanks for all the recommendations. Looking forward to the comments.",
        "upvotes": 5,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1rig4re/need_recommendations/"
    },
    {
        "id": "1ri4uly",
        "author": "ShihtzuMum39",
        "title": "Shrill - anyone else watched it? Thoughts?",
        "content": "I’m so torn with this show. On one hand, I really like that it’s tackling some of the discrimination fat people face. On the other, Annie can be very unlikeable in how she handles it and pretty self centred generally. Wondered what other people think?",
        "upvotes": 17,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1ri4uly/shrill_anyone_else_watched_it_thoughts/"
    },
    {
        "id": "1ri3wkf",
        "author": "Useful-Rough-6449",
        "title": "Makers and stars of Gold and Greed on Netflix will be giving a presentation at Seeker’s Summit 3/28 in Tucson!",
        "content": "Anyone else going?! I’m extremely excited. Seeker’s Summit is a huge gathering of treasure hunters. Netflix creators and stars will be talking about the filming process and success of Gold and Greed! \n\nseekerssummit.org ",
        "upvotes": 15,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1ri3wkf/makers_and_stars_of_gold_and_greed_on_netflix/"
    },
    {
        "id": "1ribsi6",
        "author": "teawithgoatmilk",
        "title": "Is Netflix down ?",
        "content": "Hi everyone ! \n\nI’m living in France and my Netflix account isn’t working. \n\nI was wondering in this was all of France or not?\n\nJust saying I’ve no internet connexion when I clearly do.\n\nBonjour tout le monde! \n\nJ’habite en France et mon compte Netflix ne fonctionne plus oh du moins ce soir. Je me demandais simplement si c’etait un “beug” collectif ou si c’était moi. L’application me met que je n’ai pas d’internet alors que j’en ai. ",
        "upvotes": 5,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1ribsi6/is_netflix_down/"
    },
    {
        "id": "1rimyxh",
        "author": "3greg0r3",
        "title": "Looking for a new series to binge",
        "content": "We've just finished watching Nurse Jackie and need a new series to fill the void. It doesn't have to be a medical drama but it would be great if it had multiple seasons. We like characters with substance, plots that aren't cliche or predictable, and a little humour in the mix. Does anyone have any recommendations?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rimyxh/looking_for_a_new_series_to_binge/"
    },
    {
        "id": "1riigwy",
        "author": "AffectionateRate7290",
        "title": "Adolescence Star Owen Cooper Creates History At 2026 Actor Awards",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1riigwy/adolescence_star_owen_cooper_creates_history_at/"
    },
    {
        "id": "1riex1f",
        "author": "ryanbuckner",
        "title": "Actors Awards LIVE buffering problems",
        "content": "Anyone else having buffering issues while watching the LIVE Actor Awards tonight? I tried some other shows and they are working fine. I tried restarting my Roku and that didn't help. \n\nAnyone else? ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1riex1f/actors_awards_live_buffering_problems/"
    },
    {
        "id": "1ribymc",
        "author": "Remarkable_Value_149",
        "title": "Restrictions on Tabs?",
        "content": "Got this message:\n\n&gt;\"Netflix Error M7020 If you get the error code M7020 on your computer with this message: Pardon the interruption Looks like you're viewing Netflix from more than one browser or tab. Please close any extra browsers or tabs, then reload the page. If that doesn't fix the issue, you may need to restart your computer.\"\n\nGot this message because I had two Tabs open and one was paused.. why is this even a thing? I'm supposed to be able to stream from 4 devices at the same time. if I want to stream on 4 different tabs/Browsers, I don't see the problem.\n\nand in this specific case, I wasn't even trying to stream two at the same time. I just had one other tab from Netflix open..\n\nwhy is this a thing? Youtube do not have this issue.. I just don't understand why this is a thing.\n\nplease enlighten me, I can't see the logic and its driving me insane",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ribymc/restrictions_on_tabs/"
    },
    {
        "id": "1rib9qe",
        "author": "The_Mr_Welkom",
        "title": "What was your reaction to ending of Dark: se2 ep5?",
        "content": "This is the last episode that I watched. Through the whole episode I was so flowing with its scenes, emotions and story. And at the ending scene, the way my jaw dropped and me straing at the screen, not knowing what to think because there isn’t any answer nor the slightest thought coming through my mind in the moment that could answer the questions how and what now, it was crazy. \n\nNow i get why this show is so complicated, hard and goated. Yet i still have much to watch.\n\nSo tell me how did you react to it and what were your thoughts (without spoiling pls)?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1rib9qe/what_was_your_reaction_to_ending_of_dark_se2_ep5/"
    },
    {
        "id": "1rht569",
        "author": "mulder00",
        "title": "Netflix's Algorithm.",
        "content": "I've been on a Kdrama and Cdrama binge for the last 2 ish yrs or so and now that's all I see when I open Netflix.  I like those shows but I also want to watch other stuff.\n\n  I know Netflix has category codes for everything but is it really necessary to hide most content?  I don't have the same problem with Prime or when I had Disney+.\n\n  I feel myself being forced to watch something other than Kdramas or Cdramas so Netflix will once again show me Hollywood or British shows.\n\n  Is there anyway to get around this?  Or do I have to make sure I don't watch to much of 1 Country's content?",
        "upvotes": 10,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1rht569/netflixs_algorithm/"
    },
    {
        "id": "1rhmdys",
        "author": "Available_Branch4664",
        "title": "same movies",
        "content": "im probably wrong but is there something going on where movie plots or ideas are becoming way too similar? like on purpose? are Trap House and The Rip not the same movie? im sure to some degree this has always been true. every story is a classic retelling of old stories/fables/etc with the same structures I guess. am I wrong here, are we already there or are we heading there? thank you. ",
        "upvotes": 22,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1rhmdys/same_movies/"
    },
    {
        "id": "1ri6j7m",
        "author": "BusinessPresence1590",
        "title": "It’s What’s Inside Sequel Idea",
        "content": "Beatrice (Forbes’ soul) is on the trail of Nikki (Beatrice’s soul), so a brother after his sister, then finds a trail of body swapped people, just chaos.\n\n\n\nThe Swap Chart: (Where the story starts)\n\nNikki (Helen’s soul)\n\nThere was an issue with the two million dollars, Helen is a banker and Nikki (Beatrice) takes her body leaving her in Nikki’s body.\n\nHelen (Victor’s soul)\n\nVictor is a rookie police officer that got to close to Beatrice’s scheme so she body swapped with him leaving him in Helen’s body.\n\n\n\nVictor (Beatrice’s soul)\n\nOn the run again, being on the side of the law gives authority.  \n\n\nBeatrice (Forbes’ soul)\n\nThe one finding the trail of body swapped victims.\n\n  \nThrowing ideas around, too entertaining not to have a sequel!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ri6j7m/its_whats_inside_sequel_idea/"
    },
    {
        "id": "1ri55en",
        "author": "El_Dorado_Tx",
        "title": "13 Reasons why - Monty’s dad",
        "content": "So was Monty’s dad from 13RW a pedophile that molested Estela, based on comments Inde Naverre made in 2020 when interviewed by 17 Magazine. Inde played Estela, and she made comments that Monty had shielded her from their dad. And also s2 there is something Monty said that Stay from her. And also s3 when Monty’s dad visited Monty in jail he said something “You did this to a boy”. If Monty had SA a girl….would his reaction been different. \n\nAlso S4 Estela never mentioned her dad at all, just the call to her mom while she in the bathroom in the lockdown and sees Tyler. \n\nSo did her dad end up in jail ? Or he died? Or ran off with another woman? \n\nThese are my arguments that I can make the case that I consider Monty’s dad a pedophile that sexuality abused his daughter besides the physical abuse of Monty",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ri55en/13_reasons_why_montys_dad/"
    },
    {
        "id": "1rifowf",
        "author": "Eeeej7777",
        "title": "Anyone else find it unsettling how much the reporter from Season 3 of The Night Agent (Genesis Rodriguez) looks like Lady Gaga?",
        "content": "She was on the second season of Lioness Special Ops too. She's a solid actress, but after two seasons, two shows, and two entirely different characters, I can't unsee Lady Gaga when I see her. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1rifowf/anyone_else_find_it_unsettling_how_much_the/"
    },
    {
        "id": "1rhrexm",
        "author": "CodDefiant2710",
        "title": "ONE PIECE Into the Grand Line Fan Event Video Highlights | Netflix",
        "content": "Check out this video featuring highlights from the fan event held in L.A. for Netflix's hit TV series “ONE PIECE,” edited from footage shot by our teammate Anont.\n\n[https://cinemadailyus.com/pick-up/one-piece-into-the-grand-line-fan-event-highlights-netflix/](https://cinemadailyus.com/pick-up/one-piece-into-the-grand-line-fan-event-highlights-netflix/)",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rhrexm/one_piece_into_the_grand_line_fan_event_video/"
    },
    {
        "id": "1ri8hk3",
        "author": "thefikry",
        "title": "Netflix pixelated while Disney plus runs fine",
        "content": "Hi, i am in Egypt on a vdsl 30 mbps plan\n\nNetflix is pixelated and reads 3 mbps while Disney plus and other apps run fine at 4k.\n\nanyone got a solution?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ri8hk3/netflix_pixelated_while_disney_plus_runs_fine/"
    },
    {
        "id": "1rhydmq",
        "author": "Dear_Kick6613",
        "title": "Paranormal Movie Recommendations?",
        "content": "I am in need of some movie reccomendations specifically paranormal movies that consists of like a monster hunting families, vampires,witches etc your recommendations are much appreciated",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rhydmq/paranormal_movie_recommendations/"
    },
    {
        "id": "1rhgidh",
        "author": "Old_Preparation315",
        "title": "Good Horror Movies?",
        "content": "I recently watched Abigail on Netflix and really enjoyed it. Are there any other movies you've seen like it? What are your favorite horror movies and what did you like about them?",
        "upvotes": 13,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1rhgidh/good_horror_movies/"
    },
    {
        "id": "1rhjpjq",
        "author": "Top_Report_4895",
        "title": "America's Next Top Model ‘Crime Scene’ Photographer Was ‘Mortified’ Watching the Documentary",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rhjpjq/americas_next_top_model_crime_scene_photographer/"
    },
    {
        "id": "1rh9j4o",
        "author": "iminsecure143",
        "title": "The Recruit",
        "content": "I understand that this is probably old news at this point, but the cancelation of season 3 (which i only just found out after binging the 2 seasons) has me frustrated as fuck. One of the best shows netflix has produced and they just up and cancel it? It’s unbelievable what i’d give for another season, just so it can at least have a closed ending instead of ending it without a proper ending like it has now",
        "upvotes": 19,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1rh9j4o/the_recruit/"
    },
    {
        "id": "1ri09i8",
        "author": "calthartic",
        "title": "netflix age restricting show below my age limit?",
        "content": "not sure if this is the right place to post this, but i recently started watching a show on netflix, got to episode 16 (the episode id been specifically waiting for BY THE WAY), and then suddenly netflix started saying that it exceeded my age restrictions??\n\nspecifically the show is rated 12+ (although if i look elsewhere its listed as just PG) and my account limit is set to 13. why is it doing this please help",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ri09i8/netflix_age_restricting_show_below_my_age_limit/"
    },
    {
        "id": "1rhd31e",
        "author": "kanishkavohra",
        "title": "Suggest me best shows similar to Bridgerton",
        "content": "I have just ended up the marvelous season of Bridgerton. The show keeps you knots with every episode. Once, it's finished, you may be flooded with a mix of emotions, such as joy, sorrow, happiness, and more. So, please suggest me binge-worthy shows like Bridgerton.",
        "upvotes": 8,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1rhd31e/suggest_me_best_shows_similar_to_bridgerton/"
    },
    {
        "id": "1rhxeoo",
        "author": "LoLlmAlex",
        "title": "Will Dexter stay on Netflix after the 30th march?",
        "content": "I am asking because Netflix told me that Dexter will stay Till the 30. March, wil the Dexter directors pay the license so it will stay on Netflix? Because i am not completely done watching it",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1rhxeoo/will_dexter_stay_on_netflix_after_the_30th_march/"
    },
    {
        "id": "1rhr61u",
        "author": "_pinned",
        "title": "Can't start a live stream from the beginning.",
        "content": "If I miss an hour of a live stream (wrestling, boxing, whatever), I can't seem to start the show from the beginning. Is this normal, or could it just be the app that's installed on the TV? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1rhr61u/cant_start_a_live_stream_from_the_beginning/"
    },
    {
        "id": "1rhl82l",
        "author": "richb0199",
        "title": "Invalid proxy error",
        "content": "This just started happening on my TV (Roku) and now it's happening on my Android phone.\n\nI was watching a series and suddenly I got an error saying it looks like I'm using a proxy. And I can't move past it. The catch is that I'm not using a proxy. Now I'm getting the error on my phone.\n\nIronically, I got around it by running a proxy. I don't have a proxy installed on my TV.\n\nAnyone else run into this bug? How did you get it to stop?\n\nEdit: I went to my other house and Netflix works fine on the other network. For some reason Netflix doesn't like the network at one house. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1rhl82l/invalid_proxy_error/"
    }
]