[
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 24,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1lz2vux",
        "author": "PulIthEld",
        "title": "Stop showing me games, I have never interacted with one.",
        "content": "Every time I open Netflix now its some stupid game.  Why?  That's not what I go to Netflix for.  I dont want their ads blaring every time I open Netflix.",
        "upvotes": 137,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1lz2vux/stop_showing_me_games_i_have_never_interacted/"
    },
    {
        "id": "1lz6nrx",
        "author": "Timely-Hovercraft-76",
        "title": "I actually enjoyed the waterfront.",
        "content": "I actually enjoyed waterfront quite a bit. I made a post about a month ago or so asking how it is and I got some mixed inputs. It took like 2 episodes to get into it but after that, I quite enjoyed it. I liked the setting, the overhead shots of the area, the action was pretty good, son was a realistic character imo, I liked seeing Holt McCallany back in action and the plot was basic in ways but easy to follow and fun to watch. It’s not ozark but it’s only 1 season compared to like 5. I would give it a 7-8 out of 10. Topher grace’s character was pretty fun as well, he’s a good actor. All in all, a pretty fun watch. ",
        "upvotes": 10,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1lz6nrx/i_actually_enjoyed_the_waterfront/"
    },
    {
        "id": "1lz3wrl",
        "author": "itsnobigthing",
        "title": "14 hour car journey; need a series that’s so addictive I’ll be glad I’m not there yet",
        "content": "Ideally seeking one of those shows where it would take a physical intervention to stop you watching the next episode. Like Severance, or early Lost, or similar.\n\nBut I’m down for pretty much anything except horror, or things about gangs of men doing crime). Just something compelling and bingeable that I haven’t seen! 🙏🏻\n\nNo subtitles pls as I get car sick if i read them\n\n\n\n",
        "upvotes": 10,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1lz3wrl/14_hour_car_journey_need_a_series_thats_so/"
    },
    {
        "id": "1lyb0yq",
        "author": "Altruistic_Lad",
        "title": "Dear Netflix: Registering Is Now Worse Than Tedious",
        "content": "Netflix apparently has never heard that folks can have more than one residence. Does it learn that you visit the same places over and over. Oh no. You have to jump through all the registration and security hoops OVER AND OVER despite the fact that you've paid for unlimited use. Wake up, Netflix. You're not irreplaceable. ",
        "upvotes": 427,
        "comments": 86,
        "media": null,
        "permalink": "/r/netflix/comments/1lyb0yq/dear_netflix_registering_is_now_worse_than_tedious/"
    },
    {
        "id": "1lysljv",
        "author": "Thin_Smile2722",
        "title": "Need recommendations to watch",
        "content": "I am currently having free time with no pending work or anything and thinking to start a new series/movie. \n\nPs: recommend series other than squid games ",
        "upvotes": 11,
        "comments": 57,
        "media": null,
        "permalink": "/r/netflix/comments/1lysljv/need_recommendations_to_watch/"
    },
    {
        "id": "1lyznkg",
        "author": "doorguy8888",
        "title": "Carry-On review",
        "content": "Hello! I just watched the Carry-On movie. I just got netflix again and it was one of the first movies that popped. I was interested because I'll be flying for the first time in a couple of months, hahaha. Crazy right? Watch a movie about airport devastation before my first flight ever 😂.\n\nI saw Jason Bateman's face, and I still can't picture him as a serious role actor. I think of him more from movies like \"Office Christmas Party\" or \"Identity Thief\". Goofy movies. But he did an amazing job acting and I was thoroughly impressed.\n\nI liked the suspense that the movie carried and all the twists it presented.\n\nHave you watched Carry-On? How did you like it?",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1lyznkg/carryon_review/"
    },
    {
        "id": "1lz8rok",
        "author": "Chromium4",
        "title": "Almost Cops",
        "content": "Almost Cops or Bad Boa's is Netflix's latest Norwegian import in a seemingly never ending series of them. Some have been good like the sci-fi disaster films like The Wave but most have been not very watch worthy which is the case with Almost Cops. The humor is lacking and the script/plot is almost not there. Netflix, if you're going to flood the site with Norweigian-language films then at least give us some good ones. No matter your native tongue a bad movie is a bad movie.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lz8rok/almost_cops/"
    },
    {
        "id": "1lz8or5",
        "author": "SlateAlmond90",
        "title": "Is there a way to set a profile on an account to only show movies and shows that are in English?",
        "content": "My mom doesn't like watching movies and shows that she has to read (me and my dad keep telling her she missing out on some great ones). Is there a way to set her profile to only show movies and shows that are primarily in English (I say primarily because she will watch ones that have some subtitles, so long as they're not all full of subtitles she has to be constantly reading).",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lz8or5/is_there_a_way_to_set_a_profile_on_an_account_to/"
    },
    {
        "id": "1lyi1um",
        "author": "Beastmaster122810",
        "title": "It has no right to be as good as it is",
        "content": "",
        "upvotes": 57,
        "comments": 12,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/p0n96mk91kcf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1lyi1um/it_has_no_right_to_be_as_good_as_it_is/"
    },
    {
        "id": "1lz7she",
        "author": "BigRecommendation709",
        "title": "Ozark?",
        "content": "What shows are similar to ozark? I really loved the plot of ozark and the characters. Since then I’ve watched the show three times. lol. Need something else.  ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lz7she/ozark/"
    },
    {
        "id": "1lz6pd9",
        "author": "alienboy222",
        "title": "How to add profile?",
        "content": "My parents are allowing me to use their account, and I wanted to set up my own profile. However on the profile screen, I don’t see an Add Profile selection. This is on a Roku if that matters. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lz6pd9/how_to_add_profile/"
    },
    {
        "id": "1lz64p0",
        "author": "ArcherIll6233",
        "title": "Adding members",
        "content": "So I'm from the UK but set up my Netflix account while living in Germany. I moved back to the UK a while ago but haven't changed anything since the billing goes through my PayPal. My parents have been using my account for years but have finally been locked out so I said I'd add them as members to my account. I tried this but we found that they can't join as they're not in Germany (where I set up the account) and they receive the error \"you must be in the same country to activate. Extra member slots need to be activated in the same country where the person who invited you started their membership\"\n\nI saw on the Netflix website that you could cancel your membership and restart your membership again in the next billing period to change your country. Just wanted to confirm whether this would work to get my parents added to my account and whether the UK would be the country where I (re)started my membership.\n\nAny help would be appreciated",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lz64p0/adding_members/"
    },
    {
        "id": "1lz5l57",
        "author": "Even-Jury-4552",
        "title": "Compression and color",
        "content": "I was watching bullet train on netflix and the compression was so bad I decided to switch the streaming platform and I noticed that : \n\n[Netflix](https://preview.redd.it/e9fye7rqupcf1.png?width=3452&amp;format=png&amp;auto=webp&amp;s=0d12dfd83bcdfdf5491f8bd4c53933aa68628d66)\n\n[Prime](https://preview.redd.it/ddml97rqupcf1.png?width=3456&amp;format=png&amp;auto=webp&amp;s=18d5cd8736e8ce6917edd0f30a1fe4e9a323003b)\n\n1- The compression is less in Prime \n\n2- Why is the color grading is so different from Prime ? \n\n  \nSettings are set for the highest quality on both platform, why is netflix doing that ? Or is it a completely different file ?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lz5l57/compression_and_color/"
    },
    {
        "id": "1lz03du",
        "author": "PAPAmagdaline",
        "title": "show similar to the survivors?",
        "content": "Okay just finished it, does anyone else know show with similar vibe ? Small island, thriller, secrets that’s been hushed hushed. the scenery was beautiful.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lz03du/show_similar_to_the_survivors/"
    },
    {
        "id": "1lz5eax",
        "author": "Sufficient-Pickle632",
        "title": "Is there a way to filter by Country of Origin?",
        "content": "Are there any fantastic ways to sift through films that were specifically produced in South Korea, India, or the United States? I'm eager to discover some gems from these vibrant film industries!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lz5eax/is_there_a_way_to_filter_by_country_of_origin/"
    },
    {
        "id": "1lyymq1",
        "author": "beastdodoo",
        "title": "Cannot find White collar",
        "content": "Found this series yesterday and its said it is on netflix so i made an account bougt membership but i cannot find anywhere this show, im from Romania if its matter",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lyymq1/cannot_find_white_collar/"
    },
    {
        "id": "1lyvc9p",
        "author": "Wonderful-Wafer-5874",
        "title": "Subtitles for English dialogue on foreign shows",
        "content": "So I'm watching squid game in the original Korean language of course but when it comes to the vips who are speaking English there are no subtitles which is annoying because i need subs for everything! Is there an option to add this on? ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lyvc9p/subtitles_for_english_dialogue_on_foreign_shows/"
    },
    {
        "id": "1ly50vd",
        "author": "STARRIMS",
        "title": "LUPIN is my most favorite series ever.",
        "content": "I have tried so many series in Netflix, and I don't even last one episode; from Money Heist to House of Cards to Dark. Whereas I was so Intrigued to Lupin in 2023, I login Netflix just to Re-Watch LUPIN again and again.\n\nI even stared reading Arsene Lupin and love my time in it. Eagerly waiting for Lupin part 4.\n\n  \nI am just asking who explore Netflix a lot, is there anything alike LUPIN?",
        "upvotes": 59,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1ly50vd/lupin_is_my_most_favorite_series_ever/"
    },
    {
        "id": "1lz5hsl",
        "author": "Max_Laval",
        "title": "This is unacceptable quality [rant]",
        "content": "https://preview.redd.it/jqaneyyqopcf1.jpg?width=3440&amp;format=pjpg&amp;auto=webp&amp;s=8b117e0d1771c197f2e4904cc842a6927d263ea8\n\n[imgur - for better quality (doesn't get much better than this)](https://imgur.com/a/SVHRCIh)\n\nI've been using Netflix for over eight years now, and ever since I started using it, it's only gotten worse.  \nBack then, I had 15mbps and got WAYY better quality than this, now I'm on over **1Gbps**, and the quality looks like crap.\n\nBrowser: Firefox  \nDisplay: **3440x1440 (UWQHD)**  \nGPU: *RTX 2070s*  \nRAM: *16GiB*  \nCPU: *Ryzen 5 5600x*  \nOS: *Win 10*  \nBirtate extensions didn't seem to do anything.\n\nChrome isn't as bad in terms of pixelation, it looks pretty low-res too, but as if someone put a smoothing filter over it - still super low-res tho.  \nAdditionally, Chrome exhibited severe fringing and artifacts on the edges of bright lights, particularly with saturated red or blue colors.\n\nSome people online seemed to have suggested using a user-agent changer, but that didn't seem to do much. Captain Henry Morgan is in higher resolution.\n\nIf anyone has advice on how to improve this, please tell me.\n\nhttps://preview.redd.it/thz5ne9avpcf1.png?width=1318&amp;format=png&amp;auto=webp&amp;s=718a5bfdbb0f8645ad9e632d664144ba4a77b4ca\n\n",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1lz5hsl/this_is_unacceptable_quality_rant/"
    },
    {
        "id": "1lyz9sf",
        "author": "IAmTheQuestionHere",
        "title": "Shows similar to You. The psycho aspect doesn't matter, it's the vibe of young people living in the city with work, relationships etc",
        "content": "Shows similar to You. The psycho aspect doesn't matter, it's the vibe of young people living in the city with work, relationships etc\n\nShows similar to You. The psycho aspect doesn't matter, it's the vibe of young people living in the city with work, relationships etc",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lyz9sf/shows_similar_to_you_the_psycho_aspect_doesnt/"
    },
    {
        "id": "1ly3h6v",
        "author": "BackgroundEscape9250",
        "title": "Wtf should I watch",
        "content": "I have been trying to find a good series on Netflix (located in EU) but after the first episode I can’t focus because it’s so boring. \n\nWhat i like to watch: \n\n- Brooklyn 99\n- Ghosts  \n- Tires \n- The residence \n- Arrested development \n- A shop for killers \n- Sirens \n\nSomething like the above, please. Yesterday I ate my whole burrito just surfing Netflix trying to find something. My food gets cold. Pls help. ",
        "upvotes": 47,
        "comments": 146,
        "media": null,
        "permalink": "/r/netflix/comments/1ly3h6v/wtf_should_i_watch/"
    },
    {
        "id": "1lz1z1m",
        "author": "nightmaaareinn",
        "title": "What should we watch?",
        "content": "We always end up watching Seinfeld because it's all we can agree on. Help us!\n\nHim: History, laughs, sports\n\nHer: Drama, true crime, old Hollywood\n\nThanks!\n",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1lz1z1m/what_should_we_watch/"
    },
    {
        "id": "1lyujg2",
        "author": "Quirky_Appearance539",
        "title": "Netflix account hacked! Need help desperately!",
        "content": "I need some help. My Netflix account is hacked &amp; I have lost access to everything. My payment goes through a UPI mandate which I don't have anymore but my bank account is linked so debits will likely happen. I've been logged out of my devices. Please can you help me regarding this? I want to contact them &amp; get my details changed so please can there anything be done?\n\nEdit: I called customer care &amp; they checked my details &amp; sorted out the issue immediately! Thanks everybody here for helping me! 🫡",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1lyujg2/netflix_account_hacked_need_help_desperately/"
    },
    {
        "id": "1lypqht",
        "author": "ThomasOGC",
        "title": "Wake Up Dead Man to Open BFI London Film Festival | CGO",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lypqht/wake_up_dead_man_to_open_bfi_london_film_festival/"
    },
    {
        "id": "1lz5g33",
        "author": "BrixtonButterfly",
        "title": "Too Much on Netflix: uncomfortable",
        "content": "Feeling uncomfortable watching the cringiest and oddest characters in this show? You’re not alone. While not a fairytale, give credit where it’s due. Messy and uncomfortable to watch is Lena Dunham’s genre. Feel-good was never her forte. But real, tragic, oversharing, honest? It’s more truth than we want to face. It’s also her view on the world. Gilmore Girls and Girls on HBO don’t have many differences if you think about it. Caucasian female perspective, odd humoring humans, a closed view of life in certain parts and the gentle but thorough pain behind people’s eyes. Special thanks to Will Sharpe’s character Felix and his portrayal. A grounding force throughout this whole thing and an actor who steals any scene while giving utmost on screen grace to his costars. ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lz5g33/too_much_on_netflix_uncomfortable/"
    },
    {
        "id": "1lyp7cu",
        "author": "International_Bed582",
        "title": "How do I get profile icons that Netflix has deleted?",
        "content": "I've followed all of the old tutorials that pop up on google when I search this question, but it seems they're all outdated and have been patched. I really want the Ariana Grande one that is no longer available. My friend has it and it makes me mad lol. Is there any working way of doing this?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lyp7cu/how_do_i_get_profile_icons_that_netflix_has/"
    },
    {
        "id": "1lyp3qn",
        "author": "jamiebucknole",
        "title": "Fast forward question",
        "content": "I watch WWE on my sky a box on the Netflix app and when I used to fast forward I could see what’s happening in a small box but recently I can’t see when fast forwarding and wanted to know is there a way to get it back? Any help much appreciated ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lyp3qn/fast_forward_question/"
    },
    {
        "id": "1lyp2sp",
        "author": "sparklesandroses",
        "title": "Can you use Netflix on the same device, at different locations?",
        "content": "I watch Netflix on my laptop, typically at home, if I take my laptop to another address regularly, will I still be able to use it? It’s just so that I can watch it whilst I’m working at my unit and at home.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lyp2sp/can_you_use_netflix_on_the_same_device_at/"
    },
    {
        "id": "1lysy1r",
        "author": "Ill-Particular-9138",
        "title": "Sequel Kpop Demon Hunters",
        "content": "Don't keep your fans waiting any longer and order the sequel to your hit as soon as possible. After all, you and Sony Pictures Animation see how crazy the world is about your hit. Please order this sequel and let the creators of K-Pop Demon Hunters do their thing.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lysy1r/sequel_kpop_demon_hunters/"
    },
    {
        "id": "1lyvgdm",
        "author": "desperate_shrimp",
        "title": "cannot log into netflix on multiple devices",
        "content": "me and my bf are from germany, currently in denmark, and suddenly none of our devices can log into our netflix account, nor request a login code. he is still logged in with his phone, but when i try with my phone, my ipad or my laptop it won't let me in. we double checked the password, it's correct - i tried logging in on the browser on my phone via mobile data and it worked there, but then i went over to the app as you can't watch netflix on the browser on mobile devices, and the app just refuses to log me in. i cleared all caches, reinstalled the app for the phone and tablet, restarted all devices, used my mobile hotspot from my phone for my laptop and tablet, we waited a day to see if this problem would resolve itself - nothing works. only thing left we have not tried is resetting the password on the one device we're still logged in with, but we're a little wary we will be kicked out of the account on his phone as well. very frustrating as we only subscribed to watch during our vacation. does anyone have any more ideas? ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1lyvgdm/cannot_log_into_netflix_on_multiple_devices/"
    }
]