[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1md1jnt",
        "author": "HolidayScallion8502",
        "title": "lavori notturni",
        "content": "ma vi sembra normale che in via berthollet zona San salvario facciano i lavori con martello pneumatico alle 1.30 di notte? \nAnticipo che faccio cameriere di sala quindi non è una lamentela legata al mio orario lavorativo, ma proprio di disturbo del sonno.\nchissene frega se durante la giornata viene bloccata una via porcamadonna, lasciate la gente dormire e imparate a muovervi senza macchina figli di troia.",
        "upvotes": 19,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1md1jnt/lavori_notturni/"
    },
    {
        "id": "1md00xy",
        "author": "No_Bug_3501",
        "title": "Techno in Turin",
        "content": "heyoooooo\n\nI came across this post 'cause I’ll be in Turin for a month in October, and I was checking out all the events on Resident Advisor — between Azimut Club, Q35 Warehouse, and Club To Club in November (which I already knew about)!\nHonestly, I was blown away by how many big-name artists they bring in every weekend. I had no idea Turin had such a solid international club scene! :)\nEven the ticket prices seem super low to me.\nIs the city really that cheap overall? Anyone got tips on how to live there for a month without breaking the bank?\n\n",
        "upvotes": 21,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/k5m8q3pupyff1.jpeg?auto=webp&amp;s=00948c1609f906ed42e9a98185e8071a2ffeecc1"
        },
        "permalink": "/r/torino/comments/1md00xy/techno_in_turin/"
    },
    {
        "id": "1md9c3d",
        "author": "_pigreco_",
        "title": "negozi streetwear torino e provincia",
        "content": "intendo negozi dove poter trovare della roba bella e delle chicche, non foot looker e aw lab. e risparmiate atipici, che oltre al fatto che sia stato fondato dal tipo dei duplici l’ho sempre trovato uno scam. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1md9c3d/negozi_streetwear_torino_e_provincia/"
    },
    {
        "id": "1md79o6",
        "author": "Flukierx9",
        "title": "Dubbio su punteggio tolc per scienze biologiche",
        "content": "Ciao a tutti, ho fatto 32,25 punti al tolc b, vorrei fare richiesta per il corso di scienze biologiche di torino.\nQualcuno sa se è un punteggio con cui ci sono buone probabilità di entrare? È meglio riprovare il mese prossimo per aumentare il punteggio?\nGrazie in anticipo",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1md79o6/dubbio_su_punteggio_tolc_per_scienze_biologiche/"
    },
    {
        "id": "1md4f1x",
        "author": "irmakinon",
        "title": "Parcheggio",
        "content": "Salve, non sarò in Italia per due mesi. Potreste indicarmi un parcheggio economico dove posso lasciare la mia macchina",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1md4f1x/parcheggio/"
    },
    {
        "id": "1mcd0zs",
        "author": "MoSeMagna",
        "title": "A Torino c’è chi fa solo fiordilatte. Ma c’è più di un modo per farlo bene.",
        "content": "",
        "upvotes": 11,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/nnf0x6joptff1.jpeg?auto=webp&amp;s=12a417944c1b66260268792e54649a86a2768762"
        },
        "permalink": "/r/torino/comments/1mcd0zs/a_torino_cè_chi_fa_solo_fiordilatte_ma_cè_più_di/"
    },
    {
        "id": "1mce4i5",
        "author": "glorious-ahole",
        "title": "How is Mirafiori Sud as an area",
        "content": "I am shifting soon to Mirafiori Sud, specifically Via plava and wanted to know how the area in general is..like is it safe? The apartment is good but the only problem is that it's a bit far from downtown. However I'm fine with it because its very close to the place I work",
        "upvotes": 5,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1mce4i5/how_is_mirafiori_sud_as_an_area/"
    },
    {
        "id": "1mcglei",
        "author": "External_Cow_2392",
        "title": "Cerco ragazz*(non discrimino nessuno) per fare urbex",
        "content": "Un gruppo per fare urbex e magari registrare anche chi ci sta? \nPremessa ho 20 anni e soni maschio",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1mcglei/cerco_ragazznon_discrimino_nessuno_per_fare_urbex/"
    },
    {
        "id": "1mc6w8v",
        "author": "NoAttention795",
        "title": "Orchestra a Torino?",
        "content": "Ciao a tutti! Vado a Torino a febbraio per l'Erasmus e volevo sapere se c'è qualche orchestra in città con ingresso libero. Sono una violista :)",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mc6w8v/orchestra_a_torino/"
    },
    {
        "id": "1mc8nl6",
        "author": "Charming_Mind4890",
        "title": "Zona rebaudengo",
        "content": "Purtroppo per cause di forza maggiore dovrò trasferirmi da zona san paolo a rebaudengo, mannaggia mi divertivo troppo al gabrio. Ho 19 anni e mi piacerebbe sapere com'è la zona.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1mc8nl6/zona_rebaudengo/"
    },
    {
        "id": "1mc8hsq",
        "author": "jk-9551",
        "title": "Informazioni mirafiori sud",
        "content": "Salve a tutti, mi sono recentemente trasferito a Torino in zona lingotto vicino al politecnico.\nHo trovato una palestra a sud del grattacielo regione Piemonte. Siccome si trova vicino al quartiere mirafiori sud volevo sapere se la zona sarebbe abbastanza sicura di sera (gli orari che frequenterei sono appunto serali)",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mc8hsq/informazioni_mirafiori_sud/"
    },
    {
        "id": "1mbsew7",
        "author": "blunathan",
        "title": "la mia ragazza insegna italiano agli stranieri. c'è un qualche posto o evento dove lei possa portare il suo studente tedesco a parlare italiano?",
        "content": "È  un tedesco di 55 anni che non parla tanto italiano È si deve allenare. sarebbe fantastico un posto in cui potersii allenare con frasi semplici o banalmente qualcuno con cui chiacchierare senza essere mandato a quel paese. magari una qualche attivita.eventi? party? Avete delle idee? lui sarà a Torino dal 31 luglio all'8 agosto\ngrazie mille!",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1mbsew7/la_mia_ragazza_insegna_italiano_agli_stranieri_cè/"
    },
    {
        "id": "1mbp3ip",
        "author": "ookeyboomer",
        "title": "chi vuole venire allo zoom? costa troppo ma lo prendiamo scontato insieme",
        "content": "ciao ragazzi, i biglietti dello zoom costerebbero : \n26€ ingresso\n7€ piscina\n3€ oasi delle farfalle\n\nper un totale di 36€ a testa\n peró se acquisitamo 5 biglietti, tutto questo sarebbe a 19€ a testa (praticamente ti regalano la piscina, e l'ingresso costerebbe solo 16€) \n\na me servono 2 biglietti \nriesco a trovare tre persone che mi danno 47€ per avere tre ingressi all inclusive? \n(19x3, ingresso, piscina e farfalle)\n",
        "upvotes": 5,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/742n7kjmxnff1.jpeg?auto=webp&amp;s=b21d374c205c6ee7184d4053683cf397014ff473"
        },
        "permalink": "/r/torino/comments/1mbp3ip/chi_vuole_venire_allo_zoom_costa_troppo_ma_lo/"
    },
    {
        "id": "1mbhwae",
        "author": "SidYato",
        "title": "Zone dove comprare casa",
        "content": "Ho 28 anni e sto cercando di comprare casa a Torino perché dopo anni di case condivise con vari coinquilini ho la necessità di andare a vivere da solo. \nHo cercato un po’ in Parella, Campidoglio e Pozzo Strada, ma trovare un buon compromesso tra prezzo e immobile, considerando che ho un budget massimo di 130/140k euro, è davvero complicato.\n\nStavo quindi pensando allargare la mia ricerca e guardare un po’ più in periferia visto che sono comunque automunito, ma quali sono le zone migliori in cui cercare? Vorrei evitare di comprare in una brutta zona dove non posso manco farmi un giro a piedi",
        "upvotes": 9,
        "comments": 20,
        "media": null,
        "permalink": "/r/torino/comments/1mbhwae/zone_dove_comprare_casa/"
    },
    {
        "id": "1mbx47a",
        "author": "dkroods",
        "title": "Ora compatibile con oltre 5.000 dispositivi in più!",
        "content": "Ciao a tutti!  \nSiamo felici di annunciare un nuovo aggiornamento per *Take It Easy Torino*, l'app pensata per rendere la vita in città un po’ più semplice.\n\n**🆕 Novità principali:**\n- ✅ Supporto esteso: ora compatibile con **oltre 5.000 dispositivi in più**!\n- ⚡ App più **veloce**, **fluida** e **reattiva**.\n- 📊 Dati aggiornati e ottimizzazioni interne per offrirvi un’esperienza ancora migliore.\n\nGrazie a tutti per il supporto e i feedback! Se non l’avete ancora provata o volete aggiornare, è il momento giusto.  \nE come sempre, fateci sapere cosa ne pensate – ogni consiglio è prezioso. 🙌\n\n**📲 Download the app and take it easy!**\n\n➡️ [Scarica per Android](https://davomelkumyan40.github.io/TakeItEasy.github.io)  ",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EpYyQODxl6eljubkP760TGO7x_pny1FRo7fS3IDdcfI.jpeg?auto=webp&amp;s=d885862ca52d637caa091ac0189af5f9076f03ad"
        },
        "permalink": "/r/torino/comments/1mbx47a/ora_compatibile_con_oltre_5000_dispositivi_in_più/"
    },
    {
        "id": "1mblgwu",
        "author": "barelyheard",
        "title": "Cheapest Roll of film?",
        "content": "Hi guys, I always get my films when i’m in my country because sometimes the prices seem way overprices here - Marvin sells the most basic Kodak Colorplus for 22 euros 😳\n\nBut i’m in need of some rolls soon for a trip and wanted to know if someone knows a place that sells rolls for less. Something around 10-12 euros for Colorplus so I can get multiple. \n( Already tried RTP and reflessi in Crocetta :/) ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1mblgwu/cheapest_roll_of_film/"
    },
    {
        "id": "1mb8kzm",
        "author": "Head-Share500",
        "title": "Come possono parcheggiare le macchine straniere?",
        "content": "Ciao a tutti, qualche giorno fa ho parcheggiato la mia auto in via Nizza e ho usato un’applicazione per parcheggiare. Mentre scendevo dall’auto ho visto una famiglia composta da madre, padre e due ragazzine di circa 10-12 anni, davanti alla colonnina per pagare il parcheggio che cercavano di capire come procedere. Mi sono avvicinata per aiutarli, erano tedeschi ed erano qui in vacanza. Quando è arrivato il momento di inserire la targa, il,parcometro si bloccava perché era una targa straniera. Ho provato un paio di volte ma non sono riuscita ad arrivare alla fine. Mi sono chiesta se era un problema di quella colonnina oppure se tutte le colonnine rifiutano le targhe straniere, perché se così fosse come fanno gli stranieri a pagare il parcheggio a Torino?",
        "upvotes": 16,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1mb8kzm/come_possono_parcheggiare_le_macchine_straniere/"
    },
    {
        "id": "1mao0hj",
        "author": "Pale-Diamond-6384",
        "title": "Affittare in Barriera",
        "content": "Ciao amici!\n\nSto valutando l'acquisto di un immobile da affittare e ho trovato una casa interessante e cheap in questa zona. So che Barriera di Milano e abbastanza spicy (e quindi ancora relativamente economica), ma non vivendo più a Torino da qualche anno non so bene com'è cambiata la situazione al di là di Corso Novara. \n\nHo letto che c'è in progetto una grande riqualificazione di Corso Palermo che mi fa pensare ad una possibile gentrificazione stile San Salvario 20 anni fa e conseguente aumento dei prezzi degli immobili.\n\nÈ fattibile secondo voi affittare in questa zona per 700/800€ (trilocale di 75m2 e due stanze)? Rischio accoltellamento e sicurezza notturna? Pareri onesti solo senza essere eccessivamente drammatici!\n\nThanks!!",
        "upvotes": 5,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ey6keckeifff1.jpeg?auto=webp&amp;s=427688c33ae1ed1e2f46a9961a64b6cd04c57dc5"
        },
        "permalink": "/r/torino/comments/1mao0hj/affittare_in_barriera/"
    },
    {
        "id": "1mas0h0",
        "author": "forsequeneau",
        "title": "Negozi gameboy",
        "content": "Ciao torinesi!\n\nVorrei fare un regalo a un amico e non ho tempo per aspettare spedizioni online.\n\nEsiste a Torino un negozio affidabile che venda gameboy buoni/restaurati ecc?\n\nPremetto che io non me ne intendo per niente del mondo console/videogiochi, quindi qualsiasi consiglio è ben accetto.\n\nGrazie!",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1mas0h0/negozi_gameboy/"
    },
    {
        "id": "1maot9i",
        "author": "3dgarAllanHo3_",
        "title": "Coffee shops",
        "content": "Ciao! Sono tornata in Italia da poco dopo anni all'estero, e mi chiedevo se ci fossero dei coffee shop a Torino che facciano bevande come iced coffee, matcha latte e minchiate varie, che sotto sotto mi mancano un po'! Magari con un po' di spazio per leggere o lavorare! No Starbucks  :)) grazie!\n\nENG version:\nI just moved back to Italy after years abroad, and I was wondering wether there's a good coffee place that does iced coffee or matcha lattes and those sorts of things! I love our espresso and shakerato, but sometimes I find myself craving a overly sweet iced matcha ahah. Please don't recommend Starbucks lol",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1maot9i/coffee_shops/"
    },
    {
        "id": "1mav5cs",
        "author": "livinglegend2003",
        "title": "cercasi tekno compagnə",
        "content": "ciaoo a settembre mi trasferisco a torino e mi piacerebbe trovare persone x danzettare in festa &lt;3 ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1mav5cs/cercasi_tekno_compagnə/"
    },
    {
        "id": "1mammbt",
        "author": "minidonnie",
        "title": "Trovare fotografo che cerca un assistente",
        "content": "vorrei iniziare la carriera da fotografo e per imparare vorrei affiancarne uno già stabilito, ciò che mi interessa è la fotografia editoriale di moda però non mi dispiacerebbe fare esperienza nelle cerimonie ed in tutti gli altri ambiti della fotografia, però non so come trovare un fotografo a cui serva un assistente o second shooter\n\nse qualcuno ha consigli o conosce qualcuno che possa aver bisogno di un assistente ne sarei grato e se c'è qualche fotografo di Torino che vede questo post in dm mando il mio portfolio di scatti fatti fin'ora ^^",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mammbt/trovare_fotografo_che_cerca_un_assistente/"
    },
    {
        "id": "1maj2zw",
        "author": "[deleted]",
        "title": "Incroci torino",
        "content": "Ma a torino, siccome i cartelli agli incroci che ti segnalano se puoi svoltare o meno, sono in prossimità dell incrocio spesso, a volte attaccati al semaforo, bisogna andare ai 20 allora per vedere bene prima il Tutto.. Altrimenti rimani veramente non sai fino all ultimo se potrai svoltare o no.. Bisogna andare come lumache e nell l'avvicinarsi all incorcio vedere se c'è il cartello e cosi uno si può spostare di corsia anche... ",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1maj2zw/incroci_torino/"
    },
    {
        "id": "1mafs6p",
        "author": "Independent_Dingo904",
        "title": "Acquisto alloggio a Torino",
        "content": "Buongiorno a tutti,\na breve le mie due figlie si trasferiranno a Torino per studio e anche io mi trovo allo prese con la ricerca di una sistemazione abitativa.\nAvendo altri due loro amici con la stessa necessità  stanno cercando una casa in affitto ma, viste le cifre richieste, stiamo valutando l'acquisto di un appartamento da destinare poi all'affitto, una volta che avranno ultimato gli studi,\nche frequenteranno a  Palazzo Nuovo e al Campus Einaudi.In zona ho trovato davvero poco in vendita e a prezzi elevati Valuterei eventualmente di allontanarmi, rimanendo in zone ben collegate e, per quanto possibile, soprattutto vivibili in termini di sicurezza.Quali consigli potete darmi? Grazie in anticipo ",
        "upvotes": 5,
        "comments": 38,
        "media": null,
        "permalink": "/r/torino/comments/1mafs6p/acquisto_alloggio_a_torino/"
    },
    {
        "id": "1m9x1g0",
        "author": "spacecraft628",
        "title": "Arriva la più grande sala giochi anni ‘80 d’Italia!",
        "content": "https://preview.redd.it/1h0py452s8ff1.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=f677be94d7de3200389eaee3a7cfbac90d877f61\n\nA settembre, a Grugliasco (TO), ci sarà la più grande sala giochi anni '80: grazie alla partnership con Arcade Story si troveranno un centinaio di cabinati originali, console vintage, flipper, air hockey, calciobalilla e per esagerare anche una mostra di giocattoli e Lego anni ’80.\n\nSi paga l'ingresso, ma il gioco è completamente libero. Domani finisce la promozione dei biglietti.\n\nNel parco fuori ci sarà anche un mercatino a tema anni ’80, con musica, cosplay, collezionisti e intrattenimento.\n\nSuper consigliato ad appassionati di retrogaming e anni '80 in generale!",
        "upvotes": 49,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1m9x1g0/arriva_la_più_grande_sala_giochi_anni_80_ditalia/"
    },
    {
        "id": "1m9t4nc",
        "author": "melkijades",
        "title": "Mi hanno derubato in palestra Orange/I was robbed in the Orange gym (Via Nizza)",
        "content": "Ciao! I’m a foreigner temporarily living and working in Torino since 2024. About 6 months ago, I joined the Orange Nizza gym. I’ve always used the same corner of the locker room, where I usually lock my stuff.\n\nLast night, around 22:45, I went to the gym for a short workout. When I returned to the lockers on the second floor, my bag was gone. I searched nearby and checked other lockers, but it was not there. The bag contained my clothes, house keys, and wallet. Inside the wallet were my ID, driver’s license, and credit cards. All gone. The keys of my house as well (tonight I slept in a hotel, and this was almost impossible to get without any documents on me).\n\nI immediately informed the young man at the reception, but he showed no concern. He told me, *“Come back tomorrow morning.... If it’s not there, then you call the police.”* He also said, *“Maybe someone kicked it by accident. Check around the gym. Wait for the cleaning lady in the morning to see if she finds it...”* He was clearly watching the clock, more focused on closing the gym than helping me.\n\nI asked about the security cameras (the gym has many inside and outside!) but he said he couldn’t check them without a police request and insisted I return the next day. I was speechless!\n\nAnd here is the 2nd part:\n\nI immediately blocked my credit cards and went to the nearest police  (Carabinieri office). When I arrived, the officer told me I’d have to wait 3–4 hours. Just then, I got a notification from my bank app that someone was trying to use my card at a specific store. I found the store on Google Maps and urgently showed it to the officer, saying, *“They’re trying to steal my money right now....can we please go there quickly?”*\n\nHe simply pointed to the waiting room and repeated: *“You’ll have to wait 3–4 hours.”*\n\nI was in disbelief. I had always thought that the Carabinieri were the “serious” police who deal with crime. LOL. But in this case, the officer showed no urgency or interest.\n\nAfter a few hours, I finally gave my statement and received a report in paper and that was it.\n\nNo follow-up. Nothing.\n\nI’ll replace my credit cards, and I don’t care about the clothes. But I’m deeply worried about my documents, some of them are really sensitive... for example my driver’s license, which was issued in the country where I previously studied. Replacing it would take me a lot of time and a lot of money, and I need to drive in the meantime!\n\nDoes anybody have advice on what to do in this situation?",
        "upvotes": 56,
        "comments": 26,
        "media": null,
        "permalink": "/r/torino/comments/1m9t4nc/mi_hanno_derubato_in_palestra_orangei_was_robbed/"
    },
    {
        "id": "1maijsp",
        "author": "adamtheapteryx",
        "title": "Ebike hire in Torino",
        "content": "Ciao r/torino! Scusate se il post è in inglese ma il mio italiano non è ancora abbastanza buono...\n\nCan anyone point me to a shop that hires ebikes? I'm in Torino with my wife and we'd like to explore Collina Torinese...\n\nGrazie!",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1maijsp/ebike_hire_in_torino/"
    },
    {
        "id": "1m9uhk9",
        "author": "Dqrank",
        "title": "Rave oggi? (26/07)| Rave today",
        "content": "\nQualche raccomandazioni?\n\nAny recommendations? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1m9uhk9/rave_oggi_2607_rave_today/"
    },
    {
        "id": "1m9rdn6",
        "author": "maronne93",
        "title": "Norbertus Kardinal",
        "content": "Qualcuno sa dove posso comprare la birra Norbertus Kardinal a Torino o dintorni?\n Ho già provato a vedere nei Mercató e Carrefour ma niente.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1m9rdn6/norbertus_kardinal/"
    },
    {
        "id": "1m9tsdn",
        "author": "m4db0b",
        "title": "Lamiera di metallo?",
        "content": "Da tempo mi frulla per la testa di piazzare in salotto una lastra di metallo abbastanza grande da usare come lavagna magnetica per i magneti raccolti nel corso dei miei viaggi, appendere foto e cose del genere. Ma non volendo applicare tasselli al muro, l'idea sarebbe di farla stare in piedi mettendola tra il muro ed il divano.\n\nStamane sono andato al Tecnomat di Orbassano ed ho trovato una lastra di ferro 2x1 metri, ma [spessa 0.6mm](https://www.tecnomat.it/it/lamiera-ferro-100x200cm-sp-0-6mm-10049891/): troppo sottile, flette e non sta dritta da sola. Leroy Merlin a catalogo ha [la stessa cosa](https://www.leroymerlin.it/prodotti/lamiera-in-ferro-liscio-opaco-200x100-cm-0-6-mm-argento-83972893.html), nulla di più spesso.\n\nVorrei provare a valutare qualcosa di più rigido ma non ho idea di dove andarlo e pescare, anche per farmi una idea del peso. Qualcuno ha un suggerimento?\n\nBen vengano anche eventuali altri suggerimenti sul tema \"superficie magnetica in salotto\", purché appunto non prevedano interventi invasivi di installazione e fissaggio.",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1m9tsdn/lamiera_di_metallo/"
    }
]