[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 488,
        "comments": 259,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1ijvfht",
        "author": "Internal_Deer_5324",
        "title": "Stop making documentaries about serial killers.",
        "content": "Making these documentaries is only giving what these murderer what they want… to be famous. They want to be immortalized by these terrible terrible acts, and these documentaries do exactly that. Please stop fulfilling the hopes of these wretched and vile transgressors.",
        "upvotes": 324,
        "comments": 80,
        "media": null,
        "permalink": "/r/netflix/comments/1ijvfht/stop_making_documentaries_about_serial_killers/"
    },
    {
        "id": "1ijv56g",
        "author": "Whobitmyname",
        "title": "‘Dungeons &amp; Dragons: Honor Among Thieves’ Releases on Netflix on February 26.",
        "content": "",
        "upvotes": 73,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ijv56g/dungeons_dragons_honor_among_thieves_releases_on/"
    },
    {
        "id": "1ijv5ef",
        "author": "Somethingman_121224",
        "title": "Streaming Giant Netflix Is Looking To Secure F1 Broadcasting Rights",
        "content": "",
        "upvotes": 41,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1ijv5ef/streaming_giant_netflix_is_looking_to_secure_f1/"
    },
    {
        "id": "1ijvbgk",
        "author": "soapnews",
        "title": "Ben Affleck and Gillian Anderson Set to Star in Kidnapping Thriller 'Animals' for Netflix",
        "content": "",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ijvbgk/ben_affleck_and_gillian_anderson_set_to_star_in/"
    },
    {
        "id": "1ijt9jj",
        "author": "peoplemagazine",
        "title": "Little House on the Prairie's Dean Butler Addresses Differences in Netflix Reboot, Reveals Why It Will 'Never' Be Like the OG Series",
        "content": "",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ijt9jj/little_house_on_the_prairies_dean_butler/"
    },
    {
        "id": "1ijygkh",
        "author": "Miserable-Penalty-54",
        "title": "Barbarians",
        "content": "Hi everyone, I have a question about a netflix show that I really liked, barbarians.\nI finished the first two seasons in no time and the final episode left me dangling and I would like to know if there is going to be a New season.\nI've recently read on the web that the series has been \"renewed\" (source: rotten tomatoes, an article from 2 weeks ago), please let me know anything.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ijygkh/barbarians/"
    },
    {
        "id": "1ijuhil",
        "author": "Robemilak",
        "title": "Netflix is reportedly interested in securing the live streaming rights for F1.",
        "content": "",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ijuhil/netflix_is_reportedly_interested_in_securing_the/"
    },
    {
        "id": "1ijjysf",
        "author": "IshaanM8",
        "title": "Device not part of household on PC",
        "content": "# Your device is not part of the Netflix Household for this account is now happening on PC as well..\n\n  \nIt was good while it lasted as you could still use it as before on the laptop / desktop but the same issue that was happening on the phone, is now happening on PC.",
        "upvotes": 20,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1ijjysf/device_not_part_of_household_on_pc/"
    },
    {
        "id": "1ijujs5",
        "author": "mynotell",
        "title": "netflix household wifi and lan",
        "content": "i have 2 devices:\n- tv connected via wifi in bedroom\n- pc connected via lan in gaming room\n\n\nboth use the same router\n\nstill netflix tells me, that one device doesnt belong to my household - wtf? they are literally 5 meter apart\n\n\nany way to fix that?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ijujs5/netflix_household_wifi_and_lan/"
    },
    {
        "id": "1ij3kyz",
        "author": "gbnewsonline",
        "title": "Netflix price rise coming to UK",
        "content": "",
        "upvotes": 128,
        "comments": 67,
        "media": null,
        "permalink": "/r/netflix/comments/1ij3kyz/netflix_price_rise_coming_to_uk/"
    },
    {
        "id": "1ijz0un",
        "author": "Ok_South1722",
        "title": "Netflix App is Bugged",
        "content": "Hi everyone, I have a problem where my Netflix app kept changing my phone to light mode, so I uninstalled and now I installed it again, and not only did it change my phone to light mode again but it's also bugged, it's stuck on the account info pop up and it won't let me do anything, the app is not working at all. Did anyone else experience this? Does someone know how to fix this? I wrote them on google play, as I don't know how to contact their customer service. I haven't found anything anywhere online on this issue, so that's why I'm asking here.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ijz0un/netflix_app_is_bugged/"
    },
    {
        "id": "1ijk6lm",
        "author": "dragon-elbow-coal",
        "title": "Scooby-Doo! Mystery Incorporated on Netflix is NOT a prequel to Scooby-Doo, Where Are You!",
        "content": "I keep seeing on this sub that Scooby-Doo! Mystery Incorporated (SDMI) is a prequel to Scooby-Doo, Where Are You! (SDWAY), but I struggle to see how that could be the case. While the ending does reset Crystal Cove to a timeline where there was no influence from the Evil Entity—complete with the gang driving off into the sunset with a 1960s Hanna-Barbera-style laugh track—several inconsistencies prevent this from leading directly into the events of SDWAY.  \n\nFirst off, canonically, Coolsville has always been the gang’s origin. This has been consistent in nearly every Scooby-Doo movie and series until SDMI. Secondly, SDMI features a museum displaying the costumes of unmasked villains from SDWAY, suggesting that SDWAY already exists within the SDMI universe. Additionally, Fred and Daphne appear visibly shaken when they see a synthetic replica of Scrappy-Doo in the same museum, a direct reference to Scooby-Doo (2002).  \n\nFor SDMI to lead into SDWAY, the gang would have had to lose their memories—just like the other residents of Crystal Cove—which clearly does not happen. When they leave town for college, they still remember all their past cases, despite those events technically never having taken place in the new timeline. This means that the individuals who would have become villains in SDWAY lived different lives and never donned their infamous disguises.  \n\nIf anything, the ending of SDMI erases the events of SDWAY rather than setting them up. This would suggest that SDWAY is actually a prequel to SDMI, with the most likely sequel being What’s New, Scooby-Doo? (WNSD). However, due to the timeline alterations in SDMI, I’d rather view it as a standalone, non-canon series—or possibly part of a Scooby-Doo multiverse. Since Scooby-Doo is technically part of the DC Universe, the latter isn't entirely out of the question.  \n\nWhat are your thoughts? ",
        "upvotes": 13,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ijk6lm/scoobydoo_mystery_incorporated_on_netflix_is_not/"
    },
    {
        "id": "1ijs6ks",
        "author": "FirTrader",
        "title": "My favorite show",
        "content": "I feel that “Black Mirror” has so much character creation and story to fit into each episode, that every second and every detail , of every scene, matters.  I know it is often dark, and has its fair share of gore, but I sure do love the series.",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ijs6ks/my_favorite_show/"
    },
    {
        "id": "1ijvxdl",
        "author": "Djordje101",
        "title": "Is it common for screen to glitch for couple of seconds while watching something",
        "content": "I was watching dexter recently (first season) and the screen happend to glitch rarely on tv, i rewind it in case if it is me but no it isn’t. It is like the video format is that way. So i wanna ask is this common with some other shows.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ijvxdl/is_it_common_for_screen_to_glitch_for_couple_of/"
    },
    {
        "id": "1iiz9pz",
        "author": "StarKCaitlin",
        "title": "Ben Affleck to Replace Matt Damon in Netflix Thriller ‘Animals,’ Gillian Anderson Joins Cast",
        "content": "",
        "upvotes": 116,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1iiz9pz/ben_affleck_to_replace_matt_damon_in_netflix/"
    },
    {
        "id": "1iiyhyr",
        "author": "theipaper",
        "title": "Apple Cider Vinegar isn't just cashing in on Belle Gibson's scam",
        "content": "",
        "upvotes": 97,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1iiyhyr/apple_cider_vinegar_isnt_just_cashing_in_on_belle/"
    },
    {
        "id": "1ijrd3o",
        "author": "talktailshep",
        "title": "issue with local multiplayer in civilisation 6",
        "content": "me and my buddy are both connected to the same wifi, but we cant manage to see each others lobbies in the local multiplayer menu. did anyone else manage to get in a local multiplayer game on the netflix version on civ 6?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ijrd3o/issue_with_local_multiplayer_in_civilisation_6/"
    },
    {
        "id": "1ijn361",
        "author": "jedix_",
        "title": "new isp, no tv, household locked out",
        "content": "I don't watch netflix on a tv, but somehow my household is set.  I read in another post this is done automatically by device activity if you don't have a tv.. I really don't care how it's set but I can't update it now.  I just switched internet providers and now I'm locked out of using my own account.  I kicked all my devices out and changed my password, but I'm still locked out.  I guess the enshitification continues to expand, even to paid services.  Way to go netflix.\n\n  \nEdit: I was able to get into chat this AM with a tech person by using a temporary code and waiting 15 minutes (much better than the hour I spent on hold..).  After you purge your account of devices and reset the password you may have to wait 24 hours for some devices to be signed out.\n\nSuch a poor user experience, it's sad to see a service go this way.",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ijn361/new_isp_no_tv_household_locked_out/"
    },
    {
        "id": "1iirj71",
        "author": "Impossible-Will-8414",
        "title": "Kinda Pregnant -- Wow",
        "content": "OK, I know Amy Schumer can be a complicated figure, but she has done some decent work lately, including in the Hulu series Life and Beth -- not amazing or anything, but a mix of quiet humor and heartfelt plot lines. And movies like Trainwreck, while not great, still have had some merit. But my GOD -- Kinda Pregnant, which debuted today on Netflix, is fully unwatchable -- it's like a Z-grade Adam Sandler movie (and funnily enough, Adam Sandler's nephew, Tyler Spindel, directs this atrocity!), with a \"wild and wacky\" plot that is completely over the top and characters who are not in any way recognizably human. And Schumer actually co-wrote the script, so she can't blame this on bad writing. It is ATROCIOUS. Watched about 30 minutes and flipped it off, both literally and figuratively. Schumer really seems to be in a very bad place if this garbage is any indication.",
        "upvotes": 251,
        "comments": 165,
        "media": null,
        "permalink": "/r/netflix/comments/1iirj71/kinda_pregnant_wow/"
    },
    {
        "id": "1ijpzjo",
        "author": "OlympicPlinkoChamp",
        "title": "Personal Information Techinal Help Needed Urgently",
        "content": "I requested and received my personal information from Netflix.  It contained a file \"MessagesSentByNetflix\".  Under the column \"Message Name\" there are messages labeled \"Barrower Resolution Interstitial\".  What does this mean?  Under the column \"Channel\" it has some labeled \"Alerts\".  What does this mean?  With most messages there is no logged interaction or device.  Is there a way to see what device triggered this message?  Is there a way to see if there was in fact any interaction?  Is there a way to get more IP information?  Is there detailed information about the length of active periods of browsing?  \n\nI need exact technical definitions of what these things mean and as detailed as possible information about interactions during a given period.  \n\nI need this information urgently.  I can't emphasize enough how critical my need for this information is.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ijpzjo/personal_information_techinal_help_needed_urgently/"
    },
    {
        "id": "1ij16du",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix has released the teaser for 'The Eternaut' live-action adaptation of the famous Argentinian sci-fi comic. Premieres globally on April 30",
        "content": "",
        "upvotes": 28,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ij16du/netflix_has_released_the_teaser_for_the_eternaut/"
    },
    {
        "id": "1ijn1dw",
        "author": "forevony_0904",
        "title": "Good show Maid",
        "content": "Just finished\n\nI really liked this show. Not my fave as I normally love teen dramas romance but this was very good. \n\nSad we didn't see an ending for Nate tho. But so happy ending for Maddy and Alex. Good good show. Highky recommend everyone watch it ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ijn1dw/good_show_maid/"
    },
    {
        "id": "1ijxja5",
        "author": "Brilliant_Shock_7226",
        "title": "That 90s show! Canceled what can we do?",
        "content": "That 90s show is canceled after finally getting good? What can we do to fix and change Netflix mind. They did this to Julie and the phantoms please Netflix how do we keep this show renewed! Please ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ijxja5/that_90s_show_canceled_what_can_we_do/"
    },
    {
        "id": "1ijs6e6",
        "author": "Blorbogan",
        "title": "New tv.",
        "content": "I’m staying with my girlfriend and my Netflix which has like five of us family members paying for it won’t log in on her tv and says I have to register her tv even tho I’m doing the Wi-Fi  connection wtf is going on ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ijs6e6/new_tv/"
    },
    {
        "id": "1ijq1jd",
        "author": "Cassidus",
        "title": "Have you noticed this or has it happened to you?",
        "content": "I'm a week off from my membership being over and Netflix is trying to encourage me back with offers. But also, my continue watching list is gone and i cant even search for the show I want because it's \"gone\" on my profile. My partner can search it fine on the same account, by just using her profile. My theory is that they're trying to subtlety encourage me back to subscribing. Would you agree?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ijq1jd/have_you_noticed_this_or_has_it_happened_to_you/"
    },
    {
        "id": "1ijk0ay",
        "author": "apoc_krysis",
        "title": "Lost feature",
        "content": "Does anyone remember several years back when Netflix had a thing I think it was called “Max” and it would talk to you and pick out a random movie based on what you told it you liked? It was very short lived but it was cool. I can’t remember if that was the correct name. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ijk0ay/lost_feature/"
    },
    {
        "id": "1iiew2n",
        "author": "EthanWilliams_TG",
        "title": "Netflix Cancels Six Announced Games Before Release",
        "content": "",
        "upvotes": 438,
        "comments": 105,
        "media": null,
        "permalink": "/r/netflix/comments/1iiew2n/netflix_cancels_six_announced_games_before_release/"
    },
    {
        "id": "1ijjq7a",
        "author": "Winter_Swing9361",
        "title": "rom com movie + tv + book suggestions",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ijjq7a/rom_com_movie_tv_book_suggestions/"
    },
    {
        "id": "1ij8qaz",
        "author": "brucie_me",
        "title": "Roku won't show Netflix on home page!",
        "content": "I have 3 Rokus and one of them (newest Roku Ultra 2024) doesn't show Netflix on my home page no matter how I try! I can only access it through the remote or \"channel lineup\" -- no problem with other apps. This is known issue from what I read online, is a fix or workaround available?",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ij8qaz/roku_wont_show_netflix_on_home_page/"
    },
    {
        "id": "1ij44af",
        "author": "ideasnstuff",
        "title": "Action Scenes in The Night Agent",
        "content": "For all the serious action fans - do the fight and action scenes stand out in TNA? I find the production quality great overall but the action scenes are comparable to other similar shows. I don't see anything that sets it apart to justify all the attention it gets during promos.",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ij44af/action_scenes_in_the_night_agent/"
    }
]