[
    {
        "id": "1j59wkz",
        "author": "BunyipPouch",
        "title": "Join us tomorrow Friday 3/7 at 2:00 PM ET for an AMA/Q&amp;A with Carson Lund &amp; Keith William Richards, director and lead actor of 'Eephus', a critically-acclaimed baseball film that premiered at Cannes last year. Keith is also known for his performance in 'Uncut Gems'.",
        "content": "",
        "upvotes": 3,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ghiadnvtp5ne1.png?auto=webp&amp;s=9620646f179bae86ec9299f0fae7b7e80d3ea188"
        },
        "permalink": "/r/movies/comments/1j59wkz/join_us_tomorrow_friday_37_at_200_pm_et_for_an/"
    },
    {
        "id": "1j4xlby",
        "author": "NightoftheZooAMA",
        "title": "Hi reddit! We are Ricardo Curtis and Rodrigo Perez-Castro. We are the co-directors of the animated horror-comedy NIGHT OF THE ZOOPOCALYPSE, out in theaters this week. We've also worked on films like The Incredibles, Monsters Inc, Ice Age, Rio, Angry Birds &amp; much more as animators/story artists. AMA!",
        "content": "",
        "upvotes": 23,
        "comments": 56,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gyg3safs43ne1.png?auto=webp&amp;s=6fef86cba930c40f6c3eed6528ca3e8ca261af86"
        },
        "permalink": "/r/movies/comments/1j4xlby/hi_reddit_we_are_ricardo_curtis_and_rodrigo/"
    },
    {
        "id": "1j54fnz",
        "author": "MarvelsGrantMan136",
        "title": "'Monty Python and the Holy Grail' Is Returning to Theaters on May 4 to Celebrate 50th Anniversary",
        "content": "",
        "upvotes": 4886,
        "comments": 250,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9X8AWHoMf1-0XuL379HYES5nNvNF1hc6eSNL5uvKJRU.jpg?auto=webp&amp;s=4ec479586790ddb3dfaa121af760f66e0ce27069"
        },
        "permalink": "/r/movies/comments/1j54fnz/monty_python_and_the_holy_grail_is_returning_to/"
    },
    {
        "id": "1j511ay",
        "author": "guyfierihair",
        "title": "9 is one of the most overlooked animated movies",
        "content": "",
        "upvotes": 1189,
        "comments": 130,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/p4nPNPyj8MUqv5SLqgVmg_VmE2fL1I94b69GFTcT2tA.jpg?auto=webp&amp;s=d465f0b0109893dc4f88ec8e77c673e4eb89d8c3"
        },
        "permalink": "/r/movies/comments/1j511ay/9_is_one_of_the_most_overlooked_animated_movies/"
    },
    {
        "id": "1j4vgj6",
        "author": "Puzzled-Tap8042",
        "title": "Roy Ayers, ‘Everybody Loves the Sunshine’ Musician and ‘Coffy’ Composer, Dies at 84",
        "content": "",
        "upvotes": 1917,
        "comments": 65,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_2zWJe6L9_kXSst2UEfhfZYbjbMPVKQ_R20I6fq0FJU.jpg?auto=webp&amp;s=0d5004d139e7915cef4daff657ccc9c6fcf47664"
        },
        "permalink": "/r/movies/comments/1j4vgj6/roy_ayers_everybody_loves_the_sunshine_musician/"
    },
    {
        "id": "1j51z2i",
        "author": "slhamlet",
        "title": "I love how Bill Hader describes this \"Taxi Driver\" scene: “It’s so painful, it’s like the movie doesn’t want to watch this.” (Info on comments)",
        "content": "",
        "upvotes": 558,
        "comments": 43,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/AbqfBnAuKD1Cl5mvKBqlUSq3QF8x0eMF_H-zoHE38bQ.jpg?auto=webp&amp;s=ba8bda9fa658044a822cd94b4c975cc306378617"
        },
        "permalink": "/r/movies/comments/1j51z2i/i_love_how_bill_hader_describes_this_taxi_driver/"
    },
    {
        "id": "1j4vxg0",
        "author": "NimdokBennyandAM",
        "title": "I wasted too much of my life having never watched Paddington 2.",
        "content": "This movie has no right to be this good. So damn charming. It's so delightfully unserious at moments and them wham, you get hit by such genuine and moving moments of love, care, and for some of the characters, redemption.\n\n\n\n\nThe entire prison sequence is perfection. Paddington makes prison nice. Marmalade sandwiches, planters in front of cells, and the jump cut from Paddington noticing the red sock in the laundry to the prisoners all wearing pink clothing is top tier.\n\n\n\n\nHugh Grant? Perfect.\n\n\n\n\nSorry, Paddington 2. I knew not of your perfection.\n\n\n\nOh, also, the post-credits scene of Hugh Grant leading the prison in a big Broadway number? ::chef's kiss::\n\n\n**Edit:** I also forgot to mention: I remember seeing someone in this subreddit whose flair says: \"Paddington 2 is the Citizen Kane of talking animal movies,\" and I understand that now, and agree very much.",
        "upvotes": 1030,
        "comments": 185,
        "media": null,
        "permalink": "/r/movies/comments/1j4vxg0/i_wasted_too_much_of_my_life_having_never_watched/"
    },
    {
        "id": "1j4vuq7",
        "author": "mbroda-SB",
        "title": "Pulp Fiction Question I’ve Pondered for 30 Years",
        "content": "So, Butch and Marcellus reach their truce after the “event” in the basement of the pawn shop, leaving Butch conditionally safe from Wallace’s retribution.  Do we think Marcellus may have changed his mind after finding out Butch killed Vincent in his apartment, or would Marcellus just consider this the cost/risk of doing business?\n\nSince it’s established that Marcellus and Vincent have a bit more of a professional relationship and seem to have some level of trust and friendship beyond business, would Butch ever truly be safe even if he stays out of LA?\n",
        "upvotes": 833,
        "comments": 394,
        "media": null,
        "permalink": "/r/movies/comments/1j4vuq7/pulp_fiction_question_ive_pondered_for_30_years/"
    },
    {
        "id": "1j4s26r",
        "author": "amberlouiseb",
        "title": "'The Ugly Stepsister': Director Emilie Blichfeldt on reframing Cinderella as body horror",
        "content": "",
        "upvotes": 1652,
        "comments": 166,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vQlvVaUENZ_HKvt-JPVVoZdqKfY7tkGoHy9_DijAu-o.jpg?auto=webp&amp;s=8b2e06ef40c8496d69072efcc421282a68330ace"
        },
        "permalink": "/r/movies/comments/1j4s26r/the_ugly_stepsister_director_emilie_blichfeldt_on/"
    },
    {
        "id": "1j5973c",
        "author": "heileggg",
        "title": "A movie that isn't popular, but you like it.",
        "content": "I can't think of too many movies where it's clearly an unpopular or non mainstream movie, but you still LOVE it.\n\nFor me it's brainstorm (1983).  It's my favorite movie.\n\nWhat movie do you love that is not so popular?  Looking forward to hearing from you all.  And I'm not talking about bad movies.  I mean movies that just need more attention, i suppose.\n\nThere are some quality answers here.  Sometimes some films don't get enough LOVE.  They are good movies, and you're just like, wow more people should know!",
        "upvotes": 107,
        "comments": 751,
        "media": null,
        "permalink": "/r/movies/comments/1j5973c/a_movie_that_isnt_popular_but_you_like_it/"
    },
    {
        "id": "1j4z9t1",
        "author": "ChiefLeef22",
        "title": "David Lynch to Be Celebrated by World Soundtrack Awards | Belgian Film Fest Gent and the World Soundtrack Academy will honor the memory of David Lynch by having young composers score an excerpt from the late auteur’s “The Elephant Man” as part of their annual Film Music Composition Contest",
        "content": "",
        "upvotes": 161,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/U4MMOgRUhYx8Gls_UDIdAEV533bfdZRTXGda4JLCWaY.jpg?auto=webp&amp;s=a992d919a45d10ce8377aba1f423583af7d436e0"
        },
        "permalink": "/r/movies/comments/1j4z9t1/david_lynch_to_be_celebrated_by_world_soundtrack/"
    },
    {
        "id": "1j4y6wb",
        "author": "ChiefLeef22",
        "title": "Steven Soderbegh's 'Black Bag' - Review Thread",
        "content": "Soderbergh fans are eating good this year.\n\n**Rotten Tomatoes:** [94%](https://www.rottentomatoes.com/m/black_bag)\n\n**Metacritic:** [86/100](https://www.metacritic.com/movie/black-bag/)\n\nSome Reviews:\n\n[The Independent - Clarisse Loughrey](https://www.independent.co.uk/arts-entertainment/films/reviews/black-bag-review-steven-soderbergh-michael-fassbender-b2710141.html)\n\n&gt;While the supporting cast are impeccable across the board, it’s really Blanchett and Fassbender’s film to command, with performances that drip with old-school star power. Fassbender, when he delicately adjusts his glasses or cuffs, evokes the sly, chilled elegance of a Michael Caine or Dirk Bogarde, but with a sliver of vulnerability in the eyes that really begs the question of what exactly is going on in that head of his.\n\n[Screen Daily - Tim Grierson](https://www.screendaily.com/reviews/black-bag-review-fassbender-blanchett-spy-up-a-storm-for-steven-soderbergh/5202447.article)\n\n&gt;Highly entertaining from start to finish, the film benefits from David Koepp’s inventive screenplay and Soderbergh’s storytelling swagger.\n\n[The Daily Beast - Nick Schager](https://www.thedailybeast.com/obsessed/black-bag-review-the-sleek-sexy-spy-thriller-movie-theaters-need/)\n\n&gt;When it comes to sleek, stylish genre movies, Soderbergh remains a maestro at the top of his game. A spy thriller that feels like a cross between John le Carré and Agatha Christie, the director’s latest—written, as was his prior [*Presence*](https://www.thedailybeast.com/obsessed/presence-review-steven-soderbergh-does-his-own-haunted-house-movie/), by Oscar-winning screenwriter David Koepp—is at once clipped and fluid, as sharp as a dagger and as silky as luxury bedsheets.\n\n[The Wrap - William Bibbiani](https://www.thewrap.com/black-bag-review-steven-soderbergh-michael-fassbender-cate-blanchett/)\n\n&gt;Human weakness is 'Black Bag’s' greatest strength. It’s an insidiously great spy movie, mature and satisfying. “Black Bag” digs into the superficially erogenous spy genre and finds inside it a desperate need for therapy. It’s an intricately intertwined tale of sexual strife and political machinations, and a strong reminder at the heart of every drama, personal or political, there’s human weakness.\n\n[TIME - Stephanie Zacharek](https://time.com/7264825/black-bag-review-steven-soderbergh/)\n\n&gt;Black Bag succeeds on its chilly wit, and on the cool, nervy appeal of its two stars. Blanchett strides through the movie with lioness grace; Fassbender makes George’s robotic use of logic seem like an aphrodisiac.\n\n[IGN - Siddhant Adlakha ](https://www.ign.com/articles/black-bag-review-michael-fassbender-cate-blanchett-steven-soderbergh)\n\n&gt;Its story of three couples working at the same British agency turns all the right screws with impeccable timing, forcing its characters to examine the flaws in their relationships as its tale of state secrets gradually unravels. A film that projects domestic anxieties onto the espionage genre, Steven Soderbergh’s Black Bag is a slick, self-assured, wildly entertaining spy thriller about a husband-wife intelligence duo forced to question their trust.\n\n[Variety - Peter Debruge](https://variety.com/2025/film/reviews/black-bag-review-steven-soderbergh-cate-blanchett-michael-fassbender-1236329004/)\n\n&gt;Steven Soderbergh dashes off a sleek little genre exercise -- a doodle really, at a stage in his career when he’s clearly just having fun -- that proves to be one of his smartest and sexiest films yet.\n\n[Deadline - Pete Hammond](https://deadline.com/2025/03/black-bag-review-michael-fassbender-cate-blanchett-spies-steven-soderberghs-stylish-thriller-1236311971/)\n\n&gt;With an A+ cast at the top of their game, a tight 93 minute running time, and dialogue with wit and bite, this finds the director with one of his best opportunities to do what he does so well and give that older audience a reason to go back to the movies.\n\n[The Guardian - Peter Bradshaw](https://www.theguardian.com/film/2025/mar/07/black-bag-review-michael-fassbender-and-cate-blanchett-intrigue-in-marital-espionage)\n\n&gt;Steven Soderbergh’s downbeat, affectless tongue-in-cheek spy comedy (“caper” isn’t quite right) is in this new mode, though taking itself to the edge of self-satire, with a few 007 refugees in the cast, efficiently scripted by David Koepp.",
        "upvotes": 99,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LyN55qdE08G2QXtXUUU6_XF_EYmp7m-1vTJKKvl17to.jpg?auto=webp&amp;s=c004dd939ecdb775b3887c4e64d45fb16bc8669c"
        },
        "permalink": "/r/movies/comments/1j4y6wb/steven_soderbeghs_black_bag_review_thread/"
    },
    {
        "id": "1j52in9",
        "author": "whodoesntlovedogs",
        "title": "Soderbergh made Out of Sight, The Limey, Erin Brockovich, Traffic &amp; Oceans 11 in 3 years. How is that possible?",
        "content": "In terms of delivering movies across different movie genres, only other people as prolific as him I can think of would be Ridley Scott or Clint Eastwood. Although, the quality has been very inconsistent. \n\nSoderbergh stands out because he balances speed, variety, and quality, but some directors match or even surpass him in different ways. Any thoughts?",
        "upvotes": 56,
        "comments": 45,
        "media": null,
        "permalink": "/r/movies/comments/1j52in9/soderbergh_made_out_of_sight_the_limey_erin/"
    },
    {
        "id": "1j46sx6",
        "author": "ChocolateOrange21",
        "title": "'Movies don't change but their viewers do': Movies that hit differently when you watch them at an older age.",
        "content": "Roger Ebert had this great quote about movies and watching them at different points in your life. Presented in full below.\n\n“Movies do not change, but their viewers do. When I saw La Dolce Vita in 1960, I was an adolescent for whom “the sweet life” represented everything I dreamed of: sin, exotic European glamor, the weary romance of the cynical newspaperman. When I saw it again, around 1970, I was living in a version of Marcello’s world; Chicago’s North Avenue was not the Via Veneto, but at 3 a.m. the denizens were just as colorful, and I was about Marcello’s age.\n\nWhen I saw the movie around 1980, Marcello was the same age, but I was 10 years older, had stopped drinking, and saw him not as a role model but as a victim, condemned to an endless search for happiness that could never be found, not that way. By 1991, when I analyzed the film a frame at a time at the University of Colorado, Marcello seemed younger still, and while I had once admired and then criticized him, now I pitied and loved him. And when I saw the movie right after Mastroianni died, I thought that Fellini and Marcello had taken a moment of discovery and made it immortal.”\n\n\\*\\*\n\nWhat are some movies that had this effect on you? Based on a previous discussion, 500 Days of Summer was one for me. When I first watched it, I just got out of a serious relationship, and Tom resonated with me. Rewatching it with some time, I realized Tom was flawed, and he was putting Summer on a pedestal and not seeing her as a person.\n\nDiscuss away!\n\n",
        "upvotes": 6610,
        "comments": 2361,
        "media": null,
        "permalink": "/r/movies/comments/1j46sx6/movies_dont_change_but_their_viewers_do_movies/"
    },
    {
        "id": "1j4ukq9",
        "author": "zeusakash",
        "title": "What is a movie released on or after 2015 that you have watched multiple times",
        "content": "I'm asking to find the most rewatchable movies released in this decade, and I'd love your input! There are certain films that draw us in every time, whether due to their captivating storylines, incredible performances, or simply how comforting they are to watch again and again and im tired of seeing the same Jurassic Park,Matrix,Alien answers. I want to know which relatively new films you just can’t get enough of. What makes them so special for you? Share your thoughts and help build a list of films of the decade that are truly rewatchable!",
        "upvotes": 125,
        "comments": 731,
        "media": null,
        "permalink": "/r/movies/comments/1j4ukq9/what_is_a_movie_released_on_or_after_2015_that/"
    },
    {
        "id": "1j4w4te",
        "author": "kassiusx",
        "title": "‘A certain kind of chaos’: Errol Morris unpacks Charles Manson theories",
        "content": "",
        "upvotes": 88,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ucXs_l-zYrpzwbVTLLsLPCEi64bXmZJpCIfCHLbSH0E.jpg?auto=webp&amp;s=3d182f83b23aa437098cd8ac2aa82786378776f7"
        },
        "permalink": "/r/movies/comments/1j4w4te/a_certain_kind_of_chaos_errol_morris_unpacks/"
    },
    {
        "id": "1j4lqwx",
        "author": "parkergallery",
        "title": "Movies where everything is a lie",
        "content": "Hi! I wanted some recommendations of movies like The Truman Show and Matrix where the main character just finds out that their reality is not real. Not necessarily movies where the character is being watched (like The Hunger Games), but movies where they didn't know and then found out.\n\nI know that asking for those recommendations is asking for spoilers but in this case i don't mind. \n\nEDIT: Thank you some much everyone!! I never expected this post to get so much attention and answers! I will make sure to watch everything and look back at the discussions! xx",
        "upvotes": 587,
        "comments": 967,
        "media": null,
        "permalink": "/r/movies/comments/1j4lqwx/movies_where_everything_is_a_lie/"
    },
    {
        "id": "1j4mzjy",
        "author": "one_pound_of_flesh",
        "title": "The Big Lebowski",
        "content": "Is it a perfect movie? It was a cult favorite in college. But giving it a rewatch and more analysis - the cast is entirely GOATS. The soundtrack. The editing. The cinematography of Roger Deakins. There is no wasted shot. \n\nThe script is funny and tight. It is absurd, self referential, a play. \n\nThe film more than holds up. ",
        "upvotes": 440,
        "comments": 239,
        "media": null,
        "permalink": "/r/movies/comments/1j4mzjy/the_big_lebowski/"
    },
    {
        "id": "1j4q0mw",
        "author": "Torley_",
        "title": "Tom Hanks singing Talking Heads' \"Once in a Lifetime\"... same as it ever was (from A HOLOGRAM FOR THE KING)",
        "content": "",
        "upvotes": 227,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-pXndi4Ee34eHW9hJQSGywyN3J4RHP0XFFZkHJps9ZU.jpg?auto=webp&amp;s=0f36f45b1fe438647dbee38caed2d9a23757d957"
        },
        "permalink": "/r/movies/comments/1j4q0mw/tom_hanks_singing_talking_heads_once_in_a/"
    },
    {
        "id": "1j51muh",
        "author": "artpayne",
        "title": "Would you rather ride with Alonzo Harris from Training Day or drive Vincent around from Collateral?",
        "content": "It's L.A. It's your training day, where you have to ride with Alonzo Harris without knowing he's been *planning it all week,* in his '79 Monte Carlo (which is *da office, baby).* Remember, *King Kong ain't got shit on him.*\n\nOr...\n\nIt's L.A. You have to drive your cab with Vincent *(\"Yo, homie... that my briefcase?\")* in the backseat, making five stops, thinking it’ll be just like any other night.\n\nSo, if you had to choose one, which would you?",
        "upvotes": 27,
        "comments": 47,
        "media": null,
        "permalink": "/r/movies/comments/1j51muh/would_you_rather_ride_with_alonzo_harris_from/"
    },
    {
        "id": "1j5atjc",
        "author": "CanadianClassicss",
        "title": "Letters from Iwo Jima: Did Japanese soldiers commit suicide like depicted in the caves with grenades?",
        "content": "I thought Bonzai attacks/suicides were typically aimed at at least killing some of the enemy. It is portrayed in the movie that a unit kills themselves with grenades (after disobeying a direct order) by pulling the pin, hitting their head with the grenade, yelling bonzai and having it explode on their chest.\n\nI know officers would stab themselves, but would soldiers commit suicide in this manner? Was it common? I tried looking online for this but I could not find anything.\n\n[https://www.youtube.com/watch?v=3l2NeCiP8b8](https://www.youtube.com/watch?v=3l2NeCiP8b8)",
        "upvotes": 9,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WrZNXff0cybop4SSd42_uRKgyKi1J_V5Q2Ain0BfoZ0.jpg?auto=webp&amp;s=98a5b795b96d88684707abe91c5a5568a6fadfe1"
        },
        "permalink": "/r/movies/comments/1j5atjc/letters_from_iwo_jima_did_japanese_soldiers/"
    },
    {
        "id": "1j4m8gy",
        "author": "Visual-Coyote-5562",
        "title": "Why do non-closed captioned subtitles no longer exist as an option on streaming?",
        "content": "When DVDs came out, many offered both closed captions and subtitles as an option.  In fact people would complain if subtitles weren't included.  You see, subtitles don't include words indicating sound effects, noises, or music and are much less intrusive than closed captions which are designed for people who are hard of hearing.   However from what I can tell subtitles outside of foreign titles no longer exist.  It seems like this would be such an easy thing to facilitate with current technology.  Is there a reason for it?",
        "upvotes": 439,
        "comments": 157,
        "media": null,
        "permalink": "/r/movies/comments/1j4m8gy/why_do_nonclosed_captioned_subtitles_no_longer/"
    },
    {
        "id": "1j4d0m1",
        "author": "NoCulture3505",
        "title": "Kathryn Newton Reteaming With Radio Silence For Searchlight’s ‘Ready Or Not’ Sequel",
        "content": "",
        "upvotes": 1416,
        "comments": 91,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5jbTh4jQtO5MBBwk6VO4MRizseNL5leF0KfJB1W8XUI.jpg?auto=webp&amp;s=9d5637a145d4005e3644b8b6e34f1f723aab5c57"
        },
        "permalink": "/r/movies/comments/1j4d0m1/kathryn_newton_reteaming_with_radio_silence_for/"
    },
    {
        "id": "1j583in",
        "author": "Aboveground_Plush",
        "title": "Streaming's Impact: Classic Films Lost to Algorithms",
        "content": "",
        "upvotes": 11,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/z7C7wNPEHrftPuWDaiM7-qlN7eoYifJH4K0B3IOrYFs.jpg?auto=webp&amp;s=6a6da83bd2b65509d9554169a1c98f6160c32d82"
        },
        "permalink": "/r/movies/comments/1j583in/streamings_impact_classic_films_lost_to_algorithms/"
    },
    {
        "id": "1j4b0bc",
        "author": "DemiFiendRSA",
        "title": "‘Jaws’ Swims Back Into Theaters This Summer for 50th Anniversary on August 29",
        "content": "",
        "upvotes": 1434,
        "comments": 98,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YxzVKLqbhd2LhQDO1u-S0n9fOOJqqjOz9EzazTaG9fc.jpg?auto=webp&amp;s=d1531c974113396245b6cf1cec4c6b920599a992"
        },
        "permalink": "/r/movies/comments/1j4b0bc/jaws_swims_back_into_theaters_this_summer_for/"
    },
    {
        "id": "1j54357",
        "author": "Puzzled-Tap8042",
        "title": "‘Wolfs’ Breakout Austin Abrams To Star In ‘Whalefall’ From 20th Century, Imagine And Brian Duffield",
        "content": "",
        "upvotes": 12,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LIYx4hpCCM5eeJ_WQW25fYiL9gGJM2Fsz76A70WAFCk.jpg?auto=webp&amp;s=f20fae2de85a09cd9f118f90e96688ea6893a16a"
        },
        "permalink": "/r/movies/comments/1j54357/wolfs_breakout_austin_abrams_to_star_in_whalefall/"
    },
    {
        "id": "1j49cyv",
        "author": "LunchyPete",
        "title": "Captain America Co-Creator Jack Kirby Getting Definitive Documentary ‘Kirbyvision’",
        "content": "",
        "upvotes": 1291,
        "comments": 51,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YNSVr2XSJpXmmxgqnwiWG85zJ7tBuKGIYY8NZg6-DWE.jpg?auto=webp&amp;s=fe5160167ee38373b0fa74b4196a201724933daa"
        },
        "permalink": "/r/movies/comments/1j49cyv/captain_america_cocreator_jack_kirby_getting/"
    },
    {
        "id": "1j579b4",
        "author": "kehakas",
        "title": "Which great movie owes the largest share of its greatness to its score?",
        "content": "I don't feel this way, but let's say for the sake of argument that Alan Silvestri's score for Forrest Gump is a huge reason why people love it, and the movie itself isn't a great movie. In that vein, what well-regarded movie do you feel is elevated by its score more than any other? Let me know your thoughts!",
        "upvotes": 7,
        "comments": 115,
        "media": null,
        "permalink": "/r/movies/comments/1j579b4/which_great_movie_owes_the_largest_share_of_its/"
    },
    {
        "id": "1j48ukw",
        "author": "Fun_Protection_6939",
        "title": "Can we appreciate Quentin Tarantino's casting for the Manson family members in Once Upon a Time.....in Hollywood?",
        "content": "One an Oscar winner (Mikey Madison), the other an Oscar nominee (Austin Butler), another's Oscar nomination is a case of when, not if (Margaret Qualley), Maya Hawke who has been doing incredible work and had one of the biggest successes of the year in Inside Out 2.......and then there's Sydney Sweeney. ",
        "upvotes": 1136,
        "comments": 267,
        "media": null,
        "permalink": "/r/movies/comments/1j48ukw/can_we_appreciate_quentin_tarantinos_casting_for/"
    },
    {
        "id": "1j5btvv",
        "author": "trinamareena",
        "title": "Two movies filmed in the same location",
        "content": "I just watched two movies back-to-back that I'm pretty sure were filmed at the same house, at least used the same house for the outside shot. Cellar Door and It's What's Inside\n\nIMDb says filming location was Portland, OR but that's all. Can anyone confirm? Just found it a interesting coincidence.\n\nCellar Door was a 5, boring twist. It's What's Inside was a 7, interesting premise, unexpected twist.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1j5btvv/two_movies_filmed_in_the_same_location/"
    },
    {
        "id": "1j4iwl3",
        "author": "Rigamortus2005",
        "title": "Greatest actors without an Oscar win?",
        "content": "It's quite insane the number of legeendary actors without an oscar win for acting. If i had to list off the top of my head I'd personally say Ralph Fiennes, Jake Gyllenhaal,  Edward Norton, Samuel L Jackson, Liam neeson , Johnny Depp, ian mckellen and even willem defoe. Curious to see who else you guys have up there.   ",
        "upvotes": 268,
        "comments": 789,
        "media": null,
        "permalink": "/r/movies/comments/1j4iwl3/greatest_actors_without_an_oscar_win/"
    },
    {
        "id": "1j50o51",
        "author": "jjochems78",
        "title": "Historical movies that need to be made",
        "content": "I’d love to hear others talk about history stories that would be amazing to see on screen but no one has attempted yet, at least in a satisfying way.  Here are some of my choices\n\nI would love to see someone tackle deaf history in an accurate way.  There are so many stories there.  John Braidwood- The man who failed to establish the first deaf school because he was a hopeless drunk. Alexander Graham Bell- One of the most divisive figures in the deaf community for being extremely oppressive during the pro-eugenics era.  Laurent Clerc- The French man who fathered sign language in America and paved the way towards deaf education.\n\nI would also love to see an in depth biopic on Fritz Haber.  A man who might’ve saved more lives than anyone in history but utterly destroyed his legacy for his outrageously selfish acts and his awful war crimes.  The most tragic aspect being how his own work was stolen by Nazis and used to murder the people he likely cared the most about.\n\nHonorary mentions-  Would love to see a very dramatic and well done telling of the Russian revolution.  Rasputin still hasn’t been done justice yet.  Also would love a great movie about very early civs like Babylon, Sumeria/Mesopotamia.  And if there’s a historical leader who is very long overdue for a well done film it would be Mansa Musa.\n\n",
        "upvotes": 10,
        "comments": 49,
        "media": null,
        "permalink": "/r/movies/comments/1j50o51/historical_movies_that_need_to_be_made/"
    }
]