[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 10,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 43,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1kyrn8k",
        "author": "gracieb_1",
        "title": "streaming not working?",
        "content": "can’t watch netflix on any devices (tv, ipad, phone, computer, etc). it’s not our account or our wifi. is anyone else having this issue? we’ve troubleshot multiple times and contacted support, but they say that it’s not showing any issues.",
        "upvotes": 719,
        "comments": 811,
        "media": null,
        "permalink": "/r/netflix/comments/1kyrn8k/streaming_not_working/"
    },
    {
        "id": "1kyrqyd",
        "author": "Wildstephy4",
        "title": "Down?",
        "content": "Anyone else having issues with Netflix being down at the moment. I'm pretty sure the site is down but it's a weird error code so I'm not sure if it's me or not.",
        "upvotes": 257,
        "comments": 167,
        "media": null,
        "permalink": "/r/netflix/comments/1kyrqyd/down/"
    },
    {
        "id": "1kyri1s",
        "author": "Alextheseal_42",
        "title": "Can’t watch anymore episodes of Dept Q??",
        "content": "So I started watching Dept Q today (in the US) where all episodes are supposed to be available as of today. Get to the end of episode two and it won’t continue, saying I cannot watch it anymore. When I go to look up the series all that’s there is the trailer. What????\n\nEdit: glad to know I’m not alone but still sucks. I can watch other stuff on Netflix but seems like many others can’t. Ahhh technology. 🤦🏻‍♀️ ",
        "upvotes": 184,
        "comments": 272,
        "media": null,
        "permalink": "/r/netflix/comments/1kyri1s/cant_watch_anymore_episodes_of_dept_q/"
    },
    {
        "id": "1kyrtg6",
        "author": "Blindshrine",
        "title": "Is anybody else unable to stream stuff right now?",
        "content": "It’s currently 6:22 pm pacific time and my Netflix is showing network errors. All other apps and wifi in the house is working fine, is Netflix having issues?",
        "upvotes": 133,
        "comments": 75,
        "media": null,
        "permalink": "/r/netflix/comments/1kyrtg6/is_anybody_else_unable_to_stream_stuff_right_now/"
    },
    {
        "id": "1kyevkp",
        "author": "jerkoff1610",
        "title": "Anyone else tired of the four-year-long wait between seasons of Stranger Things, where kids don't look like kids anymore?",
        "content": "They all look so different now! Weren't they supposed to be 16-17 in season 5??\n\nAlso, correct me if I'm wrong, but isn't Erica, who btw just graduated high school and is an adult now, supposed to be THIRTEEN in season 5????\n\nApparently, they have pushed the release date for season 5 to 2026. This is just crazyyy!!!  \n",
        "upvotes": 711,
        "comments": 172,
        "media": null,
        "permalink": "/r/netflix/comments/1kyevkp/anyone_else_tired_of_the_fouryearlong_wait/"
    },
    {
        "id": "1kyrzzv",
        "author": "NorjackNC",
        "title": "Season 1 Episode 1 of \"This title is not available to watch instantly. Please try another title.\" is everything I hoped it would be.",
        "content": "Season 1 Episode 1 of \"This title is not available to watch instantly. Please try another title.\" is everything I hoped it would be. I'm bing watching it now.",
        "upvotes": 79,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1kyrzzv/season_1_episode_1_of_this_title_is_not_available/"
    },
    {
        "id": "1kyrvmj",
        "author": "ZirfyGaming2727",
        "title": "Error Code 2-0, \"This title is not available to watch instantly. Please try another title.\"",
        "content": "It's on an Apple TV. I've already restarted Netflix, restarted the TV, and all that hullabaloo. It still gives me the same answer. Somebody please help me, I just wanna watch Vinland Saga. \n\nWhy does technology hate me so\n\nEdit: They fixed it",
        "upvotes": 68,
        "comments": 60,
        "media": null,
        "permalink": "/r/netflix/comments/1kyrvmj/error_code_20_this_title_is_not_available_to/"
    },
    {
        "id": "1kyrxds",
        "author": "ZeroSwingy",
        "title": "Is anybody else getting the “the title is not available instantly” error?",
        "content": "Was watching a certain show and all of a sudden when i wanted to get to the next episode, the error popped up saying “the title is not available instantly”?",
        "upvotes": 54,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1kyrxds/is_anybody_else_getting_the_the_title_is_not/"
    },
    {
        "id": "1kys0st",
        "author": "Emergency-Garden8383",
        "title": "What is happening?",
        "content": "What is this Netflix? Why would you advertise something I can't watch? \n\nI went to watch a show and for whatever reason this keeps popping up, but I'm a little confused because I thought that everything that is advertised on Netflix is available to watch. \n\nDoes anyone have experience with this? ",
        "upvotes": 33,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1kys0st/what_is_happening/"
    },
    {
        "id": "1kynijb",
        "author": "ComradeRedsky",
        "title": "Ozark years later.",
        "content": "Way behind the times here I've just started Ozark, meant to start it during lockdown however watched breaking bad and narcos Mexico instead, some people put me off Ozark however I'm loving the characters and the slow build up of the story. Anyone  watched it, any views,,, don't tell me the ending of course..",
        "upvotes": 42,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1kynijb/ozark_years_later/"
    },
    {
        "id": "1kyryrw",
        "author": "Aardvarkinaviators",
        "title": "Hey, I have a quick question, does anyone know if Netflix has been removed from Netflix?",
        "content": "I was watching Netflix for the first time with family, and as we went from episode 4 to episode 5 we received an error message and we cannot pull it back up?",
        "upvotes": 20,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1kyryrw/hey_i_have_a_quick_question_does_anyone_know_if/"
    },
    {
        "id": "1kys63c",
        "author": "DeseanDaGoat",
        "title": "I think it's back up!",
        "content": "Anyone who's waiting for Netflix to come back, mine just came back on, so I think it's all set now.\n\nI'm in Canada though, I'm not entirely sure if it's up worldwide",
        "upvotes": 15,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1kys63c/i_think_its_back_up/"
    },
    {
        "id": "1kys3gz",
        "author": "Previous-Rip-7104",
        "title": "Netflix still down",
        "content": "It’s been a couple minutes has anybody figured out how to activate Netflix back up? Or is Netflix still working for some people please share whatever work for you if your Netflix is actively working ",
        "upvotes": 13,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1kys3gz/netflix_still_down/"
    },
    {
        "id": "1kys4j5",
        "author": "FunnyJudgment437",
        "title": "Issues",
        "content": "Is anyone else having issues 2iht their Netflix? I Googled and everything it says no widespread issues but I wanted to know if individuals are also experiencing these problems I even have screenshots. ",
        "upvotes": 12,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1kys4j5/issues/"
    },
    {
        "id": "1kyrq24",
        "author": "BizzyM",
        "title": "Everybody's Live with John Mulaney has gone missing.",
        "content": "I couldn't watch it live last night, so I'm trying to watch it tonight and the whole series is gone.  It's missing from my Continue Watching.  it's missing from My List.  And I can't find it in search.",
        "upvotes": 11,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1kyrq24/everybodys_live_with_john_mulaney_has_gone_missing/"
    },
    {
        "id": "1kys4ew",
        "author": "theredmile0927",
        "title": "netflix down",
        "content": "Netflix not working on TV, some down detector sites report issues. wondering if it's been resolved yet. also is it just me or is this happening a LOT more recently, not only with Netflix but several other streaming services",
        "upvotes": 10,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kys4ew/netflix_down/"
    },
    {
        "id": "1ky84ax",
        "author": "theipaper",
        "title": "Dept Q is the best police procedural Netflix has ever made",
        "content": "",
        "upvotes": 129,
        "comments": 171,
        "media": null,
        "permalink": "/r/netflix/comments/1ky84ax/dept_q_is_the_best_police_procedural_netflix_has/"
    },
    {
        "id": "1kys6y4",
        "author": "Previous-Rip-7104",
        "title": "NETFLIX IS BACK UP",
        "content": "WERE FREE! Netflix is back up and running they didn’t waste no time fixing whatever the problem is I hope we all go back to enjoying our shows! We made it yall LMAO😂😂😂",
        "upvotes": 9,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kys6y4/netflix_is_back_up/"
    },
    {
        "id": "1kys273",
        "author": "Quiet_Aide6443",
        "title": "Netflix is updating its UI",
        "content": "Or at least it’s trying to. Obviously it’s failing. The new UI wont support Bandersnatch- which is why it had to go :/\n\nSo, not sure what to do until then. I guess Youtube it is.",
        "upvotes": 9,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1kys273/netflix_is_updating_its_ui/"
    },
    {
        "id": "1kys7dz",
        "author": "VoDkA__1999",
        "title": "Netflix is back for multiple people now!",
        "content": "If you're still having issues maybe try changing WiFi or swapping in between different shows! It was continously loading for me but then I swapped shows and it started working so I swapped back! Hope this helps anybody :3",
        "upvotes": 8,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1kys7dz/netflix_is_back_for_multiple_people_now/"
    },
    {
        "id": "1kyr6et",
        "author": "VixenSunburst",
        "title": "Netflix TV UI has changed - anyone else??",
        "content": "I personally hate it, things are too big and rounded now for no reason. Makes things much harder to look at, actually.\n\nMy phone's Netflix hasn't changed. If there is a way to revert it on TV, it'd be great to know. In the meantime I suppose I'll check to turn off auto-update on my phone. ",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kyr6et/netflix_tv_ui_has_changed_anyone_else/"
    },
    {
        "id": "1kyrzdv",
        "author": "grayking97",
        "title": "Dist. Q has disappeared",
        "content": "I watched an episode of Dist. Q this morning on Netflix. This evening, it’s gone. Does anyone know what happened to it? Tried searching for it in the app, nothing. Searched on google, it says all episodes for season 1 dropped today. Any ideas?",
        "upvotes": 7,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1kyrzdv/dist_q_has_disappeared/"
    },
    {
        "id": "1kyruzy",
        "author": "KittyKratt",
        "title": "Did Squid Game just leave Netflix, like just now?",
        "content": "I was just watching Season 2 of Squid Game on Netflix and it ended on the episode with the third game ...then the episode ended and I CANNOT FIND SQUID GAME ON NETFLIX. At all. I search for it, and the only \"Titles in: Squid Game\" are: \"Squid Game: The Challenge\", \"Squid Game: Fireplace\", \"Squid Game: Making Season 2\", and \"Making Squid Game: The Challenge\".\n\nI tried logging out and back in, restarting my browser and my computer. I am livid. The only option under Squid Game is under \"Your Next Watch\", and when I click on it, it does nothing except make the thumbnail larger with a little bell saying \"remind me\" and \"Final Seasons Coming June 27\". I can click on \"Episodes and Info\" but it does NOTHING. It shows NO episodes. WTF????",
        "upvotes": 7,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1kyruzy/did_squid_game_just_leave_netflix_like_just_now/"
    },
    {
        "id": "1kyowd1",
        "author": "jerkoff1610",
        "title": "How Netflix got James Lewis to finally speak about the Tylenol murders in new doc",
        "content": "Netflix released a new doc called Cold Case: The Tylenol Murders. It's about the 1982 case where seven people died after taking cyanide-laced Tylenol in the Chicago area. It's still unsolved, but the wild part is they got James Lewis, the only official suspect for decades, to finally talk on camera before he died. He was never charged for the murders, but did serve time for sending a ransom letter. He had refused every major interview, but he agreed to do this one. They gave him the space to talk about his side of the story.\n\nIt is sooo strange how no one thought about approaching him like this before. And if they did, why didn't he talk? It's so bizzare. ",
        "upvotes": 10,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kyowd1/how_netflix_got_james_lewis_to_finally_speak/"
    },
    {
        "id": "1kys4v4",
        "author": "oil_can_boyd69",
        "title": "Department Q in US???",
        "content": "I was just watching new release, finished episode 1, started ep 2, paused it…. And now it’s gone! Did they release by accident and then retract? I tried on Iipad and says not available in my area…?",
        "upvotes": 6,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1kys4v4/department_q_in_us/"
    },
    {
        "id": "1kys8mn",
        "author": "Friendly_francis",
        "title": "Where did deptQ go???",
        "content": "I started watching Dept Q starring matthew goode but it just disappeared and I can’t find it on Netflix. 😐 anyone else experiencing this or am I going crazy? ",
        "upvotes": 5,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1kys8mn/where_did_deptq_go/"
    },
    {
        "id": "1kys6wb",
        "author": "SnooApples9894",
        "title": "Is it just me or did the Netflix collectively decide to take a coffee break ☕💻 📺",
        "content": "Hey fellow streamers,\n\nHas anyone else encountered the error message \"Title not available to watch instantly\" on Netflix? I was in the middle of my binge session when this popped up, and it's been persistent ever since. Not sure if it's a widespread issue or just me.\n\nI've tried refreshing, logging out and back in, and even restarting my device, but no luck so far. Any insights or fixes would be greatly appreciated!\n\nThanks in advance!",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kys6wb/is_it_just_me_or_did_the_netflix_collectively/"
    },
    {
        "id": "1kyruz7",
        "author": "I_am_a_fishyy",
        "title": "Did Wednesday disappear for anyone else?",
        "content": "I was trying to watch Wednesday with my family, but it was gone. But we were watching the day before, and it wasn't gone. I searched it in the Roku search tab, and it went to Netflix, then it just said something like. \"This title isn't available to watch insanely try again later\" please help.      ",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kyruz7/did_wednesday_disappear_for_anyone_else/"
    },
    {
        "id": "1kys9eb",
        "author": "TeacherLeigh",
        "title": "Dept Q Disappeared",
        "content": "I was watching Dept Q, and after I watched the first two episodes, the entire series seems to have disappeared. It doesn’t come up at all anymore. Even when I search for it. Has anyone else experienced this? I was really enjoying it.",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kys9eb/dept_q_disappeared/"
    },
    {
        "id": "1kyrp94",
        "author": "Heavy_Mental76",
        "title": "Squid Game removed?",
        "content": "I was watching Squid Game last night and tonight (on S1E8, was going to start E9) but when I clicked to go to the next episode, Netflix instead started playing the first episode of The Rookie.  I tried refreshing, but Squid Game is gone from the Continue Watching section.  Seriously?",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1kyrp94/squid_game_removed/"
    }
]