[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 482,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1gsenwg",
        "author": "AutoModerator",
        "title": "JAKE PAUL v. MIKE TYSON Fight Megathread",
        "content": "&amp;#x200B;\n\nhttps://preview.redd.it/w8ywthvqp61e1.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=95e740ea33c09fcd4e8c898ea8b46958cd88635d",
        "upvotes": 113,
        "comments": 5803,
        "media": null,
        "permalink": "/r/netflix/comments/1gsenwg/jake_paul_v_mike_tyson_fight_megathread/"
    },
    {
        "id": "1gtwwjz",
        "author": "trevorlong",
        "title": "Mike Tyson and Jake Paul fight pushes Netflix online traffic to three times normal peak",
        "content": "",
        "upvotes": 72,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1gtwwjz/mike_tyson_and_jake_paul_fight_pushes_netflix/"
    },
    {
        "id": "1gts2m3",
        "author": "Any_Permission_8142",
        "title": "Why?",
        "content": "Why does netflix constantly recommend the same things to me over and over and over same exact movies and shows and alot that I've already watched. It makes it difficult to find new things and it drives me up a wall. ",
        "upvotes": 37,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1gts2m3/why/"
    },
    {
        "id": "1gu78ui",
        "author": "sisyphus_persists_m8",
        "title": "Cancelled shows",
        "content": "I'm really disappointed that NF canceled both Outer Range and Kaos.  \n\n  \nBoth were very unique, creative, well written, and well acted.   \n\n  \nI do not understand how shows of this quality are canceled, and yet Outer banks and Lincoln Lawyer, which both show zero uniqueness and creativity, live on.   \n\nI know there have been other series that users pushed hard for, that were picked up by other networks...\n\nIs there any hope of having these revived?? \n\n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gu78ui/cancelled_shows/"
    },
    {
        "id": "1gu6fx2",
        "author": "diofantos",
        "title": "Can remove creditcard without adding another form of payment ",
        "content": "uhhmmm.. So i just canceled my subscription cause the boxing stream was a total fail and for me at least (we dont have the same content on netflix like US for example) the content kinda sucks, very old and and not exciting.. So to make sure i dont get charged again, I wanted to remove my card from their site, cause I dont like them keeping my CC info when im not using the service.. However I cant remove it without adding another payment method.. So im wondering if the only way to remove my CC info from them is just to delete the account ?",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1gu6fx2/can_remove_creditcard_without_adding_another_form/"
    },
    {
        "id": "1gu4og4",
        "author": "Horror_Effective12",
        "title": "'The Law According to Lidia Poet' Season 2 Episode 6 - Review &amp; Ending Explained",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gu4og4/the_law_according_to_lidia_poet_season_2_episode/"
    },
    {
        "id": "1gu18rf",
        "author": "Wild-Commission-9077",
        "title": "Boy swallow universe curiousity : spoiler",
        "content": "Am i understanding it right?\n\nSo Lyle worked for Darrens mom,\nBut he stoled some portion, \nSo he was killed by Ivan Crole.\n\nEli went to Darren's mom to save him later but he was already dead, and maybe she wouldnt have helped anyway.\n\nBut still Eli befriend with Darren.(why)\nAnd Lyle had not told where the stuff, risking his life(just tell themTT), and left message to Eli' older brother. \n\nWhen Ivan asked whats the message, he didnt answer honestly even if his brothers finger was about to be cut(why).\n\nWhen Eli found the stuff back, he went to Darren and try selling it when it was stolen one from her mom's stuff.\nAnd weirdly darren paid 50000bucks for it anyhow....(why)\n\n\n\n\nYet on epi5 but cant understand ....",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gu18rf/boy_swallow_universe_curiousity_spoiler/"
    },
    {
        "id": "1gu0x2v",
        "author": "DataPastor",
        "title": "Does Netflix plan to add back the downloading capability to Netflix Windows ARM app?",
        "content": "I love to watch Netflix series on the go on my Surface Pro 11 tablet, but as of July/2024 it lost its downloading capability. Do they plan to put it back?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gu0x2v/does_netflix_plan_to_add_back_the_downloading/"
    },
    {
        "id": "1gu0wnk",
        "author": "Armadillo_Prudent",
        "title": "Has anyone here encountered this problem?",
        "content": "I just got a new TV and a chromecast. Netflix can't connect to my network on either the chromecast nor my playstation 4, yet all other apps on both devices can connect just fine *and* Netflix works just fine on both my phone and tablet, both of which are connected to the same network as my chromecast and PS4. On the playstation, I sometimes error code nw-6-408 and sometimes nw-2-5, on the chromecast I get nw-6-408 until I troubleshoot, at which point I get code ui-113.\n\nThis is frustrating AF.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gu0wnk/has_anyone_here_encountered_this_problem/"
    },
    {
        "id": "1gtsoa8",
        "author": "DigComplex4933",
        "title": "Series to watch while doing other stuff",
        "content": "\nI like to watch series/listen podcast while drawing, cuting my nails, brushing teeth...\nwhich series is the best?\n\nI don't like stuff like the office, greys anatomy, friends, modern family....",
        "upvotes": 4,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1gtsoa8/series_to_watch_while_doing_other_stuff/"
    },
    {
        "id": "1gttnxk",
        "author": "NonVeggieRaccoon",
        "title": "Audio keeps switching back to English ",
        "content": "I'm watching a Korean show with English subtitles because the dub sucks real bad, and every time it goes to the next episode or switches back to English audio. How can I stop this? ",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1gttnxk/audio_keeps_switching_back_to_english/"
    },
    {
        "id": "1gtqa57",
        "author": "Loxer150",
        "title": "Error signing in SPECIFICALLY ONLY for the Netflix mobile app",
        "content": "i just bought my own account after only using someone else’s but i can’t sign in on the netflix ios app. either says “incorrect password” (it’s correct) or “something went wrong” \n\nthis happens only on the app. signing in using safari and other devices work fine. i’ve tried every solution possible, from resetting passwords multiple times to reinstalling the app, but it’s useless. \n\ncustomer service is useless too. they merely repeat the same generic solutions. pretty much just saying “turn it on and off again”. \n\nhowever, the help center did detect that im having a problem. it says “Netflix Error tvq-prfls-101” which means old data on my device needs to be refreshed. but i’ve deleted and reinstalled it again. saved passwords from the account i borrowed were also deleted. old data should be gone.\n\nso this is just frustrating since i’ve already paid for my account. add to the fact that netflix themselves dont seem to know what’s going on either.",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1gtqa57/error_signing_in_specifically_only_for_the/"
    },
    {
        "id": "1gu0ply",
        "author": "ummmm2002",
        "title": "Netflix and tiktok (about arcane)",
        "content": "So I watched the last ep of arcane act 2 today and after I finished it and went to tiktok and there were a bunch of videos about the big thing that happens in the ep. Before today I didn't see a single spoiler even though it's been out for 2 or 3 days and the videos that were popping up were from 2 or 3 days ago. I was wondering if Netflix figured out a way to restrict spoilers from being recommended on your fyp until after you finished the ep/series.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gu0ply/netflix_and_tiktok_about_arcane/"
    },
    {
        "id": "1gscas1",
        "author": "TheDean242",
        "title": "Crap quality for the fight ",
        "content": "Anyone else having this issue? I’m at 720 or worse. I have fiber and no one else is using my internet. I’m guessing the Netflix servers are overloaded. \n\nEdit: now the app is gaslighting me. It’s saying I have no internet connection. I do. I have great connection. \n\nEdit 2: now it shows me 15-20 seconds of the last round of the Taylor vs Serrano fight then tosses me out. It does this a few times then it starts me back at the beginning. I’m guessing the entire event is over at this point. I’m pissed. They have to do better. They have to make this right. I’m never watching a live stream on Netflix again.",
        "upvotes": 22394,
        "comments": 6015,
        "media": null,
        "permalink": "/r/netflix/comments/1gscas1/crap_quality_for_the_fight/"
    },
    {
        "id": "1gtrxik",
        "author": "UniqueBuilding7524",
        "title": "Alien Investigation: Rory the archeologist has such great outerwear?",
        "content": "That's it really. This post is here to commemorate the rock solid fashion choices of the archeologist, whose patterned fleece was really working. His quilted black puffy one? Also immaculate.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gtrxik/alien_investigation_rory_the_archeologist_has/"
    },
    {
        "id": "1gtkg3b",
        "author": "StrongLongLegs",
        "title": "It’s What’s Inside….opinions???",
        "content": "I recently watched this movie and thought it was honestly really good. the storyline was intriguing and unpredictable (at some points), but I really liked the camera work when they were tripping out, it made me question if I was the one seeing things lol",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gtkg3b/its_whats_insideopinions/"
    },
    {
        "id": "1gtvc1z",
        "author": "IHaveTheBestOpinions",
        "title": "Netflx app defaulting to foreign language and I can't make it stop",
        "content": "A week or so ago I thought it might be fun to watch a show in portuguese for a few minutes. Big mistake, apparently, because after making that change one time, every single movie or show that I start has portuguese audio and subtitles, and I have to change it back to english. Every. Single. Time.\n\nThe PS5 app doesn't have any \"default language\" settings that I can find, aside from one on the show page that seems to be specific to that show. Of course, changing this to english doesn't stick - every time I come back to a show it has been changed back to portuguese.\n\nMy phone app does have a \"Manage Profiles\" option which allows me to select a language. I changed this to english. In fact, I have changed it to english several times over the last few days, and it keeps changing itself back to portuguese.\n\nThe \"Manage Profiles\" option on the netflix website also has a language option, though this appears to impact the menus rather than the in-show audio. This has been english all along and has not changed.\n\nI have tried logging out and logging back in. I have deleted the app from my devices and redownloaded it. I have logged out of ALL devices and changed everything I could back to english. Nothing changes. On every device, everything always defaults back to portuguese. It's driving me insane.\n\nHas anyone else had a problem like this? Am I missing a hidden setting somewhere? Or do I just have to accept my fate and learn portuguese to continue using Netflix?\n\nEDIT: after some more experimentation I have managed to get to a place where movies play in english, but shows still play in portuguese. This makes even less sense to me, but I guess it's a slight improvement?",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1gtvc1z/netflx_app_defaulting_to_foreign_language_and_i/"
    },
    {
        "id": "1gu5sv4",
        "author": "Serious--Vacation",
        "title": "Please keep the boxing discussions to /r/boxing",
        "content": "There are a lot of people who don’t follow boxing who saw some matches via Netflix. I was one of those. However, this is /r/Netflix not /r/boxing. \n\nWant discuss the crappy stream, the horrible commentary, or the promotion of the fight(s)? Those are Netflix issues. Want to discuss the fight itself? You’re going to get better discussion at /r/boxing.",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1gu5sv4/please_keep_the_boxing_discussions_to_rboxing/"
    },
    {
        "id": "1gtlzro",
        "author": "Jconley123",
        "title": "Subtitles wont stop",
        "content": "I am trying to turn off the subtitles but no matter where I do it from it only stays off for the 1 show or movie. I have turned them off i. The account profile, turned them off in the tv shows main page and also every episode I have to turn them off. Any idea why they keep coming back?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gtlzro/subtitles_wont_stop/"
    },
    {
        "id": "1gscer9",
        "author": "CurrentLeather6751",
        "title": "Fight buffering",
        "content": "Everyone was saying there wouldn’t be issues, and clearly they’re happening. The main fight is going to be so much worse. This is what happens when you monopolize a stream and only let one platform stream a giant event. ",
        "upvotes": 4295,
        "comments": 1545,
        "media": null,
        "permalink": "/r/netflix/comments/1gscer9/fight_buffering/"
    },
    {
        "id": "1gu3yrw",
        "author": "nurse0813",
        "title": "Who else cancelled Netflix?",
        "content": "I spoke to customer service for drug around in circles. No compensation. Cancelled. Wondering who else did. Hit ‘em where it hurts. There $$ could this be a breach of contract? I’m talking out my ass now but class action lawsuit? (Note I know nothing of this stuff) just curious ",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1gu3yrw/who_else_cancelled_netflix/"
    },
    {
        "id": "1gsgeon",
        "author": "Takasuya",
        "title": "This was the most dissapointing fight I had ever witnessed in my life.",
        "content": "Keep in mind I'm from Europe. So, before all the crap even occured, I had to stay up to 5 AM IN THE MORNING. \n\nFirst of all, worst streaming experience I had to endure. But the thing is, I was fighting to keep the stream back up for my life because I REALLY WANTED TO WATCH THIS FIGHT!\n\nAND THE FIGHT?!\n\nIT WAS MORE DISSAPOINTING THAN THE S$#T SHOW THAT WAS THE STREAM. THE MOST TIME-WASTEFUL,  BORING-ASS LET DOWN OF AN EVENT I HAD EVER SEEN. I'D GET MORE ACTION WATCHING WALL DRY. \n\nReality is often dissapointing. ",
        "upvotes": 1680,
        "comments": 405,
        "media": null,
        "permalink": "/r/netflix/comments/1gsgeon/this_was_the_most_dissapointing_fight_i_had_ever/"
    },
    {
        "id": "1gtoczs",
        "author": "iamanswerzequestion",
        "title": "Hellbound - What are the reasons for the decrees?",
        "content": "Was it ever explained in season 2 or the webtoon as to what reasons people are being banished to hell for? It was especially confusing at the end when thousands of cops, cult members, and bystanders alike started getting their decrees to hell. Has there ever been an actual reasoning revealed behind it? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gtoczs/hellbound_what_are_the_reasons_for_the_decrees/"
    },
    {
        "id": "1gscowi",
        "author": "GlobalLifeguard8928",
        "title": "Netflix is not ready to stream live sports",
        "content": "The fight is rendered unwatchable due to all of the streaming problems I have been experiencing. What a bust. I see that I am not the only one. This is a bad start for Netflix.\n\nMaybe I am taking it all back, Barrios vs Ramos is very good. ",
        "upvotes": 3049,
        "comments": 368,
        "media": null,
        "permalink": "/r/netflix/comments/1gscowi/netflix_is_not_ready_to_stream_live_sports/"
    },
    {
        "id": "1gspt77",
        "author": "Shaggy_San",
        "title": "Arena booing Tyson and Paul",
        "content": "Netflix couldn’t mute the boos enough. After round 3 the crowd was HEAVILY booing during and after each round. They did do live audio edits where they turn down the sound of the boos and pipe some cheers in, but it wasn’t enough. I noticed a few articles spin it as “Tyson fans boo Jake Paul’s win.” That’s just not true they were booing the lie they were sold. Everyone was very disappointed with the fight from both fighters. If you look at Tyson’s walk out you can see it all over his face he already knows everyone is about to see this lie they were selling. He looks worrying or sad, not about the fight, but what everyone is about to see.\nI’d go as far to say that someone should get sued for this. They advertise the fight as being real and all out. Leading up to the fight both sides are saying how ready and how crazy of a battle it’s going to be. ALL FALSE ADVERTISING. Then the entire time they are CLEARLY signaling to each other. Looked up Mike Tyson glove biting habit? Not a single picture last night. Maybe they’ll surface soon? Plenty of times Paul had the upper hand and could’ve lit Tyson up. It was a joke. He could’ve easily had the knockout. I don’t gamble, but I could imagine people going into this betting expecting a real fight, and seeing this as infuriating.",
        "upvotes": 197,
        "comments": 66,
        "media": null,
        "permalink": "/r/netflix/comments/1gspt77/arena_booing_tyson_and_paul/"
    },
    {
        "id": "1gscjg3",
        "author": "Bolt_McHardsteel",
        "title": "Worldwide buffering issues…",
        "content": "Three rounds into the first fight on the Tyson - Paul undercard and Netflix is having massive buffering issues everywhere it appears.\n\nThis could be a fail of epic proportions if they don’t figure this out very quickly. SMH. ",
        "upvotes": 1892,
        "comments": 972,
        "media": null,
        "permalink": "/r/netflix/comments/1gscjg3/worldwide_buffering_issues/"
    },
    {
        "id": "1gt461j",
        "author": "K-Z-O",
        "title": "Why Netflix’s Marco Polo Series was Peak and Deserves a Third Season",
        "content": "Alright, hear me out. Netflix’s Marco Polo was actually one of the most underrated gems out there. The production quality? Insane. The characters? Iconic. The potential? ENDLESS. We’re talking Game of Thrones-level world-building, but with Mongolian steppes and Silk Road intrigue instead of dragons (no hate to dragons, but Kublai Khan was his own kind of beast). Let’s dive into why this show was pure peak and why Netflix really owes us a Season 3.\n\nFirst up, Marco and Jingim’s dynamic was one for the ages. I mean, c’mon—Marco, the Italian outsider, and Jingim, the heir to the Khanate? It wasn’t just a classic “buddies who can’t stand each other” thing; it was like watching two people who knew they had to learn from each other to survive. Marco’s worldview and knowledge from the West gave Jingim a different perspective, and vice versa. But it wasn’t some sappy bromance—they constantly had that “are we enemies or are we brothers?” vibe. Watching their grudging respect evolve was actually satisfying AF.\n\nThen we had Byamba, Kublai’s other son, who was a straight-up wild card. Byamba was that guy who could’ve gone either way—totally loyal one minute, ready to throw it all away the next. He’s got Kublai’s blood, but he’s way more rebellious and has no interest in all the traditional rules that Jingim is bound by. His interactions with Marco had this “unlikely allies” energy, like they both understood what it felt like to be outsiders, even if for different reasons. Honestly, Marco kind of needed both of these relationships to survive Kublai’s court; Jingim taught him loyalty, and Byamba taught him adaptability.\n\nAlso, let’s talk Kublai Khan. This guy wasn’t just a brutal conqueror; he was a super complex ruler who respected Marco but also low-key saw him as a threat. I mean, that relationship? Tense. Kublai was like, “I could kill you in a heartbeat, but hey, you’re kind of useful.” He was layered, not just some caricature of a leader, which made his scenes all the more intense. Marco Polo didn’t shy away from showing how every decision Kublai made was about holding onto power, balancing loyalty, and maintaining family connections. He was ruthless, sure, but relatable? Weirdly, yes. By Season 2, I was more invested in his life than Marco’s half the time.\n\nAnd can we talk about Hundred Eyes? This man was easily one of the greatest mentors in any series. His wisdom, the way he balanced loyalty and his own sense of honor—it was all just legendary. He even got his own spin-off episode, which just proved how strong his character was. That spin-off was so good it felt like a teaser, but then…nothing. Like, c’mon Netflix, you gave us a taste, and then left us high and dry. There’s so much more we could’ve explored with him and his relationship with Marco and the whole “wise mentor” dynamic that made us care so much.\n\nThe series had serious potential for a Season 3. They left so many threads open! There was Marco’s return to Italy still looming, and the impact his years in the East would’ve had on him and, honestly, on Europe. Plus, the romance, political drama, the family feuds, and literal battles—it was like we were on the brink of watching the world change. We could’ve seen Jingim stepping up, Marco finding himself in his “real home” of the Khanate, Byamba stirring the pot in his own rebellious way, and Kublai facing enemies on all sides, both foreign and family. Don’t tell me Netflix doesn’t see the potential here—like, we all saw it!\n\nLook, if Netflix can greenlight five seasons of Emily in Paris, they can give us one more of Marco Polo. The fans are still here. Just scroll through the subreddits, the YouTube comments, the tweets—everyone’s STILL talking about it. Imagine the hype if they announced Season 3, how they could bring back that mix of historical drama, action, and stunning visuals (shoutout to those Mongolia scenes, BTW).\n\nIn conclusion, if you’re listening, Netflix: Marco Polo was peak TV. The show deserves a conclusion, the fans deserve closure, and honestly, we all deserve to see Kublai, Marco, Byamba, Jingim, and Hundred Eyes in action one last time. Bring it back for the culture.",
        "upvotes": 19,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1gt461j/why_netflixs_marco_polo_series_was_peak_and/"
    },
    {
        "id": "1gtjh7r",
        "author": "drkangel181",
        "title": "Am I the only one",
        "content": "Just curious if i'm the only one that loved Jupiter's Legacy, I know it's not as good as the boys,  But I thought it did a better job in that if people had superpowers, what would it be like?It's no near the violence and nudity the boy's had I just thought they did a better job with that premise.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1gtjh7r/am_i_the_only_one/"
    },
    {
        "id": "1gtwrx3",
        "author": "SallyCummings",
        "title": "Beyoncé Performing Halftime Show during Christmas Day NFL game live on Netflix",
        "content": "Netflix better figure out their live streamingitogether ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1gtwrx3/beyoncé_performing_halftime_show_during_christmas/"
    },
    {
        "id": "1gsgkex",
        "author": "Griswa",
        "title": "Netflix, you should ask Paul for 39.5 million back",
        "content": "This was the worst display of what anyone could call boxing. It was like watching kids spar in U10 ninja karate. I imagine if two drunk dudes fought in the middle of a quick mart in Oklahoma and filmed it, it would have been more entertaining. I would have rather watched  paint dry while eating uncooked hotdogs. Short of the fact I had to restart Netflix every 3 minutes to stop buffering my 800gb down speed internet. Now I am going to be exhausted. I hate you. ",
        "upvotes": 669,
        "comments": 154,
        "media": null,
        "permalink": "/r/netflix/comments/1gsgkex/netflix_you_should_ask_paul_for_395_million_back/"
    },
    {
        "id": "1gscloh",
        "author": "ThelastJasel",
        "title": "Booo Netflix boo",
        "content": "Get your shit together Netflix or refund this month. It is taking 7 min to load 3 seconds of fight that is two pixel blobs with zero human features. Boooooooo awful. \n\nEdit: Ok, it seems to be better now. I guess they heard with that overwhelming groundswell of 50 upvotes. \n\nEdit 2: I take my first edit back. Nonstop crashing awful quality. Boooooooo Netflix boo. Tried putting on something else perfect HD quality zero problems. Booo Netflix boo. Nonstop rate hikes and this is all you got? Refund the month, booo. \n\nEdit 3: Now you are lying to us by brining up screens that say it is our isp? Boooooooooooooooooooooooo! Lying and grifting. Refund the month. Booo Netflix booo. ",
        "upvotes": 1376,
        "comments": 64,
        "media": null,
        "permalink": "/r/netflix/comments/1gscloh/booo_netflix_boo/"
    }
]