[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 487,
        "comments": 258,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1ib9728",
        "author": "Whobitmyname",
        "title": "Carey Mulligan ‘Just Started’ Filming ‘Beef’ Season 2 and Says ‘Almost Everything’ Is Different",
        "content": "",
        "upvotes": 122,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1ib9728/carey_mulligan_just_started_filming_beef_season_2/"
    },
    {
        "id": "1ib5hvi",
        "author": "S4v1r1enCh0r4k",
        "title": "Some rumors claim that season 5 will be split into two parts, premiering in October/November 2025",
        "content": "",
        "upvotes": 28,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1ib5hvi/some_rumors_claim_that_season_5_will_be_split/"
    },
    {
        "id": "1iagsqk",
        "author": "cu_when_i_cu",
        "title": "Netflix will keep raising prices, they want you to downgrade because they make more money off ads.",
        "content": "Old DVD subscriber here, unsubscribed this weekend. Won't won't sign back up until there's a number of shows to watch, binge and then disconnect again.",
        "upvotes": 482,
        "comments": 93,
        "media": null,
        "permalink": "/r/netflix/comments/1iagsqk/netflix_will_keep_raising_prices_they_want_you_to/"
    },
    {
        "id": "1ib31p2",
        "author": "techfinpro",
        "title": "Finn Wolfhard Says ‘Stranger Things’ Couldn’t Have Ended Better After ‘Lord of the Rings’ Style Year-Long Shoot; Last Day on Set Was ‘Incredibly Emotional’",
        "content": "",
        "upvotes": 15,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ib31p2/finn_wolfhard_says_stranger_things_couldnt_have/"
    },
    {
        "id": "1ib4mhr",
        "author": "Mindless-Library-763",
        "title": "Stop hating on normal shows - the night agent season 2",
        "content": "Hey, \nso I recently read a post about how awful the night agent season 2 was and honestly it wasn't that bad. Of course it's not perfect, but some of us are loving the show and because of hate posts all series are getting cancelled. I understand that people don't see the logic behind some stuff or that a character ist annoying. But oh my god... do you really think that every human being isn't at some point in their life annonying? It's realistic that Rose can't decide if she wants to stay or to go. Every normal human would act like that. But for some reason you guys always want some perfect series with perfect plot and perfect people. It's just a show. Don't take it so serious. \nYou can criticize it, but come on, they didn't want an oscar for the night agent. \nIn the end of the day, I want to escape my real life, watch a show and forget about my problems. But because some people think they are smarter and better than everyone, my comfort shows are always getting cancelled.",
        "upvotes": 14,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1ib4mhr/stop_hating_on_normal_shows_the_night_agent/"
    },
    {
        "id": "1ia3wns",
        "author": "krazykatz911",
        "title": "Cancelling after 20 years",
        "content": "Price increase again.   $24.99 a month.  $300 a year.  Just plain ripoffs.  \n\nI’ve been a customer for 20 years.  Never again.  \n\nThe content is garbage.  \n\nA lot of the shows/movies are in different languages.  Which is fine but allow the user to select what languages they only want to see.  Not mix it all together and you have to start playing it to find out. \n\nA lot are old and available free on prime anyway.  \n\nThey keep raising the rates like it’s something people can’t live without. \n\nI got 4 streaming services for less than half of what Netflix wants a year. \n\nGoodbye greedy Netflix. ",
        "upvotes": 2937,
        "comments": 519,
        "media": null,
        "permalink": "/r/netflix/comments/1ia3wns/cancelling_after_20_years/"
    },
    {
        "id": "1iafu8x",
        "author": "johnppd",
        "title": "Netflix won the streaming wars, and we’re all about to pay for it",
        "content": "",
        "upvotes": 318,
        "comments": 146,
        "media": null,
        "permalink": "/r/netflix/comments/1iafu8x/netflix_won_the_streaming_wars_and_were_all_about/"
    },
    {
        "id": "1ibc4vz",
        "author": "Ciaruhhh",
        "title": "price change",
        "content": "premium is now going from $24.99 to $33.98 PRE TAX. why on gods green earth does it even cost $24.99 to even raise to $33.98?! how much longer until we are charged the amount of a cable or internet bill??? this is utterly ridiculous. are you including live tv with this subscription?! i don’t pay but my boyfriend does bc he uses it the most. they don’t have to worry about losing him as a customer but im willing to bet their customer count is going to severely decrease &amp; backfire for taking advantage of their customers yet again. the amount of price increases over the years never made any sense. there’s nothing new or exciting released as a result of these multiple increases to benefit your customers unless im totally missing something on the app. how does everyone else feel about this? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ibc4vz/price_change/"
    },
    {
        "id": "1iav59m",
        "author": "darkdevilxy",
        "title": "Something like Dark and 1899.",
        "content": "Hi, can you guys please suggest me shows like Dark, 1899 and Three Body Problem. A big and mysterious event is slowly unraveled over the course of the series. Something with not more than 3 seasons.",
        "upvotes": 28,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1iav59m/something_like_dark_and_1899/"
    },
    {
        "id": "1ia2zgv",
        "author": "stellacampus",
        "title": "Anyone else think \"WTF is \"Emilia Pérez\"?\" when they saw 13 Oscar nominations?",
        "content": "Emilia Pérez got 13 Oscar nominations, more than any other movie, and I had never even heard of it until recently.  In all the time it's been on Netflix, I've never seen it suggested in any of the lists I've perused on my home page.  If I had seen it, I probably wouldn't have watched it - I mean it's a French movie, in Spanish only, about a trans gangster in Mexico, and it's a musical to boot.  Now of course I have to at least give it a shot!",
        "upvotes": 488,
        "comments": 82,
        "media": null,
        "permalink": "/r/netflix/comments/1ia2zgv/anyone_else_think_wtf_is_emilia_pérez_when_they/"
    },
    {
        "id": "1iamjxk",
        "author": "stelio_contos68",
        "title": "Consider pausing your subscription​",
        "content": "I enjoy a lot of the original conflict Netflix offers but I don't need twelve months of subscription to watch it. So, a couple times a year I go to account settings and pause my subscription. \n\nIf you're just looking for something to watch then use a free or cheap platform. If you like Netflix-specific content then subscribe but take a month off here and there.\n\nI know it's petty but it make me feel like I'm winning lol \n\nAlso, I downgraded to standard on the last price hike and didn't notice a difference.\n\nHow this helps someone.",
        "upvotes": 19,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1iamjxk/consider_pausing_your_subscription/"
    },
    {
        "id": "1ib4uye",
        "author": "der_user_55",
        "title": "2 adresses same person",
        "content": "So I have a Netflix account but when i am at my Patents (where i live on weekends) I cannot Access my own account. Thats ridiculous. Do i have to decide now whether I watch on weekends or Under the week?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ib4uye/2_adresses_same_person/"
    },
    {
        "id": "1iah0t1",
        "author": "Original2021",
        "title": "Night agent season 2 worked against the entire premise of the show",
        "content": "The entire show is built around a premise that a night agent is the most elite intelligence officer that exists. Yet Rose, with no training is running around meddling in highly sensitive missions. I couldn't even finish the season. Its obvious the writers wanted Rose to have a presence during the season but this made the plot unbelievable. It's too bad because the lead actor could  have easily carried the series without the other character helping him. ",
        "upvotes": 33,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1iah0t1/night_agent_season_2_worked_against_the_entire/"
    },
    {
        "id": "1iaylq2",
        "author": "Linariaa",
        "title": "Netflix being weird",
        "content": "Hello im from aus and netflix is being weird. It changed my mom’s profile pic and then deleted the shows im watching and are unfortunately not there anymore like what? They usually remind me that shows will no longer available at a certain date but it just fully removed all my shows like anime such as jujutsu kaisen and dandadan :&lt; is this a bug or something? \n\n",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1iaylq2/netflix_being_weird/"
    },
    {
        "id": "1ib4bfw",
        "author": "Shadow_Samurai9978",
        "title": "Help me find a series",
        "content": "This was a series of Horror genre, I vividly remember that soldiers went to a specific place, and it was not just soldiers, but iirc, it was the government who ordered them to do it, they touched or awakened or did smt to an underground cave they found and then after some time, some sort of zombie like creature start attacking them\n\nI would appreciate any help",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ib4bfw/help_me_find_a_series/"
    },
    {
        "id": "1ibbwep",
        "author": "Global-Risk-8898",
        "title": "Netflix picks up new movie over the weekend, is it a dud? WD Reviews Saturday Night",
        "content": "Just watched the newest Netflix movie Saturday Night for the first time. Not in love with it. Check out why and tell me what you thought of Saturday Night \nhttps://www.watchersdelight.com/post/watchers-delight-weekly-saturday-night-review",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ibbwep/netflix_picks_up_new_movie_over_the_weekend_is_it/"
    },
    {
        "id": "1iaq7yw",
        "author": "Emotional-Pop-4621",
        "title": "The night agent",
        "content": "It seems like rose is on the same page as some of us also",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iaq7yw/the_night_agent/"
    },
    {
        "id": "1ia2id7",
        "author": "HehroMaraFara",
        "title": "Night Agent Season 2 = Massive Disappointment",
        "content": "I loved the first season and did not expect much from it, which might have been key. \n\nI was hoping for more of the same understated approach with brief bursts of action and situational resolution. \n\nThis was not that. This was a convoluted mess of overly complicated ideas and plot lines, with random characters that are just an inch deep on development. I’m not even gonna mention the whole first couple of episodes of him being a basketball coach protecting a kid from an abduction. They sooooo loosely tied it in with the main story that they might as well of labeled it as the “Peter is a great guy, remember?” Prologue. \n\nThe story is generally boring. They made Rose sadly annoying and inexplicably demanding and entitled. It got so stupid and lost that the head of the program was forced to say, in literal dialogue “Night Agent missions often hit deadends” as if accidentally being caught on a hot mic trying to explain away why there are so many dumb unnecessary twists. \n\nWatch season one and pretend this doesn’t exist. ",
        "upvotes": 138,
        "comments": 186,
        "media": null,
        "permalink": "/r/netflix/comments/1ia2id7/night_agent_season_2_massive_disappointment/"
    },
    {
        "id": "1iappis",
        "author": "ExistanceIsKeyToLife",
        "title": "Drop your best drama shows!",
        "content": "I've really enjoyed Unorthodox, Maid, Caliphate, Yellowjackets, Baby Reindeer, Unbelievable, The Hijacking of Flight 601, Pantheon and The Mothers of Penguins, so I'm looking for similar vibes. I also liked Black Mirror (except for the last season), Love, Death and Robots and Blue Eye Samurai.\n\nGlow, Beef and The Glory were also decent watches.\n\nThanks in advance!",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iappis/drop_your_best_drama_shows/"
    },
    {
        "id": "1iapfqz",
        "author": "South_Advantage2461",
        "title": "Movies/Series suggestions",
        "content": "Okay so I watched Anne with an E and i loved it. I want to watch similar or even better movies or series romantic,fantasies, dramatic,old school and yea 🍒 on top if it's british so suggest me some. And yea I don't watch series that often I've only watched few and would like to watch more so movies appreciated and if series then I'll be thankful. ( I get bored easily and quit watching so please suggest me something which will grab all of my attention and get me excited  I prefer old school romance and delusional people in love)...",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iapfqz/moviesseries_suggestions/"
    },
    {
        "id": "1iaslmd",
        "author": "Joker_JG",
        "title": "Vikings no subs at certain points",
        "content": "Netflix always do this and its annoying. When they speak a foreign language they don't put the subs in those parts like they do on tv or box set. Vikings switch between English and other languages it's cool but it's pointless if you don't speak them ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1iaslmd/vikings_no_subs_at_certain_points/"
    },
    {
        "id": "1iax8da",
        "author": "zooMobMember",
        "title": "Need help if anyone knows",
        "content": "So when I watch Netflix on my Xbox, if I press the right stick in, a little time stamp pops up in the top left corner(don’t know if that’s the actual term or if anyone Is familiar with it just hoping so) and I’m wondering if there is a way to make it pop up on the Roku too?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iax8da/need_help_if_anyone_knows/"
    },
    {
        "id": "1ib07n0",
        "author": "Responsible-Bird-470",
        "title": "Night Agent S2",
        "content": "I actually enjoyed Season 1- kinda pulpy but very entertaining! Started watching season 2 and feel like the writing is mid, the sets are amateurish. I want to like it. Thoughts? Is it just me? ",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1ib07n0/night_agent_s2/"
    },
    {
        "id": "1ib4rk1",
        "author": "daily_mirror",
        "title": "Netflix's new 'next level' competition series has 'genuinely terrifying' aspect",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ib4rk1/netflixs_new_next_level_competition_series_has/"
    },
    {
        "id": "1iaytgl",
        "author": "DewdropTeacup",
        "title": "Uppimg prices so often but always have issues",
        "content": "They keep cutting me off mid episode because there was an \"issue\", but they want me to pay more? Girl I already sit through ads to not pay 20 whole canadian dollars a month, the least they could do is let ads be the only interruption.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iaytgl/uppimg_prices_so_often_but_always_have_issues/"
    },
    {
        "id": "1iasceu",
        "author": "onlyeckles_",
        "title": "Kicked out on all devices - can't find active account to log back in",
        "content": "So we went to watch netflix tonight, and have been logged out of the app on the TV.  We tried to log back in but couldn't remember the password, checked on our phones and have been logged out there also.\n\nPassword has been reset, but now when logging in we get a 'Finish signing up to start watching' page, when we're been subscribers for years and most recent payment was less than a month ago.\n\nAny idea what's happened or might be causing this?  Don't wanna just follow the finish signing up process and end up paying 2 subscriptions 🤷🏼",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iasceu/kicked_out_on_all_devices_cant_find_active/"
    },
    {
        "id": "1iam7nv",
        "author": "OrthodoxPrussia",
        "title": "English subtitles not available in my location?",
        "content": "Not US. English subs are usually available for TV shows, but I've started watching an anime and they're not there, only local subs and a neighour country, and Japanese. I tried changing the language settings for no effect. The subs in the local language are really bad, and sometimes I'm somewhere I don't speak the language at all. \n\nAnything I can do to add English subs to the sub list. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iam7nv/english_subtitles_not_available_in_my_location/"
    },
    {
        "id": "1iam60w",
        "author": "s168501",
        "title": "Choose love 2023 Poland",
        "content": "So I've heard about these interactive movies recently and wanted to give a try out for the one in the title... I cannot open it though now... I am based in PL. Is it avaialable only in US? \n\nKind regards, thanks\n\nhttps://preview.redd.it/z1z1ylx0tdfe1.png?width=2096&amp;format=png&amp;auto=webp&amp;s=5f0c6974165eb190e3bb712cebb9ea055a749357\n\n",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iam60w/choose_love_2023_poland/"
    },
    {
        "id": "1ib0qbi",
        "author": "chiptrager",
        "title": "American Primeval is a bit overrated",
        "content": "A bit disappointed with the show after seeing the hype it was getting on here. It was definitely enjoyable and worth the watch. The production value was pretty good. The massacre scene was awesome and terrifying. I loved the dialogue. Some of the performances were really excellent, particularly Captain Edmund, Bridger, and Virgil characters I thought were really strong. The conflict between the Mormons, US Govt, Native tribes, and the townsfolk was really interesting and imo should’ve been the focal point of the show. \n\nThe main story following Isaac, Sarah, and the kids was very weak. Their decisions constantly did not make sense. Isaac would’ve got on his horse and said “see ya” the very first time the mom almost got them killed, and certainly 3 or 4 times later. Sarah would not have acted so defiant to Isaac’s instructions, especially considering he is a professional outlaw and she established immediately that she is scared and out of her depth in the wild west. The only strong acting out of that group imo was the boy. Other than that the writing on their whole plot line was messy. When they shoehorned in the love story in the 11th hour I actually rolled my eyes lol. \n\nAll in all it was a good watch that I don’t regret. Just a shame as it was so close to being great. ",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1ib0qbi/american_primeval_is_a_bit_overrated/"
    },
    {
        "id": "1iaeo5m",
        "author": "katheryn_gamer_girl",
        "title": "household questions",
        "content": "hii\n\nSo I used to live in Philippines for a year and half and setup my Netflix account there because I have a girlfriend and we share the account and I opened on June 2022\n\nI had to return home to the states in Nov 2023 and it didn't give my girlfriend a temporary access code until Nov or Oct 2024 and I gave it to her and I stopped using Netflix at that point and she is the one mainly using it now\n\nmy question is I logged in yesterday and started watching a movie I can only find on Netflix, will my girlfriend still get a temporary code again or will I or will the systems not even notice?\n\nI checked and she had logged in after I had watched last and the temporary code would be sent to me if she tried to log in for a temporary duration but that never happened \n\nThanks!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iaeo5m/household_questions/"
    }
]