[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 484,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1gsenwg",
        "author": "AutoModerator",
        "title": "JAKE PAUL v. MIKE TYSON Fight Megathread",
        "content": "&amp;#x200B;\n\nhttps://preview.redd.it/w8ywthvqp61e1.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=95e740ea33c09fcd4e8c898ea8b46958cd88635d",
        "upvotes": 113,
        "comments": 5799,
        "media": null,
        "permalink": "/r/netflix/comments/1gsenwg/jake_paul_v_mike_tyson_fight_megathread/"
    },
    {
        "id": "1gunedr",
        "author": "stratogod",
        "title": "Complete silence from Netflix",
        "content": "Has anyone seen any acknowledgement or apology for the shit show Tyson stream?  I've asked a handful of people that I know that tried to watch it and they all had issues... These people lived in different areas of the US. It seems it was very widespread but Netflix is completely ignoring it and gaslighting us with how successful it was to not upset investors.  I guess they are not wanting to engage and hope it fizzles out while they correct internal issues before next stream, essentially making us beta testers.  \n\nI had friends over and spent an hour fucking with my home network thinking it was on my end until I saw others reporting issues.  It was beyond frustrating... then when it did work it looked like dog shit... I pay for 4k/HDR.  This is 2024, the scaling technology is there, yet they cut corners somewhere at the expense of its customers.  Oh well... cancelled just on principle. Ive been with them since early DVD delivery era.  Sorry, just ranting... tired of greedy corporations bending us over.  \n\nEDIT:  I should have included that they 'sort of' acknowledged it per the CTO to their EMPLOYEES... nothing publicly, at least not that I know of yet. \nhttps://x.com/markgurman/status/1857903507694915931",
        "upvotes": 148,
        "comments": 130,
        "media": null,
        "permalink": "/r/netflix/comments/1gunedr/complete_silence_from_netflix/"
    },
    {
        "id": "1guz6w5",
        "author": "quangbilly79",
        "title": "Can't find 4k/hdr content. Membership said \"You're an extra member on someone else's plan\"",
        "content": "Can anyone help me to confirm what is going on? I just got a Netflix account from a local merchant. He said that I could watch 4k HDR movies with that account. But I can't find any 4k or HDR content on Netflix.\n\nCan anyone confirm that the Arcane movie only has an HD option, or is there something wrong with my Netflix/Window/Android setting?\n\nhttps://preview.redd.it/3yqc3zj3iv1e1.png?width=885&amp;format=png&amp;auto=webp&amp;s=289700050acce8fe9c6c4bcc7f3c17a99833bc33\n\nTry to check the Membership info on the Account section but all I can find is  \n\"You're an extra member on someone else's plan: [**xxx@gmail.com**](mailto:xxx@gmail.com)**\"**  \nSo how do I find my current Plan? How do I know if I can watch HDR/4k or not?\n\nP/s: I can watch 4k hdr content on Youtube fine. I bought a new LG C4 Oled TV so I don't think DRM is a problem.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1guz6w5/cant_find_4khdr_content_membership_said_youre_an/"
    },
    {
        "id": "1guz6sg",
        "author": "quangbilly79",
        "title": "Can't find 4k/hdr content. Membership said \"You're an extra member on someone else's plan\"",
        "content": "Can anyone help me to confirm what is going on? I just got a Netflix account from a local merchant. He said that I could watch 4k HDR movies with that account. But I can't find any 4k or HDR content on Netflix.\n\nCan anyone confirm that the Arcane movie only has an HD option, or is there something wrong with my Netflix/Window/Android setting?\n\nhttps://preview.redd.it/3yqc3zj3iv1e1.png?width=885&amp;format=png&amp;auto=webp&amp;s=289700050acce8fe9c6c4bcc7f3c17a99833bc33\n\nTry to check the Membership info on the Account section but all I can find is  \n\"You're an extra member on someone else's plan: [**pascual.compagnoni@gmail.com**](mailto:pascual.compagnoni@gmail.com)**\"**  \nSo how do I find my current Plan? How do I know if I can watch HDR/4k or not?\n\nP/S: The merchant said the main account can watch 4k/HDR so the child account can too. He said it's either the TV setting problem, the internet problem (My TV using wifi), the content is not 4k/hd problem (I don't know, everything show HD to me), the browser problem (but I checked on TV Netflix app too),... but not the account problem.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1guz6sg/cant_find_4khdr_content_membership_said_youre_an/"
    },
    {
        "id": "1guz0dc",
        "author": "MysteriousDelay6266",
        "title": "The Leopard (Italy) | Period Drama | Netflix in 2025",
        "content": "[THE LEOPARD \\/ IL GATTOPARDO \\(Italy\\) - Netflix in 2025](https://preview.redd.it/bcpffu06hv1e1.png?width=1299&amp;format=png&amp;auto=webp&amp;s=4a37a14a04f5f1966bbe894b6ced72279a284f27)\n\nBased on what many consider to be one of the greatest Italian novels of all time, The Leopard is a dazzlingly sensuous epic, set against the backdrop of revolution in 1860s Sicily. At its heart is Don Fabrizio Corbera, the Prince of Salina, who leads a life surrounded by beauty and privilege. But as Italy moves towards unification and the old aristocratic order is threatened, he realizes that his family’s future is in jeopardy. New allegiances must be made, each one a threat to his principles. Eventually Don Fabrizio is faced with an impossible choice. He has the power to engineer a marriage, between the rich and beautiful Angelica and his nephew Tancredi, that could secure his family’s legacy but, doing so would break his favorite daughter, Concetta’s heart. The series will be a modern exploration of timeless themes — power, love, and the cost of progress.\n\nDIRECTOR: Tom Shankland, Giuseppe Capotondi, Laura Luchetti  \nWRITER: Richard Warlow, Benji Walters  \nBASED ON THE BOOK: The Leopard (Original Title: Il Gattopardo) by Giuseppe Tomasi di Lampedusa\n\nKEY CAST: Kim Rossi Stuart, Benedetta Porcaroli, Deva Cassel, Saul Nanni\n\nTEASER: [https://www.youtube.com/watch?v=k0DS9ERfLjk](https://www.youtube.com/watch?v=k0DS9ERfLjk)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1guz0dc/the_leopard_italy_period_drama_netflix_in_2025/"
    },
    {
        "id": "1guwgqg",
        "author": "Delta-Dubs",
        "title": "Question from a UK user. Why only 65 episodes of batman the animated series?",
        "content": "Ignore this text. This is just here to fill out the one hundred and fifty character limit. It sucks I have to type this just to fill out a character limit so I'll ask this. Ŵhy impose a character limit? Why Netflix reddit? WHY?!!!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1guwgqg/question_from_a_uk_user_why_only_65_episodes_of/"
    },
    {
        "id": "1guvsys",
        "author": "Spurdaniel123",
        "title": "Download doesn't work",
        "content": "Recently, I've wanted to download a few episodes of a series onto my mobile, but I couldn't because it said there were downloads on too many devices (I have the lowest subscription tear, so it only works for one device). I found the device on which there were downloads and I deleted them. Afterwards, I tried to download the episodes on my mobile again, but the same message popped up. I've even waited, but more than 12 hours have passed and it still doesn't work.\nDoes somebody know what to do?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1guvsys/download_doesnt_work/"
    },
    {
        "id": "1gunj7h",
        "author": "Kakaroto777",
        "title": "How to correctly adjust the option \"tv animation effects\"",
        "content": "Hi.  I was recently browsing through the Netflix options, and found in my profile a new option \"TV Animation effects\".  Tried to Google how to enable or disable but just found people with the same question as me.  In Youtube and a couple of websites, it says that to \"reduce animation effects when navigating on tv\" to put a check mark in the empty box. That seems pretty straight forward.  But in my account, under my profile, it says \"TV animation effects\" and under \"Reduce motion transitions\"  At the right side there is no box for a check mark, but a toggle, that is either gray with a minus \"-\" sign or if clicked again, it turns blue with a check mark sign.   Does the check mark still means that transitions are reduced, or since is blue with the checkmark that transitions are actually enabled and can be seen?",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gunj7h/how_to_correctly_adjust_the_option_tv_animation/"
    },
    {
        "id": "1guuncq",
        "author": "Wombo931",
        "title": "Looking for a show to watch? List of 5 of the best shows I have seen",
        "content": "People around me tell me that I give the best recommendations for shows and movies. You can basically be sure that whatever I recommend to you will not be in vain, and you'll likely share similar feelings to mine. I take a lot of pride in the fact that people respect the recommendations I give, along with the thoughts I share about a show or film. So, I refuse to do anything that might jeopardize that. Below is a list of shows (in no particular order) that I hold in the same regard as *Breaking Bad* (not all of the recommendations I give right now will have similar plots to *Breaking Bad*, such as drug dealing or gangs, but some will). Also, I am FAR FROM a good writer. So my writing may be a bit sloppy, or bland... but just trust me that these are some of the best shows you can watch. Each of them had a similar factor. I got extremely in to them to the point I would stand up, cry, or talk to the TV; and I basically watched most of them in a few sittings if not one alone. You will won't be bored for a while if you go through this list and watch each one. Here we go though!\n\n1. **Snowfall** 8/10 A solid show. It starts off feeling a bit cheesy with the acting and something about Franklin felt goofy to me at the start. However, the character development is outstanding, and the actors seem to find their footing as the show progresses. Take my criticism with a grain of salt because the show is definitely not a slow burn. It starts strong and captivating, only continuing to get better (until season 4).\n2. **3%** 9.5/10 A phenomenal show, truly a hidden gem, and in my opinion, the king of hidden gems. If a show truly deserves a 10/10 rating, this is one of the few that comes close. Some of the best acting I’ve ever seen, with exceptional character development. I became so attached to some characters and truly despised others. What makes the show unique is that there isn’t a clear \"good guy/bad guy\" dynamic. While the show guides you toward who you’re supposed to root for, you can still choose your own \"home team\" without having your experience ruined. The show excels in its realism—real in the way people react to events and situations. It provides a genuine depiction of what the world could be like, even in its dystopian setting. There isn't much \"evil\"; instead, you see people doing what they think is right, even if others view their actions as evil. I watched it in its original Portuguese because the dubbed English version didn’t do justice to the actors' performances—and frankly, it was poorly done, as most English dubs are. The show is filled with twists and turns, and it's almost never predictable. An incredible mind-bender of a show.\n3. **Ozark** 8/10 Another strong show. For some reason, I tried starting it about four times before I finally got into it—I can't remember why. This show excels in almost all aspects: plot, acting, character development, and twists that are far from predictable. The pacing is smooth, and the plot is captivating. There are moments where you notice something but don’t think much of it, only to realize how pivotal it was 30 episodes later. I love shows with well-written foreshadowing, and *Ozark* is one of them.\n4. **Attack on Titan** 9.5/10 I understand not everyone is into anime, but I truly believe anyone can watch *Attack on Titan* and love it. In my opinion, it’s one of (if not *the*) greatest stories ever told. It doesn’t rely on typical anime clichés like over-the-top humor or fan service. The acting is great (both the sub and dub, although the sub is infinitely better), and it feels like regular TV—despite being animated. The first episode grabs your attention in a huge way. While the show might seem a bit slow after that, be patient—the first season is just laying the foundation. I wouldn’t call it a slow burn, but the first season is one of the less captivating ones. Once you reach the middle of the third season, nearly every episode has you on the edge of your seat. Not many shows can make me stand up or talk to the TV, but *Attack on Titan* did it repeatedly. It’s one of the most well-written shows of all time, with incredible foreshadowing, mind-blowing twists, and unforgettable characters. It explores the gray areas of good and evil in a way few shows do. The second half of the series is almost a new show, yet it still feels like the same one. It's hard to explain, but you’ll understand if you watch it. This show has everything to be peak fiction—nothing is missing. The ending was set from the very beginning, which is rare in storytelling. Every storyline and loose end is tied up in a way that’s incredibly satisfying. I cried multiple times and had my mind blown on more than one occasion. SO many twists. A perfect show.\n5. **White Lotus** 8.5/10 Another hit. I don’t typically enjoy comedies or shows that try too hard to be funny (not that I’d call *White Lotus* a comedy), because more often than not, I find them forced and unfunny. But this show had me laughing on several occasions. It doesn't let the humorous moments overshadow the overall tone of the show, nor does it detract from its urgency or seriousness. The show portrays society and the human psyche in a way that feels incredibly real. Throughout, you feel as though you’re watching a story that could happen in real life, even though the events are outrageous. The characters' reactions to events make sense, and I found myself comparing them to people I know. The acting is excellent, and each character feels authentic. At times, I was amazed at how much they resembled real people—not in appearance, but in their actions. It’s over the top at times, but never to the point where it feels unreal. A remarkable show.",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1guuncq/looking_for_a_show_to_watch_list_of_5_of_the_best/"
    },
    {
        "id": "1gtwwjz",
        "author": "trevorlong",
        "title": "Mike Tyson and Jake Paul fight pushes Netflix online traffic to three times normal peak",
        "content": "",
        "upvotes": 143,
        "comments": 92,
        "media": null,
        "permalink": "/r/netflix/comments/1gtwwjz/mike_tyson_and_jake_paul_fight_pushes_netflix/"
    },
    {
        "id": "1guclwk",
        "author": "Atlast_2091",
        "title": "Apple Cider Vinegar | Official Teaser | Netflix",
        "content": "",
        "upvotes": 9,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1guclwk/apple_cider_vinegar_official_teaser_netflix/"
    },
    {
        "id": "1gumjj6",
        "author": "Awkward-Motor3287",
        "title": "How did gene wilder narrate \"remembering gene wilder\" when it released 7 years after he died?",
        "content": "It seems to me that seven years is an extraordinary amount of time to produce a movie, particularly a documentary with little new footage.  What's the explananation?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gumjj6/how_did_gene_wilder_narrate_remembering_gene/"
    },
    {
        "id": "1gug6fb",
        "author": "Crafty-Afternoon-116",
        "title": "Rare Movie night. ",
        "content": "Please suggest a Sci Fi movie for an old friend and I to watch.   \nOff the the grid living is taking a vacation tonight.  We have pizza and Netflix.   Once a year thing.   No clue what’s available yet.  ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1gug6fb/rare_movie_night/"
    },
    {
        "id": "1gukx4q",
        "author": "Substantial-Point-90",
        "title": "Help us pick a new show",
        "content": "My husband and I don’t know what to watch. Here’s what we’ve finished:\n\nNobody Wants This,\nGinny &amp; Georgia,\nThe Unbreakable Kimmy Schmidt,\nThe Good Place,\nIn the Dark,\nManifest,\nDead to Me,\nRiverdale,\nThis is Us,\nNight Agent\n\nPlease nothing overly sexual or bloody. \n\nTIA!",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1gukx4q/help_us_pick_a_new_show/"
    },
    {
        "id": "1gujfkn",
        "author": "Future-Agent",
        "title": "Cobra Kai Thoughts ",
        "content": "The last three episodes of Cobra Kai before the last batch (11-15) in 2025...\n\n- Ep. 8: Let's fuckin go, boys.\n- Ep. 9: LET'S FUCKIN GO, BOYS!\n- Ep. 10: ...Fuck",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gujfkn/cobra_kai_thoughts/"
    },
    {
        "id": "1guduot",
        "author": "LetAfraid8933",
        "title": "Recommendations ",
        "content": "Any series like 13 reasons why? I’ve just rewatched it for the third time and need something similar. Thanks \n\nPS. I loved these too so any like theee would also be appreciated \n\nBreaking bad \nPeaky Blinders\nOzark\nStranger things ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1guduot/recommendations/"
    },
    {
        "id": "1gui1qg",
        "author": "TwinSong",
        "title": "What are some good adventure films/series depicting other worlds and fictional locations?",
        "content": "Examples:\n\n* Valerian and the City of a Thousand Planets\n* Stranger Things (the Upside Down parts)\n* Alita: Battle Angel\n* Avatar\n* Dune (though I didn't find the film that interesting)\n\n  \nI'm not all that interested in films set in generic US city landscapes.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gui1qg/what_are_some_good_adventure_filmsseries/"
    },
    {
        "id": "1gts2m3",
        "author": "Any_Permission_8142",
        "title": "Why?",
        "content": "Why does netflix constantly recommend the same things to me over and over and over same exact movies and shows and alot that I've already watched. It makes it difficult to find new things and it drives me up a wall. ",
        "upvotes": 60,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1gts2m3/why/"
    },
    {
        "id": "1guf94u",
        "author": "AtlasPinch",
        "title": "Unauthorized log on",
        "content": "Someone I know was able to create a profile on my account and started watching shows. I never gave out my Netflix log on info or the email address connected to it. I also haven't logged on to my Netflix account with any of their devices, or used that email address on their devices. How could this person have been able to get access to my account? Nobody should know my email address for Netflix, because I created it specifically so anyone who knows my real email address can't get on Netflix.\n\nI have since logged off all devices, changed my password, opted out of matched identifier communications, and turned off profile transfer. I didn't realize these were opt out features, but I don't see how someone could bypass my password with that. I thought I was secure with an alternative email address, so what am I missing?\n\n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1guf94u/unauthorized_log_on/"
    },
    {
        "id": "1gu6fx2",
        "author": "diofantos",
        "title": "Can remove creditcard without adding another form of payment ",
        "content": "uhhmmm.. So i just canceled my subscription cause the boxing stream was a total fail and for me at least (we dont have the same content on netflix like US for example) the content kinda sucks, very old and and not exciting.. So to make sure i dont get charged again, I wanted to remove my card from their site, cause I dont like them keeping my CC info when im not using the service.. However I cant remove it without adding another payment method.. So im wondering if the only way to remove my CC info from them is just to delete the account ?",
        "upvotes": 3,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1gu6fx2/can_remove_creditcard_without_adding_another_form/"
    },
    {
        "id": "1guml00",
        "author": "TitanSerenity",
        "title": "Households and Members - WTF?",
        "content": "I've paid for Netflix for my immediate family (Parents, brother) since sometime in 2018.  I've lived alone, they still all live at the house where I grew up.   2 houses, 4 profiles.  So yes, that was bad and I was part of the problem.  Bad TitanSerenity.  Bad.  Moving on.  When they announced they were cracking down on sharing, I was like \"Fine, whatever, we'll pay for the extra household or whatever thing.\"\n\nFast forward to last night, my brother tried to log in and finally got caught, and got the popup about households.  I \\*thought\\* that I'd made the right adjustments to my account when the notice came out back in spring, but apparently not.  \n\nSo I crated a member account, which he activated, and we transferred his profile.  All went well.  \n\nThen we go to transfer Mom and Dad's profiles to that member account, becuase they're the same 'household'/would be coming from the same public IP.   Only to then find out that Member Accounts can't have more than one profile.  \n\nSo this is really stupid, because if you're restricting it to IP/Geo, what's it matter?  After talking to support, it turns out it would've been perfectly viable to make myself the member (since I live alone and only have one profile), and leave them on the 'main' account so they can have multiple profiles at THAT location.  \n\nBut support tells me that once the profile is moved off the main account, it can't be moved back.    \nWTF is that?  There's zero technical reason for that.  None.  So I can't undo what we did and fix it. \n\nSo now, basically I'm going to have to jump through a bunch of hoops to create accounts, move profiles, etc etc, only to end up at the same place they won't let me go.  I'm going to end up within the rules, at one household with 3 profiles on it, and a member account with one profile on it.  Why are you going to make me do all the gymnastics to do the thing I can just go do anyway?  Completely assinine.  \n\nI already have the technical infrastructure in place to do the thing that I can't say I can do on this sub.  I'm half tempted to do it now just out of spite. \n\nDid I miss something? Is there an easier way to do this?  ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1guml00/households_and_members_wtf/"
    },
    {
        "id": "1gue97i",
        "author": "Voldi01",
        "title": "To watch something that is just genuinely funny, can watch each episode separately, requires no brain.",
        "content": "Yes. I’m looking for something on Netflix that has no continuity, requires no thinking, it’s just funny in every episode. It can be a reality show or a series, whatever just to turn my brain off. Thank you so much for recommendations!",
        "upvotes": 1,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1gue97i/to_watch_something_that_is_just_genuinely_funny/"
    },
    {
        "id": "1guoasu",
        "author": "Overall_Ad_9272",
        "title": "6.99 with ads",
        "content": "Why did I think I was getting a deal because idc about ads but I can’t watch everything on Netflix? Have to pay more than double to watch everything. Used to use my moms account but can’t do that either ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1guoasu/699_with_ads/"
    },
    {
        "id": "1guj122",
        "author": "poopybuttholegape",
        "title": "Is anyone else getting ads now? ",
        "content": "I am US based &amp; I haven’t watched any movies or anything for awhile, I turned on Netflix today and my movie had ADS IN IT?! Unskippable!! I am totally floored right now lol, is this happening to anyone else? ",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1guj122/is_anyone_else_getting_ads_now/"
    },
    {
        "id": "1gu4og4",
        "author": "Horror_Effective12",
        "title": "'The Law According to Lidia Poet' Season 2 Episode 6 - Review &amp; Ending Explained",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gu4og4/the_law_according_to_lidia_poet_season_2_episode/"
    },
    {
        "id": "1gui716",
        "author": "Notoriously_So",
        "title": "Howard Stern Warns Netflix Over Tyson-Paul Technical Issues: “Hell To Pay”",
        "content": "",
        "upvotes": 0,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1gui716/howard_stern_warns_netflix_over_tysonpaul/"
    },
    {
        "id": "1gu0wnk",
        "author": "Armadillo_Prudent",
        "title": "Has anyone here encountered this problem?",
        "content": "I just got a new TV and a chromecast. Netflix can't connect to my network on either the chromecast nor my playstation 4, yet all other apps on both devices can connect just fine *and* Netflix works just fine on both my phone and tablet, both of which are connected to the same network as my chromecast and PS4. On the playstation, I sometimes error code nw-6-408 and sometimes nw-2-5, on the chromecast I get nw-6-408 until I troubleshoot, at which point I get code ui-113.\n\nThis is frustrating AF.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gu0wnk/has_anyone_here_encountered_this_problem/"
    },
    {
        "id": "1guhj24",
        "author": "SimplePuzzleheaded80",
        "title": "Unpopular opinion ? ",
        "content": "I'll keep it short and simple. History shows us that no product out or app for that matter, has ever given US consumers more for the same price and to the contrary, found ways to increase prices. With that said, would it be wise to think this whole ' Live Sport' \" testing \" ( what im calling it right now ) is simply a way for Netflix to finally end up splitting such a good app in which if you have Netflix you CAN watch everything in it? Im getting a sense of \" packages\" and \"buy-in\" coming. Just me, but curious what everyone expects from sports streaming. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1guhj24/unpopular_opinion/"
    },
    {
        "id": "1gudy4e",
        "author": "jonbristol123",
        "title": "Can a WiFi in a home have 2 separate Netflix accounts?",
        "content": "I have a room in a house and I use the WiFi of the house. I was using my girlfriends Netflix but now it says Your TV isn't part of the Netflix household for this account.\n\nSo I'm wondering if each WiFi has one Netflix account, what happens if I sign up for my own Netflix and through my firestick sign in on the TV that is connected to the WiFi of the landlord.\n\nHope that all makes sense!",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1gudy4e/can_a_wifi_in_a_home_have_2_separate_netflix/"
    },
    {
        "id": "1gu18rf",
        "author": "Wild-Commission-9077",
        "title": "Boy swallow universe curiousity : spoiler",
        "content": "Am i understanding it right?\n\nSo Lyle worked for Darrens mom,\nBut he stoled some portion, \nSo he was killed by Ivan Crole.\n\nEli went to Darren's mom to save him later but he was already dead, and maybe she wouldnt have helped anyway.\n\nBut still Eli befriend with Darren.(why)\nAnd Lyle had not told where the stuff, risking his life(just tell themTT), and left message to Eli' older brother. \n\nWhen Ivan asked whats the message, he didnt answer honestly even if his brothers finger was about to be cut(why).\n\nWhen Eli found the stuff back, he went to Darren and try selling it when it was stolen one from her mom's stuff.\nAnd weirdly darren paid 50000bucks for it anyhow....(why)\n\n\n\n\nYet on epi5 but cant understand ....",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gu18rf/boy_swallow_universe_curiousity_spoiler/"
    },
    {
        "id": "1gu0x2v",
        "author": "DataPastor",
        "title": "Does Netflix plan to add back the downloading capability to Netflix Windows ARM app?",
        "content": "I love to watch Netflix series on the go on my Surface Pro 11 tablet, but as of July/2024 it lost its downloading capability. Do they plan to put it back?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1gu0x2v/does_netflix_plan_to_add_back_the_downloading/"
    }
]