[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 3,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1lgtfdg",
        "author": "blunathan",
        "title": "Le facciate di Torino",
        "content": "",
        "upvotes": 48,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/sonbivegc98f1.jpeg?auto=webp&amp;s=a5f61b6c27cd00b0e0387b305b40a1e756d1dcec"
        },
        "permalink": "/r/torino/comments/1lgtfdg/le_facciate_di_torino/"
    },
    {
        "id": "1lgtz9e",
        "author": "Typical-Buyer2901",
        "title": "Pfas nelle fontanelle dell'acqua, a Torino le più inquinate in Italia",
        "content": "1. Torino, casa dell’acqua, 920±300 ng/l;\n2. Firenze, piazza della Repubblica 880±280ng/l;\n3. Paesana (Cuneo) 850±280ng/l;\n4. Torino, piazza Galimberti 840±270ng/l;\n5. Luserna San Giovanni (Torino), 590±190 ng/l;\n6. Valdisotto (Sondrio) 530±180 ng/l;\n7. Galliano (Firenze) 480±160 ng/l;\n8. Bagolino (Brescia) 470±150 ng/l;\n9. Sondrio, via Orobie 450±150 ng/l;\n10. Graglia (Biella), 440±150 ng/l;\n11. Garessio (Cuneo), 370±120 ng/l;\n12. Rorà (Torino),  360±120 ng/l;\n13. Ormea (Cuneo), 360±120 ng/l;\n14. Darfo Boario Terme (Brescia) 287±95 ng/l;\n15. Milano, piazza Duca d’Aosta 274±91 ng/l.",
        "upvotes": 8,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/yGK74IRHoKqJjT7r5YsxT8rnF3i1TO_Xf3RNrvpzO80.jpeg?auto=webp&amp;s=bf3e608e66fc0ba9614da48f95a079c2b37bb714"
        },
        "permalink": "/r/torino/comments/1lgtz9e/pfas_nelle_fontanelle_dellacqua_a_torino_le_più/"
    },
    {
        "id": "1lgrni8",
        "author": "Confident-Art-8800",
        "title": "Stand up a Torino?",
        "content": "Ciao, avete posti che facciano stand up comedy di qualità a Torino?",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1lgrni8/stand_up_a_torino/"
    },
    {
        "id": "1lh0yvq",
        "author": "Adorable_Test399",
        "title": "Bar/eventi per conoscere gente il sabato sera?",
        "content": "Ciao, sono da poco a Torino. Esistono bar/eventi per conoscere gente nuova il sabato sera. Chiaramente ogni bar andrebbe bene, ma mi chiedevo se ci fossero gruppi/eventi già organizzati a tale scopo ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lh0yvq/bareventi_per_conoscere_gente_il_sabato_sera/"
    },
    {
        "id": "1lgq6ph",
        "author": "aranor01",
        "title": "Easy Riders: Pedalata Notturna",
        "content": "Iscrizione: https://docs.google.com/forms/d/e/1FAIpQLSef2dwtgHlFbFu94bWLgERm5lXQIWY7UcJKEJh_FGhfXjTy_A/viewform",
        "upvotes": 5,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5tgla4ep888f1.jpeg?auto=webp&amp;s=1b3ec919074d97283fe0c1fad5984226af51a7dd"
        },
        "permalink": "/r/torino/comments/1lgq6ph/easy_riders_pedalata_notturna/"
    },
    {
        "id": "1lguw1m",
        "author": "Zarpenguin2091",
        "title": "C’è qualche negozio a Torino che può farmi questa riparazione?",
        "content": "Ho bisogno di trovare un negozio che mi ripari il cavo di queste cuffie,qualcuno può aiutarmi?",
        "upvotes": 1,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/u67u1edns98f1.jpeg?auto=webp&amp;s=5ec891e2546ad07eba9f059eb0e1348f1060cc69"
        },
        "permalink": "/r/torino/comments/1lguw1m/cè_qualche_negozio_a_torino_che_può_farmi_questa/"
    },
    {
        "id": "1lgtv3k",
        "author": "thingsacaso",
        "title": "Donare giocattoli",
        "content": "Avete idea di qualche associazione che raccolga giocattoli usati? Ho provato a cercare ma ho trovato poca roba che accetti donazioni fuori dal periodo di Natale",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1lgtv3k/donare_giocattoli/"
    },
    {
        "id": "1lgwlyr",
        "author": "Murky_Giraffe8700",
        "title": "Via Roma cade a pezzi?",
        "content": "Passeggiando sotto i portici di Via Roma, vicino a Piazza Castello, ho notato l’intonaco che cade a pezzi e muri coperti di graffiti (“Del Piero forever”, “LUPUS”, “Nachos Rules”… sì, davvero).\nZona centralissima, turistica, storica… ma sembra abbandonata.\n\nQualcuno sa se il Comune ha in programma un restauro?\n",
        "upvotes": 0,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/j3achwmp8a8f1.jpeg?auto=webp&amp;s=dd05dba56e9ca1abd4886c9ebbe2de776a4aebeb"
        },
        "permalink": "/r/torino/comments/1lgwlyr/via_roma_cade_a_pezzi/"
    },
    {
        "id": "1lfw05h",
        "author": "TheTrampIt",
        "title": "Ma Veramente?",
        "content": "A Modugno...\n\nQua vicino no?",
        "upvotes": 58,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ie1m5q5ap08f1.jpeg?auto=webp&amp;s=d61827b6d0b857b7909850ed504d5de49f7281a1"
        },
        "permalink": "/r/torino/comments/1lfw05h/ma_veramente/"
    },
    {
        "id": "1lfx5ml",
        "author": "Mf-2hd",
        "title": "Torino è alle prese con continui blackout - Il Post",
        "content": "",
        "upvotes": 44,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/o851T1UzfHwvL-kWoPOXN6FnvjdN6mCzfYkZB4TfQ5Y.jpeg?auto=webp&amp;s=035fffcfa81d384e1e1540a2f24d8446d595af52"
        },
        "permalink": "/r/torino/comments/1lfx5ml/torino_è_alle_prese_con_continui_blackout_il_post/"
    },
    {
        "id": "1lfxl8g",
        "author": "Lovelydayinbaltimore",
        "title": "dove andate in piscina a Torino? (relax no per allenamento)",
        "content": "",
        "upvotes": 8,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1lfxl8g/dove_andate_in_piscina_a_torino_relax_no_per/"
    },
    {
        "id": "1lg9yr0",
        "author": "TOKYO6655",
        "title": "I Have Some Questions About UniTo",
        "content": "Hello, I'm an EU citizen (Austrian) wishing to study at the University of Turin. I do not live in Italy (and I wasn't born there, just went on a vacation once as a kid) and I'm currently outside of Europe hoping to move to Italy in September. While I've been emailing the university and frequently checking UniTo's website to figure out some things I'm confused about, I'm having a hard time with a couple of things. The responses I get to my emails are very brief and seem to only focus on one of many questions I have each time and I don't want to take away any more of their time. I'm running out of time here with the application deadlines. Due to me being an European citizen I'm able to apply late so I'm trying not to miss out on that but I have no idea how to plan this summer out.\n\nIf anybody could help me find an answer to my questions I'd really appreciate it.\n\n1. One question I asked in every single email I've sent them but never got an answer to has been whether or not I should provide my overall educational score when applying. I went to high school in Turkey so we don't really have a gpa kind of thing? I do have logs of all my yearly grades since they're stored in a website we have. Should I print those out somehow? How would I go about it if that was required of me to show?\n\n2. What are the exact documents needed for a non-Italian EU citizen to provide? I know the basics like ID, motivational letter etc. but I don't want to leave anything to chance.\n\n3. I know that free-access programs require students to take their corresponding TOLC exams, and my main goal is to study International Relations. But I don't know the subjects of said exam and what to prepare for. If anybody knows the premises of what subjects they focus on for that and could let me know that'd be amazing. That being said, I'm also debating trying out economics or something of the sort as a limited program first. But I haven't been able to figure out what kind of test limited programs require. So I'm also wondering about that aswell.\n\n4. I've paid for the university exams happening in the country I'm in and I will be attending them this weekend. Will my score on those matter or do I just need to provide proof that I've attended them? Either way I'll be doing my absolute best but I am pretty worried about how things will play out for me this upcoming educational year.\n\n5. Is anything different for EU citizens aside from the chance to still apply past the normal application dates? Anything I should keep in mind?\n\nI'm aware I'm pretty late to everything, I didn't want to rush for solutions before getting a response to my last email. I did today and like I said it was quite brief, so this is my last resort. My apologies if this is all over the place, I'm just really lost at this point.\n\nIncase it raises any questions I moved out of Austria and moved in with my mom in Turkey before high school started due to personal reasons. I have a dual citizenship from birth.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1lg9yr0/i_have_some_questions_about_unito/"
    },
    {
        "id": "1lfvvxl",
        "author": "Defiant-Wishbone1345",
        "title": "is torino lgbt friendly?",
        "content": "hi everyone, im f21 and moving to torino in september for uni. im a bisexual woman so i want to know what is it like for gay women in torino? id appreciate if any woman dating another woman in torino could tell me a bit about what to expect, if the city is lgbt friendly, if there's a lot of lgbt ppl, if there's lgbt events or spots to hang out etc. ",
        "upvotes": 10,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1lfvvxl/is_torino_lgbt_friendly/"
    },
    {
        "id": "1lg885y",
        "author": "Mindless_Debate2559",
        "title": "Italian classes in Torino",
        "content": "Hello lovely people I am a 35m and I am looking for some Italian classes in the afternoon so I can go after work. So if you know any decently priced and good Italian classes after 6pm I would appreciate if you can recommend me some. :) Grazzie mille.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1lg885y/italian_classes_in_torino/"
    },
    {
        "id": "1lfytz5",
        "author": "Loppo93",
        "title": "Motorizzazione civile",
        "content": "Domanda per chi ci è già passato. \n\nDevo richiedere la patente internazionale. Ho già stampato tutto, mancano solo le marche da bollo.\n\nSto cercando di prenotare l'appuntamento. Ho compilato il form online ad inizio settimana, ma non ho ricevuto risposta. Ora sto provando a chiamare telefonicamente, ma non riesco ad entrare in contatto con nessun operatore \n\nMi consigliate di andare direttamente?\n\nGrazie in anticipo per le risposte.",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1lfytz5/motorizzazione_civile/"
    },
    {
        "id": "1lg53bi",
        "author": "One_Put_9182",
        "title": "Come scegliere una zona?",
        "content": "Ciao a tutti ragazzi, sto per trasferirmi a torino per lavoro, e sto cercando casa in affitto.  \nQuali sono le zone che dovrei evitare?  \nPremetto che dovrei lavorare a mirafiori nord, e che quindi mi farebbe comodo la vicinanza con i mezzi, ma non vorrei trovarmi troppo distante dal centro città.\n\nCi sono delle zone che mi hanno sconsigliato, ma leggendo qua e là non capisco bene se sia effettivamente così o meno. \n\nHo provato a guardare qualcosa in zona politecnico, ma purtroppo affittano solo a studenti viste le convezioni del comune di Torino. \n\nSapreste darmi qualche consiglio? ",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1lg53bi/come_scegliere_una_zona/"
    },
    {
        "id": "1lfzh8b",
        "author": "chaoticbabe10",
        "title": "public transport",
        "content": "Hi! My boyfriend’s family and I are going to travel to Torino this September and we will stay for 10 days. We’re staying near the city center but will probably need to use public transport to explore the city. I would like to know what’s the best option for us, because we’re 5 in total so taxi will not be the best option. Thanks! \nP.D If you have any food, or places recommendations i’m open to listen! ",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1lfzh8b/public_transport/"
    },
    {
        "id": "1lfxhuv",
        "author": "bec0m1ng",
        "title": "Dentista per paziente fobica",
        "content": "Ciao! Sto cercando un* dentista su Torino che abbia esperienza con pazienti fobici o con forte ansia, per risolvere problemi importanti. Possibilmente no catene e franchising: cerco un* dentista non giudicante e umano, se non costasse troppissimo sarebbe meglio. Se potesse avere opzioni di sedazione cosciente ancora meglio (anche se so che costa tanto), ma non è indispensabile.\nAvete esperienze dirette o nomi da consigliare? Grazie a tutt*",
        "upvotes": 3,
        "comments": 17,
        "media": null,
        "permalink": "/r/torino/comments/1lfxhuv/dentista_per_paziente_fobica/"
    },
    {
        "id": "1lfvtzl",
        "author": "Defiant-Wishbone1345",
        "title": "what to expect as a uni student",
        "content": "hi everyone\nill be moving to turin around september for uni, and i wanted to ask what is it like for uni students? are there cute coffee shops to study? fun places to hang out? decent nightlife? im f21 for reference, id appreciate anyone telling me what to expect and if it is a fun city to live in during my uni years.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1lfvtzl/what_to_expect_as_a_uni_student/"
    },
    {
        "id": "1lfchb2",
        "author": "JackFr0st024",
        "title": "Casa corso Regina",
        "content": "Sto cercando casa da un po' e ho trovato una casa che potrebbe essere una buona occasione su corso regina praticamente attaccata alla fermata Livorno. So che andando verso porta palazzo inizia a diventare un po' sketchy, ma quel punto mi sembra abbastanza lontano e tranquillo. Voi avete avuto esperienze in zona/sapere com'è? Grazie in anticipo ",
        "upvotes": 6,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1lfchb2/casa_corso_regina/"
    },
    {
        "id": "1lfkyhw",
        "author": "Just_Chain_366",
        "title": "universitari, cosa scelgo?",
        "content": "Ho un dubbio che mi tormenta da diverse settimane. Ho ottenuto di recente una triennale in lingue, e per la mia magistrale ho visto delle possibilità ad UniTO e alla Sapienza di Roma. Personalmente entrambe le città hanno diversi pro e contro, e quella verso cui sono più orientato è UniTo, ma volevo capire dai torinesi stessi, qual è la loro opinione sulla loro università. (domanda off topic, è vero o è un mito che l'aria è quasi velenosa?)",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1lfkyhw/universitari_cosa_scelgo/"
    },
    {
        "id": "1lfkt74",
        "author": "MedinisSuris",
        "title": "Torino places to visit",
        "content": "Hi,\nSo we're in Turin for 2 more days and so far many of planned activities didn't go to plan. Mole Antoneliana elevator is closed, due to strikes many of destinations around Turin are hard to get to, so Parco Gran Paradiso did not work either. Today we got to Basilica of Superga. No luck finding any places to rent a scooter either. \n\nSo the quesion is - any suggestions where else to go? Or does anyone know a place to rent a scooter in Turin?\n\nMuch appreciated!",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1lfkt74/torino_places_to_visit/"
    },
    {
        "id": "1lfa3s0",
        "author": "Additional_Jello_429",
        "title": "C'è un'interruzione di corrente dove ti trovi?",
        "content": "Vivo a Crocetta e la nostra corrente si è appena spenta",
        "upvotes": 5,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1lfa3s0/cè_uninterruzione_di_corrente_dove_ti_trovi/"
    },
    {
        "id": "1lfdlbx",
        "author": "Similar_Profit_7298",
        "title": "Orologio da taschino",
        "content": "So che è una richiesta strana, ma ho urgente bisogno di trovare un orologio da taschino con catena a Torino. Non me ne serve uno figo o di qualità, cerco una cinesata da 20€ circa, conoscete un negozio di cianfrusaglie che potrebbe venderlo? Per la zona è indifferente.",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1lfdlbx/orologio_da_taschino/"
    },
    {
        "id": "1lf5co9",
        "author": "Mediocre_Meal_5559",
        "title": "Psichiatra a Torino",
        "content": "Scrivo con account usa e getta per riservatezza, vorrei qualche nome di psichiatri a Torino, per problemi di ansia. Sono seguita dallo stesso con buoni risultati da diversi anni, ma ho ragione di pensare che possa avere seri problemi con l'uso di sostanze e questo fa sì che io non senta di potermici affidare. Non giudico, semplicemente non riesco a fidarmi più ora che ho questi forti sospetti. Quindi, chiedo se qualcuno ha suggerimenti di medici con cui avete avuto esperienze positive. ",
        "upvotes": 8,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1lf5co9/psichiatra_a_torino/"
    },
    {
        "id": "1leajj0",
        "author": "HappyLuca",
        "title": "Mi hanno chiesto 10.000€ per aver partecipato ad un open house",
        "content": "In breve: mi hanno chiesto il 7,4% di commissioni per l’agenzia immobiliare (10.000€ +iva) per un immobile da 135.000€\n\nParte lunga per chi ha voglia:\nSto cercando casa da acquistare a Torino. \nNe individuo una, bilocale in zona non troppo centrale ma comoda. Con qualche lavoretto da fare internamente ma comunque abitabile. Prezzo 135.0000€. \n\nLa vado a vedere, scopro il giorno stesso che non sarei stato l’unico a vederla, ma mi avevano inserito in un open house. Mando giù l’amaro in bocca, mi sono fatto 1h di strada per vedere la casa. \n\nVedo la casa ed effettivamente mi interessa. \n\nEravamo in 40 persone e l’agenzia premeva per raccogliere tutte le proposte entro sera, in quanto il giorno dopo avrebbero inoltrato tutto al proprietario. Già la cosa non mi va giù ma la casa mi piace molto.\n\nPrendo coraggio, ipotizzo il costo di ristrutturazioni e ci sto dentro con il budget. \nVado nell’ufficio di un famoso franchising immobiliare per fare la mia proposta di acquisto e lì l’amara sorpresa.\n\n10.000€+iva solo per il loro servizio.\nIl 7,4% del valore della casa solo per avermi fatto partecipare ad un open house. \n\nOvviamente non trattabili in nessun modo, si coprono con “listino aziendale”, fino a 150.000€ sono 10.000€ fissi.\n\nCosti notarili e tasse escluse, ma quelle almeno non sono a discrezione dell’agenzia.\n\nA queste condizioni rinuncio, non regalo 10.000€ ad una agenzia che non ha saputo nemmeno darmi tutte le risposte esaustive che cercavo.\n\nMa veramente dobbiamo sottostare a questi prezzi folli per un servizio inesistente? \nCome è possibile che non ci sia nessuna soluzione alternativa? \n",
        "upvotes": 424,
        "comments": 208,
        "media": null,
        "permalink": "/r/torino/comments/1leajj0/mi_hanno_chiesto_10000_per_aver_partecipato_ad_un/"
    },
    {
        "id": "1lfb8e5",
        "author": "dani-foxy",
        "title": "Francobolli",
        "content": "Buongiorno, avrei una vecchissima collezione di francobolli da vendere. Qualcuno può consigliarmi qualche negozio a Torino che sia onesto nella valutazione? Grazie mille!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1lfb8e5/francobolli/"
    },
    {
        "id": "1lerc1g",
        "author": "Parmesean_Lover",
        "title": "Romantic date in Turin",
        "content": "Hiii dear Piemonteses!\n\nMy partner of 4 years has been under the weather for a while and I want to make her happy,\nWe are both students and respectfully poor 🥲\n\nCan you recommend me any interesting place or cafe or restaurant to me? For example Cafe Napoleon was really interesting as it was named after Napoleon Bonaparte. We have visited literally every single museum in Turin area.\n\nMy budget is about 15 euros per person, if less then even better.\n\nThank a lot in advance and may you be blessed with endless Lavazza Coffee!\n\n",
        "upvotes": 20,
        "comments": 51,
        "media": null,
        "permalink": "/r/torino/comments/1lerc1g/romantic_date_in_turin/"
    },
    {
        "id": "1lf5u8n",
        "author": "Electrical-Fix2073",
        "title": "Finals Nba",
        "content": "Ciao, cerco qualche posto dove vedere gara 6 delle finals Nba queste notte, qualche consiglio?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lf5u8n/finals_nba/"
    },
    {
        "id": "1lf95pa",
        "author": "everald_dalevic",
        "title": "Noleggio furgoncino 5 posti",
        "content": "Come da oggetto, avrei bisogno di noleggiare per un giorno un furgoncino 5 posti tipo Doblò. Le ditte di noleggio che ho contattato hanno tutte soltanto furgoncini da 2 passeggeri... l'unica che ne ha uno sarebbe la Gimax di Rivoli, ma non è disponibile per le date in cui serve a me.\nPer caso qualcuno conosce ditte di noleggio che hanno questo tipo di veicolo?\nGrazie infinite per qualsiasi suggerimento!",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1lf95pa/noleggio_furgoncino_5_posti/"
    }
]