[
    {
        "id": "1n5xjsl",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Curry Barker - Tuesday 9/2 at 5:00 PM ET - Director of the upcoming TIFF Midnight Madness movie 'Obsession' and director of 2024's 'Milk &amp; Serial'.",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/z6gf9jcjplmf1.jpeg?auto=webp&amp;s=804f3c0c37722607d064eab9d49c66c966d76ff2"
        },
        "permalink": "/r/movies/comments/1n5xjsl/amaqa_announcement_curry_barker_tuesday_92_at_500/"
    },
    {
        "id": "1n5x8ha",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Sean Ellis - Wednesday 9/3 at 11:00 AM ET - Oscar-nominated director of 'The Cut', 'Cashback', 'Anthropoid', 'Metro Manilla', 'The Broken', and 'The Cursed'.",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/30r4m8eenlmf1.png?auto=webp&amp;s=95630a228fb56af3a8160709f2b4f824a502f365"
        },
        "permalink": "/r/movies/comments/1n5x8ha/amaqa_announcement_sean_ellis_wednesday_93_at/"
    },
    {
        "id": "1n624uu",
        "author": "MarvelsGrantMan136",
        "title": "Graham Greene Dies: Oscar-Nominated ‘Dances With Wolves’ Actor Was 73",
        "content": "",
        "upvotes": 16979,
        "comments": 652,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g8cYASp5XTcIQZtBY8nc84vHVVDs5UiDn3XXMAytUTw.jpeg?auto=webp&amp;s=da843a510bb240a5f13297fc653db68339376348"
        },
        "permalink": "/r/movies/comments/1n624uu/graham_greene_dies_oscarnominated_dances_with/"
    },
    {
        "id": "1n5u723",
        "author": "ChiefLeef22",
        "title": "Benny Safdie's 'The Smashing Machine' - Review Thread",
        "content": "*MMA fighter Mark Kerr reaches the peak of his career but faces personal hardships.*\n\nCast: Dwayne Johnson, Emily Blunt\n\n**Rotten Tomatoes:** [94%](https://www.rottentomatoes.com/m/the_smashing_machine_2025)\n\n**Metacritic:** [79/100](https://www.metacritic.com/movie/the-smashing-machine/)\n\nSome Reviews:\n\n[The Independent - Geoffrey Macnab](https://www.the-independent.com/arts-entertainment/films/reviews/the-smashing-machine-review-dwayne-johnson-b2817883.html) \\- 4 / 5\n\n&gt;This, though, is a story in which winning finally begins to seem very hollow. The real way Safdie puts a chokehold on his audience is by examining Mark and Dawn’s physical and emotional weaknesses in such forensic detail. The Smashing Machine may not provide the pay-offs that audiences expect from more conventional sports movies, but this is the most raw and vulnerable that Johnson has ever been on screen. Once you’ve seen him this exposed, you won’t watch his typical action movie stunts in quite the same way ever again.\n\n[Daily Telegraph - Robbie Collin](https://www.telegraph.co.uk/films/0/the-smashing-machine-review-dwayne-johnson/) \\- 4 / 5\n\n&gt;It’s a classical fight movie that innovates subtly. Maceo Bishop’s nimble photography has the sweat and grit of a vintage muscle flick from the Pumping Iron era, but the score by the experimental jazz composer Nala Sinephro is all swirling harps and breathy saxophones; arguably no piece of music has ever sounded less like a punch in the face. Yet as an accompaniment to Kerr’s battles in and out of the ring, it’s oddly perfect, giving this tough story an unexpectedly sweet and even spiritual edge. Smashing stuff has rarely been such smashing stuff.\n\n[Next Best Picture - Cody Dericks](https://nextbestpicture.com/the-smashing-machine/) \\- 7 / 10\n\n&gt;Dwayne Johnson delivers the best performance of his career as the amiable but troubled UFC champion Mark Kerr. Emily Blunt and Ryan Bader are also excellent in their roles. The screenplay is repetitive and frustrating. Blunt's character is so unlikeable and written with such vitriol that it becomes exhausting to watch her, although Blunt's performance is as good as it could possibly be.\n\n[Variety - Owen Glieberman](https://variety.com/2025/film/reviews/the-smashing-machine-review-dwayne-johnson-benny-safdie-1236503546/)\n\n&gt;Johnson, shifting his whole aspect (he seems like a new actor), invests that silent, moody, hidden side of Mark with a quality of mystery. He gives an extraordinary performance, playing Mark Kerr as a gentle giant with demons that will not speak their name, yet the audience can feel them there; we want to see those demons healed. You might think the key word in the movie’s title is “smashing,” but it’s actually “machine.” Mark is a man who reins in his violence by having constructed his entire self — body and personality — as a controlled engine of demolition. The movie is about how this man-machine becomes a human being.\n\n[The Hollywood Reporter - Jordan Mintzer](https://www.hollywoodreporter.com/movies/movie-reviews/the-smashing-machine-review-dwayne-johnson-delivers-the-blows-as-a-tormented-fighter-in-benny-safdies-gritty-and-downbeat-mma-flick-1236358361/)\n\n&gt;Johnson has rarely played a loser, but he’s always been likable, displaying a massive grin to match his massive pecs in action vehicles that never allowed him to showcase much range. He manages to go deep here without overdoing it, killing the audience with kindness as a benign warrior who suffers from one scene to the next, triumphing briefly in the ring before succumbing to addiction and/or romantic grief. Like Mickey Rourke in *The Wrestler* — a film from which Safdie seems to take a few cues — the actor delivers an intoxicating mix of blood, sweat, tears, protein and total helplessness.\n\n[IndieWire - Ryan Lattanzio](https://www.indiewire.com/criticism/movies/the-smashing-machine-review-1235148509/) \\- 'B+'\n\n&gt;Johnson’s performance is out-and-out wonderful, a beady-eyed fusion of body and spirit that osmoses Safdie’s sensibility to deliver what can’t be disputed as the most layered work of the actor’s career. A vividly contradictory Blunt, funny and sad especially in articulating Dawn’s conflicted response to Mark’s post-rehab emotional about-face during a tense argument, is equally sensational.\n\n[Deadline](https://www.rottentomatoes.com/critics/source/2256) \\- [Damon Wise](https://www.rottentomatoes.com/critics/damon-wise)\n\n&gt;Dwayne Johnson owns the whole thing with his truly remarkable work as fighter Mark Kerr, disappearing so fully underneath Kazu Hiru’s astonishing prosthetics that the opening of the film, presented as contemporary footage from an event in Sao Paulo 1997, looks genuinely like the real thing. It’s that rare beast, a biopic that’s light on the bio and resistant to being a pic. It’s a film about a human being, and its effect is strangely haunting, since Dwayne Johnson seems to do everything while doing nothing.",
        "upvotes": 2583,
        "comments": 535,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_2G9Mo5PGGZ4M7fVlcULtL0yIfl1gYAWNSiGlMJrscg.jpeg?auto=webp&amp;s=8edb4c0c0a6c7172d8a434837786bc09e5434eb8"
        },
        "permalink": "/r/movies/comments/1n5u723/benny_safdies_the_smashing_machine_review_thread/"
    },
    {
        "id": "1n5tazq",
        "author": "tylerthe-theatre",
        "title": "Paul Walter Hauser backed out of Rob Ford role to avoid playing 'every chubby idiot ne'er-do-well' from history",
        "content": "",
        "upvotes": 2268,
        "comments": 224,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/paucecElLuA3JsCh9We8pEis2uYkoe-5nBrNgDvpHIM.jpeg?auto=webp&amp;s=5142e516ef6d33b77f00fb65a329c95f883fd56e"
        },
        "permalink": "/r/movies/comments/1n5tazq/paul_walter_hauser_backed_out_of_rob_ford_role_to/"
    },
    {
        "id": "1n67yv6",
        "author": "stormborn3",
        "title": "When you hear the name “Patrick Swayze” what is the first movie that comes to mind?",
        "content": "Me and my boyfriend are having a passionate disagreement and need to know what movie honestly comes to your mind first when you hear the  name Patrick Swayze. We have asked our friends and family and the answers are pretty balanced between his option and mine so I need an internet tiebreaker with the help of the kind Reddit movie community.\n\nEDIT: \n1. I had no idea he was in Donnie Darko.\n2. I am definitely going to start a list and start watching a lot of these because I can honestly say I haven’t seen most of the ones mentioned.\n3. I suspected it may be a woman vs man thing because I have seen a couple people mention their gender when answering which is kind of what I expected.",
        "upvotes": 329,
        "comments": 1150,
        "media": null,
        "permalink": "/r/movies/comments/1n67yv6/when_you_hear_the_name_patrick_swayze_what_is_the/"
    },
    {
        "id": "1n5n4ur",
        "author": "MarvelsGrantMan136",
        "title": "New Image of Bob Odenkirk in ‘Normal’ - Ulysses is appointed substitute sheriff in the tiny Minnesota town of Normal. When the local bank is sacked, Ulysses unknowingly uncovers something far more explosive than a simple bank robbery.",
        "content": "",
        "upvotes": 4741,
        "comments": 233,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2doefuzepjmf1.jpeg?auto=webp&amp;s=e4ba1001a0421fad6a3b1ae37cca917157acf68e"
        },
        "permalink": "/r/movies/comments/1n5n4ur/new_image_of_bob_odenkirk_in_normal_ulysses_is/"
    },
    {
        "id": "1n66kcr",
        "author": "Magical_critic",
        "title": "Actors who often play characters that are way older than their actual age?",
        "content": "There's a Korean actress named Lee Jung-eun who international viewers probably best know her as the housekeeper from Parasite. I just realized that she seems to be stuck playing characters where the character is way older than her actual age (55), with the most recent example being My Daughter is a Zombie, where she plays a Grandma even though there's only an 11 year age gap between her and the actor who plays her son. Are there any other actors who are known to be stuck playing characters that are way older than their actual age? ",
        "upvotes": 296,
        "comments": 133,
        "media": null,
        "permalink": "/r/movies/comments/1n66kcr/actors_who_often_play_characters_that_are_way/"
    },
    {
        "id": "1n5z7mq",
        "author": "MarvelsGrantMan136",
        "title": "‘Evil Dead 2’ Writer, ‘Intruder’ Director Scott Spiegel Has Passed Away at 67",
        "content": "",
        "upvotes": 739,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YS57sPaeMi7KMDoYW0-KceM4llaZ_KzcAv7hqLmGMr4.jpeg?auto=webp&amp;s=3899d975e9af48786ff90114427eaabb1d1c49b1"
        },
        "permalink": "/r/movies/comments/1n5z7mq/evil_dead_2_writer_intruder_director_scott/"
    },
    {
        "id": "1n67hwi",
        "author": "ShouldBeWorking2nite",
        "title": "What line or scene did you not realize was a reference to another movie till much later?",
        "content": "For me it’s in the movie Super Troopers when the teens in the beginning of the film are in the back of the squad car. And the one who was super high is licking the window and says “The Snozberries taste like Snozberries”. I just thought it was a silly made up fruit that someone high would think is real. But 24 years later and many rewatching’s, it was today I happened past Willy Wonka and the Chocolate Factory from 1971 and the scene with the flavored wallpaper comes up. And what do I hear “The Snozberries taste like Snozberries”. Are you kidding me it’s been a while since I’ve watch Willy Wonka but how did that never click until today.",
        "upvotes": 209,
        "comments": 148,
        "media": null,
        "permalink": "/r/movies/comments/1n67hwi/what_line_or_scene_did_you_not_realize_was_a/"
    },
    {
        "id": "1n5khoe",
        "author": "RejectingBoredom",
        "title": "Best example of “I can’t believe these two movies were made by the same director” pairings?",
        "content": "Example:\n\nIn 1998, Martin Campbell delivered what, at that time, was one of the all time great swashbuckling adventure movies in Mask of Zorro. Complete character revival and revitalisation, one of the best comic book movies of the decade.\n\n8 years later he makes one of the all time great spy movies and all time great Bond movies in Casino Royale. \n\nTwo absolute masterpieces of their respective genres, right?\n\nThen in 2011 he directs fucking Green Lantern, one of the worst comic book movies of all time and basically put GL on ice for over a decade. Even the animation stuff cooled off on GL. \n\nSo Campbell is clearly a very talented director but he goes from a couple of all time greats to an almost universally hated movie.\n\nOther examples?",
        "upvotes": 2918,
        "comments": 1245,
        "media": null,
        "permalink": "/r/movies/comments/1n5khoe/best_example_of_i_cant_believe_these_two_movies/"
    },
    {
        "id": "1n66j1x",
        "author": "bluesundust",
        "title": "Movies that changed you as a child. For me this was 'The Last Unicorn'.",
        "content": "The Last Unicorn, this movie is magical. In combination with his soundrack from America - wow.\n\nIt had a deep emotional impact on me as child. I had never seen a 'kids movie' like this before. It introduced me to a new emotion — melancholy.\n\nSure, Pixar also makes good movies about dealing with emotions. But this film hits you differently as a child.\n\nWhich movie broadened your emotional horizons as a child?",
        "upvotes": 137,
        "comments": 76,
        "media": null,
        "permalink": "/r/movies/comments/1n66j1x/movies_that_changed_you_as_a_child_for_me_this/"
    },
    {
        "id": "1n5uxbi",
        "author": "indiewire",
        "title": "Jesse Plemons' Role in 'Bugonia' Is the Talk of Telluride (Interview)",
        "content": "",
        "upvotes": 465,
        "comments": 70,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/t1tlfzcEusAgq-fOnzZbswqxzDAZY0XVubeSuzfFoVc.jpeg?auto=webp&amp;s=fe0bc71b81af489aa46c470dd2694d8a12de2679"
        },
        "permalink": "/r/movies/comments/1n5uxbi/jesse_plemons_role_in_bugonia_is_the_talk_of/"
    },
    {
        "id": "1n5guls",
        "author": "megamindwriter",
        "title": "The birth of James T. Kirk and the death of his father in Star Trek (2009)",
        "content": "",
        "upvotes": 3857,
        "comments": 536,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zazvxt5tthmf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1n5guls/the_birth_of_james_t_kirk_and_the_death_of_his/"
    },
    {
        "id": "1n68fj6",
        "author": "HereComeTheFlutePart",
        "title": "The Nice Guys",
        "content": "Just rewatched this gem again.  Best buddy cop movie of the last 30 years.  Excellent writing with Crowe and Gosling juxtaposing straight edge hard ass with bumbling buffoon perfectly.\nTrying to identify the car Ryan Gosling takes from the Valet when he’s told his daughter is in the Limo that just left the party.  Red car, looked like a firebird or corvette.  Google GPT saying the scene didn’t happen.\nLove to hear other opinions on it and possible ID on the whip.\n",
        "upvotes": 69,
        "comments": 19,
        "media": null,
        "permalink": "/r/movies/comments/1n68fj6/the_nice_guys/"
    },
    {
        "id": "1n5plod",
        "author": "jesepy",
        "title": "Local theater is doing a 'forgotten films' marathon: what's a movie you always recommend but nobody's heard of?",
        "content": "My local theater is doing a 'forgotten films' marathon and I want to suggest some truly underrated movies from the late 90s to early 2000s. Looking for films that deserved way more attention but got overshadowed by blockbusters. I'm thinking quality dramas or thrillers that critics loved but audiences missed. What's a movie you always recommend but nobody's heard of?",
        "upvotes": 669,
        "comments": 1735,
        "media": null,
        "permalink": "/r/movies/comments/1n5plod/local_theater_is_doing_a_forgotten_films_marathon/"
    },
    {
        "id": "1n6cjmy",
        "author": "tiddertnuocca519",
        "title": "Watching ‘The Mighty Ducks’ (1992) in 2025 makes me long for a different decade",
        "content": "It’s 2AM, I can’t sleep and I need some fodder on the screen to put me to bed. Picking ‘The Mighty Ducks’ was the wrong movie but in watching it, it has really made me realize how much the world has changed since 1992.\n\nGranted, it’s a work of exaggerated fiction. Even in 1992, no law firm is giving a pee wee hockey team $15k to buy equipment, there weren’t publicly broadcast televised pee wee tournaments with commentators, analysts and a full stadium audience, coaches aren’t telling 10 year olds that if they don’t make the game winning shot, not only are they letting their coach down but they are letting their team and their dead dad down and finally, the dialogue is way too clever and quippy for a bunch of 10 year old kids.\n\nGreat, we got that out of the way. But the movie unintentionally captures a vibe in the 90s that has since disappeared. They shot it earnestly and now it’s a time capsule for that time. The kids are out hanging out with each other, the cities are lively, people communicate in the wild. The kids have this sense of adventure that I recall in my childhood but don’t see in kids today. They are generally just out in the world without parental supervision, and that’s *okay*. Shit, the notion of a grown man trying to teach kids hockey didn’t come with the default assumption of grooming and pedophilia. \n\nIt’s just wild how different things are today. I was a teenager in the 90s and again, yes the film exaggerates but the details they showcase in how we freely communicated back then and how people didn’t jump to the worst conclusions of each other, is just wildly different.\n\nFinally, this is a little off topic, but this movie was rated PG yet it gets away with so much stuff and definitely isn’t just a kids movie, as we know them today. The kids are looking at dirty magazines, they make light hearted race jokes like calling the 2 black kids and one white kid “Oreos”, Gordon Bombay verbally rips the kids apart and straight up tells them they “suck”. I just can’t imagine a PG movie today having any of these vibes.\n\nI really encourage giving the film a shot. I haven’t seen it since I was probably 10 years old myself. No it is not high art and it won’t blow your socks off. But if you recognize that the days we live in today are just…so…bland, I think you’ll have a good time with this unintentional time capsule of a film.",
        "upvotes": 30,
        "comments": 15,
        "media": null,
        "permalink": "/r/movies/comments/1n6cjmy/watching_the_mighty_ducks_1992_in_2025_makes_me/"
    },
    {
        "id": "1n67ls9",
        "author": "fungobat",
        "title": "Dave (1993) Official Trailer - Kevin Kline, Sigourney Weaver Comedy HD",
        "content": "",
        "upvotes": 62,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Hgp4rhKkUbys3lJjCEwdDrfXR6J9CVDQX_mSI4A8aDE.jpeg?auto=webp&amp;s=183bd795a1e14ea37a649fc78be6e37d1d0e73cd"
        },
        "permalink": "/r/movies/comments/1n67ls9/dave_1993_official_trailer_kevin_kline_sigourney/"
    },
    {
        "id": "1n65gbl",
        "author": "ang-ela",
        "title": "What movie completely changed your opinion after a second watch?",
        "content": "The first time I saw Eternal Sunshine of the Spotless Mind, I thought it was just a quirky romance with a strange sci-fi twist. On rewatch, the emotional core hit much harder. The longing, the pain of trying to erase memories, and the bittersweet truth of love and heartbreak. The quiet moments between Joel and Clementine feel devastating once you know what’s coming. It’s one of the few films that makes me both ache and smile at the same time.",
        "upvotes": 49,
        "comments": 56,
        "media": null,
        "permalink": "/r/movies/comments/1n65gbl/what_movie_completely_changed_your_opinion_after/"
    },
    {
        "id": "1n5tws6",
        "author": "NotASynth499",
        "title": "Movie with the most unlikeable lead character?",
        "content": "Recently i saw Vampires by John Carpenter, i adore the director but the movie had tons of problems and the biggest one was how deeply unlikeable the two leads were.\n\nJames Woods was just offputting at every second, beating a priest that was his ally and overall being sleazy as fuck and having a really questiinable sense of humor... Daniel Baldwin was worse somehow, an actually uncomfortable presence- he kept beating a woman that was turning into a vampire, at one moment when he tied her to the bed he stripped her of her clothes for some reason. He came across as someone who never had consensual sex with a woman, worse of all is the two ended together at the end of the movie.\n\nBoth literally ruined any enjoyment i might gotten from this movie.",
        "upvotes": 134,
        "comments": 341,
        "media": null,
        "permalink": "/r/movies/comments/1n5tws6/movie_with_the_most_unlikeable_lead_character/"
    },
    {
        "id": "1n59dbj",
        "author": "Happy_Philosopher608",
        "title": "I ruined Flubber for myself after rewatching it as an adult after all these years later... 😞🤦",
        "content": "I have fond memories of seeing this movie as a kid in the cinema and also breaking the VHS tape rewatching over and over, but I never truly realised until today rewatching it as an adult with a mature perspective, JUST HOW MUCH OF AN ABSOLUTE SCUMBAG PSYCHO PROFESSOR PHILIP BRAINARD is!! \n\nLike seriously, this dude leaves his supposedly beloved fiance at the altar THREE times:\n\nConstantly forgets his dates and even that he had a rehearsal dinner the night before (thus surely making Sarah feel like hes not remotely interested in her or this wedding);\n\nBriefly apologises but then acts as if its no big deal he humiliated her yet again and just tries to excuse it by saying he was busy playing with his goo all night in a darkened basement;\n\nThen spies on his ex gf and enviously lobs innocent fruit at his arch nemesis just for trying to comfort his Phil's jilted ex;\n\nProceeds to rig a junior high basketball game and cheat his team to victory just to impress his girl again (which he even brags about to her face like its meant to win her heart because he's a full blown autist who cant read emotions, comprehend social norms or even basic morality);\n\nAnd even bloody threatens literal minors to take his equivalent of steroids and indeed cheat their way to victory;\n\nBefore finally learning absolutely nothing by the end of it, and the movie ends with him once again prioritising his madcap science experiments over taking an hour to get out and marry his soul mate (who bizarrely has now given him FOUR chances to do so like a proper mug!!), and instead just calls in via Zoom to exchange vows like its a pesky distraction thats totally beneath him!!  \n\nAnd this is supposed to be the protagonist of the movie who Disney wants us to root for?! Guy's a complete scumbag ffs. Not to mention keeping all the world changing tech secrets to himself lol \n\nAnd i swear this guy isnt just simply \"absent minded\"... Hes such a genius yet cant tell time properly and misses the first wedding, whilst not realizing hes been lecturing a life drawing class for a full 5 minutes, nor that he was at a rehearsal dinner for his own wedding just the night before, is utterly bonkers!! \n\nI mean theres ditzy and scatterbrained, and then theres just full blown dementia! 🤦\n\nDear god this has spoiled my memories of this flick BIG TIME! 😞\n\nDid I miss anything? Lol. ",
        "upvotes": 2997,
        "comments": 399,
        "media": null,
        "permalink": "/r/movies/comments/1n59dbj/i_ruined_flubber_for_myself_after_rewatching_it/"
    },
    {
        "id": "1n69gjw",
        "author": "WhatsATrouserSnake",
        "title": "The Last Supper 1995 Official Trailer - Cameron Diaz",
        "content": "",
        "upvotes": 13,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0l6rQeaZWsdPtK6rAC7iGjKNqb3TFVs1-LwGRGWEOcc.jpeg?auto=webp&amp;s=2b9d7e8b240ac8ccb12a0ed140bafd07866d766a"
        },
        "permalink": "/r/movies/comments/1n69gjw/the_last_supper_1995_official_trailer_cameron_diaz/"
    },
    {
        "id": "1n5n1fa",
        "author": "Fisher212121",
        "title": "What ‘classic’ novels do you feel have never really had a really good film adaptation?",
        "content": "[Discussion](https://www.reddit.com/r/movies/?f=flair_name%3A%22Discussion%22)\n\nWhat ‘classic’ novels do you feel have never really had a really succesful film adaptation?\n\nWhich novels would you most like to see adapted? Feel free to go classic or modern.\n\nPersonally I’d go for ‘The Island Of Doctor Moreau’. I've always assumed the 70s version was highly regarded but turns out it isn't!",
        "upvotes": 232,
        "comments": 576,
        "media": null,
        "permalink": "/r/movies/comments/1n5n1fa/what_classic_novels_do_you_feel_have_never_really/"
    },
    {
        "id": "1n69rle",
        "author": "Vadersleftfoot",
        "title": "Does anyone know where i could get an old Movie Ticket Machine that prints the old fashioned movie tickets we all remember and love?",
        "content": "I am looking for one because I'm hoping to open my own mini movie Theater, and I would like to print out tickets the way tickets used to be printed out on the heavier paper instead of the receipt paper or the heat paper. \n\nBecause it is so cheap and I really want to get back to the old way of printing movie tickets. Does anyone know where I would be able to find something like this? And what something like this would be called, or if there is a certain model number that someone is aware of that would be most helpful.",
        "upvotes": 13,
        "comments": 17,
        "media": null,
        "permalink": "/r/movies/comments/1n69rle/does_anyone_know_where_i_could_get_an_old_movie/"
    },
    {
        "id": "1n62f2x",
        "author": "dclan630",
        "title": "Glengarry Glen ross",
        "content": "I'm not good at analyzing movies really so I'd like some feedback on this.\n\nI just watched Glengarry Glen ross for the first time and thought it was amazing. 9/10 movie at least.\n\nWhat is it that makes this film so good? Obviously the dialogue is stellar and many classic quotables are dropped throughout the length of the film. Acting and writing is on point.\n\nUsually I like crime dramas, dark comedy, neo noir, and character studies, but this movie was solid. I've never heard of the director before watching it either.\n\nSo your thoughts on why so many consider this a classic?",
        "upvotes": 32,
        "comments": 73,
        "media": null,
        "permalink": "/r/movies/comments/1n62f2x/glengarry_glen_ross/"
    },
    {
        "id": "1n4tt9s",
        "author": "AnonymousTimewaster",
        "title": "Steve Carrell's 2004 audition for Anchorman",
        "content": "",
        "upvotes": 13585,
        "comments": 168,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2zee7pdupcmf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1n4tt9s/steve_carrells_2004_audition_for_anchorman/"
    },
    {
        "id": "1n5h6f5",
        "author": "wtfytya",
        "title": "What was the first movie that kinda shattered your childhood and showed you how messy the world really is?",
        "content": "For me, it was Matilda. My parents showed me this probably thinking oh this is just a movie about this cute little girl with superpowers! \n\nThis movie wasn’t just a cute kid’s flick it was the moment I realized the world is basically a chaotic mess but there’s still some hope. Miss Trunchbull? Basically every nightmare you didn’t know you had she literally turned dessert into a war crime. Poor Bruce was up there, shoving cake while the entire school was chanting. Then there’s that pigtail scene, That Little girl shows up with cute braids, and Trunchbull is likr “Oh, you like flying?” and just yeets her across the playground, I didn’t know whether to laugh or cry, that scene still terrifies me till this day.\n\nOh and Matilda’s parents, just the absolute champions of terrible parenting. The fact that those responsible to protect you can be so evil! \n\nThen there’s Miss Honey, the one decent adult in the whole story, her character to this day remains one of my favorite, wanted to be like her growing up.\n\nAnd Matilda? Tiny but mighty basically saying, “Screw your unfair world, I’ve got powers.”\n\nThis movie taught me life isn’t always flowers and sunshines, it’s messy, painful, but beautiful sometimes ! As a kid, this movie did some great numbers for me.\n\nWhat about you? What was the first movie that gave you that “oh crap, life is complicated” moment as a kid? How did it mess with your brain?",
        "upvotes": 410,
        "comments": 377,
        "media": null,
        "permalink": "/r/movies/comments/1n5h6f5/what_was_the_first_movie_that_kinda_shattered/"
    },
    {
        "id": "1n65wol",
        "author": "KingJak117",
        "title": "I hiked to where Lone Survivor (2013) was filmed",
        "content": "[Album](https://imgur.com/a/5ZgCmFO)\n\n**Why?:** Lone Survivor (2013) is one of my all-time favorite war movies, factual inaccuracies aside. I’ve always appreciated Peter Berg’s attention to detail with the rifles and gear and the beautiful scenery of the mountains. Once I learned that the film was shot on location in the Sangre de Cristo Mountains of New Mexico, I had to go see the site in person.\n\n**Finding the Site:** The behind the scenes footage from the Blu-Ray special features established the crew filmed at Ski Santa Fe, but I used Google Earth to narrow down the precise filming locations. [Using this large boulder for reference](https://imgur.com/yePWGEv) I was able to determine one scene was filmed at 35°47'35\"N 105°46'47\"W, elevation 11,658ft (3,553m). [Here is the same boulder from the other direction](https://imgur.com/QIEf0S4). For comparison, [here is the same location in person](https://imgur.com/ONLXKZA). Once there, [I found several crimp-nosed 5.56 blank cartridges cases](https://imgur.com/KYRRRrA).\n\n**The Hike:** Luckily, this area is located in the Santa Fe National Forest and is publicly accessible. The elevation at the parking lot is 10,295ft (3,138m) and the hike from there is about 1.4 miles (2.3km). Expect very steep slopes as this is a ski area after all. The most direct route was blocked off for construction when we visited, but we managed to find our own way. Regardless, this was the most physically difficult thing I’ve ever done. Why?\n\n**The Loadout:** I have something of a hyper fixation on the loadouts in this film, so I wanted to recreate them as authentically as possible. Feel free to skip this section if you do not share the same type of autism.\n\n&gt;![This blog](https://atrg836615659.wordpress.com/2019/04/18/anatomy-of-a-lone-survivor-loadout/) has an extensive breakdown of all 4 kits in the film and is a great resource. Overall, I did not clone a specific kit but rather borrowed elements of both Luttrell and Axelson’s kits.!&lt;\n\n&gt;![Supplementary photos](https://imgur.com/a/fwzRg6V)!&lt;\n\n&gt;!**Apparel –** USGI M83 BDU blouse that I raid modded. Added a subdued-tone Texas flag patch to the right arm and a two US ODG US flags to the left arm, one IR visible. Propper BDU khaki trousers. Merrell Moab 3 hiking boots. Green &amp; black shemagh. USGI khaki boonie hat. Mechanix woodland gloves (unfortunately not the black woodland ones as seen on screen)!&lt;\n\n&gt;!**Equipment -** Eagle Industries Rhodesian Recon Vest, khaki (the filmmakers cut costs by using Pantac instead, likely why their equipment appears a tan shade). 5x Eagle Industries double M4 mag pouches. 10x 30rd ar15 magazines fully loaded. 2x Eagle Industries pistol magazine pouches. 2x P226 magazines. 2x Eagle Industries frag pouches. Eagle Industries MBITR radio pouch (unfortunately no radio). Eagle Industries admin pouch with another Texas patch. Eagle Industries horizontal utility pouch. CAT tourniquet rubber banded to the right shoulder strap. Cold Steel SRK-C, the sheath spray painted desert tan (in the film they used SOG Seal Pup knives). 10x12 RMA Level IV ceramic plate (I’m aware none of the Seals wore plates, but I imagine they regretted that). 2x kevlar inserts from groin protectors (pro tip, you can slide these into the lining of the vest to act as additional fragmentation protection). Safariland 6004-77 drop leg holster. W. German Sig Sauer P226 (in the film they used M9s, but the MK25 would have been more authentic). Kelty Map 3500 backpack with some camo netting strapped to the bottom. Pro-Tec skate helmet with rachet NVG mount. I spray painted the helmet in the pattern of the flag of Texas but in ODG, desert tan, and earth brown (the film anachronistically used Ops core helmets iirc)!&lt;\n\n&gt;!**Rifle -** [MK12 Mod 1 cLoNe](https://imgur.com/E7Tnm8N)!&lt;\n\n&gt;!DS Arms MK12 Mod 1 upper. Allen Engineering AEM5 suppressor. H&amp;R M16A1 lower. KAC 98474 rear sight. KAC 99051 front sight. KAC 98060 bipod adapter. P&amp;S broomstick foregrip. PRI M84 gasbuster charging handle. Harris bipod with KWM Pod Loc. Larue MBT-2S. Ergo pistol grip. B5 Sopmod Government stock!&lt;\n\n&gt;!This stuff is all pretty straightforward for a MK12 Mod 1 build, but I decided to go a different route with the optic. The Leupold MR/T 2.5-8x36 scope and ARMS #22 scope rings are outclassed by modern options. To imitate their appearance without sacrificing quality and functionality (and my wallet), I militarized a civilian Leupold VX-R 2-7x33 scope. I added Kenton turrets, Butler Creek scope caps, MK Machining throw lever, and Larue LT123 scope rings. A little less magnification and a basic duplex reticle, but it’s still quite functional for how little it cost.!&lt;\n\n&gt;!I spray painted the rifle with Majic camouflage desert tan and earth brown. I highly recommend this paint. To better balance the front-heavy 12lb rifle, I added two 7oz steel rods to the battery compartment of the B5 sopmod.!&lt;\n\n&gt;!**Notable missing items-** Adventure Lights VIP IR strobe (lost the eBay auction) PEQ 2a IR designator (I don’t even have nods yet) PRC-148 radio, Davies TEA PTT, and Invisio M3 earpiece (Too much money for outdated comms) M67 frag grenades (thanks NFA)!&lt;\n\n**TL;DR: 65lb of gear + 12.4lb rifle and I live at sea level.**\n\nDespite training with the vest at the gym, I was woefully unprepared for the altitude. I was gasping for air every 50 feet or so exacerbated by the vest constricting the expansion of my lungs. I drank 3.5 liters of water on the way up. On the way down, my legs actually trembled with each step. Word of caution, walking downhill in the vest also blocks your line of sight to your footing so you cannot watch where you step.\n\n**Bonus:** On the way up to the boulder, we stumbled upon another filming location.[Pictured here](https://imgur.com/UkFB3we) is the behind the scenes notes from the location scout. Note that the cliff on the right, where Murphy makes the call, was added in post-production. [Here is the same area in person.](https://imgur.com/rZ2uHtD) The pictures really don’t do the verticality justice, I cannot believe they filmed out here.\n\nTL;DR: I hiked to where Lone Survivor (2013) was filmed, wearing full kit. Beautiful hike, definitely recommend.",
        "upvotes": 13,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6zQcMKdrt7ZhrAv9nFhqw-3omsIm3AhtToinMgr5zRs.jpg?auto=webp&amp;s=8fcccf77049fbd11bd9a47ab61af0ecbf60a688e"
        },
        "permalink": "/r/movies/comments/1n65wol/i_hiked_to_where_lone_survivor_2013_was_filmed/"
    },
    {
        "id": "1n5h5ef",
        "author": "TapExtension5900",
        "title": "Swingers is the best breakup movie for guys",
        "content": "First time watching. Just recently had my girlfriend break up with me while I was being manipulated and emotionally taken advantage of the whole time. Took me until the breakup to realize. \nI always watch films to try and distract my mind but try to tap in to ones that trigger exactly what I’m feeling. The “why won’t she call?” scene got some tears rolling, because that’s exactly what I’m wondering. It’s been a rough few weeks, but I know that treatment is not what I deserve. \n\n“Baby you’re so money and you don’t even know it”\n\nOddly some of the most inspirational and motivating words I’ve heard from anyone while going through this. ",
        "upvotes": 349,
        "comments": 52,
        "media": null,
        "permalink": "/r/movies/comments/1n5h5ef/swingers_is_the_best_breakup_movie_for_guys/"
    },
    {
        "id": "1n5ootx",
        "author": "Nice-Chef-3364",
        "title": "What annoys you most about film criticism/discussion nowadays?",
        "content": "What’re some things that annoy you personally the most about film criticism/discussion these days?\n\nThere are a few things but the main one I miss is general nuance. It either has to be a 10/10 movie or it’s terrible. There’s no acknowledging of good things in bad movies (which sometimes isn’t easy to find so sometimes there is just nothing redeeming about it) or criticisms for good movies. It’s always “well is it a fresh or rotten review?”, “What’s the rating?” “Sum up your thoughts in a sentence”, “movie good or movie bad”. \n\nI’m also sick of the “well you didn’t agree with me on a movie therefore I can’t listen to your opinions about anything”. It’s. Subjective. Someone not reacting the same way as you doesn’t mean their opinion is invalid. \n\nOr the whole “they just hate fun” argument. Or “why can’t you just enjoy it??! It’s not that deep!” I don’t go into every movie thinking I’m going to hate it. I do give the benefit of the doubt. \n\nSure some opinions can be pretentious. Hell - I’ve been in that boat where I question someone’s tastes because they’ll say something isn’t “that bad”. And I did not handle those conversations well. But now I don’t try to make them think they’re wrong for an opinion. I try to ask what worked for them or what didn’t. Sometimes they’ll give me a boring answer like “I was just entertained” but sometimes they’ll throw a point that I may not agree with but can understand. \n\nThere are people who are genuinely nuanced in their approach to talking about movies. But good grief it’s not what it once was. I don’t want to sound like that old guy by saying that given that I’m in my late 20’s but it has gotten worse in the last decade. ",
        "upvotes": 75,
        "comments": 402,
        "media": null,
        "permalink": "/r/movies/comments/1n5ootx/what_annoys_you_most_about_film/"
    },
    {
        "id": "1n63fnk",
        "author": "indiewire",
        "title": "Gus Van Sant on the Luigi Mangione Link to His Hostage Thriller ‘Dead Man’s Wire,’ the Legacy of ‘Elephant,’ and Streaming vs. Theatrical",
        "content": "",
        "upvotes": 12,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-t1kgWB6Jh_5wHcmcP-uG5hV2rpM5jDhC8aeDwjxQ3Y.jpeg?auto=webp&amp;s=7d414766162083b48fad10ec4c1515a19e73bccd"
        },
        "permalink": "/r/movies/comments/1n63fnk/gus_van_sant_on_the_luigi_mangione_link_to_his/"
    },
    {
        "id": "1n5rhm9",
        "author": "GandalfSkywalker83",
        "title": "Current singers/bands who will have a biopic in 30-40 years, if not sooner.",
        "content": "My wife and I did a bit of a biopic marathon this weekend. We watched Bohemian Rhapsody, Rocketman, Walk the Line, and Straight Outta Compton. Each was released approximately 30-40 years after the singer/band was at their most popular. It got me thinking about which current artists will inevitably have an Oscar-bait biopic in the next 3-4 decades. \n\n I landed on Taylor Swift, Justin Bieber, and Eminem. Taylor Swift because she’s Ari ably the biggest pop star right now and doesn’t show any signs of not continuing to dominate music, at least in the eyes of her very loyal fans. And she has had a complex dating history which will make nice story beats in a bio pic. Justin Bieber because he’s had quite the fall after rising very rapidly at a young age and because of his proximity to some nefarious  actors in music’s history. And Eminem because he’s such a polarizing yet popular figure with his own substance abuse and mental health struggles; that Oscar writes itself lol. And I know we had kind of a biopic on him already with Eight Mile, but he’ll inevitably get a proper biopic.\n\nWhat current artists do you see getting a biopic in the next 30-40 years? And why?",
        "upvotes": 55,
        "comments": 352,
        "media": null,
        "permalink": "/r/movies/comments/1n5rhm9/current_singersbands_who_will_have_a_biopic_in/"
    }
]