[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 11,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 715,
        "comments": 5196,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1nzotzy",
        "author": "camwtss",
        "title": "does ANYONE like the ed gein series?",
        "content": "im bummed because i was really looking forward to watching this, but i have seen nothing but negative comments about it. did anyone enjoy it? or is it a waste of 8 hours.",
        "upvotes": 103,
        "comments": 287,
        "media": null,
        "permalink": "/r/netflix/comments/1nzotzy/does_anyone_like_the_ed_gein_series/"
    },
    {
        "id": "1nzv2dk",
        "author": "Adventurous_Ant5428",
        "title": "Why didn’t Alice in Borderland ever gain popularity like Squid Game?",
        "content": "Kind of similar premise involving survival games, so why didn’t Alice in Borderland seem to gain as much traction? It has a more complex storyline and the games are arguably more interesting. ",
        "upvotes": 19,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1nzv2dk/why_didnt_alice_in_borderland_ever_gain/"
    },
    {
        "id": "1nyv5v2",
        "author": "DMFD_x_Gamer",
        "title": "Just found a relic in a packed away box.",
        "content": "Still has a CD in it. Not sure what the movie is though. The envelope is sealed. I dont even have a DVD player anymore so im in no real hurry to see what's inside. Still a cool find. ",
        "upvotes": 1173,
        "comments": 121,
        "media": null,
        "permalink": "/r/netflix/comments/1nyv5v2/just_found_a_relic_in_a_packed_away_box/"
    },
    {
        "id": "1nzp5lx",
        "author": "GoldDerby",
        "title": "‘Monster: The Ed Gein Story’ star Charlie Hunnam reflects on ‘Sons of Anarchy’ awards snubs: ‘Nice to receive them, bad form to covet them’",
        "content": "",
        "upvotes": 13,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nzp5lx/monster_the_ed_gein_story_star_charlie_hunnam/"
    },
    {
        "id": "1nz263e",
        "author": "no_tengas_miedo",
        "title": "Ed Gein is pretty bad",
        "content": "At first I thought it was going to be good. Especially the first 2 chapters, I liked them a lot, but throughout the series my desire to watch it disappears. It all consists of telling stories about psychosis actors, the Texas massacre, film producers who were inspired by him, and above all, romances they have had and experiences that are not real or are still theories.\nI thought I was going to see how Ed Gein acted, the things he did, what he did with corpses, everything. But instead I find that shit. \nI had a lot of hype for this season, I thought it would be good and above all that it would be the creepiest of all. But it feels pretty bad. It's morbid of me to want to see more of what the crimes were like and how he really acted, but damn, that's better than wanting to see stories that never happened about his life.",
        "upvotes": 378,
        "comments": 316,
        "media": null,
        "permalink": "/r/netflix/comments/1nz263e/ed_gein_is_pretty_bad/"
    },
    {
        "id": "1o01eh3",
        "author": "leaveitbetter20",
        "title": "INSIDE, who's watching",
        "content": "So I started watching INSIDE on Netflix and wasn’t sure what to expect, but now I’m low key addicted 😅 I’m on episode 5 already! Who else is watching this?? 🍿👀🍿",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o01eh3/inside_whos_watching/"
    },
    {
        "id": "1nytmw9",
        "author": "Last-Upstairs1387",
        "title": "What is a Netflix show you think deserved way more attention",
        "content": "I just finished watching The OA and honestly I cannot stop thinking about it. I had heard about it years ago but never got around to watching it until now. And wow. It was so different from anything I have seen before. Strange, emotional, and full of mystery. The way the story was told kept pulling me in. I kept wondering what would happen next.\n\nAfter I finished I looked it up and saw it had a lot of praise but was cancelled after only two seasons. That made me kind of sad because I really feel like it could have gone somewhere even bigger if it had more time. Netflix has so many shows that end up disappearing under the radar, even when they are really good.\n\nSo I wanted to throw this out to the community. What is a Netflix show you think deserved way more attention? Not the big ones everyone talks about, but those hidden gems that maybe only a small group of people know about.\n\nFor me The OA will stick with me for a long time. I keep thinking about its ending and the questions it leaves open. I wish more people had seen it so we could talk about it.\n\nI would love to hear your picks. Is there a show you watched on Netflix that surprised you and deserved more love? Something you wish had gotten more seasons or more people watching? I feel like this could turn into a great list of hidden gems we all need to check out.\n\n",
        "upvotes": 616,
        "comments": 855,
        "media": null,
        "permalink": "/r/netflix/comments/1nytmw9/what_is_a_netflix_show_you_think_deserved_way/"
    },
    {
        "id": "1nzzgp7",
        "author": "gumOnShoe",
        "title": "Running out",
        "content": "I've been a customer since DVDs. Was super excited to cut the cord. Was all about streaming, didn't once opt for the cheaper plan, but it's finally happened. I've reached the end of my list and Netflix is no longer keeping up with my viewing habits. \n\nI'm wondering if stranger things will be my last month subscribing. I used to be able to count on having a show that was fine that i didn't care much about, but was interesting enough to put on with the wife. Neither one of us are very stratified or interested in what's left. There used to be something to at least consider each month, but since they started splitting seasons it's more like something every three months. \n\nWe quit HBO/max when they stopped delivering new content just before the discovery merger, though it became clear paying for months of zero content was their plan. Disney is just as bad. We're just paying for a library. As soon as the youngest is old enough to not break disks I'll probably dig out the player and cancel that too. Cancelled prime due to the ads.\n\nApple was doing the best, but the drip is slow, so we're waiting for content.  I'm not against reading a book or checking out from the library. I have always loved movies and tv, but what I love is story and novel content. \n\nI know a bunch of you are agrieved over cut and cancelled shows. I hear that, but I didn't much care as long as something was around to watch. I think we might move to streaming 3 months out of the year or something. \n\nBasic cable was somehow better, and I'm throwing up in my mouth saying that.\n\nBut maybe I'm just not being surfaced good content that exists? What we've liked (here or elsewhere): bsg, last air bender (not the live action), fullmetal alchemist, outlander, stranger things, lupin, sandman, wednesday, good place, severence, big door prize, lucifer, game of thrones, firefly, trek (Voyager, strange be worlds), bridgerton (i tolerate it), witcher, wheel of time, rings of power, umbrella academy, lockwood &amp; co, ted lasso, unstable, murder bot, pluto, mrs maisel, shadow and bone, upload, disenchanted, warehouse 13, eureka, cobra kai, lost in space, Westworld, merlin, dragon prince, community, andor, murder bot, arrested development, Queens Gambit\n\nProbably more too... But Netflix thinks I just like horror or trash romance. I actually kinda hate horror, it's only when the writing is very good that I get past that. I watched squid games (for the wife) and wouldn't choose to put myself through that again \n\nI've bounced off: black mirror, the boys, foundation, supernatural, most of the new star wars stuff, most of the new trek stuff, halo, most sitcom/reality stuff\n\nThen there stuff that I'd watch, but only if there's nothing else: altered carbon, top chef, mandalorian, and other stuff where the vision or writing isn't quite good, but I'll deal because it feels like they were trying.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nzzgp7/running_out/"
    },
    {
        "id": "1nzsjrb",
        "author": "Timewilltell755",
        "title": "Did anyone start watching The Way Home?",
        "content": "Season 1 and 2 is on Netflix.  Originally on Hallmark.  So good.  Already half way through season 2.  There are 3 seasons.  Hopefully the 3rd one will be added.  ",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nzsjrb/did_anyone_start_watching_the_way_home/"
    },
    {
        "id": "1o01983",
        "author": "Original2021",
        "title": "The missed opportunity in the Angela series",
        "content": "The series started off great but the ending fell so flat. And then there’s Angela’s friend who is also her lawyer. I thought the whole time the lawyer friend was in on it, but it turns out that’s not true. That was disappointing because the series spends a lot of time setting up for something else to happen and then in the last episode nothing. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o01983/the_missed_opportunity_in_the_angela_series/"
    },
    {
        "id": "1o00sun",
        "author": "Eclipse8301",
        "title": "WWE Raw on Netflix question",
        "content": "So I used to have the version of Netflix that had ads. I recently moved to the ad free version, and I just realized tonight that I still get ads on the live programming. What I don’t understand is before with my ad free version I could start the show a half hour late and it would auto skip. The commercials had already were done until I caught up live. (the next day on demand I would be forced to watch them.)\n\nMy question is now I’m forced to watch ads even starting late. Is this something brand new?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o00sun/wwe_raw_on_netflix_question/"
    },
    {
        "id": "1nzlmyr",
        "author": "Onedeadchild",
        "title": "Not Part Of The Netflix Household",
        "content": "I don't have a photo of what I'm talking about but anyone who is struggling with figuring how to get around Netflix trying to get around not being on the same wifi just turn your device on airplain mode then open Netflix and sign in once in the show selection then just turn airplane mode off, it's the quiest and easiest solution. If anyone has any better ways please let me know I'm a broke college kid trying to mooch off my mom still.",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nzlmyr/not_part_of_the_netflix_household/"
    },
    {
        "id": "1o0096k",
        "author": "MattNola",
        "title": "The “movie” scenes on the New Ed Gein show.",
        "content": "Completely enamored by the scenes where they take the real life movies and recreate them, the did especially well with the Texas Chainsaw one’s, my question is are there any other Tv shows or movies where they do this? Only one I can really think of off the top of my head is Snowfall when at the end they were filming Boyz N the Hood. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o0096k/the_movie_scenes_on_the_new_ed_gein_show/"
    },
    {
        "id": "1nzjp0v",
        "author": "Sweaty-Toe-6211",
        "title": "Ginny &amp; Georgia S4 Is Now In Production! It'll Run Through To Late February.",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nzjp0v/ginny_georgia_s4_is_now_in_production_itll_run/"
    },
    {
        "id": "1nzsw76",
        "author": "mmmadness",
        "title": "'A House of Dynamite' Review: Kathryn Bigelow's American Nuclear Thriller Explodes in a Vacuum",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nzsw76/a_house_of_dynamite_review_kathryn_bigelows/"
    },
    {
        "id": "1nzi0n3",
        "author": "rainj97",
        "title": "What Ed Gein and the real life characters in controversial Monster series actually looked like",
        "content": "",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nzi0n3/what_ed_gein_and_the_real_life_characters_in/"
    },
    {
        "id": "1nzuffu",
        "author": "Aesrone",
        "title": "Why can’t this multi-hundred-billion dollar company properly keep track of where I’m at in a show?",
        "content": "If I watch half an episode of a show, I go back later and it either starts at the beginning or thinks I’m on the next one. If I pause Netflix on my TV for 10 mins and come back, it loses where I’m at and exits the app, doesn’t happen with any other service. If I watch half an episode on my iPad, then try and finish it on my tv, it loses my progress AND puts me back one or two episodes. \n\nAm I alone or does everyone deal with this? \n\n",
        "upvotes": 2,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1nzuffu/why_cant_this_multihundredbillion_dollar_company/"
    },
    {
        "id": "1nznsru",
        "author": "skawngurr__",
        "title": "in dire need of series/movie recs",
        "content": "for context: i j finished watching the **ed gein series on netflix.** as controversial as it is i loved that series, think it was a well-made dramatization. i love true crime podcasts, and other true crime stuff. i love **severance** too. \n\nalso love a lot of **nolan's films, thrillers, mind-bendy, plot twisty films and series.** also finished watching  **the pitt**, which i absolutely loved and binged in a night. i also finished watching **the girlfriend** recently and loved it too. lately its been quite difficult for me to get so hooked on a series or a movie coz i have shit attention span, so i need something out of the ordinary super good that's gona keep me hooked and hyperfixated for a while. and i don't mean good good i mean out of this world crazy good.\n\nplease and thanks!",
        "upvotes": 2,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1nznsru/in_dire_need_of_seriesmovie_recs/"
    },
    {
        "id": "1nz5cy6",
        "author": "Lifesabitch59",
        "title": "Ed gein",
        "content": "Why couldn't they stick to just the facts of this case! That is enough to be a great series. All the fake storylines just take away from the series imo",
        "upvotes": 28,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1nz5cy6/ed_gein/"
    },
    {
        "id": "1nzgjcw",
        "author": "sadpengolin",
        "title": "Useless help",
        "content": "I messaged help to let them know a main movie wasn't showing subtitles (mainly blocked audio for me) and they just wanted to know my name and area. If I can't hear and therefore can't read it, who cares? I reset my device and checked all the settings but I guess it's just me?\n\nPs don't watch any ghost movies if hard of hearing",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nzgjcw/useless_help/"
    },
    {
        "id": "1nzo7i6",
        "author": "Odd_Negotiation5318",
        "title": "Made a tool to learn English while binge-watching Netflix - thought you might like it",
        "content": "Netflix addict here 🍿\n\nRealized I was watching hours of English content but not really learning. So I built a Chrome extension that lets you:\n\n✓ Click words in subtitles to save them\n\n✓ Get AI flashcards based on the show you're watching \n\n✓ Actually remember vocabulary from your favorite series\n\n**Perfect for:**\n\n\\- Non-native speakers improving English\n\n\\- Students preparing for TOEFL/IELTS\n\n\\- Anyone who wants to learn while watching Stranger Things for the 10th time 😅\n\n**Free version**:  50 words + basic flashcards\n\n**Premium:** Unlimited everything ($4.99/month)\n\n[https://chromewebstore.google.com/detail/ihpcbahpgelkeebgolejlpipcogffacd?utm\\_source=item-share-cb](https://chromewebstore.google.com/detail/ihpcbahpgelkeebgolejlpipcogffacd?utm_source=item-share-cb)\n\n\\[Demo video\\]\n\n[https://youtu.be/NEXclpKPMYw?si=lMkNtxXJVfKd0QLX](https://youtu.be/NEXclpKPMYw?si=lMkNtxXJVfKd0QLX)\n\nBeen using it myself for 6 months - my English vocabulary doubled!\n\nHappy to answer questions 👇\n\nFlair : Discussion",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nzo7i6/made_a_tool_to_learn_english_while_bingewatching/"
    },
    {
        "id": "1nzytya",
        "author": "YesterdayCharacter46",
        "title": "Thoughts on Monster: The Ed Gein Story",
        "content": "There’s a lot of contradictory feelings after watching this show, evoking questions I couldn’t shake. And I think I have an answer. What makes this show so powerful isn’t just its retelling of a notorious killer’s story, it’s how it examines the way we, as viewers and as a culture, respond to horror itself. The series constantly moves between Ed Gein’s real life and the films his crimes inspired, like Psycho and The Texas Chainsaw Massacre. This isn’t just a storytelling choice; it’s a reflection on how cinema has transformed real human tragedy into art, often by exaggerating, sexualizing, or dramatizing it to evoke emotion. But where those films turned horror into spectacle, this show turns it into introspection. It forces us to sit in contradiction, to see Gein as both a monster and a victim, to feel empathy for someone we know we should despise. That conflict, the disgust we feel for our own compassion, is the emotional core of the series. The show uses that contradiction not to excuse him, but to expose the blurry moral line between understanding evil and consuming it as art. In the end, Monster: The Ed Gein Story isn’t just about Ed Gein at all. It’s about us and our fascination with darkness, our need to categorize people as purely good or evil, and our discomfort when art refuses to let us do that. It’s a story that doesn’t give us the comfort of moral clarity, and that’s what makes it so unsettling and, ultimately, so meaningful.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nzytya/thoughts_on_monster_the_ed_gein_story/"
    },
    {
        "id": "1nzmi8g",
        "author": "eeejit075",
        "title": "House of Guinness",
        "content": "Is anyone watching this?  My wife recommended it to me (mainly because years ago I used to drink a lot of Guinness) but lately she’s been watching it, and what little I’ve seen and heard sounds really confusing, jarring and violent. Thoughts?",
        "upvotes": 2,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1nzmi8g/house_of_guinness/"
    },
    {
        "id": "1nz2i0y",
        "author": "DefiantRanger9",
        "title": "Any suggestions for a cute, fun series",
        "content": "With 20-30 minute episodes? Some shows I’ve enjoyed so far were Kim’s Convenience, Good Girls, Weeds, Schitts Creek, Reba and Seinfeld (rewatch), Workin Moms was hilarious, and Shameless (even if the episodes were a bit longer). Oh, Younger was kind of cute too. ",
        "upvotes": 19,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1nz2i0y/any_suggestions_for_a_cute_fun_series/"
    },
    {
        "id": "1nybuog",
        "author": "TheCruelHand",
        "title": "What the hell did they do to the Ed Gein story?",
        "content": "I get taking some creative liberties, but holy shit did they do everything they could make stuff up. \n\nIt will take any common person two seconds of research to learn that this isn’t how his life really was. \n\nIt is a major known fact that after his mother died, he boarded up her room and left it the way it was the day she died. And that he never dug his mother up. \n\nBut somehow here that’s exactly what’s happened?\n\nIt’s known he made furniture, bowls and a skin suit out of the people he dug up. \n\nI’m only on episode 4 and it’s like pulling teeth trying to watch this show at this point. \n\nAlso what with parallel story about Alfred Hitchcock that wasn’t shown at all in the trailers?\n\nRyan Murphy should not be allowed to make shows anymore.  \n\n\nUpdate - I’ve been corrected, he turned one of his victims into his “mother” and put his mother’s clothes on her. That is my mistake \n",
        "upvotes": 851,
        "comments": 546,
        "media": null,
        "permalink": "/r/netflix/comments/1nybuog/what_the_hell_did_they_do_to_the_ed_gein_story/"
    },
    {
        "id": "1nzqbr8",
        "author": "ThrowRAalluminiumll",
        "title": "Monsters: Ed Gein (Not that bad)",
        "content": "Before anything, I am open to genuine educated discourse about this topic as it may be touchy for some.\n\nI just recently finished watching the new Monsters series and I have to say, I feel like people are dragging it. I don’t think the series was actually that bad at all tbh. If you aren’t someone who’s interested in crime and horror films and didn’t know anyone mentioned in the series, then I can see how it threw you off. I will say creating a fake storyline between Richard Speck, Ted Bundy, and Ed gein was completely unnecessary, especially being that there were no correlations between each person. However, i think this series really humanized Ed gein and is it bad to say that I felt genuine sympathy for him. The series prompted me to look further into his case and he wasn’t a serial killer the way media infamously portrayed him to be. \n\nNow I want to clarify, I DO NOT advocate for violence or harm to anyone in any way. I do think though, had there been earlier intervention and his diagnosis been caught earlier, his crimes could’ve been prevented. Granted this was back in a time where mental health education was relatively brand new, and berated. If Ed’s mother was indeed extremely religious and verbally violent, it’s easy to see how this happened, forcing a co-dependent relationship with Ed, creating this person who quite literally couldn’t live without his mother. It always makes me sad finding out that once medicated and properly treated these people turn into model citizens. If I’m being honest, the series really shined a light on just how important mental health research is. Not everyone with a mental illness is a criminal, however, a lot of criminals have extremely unchecked mental illnesses. The way they described Ed gein also made me think he might’ve had some delayed mental development but again, being that this was in the 1950’s and he was born in 1906, I’m sure schizophrenia was all they cared to search for, because even that they had little to no knowledge about. \n\nI know I might get crucified for this but I wouldn’t say Ed Gein was a bad person. What he did was bad of course. No one should be able to take someone’s life, mental illness or not. The matter of the fact though, is that he was extremely unwell, always had been. The death of his mother threw him into this new world and it accelerated his mental decline. Being alone, with schizophrenia, and possibly other undiagnosed mental illnesses, he tried to cope and he couldn’t. He was in denial that his mother was gone and so believed that if he “re-created” her, she’d still be there. And that is really sad to me. \n\nIt seemed like the Planefield WI PD also just needed someone to pin the rest of the missing persons on someone. I read the other cases they “suspected” him of and there was no connection other than they found he killed two people so he must’ve killed more in WI. ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nzqbr8/monsters_ed_gein_not_that_bad/"
    },
    {
        "id": "1nzk4fq",
        "author": "ToonAdventure",
        "title": "The Twits | Official Trailer | Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nzk4fq/the_twits_official_trailer_netflix/"
    },
    {
        "id": "1nz2bvd",
        "author": "itsmebroskies",
        "title": "Wayward and Mae’s acting (spoilers)",
        "content": "I literally spent the whole first episode repeatedly questioning who would cast Mae for a role in this show, and a lead role none the less, just for the episode to end and Mae’s name being cited as the creator and (sometimes) writer. Their acting was so incredibly horrible, it felt like a self insert fan fiction where they could be the “good” guy and wear tank tops that show off their biceps, and then occasionally take it off to show their tattoos and muscles. They’re so flat and lack any genuine emotion or expressions and should have never been given a lead role, even if they created it, was the director not doing their job? Why’re they being out acted by literally EVERY character and child in the show. Even that little cute kid that won the mountain episode was amazing despite barely having any speaking lines. I think they were out of their depth and should’ve stayed as a creator but had the self awareness to understand that they weren’t fit for this job.\n\nThe show itself was really interesting and had a lot of potential, however, there were some confusing plot lines. Honestly, for the most part, it seems like the “therapy” they do actually helps the kids confront their issues in a way? But then Abbie told Leila that it was just Evelyn messing with her head and that her original memories were actually true. This was kind of confusing because it seemed like blocked trauma coming out but if they meant for it to be just a manipulation of Evelyn then I think it didn’t translate fully for me. Of course this isn’t to say that everything happening at the school wasn’t fully insane. The ending also didn’t sit right, specifically Alex’s character arc. How does the character who is constantly trying to do good end up staying through that? Is it because he keeps violently hurting people over and over again so now he feels connected to her because “awe babe we’re both murderers &lt;3)? He pissed me off so much every time he would hurt someone because, for example, with that one dad whose house he went to, he could’ve fully stopped him and told him that he wasn’t a spy, but he chose to beat his ass till he was half dead? If they meant to show that Evelyn was right because he repeated the patterns of his fathers violence even while actively trying to be different then that would make sense, but I think the way they wrote the story, and once again, Mae’s HORRENDOUS acting, it didn’t translate well. I suppose it would also make sense why he chose to stay given Evelyn’s scene telling them that he doesn’t love his wife and he just loves the idea of the family she can give him, but I think these thoughts and emotions should’ve been expressed in a better way, because with Alex’s constant flat tone and facial expressions regardless of what’s happening in the scene, you’d think there were pebbles up there.\n\nAlso, a little note of appreciation for the actress who played Evelyn, she was AMAZING, her character deserved a bigger, better show.\n\nWhat do you guys think? I think writing all of this down helped me understand some decisions that I hadn’t considered.",
        "upvotes": 15,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1nz2bvd/wayward_and_maes_acting_spoilers/"
    }
]