[
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 79,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 22,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1lt3rus",
        "author": "NoWhereNorth-II",
        "title": "Sandman S2 is out - who remembers S1?",
        "content": "\nI have had enough with Netflix disappearing for years between seasons. The Sandman S2 is out approx 3 years after S1. I do not remember S1 and I have had enough rewatching old seasons. \n\nAnd Netflix cannot blame the pandemic, they have been releasing content throughout the past 3 years. \n\nI have made a vow never to watch a new season if it is too far out that I cannot recall the previous season. \n\nNetflix needs to reconsider how they prioritize their content investments. \n\nDo you feel the same?",
        "upvotes": 28,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1lt3rus/sandman_s2_is_out_who_remembers_s1/"
    },
    {
        "id": "1lsmlz5",
        "author": "Fragrant_Peanut_9661",
        "title": "Mr Robot",
        "content": "So I'm just about to start this. Mr Robot. I'm doing it based off recommendations from here. Is it really as good as I've heard? I'm like horror/thriller normally. But I've heard a fuck-ton of ranting and raving over it. So I'm gonna give it a shot! 🤞🏻📺",
        "upvotes": 109,
        "comments": 77,
        "media": null,
        "permalink": "/r/netflix/comments/1lsmlz5/mr_robot/"
    },
    {
        "id": "1lsxbuc",
        "author": "Natural_West4094",
        "title": "Where has all the good stuff gone?",
        "content": "This has probably been asked a thousand times already - is the netflix algorithm hiding all the good stuff or is netflix just shit now?\n\nThe algorithm is giving me more and more of the shit stuff that I don't like, and so I end up watching the least terrible thing I can find (or switching off) and I think this is reinforcing the shit stuff that is offered to me. And it seems to have gotten worse since the UI was updated. Or is there really nothing to watch on netflix?\n\nAnd its now always pushing for me to rewatch everything I've already watched, like just minutes after I've finished something it's the big main full screen suggestion. What's that about? Where's all the good stuff? Is there a way to game the algorithm so I can see the stuff it's not showing me? Or is Netflix really just Korean melodramas and 20 year old terrestrial TV dross.\n\nI'm using netflix so much less since the ui was updated that I'm starting to wonder if the algorithm is designed to find the sweet spot between keeping me paying but watching nothing. :(",
        "upvotes": 14,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1lsxbuc/where_has_all_the_good_stuff_gone/"
    },
    {
        "id": "1lsts5i",
        "author": "Miserable_Spray6539",
        "title": "another mini-serie to binge watch?",
        "content": "i just finised Sirens in one night and I LOVEDDD IT !! seriously i would have never tought of that, after every episodes i wanted to know more. do u have something similar? i like drama/actions/suspense/murder themes 😍🤭 i watched perfect family this week too and liked it\n\nTIA",
        "upvotes": 18,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1lsts5i/another_miniserie_to_binge_watch/"
    },
    {
        "id": "1lszllo",
        "author": "LeatherMiserable4414",
        "title": "Good true crime documentaries to watch?",
        "content": "Hello, i am just now trying to get into true crime. Although i dont really know where to start. Figured i would hop on here and then ask you guys.. Thank you!!!",
        "upvotes": 4,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1lszllo/good_true_crime_documentaries_to_watch/"
    },
    {
        "id": "1lsvsep",
        "author": "Airirazig",
        "title": "[Discussion] Dept. Q - Great Show",
        "content": "An absolutely riveting series with Matthew Goode as a detective assigned to the cold case files because he’s a pain in the butt to his department. The case is about a missing prosecutor who may or may not be dead but has disappeared. \nFrom a Polish (or German, I can’t remember which) series. It kept me glued to the set and the last two episodes are explosive with revelations and the ending had me crying with joy. Adapted by Scott Frank who did the same for The Queen’s Gambit, from the novel by Walter Tevis (small plug: Tevis was my college writing professor.)",
        "upvotes": 11,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lsvsep/discussion_dept_q_great_show/"
    },
    {
        "id": "1lt2lij",
        "author": "spenceryahoo",
        "title": "Creeped Out",
        "content": "I feel as though this show has left most of our minds, it was AMAZING!! What the hell happened to it? Two short seasons and it was over, so upsetting. I rewatch it every couple of months and I’m always left begging for more. I personally think the acting and storylines in each episode are literally just perfect, and the reoccurring character of “The Curious” really just ties together the entire series!",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1lt2lij/creeped_out/"
    },
    {
        "id": "1lsw54s",
        "author": "Crandin",
        "title": "Edgerunners Returns With a New Director and a New Story",
        "content": "",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lsw54s/edgerunners_returns_with_a_new_director_and_a_new/"
    },
    {
        "id": "1lsie08",
        "author": "ToonAdventure",
        "title": "Cyberpunk: Edgerunners 2 | Official Teaser | Netflix",
        "content": "",
        "upvotes": 39,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lsie08/cyberpunk_edgerunners_2_official_teaser_netflix/"
    },
    {
        "id": "1lt3z0y",
        "author": "MaceShyz",
        "title": "Random Button",
        "content": "I searched the sub, I see old posts, but im making a new post anyway. I want a damn random button, a pure random button with no agenda, and what I mean by that, when you hit random it will pull a random movie or the 1st episode of a tv show, not a movie and tv show Netflix wants to promote. You keep increasing the prices, so im going to demand a feature that shouldn't be hard to implement. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lt3z0y/random_button/"
    },
    {
        "id": "1lt3bzx",
        "author": "InterviewCareful1784",
        "title": "Plot twists in the survivors series",
        "content": "I was spoiled by the killer reveal in the survivors. Does it have other unpredictable plot twist in the series? I don't want to be disappointed. looking forward for the series ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lt3bzx/plot_twists_in_the_survivors_series/"
    },
    {
        "id": "1lsyb6b",
        "author": "Automatic-Variety429",
        "title": "Weird Netflix Dolby Vision glitch",
        "content": "Hi everyone,\n\nApologies if this isn’t the right place—this issue relates to both Netflix and my TV, so I thought I’d start here.\n\nWhen watching Dolby Vision content on my LG M3 77”, I’ve noticed the overall picture appears quite dark. I understand this has been discussed before, and that the darker image is often a creative choice by the filmmakers rather than a technical limitation—especially with Dolby Vision, which isn’t always used to its full dynamic range. Even in daytime scenes, the average brightness tends to be much lower than standard SDR content.\n\nWhat puzzles me, though, is the contrast between the playback and the scene thumbnails. When scrubbing through scenes, the thumbnails appear much brighter and more vivid—more in line with what I’d expect from HDR content.\n\nHas anyone else experienced this? Is this behaviour down to Netflix, or something to do with how LG handles Dolby Vision?\n\nThank you!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lsyb6b/weird_netflix_dolby_vision_glitch/"
    },
    {
        "id": "1lt2gm8",
        "author": "Only-Cartographer488",
        "title": "Enjoy this fantastic interview with Despair of The Endless!",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lt2gm8/enjoy_this_fantastic_interview_with_despair_of/"
    },
    {
        "id": "1lt1nkb",
        "author": "starwarden2245",
        "title": "Full screen mode shifting on laptop",
        "content": "I have a windows 11 laptop and whenever I watch Netflix on the app in full screen mode specifically, the shows tends to glitch and move as shown in the vid. It doesn’t happen when playing on non fullscreen and also doesn’t happen with other apps like YouTube. Anyone know how to fix this issue? It rlly bothers me cuz it takes out of the watching experience",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/kw050p3fd9bf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1lt1nkb/full_screen_mode_shifting_on_laptop/"
    },
    {
        "id": "1lsox1p",
        "author": "ChipsnGiggles23",
        "title": "Show I can’t remember the name of",
        "content": "I’m pretty sure it was Netflix and this was years ago, but the scene that really stuck out to me was a husband and wife. We’re having a barbecue of some sort of possibly a birthday party for him and his wife goes to the trunk of his car and finds a second phone in the trunk and that their family friend is having an affair with him she is looking at the phone as well as all of the people in their lives at the party who knew about the affair",
        "upvotes": 9,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1lsox1p/show_i_cant_remember_the_name_of/"
    },
    {
        "id": "1lszlho",
        "author": "LeatherMiserable4414",
        "title": "Good true crime documentaries to watch?",
        "content": "Hello, i am just now trying to get into true crime. Although i dont really know where to start. Figured i would hop on here and then ask you guys.. Thank you!!!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lszlho/good_true_crime_documentaries_to_watch/"
    },
    {
        "id": "1lssn53",
        "author": "Constant_Deal8224",
        "title": "Series Missing!",
        "content": "I was watching supernatural, lost and prison break on netflix and now they are gone. What happened? I am from India . Anybody aware of what is going on?",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lssn53/series_missing/"
    },
    {
        "id": "1lsvmtq",
        "author": "S4v1r1enCh0r4k",
        "title": "'Cyberpunk: Edgerunners' Season 2 Production Confirmed With Haunting New Teaser",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lsvmtq/cyberpunk_edgerunners_season_2_production/"
    },
    {
        "id": "1lsqh19",
        "author": "Sea_Entrepreneur6204",
        "title": "The Last bullet trilogy",
        "content": "I feel this has been buried in Netflix and is a much better action film than the Old Guard. It's Fast and Furious if they stayed with practical stunts and a cops and robbers (vs global super spies) theme. \n\nThe stunt work in this is really so very good it deserves a wider audience and more marketing. ",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lsqh19/the_last_bullet_trilogy/"
    },
    {
        "id": "1lsymn3",
        "author": "Jolly_Peace_890",
        "title": "Join us in r/Saja_Boys to discuss everything related to the K-pop Demon Hunters boy group, Saja Boys!",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lsymn3/join_us_in_rsaja_boys_to_discuss_everything/"
    },
    {
        "id": "1lssw4q",
        "author": "bahiyyihfiend",
        "title": "how did jinu get his soul back to give to rumi in kpop demon hunters?",
        "content": "isn’t he dead? at least i thought so bc he’s 400 years old and a demon. idk i feel like there was a lot of holes/stuff unanswered, especially since the original film was suppose to be 3 hours long. still don’t understand how they made the 3 hour film into a hour and a half long movie😔",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lssw4q/how_did_jinu_get_his_soul_back_to_give_to_rumi_in/"
    },
    {
        "id": "1lsy0ef",
        "author": "S4v1r1enCh0r4k",
        "title": "Lee Byung-hun Talks Front Man’s Future and Possible Squid Game Spinoff",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lsy0ef/lee_byunghun_talks_front_mans_future_and_possible/"
    },
    {
        "id": "1lsxo9v",
        "author": "nao921",
        "title": "Netflix app on iOS 26 (cannot play title, AVF:11819)",
        "content": "anyone on iOS 26 having issue with Netflix streaming and downloaded title playback?\n\nI understand iOS 26 is still on developer preview and I tried to find a place to report this to Netflix, but all I got from the Netflix help page is to restart the iPhone and it will work.  However it is not the case. I tried to redownload the episode, remove the episode and just stream, it would regularly lead me to avf 11819.\n\nIs there anywhere that I can talk to someone from Netflix or send them details about the issue?\n\nThanks!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lsxo9v/netflix_app_on_ios_26_cannot_play_title_avf11819/"
    },
    {
        "id": "1lt0vll",
        "author": "Moudasty",
        "title": "Terrible bitrate, how do you cope?",
        "content": "I have NF Standard and I'm in Germany. I don't understand what am I paying for. The bitrate is bad, sometimes too bad (depending on the show). It looks worse than a BDrip from 2006.\nI want a clear, crisp image, I don't need more. But they don't give it to me.  I have a 1080p 55\"TV from 2013.\n\nEverything seems to be degrading instead of developing. We are moving backward. In 2010 blu ray quality was standard. 15 years later we have a WORSE quality. And shows like Squid game isn't even available on Bluray anymore. \n\nDid we stop to value quality? What happened? \n\nI'm using the ps5 app\n\nAnd is 1080p on Premium better than on Standard? \n\nThx",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lt0vll/terrible_bitrate_how_do_you_cope/"
    },
    {
        "id": "1lstgmu",
        "author": "AppearanceOdd1744",
        "title": "Censorship audio drops?",
        "content": "Sorry if this has been posted before. I’m rewatching Mr Robot and I’m noticing audio drop outs on the profanity that I know aren’t in the show originally. Is there a way to turn that off? It’s really distracting. \n\nMore to the point, why am I watching censored versions that I watched uncensored on live TV? So stupid. Thx in advance. .\n\nEdit: apparently it’s specifically a Mr Robot issue. I checked Breaking Bad and that one still has plenty of f’s in it but the audio drop out in Mr Robot is consistent. I read up on it and I guess that’s the version they must have gotten.  \n",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lstgmu/censorship_audio_drops/"
    },
    {
        "id": "1lsi9o5",
        "author": "RunPowerful468",
        "title": "Adolescence",
        "content": "I believe that by trying to break a generational curse, the dad unintentionally creates a new one.\n\nAt the end he talks about how his dad used to beat him so he promised himself that he wouldn’t do the same to his kids so my assumption is that throughout Jaime’s life whenever the dad saw himself in Jaime he chose to ignore it because he didn’t know how to handle it and just let Jaime be. By doing that jaime doesn’t know how to regulate his feelings so he holds it in and lashes out when the pressure becomes too much. One thought that crossed my mind, is when the dad is mentioning all the things he did to help Jaime, was the same exact reasons Jaime did what he did.",
        "upvotes": 10,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lsi9o5/adolescence/"
    },
    {
        "id": "1lsl531",
        "author": "Chance_Excitement_63",
        "title": "If you have seen the amazing new film K-Pop Demon Hunters, what was your favorite song(s) from the film?",
        "content": "For a fictional boy band, they were heard to have broken several Spotify records, including best song or something that overtook BTS! This is the best animated film I've seen in a while since Ladybug &amp; Cat Noir: The Movie!",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lsl531/if_you_have_seen_the_amazing_new_film_kpop_demon/"
    },
    {
        "id": "1lsok0r",
        "author": "Jason13v2",
        "title": "The subtitles' shadow disappeared after the most recent app UI update.",
        "content": "What can I do? When I go into the subtitle settings, the shadow option is still there, but even after disabling and re-enabling it, the shadow doesn't appear.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lsok0r/the_subtitles_shadow_disappeared_after_the_most/"
    },
    {
        "id": "1lsbeqy",
        "author": "WinAdmirable5400",
        "title": "Have the small pictures been removed when rewinding?",
        "content": "When I try to rewind or fast forward there used to be an image of each 5-10 second increment on the bottom. Now there’s only a blank grey square. Is this a new thing? It feels like it’s intentional and not a bug. I don’t like it.",
        "upvotes": 12,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lsbeqy/have_the_small_pictures_been_removed_when/"
    },
    {
        "id": "1lt1l86",
        "author": "Michael_Phalanges",
        "title": "It's Rick and Glenn's fault for the walker attack that night at camp",
        "content": "",
        "upvotes": 0,
        "comments": 7,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/jyo2sr6tc9bf1/DASH_270.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1lt1l86/its_rick_and_glenns_fault_for_the_walker_attack/"
    }
]