[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 473,
        "comments": 249,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1gqzgsf",
        "author": "Still_Boat_233",
        "title": "Lady Gaga Joins Wednesday Season 2 With Jenna Ortega in Undisclosed Role",
        "content": "",
        "upvotes": 22,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1gqzgsf/lady_gaga_joins_wednesday_season_2_with_jenna/"
    },
    {
        "id": "1gr5inl",
        "author": "Kindly_Boysenberry47",
        "title": "Help me find a show! Pls",
        "content": "I cannot remember this show. It was just in the last few years I saw it on Netflix. It was a sci-fi series. There were representatives from a bunch of different countries that are on a space ship when a bunch of weird things start happening. If I remember correctly it starts happening after they collect some dirt samples.  I think they they're in an alternative universe? I remember a specific scene where someone's limb gets cut off but they're not in pain and there's no bleeding?? \n\nAlso at the same time one on Earth these spaceship/monoliths appear but they don't open until later on in the series. \n\nDoes anyone remember this show?",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1gr5inl/help_me_find_a_show_pls/"
    },
    {
        "id": "1gr79zu",
        "author": "koalamomma85",
        "title": "What can I watch with my daughter ",
        "content": "Looking for shows to watch with my  daughters \nWe watched Wednesday, babysitters club, bean and ivy, don't remember what it was called but some gymnastics show, dance mom's, thr healing power of Duke,  So daughter are 8 and 15. My 8 yr old is into a little order stuff not 100% sure if she  understands half of what we watch or not but she pays attention. \nIt doesn't have to be on Netflix.  We have just about everything lol\n",
        "upvotes": 3,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1gr79zu/what_can_i_watch_with_my_daughter/"
    },
    {
        "id": "1gqkqem",
        "author": "Atlast_2091",
        "title": "The Night Agent: Season 2 | Official Teaser | Netflix",
        "content": "",
        "upvotes": 82,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1gqkqem/the_night_agent_season_2_official_teaser_netflix/"
    },
    {
        "id": "1gqjzs3",
        "author": "ALVARO39YT",
        "title": "A 70-Million-User Success: Netflix's Ad-Supported Plan Pays Off",
        "content": "",
        "upvotes": 64,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1gqjzs3/a_70millionuser_success_netflixs_adsupported_plan/"
    },
    {
        "id": "1gr8i7s",
        "author": "luckybell333",
        "title": "Jentry chau vs the underworld trailer",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gr8i7s/jentry_chau_vs_the_underworld_trailer/"
    },
    {
        "id": "1gr6x1s",
        "author": "iPhone13pm",
        "title": "Back In Action | Official Teaser | Netflix",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gr6x1s/back_in_action_official_teaser_netflix/"
    },
    {
        "id": "1gr6sha",
        "author": "peoplemagazine",
        "title": "Squid Game Creator Says He Lost '8 or 9' Teeth from 'Stress' of First Season but Season 2 Is Even More Taxing",
        "content": "",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1gr6sha/squid_game_creator_says_he_lost_8_or_9_teeth_from/"
    },
    {
        "id": "1gr6pan",
        "author": "fate763",
        "title": "Tv series ",
        "content": "With how well the reacher books have done being turned into a series on Prime I am amazed netflix hulu peacock or some other streaming service has not jumped on it. What book series would you like to see made into a TV show?\nIf they stuck to the source material I would love to see a Dresden files series. I know that a network made a season one of it some years ago, and while it wasn't terrible, it wasn't harry dresden.\nAnother would be The Deed Of Paksenarrion trilogy and books that followed. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gr6pan/tv_series/"
    },
    {
        "id": "1gr4i53",
        "author": "EconomyExisting4025",
        "title": "American vs rest of the world content ",
        "content": "There are more, but this is off the top of my head and def underrated:\n\n- The confidante (France)\n- Undercover &amp; Ferry series (Belgium/Netherlands)\n- Inside man (UK)\n- Kalifat (Sweden)\n...\n\nAre these popular in your countries? What's the general opinion on topic American vs rest of the world content? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gr4i53/american_vs_rest_of_the_world_content/"
    },
    {
        "id": "1gqvldu",
        "author": "Mik_Will",
        "title": "Looking for animated show I can’t remember the name of",
        "content": "As the title suggests I can’t remember the name and I really want to rewatch the show. I’m pretty certain it was on Netflix maybe a Netflix original. It centered around this character who lived in a perfect world with a sentient mountain and his monster friend. He then wakes up forward in time and the current world is ruled by an elephant dictator. The world sucks and his friend is working a boring job. He goes on an adventure to wake up the mountain and eventually ends up in a vampire night club. It was a weird series hope that info can help identify it. Thanks!",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gqvldu/looking_for_animated_show_i_cant_remember_the/"
    },
    {
        "id": "1gqrshh",
        "author": "Alan_Stamm",
        "title": "'The Lost Children:' Extraordinary story of four missing kids in Colombian rainforest [3-star review]",
        "content": "",
        "upvotes": 11,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gqrshh/the_lost_children_extraordinary_story_of_four/"
    },
    {
        "id": "1gqq2ao",
        "author": "iPhone13pm",
        "title": "Carry-On | Official Trailer | Netflix",
        "content": "",
        "upvotes": 12,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1gqq2ao/carryon_official_trailer_netflix/"
    },
    {
        "id": "1gqwj8e",
        "author": "Movielover718",
        "title": "Emilia Perez ",
        "content": "So what did everyone think?\n\nMy\nOpinion \n\nZoe saldana was great like she always is in things,\nSelena Gomez def showed her acting skills in this movie.\nHer Spanish was terrible lol I know her character is a Mexican who was raised in states but her Spanish was just terrible especially\nConsidering she is actually Mexican!! She should have went to months of Spanish classes before doing this movie cus when she speaks Spanish it’s like she’s reading off the script word by word idk if I’m explaining it right lol it’s doing flow.\n\nThe musical part wasn’t bad except the English musical part with the doctor it was weird overall i give it a 6.5/10 \nI think it should have been a mini series honestly ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gqwj8e/emilia_perez/"
    },
    {
        "id": "1gqr836",
        "author": "West-Weakness-753",
        "title": "Is Standard with ads worth it? Looking for specific shows!",
        "content": "I'm going to be getting netflix again, but after reading that there are limited movies and TV shows, I'm really unsure if what I want to watch will be available. \nI'm wanting to watch The 100, Breaking Bad, The Haunting of Hill House, and Shameless. There's a bunch more, but I can't think of them! \nCan anyone tell me if these are available? And possibly let me know of some good movies or shows that won't be available so I'm prepared? I've tried researching, but literally every result had a different answer. \nPlease spam me with any information! ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gqr836/is_standard_with_ads_worth_it_looking_for/"
    },
    {
        "id": "1gqn6o6",
        "author": "antoinefbm",
        "title": "Looking for a specific Netflix show from around 2019",
        "content": "I've been looking for a show I had watched at this time but can't remember the name. The main character was a girl and she lived in this poor city under better one that was over a cliff. there was also a sand tornado I think that broke a lot of things in the poor city. to get to the better place, people had to do challenges in a sort of closed building. at the end after the girl wins there's a plot twist which is that to get to that better place, people must get sterilized. ",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1gqn6o6/looking_for_a_specific_netflix_show_from_around/"
    },
    {
        "id": "1gr2trt",
        "author": "karmaisded",
        "title": "I have a Netflix subscription, but I am going to pirate shows",
        "content": "I have a MacBook Pro and going on a 8 hour flight tomorrow. This is so dumb that Netflix doesn’t allow downloads on Mac.\n\nThe only suggestions I could find was running a VM. Honestly, pirating is much easier than running a windows VM on a M1 mac.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1gr2trt/i_have_a_netflix_subscription_but_i_am_going_to/"
    },
    {
        "id": "1gpynmr",
        "author": "opheliasdinosaur",
        "title": "Stop first season cliffhangers",
        "content": "Is anyone else ever really frustrated with a good, unique first series that ends on a cliff hanger and then gets cancelled because it didn't hit the top 5 viewing figures in week 1 or 2?\n\nNetflix needs to stop this crap. Either have a rule that all first seasons have a closed story arc or give shows time to build viewership.\n\nGood example - dead boy detectives = I'm devastated there's no season 2, but it was a closed arc, all major ploy points resolved and I don't feel that netflix stole 8 hours of my life.\n\nBad example - the midnight club, or a whole bunch of others that I had on a watch list and then removed when I found out they were cancelled but left on a cliff hanger. I have no incentive to watch them now. \n\nAt least where there is a closed arc, I may still go and watch a cancelled show.\n\nDoes anyone else feel like this?",
        "upvotes": 100,
        "comments": 64,
        "media": null,
        "permalink": "/r/netflix/comments/1gpynmr/stop_first_season_cliffhangers/"
    },
    {
        "id": "1gqqd1y",
        "author": "Promax1127",
        "title": "How do I fix this problem ",
        "content": "So I let my friend borrow my account, and when I watch a show it doesn’t save my progress on what part I was in the show, but it does for him. How can I possibly fix this?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gqqd1y/how_do_i_fix_this_problem/"
    },
    {
        "id": "1gq7a6x",
        "author": "LetterheadFun3697",
        "title": "'Avatar: The Last Airbender' Season 2 Finds Its Joo Dee, Long Feng, The Boulder and Casts 'Sympathizer' Star Hoa Xuande",
        "content": "",
        "upvotes": 19,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1gq7a6x/avatar_the_last_airbender_season_2_finds_its_joo/"
    }
]