[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 14,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 49,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1l26ugd",
        "author": "iLikeDinosaursRoar",
        "title": "Dept Q",
        "content": "Going to need everyone reading this to please watch this show ASAP. Even if you don't like it, just let it run so Netflix thinks it was watched! Really be a shame not to get a 2nd season. \n\nJust need a few dozen million...thanks.\n\nNot to mention it was a fun crime drama with some enjoyable characters, it's Sherlock Holmes vs House. \"But they are the same!\" Yes yes, but imagine the detective an enjoyable grouch like House but it has all the detective and crime qualities of Sherlock. \n\nGive it a watch or the very least let it run in the background! ",
        "upvotes": 131,
        "comments": 66,
        "media": null,
        "permalink": "/r/netflix/comments/1l26ugd/dept_q/"
    },
    {
        "id": "1l2amhj",
        "author": "montgomery2016",
        "title": "I did the math regarding the Tyson v Paul lawsuit",
        "content": "So this guy is suing because of the poor streaming quality during the fight. I decided to calculate how much money a subscriber would realistically be entitled to if they win the suit.\n\nA month has 43,800 minutes. The whole 5 hour event totals to 306 minutes. 306 is 0.7% of 43,800, so subs experienced poor streaming quality for 0.7% of the time they're paying for per month. We just find 0.7% of each sub tier to determine how much you're owed;\n\n$7.99: 0.05593, or $0.06\n\n$17.99: 0.12593, or $0.13\n\n$24.99: 0.17493, or $0.17\n\nHow how much money would you get back and what will you do with it? Like, subscribe and leave a comment down below /s\n\nEdit: \n\n&gt;Isn’t some also retained by the law firm?\n\n\\-u/dethsesh \n\nFirst of all, fuck you, so jot that down \n\nAccording to[ this article,](https://www.txattorneys.com/faqs/what-percentage-do-class-action-lawyers-take/) law firms would get \"25% to 35% of the total settlement amount awarded to the class of plaintiffs.\" We can go with the middle and say 30%, which I'm thinking would be taken out of each individual payout.\n\nSo, if subscribers were to be paid for the amount of service time lost during the fist minus the average fee for a law firm, they'd get:\n\n* $7.99: 0.016779, or $0.02\n* $17.99: 0.037779, or $0.04\n* $24.99: 0.052479, or $0.05\n\nConsiderably worse, lawyers truly are the bane of the average Netflix subscriber's existences.\n\nHowever, the lawsuit is for $50 million. What we can do is subtract 30% to get $35 mil. According to[ this article,](https://www.demandsage.com/netflix-subscribers/) Netflix had a total of 301.6 million active users. 40 million of those were on the ad-free tier and has (to my chagrin) no data on the other two tiers. We can say there are 261.6 million users between the other two tiers and split it in half to get an estimate (damn you, Netflix), which is about 130.8 million apiece. So, the three tiers make up an estimated *x*% of the total user base:\n\n* $7.99: 13.2625995%, or 13%\n* $17.99: 43.3687003%, or 43%\n* $24.99: 43.3687003%, or 43%\n\nI know the rounded values don't add up to 100%, let's just say the lawyers took the rest as part of their fee.\n\nI'm lost here, not sure what to do with this information. I think I need how much money everyone paid, which is *x* (cost) times *y* (number of users) to get *z* (amount each demographic spent).\n\n* $7.99 x 40 million = 319600000, or $319.6 mil\n* $17.99 x 130.8 million = 2.353092 billion, or $2.4 bil\n* $24.99 x 130.8 million = 3.268692 billion, or $3.3 bil\n\nThen, we want *a* (amount paid for the fight). The amount each tier spent to watch the fight is:\n\n* $7.99: 0.7% of $319.6 mil is $223.72 mil\n* $17.99: 0.7% of $2.4 bil is $16.8 mil\n* $24.99: 0.7% of $3.3 bil is $23.1 mil\n\nI added the total amount spent and determined that the tiers are entitled to *a*% of the $35 mil.\n\n* $7.99: 84.92% of $35 million is 29.72200 million, or $29.7 million\n* $17.99: 6.378% of $35 million is 2.2323 million, or $2.2 million\n* $24.99: 8.769% of $35 million is 3.06915 million, or $3.1 million\n\nSo clearly, you're not getting what you're entitled back. Divide $b (total entitled amount per tier) by *y*(the number of users) to get the realistic amount a subscriber would receive.\n\n* $7.99: $29.7 million divided by 40 million is 0.7425, or $0.74\n* $17.99: $2.2 million divided by 130.8 million is 0.01681957186, or $0.02\n* $24.99: $3.1 million divided by 130.8 million is 0.0237003058, or $0.02\n\nI've probably made a fool of myself somewhere along the line with an obvious oversight, but I've run out of steam. ",
        "upvotes": 18,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1l2amhj/i_did_the_math_regarding_the_tyson_v_paul_lawsuit/"
    },
    {
        "id": "1l20y5d",
        "author": "Aggressive_Data_6291",
        "title": "A Show That’s Going To Have Me Gagged and Shocked",
        "content": "I need to feel something. I wanna watch something that’s going to have me floored multiple times throughout watching. I’m talking jaw dropping , unexpected and applause worthy. I’m not really into documentaries. ",
        "upvotes": 108,
        "comments": 225,
        "media": null,
        "permalink": "/r/netflix/comments/1l20y5d/a_show_thats_going_to_have_me_gagged_and_shocked/"
    },
    {
        "id": "1l22i52",
        "author": "portezbie",
        "title": "Why does Netflix change the UI constantly but almost never add actual new features?!",
        "content": "So the goddamn Netflix app on my TV is different again, apparently it was really important to make the cover images huge and make the buttons rounder. \n\nAnd yet for some reason all these super basic things still don't exist, like asking if you want to remove something from My List when you finish it, or easier access to subtitle options. \n\nOr heaven forbid having more than one list, like I dunno a \"watched favorites\" list and a \"want to watch\" list? It's so friggin basic! \n\nSorry, just really needed to vent. Rant over.",
        "upvotes": 31,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1l22i52/why_does_netflix_change_the_ui_constantly_but/"
    },
    {
        "id": "1l21wda",
        "author": "FryingAir",
        "title": "Maid",
        "content": "So good! I’ve been glued to it for the past 24 hours. It’s so real and makes you really think of how hard it is to stay afloat. I know it’s not new but how many of you have seen it? Highly recommend.",
        "upvotes": 33,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1l21wda/maid/"
    },
    {
        "id": "1l1kjs3",
        "author": "Top-Ring9619",
        "title": "Is it just me or….?",
        "content": "",
        "upvotes": 230,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1l1kjs3/is_it_just_me_or/"
    },
    {
        "id": "1l2gb8o",
        "author": "chrisarrant",
        "title": "Queen's Gambit creator mixes Scandi Noir with UK crime shows like Prime Suspect for Netflix's Dept. Q (with a side of Matthew Goode)",
        "content": "",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l2gb8o/queens_gambit_creator_mixes_scandi_noir_with_uk/"
    },
    {
        "id": "1l2bej5",
        "author": "Internal-Bed-3150",
        "title": "Led Zeppelin’s story like you’ve never seen it, is coming to Netflix soon",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l2bej5/led_zeppelins_story_like_youve_never_seen_it_is/"
    },
    {
        "id": "1l2asnq",
        "author": "Mycroft_xxx",
        "title": "Guillermo del Toro’s Frankenstein, official teaser trailer.",
        "content": "Very excited about this.  Can’t wait to see it in theaters.  I love the look and the musical score .  I know this is  Del Toro’s dream project and I am super excited to see his vision.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l2asnq/guillermo_del_toros_frankenstein_official_teaser/"
    },
    {
        "id": "1l2hdqx",
        "author": "ProbablyHere4Help",
        "title": "Netflix’s interface is AWFUL and permanent. Best part: you can’t leave feedback anywhere!",
        "content": "I could be wrong but wouldn't less title visibility induce quicker scroll fatigue? I have no desire to hunt for new titles and the once PERFECT interface now resembles all the others. Might as well spread my time and money elsewhere now that there's no difference in how annoyed I get navigating these streaming apps. \n\nYeah, most people are naturally resistant to change but this is probably their worst decision yet. I've been actively trying to avoid this ugly layout by keeping my testing feature off but I guess it's here to stay.\n\nI hope Netflix considers revising toward something that feels more like Netflix but my expectations are in Hell.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l2hdqx/netflixs_interface_is_awful_and_permanent_best/"
    },
    {
        "id": "1l2h0ub",
        "author": "Street-Opening-5166",
        "title": "Series Recommendations",
        "content": "Hey everyone!\nI’ve barely watched any series in the past because work kept me super busy. But now that I finally have some free time, I want to dive in! 😄\n\nI’m looking for Netflix recommendations—I enjoy courtroom dramas, thrillers, mysteries, fiction, and even light-hearted comedies like Friends or The Big Bang Theory.\n\nWould love your suggestions—drop your favorites below! 🍿✨",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l2h0ub/series_recommendations/"
    },
    {
        "id": "1l1fz1e",
        "author": "Wyldstallyn80",
        "title": "Dept Q",
        "content": "Watched this over the weekend, really enjoyed it. Thought the relationships between all the main characters were very well written and acted. Now I’m just looking forward to the 3 year wait for the next season. ",
        "upvotes": 187,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1l1fz1e/dept_q/"
    },
    {
        "id": "1l297nd",
        "author": "bingewatchgal",
        "title": "Sirens - more thoughts/questions",
        "content": "&gt;!Loved the show! So much to think about! I've read the other threads on here which have made me see some things I missed and think about other things a little differently, but I still have some thoughts/questions...\n\nWas Devon actually thinking Simone should feel obligated to care for an abusive father part of Devon's trauma response? A \"misery loves company\" mentality? Devon spent her life trying to protect and support Simone. Why is she now, all of a sudden, trying to bring her down? Simone was totally justified in not wanting to do a damn thing for her dad. Did Devon feel it was more about helping her than the dad and it was finally time for Simone to start paying her back for all she did for her?\n\nJose!! I thought he was the most mysterious/interesting character! At the end, when he called Simone \"my love\" (I think that was the term)...so creepy and so telling. If anyone was  being \"cultishly\" controlled, it was him!\n\nThe girl in jail. What did she represent?\n\nI really need to watch it again knowing what I know now. I'm sure so many things will look very different!!&lt;",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l297nd/sirens_more_thoughtsquestions/"
    },
    {
        "id": "1l2b5v4",
        "author": "indiewire",
        "title": "‘Squid Game’ Creator Teases Potential Spinoff: ‘I Want to Show What They Did’ Between Seasons 1 and 2",
        "content": "",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1l2b5v4/squid_game_creator_teases_potential_spinoff_i/"
    },
    {
        "id": "1l2a4d0",
        "author": "ameliabebe",
        "title": "Sirens - possible plot hole?",
        "content": "I just finished watching Sirens and I enjoyed it for the most part. There was something that really threw me off though and I was wondering if anyone else noticed it or if I have got it wrong.\n\nSo, when Simone and Devon's mum dies Simone is 7 and Devon is 12. But the show makes it out like no one was around for Simone after, but where was Devon? She didn't go straight to college at 12 years of age.. she would of been like 18 when she went to college right? (I am not from the US, so I don't know the exact age most kids go to college) Which means Simone would have been 13 when Devon left. So why was Simone the one that was neglected, and put into foster care but not Devon!?!? Unless I misheard the ages they said they were when their mum died it doesn't make sense!? Did I miss something???",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1l2a4d0/sirens_possible_plot_hole/"
    },
    {
        "id": "1l29lex",
        "author": "galatackus",
        "title": "\"Sites can play protected content\" issue",
        "content": "I've been trying to watch Lost in Space on my computer after having only watched it on my phone or TV previously, and I keep getting this error message when I try to start an episode despite visiting said link and making sure they were correct (they were from the beginning but I've tried every other combination of the two settings aswell just to make sure).  \nDoes anyone know how to fix this issue?  ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l29lex/sites_can_play_protected_content_issue/"
    },
    {
        "id": "1l25odq",
        "author": "ScaryBlanket",
        "title": "We Deserve a 5x FFWD/RWD Speed",
        "content": "3x is too slow. Slower than rewinding a VHS tape. I rewind and fast forward often because my wife consistently falls asleep during movies. I would greatly benefit from a faster option, like other streaming services. \n\nWe deserve a 4x! No 5x! WHO’S WITH ME? God I miss DVD chapters. Those dumb discs sure got that right. Give us chapters!",
        "upvotes": 1,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1l25odq/we_deserve_a_5x_ffwdrwd_speed/"
    },
    {
        "id": "1l2csba",
        "author": "MysticCrest1830",
        "title": "Eiichiro Oda Hypes the Fandom for Season 2 of Live-Action 'One Piece' and the Series' Chopper",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l2csba/eiichiro_oda_hypes_the_fandom_for_season_2_of/"
    },
    {
        "id": "1l1w14d",
        "author": "sbingle73",
        "title": "The OA",
        "content": "Is it worth watching? I started watching the first season because I’ve heard it’s good but also that it got cancelled. Not sure I want to invest my time. Does it at least end in a place where some of the plot lines are resolved?\n",
        "upvotes": 7,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1l1w14d/the_oa/"
    },
    {
        "id": "1l22hcg",
        "author": "dudepefext",
        "title": "Tv shows",
        "content": "Can someone tell me some actual GOOD tv shows. Not comedy, but more thriller. For example, “The stranger”, “You”, “Severance”, “Stranger Things”. I don’t want mid shows, only shows that’ll have me wanting to finish it in one day.",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1l22hcg/tv_shows/"
    },
    {
        "id": "1l25esk",
        "author": "coffeetime121",
        "title": "Jupiter's Legacy audio issue?",
        "content": "Is anyone else noticing that the audio on Jupiter's Legacy is too soft? I have normal audio on everything except for this specific show. Changing settings on my TV isn't correcting the problem; is it possible they have a glitch on the server side? Is anyone else having problems with this show?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l25esk/jupiters_legacy_audio_issue/"
    },
    {
        "id": "1l24rjb",
        "author": "SelfAmbitious",
        "title": "SETH SCREWS PUNK!!!! Wwe Raw Review (3/6/25)",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l24rjb/seth_screws_punk_wwe_raw_review_3625/"
    },
    {
        "id": "1l28yua",
        "author": "whenyoulandinparis",
        "title": "Do unpaid subscriptions pile up after they are suspended?",
        "content": "My son has subscriptions Netflix, YouTube, Snapchat+ and god knows what else.  Every now and then he'll get suspended from one or the other when, obviously, he's broke.  My question is, do the billls pile up if you're suspended?  In other words, if your Netflix account is suspended for 10 months and it's $20/mo (for the sake of easy math), do you owe them $200?  Or is the account just reinstated when you have $20?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1l28yua/do_unpaid_subscriptions_pile_up_after_they_are/"
    },
    {
        "id": "1l20uwu",
        "author": "CreepyPastaLover2005",
        "title": "Why was there no ads on my ad included account?",
        "content": "I recently watched Rebel Moon with my dad on Sunday and half way through I realized we never saw an ad, and 0 played through the entire movie. Same account that I use but he has a different profile. When I went upstairs to use my account, I got hit with an ad the second I turned on Scott pilgrim takes off. Was it a glitch? Did we just get lucky? Anyone else have this happen?",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1l20uwu/why_was_there_no_ads_on_my_ad_included_account/"
    },
    {
        "id": "1l20p4n",
        "author": "6teeee9",
        "title": "Does the premium plan show more screen than the other plans? (4k vs 1080p)",
        "content": "This is going to sound like a dumb question but I feel like when I'm watching something on Netflix the video is kinda zoomed in compared to clips of those scenes online. I'm suspecting that it has to do with my plan being on 1080p while those clips come from other people are watching them on 4k. Is this correct? If not, does anyone know why it's zoomed in?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l20p4n/does_the_premium_plan_show_more_screen_than_the/"
    },
    {
        "id": "1l1wxot",
        "author": "WindowsXP-Jackson",
        "title": "So many ads",
        "content": "Why am I getting so many ads, I think I’m getting more than YouTube atp, I have had to watch a minute of ads before, halfway through, and at the end of a 20 minute episode, i understand they where going to give us a *couple* ads but atp you might as well watch normal tv 😭",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l1wxot/so_many_ads/"
    },
    {
        "id": "1l1q5p3",
        "author": "indiewire",
        "title": "At Netflix, Documentaries Still Have a Home as Streamer Picks Up Six Features",
        "content": "",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l1q5p3/at_netflix_documentaries_still_have_a_home_as/"
    },
    {
        "id": "1l22c0y",
        "author": "Frosty_Manager_1035",
        "title": "Dept W question/spoiler death Sam Haig",
        "content": "It seems that Sam was killed a distance from the cliff.  Wouldn’t the investigation shown blunt force trauma killed him before he fell over the edge?  Seems like a big miss for the writers to gloss over this. ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1l22c0y/dept_w_questionspoiler_death_sam_haig/"
    },
    {
        "id": "1l18gq3",
        "author": "Top-Three-USA",
        "title": "Kristen Bell and Adam Brody return in Nobody Wants This Season 2, premiering October 23, 2025, on Netflix with new guest stars and fresh storylines",
        "content": "",
        "upvotes": 24,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l18gq3/kristen_bell_and_adam_brody_return_in_nobody/"
    },
    {
        "id": "1l0umzr",
        "author": "geniebythesea",
        "title": "Looking for a “Limited Series” show to watch. What’s your favourite?",
        "content": "As the title suggests, I’m looking to make a list of limited series shows to watch. Generally I like most genres, but specifically enjoy British crime shows/mystery, true story events, a little bit of sci fi (Severance and The OA are as far into that genre I go). A list of the shows I’ve seen and I’m looking more of is below - some of these might not be Netflix I’m not sure. \n\nEdit edit: I started watching Dept Q last night. So far it’s exactly what I was looking for. I’ve made a list of other shows to watch as well. Thank you all for your suggestions. \n\n- Broadchurch\n- Unbelievable \n- Unorthodox \n- Queens Gambit\n- Maid\n- Bodyguard\n- Baby Reindeer\n- The Fall\n- Gracepoint \n- Toxic Town\n- Mare of Eastown\n- The Missing \n- Adolescence \n\nEdit to add a show:\n- Bad Sisters (not Netflix show - but I highly recommend)\n- Sirens\n- Residence ",
        "upvotes": 153,
        "comments": 364,
        "media": null,
        "permalink": "/r/netflix/comments/1l0umzr/looking_for_a_limited_series_show_to_watch_whats/"
    }
]