[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 485,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1haf6gm",
        "author": "netflix",
        "title": "Netflix received 36 Golden Globes nominations!\n\nCongratulations to Emilia Pérez, Nobody Wants This, Squid Game, Monsters: The Lyle and Erik Menendez Story, Maria, Ripley, Griselda, Black Doves, The Gentlemen, The Diplomat, A Man on the Inside, and Glen Powell who scored his first-ever nomination.",
        "content": "",
        "upvotes": 26,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1haf6gm/netflix_received_36_golden_globes_nominations/"
    },
    {
        "id": "1hc243k",
        "author": "TheMirrorUS",
        "title": "Netflix teases 'dark truths' of Jerry Springer Show exposed in upcoming documentary",
        "content": "",
        "upvotes": 404,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1hc243k/netflix_teases_dark_truths_of_jerry_springer_show/"
    },
    {
        "id": "1hcex2d",
        "author": "Robust5000T",
        "title": "Looking for a new show to watch similar to the society",
        "content": "Idk if I'd say similar but I liked the society, I also liked the rain and the mist and also 3% idk if those r rlly similar but they have like a similar vibe ig? Anyways I'm looking for something like that",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hcex2d/looking_for_a_new_show_to_watch_similar_to_the/"
    },
    {
        "id": "1hcae9i",
        "author": "GoodWaves89",
        "title": "Help distract my 17yo friend in the hospital, series recommendations?",
        "content": "Hi all, my best friend is in the hospital right now, does anyone have recommendations on some light hearted series on netflix she could watch. She liked heartstoppers she also likes the marvel movies, poetry, and reading. Really anything with a really hooking plot, I'm thikning it would be good to her to have some sort of light hearted romance that she could binge for hours maybe?",
        "upvotes": 8,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1hcae9i/help_distract_my_17yo_friend_in_the_hospital/"
    },
    {
        "id": "1hbq29m",
        "author": "Thin_Marionberry5209",
        "title": "Did Anyone Else Catch Jamie Foxx’s Netflix Special: An Hour-Long Love Letter to Himself?",
        "content": "So, I just finished watching Jamie Foxx’s Netflix special, and...wow. Has anyone ever loved themselves more? I mean, the man literally sang and danced about himself for an hour straight. Don’t get me wrong, he’s talented, but this was next-level self-admiration.\n\nIt was like watching someone throw their own surprise party, and then spend the whole time giving a speech about how awesome they are—complete with choreography. By the end, I felt like I should’ve sent him a card that just said, *“Congrats on being you.”*\n\nIs this what peak self-confidence looks like? Should I be inspired or concerned?",
        "upvotes": 132,
        "comments": 153,
        "media": null,
        "permalink": "/r/netflix/comments/1hbq29m/did_anyone_else_catch_jamie_foxxs_netflix_special/"
    },
    {
        "id": "1hcgp7a",
        "author": "evildomovoy",
        "title": "Series about liars getting caught.",
        "content": "There was a series a while ago about people cheating/lying etc and the real world consequences. It had episodes about Tim Donahgy, a University admissions lady that faked her qualifications, a lady that faked her address to get her kids into a better school and some guys that did some insider trading. Does anyone recall the series and remember what it was called?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hcgp7a/series_about_liars_getting_caught/"
    },
    {
        "id": "1hcg835",
        "author": "dill_pickle1141",
        "title": "Account hacked and cannot login - does this mean someone has access to my money?",
        "content": "I tried to login to Netflix today and basically my email doesn't exist. I tried to recover my account, but when I put in my name and payment method as required it stated it sent an email to a completely different email I'd never heard of. \nCan someone really get my card details from my Netflix account? I was using PayPal, so cancelled the automatic payments, but not sure what to do now... \nPlease any advice for me? I tried Netflix support, but they only said to do what I'd already tried. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hcg835/account_hacked_and_cannot_login_does_this_mean/"
    },
    {
        "id": "1hc6rk6",
        "author": "NaviFeed",
        "title": "Netflix January 2025 Originals, Movies and Series Announced",
        "content": "",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hc6rk6/netflix_january_2025_originals_movies_and_series/"
    },
    {
        "id": "1hbz9hw",
        "author": "According-Sign-9587",
        "title": "Any tv show recommendations with secret service action?",
        "content": "I love watching White House, government or secret service shows - something about it gets me very interested. \n\nAnyone know any good ones? I don’t mind if it’s on Netflix or not but I need shows that give me the same interest as shows like night agent or designated survivor. \n\n",
        "upvotes": 13,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1hbz9hw/any_tv_show_recommendations_with_secret_service/"
    },
    {
        "id": "1hbnbzz",
        "author": "Robemilak",
        "title": "Adam Sandler Teases Eminem Cameo in ‘Happy Gilmore 2,’ Says the Sequel Is Eyeing a July 2025 Release on Netflix",
        "content": "",
        "upvotes": 94,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1hbnbzz/adam_sandler_teases_eminem_cameo_in_happy_gilmore/"
    },
    {
        "id": "1hc810k",
        "author": "PunchBeard",
        "title": "Subtitles are \"All or None\"?",
        "content": "I'm in the mood for a cheesy war movie and figured I'd watch Midway but in order to understand the Japanese bits I either have to turn on English (CC), which turns on subtitles in English for everything, or turn subtitle Off which doesn't translate the Japanese bits to English. Is there something I'm missing here? Because I cannot figure out how to set it up so the English parts are not subtitled but the Japanese parts are. Google has been no help.",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hc810k/subtitles_are_all_or_none/"
    },
    {
        "id": "1hcbjun",
        "author": "Badhotgirlshit",
        "title": "A kids show I used to watch but forgot its name ",
        "content": "I’m looking for a children’s TV show where each episode tells a different story, but all the stories revolve around the same tree. The show spans different time periods, showing the tree as a central connection point through history. I think there was a young actress in the show who resembled Scarlett Johansson, and it may have aired in the 90s or early 2000s. Does anyone know the name of this show?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hcbjun/a_kids_show_i_used_to_watch_but_forgot_its_name/"
    },
    {
        "id": "1hcaucn",
        "author": "Top-Case6314",
        "title": "Navigation PopUps",
        "content": "How do I get rid of those navigational pop-ups that load on startup - (movies, tv shows) they are like these four different screens that are tutorial-like and you have to navigate thru them on every startup. Can this be shut off? Have searched settings high and low. So annoying. Sorry if I am not explaining it very well. You have to click ‘next’ thru them all each time to get them to go away. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hcaucn/navigation_popups/"
    },
    {
        "id": "1hbphro",
        "author": "Nuo_Vibro",
        "title": "New 2024 Netflix Christmas Movies Ranked from Worst to Best",
        "content": "",
        "upvotes": 27,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1hbphro/new_2024_netflix_christmas_movies_ranked_from/"
    },
    {
        "id": "1hbwbzt",
        "author": "Potential_Loss6978",
        "title": "New to Netflix- Show Suggestions",
        "content": "After milking every series available on Disney Hotstar( from White Collar to Grey's Anatomy), I finally took a Netflix subscription for the first time in my life. What are the best shows that I should get started with? There are too many all time GOATed series like Friends and Office which seem like the obvious choice but they might have been outdated, that's why coming here for suggestions",
        "upvotes": 6,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1hbwbzt/new_to_netflix_show_suggestions/"
    },
    {
        "id": "1hc3aib",
        "author": "blue-arrace91",
        "title": "Stranger Things and child actors ",
        "content": "A lot of shows involving younger casts lately have made me realize I think I take the Stranger Things cast for granted. Like even as children they were phenomenal and I think because of that, I set them as the bar. Now a lot of the time I’ll watch a show (not just from netflix tbh) I cringe at how tough the acting is to watch. Obviously they are young and learning, and it also requires direction from directors. But man, those ST kids are one of a kind. ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hc3aib/stranger_things_and_child_actors/"
    },
    {
        "id": "1hbvwzp",
        "author": "stina6767",
        "title": "Password issue",
        "content": "So this is the first time I have tried to use my Netflix since abroad and I can't sign in because it keeps rejecting my password.  \n\nIt isn't an error on my part so does this have to do with me trying to use Netflix in another country?  \n\nBecause that was never a problem in the past before they got all strict about password sharing.  ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hbvwzp/password_issue/"
    },
    {
        "id": "1hbxfj0",
        "author": "Filiope",
        "title": "I'm a bit confused on the Travel Code? How does it work?",
        "content": "Can someone explain to be how travel code works? I heard you can get 14 days of netflix but after that you can't get access to it anymore outside your primary house.\n\nIf I use the travel code will it log out my primary house'se device?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hbxfj0/im_a_bit_confused_on_the_travel_code_how_does_it/"
    },
    {
        "id": "1hc1lhd",
        "author": "tango_november_bravo",
        "title": "Netflix Games GPS",
        "content": "Do Netflix games track your location like Netflix streaming does? Or can you play the games anywhere no matter where your home location is? I ask because I don’t want to sign into my account to play a game when on vacation/travelling if it’s automatically going to think I’m accessing outside my home location ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hc1lhd/netflix_games_gps/"
    },
    {
        "id": "1hc0l21",
        "author": "DiamondNite2",
        "title": "I can't sign into Netflix on my old phone. ",
        "content": "Whenever I try to sign into Netflix it gives me an error that says \"Network Error. There was a problem signing in, please try again later.\" This is my old iPhone XR btw and it doesn't have an internet provider so it is only on Wi-fi and has no service. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hc0l21/i_cant_sign_into_netflix_on_my_old_phone/"
    },
    {
        "id": "1hb9j7o",
        "author": "Atlast_2091",
        "title": "Castlevania: Nocturne Season 2 | Official Trailer | Netflix",
        "content": "",
        "upvotes": 68,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1hb9j7o/castlevania_nocturne_season_2_official_trailer/"
    },
    {
        "id": "1hbqry3",
        "author": "StarKCaitlin",
        "title": "Netflix, Mastercard Team for Cardholder Perks for Live Experiences",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hbqry3/netflix_mastercard_team_for_cardholder_perks_for/"
    },
    {
        "id": "1hbynxa",
        "author": "HotBorder8261",
        "title": "My parent's account got hacked and I got kicked out of being an extra member",
        "content": "I don't live with my parents and since Netflix started the whole \"you must be on the base IP\" thing my parents started paying for me as an \"extra member\" so I can have Netflix without paying the full price.\n\nA few days ago their account got hacked and they kicked me out and added themselves as extra members. The problem is they used the 2 invitations per month we have and so I can't re-invite myself as an extra member.\n\nI tried contacting Netflix's support chat but they said they can only refund us the money on this month and try again next month (i.e. after the next payment).\n\nAnyone knows of some other solution so we can watch Netflix this month?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hbynxa/my_parents_account_got_hacked_and_i_got_kicked/"
    },
    {
        "id": "1hbmmbt",
        "author": "doratheexplorers",
        "title": "crashing ",
        "content": "pls recommend me another show like Crashing. It was soooo good but just too short :( I loved all the quirky characters and just how wholesome and messy they were. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hbmmbt/crashing/"
    },
    {
        "id": "1hbuvwo",
        "author": "Fr33mars",
        "title": "Jamie foxx special",
        "content": "I cried real man tears hearing his experience. 20yrs in health care and I was destroyed by his treatment and care by my peer group and chosen profession. There is hope in this broken system. \n",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hbuvwo/jamie_foxx_special/"
    },
    {
        "id": "1hbibpv",
        "author": "Midnight_Ghosty_",
        "title": "Netflix Profiles Reverted?",
        "content": "I logged onto my account this morning and it looks like my profiles have reverted back to old profiles?! Has this ever happened to anyone else and is it fixable? Not a huge deal but it's annoying since I've lost all watch history and \"currently watching\"",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hbibpv/netflix_profiles_reverted/"
    },
    {
        "id": "1hb1k7v",
        "author": "bangeybois25",
        "title": "What’s the name of this show? ",
        "content": "Used to have a subscription to Netflix years ago (10+). I remember there was this survival show based on true events. Specifically there was this one episode about a man surviving a bear attack in the woods. It got pretty gruesome at some points. The show was apart of my childhood and I’ve been trying to find it again and have had no luck. \n\n",
        "upvotes": 9,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hb1k7v/whats_the_name_of_this_show/"
    },
    {
        "id": "1hb400v",
        "author": "EpicVictoryRoyalBoi",
        "title": "Audio and Subtitles changing when in another country",
        "content": "I’m currently in Peru, although i came from australia just for holidays. I’m trying to watch the mob psycho anime, but before coming here, i’ve it downloaded in english. However now that i’m in Peru, the audio and subtitles have changed and my downloads also have changed to only the spanish, japanese and portuguese options with no English audio or subtitles available anymore. \n\nI’ve put the profiles and everything on english but the language for the dub and subtitles are only either in japanese, spanish or portuguese still! Idk if it’s the same situation for anyone else but it is something that’s been driving me insane.\n\nI’m on the third season and things have been getting really good and I love Reigens VA int eh english dub so I don’t wanna lose that! Please help!!!\n\nTL:DR: My audio and subsidies have changed for the anime i’m watching and i can’t change it back despite setting everything to english primarily. ",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hb400v/audio_and_subtitles_changing_when_in_another/"
    },
    {
        "id": "1hbejic",
        "author": "Dedmisk",
        "title": "Freezing",
        "content": "Been trying to watch Peaky Blinders on my phone, but it only plays about 10 seconds before the screen freezes and the audio keeps playing. Unistalled and reinstalled the app, as well as restarted my phone, which made no difference. Anyone else had this issue, and how did you go about fixing it?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hbejic/freezing/"
    },
    {
        "id": "1hbpxgh",
        "author": "Alarmed-Spend-9278",
        "title": "Time to say bye bye to Netflix",
        "content": "Recently I changed to an ‘ad’ plan with Netflix, which I thought was reasonable as it saved $5 a month and I just ignore ads anyway 😂. Today I got a rude shock that you can’t access all content on this plan 🤬there’s no option to go back on my slightly more expensive plan and the $18.99 option is just too expensive. They are losing me as a customer. Rant over. Anyone else facing this? I am in Australia 🇦🇺 ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1hbpxgh/time_to_say_bye_bye_to_netflix/"
    },
    {
        "id": "1hb8fsp",
        "author": "ZeusLordss",
        "title": "Netflix Subscription Question",
        "content": "I just bought the netflix basic subscription yesterday with 6 dollars and i was wondering why it says that it will expire on 26th december or that they will charge me again on 26th and until then i can still watch (something like that).  Shouldnt be until 9 january? Also if I upgrade my plan from basic to standard for exemple it doesnt charge me even tho I have upgraded it. now i can simultanously watch with my friend on different devices\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hb8fsp/netflix_subscription_question/"
    }
]