[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 54,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 18,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1r663yp",
        "author": "Zokieiei022",
        "title": "Did Don't Look Up age way too well… or was it always this accurate?",
        "content": "I just rewatched Don't Look Up and honestly it hits differently now. When it first came out, I thought it was exaggerated satire. But on a rewatch, the media chaos, political spin, meme culture, people turning everything into a trend… it doesn’t even feel unrealistic anymore.\n\nDo you think the movie was brilliant social commentary, too on-the-nose, or just heavy-handed? And which character do you think was the most realistic?\n\nCurious how everyone feels about it now vs when it first dropped.",
        "upvotes": 372,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1r663yp/did_dont_look_up_age_way_too_well_or_was_it/"
    },
    {
        "id": "1r68bvn",
        "author": "MintySea92",
        "title": "Reality Check: Americas Next Top Model",
        "content": "Tyra, the judges and all the producers on that show were just pure evil towards those girls. They filmed and aired a crime, put many through unnecessary surgeries as well as mentally and physically humiliating them. To then have the gall to justify it all by saying they didnt realise they were hurting them at the time and that they were helping them!!\n\nThe documentary was a hard watch and I hope all the women involved have been able to find some happiness after the trauma they were put through.",
        "upvotes": 141,
        "comments": 75,
        "media": null,
        "permalink": "/r/netflix/comments/1r68bvn/reality_check_americas_next_top_model/"
    },
    {
        "id": "1r6b8pb",
        "author": "reaper88911",
        "title": "Issues with rewatching shows?",
        "content": "has anyone else had issues with rewatching shows? I wanted to start LDR again, started an episode then it always goes to \"play next episode\" and plays Lucky 13 instead on the next one in sequence. (its already odd that S4 is at the top.) but most eps are in the \"seen\" stage with the red bar, they play for 1 or 2 seconds then go to the \"playing next\" screen and skip to lucky 13..\n\nwe need a \"start again\" button to reset all the red progress bars i guess.",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1r6b8pb/issues_with_rewatching_shows/"
    },
    {
        "id": "1r6fxdx",
        "author": "Infinite-Albatross44",
        "title": "Your Monster, was really amazing!",
        "content": "“IT’S NOT OK!”\n\nI almost broke down at this moment because the scene is so deeply moving. It honestly feels possibly Oscar worthy. All those times when people run over you and you tell yourself it is ok, even when you know it is not. You keep going anyway, trying not to look unhinged, trying to survive the feeling. It is painfully relatable.\n\nYour Monster carries strong Beauty and the Beast energy with a love story that wrestles with the inner self. It explores the struggle to overcome the distance between loving who you are inside and facing a world that keeps pushing past your boundaries.\n\nJust gorgeous and completely unhinged in the best possible way.\n\nThey also killed the ending!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r6fxdx/your_monster_was_really_amazing/"
    },
    {
        "id": "1r6ey58",
        "author": "Aromatic-Bad146",
        "title": "How can I complain?",
        "content": "I am based in the U.K. and I try to change my password and it says can’t do this try again later. I chat to them online and they say please manage your account via my account. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1r6ey58/how_can_i_complain/"
    },
    {
        "id": "1r6exe2",
        "author": "Einsteinssister",
        "title": "Reality Check: Americas Next Top Model severe abuse!",
        "content": "Shandi being raped while completely blacked out, no stopping it, AND then supposedly filming it is absolutely insane. Filming her break up after being raped was so tacky. Why in the world did they even put that into the story line? Shandi faced significant backlash and bullying online. \n\nAlso hearing that they filmed while a girl was showering with another guy was said to be prohibited? Sounds like a bunch of creeps to me.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1r6exe2/reality_check_americas_next_top_model_severe_abuse/"
    },
    {
        "id": "1r6dv4n",
        "author": "PLUSsignenergy",
        "title": "Help me find a German or Dutch sci/fi show",
        "content": "I remember watching it around 2019 or maybe 2021. It reminds me of the German show, “DARK.” It has a main female protagonist whose brother or someone she knows went missing into the woods. The show revolves around this forest that some believe is being protected by a goddess of Celtic origin that started with an A. I believe the deity was part deer? The deity kidnaps her and chains her up. I think the dear ended up being her brother? \n\nWell, I can’t anything about this! Help! ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1r6dv4n/help_me_find_a_german_or_dutch_scifi_show/"
    },
    {
        "id": "1r5vd00",
        "author": "Sad-Conflict-4435",
        "title": "The Hunting Party",
        "content": "So is anyone else watching this? I tuned in cuz of my love/hate relationship with Melissa Roxburgh. She was in \"Manifest\"...which happens to be one of my all-time favorites. Lmk what's y'all think?",
        "upvotes": 15,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1r5vd00/the_hunting_party/"
    },
    {
        "id": "1r5k2gw",
        "author": "Tomegaro",
        "title": "Mindhunters Similiar Shows",
        "content": "So I just finished Mindhuners and OMG I CAN'T BELIEVE IT TOOK ME THAT LONG TO WATCH IT! Loved everything about it - although the ending of season 2 left a bit to be desired imo. \n\nThe cinematography, Kemper's acting, the interplay between the two FBI agents, and getting into the mind of psychopaths - amazingly told.\n\n  \nAfter finishing it, finished the Ted Bundy series (not as good imo), watched a bit of the Monster: Dahmer series again... \n\n  \nBasically wondering, what would you recommend to watch next that in that realm that's as good as Mindhunters? Documentary, Series, movie, it's allll good ",
        "upvotes": 47,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1r5k2gw/mindhunters_similiar_shows/"
    },
    {
        "id": "1r6d9cr",
        "author": "QuatroAcounto-4",
        "title": "Southland: Miranda Rights non existent",
        "content": "I’m on season 2 episode 3 and I swear I haven’t heard one suspect be mirandized. I know they won’t show it for every arrest because they would get repetitive as hell for a TV show.  But I swear I haven’t heard it once ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1r6d9cr/southland_miranda_rights_non_existent/"
    },
    {
        "id": "1r5bits",
        "author": "Orangeandjasmine777",
        "title": "ER just appeared on UK Netflix. Should I give it a try?",
        "content": "As I search Netflix for a new show to watch, I notice the American TV show ER recently came to Netflix UK. I realise this show is not a brand new show. \n\nI like medical dramas. New Amsterdamn. Chicago Med. Good Doctor. I also like psychological thrillers. Is ER a little too dated or should I give it a go? ",
        "upvotes": 45,
        "comments": 90,
        "media": null,
        "permalink": "/r/netflix/comments/1r5bits/er_just_appeared_on_uk_netflix_should_i_give_it_a/"
    },
    {
        "id": "1r5t9ch",
        "author": "Artvandelay2019",
        "title": "Looking for name of show. Trailer has a group of people robbing a warehouse, tieing everyone up and taking down a safe with a forklift.",
        "content": "I saw the trailer for a show last night on Netflix. The categorie was \"cops\" or some thing similar. I believe it was 6-8 episodes. Wanted to watch it today but can not find it. The description was something about the robbers and the cops following them. It was not a documentary. Does anyone know what it is? I wish I wrote it down. Not sure when It came out",
        "upvotes": 4,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1r5t9ch/looking_for_name_of_show_trailer_has_a_group_of/"
    },
    {
        "id": "1r5z4kk",
        "author": "trypz",
        "title": "Casting from Phones",
        "content": "Did Netflix make a change on Android so I can't cast to a tv? it is still available on my wife iPhone... it's annoying because I use it to watch shows in hotels and Airbnb's without logging in everywhere... ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1r5z4kk/casting_from_phones/"
    },
    {
        "id": "1r52dkf",
        "author": "Immediate_Strike7720",
        "title": "The Lincoln Lawyer",
        "content": "I’ve just finished season 4 and this was by far the best season in my opinion. The whole case and how it played out was done brilliantly as well as integrating the side cases with Lorna. I see that they’ve renewed another season, not sure it can top this one though and wondering if they should’ve ended on a high? What’s everyone else’s thoughts on this? ",
        "upvotes": 92,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1r52dkf/the_lincoln_lawyer/"
    },
    {
        "id": "1r5lj3c",
        "author": "Technical-Berry233",
        "title": "Rewatching Dash &amp; Lily after a bad week made me realize how much it shaped my idea of love",
        "content": "I just rewatched Dash &amp; Lily after having a pretty rough week, and I’m kind of emotional about it.\n\nI first watched it when I was 14, and I don’t think I realized at the time how much it shaped my idea of what love should be. That show genuinely formed the way I see romance, as something pure, intentional, and almost… perfect in its imperfection.\n\nIt’s not the most spectacular or dramatic series ever. It’s not trying to shock you or overwhelm you. It’s just balanced. A little humor, a little sadness, a little awkwardness, a little magic. But somehow it all comes together in a way that feels so safe and warm.\n\nThe whole notebook concept, two people connecting through words before really knowing each other  it just feels so sincere. Like love doesn’t have to start with fireworks or chaos. It can start with understanding. With curiosity. With vulnerability.\n\nAnd the atmosphere?? The Christmas vibe in New York City, the bookstores, the quiet moments, the soundtrack it creates this world that feels softer than real life. Like there’s space to breathe.\n\nWatching it again now, after feeling kind of suffocated by the world lately, it still gives me that same healing feeling. Like maybe out there, somewhere, there really is someone who fits you in that almost poetic way. The right timing. The right dynamic. The “this makes sense” kind of connection.\n\nI genuinely can’t believe I didn’t rewatch it sooner. I think I’m going to make it a thing now anytime life feels heavy, I’m putting it on.\n\nIt might not be the most complex show ever made. But to me? It’s perfect. And I kind of owe it for shaping the part of me that still believes love can be something pure.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1r5lj3c/rewatching_dash_lily_after_a_bad_week_made_me/"
    },
    {
        "id": "1r5cp3u",
        "author": "RiskAndReason",
        "title": "Has anyone watched The Museum of Innocence?",
        "content": "I recently started watching The Museum of Innocence and I’m really curious what others think about it.\n\n\n\nDid it capture the emotional depth and atmosphere of the story for you? I feel like it’s more about obsession than plot, and that’s either going to click or completely miss depending on the viewer.\n\n\n\nIf you’ve watched it, did you love it, find it slow, or somewhere in between?",
        "upvotes": 7,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1r5cp3u/has_anyone_watched_the_museum_of_innocence/"
    },
    {
        "id": "1r584pv",
        "author": "PLUSsignenergy",
        "title": "Highly recommend the German series, “The Signal.”",
        "content": "It’s a shirt limited series. I loved the show, “Dark” &amp; “The Rain” and needed something to  itch my German sci-fi scratch. Does a really good job and explaining everything from the start to finish! 9/10 ! ",
        "upvotes": 17,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1r584pv/highly_recommend_the_german_series_the_signal/"
    },
    {
        "id": "1r5lnpy",
        "author": "ZealousidealAerie657",
        "title": "Profiles disappearing?",
        "content": "I was on netflix as usual and i noticed that I was on a profile named 'C'. I completley logged out and logged back in and it was still that way. Our account had 5 profiles on it. Not sure how they would've been removed",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1r5lnpy/profiles_disappearing/"
    },
    {
        "id": "1r560if",
        "author": "Chemical-Visual-20",
        "title": "Favorite Show Intro and why?",
        "content": "mine is stranger things because of the song, how it fits the show, the red in the logo, it looks scary imo and the way it shows the stranger things logo for it.",
        "upvotes": 7,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1r560if/favorite_show_intro_and_why/"
    },
    {
        "id": "1r5bszk",
        "author": "Extension_Cheek_2850",
        "title": "Netflix New Zealand",
        "content": "Is SO dry. Everytime that $26 hits I'm reminded that I do indeed have a Netflix account. Netflix in general does a poor job at their synopsizing (that doesn't feel like a word 🧐). There's top tier movies and shows I watched outside Netflix that I would absolutely scroll so fast by in app.\n\nWhat's everybody watching? For context I like a phycological thriller, ie my baby father Jake Gylenhall (close nuff) in 'Prisoners', oh he's great in 'Everest' too, that one where he's like a street 'journalist' ambulance chaser type energy.. hmm ok so I'm a big fan then.\n\nDisaster movies, gimme just disaster like the Swedish are good at that just I don't often feel like reading a movie but worth it when I do. \n\nComedies are tough for me it gotta be stupid funny for me to laugh aloud. Also uncle Dave Attenborough everything. Lemme know what y'all are on, not restricted to netflix! 🤙🏽",
        "upvotes": 3,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1r5bszk/netflix_new_zealand/"
    },
    {
        "id": "1r4flrh",
        "author": "Particular-Can-8382",
        "title": "drop your “cancelled after once season” show",
        "content": "i just started archive 81 and promptly found out the series stops at a cliffhanger and was cancelled. this just keeps happening to the shows i watch or the shows i find after the fact. i love it, binge it, and then proceed to find out that the idiots in charge somewhere decided to cancel after the first season despite some significant viewership for some shows. \n\ni get that 2020 was difficult with covid, then we had the writers strike. but it just keeps happening. i seem to watch less and less on netflix, i try to hunt for a good show but if they all just get cancelled after one season, whats the point? \n\ni just need to commit and cancel my subscription. Netflix is too focused on getting content out and doesn’t find it worth the effort to continue the shows they start. here’s my top 10 for shows they cancelled for (mostly) no reason\n\n1. Archive 81\n\n2. 1899\n\n3. Resident Evil\n\n4. The Midnight Club (thank you mike flanagan for providing us a mini synopsis of what season 2 would have been about)\n\n5. Lockwood &amp; Co.\n\n6. Kaos \n\n7. Midnight Gospel\n\n8. High Rise Invasion (i don’t think this was confirmed cancelled, but it has been 5 years)\n\n9. The Society\n\n10. In From the Cold",
        "upvotes": 178,
        "comments": 329,
        "media": null,
        "permalink": "/r/netflix/comments/1r4flrh/drop_your_cancelled_after_once_season_show/"
    },
    {
        "id": "1r5iz5p",
        "author": "30DayRefund",
        "title": "Need Netflix Premium for 5.1 surround sound?",
        "content": "Edit: Someone on another reddit group gave me the solution! I logged into Netflix using a Chrome browser on my PC. Then I went to Account -&gt; Edit Settings -&gt; Playback Settings -&gt; Data usage per screen. It was set to Low by default. I changed it to High. Then I went back to the Roku on my TV and, BAM!!! Stranger Things on the Netflix app now shows the 5.1 logo! I just watched the first 10 minutes of season 5 episode 1 in full glorious 5.1 surround sound.\n\nOriginal: I have a Roku streaming box and I'm on the Netflix Standard plan. I can't get 5.1 surround sound working on any Netflix movies or shows. I know the Roku can output 5.1 surround sound because it's working with other apps like YouTube, MAX, etc. It's just not working with the Netflix app. Do I need to be on the Premium plan to get 5.1 surround sound? \n\nEdit: I know not all Netflix movies and shows may have 5.1 audio. I just tried Stranger Things season 5 because people online say it has amazing surround sound. But I'm only getting 2-channel sound. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1r5iz5p/need_netflix_premium_for_51_surround_sound/"
    },
    {
        "id": "1r568go",
        "author": "sammy_nyc",
        "title": "English orginal vs English 5.1 sound",
        "content": "So i am having trouble listening to speech on new TV series (like Unfamiliar) in Netflix ennglish 5.1, i need to switch to English original so the backgound music goes down (this happens with older movies as well), but new series and new movies should be able to handle English 5.1.\n\nSo why is this happening with newer TV series on netflix, when in actual fact speech should be clear and louder than background music? I need to switch from English 5.1 to English orginal. \n\nI have LG s75qr surround speakers that are 5.1.2 and they work well and have been pleasing to the ears for 3 years.\n\nThanks ",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1r568go/english_orginal_vs_english_51_sound/"
    },
    {
        "id": "1r530db",
        "author": "aj12309",
        "title": "Better call Saul",
        "content": "About to finish better call Saul for the first time. I’ve seen breaking bad once about 10 years ago. When I finish better call Saul should I go back and watch break bad?",
        "upvotes": 6,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1r530db/better_call_saul/"
    },
    {
        "id": "1r5umcm",
        "author": "GODSchile223",
        "title": "Katt Williams",
        "content": "I adore Katt Williams. He always tells the truth, and shame the devil. As well as, give with a good heart, without the fan fair. \n\nDon’t ever underestimate his intelligence, or his generosity. ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1r5umcm/katt_williams/"
    },
    {
        "id": "1r51q80",
        "author": "Gleis7",
        "title": "Finding Her Edge is poorly written! But a very enjoyable Binge.",
        "content": "Honestly, I still had a great time watching the show. It’s not the next masterpiece, but it was a fun, quick 8-episode binge. I’ve read complaints about the poor acting, but I couldn't care less because I actually enjoy a bit of trashy love triangle drama. However, one thing that really annoyed me was the relationship between the sisters, Adriana and Elise. They literally went from loving each other to being die-hard enemies wishing the worst on each other within five minutes. It didn't just happen once, it felt like it happened every single episode. It was laughable and made zero sense. Another thing that bothered me was how unrealistic the money situation was. Being 30k in debt is laughable if ALL of your pro athletes are going to the World Finals. I don't know exactly what figure skaters make, but I do know what sponsorships pay for a whole roster of World Champs. It made the debt plot point feel really weird. Also, why was there no winning party at the end? That felt like a huge missed opportunity!",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1r51q80/finding_her_edge_is_poorly_written_but_a_very/"
    },
    {
        "id": "1r4mrxm",
        "author": "queenstutter",
        "title": "His &amp; Hers",
        "content": "What other movies or series can you recommend that are similar to His &amp; Hers? In terms of plot, twists and length. We really enjoyed it and we like to see more like this!",
        "upvotes": 19,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1r4mrxm/his_hers/"
    },
    {
        "id": "1r58ga7",
        "author": "Miserable-Hunter5569",
        "title": "Unfamiliar watch",
        "content": "They should name at least one episode - Finding Nina (Nemo) in the next season.\n\nGreat show and I hope it runs more.\n\nThere was no twist as such beyond the one reveal which was somewhat out there but I liked the show.\n\nThe amount of prep and backup plans the two of them had in that safe house was amazing.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r58ga7/unfamiliar_watch/"
    }
]