[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 40,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 12,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qi6xr5",
        "author": "Fun_Molasses5215",
        "title": "Queer Eye's Karamo claims he's felt 'mentally and emotionally abused for years' as he pulls out of press for upcoming season over fear of his co-stars 'bullying' him",
        "content": "",
        "upvotes": 303,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1qi6xr5/queer_eyes_karamo_claims_hes_felt_mentally_and/"
    },
    {
        "id": "1qie9lh",
        "author": "obviouslyapparant",
        "title": "Does anyone else struggle with over the top background music?",
        "content": "Has anyone else noticed the increased presence of over the top background music? I not only struggle to hear the dialogue but I find it so distracting that I’ve had to turn a few programmes off because if it. It’s not even adding anything to the programme itself (I mostly watch documentaries) and it’s not subtle.\n\nI’ve tried changing the audio settings but it’s not helped. It’s not just Netflix recently but it’s the main culprit. ",
        "upvotes": 38,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1qie9lh/does_anyone_else_struggle_with_over_the_top/"
    },
    {
        "id": "1qidygb",
        "author": "-deetjay-",
        "title": "Netflix beats revenue estimates as subscribers reach 325 million",
        "content": "",
        "upvotes": 21,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qidygb/netflix_beats_revenue_estimates_as_subscribers/"
    },
    {
        "id": "1qi4iq9",
        "author": "jtsm1th01",
        "title": "Spoiler Ad DURING the Show Itself!",
        "content": "I started watching Stranger Things Season 1 Episode 1 with my son who had never seen the show before and in the first few minutes, a Verizon ad airs with Stranger Things spoilers! In the ad, characters literally explain key scenes to each other, spoiling the show we're ACTIVELY watching!?\n\nWhat a terrible decision by Netflix to not prevent this type of thing. I had to yell at my son to close his eyes while scrambling to hit the mute button so it wouldn't ruin the show. I know he's late to the party, but he's just now old enough to watch the show and was so excited to start it.\n\nAiring trailers for future seasons which spoil unwatched seasons is bad enough, but this seems like a new level of disregard. If nothing else, can't they put it some type of setting to disable these types of things?",
        "upvotes": 53,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1qi4iq9/spoiler_ad_during_the_show_itself/"
    },
    {
        "id": "1qhybb7",
        "author": "unicorn540",
        "title": "Keira Knightley and Ambika Mod spotted filming for series two of Black Doves",
        "content": "The two actors were filming outside St Mary le Strand",
        "upvotes": 58,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qhybb7/keira_knightley_and_ambika_mod_spotted_filming/"
    },
    {
        "id": "1qid230",
        "author": "_fastcompany",
        "title": "How Netflix brought interactive voting to ‘Star Search’",
        "content": "On January 20, Netflix is bringing back the popular talent competition *Star Search*, with a twist: For the first time in its history, Netflix will let its audience decide the outcome of a show with live voting. However, unlike how shows have done this in the past, audiences won’t have to send text messages or call a special number to make their votes count. Instead, viewers will vote with their TV’s remote control, or right within the Netflix app if they watch the show on their phones.\n\nNetflix hopes that this level of simplicity will help to make live programs like *Star Search* a lot more exciting, and offer its audience a chance to experience shared watercooler moments that tend to be missing from today’s world of hyper-personalized streaming. “You can influence the outcome \\[together with\\] everyone at the same time,” says Netflix member product VP Elmar Nubbemeyer. “You’re part of the Zeitgeist at that moment.”\n\nTo bring real-time voting to *Star Search*, Netflix relied on work it previously did for interactive narrative shows. It also snuck voting tests into David Chang’s Netflix show, and showed focus groups segments from two fake shows it cooked up for testing purposes.  The company even built internal tools that will help it to repurpose live voting and polling for other live events and shows in the future.\n\n“We are planning more of these types of moments,” says Netflix product designer Navin Iyengar. “*Star Search* is really the big unveiling of it.”\n\nWhen *Star Search* debuts Tuesday evening, viewers will have two distinct opportunities to make their voices heard. Once a singer or comedian is done with their performance, a graphic will pop up on screen, encouraging each viewer to give it a rating ranging from one to five stars. “We knew early on that giving a star rating as an interaction was really important,” says Iyengar. “It’s core to the *Star Search* IP.”\n\nLater on, they’ll also get the chance to choose their personal champion of the night out of four choices presented next to each other on screen. Each voting graphic will remain on screen for about 60 seconds, and the show’s host—Anthony Anderson, best known for the ABC sitcom *Blackish*—will respond to the incoming vote tally in real time.\n\nIt’s the first time Netflix has done real-time voting like this, but the company has been experimenting with getting viewers more actively involved for almost a decade. In 2017, the streaming service released its first interactive TV shows, which prompted viewers to choose their own adventure through branched narratives. In one scene of “Bandersnatch,” an interactive episode of the dystopian sci-fi show *Black Mirror*, the viewer has to decide whether the main character should take his medication by pressing left or right buttons on their remote control, with different choices leading to vastly varying outcomes. \n\n[Read more on Fast Company.](https://www.fastcompany.com/91477533/how-netflix-brought-interactive-voting-to-star-search)",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qid230/how_netflix_brought_interactive_voting_to_star/"
    },
    {
        "id": "1qia0l4",
        "author": "its35degreesout",
        "title": "Southland",
        "content": "Not really a \"question,\" but in a way it is: how long has Southland been available on Netflix? They have just recently started promoting it on my feed, and I am happy to see the series is now available, since before cutting the cable cord that was one of my favorite cop shows. It used a number of storytelling devices which at the time felt new to me, and had a real, gritty flavor. We are planning to watch it as soon as we are done with the series we are watching now! Highly recommend. ",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qia0l4/southland/"
    },
    {
        "id": "1qibszf",
        "author": "Mr_Perfectly_UnFine",
        "title": "Rom com recommendation",
        "content": "So I love romcoms like While you were sleeping, pretty woman, the Proposal etc. \n\nI have seen People you meet on vacation and loved it. Any similar movies you can recommend?",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qibszf/rom_com_recommendation/"
    },
    {
        "id": "1qidkep",
        "author": "AstralKatOfficial",
        "title": "This might be an odd question but is the \"Still Watching Netflix\" youtube channel an official one from netflix?",
        "content": "I've seen a few videos from that channel pop up in my feed and it seems to be like a behind the scenes channel which to be fair the channel description does mention, but I always get apprehensive about these kinds of channels if they aren't official. I love watching behind the scenes stuff so I'd like to know if it's an official channel owned by netflix or if its just some rando uploading clips from other places",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qidkep/this_might_be_an_odd_question_but_is_the_still/"
    },
    {
        "id": "1qig44r",
        "author": "Budget-Limit-2328",
        "title": "Help my math issue with tax",
        "content": "Hi everyone! I’m new here and don’t know if I’m doing this correctly. If I manage to fudge or mess this up my sincerest apologies. So I don’t know how to figure tax after a price for Netflix- my state has them( WA state), and im struggling to figure out the end price after tax so I can buy a gift card with that exact amount every month- why?  Ive had too many billing issues with them to do it off my credit card. That said can someone please help me with the tax part of the price?!? The initial price for us is saying - it’s 24.99 a month. Any help would be epic! No I don’t need a math lesson I’m not good with numbers no matter how hard I try so answers like that I’ll ignore to save my mental health. Thanks for reading! I appreciate you all so much for your help!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qig44r/help_my_math_issue_with_tax/"
    },
    {
        "id": "1qi4wao",
        "author": "castrati0n",
        "title": "People we meet on vacation review",
        "content": "*Posted this on letterboxd but I also wanna see a discussion on this here*\n\nWhile watching this I REALLY had to rationalize so so much. I was in an endless rollercoaster of *“oh this is bad” “okay yeah no I get it” “no what the fuck” “yeah that’s understandable” “what the hell”* and just ended with that.\n\nI am all for messy plots but this was probably just not for me. It deserves this rating *(2/5 stars)* for its execution and filmography at least. What made this movie feel good was how well romanticized it was. Tom Blyth and Emily Bader did incredibly well. For a second, they really make you tolerate emotional cheating, lol. But I also feel like it was so overdone in this movie that in the end, there was just no more rationalizing it.\n\nSo many of the reviews from the ones that have read the book are complaining about parts that were not added and as I’m reading through it all, it makes me thankful they weren’t. What do you mean he was supposed to get a vasectomy after the pregnancy scare even though he wasn’t the hypothetical father? That makes it so much worse.\n\nEverything also felt a bit too romanticized. Kissing in the rain, in the middle of a pedestrian, and during the challengers wind that makes you cheat (iykyk). It felt like they tried to make the kiss scenes feel more immersive, but it just ended up feeling overdone.\n\nAnother thing, Sarah could have said a bit more during that encounter with Poppy at the airport. I understand her implication that “Poppy wasn’t the problem” even though they did end because of her, but it was still a bit vague. It’s probably because she was in a rush and all, but she really could have said a bit more.\n\nAlso, probably the most controversial part of this review—not a fan of the soundtrack. It is so typical and they could have done so much better with some of the song choices. Taylor Swift and CAS, really? But this one’s highly subjective because I think both are a bit overrated. Sorry to anyone who’s a fan of both reading this.\n\nAlso, let’s be realistic. What kind of girl who just put on her gloss would make out with someone.",
        "upvotes": 5,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1qi4wao/people_we_meet_on_vacation_review/"
    },
    {
        "id": "1qiig98",
        "author": "JKSJ4567",
        "title": "Stick the landing",
        "content": "So I saw ST for the first time last November and caught finished the show. One thing that I found interesting is one of the directors said “it doesn’t matter if a show can become murky in the middle of it. It can be forgiven with sticking the landing.”/the best part remembered will be the ending. \n\nMy opinion is they didn’t do that. There was just so much questions and plot holes left open. This also made me think about other Netflix shows and their endings. I found it crazy just how much the ending with ST made me not want to rewatch it ever because it felt like they gave up with their characters in the end.\n\nWhile on this subject a show that came to mind that actually did achieve that saying/phrase was Cobra Kai. I know a lot of people have criticism and praise for this show so here’s my hot take. Cobra Kai handled their show and characters better. I felt more emotion for how Daniel, Johnny, and Miguel’s arcs and characters were handled through that show. They didn’t butcher the characters. Even then I can’t complain that the show became murky in the middle. They brought back older characters and introduced new ones which always kept the stakes high. Anyways Cobra Kai is a show I can go back and rewatch with enjoyment. As for ST I can’t say the same with how they handled it. What does anyone else think?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qiig98/stick_the_landing/"
    },
    {
        "id": "1qian90",
        "author": "unknownuserorsomthin",
        "title": "I can’t connect to Netflix servers error code nw 2-5",
        "content": "I know it is cause of bad WiFi but I have decent WiFi it’s not the best but it works on anyother device expect my ps5 and Netflix says it can connect with the internet connection but not the Netflix servers they can’t connect and give error code nw 2-5 all 3\n\nAlso I have tried restarting my router and abt all those things to get better WiFi I have abt 40-60 mb per second connection speed (download) so I thinks that’s pretty decent \n\nSo is there anything else I can do or try to fix this ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qian90/i_cant_connect_to_netflix_servers_error_code_nw_25/"
    },
    {
        "id": "1qigiyg",
        "author": "Jonlaffy",
        "title": "Netflix or internet?",
        "content": "For some reason, netflix is the only streaming service I have an issue with. My router light quits blinking (meaning no internet), then it kicks me off. Immediately after, Samsung smart TV, Amazon prime, Paramount, etc; work just fine and consistently. I have tried changing laguages, turn subtitles on and off, disconnect my router and plug it back in, reinstall the app, check for an update. I'm out of options. Unless any of you all may have a fix?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qigiyg/netflix_or_internet/"
    },
    {
        "id": "1qigbne",
        "author": "knotacceptable",
        "title": "What was the point of the guitar ********* scene in Harlan Coben's Run Away?",
        "content": "The guy in the bar, pretending to buy the guitar and then thrashing it for laughs. I just don't see how it adds to the plot at all. Sorry if this question has been asked already.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qigbne/what_was_the_point_of_the_guitar_scene_in_harlan/"
    },
    {
        "id": "1qieeng",
        "author": "AdviceHuge8114",
        "title": "Looking for a documentary",
        "content": "Someone suggested a documentary called “the lie” about a girl missing in New Zealand can’t find it anywhere apperantky it’s similar to perfect neighbour which was one of the best Netflix docs in a long time ",
        "upvotes": 1,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1qieeng/looking_for_a_documentary/"
    },
    {
        "id": "1qht0cy",
        "author": "HotPotatoPieee",
        "title": "Behind her eyes (I hated the ending)",
        "content": "TW: lots of spoilers. This was actually the most aggravating show I’ve watched. I saw someone talk about it along his &amp; hers (I loved this show) so I figured I’d watch. The first time Adele and Rob astroproject together I saw the colors of their projections so the show was spoiled for me in that moment. \n\nBinged it this weekend but the last episode pissed me off. I thought Louise was smart when she clocked Adele after Adam caught her Astro projecting. But I lost it when she proceeded to call Adele after David told her not to speak to her. FURTHER, tells her about what she knows about Rob and says he’s going to the police🤨. After her failed judgement you’d think she’d actually listen to David this time. \n\nOnly character I liked in this show was her friend. She’d clock Louis all the damn time and rightfully so but Louis shut her off after. That’s the most level headed person Louis had in her life. Idc how much pity she felt for Adele, all those interactions were just gross for character development. How can you claim to pity someone and sleep with their husband repeatedly🙂?? Her judgement throughout the show was so excruciatingly painful.\n\nAs if she didn’t already act stupid enough. She could’ve called 911 to stop the fire. BUT SHE ASTROPROJECTS???? Wtf was she planning to do in the moment. Like it was so foolish it pissed me off. I knew what was coming next when she decides to astroproject and we see Robs projection in the room as well. I was so livid I turned it off when Louise is confronted by Adele and climbs on her.\n\nI’ve never seen so much stupidity in a plot I was aggravated I didn’t want to watch the rest. Like I’ve never seen a worse ending. The fact that Rob wins and David is still sentenced to hell is just sick. I need to wash this show out of my system and forget I ever watched it ",
        "upvotes": 14,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1qht0cy/behind_her_eyes_i_hated_the_ending/"
    },
    {
        "id": "1qi9tqc",
        "author": "gud_fellow",
        "title": "Is there any difference in the website version of Netflix and the app?",
        "content": "Hey people of r/netflix , is there any difference in the resolution of shows and quality of sound in the netflix's website version and the app of Netflix? \n\nI mostly watch shows on the website version of Netflix on my computer but I found out we can download the desktop version from Microsoft Store. So I wondered if it has any difference like website being limited to a certain resolution, same with the sound quality.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qi9tqc/is_there_any_difference_in_the_website_version_of/"
    },
    {
        "id": "1qikk6u",
        "author": "dontay0100",
        "title": "Sign the Petition",
        "content": "- BRING SABRINA BACK!!! NETFLIX YOU'RE NOT LISTENING TO WHAT WE WANT!! DO IT, YOU HAVE THE FUNDS, BRING HER BACK, WE NEED HER ESPECIALLY NOW WHEN THE WORLD IS IN TURMOIL, WHO CAN SAVE US!!! SABRINA THAT'S WHO. STRANGER THINGS HAS ENDED, YOU DONT HAVE ANYTHING THAT HITS HARD RIGHT NOW IN THE HORROR GENRE. DO THIS! ITS A MONEY MAKER!!! WHAT DO WE BAVE TO DO?!? ITS BEEN 6 YEARS, IT'S TIME! OR LET SOMEONE ELSE PICK IT UP, DONT BE SELFISH, DO WHAT US THE CUSTOMERS WANT!! WHY ARENT YOU LISTENING!!!!!!!!!!!!!!!!!!!!!! LET US HELP YOU, BY YOU HELPING US!!!! ALL THOSE VIEWERS YOU'VE LOST THROUGHOUT THE YEARS, WILL COME BACK. ITS GUARANTEED TO HAPPEN, YOU JUST DONT KNOW WHAT POTENTIAL YIU HAVE ON YOUR HANDS HERE.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qikk6u/sign_the_petition/"
    },
    {
        "id": "1qhjsrb",
        "author": "fairplanet",
        "title": "why tf cant i stream netflix to my tv/cromecast anymore?",
        "content": "like i cant stream netflix to my chromecast anymore? my chromecast has always been funky with netflix like just not working but i didnt use netflix a while and wanted to cast but there is no option anymore?\n\nis there a way to fix it? ",
        "upvotes": 32,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1qhjsrb/why_tf_cant_i_stream_netflix_to_my_tvcromecast/"
    },
    {
        "id": "1qhqu60",
        "author": "Crafterandchef1993",
        "title": "Why remake the seven dials mystery when you completely change the story?",
        "content": "Netflix made a seven dials mini series, but it's not like the book or the 1981 adaptation. It's a different story, and for some reason, putting Bundle and Gerry together as a couple. The 1981 adaptation was so charming, that I'm not sure if I like this adaptation, all the Netflix version makes me want to do is watch the 1981 film. Which I have on dvd",
        "upvotes": 13,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qhqu60/why_remake_the_seven_dials_mystery_when_you/"
    },
    {
        "id": "1qhugrt",
        "author": "True_Ask_6886",
        "title": "Need Suggestions to Watch",
        "content": "So I want to watch a new tv show, I've already watched a bunch on Netflix, but all the ones Im seeing are for 18 or 16 year olds (Im 14). I was hoping for any new suggestions of what to watch! Like, I dont mind excessive violence or horror like AOUAD or AIB, but I really dont want to watch something like..... Bridgerton, Game of Thrones. Id appreaciate any suggestions you could give me!",
        "upvotes": 5,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1qhugrt/need_suggestions_to_watch/"
    },
    {
        "id": "1qhkas5",
        "author": "VesnaKostic",
        "title": "Similar series like Run Away by Cobain that the last scene left me with my MOUTH WIDE OPEN",
        "content": "I have watched all the other series by Coben and I like that every scene is a new TWIST. I want a tv show with as many twists and turns as possible. \n\nI want something twisted and that I never dreamed that it was a plot. 😶‍🌫️😶‍🌫️😶‍🌫️😶‍🌫️😶‍🌫️",
        "upvotes": 13,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1qhkas5/similar_series_like_run_away_by_cobain_that_the/"
    },
    {
        "id": "1qhpzag",
        "author": "Boring_Ant_1677",
        "title": "Sasha Calle and Catalina Sandino Moreno on The Rip, Moral Panic, and Life-Changing Cash",
        "content": "",
        "upvotes": 7,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qhpzag/sasha_calle_and_catalina_sandino_moreno_on_the/"
    },
    {
        "id": "1qhz4jb",
        "author": "toxic_1484",
        "title": "Need help with RDR mobile",
        "content": "I have an iPad Pro 2018 with iOS 18.\n\nWhen I start the game, the screen is full of pixels and a colour chaos. So I didn’t see anything. \n\nI have reinstalled the game many times and restarted my device many times. I deleted my iPad and make it new. But all of this fixed doesn’t help.\n\nI didn’t find any solutions for my problem. So I hope someone here can help me.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qhz4jb/need_help_with_rdr_mobile/"
    },
    {
        "id": "1qhysk5",
        "author": "MadxxDog",
        "title": "Remember to cancel Your \"Extra Member\" slot - sneaky charges by Netflix !",
        "content": "Like in title. After you remove addition member from your account, remember to cancel your \"Extra Member\" slot too. You will be charge if you don't do it !\n\n",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1qhysk5/remember_to_cancel_your_extra_member_slot_sneaky/"
    },
    {
        "id": "1qi7bdu",
        "author": "Inevitable-Move4941",
        "title": "“You’ve reached the yearly download limit for this video (10016-22006)” How many downloads? Is there a workaround?",
        "content": "“You’ve reached the yearly download limit for this video (10016-22006)” How many downloads? Is there a workaround?\n\n“You’ve reached the yearly download limit for this video (10016-22006)” How many downloads? Is there a workaround?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qi7bdu/youve_reached_the_yearly_download_limit_for_this/"
    },
    {
        "id": "1qhvnpx",
        "author": "nightflame5",
        "title": "Netflix Network Diagnostic Info for my ISP to Troubleshoot?",
        "content": "Netflix has detected my Thai ISP Triple T Broadband is using a VPN and restricts content I can see to only those that Netflix has a global license for. I am NOT using a VPN. I have no interest in using a VPN.\n\n\n\nI contacted Netflix and they state its an issue with my ISP doing some unusual routing.\n\n\n\nI contacted my ISP and they state their connection to Netflix is fine. When I point out content is missing the ISP states its up to Netflix what content they show and nothing to do with them.\n\n\n\nMy TV occasionally shows a warning message about a VPN, but my phone and laptop show nothing, just lots of missing shows.\n\n\n\nMy question is, is there any diagnostic info in the Netflix app that I can show my ISP that Netflix is detecting a VPN? My ISP are not interested if I can connect to Netflix but am missing shows. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qhvnpx/netflix_network_diagnostic_info_for_my_isp_to/"
    }
]