[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 48,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 17,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1r7r53d",
        "author": "TonyTaranteeno",
        "title": "Netflix is single-handedly ruining podcasts",
        "content": "The recent multi-year deals that Netflix made with all these podcasts is going to be the downfall of the podcasts. The podcast companies hold blame as well for being greedy. But this was a major miscalculation by both sides. Completely pulling the full content from YouTube, Apple etc to instead place it all on Netflix and only clips on the previous platforms was a bad move. I’m never gonna go to Netflix to watch a podcast. I’d rather just not watch the podcast. The numbers will reflect the sentiment because I know I’m not alone. ",
        "upvotes": 479,
        "comments": 171,
        "media": null,
        "permalink": "/r/netflix/comments/1r7r53d/netflix_is_singlehandedly_ruining_podcasts/"
    },
    {
        "id": "1r81vsn",
        "author": "_lareine",
        "title": "AMA about Lead Children",
        "content": "I am Jolanta Wadowska-Król’s granddaughter. In 2013, I made a short documentary about her story as a school project - and my film brought her story to the attention of a wider audience. I spent my childhood in Szopienice, and currently work as a doctor in Silesia. If you are curious about the story behind the series - AMA!",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1r81vsn/ama_about_lead_children/"
    },
    {
        "id": "1r869mu",
        "author": "CarelessQuail8121",
        "title": "Give Some Suggestions",
        "content": "Completed the Breaking Bad Universe watching all 3 Breaking Bad, Better Call Saul, El Camino and have previously watched Peaky Blinders and I enjoyed every single show now the case is I don’t really like the hype behind Squid Game, Money Heist kinda shows so give me some real good binge worthy shows that I probably end up enjoying more than Better Call Saul because till now it’s the best show I’ve watched ",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1r869mu/give_some_suggestions/"
    },
    {
        "id": "1r88l7r",
        "author": "Kitli_99",
        "title": "Why do people see the Money Heist gang as heroes?",
        "content": "I see everyone praising the professor and making him a hero (I am not talking about the show. I am talking about the audience) and I find it extremely hard to sympathise with him and the gang.\n\nFirst of all, he is not doing a heroic act by printing the money because he is not distributing it among common people. And to justify that by saying that other huge corporations and governments have also done it doesn’t make it right. Two wrongs don’t make a right. Right?\n\nAlso printing money like this doesn’t have zero consequences. It leads to overall reduction in value of the currency affecting the general public so it is not a good act.\n\nNow, in the last season he was ready to plummet the entire stock market as if it would not affect the common man? Millions would lose their jobs and so many would commit suicide. How is this heroic in any way?\n\nAlso, these heists lead to so many deaths, injuries and emotional pain to so many people.\n\nI am fine seeing them as smart people but to portray them as heroes who are here to save the world is nonsense. Your thoughts?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r88l7r/why_do_people_see_the_money_heist_gang_as_heroes/"
    },
    {
        "id": "1r7pxq0",
        "author": "AttorneyFun4901",
        "title": "First youtube, now netflix",
        "content": "is it down for everyone or just me?\n\nYoutube server just went down about an hour ago. Just opened netflix and started to face problems in netflix as well.",
        "upvotes": 17,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1r7pxq0/first_youtube_now_netflix/"
    },
    {
        "id": "1r87xqo",
        "author": "StephhhLouisa",
        "title": "How does one shoot their shot to work on an upcoming Netflix series?",
        "content": "Netflix recently announced they’re going to be adapting a few of my favorite series and I genuinely wanna see if there’s a chance that I can work on those projects. I’ve heard of people randomly shooting their shot and getting chances so I thought, why the heck not?\n\nI’ll be transparent, I don’t have professional experience within the film industry, most of my “experience” is creative writing projects and things I’d do for fun. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r87xqo/how_does_one_shoot_their_shot_to_work_on_an/"
    },
    {
        "id": "1r87ack",
        "author": "120000milespa",
        "title": "Why wont Netflix acceot my HSBC card ?",
        "content": "Duplicate post as the prior one disappeared.\n\nHad to update CC details as old one expired/cancelled. same bank cards used without issue for the last six or seven years.\n\nCard from HSBC with same bank, same name etc but is rejected.\n\nTried my wifes card from HSBC which is also active without issue and that was rejected \" there appears to be a problem with the payment method' error.\n\ntheres nothing wrong with the card and HSBC has confirmed there are no rejected activities at their end.\n\nAny idea ?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r87ack/why_wont_netflix_acceot_my_hsbc_card/"
    },
    {
        "id": "1r8767j",
        "author": "120000milespa",
        "title": "Netflix Issues with HSBC Credit cards",
        "content": "I had my CC cloned so got a new one and Netflix asked me to update my details - entirely reasonable.\n\nNo matter what I do on the update page, using text code security check or using the App to validate the transaction, the card is declined. the card is entirely valid and has no issues on it. HSBC say theres no attempted/failed transactions from Netflix so its unclear why Nertlfix wont accept a valid card.\n\nThe previous cards used on the account are all of the same type, exact same bank and theres never been an issue so its not 'My Account' thats the issue.\n\nNetflix chat help is stumped as they say theres no issues they can see but I still get the same messages up.\n\nAnyone got any ideas ? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r8767j/netflix_issues_with_hsbc_credit_cards/"
    },
    {
        "id": "1r81mnx",
        "author": "No_Cause_2731",
        "title": "We need new Netflix content in LATAM",
        "content": "Although I've seen new ads for Mexico, and they look interesting, I get the feeling that everything related to Latin America is always heavily focused on drug trafficking, light comedy, telenovelas, and reality TV. But I think we have the resources to explore many more themes. Instead of teen comedies, we should focus more on romance stories with intergenerational female drama, for example, because we have great potential. We need stories of healing that blend people's resilience, as happened with Acapulco, but without forgetting the contrast with the luxury villas and resorts on our beaches, as well as the Mayan and Aztec culture of the interior, because we have so much richness. We need to contrast that with the rebirth of Mexico City and other major cities that offer a blend of history and modernity, all the gastronomy, art—all that potential that sometimes seems to be overlooked as a character in the stories. Now that it seems more will be invested in Latin America, we want stories that travel and showcase our full potential abroad, but that also bring something new to our catalog here.\n\n\n\nDo you agree, or do you think there's already enough new material?",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1r81mnx/we_need_new_netflix_content_in_latam/"
    },
    {
        "id": "1r85x2z",
        "author": "Fit_Technology9418",
        "title": "Which one would you prefer?",
        "content": "I’ve heard mixed reviews about love is blind:Ohio, and Bridgerton, especially season 4. But also heard some hype about the second half of season 4 that releases Feb 26th and love is blind new episodes on Feb 25th. Which one do you prefer and which one do you think is gonna get in the lead between the 2 on the top 10 chart?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1r85x2z/which_one_would_you_prefer/"
    },
    {
        "id": "1r7f570",
        "author": "stravocadomf",
        "title": "Anyone else’s Netflix down right now?",
        "content": "I can watch about 30 seconds and then it forces me to restart and repeat. \n\nThis might not be related but my Crunchyroll is doing the same lmao. Weird day ",
        "upvotes": 40,
        "comments": 60,
        "media": null,
        "permalink": "/r/netflix/comments/1r7f570/anyone_elses_netflix_down_right_now/"
    },
    {
        "id": "1r84u4m",
        "author": "Dark_-_Angel",
        "title": "Every show has the correct colors except Bridgerton",
        "content": "Help me please. I tried everything. I turned on multiple shows on my phone and they look okay but then Bridgerton looks so... dim? Even if I turn the brightness to a 100, on both my phone and in app while I watch, it changes but it's still so dim. I might even say it got like a piss filter. Every season is so dark. I can't even take a screenshot to show you. I have no ai filters, any enhancements are turned off in my settings, I even turned off the HDR thing in Netflix and it's still persisting. I got a Xiaomi 15t pro if there's any significance.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1r84u4m/every_show_has_the_correct_colors_except/"
    },
    {
        "id": "1r837hr",
        "author": "largogoat",
        "title": "His and Hers, help me understand the ending?",
        "content": "I enjoyed H&amp;H and would conditionally recommend it to others. However there are a few plot holes that I can’t wrap my head around. Maybe someone here has read the book which may have more details, or just has a plausible theory on these questions.\n\n1.\t⁠Rachel and Helen were attempting to blackmail Lexi/Catherine, but for what? They couldn’t have known about L’s sister. What then?\n\n2.\t⁠When Richard took Anna to the lake house to clear the air / bury the hatchet with Lexy, what was their true intention? Did Richard confess to Lexy that he banged Anna? When Jack beat him up at the bar and Anna told him she’d tell Lexy they slept together if he pressed charges, he seemed to genuinely not want Lexy to know and agreed not to press charges if Anna kept quiet. Were they planning on murdering Anna? Was that why the bleach and other stuff was on the pool table? He had purchased that stuff days before so there must have been some kind of plan to harm her, but if so what was their motive?\n\n3. Here’s the biggest hole for me. How did the mother know that cancelling their hotel reservation would make both Anna and Richard go to the lake house and how did she know lexi would be there? How did she know it would lead to an altercation in which the cops would come, search the house and find the planted evidence? That seems like a big reach. Seems like a lot of ifs, conditions and leaps of faith to make that all happen the way it did. Seems like anna would have been more likely to go to Jack or her mom’s house, after all her and Jack had just recently somewhat reconciled (aka banged in his truck). Maybe if that didn’t work out, if Anna didn’t go to the lake house, she would have tried again another day another way?\n\nTLDR\n\n1. What did Rachel and Helen have on Lexi?\n\n2. Was Lexi and Richard planning to harm Anna and why?\n\n3. How did the mother know the stars would align and the cops would find the planted evidence?\n\nThanks for reading this far and thanks for any insight offered.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1r837hr/his_and_hers_help_me_understand_the_ending/"
    },
    {
        "id": "1r6z9j9",
        "author": "HehroMaraFara",
        "title": "Reality Check: America’s Next Top Model",
        "content": "I was getting upset initially because Tyra and all the other trash people involved with the show were just rose colored glasses-ing the useless and abusive drivel that they were responsible for.\n\nThen came halfway through episode two and finally some receipts came out. Then all you hear is the excuses of “we didn’t know then about rape and SA!”\n\nFuck right off everyone involved with the production, we see who you really are.\n\nEdit: I was disappointed in the ending. Just because the other judges got fired didn’t make them less complicit than Tyra the monster. I couldn’t of cared less about what happened to them and to spend half the episode on that was inane.",
        "upvotes": 230,
        "comments": 87,
        "media": null,
        "permalink": "/r/netflix/comments/1r6z9j9/reality_check_americas_next_top_model/"
    },
    {
        "id": "1r857vu",
        "author": "_Anvero_",
        "title": "The Blaclist",
        "content": "Hello there! Living in Ukraine and I want to know why there only 5 seasons of Blacklist available. And The Rookie only 4 seasons. Why I can't have all of them? Is there good reason or it's so I would buy subscription on another service to watch other seasons?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1r857vu/the_blaclist/"
    },
    {
        "id": "1r7304f",
        "author": "Empty-Relative3036",
        "title": "error code tvq-pb-101 (8.1)",
        "content": "anyone have any idea what this is?\n\nI'm assuming its a hardware issue, specifically xbox. no streaming apps are working on the series x and whatever the last Gen is called. internet is fine on other devices and netflix is working. no idea what this error is. obviously powered off and on, reset everything, reinstalled app. \n\nconfused. Tia. \n\nIts (5.6.1) error code. Not sure why it uploaded that. ",
        "upvotes": 56,
        "comments": 116,
        "media": null,
        "permalink": "/r/netflix/comments/1r7304f/error_code_tvqpb101_81/"
    },
    {
        "id": "1r80sfz",
        "author": "fraction00",
        "title": "Can anyone recommend me good Scottish and Irish crime thrillers on Netflix?",
        "content": "I have been really digging in and enjoying Scottish and Irish crime thriller lately. I have watched Dept Q.\n\nI am just obsessed with Scottish accent. I am thinking of leanring it.\n\nCan anyone recommmed me any Scottish and Irish crime thrillers on Netflix?\n\nThanks in Advance mate!",
        "upvotes": 0,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1r80sfz/can_anyone_recommend_me_good_scottish_and_irish/"
    },
    {
        "id": "1r7sqm7",
        "author": "luv_kamui",
        "title": "Do anyone remember this show?",
        "content": "It was an animated series about a girl (adolescent) with dark hair (blue if I remember correctly) that had a little brother (not very important to the storyline, although I remember he annoyed her sometimes). her mom and dad appeared in some episodes, and she had friends, I remember one that had brown hair and I think she liked him but, it was like just blushing when she saw him (I liked this character, so maybe I'm comfusing it). The series was episodical and it was just about the girl, nothing too fantastic. It was not anime, it was a 2d series and it was on netflix between 2012-2018 at least on Chile.\nI remember the ending being in portuguese, but I haven't find any series in portuguese that fit the series. Plz help, I want to be able to sleep, but I have to find this series.\n(No, is no Luna's world)\nThanks!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1r7sqm7/do_anyone_remember_this_show/"
    },
    {
        "id": "1r82s94",
        "author": "ComfortableCare8897",
        "title": "I feel like in the future netflix might mainly focus on kids movies/shows and non fiction movies/shows and foreign movies/shows in the future.",
        "content": "Just like PBS did. I also found it odd that most of PBS's scripted shows or movies for grown ups were not american. With Netflix having Sesame Street it will help Netflix make more kids shows.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1r82s94/i_feel_like_in_the_future_netflix_might_mainly/"
    },
    {
        "id": "1r824x5",
        "author": "alpha050518",
        "title": "I can't watch netflix",
        "content": "I can't watch Netflix.\nToday I tried to connect my TV to Netflix to watch Hunter x Hunter (it had been months since I last watched it), but when I connected, it said I couldn't watch because my TV COULD NOT HANDLE ADS DURING USE. Which is funny, because I've been watching YouTube on it for years and it always played ads, BUT NO, THE PROBLEM WAS MY TV AND NOT THIS SHITTY STREAMING SERVICE THAT PUTS ADS ON A PAID SERVICE.\nI have no choice. Thanks Netflix, you led me to the good side of the force, I'll never use your service again.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1r824x5/i_cant_watch_netflix/"
    },
    {
        "id": "1r68bvn",
        "author": "MintySea92",
        "title": "Reality Check: Americas Next Top Model",
        "content": "Tyra, the judges and all the producers on that show were just pure evil towards those girls. They filmed and aired a crime, put many through unnecessary surgeries as well as mentally and physically humiliating them. To then have the gall to justify it all by saying they didnt realise they were hurting them at the time and that they were helping them!!\n\nThe documentary was a hard watch and I hope all the women involved have been able to find some happiness after the trauma they were put through.",
        "upvotes": 1354,
        "comments": 956,
        "media": null,
        "permalink": "/r/netflix/comments/1r68bvn/reality_check_americas_next_top_model/"
    },
    {
        "id": "1r7s2v7",
        "author": "jkjeepguy84",
        "title": "Star search finale who did you vote for? Out of the 3 of us in the house everyone had TJ last.",
        "content": "After the finale we were shocked at the winner.  Each of us picked someone different but we all agreed that TJ was our least likely to win.  Out of the two magicians we had Harry being the sure pick and Duo was incredibly talented and Spud sounded great.  Don’t know we are shocked.  The announcing of the winners where Duo thought they won was wild… ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1r7s2v7/star_search_finale_who_did_you_vote_for_out_of/"
    },
    {
        "id": "1r6sn18",
        "author": "Tikitanya6667",
        "title": "Reality Check: Americas next top model",
        "content": "So it’s bad enough that nobody had Keenyah’s back when she was made to feel uncomfortable by a male model BUT for Nigel to say during his interview it’s a reality of that world to deal with harassment (maybe it wouldn’t be if people stood up for other people in those situations) “you as an individual should be able to stand up for yourself and say this isn’t working and figure it out and get the job done there’s people and cameras everywhere.” UM she did try to stand up and she was dismissed. He was harassing her and making her uncomfortable in front of all those “people and cameras” and nobody did a damn thing and she was scolded for speaking up. Like all these years later and after seeing the entire situation that happened between them and he still can’t say we messed up on how we handled that situation we should have protected her? It’s still she should have been able to get the job done regardless of how someone was making her feel… She “needed to be professional” when that man was being a creep &amp; in reality the creep was the one not being professional and should have been scolded not her. “Just take it and shut up”. Smh disgusting.",
        "upvotes": 112,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1r6sn18/reality_check_americas_next_top_model/"
    },
    {
        "id": "1r7kyye",
        "author": "SuzQP",
        "title": "Audio loss after pausing",
        "content": "Every time I pause a show on Netflix, the audio cuts out upon resuming the show. Initially, a brief rewind would correct the issue, but that no longer works. Now I have to exit Netflix completely-- and even that doesn't always work. I've taken to exiting the app every time I want to pause, which is a pita. Anybody know of a workaround for this?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1r7kyye/audio_loss_after_pausing/"
    },
    {
        "id": "1r7zog0",
        "author": "jerkoff1610",
        "title": "Jay Manuel finally shares where he and Tyra Banks stand now after America's Next Top Model split",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1r7zog0/jay_manuel_finally_shares_where_he_and_tyra_banks/"
    },
    {
        "id": "1r7ulr1",
        "author": "Twelve2375",
        "title": "Zero Day Questions",
        "content": "I’m late. I just finished this, not very good product.\n\nI looked around and there are 2 problems I have that I haven’t seen addressed, though I have given up digging pretty quickly. Spoilers ahead.\n\n1. the commission techs work on an anti-virus patch and then push it out through automatic updates. How? If everything is down including power and comms, how are they pushing out these auto updates? The App Store servers would be down. The cell towers to push the updates would be down. How exactly did they get these updates pushed?\n2. In the second episode, Angela Basset gives DeNiro like 48 hours to figure this out. She is seconds from going on air to tell the world she’s giving the go on a counter to Russia. By the last episode, she’s saying how she suspected there were high level players in the government who were behind it but couldn’t give DeNiro a heads up in there first meeting. So this awful woman was just going to knowing lead the world to ruin for no reason? Or the writers couldn’t keep continuity for 5 episodes?\n\nThat is all. I thought it was fine, not amazing, through the first 4.5-5 episodes. But that last episode was next level stupid.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1r7ulr1/zero_day_questions/"
    },
    {
        "id": "1r7o28d",
        "author": "Ill-Promise-7597",
        "title": "Using Netflix to help learn languages",
        "content": "Okay, is it possible to restrict what languages family members can select for audio and for subtitltes? So I want my family to watch movie etc. in English, because it will help them learn. But I dont think Netflix gives that option? But it really should.",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1r7o28d/using_netflix_to_help_learn_languages/"
    },
    {
        "id": "1r6exe2",
        "author": "Einsteinssister",
        "title": "Reality Check: Americas Next Top Model severe abuse!",
        "content": "Shandi being raped while completely blacked out, no stopping it, AND then supposedly filming it is absolutely insane. Filming her break up after being raped was so tacky. Why in the world did they even put that into the story line? Shandi faced significant backlash and bullying online. \n\nAlso hearing that they filmed while a girl was showering with another guy was said to be prohibited? Sounds like a bunch of creeps to me.",
        "upvotes": 317,
        "comments": 87,
        "media": null,
        "permalink": "/r/netflix/comments/1r6exe2/reality_check_americas_next_top_model_severe_abuse/"
    }
]