[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 488,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1hxziv7",
        "author": "tatarigoroshi",
        "title": "Netflix says I'm not part of the household when I'm inside my house",
        "content": "How do they decide what is and isn't part of the household?? No, I am not travelling. Don't give me a code to log in for a limited time period .... how can I fix this? \n\nWhen I google this issue I only find netflix's page saying if my device is not associated with the household, I need to create my own plan. But I live with my family in my parent's house who are paying for netflix. No one else has this problem, all TVs, laptops, ipads work for them. This is really frustrating. ",
        "upvotes": 75,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1hxziv7/netflix_says_im_not_part_of_the_household_when_im/"
    },
    {
        "id": "1hxi1ti",
        "author": "Aaditya203",
        "title": "Squid Games: Unleashed Is Now Netflix's 5th Most Downloaded Game After 10M Installs\n",
        "content": "",
        "upvotes": 307,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1hxi1ti/squid_games_unleashed_is_now_netflixs_5th_most/"
    },
    {
        "id": "1hxowvj",
        "author": "HehroMaraFara",
        "title": "American Primeval",
        "content": "Netflix makes and releases a lot of garbage and I freely shit all over it whenever possible. \n\nThat being said, this series is fucking metal. One, I had the most intense desire to redownload Red Dead 2 within the first 15 minutes and two, when they don’t pull punches on just how brutal even the Mormons were back then, I was all in. \n\nIve seen some people complain about it being too much, but these are probably the same people that want to burn books and pretend the real history of the United States never happened. \n\nThis series is awesome. ",
        "upvotes": 103,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1hxowvj/american_primeval/"
    },
    {
        "id": "1hxrrme",
        "author": "HandsomeStarLord",
        "title": "Bring this back on Netflix I would love this shows to be on Netflix uk again they were so funny and brought so light ",
        "content": "",
        "upvotes": 68,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1hxrrme/bring_this_back_on_netflix_i_would_love_this/"
    },
    {
        "id": "1hxg8za",
        "author": "NamikazeKage",
        "title": "American Primeval on Netflix is damn good",
        "content": "It is frankly surprising that I found out the show existed randomly yesterday night when I came upon the IMDB most anticipated shows of 2025 and then by 3am the entire show released on Netflix. I wanted to watch one episode a day to pace myself but i just caved and binged the whole show, and it is the BEST western I've seen in YEARS. Highly recommend.",
        "upvotes": 147,
        "comments": 82,
        "media": null,
        "permalink": "/r/netflix/comments/1hxg8za/american_primeval_on_netflix_is_damn_good/"
    },
    {
        "id": "1hy5815",
        "author": "Wide_Sympathy_1064",
        "title": "Squid game account ",
        "content": "When squid game unleashed first came out I created an account on the spot for some reason even though I have an account that I am paying for. I am level 63 and I have a level 9 player 101 so I don't want to reset everything. What can I do",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hy5815/squid_game_account/"
    },
    {
        "id": "1hy8nbr",
        "author": "PeaDue9435",
        "title": "Is WWE available on Netflix India? ",
        "content": "I'm currently exploring streaming services to subscribe to, and Netflix seems like a promising option. My primary interest lies in watching WWE, as I’ve been a fan of professional wrestling for years. However, before committing to Netflix, I want to ensure that their content library includes WWE programs in India.\n\nI know WWE has various shows, including Monday Night Raw, SmackDown, and pay-per-view events like WrestleMania. These events are central to keeping up with storylines, rivalries, and the thrill of wrestling entertainment.\n\nI’ve heard some countries have WWE-related content on Netflix, but availability can vary based on location. Considering that WWE has its dedicated streaming service, I’m curious if Netflix in India offers any WWE shows, documentaries, or classic matches.\n\nIf Netflix doesn’t provide WWE content, I’ll need to consider alternatives, such as the WWE Network or other platforms, to catch all the action. Could you confirm whether Netflix has WWE in India?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hy8nbr/is_wwe_available_on_netflix_india/"
    },
    {
        "id": "1hxzinj",
        "author": "Robemilak",
        "title": "Netflix will officially adapt Anna Huang’s bestselling series ‘TWISTED LOVE’ into a TV series. ",
        "content": "Follows the lives of four best friends &amp; their brooding love interests, riddled with dark secrets from their pasts, as they overcome the obstacles keeping them apart to fall in love.  \n",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hxzinj/netflix_will_officially_adapt_anna_huangs/"
    },
    {
        "id": "1hxt9lz",
        "author": "AVP0728",
        "title": "Recommendations for binge worthy edge of your seat show? ",
        "content": "Looking for shows that keep us on the edge of our seat and wanting more and more/has us grow impatient for the next episode. My wife and I are always waiting to get off work to have our nightly ritual to watch and snack!\n\nEdit: any other shows that are not horror?",
        "upvotes": 14,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1hxt9lz/recommendations_for_binge_worthy_edge_of_your/"
    },
    {
        "id": "1hxvx6m",
        "author": "mivicab",
        "title": "Looking for tv shows to watch with the family",
        "content": "Hi so I’m wanting to watch a tv show with my family but we are a bit specific. A thriller would be preferred, something that keeps you on your toes but anything that’s not “kid-y” is fine. My family is not cool with sex and nudity so I need something without that. Language and violence is fine as long as it’s not excessive and too graphic. \n\nSome shows we watched were squid games and stranger things which they enjoyed. \n\nPlease help me out cause I’m running out of stuff to show them 😭😭",
        "upvotes": 10,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1hxvx6m/looking_for_tv_shows_to_watch_with_the_family/"
    },
    {
        "id": "1hxwc3a",
        "author": "dj-emme",
        "title": "America Primordial",
        "content": "This show is well-researched. History, especially the white expansion into the west, is my academic obsession. It's almost too much for me to handle though - god we were such animals. \n\nAnyone else watching this? What the EFF was wrong with those French people they encountered around 25:00 in episode one? I thought the show was gonna take a horror turn there for a second. ",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hxwc3a/america_primordial/"
    },
    {
        "id": "1hy17v7",
        "author": "Only_Ice_2600",
        "title": "Shows disappeared ",
        "content": "Hi all I was on Netflix the other day watching shameless and pinky blinders and for some reason they disappeared and for curiosity I looked up The Walking Dead and in sure more. It is also gone. The only thing that I can think of that had changed was I created a password for my account roughly a few months prior and for some reason, the password went away without me getting rid of it and I guess it flew over my head. I didn’t really notice. Until it randomly came back so I put the password in and now the shows are gone. Any ideas? \nAlso I have no restrictions on movies.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hy17v7/shows_disappeared/"
    },
    {
        "id": "1hy4bk7",
        "author": "Muffin__Puffin",
        "title": "netflix hold to speed feature?",
        "content": "why doesnt netflix have hold to speed up feature? just like in tiktok or youtube it makes watching on a phone much easier especially with impatient people like me.",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1hy4bk7/netflix_hold_to_speed_feature/"
    },
    {
        "id": "1hy80xf",
        "author": "format_drive",
        "title": "Unlocked a jail experiment. Were there other prisoners in other units doing the same experiment?",
        "content": "There is a line the warden says in episode 6 (12:48).\n\n\"In comparison to the other units, they're actually doing pretty good.\"\n\nContinuing to say I'm going to give them a second chance.\n\nI thought they said the experiment was only performed on their unit.\n\nDid anyone else notice this comment.\n\nWhat are your thoughts?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hy80xf/unlocked_a_jail_experiment_were_there_other/"
    },
    {
        "id": "1hy3884",
        "author": "themanwiththegoal",
        "title": "Playback Speed changes audio",
        "content": "as stated above. when i change the playback speed on the netflix app on my windows 11 pc, it also changes the audio, to be higher pitched and just strange in general. I watch most things at a higher speed, and no other video stream app does this. Is this intentional, is this how its suppose to be?\n\nAny help in fixing this would be great, cause its making me just not use netflix\n\n(Edit: added example, obviously the video doesnt show, but the audio is the problem\n\nhttps://reddit.com/link/1hy3884/video/a42zb3cbu5ce1/player\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hy3884/playback_speed_changes_audio/"
    },
    {
        "id": "1hy34f0",
        "author": "SanrioAndMe",
        "title": "I would like some suggestions for smutless/spice free/fluffy romance/romcom shows please. ",
        "content": "Kissing is fine. I just don't want to watch the main characters doing the devil's dirty tango. \n\n\nThank you. 😊 Hope you have a good day. 💜",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hy34f0/i_would_like_some_suggestions_for_smutlessspice/"
    },
    {
        "id": "1hy1pys",
        "author": "Cjale-sama",
        "title": "Mobile video player controls won't disappear when I press the screen",
        "content": "I just redownloaded Netflix and when I play a show, the title on the top, the video player controls like prev ep or next ep won't go away when I press the screen like it used to do and I need to wait like 10 seconds just for it to disappear naturally. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hy1pys/mobile_video_player_controls_wont_disappear_when/"
    },
    {
        "id": "1hxs45y",
        "author": "Outragedwaffle",
        "title": "Strangest scam/hack?!",
        "content": "So I tried to open Netflix tonight, upon opening it had signed me out, when I tried to sign in it I got told my password was incorrect, I clicked reset password.\n\nWhen I opened my email I noticed that on 06/01/2025 I had 3 emails, someone had already reset my password, changed my email address and then changed the payment details and upped the plan to the £17.99 plan.\n\nSo I fairly understand that someone could want to gain access to your account and use your payment details to get some free Netflix.\n\nBut what I do not understand and can not understand is why they changed the payment details? That physically doesn’t make sense to me.\n\nAny ideas?",
        "upvotes": 5,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1hxs45y/strangest_scamhack/"
    },
    {
        "id": "1hxguia",
        "author": "goldingot_",
        "title": "Any suggestions for 2000s shows?",
        "content": "I watched dexter recently and got hit with nostalgia with how shows were made and written during those years like hawaii five-o but dexters premise was more interesring and less rinse and repeat. any show recs?",
        "upvotes": 20,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1hxguia/any_suggestions_for_2000s_shows/"
    },
    {
        "id": "1hy2m8y",
        "author": "Striker919",
        "title": "Why the same show is using HEVC codec on my LG Nano90 tv, but AV1 on my LG Oled C1? Netflix App, i can see this with the streaming info menu",
        "content": "Why the same show is using HEVC codec on my LG Nano90 tv, but AV1 on my LG Oled C1? Netflix App, i can see this with the streaming info menu\n\n\nNetflix Netflix Netflix Netflix Netflix Netflix Netflix Netflix\nNetflix Netflix Netflix Netflix Netflix Netflix Netflix Netflix Netflix Netflix Netflix Netflix Netflix Netflix",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hy2m8y/why_the_same_show_is_using_hevc_codec_on_my_lg/"
    },
    {
        "id": "1hxvhru",
        "author": "Frensisca-",
        "title": "Take Care of Maya (2024)[1:43]",
        "content": "What are your thoughts on the Take Care of Maya Documentary on Netflix.\n\nA nightmare unfolds for Jack and Beata Kowalski after they bring their 10-year-old daughter to the ER with unusual symptoms.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hxvhru/take_care_of_maya_2024143/"
    },
    {
        "id": "1hxyt5n",
        "author": "OneOfThoseDays_07",
        "title": "Shows not available while in WiFi but available while on mobile data",
        "content": "I came across some strange Netflix behaviour. I watch Netflix on my phone. When I use my WiFi at home, certain shows (like friends) are not at available. It tells me that is not available in your area. But when I switch off the wifi and use mobile data, all the shows are available. I googled if the shows got removed in my area but couldn’t find anything. Anyone any idea what’s going on? Is it Netflix or my wifi provider?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hxyt5n/shows_not_available_while_in_wifi_but_available/"
    },
    {
        "id": "1hxschi",
        "author": "Ornery_Disaster_953",
        "title": "Netflix Android App Brightness Slider",
        "content": "When is Netflix going to fix the awful brightness slider. Why even have a slider like that, nobody needs it. Many people know it exists, but it causes so many problems. I cannot reach the lowest brightness and neither the highest. It deactivates automatic brightness, which makes me get flashed trying to watch in a dark room, after watching somewhere in the sun...  Some people are also having the problem of it disabling the blue light filter...",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hxschi/netflix_android_app_brightness_slider/"
    },
    {
        "id": "1hxpuf9",
        "author": "speed_ganggg",
        "title": "Why can't I watch some shows and movies on my profile that I can watch on a family members profile on the same account????",
        "content": "Title. I search up the show, for example Arcane, and it doesnt show up on my profile. However when I switch to a family members profile I can watch it. What is the reason. Also when I search the show up on google and then netflix and click the link while my profile is active it comes up but it says \"remind me\" with a bell next to it. ",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hxpuf9/why_cant_i_watch_some_shows_and_movies_on_my/"
    },
    {
        "id": "1hy7up0",
        "author": "No-Bluebird-8953",
        "title": "Is this too much screen time",
        "content": "",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hy7up0/is_this_too_much_screen_time/"
    },
    {
        "id": "1hxqqoh",
        "author": "cooly0urjets",
        "title": "Can I change the Netflix home screen on my laptop?",
        "content": "Sorry in advance if this has been asked before.  \n\nFor the last several weeks, my Home Screen has been showing the Netflix game “Underwater-Melon” at the top of the page.  I no longer see new arrivals. It’s just been this stupid looking watermelon cartoon and annoying childish sounding music. It has begun to annoy me greatly. \nI don’t have this problem on my phone or my TV. It’s just on my laptop, which is my main way of watching. I am currently using a cheap, crappy Chromebook if that makes any difference.  Does anyone know if there is a way to change this, or at least have it cycle and show different videos so it’s not the same thing every time I sign on?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hxqqoh/can_i_change_the_netflix_home_screen_on_my_laptop/"
    },
    {
        "id": "1hxok4r",
        "author": "Impossible_Wafer_311",
        "title": "Netflix Preview Club ",
        "content": "Hello! ☺️\n\nNot sure who/ where to ask, please remove if inappropriate!\n\nI'm part of the Netflix Preview Club and have been able to watch a preview, but haven't received a survey email to fill in! I don't know who to contact, Netflix general customer service doesn't seem to know a lot about the club.... \n\n\nThank you in advance ✨\n\n",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hxok4r/netflix_preview_club/"
    },
    {
        "id": "1hxcxwt",
        "author": "Atlast_2091",
        "title": "Sakamoto Days | Final Trailer | Netflix",
        "content": "",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hxcxwt/sakamoto_days_final_trailer_netflix/"
    },
    {
        "id": "1hwn7w1",
        "author": "S4v1r1enCh0r4k",
        "title": " New Jerry Springer docuseries discovers some shocking stuff about the show, some of which we could already assume, apparently the producers went as far as to blackmail poor guests if they thought about not showing up for the final show panel ",
        "content": "",
        "upvotes": 374,
        "comments": 75,
        "media": null,
        "permalink": "/r/netflix/comments/1hwn7w1/new_jerry_springer_docuseries_discovers_some/"
    },
    {
        "id": "1hxqywl",
        "author": "mkaszycki81",
        "title": "Is there a way to force Netflix app to send UHD-4K (3840 px horizontal) instead of DCI-4K (4096 px horizontal) to LG TV?",
        "content": "Hi!\n\nMy TV is an ordinary LG B8 4K OLED with 3840×2160 resolution (16:9). A lot of content on Netflix is properly recorded in 16:9 aspect ratio UHD (3840×2160) and the picture fills the screen.\n\nHowever, theatrical movies are a different matter. They're recorded in DCI-4K (4096×2160 resolution, \\~17:9 aspect ratio) with an extra 256 horizontal pixels. Movie theaters make use of the entire resolution, there are home projectors and some exotic TVs that can display 4096 horizontal pixels, but my TV can't.\n\nHowever, I can't force the TV to just discard the 256 pixels, and instead it rescales the video to the 3840 horizontal pixels, displaying it in a very slight letterbox. The slight rescale also means a bit of blurriness which basically makes the displayed picture not much better than full HD resolution. Not that it matters much with typical viewing distances, but Dolby Vision isn't available with full HD video and I'm not sure about Dolby Atmos, I always had the UHD package, never tried the lower tiers.\n\nAt the very least, it wastes 6.25% of bandwidth and causes the TV to get warm due to having to rescale the movie.\n\nAnother missed opportunity is that the smart TV app is not smart enough to just align the top of the picture with the top of the screen and use the extra 135 pixels on the bottom for subtitles so they cover less of the movie, but it can't.\n\nIn short, I'd like Netflix to just send a UHD (3840×2160) stream to my TV. It can be pan/scan to show the important bits if the director was so inclined as to use the entire frame to put something important on it, but I'd be fine with just a crude center crop, it's not like trying to fit as much as possible from a 2.35:1 CinemaScope content on a 4:3 CRT TV thirty years ago.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hxqywl/is_there_a_way_to_force_netflix_app_to_send_uhd4k/"
    }
]