[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 482,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1gsenwg",
        "author": "AutoModerator",
        "title": "JAKE PAUL v. MIKE TYSON Fight Megathread",
        "content": "&amp;#x200B;\n\nhttps://preview.redd.it/w8ywthvqp61e1.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=95e740ea33c09fcd4e8c898ea8b46958cd88635d",
        "upvotes": 113,
        "comments": 5781,
        "media": null,
        "permalink": "/r/netflix/comments/1gsenwg/jake_paul_v_mike_tyson_fight_megathread/"
    },
    {
        "id": "1gybd2g",
        "author": "ChirrBirry",
        "title": "Arcane is EXCEPTIONAL ",
        "content": "I don’t just want more seasons of Arcane…I *need* it. This show fills a content gap I didn’t know could be satisfied. \n\nNormally I hate character development and over the top attempts to connect the viewer with characters, but Arcane makes the endeavor a pleasure. The animation style fills me with joy, it’s like when the first season of Avatar: The Last Airbender came out and we all had our jaws drop to the floor.\n\nI’ve never played a single second of LoL but now I’m fully immersed in a world that I’m pissed might come to an end as I finish the last episode of season 2. More please.",
        "upvotes": 22,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1gybd2g/arcane_is_exceptional/"
    },
    {
        "id": "1gy338w",
        "author": "Fishersalt",
        "title": "Any way to save frames?",
        "content": "Maybe a stupid question, but there’s a specific scene in the series Arcane that I desperately want as my wallpaper on my phone and PC, but I have no idea how to save said frame. I obviously can’t screenshot it, so how do I go about it? I’ve tried searching for the frame online but to no avail. ",
        "upvotes": 10,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1gy338w/any_way_to_save_frames/"
    },
    {
        "id": "1gxwsqf",
        "author": "Automatic-Attorney96",
        "title": "Movies and tv shows I love because of how bad they are ",
        "content": "",
        "upvotes": 14,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1gxwsqf/movies_and_tv_shows_i_love_because_of_how_bad/"
    },
    {
        "id": "1gy643m",
        "author": "BestWidowTaiwan",
        "title": "Have not been able to change my password for 3 days now",
        "content": "Is anyone else having an issue with changing their password? I have a habit of changing them every few months for security reasons but i havent been able to change it for the last few days. Netflix just gives the same generic error over and over. ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gy643m/have_not_been_able_to_change_my_password_for_3/"
    },
    {
        "id": "1gy8yxd",
        "author": "Desperate_Carry_8422",
        "title": "Account issue advice ",
        "content": "Hi all, really weird one here. \n\nBusy day done and wanted to relax and Netflix. I then find that I've been signed out, password is wrong so I reset. \n\nI log back in and it says continue sign-up. \n\nBut...\n\nI've had an account for years, never missed a payment, last Payment left my account 7 days ago as usual. \n\nBut I follow the prompts and it's asking for payment again. \n\nI've had a really bad day today and this is a frustrating mess. \n\nThanks all.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gy8yxd/account_issue_advice/"
    },
    {
        "id": "1gydnxj",
        "author": "GreattFriend",
        "title": "How to stop automatically skipping the opening when I click \"next episode\"",
        "content": "I'm watching the new season of Pokemon Horizons. I don't remember this being a problem when I watched the last new episodes a few months ago. But when the credits roll and it says \"next episode\" and i click it, it skips the opening of the next episode. I love anime openings and never skip them, and i'm wondering how to get it to stop doing that? I checked the settings on my computer and it doesn't look like there's a setting for it. I have autoplay the next episode turned off, so i don't know if maybe I turn it on it'll autoplay the next episode from the actual beginning as a temporary fix? But i'd rather fix the actual problem i'm having with my current settings intact.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gydnxj/how_to_stop_automatically_skipping_the_opening/"
    },
    {
        "id": "1gycp7h",
        "author": "Overall-Word4952",
        "title": "Does anyone know why i have access to shows on netflix that others in my country do not?",
        "content": "For example Dan Da Dan, i wanted a friend of mine to watch it, i saw him search for it on his phone and not appearing, it wasn’t available. This is taking place in Norway, I don’t use a VPN or anything. The only difference is that my phone (and thus my Netflix) was set on Norwegian while his was on Norwegian. Does Netflix hide shows if they don’t have a “your” language in either dub or sub? (My best theory)",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1gycp7h/does_anyone_know_why_i_have_access_to_shows_on/"
    },
    {
        "id": "1gycilu",
        "author": "Resident-Walrus-66",
        "title": "Netflix defaults to dub...",
        "content": "How do I set original audio with subtitles to be automatic on netflix? Whenever I have set a show to be in original audio with english subtitles in the past, it always automatically had the subsequent episodes of the show with the same setting. I never had to change it, and other shows would even have the same setting. I have rarely had to touch the language settings after that. \nRecently, I began watching a new show and found that it would be dubbed automatically no matter how many times I change it. The next episode plays and it's back to dub. Is there something that I can do to ensure that the sub will be the default option on every show? I watch all shows in all languages with subtitles as I have trouble understanding just audio, even in languages that I speak, and it's quite annoying if this is something I'm going to have to constantly do for every episode. Any tips or if anyone knows if this is a new thing netflix does? Thanks!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gycilu/netflix_defaults_to_dub/"
    },
    {
        "id": "1gy9z8l",
        "author": "PericardiumGold",
        "title": "Why the single or 3 episode releases? I miss when they would release a whole season so I could binge. Also years between seasons leaves me forgetting shows and what occurred.. ",
        "content": "Genuinely curious is it from a marketing standpoint or sales, to do these slow releases? Keeping people subscribed for longer if they are only present to view the show then cancel? \n\nI get that’s how it’s being done now (Amazon as well) ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1gy9z8l/why_the_single_or_3_episode_releases_i_miss_when/"
    },
    {
        "id": "1gxp54w",
        "author": "Russkafin",
        "title": "Ad-supported tier also limits content",
        "content": "We recently downgraded to the ad-supported tier to save money. I understood that this meant I would have ads and could only stream on one device at a time. What I didn’t realize is that some content would now be locked. \n\nMy kids went to watch Captain Underpants Hack-O-Ween and Boss Baby Back In The Crib, only to find they were locked with a message saying they are not available on the ad-supported plan due to licensing issues. I feel like they were not transparent about this when changing plans. \n\nI went on the Netflix customer service chat to complain about this. The response I got was, “I suggest you to please upgrade the plan.”\n\nIf it wasn’t for my kids I would absolutely cancel Netflix. ",
        "upvotes": 31,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1gxp54w/adsupported_tier_also_limits_content/"
    },
    {
        "id": "1gy8p29",
        "author": "Beneficial-Lake2756",
        "title": "Add Netflix accounts",
        "content": "My two siblings who live at home are paying for their Netflix together. They have the version with ads which is like $7?\n\nI asked my brother if I could pay them some money and watch a tv show on the tv when I come home for winter break. He said I'd have to pay $7 and probably more to add a profile? Does it cost money to add a profile? Then I said I could just use one of theirs and he said I couldn't watch it when they're watching it then and I was kinda like ok? Bc I doubt all three of us will watch Netflix at the same time. So idk... help? What would be the best and most cost effective way to share Netflix with two siblings?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gy8p29/add_netflix_accounts/"
    },
    {
        "id": "1gxrtec",
        "author": "HypnoToadVictim",
        "title": "Pantheon is a great!",
        "content": "It’s like a William Gibson novel set in the contemporary if not slight future. Just binged the season. The animation is neither bad nor nothing to write home about. The main draw is for sure the plot. Would give it a strong 8.5/10\n\nIf you liked ghost in the shell, ergo proxy, irobot, akira, cyberpunk edge runners, scavengers reign, there’s probably aspects of this show you’ll enjoy. ",
        "upvotes": 9,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gxrtec/pantheon_is_a_great/"
    },
    {
        "id": "1gxsuqr",
        "author": "Fit_Conversation_151",
        "title": "Midnight gospel",
        "content": "I hate to be corny as fuck but this is one of my favorite cartoons that has ever existed. I rewatch it every year or so. This cartoon is so well thought out. Its so deep. Its so good. Its made me cry. Its made me laugh. The creators need to kiss themselves to sleep. \n\nJesus is right here dont be afraid.\n\nEpisode two always reminds me to chill the fuck out.\n\nGod this show is so deep it makes me ill. ",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gxsuqr/midnight_gospel/"
    },
    {
        "id": "1gxzcta",
        "author": "Schwimp",
        "title": "The Helicopter Heist is streaming now! Being a 15year old at the time, this was the coolest thing to ever happen in Sweden. It's not a documentary, but it shows what went down accurately. ",
        "content": "",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1gxzcta/the_helicopter_heist_is_streaming_now_being_a/"
    },
    {
        "id": "1gxt49e",
        "author": "FamBamJam78",
        "title": "Empress Season 2",
        "content": "Am I missing something? This feels like a different show to me. Maybe it’s English dub? It’s not the way anyone looks….bit the writing and maybe even acting?  Curious if I’m alone here. ",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gxt49e/empress_season_2/"
    },
    {
        "id": "1gy1auv",
        "author": "RevolutionaryLion384",
        "title": "Recommend me some spanish language shows or movies that are about narcos/criminals.",
        "content": "I have already seen Narcos and narcos Mexico, Somos, Chapo, the inmate and enjoyed them all very much. Are there any other shows like these on netflix or even another streaming platform that are just as good? I just want the show to be predominantly in spanish because I am trying to learn",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1gy1auv/recommend_me_some_spanish_language_shows_or/"
    },
    {
        "id": "1gy02hz",
        "author": "MalpighialesLeaf",
        "title": "Annoying navigation whoosh",
        "content": "Netflix seem to have added a feature where every time you tab between shows, it makes a 'whoosh' sound.\n\nIs there a way to turn this off before I throw my TV out the window?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gy02hz/annoying_navigation_whoosh/"
    },
    {
        "id": "1gya5yq",
        "author": "progtfn_",
        "title": "Chestnut man ending SUCKED",
        "content": "Kastenjenmanden was not bad at all until I got to the last episode, the plot armor was crazy and unrealistic.\\\nRosa and the other guy were in the basement **drenched** in gasoline and were still able to survive, the fire spread soooo slow, one of them should have died there.\\\nAnother scene that didn't make sense was Thulin making the car crash, why didn't the murderer just shot her after she ALREADY tried to choke him.\nKristin, however, had biggest plot armor. Why on earth would him and Astrid keep her alive for that long? Why would Astrid say she was dead already? \nThe episode looked like a sad attempt at a good ending, that doesn't fit one bit the context of the situation, bad endings are \"good\" too.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gya5yq/chestnut_man_ending_sucked/"
    },
    {
        "id": "1gxzj9c",
        "author": "Military_collectorx",
        "title": "Help ",
        "content": "I remember watching this show in like the mid 2010’s on Netflix it’s been taken down a while ago and all I can remember is the into. Which started with these 2 guys one dressed something like a Viking and the other that looked like a scientist or wizard and they were following this clock on a conveyer belt and tinkering with other stuff along the way, I also remember they lived in a brick castle like building ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gxzj9c/help/"
    },
    {
        "id": "1gxdpkp",
        "author": "indiewire",
        "title": "Everything Coming to Netflix in December 2024",
        "content": "",
        "upvotes": 31,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1gxdpkp/everything_coming_to_netflix_in_december_2024/"
    },
    {
        "id": "1gxim2c",
        "author": "rdv100",
        "title": "The blue eyed Samurai is fantastic, kind of like lord of the rings, check it out! #bingewothy",
        "content": "I came across it because Netflix mentioned it as one of the most popular TV series. I started watching and couldn’t stop.  \nIt’s a truly wonderful story with excellent direction and fantastic character development. The plot revolves around a person seeking revenge for her mother’s murder.\n\n  \nIt kind of reminds me of *The Lord of the Rings* in the sense that the entire story focuses on someone on a journey to defeat the villain.\n\n  \nAnyway, definitely check it out!\n\n\n\n[https://www.netflix.com/title/81144203](https://www.netflix.com/title/81144203)  \n\n\n",
        "upvotes": 17,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1gxim2c/the_blue_eyed_samurai_is_fantastic_kind_of_like/"
    },
    {
        "id": "1gxkn6x",
        "author": "Puzzleheaded-Ad-379",
        "title": "Recommendations for snowy cozy movies like the Three Pines",
        "content": "Hello! I'm looking for your recommendations for shows or movies in snowy beautiful settings (that are currently on Netflix) but please please please NOT Christmas romances. ",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gxkn6x/recommendations_for_snowy_cozy_movies_like_the/"
    },
    {
        "id": "1gy44ee",
        "author": "Automatic-Attorney96",
        "title": "Riverdale insanity ",
        "content": "\nThey all gained superpowers but in order to defeat a comet, Cheryl had to kiss everyone to absorb their powers, in order to defeat the comet. And then they got teleported into another dimension in the 1950s where everyone's memory has been wiped except for Jughead, and then he has to get them back to their dimension. \n\nThere are multiple Jughead’s that exist in the world that are trying to separate the two universes (there are multiple universes and timelines) so Archie kills the other Jughead’s and the original too. Veronica and Cheryl were on Jughead’s side so Archie had to kill them too. In this universe, nobody can die so the people Archie killed will come back to life. Oh btw Veronica and Betty kill Archie by splitting his body in half, and in order to keep Rivervale “pure”(Riverdale is called Rivervale in this timeline) so Cheryl sacrifices Archie by ripping his heart out. Btw jughead is friends with Sabrina the teenage witch and Riverdale is a musical.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1gy44ee/riverdale_insanity/"
    },
    {
        "id": "1gxh4s3",
        "author": "-maanlicht-",
        "title": "Anyone watched 'Spellbound' already? (No spoilers)",
        "content": "Share your thoughts.\nI think it is a very cute movie. Both on the surface but also more deep between the lines it shines a light on (quite heavy) parent-child struggles and how being part of a family requires teamwork. The songs are cute with some great lyrics and I find it is very well done, a fun movie to watch over the weekend as a family.",
        "upvotes": 8,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1gxh4s3/anyone_watched_spellbound_already_no_spoilers/"
    },
    {
        "id": "1gy7b9b",
        "author": "SetSufficient7240",
        "title": "Batman 2022 is being removed tomorrow in my region Greece",
        "content": "Bro it was one the best films I watched I can't download cuz I don't have enough storage I will miss it NETFLIX PLEASE PUT IT BACK,also today is November 23 if ur wondering,netflix deletes the good films and keeps the shit ones.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1gy7b9b/batman_2022_is_being_removed_tomorrow_in_my/"
    },
    {
        "id": "1gxukl4",
        "author": "PistolPeteLara",
        "title": "Rhythm and Flow ",
        "content": "Netflix got really cheaped out on season 2. Production sucked, rappers sucked, overall it just SUCKED. \n\nDon’t make the next season if you’re just trying to cash in. \n\nLame ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gxukl4/rhythm_and_flow/"
    },
    {
        "id": "1gxob70",
        "author": "Sensitive-Anything34",
        "title": "Top 10 Lists (movie &amp; TV) Not Appearing on Browser or Apps (Xbox, phone, etc)",
        "content": "Anyone else not seeing the top 10 lists for Netflix? I checked on my phone, on browser (Firefox), and on the Xbox app, but the lists do not appear for top 10 movies or tv shows. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gxob70/top_10_lists_movie_tv_not_appearing_on_browser_or/"
    },
    {
        "id": "1gxt9xu",
        "author": "pompompuriinn",
        "title": "Netflix extra slot",
        "content": "Help anyone. My fam and I can't watch, whenever we open our app, this here stops us from watching. Extra slot was automatically added and ofc the payment was automatically deducted from my card but when I checked it said that no one's using the extra slot (ofc coz we're only three on the family plan) and this started when I cancelled the extra slot. I can't watch even on the main profile. I don't know what to do, somebody help huhu ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1gxt9xu/netflix_extra_slot/"
    },
    {
        "id": "1gxklfj",
        "author": "Detvan_SK",
        "title": "Future of Netflix app for MS platforms (discusion)",
        "content": "So an update came out that changed the application to an Edge browser window for both Windows and Xbox consoles. And I have also tested that the old version of the application now has a communication block with the server and behaves as if there is no internet.\n\nWhich is quite funny timing because there is more and more talk about ARM processors for PC, x86-64 are getting energy-efficient cores, a new Win Handheld is announced every year, even Xbox announced its own, and overall it seems that Windows core devices will become more and more mobile.\n\nI am seriously interested in whether movie services like Netflix will ignore this.",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gxklfj/future_of_netflix_app_for_ms_platforms_discusion/"
    },
    {
        "id": "1gxgtje",
        "author": "-DreamLight-",
        "title": "Any new (good) scifi/fantasy series that haven't been cancelled yet?",
        "content": "I make it a habit to not watch a series till after a second season is confirmed, had my hopes up for Kaos because it looked great but glad I held off now! Any new series that appear to have a future?",
        "upvotes": 6,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1gxgtje/any_new_good_scififantasy_series_that_havent_been/"
    }
]