[
    {
        "id": "1o36ttf",
        "author": "SmashingMachineAMA",
        "title": "Hey reddit, I'm Benny Safdie. I've co-written/co-directed Uncut Gems, Good Time, and Heaven Knows What. My newest film, The Smashing Machine (starring Dwayne Johnson &amp; Emily Blunt), is out in theaters now. You might've seen me in The Curse, Oppenheimer, and Happy Gilmore 2. Ask me anything!",
        "content": "Hey reddit, I'm Benny Safdie, here to answer your questions. \n\nYou might know me as the co-writer/co-director of Uncut Gems, Good Time, Heaven Knows What, Lenny Cooke, and Daddy Longlegs. Or maybe from The Curse, Oppenheimer, Licorice Pizza, Happy Gilmore 2.\n\nMy new film stars Dwayne Johnson &amp; Emily Blunt and is out in theaters everywhere now.\n\n**The Smashing Machine:**\n\nMMA fighter Mark Kerr reaches the peak of his career but faces personal hardships along the way.\n\n**Trailer:**\n\n[https://www.youtube.com/watch?v=aRpnP3LZ99g](https://www.youtube.com/watch?v=aRpnP3LZ99g)\n\nAsk me anything! Back at 5 PM ET today to answer your questions.",
        "upvotes": 2341,
        "comments": 980,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0ecr77irgbuf1.jpeg?auto=webp&amp;s=d63eba10421b15377a27d15bab4cc9204536d55a"
        },
        "permalink": "/r/movies/comments/1o36ttf/hey_reddit_im_benny_safdie_ive/"
    },
    {
        "id": "1o2yxrf",
        "author": "HarrisDickinsonAMA",
        "title": "Hey /r/movies. I'm Harris Dickinson. You might've seen me in Triangle of Sadness, The Iron Claw, Babygirl, The King's Man, Beach Rats, Blitz, Scrapper, Where the Crawdads Sing, See How They Run, Matthias &amp; Maxime, Maleficent: Mistress of Evil, The Souvenir Part II. Ask me anything :)",
        "content": "Hey r/movies. I'm Harris Dickinson. You might've seen me in Triangle of Sadness, The Iron Claw, Babygirl, The King's Man, Beach Rats, Blitz, Scrapper, Where the Crawdads Sing, See How They Run, Matthias &amp; Maxime, Maleficent: Mistress of Evil, The Souvenir Part II.\n\nAsk me anything :)\n\nMy new film (and directorial debut), URCHIN, stars Frank Dillane &amp; Megan Northam. It premiered in the Un Certain Regard section of Cannes and is out in select theaters starting 10/10.\n\nSynopsis:\n\nA young addict living on the streets of London is given a shot at redemption, but his road to recovery soon curdles into a strange odyssey from which he may never escape.\n\nTrailer:\n\n[https://www.youtube.com/watch?v=xUnNNwA4MiA](https://www.youtube.com/watch?v=xUnNNwA4MiA)\n\nAsk me anything! I'll be back at 3 PM ET today to answer your questions.",
        "upvotes": 1077,
        "comments": 332,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4lslc16px9uf1.jpeg?auto=webp&amp;s=50756b55c0e72acb7ea3c5c5ded2cf3b06ea64e5"
        },
        "permalink": "/r/movies/comments/1o2yxrf/hey_rmovies_im_harris_dickinson_you_mightve_seen/"
    },
    {
        "id": "1o43o4e",
        "author": "BunyipPouch",
        "title": "Actress Diane Keaton has died at the age of 79",
        "content": "",
        "upvotes": 29865,
        "comments": 1685,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OLsNWXKy6GAcVZ_kqBAN21-bwBpB_ou8kpLLF2wVGzs.jpeg?auto=webp&amp;s=fd0ff9710f9a8fbc85cf644376c0b617e93c0572"
        },
        "permalink": "/r/movies/comments/1o43o4e/actress_diane_keaton_has_died_at_the_age_of_79/"
    },
    {
        "id": "1o4f5b5",
        "author": "LollipopChainsawZz",
        "title": "Warner Bros. Is Said to Rebuff Paramount Takeover Approach",
        "content": "",
        "upvotes": 646,
        "comments": 97,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cqnp31r2Cd3mFrOhZz08ppJmn-53p51ZpUFTFEWoFzE.jpeg?auto=webp&amp;s=17d78c7207393edb28adc6aa1c7e46e66b2fc540"
        },
        "permalink": "/r/movies/comments/1o4f5b5/warner_bros_is_said_to_rebuff_paramount_takeover/"
    },
    {
        "id": "1o3x0js",
        "author": "Neo2199",
        "title": "Idiocracy (2006): President Dwayne Elizondo Mountain Dew Herbert Camacho's 2505 State of the Union Address",
        "content": "",
        "upvotes": 3763,
        "comments": 264,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Etp8aWhZqWmZtMu05MOkPz3ycJA-7j-QvoYusMa07w8.jpeg?auto=webp&amp;s=d1844d331e76a02b857e610f445a33f9baca7c8a"
        },
        "permalink": "/r/movies/comments/1o3x0js/idiocracy_2006_president_dwayne_elizondo_mountain/"
    },
    {
        "id": "1o455t2",
        "author": "NobodieInteresting",
        "title": "Movies where the Director's cut or Extended cut is wayy worse than the original theatrical cut?",
        "content": "Donnie Darko's director's cut is something I could do without. The original cut was soooo good - everything was *just right* but in the DC they overexplain everything and kill the pacing of the movie somehow.\n\nOn another note, the Justice League 2017 sucked so bad it should have never been made, but ZSJL's stretched 4h+ runtime was just *okay*. Like, it's wayyy better than JL, but still not great. The story was so drawn out, and the slo-mo in every scene was just so uninteresting/uninspired (sesame seed falling from the trucker's burger, Lois putting down her coffee cup). As one reviewer put it, \"You could cut an hour without affecting the plot even a little.\" Also, why format a film for IMAX full knowing it would be released on the HBO streaming service. (Disclaimer: not hating on ZS, it's just my opinion)",
        "upvotes": 677,
        "comments": 953,
        "media": null,
        "permalink": "/r/movies/comments/1o455t2/movies_where_the_directors_cut_or_extended_cut_is/"
    },
    {
        "id": "1o458ef",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'Mortal Kombat II'",
        "content": "",
        "upvotes": 560,
        "comments": 54,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3p3majmggjuf1.jpeg?auto=webp&amp;s=27ba0465c9ed735ff0a93005507aa539146daecb"
        },
        "permalink": "/r/movies/comments/1o458ef/new_poster_for_mortal_kombat_ii/"
    },
    {
        "id": "1o4axjb",
        "author": "EnvironmentalKey5350",
        "title": "What's your favorite movie that no one else seems to have seen?",
        "content": "One of my favorite movies is Return To Me. And every time I mention it so someone they have never even heard of it. It's a romantic comedy with David Duchovny and Minnie Driver. It makes me laugh and cry every time I watch it. Does anyone else have a movie they love, that no one else seems to know or remember? ",
        "upvotes": 227,
        "comments": 926,
        "media": null,
        "permalink": "/r/movies/comments/1o4axjb/whats_your_favorite_movie_that_no_one_else_seems/"
    },
    {
        "id": "1o4fke6",
        "author": "Business_Coffee_9421",
        "title": "2025's film that's been most overlooked?",
        "content": "I'm talking more specifically about which movie that had some bigger names and was actually good but had very little buzz and wasn't very popular at all?\n\nFor my personal pick I have to go with The Assessment. Alicia Vikander and Elizabeth Olsen star and the movie barely made a peep and lasted in theaters for about a week.",
        "upvotes": 88,
        "comments": 132,
        "media": null,
        "permalink": "/r/movies/comments/1o4fke6/2025s_film_thats_been_most_overlooked/"
    },
    {
        "id": "1o3wyiu",
        "author": "Alternative-Cake-833",
        "title": "What's the most inappropriate use of a song in a movie trailer?",
        "content": "Years ago when Imagine Dragons was at its peak of their popularity, everybody was using their songs in commercials and trailers (e.g. Friction for Mission: Impossible - Fallout and Warriors for Wonder Woman). But for some reason, someone thought that using Believer in the trailer Murder on the Orient Express (2017) was a good idea for a period piece mystery film, set in the 1930s.\n\nAnd that song did not work in the trailer at all. It was way too modern for a film set in the '30s and it was a weird song choice as well too for that trailer. That was definitely a weird moment during that period, before we even had slowed down songs in movie trailers.\n\nI give a special shout-out to Suicide Squad (2016) using Queen's Bohemian Rhapsody too and that was because the trailer was such a huge hit, WB hired the company that edited the trailer, to re-edit the movie as well. And it certainly didn't help the movie's quality at all lol.",
        "upvotes": 805,
        "comments": 414,
        "media": null,
        "permalink": "/r/movies/comments/1o3wyiu/whats_the_most_inappropriate_use_of_a_song_in_a/"
    },
    {
        "id": "1o47g2e",
        "author": "NoCulture3505",
        "title": "New Line Eyeing ‘Mortal Kombat III’ With Jeremy Slater Returning As Screenwriter",
        "content": "",
        "upvotes": 183,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jZjPGHAuJHILlujN6wxP27bKOx5dkAfchdu0Y_5F-go.jpeg?auto=webp&amp;s=1d2a73467202ecab5af6e39cbea6b0193edba212"
        },
        "permalink": "/r/movies/comments/1o47g2e/new_line_eyeing_mortal_kombat_iii_with_jeremy/"
    },
    {
        "id": "1o3mzem",
        "author": "NewSunSeverian",
        "title": "Shutter Island is so sad on a rewatch.",
        "content": "When you know what everyone’s governing motivation is, and you see how they’re all really struggling to help this one guy, it hits even harder. \n\nIt’s one of the greatest films ever to rewatch when you know what the entire situation is, not just because it’s interesting as a twisty Twilight Zone story, but because it’s so empathetic. There’s a real heart to this movie. \n\nBen Kingsley especially as that character was brilliant casting because he often plays villains and has a generally menacing countenance, but he’s ultimately revealed to be the kindest human imaginable.  ",
        "upvotes": 3531,
        "comments": 293,
        "media": null,
        "permalink": "/r/movies/comments/1o3mzem/shutter_island_is_so_sad_on_a_rewatch/"
    },
    {
        "id": "1o46d3p",
        "author": "EuphoricButterflyy",
        "title": "The Car (1977)- Hurting the Car’s feelings scene. Directed by Elliot Silverstein",
        "content": "",
        "upvotes": 156,
        "comments": 45,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/qh14bfxtojuf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1o46d3p/the_car_1977_hurting_the_cars_feelings_scene/"
    },
    {
        "id": "1o3p7nf",
        "author": "Boss452",
        "title": "The Lego Batman Movie (2017) - Batman's typical night after saving the day",
        "content": "",
        "upvotes": 1677,
        "comments": 75,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/0s2haf9difuf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1o3p7nf/the_lego_batman_movie_2017_batmans_typical_night/"
    },
    {
        "id": "1o43daz",
        "author": "tinythanoscopter",
        "title": "Just rewatched 'Sneakers' and it got me thinking about forgotten movies",
        "content": "Sneakers has an incredible cast: Robert Redford, Sidney Poiter, Ben Kingsley, River Phoenix, Dan Ackroyd, Mary McDonnell, David Strathairn. It also has a really smart script (not including the zoom-and-enhance trope), and a great score by James Horner. I never hear anyone ever talking about it, and I'm pretty sure it didn't make much of an impression when it released.\n\nSo, what other movies has an impressive cast, alongside great writing and direction, that nobody talks about anymore?\n\n(Also RIP Robert Redford. Charisma personified)",
        "upvotes": 202,
        "comments": 124,
        "media": null,
        "permalink": "/r/movies/comments/1o43daz/just_rewatched_sneakers_and_it_got_me_thinking/"
    },
    {
        "id": "1o3yxr0",
        "author": "BunyipPouch",
        "title": "First Poster for Documentary 'Are We Good?' - Comic and podcast pioneer Marc Maron reflects on loss and growth after the death of his partner, Lynn Shelton.",
        "content": "",
        "upvotes": 238,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/rtladcc17iuf1.jpeg?auto=webp&amp;s=9d2fd2b7f9184b21fe8e5dac9dca4833b8cf5382"
        },
        "permalink": "/r/movies/comments/1o3yxr0/first_poster_for_documentary_are_we_good_comic/"
    },
    {
        "id": "1o49wsa",
        "author": "seveer37",
        "title": "Billy Crystal was the lead, Jack Palance won the Oscar, but Daniel Stern was the MVP of City Slickers!",
        "content": "I mean Crystal is always funny don’t get me wrong, and yes I know this was Jake Gyllenhaal’s breakout film. But Stern gives arguably the funniest but also moving performance of them all. He has some of the funniest parts and lines. Pretending not to sleep to not talk to his wife, can’t comprehend how a VCR works, “If hate were people, I’d be China!” And asked what’s the worst day of his life after his wedding day, “Everyday since has been a tie.” But he goes through probably the most trauma and growth out of them all. Mitch is afraid of death and Ed is worried about having kids, but Phil’s entire life has now been destroyed, which wasn’t doing so good anyway. His miserable marriage has finally ended, he’s lost his job, and knows his ex is gonna take him for everything he’s got. Including his kids. So he’s the one who steps up and defends the group from the drunk cowboys. A final breaking point then has an emotional breakdown. Knowing it’s probably not gonna get better. And from the not as good sequel it doesn’t. But he continues on anyway. It hit me since I myself am going through a similar situation. A rough divorce, custody battle, loss of a job. It’s like everything happens at once. So maybe I’m just identifying with him lately. ",
        "upvotes": 59,
        "comments": 14,
        "media": null,
        "permalink": "/r/movies/comments/1o49wsa/billy_crystal_was_the_lead_jack_palance_won_the/"
    },
    {
        "id": "1o3y70d",
        "author": "BunyipPouch",
        "title": "Hugh Jackman’s Upcoming Comedy Changes Title from ‘Three Bags Full’ to 'The Sheep Detectives' &amp; Sets Release Date for Mother’s Day Weekend 2026",
        "content": "",
        "upvotes": 211,
        "comments": 70,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cRlvFamuRbjIUNxuWJfYlfQh9L3XgwBGSn_LW9_DEwo.jpeg?auto=webp&amp;s=58399a144dc0f8525f2e61752312f5ef1d0ef0e1"
        },
        "permalink": "/r/movies/comments/1o3y70d/hugh_jackmans_upcoming_comedy_changes_title_from/"
    },
    {
        "id": "1o4bryf",
        "author": "aphaits",
        "title": "Which movies best represents each of the biblical seven sins?",
        "content": "Here's my list so far from modern movies:\n\n1. **Gluttony**: The Menu\n2. **Greed**: The Wolf of Wall Street\n3. **Lust**: Eyes Wide Shut\n4. **Wrath**: John Wick\n5. **Sloth**: The Big Lebowski\n6. **Envy**: Black Swan\n7. **Pride**: Whiplash\n\nI feel like my picks are a bit shallow and doesn't have too much depth within each of the sins as the base topic of the movie. There is also some movie that represent other things quite well but does not fit in the seven sins category such as Insomnia representing Guilt.\n\nWhat movie would you guys pick as the best representation for each sin?\n\nPS: Decided to not include Se7en in any of the list because its just too on the nose.\n\nEdit: Decided to do a thread best picks to compare with my original list:\n\n1. **Gluttony**:\n   * The Menu\n   * The Whale\n   * La Grande Bouffe\n   * Salo or the 120 days of Sodom\n   * Leaving Las Vegas\n   * Fear and Loathing in Las Vegas\n2. **Greed**:\n   * The Wolf of Wall Street\n   * Wall Street\n   * The Big Short\n   * Margin Call\n3. **Lust**:\n   * Eyes Wide Shut\n   * Immoral Tales\n   * Nymphomania\n   * In The Realm of The Senses\n4. **Wrath**:\n   * John Wick\n   * Oldboy\n   * Kill Bill\n   * I Saw the Devil\n5. **Sloth**:\n   * The Big Lebowski\n   * Schindler's List\n   * Trainspotting\n   * Office Space\n   * Clerks\n   * Garden State\n6. **Envy**:\n   * Black Swan\n   * Amadeus\n   * American Psycho\n   * The Substance\n   * The Cable Guy\n   * One Hour Photo\n   * The Talented Mr Ripley\n7. **Pride**:\n   * Whiplash\n   * There Will Be Blood\n   * To Die For\n   * Oppenheimer\n   * Ex Machina\n   * Training Day",
        "upvotes": 36,
        "comments": 145,
        "media": null,
        "permalink": "/r/movies/comments/1o4bryf/which_movies_best_represents_each_of_the_biblical/"
    },
    {
        "id": "1o4fr1t",
        "author": "AceAttorneyFan12",
        "title": "Why was it so brutal (Casino 1995)",
        "content": "So I just watched it for the first time, enjoyed it a lot. The ending where they beat the shit out of the brothers was so horrible. Usually I’m fine  with bloody scenes but something about it was terrible. I felt like I was gonna vomit during it. Basically the most I’ve ever been disturbed by a movie. But it was great film.",
        "upvotes": 16,
        "comments": 61,
        "media": null,
        "permalink": "/r/movies/comments/1o4fr1t/why_was_it_so_brutal_casino_1995/"
    },
    {
        "id": "1o3hm78",
        "author": "MarvelsGrantMan136",
        "title": "Jim Caviezel Won’t Return as Jesus for Mel Gibson’s ‘Resurrection of the Christ’",
        "content": "",
        "upvotes": 2604,
        "comments": 803,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3NaFPjNlA2c_4bdnsmoOPs0HGAW-0YUkut9t5gBiLzI.jpeg?auto=webp&amp;s=4db4c3572e779b6f00dd2ac060872c727d12bdbb"
        },
        "permalink": "/r/movies/comments/1o3hm78/jim_caviezel_wont_return_as_jesus_for_mel_gibsons/"
    },
    {
        "id": "1o4ghj9",
        "author": "SymbolicRevolution",
        "title": "High school teacher looking for movie recommendations",
        "content": "Hey r/movies!\n\nI just watched The Substance and loved its artistic style, symbolism, and thematic depth. I’m looking for a film that captures a similar vibe. Something visually striking, and full of symbolism and themes.\n\nHere’s the catch: I’m a high school English teacher, and I’d love to use it in class with my honors-level seniors. So while I’m looking for something thought-provoking and a bit edgy, it still needs to be school-appropriate: no nudity or sexually explicit content. Rated R is okay if it does not have nudity/sexually explicit content. It should also be a film that would interest teens. \n\nFor context, we started the semester by analyzing the Black Mirror episode “Nosedive,” and I’d like to end the term with another piece of media that invites strong discussion and analysis.\n\nAny recommendations for films that strike that balance between artistry, symbolism, and classroom-appropriateness?",
        "upvotes": 10,
        "comments": 25,
        "media": null,
        "permalink": "/r/movies/comments/1o4ghj9/high_school_teacher_looking_for_movie/"
    },
    {
        "id": "1o3oyp9",
        "author": "ChiefLeef22",
        "title": "MatPat has been cast in the role of Toy Bonnie in 'Five Nights at Freddy's 2'",
        "content": "",
        "upvotes": 560,
        "comments": 58,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/A9EqU34hHv1cnTlPipX6IRJW58tLufQtKOes72eRyIY.jpeg?auto=webp&amp;s=e3b7f69129bd45f44ac634227e29f756d1a14db2"
        },
        "permalink": "/r/movies/comments/1o3oyp9/matpat_has_been_cast_in_the_role_of_toy_bonnie_in/"
    },
    {
        "id": "1o3nv6v",
        "author": "ChiefLeef22",
        "title": "Bradley Cooper's 'Is This Thing On?' - Review Thread",
        "content": "*Facing middle age and an impending divorce, Alex finds new purpose in the New York comedy scene, while his wife, Tess, confronts the sacrifices she made for their family.*\n\nCast: Will Arnett, Bradley Cooper, Laura Dern\n\n**Rotten Tomatoes:** [93%](https://www.rottentomatoes.com/m/is_this_thing_on)\n\n**Metacritic:** [70 / 100](https://www.metacritic.com/movie/is-this-thing-on/)\n\nSome Reviews:\n\n[The Guardian - Adrian Horton](https://www.theguardian.com/film/2025/oct/10/is-this-thing-on-review-bradley-cooper) \\- 4 / 5\n\n&gt;Is This Thing On? starts with a punchline – sad divorced dad stumbles into a bar as a cry for help – and smartly works backward; like a great routine, beneath the jokes lurks something tender, grounded and real.\n\n[Awards Radar - Joey Magidson](https://awardsradar.com/2025/10/11/nyff-review-is-this-thing-on-is-smaller-scale-divorce-dramedy-from-bradley-cooper/) \\- 3 / 4\n\n&gt;*Is This Thing On?* isn’t an awards player and is a bit of a trifle, but I’d be lying if I said I wasn’t mostly entertained. By the end, Cooper and company have crafted a winning dramedy that has elements of what makes any good rom com work. Wrapping up NYFF on a pleasant if unspectacular note, it’s destined to be a very easy watch for folks, once it comes out later on this year.\n\n[Vulture - Alisson Wilmore](https://www.vulture.com/article/is-this-thing-on-review-bradley-cooper-made-a-crowd-pleaser.html)\n\n&gt;We’ve seen Arnett play variations on his character before, sardonic and self-deprecating. It’s Dern who’s the revelation as a woman who truly doesn’t know what she wants, and who is figuring it out in real time in a way that’s a delight to watch.",
        "upvotes": 682,
        "comments": 83,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QWCoZixkTQue9UGglxOGgXqPg9XI2EStMgEkQoDvgS8.jpeg?auto=webp&amp;s=b05f458bc7eec1beb591c0e486ba1b6dacf4d6f2"
        },
        "permalink": "/r/movies/comments/1o3nv6v/bradley_coopers_is_this_thing_on_review_thread/"
    },
    {
        "id": "1o3ijqu",
        "author": "TiredWithCoffeePot",
        "title": "Megan Fox Joins ‘Five Nights at Freddy’s 2’ as Toy Chica",
        "content": "",
        "upvotes": 1368,
        "comments": 147,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fzMcwHve5mX300kQ0ISpozNYb-Pu2RyEcM4_ccizVqw.jpeg?auto=webp&amp;s=107470442628bb20559a0c2c3c2b359aed437c04"
        },
        "permalink": "/r/movies/comments/1o3ijqu/megan_fox_joins_five_nights_at_freddys_2_as_toy/"
    },
    {
        "id": "1o4efzn",
        "author": "KireRakhsh",
        "title": "Martin Scorsese and Jafar Panahi at the New Yor Film Festival (Scorsese appealed streaming platforms to promote Iranian cinema &amp; Panahi talked about his arrest, exile and censorship by IR)",
        "content": "",
        "upvotes": 10,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OzCHjexg5ccKCPIwqK85PDh7I1qo0KyNGUaMxSNyjdc.jpeg?auto=webp&amp;s=2f55109d081919be0ab0b9a631f56b2486a45b04"
        },
        "permalink": "/r/movies/comments/1o4efzn/martin_scorsese_and_jafar_panahi_at_the_new_yor/"
    },
    {
        "id": "1o3e26i",
        "author": "momskillet",
        "title": "Channing Tatum on ‘Roofman,’ Why the ‘Jump Street’ Sequel Keeps Falling Apart and His ‘Gambit’ Movie That Had Mutants Having Sex",
        "content": "",
        "upvotes": 2198,
        "comments": 121,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dB3cCUkrX2tFUNQZsOXODyFayec6OgakmuT8D0MDOxg.jpeg?auto=webp&amp;s=a979a9e3f8a8cf11a322cd67ff47926c5c6dada2"
        },
        "permalink": "/r/movies/comments/1o3e26i/channing_tatum_on_roofman_why_the_jump_street/"
    },
    {
        "id": "1o4hqc1",
        "author": "Padproductions",
        "title": "Map of American Horror Movie Towns (by state)",
        "content": "I'm building a map of American towns that serve as the setting of horror/Halloween movies, organized by state.\n\nSuggestions welcome",
        "upvotes": 6,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ZxekCV5-cF92mskfd6aIOgIxsu42xV9-RftrGgfRVmQ.jpeg?auto=webp&amp;s=47281c469a17c15c6c1feb58db9d40d762b5a0a4"
        },
        "permalink": "/r/movies/comments/1o4hqc1/map_of_american_horror_movie_towns_by_state/"
    },
    {
        "id": "1o4h69j",
        "author": "TryingNoToBeOpressed",
        "title": "Grow (2025) review – polished pumpkin growing caper stuffed with perky charm and comedy talent",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MQqcLMIBidOupN1nCTAYB9ZqrySp6xvArdvF2wYYsqE.jpeg?auto=webp&amp;s=f7e558f4d452141b89ec89ac1a4a5fa838760219"
        },
        "permalink": "/r/movies/comments/1o4h69j/grow_2025_review_polished_pumpkin_growing_caper/"
    },
    {
        "id": "1o3wm0j",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Jane Levy - Monday 10/13 at 5:00 PM ET - Actress in 'Don't Breathe', 'Evil Dead', 'A Little Prayer', ' Zoey's Extraordinary Playlist', 'Suburgatory', 'I Don't Feel at Home in This World Anymore', 'Monster Trucks', 'Castle Rock', and lots more.",
        "content": "",
        "upvotes": 71,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/eymk97wmphuf1.png?auto=webp&amp;s=d9fbdf64f9d507305cea73d0d4ce5c8eaf3f3631"
        },
        "permalink": "/r/movies/comments/1o3wm0j/amaqa_announcement_jane_levy_monday_1013_at_500/"
    }
]