[
    {
        "id": "1kspfrg",
        "author": "AlanAndMattAMA",
        "title": "Hey /r/movies! We're Alan Tudyk &amp; Matt Winn, actor &amp; director of THE TROUBLE WITH JESSICA, a dark comedy also starring Rufus Sewell &amp; Shirley Henderson about a group of longtime friends at a dinner party that goes horribly wrong, recently in theaters and now available on digital. Ask us anything!",
        "content": "You might also know Alan for films and series such as Firefly, Tucker &amp; Dale vs Evil, Serenity, Andor, A Knight's Tale, Resident Alien, Rogue One: A Star Wars Story, Moana, Frozen II, I Robot, Maze Runner, Transformers, Deadpool 2, The Electric State, Harley Quinn, Dodgeball, Raya and the Last Dragon, Ice Age, Arrested Development, 3:10 To Yuma, and much more.\n\nABOUT THE FILM: Married couple Sarah (Shirley Henderson) and Tom (Alan Tudyk) are in terrible financial trouble. On the brink of losing everything, they’ve managed to find a buyer for their stylish London home. When their best friends Richard (Rufus Sewell) and Beth (Olivia Williams) come over for a final dinner, an uninvited old friend, Jessica (Indira Varma), tags along.\n\nAfter a seemingly trivial argument at dinner, Jessica disappears. She has the temerity to hang herself in the garden, totally oblivious to the adverse consequences for Sarah and Tom’s real estate sale. The only solution: Sarah and Tom must convince Richard and Beth to help take care of this little inconvenience. If they’re clever enough about it, what could possibly go wrong? Knives are out and best-kept secrets are revealed in this laugh-out-loud dark comedy featuring a starry ensemble cast of phenomenal UK talent.\n\nTRAILER: [https://www.youtube.com/watch?v=l\\_xhtk8Tj18](https://www.youtube.com/watch?v=l_xhtk8Tj18) \n\nLearn More and Rent/Buy THE TROUBLE WITH JESSICA: https://www.musicboxfilms.com/film/the-trouble-with-jessica.\n\nAsk us anything! Back at 3 PM ET today for answers.\n\n\n\n",
        "upvotes": 242,
        "comments": 252,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ohy0hof2tb2f1.png?auto=webp&amp;s=7039a148f333722fa2414b6009872629b373b2c9"
        },
        "permalink": "/r/movies/comments/1kspfrg/hey_rmovies_were_alan_tudyk_matt_winn_actor/"
    },
    {
        "id": "1ksr5yx",
        "author": "KarateKidAMA",
        "title": "Hey /r/movies! I'm Jonathan Entwistle – director of the upcoming Karate Kid: Legends. You might also know me as the creator of The End of the F**ing World* and I Am Not Okay with This. I am so excited to be helping expand the Karate Kid universe. Ask me anything!",
        "content": "Hey r/movies! I'm Jonathan Entwistle – director of the upcoming Karate Kid: Legends. You might also know me as the creator of The End of the F\\*\\*ing World\\* and I Am Not Okay with This. I am so excited to be helping expand the Karate Kid universe. Ask me anything!\n\nI’m thrilled to say most recently, I directed Karate Kid: Legends, the latest installment in the iconic franchise, bringing together Jackie Chan and Ralph Macchio on screen for the first time. We’re introducing a new hero, Li Fong (played by Ben Wang), and telling a fresh story!\n\nWould love to talk about bringing legacy franchises back to life, directing legends, or what it’s like making movies!\n\n[https://karatekid.movie/](https://karatekid.movie/) and we’d love to call out that tickets will be on sale.\n\nTrailer:\n\n[https://www.youtube.com/watch?v=LhRXf-yEQqA](https://www.youtube.com/watch?v=LhRXf-yEQqA)\n\nSynopsis:\n\n&gt;After moving to New York City with his mother, kung fu prodigy Li Fong struggles to let go of the past as he tries to fit in with his new classmates. When a new friend needs his help, Li enters a karate competition -- but his skills alone aren't enough. With help from Mr. Han and Daniel LaRusso, he soon learns to merge two styles into one for the ultimate martial arts showdown.\n\nAsk me anything! Back at 5 PM ET tonight.",
        "upvotes": 51,
        "comments": 62,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/idvz7idg8c2f1.png?auto=webp&amp;s=0b0f533de64f2647f35dc4f4687bc0d947ec1426"
        },
        "permalink": "/r/movies/comments/1ksr5yx/hey_rmovies_im_jonathan_entwistle_director_of_the/"
    },
    {
        "id": "1kst927",
        "author": "DoctorWhofan789eywim",
        "title": "I think Hot Fuzz is a perfect movie. What movie do you consider to be absolutely perfect?",
        "content": "I think Hot Fuzz is a perfect film, genuinely flawless. The script is tighter than a drum, every single line in the first half pays off in the second, you can rewatch it a hundred times and notice a new gag and it manages to switch genres for the final third and still feel like a cohesive whole.\n\nWhat movie do you consider to be perfect?",
        "upvotes": 1775,
        "comments": 1259,
        "media": null,
        "permalink": "/r/movies/comments/1kst927/i_think_hot_fuzz_is_a_perfect_movie_what_movie_do/"
    },
    {
        "id": "1ksujyz",
        "author": "MarvelsGrantMan136",
        "title": "New Posters for ‘Superman’",
        "content": "",
        "upvotes": 646,
        "comments": 115,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xs5zh41exc2f1.jpeg?auto=webp&amp;s=47c21bceb5628981c6f9015b422fffca3c65caab"
        },
        "permalink": "/r/movies/comments/1ksujyz/new_posters_for_superman/"
    },
    {
        "id": "1kst0ri",
        "author": "NoCulture3505",
        "title": "TITAN: The OceanGate Disaster | Official Trailer | Netflix",
        "content": "",
        "upvotes": 680,
        "comments": 246,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JBKie9Xv1KxO2jhc4Ol7uft10CotHL2NV3Dzvh41oVk.jpg?auto=webp&amp;s=b20dd313ce9f06ff421bfa2c53461c343e61abab"
        },
        "permalink": "/r/movies/comments/1kst0ri/titan_the_oceangate_disaster_official_trailer/"
    },
    {
        "id": "1kst74y",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'TITAN: The Oceangate Disaster'",
        "content": "",
        "upvotes": 347,
        "comments": 174,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/c2s05oafnc2f1.jpeg?auto=webp&amp;s=34eef4d0a87165fca02c1909c1be78ba23be924e"
        },
        "permalink": "/r/movies/comments/1kst74y/official_poster_for_titan_the_oceangate_disaster/"
    },
    {
        "id": "1ksbikt",
        "author": "TheMirrorUS",
        "title": "Space Jam star Michael Alaimo dies at the age of 86",
        "content": "",
        "upvotes": 4127,
        "comments": 192,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/PNItaxbSAFynQfbmIPROhR55z1K7U3z2hCTmMMmo7Vc.jpg?auto=webp&amp;s=6d602826442c38d4154ae07c28d4121c07011c44"
        },
        "permalink": "/r/movies/comments/1ksbikt/space_jam_star_michael_alaimo_dies_at_the_age_of/"
    },
    {
        "id": "1kssnzx",
        "author": "GardenOrca",
        "title": "The Man From Earth…",
        "content": "Just wow. Never have I ever watched a movie that provoked so much thought in my mind. The concepts and characters interactions are superb. Everything about this film is incredible and I HIGHLY reccomend everyone watches it. If you are a person of faith, prepare to have your views challenged and tested. I am not a person of faith and honestly think that the theory presented in the film is more realistic than religious theory and biblical ‘evidence.’ Curious to hear other people’s thoughts on this film. Cheers. ",
        "upvotes": 190,
        "comments": 118,
        "media": null,
        "permalink": "/r/movies/comments/1kssnzx/the_man_from_earth/"
    },
    {
        "id": "1ksczwm",
        "author": "MarvelsGrantMan136",
        "title": "Kieran Culkin to Play Caesar in ‘Hunger Games: Sunrise on the Reaping’",
        "content": "",
        "upvotes": 2149,
        "comments": 160,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/h9rMNl5RbJs5lp0bwPO6IDf6WR9fcugb5MpStGPSS1E.jpg?auto=webp&amp;s=8aa983bd41ccaddef5c8f429cd7ce97bcd132431"
        },
        "permalink": "/r/movies/comments/1ksczwm/kieran_culkin_to_play_caesar_in_hunger_games/"
    },
    {
        "id": "1ksi7eo",
        "author": "EnvironmentalZone189",
        "title": "What’s your “I don’t know what to watch, so I’ll just watch this again” movie?",
        "content": "You know the one.  \nNot necessarily your favorite movie(it could be), or the best movie ever made but just the one that’s always there when your brain is tired, your food’s getting cold, and you don’t feel like making a decision.\n\nCould be comfort. Could be nostalgia. Could just be vibes.\n\nWhat movie do you keep going back to when you’re overwhelmed by options but still want to feel something?\n\nBonus points if it’s weirdly specific or not what people expect.",
        "upvotes": 653,
        "comments": 1507,
        "media": null,
        "permalink": "/r/movies/comments/1ksi7eo/whats_your_i_dont_know_what_to_watch_so_ill_just/"
    },
    {
        "id": "1ksshw5",
        "author": "rrrrrafe",
        "title": "Billy Williams, ‘Gandhi’ and ‘On Golden Pond’ Cinematographer, Dies at 96",
        "content": "",
        "upvotes": 72,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ZvJrIKFlIAq8qTbrsToyxEvf1HT6f5twg2-Ie9QJ8-Y.jpg?auto=webp&amp;s=f21fd286fc725ffcf5a1218924728f879eb345b7"
        },
        "permalink": "/r/movies/comments/1ksshw5/billy_williams_gandhi_and_on_golden_pond/"
    },
    {
        "id": "1ksufx4",
        "author": "ChiefLeef22",
        "title": "Guy Ritchie's 'Fountain of Youth' - Review Thread",
        "content": "*Two estranged siblings partner on a global heist to find the mythological Fountain of Youth. They must use their knowledge of history to follow clues on an adventure that will change their lives and possibly lead to immortality.*\n\nCast: John Krasinski, Natalie Portman, Eiza González, Domhnall Gleeson, Arian Moayed, Laz Alonso, Carmen Ejogo, Stanley Tucci, Benjamin Chivers, Michael Epp.\n\n**Rotten Tomatoes:** [20%](https://www.rottentomatoes.com/m/fountain_of_youth_2025)\n\n**Metacritic:** [42/100](https://www.metacritic.com/movie/fountain-of-youth/)\n\nSome Reviews:\n\n[Variety - Todd Gilchrist](https://variety.com/2025/film/reviews/fountain-of-youth-review-guy-ritchie-john-krasinski-1236405297/)\n\n&gt;As a spirited time-filler, “Fountain of Youth” gets the job done, but anyone looking for a deeper exploration of the search for eternal life may find this little more insightful than a stopped clock.\n\n[The Hollywood Reporter - Frank Scheck](https://www.hollywoodreporter.com/movies/movie-reviews/fountain-of-youth-review-john-krasinski-natalie-portman-1236224248/)\n\n&gt;It’s all as predictable as you’d expect, with the screenplay by James Vanderbilt failing to provide the wit necessary to make the film stand out in any way. (One exception, an exchange between young Thomas and billionaire Owen about what it’s like to be obscenely rich, stands out). By the time it concludes with the inevitable hinting at potential sequels, *Fountain of Youth* just seems desperate in its attempt to launch a viable film franchise for its streaming host.\n\n[The Wrap - William Bibbiani](https://www.thewrap.com/fountain-of-youth-review-john-krasinski-natalie-portman-apple/)\n\n&gt;It would be nice to report that “Fountain of Youth” is harmless fluff, a brisk escapist adventure with a game cast and a few fun set pieces. And I suppose it may be mostly harmless, unless you count wasting your time as a “harm” (and I wouldn’t fight you on that). But it’s annoying fluff. It’s tedious fluff. The only thing I wanted to escape was the movie itself. The cast is either trying too hard or not enough, and none of the action sequences blew me away. There’s a bit on a boat that was probably expensive. There’s a fight in a library that’s competent. There’s a shootout at the pyramids between characters we don’t know or give a damn about. There’s a big difference between “fluffy” and “empty.” “Fountain of Youth” seems to have found it.\n\n[The Daily Beast](https://www.rottentomatoes.com/critics/source/2345) \\- [Nick Schager](https://www.rottentomatoes.com/critics/nick-schager)\n\n&gt;No matter his gifts for tales about motley crews, this sub-Spielbergian venture isn’t in his rough-and-tumble wheelhouse, the result being a clunky farce that never escapes its ancestors’ shadow.\n\n[Guardian](https://www.rottentomatoes.com/critics/source/205) \\- [Ryan Gilbey](https://www.rottentomatoes.com/critics/ryan-gilbey) \\- 2/5\n\n&gt;A movie as derivative and uninspired as this will always be surplus to requirements so long as the first three Indiana Jones movies remain in circulation. As the family name Purdue suggests, Luke and Charlotte’s father believed that some things should remain lost. Would that this had been the fate of the film.",
        "upvotes": 51,
        "comments": 61,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8F-t5Ac3uDES6gH0Ck8w7NS0mDSxiIih5_HwqseNELU.jpg?auto=webp&amp;s=e1c87c82942e646d8685c6f213abddbc3aa89be6"
        },
        "permalink": "/r/movies/comments/1ksufx4/guy_ritchies_fountain_of_youth_review_thread/"
    },
    {
        "id": "1kst8j9",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'The Roses' - Ivy and Theo, the picture-perfect couple who have successful careers, great kids, and an enviable sex life. But underneath the façade of the perfect family is a tinderbox of competition and resentments that’s ignited when Theo’s professional dreams come crashing down.",
        "content": "",
        "upvotes": 55,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vnkonektnc2f1.jpeg?auto=webp&amp;s=917f111b1325f58d4ea58bae288646bb53ff78e0"
        },
        "permalink": "/r/movies/comments/1kst8j9/new_poster_for_the_roses_ivy_and_theo_the/"
    },
    {
        "id": "1ksr3xm",
        "author": "ChiefLeef22",
        "title": "Joachim Trier's 'Sentimental Value' - Review Thread",
        "content": "*An intimate and moving exploration of family, memories, and the reconciliatory power of art*.\n\nCast: Renate Reinsve, Stellan Skarsgård, Inga Ibsdotter Lilleaas, Elle Fanning and Cory Michael Smith\n\n**Rotten Tomatoes:** [100%](https://www.rottentomatoes.com/m/sentimental_value)\n\n**Metacritic:** N/A (updating)\n\nSome Reviews:\n\n[DEADLINE - Pete Hammond](https://deadline.com/2025/05/sentimental-value-review-joachim-trier-1236406716/)\n\n&gt;*Sentimental Value* is a film that sneaks up on you, more meditative than maybe expected but also one that will not leave your mind so easily. The conclusion also turns out to be one of more satisfying endings I have seen in some time, perfectly pitched and worth the wait for its human truth, and value that stops just short of sentimental. The real force of nature in *Sentimental Value* is Skarsgård and the film comes alive each moment he is on screen as a man who turned his back on his daughters, even his grandson, for the sake of a career.\n\n[IndieWire - David Ehrlich](https://www.indiewire.com/criticism/movies/sentimental-value-movie-review-joachim-trier-1235125511/) \\- 'A'\n\n&gt;Mercy asks for allowance, where forgiveness demands absolution. Mercy is a means, and forgiveness its ultimate end. Forgiveness is an act, while mercy is a *performance*. The distinction between the two may be subtle, but through the extraordinary grace of Trier’s filmmaking, which here revels in the transmutational power of filmmaking itself, “Sentimental Value” renders it larger than life. \n\n[The Daily Beast - Esther Zuckerman](https://www.thedailybeast.com/obsessed/sentimental-value-is-the-best-movie-at-the-2025-cannes-film-festival/)\n\n&gt;‘Sentimental Value’ is the best movie at the 2025 Cannes Film Festival. This year on the Croisette, Trier and Reinsve have reunited for this project, a triumph of a film that expands upon and deepens their collaboration. It’s also flat out the best thing I saw at the festival, a movie that slowly wrecks you emotionally as it tenderly unpacks a deeply complicated father-daughter relationship.\n\n[Variety - Peter Debruge](https://variety.com/2025/film/reviews/sentimental-value-review-aafeksjonsverdi-1236405810/)\n\n&gt;While not as stylistically radical as Trier’s last film, “The Worst Person in the World,” this layered family-centric drama (which was also written by Eskil Vogt) shares its ability to find fresh angles on sentiments you’d think that cinema would have exhausted by now. Chief among the previous movie’s revelations was its star, Reinsve, who recalls the laid-back, lived-in and yet entirely modern allure of Diane Keaton during Woody Allen’s peak years, mixed with an unpredictability that can feel positively radiant one second and practically inconsolable the next.\n\n[Vogue - Radhika Seth](https://www.vogue.com/article/sentimental-value-cannes-review)\n\n&gt;'Sentimental Value' might be the best film you see all year. Considering *Worst Person* got best-original-screenplay and best-international-feature Oscar nods, too, *Sentimental Value* should also expect to do well elsewhere, and is, unquestionably, this year’s first serious best-picture contender. And it couldn’t be more deserving. There are so many pleasures to be found in it—the swooningly beautiful way in which it’s shot, its painstaking design, its laidback, low-key, eternally aspirational Scandi aesthetic and costuming. But, in the end, none of that mattered to me, because emotionally, the film hit me like a truck.\n\n[The Hollywood Reporter - David Rooney](https://www.hollywoodreporter.com/movies/movie-reviews/sentimental-value-review-renate-reinsve-joachim-trier-1236223376/)\n\n&gt;For what might have been a standard family melodrama in less capable hands, *Sentimental Value* is uncommonly rich in emotional rewards and contemplative in its reflections on the places where we live becoming a permanent repository for our memories, remaining there even after we move on. The movie’s poignancy accumulates gradually, every supple turn expertly modulated as the presence of generations past becomes more tangible.\n\n[Next Best Picture - Matt Neglia](https://nextbestpicture.com/sentimental-value/) \\- 9/10\n\n&gt;“Sentimental Value” is a film about the weight of home, the bonds of family, and the redemptive potential of art. It’s a story only Joachim Trier could tell after working on “The Worst Person In The World” and challenging himself, Vogt, and Reinsve to go even deeper than they did previously to tell something that was just as impactful, if not more rewarding. It’s a daunting task to accomplish, but they somehow manage to do so with a film that will be cherished for generations. Reinsve, Skarsgård, Fanning, and Lilleaas form one of the most impressive ensembles of the year, each given the space and time to create compelling and relatable characters that offer rare subtlety and honest truth in their work rather than broad theatrics.\n\n[The Guardian - Peter Bradshaw](https://www.theguardian.com/film/2025/may/21/sentimental-value-review-cannes) \\- 3/5\n\n&gt;Here is an exuberant, garrulous, self-aware picture about an ageing and egomaniac film director and his two grownup daughters; it comes from Norwegian film-maker Joachim Trier, who gave Cannes the marvellous romantic drama The Worst Person in the World in 2021, starring the award-winning Renate Reinsve, who stars in this one as well. The film cycles through a range of moods and ideas, and finally delivers a fair bit of that sentimentality from the title; it’s a movie of daddy issues and cinematic adventures in the manner of Fellini and Bergman, with a gag about overhearing a therapist’s session through the heating pipes, pinched from Woody Allen’s Another Woman.\n\n[Screen Daily - Tim Grierson](https://www.screendaily.com/reviews/sentimental-value-review-renate-reinsve-and-joachim-trier-reunite-for-moving-family-drama/5205383.article)\n\n&gt;An actress daughter and her director father explore their family roles in *Sentimental Value*, the sensitive sixth feature from Norway’s director Joachim Trier. On its surface, the film may touch on the familiar theme of how artists draw from their own lives, but Renate Reinsve and Stellan Skarsgard bring incredible tenderness to a story that is ultimately about what children and parents never say to one another — and whether those lifelong silences can ever be broken.",
        "upvotes": 36,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/s0C3p957eX7Cfij8yiJsadlw-x0QiG_mT1L3E4M-BtA.jpg?auto=webp&amp;s=d79bdb18e1c1a9db48784e056042b6b2f2991924"
        },
        "permalink": "/r/movies/comments/1ksr3xm/joachim_triers_sentimental_value_review_thread/"
    },
    {
        "id": "1ksb2qt",
        "author": "NimdokBennyandAM",
        "title": "Which movie has the most accurate representation of spycraft?",
        "content": "I'm in the mood for a spy movie and need some suggestions.\n\n\nSpecifically, I'm looking for spy movies that give an accurate sense of what espionage and spycraft are like.\n\n\n\nI'm good with any genre, original stories or stories based in real events/history, etc. I'm open to any movie that fits in that category: true-to-life spy movies.\n\n\nBut, in your opinion, which one is *best*? Which gets it most right?\n\nWhat's good?",
        "upvotes": 619,
        "comments": 559,
        "media": null,
        "permalink": "/r/movies/comments/1ksb2qt/which_movie_has_the_most_accurate_representation/"
    },
    {
        "id": "1ks13ll",
        "author": "BunyipPouch",
        "title": "First Poster for National Geographic Documentary 'Sally' - Explores Sally Ride's groundbreaking journey as the first American woman in space.",
        "content": "",
        "upvotes": 1560,
        "comments": 88,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/d0e21o59o52f1.jpeg?auto=webp&amp;s=1db50e5cfbc03acb58dbe7b77b320f89777db4f0"
        },
        "permalink": "/r/movies/comments/1ks13ll/first_poster_for_national_geographic_documentary/"
    },
    {
        "id": "1krx82c",
        "author": "Comic_Book_Reader",
        "title": "CAUGHT STEALING - Official Trailer - In Cinemas August 28, 2025",
        "content": "",
        "upvotes": 2511,
        "comments": 419,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3FzCuj4ZsEPv4fZo8P-xbWkE0nh1XYfmsDubgdbcrJg.jpg?auto=webp&amp;s=ec2af414881af9ed517f90c110b136dca3f9e274"
        },
        "permalink": "/r/movies/comments/1krx82c/caught_stealing_official_trailer_in_cinemas/"
    },
    {
        "id": "1ks5ktf",
        "author": "NoCulture3505",
        "title": "Dwayne Johnson Joins 'Breakthrough' Thriller At A24",
        "content": "",
        "upvotes": 821,
        "comments": 234,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/RH6pFf2H86rViFz6QGTSfJvdOmCp04Gl1FdYMaIKT8M.jpg?auto=webp&amp;s=3c999de223cc4d1076a770b2a1f6879c4c95673f"
        },
        "permalink": "/r/movies/comments/1ks5ktf/dwayne_johnson_joins_breakthrough_thriller_at_a24/"
    },
    {
        "id": "1ks7tcy",
        "author": "pico_particle",
        "title": "What movie is better than book?",
        "content": "Usually people love books more. You spend more time with book and connect better with characters and little details. Especially if you read the book first, and you have some expectations of how characters should look and speak. I almost never heard someone recommending me a movie saying that is better than a book. What is your unusual experience?",
        "upvotes": 582,
        "comments": 1582,
        "media": null,
        "permalink": "/r/movies/comments/1ks7tcy/what_movie_is_better_than_book/"
    },
    {
        "id": "1ksfhkj",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Alan Tudyk - Thursday 5/22 at 3:00 PM ET - Actor in 'A Knight's Tale', 'Tucker &amp; Dale vs. Evil', 'Firefly', 'Rogue One', 'Resident Alien', 'Andor', 'Dodgeball', 'Serenity', 'Moana', 'Harley Quinn', 'Frozen II', 'The Trouble With Jessica', and much more.",
        "content": "",
        "upvotes": 178,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gsrb13w8r82f1.png?auto=webp&amp;s=4c0c827d78e39f8fa96374c376ffa6f9122fa116"
        },
        "permalink": "/r/movies/comments/1ksfhkj/amaqa_announcement_alan_tudyk_thursday_522_at_300/"
    },
    {
        "id": "1kst3of",
        "author": "Tifoso89",
        "title": "Burden of Dreams review – on-location account of Werner Herzog’s Fitzcarraldo is a gruelling delight",
        "content": "",
        "upvotes": 15,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4pumJ2SfC3QR-gWTE6UMr8s9NgNlYUDGnGZYlzojLQQ.jpg?auto=webp&amp;s=a27a010040268e59f26627865cd4a5d761b1e227"
        },
        "permalink": "/r/movies/comments/1kst3of/burden_of_dreams_review_onlocation_account_of/"
    },
    {
        "id": "1ksemdf",
        "author": "Odd_Advance_6438",
        "title": "Charlie Hunnam has grown on me a lot. I always like seeing him pop up in things.",
        "content": "I think people have very mixed opinions on him, at least on the internet. I think there’s some movies where he’s pretty stiff, but there’s also a lot where he’s very charismatic, mainly the Gentleman. He does a great job as the straight man compared to all the shenanigans going on in that movie.\n\nAlso while Rebel Moon is a movie that a lot of people dislike, I liked that he was having fun in it, even though he has a super small role",
        "upvotes": 177,
        "comments": 148,
        "media": null,
        "permalink": "/r/movies/comments/1ksemdf/charlie_hunnam_has_grown_on_me_a_lot_i_always/"
    },
    {
        "id": "1ks29ck",
        "author": "NoCulture3505",
        "title": "Michael B. Jordan to Receive American Cinematheque Award",
        "content": "",
        "upvotes": 869,
        "comments": 90,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xbD4LHnx5hpepNvANAHZO5WtZdlpdOS1VmZgS2pnJ4s.jpg?auto=webp&amp;s=0ba40de13e1a7b5f9b870ba126c43f15e1790a37"
        },
        "permalink": "/r/movies/comments/1ks29ck/michael_b_jordan_to_receive_american_cinematheque/"
    },
    {
        "id": "1ksm50y",
        "author": "gsmaciel3",
        "title": "What is your most unhinged movie x show crossover that actually sounds great once you think it over?",
        "content": "E.g.\n\nAlien franchise x White Lotus.\n\nImagine a futuristic resort with the White Lotus brand and usual cast of terrible guests. As the season progresses and drama unfolds, the audience finds out the White Lotus chain is owned by Weylend-Yutani and the resort is a front for one of their research facilities. Add a synth into the cast and a facehugger somewhere in there...\n\n\nWhat do y'all got?",
        "upvotes": 36,
        "comments": 50,
        "media": null,
        "permalink": "/r/movies/comments/1ksm50y/what_is_your_most_unhinged_movie_x_show_crossover/"
    },
    {
        "id": "1kstojl",
        "author": "joesen_one",
        "title": "Neon buys Jafar Panahi's Cannes film 'It Was Just An Accident'",
        "content": "",
        "upvotes": 12,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OID2XepLjG4TGc1zxYUj4omnjtAl_BP92a4MC-IBXvc.jpg?auto=webp&amp;s=b9b4fdc0d1de8e386b315ac1586484b4e2ce9b98"
        },
        "permalink": "/r/movies/comments/1kstojl/neon_buys_jafar_panahis_cannes_film_it_was_just/"
    },
    {
        "id": "1ksfsk1",
        "author": "Oreclocha",
        "title": "Django Unchained",
        "content": "I watch this movie every few years. Is this the best movie ever? I think it is. It genuinely has the best revenge story ever. I don’t know how anyone can watch this movie and not be affected by the message it sends. Also, Leonardo and Samuel Jackson display the best performances ever. This is an amazing performance for both actors. ",
        "upvotes": 119,
        "comments": 165,
        "media": null,
        "permalink": "/r/movies/comments/1ksfsk1/django_unchained/"
    },
    {
        "id": "1ks5uch",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for RZA's 'One Spoon of Chocolate' - An ex-military convict seeks a fresh start in a small town, but his past catches up as he finds love amidst danger and chaos.",
        "content": "",
        "upvotes": 482,
        "comments": 53,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/iemo76nol62f1.jpeg?auto=webp&amp;s=1163587ba0349af3f7723abdb724862b3c078924"
        },
        "permalink": "/r/movies/comments/1ks5uch/official_poster_for_rzas_one_spoon_of_chocolate/"
    },
    {
        "id": "1krtspj",
        "author": "FilmWaffle-FilmForum",
        "title": "What movie has an ending so bleak you’re left feeling empty inside?",
        "content": "There’s plenty of movies with “sad” endings but there’s only a few movies that have made me felt empty. Not necessarily in a sad way, more of a depleted sense. What movies made you feel like this by the end? \n\nFirst one that comes to mind, The Machinist. All of that terror, paranoia and anxiety coming from guilt. Most of the movie is actually a figment of his imagination and then to find out the “supposed” body in the fridge was actually just a fish…. talk about bleak.",
        "upvotes": 2392,
        "comments": 3109,
        "media": null,
        "permalink": "/r/movies/comments/1krtspj/what_movie_has_an_ending_so_bleak_youre_left/"
    },
    {
        "id": "1kryky7",
        "author": "MarvelsGrantMan136",
        "title": "Jordan Peele’s Personal, Never-Before-Seen 35mm Print of ‘Us’ to Screen at Film at Lincoln Center Festival (June 20 - June 26)",
        "content": "",
        "upvotes": 1047,
        "comments": 183,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8oukTP56riBUCYTkXL8vHP5oxTCBKaerJCPbh_oNK4k.jpg?auto=webp&amp;s=ade6c576c7e1bc7cd67f42a409de8d4e1e643f88"
        },
        "permalink": "/r/movies/comments/1kryky7/jordan_peeles_personal_neverbeforeseen_35mm_print/"
    },
    {
        "id": "1kspezb",
        "author": "Blood_And_Thunder6",
        "title": "The Deer Hunter went over my head",
        "content": "Finally watched this film yesterday and I'm not really sure what to make of it. I'm a very casual movie lover so apologies as I'm sure my analysis will be elementary compared to what you all are used to.\n\nThe first part shows community and how tight knit the lads are. The wedding, which is beautifully done, to me, shows how unhinged the characters are going into it. Stanley punching his girlfriend, Michael trying to freak on Nick's girl, Nick being a lunatic, Steven being a virgin?\n\nI really have no idea what the hunt was supposed to show other than Mike is a skilled hunter, but I'm sure there was way more to it.\n\nNow in Vietnam we see that Mike is hardened by war. The lads are involved in Russian roulette, make their escape and get back to safety. \n\nI assume what takes place is Nick finds the only world he can exist in now is at the RR table. He is sending money to Stanley for his love child...maybe? \n\nMike gets back tries to continue on but can't without Nick. They meet, the thing happens and the end. \n\nSo...what is the point? War is hell? The power of friendship? Or am I trying to put something in a box that won't fit?\n\nI understand this is an extremely shorthand summation. I figure if you have the answer you're intimately familiar with the movie and I'm just \neager to hear your answers.\n\nAlso shoutout to the director for capturing Allegheny county. Holy cow is it spot on. \n",
        "upvotes": 15,
        "comments": 37,
        "media": null,
        "permalink": "/r/movies/comments/1kspezb/the_deer_hunter_went_over_my_head/"
    },
    {
        "id": "1ks3thv",
        "author": "JoelAndEliAMA",
        "title": "Hey /r/movies! We're Joel McHale ('Community', 'The Soup', 'Animal Control') and Eli Stern, actor and writer/director of CALIFORNIA KING, a crime-comedy that also stars Jimmy Tatro, Victoria Justice, and Travis Bennett. It's out now on digital. Ask us anything!",
        "content": "Hey /r/movies! We're Joel McHale ('Community', 'The Soup', 'Animal Control') and Eli Stern, actor and writer/director of CALIFORNIA KING, a crime-comedy that also stars Jimmy Tatro, Victoria Justice, and Travis Bennett. It's out now on digital. Ask us anything! \n\nTrailer for our film:\n\n[https://www.youtube.com/watch?v=c6x3AT91-T0&amp;pp=0gcJCdgAo7VqN5tD](https://www.youtube.com/watch?v=c6x3AT91-T0&amp;pp=0gcJCdgAo7VqN5tD)\n\nSynopsis:\n\n  \nPerry, a mattress store manager, hatches a wild plan to impress the girl of his dreams, but his efforts go off the rails when his fake kidnapping of her brother gets more complicated than he expected.\n\n  \nWe'll be back at 5 PM ET today (Wednesday 5/21) to answer questions. Ask us anything!\n\n",
        "upvotes": 438,
        "comments": 397,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jz82yuzb762f1.png?auto=webp&amp;s=322e67b8fa90349973e57f0ecbd4417c30a3e2eb"
        },
        "permalink": "/r/movies/comments/1ks3thv/hey_rmovies_were_joel_mchale_community_the_soup/"
    },
    {
        "id": "1krxdz9",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Reminder - Simon Pegg - Wednesday 5/21 (today) at 10:45 AM ET on /r/movies. Actor in 'Shaun of the Dead', 'Mission Impossible', 'Hot Fuzz', 'Star Trek, 'The World's End', 'Ice Age', 'Star Wars', 'Paul', 'Star Wars', and lots more.",
        "content": "",
        "upvotes": 942,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/sfg5uyl2w42f1.jpeg?auto=webp&amp;s=13d9d4a60a13d57581cbabd0040862c0c3c0ac4a"
        },
        "permalink": "/r/movies/comments/1krxdz9/amaqa_reminder_simon_pegg_wednesday_521_today_at/"
    }
]