[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 5,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1neq61z",
        "author": "leonneon__",
        "title": "🚨MISSING🚨",
        "content": "Have you seen this person after 9am yesterday ? Went out from a police station half naked and never came back. No phone, no money.\nName is Kevin, French, 1m70ish, brown hair brown eyes with tattoos on the neck\nHis family is worried, any help would be welcomed \nThank you reddit please help us find our friend",
        "upvotes": 11,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3keyhqwoxmof1.jpeg?auto=webp&amp;s=8ac46b7b36390d66791b916e42d2a928efc15e0b"
        },
        "permalink": "/r/torino/comments/1neq61z/missing/"
    },
    {
        "id": "1ne5ga7",
        "author": "Independent-Pool6432",
        "title": "Sinner diventa cittadino onorario di Torino",
        "content": "Una decisione presa proprio per celebrare il rapporto che si è creato negli ultimi anni alle Finals, come ha spiegato il sindaco Stefano Lo Russo: *“Jannik è un esempio virtuoso per come interpreta il ruolo di sportivo, perché c'è modo e modo di vincere e c'è modo e modo di perdere. Sinner – ha aggiunto – scende in campo esprimendo una dimensione etica e valoriale che lo avvicina allo spirito torinese”.*  \n[https://www.supertennis.tv/News/Atp/sinner-cittadinanza-onoraria-torino-annuncio](https://www.supertennis.tv/News/Atp/sinner-cittadinanza-onoraria-torino-annuncio)\n\nCome avete preso questa notizia? Io onestamente sono molto contento che abbiano dato la cittadinanza a Sinner. Anche se stiamo parlando solo di una cosa simbolica, è sicuramente un bello spot per la nostra città.\n\n",
        "upvotes": 49,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ian99qu4liof1.jpeg?auto=webp&amp;s=93e44bbc82116105e015585fe56d53308929b5eb"
        },
        "permalink": "/r/torino/comments/1ne5ga7/sinner_diventa_cittadino_onorario_di_torino/"
    },
    {
        "id": "1ne5dkq",
        "author": "ToothPuzzleheaded303",
        "title": "IMPOSSIBILE trovare Appartamenti a TO",
        "content": "Ciao ragazzi, scrivo questo post perché ultimamente sto cercando casa a torino (non per me) ma sembra impossibile trovare qualcosa di umano!!! \n\nAmmetto di essere frustrata: nonostante il budget sia ottimale è letteralmente impossibile trovare qualcosa di decente. Tutto quello che si trova ha prezzi esorbitanti con spese escluse, se capita di trovare qualcosa di decente è sempre fuori torino o in zone non molto raccomandabili.\n\nSto cercando per il mio ragazzo: è uno studente di cybersecurity al politecnico, è laureato in ingegneria informatica e lavora come insegnante. Ha 23 anni, è libanese ed è una persona molto tranquilla e pacata. Sta cercando una camera singola, il suo budget è di 450/500€ tutto incluso e la posizione gli è indifferente. \n\nSapreste suggerirmi dei siti AFFIDABILI, pagine in cui cercare, tip per rendere smart la ricerca ? ",
        "upvotes": 16,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1ne5dkq/impossibile_trovare_appartamenti_a_to/"
    },
    {
        "id": "1nee7fl",
        "author": "Carbonifero-98",
        "title": "Posti dove mangiare per celiaco",
        "content": "Ciao a tutti,\nRiuscireste a consigliarmi posti buoni di qualunque tipo (ristorante,pizzeria ecc) dove portare a mangiare un celiaco?",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1nee7fl/posti_dove_mangiare_per_celiaco/"
    },
    {
        "id": "1nedlxx",
        "author": "Legitimate-Lock-401",
        "title": "Autolavaggio Interni ed esterni",
        "content": "Ciao a tutti,\nmi consigliate un buon autolavaggio che fa interni ed esterni, dove non bisogna prenotare?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nedlxx/autolavaggio_interni_ed_esterni/"
    },
    {
        "id": "1ne2q0v",
        "author": "Electronic_Cry_9770",
        "title": "Mi aiutate a ritrovare questo bar carino con arredi retrò in cui sono capitato a far colazione una volta, durante un lavoro a Torino? Dovrebbe essere vicino alla zona del Baloon",
        "content": "",
        "upvotes": 10,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/f750qnh2qhof1.jpeg?auto=webp&amp;s=e092a11e962bf8ad2393d217dc73b568bd486164"
        },
        "permalink": "/r/torino/comments/1ne2q0v/mi_aiutate_a_ritrovare_questo_bar_carino_con/"
    },
    {
        "id": "1ndkhfp",
        "author": "emotional_illiterate",
        "title": "Thanks for sharing your city!",
        "content": "Amazing architecture, transportation, dining, market, and general feeling when compared to many places in the US. Though that’s probably not a huge surprise. ",
        "upvotes": 123,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1ndkhfp/thanks_for_sharing_your_city/"
    },
    {
        "id": "1nddwfm",
        "author": "ProfessionalIcy306",
        "title": "In principe Oddone ho conosciuto una ragazza",
        "content": "La nostra relazione è durata anni, abbiamo conosciuto le rispettive famiglie, abbiamo deciso di metterne su una nostra... ma lei purtroppo ha avuto un aborto spontaneo e non abbiamo voluto riprovare, abbiamo pianto, riso, combattuto e vinto; ci siamo amati, abbiamo litigato, abbiamo fatto pace e siamo invecchiati insieme. Magari non sempre felici, ma spesso contenti.\n\nPoi finalmente siamo riusciti a imboccare piazza Baldissera, e il nostro rapporto si è estinto come neve al sole.\nMa non dimenticherò mai il tempo trascorso insieme l'uno accanto all'altra ",
        "upvotes": 136,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1nddwfm/in_principe_oddone_ho_conosciuto_una_ragazza/"
    },
    {
        "id": "1ndfgld",
        "author": "M9950",
        "title": "Che incubo passare da piazza baldissera",
        "content": "Buongiorno, qualcuno ha un idea di quanto dureranno i lavori a piazza baldissera? \nAd agosto erano fermi, adesso sembra che hanno iniziato a lavorare pfft ",
        "upvotes": 26,
        "comments": 19,
        "media": null,
        "permalink": "/r/torino/comments/1ndfgld/che_incubo_passare_da_piazza_baldissera/"
    },
    {
        "id": "1nd8jju",
        "author": "happy_arounding15",
        "title": "Libreria Antiquaria \"La casa del Libro\" a Torino, un viaggio nel tempo in cui perdersi tra favole in edizioni originali e vecchie pubblicità. Un posto magico",
        "content": "",
        "upvotes": 26,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1nd8jju/libreria_antiquaria_la_casa_del_libro_a_torino_un/"
    },
    {
        "id": "1ndqwbm",
        "author": "pZELIG",
        "title": "Anyone going mountains this friday?",
        "content": "Hi, my name is Peter, I used to live in Torino for a year and did quite a bit mountain trekking. I am back in the city and I plan to revisit Alps this friday, if someone happens to do the same and would like some company please feel free to get in touch ;) ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ndqwbm/anyone_going_mountains_this_friday/"
    },
    {
        "id": "1ndqnhm",
        "author": "pZELIG",
        "title": "125cc scooter rent",
        "content": "Ciao guys. Does someone know any daily rental of 125cc scooter other than Cooltra? I am looking to get to Gran Paradiso this friday and it seems the easiest way but unlike in other Italian cities I don't see many rental options.\n\nThanks",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1ndqnhm/125cc_scooter_rent/"
    },
    {
        "id": "1ndpcsg",
        "author": "Various-Soup8540",
        "title": "Cerco amici a Torino!",
        "content": "Sono un ragazzo di compagnia e divertente. \nUltimamente mi si sono sfaldate  tutte le amicizie  cerco amici per uscire serate ecc e divertirsi  un po in modo sano!",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1ndpcsg/cerco_amici_a_torino/"
    },
    {
        "id": "1nd9cbm",
        "author": "QuickPersonality9090",
        "title": "Mi hanno invitata a Barriera inoltrata: andare o no?",
        "content": "Ciao a tutti, mi scuso per l'argomento ripetitivo ma mi sono trasferita da poco a Torino e ho sentito a lungo parlare di Barriera. Una mia amica ha preso casa in Barriera inoltrata (più o meno dove c'è l'OST, via Luigi Pietracqua) e mi ha invitata lì la sera. Dovrei andare da sola (io sono in centro) e poi mi accompagnerebbe lei a prendere il bus di ritorno (75/18), dopodiché ci saluteremmo alla fermata.\n\nIo però ho molta paura, perché vengo da un paesino di provincia del profondo sud e non sono per niente abituata a certi ambienti, ho paura di non essere in grado di reagire. \n\nCom'è lì la situazione? È più tranquilla o dovrei evitare?",
        "upvotes": 13,
        "comments": 34,
        "media": null,
        "permalink": "/r/torino/comments/1nd9cbm/mi_hanno_invitata_a_barriera_inoltrata_andare_o_no/"
    },
    {
        "id": "1nco64m",
        "author": "Alien_tiramisu",
        "title": "Antonov An-124 appena atterrato a caselle, l’avete visto?",
        "content": "Questo bestione è appena atterrato a caselle, difficilmente se ne vede uno in tutta la vita considerato che ne esistono ancora circa 50 in TUTTO IL MONDO. L’avete visto atterrare? Sapete perché è qua? L’ultima volta penso che fosse per caricare qualche modulo spaziale",
        "upvotes": 156,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3xa8zi4756of1.jpeg?auto=webp&amp;s=e18ec6c0037092e72df999e0afbdc11e04be39d3"
        },
        "permalink": "/r/torino/comments/1nco64m/antonov_an124_appena_atterrato_a_caselle_lavete/"
    },
    {
        "id": "1ndi8v0",
        "author": "Electrical-Key-446",
        "title": "Hotel For Football Match",
        "content": "Im staying in Turin with my husband for the upcoming games in November and I'm trying to find the safest area to stay in that gives us easy access to the stadium and lets us see the major sights without too much of a hassle. Would you recommend staying within walking distance of the stadium? Is that the kind of area we could catch a taxi/Uber from around 2am, or walk back safely from? Are ubers to and from expensive? Or, are we better off renting our own car and staying in the city? The prices are lower for a 30 minute drive, and we could walk to the major sights easily during the day.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ndi8v0/hotel_for_football_match/"
    },
    {
        "id": "1ndnvmc",
        "author": "No-Ant-9038",
        "title": "🍫 Torino",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ndnvmc/torino/"
    },
    {
        "id": "1ndn5ah",
        "author": "Overall_Task_2783",
        "title": "chi vende scarpe a torino",
        "content": "ciao cerco persone che vendono scarpe a torino, qualsiasi",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1ndn5ah/chi_vende_scarpe_a_torino/"
    },
    {
        "id": "1ndm8bo",
        "author": "Competitive_Pop_2345",
        "title": "Vendere abbonamento Fictative",
        "content": "Ragazzi qualcuno di voi sa (o l’ha già fatto) se si potrebbe vendere l’abbonamento con braccialetto per inutilizzo? So che non è nominativo, per questo mi stavo chiedendo se si poteva venderlo senza avere problemi e ripercussioni.\nHo l’abbonamento valido ancora per 9 mesi.",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1ndm8bo/vendere_abbonamento_fictative/"
    },
    {
        "id": "1ncvihf",
        "author": "abhishekp_c",
        "title": "Antonov beauty just landed in Turin, Italy",
        "content": "",
        "upvotes": 48,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/eWYyeWk0Y2RjNm9mMcvD46ou4ldDuzslMsgahDi62ZUaVvcvm8qDjAZfsEG7.png?auto=webp&amp;s=f56346d2098257b879e6d681236896f07a003768"
        },
        "permalink": "/r/torino/comments/1ncvihf/antonov_beauty_just_landed_in_turin_italy/"
    },
    {
        "id": "1ndimyb",
        "author": "KvotheDeBruyne",
        "title": "Borgata Vittoria",
        "content": "Ciao a tutti,\nSono uno studente del Politecnico e sto cercando una stanza. Ne ho trovata una in Via Chiesa della Salute, nella zona di Borgata Vittoria.\nLa mia preoccupazione principale è la sicurezza, specialmente di sera. È un quartiere sicuro per uno studente?\nQualsiasi informazione che potete darmi sarebbe molto utile. Grazie!",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1ndimyb/borgata_vittoria/"
    },
    {
        "id": "1ndeq9v",
        "author": "Floofs-In-Space",
        "title": "Bike theft?",
        "content": "Hi, \n\nHow bad is bike theft in Turin? I've a used Cannondale that cost 400 euro, and it retailed for about twice that. \n\nI use a Kryptonite U Lock with a cable that I loop through the wheels. I used a similar setup in Boston and LA and didn't have probelms. \n\nOne person told me that theft is worse in the center. \n\nThoughts? In other cities, I liked to use my bike to get around at all hours, even going out at night to shows. \n\nI'm guessing my lock is adequate and that I'm just being paranoid. Just in case, I thought I'd ask. \n\nTIA. ",
        "upvotes": 1,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1ndeq9v/bike_theft/"
    },
    {
        "id": "1nddqvy",
        "author": "Proper_Artichoke_291",
        "title": "PALESTRE TORINO",
        "content": "qualcuno conosce delle palestre di nicchia a torino con equipaggiamenti decenti che non siano technogym o matrix? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1nddqvy/palestre_torino/"
    },
    {
        "id": "1nd97kf",
        "author": "BoredPanda6666",
        "title": "Annunci Solo Affitti",
        "content": "Punto a trasferirmi a Torino entro fine anno e ho iniziato a dare un occhiata agli annunci di immobili in affitto.\n\nSono affidabili gli annunci sul portale solo affitti?\nHo visto che ci sono mono o bi anche sotto i 500€ anche in zone non degradate. Mi dite nomi di quartieri non pericolosi ma con prezzi non da rapina per gli affitti? \n\nAvete esperienza con le agenzie di questo marchio? Quali i costi?\nÈ possibile trovare contratti da 4 anni con possibilità di intestare a me le utenze?\n\nPer il riscaldamento cosa mi consigliate? Io tenderei a escludere immobili con riscaldamento \"condominiale\" ma preferirei quello autonomo per decidere quanto e come risparmiare.\nVenendo da sud non so bene la questione riscaldamento in una città come Torino; per un immobile dai 30 a 50mq che tipo di riscaldamento è funzionale? O dite che devo per forza avere il gas?\n\nGrazie a chi avrà voglia di darmi qualche indicazione! ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nd97kf/annunci_solo_affitti/"
    },
    {
        "id": "1ncf7l1",
        "author": "Background-Chest-717",
        "title": "What are the events in Torino on October ??",
        "content": "",
        "upvotes": 21,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/so689nq494of1.jpeg?auto=webp&amp;s=c28396f605de634f9c06a672eaad7bea5e70624a"
        },
        "permalink": "/r/torino/comments/1ncf7l1/what_are_the_events_in_torino_on_october/"
    },
    {
        "id": "1ncxxp2",
        "author": "Professional_Dog6187",
        "title": "In Torino – anyone up for aperitivo? 🍷",
        "content": "Hi! I’d like to meet new people (girls &amp; boys) in Torino. Anyone up for an aperitivo or a casual hangout this week? 🙂\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ncxxp2/in_torino_anyone_up_for_aperitivo/"
    },
    {
        "id": "1nce7i2",
        "author": "zerozerosettete11",
        "title": "Ciao amici torinesi, a quanto €€€ siete riusciti ad accaparrarvi casa a Torino città? Per quanti metri quadri?",
        "content": "",
        "upvotes": 23,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/myc3x4nyx3of1.jpeg?auto=webp&amp;s=6dfb55dbcf3125ac4f30032879b53109f4b2dce3"
        },
        "permalink": "/r/torino/comments/1nce7i2/ciao_amici_torinesi_a_quanto_siete_riusciti_ad/"
    },
    {
        "id": "1nd29ub",
        "author": "Puzzleheaded_Map9504",
        "title": "cerco conoscenze",
        "content": "vorrei fare conoscenze con ragazze della mia età o anche più grandi io ragazzo 18 anni abito a madonna di campagna ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nd29ub/cerco_conoscenze/"
    },
    {
        "id": "1ncgxj1",
        "author": "Effective_Excuse_667",
        "title": "Corso lecce? Com'è la situazione?",
        "content": "Ciao, vi chiedo l'ennesima consiglio su questa zona di Torino, com'è per viverci per una giovane coppia? Spaccio? Prostituzione?\n\nGrazie in anticipo ",
        "upvotes": 12,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3g5e2nqlp4of1.jpeg?auto=webp&amp;s=c2afbdadbbc74561fd143bb01da400c393b63105"
        },
        "permalink": "/r/torino/comments/1ncgxj1/corso_lecce_comè_la_situazione/"
    },
    {
        "id": "1nca7vm",
        "author": "Tullio_Ostello",
        "title": "Average Torinese riso enjoyer",
        "content": "",
        "upvotes": 36,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qh6uducqn2of1.jpeg?auto=webp&amp;s=5d38e3e605b5e4225073bd981dec6cf94846905d"
        },
        "permalink": "/r/torino/comments/1nca7vm/average_torinese_riso_enjoyer/"
    }
]