[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 472,
        "comments": 250,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1gs1fp1",
        "author": "theboyfromphl",
        "title": "No way this isn’t scripted, right? ",
        "content": "",
        "upvotes": 601,
        "comments": 471,
        "media": null,
        "permalink": "/r/netflix/comments/1gs1fp1/no_way_this_isnt_scripted_right/"
    },
    {
        "id": "1gsc19x",
        "author": "w1n5t0nM1k3y",
        "title": "What resolution are you getting for Tyson VS Paul? I'm at 720p",
        "content": "What resolutions is everyone else getting with the Tyson VS Paul fight? I'm watching on PC with a 1080P monitor and all I get is 720P. I tried with another show (Umbrella Academy) just to see if it was something wrong with my setup and I got 1080p on there. Not sure why the fight is showing in 720p. \n\nIs anybody else having issues or is it just me? You can type Ctrl+Alt+Shift+D to show the stats. look near the middle of the wall of text and it shows\n\nPlaying bitrate (a/v): 128 / 5000 (1280x720)\n",
        "upvotes": 37,
        "comments": 95,
        "media": null,
        "permalink": "/r/netflix/comments/1gsc19x/what_resolution_are_you_getting_for_tyson_vs_paul/"
    },
    {
        "id": "1gscas1",
        "author": "TheDean242",
        "title": "Crap quality for the fight ",
        "content": "Anyone else having this issue? I’m at 720 or worse. I have fiber and no one else is using my internet. I’m guessing the Netflix servers are overloaded. ",
        "upvotes": 34,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1gscas1/crap_quality_for_the_fight/"
    },
    {
        "id": "1gsbccr",
        "author": "Infinite_Scar_2797",
        "title": "Is Netflix Going to Crash?",
        "content": "Random question, but does anything think/has anyone wondered if Netflix is going to have trouble streaming the fight to over 250 million people? According to USA Today, \"Netflix will livestream it to 280 million viewers.\" I can't imagine their servers are prepared for that!",
        "upvotes": 31,
        "comments": 163,
        "media": null,
        "permalink": "/r/netflix/comments/1gsbccr/is_netflix_going_to_crash/"
    },
    {
        "id": "1gsc0hn",
        "author": "Square-Letter-5662",
        "title": "Can’t cast Paul vs. Tyson to chromecast from iPhone?? Help!!",
        "content": "As the title states I can’t cast the live event from my iPhone to my chromecaster! But I can easily chromecast any other thing from Netflix! Other with the same problem? ",
        "upvotes": 15,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1gsc0hn/cant_cast_paul_vs_tyson_to_chromecast_from_iphone/"
    },
    {
        "id": "1gsbro2",
        "author": "CertainPersimmon778",
        "title": "Second time this week, I can't get onto Netflix. The first outage lasted 30 hours.",
        "content": "Watching Cobra Kai, 6 season, part 2 through my Netflix tv subscription.\n\nWatched the first ep of 5 in the morning, no problem.\n\nStart watching ep 7 after dinner, can't pause or rewind. Make the mistake to put away perishables from dinner at the episode break, can't get the next ep started. Fiddle with the system with no luck. Tried for more than 45 minutes to get into Netflix, can't.\n\nSo bloody frustrating. Terrible customer service.\n\n  \nBTW, I live in Boston.",
        "upvotes": 8,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1gsbro2/second_time_this_week_i_cant_get_onto_netflix_the/"
    },
    {
        "id": "1gsc986",
        "author": "rhythmwrecker",
        "title": "Paul vs tyson not available",
        "content": "the live feed isnt showing up. on my smart tv it doesnt show up as live yet just show reminder. On iphone it says its live but tells me its not available in your area. and on my mac it doesnt show up at all? im east coast us. anyone else having this issue?",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1gsc986/paul_vs_tyson_not_available/"
    },
    {
        "id": "1gscer9",
        "author": "CurrentLeather6751",
        "title": "Fight buffering",
        "content": "Everyone was saying there wouldn’t be issues, and clearly they’re happening. The main fight is going to be so much worse. This is what happens when you monopolize a stream and only let one platform stream a giant event. ",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gscer9/fight_buffering/"
    },
    {
        "id": "1gsc497",
        "author": "Itchy-Ad1005",
        "title": "Live event streaming Tyson fight",
        "content": "My TV in the family room is getting old and as of the 10th of this month the app no longer works.  Tried to stream from the app on my phone via Chromecast and it wouldn't let me.  It works fine on the phone and tablet.  Any work around?   I'm watching on a different TV.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gsc497/live_event_streaming_tyson_fight/"
    },
    {
        "id": "1gs857s",
        "author": "StatusEdge905",
        "title": "Why is Mike Tyson vs Jake Paul not on the Netflix home page?",
        "content": "Am I tripping? So if someone goes on Netflix that doesn't know it's happening, they just won't know it's happening because it's not on the front page. That's odd to make the decision to not promote it on netflix even though it's Netflix exclusive.",
        "upvotes": 3,
        "comments": 186,
        "media": null,
        "permalink": "/r/netflix/comments/1gs857s/why_is_mike_tyson_vs_jake_paul_not_on_the_netflix/"
    },
    {
        "id": "1gs9j1m",
        "author": "NateTheGreat3824",
        "title": "why can't i stream netflix to my smart tv?",
        "content": "my phone and tv are connected to the same internet it has worked in the past (about 2 months ago) now it won't i've restarted both the Netflix app and my tv",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1gs9j1m/why_cant_i_stream_netflix_to_my_smart_tv/"
    },
    {
        "id": "1gs88ny",
        "author": "DancingDrammer",
        "title": "The Final Table - Cookbook?",
        "content": "I only recently discovered The Final Table. I think it might be one of my most favourite cooking competition shows ever. I’m fascinated by the chefs and their talent and I absolutely love that there are examples cuisines from all over the world. Am I the only sucker that would buy a cookbook from The Final Table?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gs88ny/the_final_table_cookbook/"
    },
    {
        "id": "1grxdgm",
        "author": "KakoiKagakusha",
        "title": "\"Hot Frosty\" (2024) | Movie Discussion",
        "content": "It feels like **\"Hot Frosty\"** officially kicked off Netflix's *pseudo-Hallmark Christmas Movies* onslaught this year.  It's kind of a high-concept rom-com Christmas movie, basically \"what if *Frosty the Snowman* happened for a widower + Frosty is mad chiseled?\".\n\nOverall, I can't say I enjoyed it as much as I thought I would, so if you haven't seen it yet, temper your expectations.  Easily, Dustin Milligan is the standout.  I always liked him from Schitt's Creek, but he was just great in this role, balancing sweet/fish-out-of-water with sincere while pulling off the comedy aspects.  His interaction with Joe Lo Truglio was maybe my favorite part of the movie (probably tied with the 'pushing the woman's car' bit while shirtless + following scenes with the ladies friends were up there).\n\nMy biggest issue with the movie is unfortunately Lacey Chabert (as \"Kathy\").  I'll be honest, I haven't watched most of her Hallmark releases, but here, I just found her to be a surprisingly weak lead for what was a decently stacked cast.  The major problem is that for a movie called \"Hot Frosty\", I didn't feel any *heat* between Kathy and \"Jack\" (the snowman come to life).  Their lack of chemistry really sunk what could have been a much stronger rom-com (*see* **Nobody Wants This** for an example of rom-com leads with both romantic and comedic chemistry).  As a result, I found that my favorite parts of the movie were all scenes *without* her and I was never rooting for them to get together.\n\nNot as big a problem, but I really didn't like what they did for Craig Robinson as the antagonist sheriff.  He just came off as way too unlikable and not all that funny.  I think the character could have been written in a different way to still fulfill that role, but in a funnier/more enjoyable way.\n\nOn the other end of things, it took me a second to recognize Lauren Holly (I don't think I've seen her in much since the *Dumb and Dumber* days).  I was hoping for a reveal that &gt;!her husband also started out as a snowman!&lt;, but that never happened.  It's still my head-canon though.\n\nWhat we got was still enjoyable to a degree, but can't help feeling like this was a missed opportunity.  That said, I'm a 40+ dude, so not sure I'm the target audience haha.  Next on the list, hoping Lindsay Lohan's upcoming **\"Our Little Secret\"** ends up being a lot more fun!",
        "upvotes": 8,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1grxdgm/hot_frosty_2024_movie_discussion/"
    },
    {
        "id": "1gsbp6n",
        "author": "MisawaAB",
        "title": "It looks like you already have an account. Sorry, we can't find an account with this email address.",
        "content": "If I try to sign up it tells me I already have an account, if I try to login it tells me it cant find an account with that email address.... And my actual netflix account on another email address, the password isnt working and the emails arent going to the mailbox, spam, nor trash...",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gsbp6n/it_looks_like_you_already_have_an_account_sorry/"
    },
    {
        "id": "1gsbg9y",
        "author": "BeautifulBroccoli_27",
        "title": "Upper Middle Bogan is hilarious ",
        "content": "What do y’all think of this show?? It was just released on Netflix but started in 2013. I’m watching it alone so I have no gauge for how good it is without another opinion ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gsbg9y/upper_middle_bogan_is_hilarious/"
    },
    {
        "id": "1gsbdm4",
        "author": "ssj2preston",
        "title": "Added New Member but when I transferred there profile it reset ?",
        "content": "Could someone help me please, so tonight I added another member to my Netflix account the 7.99 option (Canada). So it was for my sister, under my profile I had her data and account. When I went to send her an invite there was an option to select her account or use an existing one, but she just accepted the invite, logged in and her account algorith was reset ? Any way to get her old profile and data back ??",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1gsbdm4/added_new_member_but_when_i_transferred_there/"
    },
    {
        "id": "1gruz9u",
        "author": "2ForEachofYou",
        "title": "How come my Chromebook allowed me to use Netlflix while traveling but my wife's Chromebook did not work?",
        "content": "Wife and I are out of town.  I've never used my Chromebook before to watch Netflix.  Today I went to [netflix.com](http://netflix.com) on my browser, entered my username &amp; password and was able to stream shows right away, no strings attached and no hoops whatsoever. When my wife tried the same it did not work because when she went to [netflix.com](http://netflix.com) it informed here that her Chromebook is outdated.  So we downloaded the Netflix app on her Chromebook.  We were able to sign in. but after signing in it said \"your device isn't part of the netflix household for this account.\"  My question is why did she get that message but I didn't?  Is this a browser vs app thing, and if so, what's the reasoning behind it?  ",
        "upvotes": 11,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1gruz9u/how_come_my_chromebook_allowed_me_to_use_netlflix/"
    },
    {
        "id": "1gsb9df",
        "author": "Finishfed-itover55",
        "title": "Tyson ",
        "content": "I hope this live event goes better than the Love Is Blind live event they had.  If anyone remembers that one you have already started worrying.  It was a disaster and I’m sure fight fans won’t let Netflix live it down.\n\nHopefully Netflix is ready for this one.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gsb9df/tyson/"
    },
    {
        "id": "1grw3mv",
        "author": "celestialsexgoddess",
        "title": "My Netflix sub-account is on my ex-husband's family plan. How do I renew the Netflix subscription, keep my sub-account but not pay for everyone else on the plan?",
        "content": "What the title says. I have a sub-account on my ex's family plan where I've saved all my watch list and watch history. I want to keep my sub-account. But I also want to \"divorce\" my sub-account from my ex's family plan, which he may or may not want to continue. How do I do this?",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1grw3mv/my_netflix_subaccount_is_on_my_exhusbands_family/"
    },
    {
        "id": "1gsadtr",
        "author": "greyfeather9",
        "title": "I guess I'll sub to netflix for the first time ever because I want to send a message for Arcane.",
        "content": "Uhm, or should I buy Arcane digitally, if that's possible?   I'm more concerned with funding the party losing money in the production(Riot?). Do they get a cut off people subbing for Arcane?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gsadtr/i_guess_ill_sub_to_netflix_for_the_first_time/"
    },
    {
        "id": "1gs9y8e",
        "author": "Firm_Bad7094",
        "title": "Trying to sign into my account and it says finish \"sign up\" and trys to make me buy a new plan ",
        "content": "Im trying to sign into netflix on my tv to watch the Mike Tyson and jake paul fight but I literally cannot get in I'm signed in perfect fine on my other tv and laptop and phone but I cant sign in on my ps5 or tv.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gs9y8e/trying_to_sign_into_my_account_and_it_says_finish/"
    },
    {
        "id": "1gs7anj",
        "author": "dmbjay",
        "title": "UHD 4K - Tyson/Paul Fight",
        "content": "Hey folks!  I’m on the cheapest plan that’s only 1080p.. I’ve googled and googled but no luck, does anyone know if the fight will be shot in 4K?  I’d upgrade my plan if that was the case (just for this month).  Thanks!",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1gs7anj/uhd_4k_tysonpaul_fight/"
    },
    {
        "id": "1gs6xru",
        "author": "cracken69_high",
        "title": "1080p vs 4K HDR???",
        "content": "Hi!\n\nTonight there is a fight happening between legendary Mike Tyson and Jake Paul. I am in the process of creating an account, but there is NOWHERE to be found information in what quality it will be streamed, and I need to make a choice if I buy a 1080p or 4K HDR plan?\n\nDoes anyone know or have watched any live events streamed on Netflix to confirm for me what is the max quality they stream live events at? Thanks!\n\nUPDATE1: I am waiting on a live chat to talk with an agent about it. I will post an official update.\n\nUPDATE2: Netflix Support Agent has confirmed the fight will be streamed in 4K. ",
        "upvotes": 0,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1gs6xru/1080p_vs_4k_hdr/"
    },
    {
        "id": "1gry94w",
        "author": "PuzzleheadedAd4153",
        "title": "Best true crime shows? ",
        "content": "I came up with a list of the best true crime shows of all time and would like other suggestions in addition to these: [https://gamerant.com/best-true-crime-shows-series/](https://gamerant.com/best-true-crime-shows-series/) :) ",
        "upvotes": 4,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1gry94w/best_true_crime_shows/"
    },
    {
        "id": "1gs5per",
        "author": "JelleV1996",
        "title": "Rewatch live event",
        "content": "So about tonights fight on Netflix.\nIt will be broadcast at night here in the netherlands at a time we usually sleep.\nWill you be able to rewatch it in the morning on Netflix already? Or does it take time for them to post the fight to rewatch it? Cause i want to watch it the moment i wake up without having anything spoiled",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1gs5per/rewatch_live_event/"
    },
    {
        "id": "1gs8r7d",
        "author": "Specialist_Lawyer530",
        "title": "When will Netflix release 2160p for Android tablets?",
        "content": "I’ve just bought an Honor Magicpad 2 and watching Netflix, Prime and Disney+ in Full HD is just ok. \n\nIf I stream a YouTube video at 2160p it looks absolutely stunning. \n\nWhen will all these big companies (Disney+, Prime, Netflix etc) improve the quality of their streams on tablets to 2160p? It’s unbelievable in 2024, YouTube has done it for years. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gs8r7d/when_will_netflix_release_2160p_for_android/"
    },
    {
        "id": "1gsami4",
        "author": "Iamcoolmonkeyman",
        "title": "How do I watch live streamed Netflix events?",
        "content": "Hi everyone I'm curious about how I can watched live Netflix events because I have never done this before I'm Looking to watch (Jake Paul vs Mike Tyson) any serious help is appreciated thank you!",
        "upvotes": 0,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1gsami4/how_do_i_watch_live_streamed_netflix_events/"
    },
    {
        "id": "1gr6sha",
        "author": "peoplemagazine",
        "title": "Squid Game Creator Says He Lost '8 or 9' Teeth from 'Stress' of First Season but Season 2 Is Even More Taxing",
        "content": "",
        "upvotes": 133,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1gr6sha/squid_game_creator_says_he_lost_8_or_9_teeth_from/"
    },
    {
        "id": "1gs0nf6",
        "author": "Bananalando",
        "title": "Preview for multiple anime titles are in English, but when I try to watch, only Japanese audio is available - Canada",
        "content": "This is happening on a variety of shows, but not all of them.\n\nJust now, I tried to watch One Punch Man and no English audio was available but the teaser was in English. Multiple devices are affected (I.e. my android phone and a Chromecast). \n\nI verified that English and English (UK) are the only languages selected in my profile.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gs0nf6/preview_for_multiple_anime_titles_are_in_english/"
    },
    {
        "id": "1gs8r9e",
        "author": "GigaMuffin01",
        "title": "Can't join prelims?",
        "content": "The preliminary fight for Paul vs Tyson was supposed to start 5:30PM EST, but that was 5 minutes ago and I'm unable to watch the fight. Anyone else able to join it? \n\nEDIT: Found this on a crappy news site \"The preliminary card begins tonight (November 15) at 5:30 p.m. ET on Tudum, the Netflix Sports YouTube page, and the Most Valuable Promotions’ YouTube page.\"\nSo basically, gotta go to YouTube for some ridiculous reason.",
        "upvotes": 0,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1gs8r9e/cant_join_prelims/"
    }
]