[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 491,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1i2s8o0",
        "author": "CautionCurb",
        "title": "Black bars showing on side even though tv is correct size.",
        "content": "Tried finding something in the settings to adjust aspect ratio but couldn't find anything. Does anyone know how to get rid of the black bars on the side? I'm literally using a tv that would fit the exact size of the show.",
        "upvotes": 909,
        "comments": 229,
        "media": null,
        "permalink": "/r/netflix/comments/1i2s8o0/black_bars_showing_on_side_even_though_tv_is/"
    },
    {
        "id": "1i3azrl",
        "author": "th3_pund1t",
        "title": "Netflix donating $10M towards LA wildfire relief",
        "content": "",
        "upvotes": 22,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i3azrl/netflix_donating_10m_towards_la_wildfire_relief/"
    },
    {
        "id": "1i3bpgb",
        "author": "Whobitmyname",
        "title": "Adam McKay Says ‘Don’t Look Up’ Was ‘Hated’ by ‘Critics and Cultural Gatekeepers’ but Seen by an Estimated ‘400 Million to Half a Billion’ People on Netflix",
        "content": "",
        "upvotes": 18,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1i3bpgb/adam_mckay_says_dont_look_up_was_hated_by_critics/"
    },
    {
        "id": "1i2mvd3",
        "author": "Legitimate_Ad3625",
        "title": "Squid Game Season 2's Thanos Star Breaks His Silence On Casting Backlash In First Major Interview",
        "content": "",
        "upvotes": 685,
        "comments": 131,
        "media": null,
        "permalink": "/r/netflix/comments/1i2mvd3/squid_game_season_2s_thanos_star_breaks_his/"
    },
    {
        "id": "1i3bxpg",
        "author": "Robemilak",
        "title": "Interstellar got an epic billboard to promote its release on Netflix",
        "content": "",
        "upvotes": 11,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/l8a16rg6mide1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1i3bxpg/interstellar_got_an_epic_billboard_to_promote_its/"
    },
    {
        "id": "1i2sabw",
        "author": "misana123",
        "title": "'You' Season 5: April 24 Release Date Set on Netflix for Final Episodes",
        "content": "",
        "upvotes": 92,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1i2sabw/you_season_5_april_24_release_date_set_on_netflix/"
    },
    {
        "id": "1i2negv",
        "author": "peoplemagazine",
        "title": "'Ms. Rachel' to Launch Worldwide on Netflix, with More Episodes Later This Year",
        "content": "",
        "upvotes": 181,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1i2negv/ms_rachel_to_launch_worldwide_on_netflix_with/"
    },
    {
        "id": "1i37a90",
        "author": "IRLthereisnoalgebra",
        "title": "Help me make a Harlan Coben mini-series drinking game",
        "content": "After watching (what feels like) literally every worthwhile show on every streaming network I have, I decided to give a few Harlan Coben joints a try. So far, I've seen \"Fool Me Once\", \"The Five\", \"Missing You\", and \"Safe.\"\n\nBased on what I've seen so far, these are the Harlan Coben drinking game rules I've compiled.\n\nDrink every time:\n\n* A character with a mid-level salary somehow lives in a house out of Architectural Digest\n* A character is sold to the audience as \"menacing\" almost entirely via the use of a dark hoodie\n* The main character, who we're supposed to root for, does something that they should definitely be arrested for (but they totally aren't)\n* The main character calls in a friend with convenient mystery-solving skills (hacking, phone tracking, military database access)\n* An actor from AB Fab or Coronation Street pops up\n* An actor whose previous experience is only in soap opera makes that fact very obvious\n* A teenage character uses slang that was clearly written by a middle-aged script writer\n\nFinish your drink when:\n\n* You finally realize that a side plot you thought was key to the main mystery is going nowhere\n* You accept that the burning question you were hoping would get answered will forever be a plot hole\n* You find yourself wondering what kind of blackmail HC has on Richard Armitage",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1i37a90/help_me_make_a_harlan_coben_miniseries_drinking/"
    },
    {
        "id": "1i2qzr0",
        "author": "Brilliant_Leg_4950",
        "title": "Netflix hs been recomeding DEXTER for me and now i see why.",
        "content": "I have been watching shows like house,breaking bad and the watcher. Dexter is like all of those shows mashed up together and now it is my favourite show. I totally recomed it!",
        "upvotes": 64,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1i2qzr0/netflix_hs_been_recomeding_dexter_for_me_and_now/"
    },
    {
        "id": "1i37r28",
        "author": "missylyssy3210",
        "title": "Back in action:  review of cameron diaz first movie back!",
        "content": "Cameron diaz is back!",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1i37r28/back_in_action_review_of_cameron_diaz_first_movie/"
    },
    {
        "id": "1i2o4d2",
        "author": "odd_coin",
        "title": "I just finished watching XO, kitty season 2",
        "content": "As mentioned in the title, I just finished watching it, and I’d say it was worth the wait.kind of. If you haven’t seen the series yet I suggest skipping this  to avoid spoilers\n\nThat said, I’m a bit disappointed. This season focused heavily on homosexual relationships. I’m not saying that’s bad, but most of us want to see the main character’s love story, not a side character creating drama in everyone else’s love lives. The story was supposed to center around Kitty discovering more about her mom, which was why she went to KISS in the first place\n\nOn top of that, making Kitty bisexual felt like a misstep. It shifted the focus away from the original premise, leading to unnecessary fights and breakups that dominated the screen time. If you’ve seen the show, you’ll notice that more than half of the relationships are homosexual. It felt like the series lost sight of Kitty’s journey and the charm of the original story\n\nWhat I did enjoy, however, was Kitty finding new love. I genuinely thought she’d end up with the same person(Dae) from season 1, so that twist was refreshing. And seeing Margot and Peter from To All the Boys was so relieving(?) honestly, that was the main reason I watched this season\n\nOverall, I feel like the story doesn’t completely wrap up, leaving me hoping for another season to tie up loose ends\n\n",
        "upvotes": 59,
        "comments": 107,
        "media": null,
        "permalink": "/r/netflix/comments/1i2o4d2/i_just_finished_watching_xo_kitty_season_2/"
    },
    {
        "id": "1i2ah9e",
        "author": "SignatureLabel",
        "title": "It is criminal that Mindhunter did not get a 3rd season.",
        "content": "Absolutely criminal. I’m aware of the cost of making the show and the low viewership at the beginning but now there is no reason not to make one season and finish up what I consider to be Netflix’s best show by a long shot.",
        "upvotes": 689,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1i2ah9e/it_is_criminal_that_mindhunter_did_not_get_a_3rd/"
    },
    {
        "id": "1i3c0xc",
        "author": "ms_1102",
        "title": "At least there will be a s3 of XO, Kitty",
        "content": "I’m glad they left it on a clear cliffhanger for a third season, it is a shame it will be about two years again. I think this was a brilliant season and has to be one of the best things I’ve watched in a while. And what better way to keep you hanging with Kitty &amp; Min Ho! \n\nWhat was everybody else’s thoughts? I also like how they had a lot of different storylines and situations going on between each character. It made it a lot less boring than a lot of other series like these. I’m waiting for the next season of my life with the Walter boys for instance. That can’t change very much though like this did!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i3c0xc/at_least_there_will_be_a_s3_of_xo_kitty/"
    },
    {
        "id": "1i3aoe1",
        "author": "Horror_Effective12",
        "title": "'Public Disorder' S1 Review - A controversial but dark horse that takes you by surprise",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i3aoe1/public_disorder_s1_review_a_controversial_but/"
    },
    {
        "id": "1i39i9d",
        "author": "SBdrtobe",
        "title": "Min Ho x Kitty &lt;3 XO Kitty Season 2",
        "content": "OMGGGGGGG the slow burnnnnn!!! OMGGGGG the scenes with Min HO, the Chemistry, OMGGGG!!!! These two are end game. The way they looked out for one another and supported each other so much gave life partners. OMG they are so cute together. No kiss...it sucks but lord did ya'll feel the chemistry or was it just me?? Season 3, when are you coming because wow. He is her Peter Kavinsky. The way he calls her Covey, the way he saved her from making a fool out of herself to help her with her grandma, their dance, the hot tub scene, and them breathing each others air lol. The way they looked at each other wowoowowowow!!! They really did listen to their audience after season 1 and said let's give them the slow burn. MinHo sees through Kitty and loves her for her, and Kitty loves MinHo for who he is as well. The beauty shines from within is so true in this love and friendship thing they have going. I love them together. Peter Kavinsky guest appearance was so cute and the grandma family story is so touching too. Not MinHO being jealous of Pete like he likes to call him lol!!! They would be perfect brother in laws too!! I can't deal, I think they are both so cute! I loveeee &lt;3 Can't wait for season 3!! &lt;3 ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i39i9d/min_ho_x_kitty_3_xo_kitty_season_2/"
    },
    {
        "id": "1i39e73",
        "author": "aryamanpage7",
        "title": "Help with my Project",
        "content": "Hey! 😊\n\nI’m working on my final-year project to design a new OTT platform, and I’d love your input!\n\nPlease take this 2-minute survey to share your thoughts:\n🔗 https://forms.gle/Bw8wAYV3FvRFnGBSA\n\nYour feedback will help me create something amazing. Thanks so much—feel free to share it too! 🙌",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1i39e73/help_with_my_project/"
    },
    {
        "id": "1i38md8",
        "author": "Alarming-Package-557",
        "title": "Casting netflix from phone to laptop",
        "content": "Like the title says I'm looking for ways to cast a netflix show from my phone to my laptop. I have a premium account and No, I can't just stream it from my laptop because I don't have a reliable long term internet connection. No, I don't have an hdmi cable. No, I don't want to watch it on my phone because  I have been dying to watch this show since a second season was announced and it deserves a bigger screen than my phone. \n\nSo does anyone have any idea?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i38md8/casting_netflix_from_phone_to_laptop/"
    },
    {
        "id": "1i293jx",
        "author": "AdmirableOx",
        "title": "American Primeval feels like watching \"The Revenant\"",
        "content": "Randomly stumbled upon this show and wow. This had no bussiness being THAT GOOD. The Revenant is my all time favorite movie and the way this is shot instantly reminds me of the movie. \n\n10/10 for me!! Finally a great show I really enjoy watching!",
        "upvotes": 282,
        "comments": 93,
        "media": null,
        "permalink": "/r/netflix/comments/1i293jx/american_primeval_feels_like_watching_the_revenant/"
    },
    {
        "id": "1i2k7uh",
        "author": "Pogrebnik",
        "title": "'Fear Street: Prom Queen' Gets an \"R\" Rating - Coming To Netflix This Year",
        "content": "",
        "upvotes": 42,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i2k7uh/fear_street_prom_queen_gets_an_r_rating_coming_to/"
    },
    {
        "id": "1i2r7ma",
        "author": "LauraEats",
        "title": "Surviving Black Hawk Down premieres February 10 - The real story that inspired Ridley Scott’s 'Black Hawk Down,' as told by those who survived. \n\n",
        "content": "",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i2r7ma/surviving_black_hawk_down_premieres_february_10/"
    },
    {
        "id": "1i2sy5r",
        "author": "SoftPois0n",
        "title": "YOU: Season 5 | Date Announcement | Show Countdown Begins | Netflix",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i2sy5r/you_season_5_date_announcement_show_countdown/"
    },
    {
        "id": "1i34749",
        "author": "Adventurous_Band2417",
        "title": "Gen Z and nostalgic shows/movies",
        "content": "Hi everyone! I’m conducting academic research on the intersection of Gen Z and nostalgic viewing patterns on U.S. streaming platforms. If you watch older content on streaming platforms and identify as Gen Z, I’d appreciate it if you fill out the survey!! Thank you in advance 😊\n\n[https://qualtricsxmxxlc44m2h.qualtrics.com/jfe/form/SV\\_5jOkXdcWHvjgEdw](https://qualtricsxmxxlc44m2h.qualtrics.com/jfe/form/SV_5jOkXdcWHvjgEdw)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i34749/gen_z_and_nostalgic_showsmovies/"
    },
    {
        "id": "1i2q604",
        "author": "isthisagoodusername9",
        "title": "For those that can't watch Netflix in 4K and Dolby Vision in their Windows PCs",
        "content": "This is an informative post and update for those that watch Netflix on their Windows PCs. I'm writing this update since I've saw there were few other people experiencing this.\nPrecisely two weeks ago I discovered, out of the blue, that I wasn't able to watch Netflix in 4K/Dolby Vision anymore but only in 1080p SDR at max. After a lot of tampering and reinstalling drivers, apps and extensions (DV would always work outside of netflix) I've finally found the culprit: the current versions of Microsoft Edge.\nStrangely enough, DV/4K streaming are broken and don't seem to work in my system when using the normal version of Edge or the Netflix app (which is not a standalone app anymore but a wrapped version of the Netflix page in the browser).\n\n*Using Edge Dev (which is a stable development version) everything works as intended.* \n\nSo for the time being, I'd suggest to download that version and watch Netflix there. The Netflix app can only use the normal one but it's a workaround in the meantime that it will be updated. \n\nI hope this post of mine can help someone, ofc I dunno if my case can be applied to anyone but it's something at least, especially considering that Netflix/Microsoft customer supports were not useful to say the least. Cheers",
        "upvotes": 8,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1i2q604/for_those_that_cant_watch_netflix_in_4k_and_dolby/"
    },
    {
        "id": "1i2j7qr",
        "author": "Robemilak",
        "title": "'Bloodhounds' Season 2 Is Coming: Woo Do-hwan and Lee Sang-yi Are Back, Jung Ji-hoon Joins the Cast",
        "content": "",
        "upvotes": 22,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1i2j7qr/bloodhounds_season_2_is_coming_woo_dohwan_and_lee/"
    },
    {
        "id": "1i266c2",
        "author": "DavidC_is_me",
        "title": "The fires in the Netflix \"Fireplace For Your Home\" footage are awful.",
        "content": "They're so badly built only half the logs burn properly and it is the most frustrating thing because you want to rearrange it or at least take a poker to it.\n\nI mean the whole point of the whole thing is just a fire. One job. Build a decent fucking fire.\n\nBut nooooooo. Build a shit fire and none of the crew ever notice that it's a shit fire. Assuming any of them stand aloft and have opposable thumbs, any one of them should be able to build a better fire than that.",
        "upvotes": 143,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1i266c2/the_fires_in_the_netflix_fireplace_for_your_home/"
    },
    {
        "id": "1i2gder",
        "author": "RiverLongjumping3823",
        "title": "Lucas neff in American primeval ",
        "content": "Does anyone else appreciate Lucas neff in the show? Watched this man in raising hope and now he’s killing it in American primeval as the captain. He really did a good job honestly didnt expect that from him. But I’m happy he got the role he nailed it on the dot. ",
        "upvotes": 28,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i2gder/lucas_neff_in_american_primeval/"
    },
    {
        "id": "1i2mt2h",
        "author": "sensesalt",
        "title": "HERE starring Robin Wright and Tom Hanks arrives on Netflix US on January 30th",
        "content": "",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1i2mt2h/here_starring_robin_wright_and_tom_hanks_arrives/"
    },
    {
        "id": "1i2m3z6",
        "author": "Firm_Pause_4542",
        "title": "XO Kitty Season 2, this just keeps getting worse ",
        "content": "Is it just me or like every character in XO kitty S2 is just so weird, no character development and to be honest very tedius to watch... The only reason I kept watching cuz I just wanted to know how they even end it but alas I failed, it's just bad...like the plot just doesn't make any more sense and they kind of just keep adding more weak plot twists that do not make any difference. Also what is happening in that school?? could they have not shown a few classes atleast happening like just for a second or two, the school in this series is more useless than the school in the Riverdale series and we all know that was just bad. I just wanna know am I the only one who feels this way and also those who watched the season 2 completely, can you guys just lemme know what happens in the end????? ",
        "upvotes": 8,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1i2m3z6/xo_kitty_season_2_this_just_keeps_getting_worse/"
    },
    {
        "id": "1i3099i",
        "author": "StephenHunterUK",
        "title": "\"Missing You\" reaches #19 in the UK-wide viewing charts for its opening week",
        "content": "[https://www.barb.co.uk/viewing-data/most-viewed-programmes/](https://www.barb.co.uk/viewing-data/most-viewed-programmes/)\n\n\"Missing Programme\" would be the 4 January edition of *The Masked Singer*. Clearly a fault in their system.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i3099i/missing_you_reaches_19_in_the_ukwide_viewing/"
    },
    {
        "id": "1i27a50",
        "author": "footballersabroad",
        "title": "Netflix viewership overtakes BBC One for first time",
        "content": "",
        "upvotes": 84,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1i27a50/netflix_viewership_overtakes_bbc_one_for_first/"
    }
]