[
    {
        "id": "1p5e4zn",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 21,
        "comments": 4576,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p5e4zn/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1p909sf",
        "author": "Bunchdawg",
        "title": "If the The KEY was a person.. TAA",
        "content": "I honestly believe one of the main reason Liv and Salah are terrible right now, is that they are missing Trent. He makes the game easy for everyone on the pitch. We have young guys like Carreras and Dean, but they have some ways to go. Trent is already on a star level and I’m excited to see what he’ll turn Franco into.  ",
        "upvotes": 881,
        "comments": 69,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/isonap45614g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1p909sf/if_the_the_key_was_a_person_taa/"
    },
    {
        "id": "1p9aapo",
        "author": "EndouShuuya",
        "title": "Fran Garcia scoring a great goal in training (Xabi Alonso could put him in to play).",
        "content": "",
        "upvotes": 107,
        "comments": 15,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/b8wfklxw634g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1p9aapo/fran_garcia_scoring_a_great_goal_in_training_xabi/"
    },
    {
        "id": "1p92qig",
        "author": "Ineedhelpistaken",
        "title": "No player has created more chances in the UCL this season than Kylian Mbappé",
        "content": "",
        "upvotes": 223,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hzyecoz9n14g1.png?auto=webp&amp;s=7bfb5aabd8378f743680608586f7270167d8c7eb"
        },
        "permalink": "/r/realmadrid/comments/1p92qig/no_player_has_created_more_chances_in_the_ucl/"
    },
    {
        "id": "1p8xr7p",
        "author": "o6ohunter",
        "title": "This guy has been terrorizing Europe for the past 4 years by the way",
        "content": "",
        "upvotes": 350,
        "comments": 58,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7llbm0plo04g1.jpeg?auto=webp&amp;s=6f12d6e708e71df53899bb47b22466ab66a2e016"
        },
        "permalink": "/r/realmadrid/comments/1p8xr7p/this_guy_has_been_terrorizing_europe_for_the_past/"
    },
    {
        "id": "1p93pyq",
        "author": "ContributionAway1010",
        "title": "Hi guys, I drew you Ronaldo Nazarío",
        "content": "",
        "upvotes": 157,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/btq6pij8u14g1.jpeg?auto=webp&amp;s=4cbcf6162edee794bbf3733ddb51d1471432b3c5"
        },
        "permalink": "/r/realmadrid/comments/1p93pyq/hi_guys_i_drew_you_ronaldo_nazarío/"
    },
    {
        "id": "1p8mx28",
        "author": "vil727",
        "title": "Champions League heritage.",
        "content": "",
        "upvotes": 1945,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/yp2uozzppx3g1.jpeg?auto=webp&amp;s=4e65c01bcbe5cd8155b27362acd088ecdec0ccfb"
        },
        "permalink": "/r/realmadrid/comments/1p8mx28/champions_league_heritage/"
    },
    {
        "id": "1p8yth6",
        "author": "TheFeatherDiaries",
        "title": "DID YOU KNOW? Mesut Ozil holds the record for Most Assists in a Single Season for Real Madrid with 28 assists in 2010-11.",
        "content": "",
        "upvotes": 144,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/l21n3icrv04g1.png?auto=webp&amp;s=96913cbe0a2b4dd8960a56f784e4e031bf339b46"
        },
        "permalink": "/r/realmadrid/comments/1p8yth6/did_you_know_mesut_ozil_holds_the_record_for_most/"
    },
    {
        "id": "1p985id",
        "author": "Special_Virus851",
        "title": "Should Nico Paz Join?",
        "content": "He gave a goal contribution again today,but I think it's not going to be a great decision bringing him back and here are the reasons behind me thinking so.\n\n1)We can get 80m for him if he continues these performances\n\n2)He is platformed very well in Como,here we'd be asking him to play 8 or RW at times\n\n3)He is not top in 10 pressers in Como\n\n4)Here he won't be getting playtime he'd get in Como or any other team wanting to sign him.\n\n5)Our best player in Castilla this season is also a 10\n\n6)Serie A is a very slow low intensity league,so he gets more time to make decisions on the ball\n\n7)We basically have 5 no.10s(Jude,Arda,Franco,Rodrygo,Brahim) already\n\nI love him and think he is a special player but he should only come here if he misses the bench or prefers not fulfilling his potential.Also,XA will prefer superstars instead of Castilla players.We have seen how Gonzalo cant even start vs Kairat/Olympiacos",
        "upvotes": 36,
        "comments": 42,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p985id/should_nico_paz_join/"
    },
    {
        "id": "1p8pl3a",
        "author": "landofphi",
        "title": "[David Ornstein] Real Madrid inform Liverpool they have no intention of signing Ibrahima Konate",
        "content": "",
        "upvotes": 428,
        "comments": 102,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/AoFoBp-0o3xe8By4WV_-Q6qiKfaF7tlpZRpOodYxke0.jpeg?auto=webp&amp;s=7c89604820f45cfb6a1c2601c096f263a10c83e7"
        },
        "permalink": "/r/realmadrid/comments/1p8pl3a/david_ornstein_real_madrid_inform_liverpool_they/"
    },
    {
        "id": "1p8ymsm",
        "author": "Pale-Boysenberry1719",
        "title": "La Liga is getting less competitive in Europe",
        "content": "I didn't want to give in to the EPL glazing, but here I am. From 12/13 to 19/20 we were ranked as the top league in Europe, now we're third (worst in the database history!). Here are my thoughts on some teams\n\n4th and 5th teams in UCL (anyone who isn't Real, Barca or Atletico)\n- this season Bilbao sits at 26th, Villarreal at 34th\n- last season we had Girona at 33th\n- obviously we had Villarreal surprising us in 21/22, but overall there were 3 teams from La Liga in UCL quarterfinals in the last 15 years (also Sevilla in 17/18 and Malaga in 12/13, both losing)\n- Sevilla and Villarreal got hit hard by La Liga FFP rules\n\nAtletico\n- since 15/16 final and 16/17 semis they never made it through quarterfinals\n- didn't get near the league title since 20/21\n- seem stuck despite spending big last season\n- still beat us heavily this season\n\nBarcelona\n- since Messi left they've played with Adama Traore and Braithwaithe\n- then they got some 35 year olds and a bunch of kids from academia\n- won just as many league, cup and supercup titles as us\n- easy draw helped them in UCL last year, but they're still ranked as 9th in Europe\n\nFinally Real Madrid\n- the most valuable squad in the world\n- going toe to toe with the worst Barcelona in years\n- squad getting gradually messier (heh) ever since Ronaldo left\n- miracle UCL titles in 21/22 and 23/24 make it seem like we're in control \n\nEPL currently has the best PR, insane ticket prices and a bunch of clubs that might get it right every season. Then there's PSG and Bayern and obviously some upsets every year\n\nAs Barca, or more drastically United have proved major clubs don't go bankrupt, but I fear that if nothing changes soon we'll be fighting for those \"upset spots\". Thoughts?",
        "upvotes": 61,
        "comments": 48,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p8ymsm/la_liga_is_getting_less_competitive_in_europe/"
    },
    {
        "id": "1p8vf7d",
        "author": "Plane_Outside5646",
        "title": "Our CB situation for next year.",
        "content": "So with all the rumours about Real Madrid looking at free-agent centre-backs, I’ve been trying to make sense of the situation. The three main names linked were Konaté, Guehi, and Upamecano. And honestly, after watching them and looking at their profiles, I feel like we have to be careful with our choices here.\n\nKonaté was initially the most hyped option, but now multiple reports say Madrid aren’t going to pursue him. And honestly, I get it. Injuries and inconsistency  make it a risky investment.\n\nMarc Guehi is a player I genuinely like. He’s calm, strong, good on the ball. But let’s be real — Madrid are suffering badly in aerial duels lately, especially defending crosses and long balls. Guehi is not elite aerially, and if we’re rebuilding the defensive line, we can’t afford to bring someone who doesn’t fix one of our biggest weaknesses. And let’s not pretend he’ll be cheap. High wages + average aerial presence = a questionable fit.\n\nUpamecano is another player I love on his day. Good ball carrier, very aggressive, insanely athletic. But again, he’s mostly an RCB. We already have a world-class RCB in Éder Militão. There is no point stacking two elite RCBs while leaving the LCB role incomplete. If Madrid are building for trophies now, the priority should be signing a world-class left-footed LCB. Upamecano is great, but he doesn’t solve the positional puzzle.\n\nDean Huijsen is a generational talent in my eyes. But he’s 20. He shouldn’t be carrying the defence yet, and he shouldn’t have pressure dumped on him. Let him grow, let him play as a rotational option behind two elite CBs. We’ve already seen him get shaky in big matches — which is normal for a kid. Throwing him in as a starter is how you ruin a career. He should be learning from the best, not replacing them.\n\n\n---\n\nAnd this brings me to the one player that ticks every single box:\nNico Schlotterbeck.\n\n\n• Left-footed CB (a rare profile)\n• Elite in the air (71%+ aerial win rate, high 90th percentile)\n• Elite ball progression (progressive passes + carries both 90th+ percentile)\n• Strong defender (top-tier interceptions, clearances, duels)\n• Age 25 — perfect mix of experience + long-term value\n• Plays for a big club already, used to pressure\n• Available — either for a reasonable fee now or free next year\n• Top clubs already circling — Barca, Liverpool, others\n\nJust watching his play style and seeing Bastoni comparisons makes sense. And honestly, in many defensive metrics, Schlotterbeck is better. Bastoni isn’t leaving Inter, and even if he did, the price would be insane. Saliba renewed. Gvardiol impossible. The list of elite, attainable LCBs is shockingly small — and Schlotterbeck is one of the very few who checks every box.\n\nWhat I love most is how complete he is. He’s not just a “ball-playing” defender. He’s not just “good in the air.” He’s one of the most well-rounded CBs in Europe, and the data backs it. Whether it’s aerial duels, clearances, progressive passes, defensive duels, interceptions — he’s near the top in almost everything. Add his physical profile, confidence, and left foot, and he becomes the exact partner Militão needs.\n\nAnd unlike other targets, he’s attainable right now. That’s why I don’t want Madrid to “wait for a free transfer.” Because the longer we wait, the more clubs will scrap for him. Barca already want him. Liverpool already want him. If we sit still, we’ll lose him.\n\nIn short a back 4 of \n\nCarrerras schlotterbeck militao trent\n\nIs nothing short of world class.",
        "upvotes": 83,
        "comments": 55,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p8vf7d/our_cb_situation_for_next_year/"
    },
    {
        "id": "1p8tjp2",
        "author": "Plane_Outside5646",
        "title": "CHEMA - OUR FUTURE MIDFIELD MAESTRO",
        "content": "Such a rare profile that we needs so badly.\nHe is a fucking prospect who is going to be a superstar MIDFIELDER for many years .\n\n\nChema Andrés is rapidly emerging as one of Europe’s most exciting young midfield prospects, and the combination of his physical qualities, tactical intelligence, and elite defensive output suggests he could develop into a superstar within the next few years. What makes him stand out at just 20 years old is how complete and mature his playing profile already looks.\n\nFirst, Chema’s defensive metrics are elite even when compared to top-five-league midfielders. He ranks 1st in aerial duels, 1st in aerial duels won, 1st in interceptions, and 1st in possession-adjusted interceptions, which is almost unheard of for a player so young. His ability to win the ball both on the ground and in the air gives him a rare “ball-winning dynamo” profile. In modern football, where controlling transitions is everything, this alone makes him extremely valuable.\n\nBut what elevates him beyond being just a destroyer is his quality on the ball. He ranks 1st in pass completion into the penalty area, showing composure and vision under pressure. While he’s not a pure dribbler or ball carrier yet, his forward passing, progressive passing, and ability to retain possession show a player who reads the game like a seasoned deep-lying midfielder. Scouts describe him as a “touch magnet” — a player who wants the ball in tight spaces and makes the game flow.\n\nChema also covers huge amounts of space defensively. His heat maps and radar charts show a player who reads danger early, steps into passing lanes, and filters opposition attacks before they develop. This combination of positional discipline, anticipation, and physical dominance is exactly what defines top-level modern No. 6s like Rodri, Casemiro, and Declan Rice. Analysts calling him a “baby Rodri” isn't hype — the profile really is that similar.\n\nMost importantly, Chema's ceiling is enormous because he’s already performing at elite levels with very few senior minutes. Young midfielders usually struggle with positioning, timing, and decision-making, but Chema already looks like a finished product defensively. With more experience, improved ball-carrying, and tactical refinement, he has every tool to become a world-class anchor midfielder.\n\nIf he continues on his current trajectory — and especially if he returns to a possession-dominant team like Real Madrid — Chema Andrés could become one of Europe’s most dominant midfielders within a couple of years.",
        "upvotes": 93,
        "comments": 62,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p8tjp2/chema_our_future_midfield_maestro/"
    },
    {
        "id": "1p88ait",
        "author": "Ready_Ad_1353",
        "title": "Mbappé shuts down reporter when asked if Madrid is overly dependent on him to win games: “You shouldn’t say that. I think that’s a bad question, with all due respect. I don’t think there’s any kind of dependence. Without the other players we don’t win games. Everyone has a role in the team”",
        "content": "",
        "upvotes": 1180,
        "comments": 53,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YlpNshjKcwmR4PYOUHtHHhzKt_vDn3p4kBQfiPqAYF4.png?auto=webp&amp;s=7a9b1679066c0422d7450d64aa1375b6caa1b7e8"
        },
        "permalink": "/r/realmadrid/comments/1p88ait/mbappé_shuts_down_reporter_when_asked_if_madrid/"
    },
    {
        "id": "1p8ddts",
        "author": "IstanbulisLacivert",
        "title": "This is accurate asf",
        "content": "",
        "upvotes": 483,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qlnae2mr8v3g1.jpeg?auto=webp&amp;s=6222f262966a9d41e471cb821a5ebe1307bf2b2a"
        },
        "permalink": "/r/realmadrid/comments/1p8ddts/this_is_accurate_asf/"
    },
    {
        "id": "1p85tyz",
        "author": "o6ohunter",
        "title": "Vinicius Junior goes level with Karim Benzema for all-time UCL assists. Next up? Cristiano Ronaldo.",
        "content": "",
        "upvotes": 776,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/l1cec5d1pt3g1.jpeg?auto=webp&amp;s=6fd679e7fe9cdb61910cc087c9d54eda93d7a0b1"
        },
        "permalink": "/r/realmadrid/comments/1p85tyz/vinicius_junior_goes_level_with_karim_benzema_for/"
    },
    {
        "id": "1p8epgv",
        "author": "No-Independent2522",
        "title": "Toni Kroos received Germany’s prestigious Knight’s Cross of the Order of Merit at the Bernabéu today",
        "content": "Kroos: “The Bernabéu seems like the perfect place to receive this award.”\n\n“It means a lot because it’s an award that’s not just for football, and it’s the biggest thing you can receive in Germany,” our legend added on Realmadrid TV.\n\nToni Kroos spoke to Realmadrid TV after receiving the Knight's Cross of the Order of Merit of the Federal Republic of Germany. The Real Madrid legend expressed his pride: “I'm very happy. I've received several awards in my career, but this is the highest honor you can receive in Germany. And if it's also for the Foundation, where we help sick children and their families, this award means a great deal.”\n\n\"I knew Florentino Pérez\nand the German president would be there , but I didn't know my former teammates would be there. Not even Antonio (Rüdiger), who is a very good friend, told me. It was a surprise , and it makes me happy to know that I had good teammates and good people.\"\n\nReturning home\n“When they told me the event was going to be at the  Bernabéu  , I was very happy, because it seems like the perfect place to receive this Order. It has been my home for 10 years and I feel it will always be my home. I always enjoy being in this stadium.”\n\nHis spectacular farewell at the Bernabéu\n: “The whole day was spectacular. Weeks before, I'd already said I wanted a farewell at the Bernabéu when we had nothing left to play for, and that we should finally be champions so I could enjoy it. That's exactly what happened, and from the moment I left home until I returned, I enjoyed it. What they prepared for me, the affection of the fans, my teammates, the president, the coach… It was special.”",
        "upvotes": 198,
        "comments": 7,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p8epgv/toni_kroos_received_germanys_prestigious_knights/"
    },
    {
        "id": "1p822og",
        "author": "cyrusmancub",
        "title": "Fede’s statement on the drama surrounding the team in the last week",
        "content": "“After a week in which a lot of things were said about us, we are now more united than ever.\n\nHaving Vini and Mbappé in the team is luck, but playing with the best team in the world and a committed group is a great honor.\n\nOn a personal level, I'm working to return to my best level. The coach has always been by my side, supporting me and doing everything he can to help me continue to develop and help the team.\n\nIt's not always easy, but the technical staff and the players are more united than ever.” 🤍",
        "upvotes": 434,
        "comments": 58,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zqzzlw97ws3g1.jpeg?auto=webp&amp;s=05bcaf0d0424c3a094c1291660ad9ee484073c9c"
        },
        "permalink": "/r/realmadrid/comments/1p822og/fedes_statement_on_the_drama_surrounding_the_team/"
    },
    {
        "id": "1p7w71f",
        "author": "Quirky_Appearance539",
        "title": "Even Mesut didn't have this much of an assist fetish",
        "content": "Jokes apart Guler is a top tier creator no doubts on that",
        "upvotes": 921,
        "comments": 78,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/liuh2tds5r3g1.jpeg?auto=webp&amp;s=8ee7b1fcc8bdf46ee384d7fd77310fb1d7dd0081"
        },
        "permalink": "/r/realmadrid/comments/1p7w71f/even_mesut_didnt_have_this_much_of_an_assist/"
    },
    {
        "id": "1p7xtpy",
        "author": "landofphi",
        "title": "Luka Modric: \"Staying at Real Madrid for 13 years. From 27 to almost 40, that's incredible. It's a club that doesn't tolerate mediocrity. When I arrived, I thought it would be great if I stayed for 6 years. I thought careers lasted until 34. Not only have I surpassed that, I'm still at that level\"",
        "content": "**On AC Milan**\n\n\"I always said that after Real Madrid everything is a step down, everyone can confirm that. But I think I've joined a club that is very close to Real Madrid in terms of reputation and history. It was an ideal situation for me.\n\nWhen the Milan option appeared, I knew that was it. I stayed at a high level. The Italian league is one of the most competitive in Europe, it is not easy to play. But ot was an easy choice for me. Especially because of the approach of the people and the club.\"\n\n**On his departure from Real Madrid**\n\n\"Leaving Real Madrid wasn't easy, I spent half my life there. That was one of the best periods of my life. I arrived quite late, at 27, but I was ready for that leap. Four years in England helped me a lot. Everything after that seems unreal to me, what I achieved.\n\nIf someone had said to me: \"Write what you would be happy with at Real Madrid\", I would have been afraid to write everything I achieved later. Trophies and victories are aside, but staying at a club like that for 13 years... From 27 to almost 40, that's something incredible.\n\nWe know what Madrid is like, a club that doesn't tolerate mediocrity. Staying at a club like that for so many years is the most incredible thing. When I arrived, I thought it would be great if I stayed for five or six years. I thought careers lasted until 33–34. Not only have I surpassed that, I'm still at that level.\"\n\n\"Staying at Real Madrid was really my big wish, it wasn't just platitudes or flattery to the fans. Sometimes some wishes don't come true. Even though my wish to retire in Madrid didn't come true, I achieved some things I never thought I would. I don't regret anything. I never expected this in my wildest dreams.\n\n\"The love of the fans, the club and all the people connected to the club remains forever. I have no words to thank them for that treatment. It was like that from day one. Even though I had difficulties at the beginning, I felt the love and affection of the fans. They felt that I was the one. That gave me the motivation to give back to them in the best way.\"",
        "upvotes": 587,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/u3osJ2AtKjZ5ho1yVncB41cGSFFiyh81Q3wlrQ14wwg.jpeg?auto=webp&amp;s=2dade70bbd8c02832842f7a9f552d9b3cf8ad50b"
        },
        "permalink": "/r/realmadrid/comments/1p7xtpy/luka_modric_staying_at_real_madrid_for_13_years/"
    },
    {
        "id": "1p84748",
        "author": "94Temimi",
        "title": "Real Madrid's goalscorers so far this season",
        "content": "Mbappe has been simply unstoppable this season. The gap is huge, and as much as it's great seeing him be in such an amazing form, it's also a warning for the team that we need our other forwards to start contributing more.\n\nIt's been such a weird period since El Classico with lots of yapping from the media, which, even though it's mostly nonsense, it would still affect the team. So, hopefully with the wave of comments from the players and Xabi after yesterday's match about sticking together and focusing on helping each other, this would bring the team back on track and we resume the upwards momentum we've built up to our match against Barcelona.\n\nThere are things to fix, but as long as the board is supportive of Xabi and the players are fully bought into this new era, we're going to be a very competitive team and we've seen it earlier in the season, we just need that aggression back and we should be good! ",
        "upvotes": 196,
        "comments": 81,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jbusbi3pbt3g1.png?auto=webp&amp;s=4faa298fff7b2435cc089684ea8bab33d4faa3c4"
        },
        "permalink": "/r/realmadrid/comments/1p84748/real_madrids_goalscorers_so_far_this_season/"
    },
    {
        "id": "1p7kuc3",
        "author": "thorof11",
        "title": "What does bro need to do to get a 10💀",
        "content": "",
        "upvotes": 3369,
        "comments": 162,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/08ih3acobo3g1.jpeg?auto=webp&amp;s=b58ddcd05342e80b86c96fd11880a33340ae32dc"
        },
        "permalink": "/r/realmadrid/comments/1p7kuc3/what_does_bro_need_to_do_to_get_a_10/"
    },
    {
        "id": "1p83m96",
        "author": "More-Judgment-9253",
        "title": "Camavinga vs Olympiacos",
        "content": "According to some people here he's not good enough even though he's only had one bad game this season when he has playing on the RW lol. Nobody in our midfield is as press resistant as him and his ball carrying is great along with his tackles which are also the best out of our midfielders ( very close with tchouameni), and his long passes are also top tier. If only he wasn't so injury prone though😔",
        "upvotes": 153,
        "comments": 18,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6rfbw4zl7t3g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1p83m96/camavinga_vs_olympiacos/"
    },
    {
        "id": "1p8cc7q",
        "author": "TheSayou",
        "title": "The head-to-head archive between Real Madrid and Girona",
        "content": "",
        "upvotes": 43,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3k2tkzi61v3g1.png?auto=webp&amp;s=ece57eb0300120e8c7318a0d57bc61ed82ec2021"
        },
        "permalink": "/r/realmadrid/comments/1p8cc7q/the_headtohead_archive_between_real_madrid_and/"
    },
    {
        "id": "1p7rdct",
        "author": "SaniaXazel",
        "title": "Alternative angle of the Vini assist to Mbappe and Celebration",
        "content": "",
        "upvotes": 1043,
        "comments": 32,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/3kvs68p6up3g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1p7rdct/alternative_angle_of_the_vini_assist_to_mbappe/"
    },
    {
        "id": "1p8ae68",
        "author": "Bunchdawg",
        "title": "All of our goals came from fast paced transition yesterday",
        "content": "I understand the team wants to play more possession-based football, but we also need to mix things up and lean into our strengths. We have some of the fastest attackers who can take on defenders all day, yet it’s difficult for them to thrive when opposing backlines are already set. To maximize their impact, our pressing should adjust, starting lower around midfield to create space for runs in behind.\n\nWe’re fortunate to have the best shot-stopper, and once our backline is fully healthy, defending should become more stable. Right now, though, we lack creativity in midfield. Honestly, when was the last time we scored a truly beautiful team goal, like Olymp’s opener against us?",
        "upvotes": 45,
        "comments": 18,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p8ae68/all_of_our_goals_came_from_fast_paced_transition/"
    },
    {
        "id": "1p86ts8",
        "author": "o6ohunter",
        "title": "Our fanbase after a result is way too hilarious",
        "content": "We get a positive result and here’s the media:\n“Talks of a heated and divided dressing room are heavily exaggerated. The players remain in FULL backing of Xabi, with no infighting. The coach has made a recent effort to bond with the players that was VERY well received.”\n\nThe media after a loss:\n“Despite recent form, Vinicius STALLS renewal talks INSISTING that he is the top paid on the team, demanding more than Cristiano Ronaldo. Up next? Will Jude Bellingham have to be SOLD in order to accommodate Guler and is Valverde becoming a LIABILITY to the squad?!?”",
        "upvotes": 63,
        "comments": 17,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p86ts8/our_fanbase_after_a_result_is_way_too_hilarious/"
    },
    {
        "id": "1p7wtrn",
        "author": "SaniaXazel",
        "title": "Yesterday, Raúl Asencio's grandfather passed away and yet today he played with Real Madrid. Rest in peace, and strength to Raúl",
        "content": "",
        "upvotes": 289,
        "comments": 10,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p7wtrn/yesterday_raúl_asencios_grandfather_passed_away/"
    },
    {
        "id": "1p8dpud",
        "author": "Fit_Wrap_9580",
        "title": "Why is Joan Martinez not getting the call up to 1st team?",
        "content": "https://preview.redd.it/f7shlomgcv3g1.png?width=418&amp;format=png&amp;auto=webp&amp;s=752ca1256c0488bd23921b5dd22ebec0f81d5140\n\nI support Xabi till the end, but I don't understand why Xabi is not calling Joan Martinez to the 1st eleven, dude played really well in 1st team call up before his ACL injury. People were hyping him as the next Sergio Ramos.\n\nIs it because they don't want him to have another injury or does it have anything to do with Arbeloa?",
        "upvotes": 18,
        "comments": 22,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p8dpud/why_is_joan_martinez_not_getting_the_call_up_to/"
    },
    {
        "id": "1p7il24",
        "author": "shakhthe",
        "title": "Mbappe scores a HEADER and makes it 1v2. Olympiacos vs RM",
        "content": "Yeah, Mbappe is scoring headers. Nice",
        "upvotes": 1345,
        "comments": 61,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2iyjd4rfvn3g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1p7il24/mbappe_scores_a_header_and_makes_it_1v2/"
    }
]