[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 491,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1hwn7w1",
        "author": "S4v1r1enCh0r4k",
        "title": " New Jerry Springer docuseries discovers some shocking stuff about the show, some of which we could already assume, apparently the producers went as far as to blackmail poor guests if they thought about not showing up for the final show panel ",
        "content": "",
        "upvotes": 137,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1hwn7w1/new_jerry_springer_docuseries_discovers_some/"
    },
    {
        "id": "1hwh37q",
        "author": "Robemilak",
        "title": "‘Squid Game’ Season 2 earns 126.2M views from its first 11 days on Netflix. Faster than any series ever on the platform.\n",
        "content": "",
        "upvotes": 67,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1hwh37q/squid_game_season_2_earns_1262m_views_from_its/"
    },
    {
        "id": "1hwtq3m",
        "author": "Frensisca-",
        "title": "Non-murder documentaries ",
        "content": "I would like to watch non-murder true crime documentaries, such as fraudulent, scam. financial, medical crimes etc also political scandals. I appreciate your recommendations.",
        "upvotes": 9,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hwtq3m/nonmurder_documentaries/"
    },
    {
        "id": "1hwqxuk",
        "author": "Alternative-Earth325",
        "title": "Squid Game, Alice in Borderland, The 8 Show. What’s your favorite and why?",
        "content": "Which is the standout among the survival dramas *Squid Game*, *Alice in Borderland*, and *The 8 Show*? \n\n*Squid Game* offers a poignant look at desperation with its deadly childhood games, becoming a global phenomenon due to its storytelling and character arcs. \n\n*Alice in Borderland* combines sci-fi with survival, setting its narrative in a deserted Tokyo with an intriguing card game twist, noted for its visual appeal and plot twists. \n\n*The 8 Show* examines human psychology within a grim reality show, tackling themes of greed and morality with a touch of dark humor. \n\nConsidering their unique elements - from social critique to innovative game concepts - which do you believe excels in narrative depth, character development, and cultural impact? Share your thoughts on these compelling series.",
        "upvotes": 9,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1hwqxuk/squid_game_alice_in_borderland_the_8_show_whats/"
    },
    {
        "id": "1hwx4ia",
        "author": "WaveyJB",
        "title": "Which 3 series?",
        "content": "If you could only watch 3 series on repeat for the rest of your life, which three are you picking? Need some inspiration, can’t find anything that pulls me in from the trailers!",
        "upvotes": 5,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1hwx4ia/which_3_series/"
    },
    {
        "id": "1hvlmba",
        "author": "EthanWilliams_TG",
        "title": "Watch Hulk Hogan Get Booed by Fans During WWE's Netflix Debut",
        "content": "",
        "upvotes": 3287,
        "comments": 403,
        "media": null,
        "permalink": "/r/netflix/comments/1hvlmba/watch_hulk_hogan_get_booed_by_fans_during_wwes/"
    },
    {
        "id": "1hwp5oq",
        "author": "blondeboss101",
        "title": "Shows/Movies that are originally in spanish?",
        "content": "I am trying to learn Spanish and I've heard one of the best ways to learn is to watch with subtitles. So far I have watched Narcos and Soy Georgina. Any other suggestions? Thanks in advance! ",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hwp5oq/showsmovies_that_are_originally_in_spanish/"
    },
    {
        "id": "1hx0v4r",
        "author": "TinyBoiMinecraft",
        "title": "How do I make it So Netflix doesn't remember what I watch?",
        "content": "I FIGURED IT OUT THIS IS A CLOSED POST\n\n\n\n\nI want to be able to watch something, but I don't want it to say that I've watched it before. Is there a way to remove it from my watch history, or is there a way to make it so Netflix doesn't remember that I watched it?",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1hx0v4r/how_do_i_make_it_so_netflix_doesnt_remember_what/"
    },
    {
        "id": "1hwkzv9",
        "author": "S4v1r1enCh0r4k",
        "title": "New teaser for Mo Season 2 just dropped",
        "content": "",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hwkzv9/new_teaser_for_mo_season_2_just_dropped/"
    },
    {
        "id": "1hwzs31",
        "author": "_Vacation_mode_",
        "title": "Cannot transfer profile back into main account",
        "content": "My daughter moved back in with us. Contacted Netflix about transferring her profile back into the main account and saving the $8 sub-account fee. Nope, can't do it. Only recourse is to delete her sub-account and let her start over on the main account. Not very user friendly. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hwzs31/cannot_transfer_profile_back_into_main_account/"
    },
    {
        "id": "1hwhkek",
        "author": "Pogrebnik",
        "title": "Netflix's Top 10 Most Watched Movies of All Time: Some New Arrivals Made The Cut",
        "content": "",
        "upvotes": 11,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hwhkek/netflixs_top_10_most_watched_movies_of_all_time/"
    },
    {
        "id": "1hwnbva",
        "author": "Atlast_2091",
        "title": "Prison Cell 211 | Official Trailer | Netflix",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hwnbva/prison_cell_211_official_trailer_netflix/"
    },
    {
        "id": "1hx1bm5",
        "author": "HorrorRoutine349",
        "title": "Netflix handpicking what you can watch in the Raw archive.",
        "content": "Seriously why make an agreement with WWE if you are just going to dog all the fans and handpick what is watchable from the archive. You couldn't just let Peacock keep the archive o no Netflix has to get it's grubby hands on all of Raw and then pick and choose what fans can watch from the past.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hx1bm5/netflix_handpicking_what_you_can_watch_in_the_raw/"
    },
    {
        "id": "1hw2xuq",
        "author": "Ill_Dependent1389",
        "title": "Love these BTS Squid Game 2 🫰",
        "content": "",
        "upvotes": 68,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hw2xuq/love_these_bts_squid_game_2/"
    },
    {
        "id": "1hwlwtb",
        "author": "jilldxasd35",
        "title": "Transferring profile ",
        "content": "Transferring profile\n\nTwo separate households, ip addresses. \n\nI had been logging in and watching a few minutes of something while at household 1’s (my dad) house once a week and still watching at household 2’s (my) house. Every so often we both would get the message about adding an account but could still watch. \n\nThough we decided to add me onto my dad’s account. He enabled profile transfers instantly. I entered in an email to be invited but never received an email. Later I did get a text, my dad must have done something. \n\nI tried to do a profile transfer while on his account at his house but it needed an existing account. \n\nI clicked the link in the text and created an account. \n\nNow when I get on his account at his house to transfer a profile it brings up this page after I have used my log in. What does this mean, and how can I get a profile to transfer? When I log in to Netflix with my account info I don’t have any of my old profile, nothings been transferred. \n\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hwlwtb/transferring_profile/"
    },
    {
        "id": "1hwqyts",
        "author": "matthewjn",
        "title": "Peak content from Netflix if you dislike the Shaman and like the song that plays during Mingle in Squid Game Season 2.",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hwqyts/peak_content_from_netflix_if_you_dislike_the/"
    },
    {
        "id": "1hwktiw",
        "author": "Flimsy_Task_3540",
        "title": "Surveys about  Hometown Chachacha and Physical 100",
        "content": "Hi! I'm a university student in Italy, I'm graduating in arts management. My research is focused on the succes and impact of Physical 100 and Hometown Chachacha, I've prepared a survey for each show and I'll link them below for anyone Interested. Thanks for the support !   \nHometown Chachacha : [https://docs.google.com/forms/d/e/1FAIpQLSeMxXggNbtOcFxHGhp\\_66581NIxUl6HV6Syq7eP\\_eF1upC7xA/viewform?usp=sf\\_link](https://docs.google.com/forms/d/e/1FAIpQLSeMxXggNbtOcFxHGhp_66581NIxUl6HV6Syq7eP_eF1upC7xA/viewform?usp=sf_link)\n\nPhysical 100 : [https://docs.google.com/forms/d/e/1FAIpQLSfS-c-ZAJCKJ1sW6357SOQigivCTyMkH1C-beDKNTivMbcgcQ/viewform?usp=sf\\_link](https://docs.google.com/forms/d/e/1FAIpQLSfS-c-ZAJCKJ1sW6357SOQigivCTyMkH1C-beDKNTivMbcgcQ/viewform?usp=sf_link)",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hwktiw/surveys_about_hometown_chachacha_and_physical_100/"
    },
    {
        "id": "1hwch45",
        "author": "amandaasous",
        "title": "Netflix “set household” can’t stream while traveling for work",
        "content": "I read an old post when searching for this subject but my situation is different from most of the replies and the post itself. I’ve contacted Netflix support twice today and a few other times in the past about this dumb household limitations. You can only request a vacation code in advance and only a few times a year. I travel for work often and Netflix ALWAYS force closes every minute in all  hotels. At first I thought it was Marriott hotels all having shitty TVs but finally caught onto the pattern that it is a NETFLIX issue. Prime and Max work perfectly fine in all my hotels. But I cannot use Netflix in my hotel rooms while my husband uses it at home. (I pay for more than 1 screen btw.) even if my husband is not at home and I log out of every single device and only log into my mobile phone and the hotel tv, Netflix still force closes every minute on the tv. There’s no option to update household on the TV Netflix. It just doesn’t exist. Does ANYONE have anything they’ve done that has helped with this or advice? Do I just cancel Netflix atp?\n\nTL;DR Netflix “set household” isn’t an option on my hotel tv, I cannot stream Netflix while I travel for work, and I travel often. Any tips/advice?",
        "upvotes": 8,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1hwch45/netflix_set_household_cant_stream_while_traveling/"
    },
    {
        "id": "1hvtr13",
        "author": "anonymous-user1234",
        "title": "Why wasn't Steve Wilkos brought up on Netflix Jerry Springer documentary?",
        "content": "Title says it all. Just finished the Netlix documentary and not sure why such an integral aspect and figurehead of the show wasn't mentioned once. Weird. ",
        "upvotes": 85,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1hvtr13/why_wasnt_steve_wilkos_brought_up_on_netflix/"
    },
    {
        "id": "1hwz3i1",
        "author": "metallicandroses",
        "title": "Just finished S1 Squid Game, why is this so good?",
        "content": "### Squid Game\nIve put off watchin' this squid game show partly because i thought it was just like a show within a show, like *faces of death*, netflix, one after the other. Its actually like a real show w/ real characters, and not even really about what i thought (or what anyone would think probably) Its so good, so much so i dont know what to compare it to, as its unlike anything korean or japanese, but its also not entirely american either. I mean its spoken in korean, so that much makes it korean. But the cinematography and everything else is so good. The special effects are the classic korean/japanese horror, like the walking dead but better, is how i would classify their film/and camera effects. They specialize in that, but this show is like, the best of everything, all in one, and not really like anything else....\n\nSo my question is, who created this show? Or what is going on with the writers, artists, directors/producers etc. (actors, choreographers, special effects teams, etc) that have culminated into, what has become, this riveting squid game, which is almost like, a mystery/thriller—disguised as a game- Its like, Squid-Island, the Mystery that keeps Unrolling.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hwz3i1/just_finished_s1_squid_game_why_is_this_so_good/"
    },
    {
        "id": "1hwlrsj",
        "author": "PimlicoPotluck",
        "title": "Having trouble pausing",
        "content": "Previously, if you clicked anywhere on the screen or pressed space, netflix would pause, but that no longer happens. Now i need to click the pause button in the bottom left and its really triggering.\n\nanybody else having this issue?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hwlrsj/having_trouble_pausing/"
    },
    {
        "id": "1hwqhhn",
        "author": "PIVAG07",
        "title": "Carry On does not make sense to me",
        "content": "don’t get me wrong, I was intrigued at first by the movie but I can’t help not understanding some things. \n\nFirstly how can The Traveler (Jason Bateman) have a gun with him? as soon as the plot develops we can see that Ethan and the Traveler meet in the airport toilet and he particularly has a sort of transparent gun; how is it possible that this gun can even exist in the part of the terminal after security checks? \n\nLet’s just say that somehow he did not go through the security checks yet, how is it possible that in one of the last scenes, when he goes in the cargo bay to stop Ethan, how can he have, again, a gun (different one, black)?\n\nIn a scene of the film we can see that the Traveler has a backpack in which he has stored essentially a parachute and a anti-gas mask. Again, how did no one question why he was boarding with these particular items, I mean i think this must be a valid reason to be questioned.\n\nIf we suppose he somehow found a way to sneak his backpack without the X-Ray scan, couldn’t they do the same exact thing for the luggage with the bomb?\n\nLastly, how can the FAA not ground every plane departing from LAX when it was declared a threat at the airport?",
        "upvotes": 0,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1hwqhhn/carry_on_does_not_make_sense_to_me/"
    },
    {
        "id": "1hwter1",
        "author": "Andoppy18",
        "title": "How Squid Game 2 Thrived in the Streaming Wars",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hwter1/how_squid_game_2_thrived_in_the_streaming_wars/"
    },
    {
        "id": "1hw62aq",
        "author": "RockyPS2Glitches",
        "title": "Gabriel Iglesias: Legend of Fluffy",
        "content": "Just got done watching Gabriel Iglesias' new Netflix special, \"Legend of Fluffy\", and as someone who was a big fan of Gabe in the past, this special was so disappointing. Outside of the usual \"thank you\" and \"name drop shout outs\" he gives, he had a few jokes that went on for way too long (the gun shop bit with Jim), along with some recycled jokes from past specials, like the themed weeks and Krispy Kreme jokes, as well as the story about how he flashed the old couple.\n\nPlus not to mention the constant bragging about having fans, being famous, being rich. Like, we get it, dude. I swear, it seems like his material hasn't been interesting since he got the divorce and Frankie moved out, and I think plenty of people probably feel the same way also. And the crowd got annoying at times during the special too. Like almost ever word he said evoked an applause from the audience, and I think he got more cheers than laughs that night there were so many!",
        "upvotes": 13,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1hw62aq/gabriel_iglesias_legend_of_fluffy/"
    },
    {
        "id": "1hwjk2m",
        "author": "gameofsloanes",
        "title": "Netflix keeps losing sound",
        "content": "Brand new tv and every other app works fine but Netflix randomly has no sound. It comes back on occasion but for the most part I get nothing. Anyone else had this issue?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hwjk2m/netflix_keeps_losing_sound/"
    },
    {
        "id": "1hvvtl5",
        "author": "daily_mirror",
        "title": "Netflix's Squid Game fans debunk viral theory linking Front Man to surprise character",
        "content": "",
        "upvotes": 26,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hvvtl5/netflixs_squid_game_fans_debunk_viral_theory/"
    },
    {
        "id": "1hwb2vo",
        "author": "SolidStep4016",
        "title": "Jerry Springer Doc",
        "content": "I loved this documentary becauseI grew up watchingthe Springer show. When I would stay home from school sick this show and the Price is Right were my go tos.\n\nNetflix should air all the episodes of the Springer show uncensored. ",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hwb2vo/jerry_springer_doc/"
    },
    {
        "id": "1hvp43v",
        "author": "MonkeyTacoBreath",
        "title": "So this may just be a personal pet peeve, but the show/movie playing when you just want to read the description bugs the heck out of me.",
        "content": "My main issue is that because the show/movie started playing as I read the description, even if I back out 3 seconds later, that title is now in my continue watching tab. And I have to manually go remove it. \n\nI have auto play trailers and shows turned off. This happens on all platforms that I have access to, Xbox, PC, and Android.\n\nAnyone else get bugged by this \"feature\" or some other pet peeve?",
        "upvotes": 55,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1hvp43v/so_this_may_just_be_a_personal_pet_peeve_but_the/"
    },
    {
        "id": "1hw8upz",
        "author": "Internal_King_9747",
        "title": "Parenthood look a like?",
        "content": "How did I just found Parenhood on Netflix? Im in Canada. Was it on before? Found it just this week. Never actually heard of it before!\n\nThats such a good show!\n\nAny show that looks like it?\n\nI love when there are lots of seasons too! ",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hw8upz/parenthood_look_a_like/"
    },
    {
        "id": "1hw24x9",
        "author": "Intotheparadigmshift",
        "title": "Jerry Springer Documentary",
        "content": "For almost 25 years, Jerry springer aired and entertained me as a child and I loved it! I was in for it. I’ve been having Netflix since when it came out. And I am in absolute love with Netflix documentaries. But damn did they do a horrible job on this documentary. I mean everyone on this project has to be fired it was horrible.\nFor 25 years all they got was, JS in a 3sum, a murder that took place after the show and criticism of hate about the show for cancellation. That’s it!? That’s all this crew got? Disrespectful. Shameful. I disliked this documentary and Netflix was like whaaaaaat? You disliked this doc? lol cause it wasn’t saving my dislike. Jerry springer episode was more interesting than this trash of a documentary. I have bad taste?\n• into the fire\n•don’t fuck with cats\n•marduagh murder\n• I am a killer\n• Last Chance U\n• The disappearance of Madelienne McCann\n• The Trial of Gabriel Fernandez\n• American Nightmare\n• Tiger King\n• Chefs Table\n• the Last Dance\n• The Nightcrawler\n• American Murder\n• The Tinder Swindler\n• The Hatchet Wielding Hitchhiker\n• Bitconned\n•Our Father\n• How to Rob a Bank\n• Why Did You Kill Me\n• Athlete A\n• Long shot\n• The 3 deaths of Marisela Escobedo\n• Tupelo\n\n\nJust a bit to reference off of so yall know what kind I like and watch. ",
        "upvotes": 7,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1hw24x9/jerry_springer_documentary/"
    }
]