[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 485,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1h4r2iw",
        "author": "Robemilak",
        "title": "Dark premiered on Netflix 7 years ago today. One of the best shows ever?",
        "content": "",
        "upvotes": 1135,
        "comments": 218,
        "media": null,
        "permalink": "/r/netflix/comments/1h4r2iw/dark_premiered_on_netflix_7_years_ago_today_one/"
    },
    {
        "id": "1h5hmtp",
        "author": "dry_yer_eyes",
        "title": "Arcane series 2 is incredible",
        "content": "I’ve just finished the second series of Arcane, and it’s an amazing set of episodes and an involving, thrilling conclusion to what was set up with the first series. \n\nIf you watched series 1 and found it in any form interesting, then do yourself a favor and load up series 2. It’s really, really impressive. ",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h5hmtp/arcane_series_2_is_incredible/"
    },
    {
        "id": "1h51jrn",
        "author": "mws1263",
        "title": "Klaus (2019) on Netflix is the best family Christmas movie ever made.",
        "content": "An absolute masterpiece of the family Christmas movie category. A beautiful tale of the “origin” of Santa, that kids (my 3 especially) can easily follow, and fall in love with the magic. \n\nCharacter (and setting) development, emotional connections to characters, lighting changes to reflect a changing community, the evil characters and their aura. Overall fantastic. \n\nJust thought I’d throw it out there. Merry Christmas everyone ",
        "upvotes": 62,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1h51jrn/klaus_2019_on_netflix_is_the_best_family/"
    },
    {
        "id": "1h5ctfx",
        "author": "spideralexandre2099",
        "title": "Multilingual subtitles NEED a revamp",
        "content": "From Breaking Bad to Dexter there are many circumstances where a show that is mostly in one language also has extended conversations spoken in another language and the subtitles either just say [Speaking Spanish] or actually have the subtitles in Spanish. \n\nAs an English/French bilingual (but practically English monolingual) this is real frustrating.\n\nSomebody **has** to notify **somebody** that the way these subtitles are handled makes absolutely no sense.",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1h5ctfx/multilingual_subtitles_need_a_revamp/"
    },
    {
        "id": "1h5hxob",
        "author": "Ghostrabbit1",
        "title": "Discord screen sharing",
        "content": "I've been screen sharing  for a year while my partner is out of country. Now I just get a black screen even with all \"acceleration and everything else turned off. Does anyone have any solutions? I'm considering unsubbing because of how inconvenient netflix is making their nonsense. I already get banned everytime I leave the country now I can't even screen share with my partner. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h5hxob/discord_screen_sharing/"
    },
    {
        "id": "1h57slg",
        "author": "DoItForTheGraham9",
        "title": "Parenthood coming to Netflix!!",
        "content": "\nFor all the lovers of Lauren Graham, this is exciting news. We just know that its coming on December 15th. \n\nFor those who didn’t get to watch it yet, Parenthood is a touching drama about the Braverman family, exploring the joys and challenges of life across three generations. The show focuses on Zeek and Camille Braverman, their four adult children, and their families, tackling relatable issues like parenting, marriage, career struggles, and personal growth. With heartfelt performances and a mix of humor and emotional depth, it captures the complexity of family life while addressing topics like autism, adoption, and love in an authentic and compelling way.\n",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h57slg/parenthood_coming_to_netflix/"
    },
    {
        "id": "1h5e68c",
        "author": "TrickyReason",
        "title": "Eric — Episodes/Time Stamps — CSA",
        "content": "I started Eric and I’m enjoying it. However, when trying to find the name of an actor, I ran across something that mentioned visual child sexual assault (CSA).\n\nIt sounds like a child is SA’d and then murdered. It sounds like it’s shown multiple times — maybe as a recording?\n\nI’m a survivor of CSA and I would like to avoid those scenes. Usually, I just skip those scenes, but now I know that it’s repeated, and I’m less confident that I will be quick enough. It’s my understanding that there are no CW for those episodes. \n\nI’m not having any luck finding the episodes that have those scenes. Can anyone let me know what episodes have them, or what scenes I can expect to occur beforehand? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h5e68c/eric_episodestime_stamps_csa/"
    },
    {
        "id": "1h5dycc",
        "author": "FortuneIIIAxe",
        "title": "Watched Faster, watched 25% Ads, how common is this?",
        "content": "Watching a movie on Netflix, which we pay for has as many Ads now as watching a movie on regular OTA TV. How did we get here? The movie wasn't even that good, Billy Bob Thorton did a great job, The Rock didn't do any bad acting and we like The Rock, just seemed like it wasn't the best casting choice.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1h5dycc/watched_faster_watched_25_ads_how_common_is_this/"
    },
    {
        "id": "1h5du6p",
        "author": "Madzy0",
        "title": "Why Are Streaming Apps Still So Rudimentary? ",
        "content": "Some features/abilities that I believe should have been incorporated by now: \n\n- Option to Auto-skip intros\n- Set a queue of TV episodes or movies \n- Turn off that ridiculous feature where a new movie starts RIGHT AFTER a movie ends \n- You should be able to tap into any season (i.e. summer, winter) at any time of the year \n- Hulu does okayy at this, but all apps should capsulize festive episodes so you don’t need to be looking for S/E#s \n- Much more advanced genre/content filters \n\n**What else?**",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h5du6p/why_are_streaming_apps_still_so_rudimentary/"
    },
    {
        "id": "1h58d75",
        "author": "WorriedAd870",
        "title": "Call of Duty Squid Game Collaboration Made Official",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h58d75/call_of_duty_squid_game_collaboration_made/"
    },
    {
        "id": "1h5btod",
        "author": "Beautiful-Fondant-61",
        "title": "Keeps freezing",
        "content": "Everytime I go to the lastest to see what's new and coming to netflix, the app freezes and won't respond to my remote control. Is anyone else having this problem?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h5btod/keeps_freezing/"
    },
    {
        "id": "1h4z90f",
        "author": "The_CreativeName",
        "title": "Any way to download shows for offline viewing for pc?",
        "content": "Im going on a trip in like a month, and would like to watch arcane in its entirety again, but the internet is going to be really bad on the way there, and really don’t wanna watch it on my phone. \n\nAny ideas? Just keep it legal/barely legal.  \n\nThanks in advance ;)",
        "upvotes": 4,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1h4z90f/any_way_to_download_shows_for_offline_viewing_for/"
    },
    {
        "id": "1h5fu1v",
        "author": "Gullivereddit",
        "title": "¿Alguien conoce a algún productor de Netflix?",
        "content": "Hace unos años viví una relación con una persona que estaba mal mentalmente y con los años me han dicho que es una buena historia para contarse como en película",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h5fu1v/alguien_conoce_a_algún_productor_de_netflix/"
    },
    {
        "id": "1h4z3ws",
        "author": "Sheila3134",
        "title": "Question about Netflix with commercials? ",
        "content": "How does prime video get away with adding commercials to all content on prime video, but Netflix can't and some content can't be watched because of commercials? ",
        "upvotes": 3,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1h4z3ws/question_about_netflix_with_commercials/"
    },
    {
        "id": "1h4pzbw",
        "author": "Amandamills089",
        "title": "Netflix Presents \"Senna,\" F1 Legend Ayrton Senna's Story",
        "content": "",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h4pzbw/netflix_presents_senna_f1_legend_ayrton_sennas/"
    },
    {
        "id": "1h4y5mr",
        "author": "Pogrebnik",
        "title": "Writer and Director Hwang Dong-hyuk Reveals How Season 2 Changed the Ending of 'Squid Game'",
        "content": "",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h4y5mr/writer_and_director_hwang_donghyuk_reveals_how/"
    },
    {
        "id": "1h4xpio",
        "author": "Altruistic-Slip-6340",
        "title": "The Concierge/ For Love Or Money",
        "content": "Does anyone have any idea where I can stream this movie in the UK? I've tried Netflix but had no luck. A really underrated Michael J Fox movie in the vein of Secret Of My Success. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h4xpio/the_concierge_for_love_or_money/"
    },
    {
        "id": "1h51o38",
        "author": "Intrepid-Ad5333",
        "title": "Netflix Show not visible",
        "content": "I use a vpn to watch Breaking Bad in my school as my school wifi has a blocker installed, now that im at home, I cannot access Breaking Bad which is available in my region, It says coming soon, whereas any other device i use it works perfectly fine im using an iphone 13. (India)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h51o38/netflix_show_not_visible/"
    },
    {
        "id": "1h4qrqj",
        "author": "Evara333",
        "title": "Recently watched ‘I care a lot’ ",
        "content": "the best thing about the movie was, OFCOURSE PETER DINKLAGE!! 😭🤌🏼\nI mean yes, Rosamund Pike… I wanted to kill her myself, so yeah she did amazing! The end could’ve definitely been different tho, it let me down. Such a beautiful plot in the first half, and it just went downhill from there. ",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h4qrqj/recently_watched_i_care_a_lot/"
    },
    {
        "id": "1h5djzl",
        "author": "Sensitive_Bank_2404",
        "title": "Is it cake? Holiday edition ",
        "content": "Am I the only who thinks Mikey and Miko are banging backstage? I feel like they're being so flirtatious, and he guessed the charcuter-tree way too easily 😂 it looked so realistic. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h5djzl/is_it_cake_holiday_edition/"
    },
    {
        "id": "1h5brev",
        "author": "AlexWolveX",
        "title": "La bande annonce de Le Garcon et le Héron est en Français mais pas le film !?",
        "content": "J'essaye d'écouter Le Garcon et le Héron et j'en avait hâte surtout qu'il y avais les annonces en français mais quand je commence le film il est seulement en japonais ou anglais !? Y'a t'il un problème ou c'est Netflix qui se fou des français du Québec ?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1h5brev/la_bande_annonce_de_le_garcon_et_le_héron_est_en/"
    },
    {
        "id": "1h4kov4",
        "author": "stellacampus",
        "title": "The new drama \"Senna\" was very good",
        "content": "I know there's also a really good Senna doc on Netflix, but this new drama is really well done and worth a watch if you have any interest in racing at all (or even if you don't, but are okay with a drama that revolves around it).  The actors are all good and it's easy to get pulled into the story.  When the racing gets going, there are some amazing effects that make you feel like you're in the car.  It's a good length too - long enough to tell a story spanning some years, but not so long you don't ever want to see another race.",
        "upvotes": 13,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h4kov4/the_new_drama_senna_was_very_good/"
    },
    {
        "id": "1h5adlz",
        "author": "Puzzleheaded-Web43",
        "title": "tiktok edits will be the death of me",
        "content": "no matter how much time has passed since i've finished any show, as soon as i see a well made edit..... all the feels come back.\n\nsome edits are so good that i've started shows because of them. they deserve so much credit 🙌🏻",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h5adlz/tiktok_edits_will_be_the_death_of_me/"
    },
    {
        "id": "1h4v8uv",
        "author": "Orangesplashy",
        "title": "Episode Playlist?",
        "content": "I have a big Christmas Eve party this year and have always had the idea to have xmas episodes from a multitude of my favorite/ popular shows playing in a non-main room for people who want to get away from the chaos. This has always been a tradition of mine to get myself in the spirit but usually I’d just manually switch through shows and that’d take too much effort while hosting. Does anyone know if this is possible using the download feature or is it just a pipe dream? ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h4v8uv/episode_playlist/"
    },
    {
        "id": "1h4oroi",
        "author": "DMoney_10",
        "title": "Thoughts on “Later Dating” coach? (Logan Ury)",
        "content": "I went into Netflix’s new dating show excited because of the premise, but also because I’d been following Logan for a while on social media. She seemed like an accomplished researcher, author and advisor to companies like Hinge which is so cool. I’ve also heard some of her original sound bites on dating that seemed mostly decent. \n\nHowever I was a bit let down by her appearance on the show. First of all, I felt she had very little personality. She came off as quite meek, and bland, and if anything, the participants facilitated the scenes and kept things energized. \n\nI also felt like her coaching moments were a mixed watch - some were insightful and effective, but others were lacking, and others came off as even a bit abrasive. \nFor example, there were many dates that went relatively well and had good potential, but the participant wrote it off quickly. This isn’t uncommon in modern dating. But as a coach, Logan just agreed with the dater, rather than maybe challenging them to try one more - and I think this caused some people to lose out on connections that could have developed a bit more time. \nOr another example - she tore into the lady with the big glasses - attacking her glasses choice and also telling her that her personality is too big. IMO Logan, as a coach, could have more gently engaged with the lady, rather than potentially making her self-conscious and feel put-down. It also just seemed odd to me to target her fashion choice, when the woman clearly puts in soooo much effort and presents herself thoughtfully. It’s not like on Queer Eye when a makeover is part of the deal.\n\nI think Logan is a smart lady! But I think she might be better suited for research…or for consulting on a show like this - with someone more charismatic in the spotlight (this is national tv after all).\n\nWhat are everyone else’s thoughts?\n",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1h4oroi/thoughts_on_later_dating_coach_logan_ury/"
    },
    {
        "id": "1h4mhuc",
        "author": "Sensitive_Rock6788",
        "title": "AfrAId Netflix",
        "content": "The movie began a little slow, but I knew where it was going. Almost like a M3GAN vibe but didn’t quite hit the nail for me. Towards the end, when the husband was actually visiting the company and the owners were talking to him about Iya, I don’t understand veering off and shooting her co-owner. Him then being taken to a hotel as if that woman wasn’t also part of it (so obvious). The ending felt rushed. Like the whole thing just got-bizarro. I did however feel like it was creepy because of the fact that AI can morph into this all knowing/controlling thing which I think is very real and we are clearly heading in that direction, if not there already. The beginning with the little girl listening to the show instructing her to go outside, we have that now with these crazy ass YouTube shows “for kids”. The movie just could’ve been better in my opinion. ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h4mhuc/afraid_netflix/"
    },
    {
        "id": "1h4sosb",
        "author": "Veroptik",
        "title": "Standard or premium for 1220x2712p phone and 1080p computer?",
        "content": "What plan should I buy if I plan to watch Netflix on my HD/1920x1080p computer and 1.5K/HD+/1220 x 2712 pixel phone?\nWould the slightly higher quality on the phone noticable? Money isn't a concern but like in terms of common sense there's no point in spending more if it has 0 impact.\nAnd does the plan impact anything else?\nThank you ✌️",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1h4sosb/standard_or_premium_for_1220x2712p_phone_and/"
    },
    {
        "id": "1h4v3i4",
        "author": "OopsididathingTT",
        "title": "Netflix Recommendations ",
        "content": "What should I watch on netflix? \nShows i like: inside job, bojack horseman, diplomat, shameless, gilmore girls, breaking bad. \n\nwhat should I watch next? ",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1h4v3i4/netflix_recommendations/"
    },
    {
        "id": "1h4az00",
        "author": "IntelligentBag93",
        "title": "I’m looking for positive and uplifting shows that aren’t fake",
        "content": "I’m kind of done with the murder mysteries and cold cases, and I want to watch something more airy/breezy, something you can also watch while cooking. But I’ve noticed that the ‘feel good with the fake obsticals to overcome’ style is irritating me. \n\nFor example a house make over show that pretends there is a storm coming and they don’t know if they’ll finish, while in reality there is no storm it’s just editing, that combining with a lot of dramatic and over the top editing and personalities is tiring to me.\n\nI saw a show called Motel Makeover or something that was less of what I described above so I enjoyed that very much, they didn’t pretend to have problems all there problems were pretty real and the brushed over it pretty quickly. Also I didn’t like the final table because it felt rigged at the end and too dramatic. But food related content is also up my alley!\n\nEdit: Love all the suggestions please keep them coming so I have a list!!",
        "upvotes": 15,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1h4az00/im_looking_for_positive_and_uplifting_shows_that/"
    },
    {
        "id": "1h42qwq",
        "author": "False_Summer6313",
        "title": "Dark was very boring for me",
        "content": "I watched 5 episodes. I tried watching 3 years back, i stopped at the 2nd episode. Again i tried watching it 1 year ago, stopped at 4th episode. Now at 5th episode. Literally everyone’s characteristics in this series are the same. The character designs are sooo bland. I can’t sit through 9 hours of very slow burn screenplay to get the ‘AHHHHH’ moment in the 10th episode. I usually like ‘mind-melting’ series which makes me think more. Idk what’s happening with this one. Should i continue it and give it a shot?",
        "upvotes": 42,
        "comments": 176,
        "media": null,
        "permalink": "/r/netflix/comments/1h42qwq/dark_was_very_boring_for_me/"
    }
]