[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 39,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 12,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1q2eo56",
        "author": "zekevich",
        "title": "Netflix's \"second screen\" writing ideology doesn't give me hope for Netflix's future releases.",
        "content": "Them basically writing shows to \"accommodate\" for the idea that people are probably going to be scrolling on their phones while watching them, so they simplify and dumb down their shows so people can still understand what's going on while paying attention to something else. [x](https://medium.com/enrique-dans/second-screen-viewing-netflix-succumbs-to-the-dictatorship-of-the-smartphone-6b639c829fec)\n\nand quite frankly, I think this is a horrible idea. one that's going to do more harm than good. we should ***not*** be dumbing down media and art as a whole *just because* some people *might* not happen to be paying full attention.\n\nand Stranger Things 5 was a clear example of this. a good majority of the dialogue was overexplainy, exposition dumpy, unnatural and held your hand and basically treated you like you were stupid.\n\nand if THIS is any indicator of how netflix is about to write their shows in 2026 and onward? respectfully count me out, because..... 😬",
        "upvotes": 469,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1q2eo56/netflixs_second_screen_writing_ideology_doesnt/"
    },
    {
        "id": "1q2m94q",
        "author": "Known_Broccoli_4274",
        "title": "Give netflix some credit",
        "content": "People moan a lot about Netflix, saying it's poor content but I have to say, I don't agree. I get we all like different things and genres but Netflix has some incredible originals they've made: virgin river, Ransom Canyon, Leanne, you. I think it's still worth money and getting the ad free for a few extra pounds definitely enhances user experience\nThe only negative I have is that they've got rid of friends &amp; the big bang theory...not many own a dvd player anymore and Netflix was the only platform that showed these series without having to purchase each individual season etc. Just my opinion 🩷",
        "upvotes": 17,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1q2m94q/give_netflix_some_credit/"
    },
    {
        "id": "1q2clxr",
        "author": "Vegetable_Engine_463",
        "title": "Anyone watched Members Only: Palm Beach? Is this really how wealthy Americans look and behave?",
        "content": "I watched Members Only: Palm Beach and the whole time I had a very odd feeling, like something was off. Visually everything checks out: luxury cars, massive mansions, yachts, ocean views, etc.\n\nAt the same time, the people in the show feel strange. The outfits look cringe and overloaded, kinda Chinese market-style. The overall vibe comes off as kitschy. In Europe this aesthetic disappeared a long time ago. In Italy if someone dressed like this showed up at a high-end event here, the reaction would be… complicated. Real wealth here usually shows through restraint, quality, and taste. Loud luxury feels outdated by decades.\n\nBecause of that, the show feels staged. Expensive scenery, dramatic behavior, exaggerated styling.\n\nAmericans, is this an accurate reflection of how wealthy elites in the US actually look and behave, especially in places like Palm Beach? Or is this more of a dressed-up TV version made for drama?",
        "upvotes": 54,
        "comments": 57,
        "media": null,
        "permalink": "/r/netflix/comments/1q2clxr/anyone_watched_members_only_palm_beach_is_this/"
    },
    {
        "id": "1q1rl8k",
        "author": "GuineaPKilledMe",
        "title": "Dave Chappelle - The Unstoppable",
        "content": "I have never seen something so unfunny in a long time. Genuinely what happened to this dude?? I mean I know what happened, but all he does it spew bitterness and hate.\n\nHe immediately came out preaching and ranting. Idek when he's actually telling jokes because all he does is go on and on about how he can't do this and can't do that. What a whiny baby.\n\nI used to love his standup specials. I just cannot believe that almost ten years later this man can absolutely not let anything go. I turned it off twenty minutes in without cracking as much as a smile.\n\nEdit: Some of y'all are so far up Dave Chappelle's ass that you're sending me Reddit Care alerts. You are a absolute pathetic loser to do that. Please grow up and choose to use those when someone is actually in dire need of help. I do not need help because I find your favorite comedian to be a bitter old man who rants at the clouds.",
        "upvotes": 903,
        "comments": 398,
        "media": null,
        "permalink": "/r/netflix/comments/1q1rl8k/dave_chappelle_the_unstoppable/"
    },
    {
        "id": "1q2gzfa",
        "author": "rebelsoul_8",
        "title": "Queen of the South",
        "content": "Just finished Queen of the South , anyone else seen this , i thought it was really well written and kept me engaged the whole series. The actors did a really good job to . ( Boaz especially) ",
        "upvotes": 19,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1q2gzfa/queen_of_the_south/"
    },
    {
        "id": "1q20n8a",
        "author": "emanuele94",
        "title": "Questions about Stranger Things",
        "content": "1. Why does Vecna need to open four gates in Season 4, but then in Season 5 he changes his plan and needs twelve children instead?\n\n2. Why does Vecna need twelve children on his side to bring the Abyss to Earth?\n\n3. Why does Vecna wait years before acting directly?\n\n4. Why, in the Abyss during the final showdown, are there no other creatures present (demogorgons, demodogs, demobats, etc.) besides the Mind Flayer? Did they join him spontaneously (as if that were a good strategy…)? Were they all in the Upside Down? Were they all dead? Who knows!\n\n5. Why is Mike’s mother able to move freely around the hospital with a gas tank and hide it inside one of the dryers without any demogorgon noticing?\n\n6. Why do the military, once they become aware of the “beanstalk” plan, do nothing to stop it?\n\n7. Why does Vecna, once he learns about the “beanstalk” plan (through Kali’s memories), do nothing to stop it?\n\n8. Why, inside Henry’s mind, does Holly need to pull out the “Rise of Skywalker” move, with binoculars?\n\n9. Why, once Eleven disappears, do the military decide to abandon the town and all the protagonists as if nothing had happened? Nancy and Hopper should end up in prison for at least manslaughter. Instead, Hopper regains his job as sheriff and even considers a career advancement.\n\n10. Why is a huge creature like the Mind Flayer unable to kill the protagonists in the final battle (with legs as big as an apartment building, which everyone easily dodges with a somersault)? And how do the protagonists manage to climb to the top of a canyon so quickly?\n\n11. Why, all of a sudden, can everyone enter and exit the Upside Down without needing an oxygen mask anymore?\n\n12. Why isn’t Max blind after coming out of her coma?\n\n13. Why is Joyce involved in extremely dangerous missions and plans, despite often having no real active role and providing no significant contribution?\n\n14. Why do the characters think it’s a good idea to stop and talk and deepen their relationships in the middle of very intense action scenes?\n\n15. Why do gravity, air, sound, etc. work normally in the Abyss just like on Earth? Very convenient for playing “space explorers”!\n\n16. Why is Vecna able to activate long-distance mind control over Hopper?\n\n17. Why does Vecna kill following “ritualistic” patterns instead of attacking en masse?\n\n18. Why is Eleven able to defeat 001 as a child but not as an adult (at least initially)?\n\n19. Why doesn’t Vecna kill Eleven immediately when he has the chance?\n\n20. Why are Jonathan and Nancy not even slightly injured by the slimy substance that forms after they attack the shield generator?\n\n21. Why does Henry receive an interdimensional stone with black dust and turn into a murderous madman?\n\n22. Why does the Mind Flayer change form and strategy every season? If his goal is to infest Earth, he had countless opportunities to do so (and couldn’t he have the demogorgons carry stones with black dust to possess other people, as he did with Henry)?\n\n23. Why does no one in Hawkins, besides the protagonists, wonder what is happening? No one comes up with conspiracy theories?\n\n24. Why does no one outside Hawkins take an interest in this town? Does no one have friends or relatives outside the city? What is the government doing? No external journalists investigate?\n\n25. Why do a bunch of kids always manage to figure everything out before scientists and the military?\n\n26. Why do parents tolerate such prolonged absences and/or so easily accept absurd or incomplete explanations?\n\n27. Why is the Abyss “frozen” on the day Will disappeared?\n\n28. Why does Will, despite having survived, attract no interest from the military? (There must be surveillance footage showing him fighting off demogorgons.)\n\n29. Why don’t the demogorgons in the laundry room hear the music Lucas plays to save Max?\n\n30. Why does no one seem to notice the gigantic walls surrounding the Upside Down before Season 5? Excluding Dr. Brenner—judging by the notes he wrote and then forgot in the Upside Down lab—when did he produce them? And why is there no trace of this information in the real Hawkins lab?\n\n31. Why is Eleven even capable of generating wormholes? It has been confirmed that she accidentally created the Upside Down in 1983.\n\n32. Why is Eleven able to hurl people into other dimensions? She is the one who threw Henry/001 into Dimension X / the Abyss.\n\n33. Who or what created the shield generator in the lab that keeps the Upside Down intact? Was it Eleven when she created the bridge?\n\n34. Why is Dimension X / the Abyss the only dimension trying to interfere with Hawkins?\n\n35. Why is Suzie no longer mentioned? Why aren’t Robin and Vickie included in the finale? Why are unresolved subplots left hanging?\n\n36. Why does the fate of characters like Dr. Kay remain ambiguous?\n\n37. Why does Nancy suddenly appear skilled with weapons, without any explanation or prior training?\n\n38. Why do demogorgons switch from being intelligent predators to almost stupid monsters, depending on the circumstances and the characters involved in a given scene?\n\n39. Why do the disappearance of dozens of people, numerous deaths, and the presence of giant monsters not lead to serious investigations or intervention by the press or the FBI?\n\n40. Why, in Season 5, do the vines no longer have any significance, when up until Season 4 simply touching them disturbed the hive mind?\n\n41. Why do the characters constantly seem on the verge of death but then survive (after a few seconds, a few episodes, or from one season to the next: Hopper, Nancy and Jonathan, Steve, Eleven)?\n\n42. Why did Vecna specifically take control of Will in Season 1 and not other kids?\n\n43. Why does the wormhole show only Hawkins in the Upside Down?\n\n44. Why do the Russians disappear entirely? Why do they no longer spy on operations in Hawkins, considering that even kids manage to do so with the help of a high school physics teacher?\n\n45. Why doesn’t Vecna maintain a constant army, and why doesn’t he fully exploit it?\n\n46. Why is Max able to graduate despite having missed almost two years of school?\n\n47. Why do Joyce and Hopper never talk about Henry, even though they went to school with him?\n\n48. Why does every season have to “reset” the world as if nothing had happened before?\n\n49. Why is Vecna not mentioned at all in the early seasons?\n\n50. Why does this series handle certain narrative turning points in such a sloppy way (\"good enough, let’s go!\")?\n\n",
        "upvotes": 116,
        "comments": 119,
        "media": null,
        "permalink": "/r/netflix/comments/1q20n8a/questions_about_stranger_things/"
    },
    {
        "id": "1q27y2d",
        "author": "Mucek121",
        "title": "What are your top 6 Netflix shows ever?",
        "content": "What are your top 6 Netflix shows ever?\n\n\n\nMine top 6 are  :\n\n\n\nOzark\n\n\n\nPeaky Blinders\n\n\n\nStranger Things\n\n\n\nQueen's Gambit\n\n\n\nThe Last Kingdom\n\n\n\nHaunting of Hill House",
        "upvotes": 41,
        "comments": 145,
        "media": null,
        "permalink": "/r/netflix/comments/1q27y2d/what_are_your_top_6_netflix_shows_ever/"
    },
    {
        "id": "1q2esby",
        "author": "Vegetable_Engine_463",
        "title": "Million-dollar question — is Derek’s family still tied up in that barn?",
        "content": "They got kidnapped, drugged, tied up, and left in some random barn. And that’s it, the end. Nothing in the finale. Why tf they didn’t show up at graduation? Are they alive or Dead? Did anyone ever go back for them, and if so — what did they say? Like: “well, we were kidnapped, but it’s all good, we’re gotta go back home, no worries.” \n\nOr… are they still just lying there?\n\nAnd what was the point of giving the sister a whole personality and a fight with Erica if she was gonna vanish right after? One scene and gone. For what?? ",
        "upvotes": 9,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1q2esby/milliondollar_question_is_dereks_family_still/"
    },
    {
        "id": "1q1vvza",
        "author": "Admirable-Abrocoma16",
        "title": "Where Did My Demogorgons Go? Stranger things Finale episode",
        "content": "So I just finished the Stranger Things finale and… excuse me, but did the Duffers accidentally misplace the Demogorgons in the Upside Down lost‑and‑found?  \n\n- Season 1: Demogorgon terrorizes Hawkins, eats Barb, becomes the face of nightmares.  \n- Season 2: Demo‑dogs everywhere, Will coughing up slugs, chaos.  \n- Season 3: Russians literally import a Demogorgon like it’s a Costco bulk item.  \n- Season 4: Hopper fights one bare‑chested with a sword like he’s auditioning for Conan the Barbarian.  \n- Season 5 finale: Not. Even. One. Cameo.  \n\nLike… Vecna gets his Shakespearean villain monologue, the Mind Flayer gets lore upgrades, but the OG monster? Vanished. No goodbye wave, no “thanks for the trauma,” not even a background shot.  \n\nI feel robbed. At least give me a single Demogorgon dissolving dramatically when the Upside Down collapses. Instead, it’s like Hawkins collectively forgot their first abusive ex. ",
        "upvotes": 101,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1q1vvza/where_did_my_demogorgons_go_stranger_things/"
    },
    {
        "id": "1q22won",
        "author": "Prestigious-Play8863",
        "title": "Everyone who finished the Stranger Things finale, did it feel… off?",
        "content": "Everyone who finished the Stranger Things finale, did it feel… off?\n\nWatched it yesterday and I’m still sitting with it. Not angry, not impressed, just oddly underwhelmed. \n\nFeels like there was so much build-up for something that didn’t fully hit emotionally.\n\nAm I alone in this or did it leave you feeling the same way?\n\nHere's a detailed review -\nhttps://medium.com/@fbgmb/i-watched-the-stranger-things-finale-and-wait-thats-it-3ebde2924f9e",
        "upvotes": 32,
        "comments": 175,
        "media": null,
        "permalink": "/r/netflix/comments/1q22won/everyone_who_finished_the_stranger_things_finale/"
    },
    {
        "id": "1q17wlz",
        "author": "Boring_Ant_1677",
        "title": "Gaten Matarazzo: “I don’t think I ever really want to put Stranger Things behind me”",
        "content": "",
        "upvotes": 1872,
        "comments": 256,
        "media": null,
        "permalink": "/r/netflix/comments/1q17wlz/gaten_matarazzo_i_dont_think_i_ever_really_want/"
    },
    {
        "id": "1q27ir8",
        "author": "Raganjpix",
        "title": "Netflix Run Away Anya without wheelchair",
        "content": "I just started watching Run Away on Netflix last night… The daughter Anya Greene is portrayed in a wheelchair in almost every scene. But after her school teacher parent conference, she appears to be walking and standing at the same height as her parents. Am I missing something? Does she need that wheelchair or not? Can she walk sometimes or was this just a misunderstanding as I viewed the scene?",
        "upvotes": 15,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1q27ir8/netflix_run_away_anya_without_wheelchair/"
    },
    {
        "id": "1q28qq0",
        "author": "Famous-Attention-197",
        "title": "Why the Hell did they Move the Search Bar",
        "content": "sorry, just a rant but god this is such a stupid decision from a user perspective. \n\n  \nso I just scrolled past a bunch of shit I don't want to watch, then decide I'm going to search for something specific. and now I have to scroll back past all that shit I don't want to watch. \n\n  \nwhat the hell, Netflix. some stupid middle manager somewhere justifying their existence with shitty UI changes. ",
        "upvotes": 10,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1q28qq0/why_the_hell_did_they_move_the_search_bar/"
    },
    {
        "id": "1q2ogsu",
        "author": "niiyah_babyy",
        "title": "Limited series recommendations",
        "content": "I just finished the new limited series Run Away and it was so good !! Any other short series on Netflix i should check out ??? I love thrillers but any genre is cool. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q2ogsu/limited_series_recommendations/"
    },
    {
        "id": "1q25wwr",
        "author": "IntrovertedIngenue",
        "title": "Members Only: Palm Beach — A Potemkin Village of Class",
        "content": "Genuine question with zero political motivations but just more of an observation.\n\nSo Members Only: Palm Beach looks like a perfect, wealthy facade from the outside, but as soon as they open their mouths or show their back tattoo ink, the \"decorum\" falls apart. This show feels like it was created by someone liberal to highlight (read: embarrass) the bastion of name dropping Florida MAGA women.\n\nFrom wigs falling off to tramp stamps to the attire, this is so counter to old money Palm Beach that surely this must be some sort of an inside joke, yes? Like the purest form of Schadenfreude \n\nEither way, some of the most entertaining low class dribble on television rn. I’m hooked…",
        "upvotes": 11,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1q25wwr/members_only_palm_beach_a_potemkin_village_of/"
    },
    {
        "id": "1q21v0e",
        "author": "Particular_Cow_9302",
        "title": "Joyce Byers",
        "content": "I gained interest in Stranger Things because of Wynona Forever (millennial thangs) and stayed for the story. And although Joyce was sidelined for most of the seasons, the real ones remember that she was the first to crack the code on the Upside Down—ABCD… I’m very glad that the Duffer Brothers gave this younger generation a chance to appreciate such a beloved actress. ",
        "upvotes": 14,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1q21v0e/joyce_byers/"
    },
    {
        "id": "1q2n8fb",
        "author": "photograthink",
        "title": "Kian's Bizarre B&amp;B season 1",
        "content": "Do you know how the guests from the first season are doing?\nI'm mainly thinking about the sick father who went with his children and the couple, I wonder if they're still okay?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q2n8fb/kians_bizarre_bb_season_1/"
    },
    {
        "id": "1q2m5cr",
        "author": "XandersOdyssey",
        "title": "Why is Netflix doing this on chrome after I transferred my account?",
        "content": "So up until today I only access Netflix on my laptop through chrome at my parents’ home when I would visit. \n\nToday I decided to do the “add user” option and transfer the data to my own account (while still on my parents’ plan).\n\nOnce I verified my account through their email, I went to Netflix . Com again and the page wouldn’t load at all. The loading circle would constantly be circling while the page remained white and blank.\n\nHowever, when I accessed through Safari, it worked smoothly without issues. \n\nSo … what’s the deal? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q2m5cr/why_is_netflix_doing_this_on_chrome_after_i/"
    },
    {
        "id": "1q2m18i",
        "author": "Constant_Opening6239",
        "title": "Problem with Netflix and Firefox",
        "content": "Netflix isn't showing images (the little thumbnails of the shows) on my computer when I'm on Firefox, but it -does- show the images when I use Chrome on my computer.\n\nNetflix is working fine on my cell phone and on my Smart TV.\n\nDoes anyone know what this might mean?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q2m18i/problem_with_netflix_and_firefox/"
    },
    {
        "id": "1q2luhg",
        "author": "purely_unbothered",
        "title": "Binge list",
        "content": "In 2025, I've watched many movies and series across multiple platforms but majority from Netflix. My list was filled with adventures, sci-fi,  thriller, murder mystery, drama, horror and othere genres and I'm planning to watch more of it in 2026. \n\nI've watched Breaking Bad, Better Call Saul, Peaky Blinders, Dark, Wednesday, Stranger Things, Ozark, Money Heist, Narcos, Berlin, Lucifer.\n\nAnd in movies - Shutter island, bird box, 28 years later, homebound, El Camino,  Frankenstein. \n\nBased on watched movies/series and genres mentioned above would like some suggestions for this year or month. Will watch many as i can.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1q2luhg/binge_list/"
    },
    {
        "id": "1q2l6qu",
        "author": "stellacampus",
        "title": "OMG the Run Away ending",
        "content": "I'm not advocating one way or another for the series as a whole, but I did watch the whole thing.  While some of it was predictable, and much of it was overly convoluted, and it ended up sounding like a slightly higher class soap opera, I was still somewhat shocked by the very last reveal.  &gt;!Ingrid is driven to the point that she murders someone, but doesn't know it's her son?!&lt; Wow.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q2l6qu/omg_the_run_away_ending/"
    },
    {
        "id": "1q2ks5m",
        "author": "Cooltwou",
        "title": "I have a question about WWE Content",
        "content": "Does anyone know when Netflix is going to add Raw and Smackdown from 2021 to Netflix and when will they add the older NXT weekly shows not just the PPV ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q2ks5m/i_have_a_question_about_wwe_content/"
    },
    {
        "id": "1q27pba",
        "author": "imtheshitxo",
        "title": "Black Rabbit",
        "content": "I just finished watching Black Rabbit and I thought it was great! I get everyone has different opinions but after reading some of the feedback from some people in this group, I was skeptical. Good thing I didn’t listen lol because I was very impressed with the series. ",
        "upvotes": 6,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1q27pba/black_rabbit/"
    },
    {
        "id": "1q2j5zb",
        "author": "asoulforever",
        "title": "captions font for dyslexia",
        "content": "hi ! i recently added the open dyslexic extension for chrome on my mac, but unlike other streaming apps like disney+or crave, the font doesn't automatically change to [opendyslexic](https://opendyslexic.org/) like it does everywhere else (youtube  doesn't either now that i'm thinking about it). does anyone know a way around it? english isn't my first language and its really made it easier for me to follow along with subtitles. any help is appreciated :(",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q2j5zb/captions_font_for_dyslexia/"
    },
    {
        "id": "1q2nmcq",
        "author": "Particular_Cow_9302",
        "title": "Self aware",
        "content": "I see so many people posting their complaints on the plot holes, missing demogorgons, Vecna’s easy defeat, Elevens emotionless mug, etc. But here’s some food for thought. Stranger things had never taken itself too seriously, nor did it profess to offer exemplary writing. Like when did they present a logical reason for the existence of the upside down? When did they explain why the buildings were a replica of Hawkins? They never once mentioned the Russian entrance to the upside down.  The show was never intended to be an action film, neither. It offered action because why not, but the heart of the show were always the friendships, and they did deliver on that. I understand that some were let down but ST was always meant to he a cheesy, teen fantasy that just so happened to blow up into a global phenomenon. Within that context, I believe Stranger Things over delivered. ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1q2nmcq/self_aware/"
    },
    {
        "id": "1q2ices",
        "author": "gyro_zeppeli513",
        "title": "Cant watch anything on my acc",
        "content": "Alr so when I try to watch my show it says 2 people on same acc. Some background info is that while I put it in like bubble thing (where you can still watch netflix on your phone while doing other things) it auto signed me out, and when I signed back in, it won't let me watch my show now",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q2ices/cant_watch_anything_on_my_acc/"
    },
    {
        "id": "1q2i9p9",
        "author": "lLikeEminem",
        "title": "Not logging in Bug",
        "content": "I wanted to log into my Netflix account but for some reason, it keeps showing me that I’m not a part of the household on my device. It worked two hours ago but when I restarted the app, it kept showing me this notification. I’m 100% in the same network I’m always in and the account owner is in it too and I can’t and don’t wanna request a code bcz its currently not possible to share the code and I wanna fix the problem long-term, not request a code for every time I‘m watching ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q2i9p9/not_logging_in_bug/"
    },
    {
        "id": "1q2i89c",
        "author": "mrspottertru",
        "title": "Has anyone had issues collecting their winnings from Best Guess?",
        "content": "I won 82 dollars a couple of nights ago, and I still haven’t been able to collect.  I’ve had Netflix since the beginning and PayPal forever. And they have been trying to fix it, but still nothing.  Anyone else have this issue, and did they fix it for you?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q2i89c/has_anyone_had_issues_collecting_their_winnings/"
    }
]