[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 14,
        "comments": 87,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 65,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1ljevku",
        "author": "Gnnz",
        "title": "The Good Place worth watching?",
        "content": "This pops up constantly on my Netflix and I am considering starting. For those of you that have watched it or are currently watching it, is it worth the watch?",
        "upvotes": 53,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1ljevku/the_good_place_worth_watching/"
    },
    {
        "id": "1lj3xi4",
        "author": "Logos1789",
        "title": "PSA About “Leaving Soon” Labels",
        "content": "Depending on the platform you’re watching Netflix on, the “Leaving Soon” labels may not appear on the thumbnail of the show or movie. \n\nInstead, you’ll only see the note about the movie leaving Netflix on X date after selecting the thumbnail to view more info.\n\nI happened to be browsing Netflix on my phone when I noticed that a movie on my list had the “Leaving Soon” label. Upon using my gaming console to pull up the movie, I noticed that the label wasn’t displayed.\n\nIn case this is a one-off mistake, the movie is The Net.",
        "upvotes": 22,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lj3xi4/psa_about_leaving_soon_labels/"
    },
    {
        "id": "1ljctdm",
        "author": "Indoril-Nerevar337",
        "title": "First Look: Cillian Murphy Leads Reimagining of 'Shy' in Upcoming Drama 'Steve'",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ljctdm/first_look_cillian_murphy_leads_reimagining_of/"
    },
    {
        "id": "1ljf8fu",
        "author": "Trent-Popverse",
        "title": "KPop Demon Hunters is the perfect introduction to KPop for anyone curious about it",
        "content": "Considering that it is a third of the title, KPop Demon Hunters needed to deliver on the KPop to feel worthwhile. I have some issues with some of the animation and the plot has a few inconsistencies, but one thing [I have no problems with is the music itself.](https://www.thepopverse.com/movies-netflix-kpop-demon-hunters-soundtrack-perfect-k-pop-introduction-huntrix-bts-twice/) Every song is solid and represents a trope or genre within KPop. The first song feels like it could be on a Blackpink record. The Saja Boys song was inspired by BTS. The big confrontational song is sung by members of Twice during the credits. \n\nWhat I'm saying is that KPop Demon Hunters is very good and has a great soundtrack. Highly recommend it for anyone wanting a gateway drug to KPop.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ljf8fu/kpop_demon_hunters_is_the_perfect_introduction_to/"
    },
    {
        "id": "1lje4en",
        "author": "JDeLiRiOuS129",
        "title": "Is there a way to block changing the plan on the app?",
        "content": "So basically my friend/roommate keeps changing the plan as I have a free plan through T-mobile. He really isn’t very tech savvy and doesn’t realize he’s even changing it as the pop up keeps popping up when he watches certain movies and I don’t know if he just tries to skip them or he can’t read what it actually says as he needs glasses but doesn’t own a pair but it’s getting annoying because it’s already happened 3 times and every time it happens, T-mobile changes me for the whole month regardless, even though I change it back right away. I feel like it shouldn’t have that opinion to change it without putting the account password in or something. Please tell me there’s a way to stop that pop up from coming up?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lje4en/is_there_a_way_to_block_changing_the_plan_on_the/"
    },
    {
        "id": "1lje2j3",
        "author": "MindFlourish2919",
        "title": "The latest Trainwreck review",
        "content": "Trainwreck: Poop cruise\n\nI watched the full thing and I was shocked and relieved that no one went crazy and a bigger disaster occurred. I really liked how the passengers and crew handled the whole situation. Overall very good documentary.\n\n9/10",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lje2j3/the_latest_trainwreck_review/"
    },
    {
        "id": "1ljd1g3",
        "author": "AmphibianDeep9212",
        "title": "Most anticipated for the rest of the year?",
        "content": "The second half to 2025 is going to be incredible for Netflix and us, the fans. \nStranger Things, Wednesday, Squid Game. I’m\nSure there are others, but I guess those are the big 3. \n\nhttps://apopcornmovieblog.blogspot.com/2025/06/most-anticipated-upcoming-tv-shows.html\n\nWhat are you most looking forward to? For me, it’s Stranger Things. ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ljd1g3/most_anticipated_for_the_rest_of_the_year/"
    },
    {
        "id": "1ljcjc7",
        "author": "Lopsided-Pop3120",
        "title": "What to base your ratings on?",
        "content": "This is somewhat tricky because the algorithm of Netflix suggesting new titles to you is a black box. But should you, for best results, rate based on the quality (meaning objective rating - acting, camera work, writing, cinematography etc.) or on the content (the genre, topic, setting, story etc.)?\n\nFor example if you had two movies  \nA) A sci-fi action comedy movie that has amazing camera work, acting and writing.   \nB) A medieval murder mystery thriller that has miscast actors, useless subplots stapled on with horrible acting and amateur cinematography.\n\nNow if you really really like a medieval setting, thrillers and especially murder mysteries are 100% you jam and you really don't care for action, sci-fi or comedy, how should you rate the movies? \n\n* If you go for the objective rating of A+ B- will you now see more sci-fi action stuff that you don't really care for? Or will you be treated to highly rated cinematic masterpieces of every kind? \n* On the other hand if you try and curate your stuff and go for the subjective rating of A- B+, will you get more of the themes you are looking for or will you be flooded with borderline unwatchable straight to DVD crap?\n\nThe \"I love this\" option made it a bit easier so if it's something that is both objectively and subjectively great for you, you know how to vote, but if I don't like something for the quality but not the setting or other way around, I often don't dare \"dislike\" it, because of how it might misunderstand *what* I disliked.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ljcjc7/what_to_base_your_ratings_on/"
    },
    {
        "id": "1ljc4sz",
        "author": "JustARandomTomboy",
        "title": "Why are some seasons not on here?",
        "content": "Context: I just downloaded and bought the 7.99 plan so I'm still pretty new to Netflix\n\nI downloaded Netflix so I could watch some of the shows I've been wanting to watch, Squid Games, MHA, ect. I started watching MHA and realized there is only two seasons on here. Is this just me or is this for everyone? I thought that was odd so I clicked on another title. It was also missing a season. Is this because I bought the 7.99 plan and not the other expensive plan or is something everyone experiences? And no, I don't have any filters on. I already checked. ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ljc4sz/why_are_some_seasons_not_on_here/"
    },
    {
        "id": "1liqhyd",
        "author": "SometimesWitches",
        "title": "The Waterfront",
        "content": "Got through it in a couple days.  It is intriguing enough.   If you compare everything to your favorite family goes bad shows then it ranks somewhere in the middle.    It’s not going to blow anyone away but it has good actors and it is worth it just for Maria Bello who plays the matriarch.   She has come a long way from Coyote Ugly but I have enjoyed her in the last few projects i have seen her in.   The story has a few good twists and I do hope it has a second season.   ",
        "upvotes": 24,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1liqhyd/the_waterfront/"
    },
    {
        "id": "1ljfzhf",
        "author": "intelerks",
        "title": "Martin Kove allegedly bites co-star of ‘Cobra Kai’ Alicia Hannah-Kim at fan convention in Washington",
        "content": "",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ljfzhf/martin_kove_allegedly_bites_costar_of_cobra_kai/"
    },
    {
        "id": "1li6s5y",
        "author": "ispankoldpeople",
        "title": "What is your fave hidden gem on Netflix?",
        "content": "\nLooking for recommendations of what you believe to be the most underrated shows that you have watched on  Netflix/Prime apps. My only hard no is anything dubbed, it’s just way too distracting for my tiny little mind.",
        "upvotes": 438,
        "comments": 527,
        "media": null,
        "permalink": "/r/netflix/comments/1li6s5y/what_is_your_fave_hidden_gem_on_netflix/"
    },
    {
        "id": "1lj3h1m",
        "author": "woovrsqt",
        "title": "does anybody know what’s going on/is anyone having similar issues?",
        "content": "The first photo is me trying to sign in on the website and the second is me trying to sign into the app. I know I used the correct password so idk what’s going on. The email address I used is an old one my mother had so sending a code to it would be pointless unless I can dig up some old phone that just so happens to be signed into it. I tried signing in on my tv and it just says I’m using the wrong password, but I’ve used this password any other time signing into the same devices and it’s worked just fine. Any suggestions?",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lj3h1m/does_anybody_know_whats_going_onis_anyone_having/"
    },
    {
        "id": "1ljd2na",
        "author": "No-Advance8976",
        "title": "anybody else unable to stream services?",
        "content": "Netflix crashed on me last night and it still isn’t working this morning. should i maybe uninstall and then reinstall it on the tv, or should i sign in and maybe sign back out? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ljd2na/anybody_else_unable_to_stream_services/"
    },
    {
        "id": "1liphjc",
        "author": "Significant-Skill156",
        "title": "Where's \"coming soon\" gone?",
        "content": "Sorry if this has already been answered but since Netflix changed the OS a few weeks ago, where has \"coming soon\" &amp; \"worth the wait\" gone? I don't understand why they've got rid of it?",
        "upvotes": 16,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1liphjc/wheres_coming_soon_gone/"
    },
    {
        "id": "1lj45mh",
        "author": "behelidt",
        "title": "Sex and the City gone on German Netflix",
        "content": "I had started watching Sex and The City (the original 1998 series) on Netflix about a week ago and yesterday noon it got removed and now it’s nowhere to be found. I know it’s been up since April, but it surely couldn’t have been up for barely three months. I know it got removed by noon, because I was watching up until that point in the morning and suddenly the stream stopped and I roundly play anymore. \nHas anyone experienced the same thing? \n\nI can’t find any information that in would only be up until June and Netflix also didn’t mention anything. Usually it says something like “last chance to watch”",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lj45mh/sex_and_the_city_gone_on_german_netflix/"
    },
    {
        "id": "1lj72px",
        "author": "igniz13",
        "title": "Raw and Smackdown reverting to the beginning of the show randomly?",
        "content": "Watching Raw and Smackdown on mobile and a few times in the last week, both shows have reverted to the start of the show, and it'll continue like it's the start of the show for a while. I have to skip forward and it might return to the regular show, but it can happen multiple times and sometimes doesn't seem to revert to the correct timestamp.\n\nHas anyone else seen this?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lj72px/raw_and_smackdown_reverting_to_the_beginning_of/"
    },
    {
        "id": "1lj5qud",
        "author": "Not-In-A-Tree",
        "title": "Help with a Netflix issue?",
        "content": "My Netflix has a lot of series missing (other people do have these series on their netflix) and I don't know why it is. For example, it doesn't have Apothecary Diaries, and others. Is there some way to fix this?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lj5qud/help_with_a_netflix_issue/"
    },
    {
        "id": "1lj4u2m",
        "author": "S4v1r1enCh0r4k",
        "title": "New Details Emerge About Tarantino-Verse Movie Directed by David Fincher, Netflix Involved?",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lj4u2m/new_details_emerge_about_tarantinoverse_movie/"
    },
    {
        "id": "1ljbxz1",
        "author": "sxfo_",
        "title": "PLEASE HELP ME FIND THIS SONGS NAME PLEASE",
        "content": "So recently i was watching the astro world documentary called Trainwreck The Astroworld Tragedy and Something really caught my attention it was a song that was cramped in the middle of talking and everything it’s really beautiful and i’ve been searching for the name of the song for around 2 days now please help me i’m losing my mind \n\nI uploaded the song sample and if you can’t really find it i’ll give you the time is was mentioned at in the documentary it starts at 6:58 and ends at 8:19 please help me find the songs name \n",
        "upvotes": 0,
        "comments": 3,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/dp6myelbtv8f1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1ljbxz1/please_help_me_find_this_songs_name_please/"
    },
    {
        "id": "1lix4py",
        "author": "17pounder",
        "title": "Is there any way to watch ATLA (2005) in Polish in Ireland?",
        "content": "Pretty much the title. I’ve changed the language settings to allow for Polish, and I know a dub exists, but I can’t seem to access it. This problem doesn’t occur for most other shows. Does Netflix just not have the rights to the Polish dub?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lix4py/is_there_any_way_to_watch_atla_2005_in_polish_in/"
    },
    {
        "id": "1li2xbf",
        "author": "BarracudaJazzlike730",
        "title": "Forget the critics, Tires is extremely funny",
        "content": "Tires is a great show. Absolutely hilarious. I have no idea why the critics (look at metacritic) gave the show terrible reviews. It's like a mix of the office meets East Bound and Down. Am I alone in thinking this show is awesome? ",
        "upvotes": 243,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1li2xbf/forget_the_critics_tires_is_extremely_funny/"
    },
    {
        "id": "1lifkfh",
        "author": "30HummingbirdLane",
        "title": "Favorite Monologue",
        "content": "What’s your favorite movie/TV monologue scene? \n\nPapa Pope from Scandal probably has some of the most memorable monologues for me. \n\nAdd your favorites. \n\n\n",
        "upvotes": 22,
        "comments": 14,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/xdgg82vw9o8f1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1lifkfh/favorite_monologue/"
    },
    {
        "id": "1lj8mje",
        "author": "emilywoods00",
        "title": "Did we ever find out who killed (read body text, cause I don't wanna give a spoiler) in Paranoid?",
        "content": "I watched the entire show, but admittedly did skip a few parts, cause it honestly got so repetitive and bland. So, did we ever find out who killed Angela? I'm losing my mind over it. The show could've been a 3 episode limited series for all the information we were given, but it ran for nearly 3 times as long",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lj8mje/did_we_ever_find_out_who_killed_read_body_text/"
    },
    {
        "id": "1liav4r",
        "author": "kuromisparkles",
        "title": "Suggest me your favorite documentary film!",
        "content": "I’ve been in a documentary mood lately and would love to hear your favorites. I recently watched AM: Laci Peterson documentary.\n\nWhat’s a documentary you really loved or that stuck with you long after watching? Could be about food, true crime, history, art, anything, really. I’m open to all kinds! Thanks.",
        "upvotes": 49,
        "comments": 144,
        "media": null,
        "permalink": "/r/netflix/comments/1liav4r/suggest_me_your_favorite_documentary_film/"
    },
    {
        "id": "1lixkfb",
        "author": "Rich-Ambassador9683",
        "title": "Recommendation",
        "content": "I am lost on what to watch on netflix .\nThese new shows aren't as much fun \nI liked blacklist, suits,  breaking bad, you, and many more old ones \nI would like a recommendation of something  not new but not too old either .\nBut it should have comedy as well not just thriller \nSomething nice ",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1lixkfb/recommendation/"
    },
    {
        "id": "1lj54nu",
        "author": "BoredBam_220",
        "title": "Double Charged.. Venting",
        "content": "My credit card has been compromised twice. \n\nOn April I was charged twice for Netflix Los Gatos SGP and Netflix Singapore SGP. I failed to notice this because I was busy being a phishing victim by Crunchy Roll something. \n\nCome now June 24, as i was going through statements i already noticed Los Gatos because the Ph has new tax so my acct (Singapore) adjusted the price for Netflix. Therefore the second charge (Los Gatos) should be invalidated. \n\nThis is the second time within two months that I changed cards. The Customer Service Rep gaslighting me that maybe i gave out my card numbers (like i was dumb enough for that) i can even cross examine scammers just with their calls. \n\nI just wanted to vent this out. Im so tired. Now i have to cut off my bank because I feel so unsecure with them. I’ll pay the entire amount due and cut them off. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lj54nu/double_charged_venting/"
    },
    {
        "id": "1lid639",
        "author": "MindFlourish2919",
        "title": "Should I watch Black Mirror?",
        "content": "I like anthology series because of the many stories it can bring. This show looks appealing because it focuses on technology and the flaws that humans have. Should I give it a shot?",
        "upvotes": 21,
        "comments": 61,
        "media": null,
        "permalink": "/r/netflix/comments/1lid639/should_i_watch_black_mirror/"
    },
    {
        "id": "1li5zd2",
        "author": "Tell-Uh-Tubbie",
        "title": "Sirens could be better",
        "content": "My review........it was....OK.  Julianne Moore was great...as expected.  I feel like she's super hot these days....very deserved!.  Milly Alcock...also great! Both held their part of the bargain...great actresses!   The storyline was ...meh if I'm gonna be honest.   The success of this series was really based on the cast...not the story line.  I felt that the real interest was in Meghann Fahy and Felix Solis' characters. Their chemistry was amazing and I wanted to see more! Her and his backstory, ,  how this cult started, who was the first wife, \"hey hey\"? Josh Segarra's character? Like wtf is that about? There is soooo much more to unpack here that is bigger than this storyline! PLEASE MAKE A PREQUEL  or a spinoff with Meghann Fahy and Felix Solis!.  So many questions unanswered!",
        "upvotes": 65,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1li5zd2/sirens_could_be_better/"
    },
    {
        "id": "1ljai6n",
        "author": "ScratchAny1468",
        "title": "Waterfront worst netflix movie ever",
        "content": "the acting is bad..you cant follow the different plots that come up…boring and just the worst netflix movie i even seen you already know the ending ..movie lots dont make sense ",
        "upvotes": 0,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1ljai6n/waterfront_worst_netflix_movie_ever/"
    }
]