[
    {
        "id": "1k6riqi",
        "author": "CheechandChong-AMA",
        "title": "Hey man, we're Cheech and Chong, we’re doing one of those Ask Us Anything things. You can ask about our lives, careers, or new movie (Cheech and Chong's Last Movie) and we’ll do our best to remember things. Bring a bud and a snack or two, just no math questions please.",
        "content": "Hey man, we're Cheech and Chong, we’re doing one of those Ask Us Anything things. You can ask about our lives, careers, or new movie (Cheech and Chong's Last Movie) and we’ll do our best to remember things. Bring a bud and a snack or two, just no math questions please. \n\nWe'll be back at 4 PM ET today to answer your quesitons.\n\nMore info about our new movie:\n\nOfficial Trailer:\n\n[https://www.youtube.com/watch?v=yFZaR4ubS20](https://www.youtube.com/watch?v=yFZaR4ubS20)\n\nCHEECH &amp; CHONG’S LAST MOVIE – Exclusively in Theaters Friday 4/25 🥦\n\nIn the 1970s, Cheech &amp; Chong redefined stand-up comedy, blending drugs, sex, rock’n’roll, and improvisation into a genre-shaping act. Their multicultural, irreverent humor turned them into icons, counterculture rock stars, and Hollywood legends. How did Cheech and Chong ignite imaginations and stay relevant over 50 years? Join them for one last ride to find out... and bring a bud!\n\nDirected by: David Bushell\n\nProduced by: David Bushell and Robbi Chong\n\nStarrirg: Cheech Marin and Tommy Chong",
        "upvotes": 4348,
        "comments": 670,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/49f8k6yg5swe1.png?auto=webp&amp;s=6f02add6c1451bd7f77e76129c4ae7557293a6e5"
        },
        "permalink": "/r/movies/comments/1k6riqi/hey_man_were_cheech_and_chong_were_doing_one_of/"
    },
    {
        "id": "1k6ywov",
        "author": "Mickey17AMA",
        "title": "Hi /r/movies - I'm Stuart Penn, VFX Supervisor for Mickey 17 (as well as Moon Knight, Loki, Avengers: Endgame, Paddington 2, Alien: Covenant, Venom 2, and recent Doctor Who episode 'Lux'). My team created the baby creepers, mother, and the ice cavern environments for Mickey 17. Ask Me Anything!",
        "content": "Hi r/movies \\- I'm Stuart Penn, VFX Supervisor for Mickey 17 (as well as Moon Knight, Loki, Avengers: Endgame, Paddington 2, Aline: Covenant, and recent Doctor Who episode 'Lux'). My team created the baby creepers and ice cavern environments for Mickey 17. Ask Me Anything!\n\nHere are all of my credits:\n\n[https://www.imdb.com/name/nm1176327/](https://www.imdb.com/name/nm1176327/)\n\nI'll be back tomorrow (Friday 4/25) at 10:00 AM ET to answer your questions. Please feel free to ask away in the meantime.\n\nMore information:\n\nMickey 17 was written, produced, and directed by Bong Joon Ho, (Parasite, Snowpiercer, Okja, Memories of Murder, The Host)\n\nThe film stars Robert Pattinson in the title role, alongside Naomi Ackie, Steven Yeun, Toni Collette, and Mark Ruffalo. Set in the year 2054, the plot follows a man who joins a space colony as an \"Expendable\", a disposable worker who gets cloned every time he dies.\n\nTrailer:\n\n[https://www.youtube.com/watch?v=osYpGSz\\_0i4](https://www.youtube.com/watch?v=osYpGSz_0i4)\n\nFramestore VFX Supervisor Stuart Penn and his team created the mother and baby creepers, as well as the ice cavern environments, working closely with Director Bong Joon Ho.",
        "upvotes": 779,
        "comments": 79,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/fna7sd36otwe1.png?auto=webp&amp;s=f9075c344bc679024be1b322226a962a7b14b0fc"
        },
        "permalink": "/r/movies/comments/1k6ywov/hi_rmovies_im_stuart_penn_vfx_supervisor_for/"
    },
    {
        "id": "1k6ttdz",
        "author": "BunyipPouch",
        "title": "First Image from Netflix's Mystery-Comedy 'The Thursday Murder Club' - Starring Helen Mirren, Pierce Brosnan, Ben Kingsley, Richard E. Grant, Naomi Ackie, and Jonathan Pryce - Four retirees spend their time solving cold case murders for fun, until they find themselves stuck in a real whodunit.",
        "content": "",
        "upvotes": 6675,
        "comments": 389,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zyathbiinswe1.jpeg?auto=webp&amp;s=b66582a4c04c65c89cf6646b67a292620241a381"
        },
        "permalink": "/r/movies/comments/1k6ttdz/first_image_from_netflixs_mysterycomedy_the/"
    },
    {
        "id": "1k71xfp",
        "author": "orthos",
        "title": "One of my favorite movie scenes ever - Amadeus (1984) - Salieri realizes he will never be on Mozart's level of genius.",
        "content": "",
        "upvotes": 986,
        "comments": 143,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_o44XPMi0SEMntLV14bHhe-ZughQZaPKN-vtKek2G4c.jpeg?auto=webp&amp;s=cbb88d87a7fc8c464349f198a04bef6338348835"
        },
        "permalink": "/r/movies/comments/1k71xfp/one_of_my_favorite_movie_scenes_ever_amadeus_1984/"
    },
    {
        "id": "1k72l9p",
        "author": "Past-Outside8050",
        "title": "What's the greatest fake sports moment or athlete cameo in a movie or TV show?",
        "content": "What's the greatest fake sports moment or athlete cameo in a movie or TV show? I know there  are a lot to choose from. I think it’s even better when the athletes go along with the joke. \n\nMy answer is Mark Wahlberg’s character in the Other Guys. If you don’t know he plays a cop and accidentally shot Derek Jeter on the night of game 7 of the World Series. \n\n",
        "upvotes": 357,
        "comments": 515,
        "media": null,
        "permalink": "/r/movies/comments/1k72l9p/whats_the_greatest_fake_sports_moment_or_athlete/"
    },
    {
        "id": "1k70ec4",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Guy Ritchie’s ‘The Fountain of Youth’",
        "content": "",
        "upvotes": 371,
        "comments": 105,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/skhofj92ztwe1.jpeg?auto=webp&amp;s=180f570b397b4dbffdfeb63d16dd28db5d5b5eb8"
        },
        "permalink": "/r/movies/comments/1k70ec4/official_poster_for_guy_ritchies_the_fountain_of/"
    },
    {
        "id": "1k70824",
        "author": "Ticus6866",
        "title": "Whiplash ending hit like a truck, and I can’t stop thinking about how neither of them were really victims.",
        "content": "Just rewatched Whiplash and that ending hit different this time. Everyone talks about how epic the final scene is and it is but TBH it kind of cemented how much Andrew completely lost the plot by then.\n\nThe whole movie builds up this toxic cycle between him and Fletcher, and yeah, it looks like Fletcher is the manipulative villain while Andrew is just this ambitious underdog. But by the end, it’s not that simple. Andrew needs Fletcher’s validation. He’s been so brainwashed that he’ll go to any length for that one moment of acknowledgment.\n\nAnd Fletcher.. well he’s a wreck too. He loses his job, his respect, everything but still clings to this idea that greatness only comes from suffering. In that final scene, he basically traps Andrew, tries to humiliate him and Andrew still gives him what he wants. It’s messed up. They’re not enemies, they’re enablers.\n\nThere’s no real “winner” here. They both pushed each other past the edge. And while it ends with that incredible solo, it’s not triumphant. It’s tragic. Andrew isn’t free..he’s all in, and there’s no coming back. He’s chasing this impossible standard that’ll probably destroy him.",
        "upvotes": 328,
        "comments": 99,
        "media": null,
        "permalink": "/r/movies/comments/1k70824/whiplash_ending_hit_like_a_truck_and_i_cant_stop/"
    },
    {
        "id": "1k6yvw7",
        "author": "ChiefLeef22",
        "title": "'Havoc' - Review Thread",
        "content": "Director: Gareth Evans\n\nCast: Tom Hardy,  Jessie Mei Li, Timothy Olyphant, Forest Whitaker, Justin Cornwell\n\nLogline: *After a drug deal gone wrong, a bruised detective must fight his way through the criminal underworld to rescue a politician's estranged son, unravelling a deep web of corruption and conspiracy that ensnares his entire city.*\n\n**Rotten Tomatoes:** [67/100](https://www.rottentomatoes.com/m/havoc_2025)\n\n**Metacritic:** [59/100](https://www.metacritic.com/movie/havoc/)\n\nSome Reviews:\n\n[The Hollywood Reporter - David Rooney](https://www.hollywoodreporter.com/movies/movie-reviews/havoc-review-tom-hardy-gareth-evans-netflix-1236198216/)\n\n&gt;With Hardy in fine form at the wheel, *Havoc* knows what its audience wants. It also looks great, with regular Evans DP Matt Flannery’s dynamic cameras zipping in and out of the bloody fray and textured visuals slashed with throbbing colors. The setting is a city so grim and seedy it seems to exist only at night. The fact that the environments were mostly constructed at a studio in Cardiff suggests there’s lots of ace craftspeople hiding out in Wales.\n\n[SlashFilm - Chris Evangelista](https://www.slashfilm.com/1842207/havoc-movie-review-tom-hardy-gareth-evans/)\n\n&gt;To be clear: I love a good, violent action movie as much as the next dude, but you have to give me something more than just one extreme shootout followed by another. Perhaps if the hyperviolence was a little more stylized it would play better. Instead, it's just ugly stuff repeated in numbing fashion. By the time \"Havoc\" ended, I felt as exhausted as Hardy's beaten and bruised character. I suppose Evans and company deserve some credit for making an action movie that really leans into the brutality, but there's only so much of that you can put up with before it starts to grow tedious.\n\n[Variety - Peter Debruge](https://variety.com/2025/film/reviews/havoc-review-tom-hardy-gareth-evans-1236375320/)\n\n&gt;There’s a reason big-studio producers looked to Sundance darlings like Colin Trevorrow, Rian Johnson and Jon Watts to handle their tentpoles: not because those guys are great at action, but because they keep the interpersonal dynamics interesting. That’s precisely where Evans wreaks the most havoc, ignoring (or simply not understanding) what connects us to such characters in the first place — and therefore ensuring that his unwieldy Netflix vehicle is dead on arrival.\n\n[NextBestPicture - Giovanni Lago](https://nextbestpicture.com/havoc/) \\- 6/10\n\n&gt;After years of waiting, it feels like “Havoc” was never going to reach the pre-conceived levels of hype that it was supposed to live up to. It’s clear that whenever certain moments were filmed years later than the original period of principal photography (mainly due to Hardy’s more than apparent changes in beard thickness), there’s doubt it made any real difference in the final cut that Evans envisioned. Still, when “Havoc” hits, it only reminds us how awesome it feels when Evans gets to do his own thing. Even a flawed Gareth Evans film satisfies more than most action flicks today.\n\n[Empire - Beth Webb](https://www.empireonline.com/movies/reviews/havoc/) \\- 4/5\n\n&gt;There’s also something refreshingly egoless to it; Hardy may have top billing but takes not only many sucker punches to the face but an entire roof to the head. Around him Evans utilities his full cast, throwing greener actors like Quelin Sepulveda, who plays Charlie’s partner Mia, into the eye of the storm, armed with a meat cleaver and a mission to survive. The result is a throbbing, bone-crunching diorama of violence with the occasional horrifying, glorious flourish (you’ll never want to see a fishing harpoon again).\n\n[Slant Magazine - Jake Cole](https://www.slantmagazine.com/film/havoc-review-tom-hardy-gareth-evans/)\n\n&gt;Instead of elaborate exchanges of close-quarters strikes and counters, the characters here tend to get the upper hand based on who has the quickest reflexes in tackling an assailant or getting a block up at the last possible second. Despite the advanced choreography that Evans and Flannery capture with a generally superior sense of visual fluidity than they displayed in the *Raid* movies, there’s an overwhelming sense of chaos here that feels realistic.\n\n[Nick Schager - The Daily Beast](https://www.thedailybeast.com/obsessed/tom-hardys-havoc-review-the-action-extravaganza-of-the-year/)\n\n&gt;*Havoc* is such relentless, hardhearted business that the squeamish need not enlist. Nonetheless, those with a hankering for escalating insanity will be well satiated by this saga, whose narrative convolutions are untangled in a second half that puts a premium on combat. Disappointingly, Evans (who wrote the script) shortchanges Olyphant in a role that’s barely one-dimensional and receives no stand-out moments—to a large extent because he shares only scant screen time with Hardy. The director makes up for it, however, with a barrage of broken bones and mutilated corpses—and set pieces drenched in slow motion and decorated with flying glass, splinter, and bodily debris—that tips the material into sensory-overload territory.\n\n[Collider - Tania Hussain](https://collider.com/havoc-movie-review-netflix-tom-hardy/)\n\n&gt;*Havoc* might deliver on its promise of blood, guts, and glory, but it’s these committed performances that keep it from completely collapsing under its self-induced chaos. While the vision by Evans swings hard as a stylishly savage brawler, it rarely lands with meaning, which also feels like an injustice to the filmmaker’s incredible past work. Despite a top-tier cast and bone-rattling action to keep you engaged, the Netflix flick buckles under a cluttered story with chaotic execution. It’s watchable, even entertaining in bursts — but beneath all the bruises and broken bones, there’s not much else to hold onto.\n\n[IndieWire - David Ehrlich](https://www.indiewire.com/criticism/movies/havoc-review-netflix-tom-hardy-1235117850/?utm_campaign=trueanthem&amp;utm_medium=social&amp;utm_source=twitter) \\- B-\n\n&gt;Rote as Evans’ plot might be, and wasteful as its treatment of certain characters *definitely* is (pour one out for Jessie Mei Li, whose screen time as Walker’s new partner greatly outweighs her purpose to the story), he has a well-developed ear for ice-cold gangster speak, and he isn’t afraid to make people pay a steep price for their penance. It’s enough to forgive him — and/or the movie gods — for making us wait so long to see him do it again. ",
        "upvotes": 234,
        "comments": 113,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7hWAQleIbcA6y75_a03X6blRKmGvmi0ViOAiY80WWqU.jpg?auto=webp&amp;s=8cd1f6d1c9117179cc576e9fc628451fcf1cf688"
        },
        "permalink": "/r/movies/comments/1k6yvw7/havoc_review_thread/"
    },
    {
        "id": "1k6uxsf",
        "author": "cmaia1503",
        "title": "Chloe Zhao’s ‘Hamnet,’ Starring Paul Mescal and Jessie Buckley, Sets November 27th Release Date",
        "content": "",
        "upvotes": 344,
        "comments": 53,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ZbukI1OVl6GWpIQhB5rVLqRgPzuaSeRXe9ZFXg_ygoQ.jpg?auto=webp&amp;s=bd43d18b911f6255f6c3367ba22c94ac0561a973"
        },
        "permalink": "/r/movies/comments/1k6uxsf/chloe_zhaos_hamnet_starring_paul_mescal_and/"
    },
    {
        "id": "1k69iod",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for ‘Pee-wee as Himself’",
        "content": "",
        "upvotes": 8263,
        "comments": 588,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/v08wrwas9nwe1.jpeg?auto=webp&amp;s=9287d80c9fbd39fc3172ef2d64b3507c704756ef"
        },
        "permalink": "/r/movies/comments/1k69iod/official_poster_for_peewee_as_himself/"
    },
    {
        "id": "1k6vy1y",
        "author": "KillerCroc1234567",
        "title": "‘Ballerina’: Exclusive Character Posters from the John Wick Universe Movie",
        "content": "",
        "upvotes": 191,
        "comments": 51,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/AeHF_yE-qyrivaC3tvd5_qe35iTU-e7bX0lqOM1viJo.jpg?auto=webp&amp;s=3a903238f8fdf1f90b4d9a31d81941877266eccf"
        },
        "permalink": "/r/movies/comments/1k6vy1y/ballerina_exclusive_character_posters_from_the/"
    },
    {
        "id": "1k71dlk",
        "author": "dcterr",
        "title": "The Gods Must Be Crazy",
        "content": "How many of you watched this one? If not, I highly recommend it! I think it captures quite well what's wrong with \"civilized men\", in particular, to how we relate to more \"primitive societies\", and I think it has a very strong moral message, or perhaps a few! In addition, I think the story is quite entertaining and inspiring. Watch where you drop your Coke bottle!",
        "upvotes": 90,
        "comments": 36,
        "media": null,
        "permalink": "/r/movies/comments/1k71dlk/the_gods_must_be_crazy/"
    },
    {
        "id": "1k6wpmp",
        "author": "cmaia1503",
        "title": "‘Hunger Games: Sunrise On The Reaping’ Movie At Lionsgate Taps Mckenna Grace In Maysilee Donner Role",
        "content": "",
        "upvotes": 142,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Uf3vqLNngnQoPq4ibYpA5UxTPxukloNv6BlFFQysl6c.jpg?auto=webp&amp;s=b580421a26821546c3d35b254a2abc554b8b0e5d"
        },
        "permalink": "/r/movies/comments/1k6wpmp/hunger_games_sunrise_on_the_reaping_movie_at/"
    },
    {
        "id": "1k75qcp",
        "author": "verissimoallan",
        "title": "'Friday the 13th Part VII’ Star Lar Park Lincoln Has Passed Away",
        "content": "",
        "upvotes": 45,
        "comments": 4,
        "media": null,
        "permalink": "/r/movies/comments/1k75qcp/friday_the_13th_part_vii_star_lar_park_lincoln/"
    },
    {
        "id": "1k71c2e",
        "author": "StellaZaFella",
        "title": "In Casino, why did Ace trust Ginger when it was clear she shouldn't/couldn't be trusted?",
        "content": "At the beginning of Casino, there's a voiceover of Ace where he says, \"When you love someone, you gotta trust them, there's no other way. You've got to give them the key to everything that's yours. Otherwise, what's the point? And for a while, that's the kind of love I believed I had\". \n\nHow did Ace ever trust Ginger as much as he did? He's a smart guy, and suspicious of everyone. He knew she was a hustler/grifter. And there are moments pretty early on where she blatantly lies to him or cheats him--when she takes money for a drink and doesn't give him change and says she spent it on some tables on the way back; when she calls Lester after their wedding. \n\nI don't get why he was so blind to her being untrustworthy to the point he gives her the only key to the money that might need to be used to get him out of trouble. (And I'm surprised she didn't take any of it before the end of things.)\n\nAm I missing something--why did Ace think he had the kind of love where he could trust her with everything when she never showed herself to be worthy of that trust in the first place? ",
        "upvotes": 81,
        "comments": 66,
        "media": null,
        "permalink": "/r/movies/comments/1k71c2e/in_casino_why_did_ace_trust_ginger_when_it_was/"
    },
    {
        "id": "1k6vy5t",
        "author": "Task_Force-191",
        "title": "Fountain of Youth — Official Trailer 2 | Apple TV+",
        "content": "",
        "upvotes": 119,
        "comments": 93,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BEBuJpjQelvxeEDMwJzf7dOiLfoD4ccbYZ8MJ5YWdaE.jpg?auto=webp&amp;s=e99483c3aae488e4a8c89bdabf43e6240b234d82"
        },
        "permalink": "/r/movies/comments/1k6vy5t/fountain_of_youth_official_trailer_2_apple_tv/"
    },
    {
        "id": "1k6s3wt",
        "author": "MarvelsGrantMan136",
        "title": "New Character Posters for ‘Mission: Impossible – The Final Reckoning’",
        "content": "",
        "upvotes": 137,
        "comments": 71,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BZ2GvoTSFT5pK0l9HETouDlFSzyuLfpnEgUukEyIpKk.jpg?auto=webp&amp;s=25a68c54017aa9c039db4c0e7a6f93cc0617d29b"
        },
        "permalink": "/r/movies/comments/1k6s3wt/new_character_posters_for_mission_impossible_the/"
    },
    {
        "id": "1k74918",
        "author": "KillerCroc1234567",
        "title": "TCM Classic Film Festival To Open With George Lucas And ‘The Empire Strikes Back’ &amp; More Popular Blockbusters Than Ever From ‘Jaws’ To ‘Back To The Future’ To ‘Superman’",
        "content": "",
        "upvotes": 28,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8PEsJ8VGaQ_Rn-JiNCmoTbpZ0Emtv8SebdnbzA1Urp0.jpeg?auto=webp&amp;s=9576398d7a2de653314736a6be24b37f44be78df"
        },
        "permalink": "/r/movies/comments/1k74918/tcm_classic_film_festival_to_open_with_george/"
    },
    {
        "id": "1k674z3",
        "author": "MovieMike007",
        "title": "Small Soldiers is getting a 4K release!",
        "content": "",
        "upvotes": 3532,
        "comments": 187,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5DWgQrEF1wIIxmLh3whsm9CR5-WGSqjszIjBPPzZJPA.jpg?auto=webp&amp;s=a2d2e50cdf0397f363f4403e12a14837b6522328"
        },
        "permalink": "/r/movies/comments/1k674z3/small_soldiers_is_getting_a_4k_release/"
    },
    {
        "id": "1k78z5l",
        "author": "Mu5hroomHead",
        "title": "What’s Your Favourite Scene Where the Antagonist Gets Roasted?",
        "content": "One of my favourite scenes is when Skeeter’s mother rips Hilly a new one in the movie The Help. \n\nIn this scene, Hilly comes to confront Skeeter about the book she wrote and complain to Mrs. Phelan about her daughter. Instead of chastising her daughter, Mrs. Phelan tells Hilly to “Get your raggedy ass off my porch”, as well as a few other choice words. \n\nAllison Janney’s delivery (Mrs. Phelan) is stone-cold. Bryce Dallas Howard (Hilly) does a phenomenal job of playing such a repulsive character. \n\nWhat’s your favourite scene where the protagonist or another character goes off on someone well deserved? ",
        "upvotes": 12,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3JTFTvC6mNGxL4IvkG5YGatTZZn0Cmw0r5kx8x1BKEQ.jpg?auto=webp&amp;s=07d10c6ef4ce142bee1b9a889c2e53f44827ec51"
        },
        "permalink": "/r/movies/comments/1k78z5l/whats_your_favourite_scene_where_the_antagonist/"
    },
    {
        "id": "1k62ukd",
        "author": "MarvelsGrantMan136",
        "title": "Predator: Badlands | Official Trailer",
        "content": "",
        "upvotes": 5382,
        "comments": 987,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/12ONIMLo4tbvuateaaM1xV5QLJk1WkhL_QY4k6r2nqo.jpg?auto=webp&amp;s=ddc7ad071b142026aba68345f6bae2bcaba68e95"
        },
        "permalink": "/r/movies/comments/1k62ukd/predator_badlands_official_trailer/"
    },
    {
        "id": "1k604ia",
        "author": "MarvelsGrantMan136",
        "title": "New Posters for A24's 'Friendship' Starring Tim Robinson &amp; Paul Rudd",
        "content": "",
        "upvotes": 6379,
        "comments": 361,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/alomloqzdlwe1.jpeg?auto=webp&amp;s=c284cf7ac4328c1f107a70a5eff73b2451cd4c11"
        },
        "permalink": "/r/movies/comments/1k604ia/new_posters_for_a24s_friendship_starring_tim/"
    },
    {
        "id": "1k6rpwx",
        "author": "uselesssociologygirl",
        "title": "What's a scene in a movie that really stayed with you?",
        "content": "So I'm of the opinion that everyone has that one scene that really stayed with them (or multiple), something that really pops into your head often and seemingly at random. So what's yours? Why do you think it's that one specifically?\n\nMine might be the Mockingjay pt 1 scene where Katniss talks to Snow during the rescue mission. Reinforces the idea that The Mockingjay could have been anyone, Katniss isn't special and isn't a revolutionary. She is just a girl trying to survive, and one of the most iconic quotes of the movies is said in the scene",
        "upvotes": 73,
        "comments": 273,
        "media": null,
        "permalink": "/r/movies/comments/1k6rpwx/whats_a_scene_in_a_movie_that_really_stayed_with/"
    },
    {
        "id": "1k761nm",
        "author": "Ghostmoderator",
        "title": "Which sports movie made you want to play that sport?",
        "content": "This probably happens a lot less as an adult, but I think every one of us as a kid saw a movie and right after it we wanted to play that sport. I don't necessarily mean professionally. I mean, you just wanted to go out and do what you saw in the movie. I remember after watching kingpin me and my sister wanted to go bowling. She also wanted me to train her how to box after we watched Rocky.",
        "upvotes": 12,
        "comments": 66,
        "media": null,
        "permalink": "/r/movies/comments/1k761nm/which_sports_movie_made_you_want_to_play_that/"
    },
    {
        "id": "1k6tg5g",
        "author": "ChiefLeef22",
        "title": "'Until Dawn' - Review Thread",
        "content": "*One year after her sister disappeared, Clover and her friends head to the remote valley where she vanished to search for answers. Exploring an abandoned visitor center, they soon encounter a masked killer who murders them one by one. However, when they mysteriously wake up at the beginning of the same night, they're forced to relive the terror over and over again.*\n\n**Rotten Tomatoes:** [61%](https://www.rottentomatoes.com/m/until_dawn_2025)\n\n**Metacritic:** [53/100](https://www.metacritic.com/movie/until-dawn/)\n\nSome Reviews:\n\n[AV Club - Jacob Oller](https://www.avclub.com/until-dawn-review) \\- D+\n\n&gt;Horror, whether in games or in movies, is about setups and payoffs. *Until Dawn* is a film almost exclusively of setups, with the payoffs either mismatched or permanently deferred. In its indecision around what kind of film it wanted to turn a decision-driven game into, firing its shotgun approach haphazardly into the air, it incoherently spins itself in circles.\n\n[Inverse - Lyvie Scott](https://www.inverse.com/entertainment/until-dawn-review-horror-video-games)\n\n&gt;Throws plot out the window in favor of gore and schlock. \\[Using\\] a time-loop conceit to replicate the feeling of respawning in a video game, it gives director David F. Sandberg an excuse to blitz through as many teen horror tropes as can fit in two hours.\n\n[Screen Rant](https://www.rottentomatoes.com/critics/source/1647) \\- [Mary Kassel](https://www.rottentomatoes.com/critics/mary-kassel) \\- 8/10\n\n&gt;Until Dawn takes the trope of the time loop &amp; raises the stakes, immersing us in a thrilling &amp; dynamic world of characters we can't stop rooting for. The movie is at its best when it's not taking itself too seriously. ***Until Dawn***\\*\\*'s weakest moments are when the action slows down and the writing attempts to psychoanalyze Clover\\*\\* and her issues. While it's necessary for her to have a fraught emotional backstory and for there to be hints of development, these transitions are far from seamless. Like all scary movies, *Until Dawn* sprinkles in commentary about the nature of grief and fear. However, it doesn't waste too much time trying to have a message, as it knows that isn't what the story is for.\n\n[Slashfilm](https://www.rottentomatoes.com/critics/source/1996) \\- [Bill Bria](https://www.rottentomatoes.com/critics/bill-bria) \\- 8/10\n\n&gt;Although the film is deliberately not a repetition of the video game's plot, it absolutely adapts the game's implicit concept of asking the player whether they could actually survive a horror movie or not. \"Until Dawn\" the movie subtextually asks those questions of its viewers throughout, and with so many various beasties to encounter, the answers will vary for each person alone, never mind for multiple people. The movie's variety is the peanut butter to that idea's chocolate, never allowing the film to feel stuck in one mode even as it establishes its own structure. To borrow a phrase from Bobby, \"Until Dawn\" really does feel like the platonic ideal of a graveyard smash.\n\n[FandomWire](https://www.rottentomatoes.com/critics/source/100009878) \\- [Manuel São Bento](https://www.rottentomatoes.com/critics/manuel-sao-bento) \\- B+\n\n&gt;Ella Rubin stands out in a cast that meets the bare minimum, and David F. Sandberg proves yet again that he's a filmmaker with vision, talent, and the creativity to craft visually captivating horror sequences.\n\n[IGN Movies](https://www.rottentomatoes.com/critics/source/811) \\- [Chase Hutchinson](https://www.rottentomatoes.com/critics/chase-hutchinson) \\- 5/10\n\n&gt;Until Dawn shares a title and some key details with the game that inspired it, though it mostly tries to do its own thing – to mixed results. While Annabelle: Creation director David F. Sandberg is able to find moments of bloody fun and tension – particularly in the way he shoots darkness – the lackluster script he’s working with isn’t doing him or the movie any favors. It isn’t a total disaster, but as it pushed its one-dimensional characters through a cycle of horror cinema’s greatest hits, I wished that the morning could come as quickly as possible.\n\n[The Daily Beast](https://www.rottentomatoes.com/critics/source/2345) \\- [Nick Schager](https://www.rottentomatoes.com/critics/nick-schager)\n\n&gt;Given that the game was co-penned by indie-horror icon Larry Fessenden (*Wendigo*), it’s somewhat baffling that *Until Dawn* ditches his story in favor of something this run-of-the-mill and half-baked. Despite an under-30 cast that’s perfectly capable of running and screaming when necessary (which is often), there’s no personality to this pandemonium, its evil beasts generic and its relive-the-night structure under-exploited.",
        "upvotes": 64,
        "comments": 73,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/oKXFvwjBip9y1L22DSzghdhliQH4z4Q1rzQ1zQskUmE.jpg?auto=webp&amp;s=7c1163d4b7b8f25e135e20f4e0e6fa6d5a44699a"
        },
        "permalink": "/r/movies/comments/1k6tg5g/until_dawn_review_thread/"
    },
    {
        "id": "1k6szdi",
        "author": "Faust_8",
        "title": "What’s a quip you’ve heard that you adopted into your own vocabulary?",
        "content": "Movies have lots of pithy sayings and cool one-liners, but we don’t always use those lines in our own day to day lives. But sometimes they’re funny enough or quick enough or expressive enough that we end up adding it into our own lexicon of phrases. \n\nAs one example for me personally, in The Incredibles when Bob aka Mr. Incredible lost his cool and threw his boss through several walls and outed himself as a secret Super, and he remarks to his government agent buddy that he thinks he’s fired, and his buddy just gives him the sarcastic “oh, you think?”\n\nI’ve definitely said that or thought that, exactly the way he said it, in my life when an incredibly obvious statement or question comes up. \n\nWhat’s yours?",
        "upvotes": 65,
        "comments": 300,
        "media": null,
        "permalink": "/r/movies/comments/1k6szdi/whats_a_quip_youve_heard_that_you_adopted_into/"
    },
    {
        "id": "1k6ts6o",
        "author": "FilmWaffle-FilmForum",
        "title": "What movies have bittersweet endings?",
        "content": "First one that comes to mind is Rogue One. I’m pleased they went with the ending they did, that being said, I can’t help but feel sorry for the characters. They completed the mission in exchange for their lives. My personal favourite Star Wars movie.\n\nWhat other movies can you think of with bittersweet endings?",
        "upvotes": 47,
        "comments": 93,
        "media": null,
        "permalink": "/r/movies/comments/1k6ts6o/what_movies_have_bittersweet_endings/"
    },
    {
        "id": "1k62x3f",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Dan Trachtenberg's 'Predator: Badlands'",
        "content": "",
        "upvotes": 2483,
        "comments": 156,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jofk4eyeylwe1.jpeg?auto=webp&amp;s=836bd57527270bb6591e76c0a558aa62a3ca55d4"
        },
        "permalink": "/r/movies/comments/1k62x3f/official_poster_for_dan_trachtenbergs_predator/"
    },
    {
        "id": "1k6y788",
        "author": "samx3i",
        "title": "If your country/state/city/town or whatever had an official movie, what would it be and why?",
        "content": "f your country, state, city, or town had an official movie that captures its vibe, what would it be and why?\n\nI’m in New England, and I’d say Boston’s gotta be The Departed. For New Hampshire? Probably Jumanji—small-town energy meets chaotic wilderness. For New England broadly, maybe The Lighthouse.\n\nWhat’s yours? Let’s hear it, Reddit!",
        "upvotes": 20,
        "comments": 164,
        "media": null,
        "permalink": "/r/movies/comments/1k6y788/if_your_countrystatecitytown_or_whatever_had_an/"
    },
    {
        "id": "1k64fnp",
        "author": "ASadBurrito",
        "title": "Fake (AI) Trailers are becoming a problem, in my opinion",
        "content": "Around Christmas time my mother was visiting my family and just casually we started talking upcoming movies. She then proceeded to get excited about the \"new\" twilight movie with all the original cast. She showed this trailer to my wife and myself and it was blatantly fake so we informed her. \nWith that context in mind of both my wife and me being able to spot it, my wife today sent me a trailer for \"The Conjuring: Last Rites\" and she was convinced it was real. There are tell tell signs like clips from previous movies, completely unrelated movies such as \"The Woman in the Yard\" and most egregiously, shots of the cast, alone, just kinda motionless or the camera panning slowly. \n\nMy main issue is the people posting these having no indication it's fake, or a concept trailer or anything, just very misleading. \n\nI don't necessarily have a problem with their existence, creative liberty and all that, and with AI it give people a chance to easily put ideas out there, however, is preface that fake trailers, regardless of intention, should give the watcher the knowledge, easily accessible, to know it is indeed not real.\n\nAm I alone on this?",
        "upvotes": 1742,
        "comments": 301,
        "media": null,
        "permalink": "/r/movies/comments/1k64fnp/fake_ai_trailers_are_becoming_a_problem_in_my/"
    },
    {
        "id": "1k74e0n",
        "author": "Streetwatching",
        "title": "Love this Esquire interview with the American Psycho costume designer!",
        "content": "",
        "upvotes": 10,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/efJgM2lmErGr_r8e44BIG2UK6YvIjgDIL3WX4gju_AU.jpg?auto=webp&amp;s=6cf540a795fe1ff50c01bca45669c114ca92ea70"
        },
        "permalink": "/r/movies/comments/1k74e0n/love_this_esquire_interview_with_the_american/"
    },
    {
        "id": "1k5wr5g",
        "author": "Chai_Lijiye",
        "title": "Brad Pitt, Robert Downey jr and Keanu Reeves all unsuccesfully audition for the role in BACKDRAFT that went to William Baldwin.",
        "content": "",
        "upvotes": 3272,
        "comments": 300,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/o4ua9msykkwe1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1k5wr5g/brad_pitt_robert_downey_jr_and_keanu_reeves_all/"
    }
]