[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 49,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 17,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qzv1ag",
        "author": "No_Pop7296",
        "title": "[DISCUSSION] Unfamiliar— German Spy show. It’s really good, hooks you from the start 👍👍",
        "content": "I was looking for something similar to Slow Horses after finishing that and came across this. Considering I’m also watching S2 of Dark it seems I’m destined to watch German content…\n\nIch sollte Deutsch lernen…. ",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1qzv1ag/discussion_unfamiliar_german_spy_show_its_really/"
    },
    {
        "id": "1qze36m",
        "author": "Lucariusssss96",
        "title": "What do you think of Sense 8? Is it good?",
        "content": "Hello!! I’m looking for some series to watch on Netflix. I wanna start watching Sense 8 but I just wanna know your opinions about the show. Is it worth watching? Thank you so much!! :) ",
        "upvotes": 29,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1qze36m/what_do_you_think_of_sense_8_is_it_good/"
    },
    {
        "id": "1qzwpx7",
        "author": "NewMistake2586",
        "title": "Helpp, borders turn black and white",
        "content": "The borders flicker black and white when I put it on full screen, I don't know why it's like this. The chrome browser netflix is fine, but the downloaded app flickers.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qzwpx7/helpp_borders_turn_black_and_white/"
    },
    {
        "id": "1qyt3on",
        "author": "the_al_coco",
        "title": "Secret Mall Apartment on Netflix... genius art project or peak privilege?",
        "content": "I just finished Secret Mall Apartment and I honestly don't know where I stand on it. The story is a total 2000s fever dream. It’s about eight artists building a hidden 750sq-ft flat inside a Rhode Island mall and living there for years. The lo-fi footage they captured back in 2003 is incredible, but the doc raises some massive questions that I haven't stopped thinking about.\n\nOn one hand, you have Michael Townsend and his crew, who frame this as a \"living art\" protest against corporate gentrification. You can’t help but be impressed by the pure audacity it took to smuggle cinder blocks and furniture past security for four years. For the \"art is life\" crowd, it’s an inspiring story about reclaiming space from billionaires.\n\nOn the other hand, the film itself acknowledges a huge elephant in the room: white privilege. The artists admit they likely only got away with this because of how they looked, and some of the \"magical\" reenactments (like using a diverse cast of actors for a mostly white project) feel like they're trying to rebrand a very specific, privileged experience into something more universal. It also touches on the heavy personal cost, showing how Townsend’s singular obsession with the project eventually led to the end of his marriage.\n\nI’m curious to see what everyone else thinks!!\n\nIs this a brilliant act of resistance that proves art can happen anywhere?\n\nOr is it just a case study in how \"mischief\" is only called \"art\" when the people doing it have a certain level of privilege?",
        "upvotes": 318,
        "comments": 98,
        "media": null,
        "permalink": "/r/netflix/comments/1qyt3on/secret_mall_apartment_on_netflix_genius_art/"
    },
    {
        "id": "1qzc59x",
        "author": "fishfearme420",
        "title": "Suggest apocalypse movies or shows",
        "content": "Doesn’t have to be full end of world but like nuclear war etc\n\nThere was a Netflix movie I loved, can’t remember the name, about a surprise nuclear attack on the US, came out recently\n\nAnymore stuff like this? Thank you",
        "upvotes": 7,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1qzc59x/suggest_apocalypse_movies_or_shows/"
    },
    {
        "id": "1qz63an",
        "author": "DuxxieDings",
        "title": "anyone else like adult cartoons, arcane, wolf king and blue eye samurai?",
        "content": "any other fans of adult animation arcane, wolf king and blue eye samurai?\n\ni dont see alot of people talking about blue eye samurai or wolf king, i have met a few arcane fans but not many. \n\njust wondering if theres other adults who enjoy animation for adults? ",
        "upvotes": 14,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1qz63an/anyone_else_like_adult_cartoons_arcane_wolf_king/"
    },
    {
        "id": "1qziang",
        "author": "Fluid-Expression-271",
        "title": "Shows like Finding Her Edge?",
        "content": "I'm looking for a show/movie with the same kind of romance plot, \"forced proximity\" as in pair dancing with the Braydiana chemistry\n\nI LOVED their chemistry and the whole \"be around each other every waking second for work\" idea is so interesting but I just can't find anything similar.\nI've already watched Spinning Out so I'm not sure what to do now😭 I'm also very unhappy with the whole Adriana love triangle ending so I need to find something else to make up for that\n\nAny recs?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qziang/shows_like_finding_her_edge/"
    },
    {
        "id": "1qzm1we",
        "author": "TheCosmicPanda",
        "title": "This is how you can watch Netflix in 1440p on your QHD monitor! **2026 update**",
        "content": "People kept commenting on an old post I made here after the old method stopped working: \n\nhttps://old.reddit.com/r/netflix/comments/v0uysm/this_is_how_you_can_watch_netflix_in_1440p_on/ \n\nI thought it would be best make a new post with step-by-step instructions so more people can benefit.\n\n\nThanks to user **[–]Ok-Tax769** for helping to find a solution.\n\n**Steps to take**:\n\nDownload the *HEVC Video Extensions* from here (I found this link posted on another Reddit post via Google search):\n\nhttps://archive.org/details/microsoft.-hevcvideo-extension-2.0.61931.0-neutral-8wekyb-3d-8bbwe_20231114\n\nType *\"edge://flags\"* (without the quotation marks) in the Microsoft Edge search bar.\n\nSearch for *\"PlayReady\"* and set *\"PlayReady DRM for Windows\"* to **Enabled**.\n\nSearch for *\"Widevine\"* and set *\"Widevine DRM\"* to **Disabled**.\n\nRestart the browser completely.\n\nOpen Netflix in Microsoft Edge and play a 4k show. Then press CTRL+SHIFT+ALT+D (must be in windowed mode not full screen to see the stats) and the stats for nerds will show the resolution as 2560x1440.\n\nThis will also get 1440p working in the Windows Netflix app.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qzm1we/this_is_how_you_can_watch_netflix_in_1440p_on/"
    },
    {
        "id": "1qzqzny",
        "author": "Used-Can-6979",
        "title": "Independence Day on Netflix not widescreen?",
        "content": "Was this movie not in widescreen? On Netflix it fills up the whole screen which caught me off guard. Is this a zoomed in version or something? Google shows it was filmed in 2.35:1. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qzqzny/independence_day_on_netflix_not_widescreen/"
    },
    {
        "id": "1qz3lsc",
        "author": "BigNoseParody",
        "title": "Norsemen - Cancelled",
        "content": "This might be the best comedy show out there. Pure wits combined with parody. Every single character has put out a 10/10 performance. The only other show in which I love all the characters is Chernobyl, so this speaks volumes how much I admire the cast.\n\nWhy am I making this Reddit post? I want to spread more awarness about this amazing show so we can unite all together and demand another season.\n\nEdit: Last but not least, yes I'm aware this show has been cancelled years ago, but I still have hopes for another season.",
        "upvotes": 11,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1qz3lsc/norsemen_cancelled/"
    },
    {
        "id": "1qzka9b",
        "author": "RealCanadianDragon",
        "title": "Should Netflix make it easier to see timestamps on videos?",
        "content": "This is one annoyance I have with watching Netflix on my TV. The timestamp is greyish/partially transparent which works if it's against a black or dark background, but if it's against a brighter or white background, you can't see the timestamps which makes it annoying and hard if you're trying to read the numbers on it, especially if you're skipping ahead or going back and have no idea what time you're at.\n\nWhen it comes to closed captions/subtitles you're allowed to choose the size and drop shadow of it, so why can't the time stamps follow suit?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qzka9b/should_netflix_make_it_easier_to_see_timestamps/"
    },
    {
        "id": "1qywa9c",
        "author": "lighthouse_kitten",
        "title": "The perfect neighbour - did Susan not get a CCTV camera because it would expose her?",
        "content": "The cops tell her on MULTIPLE occasions that she doesn’t have video evidence about what the kids are doing. She keeps saying yes she does not have it. \n\nI don’t know - logical conclusion would be to keep a camera to record what happens in the yard. They are also not that expensive. \n\nIt’s so clear she didn’t want to do that because she was always the problem and she had every intention of becoming violent at some point. \n\nI’m just so disturbed watching this and seeing them not immediately arrest her and offering her a ride to the house and a hotel room. ",
        "upvotes": 22,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1qywa9c/the_perfect_neighbour_did_susan_not_get_a_cctv/"
    },
    {
        "id": "1qz0c8s",
        "author": "Few_Pipe_9933",
        "title": "Recommend suspense movies please!",
        "content": "Somthing suspenseful that’s instantly grabbing and keeps you drawn the whole movie. (My attention span is bad). I really enjoy the guilty. Anything helps!",
        "upvotes": 7,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1qz0c8s/recommend_suspense_movies_please/"
    },
    {
        "id": "1qysufs",
        "author": "Amonette2012",
        "title": "Is Netflix using AI for subtitles now?",
        "content": "I'm just enjoying Everyone Else Burns (highly recommended) and the subtitles are wrong in so many places, to the point where they sometimes make no sense. This is a new release so I'm wondering if this is a one off or if they've made a change? \n\nI would have thought that using the script would be the logical way to do it but it feels more like they've just used a dictation program.\n\nHas anyone else come across this on other shows?  It's so lazy!  What's the point if they're constantly wrong? ",
        "upvotes": 17,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1qysufs/is_netflix_using_ai_for_subtitles_now/"
    },
    {
        "id": "1qziwlo",
        "author": "DuxxieDings",
        "title": "any new shows or movies in 2026?",
        "content": "whats good? I need some new things to watch. There has to be atleast one or two or more good movies or shows released in 2026.\n\nI perfer action, it has to have action. \n\nThanks to the folks who comment!",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qziwlo/any_new_shows_or_movies_in_2026/"
    },
    {
        "id": "1qxut7s",
        "author": "Fit-Significance8580",
        "title": "Netflix has gone to crap and I’m tired of pretending like it hasn’t",
        "content": "I remember when Netflix was the streaming service. You paid like $4.99 a month, there were ZERO commercials, and the library was stacked with actually good movies and TV shows. You could scroll for 10 minutes and still feel excited about what to watch.\n\nNow?\n\nWe’re paying more than double that (for the cheapest plan), getting slapped with ads, and somehow the selection has gotten worse instead of better.\n\nHow does that even make sense?\n\nEvery time I open Netflix now, it’s the same recycled “Top 10” list, half-finished original series that get canceled after one season, or movies that look like they were made for a middle school media class. If you do find something decent, congrats — it’ll probably be gone next month due to “licensing issues.”\n\nMeanwhile:\n\n\t•\tPrices keep going up\n\n\t•\tPassword sharing gets cracked down on\n\n\t•\tAds are creeping in like we didn’t specifically pay to avoid cable\n\nAt this point Netflix feels less like a premium streaming service and more like cable TV with an app and worse content.\n\nI honestly miss when Netflix felt fun instead of frustrating. Now I spend more time scrolling than actually watching anything — and half the time I just close the app.\n\nIs it just me, or did Netflix completely lose what made it great in the first place?",
        "upvotes": 1497,
        "comments": 278,
        "media": null,
        "permalink": "/r/netflix/comments/1qxut7s/netflix_has_gone_to_crap_and_im_tired_of/"
    },
    {
        "id": "1qyulit",
        "author": "olendra",
        "title": "House of Dynamite… Whaaat???",
        "content": "I really enjoyed the movie and wouldn’t have had an issue with the ending if the final cliffhanger wasn’t related to the president’s choice.\n\nNone of it made sense? They repeat several times that they are not even sure it’s a real missile that will explode, and they don’t know who launched it. So it makes for a compelling “let’s try to fix things when we know nothing about what needs fixing” plot, but how overly dramatic everyone is just feels dumb when you get to the end and there is no resolution.\n\nTrained soldiers are crying, a high level official kills himself, people advise the president to nuke random countries to show they’re not weak, and it’s not even presented as an insane recommendation.\n\nAgain, they say THEMSELVES they don’t even know if it’s really a functional nuclear missile and they have no clue who sent it… why would they commit suicide or start a nuclear war with Russia or North Korea out of the blue with that little information? This is completely crazy and an insanely stupid outcome. It’s only been 2 hours and nothing has happened yet, why being so extreme so fast? Right now, the problem is to see whether it hits Chicago or not, if you can mitigate the loss or life and where the threat comes from. These are the things you need to take action on, not pressure the president to pull the trigger on someone at random.\n\nAlso everyone seems to do the bare minimum: oh too bad our attempts to stop it failed twice, well let’s nuke Russia instead of using our other counter missiles when we don’t even know if this is a real threat. Oh Chicago may be destroyed in 1 hour well let’s not everyone try to evacuate or warn people to find a shelter that could reduce the damage, it will probably just save a few anyway.\n\nAnd the NSA guy just discussing classified stuff in the street and the hallways?\n\nThe ending just made me feel the movie thought it was smart and asking tough question, showing a Shakespearian dilemma… And I could get the dumb responses when you’re under pressure and have no information. But honestly, the fact it ends there just feels like a dumb plot while it could have looked much smarter with either different options presented to the president or someone showing the president say “lol no this is insane, if we can’t prevent it anyway, let’s take time to gather intel and I’ll decide to nuke someone or not later”. It could still be unresolved without looking that unrealistic!",
        "upvotes": 12,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1qyulit/house_of_dynamite_whaaat/"
    },
    {
        "id": "1qz30ux",
        "author": "riverpeace3",
        "title": "What’s the point in downloads if you can’t access the app offline?",
        "content": "Downloaded some videos to prepare for being somewhere with no internet, a few hours later I open the app and it prompts me to login to the app. This makes no sense.\n\nWhen you download videos on YouTube, the app recognises when you’re offline and suggests for you to access your downloaded videos. Why doesn’t Netflix do the same?",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1qz30ux/whats_the_point_in_downloads_if_you_cant_access/"
    },
    {
        "id": "1qzkl25",
        "author": "um_ser_perfeito",
        "title": "Is it true that Netflix on PlayStation 3 will be shut down in March?",
        "content": "I was researching some things for a video I'm making about Netflix on PS2, when I saw a Facebook post saying that the PS3 version of Netflix was going to be shut down on March 2nd. I don't own a Smart TV and for some reason my phone isn't compatible with Netflix, so this PS3 version is the only way I can watch it.",
        "upvotes": 0,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1qzkl25/is_it_true_that_netflix_on_playstation_3_will_be/"
    },
    {
        "id": "1qyno50",
        "author": "Venus_ivy4",
        "title": "Did you watch the new animated serie Samuel?",
        "content": "I dont know if it was added to every Netflix in the world but if it was in your country, please watch it.\n\nIts so good!\n\nI watch a lots of animated films, i love that genre a lot.\n\nI wasn’t familiar with this one, but i learned that it was a popular serie already on an other platform called Arte.\n\nThe show is french with a woman french director. That why i was curious first and set up an alarm.\n\nI started it yesterday and literally fell in love with everything.\n\nI hope Emilie Tronche, the director, will make a movie out of this. She will certainly could be nominated for an Oscar.\n\nAbsolutely brilliant.\n\nPlease watch it if you haven’t already and let me know what you thought of it",
        "upvotes": 13,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1qyno50/did_you_watch_the_new_animated_serie_samuel/"
    },
    {
        "id": "1qycp4i",
        "author": "Natural_West4094",
        "title": "Does anyone else feel like they need to thumbs-down the content they love just to stop the algorythm drowning them with stuff they've already watched?",
        "content": "Like literally, when I finish binging a show my recommendations are flooded with the very same show I just finished watching.  It's like the algorithm completely ignores the fact I've watched a show and gets overly.excited by a thumbs up or a viewing 😕",
        "upvotes": 48,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1qycp4i/does_anyone_else_feel_like_they_need_to/"
    },
    {
        "id": "1qyuxty",
        "author": "THAToneGuy091901",
        "title": "Did anyone write down the spells in this show? I can’t find them.",
        "content": "The show is Always a Witch. It was on Netflix back in 2019. But I can’t find anywhere where they wrote down the spells. I like to go down on deep dives looking for history on the spells of witch tv shows. ",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qyuxty/did_anyone_write_down_the_spells_in_this_show_i/"
    },
    {
        "id": "1qyh9nb",
        "author": "Ok-Acanthaceae-813",
        "title": "Please recommend me a good romance movie on Netflix",
        "content": "Please recommend me a good romance movie on Netflix that I can enjoy during a relaxed evening or a quiet weekend. I’m looking for a film with a strong emotional core, meaningful character development, and a story that feels heartfelt rather than overly dramatic. A movie where the chemistry between the leads feels natural and the relationship grows in a believable way would be perfect. I’d really appreciate something that balances romance with a thoughtful storyline—maybe with a touch of humor, warmth, or even a bit of life realism mixed in. It doesn’t have to be extremely intense, but it should leave a lasting impression and make me feel emotionally connected to the characters. A romance that explores themes like love, timing, personal growth, or second chances would be ideal. If possible, I’d also love a movie that has good music, beautiful visuals, or a comforting vibe that makes it enjoyable to rewatch. Overall, I’m hoping for a romantic movie on Netflix that feels genuine, memorable, and satisfying, and that can make me smile, reflect, or even tear up a little by the time the credits roll.",
        "upvotes": 14,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1qyh9nb/please_recommend_me_a_good_romance_movie_on/"
    },
    {
        "id": "1qz87oj",
        "author": "ira_shai_mase",
        "title": "Netflix Puzzled - any way to play without a subscription?..",
        "content": "hi!\n\n  \nsorry for asking in advance! I've recently discovered Netflix Puzzled, and kinda love it, and really wanna get a full experience out of it. but everything, from levels to streaks, is locked behind Netflix membership. I, sadly, can't even create an account, let alone purchase a membership (region lock stuff, not available in my region), not do I really want to pay for Netflix subscription just for this one game. so I was wondering, is there any way to play it without subscription?..\n\n  \nthanks in advance!🤧🙏\n\n",
        "upvotes": 0,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1qz87oj/netflix_puzzled_any_way_to_play_without_a/"
    },
    {
        "id": "1qyx3by",
        "author": "jnverted",
        "title": "Screen fades to black for 1 second while watching show",
        "content": "I’m watching stranger things on Netflix and the screen randomly faded to black for a split second. It was very random and abrupt in the middle of the characters talking, it didn’t fit the scene at all which is why I noticed it.\n\nI refreshed the Netflix app and the original black flash was gone from the scene, but then the screen faded black again about two seconds later instead.\n\nI recorded it when it happened both times but I didn’t realise I can’t post videos on this subreddit. \n\nI’m not really bothered by it, just curious what could be causing it. I’m watching on an Ipad. Could this be an app glitch, buffering, something else?\n\nHas anyone else experienced this?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qyx3by/screen_fades_to_black_for_1_second_while_watching/"
    },
    {
        "id": "1qyvh4i",
        "author": "harpreetthind",
        "title": "Need recommendations for new Netflix movies or TV shows",
        "content": "Just got done watching die to me. What else does everybody recommend watching that has a similar vibe to that show thanks for the recommendations thanks for the recommendations everyone",
        "upvotes": 1,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1qyvh4i/need_recommendations_for_new_netflix_movies_or_tv/"
    },
    {
        "id": "1qxhvh4",
        "author": "Longjumping_Land_977",
        "title": "Lucy Letby is on extreme safety watch in prison as she’s mocked by inmates over Netflix doc",
        "content": "",
        "upvotes": 723,
        "comments": 377,
        "media": null,
        "permalink": "/r/netflix/comments/1qxhvh4/lucy_letby_is_on_extreme_safety_watch_in_prison/"
    },
    {
        "id": "1qygoqm",
        "author": "LoveSweetSweet1",
        "title": "Can anyone suggest movies/series that match these kinds of vibes?",
        "content": "I’ve realized I’m really drawn to movies that have a very raw, immersive atmosphere or a certain kind of vibe to them...Let me give you some examples. I’m a huge fan of movies like American Honey, Victoria, The Florida Project, Girl Interrupted, Nerve, Wild Orchid, Under the Silver Lake, Sex Lies and Videotape, Thelma &amp; Louise, Silver Linings, Fall, The Notebook, Promising Young Woman, The Age of Adaline, The Lake House, Gasoline Rainbow. Series: Euphoria, Behind her eyes, The OA, Scenes from a Marriage, Poker Face.\nI’m basically looking for anything that captures that same atmospheric feeling or intensity, engaging vibe, whether it's a series or a single film.\nThank you so much!!!",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1qygoqm/can_anyone_suggest_moviesseries_that_match_these/"
    }
]