[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 501,
        "comments": 274,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 19,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jrz4ph",
        "author": "skummies",
        "title": "Con Mum arrested in Singapore",
        "content": "I’m from Singapore and it’s so surreal to see this in the news this morning. Just like in the documentary, Dionne attempted similar scams here. Victims only realised they were being cheated after they watched the documentary. ",
        "upvotes": 201,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1jrz4ph/con_mum_arrested_in_singapore/"
    },
    {
        "id": "1jschg8",
        "author": "TimesandSundayTimes",
        "title": "Charlie Brooker: I’ve only let my kids watch one episode of Black Mirror",
        "content": "",
        "upvotes": 12,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1jschg8/charlie_brooker_ive_only_let_my_kids_watch_one/"
    },
    {
        "id": "1jrzfv4",
        "author": "Key-Highway9659",
        "title": "Did anybody really bored by Ozarks stick it out and it was good? Having trouble with it",
        "content": "Hello.\n\nI am not trying to insult The Ozarks. This is the fifth time I have tried to watch it as I've heard so much good stuff about it.\n\nBut every time I watch, I am bored to tears. The way the actors all act doesn't feel real and I care about the characters most of all in a show. \n\nI thought this is about a family thrown into extreme danger unexpectedly? \n\nIt's weird. I feel like I didn't get enough time with Marty or any of these people before they were genius hardened criminals and almost...bored/underwhelmed by all of it and any vulgarity.\n\nSo far, it feels like if Breaking Bad knew it was a TV show mixed with Mad Men or American Psycho but without the... I don't know!! Justification? Style?\n\nIts frustrating. I want to shake them and wake the whole show up. \n\n\n I ask... did anybody that was IMMENSELY bored by this stick it out and it was worthwhile for you? Thank you for any info\n\nOr does it get explained later why they're all like this and weirdly numb? Even the family members?",
        "upvotes": 41,
        "comments": 121,
        "media": null,
        "permalink": "/r/netflix/comments/1jrzfv4/did_anybody_really_bored_by_ozarks_stick_it_out/"
    },
    {
        "id": "1jsiyd4",
        "author": "slyr4scal",
        "title": "Netflix issue..",
        "content": "Hey, so, just started watching Naruto through Netflix.\n\nCurrently on season 2, episode 1 and my closed captions aren’t really “closed-captioning”… The subtitles aren’t showing what the characters are saying on screen, which isn’t TOO MUCH of an issue, but it’s extremely annoying. I watch dub with subtitles on because it feels comfortable (please don’t attack me for it) and I want to know if anyone else has had this issue watching Naruto on Netflix or if it’s just me.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jsiyd4/netflix_issue/"
    },
    {
        "id": "1jsahzz",
        "author": "surtrc",
        "title": "Movies stop about 7 minutes before the end?",
        "content": "Hello\n\nI watch movies via Playstation. When the movie is about to end (about &lt;7 minutes before the end of the movie) SOME movies stop playing. I can't do anything. I have to restart my Playstation. When I try to open the movie after and watch it it happens over and over again.\n\nDo anyone of you have the same problem or experienced this issue? Thanks so much for your help.\n\nIt happens with SOME movies, but not all... really weird.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jsahzz/movies_stop_about_7_minutes_before_the_end/"
    },
    {
        "id": "1js4zds",
        "author": "TaleMother8466",
        "title": "The best reality show on netflix?",
        "content": "What is the best reality show on netflix? Something really suspenseful. I just watched Million Dollar Secret and I loved it. I know its not the real, but I would love something simmilar to watch. ",
        "upvotes": 5,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1js4zds/the_best_reality_show_on_netflix/"
    },
    {
        "id": "1jshjwx",
        "author": "EntertainerFrosty842",
        "title": "What is your takeaway from Adolescence?",
        "content": "To me the series is about how the world and especially the internet is extremely conflicted (this is not necessarily a bad thing because freedom of speech is truly needed in any society of beings who want to coexist) but learning to ease these conflicts peacefully by talking things over is of utmost importance (like Jamie should have done with Katie and/or his parents and possibly others from the very beginning and like he did too late with Briony) \n\nI feel like the series also shows that people are in search of confirmation of their own morals and beliefs, which could spiral them down further if they are only confirmed again and again (like on the internet and what Jamie seems to seek from Briony in the hearing). I see a lot of people saying the series is about toxic masculinity, and while I can clearly see it plays a big role in the series, that’s not “only” it to me.\n\nLastly, I invite everyone who has the intend to respond, to comment on my post. You may critique this, applaud it, laugh at my grammer, correct me, add to it, ask me about anything and even post memes. Just comment anything you want. Because I think you should know that your opinion matters (not necessarily to a person individually but it does 100% matter to society). If you don’t want to respond then that’s also fine, that’s an opinion too. Only by talking things out as civil beings we can make this world a better place for everyone. If you don’t agree with this part you may also comment if you want. (Sorry if this paragraph was too long, I have ADD so that may explain it hehe)\n\n(My first language isn’t English so if there are any issues and you need me to reexplain something you know what to do ;)) —&gt; if you don’t know what I meant by this just read the paragraph above this one\n\nSmall joke at the end of my comment because I want to make someone smile:\nThis comment is copyrighted by my brain",
        "upvotes": 0,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1jshjwx/what_is_your_takeaway_from_adolescence/"
    },
    {
        "id": "1jshgk3",
        "author": "Fool_Kumari",
        "title": "Adolescence",
        "content": "I just finished watching Adolescence and I absolutely loved it—the drama, the suspense, and especially Jamie’s acting were all on point. But honestly, it left me craving more; it felt like there should have been a few extra episodes. \n\nI really wanted to see more of Jamie—maybe even a courtroom drama. He kept insisting he didn’t do it, and it left me wondering what he really meant by that. Was he hinting at some psychopathic tendencies? Did he actually feel any remorse? I remember episode 3 showed a lot of his character, but it just made me even more confused about who he really is. I guess that was the point, though—leaving us with questions. Anyone else feel the same way?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jshgk3/adolescence/"
    },
    {
        "id": "1js7axp",
        "author": "Arppeggi",
        "title": "Netflix TV does not have a \"I'm traveling\" option anymore?",
        "content": "I recently bought a smart TV a month ago, and I think it had the traveling option, which worked great until today. Now, I’m stuck with having to change the Netflix household to use my TV.  \n  \nIs there any way I can use Netflix on my TV without changing the Netflix Household?",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1js7axp/netflix_tv_does_not_have_a_im_traveling_option/"
    },
    {
        "id": "1jsg9c0",
        "author": "Kuchii_Kopii",
        "title": "Florida Man - Song in episode 2??",
        "content": "I'm desperatly looking for the song thats playing at 27:20 mins Episode 2.\nI only know he sings something like:\"So slooo-o-o-o-oow\" idk??\nCan u help me there its killing me aaah",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jsg9c0/florida_man_song_in_episode_2/"
    },
    {
        "id": "1jrldyd",
        "author": "Decent_Confidence_36",
        "title": "Con mum",
        "content": "I’m so confused watching this, I can understand how a man who believes his mother he hasn’t known for his entire life can be manipulated… but the Zurich bank and lawyers ??? How ",
        "upvotes": 73,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1jrldyd/con_mum/"
    },
    {
        "id": "1jrroxe",
        "author": "Jatmahl",
        "title": "Pulse",
        "content": "Started episode one and already turned off by the shitty CGI... like everything outside the hospital building is CGI. You are telling me the producers couldn't get back drops of a random real life hospital to use? It makes it look very cheap.",
        "upvotes": 26,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1jrroxe/pulse/"
    },
    {
        "id": "1jrwylx",
        "author": "fish_man77",
        "title": "Any good detective shows??",
        "content": "I'm currently watching unbelievable which is amazing btw if you haven't seen it watch it! But I'm really into these shows and I was wondering if there's any more? I have watched one but I forgot the name but they interview murders so I've only seen two good ones:))",
        "upvotes": 9,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1jrwylx/any_good_detective_shows/"
    },
    {
        "id": "1js4ri7",
        "author": "Alterria",
        "title": "Devil May Cry E04 Won’t Play",
        "content": "(No bugs/problems flair?)\nEvery other episode and every other show works perfectly fine, Episode 4 loads 0%, 25%, or 89% before forever loading and eventually a popup shows up saying there was some kind of error and asking to run a check, which upon clicking shows a pinwheel for a split second and then cuts right to the Devil May Cry menu where I can hit play on the episode. Where it repeats the cycle. Is this a server issue or something wrong on our end?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1js4ri7/devil_may_cry_e04_wont_play/"
    },
    {
        "id": "1jryxd2",
        "author": "tsundering_kurisu",
        "title": "I made a chrome extension that changes your new tab page into a netflix themed page. Please share your opinion.",
        "content": "for those who are interested here:\n\n[Extension link for Netflix themed new tab page.](https://chromewebstore.google.com/detail/oedcjippkgifaipmjjfhjfcpikmnaopf?utm_source=item-share-cb) \n\n[Color theme link that changes your browser's frames, tab background, toolbar to look like Netflix themed.](https://chromewebstore.google.com/detail/jmjmmjncjfcejmkjicaccmdhoolpcpal?utm_source=item-share-cb)\n\nPlease share your opinions. \n\nThank you very much.",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/0q8fmpgr8zse1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1jryxd2/i_made_a_chrome_extension_that_changes_your_new/"
    },
    {
        "id": "1js4l15",
        "author": "BreathInTheWorld",
        "title": "Million dollar secret",
        "content": "Great show, could think of it similar to a popular game 'amoung us' BUT I'm sure the producer's didn't count on alliances to form instead of everyone collectively voting out the millionare.\n\nIt is possible the producers stepped in to tell the contestants they had to try vote out the millionaire. There was no downside for an alliance of 5 people voting out 4 others. That would then make it a boring and predictable show when you know who will be voted out.\n\nLet's say the contestant's voted out someone that is not the millionaire, then $100,000 is taken off the prizepool and given to the millionaire. This wiould make sure someone like Lauren isn't voted out and would create higher tensions petween players. Complete anarchy! What do you think?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1js4l15/million_dollar_secret/"
    },
    {
        "id": "1js0dxi",
        "author": "Brewben",
        "title": "Random accounts",
        "content": "Does anyone ever have a random profile pop up on your account? Second time this morning, a ‘Jojo’ pops up with a watch queue and continue watching list. \n\nOf course I immediately sign out of all devices and change password, but with Netflix locking you into only being able to watch on your local network these days, how does someone even pull this off? Also no email notification of a new sign in…",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1js0dxi/random_accounts/"
    },
    {
        "id": "1jrz999",
        "author": "Sweaty-Toe-6211",
        "title": "Ashley Park Teases Filming Emily in Paris Season 5 in the Summer: 'I Am Highly Anticipating It'",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jrz999/ashley_park_teases_filming_emily_in_paris_season/"
    },
    {
        "id": "1jrjnql",
        "author": "Ordinary_survival",
        "title": "Anyone watched Netflix Mo?",
        "content": "I am watching it now, while knitting 😄\nI am atheist/agnostic still going back and forth but I am have brought up in a muslim country so the things they tease I get it. The one thing I repelled so far was the Hameed wedding, so the girl is big, Mo himself is big aswell he can have a “love” relationship with Maria but he does not believe Hameed loves Dallas and just marries her for greencard. So as a former big girl I got triggered why men are acceptable as big as they are and women are not? What is the difference and this coming from a big guy (I mean of course it is scripted and I don’t know if he is in the writer squad but still) is very annoying and heartbreaking, when this hypocracy will end? Being a big women does not equal to not being loved😢",
        "upvotes": 23,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1jrjnql/anyone_watched_netflix_mo/"
    },
    {
        "id": "1jseswg",
        "author": "Only-Standard445",
        "title": "Why did Jamie in Adolescence keep saying ‘I didn’t do anything wrong’?",
        "content": "Was he trying to convince everyone around him that he didn’t commit the crime? Or was he trying to convince himself that even though he did it, it wasn’t wrong?",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1jseswg/why_did_jamie_in_adolescence_keep_saying_i_didnt/"
    },
    {
        "id": "1js6g8y",
        "author": "DaeOnReddit",
        "title": "Password question",
        "content": "So my boyfriend uses his family’s Netflix account. He literally lives down the street from them a few houses over but Netflix is saying he’s not part of the household. Is there anything he can do to become part of it or will he have to pay for that extra profile on his parents’ account?",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1js6g8y/password_question/"
    },
    {
        "id": "1jrvdmp",
        "author": "eHrbP",
        "title": "anything that hit like arcane or blue eye samurai?",
        "content": "Arcane + Blue Eye Samurai got me obsessed me in the best way. Looking for series or movie with that same unique art style, how the characters got built emotionally complex and has very strong storyline. Something that scratches the same itch pls pls bonus if it has a rlly darker cinematography i js want a plot that goes hard\n\n",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jrvdmp/anything_that_hit_like_arcane_or_blue_eye_samurai/"
    },
    {
        "id": "1jrxyla",
        "author": "minnnnnnnnn768829",
        "title": "I wish I could ask Netflix to stop cancelling adult cartoons !!!",
        "content": "I wish I could ask Netflix to stop cancelling adult cartoons!!!\n\nInside job\nCaptain fall\nHuman Resources\n\n\nI wish they would stop cancelling good adult shows all the good ones get cut while the crappy ones get more seasons!! What’s going on with the whole Netflix getting rid of cartoons???? I wish they would at least finish the shows off that they start. I wish all shows ended with a conclusion and no questions.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jrxyla/i_wish_i_could_ask_netflix_to_stop_cancelling/"
    },
    {
        "id": "1jr60tx",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix has 3 shows on Nielsen's Top 10 Overall for the week of March 3 to March 9",
        "content": "",
        "upvotes": 17,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jr60tx/netflix_has_3_shows_on_nielsens_top_10_overall/"
    },
    {
        "id": "1jrxdi8",
        "author": "Hiker03",
        "title": "Adolescence is really similar to God of War 2019",
        "content": "Themes of generational cycles, the relationship of a father and son, and of course the one-shot camera",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jrxdi8/adolescence_is_really_similar_to_god_of_war_2019/"
    },
    {
        "id": "1jrv5to",
        "author": "djdante",
        "title": "Am I Alone in My Interpretation of Adolescence?",
        "content": "So first of all, it was an amazing Miniseries - acting, scripting, casting, filming wow!\n\nIt has been interesting to read all the different takes on the show - Some are saying it's anti-male - some are saying it's specifically targeting the red pill culture and misogyny that's rife amongst kids. Some are pointing out how toxic bullies are - heck, some people are doubting who actually stabbed Katie!\n\nBut when I watched it, I honestly thought the beauty was that it wasn't pointing any specific fingers... Or maybe pointing many fingers at many problems coexisting in kids' worlds these days.  Merely highlighting how chaotic and scary kids lives can be and how easily it can all go wrong nowadays.\n\n1. Jamie wasn't specifically red pill or incel - but he's certainly been influenced by some of those ideas - they've found their way into his language - In a similar way to how people in the 90s used to call everything bad 'gay' at highschool 'aww I don't want to go to history class, it's so gay!'  - this way of normalising certain negative beliefs you may not even personally hold, find their way into your language.  He's certainly had some negative influences however - he has also engaged in some bullying of his own making derogatory comments to some women online.  I don't think he's a specifically bad kid though - He deserves punishment, don't get me wrong, but I think we are still meant to care and have compassion for how he ended up where he ended up.\n2. Katie was clearly one of many bullies making life very hard for Jamie - People ask \"why pick on Katie rather than other males picking on him - it must be because of sexism or red pill\" - but honestly the extra pain and shame of being humiliated by a girl you have a crush on ads an extra sting that makes it 'make sense' - not in the sense that Katie is to blame obviously, but just why she might be targetted uniquely with extra resentment.  We are never specifically told what Katie did or said in full, but based on the way her best friend was reacting to police, there was some guilt involved - again, no murder was deserved, but the best friend realised they had pushed Jamie too far and felt conflicted as she's just a teenager herself and doesnt' know how to interpret what's just happened. The show was smart not to specify how exactly Katie bullied him so as not to make it look like she deserved it - The show wasn't about blaming Katie.  Katie was also horribly bullied with her private photos so she's also a victim there, who may well have 'paid it foward' by passing her bullying pain onto a new victim \"Jamie\".\n3. We are clearly shown a school with very few boundaries run by teachers who don't care and don't exert much discipline.  The kids are unruly, the cops compare it to a prison... It's like nobody is paying any attention to anyone.\n4. It's made clear just how horrific online bullying can be - and how easy it is. When the adults were younger, teasing was usually limited to a few perpetrators - but nowadays the whole school can team up and humiliate someone on IG (as they did with both Jamie and Katie) - even if it's just through random emoji reactions to other comments - the sense of shame and humiliation can be more extreme than most adults are aware of.  It got me thinking a lot about how scary that is for kids nowadays for sure.\n\nTo me - it was more a display of what a horrible jumble of circumstances kids can find themselves in - Jamie isn't all evil, he's a confused kid stuck between wanting to be nice, and being told by male and female bullies that he's an incel for being nice and only 'bad boys' win... Katie is likely a typical teenage girl with her own angst and insecurities and she wasn't bullying any more than any other girl sometimes does - but she got caught up in a confluence of events that are more common now than any other time in the past.\n\nIt showed kids with nobody paying attention to help guide them, and as a result, their worst natures come out without regulation - sort of a modern-day 'Lord Of The Flies' in many ways.\n\nWhat I didnt' see was a direct attack on boys or bullies or even red pill - the incel movement is used more as a way to tease and humiliate a boy who didnt' even 100% buy into the dogma - and the red pill ideology was just ONE of the many moving parts that caused a murder and a death to occur that never should have.\n\nAm I alone in feeling this way?",
        "upvotes": 0,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1jrv5to/am_i_alone_in_my_interpretation_of_adolescence/"
    },
    {
        "id": "1jrpy3x",
        "author": "basedBlumpkin",
        "title": "I have a couple thousand dollars worth of quality audio gear connected to my PC, but since it's a 2.1 setup (and not 5.1) the Netflix app limits me to 192kbps audio, is there anyway to override this? [ALL]",
        "content": "On W11 using the Netflix app.  Even though I'm a Premium subscriber I have to \"acquire\" Netflix shows via other means to enjoy higher audio bitrate which seems crazy to me.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jrpy3x/i_have_a_couple_thousand_dollars_worth_of_quality/"
    },
    {
        "id": "1jruxh7",
        "author": "Sharp-Mountain-8884",
        "title": "Why so long?",
        "content": "Everything good they have takes 2-3-4 years to come out! Why?? Feel like they should start to feel the pain… if it took me 2-3-4 years to follow up on a project at work I’d be fired.. \n\nSo sick of this service..\n",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1jruxh7/why_so_long/"
    },
    {
        "id": "1jrvm0t",
        "author": "justafanboy1010",
        "title": "I just watched Adolescence twice in 48 hours. What is everyone's views on Jamie? (Flair: Discussion and Question)",
        "content": "I loved this whole show. Stephen Graham, Owen Cooper, Erin Doherty did fantastic jobs. From start to end. I am conflicted on Jamie tho. During Episode 3, I was feeling bad for him, but i started reading on reddit and other reviews and I'm not gonna lie, I don't understand the incel subculture. And I'm not saying Jamie was justified or that he should've killed Katie, but I just want to know everyone's opinions on the matter and we can discuss it.",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1jrvm0t/i_just_watched_adolescence_twice_in_48_hours_what/"
    },
    {
        "id": "1jqtpok",
        "author": "MamaMia1325",
        "title": "Million Dollar Secret EP 4-6 (SPOILERS!!!)",
        "content": "First, let me say I'm so glad that Chris is finally gone. What a piece of work he was. He thought he was god's gift to women and what was with that comment at the end about him being Prince charming?? 🤦.\n\n I didn't really care for Sam in the 1st 3 episodes but she's one of my favorites now.\n\nSydnee is playing all the men like fiddles. Those men were pathetic- all it took was a pretty girl with a nice body to show them a little attention and they turned to jelly....(Good for her though.) I wasn't sure if she and Phil had a thing or her and Chris did. \n\nOverall, I enjoyed these three episodes more than the first three. But I liked them all. I'd love to see more seasons of the show. There's still some tweaking for them to do. \n\n***Edited to add-\nThis is by far my favorite podcast I've listened to that talks about this show.  \n\nSo far there are 2 episodes, one of them talks about 1-3 and the next one talks about 4-6.\n\nhttps://open.spotify.com/episode/7eUJyjTkELE2KfbxGHbqkF?si=N_LIduBhTuaX7OB6ws5hjw\n",
        "upvotes": 29,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1jqtpok/million_dollar_secret_ep_46_spoilers/"
    }
]