[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 6,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 5,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1nnj8fm",
        "author": "SamSamuele",
        "title": "Gli affitti per studenti hanno rotto il cazzo",
        "content": "",
        "upvotes": 18,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1nnj8fm/gli_affitti_per_studenti_hanno_rotto_il_cazzo/"
    },
    {
        "id": "1nnqgnz",
        "author": "_L_-",
        "title": "La metro sta scioperando?",
        "content": "La metro sta scioperando? C'è ancora bordello in giro? Tra poco dovrei attraversare Torino e volevo capire la situazione ",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1nnqgnz/la_metro_sta_scioperando/"
    },
    {
        "id": "1nnkvxt",
        "author": "Omyrr",
        "title": "Need a lawyer",
        "content": "Hello everyone, I am an international student in Torino and I need a lawyer for both commercial and civil cases. Do anyone of you know a lawyer who help students with very affordable prices or a hardcore leftist who won’t charge a penny for racist issues. ",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1nnkvxt/need_a_lawyer/"
    },
    {
        "id": "1nnnyeu",
        "author": "Murky_Giraffe8700",
        "title": "Non esiste un'app per segnalare i veicoli che commettono infrazioni?",
        "content": "Da dove vengo io, abbiamo un'applicazione che permette di scattare una foto di un'auto e inviarla alle autorità competenti affinché intervengano.\n\nEsiste qualcosa di simile qui?   \n  \nSe non esistesse, inizierò a crearlo",
        "upvotes": 1,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1nnnyeu/non_esiste_unapp_per_segnalare_i_veicoli_che/"
    },
    {
        "id": "1nnherx",
        "author": "Subject-Store-1982",
        "title": "Vorrei trasferirmi in una città più grande",
        "content": "Ciao sono un ragazzo di 20 anni e abito in un piccolo paese in provincia di Bergamo e vorrei trasferirmi in una città più grande, \nPer avere più opportunità lavorative, di svago e servizi ma comunque stare in una città dove senza fare troppa strada posso raggiungere la montagna o comunque posti in mezzo alla natura dato che ogni tanto mi piace stare in mezzo a verde.\nVoi cosa mi consigliate? Dove abitate e consigliereste la vostra città?\nScrivetemi i vari pro e contro della vostra città\n(Ovviamente se abitate in una città grande ) \nMilano la scarto a prescindere perché troppo costosa e non me la potrei permettere, volevo anche evitare Bergamo città perché volevo spostarmi un po' dalla mia zona, e stavo pensando a Torino.\nSento tanta gente che ne parla e tanta che ne parla male soprattutto sento chiunque dire che Torino è bella ma  la gente che ci vive non lo è, e non so se è così in tutta l'Italia o solo li.\nDatemi per favore la vostra opinione ed esperienza.\nGrazie mille ",
        "upvotes": 6,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1nnherx/vorrei_trasferirmi_in_una_città_più_grande/"
    },
    {
        "id": "1nmxx01",
        "author": "Murky_Giraffe8700",
        "title": "Violenza al Balon",
        "content": "Oggi al Balon (3PM) ho vissuto una situazione assurda e frustrante. \n\nUn uomo nordafricano, completamente ubriaco, ci ha urlato contro solo perché stavamo passando, cercando persino di spingerci e colpirci.\n\nIn più, poco distante, due ragazzi marocchini gridavano alle donne che entravano al Balon dalla parte di Barriera.\n\nMa dove sono la polizia o comunque delle misure di sicurezza che possano garantire un minimo di tranquillità?\n\nÈ inaccettabile che scene del genere siano ormai “normali” per tutti\n\nNon riesco a immaginare di essere donna e passare davanti di qui sola da notte",
        "upvotes": 82,
        "comments": 156,
        "media": null,
        "permalink": "/r/torino/comments/1nmxx01/violenza_al_balon/"
    },
    {
        "id": "1nnf07p",
        "author": "EuphoricPrinciple134",
        "title": "Ricerca di tesi",
        "content": "Ciao, sono una studentessa di Psicologia Clinica (F32) e sto conducendo una tesi di ricerca in Psicologia per cui sto reclutando partecipanti (non psicologi e non studenti di psicologia) a Torino. La ricerca si tiene in presenza. Se sei interessatə scrivimi",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nnf07p/ricerca_di_tesi/"
    },
    {
        "id": "1nnqknt",
        "author": "Lost_Letter112",
        "title": "Traduzione ufficiale per documenti scolastici?",
        "content": "Ciao a tutti,avrei bisogno di tradurre delle pagelle scolastiche ,e dei certificati di alcune attività, in inglese,perchè il processo per entrare all'università all'estero dove voglio studiare, lo richiede:la traduzione deve perciò essere ufficiale/giurata.Qualcuno conosce alcuni nomi di servizi/associazioni a cui rivolgersi?E' la prima volta che ho necessità di tradurre documenti,perciò non saprei proprio dove andare.Grazie mille",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nnqknt/traduzione_ufficiale_per_documenti_scolastici/"
    },
    {
        "id": "1nnns7e",
        "author": "Friendly-Army-7729",
        "title": "uscite per camminata🌳🌳",
        "content": "c’è qualcuno a cui piacerebbe camminare con me? voglio provare tutti i parchi di torino :))",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nnns7e/uscite_per_camminata/"
    },
    {
        "id": "1nnnrhn",
        "author": "m0rningst4r420",
        "title": "tekno a Torino?",
        "content": "Ciao a tuttx!! Sono una studentessa fuorisede e volevo capire dove trovare free party interessanti. Se qualcuno vuole farmi compagnia per andare sarebbe top!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nnnrhn/tekno_a_torino/"
    },
    {
        "id": "1nmpl96",
        "author": "Iaco_V8",
        "title": "Cosa ne pensate del nuovo sistema bibliotecario BI.TO?",
        "content": "Come ben saprete, il BI.TO è il nuovo sistema bibliotecario che, oltre a essere il più grande d’Italia, unisce le biblioteche delle BCT e dello SBAM.  \nCon un’unica tessera si può ora accedere a oltre 130 biblioteche, ampliando notevolmente la scelta di contenuti.\n\nPersonalmente trovo l’idea ottima, ma al momento mi crea un po’ di confusione per i seguenti motivi:\n- Sotto ogni libro compaiono tantissime biblioteche, sia di Torino che della cintura, e bisogna cliccare più volte per capire dove è effettivamente disponibile.  \n- Non essendo ancora attivo il prestito tra Torino e cintura, devo controllare manualmente che il libro sia presente in una biblioteca torinese per poterlo prenotare e ritirare.  \n- Un’altra cosa che mi manca sono le liste dei nuovi arrivi per ogni singola biblioteca, che prima aiutavano molto a orientarsi.\n\nE voi cosa ne pensate? Preferite il sistema vecchio o quello nuovo? Pensate che in futuro riusciranno a renderlo più intuitivo, come lo era prima?",
        "upvotes": 42,
        "comments": 35,
        "media": null,
        "permalink": "/r/torino/comments/1nmpl96/cosa_ne_pensate_del_nuovo_sistema_bibliotecario/"
    },
    {
        "id": "1nmx59j",
        "author": "RevolutionaryLog3631",
        "title": "Questa cosa davanti alla mia finestra. Voi capite che cos'è?",
        "content": "https://preview.redd.it/y0zzo6cvsjqf1.jpg?width=1728&amp;format=pjpg&amp;auto=webp&amp;s=d647221a657975d9f46d3ca15cbc8c978fb9b23e\n\ncalcolate che è in cima ad un albero almeno 12-15metri.\n\nCosi pensavo che qualcuno avesse lanciato da un 5-7° piano un qualcosa.\n\nPoi guardando la foto mi sembra una roba tipo i nidi di alcuni uccelli?\n\nVoi riuscire a capire? mi sembra inquietante anche perchè e poco distante dalle finestre di casa mia :D",
        "upvotes": 11,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1nmx59j/questa_cosa_davanti_alla_mia_finestra_voi_capite/"
    },
    {
        "id": "1nnawtk",
        "author": "Icy-Distribution-765",
        "title": "Visiting Torino for Juve vs Milan",
        "content": "Hi, I’ll be visiting Torino from Canada in October for the game against Milan….my wife will go to Venezia so I’ll be on my own for the match day. Wondering if there are people who want to connect and maybe I can go to Allianz with locals, and maybe I meet some people that I can stay in touch for my future trips to Torino? I’m also learning Italian and can communicate a bit in Italian. Fino alla fine, forza Juve🤍🖤",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nnawtk/visiting_torino_for_juve_vs_milan/"
    },
    {
        "id": "1nmvo8s",
        "author": "Miserable_Crow7085",
        "title": "se sei di Torino io e i miei amici facciamo un mercatino l’11 e il 12 ottobre!",
        "content": "Iscriviti al form se sei interessato 🌷 https://forms.gle/NUo8VzFDb26aX8cEA",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wC7eM1iQxMZb5kCzmlJD48-bn8jVxu6yautVEdwWbVQ.png?auto=webp&amp;s=9ddaae4d2cfb094a2490dfd807fb3496ad0b8a2f"
        },
        "permalink": "/r/torino/comments/1nmvo8s/se_sei_di_torino_io_e_i_miei_amici_facciamo_un/"
    },
    {
        "id": "1nmvngz",
        "author": "Frengo_17",
        "title": "Sport",
        "content": "Ciao a tutti, conoscete un posto dove fare sport all'aperto vicino a corso unione sovietica, parlo di un parco con attrezzi come sbarra ecc...",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1nmvngz/sport/"
    },
    {
        "id": "1nmtr56",
        "author": "jdrin28",
        "title": "Come trovare casa in affitto a Torino (Venaria per la precisione)",
        "content": "Come avete fatto a trovare una casa in affitto (bi o trilocale a circa 500/60/€ al mese) nella zona di Venaria? I vari immobiliare ecc. non stanno dando i risultati sperati",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nmtr56/come_trovare_casa_in_affitto_a_torino_venaria_per/"
    },
    {
        "id": "1nmjxtr",
        "author": "eddz_",
        "title": "Edisu temporary accomadation requiring my credit card information to be emailed to them",
        "content": "Hello, I am planning to take edisu's temporary accomadation and in order to confirm they want me to email them my credit card information. Is it considered safe to do that? Has anyone tried it",
        "upvotes": 5,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/fr342xilhgqf1.jpeg?auto=webp&amp;s=92c78b86e43c742b952eb94103f8bc18e8fffb8b"
        },
        "permalink": "/r/torino/comments/1nmjxtr/edisu_temporary_accomadation_requiring_my_credit/"
    },
    {
        "id": "1nmre4o",
        "author": "Frads01",
        "title": "palestre con trx in zona politecnico",
        "content": "ciao a tutti!\n\nsono uno studente del poli fuorisede e vorrei iniziare ad andare in palestra. in particolare sto cercando una struttura che abbia anche trx, visto che l’ho già usato e mi piacerebbe ripartire da lì, in zona san paolo o vicino al poli (crocetta/cenisia). ho già controllato il cus ma non ho trovato nulla a riguardo.\n\nse avete consigli o esperienze da raccontare sono tutti ben accetti, punti bonus se ci sono sconti per studenti. grazie in anticipo! 😊",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nmre4o/palestre_con_trx_in_zona_politecnico/"
    },
    {
        "id": "1nm5y8l",
        "author": "_L_-",
        "title": "Acqua della doccia di merda a Torino",
        "content": "Trovate anche voi che l'acqua di Torino sia pessima sui capelli? Li rende crespi e li indebolisce. Voi cosa usate per contrastarla?\n",
        "upvotes": 11,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1nm5y8l/acqua_della_doccia_di_merda_a_torino/"
    },
    {
        "id": "1nmh4dj",
        "author": "Peregrineperceiving7",
        "title": "Parcheggi zona Porta Susa",
        "content": "Ciao a tutti, avrei bisogno di un consiglio come da titolo - in settimana io e la mia famiglia (che siamo della cintura) dovremo andare fuori città e abbiamo il treno molto presto all andata e tardi al ritorno,rendendo l arrivare in stazione coi mezzi problematico. Qual è l opzione migliore e più economica per parcheggiare nei dintorni della stazione? Grazie infinite per l aiuto!",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1nmh4dj/parcheggi_zona_porta_susa/"
    },
    {
        "id": "1nm23w8",
        "author": "Demiurgo_-_",
        "title": "Classe energetica appartamento",
        "content": "Ciao a tutti, sono andato a vedere un appartamento perché interessato all’acquisto. Mi è stato detto che è in classe energetica D. Andando però a leggere il consumo annuale kW h/m3 trovo 177.8691 annui. Leggendo diverse tabelle di appartamenti analoghi trovo che questo consumo sia appartenente ad una classe G. Potete aiutarmi a capire perchè dicono sia in D? ",
        "upvotes": 5,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/u49ifozifcqf1.jpeg?auto=webp&amp;s=83287817e866794d43be2aa411a4103a9adec191"
        },
        "permalink": "/r/torino/comments/1nm23w8/classe_energetica_appartamento/"
    },
    {
        "id": "1nm8epb",
        "author": "Frengo_17",
        "title": "Baretto",
        "content": "Ciao a tutti, avrei bisogno di un consiglio, conoscete qualche bar che ha della buona birra, grazie",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nm8epb/baretto/"
    },
    {
        "id": "1nmasdx",
        "author": "TurbulentDragon",
        "title": "Ritrovi per giovani?",
        "content": "Ciao a tutti sono un fuori sede. Vorrei trovare ritrovi per persone tra i 20-30 anni, o principalmente fatti da queste. In generale giovani adulti e giovani.\n\nMi interessano cose come il disegno o la scrittura di poesie o leggere libri (onestamente è da un buon po' che non leggo ma vorrei riniziare e un gruppo di lettura potrebbe aiutare). Va bene anche qualcosa di sportivo ma sono sempre stato imbranato negli sport. Sono aperto un po' a tutto.\n\nTuttavia cercando online ho trovato corsi in generale per maggiorenni ma popolati principalmente da 40-60enni, non ho nulla contro di loro ma ovviamente facciamo fatica a connetterci e vorrei conoscere altre persone della mia età. Ho 23 anni.\n\nNon devono per forza essere dei corsi strutturati come può essere un corso di lingua (non sto dicendo che non vanno bene), ma anche ritrovi organizzati (ad esempio come quelli di Giochi in Taverna al Comala o Conceria) o club tipo club del libro.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nmasdx/ritrovi_per_giovani/"
    },
    {
        "id": "1nlecoh",
        "author": "Tullio_Ostello",
        "title": "Poche persone riconosceranno questo circolo culturale",
        "content": "",
        "upvotes": 99,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ghkvekmzj6qf1.jpeg?auto=webp&amp;s=7158e33a9022b40d5ea1d9e6309a69652a7b58a6"
        },
        "permalink": "/r/torino/comments/1nlecoh/poche_persone_riconosceranno_questo_circolo/"
    },
    {
        "id": "1nm0sma",
        "author": "Capital_Specialist95",
        "title": "Nuove Amicizie",
        "content": "Salve a tutti. Mi presento, F18 dalla provincia di Torino. \n\nSono all'ultimo anno delle superiori, ma mi piacerebbe programmare al meglio il mio futuro universitario. \n\nNell'anno accademico 2026/2027 frequenterò la facoltà di Storia all'UniTo e mi piacerebbe conoscere ragazze e ragazzi da tutta Italia (non solo Piemonte) con le mie stesse intenzioni.   \nNessuno dei miei attuali compagni si iscriverà agli studi umanistici e vorrei evitare di trovarmi da sola. \n\nQualcosa in più sui miei interessi: \n\n\\- Adoro la Marvel (l'MCU e gli X-Men); mi piacerebbe un sacco poterci poi organizzare per andare a vedere Avengers: Doomsday a fine 2026 tutti assieme come gruppo.   \nInoltre, mi piacerebbe organizzare un viaggio dopo la Maturità per andare al San Diego Comic Con il prossimo luglio. \n\n\\- Mi piace scrivere, leggere e disegnare. \n\n\\- Sono appassionata di filosofia, storia dell'arte e letteratura oltre che a storia. \n\nSe siete interessati, mandatemi un DM!",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nm0sma/nuove_amicizie/"
    },
    {
        "id": "1nm9kca",
        "author": "Due-Effect-1606",
        "title": "Zona CPR(via Mazzarello/DeSanctis)",
        "content": "Quest'area nel titolo è morta? Pochissime attività, il CPR da poco riaperto...che voi sappiate sono previste iniziative di riqualificazione? Sarebbe un investimento lungimirante(appartamento )o al contrario, la zona specifica perderà valore?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1nm9kca/zona_cprvia_mazzarellodesanctis/"
    },
    {
        "id": "1nlczq5",
        "author": "krasnyj",
        "title": "Ma cosa mi dici mai",
        "content": "(a me sembra vada pure più veloce ora che c'è il cantiere che prima, poi boh)",
        "upvotes": 94,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1c4jjsfja6qf1.png?auto=webp&amp;s=8f32982da22619766ab7c898b5bf5793d64890d3"
        },
        "permalink": "/r/torino/comments/1nlczq5/ma_cosa_mi_dici_mai/"
    },
    {
        "id": "1nlwri0",
        "author": "SamSamuele",
        "title": "Monopolio immobiliare a Torino é uno scambio?",
        "content": "Mi sono recato presso i loro uffici e mi hanno chiesto un acconto per far partire il servizio di ricerca. Qualcuno ha avuto esperienza con questa \"agenzia\"?. Vorrei solo sapere se rischio di perdere solo la caparra, se dovrò dargli obbligatoriamente il restante o se si tratta di persone che ti aiutano davvero a trovare alloggi a Torino.",
        "upvotes": 2,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1nlwri0/monopolio_immobiliare_a_torino_é_uno_scambio/"
    },
    {
        "id": "1nm2yu8",
        "author": "Intelligent-Bell-120",
        "title": "RAVE CALLING",
        "content": "Tra pochi giorni ,RAVE in arrivo  \nHardTechno / Hardcore / Industrial Techno🖤\n\nlocation: Centro Di Torino\n\nSe ti interessa 👉 scrivimi in DM per i dettagli.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nm2yu8/rave_calling/"
    },
    {
        "id": "1nlfa08",
        "author": "mariopast",
        "title": "Suggerimenti per come sopravvivere a Torino dopo essere stati truffati",
        "content": "Tristemente oggi la mia ragazza è atterrata a Torino, dove sta per iniziare un semestre Erasmus, solo per scoprire che il monolocale che aveva affittato non esisteva, e che il video e il contratto erano completamente false.\n\nQual è secondo voi il modo migliore per trovare una stanza in affitto in questo pessimo periodo per cercare? Avete qualche consiglio su quale agenzia affidarsi?\n\nGrazie in anticipo!",
        "upvotes": 25,
        "comments": 36,
        "media": null,
        "permalink": "/r/torino/comments/1nlfa08/suggerimenti_per_come_sopravvivere_a_torino_dopo/"
    }
]