[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 5,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1nx0c16",
        "author": "VecchiaPrugna",
        "title": "Com'è vivere a Collegno?",
        "content": "",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1nx0c16/comè_vivere_a_collegno/"
    },
    {
        "id": "1nwzf3v",
        "author": "Original_Draw_9492",
        "title": "Torino Metro Coast to Coast",
        "content": "Probabilmente è stato già chiesto e se ne è già parlato però non sono molto attivo su reddit in modo costante, quindi chiedo:\nQualcuno di voi ha mai fatto tutto il percorso della metro Fermi-Bengasi o viceversa? Quanto ci mette circa? \nGoogle maps mi ha detto circa mezz'ora però mi sembrano pochino sinceramente 🤔",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nwzf3v/torino_metro_coast_to_coast/"
    },
    {
        "id": "1nx0ac5",
        "author": "Creative-Respect8486",
        "title": "Visiting Torino",
        "content": "Hello,\n\nMe and my 13 y/o son plan to visit Torino in November, mainly for 2 Juve games and of course to enjoy the city and more. \nWe arrive from Tel Aviv, late at Malpensa Airport, 10:30 PM. \n\nMy question is, stay over night at any malpensa hotel or to try to get to Torino at night so we have a full next day in the city?\n\nOur itinerary:\nNov 3: Land at MXP late → sleep near airport?\nNov 4: Biz to Turin → city walk → Juve match\nNov 5: Juve Museum + Allianz Stadium → maybe Museo Egizio\nNov 6: Turin\nNov 7: Rent a car. Lake Como in the morning, stay in Como\nNov 8: Morning Milan (San Siro tour) → Back to Turin → Juve match\nNov 9: Milan day (Duomo, Galleria, Sforza Castle, Leonardo Museum)\nNov 10: Return car at MXP → flight at 13:00\n",
        "upvotes": 2,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1nx0ac5/visiting_torino/"
    },
    {
        "id": "1nwdxuo",
        "author": "Murky_Giraffe8700",
        "title": "Il paradosso torinese",
        "content": "Negli ultimi anni a Torino vedo un paradosso sempre più evidente. Da una parte si sente ripetere in continuazione che “non ci sono posti di lavoro”, che “la città è ferma”, che “i giovani devono andarsene altrove per trovare opportunità”. Dall’altra parte, però, quando si presentano occasioni concrete per attrarre investimenti o mostrare un volto moderno e competitivo, come durante la Tech Week, emerge sempre la stessa reazione: ostilità pregiudiziale verso “i ricchi”, le aziende, chi potrebbe effettivamente portare capitali, innovazione e occupazione.\n\nNon si può avere entrambe le cose. Non si può piangere per la mancanza di lavoro e contemporaneamente demonizzare chi ha i mezzi per crearlo. Se una città vuole davvero crescere e migliorare, deve anche saper accogliere chi investe, senza trasformare ogni iniziativa in una lotta ideologica.\n\nQuesta visione fortemente sbilanciata a sinistra finisce per essere un freno: crea diffidenza, spaventa chi potrebbe portare risorse e dà l’impressione che Torino preferisca restare bloccata piuttosto che rischiare di “fare bella figura” grazie al contributo di chi ha successo economico.\n\nNessuno dice che i problemi sociali non contino, o che Palestina non sia importante. Ma continuare a trattare il mondo produttivo come un nemico, mentre si chiede più lavoro, più investimenti, più vitalità per la città, è semplicemente incoerente.",
        "upvotes": 57,
        "comments": 74,
        "media": null,
        "permalink": "/r/torino/comments/1nwdxuo/il_paradosso_torinese/"
    },
    {
        "id": "1nx3n4q",
        "author": "DarwinGGBG",
        "title": "Sarò a Torino venerdì 24/10 per un concorso pubblico, hotel e ristorante consigliati?",
        "content": "Come da titolo, lunedì 20 arriverò (non il 24, errore mio) a Torino in macchina (sono poco distante, Bergamo) per un concorso pubblico. La mia ragazza mi farà compagnia. Dopo il concorso di venerdì vorremmo pernottare una notte in zona e cenare (zona Scalo eventi). Consigli?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1nx3n4q/sarò_a_torino_venerdì_2410_per_un_concorso/"
    },
    {
        "id": "1nx1wrw",
        "author": "Current-Remote8989",
        "title": "📌 Studente a Torino: cerco bilocale o stanza con bagno privato / Student in Turin: looking for bilocale or room w/ private bathroom",
        "content": "{English Version Below}\n\n[Italiano]\n\nCiao a tutti 🌻\nMi sono trasferito/a da poco a Torino come studente e da circa due mesi sto cercando un alloggio. Sto cercando un bilocale, ma purtroppo non è facile trovarne uno—anche cercando di andare oltre il mio budget.\n\nLa parte più difficile sono le spese d’agenzia: alcune chiedono l’equivalente di 2 mensilità (o anche di più), a cui si aggiunge la caparra (almeno altre 2 mensilità). Per uno studente appena arrivato in una nuova città diventa davvero un peso molto grande.\n\nPer questo motivo sto cercando soluzioni direttamente da proprietari, e ho pensato di provare a chiedere qui su r/Torino.\nInoltre, sto anche cercando eventuali studenti che vogliano cedere la loro stanza in residenza, ma solo se con bagno privato ad uso esclusivo.\n\nSe conoscete qualcuno che affitta un bilocale, o qualcuno che vuole trasferire la propria stanza in residenza con bagno privato, o se avete semplicemente consigli su dove cercare, ve ne sarei davvero grato/a 🙏\n\nGrazie di cuore per aver letto, e apprezzo tantissimo qualsiasi aiuto dalla comunità torinese! 💙\n\n⸻\n\n[English]\n\nHi everyone 🌻\nI’ve recently moved to Turin as a student and I’ve been searching for accommodation for the past two months. I’m looking for a two-room apartment (bilocale), but unfortunately it hasn’t been easy to find one—even when I try to stretch my budget beyond my comfort zone.\n\nThe hardest part is the agency fees: some ask for the equivalent of 2 months’ rent (or even more), on top of the deposit (at least another 2 months). For a student just arriving in a new city, this becomes a really heavy burden.\n\nThat’s why I’m trying to find a place directly from homeowners, and I thought I’d try my luck here on r/Torino.\nI’m also looking for any students who might want to transfer their student housing room, but only if it comes with a private bathroom for exclusive use.\n\nIf you know anyone renting a bilocale, or anyone who wants to transfer their student housing room with a private bathroom, or even if you just have tips on where to search, I’d be truly grateful 🙏\n\nThank you so much for reading, and I really appreciate any help from the Torino community! 💙",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nx1wrw/studente_a_torino_cerco_bilocale_o_stanza_con/"
    },
    {
        "id": "1nx18yc",
        "author": "Over-Pie-7916",
        "title": "Do i have a chance to enter Uni Turin?",
        "content": "**Hey Everyone**  \nI'm thinking about applying to Turin University for the 2027–2028 intake, but I'm not really sure if my profile is strong enough. I’ll need to get DSU scholarship to be able to study there, so that’s pretty important for me.\n\nI’m planning to apply for ECONOMICS AND FINANCE WITH DATA SCIENCE OR BUSINESS &amp; MANAGEMENT . My GPA will probably be around 91/100, and my SAT score might be around 1350-1400. I’m also expecting to get a 7.0 on the IELTS.\n\nOutside of academics, I have a certificate from the ITU Entrepreneurship Summit, and I’ve been part of the eTwinning club for two years. I’ll likely do an Erasmus+ exchange soon to the Europe, and I’m also working on a biochemistry project for TÜBİTAK(The Scientific and Technological Research Council of Turkey). My ISEE is also quite low, which I think matters for scholarships.\n\nDo you think it’s worth applying with this profile or is it time waste?\n\nThanks in advance for any thoughts",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nx18yc/do_i_have_a_chance_to_enter_uni_turin/"
    },
    {
        "id": "1nwy7km",
        "author": "DanielFHD4K",
        "title": "Corso di tennis",
        "content": "Qualcuno interessato ad un corso di tennis livello intermedio (credo, basta sapere giocare un minimo e non partire da zero)?\nEventualmente scrivetemi in pvt per info\n\nEdit:\nStiamo cercando 2 persone, se arriviamo a 4 il costo è di 460€ per 24 lezioni di un'ora a settimana ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1nwy7km/corso_di_tennis/"
    },
    {
        "id": "1nwwk85",
        "author": "jollanza",
        "title": "Willie Peyote chiede corridoi umanitari e Palestina libera, (sciopero generale 3 ottobre)",
        "content": "",
        "upvotes": 0,
        "comments": 66,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ap19njr5uvsf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/torino/comments/1nwwk85/willie_peyote_chiede_corridoi_umanitari_e/"
    },
    {
        "id": "1nwt9b2",
        "author": "00Bluebell00",
        "title": "Conoscete un buon medico estetico a Torino?",
        "content": "Per ora ne ho provati un paio, ma non sono ancora riuscita a trovarne uno che mi convinca appieno. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nwt9b2/conoscete_un_buon_medico_estetico_a_torino/"
    },
    {
        "id": "1nwcmq3",
        "author": "Murky_Giraffe8700",
        "title": "Manifestanti ProPal Assaltano Le OGR",
        "content": "",
        "upvotes": 12,
        "comments": 70,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/F9cBPeey2MJvfpbSJbzMWpSfFgFcLzvq6GirpOxMX6I.jpeg?auto=webp&amp;s=0e47cafd2d70adc2f2af9816106a628be1737a97"
        },
        "permalink": "/r/torino/comments/1nwcmq3/manifestanti_propal_assaltano_le_ogr/"
    },
    {
        "id": "1nwjq91",
        "author": "Legitimate_Cry6957",
        "title": "Consigli per posti romantici a Torino (6 giorni con la mia ragazza)",
        "content": "Ciao a tutti,\nsarò a Torino per 6 giorni con la mia ragazza. Avete dei posti romantici da consigliare, magari tranquilli, dove possiamo parlare e goderci un po’ di tempo insieme?\n\nGrazie in anticipo!",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1nwjq91/consigli_per_posti_romantici_a_torino_6_giorni/"
    },
    {
        "id": "1nwhcan",
        "author": "aranor01",
        "title": "Easy Riders - Castagnata",
        "content": "Per info e iscrizioni: https://docs.google.com/forms/d/e/1FAIpQLScP3BHyto1A3sXt1HferlgMxYC5yrOV6xw1puk0D9lYvJmWHg/viewform",
        "upvotes": 6,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qhhhr92zsrsf1.png?auto=webp&amp;s=27f06ba4760ff9a9f0919efed2955431a90f0351"
        },
        "permalink": "/r/torino/comments/1nwhcan/easy_riders_castagnata/"
    },
    {
        "id": "1nwlip1",
        "author": "GoodHorse1926",
        "title": "Torino festa bianca",
        "content": "Ciao la festa è qui\nZona piazza statuto  ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nwlip1/torino_festa_bianca/"
    },
    {
        "id": "1nwd8sp",
        "author": "Virtual-Ad-8601",
        "title": "EDISU Torino review (Olimpia)",
        "content": "Hi guys, I am an erasmus student and will attend Unito in the spring semester. I got a space at the Edisu student residence hall Olimpia and was wondering if any of you could give me an honest and deep review. I know that overnight guests are not allowed on paper, but I was wondering if it’s possible to “sneak” them in :) thanks for the info :)",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nwd8sp/edisu_torino_review_olimpia/"
    },
    {
        "id": "1nwex1y",
        "author": "Virtual-Ad-8601",
        "title": "EDISU Torino reviews? (amenities, overnight guests, location, cleanliness etc)",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nwex1y/edisu_torino_reviews_amenities_overnight_guests/"
    },
    {
        "id": "1nwewnw",
        "author": "Jmariax33",
        "title": "Chances of securing an Internship in Torino?",
        "content": "Hey All!\n\nI'm relocating to Bologna from Ireland until June 2026. I'm going to be studying a Masters degree in Digital Marketing and Communications and an internship is required as part if the Degree. I have been to Turin twice before and love the city so I would love to complete my internship there. The issue is I'm learning Italian from scratch so I'm just wondering the chances of finding an appropriate internship I could complete in Turin as a non fluent Italian speaker. Any tips are appreciated. I have three years experience in corporate communications already but I'm not sure how useful that will be in Italy",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nwewnw/chances_of_securing_an_internship_in_torino/"
    },
    {
        "id": "1nwmasn",
        "author": "Current-Remote8989",
        "title": "Residence Permit Application",
        "content": "I’m applying for the first time and I have a question: Do I need any bank documents to prove financial means? In my schools website it doesn’t mention it. If yes, is dollars fine?",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1nwmasn/residence_permit_application/"
    },
    {
        "id": "1nwb1ge",
        "author": "Sorry_Carrot7537",
        "title": "Trasferimento a Torino",
        "content": "Ciao a tutti, sono un ragazzo di 20 anni, e sono siciliano, a breve salgo a Torino per lavoro diciamo, non è la prima volta che vengo, ci sono già stato in passato. Mi piacerebbe fare nuove amicizie, conoscere nuove persone, sia della mia età che non, sono aperto a tutto. Vi parlo un po' di me, mi piacciono i videogiochi (sono un PC gamer), i motori, faccio calisthenics e boh, mi piace fare un po' di tutto, dall'andare al cinema a fare normalissimi passeggiate in parchi o boschi, e nulla, se qualcun* fosse interessat* che si faccia pure avanti!!!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nwb1ge/trasferimento_a_torino/"
    },
    {
        "id": "1nvyd33",
        "author": "SarahS2222",
        "title": "Safe neighbourhoods for solo female",
        "content": "Hi all, I know it's been asked a few times but looking for more current info.  \nI'm moving to Turin and I'll need to commute late at night on my own.  \nChoosing a neighbourhood, would appreciate any advice on which to avoid for safety reasons.\n\nI've had caution against Aurora, Barriera di Milano, Porta Palazzo, via Nizza, Borgo Dora.  \nThanks!",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1nvyd33/safe_neighbourhoods_for_solo_female/"
    },
    {
        "id": "1nw8itz",
        "author": "DismalMagician2577",
        "title": "Feste in costume ad Halloween",
        "content": "Ciao, \nConoscete delle feste, magari techno, magari in cui sia incoraggiato il vestirsi in costume, per il week-end di Halloween?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nw8itz/feste_in_costume_ad_halloween/"
    },
    {
        "id": "1nw88fy",
        "author": "Disastrous-Cow6888",
        "title": "Festa laurea",
        "content": "Ciaooo, Avete qualche suggerimento per dove fare una festa di laurea magari in centro, zona quadrilatero etc..? budget medio",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nw88fy/festa_laurea/"
    },
    {
        "id": "1nw71az",
        "author": "ForeignHand6335",
        "title": "Chi va al concerto di mostro 8",
        "content": "Cerco qualcuno con cui andare al concerto di mostro a Torino ,così da cercare anche qualche fan , chi e interessato mi scriva ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nw71az/chi_va_al_concerto_di_mostro_8/"
    },
    {
        "id": "1nw0fgo",
        "author": "Demiurgo_-_",
        "title": "Mutuo INPS dipendenti pubblici",
        "content": "Ciao a tutti, c’è qualcuno che ha richiesto mutuo inps per dipendenti pubblici e può darmi qualche informazione in merito? \nTipo avete fatto tutto da soli online o vi siete fatti seguire da qualche figura professionale? Tempi della pratica? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nw0fgo/mutuo_inps_dipendenti_pubblici/"
    },
    {
        "id": "1nvyc9k",
        "author": "lexdoleur",
        "title": "eye clinic",
        "content": "hello! does anyone know a good private eye clinic and a doctor in turin who preferably knows english? and  if you had any experience with it, how much a consultation costs generally? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nvyc9k/eye_clinic/"
    },
    {
        "id": "1nv36qv",
        "author": "skippymetal",
        "title": "Mirafiori ieri",
        "content": "Ma cosa diamine è successo? (Cosa c'entrava l'uomo calvo?) Ho controllato e non mi sembra sia ancora stato postato, in caso contrario mi scuso in anticipo e vi chiedo di cancellarlo\n https://www.torinotoday.it/cronaca/machete-auto-sanremo-30-settembre-2025.html?utm_source=newsshowcase&amp;utm_medium=discover&amp;utm_campaign=CCwQ64Xd6NzO9_LBARic95P1yu3P7rUBKikIMBCnkcmD29Lp5c4BGNnag-GP_oeKnQEqDwgAKgcICjDomaEJMKe6cQ&amp;utm_content=related",
        "upvotes": 19,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/uBv5LAak8HXHlYobMU2ytJNFwSXZuf4KB3ozpPNLeng.jpeg?auto=webp&amp;s=b476cac14a5f0436d06dbb9ae68ee77692d7b1c0"
        },
        "permalink": "/r/torino/comments/1nv36qv/mirafiori_ieri/"
    },
    {
        "id": "1nv6qug",
        "author": "Parking-Job-3175",
        "title": "Com’é il mercato lavorativo a Torino? Come é cambiato negli ultimi anni?",
        "content": "",
        "upvotes": 10,
        "comments": 23,
        "media": null,
        "permalink": "/r/torino/comments/1nv6qug/comé_il_mercato_lavorativo_a_torino_come_é/"
    },
    {
        "id": "1nv543k",
        "author": "toast_118",
        "title": "Ragazzi devo prendere un treno venerdì con lo sciopero aiutatemi",
        "content": "Questo venerdì sarà un disastro, ne sono perfettamente a conoscenza, per un grosso impegno non posso stare qui e devo per forza spostarmi. Ho un Frecciarossa garantito che dovrebbe passare ma dopo che hanno bloccato i binari di Porta Nuova non so più se partire, devo fare un cambio di sera tardi con un altro treno sempre garantito e non posso permettermi di avere il treno in ritardo o altrimenti rimango a piedi a metà strada. Che faccio?",
        "upvotes": 12,
        "comments": 27,
        "media": null,
        "permalink": "/r/torino/comments/1nv543k/ragazzi_devo_prendere_un_treno_venerdì_con_lo/"
    }
]