[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 11,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 713,
        "comments": 5209,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1o3124f",
        "author": "N3DSdude",
        "title": "If Netflix really gets the Champions League, what happens to VPN users?",
        "content": "Let’s be real. Netflix and a few other platforms seem to be getting better at detecting and blocking VPNs.\n\nNow there’s talk about Netflix possibly landing the UEFA Champions League, which sounds exciting, but it also makes me wonder: if streaming services can reliably block encrypted or rerouted traffic, what does that mean for online privacy in general?\n\nAre we heading toward a future where it’s basically impossible to browse or stream without being fully visible to providers? Or will users and tech keep finding new workarounds like they always have?\n\nCurious where people think this is heading. Is it a losing battle, or just another round in the back-and-forth between privacy advocates and big streaming companies?",
        "upvotes": 10,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1o3124f/if_netflix_really_gets_the_champions_league_what/"
    },
    {
        "id": "1o2zhgo",
        "author": "Round-Refrigerator99",
        "title": "Is \"Nailed It!\" canceled?",
        "content": "I really loved watching Nailed it when I was younger but it's been so long since a new season came out. I don't keep up with any of the host's social media so I don't know if they announced it being canceled or not",
        "upvotes": 8,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o2zhgo/is_nailed_it_canceled/"
    },
    {
        "id": "1o309wz",
        "author": "Icy_Ad8228",
        "title": "There’s a Reason Billionaire Bunker Feels So Familiar, And It’s Not Just the Storyline.",
        "content": "I was watching it on Netflix and something about the vibe felt familiar: same tension, same obsession with power and control.\n\nThen I found out it’s by the Money Heist team. Makes total sense now. The whole “billionaires hiding underground while the system crumbles” angle suddenly feels like a continuation of the same story.\n\nWild connection, anyone else notice?\n",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o309wz/theres_a_reason_billionaire_bunker_feels_so/"
    },
    {
        "id": "1o2itvh",
        "author": "Ksecs83",
        "title": "Ed gein Monster bernice holden",
        "content": "EDIT: Her name was Worden.\n\nIf I were Bernice Wordens family,  I would be pretty upset by the way Ryan Murphy wrote her character in as she had a sexual relationship with Ed. He was a customer of her store. That's it. I get that it's Hollywood. They have to make shit up to make it interesting.  But it just rubbed me the wrong way. Also I think the storyline with adeline was bs too. ",
        "upvotes": 48,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1o2itvh/ed_gein_monster_bernice_holden/"
    },
    {
        "id": "1o32nog",
        "author": "YungVal94",
        "title": "The Women in cabin 10",
        "content": "I actually liked this movie, in my opinion it was actually a good thriller, and it made me jump once or twice. I think the ending was a little eah but overall, I would give the movie like a 7.5/10. What do you guys think?",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1o32nog/the_women_in_cabin_10/"
    },
    {
        "id": "1o3247r",
        "author": "VILTO_13",
        "title": "Trouble with screen mirroring",
        "content": "So I just got Netflix and I want to screen mirror it to my tv but it's not working. It connects but the TV says that I need to sign in, but when my sister tried it, it worked just fine without signing in with the TV. I know that Netflix requires you to sign in with both devices, but I'm mostly confused by why does it work without needing to sign in when my sister does it. With me Netflix doesn't even always show the screen cast icon. If you know why this is please let me know.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o3247r/trouble_with_screen_mirroring/"
    },
    {
        "id": "1o36ug6",
        "author": "Cute_Note_3624",
        "title": "The woman in cabin 10 reviews",
        "content": "Is the movie watchable despite the many bad reviews?? I have nothing to watch this weekend and I'm extremely bored. Should I really watch it or no pls be honest ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o36ug6/the_woman_in_cabin_10_reviews/"
    },
    {
        "id": "1o36c7l",
        "author": "pakotini",
        "title": "True Haunting: House that Murdered Me a.k.a. The Misogyny Documentary",
        "content": "Have you watched the House that Murdered me, part of True Haunting? Oh my, is it a study on misogyny!\n\nThe woman becomes the breadwinner, and everyone loses their shit. The mom actually tells her daughter \"you should not work at night, the house is haunted\". And \"you work at an escort service, no wonder the devil is in your house\". I stopped watching after that. Poor woman.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o36c7l/true_haunting_house_that_murdered_me_aka_the/"
    },
    {
        "id": "1o2lu13",
        "author": "gg2351",
        "title": "My cousins dining room was filmed for the Ed Gein monster series",
        "content": "",
        "upvotes": 18,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o2lu13/my_cousins_dining_room_was_filmed_for_the_ed_gein/"
    },
    {
        "id": "1o2sp97",
        "author": "Ok_fineidrcare",
        "title": "Just finished watching Boots!",
        "content": "It’s so refreshing to see a gay show about brotherhood and not much else! Thank god it didn’t turn tyler perry inside that bootcamp, I was afraid it’d be so soap opera-ish full of abuse and shits and was ready to skip the series but yeah💀 the tone and cinematography is so unserious too they made that whole 13 weeks less exhausting even as a viewer, that camp was intense asf. Hope we get another season!",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o2sp97/just_finished_watching_boots/"
    },
    {
        "id": "1o26p1p",
        "author": "No-Relative4683",
        "title": "Victoria Beckham",
        "content": "Well, this was absolute garbage!\n\nNothing on her music career, no interviews with the Spice Girls, no dirt or backstage gossip - just a vehicle to promote her flailing fashion line. \n\nAnybody else extremely disappointed in this 3 hour advertisement?",
        "upvotes": 83,
        "comments": 104,
        "media": null,
        "permalink": "/r/netflix/comments/1o26p1p/victoria_beckham/"
    },
    {
        "id": "1o2zz87",
        "author": "freaky33",
        "title": "Apple TV Netflix app variable bitrate streams very often",
        "content": "I don't now what happend but when I watch a series the Apple TV status bar overlay pops-up and it's like I touch the remote or something and after a couple of minutes the stream quality drops and I got a lot of squares and artifacts. It  comes back to 4k/Dolby Vision quality but I never ever had an issue. My bitrate of the WiFi is not changed and still the same. What happens and other people have the same issue?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o2zz87/apple_tv_netflix_app_variable_bitrate_streams/"
    },
    {
        "id": "1o2ziel",
        "author": "entcanta333",
        "title": "Netflix has been limiting me to one device, when I reached out to tech support they told me to upgrade my plan.",
        "content": "As far as I know the standard plan is supposed to support two devices to play simultaneously. \n\nIs anyone else having this issue? \n\nI'm also absolutely furious at their tech support just telling me to upgrade my account, wtaf? \n\nThe guy told me they have no hierarchy in their customer support and thats all they can do for me. \n\nAs a Netflix customer of 15+ years, and someone who has a premium account for more than half of that, I'm really on the edge here and ready to unsubscribe. I feel I've watched the decline of Netflix between raising costs,  limiting use, ads, and technical difficulties, am I overreacting?",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1o2ziel/netflix_has_been_limiting_me_to_one_device_when_i/"
    },
    {
        "id": "1o2r969",
        "author": "FuelZealousideal4553",
        "title": "Unknown user on my account",
        "content": "For weeks I’ve been noticing that my NF account will indicate a show I have no interest in has been watched both in full or partially.  At first I thought it was my husband carelessly just clicking on my profile but he assures me he never does that. We have 3 smart tv’s.  The shows indicating they’re being watched don’t appeal to either of us and only appear on my profile.  When I contacted Netflix they instructed me to go to the Security area of my account and to check the devices signed in.  I found a TV brand we do not own and signed it out.  Within days the TV appeared again and on NF advice I changed my password.  Within days they were back and now I find I have to sign them out a couple times a week.  NF seemed flummoxed and then suggested maybe my email had been hacked.  They suggested perhaps I should get a new email.  Does this make any sense?  Without my password how are they accessing my account?Should I be concerned?  ",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1o2r969/unknown_user_on_my_account/"
    },
    {
        "id": "1o1xl5o",
        "author": "Ember_Grove20",
        "title": "What’s a Netflix original you think aged really well?",
        "content": "I was rewatching some of the older Netflix originals and honestly, a few of them still hold up so well. I’m curious which ones do you think aged the best? Are there any shows or movies you’ve gone back to and thought, wow, this still slaps?\n\nWould love to hear which ones you think are still worth watching today! \\^\\^",
        "upvotes": 156,
        "comments": 331,
        "media": null,
        "permalink": "/r/netflix/comments/1o1xl5o/whats_a_netflix_original_you_think_aged_really/"
    },
    {
        "id": "1o2nxum",
        "author": "Fantastic-Pension-72",
        "title": "What’s your favorite show and why?",
        "content": "Hello I’ve been wondering what’s everyone’s favorite show and why. Wondering what genre everyone likes and why. I’ve watched a few shows on Netflix but not many as just recently getting back into watching Netflix shows. Most of the shows I’ve watched are k dramas and c dramas on Netflix. Think my favorite show would be one of the k-dramas I watched like Beyond the Bar or Startup as I haven’t watched many others yet. ",
        "upvotes": 4,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1o2nxum/whats_your_favorite_show_and_why/"
    },
    {
        "id": "1o2n4be",
        "author": "ltlbunnyfufu",
        "title": "Old dog, new tricks",
        "content": "This is hands down the funniest thing I have seen on Netflix.  It’s like All Creatures Great and Small meets Last Tango in Halifax.  If you speak Spanish there are extra jokes.  I laughed so hard I had to take multiple bathroom breaks.  I hope they do a second season.  ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o2n4be/old_dog_new_tricks/"
    },
    {
        "id": "1o2ie00",
        "author": "No-Bass8742",
        "title": "Uk: new layout",
        "content": "I have just logged on to Netflix and saw a new layout. Absolutely horrendous design, gigantic tiles, scrolling within ab inch of my life, weird categories… did coming this week, next week, worth the wait rows disappear? Any way to switch back?",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1o2ie00/uk_new_layout/"
    },
    {
        "id": "1o33s29",
        "author": "Hurridown",
        "title": "Nudity in Scandinavian Series &amp; Movies",
        "content": "Why do Scandinavian shows have more nudity as compared to the American shows?\n\nThey even have full frontal nudity (Females)\n\nIs it because nudity is culturally accepted in Europe than in USA and it's not a taboo?\n\n\n",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1o33s29/nudity_in_scandinavian_series_movies/"
    },
    {
        "id": "1o2rc4r",
        "author": "Equivalent_Phrase_25",
        "title": "SPOILER! Maze Runner",
        "content": "Just incase if no one has seen the series it’s been out for a while \n\nBut poor Jeff man, just watched the scene where Thomas led the group through the griever den and used the key to unlock the door. \n\nMihno was the only one who knew the sequence but was pinned down and Jeff was a badass and stabbed the griever to save him. \n\nYou were so close Jeff 😞 you and alby will always be remembered ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o2rc4r/spoiler_maze_runner/"
    },
    {
        "id": "1o2aiee",
        "author": "GenevieveCostello",
        "title": "Has anyone seen Nero the Assasin, newly released French Netflix show?",
        "content": "Oh My God, I binge watched all of its 8 episodes yesterday, and I guarantee you that it would be gripping. I couldn't stop watching it. Attractive characters, great actings, captivating plots, it was fascinating!   ",
        "upvotes": 5,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1o2aiee/has_anyone_seen_nero_the_assasin_newly_released/"
    },
    {
        "id": "1o26fpq",
        "author": "Jak1493",
        "title": "4K tv but you have to get the 4K plan?",
        "content": "Is it true if you have a 4K tv, you have to get the 4K plan for it? Or can you still use a lower plan for Netflix? I ask because I’ve heard not all of Netflix’s stuff is in 4K and seems a bit much ",
        "upvotes": 7,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1o26fpq/4k_tv_but_you_have_to_get_the_4k_plan/"
    },
    {
        "id": "1o2jwni",
        "author": "Ok-Let-5155",
        "title": "Can't access/buy Netflix in Colombia",
        "content": "Hi all can anybody help me.\n\nI am a NZ resident who is travelling to Colombia for work at the moment, I travel to Colombia fairly regularly actually.\n\nI am unable to access my NZ account in Colombia due to what I can only assume is geo-blocking (pure scumbaggery) so I tried to sign up for a Colombian netflix and it wouldn't accept my card. I then tried to buy a gift card to redeem which I also was unable to do.\n\nWhy are they making it so fucking difficult for legitimate customers to pay to use their service? \n\nAnybody got any advice at all? Thanks",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1o2jwni/cant_accessbuy_netflix_in_colombia/"
    },
    {
        "id": "1o1yw8w",
        "author": "dicklaurent97",
        "title": "Nurse Jackie is now on Netflix",
        "content": "It's dark, subtle, heartfelt and unexpected. Edie Falco stars as a drug-addicted nurse who is constantly either using or saving someone's life. It's a brilliant series if you want to watch something that is both enjoyable and challenging. ",
        "upvotes": 18,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1o1yw8w/nurse_jackie_is_now_on_netflix/"
    },
    {
        "id": "1o25yae",
        "author": "reggiepd",
        "title": "Mafia: Most Wanted",
        "content": "This series could have been five minutes long.\n\nSame shit repeated over and over again.\nWhat a waste of time.\n\nI guess I learned about the 'ndrangheta, but Jesus that was painful!",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o25yae/mafia_most_wanted/"
    },
    {
        "id": "1o1iob4",
        "author": "pleasedontbemeantom3",
        "title": "Wayward was sooo good until it wasn't.",
        "content": "Did anyone else feel this way?\n\nSpoilers ahead.\n\n\nI was so sucked in by wayward, it was great, the plot the mystery, the acting (Mae was a little flat but that's their shtick and I like them and Toni was so awesome I just didn't mind), I was loving it. \n\nThere was so much energy and intrigue in the show. And then in episode 8, I felt like it just didn't deliver. I think it just wasn't good as a limited series. The mystery that was built was too big for the wrap up. I wanted to understand by the end something about the inner world or workings of the townspeople. In general, for a show which centered so much around emotions, the deeper we got into the series the more shallow the characters seemed to become. It was really disappointing. We never were let into the characters internal experience. \n\nI wanted so badly to see Laura and Alex actually TALK about things. Like the relationship was never sold as functional or emotionally intimate. I get if at first they were freaked out but when they got on the same page, why was the most we got was a a couple arguments? No real conversation. Alex is obsessive and won't let things go about work but his wife is obviously going through all this and not  actually planning on leaving town snd he's not bothering her constantly about it? \n\nThe timeline just felt wonky and poorly conceived following the set up. A great concept with poor follow through. I was left wanting more, but not in a good way, but in the way that I felt they would have to undo what they had done to answer things in a satisfying way. ",
        "upvotes": 162,
        "comments": 175,
        "media": null,
        "permalink": "/r/netflix/comments/1o1iob4/wayward_was_sooo_good_until_it_wasnt/"
    },
    {
        "id": "1o1vs6b",
        "author": "voltagejim",
        "title": "Anyone watch True Haunting?",
        "content": "I used to love ghost shows and ghost stories back in the mid 90's through early 00's.  Then I found that all those reality ghost shows were all fake, and a lot of famous ghost stories were fake, and I just stopped believing in all that.\n\n  \nI watched this out of curiosity and honestly enjoyed it.  I honestly was trying to figure out explanations for  some of the things.  The 2nd story with the house was the most wild one.  Anyone have any additional info on these stories with rationale explanations for everything that happened?",
        "upvotes": 25,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1o1vs6b/anyone_watch_true_haunting/"
    },
    {
        "id": "1o27o4e",
        "author": "Jumpy_Music653",
        "title": "recommendation",
        "content": "I work from home and live alone, so to avoid dying of boredom and be more productive, I watch TV series while I work, but I'm in big trouble because I think I've seen everything. Do you have any series you can recommend? I like science fiction, documentaries, romance, I watch almost everything.",
        "upvotes": 4,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1o27o4e/recommendation/"
    }
]