[
    {
        "id": "1joono2",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1joono2/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1joonon",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1joonon/la_piola_friends_meetup/"
    },
    {
        "id": "1jz2ovu",
        "author": "spacecraft628",
        "title": "Opinione sul prezzo per un evento arcade anni ’80?",
        "content": "Ciao a tutti!  \nStiamo facendo un piccolo sondaggio per un evento dedicato al mondo arcade e retrogaming che vorremmo organizzare in zona nord-ovest.\n\nImmaginate una **sala giochi ispirata agli anni '80,** con un centinaio di cabinati originali, flipper, calciobalilla, console vintage e musica a tema.\n\nL’idea sarebbe quella di far entrare il pubblico con un biglietto e permettere gioco libero su tutto ciò che si preferisce per il tempo che si vuole. Quindi zero limiti.\n\nSecondo voi, quale sarebbe un prezzo giusto per un’esperienza del genere?\n\nGrazie a chi risponderà!",
        "upvotes": 12,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1jz2ovu/opinione_sul_prezzo_per_un_evento_arcade_anni_80/"
    },
    {
        "id": "1jyzbuv",
        "author": "_pigreco_",
        "title": "assembramento di 68",
        "content": "ironia a parte, situazione ridicola alla 4 di pomeriggio ",
        "upvotes": 17,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/tkjnxrp52tue1.jpeg?auto=webp&amp;s=5c03776979ee02cf544d0b4bb122263f1253901b"
        },
        "permalink": "/r/torino/comments/1jyzbuv/assembramento_di_68/"
    },
    {
        "id": "1jz40h7",
        "author": "Emergency-Button-66",
        "title": "Almost got run over by a car",
        "content": "What is your opinion in this situation? Is this a normal driving situation here? \n\nLong story short, I was walking home, and at the intersection, I stopped before crossing. A car was approaching but the driver also stopped at the intersection to check, so when I saw that it was safe to cross because the car stopped, I started crossing on the crosswalk. I was midway to the other end, and the driver accelerated and braked just around 1meter from me. I looked at him, and he didn’t even say sorry, just the hand gesture of both hands raising up like what do you want from me or a sign of relieve that he didn’t hit me (I don’t even know how to interpret the gesture but for sure it was not the I’m sorry because he didn’t even look at me at all). I reached to the other end, and looked at him being so pissed and mumbling vafanculo because that’s all the cursed word I know, and then continued walking. He also drove away after that.  \n\nI tried to give him the benefit of the doubt because I saw that he is a very old man driving the car, so I try not to think that it’s intentional because I’m not Italian, but it’s very unsettling in my mind. I just moved to Italy not long ago, and I’m still trying to learn about the customs and how things work over here, so this kind of incident really gets me paranoid easily. \n\nI wanted to make a report at the police station, but my husband said that won’t do anything because I don’t remember that plate number or the car brand. Also, I don’t know if there is any cctv there or not, so he suggested that the report will just be a waste of time. \n\nWhat should I do? Should I just forget about it and move on with my life? What would people over here do in this situation? ",
        "upvotes": 5,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1jz40h7/almost_got_run_over_by_a_car/"
    },
    {
        "id": "1jz63kl",
        "author": "Parmesean_Lover",
        "title": "Animal shelter",
        "content": "Italiano sotto 🇮🇹 English Above 🇬🇧\n\nHi,\nAre there any places in Turin to play or volunteer to take care of cats and dogs inside that place?\nI see some animal shelter in Turin, can one go there and play with the animals and pet them etc.?\nI am asking because my girlfriend loves animals but we can't take one yet, since she is fighting depression I thought this will cheer her up\n\nMany thanks!\n\n\nCiao,\nci sono posti a Torino dove si può giocare o fare volontariato per prendersi cura di cani e gatti all’interno della struttura?\nHo visto che ci sono alcuni rifugi per animali a Torino, ma ci si può andare per passare del tempo con gli animali, accarezzarli, ecc.?\nLo chiedo perché la mia ragazza ama gli animali, ma al momento non possiamo prenderne uno. Siccome sta lottando contro la depressione, ho pensato che questo potrebbe aiutarla a sentirsi meglio.\n\nGrazie mille!\n\n\n",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jz63kl/animal_shelter/"
    },
    {
        "id": "1jz76dj",
        "author": "Kitchen-Hospital-438",
        "title": "Wifi",
        "content": "Hi guys, I’m about to move there and I need a strong and most stable WiFi connection which company I should get, how long do they take to install and do they speak Spanish or English when they call you?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1jz76dj/wifi/"
    },
    {
        "id": "1jyw8rq",
        "author": "Takamaka7",
        "title": "Info su weekend a Torino",
        "content": "Ciao a tutti, saremo a Torino dal 19 al 21 Aprile in famiglia con bambini. Gireremo la città a piedi e se serve con i mezzi pubblici, alloggeremo nel quadrilatero.\nOltre al museo Egizio per il quale abbiamo già comprato i biglietti, ci consigliate un ristorante per sabato sera e cose imperdibili da vedere. Anche un bel mercatino usato/vintage sarebbe bello.\nGrazie 🤗",
        "upvotes": 4,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1jyw8rq/info_su_weekend_a_torino/"
    },
    {
        "id": "1jywnyj",
        "author": "No-Bit-2036",
        "title": "Consigli su Torino",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1jywnyj/consigli_su_torino/"
    },
    {
        "id": "1jz0wgn",
        "author": "Giku_DRS",
        "title": "Nuove conoscenze a Torino",
        "content": "Mi presento sono un ragazzo di 22 anni che vorrebbe organizzare uscite per conoscere nuove persone (preferibilmete della mia età). Abito in provincia e in questi anni non ho mai avuto l'occasione di esplorare la città nella sua interezza. Mi piace provare cose nuove e non mi tiro mai in dietro verso nuove proposte. Chi é interessato può scrivermi in dm per creare un gruppo. ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1jz0wgn/nuove_conoscenze_a_torino/"
    },
    {
        "id": "1jz0qes",
        "author": "Parmesean_Lover",
        "title": "IBS",
        "content": "Italiano sotto 🇮🇹\n\nHiii! I am an international student living in Turin and I am planning a trip to Genoa soon. Here is my problem: I suffer from IBS and during the time I am traveling in the bus or the train; I need the access to the toilet. It is not a beautiful scene but sadly it is my life :( How good are the toilets in FlixBus and trains overall? Can I use it for number 2 without getting STD or pregnant? /s\n\nEnglish above 🇬🇧\n\nCiaoo!\nSono una studentessa internazionale che vive a Torino e sto pianificando un viaggio a Genova.\nEcco il mio problema: soffro di IBS e, mentre viaggio in autobus o in treno, ho bisogno di avere accesso al bagno.\nNon è una scena bellissima, ma purtroppo è la mia realtà :(\nCom'è la situazione dei bagni sui FlixBus e sui treni in generale? Posso usarli per fare la \"numero 2\" senza rischiare di prendere una malattia o rimanere incinta? /s\n",
        "upvotes": 1,
        "comments": 17,
        "media": null,
        "permalink": "/r/torino/comments/1jz0qes/ibs/"
    },
    {
        "id": "1jyxtce",
        "author": "H34vyM3nt41",
        "title": "Funny souvenirs / Local brands",
        "content": "Hi all,\n\nI'm looking to buy some souvenirs for a friend.  \nMy idea is to buy either:\n\n1. A funny Torino souvenir, could be anything to be honest, so recommend your favourite shops. \n\n2. A local brand t-shirt with some Torino-based design. Like a good quality t-shirt with some print on it, could be something funny as well. What are your favorite local brands that could sell t-shirts like these?\n\n  \nThanks in advance.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1jyxtce/funny_souvenirs_local_brands/"
    },
    {
        "id": "1jyjjaz",
        "author": "davves12",
        "title": "Nuove amicizie",
        "content": "Ciao a tutti, sono un ragazzo di 29 anni che si è trasferito a Torino 5 anni fa. Da allora, complici vari motivi tra cui il mio carattere introverso, non sono riuscito a crearmi nessuna amicizia in questa città. Mi dispiace perché in realtà una volta che mi trovo a mio agio divento una persona molto aperta.\n\nMi farebbe davvero piacere trovare qualcuno/a con interessi simili con cui poter uscire in centro, fare passeggiate in montagna, visitare musei, fare qualche gioco da tavola o più banalmente chiacchierare del più e del meno :)\n\nDove fare amicizia a Torino? Oppure, se anche voi cercate nuove amicizie, scrivetemi pure! Mi farebbe piacere conoscere persone con interessi simili e creare un gruppo per uscire e divertirsi insieme!",
        "upvotes": 15,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1jyjjaz/nuove_amicizie/"
    },
    {
        "id": "1jyswng",
        "author": "Kryptonite7x7",
        "title": "A question regarding TOLC and PoliTo Uni application",
        "content": "\n\nHello everyone,\n\nSo Im a non EU student which will be attending the English TOLC I in 3 days. Either gonna study CE or EE. I was aiming for PoliMi but I realized that they dont have English CE major. So I ll opt for PoliTo.\n\nHowever while applying for the exam, I remember something like choosing school and I chose PoliMi and Tolc@Home because Im far, far away from Italy.\n\nDoes that mean I messed it up? Do I have to re enter the exam each time to apply a different school? I mean my thought was attending the exam-getting the grade-applying to schools-getting accepted/rejected\n\n  \nI m a bit confused now, can anybody help me with this process?\n\nAlso, I know that Im already late for this semester, I will hopefully enroll in spring 2026",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jyswng/a_question_regarding_tolc_and_polito_uni/"
    },
    {
        "id": "1jy7kt2",
        "author": "MaintenanceFrosty475",
        "title": "Avreste dieci minuti per rispondere il nostro questionario?🫶🏼",
        "content": "Buongiorno, siamo un gruppo\ndi studenti del Laboratorio di Design per i Beni\nCulturali del Corso di Studi Design per la\nComunicazione del Politecnico di Torino: stiamo\npensando alcune proposte di valorizzazione di\ncircuiti per cicloamatori (e non solo) della città\ndi Settimo Torinese (To) e dei comuni confinanti,\nattraverso anche una migliore comunicazione. Le chiediamo di aiutarci a capire meglio le sue\nesigenze compilando questo breve questionario anonimo (10 min). Grazie per la collaborazione.   ",
        "upvotes": 6,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LfH9y71NlX5aVzEshbLe6D4dWU5Vxbx2OuXvhNjNSso.jpg?auto=webp&amp;s=37900d10d3b74215e4c4e27a84fd3edcc3bcd5fa"
        },
        "permalink": "/r/torino/comments/1jy7kt2/avreste_dieci_minuti_per_rispondere_il_nostro/"
    },
    {
        "id": "1jy39w5",
        "author": "The_Crazy_Apple",
        "title": "Moving to Turin for Work",
        "content": "Hi all! \nI am currently in an advanced position during the recruitment process for a space start-up in Turin (I only have one interview left with management to negotiate salary and contract), and I wanted to know some more about the working and living conditions in Turin.\nI am a fresh master's graduate in aerospace engineering, having studied in the Netherlands (although I am from Romania). I have not yet received an offer, but I believe it would be for around 35k EUR gross / year. Do you believe this is a reasonable salary to live comfortably in Turin? I saw some estimates of cost of living of 875€/month without rent, and rent around 500-700€/month, although the rental places I've found seem slightly more expensive than that.\nFurthermore, what do you think about the city? Is it nice to live / work in? So far I've only studied / worked in germanic countries after high-school, so I am not sure what to expect.\nWhat approach do you recommend for looking for accommodation - going there in-person for a week to look for a place, or looking and renting online only?\nAnd last question, I have heard that there is a special tax regime / exception for foreigners moving to work to Italy, but I am not sure if it also applies for fresh graduates from other countries (my case). If anyone has any information about this, it would be greatly appreciated.\nGrazie mille! ",
        "upvotes": 11,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1jy39w5/moving_to_turin_for_work/"
    },
    {
        "id": "1jy9jn6",
        "author": "MonPorridge",
        "title": "Mullet o simil mullett a Torino?",
        "content": "Ciao a tutti, come da titolo vorrei farmi il mullett o qualcosa di simile. Qualcuno conaiglia barbieri/parrucchieri a prezzi modici? Consigli in generale? Grazie!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1jy9jn6/mullet_o_simil_mullett_a_torino/"
    },
    {
        "id": "1jy697u",
        "author": "Ok-Palpitation-1086",
        "title": "Cerco amicizie LGBT",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jy697u/cerco_amicizie_lgbt/"
    },
    {
        "id": "1jy7o2k",
        "author": "ClearSpaceCadet",
        "title": "Is it true there's a famous guy in Turin who goes by the jerking off legend name?",
        "content": "Basically I've heard that there is a guy who is popular for jerking off anywhere in Turin. True? ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1jy7o2k/is_it_true_theres_a_famous_guy_in_turin_who_goes/"
    },
    {
        "id": "1jxo2k1",
        "author": "crepaaaa",
        "title": "Consiglio su concerto a Torino",
        "content": "Buonasera r/torino,\nCon un amico stavo pensando di prendere dei biglietti per andare a vedere un concerto a Torino il 25 giugno (Collegno per la precisione, il Parco Certosa Reale) e volevo qualche consiglio per capire meglio dove alleggiare. Il concerto finirà di notte quindi il mio dubbio è: posso tornare a Torino senza macchina da Collegno prendendo i mezzi pubblici la notte? Inoltre secondo voi locals ha senso prendere un Airbnb a Torino anziché cercare qualcosa a Collegno e magari farsi un giro a Torino il pomeriggio dopo il concerto? \n",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1jxo2k1/consiglio_su_concerto_a_torino/"
    },
    {
        "id": "1jxnn92",
        "author": "cr0w8ar",
        "title": "Consiglio per ditta traslochi internazionali da Regno Unito verso l’Italia",
        "content": "Salve ragazzuoli, io e famiglia stiamo pianificando il rientro in Italia da Londra e stiamo chiedendo preventivi per effettuare il trasloco. Avete qualche ditta da consigliare in loco? I prezzi da Londra sono abbastanza alti. Grazie in anticipo!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jxnn92/consiglio_per_ditta_traslochi_internazionali_da/"
    },
    {
        "id": "1jxfjr0",
        "author": "Parmesean_Lover",
        "title": "Poste Italiane",
        "content": "Hi,\nI ordered two boxes/letters from Ebay but I wrote the wrong cap number on them, and instead of Beinasco, they will indicate Torino now, while there is no street with that name in that adress that I wrote.\nOne of the Boxes is with PosteItaliane Poste1 and other is with La Poste currently. \nWhat will happen?\n",
        "upvotes": 3,
        "comments": 24,
        "media": null,
        "permalink": "/r/torino/comments/1jxfjr0/poste_italiane/"
    },
    {
        "id": "1jxij30",
        "author": "No-Bit-2036",
        "title": "Conoscete negozi di skate?",
        "content": "Cerco in particolare dei negozi che vendono anche le tavole (usate e non)",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1jxij30/conoscete_negozi_di_skate/"
    },
    {
        "id": "1jwtwuo",
        "author": "Ieatyeet",
        "title": "GTT (scontato, lo so)",
        "content": "Salve a tutti, volevo raccontare la mia esperienza, che fa ridere se si riesce a non piangere. Stavo aspettando il 15, meraviglioso tram che ama effettuare tutte le sue corse e ai suoi orari... Comunque, alla fermata faccio segno più volte di fermarsi. L'autista, dall'altezza del su trono di moderna tecnologia nostrana, mi fissa e tira dritto. Lo rincorro, senza successo. Scelgo allora di prendere il 30 (per andare da un' altra parte). Salta 2 corse, ma cosa lo sto a dire. Qua ci si mette il clima, e mi viene un'insolazione, provocandomi quasi uno svenimento e vado a rinfrescarmi per evitare che il prossimo tentato mezzo sia un'ambulanza (unica cosa decente di sta città i bar). Notiamo, tutto nel giro di 30 minuti o meno. Salgo poi sul tanto sperato 15, ma l'impassibile giudice delle rotaie sabaude ci fa scendere dopo 3 fermate per guasto al mezzo. Devo farne altre 3 col 68. Se non ci riuscirò mi troverete sulle notizie.\n\nBaci Torino",
        "upvotes": 52,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1jwtwuo/gtt_scontato_lo_so/"
    },
    {
        "id": "1jxol8q",
        "author": "AGIL_name89",
        "title": "Escape Gtt's officer",
        "content": "Stavo pensando raga, sarebbe molto figo nonché divertente creare un gruppo dove ci condividiamo la posizione dei controllori GTT in modo da aiutare coloro che non si possono permettere il servizio. \n\n\nPensieri? Idee?",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1jxol8q/escape_gtts_officer/"
    },
    {
        "id": "1jxmuyr",
        "author": "EuphoricSurprise1455",
        "title": "[ Removed by Reddit ]",
        "content": "[ Removed by Reddit on account of violating the [content policy](/help/contentpolicy). ]",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1jxmuyr/removed_by_reddit/"
    },
    {
        "id": "1jxbi01",
        "author": "allexj",
        "title": "Quali sono le zone/vie di Barriera che sono da evitare assolutamente?",
        "content": "",
        "upvotes": 1,
        "comments": 47,
        "media": null,
        "permalink": "/r/torino/comments/1jxbi01/quali_sono_le_zonevie_di_barriera_che_sono_da/"
    },
    {
        "id": "1jwv2dz",
        "author": "realcvnce",
        "title": "conoscenze nuove?",
        "content": "ho voglia di fare nuove conoscenze (m19) qualcuno disponibile? ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1jwv2dz/conoscenze_nuove/"
    },
    {
        "id": "1jwlomp",
        "author": "Ok-Rush-5896",
        "title": "Metro",
        "content": "Cosa è successo oggi in metro che annunciava che non si sarebbe fermata a porta Susa?",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1jwlomp/metro/"
    },
    {
        "id": "1jwtmh4",
        "author": "b1729",
        "title": "Housing",
        "content": "Hi everyone! I need your advice to find a home in Turin; would you suggest a reliable website regarding it? Thank you.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1jwtmh4/housing/"
    },
    {
        "id": "1jw4z9l",
        "author": "Dangerous_Willow7496",
        "title": "Santa Rita M25",
        "content": "Sono da poco sbarcato qua a Torino e in questi giorni passando vicino al parco di Santa Rita, davanti lo stadio del Toro, ho visto un sacco di ragazzi giocare a Basket, correre, fare delle attività insomma.\nE mi si è riaccesa la voglia di concludere i pomeriggi in questo modo. \nHo 25 anni, faccio il programmatore web e mi piace la natura, gli animali, la musica e ciò che penso piaccia a tante persone (Compreso anche i Videogiochi naturalmente ).\nSono cresciuto stando sulle panchine con gli amici, fino a sera, giocando, scherzando e parlando di qualsiasi cosa ci passasse per la testa.\nE ora mi piacerebbe creare questa cosa anche qua a Torino.\nQuindi si, il mio è un annuncio per trovare amici 😂\nL’annuncio è rivolto a entrambi i sessi, non faccio discriminazioni.\nSe anche te ti trovi un po’ in questa situazione e hai voglia di fare cose scrivimi o commenta qua sotto, così magari da creare un gruppo e iniziare a prendere con più leggerezza queste belle giornate.",
        "upvotes": 10,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1jw4z9l/santa_rita_m25/"
    },
    {
        "id": "1jwaqeq",
        "author": "Pablo65t",
        "title": "Chi per 2 chiacchiere?",
        "content": "",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1jwaqeq/chi_per_2_chiacchiere/"
    }
]