[
    {
        "id": "1kspfrg",
        "author": "AlanAndMattAMA",
        "title": "Hey /r/movies! We're Alan Tudyk &amp; Matt Winn, actor &amp; director of THE TROUBLE WITH JESSICA, a dark comedy also starring Rufus Sewell &amp; Shirley Henderson about a group of longtime friends at a dinner party that goes horribly wrong, recently in theaters and now available on digital. Ask us anything!",
        "content": "You might also know Alan for films and series such as Firefly, Tucker &amp; Dale vs Evil, Serenity, Andor, A Knight's Tale, Resident Alien, Rogue One: A Star Wars Story, Moana, Frozen II, I Robot, Maze Runner, Transformers, Deadpool 2, The Electric State, Harley Quinn, Dodgeball, Raya and the Last Dragon, Ice Age, Arrested Development, 3:10 To Yuma, and much more.\n\nABOUT THE FILM: Married couple Sarah (Shirley Henderson) and Tom (Alan Tudyk) are in terrible financial trouble. On the brink of losing everything, they’ve managed to find a buyer for their stylish London home. When their best friends Richard (Rufus Sewell) and Beth (Olivia Williams) come over for a final dinner, an uninvited old friend, Jessica (Indira Varma), tags along.\n\nAfter a seemingly trivial argument at dinner, Jessica disappears. She has the temerity to hang herself in the garden, totally oblivious to the adverse consequences for Sarah and Tom’s real estate sale. The only solution: Sarah and Tom must convince Richard and Beth to help take care of this little inconvenience. If they’re clever enough about it, what could possibly go wrong? Knives are out and best-kept secrets are revealed in this laugh-out-loud dark comedy featuring a starry ensemble cast of phenomenal UK talent.\n\nTRAILER: [https://www.youtube.com/watch?v=l\\_xhtk8Tj18](https://www.youtube.com/watch?v=l_xhtk8Tj18) \n\nLearn More and Rent/Buy THE TROUBLE WITH JESSICA: https://www.musicboxfilms.com/film/the-trouble-with-jessica.\n\nAsk us anything! Back at 3 PM ET today for answers.\n\n\n\n",
        "upvotes": 635,
        "comments": 415,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ohy0hof2tb2f1.png?auto=webp&amp;s=7039a148f333722fa2414b6009872629b373b2c9"
        },
        "permalink": "/r/movies/comments/1kspfrg/hey_rmovies_were_alan_tudyk_matt_winn_actor/"
    },
    {
        "id": "1kt8f5n",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Mission: Impossible - The Final Reckoning / Lilo &amp; Stitch / Friendship) plus Throwback Discussions!",
        "content": "# New Theatrical Releases\n\n[Mission: Impossible - The Final Reckoning](https://old.reddit.com/r/movies/comments/1kt8b6m/official_discussion_mission_impossible_the_final/?)\n\n[Lilo &amp; Stitch](https://old.reddit.com/r/movies/comments/1kt8b83/official_discussion_lilo_stitch_spoilers/?)\n\n[Friendship](https://old.reddit.com/r/movies/comments/1kt8b9q/official_discussion_friendship_spoilers/?)\n\n# 25th Anniversary Throwback Discussion Threads\n\n[Dinosaur](https://old.reddit.com/r/movies/comments/1kt8baq/official_throwback_discussion_dinosaur_spoilers/?)\n\n[Road Trip](https://old.reddit.com/r/movies/comments/1kt8bc6/official_throwback_discussion_road_trip_spoilers/?)\n\n\n# Still in Theaters\n\n[Final Destination: Bloodlines](https://old.reddit.com/r/movies/comments/1knpnb1/official_discussion_final_destination_bloodlines/?)\n\n[Hurry Up Tomorrow](https://old.reddit.com/r/movies/comments/1knpnfr/official_discussion_hurry_up_tomorrow_spoilers/?)\n\n[Thunderbolts*](https://old.reddit.com/r/movies/comments/1kcpug8/official_discussion_thunderbolts_spoilers/?)\n\n[Sinners](https://www.reddit.com/r/movies/comments/1k1tsoo/official_discussion_sinners_spoilers/?)\n\n\n\n# On Streaming\n\n[Fountain of Youth](https://old.reddit.com/r/movies/comments/1ku0tg1/official_discussion_fountain_of_youth_spoilers/?)\n\n[Fear Street: Prom Queen](https://old.reddit.com/r/movies/comments/1ku0thn/official_discussion_fear_street_prom_queen/?)\n\n[Another Simple Favor](https://old.reddit.com/r/movies/comments/1kdg7p5/official_discussion_another_simple_favor_spoilers/?)\n\n[Havoc](https://old.reddit.com/r/movies/comments/1k7zfyi/official_discussion_havoc_spoilers/?)",
        "upvotes": 64,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1kt8f5n/official_discussion_megathread_mission_impossible/"
    },
    {
        "id": "1kul1g6",
        "author": "LookAtThatBacon",
        "title": "For the movie adaptation of The Martian, Ridley Scott changed the day the crew left Mars from sol six to sol 18 because he wanted to justify the higher amount of human waste used to make fertilizer. What are other instances of a movie adaptation making changes for interesting reasons?",
        "content": "Source for the fact about The Martian: https://www.thedailybeast.com/the-man-behind-the-martian/\n\n&gt; But the movie changed how long the crew spent on the planet for a funny reason. In the book they left after sol six, but in the movie they leave after sol 18. Ridley wanted Mark to stir a nice big bucket of shit when he was creating the fertilizer for the crops. Ridley said, after only six days of six people shitting that’s 36 packets. He wanted them to stay longer, so that the bucket of shit could be full.",
        "upvotes": 2600,
        "comments": 561,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5BSO5UiPNnyQaThrBsXIGITSv-lq-stoG6S3M-z3qhs.jpg?auto=webp&amp;s=f9bedfeef1801f2abac4b8e982f04f37b475cd4e"
        },
        "permalink": "/r/movies/comments/1kul1g6/for_the_movie_adaptation_of_the_martian_ridley/"
    },
    {
        "id": "1kulg3h",
        "author": "MarvelsGrantMan136",
        "title": "Live-Action ‘Voltron’ Movie, Starring Henry Cavill, Wraps Filming",
        "content": "",
        "upvotes": 815,
        "comments": 127,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vkZTue_9b9yz6ESFeRezXQkODiaHVXkIhPBihMO_J28.jpg?auto=webp&amp;s=f0811b648b7f7f4f4a4dbfdf52e8bd166db68b10"
        },
        "permalink": "/r/movies/comments/1kulg3h/liveaction_voltron_movie_starring_henry_cavill/"
    },
    {
        "id": "1kuer6l",
        "author": "NoCulture3505",
        "title": "Les Dilley Dies: 'Star Wars' Art Director Was 84",
        "content": "",
        "upvotes": 1808,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/CQc-mk5k1on-Z_ZVy8apaIkGstd3v1tjoZPK0Gtw2tA.jpg?auto=webp&amp;s=aad5b081f5dbd18a5534663d7c4bdbc170bf12e0"
        },
        "permalink": "/r/movies/comments/1kuer6l/les_dilley_dies_star_wars_art_director_was_84/"
    },
    {
        "id": "1ku9wyu",
        "author": "Ashamed_Feedback3843",
        "title": "Sparrows 1926 Mary Pickford",
        "content": "",
        "upvotes": 3239,
        "comments": 239,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/xvpa04fnyp2f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1ku9wyu/sparrows_1926_mary_pickford/"
    },
    {
        "id": "1kunzia",
        "author": "peachpitt",
        "title": "Break-up movies that DON'T end with a new partner?",
        "content": "Going through a difficult breakup and all the top recommended breakup movies I've seen so far (500 Days of Summer, Forgetting Sarah Marshall) end with what I feel to be a cheesy cop-out: oh here's a new partner to solve all the main character's problems. 500 Days of Summer was especially painful with the very last scene: \"Hi, I'm Autumn.\" What about being with yourself, exploring, and improving, not relying on a partner to make you whole? Doesn't even have to necessarily be a break-up movie as long as it covers these themes of self-exploration and improvement. Thanks.",
        "upvotes": 325,
        "comments": 355,
        "media": null,
        "permalink": "/r/movies/comments/1kunzia/breakup_movies_that_dont_end_with_a_new_partner/"
    },
    {
        "id": "1kuptde",
        "author": "Coderkid01",
        "title": "One of the coolest shots in any animated movie ever, from The Thief and The Cobbler Recobbled Cut",
        "content": "",
        "upvotes": 169,
        "comments": 20,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/0s9wx2gknt2f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1kuptde/one_of_the_coolest_shots_in_any_animated_movie/"
    },
    {
        "id": "1kuc26w",
        "author": "Mst3Kgf",
        "title": "There's few characters in cinema who are a big and as entertaining a loser as Jerry Lundegaard in \"Fargo.\" Not only is William H. Macy one of the best casting choices ever, but a big part of the film's appeal is just watching him mess up EVERYTHING.",
        "content": "I fully understand why Macy was so determined to play this role that he jokingly threatened to shoot the Coens' dogs if he didn't get it. Not only is Macy one of the best actors ever at playing this kind of character (see \"The Cooler\" for another excellent example), but Jerry is just such a screw-up at everything he does. Right from the beginning, his whole \"kidnap my own wife\" plan is so half-baked and inane that the very crooks he hires to do it are dubious about it. Think of how many ways he screws up:\n\n1. He hired Carl and Gaer on reference from someone at work (who only knows the latter and won't vouch for the former), knowing nothing about them or how competent they may be.(Short answer; not very.)\n\n2. Because of that, he can't contact them to call off the kidnapping when it looks like he might not need it done.\n\n3. He's amazed when his father in law, who is established from the beginning to not care much for him, won't just give him $750,000 with no strings attached.\n\n4. His mumbled excuses to the GM lawyer about the serial numbers to the non-existent cars he scammed them with. (\"Those're in the mail!\")\n\n5. His plan revolving around being able to deliver the ransom himself and therefore cut out most of it to keep, never realizing that his stubborn and controlling father in law (who, again, DOES NOT LIKE YOU, JERRY) might demand on doing it himself. And sure enough...\n\nAnd so on. And watching Jerry constantly fail and lose it is one of the great pleasures of the film, like when he impotently attacks his ice-covered windshield in rage or how his office blinds look like prison bars. Frequently, a character like this might bring about sympathy for his misfortunes, but not Jerry. Not only is he a loser, but his troubles are all self-inflicted. And in the end, when it all comes down on him, it feels earned and very satisfying.\n\nEven though he did manage to knock off $100 on the truecoat. You did accomplish that, Jerry.\n\n",
        "upvotes": 750,
        "comments": 149,
        "media": null,
        "permalink": "/r/movies/comments/1kuc26w/theres_few_characters_in_cinema_who_are_a_big_and/"
    },
    {
        "id": "1kuh4p7",
        "author": "ChiefLeef22",
        "title": "2025 Cannes Film Festival: Jafar Panahi's 'It Was Just An Accident' wins Palme d'Or; Joachim Trier's 'Sentimental Value' wins Grand Prix; Wagner Moura wins Best Actor, Kleber Mendonça Filho wins Best Director for 'The Secret Agent'; Nadia Melliti wins Best Actress",
        "content": "",
        "upvotes": 356,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wd3HHnsxxEjlnlgdSsv1lCgocyzG0e0B9dpVlSbI3w8.jpg?auto=webp&amp;s=5216bdb385fc54a8272438c3c20239424fbbd842"
        },
        "permalink": "/r/movies/comments/1kuh4p7/2025_cannes_film_festival_jafar_panahis_it_was/"
    },
    {
        "id": "1ku9aq1",
        "author": "Grant692",
        "title": "I Watched All 63 Disney Animated Movies, And It Was Delightful",
        "content": "I was born in the early 90s, in the midst of the Disney Renaissance, and I grew up on Disney movies. My mom showed me a lot of the classics in addition to the new ones that came out during my life, but I hadn't seen the vast majority of these films since childhood. So, nearly two years ago, I set out to watch every movie from Walt Disney Animation Studios (so, no live-action remakes, no made-for-TV sequels, etc.), in chronological order, to refresh my memory and fill in my blind spots. Overall, it was a wonderful experience. I ranked all of the movies on Letterboxd, and included my favorite moment from each one (usually an animated flourish, but occasionally a quote or an extended sequence). And below, I listed some good and bad surprises, and I ranked villains, vocal performances, and songs, just for fun!\n\nhttps://letterboxd.com/grant692/list/disney-ranked/\n\nGood Surprises:\n\n1. Cinderella - I really, really did not expect to come away from this with Cinderella as my favorite Disney movie and one of my favorite animated movies of all time. But it is. In my memory, it was the classic \"helpless princess, handsome prince, happily ever after\" story. Imagine my surprise when I find that it's a movie about a woman overcoming the most dreadful circumstances with kindness and humility and persistence and self-confidence. She's not immune to the weight of her terrible life, but when life gets her down, she picks her head up and gets back to solving her problems. She is a role model not just for little girls, but for all of us. AND it's beautifully animated, well-paced, and has one absolutely remarkable sequence (the transformation of everyone/everything in preparation for the ball). It's just splendid.\n\n2. One Hundred and One Dalmatians - I expected One Hundred and One Dalmatians to be relatively minor Disney, but I was blown away. From the gorgeous, painterly animation style, to the thrilling plot, to the devious villain, to the delightful side characters (Horace and Jasper are all-time great laughable lackeys)...it all just works.\n\n3. The Emperor's New Groove - I knew I was going to love The Emperor's New Groove, but not this much. It's just one amazing sight gag after another, coming in at an efficient 72 minutes (not including credits), and its blistering pace never runs out of steam. Amazing.\n\n4. Robin Hood - Robin Hood was one of my favorite Disney movies as a kid, but as an adult, I realized it didn't have the best reputation, so I wasn't optimistic going in...but I still loved it. It's fun, it's got some great music (\"Phony King of England\", especially), and a ridiculous villain+sidekick combo (Prince John and Sir Hiss).\n\n5. Atlantis: The Lost Empire - The crew could not be any more trope-y if it tried. Milo, the out-of-his-depth, nerdy scholar who the group reluctantly depends on. Rourke, the gruff, grizzled captain who clearly has ulterior motives. Helga, a young German woman and Rourke's second-in-command, who thinks she has to act all tough to look like she belongs next to her superior. Vinny, the cavalier Italian demolitions expert who just wants to run the family flower shop. Dr. Sweet, the physically imposing African-American/Native American doctor with a heart of gold. Audrey, the plucky, teenage Puerto Rican mechanic trying to impress her dad (who really wanted a son). Wilhelmina, the chain-smoking communications officer who looks and acts like she should have retired years ago. Cookie, the elderly chef of the expedition, who seems to have come from the Confederate South. Geatan Moliere, a Frenchman who goes by Mole, and also acts like a mole, and also looks like a mole. But it leans into those tropes with such affection, that I couldn't help but love it. \n\nBad Surprises: \n\n1. The Sword in the Stone - Like Robin Hood, The Sword in the Stone was one of my favorites growing up. I don't know what childhood me was thinking. The wizard duel is entertaining, but the plot is just totally inert otherwise. \n\n2. Tarzan - I didn't find the story all that interesting, nor the characters compelling. Much to my surprise, I also didn't love the music - it all sounded the same and didn't hook me whatsoever. RIP to the Phil Collins burning piano meme :(. \n\n3. Fantasia - Hailed as one of the all-time greats of Disney, I was excited...but it was too inconsistent. The Sorcerer's Apprentice is among the best things Disney has ever done, and Night on Bald Mountain is a good time...but otherwise? Couldn't find much to latch on to.\n\n4. The Black Cauldron - Yet another of my childhood favorite that I ranked lower than I'd hoped. I still probably have it higher than most, maybe due to my affinity for all things spooky and the fact that this is certainly the darkest Disney has ever gotten...but still didn't live up to expectations.\n\n5. Wish - This movie is SO bad. I skipped it in theaters when it came out a couple years ago (shortly after I started this project, actually) because of the so-so reviews, but I still thought I'd at least give it a solid 3/5 stars. But it looks terrible (like something from Disney Channel 10 years ago), the songs aren't the least bit memorable, there are no interesting characters, and the plot doesn't carry half the weight that it feels like it should. I LOVE the idea of this movie, and it fits so well into the mythology of Disney...which I think made me all the more angry at how it turned out. \n\n\nTop 10 Villains:\n\n1. Cruella De Vil (One Hundred and One Dalmatians)\n\n2. Hades (Hercules)\n\n3. Ursula (The Little Mermaid)\n\n4. Maleficent (Sleeping Beauty)\n\n5. Mother Gothel (Tangled)\n\n6. Yzma (The Emperor's New Groove)\n\n7. Ratigan (The Great Mouse Detective)\n\n8. John Silver (Treasure Planet)\n\n9. Scar (The Lion King)\n\n10. Doctor Facilier (The Princess and the Frog)\n\n\nTop 10 Vocal Performances:\n\n1. Robin Williams (Genie, Aladdin)\n\n2. James Woods (Hades, Hercules)\n\n3. Jodi Benson (Ariel, The Little Mermaid)\n\n4. Susan Egan (Meg, Hercules)\n\n5. Pat Carroll (Ursula, The Little Mermaid)\n\n6. Eleanor Audley (Maleficent, Sleeping Beauty)\n\n7. Eartha Kitt (Yzma, The Emperor's New Groove)\n\n8. Peter Ustinov (Prince John, Robin Hood)\n\n9. Patrick Warburton (Kronk, The Emperor's New Groove)\n\n10. Ming Na Wen (Mulan, Mulan)\n\n\nTop 20 Disney Songs:\n\n1. Friend Like Me (Aladdin)\n\n2. Part Of Your World (The Little Mermaid)\n\n3. I'll Make a Man Out of You (Mulan)\n\n4. Lost in the Woods (Frozen II)\n\n5. I've Got a Dream (Tangled)\n\n6. The Phony King of England (Robin Hood)\n\n7. For the First Time in Forever (Frozen)\n\n8. Under the Sea (The Little Mermaid)\n\n9. Surface Pressure (Encanto)\n\n10. Belle (Beauty and the Beast)\n\n11. Poor Unfortunate Souls (The Little Mermaid)\n\n12. Hellfire (The Hunchback of Notre Dame)\n\n13. I Just Can't Wait to Be King (The Lion King)\n\n14. Zero to Hero (Hercules)\n\n15. Hakuna Matata (The Lion King)\n\n16. The Bear Necessities (The Jungle Book)\n\n17. The Family Madrigal (Encanto)\n\n18. How Far I'll Go (Moana)\n\n19. I Won't Say (I'm In Love) (Hercules)\n\n20. Cruella de Vil (One Hundred and One Dalmatians)\n\nThat's it! It was a great little journey through the history of animation, and I'd encourage anyone interested to take it!",
        "upvotes": 986,
        "comments": 262,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gwSBG5Ox9DXp10DLwbOoZqn6TRWPDnV3Yva9hPAockc.jpg?auto=webp&amp;s=2b9006b5b6cb675497653a39139cc6545bf18311"
        },
        "permalink": "/r/movies/comments/1ku9aq1/i_watched_all_63_disney_animated_movies_and_it/"
    },
    {
        "id": "1kumg9n",
        "author": "Amaruq93",
        "title": "Sabotage suspected as power cut hits Cannes Film Festival",
        "content": "",
        "upvotes": 137,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XvKg4LnSDyS9dFRx8znYzGrcykSgxFlHRkpXpa1EqPI.jpg?auto=webp&amp;s=9c635b53f309e3faf69fe4bdc0a47c3f36ed0d17"
        },
        "permalink": "/r/movies/comments/1kumg9n/sabotage_suspected_as_power_cut_hits_cannes_film/"
    },
    {
        "id": "1kufamj",
        "author": "Good-Body8515",
        "title": "What’s a great movie you watched recently that nobody talks about—and you wish more people had seen?",
        "content": "I recently watched *Coherence* (2013), and I’m honestly shocked more people don’t talk about it. It’s a low-budget sci-fi film that relies entirely on tension, dialogue, and a mind-bending concept instead of special effects. I won’t spoil anything, but if you're into psychological thrillers or multiverse theories, this one's a hidden gem.\n\nIt made me wonder—what other underrated movies are out there that deserve way more attention? I’d love to build a list of lesser-known but incredible films. Drop your favorites below!",
        "upvotes": 330,
        "comments": 464,
        "media": null,
        "permalink": "/r/movies/comments/1kufamj/whats_a_great_movie_you_watched_recently_that/"
    },
    {
        "id": "1kul4vi",
        "author": "count_olaf24",
        "title": "dead Poet's society is heartbreaking 💔",
        "content": "the only thing I could think of saying during that movie was- \"that's not fair.\"\n\nbecause what else is there to say? Neil didn't deserve that at all, neither did Todd, or Charlie, or the teacher, or any of the other boys.\n\nI really want to talk about this film with someone but for some reason the subreddit for dead poet's society is locked on here? the Pinterest community is pretty big but other than that I don't know where to go.\n\nso yea, dead poet's society fans, where y'all at?? let's yawp in the comments together :)))",
        "upvotes": 143,
        "comments": 78,
        "media": null,
        "permalink": "/r/movies/comments/1kul4vi/dead_poets_society_is_heartbreaking/"
    },
    {
        "id": "1kuj168",
        "author": "mayukhdas1999",
        "title": "First Image of Gael García Bernal in Lav Diaz's 'MAGELLAN' - In the 16th century, young Portuguese navigator, Ferdinand Magellan defies the King of Portugal, who rejects his dreams, and convinces the Spanish monarchy to fund his daring expedition to discover the fabled lands of the East",
        "content": "",
        "upvotes": 171,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/cuscrk361s2f1.jpeg?auto=webp&amp;s=2830909e50f730690e9656252a3fd9a691147e51"
        },
        "permalink": "/r/movies/comments/1kuj168/first_image_of_gael_garcía_bernal_in_lav_diazs/"
    },
    {
        "id": "1ku9erd",
        "author": "danielhutt",
        "title": "What’s the most unforgettable movie ending you’ve ever seen?",
        "content": "I recently rewatched The 40-Year-Old Virgin and was reminded of how the ending totally blindsided me the first time around. One minute, I’m watching a raunchy rom-com, and the next, I’m smack in the middle of a full-blown musical fever dream. I honestly thought I had dozed off and imagined it—it was so out of left field, it felt like the movie switched genres just to mess with me.\n\nWhat other movies have endings that unforgettable?",
        "upvotes": 460,
        "comments": 591,
        "media": null,
        "permalink": "/r/movies/comments/1ku9erd/whats_the_most_unforgettable_movie_ending_youve/"
    },
    {
        "id": "1kubf4j",
        "author": "BunyipPouch",
        "title": "'Clueless' Returning to Theaters for 30th Anniversary (June 29th)",
        "content": "",
        "upvotes": 303,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/I4TzBI-_oOPw-RI05xzTdX6rIOIM2C32uy-awvuGxSY.jpg?auto=webp&amp;s=0d45d5dac5a9673b6a428302a85ee2cdfa2eba12"
        },
        "permalink": "/r/movies/comments/1kubf4j/clueless_returning_to_theaters_for_30th/"
    },
    {
        "id": "1kur4tx",
        "author": "delimeat7325",
        "title": "What’s a movie you didn’t see in theatres but wish you had?",
        "content": "One of them for me is Hereditary. It’s one of my favorite films and I wish I could have saw it on the big screen. It was thrilling watching it in my own home, I can only imagine what it was like watching it on large screen with amplified surround sound. The wails of Toni Collette were agonizing and ear piercing, the music and sounds were unsettling and dissonant. Even in the moments of sudden, compete silence were weary for me. It’s just a perfect display of grief and madness if that makes any sense.",
        "upvotes": 29,
        "comments": 73,
        "media": null,
        "permalink": "/r/movies/comments/1kur4tx/whats_a_movie_you_didnt_see_in_theatres_but_wish/"
    },
    {
        "id": "1kum750",
        "author": "BristledIdiot",
        "title": "What Movie did you love as a child/young person that you now like WAY less?",
        "content": "For me, I think it’s Robots (2005). I write sci-fi and the designs of that movie have clearly influenced my interests in more adult sci-fi, but on a rewatch it has very little to offer besides bright colors and nice animation/design. \nIt doesn’t just have to be a kids movie, if you had a movie you truly thought was your favorite as a teenager that you rewatched recently and don’t like, that works too.",
        "upvotes": 46,
        "comments": 304,
        "media": null,
        "permalink": "/r/movies/comments/1kum750/what_movie_did_you_love_as_a_childyoung_person/"
    },
    {
        "id": "1ku8flm",
        "author": "Sisiwakanamaru",
        "title": "South of France Hit By Massive Power Outage Ahead Of Cannes Closing Ceremony",
        "content": "",
        "upvotes": 321,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OQ4hmrvvVduYXgNZTao6YBPM9Bo73ZYc2IUpSYQ4KII.jpg?auto=webp&amp;s=0028d8b1dfef1cad3bda106383bf270e42f86bf8"
        },
        "permalink": "/r/movies/comments/1ku8flm/south_of_france_hit_by_massive_power_outage_ahead/"
    },
    {
        "id": "1kumz7r",
        "author": "Just__Maverick",
        "title": "Ever watched a movie that was so weird or creepy you could not shake it off for days? That was the Piano Teacher for me.",
        "content": "Now this was a movie that I couldn't find a single flaw in. It has good direction, layered story telling and a brilliant cast. Everything was so well done, even the pacing, it seemed almost realistic but engaging enough. But watching this impacted me in a way I could not shake off for days. The kind of messed up mind Erika has in the movie was so hard hitting and impactful. Definitely not something everyone should watch as it can leave you with a disturbing feeling that you can't shake off. ",
        "upvotes": 38,
        "comments": 84,
        "media": null,
        "permalink": "/r/movies/comments/1kumz7r/ever_watched_a_movie_that_was_so_weird_or_creepy/"
    },
    {
        "id": "1ktkgcr",
        "author": "MarvelsGrantMan136",
        "title": "New Image of Elijah Wood in 'The Toxic Avenger'",
        "content": "",
        "upvotes": 20027,
        "comments": 777,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1ane31n7gj2f1.jpeg?auto=webp&amp;s=70bbec22bec6e12cfbe0f26ae53036723b91c95e"
        },
        "permalink": "/r/movies/comments/1ktkgcr/new_image_of_elijah_wood_in_the_toxic_avenger/"
    },
    {
        "id": "1ku6a42",
        "author": "Deep-Ad-840",
        "title": "What's a movie you truly wish you had never watched?",
        "content": "I’m not usually squeamish about films, but \"A Serbian Film (2010)\"  is one I deeply regret seeing. It’s been over ten years, and I still think about it—for all the wrong reasons. I went in not knowing what I was getting into, and some scenes have stuck with me in a way that’s more haunting than impactful.\n\nNot trying to spark controversy or glorify extreme cinema—just genuinely wondering:\nHave you ever seen a film that you wish you could unsee?\n",
        "upvotes": 457,
        "comments": 928,
        "media": null,
        "permalink": "/r/movies/comments/1ku6a42/whats_a_movie_you_truly_wish_you_had_never_watched/"
    },
    {
        "id": "1ktw1ir",
        "author": "cmaia1503",
        "title": "First poster for Lynne Ramsay’s ‘Die, My Love’ starring Jennifer Lawrence &amp; Robert Pattinson.",
        "content": "",
        "upvotes": 2282,
        "comments": 175,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/v7agl1t0vl2f1.jpeg?auto=webp&amp;s=4e852fcd13dc6510d695743fb50a995433047ad8"
        },
        "permalink": "/r/movies/comments/1ktw1ir/first_poster_for_lynne_ramsays_die_my_love/"
    },
    {
        "id": "1kuhguc",
        "author": "kinofil",
        "title": "NEON Shines Brightly With Six For Six Palme d’Or Winners After Jafar Panahi’s ‘It Was Just An Accident’",
        "content": "\"**NEON** has just scored its sixth Cannes Palme d’Or in a row with *It Was Just an Accident*.\n\nDeadline’s Andreas Wiseman first reported two days ago that NEON scooped up North American rights to the movie.\n\nThis comes after last year’s Cannes top prize winner *Anora*, Justine Triet’s 2023 title *Anatomy of a Fall*, 2022’s *Triangle of Sadness*, 2021’s *Titane* and 2019’s *Parasite*. Out of that bunch, Anora and Parasite went on to win Best Picture at the Oscars, which is whole other level of award campaigning genius on behalf of the Tom Quinn run distribution label.\" — Deadline",
        "upvotes": 59,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OID2XepLjG4TGc1zxYUj4omnjtAl_BP92a4MC-IBXvc.jpg?auto=webp&amp;s=b9b4fdc0d1de8e386b315ac1586484b4e2ce9b98"
        },
        "permalink": "/r/movies/comments/1kuhguc/neon_shines_brightly_with_six_for_six_palme_dor/"
    },
    {
        "id": "1kuq5fo",
        "author": "X01ENCLAVESTAN",
        "title": "What's your favorite detail from a movie?",
        "content": "Something small, very unnoticeable, but makes you all the much more giddy and satisfied with the movie. Me personally, my favorite is at the end of Ratatouille. As you get a look at the restaurant that Remy, Linguini, and Collette own you get to see Anton Ego one last time, and you can see that his face and body are overall more pudgy. It's small, but shows how Anton is finally more willing to eat all food, to give it a chance. It just makes me so giddy since he is also one of my favorite movie characters of all time. \n\nBut what about you guys?",
        "upvotes": 13,
        "comments": 19,
        "media": null,
        "permalink": "/r/movies/comments/1kuq5fo/whats_your_favorite_detail_from_a_movie/"
    },
    {
        "id": "1ku308r",
        "author": "hacked_your_account",
        "title": "What is a movie that had an excellent premise that failed to deliver as a complete film?",
        "content": "I want to talk about movie concepts that sound great but were poorly executed. It Follows (2014) had a great premise and was a great movie. Then there are movies like The Invention of Lying (2009), which had a very compelling premise but shit the bed by making it about religion. What are other movies that had immediately interesting premises that wore thin or could not stick the landing?",
        "upvotes": 515,
        "comments": 683,
        "media": null,
        "permalink": "/r/movies/comments/1ku308r/what_is_a_movie_that_had_an_excellent_premise/"
    },
    {
        "id": "1ku2iyd",
        "author": "WardenofWestWorld",
        "title": "Kid appropriate movies where bad guys win?",
        "content": "My son recently said he’s getting tired of movies where the good guys always win. He’s curious about stories where the bad guys win or at least don’t lose completely. I realized most kids’ movies play it pretty safe. Are there any age-appropriate films where the villain comes out on top or the ending isn’t so clean? Not looking for horror or anything truly dark—just something with a little more edge or ambiguity. Animated, live-action, fantasy—open to all suggestions. Thanks",
        "upvotes": 512,
        "comments": 714,
        "media": null,
        "permalink": "/r/movies/comments/1ku2iyd/kid_appropriate_movies_where_bad_guys_win/"
    },
    {
        "id": "1kurdrz",
        "author": "gnome_ole",
        "title": "Altered States (1980) has held up well",
        "content": "I'm pretty sure I saw this in the theater when it came out, and don't think I'd repeated until last night.\n\nI do remember liking it, but I'm truly astounded by how well it has held up. Maybe it's just because it didn't try to do too much, or because the dialogue is so well written idk.\n\nGive it a rewatch if it's been anywhere near 45 years. \n",
        "upvotes": 7,
        "comments": 4,
        "media": null,
        "permalink": "/r/movies/comments/1kurdrz/altered_states_1980_has_held_up_well/"
    },
    {
        "id": "1kuoinw",
        "author": "__andrei__",
        "title": "What are your favorite “director’s commentary” special features?",
        "content": "I’ve really enjoyed directors commentary on several movies I own digitally and on physical media. A few that stand out are *Aliens*, *Rise of the Planet of the Apes* (includes both directors commentary and writers’ commentary) and *Smile* movies.\n\nWhat are some director’s commentary features that you’ve really enjoyed?",
        "upvotes": 8,
        "comments": 37,
        "media": null,
        "permalink": "/r/movies/comments/1kuoinw/what_are_your_favorite_directors_commentary/"
    },
    {
        "id": "1kubhw5",
        "author": "vihhkjhgf",
        "title": "A Working Man is a Disaster",
        "content": "I know I'm late to this, but yesterday I stumbled upon this movie, read the description and the cast. My expectations going in were: \"I just want a Taken knock-off that survives on the charm of Jason Statham.\" So I think I set them realistically low for an evening of kinda mindless entertainment. But even then, I was mostly bored and so disappointed that I wanted to make this post...\n\nThe biggest problem is, a big chunk of this movie is entirely useless. And I don't mean, I didn't like it or it was not that impactful. I mean, you could literally cut out the entire side plot about his daughter and father-in-law and it would change not a single thing about the main story. How do you even fumble this hard? Even in the places where it is set up to intersect, it doesn't. Statham is set up to need money to pay for his lawyers in the custody case for his daughter which never becomes relevant. Does he keep the money from the Russians? No. Is he tempted to sell the drugs he acquired in his investigation? No, the movie makes a point of him immediately flushing them. Do the Russians tempt him with a bribe to stop? Not even a throw-away scene like that...   \nAnd then, in the only intersection of these plots in the movie, the \"Russians\" set his father-in-laws house on fire. I say \"Russians\" because we don't even see one of our established bad guys doing it. And then, they do it to the father-in-law which is set up to be hateable anyways. His daughter is safe the entire time. Great emotional investment you got from me there, movie. On top of that, his father-in-law is completely fine. So there is zero consequences from this for our protagonist and, again, impacts him in no way. Does it change his motivations? No. Does it change his course of action? No. Does it maybe just make him hesitate a little or reflect on the danger he is causing? Not even that.\n\nSo we have 20 minutes of useless scenes in a movie that is already 20 minutes longer than Taken. On top of that, the movie really undercuts the emotional stakes by making the kidnappers complete buffoons that repeatedly get outsmarted by the kidnapped Girl. I have no problem with giving her more agency, but then do it in a way that makes her seem clever and not by making the bad guys completely non threatening.\n\nAnd lastly, David Ayer cannot help himself to insert his pathos over the top cringe. You want to honor the troops? Fine by me. But to have Jason Statham say to our drug producing and dealing, russian mafia associate, biker gang leader \"My beef wasn't with you\" before killing him because he was also a soldier? Wtf is even the message here?\n\nAll in all, completely wasted opportunity to make a fun, competency porn, Jason Statham against the world movie. Instead, every second scene is pointless, and the bad guys are incompetent and non-threatening. Has David Ayer made anything decent since Fury?",
        "upvotes": 45,
        "comments": 82,
        "media": null,
        "permalink": "/r/movies/comments/1kubhw5/a_working_man_is_a_disaster/"
    },
    {
        "id": "1ku2lem",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Kevin Smith - Tuesday 6/3 at 3:00 PM ET - Director of 'Clerks', 'Dogma', 'Mallrats', 'Chasing Amy', 'Jay and Silent Bob Strike Back', 'Tusk', 'Cop Out', 'Red State', and much more.",
        "content": "",
        "upvotes": 238,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ie4zur7xjn2f1.png?auto=webp&amp;s=9e08c2d95b244811bfa0bb9aa1c45de05b68ffc4"
        },
        "permalink": "/r/movies/comments/1ku2lem/amaqa_announcement_kevin_smith_tuesday_63_at_300/"
    }
]