[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 49,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 16,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qtkgut",
        "author": "MonsterZero0000",
        "title": "Netflix charging extra because I'm traveling",
        "content": "I'm in the military and traveling away from my family for a year but staying in the U.S. \n\nNetflix is asking me to add myself as a new member to my own account and pay more. I just wanted to say that I think this is a bad policy.\n\nThank you.",
        "upvotes": 89,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1qtkgut/netflix_charging_extra_because_im_traveling/"
    },
    {
        "id": "1qt1pww",
        "author": "MeanNothing3932",
        "title": "Best in Show Catherine O'Hara",
        "content": "For those of you who have or haven't seen it. It's a great movie and we love Catherine O'Hara as Cookie! It's a classic movie from the 90s. RIP Catherine we will miss your talent. ",
        "upvotes": 183,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1qt1pww/best_in_show_catherine_ohara/"
    },
    {
        "id": "1qtwi2h",
        "author": "misterpopculture",
        "title": "Hawkins Gets a New Animated Mystery in Stranger Things: Tales From ’85",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qtwi2h/hawkins_gets_a_new_animated_mystery_in_stranger/"
    },
    {
        "id": "1qtwdo4",
        "author": "ArmyInteresting9700",
        "title": "Chromecast2 and Netflix.",
        "content": "It's supposed to work but I can't get it to go to my TV Help!! I dont seem to be able to contact anyone  to help me at netflix. Is there a way  to watch it on my TV. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qtwdo4/chromecast2_and_netflix/"
    },
    {
        "id": "1qto9ij",
        "author": "godguided",
        "title": "Review of His &amp; Hers",
        "content": "I just saw His &amp; Hers Tv show and i have a mixed feelings about the show. If we talk about storyline and direction i think it lacks depth, urgency and tbh bit of logic. I get it it’s a small town so they wanted to show solving murder there is not easy but showing them straight up dumb is another thing. It was frustrating to see that even with so much attention and media coverage of high profile murder in town a detective is so easily ruining and manipulating the case with no question asked. I mean the concept and twist was tbh good, it got me and i didn’t see it coming. Last episode first half i was like this is so illogical and they built it all for this and then second half made sense of it all. If they chose better actors, and storyline and plot was played in bit different and more tension filling way it could have been great thriller mystery show but they relied it all on last 20-30 mins which made it frustrating. I am sure many people have different take on it and i would love to hear that. ",
        "upvotes": 4,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1qto9ij/review_of_his_hers/"
    },
    {
        "id": "1qtzxrm",
        "author": "neom315",
        "title": "Who did the soundtrack for the new Take That documentary on Netflix",
        "content": "Does anyone know who did the background soundtrack for the new documentary on Netflix? \n\nspecifically, the song at the very beginning of the third episode, sort of 80's synth arpeggio.\n\naround the 0.49 second mark.\n\nThank you",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qtzxrm/who_did_the_soundtrack_for_the_new_take_that/"
    },
    {
        "id": "1qt1u93",
        "author": "OverPotato2322",
        "title": "Netflix’s Conquest of Hollywood is Complete",
        "content": "",
        "upvotes": 87,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1qt1u93/netflixs_conquest_of_hollywood_is_complete/"
    },
    {
        "id": "1qszcsc",
        "author": "Both_Departure_5331",
        "title": "What shows should a Breaking Bad and Better Call Saul fan watch",
        "content": "What would you recommend to someone who views Breaking Bad and Better Call Saul as the goated series - S tier series. Doesn’t necessarily have to be a drug related show but it should be as engaging, full of suspense and exciting - a high stakes show. Please list the shows on Netflix(doesn’t have to be an original) which are as enjoyable as these classics.",
        "upvotes": 77,
        "comments": 244,
        "media": null,
        "permalink": "/r/netflix/comments/1qszcsc/what_shows_should_a_breaking_bad_and_better_call/"
    },
    {
        "id": "1qtk33s",
        "author": "Fordfanatic2025",
        "title": "Billionaire's Bunker is a prime example of not knowing how to pace/write a show properly.",
        "content": "Like here's how I would have done it, I would have spent the first few episodes establishing growing political tensions to really sell this idea of the world ending. Maybe there's this race against time plot that's more central where the dad is racing to get his son out of prison in time so they can make it to the bunker. As time goes on, you see something isn't right, the characters get to the surface, and realize the entire thing was a ruse, and we walk back through the events of the story with that info. I haven't reached the final episode yet, but I thought it would be cool if a nuclear war broke out for real, and suddenly all these people playing pretend had to really try to survive. \n\nAs for the twist, I really loved it. I think many of us sensed something was up. I remember asking questions like \"Why is this state of the art doomsday bunker designed to survive a nuclear war being so heavily damaged by a nuke being dropped miles away?\" Felt like a fake bunker. When I saw the leader smile, I knew. \n\nBut the pacing of the show is fucking terrible. Like the first episode is establishing these characters, establishing this tragic event, a prison story, a partial redemption arc for the main character, getting released from prison, getting to the bunker, setting up the tense environment within the bunker between characters, the world ending, and finding out it was all a simulation in literally the first episode. \n\nThen it's just 6 episodes of the same back and forth story telling, and characters fucking. Like the dads ex-wife is a psycho. She's literally like \"You beat my son, that's hot, let's fuck\" and you're just like WTF. Overall, very lackluster given the premise and twist, maybe the finale will save it, but I feel like it's gonna just be cliff hanger BS that's never resolved because the show got canceled. ",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1qtk33s/billionaires_bunker_is_a_prime_example_of_not/"
    },
    {
        "id": "1qtslv2",
        "author": "LoiseauMou",
        "title": "Ghosts S3 in NL, where is it?",
        "content": "So last year I've watched S1 and S2 of Ghosts on Netflix. \nLiked it very much, so I was happy to see a few weeks back on 'Most recent'  that the new season(s) would soon be available.\nI saved it in my list to get a notification and until last week I swear I saw the red 'new season coming' (or something similar) on it's picture.\n\nSo today I wanted to check it out, but I only see S1 and 2 there. And no mention at all of a new season. I feel a bit confused as I'm almost certain that it did see it.\nAm I going crazy or was there actually mentioning of S3 (and 4?) before on Netflix NL?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qtslv2/ghosts_s3_in_nl_where_is_it/"
    },
    {
        "id": "1qtq1v9",
        "author": "AwkwardPension2760",
        "title": "ERROR: UNABLE TO COMPLETE THAT ACTION NOW",
        "content": "HELLO, i was traveling so my last payment did not go through, when i tried to redo the payment , it was giving me error of use a different payment method, so far i have tried 4 different cards of different banks and 3 international ones from UK and of 2 different individuals (siblings) and its not working. Someone suggested i cancel my subscription which i did but now when i am trying to sign up again via different email, its giving me this unable to complete that action now error. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qtq1v9/error_unable_to_complete_that_action_now/"
    },
    {
        "id": "1qtohrj",
        "author": "Mystically_mystic1",
        "title": "Stuff that I had watched I will mention all and you have pick up your fav among them:)",
        "content": "Here You Go…\n1)Money Heist (Complete)\n2)Squid Game (3)\n3)All Of  Us Are Dead (1)\n4)Shooter (3)\n5)Sweet Home(1)\n6)Mumbai Meri Jaan(1)\n7)Dahmer(1)\n8)Mirzapur(3)\n9)Peaky Blinders (6)\n10)Cat(1)\n11)The Wheel Of Time(1)\n12)Kaala Pani(1)\n13)House Of Secrets (Doc)\n14)The Railway Men-The Untold Story Of Bhopal 1984\n15)Wednesday(2)\n16)Lost In Space(2)\n17)Snowpiercer(2)\n18)Hijack(1)\n19)MH370 The Plane That Disappeared (Doc)\n20)Lupin(2)\n21)Sandman(1)\n22)Panchayaat(1)\n23)Guns And Gulaabs(1)\n24)Alice In Borderland (1)\n25)The Glory(1)\n26)Indian Predator-The Butcher Of Delhi (Doc)\n27)Reacher(2)\n28)Kohraa(1)\n29)Unseen(1)\n30)1899(1)\n31)Yeh Kaali Kaali Ankhain(2)\n32)Marco Polo (2)\n33)Lockwood&amp;Co(1)\n34)Pieces Of Her(1)\n35)Stranger Things \n36)Man VS Bee(1)\n37)Kaleidoscope(1)\n38)Sacred Games(1)\n39)El Chapo( Complete)\n40)Narcos(2)\n41)Narcos Saints(1\n42)Welcome To Eden\n43)House Of Dragon(1)\n44)Berlin (1)\n45)Breaking Bad(2)\n46)Asur (Complete)\n47)Curry&amp;Cyanide| The Jolly Joseph Case(Doc)\n48)Farzi(1)\n49)Sapne VS Everyone (1)\n50) Aasharam (3)\n51) Karma Calling (1)\n52) A Murder At The End Of The World (1)\n53) Taaza Khabaar(1)\n54) Sultan Of Delhi(1)\n55) Dahaad(1)\n56) Tandav(1)\n57) The Gentleman (1)\n58) Pataal Lok (2)\n59) Lootere(1)\n60) The Hijacking Of Flight 601(1)\n61) Aar Ya Paar(1)\n62) Rudra-The Edge Of Darkness (1)\n63) Heeramandi-The Diamond Bazaar(1)\n64) Aarya(3)\n65) Murder In Mahim(1)\n66) The Night Agent(2)\n67) Troy. Fall Of A City(1)\n68) Rise Of Empires: Ottoman(2)\n69) Roman Empire (3)\n70) IC814: The Hijacking Of Kandhar Airplane (1)\n71) GyeongSeong Creature(1)\n72) Khakee: The Bihar Chapter(1)\n73) Criminal Code(1)\n74) Murshid(1)\n75) Undekhi (3)\n76) Scam 2003 The Telgi Story (1)\n77) The Terminal List (1)\n78) Hasmukh (1)\n79) The Hunt For Veerappan (Doc)\n80) The Day Of The Jackal (1)\n81) Black Warrant (1)\n82) Breathe. Into The Shadows (1)\n83) The Night Manager (1)\n84) Chernobyl (1)\n85) The Greatest Rivalry IndVPak (DOC)\n86) The Are Murders (1)\n87) Bank Under Siege (1)\n88) The Breakthrough (1)\n89) Gyaarah Gyaarah (1)\n90) Delhi Crime (1)\n91) Brinda (1)\n92) Prison Break (3)\n93) The Last Frontier (1)\n94) Hewelsiuz (1)\n95) Celda 211 (1)\n96) The Price Of Confession (1)\n97) Gone Girls (Doc)\n98) Those About To Die (1)\n99) Devil in Disguise:John wayne Gacy (1)\n100) Mrs Despande (1)\n101) The Copahengen Test (1)\n102) Taj. Divided By Blood (2)\nSuggest Me Your Fav.",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1qtohrj/stuff_that_i_had_watched_i_will_mention_all_and/"
    },
    {
        "id": "1qtltfp",
        "author": "LocksmithSad8268",
        "title": "Netflix PC black screen issue",
        "content": "Why do I always get netflix blackscreen? Even if close all other platform like steam, clean everything, When I watch a show, and go fullscreen, the computer screen immediately goes black. What is more annoying is that the black screen also make me lose control my computer i cant do anything, home button, escape bottom, even, the old trick of pulling the task manager using Ctrl + Shift + Esc does not work.I already talked with a netflix support rep(They have no idea). It is like something locked my screen. chatgpt has told me that it is something with, Netflix uses DRM (Digital Rights Management). When you go fullscreen, Netflix switches the video into a protected playback mode. On some systems, that triggers:\n\n\n\nGPU driver bug\n\n\n\nHardware acceleration conflict\n\n\n\nHDR / display mode mismatch\n\n\n\nBrowser-level DRM failure\n\n✅ Fix #1 (MOST IMPORTANT): Disable Hardware Acceleration\n\n\n\nThis solves it for the majority of users.\n\n\n\nChrome / Edge:\n\n\n\nTurn OFF “Use hardware acceleration when available”\n\n\n\nRestart browser\n\n  \nAlso I used microsoft edge no issue, but not with chrome",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qtltfp/netflix_pc_black_screen_issue/"
    },
    {
        "id": "1qt6r7i",
        "author": "Ur_Space_Girl",
        "title": "recommendations like new girl, himym, b99, friends",
        "content": "Im trying to find feel good series like new girl, himym, b99, gilmore girls, i could watch and make me feel like my millenial self again who can bingewatch series all night eventho i need to wake up at 4 in the morning. i want to feel like myself again and have a quick escape to this adulting world we are trying to survive in!!!!!!",
        "upvotes": 5,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1qt6r7i/recommendations_like_new_girl_himym_b99_friends/"
    },
    {
        "id": "1qtkld5",
        "author": "ReputationSimilar449",
        "title": "An actor reminds me of a character I dislike",
        "content": "I'm watching a movie with Daryl Mccormack (his pic is in the linked article) in Knives Out 3 and his face instantly made me feel like he's someone I dislike for being an attractive a-hole in another show who threatens the emotional stability of a character I care about, maybe because he's a romantic rival or does something bad like abuse. \nMaybe I'm confusing him with another black actor with light-colored eyes and a strong jawline.\nI feel like it's from a Netflix series like 13 Reasons Why but don't remember any character like that.\nWeird thing is: my girlfriend feels the exact same, any ideas of who it could be?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qtkld5/an_actor_reminds_me_of_a_character_i_dislike/"
    },
    {
        "id": "1qtk7lr",
        "author": "aeghftjnft",
        "title": "Does anyone remember this weird series I saw on Netflix from around what i remember 2013-2016?",
        "content": "It was like a series of chapters without any continuation, talked about (all fictional) disasters/diseases, not sure about this, since I saw it while I was a kid but I think it followed this kind of documentary format (60% sure about this)\n\nWhat I am 100% sure about is that one of the episodes was about this deathly black goo/liquid invading cities in somewhat of a tsunami style\n\nAnother one I remember but I am not sure about was one about this rabies and zombie like virus, but this one i dont quite remember as well as the other one\n\nAnother thing I saw it on LatinAmerican Netflix, i dont think this contributes on anything but that's it\n\nI've been breaking my head trying to search for it",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qtk7lr/does_anyone_remember_this_weird_series_i_saw_on/"
    },
    {
        "id": "1qtiv1l",
        "author": "SabenWS",
        "title": "I can’t find Audio Description option for the finale of Stranger Things",
        "content": "I was wondering does anyone know why I can’t find the Audio Description option for Season 5 Episode 8 of Stranger Things? Does it not exist?\n\nFor context: I downloaded the finale on my phone to watch while camping because I was going to be out of service. When playing it on my phone I couldn’t find the Audio Description option however. I turned on my iPhone’s accessibility settings for automatic Audio Descriptions, looked up tutorials, deleted &amp; then redownloaded, &amp; everything!\n\nAny suggestions?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qtiv1l/i_cant_find_audio_description_option_for_the/"
    },
    {
        "id": "1qskipm",
        "author": "kaszpur",
        "title": "What are your go-to comfort shows?",
        "content": "I watch a decent amount of things I haven’t seen before but there are shows I love to rewatch because they feel familiar. Shows that make you feel calm or safe. There are specific shows I’ll just put on even while I’m going to sleep at a low volume. Usually corny light hearted things like the big bang theory has been my go to lately. What are your comfort shows? ",
        "upvotes": 82,
        "comments": 200,
        "media": null,
        "permalink": "/r/netflix/comments/1qskipm/what_are_your_goto_comfort_shows/"
    },
    {
        "id": "1qs7mho",
        "author": "Large-Cardiologist54",
        "title": "Why do I keep rewatching the same shows instead of starting new ones?",
        "content": "I have a whole watchlist. So many “good” shows saved. But every night I end up rewatching the same comfort show I’ve already seen 5 times. It’s like my brain doesn’t have the energy to try something new. Anyone else stuck in this loop? 😅",
        "upvotes": 278,
        "comments": 171,
        "media": null,
        "permalink": "/r/netflix/comments/1qs7mho/why_do_i_keep_rewatching_the_same_shows_instead/"
    },
    {
        "id": "1qtle2j",
        "author": "NetTop4061",
        "title": "Netflix hasn't charged me for 2 years 😲",
        "content": "I subscribed to Netflix through my Totalplay (Mexico) service over three years ago. About two years ago, my recurring monthly charge stopped appearing. The first month, I thought my provider had simply stopped offering streaming services, but they haven't suspended my service since. It's worth noting that Netflix's website shows the charge as linked to my Totalplay package, but Totalplay says it wasn't, that my Netflix service was canceled two years ago. Has this happened to anyone else? Do you think they'll charge me for the two years I haven't paid?",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1qtle2j/netflix_hasnt_charged_me_for_2_years/"
    },
    {
        "id": "1qt66e5",
        "author": "DevWarrior504",
        "title": "Which horror/thriller shows do you most wish had continued?",
        "content": "I just finished “The Watcher” on Netflix again and started wondering why it never got a proper continuation, and whether it even should have.\n\nWhich horror or thriller TV shows were cancelled way too early and really deserved another season or kept going when they should have stopped a long time ago?",
        "upvotes": 2,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1qt66e5/which_horrorthriller_shows_do_you_most_wish_had/"
    },
    {
        "id": "1qsayt8",
        "author": "Slow-and-low-15",
        "title": "WHY?!",
        "content": "Rant from US: I didn’t ask for \\*mobile games\\* but my eyes are assaulted by them every time I look at my home page. And now, I’m supposed to watch PODCASTS?? On Netflix?? Who wants this?! I hate it.",
        "upvotes": 140,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1qsayt8/why/"
    },
    {
        "id": "1qso67y",
        "author": "Secret_Scallion_3452",
        "title": "Dhurandhar is #1 on Netflix and honestly… I get it now",
        "content": "Just saw Dhurandhar pop up at #1 on Netflix since Day 1.\nI watched it in theatres when it released, thought that was enough.\nBut rewatching at home hits different.\nYou catch so many small things you miss on the big screen because you’re just overwhelmed by everything happening.\nThe rewatch spike is real.\nNo wonder it’s trending like crazy.\n",
        "upvotes": 9,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1qso67y/dhurandhar_is_1_on_netflix_and_honestly_i_get_it/"
    },
    {
        "id": "1qt7xsl",
        "author": "gamer1913",
        "title": "Why does netflix say there is gonna be new episodes for a show and than just doesen't add it?!",
        "content": "This is the seconde time this happened to me i look forewherd to watching the new ep they said they will add than the day comes there are no new ep but the show is gone frop netflix now its appened again i was looking forewherd for S3 of ghost they sad it came today but no its not here ...",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1qt7xsl/why_does_netflix_say_there_is_gonna_be_new/"
    },
    {
        "id": "1qt5aar",
        "author": "rosstoferwho",
        "title": "Why can you not watch the wrestling properly on your phone next day",
        "content": "When you skip ahead it just goes back to the start of the show. \n\nSo you could be halfway through the show. And it will just go back to the start. No matter how much you try to skip. \n\n.sort your fucking shit out netflix ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qt5aar/why_can_you_not_watch_the_wrestling_properly_on/"
    },
    {
        "id": "1qt8jr1",
        "author": "joe102938",
        "title": "Netflix is awful now. I just want to watch 28 years later, but I need to upgrade my subscription to see it. I hate that Netflix has the rights to it.",
        "content": "Seriously, I already pay them a monthly fee. I can't afford to double that. And the only way to watch 28 years later is with a premium Netflix subscription, or rent it. ",
        "upvotes": 0,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1qt8jr1/netflix_is_awful_now_i_just_want_to_watch_28/"
    },
    {
        "id": "1qrdfop",
        "author": "phillygirllovesbagel",
        "title": "Catherine O'Hara Dead at 71",
        "content": "",
        "upvotes": 1489,
        "comments": 118,
        "media": null,
        "permalink": "/r/netflix/comments/1qrdfop/catherine_ohara_dead_at_71/"
    },
    {
        "id": "1qt1xzf",
        "author": "ArmyNegative2743",
        "title": "TVD, nasa Netflix na!",
        "content": "Finally nasa Netflix na ang The Vampire Diaries na noon ay napapanood pa natin via DVD series or tyinatyaga sa movie apps na may adds! Labas na mga fans ni Elena, Damon, at Stefan pati na rin ni Bonnie, Caroline, etc. Happy watching sa mga katulad kong nangarap minsan maging vampire!",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qt1xzf/tvd_nasa_netflix_na/"
    }
]