[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 33,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pi3w47",
        "author": "Routine-Ad-1546",
        "title": "Sean Combs new documentary",
        "content": "One of the greatest things the documentary proved was that the jurors were dumb as fuck. No common sense whatsoever.\n\nI just know they got paid to act dense bc if they didn’t take a payoff I’d be very surprised…. It was shocking the jurors even wanted to save face with some ridiculous excuses to literally let the devil loose. The diddler belongs UNDER the jail, k.",
        "upvotes": 298,
        "comments": 86,
        "media": null,
        "permalink": "/r/netflix/comments/1pi3w47/sean_combs_new_documentary/"
    },
    {
        "id": "1pi9fsh",
        "author": "NoMoreTicks",
        "title": "First We Waited for Seasons, Now We Wait for Volumes",
        "content": "Remember the good old days? We waited a year—maybe two—for a new **season** of our favorite show. It was painful, sure, but the eventual drop was a single, glorious binge-fest. We adapted. We endured the long waits for the return of hits like the final run of *Stranger Things*.\n\nBut now, the streaming overlords have added a new layer of torture: **Volumes**.\n\nIt’s not enough that we waited for what we were promised as \"Season 5\" of *Stranger Things*, only to get Volume 1—a cruel, tantalizing fraction of the story. You get four episodes of vital plot, a massive cliffhanger, and then... nothing. Back to the waiting game for Volume 2, which is essentially just the back half of the same season. The same happened with the highly-anticipated return of *The Family Man*, only for fans to have to wait again between parts.\n\n  \nWe signed up for the convenience of binge-watching, the freedom to control our viewing experience. Now, we are being forced back into an anticipated, staggered release schedule, only without the benefit of the traditional weekly TV model that kept the community discourse alive for months. Instead, we get an initial flash of binge-mania followed by a frustrating, momentum-killing pause.\n\n",
        "upvotes": 82,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1pi9fsh/first_we_waited_for_seasons_now_we_wait_for/"
    },
    {
        "id": "1pipz34",
        "author": "Beneficial-Anteater2",
        "title": "Netflix needs to add an “already watched” button",
        "content": "Hey guys, now that everyone has to get their own account and every tab is recommendations scroll, can we please add a button that lets us take it off the lists. I think its a good idea because We are paying for good service and seeing all these lists with stuff that I already watched makes me wanna use other streaming platforms. At least add a “watch again tab. ",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pipz34/netflix_needs_to_add_an_already_watched_button/"
    },
    {
        "id": "1pii396",
        "author": "PeaBite",
        "title": "Four Seasons w/ Steve Carrell",
        "content": "Opinions? \n\nWhen it started, there was a lot of cringy lines so I thought I wouldn’t be able to finish it. Now I finished it and I’m crying. I’m wondering how other people found it because I’m confused about the roller coaster of emotions and opinions I have about it!",
        "upvotes": 10,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1pii396/four_seasons_w_steve_carrell/"
    },
    {
        "id": "1pii7eg",
        "author": "huffpost",
        "title": "When Life Gives You Tangerines | The Unexpected Therapy of K-Dramas",
        "content": "",
        "upvotes": 10,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pii7eg/when_life_gives_you_tangerines_the_unexpected/"
    },
    {
        "id": "1pic5nv",
        "author": "Mandarina_Espacial",
        "title": "Is netflix the owner of the nemesis system?",
        "content": "This is my first post here and i wanted to know if now that netflix bought warner, does that mean also has the ownership of the nemesis system?\n\nI hope the answer is YES and also to make it public, because what warner did with the patent was evil",
        "upvotes": 10,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1pic5nv/is_netflix_the_owner_of_the_nemesis_system/"
    },
    {
        "id": "1piov3s",
        "author": "Srapotr",
        "title": "I have a problem downloading Dead cells Netflix edition",
        "content": "I can't download Dead cells Netflix edition and I don't know why I have a Redmi 14 and an active netflix account,proof ? \nMy best friend was able to do it on my account but it just won't download on my device and I played the game before I really want to play today \nPlease help ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1piov3s/i_have_a_problem_downloading_dead_cells_netflix/"
    },
    {
        "id": "1piob7f",
        "author": "Fluid-Umpire3141",
        "title": "Basic getting more ads",
        "content": "I noticed basic lately been showing more ads compared to like 4 months ago, I guess this is how they programm us sheeps to upgrade forcefully, fking greediness increase for all these trillionares",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1piob7f/basic_getting_more_ads/"
    },
    {
        "id": "1piknnx",
        "author": "LilyWai",
        "title": "Anyone getting \"No Devices Found\" when trying to stream Netflix App?",
        "content": "This has been driving me batty! On all my iOS devices the Netflix app just will not recognise my smart TV, my streaming box or my Chromecast device &amp; when tapping the streaming logo it just shows a greyed out message saying \"No Devices Found\" with a \"Go To Help Centre\" option. It has been like this for a month &amp; occurred suddenly after working fine for years.\n\nHave gone to Help Centre - which wasn't much help - &amp; tried all their suggestions &amp; few others:\nRebooted modem\nSwitched power off to all devices - modem, TV etc... - &amp; waited 10 mins &amp; powered up again\nRebooted all devices - iPhone, iPad plus all streaming devices including TV\nDeleted Netflix app &amp; re-downloaded\nSigned out of Netflix app &amp; signed back in\n\nNOTHING has worked. Is this an issue anyone else is getting or just me? Or has anyone else encountered this &amp; perhaps found a solution?\n",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1piknnx/anyone_getting_no_devices_found_when_trying_to/"
    },
    {
        "id": "1pinpqw",
        "author": "Electronic_Stop_9239",
        "title": "How long do used icons remain in the history? Is there a limit to the number of profile icons that are shown in the history?",
        "content": "I'm asking because I want to change my profile icon, but I don't know if I can reuse it whenever I want...\n\n(The icon I'm using now is no longer available for others to use.)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pinpqw/how_long_do_used_icons_remain_in_the_history_is/"
    },
    {
        "id": "1pinl7h",
        "author": "AmazingLeopard6414",
        "title": "Random language",
        "content": "So every time when I open Netflix on my tv, phone or I pad, it is in another language. First it was Japanese, then Greek, now Spanish. I am the only one who uses the account and I also checked the logged in devices. Nothing but me.\nHas anyone else this issue?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pinl7h/random_language/"
    },
    {
        "id": "1pimvu5",
        "author": "MsAdventuresBus",
        "title": "The Price of Confession",
        "content": "How are Korean dramas just so good? It is like their writers understand human emotions so well AND they don’t need to add gratuitous sex scenes Lin their shows. Violence, yes, so not all together family friendly but the writing is just so good. Another show I enjoyed was Heavenly Ever After. Their depiction of dogs and cats who make it to heaven just makes me cry. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pimvu5/the_price_of_confession/"
    },
    {
        "id": "1pilzbn",
        "author": "TwinSong",
        "title": "Would some series be better released weekly?",
        "content": "The trouble with this all-at-once format or half-series blocks in some cases (Stranger Things), everyone's essentially at different points in the series so spoilers are likely\\* and it means you can't really discuss it.\n\nTake *Doctor Who* which uses the weekly release format (usually), when there are two-parters everyone except the production team has the same amount of knowledge. You have more of a sense of community I suppose.\n\nIt might also prevent people just binge-watching series in a short duration so make the gap between series less pronounced. \n\n\\*yes, leaks happen but more of a rarity.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pilzbn/would_some_series_be_better_released_weekly/"
    },
    {
        "id": "1pil48q",
        "author": "MachineConnect",
        "title": "Money Heist",
        "content": "Honestly looking back at the series. Both Tokyo and Rio gotta be the two worst in constantly putting the entire plan at risk. Tokyo is just a hothead ready to blow up and Rio is a vulnerable simp. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pil48q/money_heist/"
    },
    {
        "id": "1piktud",
        "author": "Lizzy10twins",
        "title": "How many devices can I stream Netflix on",
        "content": "How many devices can I have signed into Netflix at one time not meaning simultaneously just logged in because a lot of my family has their devices logged in and I want to know if I can log another one on because I’m getting a projector soon and want to be able to have Netflix on it",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1piktud/how_many_devices_can_i_stream_netflix_on/"
    },
    {
        "id": "1phzd9u",
        "author": "Cool_Bath_77",
        "title": "Love &amp; Death and Candy",
        "content": "I did not realize \"Love &amp; Death\" (2023) is the same story as \"Candy\" (2022). I am watching Love &amp; Death and did not realize it was the same storyline until episode 4. I probably watched Candy in 2022. I don't have a memory to remember character names years later.\n\nWhen did everyone else realize it was the same story?",
        "upvotes": 18,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1phzd9u/love_death_and_candy/"
    },
    {
        "id": "1pijqni",
        "author": "SignificantCricket",
        "title": "UK: while on a pause, is there a way to switch subscription tiers so that when you unpause, you get charged the lowest rate?",
        "content": "On the Netflix site, it looks like you can't, and you have to leave it on your previous rate, and only after you have ended the pause and been charged your previous rate, can you switch down if your previous rate was not the lowest.\n\nThis doesn't seem very fair. (A lot of things aren't in commerce obvs, but it does not seem like the typical standard for how stuff works in the UK.)\n\nDoes anyone know a way round this?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pijqni/uk_while_on_a_pause_is_there_a_way_to_switch/"
    },
    {
        "id": "1pi7yo0",
        "author": "Educational_Base_301",
        "title": "I feel like I watched everything on Netflix. Any new 2026 series to look forward to?",
        "content": "I’ve gone through so many shows over the last few years that I’m starting to run out of things to watch.  \nDo you guys have any recommendations for upcoming Netflix series in 2026 or something recent that feels fresh?  \nI’m open to any genre, as long as it keeps me hooked.",
        "upvotes": 4,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1pi7yo0/i_feel_like_i_watched_everything_on_netflix_any/"
    },
    {
        "id": "1phkmdn",
        "author": "Brandon84xx",
        "title": "The Beast In Me",
        "content": "Was I the only person who thought Nile asked Aggie to sign the book just to forge her signature for the jogging path?\n\nI was so sure but apparently not.",
        "upvotes": 100,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1phkmdn/the_beast_in_me/"
    },
    {
        "id": "1pih85d",
        "author": "Forward-Spinach1897",
        "title": "Update household question please help",
        "content": "I recently got a PlayStation and I’m trying to set up the Netflix here., I lt said I had to send my mom an email and she had to follow instructions. It asked her if she wanted to approve and she said yes, and it let me in to watch Netflix. But the next day it was asking me to do it all over again. It says that this device is already set up, but that my mom has to do something further. Any help is appreciated thank you 🙏 ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pih85d/update_household_question_please_help/"
    },
    {
        "id": "1pifz8a",
        "author": "Strange-Internal7153",
        "title": "Membership canceled 10 days early, now I can’t even re-subscribe everything is broken",
        "content": "  \nThis is seriously frustrating and feels unacceptable.\n\n  \nMy membership was **automatically canceled 10 days before my plan was supposed to expire**. No warning, no justification — just gone. Fine, mistakes happen, right? So I tried to **re-start my membership**… and that’s where things completely fall apart.\n\n\n\n* Clicking **“Select Plan” does absolutely nothing**\n* Sometimes it just throws random **errors**\n* Tried on **my phone**\n* Tried on **my laptop**\n* Tried **different browsers**\n* Tried **incognito**\n* Tried everything I could think of\n\n  \nThen I thought, okay, I’ll contact support. Guess what? **The help/contact support page is ALSO throwing an error.** I literally can’t even report the problem properly.\n\n\n\nSo\n\n* They canceled my membership early ✅\n* They won’t let me re-subscribe ✅\n* And they won’t even let me contact support ✅\n\n\n\nWhat exactly am I supposed to do at this point?\n\nIs anyone else dealing with this right now, or is my account just completely broken? Would really appreciate if someone from the team could actually look into this because this is beyond ridiculous.\n\nAttaching proof so that no one says its my fault.\n\n  \n[From mobile](https://imgur.com/a/Ao1h9YZ)\n\n[From web help](https://imgur.com/a/Lzb5xDA)\n\n[Console error](https://imgur.com/a/8PPt5VK)\n\nThank you",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pifz8a/membership_canceled_10_days_early_now_i_cant_even/"
    },
    {
        "id": "1ph1mqu",
        "author": "Other-Squirrel-8705",
        "title": "Diddy is done.",
        "content": "Sean Combs:The reckoning.  What shocked you the most? Collecting bodily fluids to drink later 😱. Also when he shook hands with his fans/people in Harlem….and talked about needing a shower after. That man is layers of evil. ",
        "upvotes": 1539,
        "comments": 522,
        "media": null,
        "permalink": "/r/netflix/comments/1ph1mqu/diddy_is_done/"
    },
    {
        "id": "1piew79",
        "author": "Agreeable-Bike-3782",
        "title": "Alaskan Bush People",
        "content": "Was quite happy to see new series coming after enjoying the easy watching of series 1 &amp; 2.\nSo thanks netflix for picking up at series 12, 13, 14.\nIf someone can fill me in on series 3-11 I'll be grateful ya'll 🤣🤣🤣🤣",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1piew79/alaskan_bush_people/"
    },
    {
        "id": "1pijcwt",
        "author": "redditor329845",
        "title": "Wake Up Dead Man Release",
        "content": "I know the movie’s coming out this Friday, but is there any way to know exactly what time of day? \n\nMy friends and I want to do a watch party but we’re not sure what time to hold it at. I haven’t tried to catch a new Netflix release in a while, so I’m not sure. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pijcwt/wake_up_dead_man_release/"
    },
    {
        "id": "1ph42sv",
        "author": "HehroMaraFara",
        "title": "Sean Combs: The Reckoning",
        "content": "Obviously he’s generally a scumbag and that’s been well established. What struck me the most is almost any time he speaks at length, it is pure gibberish. \n\nThis mofo cannot put together a coherent thought. How he operated in any kind of a professional sense is unbelievable. It is pretty ridiculous that he was not exposed earlier. \n\nFuck Diddy. ",
        "upvotes": 719,
        "comments": 126,
        "media": null,
        "permalink": "/r/netflix/comments/1ph42sv/sean_combs_the_reckoning/"
    },
    {
        "id": "1piaaqu",
        "author": "MechRat",
        "title": "How to fix your monitor going black when opening Netflix, Spotify, Disney+ on your PC, caused by HDCP, when the NVIDIA setting \"Content Type Reported to the Display\" doesn't appear",
        "content": "My setup: *Windows 11, AMD Ryzen 9, RTX 3070, Dual Acer Monitors. However, I've experienced this with other setups too.*\n\nMy monitors going black when loading up Netflix, Spotify and other services, whether through desktop apps or through any browsers, has plagued me for years. Yesterday I finally tried a fix that actually worked flawlessly for me.\n\nFor reference, I tried the most popular fixes, such as disabling audio devices in Device Manager or Content Type Reported to the Display in NVIDIA Control Panel (as I don't have that option appear), but to no avail.\n\nI stumbled upon this [forum](https://forums.guru3d.com/threads/disable-hdcp-regedit.442563/), discussing how to disable HDCP with a registry edit. And it worked flawlessly for me.\n\n**DISCLAIMER: Editing the Windows Registry carries significant risks. Disabling HDCP may cause other issues with compatibility in other software and services.**\n\n1. **Get your GFX Class GUID** (*Open Device Manager, right click your graphics card under Display adaptors, go to details, select Class GUID, right click the number that appears and copy and paste somewhere!)*\n2. **Open Command Prompt** (*Press Windows key, type Command Prompt, right click and open as administrator*)\n3. **Disable HDCP** (*Paste in the command below to update your registry, checking that the ID matches your GFX and then press enter)*\n4. **Restart your PC**\n\n`reg add \"HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Class\\{4d36e968-e325-11ce-bfc1-08002be10318}\\0000\" /v \"RMHdcpKeyglobZero\" /t \"REG_DWORD\" /d \"1\" /f`\n\nI hope it can help others - it was driving me mad!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1piaaqu/how_to_fix_your_monitor_going_black_when_opening/"
    },
    {
        "id": "1phedey",
        "author": "DetectiveHot2071",
        "title": "50 Cent claims Diddy sent him ‘creepy’ gift from prison after explosive Netflix doc",
        "content": "",
        "upvotes": 86,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1phedey/50_cent_claims_diddy_sent_him_creepy_gift_from/"
    },
    {
        "id": "1phyz8q",
        "author": "BiploarFurryEgirl",
        "title": "Has anyone else noticed that subtitles are suddenly not correct on translated shows?",
        "content": "I love Ragnarok. I’ve watched it about 4 times and I started my 5th watch today, but I don’t remember the subtitles being this wrong. The third episode is especially glaring. I’m so confused on what happened, like thank god I’ve watch the show before so I wasn’t confused when the subtitles during the therapist’s and Ran’s conversation shows the therapist (via subtitles) saying that he SHOULD be telling Ran the things Magna had just told him, when in reality the actual conversation (via audio) says that he shouldn’t be saying these things. My fiance was confused though so I had to pause to explain. And that’s just one of many translation issues in this episode.\n\n\nI’m so confused, this show was pretty well translated about a year ago? What happened?",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1phyz8q/has_anyone_else_noticed_that_subtitles_are/"
    }
]