[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 3,
        "comments": 26,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 5,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1m5bpsa",
        "author": "Infamous-Habit4769",
        "title": "L'ubriacone del 64 e il disagio sociale",
        "content": "Ieri sera ho assistito a un siparietto molto trash sul 64, direzione Collegno.\n\nCredo sia ormai un volto noto sul 64 notturno, un tizio sulla sessantina perennemente ubriaco e molesto che parla da solo inveendo contro qualcuno che vede solo lui, tirando porconi e mugugnando qualcosa tipo ''mandarini di merda''.\n\nFatto sta che ieri sera stava bofonchiando da solo come suo solito quando ha detto qualcosa riguardo non meglio specificata ''gente di colore'': apriti cielo.\n\nUn tizio ha iniziato a fargli brutto urlandogli che aveva rotto i coglioni e che non doveva permettersi di dire cose razziste a gente che stava tranquilla.\n\nIn tutto questo, per qualche ragione, altri passeggeri hanno iniziato a prendere le difese del tizio ubriaco nonostante il fastidio recato, perché non si sa cosa ha passato per ridursi così, e che comunque l'altro tizio non aveva nessun diritto di dire alla gente di star zitta e chiudere la bocca.\n\nDopo varie minacce vuote, insulti, e bofonchiate incomprensibili, l'eroe che nessuno ha chiesto è sceso, seguito dopo qualche fermata dal nostro alcolizzato.\n\nOgni sera sul 64 è così con quest'uomo.\n\nQuello che mi lascia perplesso è che tanta gente che ha comunque i propri problemi vorrebbe solo star tranquilla soprattutto a fine giornata, e prendersela con uno che dice a un tizio molesto di star zitto mi pare assurdo. Nel senso, essere in una situazione di fragilità ti da il diritto di essere una spina nel culo a gente che è obbligata suo malgrado ad averti attorno?",
        "upvotes": 25,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1m5bpsa/lubriacone_del_64_e_il_disagio_sociale/"
    },
    {
        "id": "1m4w8k7",
        "author": "amicidilazzaro",
        "title": "Mense a Torino - Servizi per chi e' in difficolta' (con alcune segnalazioni per l'estate 2025)",
        "content": "In luglio Casa s.Luisa chiusa  \nS. Antonio ad agosto (fino al 25), in compenso c'e' la  \nMensa Estiva Via Ghedini 6, 10154 Torino Aperta d'estate. Dal lunedi al venerdì, più sacchetto per i festivi, dalle ore 11.45 alle 12.45.\n\nNel link invece trovate le mense aperte abitualmente durante l'anno (link aggiornato abbastanza regolarmente)  [https://www.amicidilazzaro.it/it/solidarieta/mense-a-torino-servizi-per-chi-e-in-difficolta/](https://www.amicidilazzaro.it/it/solidarieta/mense-a-torino-servizi-per-chi-e-in-difficolta/)",
        "upvotes": 22,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1m4w8k7/mense_a_torino_servizi_per_chi_e_in_difficolta/"
    },
    {
        "id": "1m4qaol",
        "author": "Parking-Job-3175",
        "title": "Chi vuole venire al museo egizio? O altre attività",
        "content": "Ciao! Sarò a Torino per un paio di giorni principalmente per lavoro. Nel tempo che avrò libero, mi piacerebbe andare a visitare il museo egizio ed eventualmente passeggiare per la città. Se qualcuno è interessato, possiamo chiacchierare per messaggio privato. Io ho 29 anni e parlo italiano, inglese, francese e spagnolo. Lavoro nella sostenibilità / riciclaggio, mi piace lo sport e faccio parte della comunità LGTBI. 🤗",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1m4qaol/chi_vuole_venire_al_museo_egizio_o_altre_attività/"
    },
    {
        "id": "1m4qujm",
        "author": "Meiyo_ayoo",
        "title": "Sta sfuggendo di mano",
        "content": "BUONSALVE ABITANTI DI TORINO! \nTorino capitale delle belle cose, molto belle, tra cui l’indecenza delle persone!\nDunque miei fedeli destrieri oggi torno, dopo mesi di inattività, a raccontare una parte di questa città magnifica, al fine di chiedere aiuto a risolvere queste cose indecenti.\nQuindi, io sono M16, e no, non sono un fucile d’assalto ma un semplice ragazzo delle superiori -a volte preferirei esserlo- e oggi vi racconterò un avvenimento di qualche ora fa, vissuto sulla mia pelle.\nDunque, io non mi reputo una persona matura, anzi credo di poterlo essere di più, però oggi ho compiuto un atto degno di lode… non per tutti a quanto pare.\nStavo aspettando il pullman sotto casa mia e vedendolo arrivare mi accingo a fare il consueto gesto con la manina per farlo fermare, alchè vedo un povero uomo correre verso il pullman, in fondo, all’orizzonte, con l’intento di prendere il mezzo pubblico.\nIo, da bravo cittadino che sono, mi metto a metà tra porta e marciapiede per evitare che l’autista chiuda le porte e per far salire questo povero corridore (appunto: l’autista aveva aperto solo una porta, quella centrale). \nAd un certo punto (5 secondi dopo che si era fermato il pullman e che non ero salito) l’autista ha provato a chiudere la porta, che avevo prontamente fermato con il mio braccio, e iniziato ad urlarmi contro.\nIo e il mio prodo entriamo in pullman e quella strega maligna inizia ad urlarmi “NON DEVI FARE QUESTE COSE, SIAMO TUTTI DI FRETTA QUI, SI POSSONO ROMPERE LE PORTE!” alchè io rispondo a tono con un “Stia calma, ho solo fatto un buon gesto. Un po’ di umanità c**zo” e finisce lì la storia.\nQuindi miei fedeli lettori, cosa ne pensate? \nSono stato io il problema perché il pullman era in ritardo di 6 minuti o l’autista indegna di essere un’umano pensante?\nLa cosa che fa riflettere molto sulla maturità delle persone oggi è che la guerriera infuriata era una donna sulla cinquantina… battuta da un sedicenne.\nBENE, a voi i restanti pareri, \nBuona giornata miei prodi!\n\nps: quando sono sceso dal pullman e dovevo attraversare mi sono fermato in mezzo alla strada, l’ho guardata e ho sorriso come un imbecille.\n\nps2: il tipo mi ha ringraziato e ho scoperto che era un turista… che brutta idea si sarà fatto… menomale che non ha capito cosa diceva quella lì perché non sa l’italiano!",
        "upvotes": 6,
        "comments": 36,
        "media": null,
        "permalink": "/r/torino/comments/1m4qujm/sta_sfuggendo_di_mano/"
    },
    {
        "id": "1m4lduy",
        "author": "Fv_invest",
        "title": "Quale attività, servizio o business secondo voi manca a Torino (o in Italia in generale)?",
        "content": "Ciao a tutti!\nSto cercando di farmi un’idea su cosa manca nella nostra città (e più in generale in Italia) a livello di servizi, attività o business.\nMi piacerebbe sapere da voi:\n\nC’è qualcosa che avete visto all’estero e che qui non esiste (o esiste poco)?\n\nUn problema che vivete ogni giorno e che secondo voi si potrebbe risolvere con un servizio intelligente?\n\nUn tipo di locale, spazio, app, o esperienza che vi piacerebbe esistesse?\n\n\nNon cerco idee da copiare, ma voglio capire meglio i bisogni non soddisfatti delle persone. Ogni spunto è benvenuto. Anche le cose più piccole o strane!\n\nGrazie in anticipo!",
        "upvotes": 6,
        "comments": 59,
        "media": null,
        "permalink": "/r/torino/comments/1m4lduy/quale_attività_servizio_o_business_secondo_voi/"
    },
    {
        "id": "1m4kbua",
        "author": "O_O__________",
        "title": "Strutture Anziana con figlio disabile",
        "content": "Salve Redditors, \nHo una zia molto anziana di Torino che al momento vive da sola e gestisce un figlio con disabilità (mentale e fisica). Da un po' di tempo stava cercando una struttura che potesse accomodare lei e suo figlio, una struttura che lei dia la tranquillità che sua figlia viva bene nel momento in cui verrà a mancare.\n\nNon ho la possibilità io di mollare tutto e gestire la situazione e probabilmente creerei solamente problemi con i vari parenti parassiti che stanno cercando di marciarci sopra.\nHo pensavo dunque di salire  3-4 giorni per fare una cernita delle varie strutture, così da lasciarle une lista e sperare che tutto vada per il meglio.\n\nVorrei chiedervi se qualcuno ha qualche struttura affidabile da consigliarmi",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1m4kbua/strutture_anziana_con_figlio_disabile/"
    },
    {
        "id": "1m4vsha",
        "author": "gamma50g",
        "title": "TrenItalia from Torino to Venice at 805 am. How early do I need to get to Torino station?",
        "content": "I have a train from Torino to Venice Trenitalia frecciarossa 9715. The departure time is 805 am from Porta Nueva Station.\n\nHow much time earlier should I arrive? We are 3 people with one suitcase each.\n\nThanks!",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1m4vsha/trenitalia_from_torino_to_venice_at_805_am_how/"
    },
    {
        "id": "1m3z6z1",
        "author": "iLoveLoFi",
        "title": "4 Nights in Torino",
        "content": ".. were definitely not enough. I had around 30.000 Steps a day and i gotta say :\nIm so impressed. All the porticoes, the little side streets, there is so much to explore! I thought after being to Bergamo and Verona for two nights each that this City might be a little more stressful but i actually managed to relax more here. Coming from Berlin, i really felt at home. I think those two cities are actually pretty similar. Some areas are a little bit sketchy i suppose but i didn’t feel in danger anywhere, even BdM was not as bad as expected. I have been to a few larger european cities like Paris, Munich, Cologne, London etc. and even Milan and Rome but if i would have to choose i would definitely prefer staying in Turin. I can’t exactly explain why i felt so comfortable here, some people told me before that it can be boring and that its a non-touristic city but maybe that’s precisely why it felt so good. I didn’t hear any loud americans or drunk russians. (sorry for the stereotypes but i mean it’s true).\nA city like Bergamo was amazing to see, a lot of history and a lot of pretty architecture, but i wouldn’t exactly wanna live there i think. Turin is different, while it also has the history and architecture, it just feels more lively. I really enjoyed going to places like Master Sandwich or Imbarchino. Talking to locals, students etc. everybody was really nice and seemed to appreciate my effort to speak in broken italian. A tobacco store owner told me how much the city is changing and that he is a bit afraid of the direction it might take but i think as long as it stays true to the core values that it seems to have, it will be just fine, i definitely enjoyed it a lot and would love to come back. Just wanted to say that i think you guys can be proud of your city, its really nice!\n\n\nedit: oh also, molecola is amazing! i hate normal coke which is why i usually only drink Fritz Kola, which i couldn’t find anywhere, but molecola was a nice replacement. \n",
        "upvotes": 73,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1m3z6z1/4_nights_in_torino/"
    },
    {
        "id": "1m4ljdu",
        "author": "seba-dev",
        "title": "Conoscete associazioni non profit?",
        "content": "Da poco sto cercando di mettere in piedi una piattaforma per connettere volontari e associazioni non profit e mi chiedevo se ce ne fossero che cercano attivamente volontari.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1m4ljdu/conoscete_associazioni_non_profit/"
    },
    {
        "id": "1m4llhc",
        "author": "Charming-Spend-4031",
        "title": "Scambisti",
        "content": "Salve a tutti scusate x questa domanda.\n\nVolevo sapere se a pinerolo e dintorni ci sono parcheggi x scambisti ecc ecc...\n\nGRAZIE A CHI RISPONDE\n",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1m4llhc/scambisti/"
    },
    {
        "id": "1m45zx3",
        "author": "fotopers",
        "title": "[OC] Foglie d'autunno al Parco del Valentino (November 2019)",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/du1ottr93wdf1.jpeg?auto=webp&amp;s=afdb989a8c99b4c256a8f4234e830baaa3c7ce0e"
        },
        "permalink": "/r/torino/comments/1m45zx3/oc_foglie_dautunno_al_parco_del_valentino/"
    },
    {
        "id": "1m42l73",
        "author": "unoret",
        "title": "Is San Salvario (Turin) safe to live in ?",
        "content": "",
        "upvotes": 6,
        "comments": 26,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ru374bkvdvdf1.jpeg?auto=webp&amp;s=33d5518c0ab4fdcfc36615d29cd76e9f481ab516"
        },
        "permalink": "/r/torino/comments/1m42l73/is_san_salvario_turin_safe_to_live_in/"
    },
    {
        "id": "1m41u60",
        "author": "MrWaffles916",
        "title": "Please I need urgent help regarding the universitaly application",
        "content": "So I applied to sapienza on univeristaly and then i got my acceptance for polito june 29 so i want to rechange that. I wish to change my universitaly application to polito. Can sapienza do that without doing a full cancelation of my application? Because I am scared if they do a full cancelation i can't anymore apply to polito as the deadline as passed June 30. Please if someone could help me.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1m41u60/please_i_need_urgent_help_regarding_the/"
    },
    {
        "id": "1m3pcb1",
        "author": "Training_Medicine_49",
        "title": "Aeroporto: domanda",
        "content": "Ciao a tutti\n\nAvevo sentito varie cose dall’aeroporto a Torino e volevo avere un po’ di chiarezza su una cosa. I voli internazionali che partono molto presto di mattina dovrei arrivare 2 o 3 ore in anticipo? Vi chiedo perché ho letto da qualche parte 3 ore e poi lo so a volte non c’è molto staff che lavora di mattina , solo un paio di persone, con molti voli che decollano più o meno lo stesso orario il che può richiedere più tempo ai passeggeri. Il mio volo parte alle 6:35 per Parigi con air France. ",
        "upvotes": 3,
        "comments": 17,
        "media": null,
        "permalink": "/r/torino/comments/1m3pcb1/aeroporto_domanda/"
    },
    {
        "id": "1m3b2w6",
        "author": "Ok_Foot3291",
        "title": "Looking for theatre/acting workshops in Turin",
        "content": "Hi! I’m moving to Turin soon to study at the University of Turin and I’m really interested in joining a theatre or an acting workshop. I don’t speak Italian yet, so I’m hoping to find something that’s either in English or beginner friendly.\n\nIf anyone knows any groups, schools, or student clubs that would be open to foreigners, I’d love your suggestions :)\n\nCiao! Mi trasferirò presto a Torino per studiare all’Università di Torino e mi piacerebbe molto partecipare a un corso di teatro o recitazione.\n\nNon parlo ancora italiano, quindi sto cercando qualcosa che sia in inglese o comunque adatto anche a chi non parla bene la lingua.\n\nSe conoscete gruppi, scuole o club aperti a stranieri, vi sarei davvero grato per i consigli :)",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1m3b2w6/looking_for_theatreacting_workshops_in_turin/"
    },
    {
        "id": "1m2xc7f",
        "author": "araic8991",
        "title": "Looking for a calm space in Torino",
        "content": "I’ll be moving to Torino as a woman, 26y.\nI struggle with sensory issues experienced cities in southern Europe to be quite overwhelming with the traffic, the noise and the dirtiness. I am now looking for 1. places to live and 2. places to spend my spare time.\n\nRegarding 1.: What areas would you recommend me living in? I don’t have a big income, so shouldn’t be super expensive but in a safe area. Am happy to live in a flat/house share. Bonus would be living in a green area, happy to live outside the city Center, but am flexible.\nI don’t have a car so I’d love to be able to cycle (preferably with good bike lanes) to Porta nuova in 40min or less.\n\nRegarding 2: Looking for places to hang out in the city or things to do on the weekend.\nI love nature, hiking, swimming in lakes and am looking for underrated or quiet parks and cafes in Turin away from roads and day-hikes off the beaten path.\n\nI’m really looking forward to hearing your suggestions, it feels like an impossible task to find these things through my own research!\n",
        "upvotes": 10,
        "comments": 31,
        "media": null,
        "permalink": "/r/torino/comments/1m2xc7f/looking_for_a_calm_space_in_torino/"
    },
    {
        "id": "1m2w570",
        "author": "Ok-Discipline-1977",
        "title": "Help with Virtual Reality Headset",
        "content": "Ciao,\n\nSono a Torino, ma sto seguendo a distanza un progetto per la mia università negli Stati Uniti. Avrei bisogno di accedere a un visore Oculus Quest (Meta Quest) per testare il mio codice  \n\n\n[Virtual Reality headsets \\(Meta Quest 3 and 3s\\)](https://preview.redd.it/gxq1wqpm6ldf1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=1d55b565ba4fcc1f3073a9ac719a8e4c6c74d620)\n\nNon ho portato in valigia quelli della mia università, ma solo quelli di un dipartimento universitario, di uno spazio creativo o di una biblioteca che mi permettessero di usare un visore per 30 minuti o un'ora.",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1m2w570/help_with_virtual_reality_headset/"
    },
    {
        "id": "1m2z8su",
        "author": "davivesp",
        "title": "Noleggio furgone?",
        "content": "Ciao, dovrei trasferire dei mobili, conoscete qualche servizio che affitti un qualche furgoncino tipo doblo? Mi serve per un paio di ore, mezza giornata al massimo.\nEnjoy non mi sembra che abbia più nessun doblo a Torino. ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1m2z8su/noleggio_furgone/"
    },
    {
        "id": "1m356gj",
        "author": "Whole_Discipline_270",
        "title": "Hi can you help me to identify the authenticity of this palace x Juventus shirt please",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1m356gj/hi_can_you_help_me_to_identify_the_authenticity/"
    },
    {
        "id": "1m2oqjs",
        "author": "Zestyclose-Tank9125",
        "title": "EDISU",
        "content": "Ciao a tutti!\nL’anno prossimo studierò all’UniTo e ho intenzione di richiedere la borsa di studio EDISU Piemonte, principalmente per l’alloggio in una delle residenze studentesche.\n\nHo una domanda: visto che non vengo dall'Italia, mia madre verrà con me i primi giorni per aiutarmi ad ambientarmi. Mi chiedevo se nelle residenze studentesche ci sono stanze per gli ospiti disponibili per situazioni del genere e se sì, come richiederne una.\n\nSo che è ancora presto, ma visto che vivo all'estero ho bisogno di pianificare tutto con largo anticipo.\nGrazie in anticipo per qualsiasi aiuto o consiglio!",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1m2oqjs/edisu/"
    },
    {
        "id": "1m2kl08",
        "author": "sylvieatica",
        "title": "Linee tram",
        "content": "Ciao a tutti, sto cercando casa a Torino (sia affitto che vendita) e dato che i prezzi delle case vicine alla linea metro (corso Francia) sono un po' più alti del mio budget stavo valutando la zona intorno a corso agnelli e corso unione sovietica, dove ho visto che passano le linee dei tram che portano in centro. Il mio dubbio è: le linee tram sono effettivamente comode? Capitano spesso ritardi? Ogni quanto passano le corse? Rispetto alla metro hanno effettivamente meno vantaggi?",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1m2kl08/linee_tram/"
    },
    {
        "id": "1m2zzyh",
        "author": "Avia_Vik",
        "title": "Property prices in Torino for investment",
        "content": "Buongiorno a tutti. I have been thinking about investing in property by buying an apartment in Torino and I have realised that property prices are much lower than in other cities in Italy and outside of it. I struggle to understand what is the reason for it, I always thought that Torino is one of Italy's richest and wealthiest cities but it turns out there are 70m² apartments for 50k € which is insane for such a city. How come a city with such a good university, large population, good location, pretty high development level and just one of Italy's largest and most popular cities is so cheap property-wise? Cheap prices make it attractive to buy property there but is there any potential that prices will return to where they should be at, to a level of other Italian cities at least?\n\nAll explanations will be appreciated. Grazie per il vostro aiuto, saluti da Nizza :) ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1m2zzyh/property_prices_in_torino_for_investment/"
    },
    {
        "id": "1m28n32",
        "author": "Small-Basis-502",
        "title": "Trovare casa a Torino (da non studente) - come evitare gli scam?",
        "content": "Ciao a tutti!\n\nSono un designer e vorrei trasferirmi a Torino in un monolocale/bilocale. \n\nSto cercando su idealista, [casa.it](http://casa.it) e immobiliare, ma sembra che gli annunci decenti provengono da poche agenzie, che quando provi a contattarle o non rispondono oppure ti dicono dei fantomatici 250 euro per la lista. \n\nA una di queste io gli ho chiesto \"ma se non fossi interessato al servizio e volessi solo visitare la casa di questo annuncio?\" mi ha risposto che non ci sarebbe stato alcun problema, di venire in sede e controllare la disponibilità. Ma mi dovrei fidare anche senza pagare il servizio che è un palese scam? Anche perchè, al volo ho utilizzato la ricerca per immagine e alcuni annunci utilizzano stesse immagini ma con vie, descrizioni e prezzi diversi, il che mi insospettisce.\n\nE se in conclusione questi sono scam, come si fa a trovare veramente una casa? Mi hanno consigliato i gruppi facebook e telegram, ma sono quasi tutti stanze per studenti.\n\nGrazie in anticipo a tutti! ",
        "upvotes": 7,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1m28n32/trovare_casa_a_torino_da_non_studente_come/"
    },
    {
        "id": "1m2aofj",
        "author": "Strange-Inflation689",
        "title": "hi i am planning to start my masters degree in torino this fall and was wondering what's it's like to live in torino as an international queer person. is there a big lgbt+ community? what's the public treatment to same sex relationships",
        "content": "",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1m2aofj/hi_i_am_planning_to_start_my_masters_degree_in/"
    },
    {
        "id": "1m2glzs",
        "author": "dubastian25",
        "title": "White Moon club",
        "content": "How is the white moon club in Torino? Is it worth it? I have to say we are tourists and we ‘d like to get into the partying vibe of the city. If it’s not a good option, what would u recommend? Thank you!",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1m2glzs/white_moon_club/"
    },
    {
        "id": "1m26m40",
        "author": "Ibrahimt51",
        "title": "Turin to Marseille",
        "content": "Hey ya'll, what's the fastest and cheapest way to get from Torino to Marseille in France? I looked at flixbus and they take a lot of time, same thing for train, any alternative ways? ",
        "upvotes": 3,
        "comments": 26,
        "media": null,
        "permalink": "/r/torino/comments/1m26m40/turin_to_marseille/"
    },
    {
        "id": "1m21izh",
        "author": "Parmesean_Lover",
        "title": "Torino to Paris",
        "content": "Hi dear Piemontes!\n\nAny advice for travelling to Paris in September/October by plane or trains?\n\nAnd how good is TGV Oui Torino to Paris experience?\n\nMany thanks!",
        "upvotes": 6,
        "comments": 17,
        "media": null,
        "permalink": "/r/torino/comments/1m21izh/torino_to_paris/"
    },
    {
        "id": "1m28r8w",
        "author": "snor09",
        "title": "Officina moto affidabile",
        "content": "Ciao a tutti concittadini bikers e non. Come da titolo cerco un'officina moto affidabile in città. \nVorrei fare delle modifiche alla moto (manopole, easyblock, scarico etc.) e vorrei trovare un posto serio per la mia due ruote che non mi dia tempi biblici per prenotare e mi faccia trovare sorprese sulla moto.",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1m28r8w/officina_moto_affidabile/"
    },
    {
        "id": "1m2bvz8",
        "author": "Vegetable-Goat6310",
        "title": "is PoliTo worth it?",
        "content": "Sto pianificando di fare domanda al Politecnico di Torino per una laurea triennale (in Informatica o Ingegneria Aerospaziale) come studente indiano. Ho preparato alcune domande rapide a cui mi piacerebbe ricevere risposta da studenti attuali o passati:  \n  \nUn buon punteggio SAT può aiutare con l’ammissione, oppure considerano principalmente i voti del diploma?  \n  \nCome funziona la borsa di studio EDISU e quali documenti sono solitamente richiesti?  \n  \nL’EDISU è disponibile per studenti internazionali del primo anno provenienti dall’India?  \n  \nQuanto è importante l’ISEE Parificato per la borsa e quanto è difficile ottenerlo dall’India?  \n  \nÈ possibile conciliare un lavoro part-time con le lezioni al Polito?  \n  \nCom’è in generale la vita da studente al Polito e a Torino?  \n  \nLe persone all’università e in città parlano inglese?  \n  \nConsiglieresti il Polito a uno studente indiano laborioso che punta a una carriera nella tecnologia o nell’aerospaziale?  \n  \nCi sono errori comuni che gli studenti internazionali commettono durante la domanda o l’adattamento che dovrei evitare?  \n  \nApprezzo molto il vostro aiuto — anche intuizioni personali o approssimative sarebbero davvero utili!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1m2bvz8/is_polito_worth_it/"
    },
    {
        "id": "1m2bpgb",
        "author": "Vegetable-Goat6310",
        "title": "Is PoliTo worth it",
        "content": "I’m planning to apply to Polito for a Bachelor's (either Computer Science or Aerospace) as an Indian student. I’ve put together a few quick questions I'd love to get answers for from current or past students:  \n  \nCan a good SAT score help with admission, or do they mostly consider board exam marks?  \n  \nHow does the EDISU scholarship work, and what documents are usually required?  \n  \nIs EDISU available for first-year international students from India?  \n  \nHow important is the ISEE Parificato for the scholarship, and how hard is it to get it done from India?  \n  \nIs it possible to balance part-time work with classes at Polito?  \n  \nWhat’s the general student life like at Polito and in Turin?  \n  \nDo people at the university and around the city speak English?  \n  \nWould you recommend Polito to a hardworking Indian student aiming for a career in tech or aerospace?  \n  \nAre there any common mistakes international students make when applying or settling in that I should avoid?  \n  \nReally appreciate your help — even rough or personal insights would go a long way!",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1m2bpgb/is_polito_worth_it/"
    }
]