[
    {
        "id": "1i0biuo",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 13,
        "comments": 1208,
        "media": null,
        "permalink": "/r/realmadrid/comments/1i0biuo/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1i1j6zl",
        "author": "dark4403",
        "title": "Rudiger has injured his knee",
        "content": "According to Mario Cortegana, Rüdiger has discomfort in one of his knees, a circumstance that may be due to the enormous load of games and minutes. The German adds 2,527 so far this season (93.5% of the minutes of the season) and is the second footballer with the most minutes only surpassed by Valverde (93.9%)",
        "upvotes": 247,
        "comments": 116,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xpFYVlVn-RdTlsiL1sw0PMDohp7Vzrig2ViZIpIpwds.jpg?auto=webp&amp;s=f0cb851a13ea1d2d71642ade72bf04a1951516fe"
        },
        "permalink": "/r/realmadrid/comments/1i1j6zl/rudiger_has_injured_his_knee/"
    },
    {
        "id": "1i151ev",
        "author": "dark4403",
        "title": "We need to talk about Vinicius",
        "content": "",
        "upvotes": 1097,
        "comments": 270,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/o9esfgcicyce1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1i151ev/we_need_to_talk_about_vinicius/"
    },
    {
        "id": "1i13wrt",
        "author": "Damned_chicken",
        "title": "Carlo in every match",
        "content": "",
        "upvotes": 1043,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/z46zkiri1yce1.jpeg?auto=webp&amp;s=4de117526f9b7090bce5fa4d1a2defe0e1f92293"
        },
        "permalink": "/r/realmadrid/comments/1i13wrt/carlo_in_every_match/"
    },
    {
        "id": "1i1oapd",
        "author": "Moreplatesmoregains",
        "title": "Aren’t we missing someone like my man JOSELU",
        "content": "I know our problem now is more the defence not the attack. But someone like joselu is needed in these times when you need a goal from a header or any cross a real pure striker. We don’t have that endrick can be a very good player but he can’t add ao much when teams are parking the buss in the last minutes of the game. I think we need to fix our defence first but also a supersub striker who is not 5’5 and can head a ball is needed.",
        "upvotes": 50,
        "comments": 15,
        "media": null,
        "permalink": "/r/realmadrid/comments/1i1oapd/arent_we_missing_someone_like_my_man_joselu/"
    },
    {
        "id": "1i1got5",
        "author": "dark4403",
        "title": "Alphonso Davies doubts, not satisfied with Bayern's renewal offer.",
        "content": "",
        "upvotes": 118,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8OmuyfLVhXv6KvnReSdQhRi8U73fqszBdEBAqFlZRJU.jpg?auto=webp&amp;s=806541f5a4339ef0cea4a938f4126148dd947733"
        },
        "permalink": "/r/realmadrid/comments/1i1got5/alphonso_davies_doubts_not_satisfied_with_bayerns/"
    },
    {
        "id": "1i1ilf0",
        "author": "blueXwho",
        "title": "Ancelotti may be wrong, but he's certainly not a dummy coach",
        "content": "I understand people are angry, especially after that terrible Clásico, but people need to stop talking nonsense. There's no way a manager is hired and is successful in top elite teams, winning more UCL than any other manager in history, and not know tactics.\n\nYou might not like them, you might want a Guardiola or Cholo just yelling the whole game, micromanaging the team (for real or for show), but that doesn't mean Ancelotti doesn't analyze the game.\n\nThis season, there's a clear disconnect between what's needed and what happens on the field. There are many possible reasons:\n1. the team is unbalanced after Kroos departure and the injuries, without proper signings\n2. the team is exhausted\n3. the team has no motivation after winning big last season\n4. too many players out of their natural position\n\nYes; 1, 3, and 4 are mostly the manager's fault. We know Ancelotti is stubborn, he has an idea and won't change it, especially mid-game. That's why he doesn't make subs until we're behind and why he has the team playing low block the first half, slowing down the game. But it has worked for him, so he won't change his ways.\n\nHe's totally able to change the tactical scheme, but he rarely does it during the game. He studies the rivals and makes mistakes, but this season those mistakes outweigh the good choices.\n\nThis is probably the end of his cycle, we might get Xabi Alonso, whose style is more direct and fast-paced, but that's doesn't mean he's just a grandpa Florentino Pérez hired so he is told who you play, that's simply not true. His colleagues and former players can attest to that.",
        "upvotes": 72,
        "comments": 65,
        "media": null,
        "permalink": "/r/realmadrid/comments/1i1ilf0/ancelotti_may_be_wrong_but_hes_certainly_not_a/"
    },
    {
        "id": "1i1elbz",
        "author": "PlantComprehensive77",
        "title": "We played just as poorly last season as we are now",
        "content": "Some of the revisionism I'm seeing on this sub lately is crazy, especially regarding the absence of Kroos. I love Kroos, and he played at a world-class level last season, but we still played shit football most of the time.\n\nIn the first half of the season, we had to rely on Bellingham turning into prime CR7 to squeeze past the likes of Celta Vigo, Getafe, Union Berlin, etc. We were bailed out by set piece goals against bottom teams like Deportivo Alaves and Mallorca. \n\nDon't get me started on our run in the CL knockout stages. We were comprehensively outplayed in every single match, apart from the 2nd leg against Bayern. Fucking RB Leipzig could have scored 8 goals against us if it wasn't for Sesko shooting like a donkey and Lunin turning into god. If Leipzig knocked us out in the RO16, all of a sudden last season looks a lot worse.\n\nNo wonder we're struggling this season. Last year we had Kroos playing like he's 20 years younger, Bellingham having one of the greatest debut seasons ever, and Vinicius putting up Ballon D'or performances, and yet we still played fugazi football most of the time, especially against big teams. The issue isn't the individual players (apart from Vasquez and Tchouameni), it's Ancelotti's non-existent tactics and an unbalanced squad ",
        "upvotes": 106,
        "comments": 73,
        "media": null,
        "permalink": "/r/realmadrid/comments/1i1elbz/we_played_just_as_poorly_last_season_as_we_are_now/"
    },
    {
        "id": "1i0w63t",
        "author": "Damned_chicken",
        "title": "miss him already man ",
        "content": "",
        "upvotes": 1475,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1qnq2pcjivce1.jpeg?auto=webp&amp;s=861b71e7e5e368fda695e333157e686d15055b28"
        },
        "permalink": "/r/realmadrid/comments/1i0w63t/miss_him_already_man/"
    },
    {
        "id": "1i1sr7b",
        "author": "Frustatedketa",
        "title": "Who can be the best choice for a defender?",
        "content": "While talking about how lame is our defense system. We all can be sure that our club will buy a new Rb a defender and possibly also a Cb. So who can be the possible target and suits for the club ? The rumours are widespread with Trent Alexander Arnold from Liverpool but I think we will ruin our club more than the current state. Dude doesn't know how to defend , he makes numerous mistakes from which Virgil Van Djik Always remains frustrated. So what you guy's think ? Except TAA who can be the better target for real Madrid ?",
        "upvotes": 6,
        "comments": 11,
        "media": null,
        "permalink": "/r/realmadrid/comments/1i1sr7b/who_can_be_the_best_choice_for_a_defender/"
    },
    {
        "id": "1i1c37s",
        "author": "Nikhil__1012",
        "title": "What goes through the mind of Florentino Perez.?",
        "content": "Like everyone knows how his idea of “the galacticos” failed back in 2002 .. the sole reason being not spending on defense.. we got a generational defense in carvajal ramos pepe varane and marcelo.. but now looking at the state of defense .. like every team literally every team is reinforcing.. it’s not as if we are out of funds or something..like what’s the deal man..? We were interested in yoro.. and we offered lille 15 million.? Like i am genuinely confused what is actually the transfer strategy here man.? We still have the entirety of the jan transfer window.. can still sign a defender and heck trust our own academy players for once.. i dont recognise my club anymore dawg..",
        "upvotes": 78,
        "comments": 71,
        "media": null,
        "permalink": "/r/realmadrid/comments/1i1c37s/what_goes_through_the_mind_of_florentino_perez/"
    },
    {
        "id": "1i0xmf8",
        "author": "Henry-Doe",
        "title": "The German Sniper: You can try to replace him, but you can never replicate him.",
        "content": "",
        "upvotes": 899,
        "comments": 20,
        "media": null,
        "permalink": "/r/realmadrid/comments/1i0xmf8/the_german_sniper_you_can_try_to_replace_him_but/"
    },
    {
        "id": "1i130z2",
        "author": "AestheticEvan23",
        "title": "Kylian Mbappé vs Barcelona in the super Copa de España ",
        "content": "",
        "upvotes": 279,
        "comments": 31,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/njx2ogkbqxce1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1i130z2/kylian_mbappé_vs_barcelona_in_the_super_copa_de/"
    },
    {
        "id": "1i1sg0h",
        "author": "GuestZealousideal228",
        "title": "We are a deeply unserious club if we don't sign a defender",
        "content": "Second humiliation against Barca this season &amp; still no talk of a defensive signing. I don't get it, our board watched us get absolutely HAMMERED at HOME &amp; they still persist with not signing a defender. If the previous Classico wasn't proof enough, there's the Milan game, our board were negligent for not signing a defender after Militao tore his ACL, I wonder what they thought would happen going into the season with Rudiger, Militao &amp; Tchouameni (I know I know). We deserve to go trophyless (y'know what I mean) if we don't learn from these losses.",
        "upvotes": 3,
        "comments": 15,
        "media": null,
        "permalink": "/r/realmadrid/comments/1i1sg0h/we_are_a_deeply_unserious_club_if_we_dont_sign_a/"
    },
    {
        "id": "1i12e6v",
        "author": "Nyghl",
        "title": "LaLiga YT Channel Made A \"The BEST of ARDA GÜLER | 2024\" Video",
        "content": "",
        "upvotes": 162,
        "comments": 11,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/duxi4ihyhxce1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1i12e6v/laliga_yt_channel_made_a_the_best_of_arda_güler/"
    },
    {
        "id": "1i1hl5z",
        "author": "ManuMora98",
        "title": "[Basket] We begin the week with a scoring spectacle, 116-113 against Maccabi without extra time to get our 6th consecutive win in Euroleague.",
        "content": "",
        "upvotes": 12,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7jKR4D-BBPMoFonsUSJKO8r-7oOo0lWoe0O-XtAmmRA.jpg?auto=webp&amp;s=32586a9b0deb9d54326071027c8e667c451edfda"
        },
        "permalink": "/r/realmadrid/comments/1i1hl5z/basket_we_begin_the_week_with_a_scoring_spectacle/"
    },
    {
        "id": "1i0vpr4",
        "author": "Damned_chicken",
        "title": "Yea our defence is so gone man",
        "content": "",
        "upvotes": 384,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ldx6e7jeevce1.jpeg?auto=webp&amp;s=b770026f351ded81080f85685e6dfdbea63688d1"
        },
        "permalink": "/r/realmadrid/comments/1i0vpr4/yea_our_defence_is_so_gone_man/"
    },
    {
        "id": "1i12n0n",
        "author": "sntqst2",
        "title": "Real Madrid are a poorly constructed squad? ",
        "content": "3 left-wingers up front only to finish the game with Rudiger as CF when we have a 40m Euro CF on the bench whom we clearly don’t rate in reality\n\nThe injury crisis is unforeseeable but Carvajal hadn’t had a credible back-up in years. His injury came in the last seconds of a game where he was one of FOUR Real Madrid fullbacks (if we count Lucas) on the field?\n\n80m for Tchouameni is 80m that we might aswell have invested in a celebrity crypto coin. \n\nWe have 2 DMs that do not want to be strict, screening DMs, but cannot direct play from deep either. Our entire palate of young/new midfielders offers combined 0 control/retention or dictation of play. \n\nWe are starting 4 vertical runners every match\n\nNacho and Marin were allowed to leave despite not having Alaba back (and he was poor anyway tbh) and Militao’s health being uncertain. Even Rudiger isn’t getting any younger and there is no breakthrough CB unless we count Ascensio who wasn’t even seem as Castilla’s best CB prospect.\n\nWe like to think we are so “well ran” but honestly if PSG or Chelsea was doing all this we’d rightly sneer at them. This is such a poorly constructed squad. \n\nEDIT: at risk of persecution here: I don’t rate Eder Militao *AT ALL* even before ACLs. His catalogue of ELGs and own-goals is EXTRAORDINARY. Like how is he getting away with this? Catastrophic defender. Another 50m we should have given to Ronaldinho’s cypto coin instead. Also signing Rudiger when we have Militao means our defence will have a “double aggressor” pairing leading to dangerous step-ups/disrupted line. Again poor construction. Love Rudiger though tbh.",
        "upvotes": 90,
        "comments": 47,
        "media": null,
        "permalink": "/r/realmadrid/comments/1i12n0n/real_madrid_are_a_poorly_constructed_squad/"
    },
    {
        "id": "1i175bs",
        "author": "Ubbe_04",
        "title": "Our team lacks playmaker and its not even a debate",
        "content": "I'm going to get straight to the point: yes, I accept that our defense is lacking, but we also need to acknowledge that our midfield was effectively shut down. Bellingham disappeared during the game, and Valverde seemed to be running around just covering for Vazquez. Camavinga was put in a difficult position because he’s not someone you can rely on with the ball. \n\nI think Madrid needs to realize that we need a proper midfielder who is skilled with the ball and has great vision. I believe Odegaard could be the answer; I've been watching him since he joined Arsenal, and he has developed really well. He would fit into our team nicely. Additionally, we need a solid defensive option because Mendy is, as far as I know, out of the picture. This way, we can build our attacks from the right-back position with Alexander-Arnold.",
        "upvotes": 36,
        "comments": 119,
        "media": null,
        "permalink": "/r/realmadrid/comments/1i175bs/our_team_lacks_playmaker_and_its_not_even_a_debate/"
    },
    {
        "id": "1i1cfxp",
        "author": "KingDawg72-",
        "title": "So…. how do people post sports highlights without copyright? ",
        "content": "Yesterday, I received a warning notification for a copyrighted video where I screenshot Vinicius Jr scoring during a live Real Madrid game that I watched on my phone back on October 5, 2024. \n\nI don’t understand why that’s copyright, I just wanted to share a cool moment. And now I can’t even share sports highlights? \n\nMan… this is so not cool. ",
        "upvotes": 14,
        "comments": 11,
        "media": null,
        "permalink": "/r/realmadrid/comments/1i1cfxp/so_how_do_people_post_sports_highlights_without/"
    },
    {
        "id": "1i0obqb",
        "author": "Sir-Dickson",
        "title": "Look at Rudiger positioning when paired with Asencio",
        "content": "Saw this on X and have to agree. They compliment each other. Having a good defensive duo with chemistry is vital ",
        "upvotes": 488,
        "comments": 72,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/w7oivisuqtce1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1i0obqb/look_at_rudiger_positioning_when_paired_with/"
    },
    {
        "id": "1i0elvy",
        "author": "Fluffy_Position7837",
        "title": "Tragic seeing Modric like this, seems unnatural even.",
        "content": "",
        "upvotes": 1647,
        "comments": 144,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OneaCrHwuyZlke6iHt3Xmr-wEnGjCK3bt9R1t0YkoSA.jpg?auto=webp&amp;s=61a1efd62caea9d3800d8dd3673914f385d994f5"
        },
        "permalink": "/r/realmadrid/comments/1i0elvy/tragic_seeing_modric_like_this_seems_unnatural/"
    },
    {
        "id": "1i0ithz",
        "author": "Total_Escape_9778",
        "title": "Mbappe after the supercopa de espana final yesterday...",
        "content": "",
        "upvotes": 857,
        "comments": 84,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/r2falo3gmsce1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1i0ithz/mbappe_after_the_supercopa_de_espana_final/"
    },
    {
        "id": "1i1jply",
        "author": "Ok_Seaweed_9452",
        "title": "Defense is the problem but offense isn't without problem",
        "content": "So I keep seeing we need to strengthen RB or anywhere on our defense which is where we get abused by decent opponent. But I expect with lineup name like Vinicius, Mbappe, Bellingham, Rodrigo , Valverde and so on we should not have trouble scoring. But on the last 2 classic we can't even lose 3-5 or like 3-4 on the first leg. Not a lot of shoot on goal as well. Does fixing the defense gonna make the offense better? Looks like the direction we are going is offense minded defender like TAA, Davies. I still think we need more direction than just completely using the star power to carry the game.. Thoughts? ",
        "upvotes": 3,
        "comments": 15,
        "media": null,
        "permalink": "/r/realmadrid/comments/1i1jply/defense_is_the_problem_but_offense_isnt_without/"
    },
    {
        "id": "1i1bcib",
        "author": "Domesticated_Cum",
        "title": "Going on a tangent about Real Madrid playstyle (or lack thereof).",
        "content": "Before I start, my ball knowledge is that of a fan. This is just a quick rant around how the team have been \"playing\" this season (and somewhat last season but we had Kroos). Feel free to bully this in the comments.\n\nI don't like the long balls. I just don't.\n\nReal Madrid looks clueless. Sending long balls that get intercepted and end in opposite team posession. How can you play long balls without pressing? \n\nI blame Ancelotti for not addressing this. His reliance on individual player brilliance is a little bit imbalanced and whenever these players don't perform we end up having a VERY bad game. The lack of alternative build ups, midfield ball carry structure, and quick ball recovery/pressure are very apparent vs good teams and, as of January 2025, have not been addressed.\n\nLong balls are okay, even encouraged when you have dangerous forward players (Arguably 2 best LWs in the world rn), but need to be followed with high press to recover the ball in opposition side. Instead, we send a long ball, it gets headed back by their defence....And lands in a Barca player's feet as our team is trailing back to defend lower...\n\nFlick's approach with the high line actually did fix Barcelona's defence issues for a while. If you want to play with your forwards, then go ALL IN! Win second balls and keep the pressure up. Having huge space between your target forwards and midfield/defence is just inviting teams like Barcelona to completely dominate you.\n\nI always wanted to see Real Madrid with 3 defenders high line. Stack your midfield with wide midfield players that can cover on defense, but most importantly, fight for second balls and apply pressure to the midfield. Camavinga and Valverde can both fill these roles as wide midfielders and we would have an additional opening to play in the midfield where someone like Cebaillos can be a great addition.\n\nCamavinga and Valverde both showed proffeciency in defending wide, they both played as LB/RB respectively, and did good given the circumstances. These \"expirements\" can be expanded on, I see Valverde and Camavinga as greate potential wide midfielders, combining their exquisite ball carry, vision and passing, as well as their defensive abilities. This will allow us to play more aggresively, defend higher, and generally win more balls.\n\nNow I know there is no way in hell this happens. But I would love to see Real Madrid playing with 3-4-3.\n\nLine up would look like this:\n\nCourtois\n\nTchouameni, Rudiger, Ascensio\n\nValverde, Cebaillos, bellingham, Cammavinga\n\nRodrygo, Mbappe, Vinicius\n\n  \nTl;dr: We suck at pressing. We need to press. Here is my line up to press.",
        "upvotes": 7,
        "comments": 13,
        "media": null,
        "permalink": "/r/realmadrid/comments/1i1bcib/going_on_a_tangent_about_real_madrid_playstyle_or/"
    },
    {
        "id": "1i0gg49",
        "author": "dark4403",
        "title": "Ancelotti asks Florentino for signings",
        "content": "",
        "upvotes": 407,
        "comments": 184,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/I79umgfCcm7_UegkHgY9nQcsUmNZur4RGiIJh7Wv9k0.jpg?auto=webp&amp;s=5c21fc10cee767903d24d46206aa4ec538931cc9"
        },
        "permalink": "/r/realmadrid/comments/1i0gg49/ancelotti_asks_florentino_for_signings/"
    },
    {
        "id": "1i0im9s",
        "author": "sntqst2",
        "title": "People talking about Tchouameni not being a good CB?",
        "content": "Lets not forget that he’s also pretty bad CM and DM. I just don’t see a Real Madrid level player in him, and I do not see a Real Madrid personality either.\n\nHe doesn’t cover enough ground, he isn’t secure enough in possession, he’s slow. He’s error-prone and he engages in what I always call “half measures” when completing defensive actions in midfield. \n\nHe also comes across as just lazy and complacent all-round tbf?\n\nI can’t be the only one who really thinks it’s tome we found a buyer? Let this goofer-offer be* PSG or Chelsea’s problem. They have a sporting culture more like his.\n\nEDIT: forgot to mention recurring communication problems with Rudiger when at CB, and with Fede when in midfield. He is the common denominator.",
        "upvotes": 289,
        "comments": 162,
        "media": null,
        "permalink": "/r/realmadrid/comments/1i0im9s/people_talking_about_tchouameni_not_being_a_good/"
    },
    {
        "id": "1i0w39x",
        "author": "Damned_chicken",
        "title": "Comeback eyebrow our last hope",
        "content": "",
        "upvotes": 37,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/98zlzj4phvce1.jpeg?auto=webp&amp;s=6209bf1274bb87bf1fd83479e431412d11e1ffce"
        },
        "permalink": "/r/realmadrid/comments/1i0w39x/comeback_eyebrow_our_last_hope/"
    },
    {
        "id": "1i0pm5v",
        "author": "Nyghl",
        "title": "I'm sick of people that downplays our poor form.",
        "content": "Especially with the excuses like \"We were gassed\", \"We are in a transition\", \"broo it is what it is, who cares\" etc. and criticizing/ostracizing other Real Madrid fans.\n\nWe care, as Madridistas and it is called having STANDARDS and being a big club. It is a about always wanting to achieve great things.\n\nThis is not a run of the mill club where there are low expectations. This is the biggest club in the world, with players that earn the most money and if you don't want to have standards and high expectations, why are you here? There are thousands of small to mid clubs around the world. And if you love Real Madrid for something else and want to be a Madridista for your own reason, you are welcome but please at least don't try to change our winning culture.\n\nBy the way I am not saying we should panic but who is panicking anyways? This is not panic, this is being passionate and wanting the best, expecting the best. This season, we were FAR from being the best in most major matches. We didn't even get close.\n\nLike I can't fathom my head around how some fans think of Madrid. Where is your fire to stay as the biggest and the better club? Why should Real Madrid ever be content with frequently losing or playing inferior while we have one of the best squads, resources, culture and a heritage in the world?\n\nLike how did we get into a point in this subreddit where if you want the best for Madrid, you looked upon as a weirdo or a doomer?\n\nEdit: I see misunderstandings such as \"You guys can't accept a loss\" and I want to clarify that it isn't about losing games but **how** we lost them. I am %99 sure that people wouldn't be that upset if we played better, put up a fight and still lost. Because losses can and WILL happen, that's a reality but it's how you play and show your character while losing, not going below your standards. One day offs are also okay but it shouldn't come from a systemic error. It is also not this one game and final, we haven't been putting a fight for the most major matches this season.\n\nWe are not putting high standards to our \"winning streak\", we are putting it on how we play and fight. Win or lose, that's just fate but how you win and lose, that can be concerning.\n\nWe grow from these, always do but not via turning a blind eye to how we play. Hala Madrid!",
        "upvotes": 96,
        "comments": 92,
        "media": null,
        "permalink": "/r/realmadrid/comments/1i0pm5v/im_sick_of_people_that_downplays_our_poor_form/"
    },
    {
        "id": "1i0mblj",
        "author": "chui77",
        "title": "[Post Match Survey Results] Real Madrid 2-5 Barcelona",
        "content": "",
        "upvotes": 119,
        "comments": 28,
        "media": null,
        "permalink": "/r/realmadrid/comments/1i0mblj/post_match_survey_results_real_madrid_25_barcelona/"
    },
    {
        "id": "1hzx57e",
        "author": "Disastrous-Basket-71",
        "title": "This was the worst performance in the last 5 years",
        "content": "",
        "upvotes": 6769,
        "comments": 264,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ihn5uknjpmce1.png?auto=webp&amp;s=78a629a79c0cd78a2a945680812a2ce90ed6f455"
        },
        "permalink": "/r/realmadrid/comments/1hzx57e/this_was_the_worst_performance_in_the_last_5_years/"
    }
]