[
    {
        "id": "1lzl8ai",
        "author": "OxyMoronsAMA",
        "title": "Hey r/movies! I'm Sarah Cayce, the director of the new, raunchy, unapologetic, crime-action-comedy Oxy Morons. I'm joined by cast member Jeremy Holm. We're excited to be here to discuss the film and answer your questions. Ask us anything!",
        "content": "Hey [r/movies](https://www.reddit.com/r/movies/)! I'm Sarah Cayce, the director of the new, raunchy, unapologetic, crime-action-comedy Oxy Morons. I'm joined by cast member Jeremy Holm. We're excited to be here to discuss the film and answer your questions. Ask us anything!\n\nHere's our trailer:\n\n[https://www.youtube.com/watch?v=WPOdTwvSlUE&amp;pp=0gcJCfwAo7VqN5tD](https://www.youtube.com/watch?v=WPOdTwvSlUE&amp;pp=0gcJCfwAo7VqN5tD)\n\nSynopsis:\n\nA nobody and a crew of underachievers hatch a half-baked plan to strike it rich by out hustling a large pharmaceutical company at their own game.\n\nIt's now out on digital.\n\nCo-star Jeremy Sumpter is also doing an AMA today here:\n\n[https://www.reddit.com/r/movies/comments/1lyzknn/hey\\_rmovies\\_im\\_jeremy\\_sumpter\\_you\\_might\\_know\\_me/](https://www.reddit.com/r/movies/comments/1lyzknn/hey_rmovies_im_jeremy_sumpter_you_might_know_me/)\n\nWe'll be back at 5 PM ET today to answer questions. Ask us anything!",
        "upvotes": 0,
        "comments": 56,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ydsr168v3ucf1.png?auto=webp&amp;s=fa76310d955e7060d6650d1f5070eaa244fd628f"
        },
        "permalink": "/r/movies/comments/1lzl8ai/hey_rmovies_im_sarah_cayce_the_director_of_the/"
    },
    {
        "id": "1lzzv2c",
        "author": "SanderSo47",
        "title": "July 11-13 Box Office Recap – 'Superman' flies to a great $125M debut domestically. However, it debuts with just $95M overseas, which is below expectations. 'Jurassic World Rebirth' crosses $500M worldwide, and 'F1' reaches almost $400M worldwide.",
        "content": "https://preview.redd.it/p5azvgxfvwcf1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=5c78ecb39aba431a678658665331a79bdb4c9e7d\n\nYears in the making, the new DCU officially made its way to theaters.\n\n***Superman*** flew as high as possible, delivering a pretty great debut domestically. But overseas tells another story; it was below expectations, and suggests America will have to do the heavy lifting.\n\nThe Top 10 earned a combined $195.6 million this weekend. That's up a massive 66% from last year, when ***Despicable Me 4*** stayed at #1, and ***Longlegs*** over-performed projections.\n\nDebuting at #1, ***Superman*** earned a pretty great $125 million in 4,135 theaters. That number is simlar to ***Man of Steel***, which debuted with $116 million back in 2013 (although it earned an additional $12 million from early Wal-Mart screenings). It's also James Gunn's second biggest debut as director, behind ***Guardians of the Galaxy Vol. 2*** ($146 million). The debut is also among the strongest for DC; it's the seventh best debut for a DC film, and it's also the first to open to $100+ million since ***The Batman*** ($134 million). \n\nThis is a very strong debut for DC, as the brand has taken a huge dive at the box office. The DCEU had an incredibly poor run in its last years, with their last 8 films all flopping at the box office. That's an astonishingly horrible record, and the inconsistent run is what led to the current DC Universe. Sure, ***The Batman*** was a hit, but it's still an Elseworld film that won't change plans in the DCU. \n\nFor quite some time, Warner Bros. heavily backed ***Superman***, emphasizing James Gunn's involvement as writer and director. Now, the general audience doesn't really pay attention to directors outside some like Christopher Nolan, Steven Spielberg, James Cameron, Quentin Tarantino, etc. They might not know who Gunn is, but his quality track record is what gave WB confidence in ***Superman***'s prospects.\n\nWB bet high on the film's marketing. [The Hollywood Reporter said](https://www.hollywoodreporter.com/movies/movie-news/mission-impossible-jurassic-world-superman-box-office-summer-1236255949/) that WB could spend up to $200 million in marketing, which is insanely high even for a blockbuster. When the first trailer debuted in December 2024, it was viewed by 250 million viewers within 24 hours, a record for DC. Obviously, that didn't pan out to the absolute best debut for them, but it was still a sign of high interest. All the trailers highlighted the dazzling action sequences, Superman's iconic characterization, and Krypto's involvement (with the latter going viral on social media). And finally, Gunn delivered the quality: it's sitting at 83% on RT.\n\nNow obviously, there's the question: could it have debuted higher? Perhaps, yeah. But as mentioned, DC's brand is at an all-time low and they're currently struggling to gain good will with the audience. ***Superman*** is the first step in building that good will. After all, the character has had very rough decades; the Christopher Reeve films fizzled out by the end, ***Superman Returns*** disappointed, and the DCEU Superman didn't fully connect with audiences.\n\nAccording to Warner Bros., 68% of the audience was male, and 66% was 35 and under. They gave it a solid \"A−\" on CinemaScore, which is actually the same grade as ***Man of Steel***, and below Gunn's ***Guardians of the Galaxy*** trilogy. That suggests word of mouth is good, but not incredible. It remains to be seen how it will be impacted by the arrival of ***The Fantastic Four: First Steps*** in two weeks. But for now, ***Superman*** should easily cross the $300 million milestone. This is a very good way to start the DCU, at least domestically (we'll get to the overseas performance in a moment).\n\nIn second place, ***Jurassic World: Rebirth*** earned $40.3 million this weekend. That's a rough 57% drop, although considering how high ***Superman*** opened and its weak word of mouth (\"B\" on CinemaScore), it could've been worse.\n\n***F1*** dropped 49%, grossing $13 million. Not a bad drop, considering it lost IMAX screens to ***Superman*** this weekend***, although it's still not holding as great as its strong word of mouth suggested. The film has amassed $136.2 million domestically, and it should cross $160 million by the end of its run.\n\nThrough 2 weekends, it has earned $232.4 million. For reference, it was ahead of ***Dominion*** on its first Sunday by $2 million, but it's now $18 million behind it (and that's with two full extra days). It's very likely that gap will continue getting bigger. Should definitely hit $300 million for now.\n\n***How to Train Your Dragon*** eased 30% and added $7.9 million this weekend. The film has earned $239.9 million, and it's set to close with around $255 million.\n\nIn fifth place, ***Elio*** eased just 30%, earning $4 million. That would be commendable, but considering its domestic total is a pretty brutal $63.8 million, there's not a lot to celebrate. Now let's see if ***Smurfs*** impacts it this week.\n\n***28 Years Later*** dropped 40%, grossing $2.7 million this weekend. The film has amassed $65.7 million so far, and it will finish with slightly close to $70 million.\n\n***Lilo &amp; Stitch*** added $2.7 million this weekend, which was just 31% off from last week. The film has earned $414.5 million so far.\n\n***Mission: Impossible – The Final Reckoning*** dropped 46% and earned $1.4 million this weekend. With $194 million domestically, it has officially cleared the 3x multiplier. It will pass ***Rogue Nation*** ($195 million) by next week, but it will close so damn close to $200 million domestically.\n\n***M3GAN 2.0*** is nearing the end of its run, and it's barely on its third weekend. It has fallen all the way to ninth place, dropping a poor 64% and making just $1.4 million this weekend. The film has made a poor $22.4 million, and it's set to finish with just $25 million domestically.\n\nRounding out the Top 10 was A24's ***Materialists***. It dropped 46%, earning $720,498 this weekend. The film's domestic total stands at $35.1 million, and it's nearing the end of its run.\n\n#**OVERSEAS**\n\nSo yes, ***Superman*** was off to a great start domestically. Overseas, however, is another story.\n\n***Superman*** debuted with $95 million overseas, for a $220 million worldwide debut. That's below the $100+ million projections, which is very perplexing. It was a mixed bag in the rest of the world. Its strongest debuts were in the UK ($9.8M) and Mexico ($8.8M), Australia ($5.3M), Brazil ($5.9M), and India ($3.8M), although they were expected to perform better. Europe was so-so: it had very soft debuts in France ($4.2M), Spain ($2.9M), and Italy ($2.5M). Asia was pretty much bad: it flopped with just $6.9M in China (amidst very poor word of mouth), $4.2M in South Korea, and Japan ($2.5M).\n\nThis is where things start to unravel. This is not a great start for the film. WB spent $225 million on the film, and it mounted a very extensive marketing campaign around the world. ***Superman*** is obviously considered more an American icon than a worldwide icon, but even ***Man of Steel*** made $670 million back in 2013, and overseas accounted for 56.6% of its gross. Where does ***Superman*** go from here? Well, clearly it's gonna be up to the domestic market to do the heavy lifting, cause word of mouth isn't strong outside America. It should hit $550 million worldwide, but it's unlikely it can clear $600 million. Hell, if word of mouth isn't strong, it can also miss $550 million. That wouldn't be good news for the film's extensive budget, and for the future of the DC Universe.\n\n***Jurassic World Dominion*** fell 51% overseas, earning $68.1 million, and its total is now $532 million worldwide. That's quite a bad drop, even with ***Superman***'s disappointing debut. The best markets are China ($62.7M), the UK ($26.4M), Mexico ($22.8M), Germany ($15.5M) and Australia ($12.6M). Only Japan is left for now, but based on other patterns, it should close its run with around $750 million worldwide.\n\n***F1*** was not affected in the slightest by ***Superman***. It dropped just 34% overseas for a $38.5 million weekend, taking its worldwide total to an incredible $393.4 million after just 3 weeks. The big story was China, where the film is enjoying extraordinary word of mouth. In the market, the film's third weekend was actually higher than its prior weekends, adding $8 million this weekend. The film's best markets are China ($35.8M), the UK ($21.6M), France ($17.7M), Mexico ($15.4M) and Australia ($13.1M). Based on these drops, the film is heading for over $500 million worldwide by the end of its run.\n\n***How to Train Your Dragon*** added $13 million, taking its worldwide total to $561 million. The best markets are China ($37.8M), Mexico ($35.1M), UK ($26.2M), Brazil ($19.1M) and France ($16.6M).\n\n***Lilo &amp; Stitch*** added $7 million, and its worldwide is now $994 million. The best markets are Mexico ($66.9M), the UK ($48.8M), France ($42M), Brazil ($37.2M) and Germany ($32.1M). By next week, it will cross the $1 billion milestone.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Karate Kid: Legends* | May/30 | Sony | $20,302,016 | $52,547,391 | $103,347,391 | $45M\n\n- Turns out no one was really interested in seeing a new ***Karate Kid*** movie in theaters. Sony's latest attempt, ***Legends*** has closed with a very underwhelming $52 million domestically and $103 million worldwide. The domestic total is below the 2010 version's opening weekend ($55.6M), and managed to finish below the first two films in the franchise. Worldwide, it's a colossal 71% drop from the 2010 film. Even with a $45 million budget, this is not really a success and it's even more disappointing considering the film was selling nostalgia by having Jackie Chan and Ralph Macchio teaming up. Maybe the future of the franchise lies with streaming now.\n\n#**THIS WEEKEND**\n\nWith a weak slate of newcomers, ***Superman*** will easily hold on to the top spot.\n\nPerhaps the biggest newcomer will be Sony's ***I Know What You Did Last Summer***, which arrives 27 years after the previous installment. A legacy sequel with new characters, who are joined by Freddie Prinze Jr. and Jennifer Love Hewitt, as they are targeted by a new hook-wielding killer. The first two films were big hits, although their popularity was still inferior to the ***Scream*** series, which was released around the same point. The plot is pretty much the same as the original, so we'll see if Gen Z (a big horror audience) cares for this franchise.\n\nAnother wide release is Paramount's ***Smurfs***, another reboot of the iconic franchise. Well, \"iconic\", cause it's definitely well known, but its popularity has dwindled in the past decade. The 2011 film earned $142 million domestically and $563 million worldwide, the 2013 sequel made $71 million domestically and $347 million worldwide, and the 2017 animated film tapped out at $45 million domestically and $197 million worldwide. But with ***Elio*** failing to perform well, family audiences could tune in here if they're desperate for something. Or they can simply wait for ***The Bad Guys 2*** instead.\n\nAnd finally, A24 is releasing Ari Aster's new film ***Eddington***, which stars Joaquin Phoenix, Pedro Pascal, Luke Grimes, Deirdre O'Connell, Micheal Ward, Austin Butler, and Emma Stone. This cast is bigger than Aster's previous films, and he has amassed a cult following with horror fans. Even though ***Hereditary*** and ***Midsommar*** were hits, ***Beau Is Afraid*** was very polarizing. And judging by its very polarizing reviews, it looks like ***Eddington*** is more ***Beau*** than the other films. His fans are definitely showing up, but it remains a question mark if the general audience will do the same.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 320,
        "comments": 121,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4kSsHf1prTjNLo2YRVRxaoYkO5E6dUjVxIn63dIRgw0.png?auto=webp&amp;s=2ba780deef859ca96b6eed1d3971b45ff38ce255"
        },
        "permalink": "/r/movies/comments/1lzzv2c/july_1113_box_office_recap_superman_flies_to_a/"
    },
    {
        "id": "1lzqaw5",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for Zach Cregger's 'Weapons'",
        "content": "",
        "upvotes": 5782,
        "comments": 310,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/oful89bj4vcf1.jpeg?auto=webp&amp;s=4f2242c088163f939f6f87b6347ae33cde82ee0d"
        },
        "permalink": "/r/movies/comments/1lzqaw5/new_poster_for_zach_creggers_weapons/"
    },
    {
        "id": "1lzxtwo",
        "author": "indiewire",
        "title": "Indian Film Board Censors 'Superman' for Being Too Sensual",
        "content": "",
        "upvotes": 1715,
        "comments": 207,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fQMTjeNQL2JSCmO0Z3pQyzKEYuR_ANVGFOA2-3LHX1I.jpeg?auto=webp&amp;s=07851f63d46f402bb1893f6b1e9238496b4943d9"
        },
        "permalink": "/r/movies/comments/1lzxtwo/indian_film_board_censors_superman_for_being_too/"
    },
    {
        "id": "1lzzr2h",
        "author": "MarvelsGrantMan136",
        "title": "‘The Odyssey’ Imax 70mm Screenings Are Already Being Scheduled for July 2026",
        "content": "",
        "upvotes": 669,
        "comments": 56,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sVw-ECXyn3N_QKryX6C00dtDv1OlGTW0uup70XXUHUo.jpeg?auto=webp&amp;s=9b5219cfb5722638783ade10f41d1dd267cfd7b5"
        },
        "permalink": "/r/movies/comments/1lzzr2h/the_odyssey_imax_70mm_screenings_are_already/"
    },
    {
        "id": "1lzmso3",
        "author": "shmu_",
        "title": "Donkey Kong is finally getting his own movie adaptation, Nintendo copyright filing suggests",
        "content": "",
        "upvotes": 1885,
        "comments": 239,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/urz_TK-d5CLY3037rS4nfj8MHsE797JT-16yACsfj1Y.jpeg?auto=webp&amp;s=a9de8a407898eae3466ef54fec5ac6b058e32b98"
        },
        "permalink": "/r/movies/comments/1lzmso3/donkey_kong_is_finally_getting_his_own_movie/"
    },
    {
        "id": "1lzujca",
        "author": "MarvelsGrantMan136",
        "title": "David Kaff, aka 'The Is Spinal Tap' Keyboardist Viv Savage, Dies at 79",
        "content": "",
        "upvotes": 752,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Djzo130qvTHCDlPA3LgbgKw2OcV2EMfWncZQoWqPu00.jpeg?auto=webp&amp;s=67907b5c0461b1685b3f219ee95aa311d7ec2d47"
        },
        "permalink": "/r/movies/comments/1lzujca/david_kaff_aka_the_is_spinal_tap_keyboardist_viv/"
    },
    {
        "id": "1lztie8",
        "author": "WesbroBaptstBarNGril",
        "title": "Best self sacrifice in a movie?",
        "content": "Rewatching the Kingsman Series because why not? And in the Golden Circle, &gt;!Merlin bravely switches places with Eggsy on a land mine then lures a group guards in my singing \"Country Roads\" before taking his final step and giving them rest of the team the distraction they need to infiltrate Poppy's lair. This of course leads into the most perfect rendition of Elton John's \"Saturday Nights Alright for Fighting.\"!&lt;\n\nIt's perfect in a campy way, and brings me chills. \n\nWhat other moments brings those deep feels?",
        "upvotes": 835,
        "comments": 1294,
        "media": null,
        "permalink": "/r/movies/comments/1lztie8/best_self_sacrifice_in_a_movie/"
    },
    {
        "id": "1lzhhno",
        "author": "Vegetable_Star8931",
        "title": "What’s one movie you loved as a kid but realized was terrible when you rewatched it as an adult?",
        "content": "We all have that one film we swore was the greatest thing ever growing up — until we rewatched it years later and went, *“Wait... what was I thinking?”*\n\nFor me, it was **\"The Master of Disguise.\"** I thought it was peak comedy when I was 10. Rewatched it recently and... yeah, not so much 😅\n\nCurious to know yours — which movie didn’t age well for you, or just lost the magic over time?",
        "upvotes": 3104,
        "comments": 3160,
        "media": null,
        "permalink": "/r/movies/comments/1lzhhno/whats_one_movie_you_loved_as_a_kid_but_realized/"
    },
    {
        "id": "1lzw2dt",
        "author": "BunyipPouch",
        "title": "First Poster for Psychological-Horror 'Bone Lake' - When two young couples are mistakenly double-booked into the same vacation rental, their romantic weekend becomes a twisted maze of sex, lies, and survival.",
        "content": "",
        "upvotes": 271,
        "comments": 67,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/g2f9ij566wcf1.jpeg?auto=webp&amp;s=0b2797fffd1b0e81ce6c75a9fc17389abccff455"
        },
        "permalink": "/r/movies/comments/1lzw2dt/first_poster_for_psychologicalhorror_bone_lake/"
    },
    {
        "id": "1lzmiux",
        "author": "CamelReds73",
        "title": "The Big Lebowski is the perfect movie to explain the tenets of Taoism.",
        "content": "Firstly, this is a 5/5 movie for me, easily have watched this over ten times but this is the first time I really tried to apply the ideas of the Tao to what I was watching. I don’t think this is a groundbreaking take but it was really special to me to just have that “ah-ha” moment.\n\nWhen you think about The Dude and how much of a ~go with the flow~ kind of person he is, constantly adapting, you can then really see how he is the embodiment of living by Taoists principles. Just an entire movie dedicated to shit happening over and over to a singular individual wrapped up in the strands and complications of everyone else’s problems. You would expect that to be a terrible experience, and at times it can be, but rather than submitting to despair he just abides. As he abides, there are moments of serenity, more often than not in the bowling alley. Now he does go through the range of human emotion as you would expect one to go through during all these events, but not only is that normal, that is what is expected of trying to live and abide in balance with all there is and all that can be. The ol ying and the yang you know? The Dude just simply continues to be. I find that deeply moving and deeply spiritual. We are all just travelers in this iteration of who we are and all we can do is continue to trying to abide and not spill our beverage.",
        "upvotes": 810,
        "comments": 160,
        "media": null,
        "permalink": "/r/movies/comments/1lzmiux/the_big_lebowski_is_the_perfect_movie_to_explain/"
    },
    {
        "id": "1m001o8",
        "author": "adamsandleryabish",
        "title": "A Mighty Wind - Hey Wha' Happened",
        "content": "",
        "upvotes": 167,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4HV8qcfHdbEc5ABX7maZradUlGRSS_DssldlGjpKPQE.jpeg?auto=webp&amp;s=93b104eff92186cdf4f838f6cdadcfde63125bcd"
        },
        "permalink": "/r/movies/comments/1m001o8/a_mighty_wind_hey_wha_happened/"
    },
    {
        "id": "1lzrwrn",
        "author": "CallMeNoodler",
        "title": "The worst part of The Mist for me",
        "content": "Whenever The Mist gets brought up online, it seems what most people talk about the most is the ending (which to be fair, is a real gut punch) where &gt;!David shoots everyone in the car to prevent them from getting killed by the monsters, then goes out into the mist and yells at them to take him... only for the mist to clear and the military to show up, saving the day.!&lt;\n\nThat's awful. But the worst part for me is right before that, when they go to David's home and &gt;!find his wife strung up in one of those spider cocoons. She died, alone, afraid, in agony, not knowing what happened to her husband or son or what the mist and the monsters were. From her perspective, they went to the store, the mist rolled in, and a nightmare started!&lt;\n\nI knew about the ending going in. I did not know about this part, and it really hit me, especially since I'm married and a (fairly) new dad.",
        "upvotes": 389,
        "comments": 164,
        "media": null,
        "permalink": "/r/movies/comments/1lzrwrn/the_worst_part_of_the_mist_for_me/"
    },
    {
        "id": "1lzvnge",
        "author": "jsakic99",
        "title": "Who’s the bext “fixer” in the history of movies?",
        "content": "Who’s the bext “fixer” in the history of movies?\n\nThis would be someone that “fixes” a difficult situation for a (possibly) shady organization. \n\nOff the top of my head, I can think of Michael Clayton, Jodie Foster’s character in Inside Man, and Winston Wolfe in Pulp Fiction. \n\nAre there any others that are missing?",
        "upvotes": 231,
        "comments": 275,
        "media": null,
        "permalink": "/r/movies/comments/1lzvnge/whos_the_bext_fixer_in_the_history_of_movies/"
    },
    {
        "id": "1lzz71q",
        "author": "BeerSmoker228",
        "title": "What movie got unintentionally spoiled for you?",
        "content": "Here’s mine which I kind of thought was funny because it ruined the whole movie for me, although I enjoyed watching it play out.\n\nDO NOT READ IF YOU HAVEN’T WATCHED THE USUAL SUSPECTS:\n\nI remember looking for a movie to watch on amazon prime video and I came across The Usual Suspects. It had a very good rating and has some oscar nominations. Ive only heard about the movie and I’ve seen the famous interrogation scene on Youtube once or twice.\n\nAnyways, before I watch a movie I usually check the cast list on google to see if there’s anyone I recognize (although it usually doesnt stop me from watching whatever movie it is, it’s just pure curiosity) and it showed Kevin Spacey as ‘Keyser Soze’.\n\nImmediately after the first minute of the movie I was so sad lol",
        "upvotes": 116,
        "comments": 240,
        "media": null,
        "permalink": "/r/movies/comments/1lzz71q/what_movie_got_unintentionally_spoiled_for_you/"
    },
    {
        "id": "1lz3ahl",
        "author": "ihopnavajo",
        "title": "What's the worst case of a movie breaking its own rule",
        "content": "I remember when It Follows came out, Quentin Tarantino made a post about how the movie broke its own rule (having the \"It\" touch someone without killing them). \n\nHowever, my top pick for a movie that broke its own rule is The Butterfly Effect. \n\nThe whole premise of the movie is that, with time travel, the smallest changes can have enormous consequences. You change one little thing and the future can change drastically. \n\nAnd yet ... The main character, in a situation where he wants to prove to someone that he has special Jesus like powers, goes back to his own childhood to a moment in class and makes a drastic change by violently mutilating himself in front of everyone, and then *ZIP* somehow we're back to the same point in the future and the only thing that changed was that he now has scars on his hands?!?\n\nWHACK\n\nAnyone have some other candidates?",
        "upvotes": 9629,
        "comments": 3600,
        "media": null,
        "permalink": "/r/movies/comments/1lz3ahl/whats_the_worst_case_of_a_movie_breaking_its_own/"
    },
    {
        "id": "1lzp3rz",
        "author": "KillerCroc1234567",
        "title": "Andrew Garfield Officially Boards Luca Guadagnino’s ‘Artificial’ at Amazon MGM",
        "content": "",
        "upvotes": 193,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VfFmN6QsivNF99Spz6Xsv49tPPTG47iFZ0ICrlCbKEQ.jpeg?auto=webp&amp;s=2371fd0bb66c64aff63dd9b8fc9acbed62d3a2dc"
        },
        "permalink": "/r/movies/comments/1lzp3rz/andrew_garfield_officially_boards_luca/"
    },
    {
        "id": "1m04z3x",
        "author": "ggroover97",
        "title": "Blumhouse Undergoes Layoffs In Film &amp; Television",
        "content": "",
        "upvotes": 28,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cAfSGye8ayunHs1moQjiCCpcEHIatUY6pw_tOppvLlk.jpeg?auto=webp&amp;s=8ab391fe0c1cdeb45a67b11c52b730318777f5d0"
        },
        "permalink": "/r/movies/comments/1m04z3x/blumhouse_undergoes_layoffs_in_film_television/"
    },
    {
        "id": "1lzm6vm",
        "author": "These_Feed_2616",
        "title": "What food scene in movies always make you hungry?",
        "content": "What scene in a movie involving food really makes you want to get whatever is in the scene in real life? I have 2, I always want burgers and fries after the big kahuna burger and sprite scene in Pulp Fiction. Also, whenever I watch GoodFellas, I always want to eat Italian food whether it be spaghetti or pizza!",
        "upvotes": 164,
        "comments": 434,
        "media": null,
        "permalink": "/r/movies/comments/1lzm6vm/what_food_scene_in_movies_always_make_you_hungry/"
    },
    {
        "id": "1lz0nr6",
        "author": "ChiefLeef22",
        "title": "Christopher Nolan's 'Inception' Turns 15: A Look Back At The \"BRAAM\" Sound From Nolan's Film that Invaded the Hollywood Soundtrack",
        "content": "",
        "upvotes": 4906,
        "comments": 411,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/tPmBuLJN4CkgIraMn22dRvUTCxviibyVDEnVM8x16Ao.jpeg?auto=webp&amp;s=00f269dcdeef227ef297573e677e9c9ece1f472a"
        },
        "permalink": "/r/movies/comments/1lz0nr6/christopher_nolans_inception_turns_15_a_look_back/"
    },
    {
        "id": "1lzxj19",
        "author": "PristineAverage6253",
        "title": "What movies randomly feature a cow?",
        "content": "I just finished watching the movie La Haine, 1995, and all of the sudden a cow randomly pops up. This seems to happen to me in movies and at museums incredibly often, which i find hilarious, I don't know why, but hey I love It.\n\nOf course in this case the appearance does have a meaning (by the way, what do you think it means?), but I was wondering if there are any other examples of cows in movies, with or without a meaning, that come to your mind!",
        "upvotes": 42,
        "comments": 267,
        "media": null,
        "permalink": "/r/movies/comments/1lzxj19/what_movies_randomly_feature_a_cow/"
    },
    {
        "id": "1m01ooj",
        "author": "KillerCroc1234567",
        "title": "JB Tadena Lands Role In David Fincher’s ‘The Adventures Of Cliff Booth’ At Netflix",
        "content": "",
        "upvotes": 26,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Eavl-ZRF1IXKYgpuFPPZ6uFRHlFlVa_21QiIazFxBWs.jpeg?auto=webp&amp;s=2aba6ac5e02f7553d48c81fa9d2eb13380644166"
        },
        "permalink": "/r/movies/comments/1m01ooj/jb_tadena_lands_role_in_david_finchers_the/"
    },
    {
        "id": "1lzs0eb",
        "author": "darth_vader39",
        "title": "Eva Longoria to Direct ‘Anita de Monte Laughs Last’ Movie for Searchlight",
        "content": "",
        "upvotes": 38,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mqQAxvrwzxFW10oSo5DBnatTkiI1VzIhKbL6yfmXHjg.jpeg?auto=webp&amp;s=6059c8dd9423602d86cfb749030904378fabfa76"
        },
        "permalink": "/r/movies/comments/1lzs0eb/eva_longoria_to_direct_anita_de_monte_laughs_last/"
    },
    {
        "id": "1lzimlt",
        "author": "One-Complex-9267",
        "title": "Just finished watching Braindead (Aka Dead Alive) and possibly the goriest movie ever made",
        "content": "Sorry if it’s been discussed but I have to. \n\nI have watched many horror/gory/zombie movies and I was chatting with a friend about how it never usually weirds me out and in fact I enjoy them so he recommended me Braindead as it was one of those movies he could never finish. \n\nI usually get skeptical about low budget horror comedy but got super interested as I saw it was Peter Jackson movie. As New Zealander myself, I felt obligated and watched it. And boy I’m so shocked and surprised that it’s a Peter Jackson movie lol\n\nIn beginning when they showed cgi monkey, I got so disappointed that ok, this is gonna be shit show but I’m already 20 minutes in so let’s just keep watching and thank god I did that. It is officially the best zombie movie I’ve seen. The whole “I kick arse for lord”, breakfast with zombie to baby’s day out was just hilarious. And the last act was truly beyond words. I can’t be thankful enough of my friend after that.",
        "upvotes": 130,
        "comments": 81,
        "media": null,
        "permalink": "/r/movies/comments/1lzimlt/just_finished_watching_braindead_aka_dead_alive/"
    },
    {
        "id": "1lzs1d1",
        "author": "darth_vader39",
        "title": "Chris Meloni, Ego Nwodim, Sherry Cola, Caleb Hearon and Ben Ahlers Join ‘Little Brother’ Netflix Comedy Feature",
        "content": "",
        "upvotes": 29,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Yp8ZGiFGkoHjyLyVjIvdQRvxfioEJJ2vjIs6aMvoWTk.png?auto=webp&amp;s=925b17d3e358e36704f26701d360f1a22b30e34d"
        },
        "permalink": "/r/movies/comments/1lzs1d1/chris_meloni_ego_nwodim_sherry_cola_caleb_hearon/"
    },
    {
        "id": "1lyv5u5",
        "author": "MarvelsGrantMan136",
        "title": "New Images of Daniel Bernhardt in ‘Deathstalker’, Directed by Steven Kostanski (‘Psycho Goreman’)",
        "content": "",
        "upvotes": 3622,
        "comments": 271,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/swudib2sqncf1.jpeg?auto=webp&amp;s=ea6d32408b4be5859055faee36896bc2f7ffd38c"
        },
        "permalink": "/r/movies/comments/1lyv5u5/new_images_of_daniel_bernhardt_in_deathstalker/"
    },
    {
        "id": "1lzvii0",
        "author": "Scythe95",
        "title": "What is your top 5 ‘based on a true story’ film?",
        "content": "Movies like:\n\nPursuit of Happiness, the Pianist, Zodiac, Social Network, Catch me if you Can, The Last King of Scotland, 12 years a slave, the kings speech, the boy in the striped pyjama’s, into the wild. Etc\n\nAll movies that are based on true humans experiences and decisions that they made. \n\nGive me your favourite or your top 5 if you’re really feeling it.",
        "upvotes": 20,
        "comments": 122,
        "media": null,
        "permalink": "/r/movies/comments/1lzvii0/what_is_your_top_5_based_on_a_true_story_film/"
    },
    {
        "id": "1lzxau6",
        "author": "Release-Tiny",
        "title": "The Movie Friendship felt too real",
        "content": "So I watched the Tim Robinson movie, Friendship recently, and I was expecting a comedy similar to his Netflix show, and it was, but it was so much more than that.\n\nI have trouble with relationships and reflecting on my behaviour and oh boy did this movie put up a mirror to my behaviour.\n\nThroughout the movie the main character diminishes other people’s feelings and fears, “it’s not coming back.”\n\nHe responds to people pointing out he’s the problem or made a mistake by making a joke and trivializing the problem and if this doesn’t work, he gets angry and goes on the offensive.\n\nHes so repressed that the few times he experiences his emotions they’re so overpowering, it feels like love (seeing his neighbour play in the band) or knocks him on his ass (when he sees the orchid).\n\nThe movie hits on lots of other issues, and Sarah Silverman said it best, Robinson’s work shows the absurdity of Toxic Masculinity.",
        "upvotes": 17,
        "comments": 15,
        "media": null,
        "permalink": "/r/movies/comments/1lzxau6/the_movie_friendship_felt_too_real/"
    },
    {
        "id": "1lz9912",
        "author": "MrGittz",
        "title": "What movie did you always just assume was a big hit but turned out not to be? For me it’s the 2003 Peter Pan film.",
        "content": "I use to love looking up box office numbers for movies and there were so many times I would be surprised a movie i thought was a huge hit turned out to be a flop or barely made a profit. \n\nA big one is the 2003 Peter Pan movie. I just assumed it was a big hit. Like…how could it not be? Releases during the Harry Potter LOTR era? English kids with awesome visuals, flying, pirates? This should’ve been huge. \n\nThe original Tron is another movie I thought was a big hit. I guess that’s why it took them so long to make a sequel.",
        "upvotes": 478,
        "comments": 366,
        "media": null,
        "permalink": "/r/movies/comments/1lz9912/what_movie_did_you_always_just_assume_was_a_big/"
    },
    {
        "id": "1lz40xn",
        "author": "MaxRichter_Enjoyer",
        "title": "Samurai duel from the movie Twilight Samurai. Featuring Hiroyuki Sanada. Movie was amazing too.",
        "content": "",
        "upvotes": 925,
        "comments": 107,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/60AOixlrYBOYwi6rF21_BLBYCXvOyxIW2ZfGAsiJ1A4.jpeg?auto=webp&amp;s=94b4dfed40a0d839203b9a06a130c60b419425b8"
        },
        "permalink": "/r/movies/comments/1lz40xn/samurai_duel_from_the_movie_twilight_samurai/"
    },
    {
        "id": "1lzx8ak",
        "author": "SiTheHandsomeGuy",
        "title": "What’s a movie that completely changed your opinion on a genre you used to dislike?",
        "content": "I used to avoid musicals like the plague until I watched *La La Land* on a whim. Something about the cinematography, the melancholy tone, and that ending flipped a switch in my brain. Now I actually seek out musicals, which I never thought would happen. Have you had a similar experience? A horror film that converted you? A rom-com that snuck past your defenses? Curious what movies changed your mind on an entire genre.",
        "upvotes": 13,
        "comments": 24,
        "media": null,
        "permalink": "/r/movies/comments/1lzx8ak/whats_a_movie_that_completely_changed_your/"
    },
    {
        "id": "1lzzw2z",
        "author": "NoCulture3505",
        "title": "Legendary’s ‘Street Fighter’ Movie Casts Vidyut Jammwal As Dhalsim",
        "content": "",
        "upvotes": 9,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-l15ptNLgMqq624wSvTjL_dMZjV2D9eDbG8Qi8qGiPs.jpeg?auto=webp&amp;s=cefd51e388fda31d2a0536d6ca4853b017054692"
        },
        "permalink": "/r/movies/comments/1lzzw2z/legendarys_street_fighter_movie_casts_vidyut/"
    }
]