[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 487,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1i2ah9e",
        "author": "SignatureLabel",
        "title": "It is criminal that Mindhunter did not get a 3rd season.",
        "content": "Absolutely criminal. I’m aware of the cost of making the show and the low viewership at the beginning but now there is no reason not to make one season and finish up what I consider to be Netflix’s best show by a long shot.",
        "upvotes": 433,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1i2ah9e/it_is_criminal_that_mindhunter_did_not_get_a_3rd/"
    },
    {
        "id": "1i293jx",
        "author": "AdmirableOx",
        "title": "American Primeval feels like watching \"The Revenant\"",
        "content": "Randomly stumbled upon this show and wow. This had no bussiness being THAT GOOD. The Revenant is my all time favorite movie and the way this is shot instantly reminds me of the movie. \n\n10/10 for me!! Finally a great show I really enjoy watching!",
        "upvotes": 199,
        "comments": 64,
        "media": null,
        "permalink": "/r/netflix/comments/1i293jx/american_primeval_feels_like_watching_the_revenant/"
    },
    {
        "id": "1i266c2",
        "author": "DavidC_is_me",
        "title": "The fires in the Netflix \"Fireplace For Your Home\" footage are awful.",
        "content": "They're so badly built only half the logs burn properly and it is the most frustrating thing because you want to rearrange it or at least take a poker to it.\n\nI mean the whole point of the whole thing is just a fire. One job. Build a decent fucking fire.\n\nBut nooooooo. Build a shit fire and none of the crew ever notice that it's a shit fire. Assuming any of them stand aloft and have opposable thumbs, any one of them should be able to build a better fire than that.",
        "upvotes": 127,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1i266c2/the_fires_in_the_netflix_fireplace_for_your_home/"
    },
    {
        "id": "1i2gder",
        "author": "RiverLongjumping3823",
        "title": "Lucas neff in American primeval ",
        "content": "Does anyone else appreciate Lucas neff in the show? Watched this man in raising hope and now he’s killing it in American primeval as the captain. He really did a good job honestly didnt expect that from him. But I’m happy he got the role he nailed it on the dot. ",
        "upvotes": 20,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1i2gder/lucas_neff_in_american_primeval/"
    },
    {
        "id": "1i2k7uh",
        "author": "Pogrebnik",
        "title": "'Fear Street: Prom Queen' Gets an \"R\" Rating - Coming To Netflix This Year",
        "content": "",
        "upvotes": 9,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i2k7uh/fear_street_prom_queen_gets_an_r_rating_coming_to/"
    },
    {
        "id": "1i27a50",
        "author": "footballersabroad",
        "title": "Netflix viewership overtakes BBC One for first time",
        "content": "",
        "upvotes": 70,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1i27a50/netflix_viewership_overtakes_bbc_one_for_first/"
    },
    {
        "id": "1i2j7qr",
        "author": "Robemilak",
        "title": "'Bloodhounds' Season 2 Is Coming: Woo Do-hwan and Lee Sang-yi Are Back, Jung Ji-hoon Joins the Cast",
        "content": "",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1i2j7qr/bloodhounds_season_2_is_coming_woo_dohwan_and_lee/"
    },
    {
        "id": "1i1t0t8",
        "author": "Whobitmyname",
        "title": "‘Squid Game 2’ Becomes Netflix’s Third Most-Watched Season Ever, After ‘Squid Game 1’ and ‘Wednesday’",
        "content": "",
        "upvotes": 325,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1i1t0t8/squid_game_2_becomes_netflixs_third_mostwatched/"
    },
    {
        "id": "1i2jalu",
        "author": "Robemilak",
        "title": "The Night Agent returns next thursday. Gabriel Basso recaps Season 1 to help you get ready.",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i2jalu/the_night_agent_returns_next_thursday_gabriel/"
    },
    {
        "id": "1i1jxms",
        "author": "Temporary-Spell3176",
        "title": "American Primeval is amazing, give it a try.",
        "content": "If you’re into gritty, no holds barred Wild West stories, this is it. Set in 1857, it throws you right into the chaos of frontier life, no sugarcoating, just raw survival. The landscapes are insane, the action hits hard (not just shootouts, but brutal hand-to-hand stuff), and the story actually moves.\n\nIt’s not all talky drama, but when there’s dialogue, it matters. The main characters are solid. Isaac Reed is a total mystery, and the tension between settlers, Native tribes, and religious groups feels so real. It also ties in actual historical events, which makes it feel even more grounded.\n\nNot gonna lie, it’s dark and violent, so don’t expect any warm, fuzzy cowboy vibes. It’s like if Yellowstone and The Revenant had a gritty baby. Definitely worth the watch if you’re into intense Westerns or just want a break from the usual predictable shows. \n\n",
        "upvotes": 541,
        "comments": 220,
        "media": null,
        "permalink": "/r/netflix/comments/1i1jxms/american_primeval_is_amazing_give_it_a_try/"
    },
    {
        "id": "1i2i37u",
        "author": "Little-Air2931",
        "title": "Recommendations ",
        "content": "Hey so it's quite a while that i have binge cdrama as i was studying hard for my exams but i want to now watch them again.\nI am specifically looking for some of these similar drama if you guys have any recommendations please put forward - \nCdrama drama (historical) \nThe romance of rose and tiger \nAutumn balled \nNovoland: pearl eclipse \nBack from the brick\nA female student in the imperial court \n\n(Modern) \nPut your head on my shoulder \nThe brightest star in the night sky \nGo ahead \nLove o2o \nMeteor garden \nThe love you gave me \nMy girlfriend is an alien \nHidden love \nWhen I fly towards you \n\nKdramas(limited to these only) \nThe liberation notes \nWelcome to slamdri \nA moment of 18 \nSummer strike \nWeak Hero class 1 \nTomorrow \nWeight lifting fairy \nStrong woman \nW \nThe flower of evil\n",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1i2i37u/recommendations/"
    },
    {
        "id": "1i2f7cu",
        "author": "TightBid169",
        "title": "does the show younger get better?? ",
        "content": "I watched the first episode and it was really bad considering it had so many seasons. I want to watch because I love hilary duff and because I want a casual light show but the first episode was like all bad kinda racist jokes about india and the main girl being annoying. ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i2f7cu/does_the_show_younger_get_better/"
    },
    {
        "id": "1i2kl8i",
        "author": "Responsible_Mess277",
        "title": "is Yu Yu Hakusho on Netiflix is worth watching?",
        "content": "I was scrolling through some japanese series for netflix and then this Yu Yu Hakusho show appeared, didn't know they made a live action. is it really worth watching?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1i2kl8i/is_yu_yu_hakusho_on_netiflix_is_worth_watching/"
    },
    {
        "id": "1i2jge5",
        "author": "Tomato7787",
        "title": "💕#fatherdaughter Bond young-hee still haunts me #squidgame #netflix #koreandrama #saebyeok",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i2jge5/fatherdaughter_bond_younghee_still_haunts_me/"
    },
    {
        "id": "1i1u0wm",
        "author": "Pierredyis",
        "title": "What’s with the new anime series featuring ridiculously long titles?",
        "content": "",
        "upvotes": 42,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1i1u0wm/whats_with_the_new_anime_series_featuring/"
    },
    {
        "id": "1i2hpii",
        "author": "Commercial-Elk1712",
        "title": "Can't Login",
        "content": "Before anyone asks, I've followed every advice I've done research on. The password is correct, cookies are cleared, different browsers have been tried, different networks. I've done it both on phone data and on my local home network. \n\nSigning in with the correct password:\n\n\"Something went wrong. We are having technical difficulties and are actively working on a fix. Please try again in a few minutes.\"\n\nSigning in with a passcode: \n\n\"Please try again\"\n\nResetting my password with phone number and email:\n\n\"Sorry, this change password link is not valid. Please request another one\"\n\n  \nI've tried every browser under the sun, cleared cookies, tried different devices. I've done everything I can think of. Support basically stopped talking to me in the chat after we tried a bunch of stuff.\n\n  \nAnyone else having an issue getting into their account?\n\n\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i2hpii/cant_login/"
    },
    {
        "id": "1i20s42",
        "author": "jries05",
        "title": "New Non-English series doesn’t have subtitles in English",
        "content": "I’m trying to watch the series Public Disorder, but it does not come with English subtitles. It has subtitles in every other language but English. I personally prefer not to use the dub(of which an English version exists), so this is really frustrating. Has anyone had this problem with other foreign series as of recently?",
        "upvotes": 8,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1i20s42/new_nonenglish_series_doesnt_have_subtitles_in/"
    },
    {
        "id": "1i2cty4",
        "author": "SavingForColege",
        "title": "No credit line for Kat's cell phone in Missing You?",
        "content": "Also starring Kat's Phone as \"Kat's Phone.\"\n\n  \nIt's kind of crazy how central cell phones are to most new shows. Don't think they could have made this one pre-2000.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1i2cty4/no_credit_line_for_kats_cell_phone_in_missing_you/"
    },
    {
        "id": "1i2713d",
        "author": "Boom767",
        "title": "What to watch after Alice in Borderland ?",
        "content": "",
        "upvotes": 1,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1i2713d/what_to_watch_after_alice_in_borderland/"
    },
    {
        "id": "1i2b1e2",
        "author": "LowlandMilk",
        "title": "Households.",
        "content": "I am a new subscriber (6 weeks now).\nWe live in our main house but travel to our cottage approx 15 min away on the weekends. Some times during the week, I go there as well. Like today to shovel show. Once I was done, I wanted to watch an episode of my show with the same user.\n\nWhy am I asked to verify the households (both) whenever I am back from the other?\n\nI usually have to update it once a week.\n\nDo I call in to Netflix to manually update something? This is annoying.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i2b1e2/households/"
    },
    {
        "id": "1i24sgm",
        "author": "bennylilfluff",
        "title": "Preview Club Questions",
        "content": "So I just got my first screening invite for preview club. I was super excited and then saw who is starring in the movie. This is someone who is in my personal top 5 list of most hated “celebrities”. I would absolutely not waste time watching something with this person in it, in fact I would thumbs down it on Netflix without watching it, and I don’t do that. If something was playing at the dentists office with this person in it, I would ask for the remote.\n\nSo if I don’t watch the movie, will I be sent any other previews? I really want to be in the preview club, but this is worst case scenario. I would rather watch a presidential debate. How ironic is it that I’m open to literally anything but this dumb b. \nSo do I skip… or watch it, bleach my eyes and ears, and then shit all over the survey? ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1i24sgm/preview_club_questions/"
    },
    {
        "id": "1i1bydj",
        "author": "S4v1r1enCh0r4k",
        "title": "'The Witcher: Sirens of the Deep' animated movie just released its first trailer, The movie takes place between episodes 5 and 6 of The Witcher Season 1.",
        "content": "",
        "upvotes": 151,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1i1bydj/the_witcher_sirens_of_the_deep_animated_movie/"
    },
    {
        "id": "1i2hsob",
        "author": "Shunzi20000",
        "title": "Should I touch grass? (under watermelon)",
        "content": "https://preview.redd.it/2yvan9d5jade1.png?width=1897&amp;format=png&amp;auto=webp&amp;s=6883f4bda29e90d6790b17d222ce395534d26112\n\n  \nI have over 89 watermelons collected. I play everyday. My goal was to merge two watermelons, but now I consistently do that multiple times a game. My new goal is a million? But what after that? Do I need to touch grass?\n\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1i2hsob/should_i_touch_grass_under_watermelon/"
    },
    {
        "id": "1i132cg",
        "author": "dailystar_news",
        "title": "WWE fans confused as Netflix show with huge debut 'runs short' as new champ crowned",
        "content": "",
        "upvotes": 543,
        "comments": 62,
        "media": null,
        "permalink": "/r/netflix/comments/1i132cg/wwe_fans_confused_as_netflix_show_with_huge_debut/"
    },
    {
        "id": "1i25y52",
        "author": "Tom2Travel",
        "title": "Netflix without TV subscription",
        "content": "I am from Belgium and planning to cancel Proximus TV subscription. But I am wondering will there be an issue watching Netflix if I pay for them separately. I always went into netflix with their TV connecting apps. Please shed some light as I am eager to understand befor I cancel TV subscription. Thanks for your time.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i25y52/netflix_without_tv_subscription/"
    },
    {
        "id": "1i1jifs",
        "author": "helpforhorror",
        "title": "Behind Her Eyes",
        "content": "Okay first of all- what? Second of all.. what? I need someone I can talk to about this show. It absolutely blew my mind and made me deeply uncomfortable at the end. Can I hear your thoughts? How it made you feel?",
        "upvotes": 24,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1i1jifs/behind_her_eyes/"
    },
    {
        "id": "1i2ft44",
        "author": "MommaBlaze",
        "title": "No Kdramas but lots \"new\" Jdramas",
        "content": "I am so disgusted with Netflix right now. I primarily watch K dramas but lately there are only \"new\" J dramas. Beautiful Life 2000, The Black Swindler 2006, Bayside Shakedown 1997 snd Tokyo Love Story 1991. And the tiny screens are so nostalgic.  Seriously? I am just about ready to break up. Anyone else? Fully expecting to get blocked but i do not care ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1i2ft44/no_kdramas_but_lots_new_jdramas/"
    },
    {
        "id": "1i123z9",
        "author": "HandsomeStarLord",
        "title": "This the movie we need the 1995 version not this crap version of Tom cruise Netflix UK ",
        "content": "",
        "upvotes": 290,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1i123z9/this_the_movie_we_need_the_1995_version_not_this/"
    },
    {
        "id": "1i1k4p1",
        "author": "krybaebee",
        "title": "Younger",
        "content": "Is anyone watching Younger?  It was recently added to the lineup.\n\n\n\nI watched it during its OG run on TV Land starting back in 2015.   I binged the whole thing over the past week, the episodes are short.\n\n\n\nIt's cotton candy tv for me - sweet and airy with zero nutritional value for the brain.   If you like Emily in Paris - Younger is a much better show from the same Darren Star production house.",
        "upvotes": 18,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i1k4p1/younger/"
    },
    {
        "id": "1i1n0qe",
        "author": "Lamboo-",
        "title": "Most Watched Netflix Series And Movies of 2024 (And Biggest Disappointments)",
        "content": "",
        "upvotes": 13,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i1n0qe/most_watched_netflix_series_and_movies_of_2024/"
    }
]