[
    {
        "id": "1ius624",
        "author": "GrandTheftHamlet",
        "title": "Hi /r/movies! We’re Sam Crane, Pinny Grylls &amp; Mark Oosterveen, co-directors &amp; actor of Grand Theft Hamlet, streaming exclusively on MUBI. It's an award-winning documentary about attempting to stage a Shakespeare adaptation inside the chaotic world of Grand Theft Auto online. Ask us anything!",
        "content": "",
        "upvotes": 45,
        "comments": 91,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ydrdtl7p5ike1.png?auto=webp&amp;s=d2ab95e5f2af65d68da2535bea5bd3c646d88280"
        },
        "permalink": "/r/movies/comments/1ius624/hi_rmovies_were_sam_crane_pinny_grylls_mark/"
    },
    {
        "id": "1iuhgt8",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (The Monkey / The Gorge / Bridget Jones: Mad About the Boy)",
        "content": "# New Theatrical Releases\n\n[The Monkey](https://old.reddit.com/r/movies/comments/1iuh94f/official_discussion_the_monkey_spoilers/?)\n\n\n# Still in Theaters\n\n[Captain America: Brave New World](https://old.reddit.com/r/movies/comments/1ip0ump/official_discussion_captain_america_brave_new/?)\n\n[Paddington in Peru](https://old.reddit.com/r/movies/comments/1ip0uph/official_discussion_paddington_in_peru_spoilers/?)\n\n[Dog Man](https://old.reddit.com/r/movies/comments/1ie56s0/official_discussion_dog_man_spoilers/)\n\n[Love Hurts](https://old.reddit.com/r/movies/comments/1ijl8mc/official_discussion_love_hurts_spoilers/?)\n\n[Heart Eyes](https://old.reddit.com/r/movies/comments/1ijl8ob/official_discussion_heart_eyes_spoilers/?)\n\n\n# On Streaming\n\n[The Gorge](https://old.reddit.com/r/movies/comments/1iuhec9/official_discussion_the_gorge_spoilers/?)\n\n[Bridget Jones: Mad About the Boy](https://old.reddit.com/r/movies/comments/1iuhedf/official_discussion_bridget_jones_mad_about_the/?)\n\n# Oscar Rewind\n\n[Anora](https://old.reddit.com/r/movies/comments/1ggv4yg/official_discussion_anora_spoilers/)\n\n[A Complete Unknown](https://old.reddit.com/r/movies/comments/1hlsi27/official_discussion_a_complete_unknown_spoilers/)\n\n[The Brutalist](https://old.reddit.com/r/movies/comments/1i37yra/official_discussion_the_brutalist_spoilers/?)\n\n[Conclave](https://old.reddit.com/r/movies/comments/1gbjlm7/official_discussion_conclave_spoilers/)\n\n[Dune: Part Two](https://old.reddit.com/r/movies/comments/1b3jo9s/official_discussion_dune_part_two_spoilers/)\n\n[Emilia Perez](https://old.reddit.com/r/movies/comments/1grn0lz/official_discussion_emilia_p%C3%A9rez_spoilers/)\n\n[Nickel Boys](https://old.reddit.com/r/movies/comments/1i8m8iz/official_discussion_nickel_boys_spoilers/?)\n\n[The Substance](https://old.reddit.com/r/movies/comments/1fl1bpl/official_discussion_the_substance_spoilers/)\n\n[Wicked](https://old.reddit.com/r/movies/comments/1gwxxy1/official_discussion_wicked_part_i_spoilers/)",
        "upvotes": 24,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1iuhgt8/official_discussion_megathread_the_monkey_the/"
    },
    {
        "id": "1ivkq33",
        "author": "Sutech2301",
        "title": "Movies that no one else remembers that you regularly think about.",
        "content": "So, there is this 1991 romcom \"Defending your Life\" starring Meryl Streep and Albert Brooks, whose premise is two people meeting each other in some sort of purgatory after dying and falling in love.\n\nAnd i gotta tell you, this movie is neat af. Interesting concept of the afterlife and solid world building and it also has a bit of suspense, considering that they don't know what will happen to them because they are in purgatory.\n\nWell, this movie has obviously met the typical 1990s romcom fate and disappeared into oblivion, but for me personally, since i watched  \"Defending your Life\" in the early 2000s, to quote Citizen Kane's Mr. Bernstein, not a month has gone by, that i haven't thought about that movie.\n\n\nDo you have a movie that isn't very popular or maybe considered a generic mass product in the general popculture conscious, that stuck with you?",
        "upvotes": 5945,
        "comments": 6906,
        "media": null,
        "permalink": "/r/movies/comments/1ivkq33/movies_that_no_one_else_remembers_that_you/"
    },
    {
        "id": "1iw1lzx",
        "author": "Nobodygrotesque",
        "title": "What are some WW2 movies that are the most historically accurate that one can learn from?",
        "content": "My son is in 7th grade and he just got finished with WW2 in history class and they spent only 2 weeks on WW2 which is mind boggling. I get that time is limited and WW2 is complex and it’s my job as a parent to teach him even more. So what are some movies that are for the most part historically accurate about the war?  I’m open to movies from all different countries as well, thanks! ",
        "upvotes": 122,
        "comments": 304,
        "media": null,
        "permalink": "/r/movies/comments/1iw1lzx/what_are_some_ww2_movies_that_are_the_most/"
    },
    {
        "id": "1ivt3tz",
        "author": "herewego199209",
        "title": "I'm watching Source Code again and it made me wonder how is it that you get a director that makes inventive science fiction movies like Moon and Source Code and just cannot make another good movie again? I've seen this with many directors and I don't get it.",
        "content": "I legitimately thought when Duncan Jones made those two movies he was the Ridley Scott of that generation of directors. Just wildly entertaining but smart science fiction movies that were ridiculously tightly made. And after seeing Warcraft and Mute it just feels like a different filmmaker I've seen this happen with Neil Blompkamp who has had like 2 or 3 comeback attempts as well and it's not hitting. It's weird. ",
        "upvotes": 327,
        "comments": 104,
        "media": null,
        "permalink": "/r/movies/comments/1ivt3tz/im_watching_source_code_again_and_it_made_me/"
    },
    {
        "id": "1ivq7sx",
        "author": "GoldSteak7421",
        "title": "What movies have the worst Shaky cam?",
        "content": "I never been fan of shaky cams but when it's decent and serves well enough the purpose , i can tolerate it. You know, some Greengrass movies, Children of Men and such. But when it's bad, it's the worst shit ever, a clear sign of bad direction. Either i don't understand what the hell is going on, or it literally gives me headache (actually, most of times its both)\n\nSo yeah, whats your opinion on shaky cam? And what's the worst example of this filmmaking method for you?",
        "upvotes": 445,
        "comments": 602,
        "media": null,
        "permalink": "/r/movies/comments/1ivq7sx/what_movies_have_the_worst_shaky_cam/"
    },
    {
        "id": "1iviek1",
        "author": "NeverEat_Pears",
        "title": "Why did no one tell me Crank (2006) was such a crazy balls to wall movie? Jason Statham's greatest performance. Seriously under-hyped action-comedy.",
        "content": "Obviously, the title is slightly tongue in cheek, and Crank is a popular, well-known movie. I think it deserves to be seen as an action comedy classic and an archetype of how to make a great fast paced 90 min movie, however. The budget seems fairly mid-range with the various action sequences.\n\nThe movie is so frenetic from the very start.  Jason Statham is just goddamn marvelous in it. His greatest performance I have ever seen. \n\nI'd always thought Statham's best performance was in Snatch. That may be the best movie he's starred in - but Crank has to be the best performance for me. It seems like he's up for anything. It's a satirical self-deprecating Statham performance, like in Spy with Melissa McCarthy. Just really fun.\n\nThis movie starts with the foot on the accelerator and doesn't stop, getting more and more crazy as Chev (Statham) fights against the poison in his body - he has to keep his heart rate high to stop it from killing him. \n\nThe action is fun and the movie is very funny. It sort of feels like I am watching a movie version of GTA at times as Chev is just like one of their protagonists and causes utter carnage - I honestly think it must have been inspired by those games (with Sanandreas out a couple years prior). Statham bears a striking resemblance to the look and feel of characters from the later GTA games - so it may have worked both ways.\n\nAmy Smart is so utterly sexy as the girlfriend Eve. A scene stealing role. There's some funny scenes and hijinks where she's getting on with her normal life, lolling about in bed high, trying to fix the microwave clock, while all this crazy pandemonium is kicking off all around her. I love how this film doesn't take itself seriously but is also extremely unrelenting.\n \nThere's one uncomfortable scene with Chev and Eve which shows the film's age. &gt;!The public sex scene!&lt;. This scene kind of has a &gt;!rapey!&lt; moment that will have you squirming but then it relents and makes up for it with a very funny crazy sequence.\n\nI feel like this film doesn't get the recognition it deserves. I never knew it was so damn good and I'm a huge film fan. I always got the impression it was just a run of the mill noughties action movie.\n\nEdit: &gt;!Just got to the part where Chev and the bad guy fall out the helicopter and through the sky, and continue to argue and fight eachother. Then, after winning, Chev proceeds to make a phonecall while peacefully falling to his death. Again, so so funny.!&lt;",
        "upvotes": 1230,
        "comments": 230,
        "media": null,
        "permalink": "/r/movies/comments/1iviek1/why_did_no_one_tell_me_crank_2006_was_such_a/"
    },
    {
        "id": "1ivob70",
        "author": "theatlantic",
        "title": "“The Monkey” review, by David Sims",
        "content": "",
        "upvotes": 517,
        "comments": 95,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EK4Ikq2WmhCMookkG1jHMK3tQQ26kX0Q-GbinVPFsvs.jpg?auto=webp&amp;s=ed72fd88fa05e63f2043e0497d796ac2cc6920eb"
        },
        "permalink": "/r/movies/comments/1ivob70/the_monkey_review_by_david_sims/"
    },
    {
        "id": "1ivui0p",
        "author": "MrGittz",
        "title": "What are some Legendary Deleted Scenes that have never been released that you’d LOVE to see? One that I can think of is the so called “Camelot” scene in Spielberg’s War of the Worlds. It was cut so late all the cgi had been finished.",
        "content": "I would LOVE to see this scene. It takes place late in the film, as Tom and his kids are travelling on foot, they encounter a tripod ripping people out of their homes. It was a late cut and so all the VFX by ILM had been completed. There’s a few pictures of it So why not include it on the dvd/blu ray?\nAnyway what are some other unreleased deleted scenes you would love to see?",
        "upvotes": 213,
        "comments": 188,
        "media": null,
        "permalink": "/r/movies/comments/1ivui0p/what_are_some_legendary_deleted_scenes_that_have/"
    },
    {
        "id": "1ivwo3g",
        "author": "JohnRedcornXL",
        "title": "Movies with upsetting endings",
        "content": "I'm not going into detail with endings. Just asking for movie suggestions that leave you feeling upset. Not a happy ending. Just straight up slaps you around unexpectedly. \n\nI'm going to list examples of movies with this type of ending below that I have seen and absolutely loved - which is why I listed the spoiler warning... So, heads up - they don't have the happiest of endings 😅 BUT if you HAVEN'T seen any of these films, PLEASE DO: \n\nThe movies:\n- Memento \n- Upgrade \n- Ex Machina \n- The Prestige \n- Prisoners \n- Se7en \n- One Hour Photo \n- The Mist \n- Interstellar\n- The Butterfly Effect \n- The Bridge to Terabithia \n- The Boy in the Striped Pajamas \n- District 9 \n- No Country for Old Men \n\n\n",
        "upvotes": 153,
        "comments": 557,
        "media": null,
        "permalink": "/r/movies/comments/1ivwo3g/movies_with_upsetting_endings/"
    },
    {
        "id": "1iw1jqv",
        "author": "Nuclear_eggo_waffle",
        "title": "I think Glass (2019) might actually be better as a standalone movie",
        "content": "Following a Netflix mishap, i ended up watching Glass (2019) without knowing it was part of a trilogy (they really should tell you that when you click on it).I enjoyed the mystery surrounding the existence of superpowers. I also liked the end and how subversive it was. So I was pretty surprised to see that the entire Internet seems to agree it's the worst thing since unsliced bread. I've read the complaints and I must agree, people who have seen the first two movies don't wonder if it's all real because they know they really have powers, and fans of the trilogy just find the end underwhelming. So, in a way, the best way to enjoy this movie is to either watch it before the other two, or to not watch them. Does anyone else feel this way?",
        "upvotes": 67,
        "comments": 41,
        "media": null,
        "permalink": "/r/movies/comments/1iw1jqv/i_think_glass_2019_might_actually_be_better_as_a/"
    },
    {
        "id": "1ivx2ta",
        "author": "indiewire",
        "title": "‘Anora’ Wins the Spirit Award for Best Feature — See the Full Winners List",
        "content": "",
        "upvotes": 125,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0sK71oeXQieE7GlO2tXfKL8UYf2nDP_yOd-g3mVsppA.jpg?auto=webp&amp;s=50b38874db535fbc031e9296d63ba6388f1b51cf"
        },
        "permalink": "/r/movies/comments/1ivx2ta/anora_wins_the_spirit_award_for_best_feature_see/"
    },
    {
        "id": "1ivvj26",
        "author": "VanGoghEnjoyer",
        "title": "Carlos Diegues, Filmmaker Who Celebrated Brazil’s Diversity, Dies at 84",
        "content": "",
        "upvotes": 161,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bApzpWm90qJQjj7W-1FPDaED3ChClDcguDMbWzbrdZk.jpg?auto=webp&amp;s=9df30e16aec6c16915fd7b26306f428ee49b62a4"
        },
        "permalink": "/r/movies/comments/1ivvj26/carlos_diegues_filmmaker_who_celebrated_brazils/"
    },
    {
        "id": "1iv7cxh",
        "author": "JannTosh50",
        "title": "'Jupiter Ascending' came out 10 years ago, and we're still not sure how The Matrix creators' space opera went so wrong",
        "content": "",
        "upvotes": 8159,
        "comments": 1465,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4JixvbH-6GzSwBqnPXBGA7ftSDDXFA_4KE39231Ors0.jpg?auto=webp&amp;s=48272f93123f85edd61f2de05fa514d36be3cdc6"
        },
        "permalink": "/r/movies/comments/1iv7cxh/jupiter_ascending_came_out_10_years_ago_and_were/"
    },
    {
        "id": "1iw5152",
        "author": "BathroomOld2737",
        "title": "I was thinking, what is the oldest movie featuring with an actor who is still alive?",
        "content": "I did some research and came across an actress named Maria Riva, who appeared in a 1934 film—The Scarlet Empress. It’s fascinating to think that someone from a movie that old is still with us.\n\nAm I correct, or do you happen to know of an even older movie that features a living actor? I’d love to learn more about this topic if there are other cases like this.\n\nPS: The actor doesn’t necessarily need to be active in the industry anymore.",
        "upvotes": 19,
        "comments": 13,
        "media": null,
        "permalink": "/r/movies/comments/1iw5152/i_was_thinking_what_is_the_oldest_movie_featuring/"
    },
    {
        "id": "1ivthtd",
        "author": "bpres08",
        "title": "Anyone remember Clockstoppers?",
        "content": "This movie just randomly popped up in my head. It’s super cheesy now but at the time Clockstoppers was *the coolest* movie I’d ever seen. It blew my 11-year-old mind. It was like I had just seen Inception or something. I walked out knowing my parents had just witnessed greatness with me.\n\nI’d love to watch it now just to see how much it’s aged. Anyone else see this one in theaters?",
        "upvotes": 123,
        "comments": 56,
        "media": null,
        "permalink": "/r/movies/comments/1ivthtd/anyone_remember_clockstoppers/"
    },
    {
        "id": "1ivuu0s",
        "author": "Xruptor",
        "title": "sci-fi movie about terraformers leaving colony to find power and what happened to a colony that went silent?",
        "content": "I vaguely remember this movie about a terraforming colony (on a pretty forested planet) that loses power and some members go in search of restoring power by following these huge power line poles left by the original colony constructors.  They also want to know what happened to an old colony that went silent.  Only to find out some are still living there but were attacked.  As they follow the power lines they are being hunted by aliens (or people can't remember).  They come across this HUGE (human if I recall) derelict crashed ship  (near the power lines) and end up restoring the power (while fighting off aliens or those hunting them) through the ship to those lines to give power back to the colonies.  It takes place on another planet and it was a fairly recent movie.  I remember the town being pretty run down too.  Then again I could be going crazy and remembering this wrong.\n\nNo it's not Aliens, Prospect or The Colony ;)",
        "upvotes": 55,
        "comments": 54,
        "media": null,
        "permalink": "/r/movies/comments/1ivuu0s/scifi_movie_about_terraformers_leaving_colony_to/"
    },
    {
        "id": "1iw1id2",
        "author": "Billie_Mumphrey",
        "title": "My Dinner with Andre",
        "content": "I liked this movie.  I just wanted to say that, regardless of who you side with in the movie (I found myself either agreeing with both in different situations, or at least empathizing with each character in instances where I disagreed), what hit me the most was the CIVIL discourse that occurred.  The both LISTENED to each other.  Neither was interrupting the other.  No personal attacks.  No talking over each other.  Nothing like \"I'm right and you're wrong\".\n\nWhen I think of discussions that I've had in real life, it usually ends up the opposite.  Friends constantly interrupting each other and being dismissive of each others' opinions.  And personal attacks galore!\n\nNow I know this is just a movie, and it's possible that situations like this movie possibly occur in real life, but I just don't think it's common.\n\n  \nI will add that I was very much surprised that Troma Inc was involved in the production of this movie.  I LOVE Troma movies, and I always associated them with the awesome B-horror flicks.  So that was probably the biggest surprise.",
        "upvotes": 19,
        "comments": 18,
        "media": null,
        "permalink": "/r/movies/comments/1iw1id2/my_dinner_with_andre/"
    },
    {
        "id": "1ivzjsh",
        "author": "stillcore",
        "title": "‘Judge’ - John Astin - THE FRIGHTENERS",
        "content": "",
        "upvotes": 23,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/njh6OPBCt_LZs6OYCiZ8YikYhVYz3HW2m5jeh87ZLdA.jpg?auto=webp&amp;s=64be5bf52f26a487f56617551b987412aeb8d7ee"
        },
        "permalink": "/r/movies/comments/1ivzjsh/judge_john_astin_the_frighteners/"
    },
    {
        "id": "1ivga4c",
        "author": "exally__",
        "title": "Unexpected movies that have an all-time cast",
        "content": "Unexpected movies that have an all-time cast\n\nWatching The Faculty (1998) after 22 years. The cast is crazy good. \n\nWas watching it and everyone of main cast and supporting actors are recognisable from other rolls.\n\nJon Stewart, Salma Hayek, Famke Jensen, Robert Patrick. Jordana Brewster, ... are just some of the ones I forgot about.\n\nCrazy good cast.\n\nSo what other movies cam you think of that just have an unexpected well rounded cast. \n\nNot talking about movies where a good ensemble is expected. Or even if the movie started the careers of a bunch of actors (LOTR for example).",
        "upvotes": 279,
        "comments": 254,
        "media": null,
        "permalink": "/r/movies/comments/1ivga4c/unexpected_movies_that_have_an_alltime_cast/"
    },
    {
        "id": "1ivnvv2",
        "author": "fartatwork",
        "title": "What movie made you want to start working out?",
        "content": "I feel like a lot of people have a specific movie where the actor looks so in shape that it inspires you to start working out. For me I remember seeing Brad Pitt in Fight Club and thinking “Holy shit, that’s my goal” \nMore recently it was Jake Gyllenhaal in both Southpaw or Roadhouse. \n\nWhat movie made you feel this way?",
        "upvotes": 75,
        "comments": 295,
        "media": null,
        "permalink": "/r/movies/comments/1ivnvv2/what_movie_made_you_want_to_start_working_out/"
    },
    {
        "id": "1iw1uzl",
        "author": "Rageminusenthusiasm",
        "title": "A film that made you feel bad about liking the original.",
        "content": "Sequels are often a death-punch to the possibility of further films or a franchise. There are red-flags for money grabs…changing Directors, only one or more oft none of the original actors in the 2nd film, etc.\n\nI’m glad not a lot of people have heard of S. Darko and such, but that’s the inspiration film.",
        "upvotes": 11,
        "comments": 77,
        "media": null,
        "permalink": "/r/movies/comments/1iw1uzl/a_film_that_made_you_feel_bad_about_liking_the/"
    },
    {
        "id": "1ivqh9v",
        "author": "BunyipPouch",
        "title": "Berlin Film Festival Winners: ‘Dreams (Sex Love)’ Wins Golden Bear for Best Film, Andrew Scott (Richard Linklater's 'Blue Moon') &amp; Rose Byrne (A24's 'If I Had Legs I’d Kick You) Take Acting Honors",
        "content": "",
        "upvotes": 55,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QJGwNkjZxxjr5ZoNPUvYY3LAyziQV5wz0vXb1SKqkq0.jpg?auto=webp&amp;s=e2e7bbb14a524a384b08908e4e28018c929a285a"
        },
        "permalink": "/r/movies/comments/1ivqh9v/berlin_film_festival_winners_dreams_sex_love_wins/"
    },
    {
        "id": "1iv5x61",
        "author": "MarvelsGrantMan136",
        "title": "Tom Holland's 'Spider-Man 4' Delayed a Week to July 31, 2026",
        "content": "",
        "upvotes": 1759,
        "comments": 191,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0YuxiZRtfNYD0sCS_tujMVVI-g9iYdCB2penxvzS5gc.jpg?auto=webp&amp;s=a1490aebc0843a027636815cfa3febf6b949d8b5"
        },
        "permalink": "/r/movies/comments/1iv5x61/tom_hollands_spiderman_4_delayed_a_week_to_july/"
    },
    {
        "id": "1iuqnxv",
        "author": "Robemilak",
        "title": "Nicole Kidman Worked With 19 Women Directors in Eight Years",
        "content": "",
        "upvotes": 9764,
        "comments": 570,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ncKi0eEpaFRjCm8K5enXQFaHT1yrQVsSuWzKvOgN7Kc.jpg?auto=webp&amp;s=945d11b4c7e41cee47a10e1e21e610c5ba3e818e"
        },
        "permalink": "/r/movies/comments/1iuqnxv/nicole_kidman_worked_with_19_women_directors_in/"
    },
    {
        "id": "1iv0ftu",
        "author": "cmaia1503",
        "title": "Groping Allegations Against Director Of Trump Film ‘The Apprentice’ Leads To Ali Abbasi Breakup With CAA, Entertainment 360 &amp; Law Firm",
        "content": "",
        "upvotes": 2206,
        "comments": 79,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-YqqskiiYkJ9YxUwrzEjIutQ_0FyTSms0lJzRb-VB7w.jpg?auto=webp&amp;s=413504c9f4b0284d1c5e165f7fa564c10cfecb79"
        },
        "permalink": "/r/movies/comments/1iv0ftu/groping_allegations_against_director_of_trump/"
    },
    {
        "id": "1iw3trn",
        "author": "Top_Cranberry_3254",
        "title": "Great movies where supporting actor arc is your favorite part with rewatches",
        "content": "Sometimes when you first watch a movie, the protagonist(s) are so front and center that while you realize the supporting characters are good, you don't realize how important they are to the quality of the film. This can be because they have less screen time or they play a villain. But after watching it several times, you start to realize that you prefer the supporting character's part even more than the protagonist, at least in terms of several watches, because the characters are more rich and meaningful than first realized.\n\nIt just dawned on me recently rewatching Forrest Gump that as much as I love Gump's journey, I now find Lieutenant Dan's to be my favorite character arc.\n\nWhat are some movies where the supporting actor(s) with less screen time have wound up being perhaps your favorite chacracter arc of a great movie. Here are some examples so far imo:\n\nThe Dark Knight: Harvey Dent/Aaron Eckhart\n\nForrest Gump: Lietenant Dan/Gary Sinise\n\nJaws: Quint/Robert Shaw\n\nGladiator: Commodus/Joaquin Phoenix",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1iw3trn/great_movies_where_supporting_actor_arc_is_your/"
    },
    {
        "id": "1iw2u22",
        "author": "PlumeriaOtter",
        "title": "Movie title-help!",
        "content": "There was a movie that my kids and I watched when they were younger between 2015-2018. It was on Netflix— I highly believe it was an international animated film— the plot is: a group of children from other countries visit the United States to warn about the dangers of technology and how it’s harming the world. One of the kids has a special connection with nature and animals, able to communicate with them. They try to convey a message about how the world is being hurt by technology, with a key focus on a tree that symbolizes nature’s power and connection to the world. The kids had Southeast Asian traditional golden necklaces that stacks up to make their neck look longer—They also met this boy from America who had father in the government and they were trying to warn him about technology.  Eventually the technology was taking over the planet and the special kid was able to communicate with this tree to tell others to unplug everything to help earth heal.  \n\nI hope someone knows what I’m talking about!!!  I have tried to Google it but I couldn’t find it. ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1iw2u22/movie_titlehelp/"
    },
    {
        "id": "1ivzu83",
        "author": "PooperScooper1124",
        "title": "Strawberry Mansion Fans?",
        "content": "Does anyone like this movie as much as I do? This has got to be my favorite movie and I see no hype for it. Like yeah it's definitely not a movie for everyone but it's so good and I'd expect somewhat of a fanbase. I just can't understand how this movie doesn't just feel like home to someone else at all. Do most people just think it's bad? Because if that's the case I feel like they just don't understand it.\nNot only is the story is an amazing critique of capitalism and monopolies controlling and destroying your life, but also it just has this nostalgic feel to it that makes you feel like you understand it all.",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/movies/comments/1ivzu83/strawberry_mansion_fans/"
    },
    {
        "id": "1iw2s83",
        "author": "AlarmedViolinist7215",
        "title": "In defense of The Watchers (2024)",
        "content": "I’m going to put a spoiler tag just in case. \n\nThe Watchers is far from a perfect movie. It’s flawed and has some serious issues. I just see so many people hating on it when I feel like it wasn’t that bad and doesn’t warrant so much hate so I’m going to attempt to defend the watchers. \n\nHonestly, I’d probably watch it again if it came to streaming. But I’d just stop at when they get rescued. For me, it’s a perfect movie up until that point. This may be my personal preference but I’m able to just disconnect and suspense disbelief if I like the movie enough. I’m sure there’s lots of errors or details that I was able to ignore. \n\nI was on the edge of my seat for the first half, the coop part. It was full of suspense. I liked the setting too. The isolation of the woods and the small square of the coop, added to the suspense and the dread. It all felt very atmospheric. The monsters were unique too. I forgot what I read but accidentally read an article that said the monsters were fairies and was immediately turned off for a little bit. Them being fairies just made me roll my eyes. I love monsters but not fairies lol. They can’t be scary lol. But these fairies were scary and I loved it. The monster design was cool as well, so creepy and unsettling. I liked the folklore and history of the fairies as well. I wanted to solve all the mysteries of the story. \n\nFor me, in the second half, it all fell apart. I hated what happened when they escaped. Also if you think that death as they were escaping is stupid like I do. Blame the book. It came from there. It felt like two different movies to movie. When they escaped, it felt like a whole different movie. Also the professor office still being there? Lol. I get that it’s prettier cinematically for her to look through his office but c’mon. I couldn’t suspense my disbelief on that one. \n\nThere’s a lot wrong with it for sure, but it’s still overall an entertaining, suspenseful, and unique movie. I think people are too hard on it sometimes. The trailer was killer too. \n\nI’m fragile so please don’t tear me apart too badly in the comments. Trust me, i know it’s not perfect and there’s millions of better movies. For a first time director, based on a book, it’s a pretty good movie. \n",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1iw2s83/in_defense_of_the_watchers_2024/"
    },
    {
        "id": "1iv1y37",
        "author": "themaddogmax",
        "title": "‘Phantasm’ Star Reggie Bannister Enters Hospice Care; Fans Can Send Cards &amp; Letters to This Address",
        "content": "",
        "upvotes": 714,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/x_CqgpgxjE08Zas7f12W-ip7akxFFnLuVIA3H8-2aWE.jpg?auto=webp&amp;s=860f46113af5ded0dd695db473359b715044e5c9"
        },
        "permalink": "/r/movies/comments/1iv1y37/phantasm_star_reggie_bannister_enters_hospice/"
    },
    {
        "id": "1iw4vug",
        "author": "Axxkicker",
        "title": "Characters you initially dislike but end up siding with",
        "content": "I’m watching Three Billboards Outside Ebbing Missouri and was struck by the character change of Sam Rockwell’s’ Dixon.  His character totally changes over the course of the film. Starting out as a somewhat humorous yet ill willed and racist  deputy who becomes someone more redeemable and upstanding. \n\nCurious if any other characters you’ve encountered have a similar arc. ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1iw4vug/characters_you_initially_dislike_but_end_up/"
    }
]