[
    {
        "id": "1lumzpk",
        "author": "LarryCharlesAMA",
        "title": "Hi reddit, I'm Larry Charles. You might know me as the director of BORAT, BRUNO, THE DICTATOR, and DICKS: THE MUSICAL. I’ve also directed many of your favorite episodes of CURB YOUR ENTHUSIASM &amp; wrote many of your favorite SEINFELD episodes. My new book, COMEDY SAMURAI, is out now. Ask me anything!",
        "content": "Hi reddit, I'm Larry Charles. You might know me as the director of BORAT, BRUNO, THE DICTATOR, RELIGULOUS, DICKS: THE MUSICAL, MASKED AND ANONYMOUS and ARMY OF ONE. I’ve also directed many of your favorite episodes of CURB YOUR ENTHUSIASM and wrote many of your favorite SEINFELD episodes. My new book, COMEDY SAMURAI, is out now. It chronicles my life and work in the battleground of American comedy. Please, I beg you, ask me anything!\n\n**Here's where you can purchase my book:**\n\n[https://www.hachettebookgroup.com/titles/larry-charles/comedy-samurai/9781538771549/?lens=grand-central-publishing](https://www.hachettebookgroup.com/titles/larry-charles/comedy-samurai/9781538771549/?lens=grand-central-publishing)\n\nAsk me anything! I'll be back at 3 PM ET today to answer your questions.\n\n**Bio and more information:**\n\nFrom Peabody, Golden Globe, and Emmy Award-winning writer/producer/director Larry Charles, COMEDY SAMURAI: 40 YEARS OF BLOOD, GUTS, AND LAUGHTER is a rollicking journey through modern American comedy, as he shares behind-the-scenes stories from his life\\&amp;#39;s work.\n\nGrand Central will publish Charles’s memoir on June 17, 2025. To tell Larry Charles’s life story is to tell the story of modern American comedy. Over the last 40 years, few comedians have been a part of so many iconic, beloved projects. Larry was one of the original writers and producers on the first five seasons of Seinfeld, executive produced both Curb Your\n\nEnthusiasm and Entourage while directing 18 episodes of Curb and served as the showrunner for Mad About You. His film directing credits include Borat, Bruno, and The Dictator, the comic documentary Religulous (starring Bill Maher), and Masked and Anonymous (which he co-wrote with Bob Dylan who stars).\n\nIn Comedy Samurai, Charles pulls back the curtain on the making of his successful projects, offering sharp, never-before-told anecdotes about Jerry Seinfeld, Sacha Baron Cohen, Bill Maher, Bob Dylan, Nic Cage, Mel Brooks, Julia Louis-Dreyfuss, and Larry David, among many others.\n\nLarry Charles rose from the mean streets of Brooklyn and the working-class housing projects of Donald Trump’s nefarious father Fred, to become the director of Borat, Bruno, The Dictator and Religulous amongst others. He directed Bob Dylan and an all-star cast (Jeff Bridges, John Goodman, Jessica Lange and Penelope Cruz among others) in the film, Masked an Anonymous which he and Dylan wrote together. He has also directed numerous episodes of Curb Your Enthusiasm and was one of the original writers and producers of Seinfeld. Larry is a Peabody, Golden Globe, and Emmy-award winner. Since the Malibu fires, he, and his wife and two dogs are vagabonds.\n\nBack at 3 PM ET to answer your questions!\n\n\n\n",
        "upvotes": 212,
        "comments": 241,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/pk0c6pt13nbf1.jpeg?auto=webp&amp;s=c5eb6c3d1705132602f36864169aaf4a15394d77"
        },
        "permalink": "/r/movies/comments/1lumzpk/hi_reddit_im_larry_charles_you_might_know_me_as/"
    },
    {
        "id": "1lv75s0",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Jeremy Sumpter - Monday 7/14 at 5:00 PM ET - Lead Actor of 2003's 'Peter Pan'",
        "content": "",
        "upvotes": 29,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/15qof5m2crbf1.png?auto=webp&amp;s=9f9f7412c4a557abd267de7366681d3b45895728"
        },
        "permalink": "/r/movies/comments/1lv75s0/amaqa_announcement_jeremy_sumpter_monday_714_at/"
    },
    {
        "id": "1lut620",
        "author": "MarvelsGrantMan136",
        "title": "Denis Villeneuve’s ‘Dune 3’ Gets Official Title 'Dune: Part Three', Will Be Shot With Imax Cameras",
        "content": "",
        "upvotes": 13692,
        "comments": 1444,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/AIDadH49N1ZgX5rCrWnVJ--85poerbVbQtG43LY0_No.jpeg?auto=webp&amp;s=12132d558addd68a18682a884e7e49c2ddd04d5e"
        },
        "permalink": "/r/movies/comments/1lut620/denis_villeneuves_dune_3_gets_official_title_dune/"
    },
    {
        "id": "1lux4kl",
        "author": "ICumCoffee",
        "title": "'Superman' - Review Thread",
        "content": "[**Rotten Tomatoes:**](https://www.rottentomatoes.com/m/superman_2025) **87% (135 Reviews) -**  ***Certified Fresh***\n\n* **Critics Consensus**: Pulling off the heroic feat of fleshing out a dynamic new world while putting its champion's big, beating heart front and center, this Superman flies high as a Man of Tomorrow grounded in the here and now.\n\n[**Metacritic**:](https://www.metacritic.com/movie/superman-2025/) **71 (42 Reviews) -** ***Generally Favorable***\n\nReviews:\n\n[Variety (80)](https://variety.com/2025/film/reviews/superman-review-james-gunn-david-corenswet-1236444126/)\n\n&gt;The super-busy quality of “Superman” works for it and, at times, against it. The movie rarely slows down long enough to allow its characters to meditate on their shifting realities. That’s one reason it falls short of the top tier of superhero cinema (“The Dark Knight,” “Superman II,” “The Batman,” “Guardians”). I’d characterize the film as next-level good (a roster that includes “Iron Man,” “Thor,” “Batman Begins,” “Captain America,” and the hugely underrated “Iron Man 3”). Yet watching “Superman,” we register the layered quality of the conflicts, and we’re drawn right inside them. Gunn constructs an intricate game of a superhero saga that’s arresting and touching, and occasionally exhausting, in equal measure\n\n[The Hollywood Reporter (80)](https://www.hollywoodreporter.com/movies/movie-reviews/superman-review-david-corenswet-rachel-brosnahan-james-gunn-1236305764/)\n\n&gt;What matters most is that the movie is fun, pacy and enjoyable, a breath of fresh air sweetened by a deep affection for the material and boosted by a winning trio of leads.\n\n[DEADLINE](https://deadline.com/2025/07/superman-review-james-gunn-reboot-1236450641/)\n\n&gt;Overall, Gunn might be trying to do too much here, basically throwing everything against the wall and hoping some of it sticks. More than enough does in this entertaining new direction, but at times *Superman* suffers from overload, much like Gunns’ *Guardians of the Galaxy* trilogy, which wore out its welcome with Vol. 3 where Rocket unfortunately got the *Babe: Pig in the City* treatment. Nevertheless he is a talented and skilled director, no question, and one with optimism himself. It will be interesting to see where the future lies for DC under his (and Safran’s) more hopeful vision.\n\n[Indiewire (58)](https://www.indiewire.com/criticism/movies/superman-movie-review-james-gunn-1235137386/)\n\n&gt;Gunn is right to recognize that a certain amount of silliness is key to Superman’s charm, but here it mostly just distracts from the seriousness of what’s at stake. It’s hard to make a comic book come to life at the same time as you’re trying to bring life into a comic book, just as it’s hard not to admire Gunn for trying. But it’s even harder to care if a man can fly when there isn’t any gravity to the world around him. Grade: C+\n\n[IGN (8)](https://www.ign.com/articles/superman-2025-review-james-gunn-david-corenswet-rachel-brosnahan-nicholas-hoult)\n\n&gt;Superman is a wonderfully entertaining, heartfelt cinematic reset for the Man of Steel, and a great new start for the DC universe on the big screen.\n\n[The Atlantic (90)](https://www.theatlantic.com/culture/archive/2025/07/superman-movie-2025-review/683462/)\n\n&gt;The First Superman Movie Worth Watching in Years. The newest take on the caped hero wisely embraces his corniness.\n\n[Consequence (83)](https://consequence.net/2025/07/superman-review-james-gunn-2025/)\n\n&gt;Grim and gritty are words this movie firmly rejects, instead leaning into the human side of everyone involved, even its villains. There are a few choices that work less well than others, but the end result is a movie that doesn't sacrifice its titular character in service to franchise-building. Instead, it focuses on celebrating the values that Superman himself has embodied from the beginning.\n\n[Collider (80)](https://collider.com/superman-2025-review-james-gunn-dc-david-corenswet/)\n\n&gt;Superman is a magnificent feat, a film that makes the Man of Steel fascinating in a way we’ve rarely seen on film, with a take on the hero that is trenchant, clever, and delightful. Gunn is paying tribute to the past while also making a very clear mark on this world’s future, crafting an introduction to the DCU that inherently makes the viewer want to know where this world goes from here. At this point, it’s rare for superhero films to give a sense of wonder and a reminder of how beautiful these films can be when executed well. But Gunn has brought optimism, hope, and care back to Superman. It ends up becoming one of the best DC films in years, and one of the best movies of the summer.\n\n[The Guardian - UK (2/5)](https://www.theguardian.com/film/2025/jul/08/superman-review-david-corenswet-james-gunn)\n\n&gt;From the very beginning, this new Superman is encumbered by a pointless and cluttered new backstory which has to be explained in many wearisome intertitles flashed up on screen before anything happens at all. Only the repeated and laborious quotation of the great John Williams theme from the 1978 original reminds you of happier times.\n\n[The Wrap (88)](https://www.thewrap.com/superman-2025-review-james-gunn-david-corenswet/)\n\n&gt;A fabulously smart and entertaining film whose flaws stem from trying too hard… which are the best flaws a film can have.\n\n[Entertainment Weekly (67)](https://ew.com/superman-review-david-corenswet-rachel-brosnahan-soar-kryptonite-script-11768207)\n\n&gt;Whether Gunn fell victim to the kryptonite of excessive studio notes, his desire to populate the film with his stalwart company of actors, or the hubris of not needing to offer reasons to be invested in these characters beyond the mere fact of their existence is unclear. Because there is an unquestionable love for the material and a passion for the goofier, larger-than-life scenarios of comic book lore. With a cast this excellent, there's a capacity for something truly super in a future film — if only Gunn chooses to put the characters' humanity first. **Grade: B-**\n\n[BBC (3/5)](https://www.bbc.com/culture/article/20250708-superman-review)\n\n&gt;It's a shame that Gunn didn't give his story more time to breathe. It's a shame, in particular, that he didn't devote more time to showing us that Superman really is the paragon that his supporters keep saying he is. Corenswet is well cast – he has plenty of all-American charm both as Superman and as his mild-mannered alter ego, Clark Kent – but we have to take it on trust that he is a selfless gentleman who helps his friends and enjoys Lois Lane's company. We don't see any of that. Indeed, Corenswet plays him as an oddly hot-headed manchild who can't get through a conversation with his girlfriend without shouting angrily at her. Was Gunn racing through his material so fast that he forgot to put in the scenes that show Superman's sweeter and nobler side? Maybe so. In a film that whirls with flying dogs and bright green baby demons, the most bizarre element is a Man of Steel who keeps having meltdowns.\n\n[Empire Magazine - UK (2/5)](https://www.empireonline.com/movies/reviews/superman-2025/)\n\n&gt;David Corenswet takes on the blue-and-red mantle admirably, and glimpses of Gunn’s signature sense of fun shine through — but a lack of humanity, originality and cohesion means the movie around them just doesn’t work.\n\n[Rolling Stone (80)](https://www.rollingstone.com/tv-movies/tv-movie-reviews/superman-review-james-gunn-dc-universe-1235374965/)\n\n&gt;It’s faint praise, even in the post-MCU era of the genre, to say that Superman is a solid superhero film; the caveat is hiding in plain sight. What Gunn has pulled off is something more complicated, more interesting, and far tougher: He’s given us a Superman movie that actually feels like a living, breathing comic book.\n\n[SlashFilm (80)](https://www.slashfilm.com/1906722/superman-james-gunn-movie-review/)\n\n&gt;Yes, \"Superman\" is a frequently corny movie because Superman is a corny character, a Kansas farm boy alien who saves squirrels in danger and listens to lame pop music. There's nothing grim or dark here, just a real sense of entertaining silliness that left a big, stupid smile on my face. In our current media landscape, such an approach feels surprisingly bold.\n\n[Independent - UK (4/5)](https://www.the-independent.com/arts-entertainment/films/reviews/superman-review-james-gunn-david-corenswet-b2782165.html)\n\n&gt;David Corenswet, Rachel Brosnahan and Nicholas Hoult lead a movie that doesn’t just serve as a referendum for superhero films, but for the cinematic future of DC as a whole.\n\n[New York Times (90)](https://www.nytimes.com/2025/07/08/movies/superman-review.html)\n\n&gt;As both a story on its own and a prequel to a whole bunch of others, this movie must introduce us to a variety of characters we’ll meet later, and it does it without feeling too much like fan service or exposition.\n\n[Vulture (90)](https://www.vulture.com/article/review-james-gunns-superman-cant-help-but-be-political.html)\n\n&gt;There’s a lot about how we complicate and obfuscate what should be obvious goods, such as saving the lives of children. But the film’s approach isn’t ham-fisted, and it makes room for gleefully fun stuff, too.\n\n[The Times - UK (2/5)](https://www.thetimes.com/culture/film/article/superman-film-review-david-corenswet-vbzrgpdhh)\n\n&gt;This migraine of a movie is superhero soup. David Corenswet is serviceable as Hollywood’s latest Man of Steel, but director James Gunn has turned the ninth big-screen film into an indigestible mush\n\n[The Irish Times (2/5)](https://www.irishtimes.com/culture/film/review/2025/07/08/superman-review-utterly-charmless-and-as-funny-as-toothache/)\n\n&gt;The cartoonish closing battles make it clear that, not for the first time, Gunn is striving for high trash, but what he achieves here is low garbage. Utterly charmless. Devoid of humanity. As funny as toothache.\n\n\\---\n\n**SYNOPSIS:**\n\n&gt;Follows Superman as he reconciles his heritage with his human upbringing. He is the embodiment of truth, justice and a brighter tomorrow in a world that views kindness as old-fashioned.\n\n**STARRING**:\n\n* David Corenswet as Clark Kent / Superman\n* Rachel Brosnahan as Lois Lane\n* Nicholas Hoult as Lex Luthor\n* Edi Gathegi as Michael Holt / Mister Terrific\n* Anthony Carrigan as Rex Mason / Metamorpho\n* Nathan Fillion as Guy Gardner / Green Lantern\n* Isabela Merced as Kendra Saunders / Hawkgirl\n* Skyler Gisondo as Jimmy Olsen\n* Wendell Pierce as Perry White\n* Beck Bennett as Steve Lombard\n* Mikaela Hoover as Cat Grant\n* Alan Tudyk as Superman Robot #4\n* Sara Sampaio as Eve Teschmacher\n* María Gabriela de Faría as Angela Spica / The Engineer\n* Pruitt Taylor Vince as Jonathan 'Pa' Kent\n* Neva Howell as Martha 'Ma' Kent\n\n**DIRECTED BY:** James Gunn\n\n**WRITTEN BY:** James Gunn\n\n**PRODUCED BY:** Peter Safran, James Gunn\n\n**CINEMATOGRAPHY:** Henry Braham\n\n**EDITED BY:** William Hoy, Craig Alpert\n\n**MUSIC BY:** John Murphy, David Fleming\n\n**RELEASE DATE:** July 11, 2025\n\n**RUNTIME:** 2h 9m\n\n**BUDGET:** $225 Million",
        "upvotes": 4401,
        "comments": 2055,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VYE8vfolHs_p2fjTta1mmepfwdQ5IPx6uykET6HisOk.jpeg?auto=webp&amp;s=7fb0bd6217cb5d08d0684ae338808edb236c7cdd"
        },
        "permalink": "/r/movies/comments/1lux4kl/superman_review_thread/"
    },
    {
        "id": "1lv1i7s",
        "author": "MarvelsGrantMan136",
        "title": "Max Will Change Back to HBO Max on Wednesday (July 9)",
        "content": "",
        "upvotes": 2322,
        "comments": 251,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sK7fuQBNLwofGFxTZpD4tO6ycgLavavpd_AOvY9-aEU.jpeg?auto=webp&amp;s=6fe96cae62f6d0454d58504b7faf20649e5f721e"
        },
        "permalink": "/r/movies/comments/1lv1i7s/max_will_change_back_to_hbo_max_on_wednesday_july/"
    },
    {
        "id": "1lv5nmi",
        "author": "lnsknndy",
        "title": "Name a movie recommendation with a plot twist you 100% didn't see coming",
        "content": "I’m on the hunt for movies with plot twists that genuinely caught you off guard, you know something that would make you go \"wait, WHAT just happened?\" kind of twists. To give you an idea of what I’ve already seen, I watched Fractured a couple of years ago and thought it was really good, but I didn’t expect it to mess with my head the way it did. Recently, I watched Straw, and somehow I walked right into the same kind of twist again, still completely unprepared lmao. I guess enough time had passed for me to fall for it all over again which made it even better, honestly.. Would appreciate it if there's no spoilers tho! Just simply the title, genre, or maybe how you felt about it will do. Thank you!",
        "upvotes": 428,
        "comments": 1048,
        "media": null,
        "permalink": "/r/movies/comments/1lv5nmi/name_a_movie_recommendation_with_a_plot_twist_you/"
    },
    {
        "id": "1luwlgq",
        "author": "chutlover69",
        "title": "What's a good movie where the \"Good guys\" lost?",
        "content": "I'm looking for movies where the protagonists (or the \"good guys\") don’t come out on top in the end — not just morally gray stories, but where things actually go wrong for them and the bad guys win (or at least don’t lose).\n\nCould be a total defeat, a bittersweet ending, or just a situation where things spiral out of control. Bonus points if it still feels satisfying or thought-provoking.\n\nWhat are your favorite films like this?",
        "upvotes": 1266,
        "comments": 2217,
        "media": null,
        "permalink": "/r/movies/comments/1luwlgq/whats_a_good_movie_where_the_good_guys_lost/"
    },
    {
        "id": "1luseg9",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Osgood Perkins' 'Keeper'",
        "content": "",
        "upvotes": 1712,
        "comments": 212,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ou0phvo1bobf1.jpeg?auto=webp&amp;s=92b0aa818f379b733781fb17572cd27ec3b7a2cf"
        },
        "permalink": "/r/movies/comments/1luseg9/official_poster_for_osgood_perkins_keeper/"
    },
    {
        "id": "1lv65ug",
        "author": "ggroover97",
        "title": "Turner Classic Movies Will Stay on David Zaslav’s Side of Warner Bros. (EXCLUSIVE)",
        "content": "",
        "upvotes": 231,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JWWCcoUlbUNac1e65dD-Dinft-uoZBPu5yb_dGw1T6M.jpeg?auto=webp&amp;s=1b59c4d7b549edce22483e329560e21e29529008"
        },
        "permalink": "/r/movies/comments/1lv65ug/turner_classic_movies_will_stay_on_david_zaslavs/"
    },
    {
        "id": "1lv4i8g",
        "author": "NoCulture3505",
        "title": "‘Devil Wears Prada 2’ Adds Lucy Liu, Justin Theroux, B.J. Novak, Pauline Chalamet and More to Cast",
        "content": "",
        "upvotes": 265,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Fls315zq54xS2phg14wDEpjx66R7BoQnFIrdW0UE4Rs.jpeg?auto=webp&amp;s=14cb647980f2a2b5c10f6c669936c39c04e53fa7"
        },
        "permalink": "/r/movies/comments/1lv4i8g/devil_wears_prada_2_adds_lucy_liu_justin_theroux/"
    },
    {
        "id": "1lupdrg",
        "author": "MarvelsGrantMan136",
        "title": "Fandango Raises $1.3 Million to Send Members of Boys &amp; Girls Clubs of America to Movies",
        "content": "",
        "upvotes": 1644,
        "comments": 56,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0TYK_Jm5FOAm7h1QpK1tOA7YNzVD1MGOvBtWqCcty8A.jpeg?auto=webp&amp;s=4f1c6ac63360112a9809fd17da39e730e837c065"
        },
        "permalink": "/r/movies/comments/1lupdrg/fandango_raises_13_million_to_send_members_of/"
    },
    {
        "id": "1lv8v53",
        "author": "FelixStratton",
        "title": "Name a movie better than the book its based upon",
        "content": "I can think of a fair few, most notably L.A. Confidential and Jaws.\n\nL.A. confidential is an incredibly convoluted mess of a story, full of sideplots that try to flesh things out but only drag on. The film streamlines it immensly.\n\nJaws has pointless sideplots that have bearing on the story...but only serve to underline how unlikeable every single character is. Really, everyone in the book is terrible.\n\nAnyone else want to share?",
        "upvotes": 118,
        "comments": 577,
        "media": null,
        "permalink": "/r/movies/comments/1lv8v53/name_a_movie_better_than_the_book_its_based_upon/"
    },
    {
        "id": "1luspim",
        "author": "TiredWithCoffeePot",
        "title": "Official Poster for ‘THE SPONGEBOB MOVIE: SEARCH FOR SQUAREPANTS’",
        "content": "",
        "upvotes": 872,
        "comments": 143,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ox8a5q46dobf1.jpeg?auto=webp&amp;s=b478e07ca79776858f301a80c8e92abd24a20fa0"
        },
        "permalink": "/r/movies/comments/1luspim/official_poster_for_the_spongebob_movie_search/"
    },
    {
        "id": "1luugzm",
        "author": "splader",
        "title": "Better Off Dead (1985) is Unhinged",
        "content": "Okay so I've been on a bit of a Cusack spree lately. Id seen 1408, Gross Point, 2012 etc, but I wanted to watch his older flicks.\n\nSo I watched High Fidelity (which was great) and ~~Don't~~ Say Anything, which was also really good. Next up was this one, Better off Dead. Which I thought would be another romcom.\n\nBro, what was this movie. It was unhinged in an incredible way, from the Airplane style jokes to the relentless paper boys, to the \"testicles all over me\". \n\nI'm pretty sure Lane killed at least like 3 people in this movie lol, and what was with the skiing obsession?! \n\nI need to look into the making/background of this movie because yeah wow, what the heck was that. And of course, endlessly quotable...\n\nEdit: while folks are commenting, any other Cusack recommendations? I'm definitely watching \"One Crazy Summer\", but I'm open to pretty much anything he's in that's also a good movie lol",
        "upvotes": 662,
        "comments": 479,
        "media": null,
        "permalink": "/r/movies/comments/1luugzm/better_off_dead_1985_is_unhinged/"
    },
    {
        "id": "1luv8bz",
        "author": "BunyipPouch",
        "title": "Due to a very successful limited release ($932K in 1,015 theaters last weekend), cult classic mockumentary 'This Is Spinal Tap' is extending its nationwide theatrical re-release, adding screenings on July 8, 9, and 10.",
        "content": "",
        "upvotes": 456,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TCpgPe9jo3nKybYHe1WOX4wFMBnpV_-udxv2mGFHSg0.jpeg?auto=webp&amp;s=9a052ea3904f2174b1442bcb807cb46fdc1c65b3"
        },
        "permalink": "/r/movies/comments/1luv8bz/due_to_a_very_successful_limited_release_932k_in/"
    },
    {
        "id": "1lv2toe",
        "author": "DemiFiendRSA",
        "title": "‘Bridgerton’ Actress Simone Ashley Struts Into ‘Devil Wears Prada 2’",
        "content": "",
        "upvotes": 109,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qPZV9T-QR42jGowKOc3kLprxMKgWNc9StvAd-Y93Fjo.jpeg?auto=webp&amp;s=186b9df8fdf29bf7a96808b0d77558fab9e09fb6"
        },
        "permalink": "/r/movies/comments/1lv2toe/bridgerton_actress_simone_ashley_struts_into/"
    },
    {
        "id": "1luu0pt",
        "author": "IReadTheWholeThing",
        "title": "What's a movie you went into blind and it completely blew you away?",
        "content": "For example I watched A beautiful mind and fight club without knowing anything about them, and I was mind blown by the stories. Some movies hit harder when you go blind. That's why I always try not to read much or watch trailer of the film before watching. \n\nCurious to know which films surprised you the most when you had no idea what to expect. P.S. no spoiler please. ",
        "upvotes": 273,
        "comments": 898,
        "media": null,
        "permalink": "/r/movies/comments/1luu0pt/whats_a_movie_you_went_into_blind_and_it/"
    },
    {
        "id": "1lushol",
        "author": "Siir_Gamer",
        "title": "Whats one movie you have no shame in saying you cried to.",
        "content": "Mine has to be \"Million Dollar Baby\". The ending was just so so so heartbreaking and just the character interactions and development and relationships just got me. Its in my top 5 list of my favorite movies without a doubt. Everything about it is great and it needs to be more well-known and recognized.",
        "upvotes": 296,
        "comments": 831,
        "media": null,
        "permalink": "/r/movies/comments/1lushol/whats_one_movie_you_have_no_shame_in_saying_you/"
    },
    {
        "id": "1lut84e",
        "author": "PokemonGoBao",
        "title": "Whats a movie whether successful or not that changing its title would attract more people to it?",
        "content": "Take, for example, the Harley Quinn birds of prey movie. They changed it because the words Harley Quinn wasn't spelled outright in front of them. What movie title do you think if they changed the name, it would have attracted even more people? \n\nAs I previously posted, a glorious movie I've seen recently was Dungeons and Dragons Honor Among Thieves. But man, is this movie hard to pitch to some people who see dungeons and dragons in the title and nope out. Yet they adore Princess Bride and Monty Python...\n\n...While yea it has dungeons and dragons all over it, you can enjoy it and know 100% nothing and still enjoy yourself. I think it would have been better as its own title, and it gets revealed at the end that it was dungeons and dragons all along.\n\n",
        "upvotes": 205,
        "comments": 232,
        "media": null,
        "permalink": "/r/movies/comments/1lut84e/whats_a_movie_whether_successful_or_not_that/"
    },
    {
        "id": "1lv941k",
        "author": "MonsterBongos",
        "title": "Best under the radar spy movie?",
        "content": "I think I've seen most of the mainstream spy movies, and as far as the novels go I'm a fan of Trevanian, Ian Fleming, John Le Carre, And other masters of the genre. The thing is, is it's really hard to find a good spy movie that I haven't seen that was made after 2000. \nA lot of them just look nearly as badly thought out as \"made-for-television\" movies, not to speak badly of made for television movies, but they just lack a certain adult theme and intellectual quality that makes the great spy movies.\n\nSo I'm thinking that maybe some of you with your excellent tastes, who have never steered me wrong, can recommend some excellent intrigue/spy/political drama movies, that were made after 2000? I also like some historical intrigue, like,\"\"Britannia\" which felt like a combination of a suspense and intrigue movie combined with action and historical reference.\nDoesn't have to be in English, I don't mind reading subtitles see if it's good.\nThanks!",
        "upvotes": 20,
        "comments": 85,
        "media": null,
        "permalink": "/r/movies/comments/1lv941k/best_under_the_radar_spy_movie/"
    },
    {
        "id": "1lv5o6g",
        "author": "SanderSo47",
        "title": "Nicholas Britell ('Succession', 'Moonlight', 'Andor', 'If Beale Street Could Talk', 'Don't Look Up') Scoring Noah Baumbach’s ‘Jay Kelly’ – Starring George Clooney, Adam Sandler, Billy Crudup, and Laura Dern.",
        "content": "",
        "upvotes": 26,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1lv5o6g/nicholas_britell_succession_moonlight_andor_if/"
    },
    {
        "id": "1luy3g8",
        "author": "DiscoPopStar",
        "title": "TIFU - took my wife on a date to see “From Hilde, With Love” - a short review.",
        "content": "This movie is billed as being a daring romance with elements of espionage - set during the resistance in Berlin during the Second World War. \n\nIt is not. \n\nSpoilers -\nWhile it is a very topical movie with a timely message, it is an extraordinarily depressing tale of one woman’s existence in Nazi prisons while she raises a baby while waiting the death penalty. Her romance with her husband is shown in flashbacks, but there is no chemistry between the leads and after he is executed, she just stoically gets on with it. Therefore, no romance. The espionage bit is basically just them typing in morse code, trying to reach the Soviets, but in the end their radio was too weak to send but a single message.  No thrilling espionage.\n\nWhile it is pretty clear what Hilde’s fate is going to be, it is shown very starkly. \n\nI can’t really say I enjoyed it. It is very scary, because people were given the death penalty for basically putting up stickers over Nazi propaganda and listening to a certain radio programme. It isn’t too much of a stretch to see that pattern repeating itself. \n\nTLDR: good movie, but definitely NOT for a date and not what it says on the tin. ",
        "upvotes": 66,
        "comments": 8,
        "media": null,
        "permalink": "/r/movies/comments/1luy3g8/tifu_took_my_wife_on_a_date_to_see_from_hilde/"
    },
    {
        "id": "1lvawyj",
        "author": "KingLance123",
        "title": "Favorite movie by Asian country: Bangladesh",
        "content": "For those who haven't seen, I am seeking to find the [best movie from each country around the globe](https://www.reddit.com/r/movies/comments/1lth326/favorite_movies_from_each_country_asia_afghanistan/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button), starting in Asia. Yesterday was the second day with Bahrain. Today is Bangladesh. \n\nOur second day winner, from Bahrain, is **Hamad and the Pirates (1971) directed by Richard Lyford.** I know nothing about this movie other than it apparently is a Disney movie, yet sadly not on Disney Plus. It is not on 1337x. If anyone has access on how to view it, feel free to comment. \n\nOkay let's do **Bangladesh.**\n\nIt's a little country east of India that oftentimes lingers in India's shadow. So let's let this beautiful country stand on its own today in film!\n\nThe rules:\n\nI) It's not important if the movie was made in the given country, but it *has* to be set there (e.g. the movie can be set in Paris, but hasn't to be a french movie after all). Mainstream American made movies are totally okay, but let's always try to prioritize movies with the native language, if possible. If a movie is split between a few locations I’m looking for where it’s rooted.\n\nII) Animated movies are okay but not documentaries.\n\nIII) On ties I'll just pick the movie with less reviews on imdb to spotlight the lesser known films.\n\nIV) After 24 hours, whatever movie comment gets the most upvotes, wins. make sure that the film is not already mentioned before creating a new comment.\n\nDay 2: Bahrain- Hamad and the Pirates (1971) directed by Richard Lyford\n\nDay 1: Afghanistan- Osama (2004) directed by Siddiq Barmak",
        "upvotes": 10,
        "comments": 10,
        "media": null,
        "permalink": "/r/movies/comments/1lvawyj/favorite_movie_by_asian_country_bangladesh/"
    },
    {
        "id": "1lv3f8h",
        "author": "bourj",
        "title": "You're a detective in a movie. What famous car, gun, and partner would you choose?",
        "content": "Thinking about all the different cop movies, I'm struck by the wonderful variety of detectives who catch criminals, solve crimes, get in car chases and shootouts, all that stuff. So that made me wonder, what TV/Film character would I want to be paired up with? What would I carry for a sidearm? And, perhaps most important to me, what would I drive?\n\nOnly rule for this discussion is that all choices must be \"realistic,\" i.e., not sci-fi weapons, alien partners, etc., nor any superhero/cyborgs, etc. All real cars, real guns, and real humans.\n\nMy choices:\n\nPartner: Serpico. Honest, hard worker, a bit too flashy with the outfits, but a solid backup man with a good mind.\n\nGun: I'm a plain kind of guy who wants something reliable, not too flashy, and with a story behind it. John Ryder's (Rutger Hauer's) S&amp;W Model 28 from \"The Hitcher\" fits the bill perfectly. \n\nCar: So many to choose from, but my heart always goes back to my love for the white 1985 Ferrari Testarossa from Miami Vice.  (Also, I think Serpico could dig the ride.)\n\nWhat would you choose?",
        "upvotes": 32,
        "comments": 139,
        "media": null,
        "permalink": "/r/movies/comments/1lv3f8h/youre_a_detective_in_a_movie_what_famous_car_gun/"
    },
    {
        "id": "1lutmw5",
        "author": "tylerthe-theatre",
        "title": "The Best Horror Movies of 2025 So Far, Ranked: ‘Sinners,’ ‘Final Destination Bloodlines,’ ’28 Years Later’ and More",
        "content": "",
        "upvotes": 85,
        "comments": 151,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1h7ErXunzecK6hNx9GbjDg_85JMMKEraOgCXOWJyTuo.jpeg?auto=webp&amp;s=e0c411fa9a61f8a92aecda4c54e616de80e37366"
        },
        "permalink": "/r/movies/comments/1lutmw5/the_best_horror_movies_of_2025_so_far_ranked/"
    },
    {
        "id": "1luzryi",
        "author": "OcelotFormal895",
        "title": "How old were you when you first watched JAWS?",
        "content": "I believe I was 8 years old. I remember being scared at times. Honestly, the movie still makes me a little nervous when I watch it even as an adult. My kids are getting older now. It didn’t affect me in a negative way, but I’m curious what others think about showing it to kids today, especially younger ones. Did it have a lasting impact on you? Did it keep you out of the water?",
        "upvotes": 39,
        "comments": 177,
        "media": null,
        "permalink": "/r/movies/comments/1luzryi/how_old_were_you_when_you_first_watched_jaws/"
    },
    {
        "id": "1lv6dbj",
        "author": "Bennett1984",
        "title": "Descendant - Trailer",
        "content": "",
        "upvotes": 16,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/piOwGWuuXGTQ5z6_vGAtjJqDtRqxoctrU3h2ks5ugGA.jpeg?auto=webp&amp;s=186a0eb8cbd600cd29aca56efabfeee7acc87f25"
        },
        "permalink": "/r/movies/comments/1lv6dbj/descendant_trailer/"
    },
    {
        "id": "1luzmww",
        "author": "DowntownYorickBrown",
        "title": "Gene Hackman Hall of Fame",
        "content": "I recently recorded a video putting together what I believe to be ultimate Gene Hackman Hall of Fame. In doing so, I set out to create the categories of films that I believe define every true movie star. They are as follows: \n\n\n1. Award Winner - One Must Be a film for which the actor received an Awards nomination, be it Academy Awards or Golden Globes\n\n2. Box Office Smash – Need to have Made 200 Million at the Box Office \n\n3. Two Hander – A movie where the actor stars opposite another major movie star\n\n4. Auteur Turn – A movie where the actor works with an Auteur Director \n\n5. Comedy – Every serious Actor of the last 40 years – This doesn’t mean the movie itself necessarily is a comedy, but the Actor has to give a comedic performance, intentionally or not. \n\n6. Bit Part – This Can be either a brief cameo appearance in the movie or an appearance as part of a larger ensemble\n\n7. Flop – Even our biggest stars have a few flops interspersed throughout their careers and Hackman is so different – the key to this category is choosing a FLOP that is still somehow watchable\n \n8. Wild Cards- Dealer's choice\n\n9. Wild Card – Dealer's choice. \n\nLink to my Gene Hackman Hall of Fame Video: https://youtu.be/8WkqEpqEKls?si=ZIGzWyfODYznEjrv\n\nWhat would your Gene Hackman Hall of Fame look like?",
        "upvotes": 37,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/se8NjxsaqldclC0MfXAnjEhPa5WNBxDj6VbRf_cbpoQ.jpeg?auto=webp&amp;s=3fc5b2f11af2f31fa9e5b797744ec4f5fe64bb26"
        },
        "permalink": "/r/movies/comments/1luzmww/gene_hackman_hall_of_fame/"
    },
    {
        "id": "1luvtgo",
        "author": "PM_Peartree",
        "title": "Sad Tales from Old Hollywood",
        "content": "Jeff Richards, who was in Seven Brides for Seven Brothers and had a brief leading man career, spent his later years living off disability in a trailer\n\nCathy Downs from My Darling Clementine died broke. \n\nSusan Peters's life story is one of the most tragic—possibly the most tragic—I can think of. I'm surprised a film about her life has never been made...yet. \n\nMargaret Sullavan. Mental Breakdown, hearing loss, suicide.\n\nFrances Farmer had such a roughed up life that a Jessica Lange starring film was made about her, \"Frances\", which landed Lange her first Oscar nomination as a Lead actress.",
        "upvotes": 47,
        "comments": 44,
        "media": null,
        "permalink": "/r/movies/comments/1luvtgo/sad_tales_from_old_hollywood/"
    },
    {
        "id": "1lukpah",
        "author": "SubstantialLion7926",
        "title": "2001: A Space Odyssey is the most cinematic movie I've ever seen",
        "content": "I'm 26 and this was just... wow. I saw this yesterday and I am thoroughly impressed with the cinematography and haven't gotten it out of my head. I'm still thinking about the last 20 minutes when Dave gets to the monolith at Jupiter. \n\nI have no idea how they were able to make this movie. I honestly can't even say the movie is dated. It's certainly a product of it's time, but there didn't seem to be anything in it that screams out \"THIS IS OLD!\" other than the ape costumes, but even then it still looks good. I'm not going to pretend like I understood everything that happened in the movie, but damn was it good.",
        "upvotes": 191,
        "comments": 85,
        "media": null,
        "permalink": "/r/movies/comments/1lukpah/2001_a_space_odyssey_is_the_most_cinematic_movie/"
    },
    {
        "id": "1luwsa1",
        "author": "ramblinRed",
        "title": "Rounders made me create a standing poker night with friends that lasted a decade. What movie influenced you to start doing something?",
        "content": "My buddy and I walked out of the theater after seeing Rounders, and decided that we were going to start doing a poker night with some friends. That lasted for nearly every Thursday (with exceptions) for the next 9 or so years). I'm sure it inspired others similarly. \n\nWhat movie can you think of that set off a trend just by existing?\n\nEdit: its funny how no one came up with a Fight Club joke, oh wait, everyone did. We're good on Fight Club jokes for now y'all.",
        "upvotes": 42,
        "comments": 43,
        "media": null,
        "permalink": "/r/movies/comments/1luwsa1/rounders_made_me_create_a_standing_poker_night/"
    },
    {
        "id": "1luj3qw",
        "author": "Agile-Tie-7433",
        "title": "Which actors do you only ever see as themselves, and which completely disappear into their roles?",
        "content": "Had a chat with my fam about this the other night while watching a film. For whatever reason, with some actors, no matter what film I’m watching with them in it, I don’t see the character, I just see the actor.\n\n\nSometimes it’s because they basically play themselves every time, or they’re typecast into the same type of role over and over. Other times it’s just their massive star power overshadowing the entire film.\n\n\nFor example, Marilyn Monroe - one of the earliest examples of this. Hell yeah, she was a great actress, but in every film, all I see is Marilyn. I can never even remember her characters’ names because it’s just her.\n\n\nPerfect example: Dwayne “The Rock” Johnson...he’s been playing himself since the mid-2000s. imo Jack Black too. Jeff Goldblum feels like he’s parodying himself these days. And as much as I love Bruce Willis (😢) after Die Hard, 90% of his roles felt like slight variations of a cavalier John McClane. Pacino too - after Scent of a Woman, all I see is Pacino being Pacino. Watching Tom Cruise in a movie these days feels like Tom Cruise doing cool Tom Cruise things, and as hilarious as I find Ryan Reynolds, Deadpool is basically Van Wilder in a suit. I don't mean to bash on any of them at all, I've enjoyed every single one, i just thought it interesting to point out. \n\n\nBut then you've got absolute superstars like DiCaprio, one of the most recognizable faces on the planet, yet when I watch his movies, I don’t see Leo, I see his characters. Same with guys like Daniel Day-Lewis, Gary Oldman, and Christian Bale, who completely vanish into whoever they’re playing.\n\n\nFunny enough, Johnny Depp used to be on that list for me. the king of vanishing into a role. But now, even though he looks nothing like himself under all that makeup, i'm still sitting there in the theatre like: “yep, that’s Johnny Depp doing his thing.”\n\n\nNicolas Cage is the wildcard. Sometimes I can’t get past that it’s just Nic Cage being Nic Cage, other times his performance is so phenomenal I completely forget it’s him...or maybe because it’s actually John Travolta, playing Nic Cage, playing John Travolta…\n\n\nWhat about you guys? Which actors can you never unsee, and which ones completely vanish into their characters for you?",
        "upvotes": 255,
        "comments": 469,
        "media": null,
        "permalink": "/r/movies/comments/1luj3qw/which_actors_do_you_only_ever_see_as_themselves/"
    }
]