[
    {
        "id": "1otod3y",
        "author": "MoviesMod",
        "title": "Paramount Presents: Edgar Wright's 'The Running Man' - Interactive/Exclusive Reddit Game - In Theaters This Friday!",
        "content": "[https://i.imgur.com/8k3uq7t.gif](https://i.imgur.com/8k3uq7t.gif)\n\nLeading up to Friday's premiere of The Running Man, the studio dropped a Reddit-only game with exclusive footage from the movie revealed to winners. Glen Powell makes a special appearance in the game, and let's just say the new footage holds no punches. Only place to find it will be on Reddit, so give it a play and a watch. Check it out [here](https://www.reddit.com/user/RunningManMovie/comments/1oq7u61/do_you_have_what_it_takes_to_survive_the_running/?p=1).\n\nMake sure to also tune in tomorrow 11/11 for our AMA/Q&amp;A with director Edgar Wright here on r/movies. Live at 10:00 AM ET, answers at 7:15 PM ET.\n\nThe Running Man is out in theaters everywhere this Friday 11/14 and stars Glen Powell.\n\n[Trailer](https://www.youtube.com/watch?v=KD18ddeFuyM)\n\nSynopsis:\n\nIn the near future, \"The Running Man\" is the top-rated show on television, a deadly competition where contestants must survive 30 days while being hunted by professional assassins. Desperate for money to save his sick daughter, Ben Richards is convinced by the show's ruthless producer to enter the game as a last resort. Ratings soon skyrocket as Ben's defiance, instincts and grit turn him into an unexpected fan favorite, as well as a threat to the entire system.\n\n\n\n",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/movies/comments/1otod3y/paramount_presents_edgar_wrights_the_running_man/"
    },
    {
        "id": "1otf40h",
        "author": "MarilynFuAMA",
        "title": "Hi reddit, I'm Marilyn Fu. I'm the screenwriter of ROSEMEAD, a family-drama that stars Lucy Liu. It's based on a tragic true story, has played many festivals (Tribeca, Locarno, Newport, SCAD, Miami, etc), and is out in select theaters soon. Ask me anything!",
        "content": "**Synopsis**:\n\nAn immigrant mother in California's San Gabriel Valley takes desperate measures to help her unstable teenage son as she uncovers his obsession with mass shootings. Inspired by true events.\n\n**Trailer:**\n\n[https://www.youtube.com/watch?v=IwQy6jV1QCM](https://www.youtube.com/watch?v=IwQy6jV1QCM)\n\nRuntime: 97 Minutes - Directed by Eric Lin (Directorial Debut)\n\n**My Bio:**\n\nMarilyn Fu is an American screenwriter of Taiwanese descent whose work focuses on adaptations and true stories that explore American identity through a multicultural lens.\n\nShe is the screenwriter of Rosemead, a feature film starring Lucy Liu and based on the award-winning Los Angeles Times article by Frank Shyong. The film earned her a 2025 Golden Horse Award nomination for Best Adapted Screenplay — one of Asia’s highest honors in cinema.\n\nFu also wrote The Honor List, executive produced by Zoe Saldaña and released by Lionsgate, and The Sisterhood of Night, based on a short story by Pulitzer Prize winner Steven Millhauser, for which she received the Tribeca Film Institute’s Creative Promise Award.\n\nIn television, Fu is a writer on Peacock’s upcoming espionage thriller The Copenhagen Test, starring Simu Liu and executive produced by James Wan. She also adapted the bestselling novels of Karen Kingsbury into The Baxters, a faith-based family drama for Amazon/MGM, executive produced by Will Packer and Roma Downey.\n\nEarlier in her career, Fu was a writer/reporter for over 40 publications under Time Inc. She earned her degrees from the University of Pennsylvania and Columbia University’s School of the Arts, where she became the first recipient of the William Goldman Screenwriting Fellowship and later returned to teach television writing.\n\n\\----------------------------------------------------------------\n\nAsk me anything! I'll be back Wednesday 11/12 at 12:00 PM ET to answer your questions :)",
        "upvotes": 293,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hkcymlnbqf0g1.png?auto=webp&amp;s=3e09da7c131a0f88b7c4a4312473e977df23b052"
        },
        "permalink": "/r/movies/comments/1otf40h/hi_reddit_im_marilyn_fu_im_the_screenwriter_of/"
    },
    {
        "id": "1otrot0",
        "author": "MarvelsGrantMan136",
        "title": "New Teaser Poster for ‘The Super Mario Galaxy Movie’",
        "content": "",
        "upvotes": 2423,
        "comments": 185,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gwnyvt657i0g1.jpeg?auto=webp&amp;s=9378bbbce6fce7b55c7b46717bed4761c25d7873"
        },
        "permalink": "/r/movies/comments/1otrot0/new_teaser_poster_for_the_super_mario_galaxy_movie/"
    },
    {
        "id": "1otx9z4",
        "author": "Powerful_Topic_7046",
        "title": "What’s a movie that is awful, critically panned, the audience hated - and you are embarrassed that you LOVE?",
        "content": "I’ll start….. I literally love Robin Hood: Prince of Thieves 😂😂😂 I shouldn’t. Kevin Costner uses an American accent.  The dialogue isn’t very good. There are a million reasons this movie sucks - and I get it. But I LOVE it. I generally (from what I’m told by others) have decent taste in movies. But I LOVE this movie like an asshole lol what’s your embarrassing pick? ",
        "upvotes": 1137,
        "comments": 2531,
        "media": null,
        "permalink": "/r/movies/comments/1otx9z4/whats_a_movie_that_is_awful_critically_panned_the/"
    },
    {
        "id": "1otjf0j",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Taron Egerton in 'Everybody Wants To F*ck Me' - A comedy thriller set in the world of modern dating",
        "content": "",
        "upvotes": 5949,
        "comments": 602,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qo72dmu7og0g1.jpeg?auto=webp&amp;s=110fa099171994d095fd494044693d57574beec8"
        },
        "permalink": "/r/movies/comments/1otjf0j/first_image_of_taron_egerton_in_everybody_wants/"
    },
    {
        "id": "1otsqeo",
        "author": "lawrencedun2002",
        "title": "Paramount+ to Hike U.S. Prices in First Quarter of 2026",
        "content": "",
        "upvotes": 1389,
        "comments": 299,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/eEilEPsi30-6liMpsK4bX-ZOMazqO4wQJ9Xtk59YnB4.png?auto=webp&amp;s=85e1e4841111c5c1787798a43326678a275b5751"
        },
        "permalink": "/r/movies/comments/1otsqeo/paramount_to_hike_us_prices_in_first_quarter_of/"
    },
    {
        "id": "1oty839",
        "author": "RomanReignsDaBigDawg",
        "title": "Actor Tetsuya Nakadai has died at the age of 92",
        "content": "",
        "upvotes": 410,
        "comments": 43,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GbEKSU-EO7A9D2FpfOU3MKj_GQROV6sfXEQIIehulsg.jpeg?auto=webp&amp;s=eb349ade0f90475451329ee61f1a014206971ae4"
        },
        "permalink": "/r/movies/comments/1oty839/actor_tetsuya_nakadai_has_died_at_the_age_of_92/"
    },
    {
        "id": "1ou0vaw",
        "author": "custards_last_flan",
        "title": "Saw a tiktok about how Michael Cera danced for an hr for the superbad DVD menu, realized I hadn't seen this movie in probably 15 years and rented it, man what classic...",
        "content": "Just finished it and man, Seth Rogan and Evan Goldberg are almost always firing on all cylinders, especially in this era. On the surface the movie is obviously a very funny coming of age teen comedy set in 2007-ish. I realized it's our generations \"Dazed and confused.\" (I was 16 when it came out) it is actually very similar in a lot of ways to that movie while being very different too. The subtext in this movie though, themes of toxic masculinity, the issues transitioning into adulthood, and growing apart from friends really grounds the film. The ending is really wholesome while also being kind of sad. Sure, they love each other and are platonic soul mates lol.  Still, I really get the impression Evan resents Seth for making him a \"loser.\" And now with them probably getting summer girlfriends and going off to different schools, will they stay lifelong friends or finally completely drift apart? A more realistic outcome IMHO. Idk great movie. Definitely one of the best comedies of this century. Thoughts?",
        "upvotes": 196,
        "comments": 69,
        "media": null,
        "permalink": "/r/movies/comments/1ou0vaw/saw_a_tiktok_about_how_michael_cera_danced_for_an/"
    },
    {
        "id": "1otk5vd",
        "author": "SanderSo47",
        "title": "Andrew Niccol's ‘Lord of War’ Sequel, Starring Nicolas Cage and Bill Skarsgard, to Start Filming This Month in Belgium and Morocco; Sylvia Hoeks and Greg Tarzan Join Cast",
        "content": "",
        "upvotes": 1378,
        "comments": 108,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-0f1TIxWCKWAoD5wfKsmBPoAUWNmmXkfa7o2XwimB78.jpeg?auto=webp&amp;s=775e6c79dd4f990857c7a51abea9264b1f7b9464"
        },
        "permalink": "/r/movies/comments/1otk5vd/andrew_niccols_lord_of_war_sequel_starring/"
    },
    {
        "id": "1ou40qy",
        "author": "EconScreenwriter",
        "title": "Tatsuya Nakadai Dead: Japanese Actor in 'Ran,' 'Harakiri' Was 92",
        "content": "",
        "upvotes": 83,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/k1EjomBFGRC3I0HyDmVnWANLJgzJBUra8s2fF1oSUOE.jpeg?auto=webp&amp;s=3dc8ee352559e5678ffb2aefead3d3aec4ee9a76"
        },
        "permalink": "/r/movies/comments/1ou40qy/tatsuya_nakadai_dead_japanese_actor_in_ran/"
    },
    {
        "id": "1otej25",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'Marty Supreme'",
        "content": "",
        "upvotes": 1918,
        "comments": 613,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/caxwcrynrf0g1.jpeg?auto=webp&amp;s=800d549bd5e833cb3493a9bfb615010802350573"
        },
        "permalink": "/r/movies/comments/1otej25/new_poster_for_marty_supreme/"
    },
    {
        "id": "1otu2td",
        "author": "colomb1",
        "title": "Animated Catwoman Was One of 42 Projects Cancelled In 2022 By Zaslav, Ended Up Becoming Dynamic Duo",
        "content": "&gt;",
        "upvotes": 260,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nzy9bJDUriHAuse4MNCNHDZwRIVjo1QTCI__LDU5wTY.jpeg?auto=webp&amp;s=6cdacff5cb7703daf35d79b858bed8df272f247d"
        },
        "permalink": "/r/movies/comments/1otu2td/animated_catwoman_was_one_of_42_projects/"
    },
    {
        "id": "1otqw6b",
        "author": "slhamlet",
        "title": "Michelle Yeoh Breaks Down Her Career from 'Everything Everywhere All At Once' to 'Wicked'",
        "content": "Michelle Yeoh takes us through her illustrious career, including her roles in 'The Owl vs. Bombo,' 'Yes, Madam,' 'Police Story 3: Supercop,' 'Tomorrow Never Dies,' 'Crouching Tiger, Hidden Dragon,' 'Memoirs of a Geisha,' 'Crazy Rich Asians,' 'Everything Everywhere All At Once,' and 'Wicked.' ",
        "upvotes": 357,
        "comments": 109,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Gq-3BLpraOPAppbErGYWN2O78-WIx3z4Y3bBrWAHv-k.jpeg?auto=webp&amp;s=d23ba2839d54ae5044e0a555b3209a56aa4c491d"
        },
        "permalink": "/r/movies/comments/1otqw6b/michelle_yeoh_breaks_down_her_career_from/"
    },
    {
        "id": "1otr72y",
        "author": "BunyipPouch",
        "title": "Mark Ruffalo to Star in Vatican Thriller ‘Santo Subito!’ Directed by Bertrand Bonello ('The Beast') - Based on a true story, Ruffalo will play an American priest summoned by the Vatican to serve as the “devil’s advocate” in the investigation of Pope John Paul II’s life &amp; potential path to sainthood.",
        "content": "",
        "upvotes": 289,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FTmdKvzTJjhQGBozh-0HJNM1A50lNsHyM-f7oUmLWQY.jpeg?auto=webp&amp;s=f25a86af2db5d41378029c5d97c472d845fa6a37"
        },
        "permalink": "/r/movies/comments/1otr72y/mark_ruffalo_to_star_in_vatican_thriller_santo/"
    },
    {
        "id": "1oteqg0",
        "author": "DemiFiendRSA",
        "title": "‘One Battle After Another’ Will Make Digital Debut on November 14; 4K UHD, Blu-Ray and DVD on January 20, two days before the announcement of the nominees for the 98th Academy Awards",
        "content": "",
        "upvotes": 1154,
        "comments": 84,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/quDBhCNu6YfiZiVuvZVzl-Bc-FtfoCCGWKE-ER_Q-NY.jpeg?auto=webp&amp;s=269b1dd75acbb08a1a9e37a923bdc6d0c3dd66ae"
        },
        "permalink": "/r/movies/comments/1oteqg0/one_battle_after_another_will_make_digital_debut/"
    },
    {
        "id": "1othlzk",
        "author": "NoCulture3505",
        "title": "New Poster for \"Jay Kelly\"",
        "content": "",
        "upvotes": 734,
        "comments": 49,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/r5rzv9b3dg0g1.jpeg?auto=webp&amp;s=f11d7c4e199229215d70ef1a511e69d8a236d2c5"
        },
        "permalink": "/r/movies/comments/1othlzk/new_poster_for_jay_kelly/"
    },
    {
        "id": "1otocyh",
        "author": "waitingforthesun92",
        "title": "The USS Indianapolis speech from Steven Spielberg’s “Jaws” (1975)",
        "content": "",
        "upvotes": 330,
        "comments": 51,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3FGwXfzump6TKPoTLtAvd0HbVIuxpCcd4TnGvou8rXQ.jpeg?auto=webp&amp;s=104550db68c255e7d2d0342447f181ed3039fcc7"
        },
        "permalink": "/r/movies/comments/1otocyh/the_uss_indianapolis_speech_from_steven/"
    },
    {
        "id": "1otkhp0",
        "author": "NoCulture3505",
        "title": "Nicole Kidman Joins Osgood Perkins Horror-Thriller ‘The Young People’",
        "content": "",
        "upvotes": 473,
        "comments": 54,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qaX1Og5LBPEBPtDeARnI4kSPoVgOqCXQPWaz_TcIPA0.jpeg?auto=webp&amp;s=9aa7a0cd857af33a39e6e0ca3641bedd5a018f0f"
        },
        "permalink": "/r/movies/comments/1otkhp0/nicole_kidman_joins_osgood_perkins_horrorthriller/"
    },
    {
        "id": "1otxrgy",
        "author": "Wonder-Lad-2Mad",
        "title": "Man, The English Patient (1996) has everything. Mystery, drama, war, romance, tragedy. What a satisfying movie.",
        "content": "I heard about this movie for years and years. It was always on my to watch list, I finally remembered it and decided to give it a watch, going in with high expections and walking out incredibly satisfied.\n\n\nThis is a pleasantly long movie, it's a slowburn mystery that takes it's time to leisurely unfold itself. I think the only time I felt the length was in the third act where it felt like the pacing was briefly lost, but then the ending brings it back.\n\n\nMan, Ralph Fiennese was killing it in the 90's. He's still killing it today too, but he also killed it back in the 90's lmao. Between this, Schindler's List and Red Dragon, he was handing out ace performances left and right.\n\n\n\nWhat an emotional rollercoaster of a movie. The romance is scandelous and seductive, and the tragedy of it all is brutal. What a fucked up fate.\n\n\nI really do appriciate how WW2 is pretty much a background element that peaks it's head into the plot every once in a while.\n\n\n\nHonestly makes me wanna check out the book someday.",
        "upvotes": 67,
        "comments": 66,
        "media": null,
        "permalink": "/r/movies/comments/1otxrgy/man_the_english_patient_1996_has_everything/"
    },
    {
        "id": "1otq7lv",
        "author": "ButlerWimpy",
        "title": "\"Rango\" is a triumph of meta-modern storytelling.",
        "content": "I recently re-watched the 2011 animated film Rango, and was reminded of how well it incorporates contemporary ideas about constructing one's own identity into the framework of a classic \"hero's journey\" morality tale. To me, it juggles postmodern existentialism, individualist modernism, and (somewhat subversively) traditional morality in a clever way. It starts out as existential because the chameleon character starts out with no identity and has to create one based on the situation he finds himself in. (Obviously, he's a chameleon.) But, importantly, he also has an internal idea of the story he'd like to tell based on his imagination, which defines his lonely fish tank existence, and seemingly inspired by cinema (he fancies himself as an actor). Unfortunately for him, he isn't able to successfully bring that self-constructed (but externally influenced) story into reality by his own volition. He fails, and is left wandering in the desert. \n\nThe movie's core scene is brought into play when Rango (which the chameleon names himself) deconstructs the walls of the story he's set himself in and allows himself to be guided across the road, not by way of his own heroism but by closing his eyes and trusting in something external. There he is confronted by the Spirit of the West, who in one sense represents traditional morality (he is portrayed as omniscient, a \"higher being\" as a human amongst animals, and provides Rango moral guidance), but is also representative of both modernist hero narratives (individualist American Westerns) and, complicatedly, postmodern anti-hero narratives (spaghetti Westerns). It would have been more straightforward to just use John Wayne or something and reinforce modernist individualism, but rather than being on-the-nose, using the Man with No Name incorporates the complications of fractured identity into the movie's resolution.\n\nHe tells Rango that Rango is trying to \"find something that isn't out here\"--that \"something\" being Rango's preconceived notion of what his story should be, or needs to be. For the story to be merely existentialist, the thread would end with that deconstruction of the notion of a traditionally defined goal. But, the Spirit follows with the message that \"it's not about you, it's about them.\" This is traditional morality undermining Rango's self-important, self-constructed role as a modernist hero, and reinforcing that he needs to define himself not by a myopic view of what \"heroes should be,\" but instead define himself by the moral service he is able to provide others. The spirit then symbolically \"boxes in\" Rango, framing him as if on a movie screen, implying that Rango has confined himself by the modernist, classic Hollywood ideal of a Hero narrative. The spirit then rides away with the remark that \"no man can walk out on his own story,\" summarizing the philosophy of the film by submitting that we all inescapably exist within a larger story, but despite that larger framework which is the \"story\" of human existence, it is also *our own* story, in which our individual identity and choices must be guided by both traditional morality, and a sense of the individual talents and limitations that make us ourselves. Not solely what the modernist hero story imposes on us.\n\nSo, rather than being simply deconstructionist and postmodern, it is instead meta-modern, acknowledging the postmodern moral uncertainty of a post-WWII, post-nuclear world, and the utility of modernist hero narratives, but rejecting the naivety of either philosophy on its own, and instead incorporating both, along with traditional morality, towards a more nuanced positive message. \n\nIt's not unique in doing so; plenty of other stories since around the 2000s have been doing similar things. But it does a really good job of it. The surreal presentation serves the philosophy of the narrative as well. The rendering of the environments and characters is scientifically realistic, but the logic the world works in, the way things move and act, is cartoony and dream-like. It marries the grounded, directed certainty of modernism with the absurdity of postmodernism. The genre tropes and Western cliches are at once treated with reverence and also undermined by the subtle, tongue-in-cheek acting and occasional naturalistic dialogue. The mariachi owls reinforce the self-awareness that the movie is playing with narrative presentation itself and examining the utility of traditional storytelling frameworks, which is meta-modern.",
        "upvotes": 110,
        "comments": 26,
        "media": null,
        "permalink": "/r/movies/comments/1otq7lv/rango_is_a_triumph_of_metamodern_storytelling/"
    },
    {
        "id": "1ots703",
        "author": "These_Feed_2616",
        "title": "Eddington is fantastic and one of the best films of the year",
        "content": "It’s my favorite film of the year and I think it’s a brilliant film. I might be biased because I’m a huge fan of both Ari Aster and Joaquin Phoenix. First, 2020 was an absolutely insane year and Eddington captured the feel of 2020 perfectly. The insanity, the anxiety, the constant events that keep piling up on top of each other, the sense of darkness of 2020 etc.\n\nThe commentary of corporations and having the movie end on the shot of the data center is perfection. The way that the characters were all in their own world of hatred and division while at the end, it basically shows how the mega rich get what they want at the end of the day anyway. It’s so nihilistic and perfect.\n\nAlso, Eddington is everything I love about cinema smashed into one film. I love dark comedies, I love westerns, I love political thrillers, I love dark/violent films, I love ominous music cues and a sense of dread, I love meta films, I love long films, and Joaquin Phoenix is my favorite actor. This film is literally all of those things smashed into one package. My favorite film of the year and I’m happy I was able to see it with an audience in theaters, my only complaint is that it wasn’t as long as Beau is Afraid lol.\n\nPeople criticize him a lot, but Ari Aster in my opinion is one of the most original directors working today and he’s one of my modern favorites!",
        "upvotes": 72,
        "comments": 42,
        "media": null,
        "permalink": "/r/movies/comments/1ots703/eddington_is_fantastic_and_one_of_the_best_films/"
    },
    {
        "id": "1otsdh9",
        "author": "SanderSo47",
        "title": "November 7-9 Box Office Recap – 'Predator: Badlands' debuts with a great $40M domestically and $79.2M worldwide, the best ever in the franchise. 'Sarah's Oil' and 'Nuremberg' debut solidly with $4.2M and $3.8M. But 'Die My Love' and 'Christy' flop with $2.6M and $1.3M, respectively.",
        "content": "https://preview.redd.it/ok99bh6mbi0g1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=38e990da9512f2b8d0e742c716a71720383df928\n\nAfter a very slow October, the box office reignited with the beginning of November.\n\nThat was mainly due to ***Predator: Badlands***, which posted the best ever debut in the franchise, showing that this IP still has a lot of life at the box office. The rest of the newcomers, however, were a mixed bag. ***Sarah's Oil*** had a very middling debut, although ***Nuremberg*** over-performed projections. \n\nThe real losers, though, were ***Die My Love*** and ***Christy***. The former had one of the worst ever debuts for Jennifer Lawrence and Robert Pattinson, while the latter had one of the worst starts in 2,000 theaters.\n\nThe Top 10 earned a combined $74.9 million this weekend. That's up 20.7% from last year, when ***Venom: The Last Dance*** topped the box office for a third week.\n\nDebuting at #1, ***Predator: Badlands*** opened with a great $40 million in 3,725 theaters. That's easily the best debut in the franchise, even dethroning ***Alien vs. Predator*** ($38 million). This debut is also very close to ***Alien: Romulus*** ($42 million) last year.\n\nEven though ***Prey*** and ***Killer of Killers*** were sent to streaming, Disney had enough confidence in the film that they enlisted Dan Trachtenberg to return as director and giving it a theatrical release. To separate itself from the previous installments, the film went on a bigger scale, positioning the Predator to fight large monsters. And despite casting Elle Fanning as co-lead, it was clear that humans were not the focus of the film. \n\nA few weeks prior, it was revealed that the film would be rated PG-13, the first film in the franchise (excluding ***AvP***) to get it. That led to some disappointment from fans, but the rating did not fundamentally impact the film in a negative way. The rating was mainly because the level of violence wasn't aimed at humans, so the MPAA was a bit lenient in that way. And despite the rating, it still had the reception to justify it; it's sitting at 85% on RT and 71 on Metacritic, which convinced everyone that this is the theatrical ***Predator*** film they were waiting for.\n\nAccording to 20th Century Studios, 61% of the audience was male. Despite the PG-13 rating, it didn't really benefit much from it; only 11% of the audience was 17 and under. They gave it a great \"A–\" on CinemaScore, the best ever in the franchise. Even with some competition on the way, the film should still hold around the same as ***Romulus***. Which means it should be the franchise's first film to crack $100 million domestically.\n\n***Regretting You*** has kept the second place for the third week in a row. The film eased a very light 15%, adding $6.6 million. The film is clearly showing some damn great legs. The film has earned $38.1 million, and it should finish with over $50 million, which is much better than its early prospects.\n\nIn third place, ***Black Phone 2*** eased just 38%, adding $5.1 million this weekend. The film has made $70 million, and it should finish with around $80 million domestically. Not a bad run at all.\n\nIn fourth place, Amazon MGM's ***Sarah's Oil*** debuted with a so-so $4.2 million in 2,410 theaters. It's a soft debut, but it's hard to ask for much better numbers here. On some good news, it scored a rare \"A+\" on CinemaScore, which bodes well for its legs.\n\nComing in over projections, Sony Pictures Classics' ***Nuremberg*** opened with a solid $3.8 million in 1,802 theaters. Its $2,155 per-theater average was also the second best in the Top 10, just behind ***Badlands***. That's a very surprising result, considering that the film didn't have particularly great reviews (69% on RT, 61 on Metacritic) and both Russell Crowe and Rami Malek have struggled in the past few years. Not a bad start, especially compared to two other newcomers we're about to talk about...\n\n***Chainsaw Man – The Movie: Reze Arc*** is holding surprisingly well for an anime title. It dropped just 45%, for a $3.4 million weekend. The film's domestic total stands at $37.8 million.\n\nYorgos Lanthimos' ***Bugonia*** added $3.4 million this weekend. That represents a very light 32% drop, signaling some great word of mouth. Through its first 2 weeks in wide release, the film has amassed $12.2 million (Lanthimos' third highest grossing film) and could crack $20 million, assuming it continues holding well.\n\nIn eighth place, MUBI's ***Die My Love*** flopped with just $2.6 million in 1,983 theaters. In comparison, MUBI's buzzy title ***The Substance*** earned $3.2 million in 1,949 theaters last year. It's one of the worst ever wide debuts for both Jennifer Lawrence and Robert Pattinson.\n\nA film like this was always going to be a tough sell; a film focusing on post-partum depression is not on many moviegoers' minds. Upon premiering in Cannes, MUBI bought the film for a record $24 million (far more than the $12.5 million they spent on acquiring ***The Substance***), which guaranteed at least 1,500 theaters. But it seems like they over-estimated the appeal and its reception; the film is sitting at a 76% on RT, which is solid, but not particularly glowing for an adult drama. It just doesn't have the buzz that ***The Substance*** achieved. So even though MUBI tried an extensive marketing campaign by having many press junkets, the film just didn't attract any interest.\n\nAccording to MUBI, 51% of the audience was male, and 78% was in the 18-34 demographic. They gave it a horrible \"D+\" on CinemaScore, signaling toxic word of mouth. Even though Lawrence has gained some buzz for her performance, it's very unlikely the film can last long with this reception. Especially when there's more Oscar contenders coming up. It would be a surprise if ***Die My Love*** made anything above $6 million domestically.\n\n***Springsteen: Deliver Me from Nowhere*** dropped 44% and added $2.1 million this weekend. That took its domestic total to $20.3 million, and it will finish with around $25 million domestically.\n\nRounding out the Top 10 is ***Tron: Ares***. It dropped 40%, grossing $1.8 million. The film has made a meager $71.2 million, and it only has around $5 million left in the gas tank. \n\nFailing to crack the Top 10 was Black Bear's ***Christy***, starring Sydney Sweeney, which flopped with an abysmal $1.3 million in 2,011 theaters. That's the 13th worst debut for a film playing in 2,000 theaters, and it gets to 11th if we exclude re-releases. That's an abysmal $652 per-theater average.\n\nDespite Sweeney going on a press tour and extensively promoting it, the film just couldn't attract any interest. It was Black Bear's first distributed film, but that just proves the challenge of getting in the theatrical business. The film also lacked an interesting hook or subject matter; Christy Martin may not ring a bell to moviegoers, so they'll be less interested in checking out a biopic. Sweeney's presence has also been marred with controversies over the past months; while it's hard to say it negatively impacted it, it certainly didn't help it. The film's middling reviews (67% on RT) were the nail in the coffin.\n\nAudiences gave ***Christy*** a middling \"B+\" on CinemaScore, which is not a sign of great word of mouth. With zero Oscar buzz, adult dramas coming on its way, and theaters absolutely dropping it with such a pitiful debut, ***Christy*** might struggle to hit $3 million domestically.\n\nLet's cap it off with some great news. Neon released Joachim Trier's ***Sentimental Value*** in 4 theaters, and it debuted with a dazzling $200,031. That's a strong $50,008 per-theater average, which ranks sixth best of the year (fourth best with at least 2 theaters). The film will continue expanding over the next few weeks, hoping to capitalize on some Oscar buzz.\n\n#**OVERSEAS**\n\n***Predator: Badlands*** debuted with $39.2 million overseas, for a great $79.2 million worldwide debut. Like the domestic market, it was the best ever debut for the franchise. The best debuts were in China ($7.4M), UK ($3.2M), Mexico ($2.3M), France ($1.8M) and Japan ($1.7M). China did not over-perform massively like ***Romulus***, but it wasn't expected to do that. From early signs, ***Predator: Badlands*** should easily hit $200 million worldwide, becoming the biggest film in the franchise.\n\n***Regretting You*** added $5.7 million overseas, taking its worldwide total to $70.5 million. \n\n***Black Phone 2*** added $4 million overseas, for a $110 million worldwide total.\n\n***Bugonia*** seems to be showing some small power outside America. It added $3.6 million overseas, taking its worldwide total to $23 million. There's still lots of markets left.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEKEND**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Weapons* | Aug/8 | Warner Bros. | $43,501,217 | $151,550,044 | $268,042,500 | $38M\n*The Strangers: Chapter 2* | Sep/26 | Lionsgate | $5,806,192 | $15,153,346 | $21,293,765 | $8.5M\n*After the Hunt* | Oct/10 | Amazon MGM | $1,529,394 | $3,258,830 | $7,093,629 | $70M-$80M\n\n- Zach Cregger's ***Weapons*** has closed with a fantastic $151 million domestically and $268 million worldwide, far above its $38 million budget. A huge win for original films, and further cementing Cregger as a box office draw (after all, this was sold on his name). Thanks to an incredible marketing campaign, the film was buoyed by great word of mouth (an \"A–\" on CinemaScore, not an easy feat for a horror). Now let's see how his ***Resident Evil*** version does next September.\n\n- Bravo, Renny Harlin. It takes talent to make ***The Strangers: Chapter 2*** fizzle out with just $21 million worldwide. A very underwhelming result, but it's hard to be surprised after the terrible reception to both ***Chapter 1*** and ***Chapter 2***. And there's still another film left to be released. The floor can get lower.\n\n- One of the year's biggest flops, Luca Guadagnino's ***After the Hunt*** has closed with a horrible $3.2 million domestically and $7 million worldwide. For some reason, this cost $70-$80 million, with $20 million going to star Julia Roberts. While the subject matter is challenging, the film's reception did not help it. Originally positioned as a possible Oscar contender, the film shocked many with its Venice premiere, where it earned weak reviews. All buzz went down, and the film vanished without a trace. It marked Guadagnino's latest box office disappointment, and he better hope that his next film fares much better.\n\n#**THIS WEEK**\n\nIt's a very busy week, with four films debuting in wide release.\n\nThe first is Paramount's ***The Running Man***, the new film from Edgar Wright. Based on the novel by Stephen King, it stars Glen Powell as a man who takes part in a dangerous game show where he must survive 30 days to win money. The trailers have emphasized action and the big scale of the game, which is very important in a blockbuster. Will that be enough to top the box office?\n\nThere's also the release of Lionsgate's ***Now You See Me: Now You Don't***, the third installment in the franchise. Jesse Eisenberg, Woody Harrelson, Dave Franco, Isla Fisher, and Morgan Freeman reprise their roles, and they're joined by Justice Smith, Dominic Sessa, Ariana Greenblatt, and Rosamund Pike. The franchise has been lucrative for Lionsgate; each film has made over $330 million worldwide. But the franchise halted 9 years ago, which is a long time to release a sequel. Will the audience still show up or they did just move on?\n\nNeon is also releasing Osgood Perkins' new horror film ***Keeper***, which stars Tatiana Maslany and Rossif Sutherland. Perkins is responsible for two of Neon's highest grossing films, ***Longlegs*** and ***The Monkey***, so he's riding on some good will with the audience. With ***Black Phone 2*** slowing down, could this be a main attraction for horror fans?\n\nAnd finally, A24 is releasing ***Eternity***, starring Miles Teller, Elizabeth Olsen, Callum Turner. The film follows a woman who must choose between two men with whom to spend eternity in the afterlife. Reviews have been positive since its TIFF premiere (85% on RT), so perhaps it could surprise.",
        "upvotes": 76,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/moJquCyw1WzGCY7HB8ZAmJR66NdcwRKiIZaEeMaydZA.png?auto=webp&amp;s=97414a4c2a8a77caaae3762089a3879ea4a5b48b"
        },
        "permalink": "/r/movies/comments/1otsdh9/november_79_box_office_recap_predator_badlands/"
    },
    {
        "id": "1otgg1m",
        "author": "MarvelsGrantMan136",
        "title": "Dog-in-Haunted-House Movie ‘Good Boy’ Sets November 21 Release Date on Shudder",
        "content": "",
        "upvotes": 256,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dWSBFvd21YBBZQ6d-bAWthSyoB_VeEax9x8X7YVo9P0.jpeg?auto=webp&amp;s=0a86f4adca8e86092094f944bd87c49aefbda452"
        },
        "permalink": "/r/movies/comments/1otgg1m/doginhauntedhouse_movie_good_boy_sets_november_21/"
    },
    {
        "id": "1otln2c",
        "author": "NoCulture3505",
        "title": "Edgar Wright’s Closet Picks",
        "content": "",
        "upvotes": 127,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/L_bSo7zvr10xsK6ZJrbyJbl-cDxNkir5NPyyV4szAU4.jpeg?auto=webp&amp;s=69d21a3e2bda34370be6fecd8f3c9d97ead51b2d"
        },
        "permalink": "/r/movies/comments/1otln2c/edgar_wrights_closet_picks/"
    },
    {
        "id": "1otmd7r",
        "author": "darth_vader39",
        "title": "Wicked Witch’s Hat From 1939’s ‘Oz’ Hits Auction Block | It's expected to fetch well above its $3 million sale price from last year.",
        "content": "",
        "upvotes": 101,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Fhjsovow-DsIxrKSLQ3N-EtWnlernuNM1x0OsrUUM6g.jpeg?auto=webp&amp;s=29adfd85604b6ebee2fc933bb01b2726e1a2fa88"
        },
        "permalink": "/r/movies/comments/1otmd7r/wicked_witchs_hat_from_1939s_oz_hits_auction/"
    },
    {
        "id": "1ot5tz7",
        "author": "ForgotenKing",
        "title": "Why don't shows and movies call zombies \"zombies\"?",
        "content": "I get that when the media is made, the people making it want to keep a genre blindness effect, but it ends up being so distracting and stupid. Every time I hear them call zombies \"walkers, biters, ghouls, zeds (like in killing floor)\" it ends up being wayyyy tooo distracting. It often times takes me out of the movie, especially when the movie is trying to be serious 💀. Anyone else also feel this way?  ",
        "upvotes": 1100,
        "comments": 682,
        "media": null,
        "permalink": "/r/movies/comments/1ot5tz7/why_dont_shows_and_movies_call_zombies_zombies/"
    },
    {
        "id": "1otdlbc",
        "author": "JohnnyRock110",
        "title": "Films where the soundtrack almost never stops?",
        "content": "Some films feature little to no music to great effect: *No Country for Old Men*, *A Separation*, etc. So how about films that feature an expansive score or soundtrack of songs that almost never stops? (Albeit with a few exceptions)\n\nI'd be curious to hear more examples, but two I can think of so far are *Casino* — where its songs effectively help tell the story — and *Oppenheimer* — with its immersive score and unrelenting pace that keep the momentum going through its three hour runtime.",
        "upvotes": 258,
        "comments": 487,
        "media": null,
        "permalink": "/r/movies/comments/1otdlbc/films_where_the_soundtrack_almost_never_stops/"
    },
    {
        "id": "1otm4fp",
        "author": "HiImWallaceShawn",
        "title": "Anyone else revisit Disney’s 1996 Hunchback of Notre Dame as an adult and realize it might be their most mature movie?",
        "content": "I recently revisited this movie after having not seen it for probably 20 years. I quickly realized besides the talking, joking gargoyles this felt like the most mature Disney movie I have ever seen. Some of the primary themes of the movie being institutional oppression, religious versus government power, lust, and duty. Felt like a PG-13 movie and if  reworked, could’ve been rated R. Frollo came off to me as one of the most nuanced and interesting villains in all of Disney. Really boosted my opinion of it when rewatching as an adult. \n",
        "upvotes": 83,
        "comments": 83,
        "media": null,
        "permalink": "/r/movies/comments/1otm4fp/anyone_else_revisit_disneys_1996_hunchback_of/"
    },
    {
        "id": "1otddys",
        "author": "PumpkinCarvingisFun",
        "title": "\"The Family Man\" is one of the best Christmas movies ever.",
        "content": "I watch this movie every holiday season (at least) and it elicits more emotion than any other movie I watch at the holidays. The story telling, music, and acting are fantastic. It's also almost liminal with its setting. \n\nDef not a traditional ending to a holiday film, but it's not a traditional ending to any film. ",
        "upvotes": 239,
        "comments": 101,
        "media": null,
        "permalink": "/r/movies/comments/1otddys/the_family_man_is_one_of_the_best_christmas/"
    },
    {
        "id": "1otnvkj",
        "author": "animeking1074",
        "title": "The Plague | Official Trailer",
        "content": "**Logline:** *A socially anxious 12-year-old boy is pulled into a cruel tradition at an all-boys water polo camp.* \n\nIFC plans a platform Dec 24 US release for Oscar qualification, then expanding on Jan 2.",
        "upvotes": 60,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BZSMa4Fh9X0KUDGuAVSTpyHvzEv3llOzKPX3mMdTTDM.jpeg?auto=webp&amp;s=18607e88b72d0044791f18e08e81ce5f2e708fb5"
        },
        "permalink": "/r/movies/comments/1otnvkj/the_plague_official_trailer/"
    }
]