[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 12,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1oomxpo",
        "author": "graemeisverytired",
        "title": "Daniel Craig reads each new Knives Out script like his character - and doesn’t want to have the mystery spoiled for him in advance",
        "content": "“I read them, I suppose, like Benoit... I’m trying to sort of get in Benoit’s head. I don’t read it wanting to know who the murderer is; I want to know what the whole is,\" Craig began. He also added that he told writer-director Rian Johnson, \"I don't want to know!\" when asked by him if he wanted to know who the killer was beforehand. ",
        "upvotes": 22,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oomxpo/daniel_craig_reads_each_new_knives_out_script/"
    },
    {
        "id": "1oobnhv",
        "author": "Crowned_Toaster",
        "title": "Recommend your best dystopian movies.",
        "content": "I would like movies like Never Let Me Go, Paradise, or In Time. Any movie is generally fine as long as it's non-horror and no dogs die in said movies (we recently lost our dog).",
        "upvotes": 27,
        "comments": 58,
        "media": null,
        "permalink": "/r/netflix/comments/1oobnhv/recommend_your_best_dystopian_movies/"
    },
    {
        "id": "1oobl1n",
        "author": "Hackedbytotalripoff",
        "title": "Got hooked to the show \"Sinner\"",
        "content": "I have started watching the first season of Sinner. Oh boy,  I got hooked right away.   I was so intrigued by the storyline, the slow pace that provided background for each of the characters, and the acting.   It is a fantastic show, and it is going to keep me busy. Binge-watching it for a while.",
        "upvotes": 13,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1oobl1n/got_hooked_to_the_show_sinner/"
    },
    {
        "id": "1oodnq9",
        "author": "graemeisverytired",
        "title": "Netflix has found its Bon Clay for One Piece and are once again having us hope for more seasons beyond season 3",
        "content": "\"Fans of One Piece will be familiar with Bon Clay as a member of Baroque Works, the infamous criminal organization that plays a key role in [the Alabasta Arc](https://www.thepopverse.com/one-piece-arcs-ranked-best-worst-luffy-wano-country-enies-lobby-water-7-crunchyroll-marineford). Although originally male in the manga and anime, [initial reports around](https://deadline.com/2025/11/one-piece-cole-escola-bon-clay-1236604228/) Cole Escola’s casting of Bon Clay indicate that the character has been reimagined as non-binary to match the actor. A master of disguise with the ability to change their face into anyone with the touch of their hand, Bon Clay is a formidable opponent who eventually becomes a stalwart ally of Luffy and the Straw Hats in later arcs.\"",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oodnq9/netflix_has_found_its_bon_clay_for_one_piece_and/"
    },
    {
        "id": "1oo862f",
        "author": "wiredmagazine",
        "title": "Premiere: Netflix’s New True Crime Doc Dives Into a Mother’s Mysterious Disappearance",
        "content": "",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oo862f/premiere_netflixs_new_true_crime_doc_dives_into_a/"
    },
    {
        "id": "1ooox3k",
        "author": "giveaway_yt",
        "title": "did supernatural leave netflix",
        "content": "its not anywhere in the search bar i cant find it anywhere. anyone know whats going on has it been removed i just cant find it i watched it earlier now its not showing.",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1ooox3k/did_supernatural_leave_netflix/"
    },
    {
        "id": "1oooet1",
        "author": "chi_guy8476",
        "title": "International Travel - New Account",
        "content": "Looking for some advise, as it seems Netflix is getting increasingly tight on location restrictions. Best friend recently moved from the states to Dublin for a 2 year work stint. They have been using their US account and clicking on travel, this has recently stopped working. To add to the matter she has started traveling weekly, typically visiting 2 to 3 different countries per week (no pattern to it). Is the best course to cancel their existing US plan, and sign up for one at their home in Dublin.  Assuming she checks in at least once a month in Dublin, regardless of how many countries she visits within the month (can vary from in Europe, Australia, Japan/China and then the states for the holidays)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oooet1/international_travel_new_account/"
    },
    {
        "id": "1on4nrc",
        "author": "moodyhippy",
        "title": "i watched Idiocracy for the first time today",
        "content": "after my coworker saw me pour electrolytes in my water and she quoted a line from the movie that i had no idea what she was talking about haha. i enjoyed it, i laughed a lot. kinda wild how on point it is - the ads everywhere, the stupidity, the love of violence. big yikes. ",
        "upvotes": 1732,
        "comments": 249,
        "media": null,
        "permalink": "/r/netflix/comments/1on4nrc/i_watched_idiocracy_for_the_first_time_today/"
    },
    {
        "id": "1oobuzc",
        "author": "N3DSdude",
        "title": "Bro netflix probably knows me better than my own friends lol",
        "content": "Real talk, Netflix definitely has me figured out.\n\nThey know when i’m sad, when i’m bored, when i’m trying to fall asleep to the same show again.\n\nMy continue watching list is basically a mood ring.\n\nand if you ever check one of those leak sites, half your old accounts are just sitting there.\n\nWe’re not private online at all, we just like to pretend we are. Kinda scary but also… whatever, play the next episode 😭",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oobuzc/bro_netflix_probably_knows_me_better_than_my_own/"
    },
    {
        "id": "1oojjfc",
        "author": "beanos4lyf",
        "title": "Murder mindfully season 1, episode 7, 8 minute mark.",
        "content": "Could Bjorn, Toni and sascha have gotten away during their standoff by claiming to have been making a gay porn video?\nRealistically this idea could have worked right?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oojjfc/murder_mindfully_season_1_episode_7_8_minute_mark/"
    },
    {
        "id": "1ooix5m",
        "author": "TromboneAl",
        "title": "Mirror Netflix to TV During Power and Internet Outage?",
        "content": "I've downloaded Netflix shows and would like to watch them on my TV when my power and internet is out. My WiFi is on a battery backup, so it is available.\n\nIf I mirror my Mac screen, Netflix won't allow it (due to DRM, I'm sure). I can cast the video from my android tablet, but I think that depends on an internet connection(?).\n\nI can connect with an HDMI cable, but that is less convenient.\n\nQ1: Does the Netflix casting work even if the internet is out?\n\nQ2: Is there a simple hardware device that will solve this problem?\n\nThanks!",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ooix5m/mirror_netflix_to_tv_during_power_and_internet/"
    },
    {
        "id": "1onmrka",
        "author": "rossfororder",
        "title": "Wayward",
        "content": "The show is initially a thriller about a bunch of kids in a school prison but it's so much more. I loved this show, one of the best I've seen in a long while.\n\nToni Collette as a cult leader is impossibly good. Created and starring Mae Martin.",
        "upvotes": 75,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1onmrka/wayward/"
    },
    {
        "id": "1oog75e",
        "author": "brain_rot_101",
        "title": "Horror movie recommendations please...",
        "content": "I'm a huge fan of this genre and have seen A LOT of these movies, so much so that I've run out of any 'actually good horror movies' to watch. \n\nWould be great if you could recommend me any. I've mostly watched English language's horror, but have also covered popular international ones, so I'm open to those as well.\nWould prefer if the recommendations are closer to the paranormal and slasher genre. \n\n\nPlease don't recommend stuff like Get Out, The Babadook, The wailing, etc. Or ones where the ghost isn't even good enough to scare a kid.\n\nI've liked Conjuring 1 &amp; 2, Scream (earlier movies), Oculus, The Visit, Veronica... you get the idea.\n\nThank you...",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oog75e/horror_movie_recommendations_please/"
    },
    {
        "id": "1ooer1r",
        "author": "AlissaKane",
        "title": "Learning German. Any way to get German language for UK resident",
        "content": "I am currently learning German and have been for a couple years, mostly via Duolingo and speaking to some German friends. I know Duolingo isn't the best and I'd like to be able to watch some shows in German as I believe this will really help me out by hearing the language spoken casually and often with real world usage.  I know the German dubs for many shows exist as my friends have acess to both German and English on their end. However for me, who is British, there is only ever English. From googling a bit it also seems VPNs wont work either as your account still remembers where is is from. \n\nCan anyone give any advice or know a way to get access to additional languages?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ooer1r/learning_german_any_way_to_get_german_language/"
    },
    {
        "id": "1ood3tn",
        "author": "420kai",
        "title": "Netflix no longer working on PC and can't login",
        "content": "Just yesterday, I was using my laptop to watch Netflix, but today when I tried to watch a series, its thumbnail (along with some others) appeared black. Clicking them didn’t load anything. So, I logged out, but now I’m getting the error message: *“Sorry, we are unable to complete that action now. Please try again later.”*\n\nNetflix works completely fine on my mobile and TV.  \nI’ve already tried restarting the router, switching browsers, and even using the app version from the Microsoft Store, but I’m still unable to log in.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ood3tn/netflix_no_longer_working_on_pc_and_cant_login/"
    },
    {
        "id": "1oo0zzb",
        "author": "MusicSavesSouls",
        "title": "El Dorado : Everything the Nazis Hate",
        "content": "Has anyone seen this? It looks like it came out a few years ago, but it is so educational and amazing to watch. This happened almost a 100 years ago, and it is also going on today. The same bullsh\\*t and this was almost 100 years ago!! It makes me wish we would all evolve as humans and live peacefully together. If you hate someone, who is not bothering you or does nothing to affect your life in any way, you have a problem. I really enjoyed this film. Old archives from the Nazi days and a different subject than most Nazi movies. It is wild. I knew Nazis didn't like gay or trans people, but I didn't know to what extent they didn't like them. Now, trans are the enemy, again. Without getting too political, it really looks like we are repeating everything that happened in 1933.\n\nEdited to add: A chilling quote from Hitler, in this documentary. \"Homosexuality has to be combated at all costs, otherwise it will be the end of Germany, the end of the Germanic world.\"\n\nCan't we all learn from history?\n\nIf you want a thought-provoking film, I recommend this one!\n\n",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oo0zzb/el_dorado_everything_the_nazis_hate/"
    },
    {
        "id": "1ooe3i6",
        "author": "RepresentativeState3",
        "title": "If Rian Johnson makes future Knives Out films do you think Netlfix will try and keep the franchise?",
        "content": "If Rian Johnson decides to make Knives Out films beyond Wake Up Dead Man, do you think Netflix will be able to successfully make a play to keep the franchise now that the two film contract is up?\n",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ooe3i6/if_rian_johnson_makes_future_knives_out_films_do/"
    },
    {
        "id": "1ontlmr",
        "author": "Cooper_Inc",
        "title": "Almost finished Shameless US and looking for another series, ideally drama to binge next on Netflix. Some ideal criteria below",
        "content": "* Preferably 5+ seasons\n* Eps \\~45mins long\n* Drama ideally, but not into period dramas\n* Others I've loved are Mad Men, House of Cards, Luther\n* Edit to add also loved Animal Kingdom \n\nAny suggestions on what I can have lined up next?",
        "upvotes": 11,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1ontlmr/almost_finished_shameless_us_and_looking_for/"
    },
    {
        "id": "1oofjn1",
        "author": "Aggravating-Wolf-823",
        "title": "Go watch Dark",
        "content": "**\"I don’t know what you’re watching right now, but Dark** ***must*** **be the next thing.**  \n**One of the best things I’ve seen on screen in my life.\"**\n\nThat was the post I saw scrolling reddit. 5 episodes in, how the fuck is this the best thing you've seen in your life? Unless the writter died at the end of episode 5 and they got a new one, this show isn't worth making a post like that",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1oofjn1/go_watch_dark/"
    },
    {
        "id": "1oodpav",
        "author": "schefferjoko",
        "title": "Hungarian References Shine in Netflix’s The Witcher Season 4",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oodpav/hungarian_references_shine_in_netflixs_the/"
    },
    {
        "id": "1onvccl",
        "author": "AnotherDarnDay",
        "title": "Merry Gentlemen",
        "content": "Yeah, I'm late to talking about this one, but I recently rewatched it... I dunno why but I get secondhand embarrassment from watching this movie, yet I kind of enjoy the gooey cheesy aspect of it. \n\nI was never big into Chad Michael Murray. I didn't watch one tree hill, I knew him as Tristen on Gilmore Girls but never liked him or his characters. But I'm finding I like him in the Hallmark type movies on GAF and of course Netflix movies. Maybe because I'm older I appreciate the bad acting on crappy made for TV movies.\n\nThis is probably one of the strangest movies for Netflix holidays... next to hot frosty.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1onvccl/merry_gentlemen/"
    },
    {
        "id": "1on93iz",
        "author": "missuniversearth",
        "title": "The Mother (2023) Netflix sad ending",
        "content": "Spoiler Ahead ⚠️\n\nJ Lo's character is so sad at the end and no matter what the haters say, her acting at the end and the makers really set that scene. Especially, with Kate Bush's song, there could have been no other better scene to compliment her song.\n\nSo fed up of this culture of adoptive parents being jerks. The adoptive mom is definitely one and it seems like she made J Lo keep her promise as she is very nonchalant and uninviting in that scene. Plus, in the reunion scene before when she and J Lo meet eyes and she is not even looking at her in spite of looking straight into her face. J Lo, on the other hand, nods while she proceeds to ignore her and hold their daughter tighter, especially when J Lo is pulling off, not giving a chance for the daughter to turn around and watch her leave.\n\nWhat are your thoughts? Would J Lo only observe her daughter and would they communicate only from a distance like in that scene?",
        "upvotes": 13,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1on93iz/the_mother_2023_netflix_sad_ending/"
    },
    {
        "id": "1onc23q",
        "author": "Sufficient-Curve2951",
        "title": "The Asset",
        "content": "Mystery lovers, is the recent Danish series worth watching?? I find the premise quite interesting and the fact that it does not kick start with a murder is exciting too!! But is it worth the time? This article has listed some solid points and I might tune in\n\n  \n[https://www.soapcentral.com/shows/5-reasons-netflix-s-the-asset-watchlist](https://www.soapcentral.com/shows/5-reasons-netflix-s-the-asset-watchlist)",
        "upvotes": 7,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1onc23q/the_asset/"
    },
    {
        "id": "1onx2q2",
        "author": "eggn00dles",
        "title": "Forced into 4k upgrade",
        "content": "Last couple of times I sign into Netflix, it tries to upgrade me to 4k. I decline.\n\nNow, it would not let me decline. I had to do the FREE upgrade to 4k.\n\nOf course what this actually does is change your membership to Premium, and you need to manually change it back.\n\nPretty sketchy move imo.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1onx2q2/forced_into_4k_upgrade/"
    },
    {
        "id": "1oo47aq",
        "author": "ThEmOvIeGuY0069",
        "title": "Back to future",
        "content": "I really like the movie.. it’s a classic in my opinion, like a top 10 holidays film. BUT, hear me out.. is it really so good to get a 8.5 imdb. Just for comparison another classic Jurassic Park the original has a 8.2 imdb. It has a greater imdb score than freaking Dark Knight Rises, Revenant, The Wolf of Wall Street. I don’t think this score is justified.. thoughts??",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1oo47aq/back_to_future/"
    },
    {
        "id": "1onpoi5",
        "author": "Glittering_duck7004",
        "title": "NW-4-8 ERROR (AUSTRALIA)",
        "content": "My 6/7 yo main tv with netflix installed as standard (can't un-install) has thrown this error message\nWe have factory reset the tv, wifi network\nOur 2nd tv connects with no issue as does our phones and all other streaming services work on the main tv\nNetflix were of no help,  I fear the tv is now too old to support the requirements \nCan anyone shed some light?\nTa!",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1onpoi5/nw48_error_australia/"
    },
    {
        "id": "1onon1o",
        "author": "Significant-Force671",
        "title": "Just finished ‘Mo’",
        "content": "The show has so many great characters and truly left me feeling appreciative for the exposure it gave me to Palestinian culture, but the character Mo himself became unwatchable in S2.\n\nMo only gets the wins he doesn’t deserve. It’s hard enough to sympathize with a character who suffers from problems they caused themselves, but it’s even harder when the character does basically nothing to redeem themselves before picking up a life changing win. The whole subplot of his relationship with Maria revolved around him being a terrible partner - always lying, always selfish, and only supportive until his own pride ruins whatever Maria had going on. And in the end, all it took was for him rage quit, blame her for all his misfortune, then walk back into a store and tell her “it’s okay” for all of his problems to be solved? Gimme a break.\n\nOn the flip side, every time he displays an ounce of character development and is on the cusp of getting a win he actually does deserve, he ruins it for himself by saying/doing something so unreasonable that it’s borderline insulting to the viewer. It made it impossible to root for the guy by the end of S2. \n\nFor the record, this isn’t something that bothers me in other shows where I the main protagonist is supposed to be dumb, pathetic, or simply a bad person. In the end, I just don’t think Mo himself was funny enough for me to excuse all of his character flaws. It was basically just Eastbound &amp; Down (one of my favorite shows btw) but without the main character being funny enough for me to be happy when he “redeems” himself. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1onon1o/just_finished_mo/"
    },
    {
        "id": "1onojzw",
        "author": "borbloom",
        "title": "Breathless season 2!!",
        "content": "What are your thoughts? For me it's way better than season one, even thought there is a felling of rush, like there is not enought episodes to talk about all the problems they want to develope, which it's a shame because the majority of them are quite interesting. Hope there is a third season!!!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1onojzw/breathless_season_2/"
    }
]