[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 496,
        "comments": 261,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1iqseno",
        "author": "dailystar_news",
        "title": "Netflix star found dead at home age 24, as police investigate circumstances",
        "content": "",
        "upvotes": 171,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1iqseno/netflix_star_found_dead_at_home_age_24_as_police/"
    },
    {
        "id": "1iqupoq",
        "author": "Vector_Heat",
        "title": "How Oil Propaganda Sneaks Into TV Shows",
        "content": "",
        "upvotes": 14,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iqupoq/how_oil_propaganda_sneaks_into_tv_shows/"
    },
    {
        "id": "1iqrvcy",
        "author": "Somethingman_121224",
        "title": "Kate Winslet Will Debut as Director in Netflix's Drama 'Goodbye June'",
        "content": "",
        "upvotes": 16,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iqrvcy/kate_winslet_will_debut_as_director_in_netflixs/"
    },
    {
        "id": "1iqrix7",
        "author": "TheExpressUS",
        "title": "Netflix Sweet Magnolias season 4's biggest differences from the book",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iqrix7/netflix_sweet_magnolias_season_4s_biggest/"
    },
    {
        "id": "1iqshtb",
        "author": "NotJuli2011",
        "title": "Don‘t know what to watch?",
        "content": "Hey I need a good show that is not too boring and has deep characters.\n\nMy all time favorites are Breaking Bad, Shameless (US), Vikings, Prison Break.\n\nI also loved Haunting of Hill House, Peaky Blinders, Skins, Ginny &amp; Georgia, Top Boy, Last Kingdom, Queens Gambit…\n\nRecently I cannot decide what to watch. There are so many shows and I don‘t want to waste my time with a bad show.\n\nThanks for your recommendations :)\n\n",
        "upvotes": 5,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1iqshtb/dont_know_what_to_watch/"
    },
    {
        "id": "1iq9bom",
        "author": "Practical-Creme-6025",
        "title": "Netflix pricing in Europe (as of February 2025)",
        "content": "*Premium plan only",
        "upvotes": 81,
        "comments": 61,
        "media": null,
        "permalink": "/r/netflix/comments/1iq9bom/netflix_pricing_in_europe_as_of_february_2025/"
    },
    {
        "id": "1iqukje",
        "author": "New_Seat_3868",
        "title": "Netflix",
        "content": "What does the title, Asura, mean in this context?  I goggled it and learned it is a reference to a Buddhist god. How does that fit in with the themes of the show?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iqukje/netflix/"
    },
    {
        "id": "1iqpzq7",
        "author": "Afraid-Till-4101",
        "title": "Is Solo account and Shared account nothing different when it comes to screen limit?",
        "content": "I was still confused with mine, I have a Premium plan which has 4 screen limit device at once, and I have other 2 slots for Solo profile members outside my household. So does it mean, those 2 solo acc would be counted in the screen limit of 4 device if ever being watched all at once? Cause if yes, I'm just gonna abolished those 2 solo membership cause it's already costs me lol. Please enlighten me, thank you!",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1iqpzq7/is_solo_account_and_shared_account_nothing/"
    },
    {
        "id": "1iqrn6y",
        "author": "Competitive-Rip5932",
        "title": "What do you prefer?",
        "content": "I have watched Squid game season 1 and 2 and i found it really interesting and dramatic, especially for the critic to the south korean system and the fact that people risk their life for money.\nAfter this I searched for some similar series and I found out \"the 8 show\", that in my opinion is way better than squid game, am I the only one thinking it?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iqrn6y/what_do_you_prefer/"
    },
    {
        "id": "1iq8c02",
        "author": "fermulator",
        "title": "Canada Pricing Increases (again) Feb 2025",
        "content": "Netflix year over a year continues to increase their prices and they are no longer competitive. (in my opinion.)\n\nBecause of this ongoing increase last year we downgraded to the standard with ads plan, which has been fine . The cost was $5.99.\n\nHere are the changes \n- Standard with ads $5.99 to $7.99\n- standard $16.49 to $18.99\n- premium $20.99 to $23.99\n\nAbsolutely unacceptable . (to me)\n\nWe have cancelled our membership .  I encourage others to do the same in solidarity.",
        "upvotes": 21,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1iq8c02/canada_pricing_increases_again_feb_2025/"
    },
    {
        "id": "1iqdhoq",
        "author": "anushkaaaaaaaaaaa",
        "title": "Cassandra",
        "content": "This show was so good, oh my god! Yes, there were plenty of obvious dumb decisions, but overall, it was a really great watch. I ended up binging it in one night. It actually made me sad—she just wanted a family, and it breaks my heart. A victim turned villain.",
        "upvotes": 7,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1iqdhoq/cassandra/"
    },
    {
        "id": "1iqohm7",
        "author": "kurd2005",
        "title": "How to view deleted movie timestamp",
        "content": "I was watching “the karate kid” a while back but they removed it from Netflix and I don’t remember what time stamp it stopped at. Is there anyways to find out?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iqohm7/how_to_view_deleted_movie_timestamp/"
    },
    {
        "id": "1iqo9yh",
        "author": "Ok_South9239",
        "title": "Has anyone fanfic’d an ending to the society?",
        "content": "I know the society season 2 has come up a lot here and I’ve given up hoping tbh. They were gonna release a graphic novel for season 2 but the publisher fucking WENT OUT OF BUSINESS before they could release it (whyyyy is this show cursed).\n\nAnyway im torturing myself rewatching it for some reason so is there like a fanfic or something that’s at least 60 percent satisfying? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iqo9yh/has_anyone_fanficd_an_ending_to_the_society/"
    },
    {
        "id": "1iprjma",
        "author": "TheMirrorUS",
        "title": "Netflix says Emilia Perez controversy is 'bummer' for Selena Gomez and Zoe Saldana",
        "content": "",
        "upvotes": 253,
        "comments": 57,
        "media": null,
        "permalink": "/r/netflix/comments/1iprjma/netflix_says_emilia_perez_controversy_is_bummer/"
    },
    {
        "id": "1iqnrex",
        "author": "AnusChakra",
        "title": "Netflix editing in distortions in old footage",
        "content": "After watching a bunch of Netflix real crime I noticed that literally EVERY old piece of footage was distorted one way or another. It can be discoloring, lines of white noise or distortion of parts of the screen.\n\nI know that even footage from the 90s can look ancient, but at some point I realized that Netflix does this to \"help the viewer\". When they again show footage from some time ago they add the distortion so that viewer subconsciously can place the footage in time (\"ah, right, we're having a flashback\").\n\nDid anyone else notice this? And is it indeed an editing trick to help the viewer? Or is really all their archived footage damaged?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iqnrex/netflix_editing_in_distortions_in_old_footage/"
    },
    {
        "id": "1iq60c1",
        "author": "AnthologicalAnt",
        "title": "Watch list question...",
        "content": "Am I the only person that fills their watch list of shows and films that I would love to watch. And as soon as I want to watch something, everything looks like a load of crap I wouldn't ever want to watch? ",
        "upvotes": 16,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1iq60c1/watch_list_question/"
    },
    {
        "id": "1iq809f",
        "author": "Upstatealphamama",
        "title": "Dead Boy Detectives",
        "content": "Did anyone watch Dead Boy Detectives? Did you like it? It's in the same universe as Sandman. I really enjoyed both shows and was really looking forward to season 2 of Dead Boy Detectives but found out it was canceled due to low views. I feel like Netflix cancels so many shows super quickly. ",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iq809f/dead_boy_detectives/"
    },
    {
        "id": "1iqi886",
        "author": "ProfessionalMusic414",
        "title": "Trailer for #aSTRANGERdarkly #earlyrelease #trailer",
        "content": "I tagged my project on ig &lt;aSTRANGERdarkly&gt;\n\n#ASTRANGERDARKLY\n#PARTTWO of #PKD’s\n#aSCANNERDARKLY",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iqi886/trailer_for_astrangerdarkly_earlyrelease_trailer/"
    },
    {
        "id": "1iqi5yl",
        "author": "Key_Training_2484",
        "title": "Broken Netflix?",
        "content": "So oddly enough years ago I subscribed to Netflix over my Playstation and have yet to actually get charged on my payment method.  Yeah I know it's weird but I'm not complaining free Netflix right? Well I got a message today saying they're increasing rates.  My question is will my account start getting charged or do you think that when it updates will I be lucky enough to avoid there payments lol. Side note when I subscribed to PS+ I also never have been charged for a single payment it's almost as if my Playstation account just has unlimited PS+ as not one payment came out other than the initial first payment and this was a long long time ago. To this day I don't have to pay for it am I just lucky or has anyone else had this happen to them?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1iqi5yl/broken_netflix/"
    },
    {
        "id": "1iqbu35",
        "author": "tabloidjournalism",
        "title": "When watching in Dolby Vision, are HD-only shows supposed to look slightly more washed out?",
        "content": "If I'm watching a show that supports 4K and Dolby Vision, it looks great. If I'm watching an older show like Lost which is only in HD, it's nowhere near as colourful and I have to manually turn up the saturation. Is this supposed to happen or do I need to reconfigure something? I'm watching via Xbox Series X. Thank you",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iqbu35/when_watching_in_dolby_vision_are_hdonly_shows/"
    },
    {
        "id": "1iqg00g",
        "author": "Victor-Romeo",
        "title": "Scene change flicker",
        "content": "Why are there so many of these flickering cuts between scenes in Netflix?  Clip from The Courier for example.\n\nI've seen these in Android and Apple TV netflix apps.  \n\nDoes Netflix re-edit films before they are made available to stream?  Is this a streaming artefact or something in the source film?",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ujvkepg1deje1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1iqg00g/scene_change_flicker/"
    },
    {
        "id": "1iq9tfw",
        "author": "Ok_Group_1322",
        "title": "Games with friends?",
        "content": "Every Sunday we have friends come over and I see our subscription gives us games. Is there a recommended game that you would say would work for a crowd of all ages??",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iq9tfw/games_with_friends/"
    },
    {
        "id": "1iqee1b",
        "author": "KiwiBubbly9246",
        "title": "Cobra kai season 6 part 3 was good but",
        "content": "There were definitely some problems. First of all their were way to many call backs like I get it the shows about the end and they were about to fight in the biggest karate tournament in the world but did they really have to add a callback to literally every scene. Next how did the sekai tekai get brought back that early seriously only a month I felt like they should have made it a bit longer. Also why would the Sekai Tekai even be the valley I get that it's better narratively but realistically it made no sense. When kreese and silver died it felt so abrupt and also how did kreese even kill that guy that silver hired even daniel could barely beat him so how in the world did he kill him without a weapon. They also didn't even address at all their deaths. Axel got so heavily debuffed it was crazy. The guy went from getting barely hit from being beaten by miguel. Also this is a small detail but why was the Russians even there you could see them right before the fight was about to start. Also Wolf I like his character but honestly it made no sense why he was abusing Axel so much without even doing anything to Zara. I feel like he would be even more frustrated at her because she's not focused. Another huge misoppurtunity was I kinda of wished that Johnny would go back to him and just console him a bit after losing a final. It would be so sweet and awesome. Feel free to critique my points but I'm just curious what you guys think.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1iqee1b/cobra_kai_season_6_part_3_was_good_but/"
    },
    {
        "id": "1ipw8zj",
        "author": "Robemilak",
        "title": "‘XO, KITTY’ has been renewed for Season 3 at Netflix.",
        "content": "The announcement was made on Netflix’s official X account on Friday. Season 2 of the YA series premiered on Netflix on Jan. 16.\n\n“I’m so excited to head back to Seoul for another season with our incredible cast and crew. If you thought junior year at KISS brought the drama…just wait,” said series showrunner, executive producer and writer Jessica O’Toole. “I know we left fans on a cliffhanger at the end of Season 2 but I can promise season 3 will be worth the wait, including our first summer episode — not to mention plenty of romance, friendship, adventure…and kissing. Lots of kissing.”",
        "upvotes": 17,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ipw8zj/xo_kitty_has_been_renewed_for_season_3_at_netflix/"
    },
    {
        "id": "1iq0m37",
        "author": "EthanWilliams_TG",
        "title": "Netflix Reveals Clip from 'Demon City' Manga Live-Action Adaptation, Debuts Late February",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iq0m37/netflix_reveals_clip_from_demon_city_manga/"
    },
    {
        "id": "1iq662j",
        "author": "SlothSnoozes",
        "title": "Feel like there is nothing for me to watch, help me out!",
        "content": "A list of some of the things I’ve watched. 13 reasons why, breaking bad, TWD, better call Saul, stranger things, Bojack Horseman, avatar, on my block, school spirits, squid games, dark, the end of the fucking world, umbrella academy, everything sucks, beef, cyberpunk, insatiable, i am not okay with this. \n\nI am probably missing a couple but most of these shows had me somewhat hooked and I’m looking to find that in another show. It feels like maybe I’ve watched all there is for me on Netflix so if anyone could help me out that would be great! ",
        "upvotes": 1,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1iq662j/feel_like_there_is_nothing_for_me_to_watch_help/"
    },
    {
        "id": "1ipdaia",
        "author": "Somethingman_121224",
        "title": "Netflix's Bela Bajaria Believes Amazon Overpaid 'Beast Games' To Snatch It From Netflix",
        "content": "",
        "upvotes": 195,
        "comments": 57,
        "media": null,
        "permalink": "/r/netflix/comments/1ipdaia/netflixs_bela_bajaria_believes_amazon_overpaid/"
    },
    {
        "id": "1ipxuje",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix has shared a new clip from Demon City, a live-action adaptation of Masamichi Kawabe’s popular manga",
        "content": "",
        "upvotes": 9,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ipxuje/netflix_has_shared_a_new_clip_from_demon_city_a/"
    },
    {
        "id": "1ipwatd",
        "author": "Robemilak",
        "title": "Guillermo del Toro’s ‘FRANKENSTEIN’ will be getting a “bespoke qualifying run” in theaters from Netflix.",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ipwatd/guillermo_del_toros_frankenstein_will_be_getting/"
    },
    {
        "id": "1ip9i52",
        "author": "brownieekb",
        "title": "Ralph Macchio on the new Karate Kid movie as Cobra Kai returns on Netflix",
        "content": "",
        "upvotes": 195,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1ip9i52/ralph_macchio_on_the_new_karate_kid_movie_as/"
    }
]