[
    {
        "id": "1ohdvh8",
        "author": "ChadPowersAMA",
        "title": "Hi /r/movies! I'm Michael Waldron. I'm the co-creator, exec producer &amp; writer of the new Hulu series CHAD POWERS (starring Glen Powell). You might also know me as the creator/writer of LOKI, writer of DOCTOR STRANGE IN THE MULTIVERSE OF MADNESS, creator of HEELS, and writer for RICK AND MORTY. AMA!",
        "content": "Hi r/movies! I'm Michael Waldron. I'm the co-creator, executive producer, and writer of the new Hulu series CHAD POWERS (starring Glen Powell). You might also know me as the creator/writer of LOKI, writer of DOCTOR STRANGE IN THE MULTIVERSE OF MADNESS, creator of HEELS, and writer for RICK AND MORTY.  Ask me anything!\n\nChad Powers stars Glen Powell and is now streaming on Hulu.\n\n**About Me:**\n\nMichael Waldron is an Emmy award-winning writer from Atlanta, Georgia. He created and served as head writer and executive producer for Marvel and Disney+'s LOKI series and wrote Marvel's DOCTOR STRANGE IN THE MULTIVERSE OF MADNESS for Sam Raimi. He created and executive produced Starz' wrestling drama HEELS, starring Stephen Amell and Alexander Ludwig which is now available on Netflix. He is also the executive producer behind the Hulu comedy series CHAD POWERS starring Glen Powell. He began his career on Adult Swim's RICK AND MORTY, where he won an Emmy for his work as a writer and producer on Season 4. He co-founded a feature film and TV production company, Anomaly Pictures, in 2023 with Adam Fasullo. \n\n**About Chad Powers:**\n\nEight years after an unforgivable mistake nukes his promising college football career, hotshot quarterback Russ Holliday tries to resurrect his dreams by disguising himself as Chad Powers - a talented oddball who walks on to the struggling South Georgia Catfish.\n\n**Trailer:**\n\n[https://www.youtube.com/watch?v=\\_nFZMD8FMM0](https://www.youtube.com/watch?v=_nFZMD8FMM0)\n\n**Watch the series:**\n\n[https://www.hulu.com/series/chad-powers-7117a15d-128c-4c2b-a5b9-98adfa0f4505](https://www.hulu.com/series/chad-powers-7117a15d-128c-4c2b-a5b9-98adfa0f4505)\n\nAsk me anything! I'll be back tomorrow (Tuesday 10/28) at 3 PM ET to answer your questions.",
        "upvotes": 128,
        "comments": 167,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ht7yf7xrknxf1.png?auto=webp&amp;s=aefcdc53e04357607bb16d3b955df2c96a640192"
        },
        "permalink": "/r/movies/comments/1ohdvh8/hi_rmovies_im_michael_waldron_im_the_cocreator/"
    },
    {
        "id": "1ohrsk3",
        "author": "SanderSo47",
        "title": "October 24-26 Box Office Recap – 'Chainsaw Man' opens at #1 with a great $18M and hits $108M WW. 'Regretting You' debuts with a solid $13M DOM and $23M WW, 'Springsteen: Deliver Me from Nowhere' flops with just $8.8M DOM and $15.8M WW, and Chris Stuckmann's 'Shelby Oaks' opens with an okay $2.3M.",
        "content": "https://preview.redd.it/l99c4kb07qxf1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=6ed90ab7183c86b19d98be760ceae39de2174e02\n\nIt was a busy week, with 3 films earning at least $10 million this weekend.\n\nThe clear winner was ***Chainsaw Man – The Movie: Reze Arc***, which had a very great debut for an anime title. The other newcomers were a mixed bag; ***Regretting You*** had an okay start, but it was nowhere close to what ***It Ends with Us*** made last year, while ***Springsteen: Deliver Me from Nowhere*** flopped. In not-so-wide releases, Chris Stuckmann's directorial debut ***Shelby Oaks*** had an okay start given its low budget. And in some great news, Yorgos Lanthimos' ***Bugonia*** got off to a very strong debut in limited release.\n\nThe Top 10 earned a combined $67.8 million this weekend. That was down a rough 23.9% from last year, when ***Venom: The Last Dance*** topped the box office.\n\nDebuting at #1, ***Chainsaw Man – The Movie: Reze Arc*** debuted with a pretty great $18 million in 3,003 theaters. That's not close to ***Demon Slayer: Kimetsu no Yaiba – The Movie: Infinity Castle*** ($70 million), but it was foolish to expect it to come close to that. At the end of the day, ***Chainsaw Man*** just lacks the massive popularity of ***Demon Slayer***.\n\nJust to show how difficult it is for an anime film, this is just the ninth anime title to open with at least $10 million. It's a niche market, but this is indicating that audiences are opening up to animes. Obviously, it depends on the IP: ***Chainsaw Man*** has that advantage over other original films. Considering how Sony has had a very mixed year at the box office with its live-action titles, it's good to see that anime is saving them.\n\nAudiences gave ***Chainsaw Man – The Movie: Reze Arc*** a great \"A\" on CinemaScore. And don't expect it to hold well; anime titles (especially IP-driven) fall quickly, so it would be a surprise if it got to $40 million domestically. But it's still a great performance regardless.\n\nIn second place, Paramount's ***Regretting You*** debuted with $13.6 million in 3,393 theaters. That's nowhere close to the debut of ***It Ends with Us*** ($50 million), but it was never expected to reach that high. The book is not as popular, and the film also didn't have an aggressive marketing like Sony did for that film.\n\nNot a bad debut, but it's not particularly impressive either. And that's because the premise just lacked any hook; it didn't have much intrigue nor brought anything new to the table. What was important is that it could bring women and couples to the theaters, and it succeeded. And while ***It Ends with Us*** wasn't a critical darling, it certainly felt like a masterpiece compared to this film; it's sitting at a poor 30% on RT. Basically it could only attract Colleen Hoover's fans.\n\nAccording to Paramount, a colossal 84% of the audience was female, but that's not really a surprise. They gave it a middling \"B\" on CinemaScore, which is below ***It Ends with Us*** and doesn't indicate good word of mouth. It's likely that it can drop off quickly, but the lack of titles for women could help it for the next few weeks. At the very least, it should end with around $35 million domestically.\n\n***Black Phone 2*** added $12.9 million this weekend. That's a 53% drop, which is slightly above average for a horror title. But it's a bigger drop than the original (48.2%). Through 10 days, the film has earned $48.9 million. While it opened $4 million above the original, it's now just $1.5 million ahead of it and it will lose that lead over the next few days. The Halloween weekend could help it with a great drop, but it doesn't look like it will reach $80 million.\n\nDebuting in fourth place, 20th Century Studios' ***Springsteen: Deliver Me from Nowhere*** flopped with just $8.8 million in 3,460 theaters. That's below ***A Complete Unknown*** ($11 million), and that film already burned off some demand after debuting on Wednesday.\n\nMusic biopics are more common now, so it felt inevitable that Bruce Springsteen would get a biopic. But ***Springsteen*** had a few challenges to overcome. For starters, having the film focus on the making of his album *Nebraska* offered an interesting deviation to the generic biopic trope, but it also meant that it would exclude a lot of his journey. Second, Jeremy Allen White has been on a critically acclaimed run thanks to ***The Bear***, but he's still not very popular to handle a production like this. It doesn't help that ever since his casting and first-look photos, a lot complained that he didn't look like the Boss. And finally, it's the film itself. It was positioned as an awards contender, but reviews have been mediocre (58% on RT), indicating that it would struggle to attract non-fans and would not become the contender it could've been.\n\nAccording to 20th Century Studios, 52% of the audience was female. Unsurprisingly, it skewed old; 40% was 55 and over, and 59% was 45 and over. Only 12% of the audience was 25 and under. They gave it a so-so \"B+\" on CinemaScore, which is not a glowing grade; usually music biopics easily hit the A range. What does this suggest? That even Springsteen's fans are not fully in love with the film. With little-to-no awards buzz on the horizon, it's unlikely ***Springsteen*** can last long in theaters. Right now, it should finish with around $25 million domestically. \n\n***Tron: Ares*** continues its freefall at the box office. It had another steep 56% drop, earning just $5.9 million this weekend. The film has earned a poor $63.3 million, and it will probably cap off with just $75 million domestically.\n\nLionsgate's ***Good Fortune*** dropped 50% this weekend, earning $3.1 million this weekend. Through 10 days, the film has earned $11.8 million, and it will struggle to get to $20 million domestically.\n\nIn seventh place, Neon's release of Chris Stuckmann's ***Shelby Oaks*** debuted with $2.3 million in 1,823 theaters. That's not a bad debut, considering its low budget and the lack of big names in the cast.\n\nEven though Stuckmann has garnered a following thanks to his YouTube channel (with over 2 million subscribers), it's still too much to ask for higher numbers. Independent horror needs to stand out in order to break out, and none of ***Shelby Oaks***' trailer seemed to offer anything new in the horror genre. And while it had a solid debut in festivals, reception has dwindled as the release got closer; it's currently sitting at a 58% on RT. So basically the only selling point was Stuckmann's involvement.\n\nAccording to Neon, 53% of the audience was male, and 74% was in the 18-34 demographic. They gave it a weak \"C+\" on CinemaScore, which is quite common for horror titles. It's very likely that it burns off demand and falls off quickly, but its very low budget and foreign sales will help it turn a profit. But Stuckmann will really need to step up his game if he can get another film off the ground.\n\nWB's ***One Battle After Another*** earned $2.2 million, which was down 41% from last week. The film's domestic total stands at $65.7 million, and it should hit the $70 million by early November.\n\nParamount's ***Roofman*** grossed $2 million, which represented a 45% drop. The film has amassed $19.4 million, and it will finish with around $25 million.\n\nRounding out the Top 10 was Fathom Events' re-release of ***ParaNorman*** in 1,359 theaters. It made $1 million this weekend, taking its lifetime gross to $57.1 million.\n\nFocus Features released Yorgos Lanthimos' ***Bugonia*** in 17 theaters, where it earned $706,649. That's a strong $41,568 per-theater average, which ranks as the seventh best PTA of the year. But the real test starts next week, when it hits wide release.\n\nSony Pictures Classics expanded Richard Linklater's ***Blue Moon*** to 689 theaters, but the film could only muster a weak $554,321. That's a poor $805 per-theater average.\n\n#**OVERSEAS**\n\n***Chainsaw Man – The Movie: Reze Arc*** debuted in some new markets and added $14.7 million this weekend, taking its worldwide total to $108 million. Its biggest market is, obviously, Japan with $48 million.\n\n***Black Phone 2*** added $10.5 million, for a $80.7 million worldwide total. The best markets are Mexico ($7.8M), the UK ($3.1M), Brazil ($2.2M), Australia ($1.8M) and France ($1.3M). It still has South Korea and Japan left, and it should crack the $100 million milestone next week.\n\n***Regretting You*** debuted with $9.9 million overseas, for a $23.6 million worldwide debut. The best debuts were in the UK ($1.75M), Germany ($1.65M), Australia ($1.4M), Mexico ($1.3M) and Brazil ($745K). While it has some markets left, it doesn't look like it will break out anywhere. \n\nWith $8 million overseas, ***One Battle After Another*** has crossed $180 million worldwide. In the next few weeks, it should finally cross $200 million.\n\n***Springsteen: Deliver Me from Nowhere*** opened with a very soft $6.9 million overseas, for a weak $15.8 million worldwide debut. The only notable markets were the UK ($1.6M) and Germany ($1M), while it performed mediocre in the rest. Like Bob Dylan, Bruce Springsteen has not been massively popular overseas like he is in America. While it still has some markets left, the $55 million budget will really be a challenge to recoup. \n\n***Tron: Ares*** keeps dropping overseas. It added just $6.5 million, for a pathetic $123 million worldwide total. With heavy drops not showing signs of stopping, it really looks like the film will miss $150 million. That's gonna make it one of the year's biggest flops.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*The Fantastic Four: First Steps* | Jul/25 | Disney | $117,644,828 | $274,286,610 | $520,636,922 | $200+M\n*Freakier Friday* | Aug/8 | Disney | $28,583,167 | $94,186,236 | $153,146,822 | $45M\n*Downton Abbey: The Grand Finale* | Sep/12 | Focus Features | $18,107,405 | $44,996,590 | $100,397,590 | $50M\n*Him* | Sep/19 | Universal | $13,251,560 | $24,936,390 | $27,568,398 | $27M\n\n- ***The Fantastic Four: First Steps*** has ended its run with $274 million domestically and $520 million. Easily the biggest ***Fantastic Four*** film, though that's not expected. It was the first well received film of the characters, and while it had a big debut, the film's legs proved to be quite shorter than expected (a 2.33x multiplier is very rough, even for a superhero film). And the film also had a soft performance outside America, which should be a concern for Marvel; with each passing year, the overseas share continues dropping. The budget has never been disclosed, only reported to be at more than $200 million. For now, it's a solid, not spectacular performance. Now let's see what the future holds for these characters.\n\n- ***Freakier Friday*** has closed with $94 million domestically and $153 million worldwide. Even though these are all below the original, it's still a good performance for a comedy in this environment. After all, it's complicated to get them to at least $100 million. Should also perform well in Disney+.\n\n- ***Downton Abbey: The Grand Finale*** has closed with $44 million domestically and $100 million worldwide. Only a little above ***A New Era***, but it's not like the future of the franchise depended on it. It's the end after all.\n\n- Universal's ***Him*** has closed with just $27 million worldwide, failing to recoup its budget. Talk about wasted potential, man. Universal really sold the film as a \"*Whiplash* meets NFL\" horror film and aggressively pushed producer Jordan Peele's name in the marketing. But it turned out to be a fumble, for the film earned terrible reviews and word of mouth. Yeah, this kid ain't making it to next season, coach.\n\n#**THIS WEEKEND**\n\nAs mentioned, ***Bugonia*** will expand into wide release, heading into around 1,800 theaters. And Netflix is bringing back ***KPop Demon Hunters*** into 300 locations, far below its previous theatrical weekend back in August. And... that's actually it. Studios often avoid the Halloween weekend, especially when Halloween falls on a Friday. It'd be a surprise if anything got to $10 million this weekend.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 20,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/M37LvDg-VgR2_BIJIEL23xTFdsTJhtBkhzGtUmMYauU.png?auto=webp&amp;s=f736e1ba948bc999ceedd23b3d0ee99dcf333642"
        },
        "permalink": "/r/movies/comments/1ohrsk3/october_2426_box_office_recap_chainsaw_man_opens/"
    },
    {
        "id": "1ohpi6j",
        "author": "MarvelsGrantMan136",
        "title": "Paramount Skydance to Lay Off 1,000 Employees This Week, With Additional Cuts Expected",
        "content": "",
        "upvotes": 2669,
        "comments": 186,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0uxdGRqo9hH8vuMhOUW8Dd2h8b6W3DpCKxk2xFAfAMM.jpeg?auto=webp&amp;s=245d983af683a43ee7e0407c13f2130e34787db7"
        },
        "permalink": "/r/movies/comments/1ohpi6j/paramount_skydance_to_lay_off_1000_employees_this/"
    },
    {
        "id": "1ohd3p8",
        "author": "MarvelsGrantMan136",
        "title": "Cinemark to Add 70mm Imax Screens Ahead of Christopher Nolan’s ‘The Odyssey’",
        "content": "",
        "upvotes": 2706,
        "comments": 160,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HBi8OnOFkLnmb3uMGjBQdlpUslG_FhHuuwOrihSi4po.jpeg?auto=webp&amp;s=9cacab72a46f208ff20b5b95c722b0ce29e902d0"
        },
        "permalink": "/r/movies/comments/1ohd3p8/cinemark_to_add_70mm_imax_screens_ahead_of/"
    },
    {
        "id": "1ohg8xl",
        "author": "Yellowstone_98",
        "title": "New Poster for \"THE RUNNING MAN\"- In Theatres November 14th.",
        "content": "",
        "upvotes": 1175,
        "comments": 597,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/44j9zhka2oxf1.jpeg?auto=webp&amp;s=8663131273d33b4bd830dc925c4f77712216b30a"
        },
        "permalink": "/r/movies/comments/1ohg8xl/new_poster_for_the_running_man_in_theatres/"
    },
    {
        "id": "1ohq3ef",
        "author": "KillerCroc1234567",
        "title": "Taylor Sheridan’s Deal with NBCUniversal is for $1B+ for TV, Movies",
        "content": "",
        "upvotes": 350,
        "comments": 142,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vCvts2ePiwHGSABi_1SZmY-w2s2df2lA8lUs3CU3gwo.jpeg?auto=webp&amp;s=c2385a4ef8db6e7278eff3b86078a7d4abb518f0"
        },
        "permalink": "/r/movies/comments/1ohq3ef/taylor_sheridans_deal_with_nbcuniversal_is_for_1b/"
    },
    {
        "id": "1ohn5ff",
        "author": "KingMario05",
        "title": "Why Netflix and AMC Theatres Are Finally Getting Into Business Together for ‘KPop Demon Hunters,’ ‘Stranger Things’ and More",
        "content": "",
        "upvotes": 320,
        "comments": 40,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ZDuH4XC8a6RwZ1JBGRkUllyFBQNbSIxjUnYhF4F7BhI.jpeg?auto=webp&amp;s=ee760d40f8d6505c4a367e8ae0e8f8361fea9a16"
        },
        "permalink": "/r/movies/comments/1ohn5ff/why_netflix_and_amc_theatres_are_finally_getting/"
    },
    {
        "id": "1ohil4s",
        "author": "SanderSo47",
        "title": "Official Poster for Gus Van Sant's 'Dead Man's Wire', Starring Bill Skarsgård, Dacre Montgomery, Cary Elwes, Myha'la, Colman Domingo, and Al Pacino – Based on the true story of kidnapping by Tony Kiritsis in the 1970s.",
        "content": "",
        "upvotes": 336,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1xrath1thoxf1.jpeg?auto=webp&amp;s=9e862a41b60272fa229890261e06114e50298d8c"
        },
        "permalink": "/r/movies/comments/1ohil4s/official_poster_for_gus_van_sants_dead_mans_wire/"
    },
    {
        "id": "1ohmfom",
        "author": "cricinephile",
        "title": "RRR director - SS Rajamouli's Baahubali, a 2 Part fantasy epic franchise is recut and remastered into a single film \"Baahubali: The Epic\". Releasing in theatres worldwide as Baahubali celebrates 10 years anniversary.",
        "content": "",
        "upvotes": 183,
        "comments": 64,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ing58gd67pxf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1ohmfom/rrr_director_ss_rajamoulis_baahubali_a_2_part/"
    },
    {
        "id": "1ohenoi",
        "author": "KillerCroc1234567",
        "title": "Steve Coogan Settles Libel Claim Over Richard III Film ‘The Lost King’",
        "content": "",
        "upvotes": 423,
        "comments": 112,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Tsj3uTRB2HGKJUkEj1ibsON2Ohkfj3ZuhBjPYrVxqkU.jpeg?auto=webp&amp;s=955df530d0aa84ae67b47fdc18dead4a8addee24"
        },
        "permalink": "/r/movies/comments/1ohenoi/steve_coogan_settles_libel_claim_over_richard_iii/"
    },
    {
        "id": "1ohk082",
        "author": "DemiFiendRSA",
        "title": "June Squibb's Criterion Closet Picks",
        "content": "",
        "upvotes": 222,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GGt_8GiyKLr4Ct8TkVbUm4Tl5lTZY3wuZDxZIfqPrfY.jpeg?auto=webp&amp;s=4ad6a648b01f08d808a88746985c9c6b1e89ac1f"
        },
        "permalink": "/r/movies/comments/1ohk082/june_squibbs_criterion_closet_picks/"
    },
    {
        "id": "1ohj2wj",
        "author": "Minifig81",
        "title": "Wildwood First Look: Where Magic Takes Flight | LAIKA Studios",
        "content": "",
        "upvotes": 218,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pEmkBjsnPLUyJXrzmIZSSWNbzu4p8mui_WS3wivbgTM.jpeg?auto=webp&amp;s=ca6e7f67553bf11c6d86f3e7528f12d070513e7e"
        },
        "permalink": "/r/movies/comments/1ohj2wj/wildwood_first_look_where_magic_takes_flight/"
    },
    {
        "id": "1oh6hrc",
        "author": "fraisierdesbois",
        "title": "Björn Andrésen Dead: 'Death in Venice' Star Was 70",
        "content": "",
        "upvotes": 1125,
        "comments": 58,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S9Tf3vVnO6NwtGG72rS7ZLXj_xBtCpAJ6IQB93BFE6k.jpeg?auto=webp&amp;s=ddc19dcf04457f343e4c8395db1ab1a08a656b71"
        },
        "permalink": "/r/movies/comments/1oh6hrc/björn_andrésen_dead_death_in_venice_star_was_70/"
    },
    {
        "id": "1ohifpg",
        "author": "NoCulture3505",
        "title": "Zootopia 2 | International Trailer",
        "content": "",
        "upvotes": 159,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ZyUpXryDFq5sLCnpZXLbgTzl-9VzVNQbWWTjCX0tCEM.jpeg?auto=webp&amp;s=b34693e35a682ca123ff479f0d3978e2c21d41c6"
        },
        "permalink": "/r/movies/comments/1ohifpg/zootopia_2_international_trailer/"
    },
    {
        "id": "1ohcn92",
        "author": "writenowimfine",
        "title": "80's Movies That You Never Hear Of Now",
        "content": "Yes we had blockbusters and teen romances and rom-coms, but I also remember loving a lot of movies that no one seems to remember nowadays. Like China Girl. It was a darker, grittier take on West Side Story, set in the (then) modern day. Loved it (not just because of the hot lead actor, I promise). Even the trailer is great. \n\nhttps://youtu.be/WonOBoFfsDQ?si=d_Oj5N6zQF5sx3Eg",
        "upvotes": 204,
        "comments": 619,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Y0FWzn-fMMBQPzmEuqYw_UrAXD-Ck3lvYfg1fbtcRQg.jpeg?auto=webp&amp;s=6757c04fa2541f2837ffb2fa10e31c3fe899b7e3"
        },
        "permalink": "/r/movies/comments/1ohcn92/80s_movies_that_you_never_hear_of_now/"
    },
    {
        "id": "1ohbr9n",
        "author": "-FemboiCarti-",
        "title": "What is a bad movie you loved as a kid?",
        "content": "I used to LOVE Percy Jackson and the Lighting Thief when I was a tween. Now I’m an adult who has read all the books… it is a TOUGH watch 😭\n\nIn some ways I am sad that I can no longer enjoy dumb movies the same way as before, but also glad that I can fully appreciate really good movies that I would probably have found boring if I watched them 10 years ago. What are yours?\n",
        "upvotes": 207,
        "comments": 752,
        "media": null,
        "permalink": "/r/movies/comments/1ohbr9n/what_is_a_bad_movie_you_loved_as_a_kid/"
    },
    {
        "id": "1ohjof0",
        "author": "Task_Force-191",
        "title": "New Poster for Joachim Trier’s ‘Sentimental Value’ starring Renate Reinsve, Stellan Skarsgård, Inga Ibsdotter Lilleaas and Elle Fanning - When a famed director (Stellan Skarsgård) returns to his estranged daughters, the past and the present collide in a story of art, regret and redemption",
        "content": "",
        "upvotes": 67,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xf6c7hq0poxf1.jpeg?auto=webp&amp;s=f0f1c67ce4345a69501d2e6eb6986849619e8173"
        },
        "permalink": "/r/movies/comments/1ohjof0/new_poster_for_joachim_triers_sentimental_value/"
    },
    {
        "id": "1ohuumd",
        "author": "TerrifierBlood",
        "title": "Josh Hartnett To Star In Tommy Wirkola’s Action-Thriller ‘All Day &amp; All Night’ For XYZ Films — AFM",
        "content": "",
        "upvotes": 15,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IWk4EofnQRsh4iU2BVs-wLUSA-gT4rkCPs-HES1BoC8.jpeg?auto=webp&amp;s=44733c7448f756e57c3353b8a7567ea7bc8cc3a2"
        },
        "permalink": "/r/movies/comments/1ohuumd/josh_hartnett_to_star_in_tommy_wirkolas/"
    },
    {
        "id": "1ohn04q",
        "author": "pointingbone",
        "title": "A movie about daydreaming as a form of escapism",
        "content": "Hi, can you recommend me a movie about daydreaming as a form of escapism? The only example I could think of is Sucker Punch. I'm currently in a process of creating an installation about daydreaming for my bachelor's degree in art so I would like to find some more inspiration for my project. If you also know any other examples in other media, not only movies, I would appreciate it just as much :]",
        "upvotes": 35,
        "comments": 159,
        "media": null,
        "permalink": "/r/movies/comments/1ohn04q/a_movie_about_daydreaming_as_a_form_of_escapism/"
    },
    {
        "id": "1ohu4b6",
        "author": "Historical_Ostrich",
        "title": "Movies that squandered really cool premises?",
        "content": "The movie Bright was a tough watch, but I feel like the premise could have been turned into something much better. Modern day fantasy world set in the distant aftermath of a Lord of the Rings style clash between good and evil - I'd have been totally onboard with a halfway decent execution of that. What are some other movies that sounded cool on paper, but wound up missing the mark?",
        "upvotes": 17,
        "comments": 89,
        "media": null,
        "permalink": "/r/movies/comments/1ohu4b6/movies_that_squandered_really_cool_premises/"
    },
    {
        "id": "1ohp4sy",
        "author": "_DavidSPumpkins_",
        "title": "Need Hard-Boiled Detective Movie Recommendations, Prefer Sci-Fi / Alternative Reality",
        "content": "I just finished watching Split Second, a early 90's sci-fi detective movie with Rutger Hauer, and now I need more! The more \"throw out the book and get it done the hard way\" style detectiving the better. For reference I just watched Rutger dip his tooth brush in coffee and brush his teeth, before putting his cigarette out in said coffee and light up a cigar seconds later. That's the grit I crave!",
        "upvotes": 24,
        "comments": 83,
        "media": null,
        "permalink": "/r/movies/comments/1ohp4sy/need_hardboiled_detective_movie_recommendations/"
    },
    {
        "id": "1ohio71",
        "author": "Scared-Engineer-6218",
        "title": "Which movies from 20's do you think have/will have a cult following? (No popular movies)",
        "content": "A cult classic is ***a movie which may have a few, but dedicated fans***.\n\nSo please do not include the movies that are well liked and watched by a lot of people.\n\nThe decade is only half done. So there's a long time and cult classics don't happen overnight. But which movies do you see becoming cult classics? For example, **The Nice Guys (2016).** It bombed at BO, but it got its fans over time and they always mention the movie in the similar discussions.\n\nI think Palm Springs (2020) has a great chance to be that. What do you think?",
        "upvotes": 52,
        "comments": 208,
        "media": null,
        "permalink": "/r/movies/comments/1ohio71/which_movies_from_20s_do_you_think_havewill_have/"
    },
    {
        "id": "1ogoclh",
        "author": "paxinfernum",
        "title": "Matthew Lillard Embraces Queer Reading of Scream Killers",
        "content": "",
        "upvotes": 4514,
        "comments": 271,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mHXZsnw-zbeXXGz8Z8Hrb4Bd8IoYvKGGW-BWlbWA_OY.jpeg?auto=webp&amp;s=32c918ab1ed9c2b1352b391d347b62e0211b4a93"
        },
        "permalink": "/r/movies/comments/1ogoclh/matthew_lillard_embraces_queer_reading_of_scream/"
    },
    {
        "id": "1ohmdj7",
        "author": "Redditdonethat00",
        "title": "[made in Hong Kong] Another World teaser | 動畫電影《世外》30秒先導預告",
        "content": "",
        "upvotes": 31,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/24H4JZMny2jro8NF6XvAprVipP21Xr1fB1hGG5aD_80.jpeg?auto=webp&amp;s=90c1463b272a82b5629376888d9de9cd0434bd9a"
        },
        "permalink": "/r/movies/comments/1ohmdj7/made_in_hong_kong_another_world_teaser/"
    },
    {
        "id": "1oh2tgr",
        "author": "Used-Treat-1100",
        "title": "How come expensive movies look so cheap?",
        "content": "I wanted a “purely entertainment” movie and decided to watch Jurassic World Rebirth. I knew it wasn’t gonna be good but did not expect it to be so bad.\nOne of the main reasons why is that it looks CHEAP, but I don’t know how to explain.\nI expected a lot of CGI and green screen stuff, but it somehow looked like it was something low budget from 2002 despite being a big studio film from this year.\nI had this feeling with a couple of movies recently and I wanna complain correctly lol so can someone who understands a bit more about VFX help me understand?",
        "upvotes": 587,
        "comments": 432,
        "media": null,
        "permalink": "/r/movies/comments/1oh2tgr/how_come_expensive_movies_look_so_cheap/"
    },
    {
        "id": "1ohpweo",
        "author": "TheHowlingMan20",
        "title": "A fun early 60s horror movie involving a fiancées severed head, failed experiment humanoid monster and revenge - The Brain That Wouldn’t Die (1962)",
        "content": "",
        "upvotes": 17,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/O4sghEU5dmjGAxuE8-eLWnJzDrzuLznFdp_7HOGl_sk.jpeg?auto=webp&amp;s=a3fc8627e01d6270c137f895ee2d1d9b43440fff"
        },
        "permalink": "/r/movies/comments/1ohpweo/a_fun_early_60s_horror_movie_involving_a_fiancées/"
    },
    {
        "id": "1ohkfu5",
        "author": "UniverslBoxOfficeGuy",
        "title": "Lost &amp; Found in Cleveland: Trailer | in theaters November 7",
        "content": "",
        "upvotes": 27,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aDQ0YqjYQUTucCL2MvBc9of3djLRjuw6Ta233DnzdlI.jpeg?auto=webp&amp;s=b8ce734844a86a58fab1dc851e31240e294e1742"
        },
        "permalink": "/r/movies/comments/1ohkfu5/lost_found_in_cleveland_trailer_in_theaters/"
    },
    {
        "id": "1ogwq0y",
        "author": "XinvolkerX",
        "title": "What is a \"comfort movie\" of yours that most people would be surprised that you chose as being a comfort movie?",
        "content": "With all the Harry Potter's, Jaws, Lord of the Rings, and Titanic's out there that are common \"go-to\" comfort movies, there is a giant handful of other movies that some people would be surprised to know are comfort movies to others.\n\nFor me, it's \"Straight Outta Compton\".\n\nI could watch it every day, all day long.\n\nI love the behind the scenes depictions of how N.W.A. formed and the successes and struggles of their lifestyle and environment back in the 90's.\n\nWhat are your uncommon or unusual titles that others may see as non-typical comfort movies?",
        "upvotes": 1023,
        "comments": 2954,
        "media": null,
        "permalink": "/r/movies/comments/1ogwq0y/what_is_a_comfort_movie_of_yours_that_most_people/"
    },
    {
        "id": "1ohhxph",
        "author": "darth_vader39",
        "title": "A Warner Bros. Sale Could Kill Even More Jobs. How Will Hollywood Labor Respond?",
        "content": "",
        "upvotes": 33,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9IGSrAUtuTTzk76Io-BYS5V8J5jBvqYjFPK-4xdITWc.jpeg?auto=webp&amp;s=25a2e4cf7d6ac17dcd0d1e5fdc897b42700fec59"
        },
        "permalink": "/r/movies/comments/1ohhxph/a_warner_bros_sale_could_kill_even_more_jobs_how/"
    },
    {
        "id": "1ohfkxh",
        "author": "DemiFiendRSA",
        "title": "Simon Pegg, Sofia Boutella, Charlotte Gainsbourg &amp; Quentin Tarantino Starring In ‘Only What We Carry’; QT’s Biggest Screen Role In Years",
        "content": "",
        "upvotes": 39,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LSc1B0wcd0ImDfSMy-kcyeFILY1TR03TVPmC7QxF8-M.jpeg?auto=webp&amp;s=4266da4ea8bdd73eddec0204f67427f19a721b35"
        },
        "permalink": "/r/movies/comments/1ohfkxh/simon_pegg_sofia_boutella_charlotte_gainsbourg/"
    }
]