[
    {
        "id": "1j6nlbt",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement: Gary Sinise - Monday 3/10 at 12:00 PM ET - Star of Apollo 13, Forrest Gump, A Midnight Clear, The Green Mile, Of Mice and Men, Ransom, and much more.",
        "content": "",
        "upvotes": 294,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8cg26g0veine1.png?auto=webp&amp;s=7efc9641d47f658726567abf880d1608d35c9420"
        },
        "permalink": "/r/movies/comments/1j6nlbt/amaqa_announcement_gary_sinise_monday_310_at_1200/"
    },
    {
        "id": "1j5dyi3",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Mickey 17 / In the Lost Lands / Ne Zha 2 / My Dead Friend Zoe / Cleaner)",
        "content": "# New Theatrical Releases\n\n[Mickey 17](https://www.reddit.com/r/movies/comments/1j5dv2d/official_discussion_mickey_17_spoilers/?)\n\n[In the Lost Lands](https://www.reddit.com/r/movies/comments/1j5dv58/official_discussion_in_the_lost_lands_spoilers/?)\n\n[Ne Zha 2](https://www.reddit.com/r/movies/comments/1j5dv7y/official_discussion_ne_zha_2_spoilers/?)\n\n[My Dead Friend Zoe](https://www.reddit.com/r/movies/comments/1j5dvaf/official_discussion_my_dead_friend_zoe_spoilers/?)\n\n[Cleaner](https://www.reddit.com/r/movies/comments/1j5dvd0/official_discussion_cleaner_spoilers/?)\n\n# Still in Theaters\n\n[Last Breath](https://www.reddit.com/r/movies/comments/1izxxg1/official_discussion_last_breath_spoilers/?)\n\n[Riff Raff](https://www.reddit.com/r/movies/comments/1izxxja/official_discussion_riff_raff_spoilers/?)\n\n[Mobile Suit Gundam GQuuuuuuX: Beginning](https://www.reddit.com/r/movies/comments/1izxxn8/official_discussion_mobile_suit_gundam_gquuuuuux/?)\n\n[The Monkey](https://old.reddit.com/r/movies/comments/1iuh94f/official_discussion_the_monkey_spoilers/?)\n\n[Captain America: Brave New World](https://old.reddit.com/r/movies/comments/1ip0ump/official_discussion_captain_america_brave_new/?)\n\n\n# On Streaming\n\n[The Gorge](https://old.reddit.com/r/movies/comments/1iuhec9/official_discussion_the_gorge_spoilers/?)\n\n[Bridget Jones: Mad About the Boy](https://old.reddit.com/r/movies/comments/1iuhedf/official_discussion_bridget_jones_mad_about_the/?)",
        "upvotes": 45,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1j5dyi3/official_discussion_megathread_mickey_17_in_the/"
    },
    {
        "id": "1j6xfq3",
        "author": "Vanderlyley",
        "title": "Paramount Posts $286M Fourth Quarter Streaming Loss",
        "content": "",
        "upvotes": 7356,
        "comments": 939,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FRXeGK0eWl04ZUB1PqPZq7OlIJrxW-4dRwNMk2-GlWc.jpg?auto=webp&amp;s=135184559ba88e0a345bdc1617bf4d57a1bc9882"
        },
        "permalink": "/r/movies/comments/1j6xfq3/paramount_posts_286m_fourth_quarter_streaming_loss/"
    },
    {
        "id": "1j769o2",
        "author": "MarvelsGrantMan136",
        "title": "‘Jaws’ at 50: Celebrating the Film That Forever Haunted Our Oceans",
        "content": "",
        "upvotes": 245,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OJWhgL81Xiw6Xcvku7h2OCDSjFW8NCH-0vVVVo7Kp-I.jpg?auto=webp&amp;s=a742d92280b2c53629bee9ad710758a536936aef"
        },
        "permalink": "/r/movies/comments/1j769o2/jaws_at_50_celebrating_the_film_that_forever/"
    },
    {
        "id": "1j7797a",
        "author": "AdrianVeidt19",
        "title": "I stopped watching trailers and it's the best movie related decision i ever made",
        "content": "It's been years and it's not something i did on purpose, it just happened.\n\nYou might think 'yeah, trailers became very spoilery and it makes sensw' but not necessarily, sure it's a giant fuckin problem but major reason, at least for me is that there were a lot of times trailers made me interpret some scenes wrong and i know it's kinda the point sometimes but couldn't help it, i was always disappointed, trailer moments mixed with different music with different vibes and then you waiting them always ruined the moment for me, can't even explain properly but it just fuckin mixed my emotions wrongly. Avoiding spoilers and not knowing any scenes is a bonus.\n\nMost of the time I don't even read synopsis, i always go blind into the movies now (of course if it's not known widely what it is about) and it's been great.",
        "upvotes": 177,
        "comments": 44,
        "media": null,
        "permalink": "/r/movies/comments/1j7797a/i_stopped_watching_trailers_and_its_the_best/"
    },
    {
        "id": "1j6yw1v",
        "author": "KuroKinoko",
        "title": "Name an actor whose acting you can always 'see'.",
        "content": "If you get my meaning... I don't mean in the superstar sense. Tom Cruise is a mega star but I can still watch a film of his and be lost in it. I mean an actor who I'm just aware they're acting the entire time, not necessarily bad acting, just noticeable (which I suppose is bad.) I get this with DiCaprio and (less so) Bradley Cooper.",
        "upvotes": 642,
        "comments": 1428,
        "media": null,
        "permalink": "/r/movies/comments/1j6yw1v/name_an_actor_whose_acting_you_can_always_see/"
    },
    {
        "id": "1j6rovv",
        "author": "MarvelsGrantMan136",
        "title": "‘A Quiet Place 3’ Is Officially In Development",
        "content": "",
        "upvotes": 1950,
        "comments": 464,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nrYamjljdlWxTdAmq2jdCzRxnFZ9xjNhLInqsN9bf1s.jpg?auto=webp&amp;s=5ec407ba69d37d871d1158953b406e15e53c6124"
        },
        "permalink": "/r/movies/comments/1j6rovv/a_quiet_place_3_is_officially_in_development/"
    },
    {
        "id": "1j6nuxm",
        "author": "MarvelsGrantMan136",
        "title": "John Goodman Injured During Warner Bros Movie Starring Tom Cruise, Production Briefly Delayed In UK",
        "content": "",
        "upvotes": 2619,
        "comments": 197,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zLuhDPNJd9b_d_uAfk_dYX7xzHuR0eZFnhMHVwdL554.jpg?auto=webp&amp;s=244ad55f6261bbe34fafca2c3bc4572a2b51ecb5"
        },
        "permalink": "/r/movies/comments/1j6nuxm/john_goodman_injured_during_warner_bros_movie/"
    },
    {
        "id": "1j6dh7e",
        "author": "cglotr",
        "title": "Pre-cinema ads getting longer and ‘wasting time’ of frustrated film fans",
        "content": "",
        "upvotes": 22964,
        "comments": 2025,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/tFbYlOxJF15Io3bHrmZ3la9kmPjJO5p_ElqiAx42LoE.jpg?auto=webp&amp;s=75ae2f77200120995b346aa26e5077543fa63bda"
        },
        "permalink": "/r/movies/comments/1j6dh7e/precinema_ads_getting_longer_and_wasting_time_of/"
    },
    {
        "id": "1j78ndz",
        "author": "Funny2Who",
        "title": "Jim Downey(Billy Madison, Saturday Night Live) talks about his experience on acting in There Will Be Blood with Daniel Day Lewis and Paul Thomas Anderson.",
        "content": "",
        "upvotes": 52,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/T4H3zgE-W6nsBaK4AcJPzwzvwhFWELtNnc6RcwmgJAs.jpg?auto=webp&amp;s=de0af435c851270370409fd95613f15f4ce8bf21"
        },
        "permalink": "/r/movies/comments/1j78ndz/jim_downeybilly_madison_saturday_night_live_talks/"
    },
    {
        "id": "1j7a8u8",
        "author": "kookookachu26",
        "title": "Great movies that have an abysmal cult following?",
        "content": "The biggest culprit of this I think HAS to be the wolf of Wall Street. Everyone watched that movie and all the young people of the world thinks that they are now a financial expert and stock broker. I really truly think that this movie is what popularized all the efforts to make it big off of meme coins and penny stocks. I have seen so many different reels of people who have clearly watched this movie and start using words like, “price position,” and “leveraged,” when we all know they don’t know at all what they are talking about. \n\nThat being said, I do think that the wolf of Wall Street is a great movie and is one of Scorsese’s best films to date… it just gets slightly tarnished by the awful cult following it has. ",
        "upvotes": 26,
        "comments": 88,
        "media": null,
        "permalink": "/r/movies/comments/1j7a8u8/great_movies_that_have_an_abysmal_cult_following/"
    },
    {
        "id": "1j6wh6x",
        "author": "No_Type_7156",
        "title": "What’s your most powerful in theatre movie experience?",
        "content": "I saw Amadeus when it came out. I still remember how people were weeping during the Requiem and then the couple of minutes of utter silence when the film ended. Then the whole audience erupted in applause. This was in a chain theatre in rural NY. It was amazing to be in that shared moment, being swept away by a film.",
        "upvotes": 337,
        "comments": 823,
        "media": null,
        "permalink": "/r/movies/comments/1j6wh6x/whats_your_most_powerful_in_theatre_movie/"
    },
    {
        "id": "1j6owdi",
        "author": "jokunokun",
        "title": "My wife (not an animation fan) has told me I can pick one animated film for us to watch. Which one??",
        "content": "***EDIT #4- Putting this at the top because it's an important development: she wants me to clarify that she hasn't always disliked ALL animated films. She liked the first Toy Story (although hasn't shown any interest in the sequels) and swears i convinced her to watch \"a movie about two girls and there were race cars (?what?).\" Also, anime is back on the table for some reason, so that opens up a lot of possibilities.\n\n\n***EDIT-this has gotten way more traction than I expected. I appreciate everyone 's input so far and it's unlikely I'll be able to respond to everyone. A couple of notes:\n\n1- I don't know exactly why she doesn't like animation. She just can't seem to get interested. I've tried in the past, I have. It hasn't captured her attention.\n\n2- Despite some very good recommendations, I'd like to avoid traumatizing her completely (Grave of the Fireflies, for example)\n\n3- She likes a variety of genres, so it's hard to narrow it down. She's also incredibly difficult to shop for, in the same way. She's very much a \"I'll know what I like when I see it\" person.\n\n****EDIT #2- Some great options so far. Lead contenders right now are probably Up, Wild Robot, Wall-E, Spiderverse, Incredibles, Iron Giant, Flow (I haven't seen this one yet either), Shrek.\n\nAbsolute no-no's, and you should be ashamed of yourselves (you know who you are) Heavy Metal, Watership Down, Grave of the Fireflies\n\n****EDIT #3- I've tried in the past. I thought we were on to something when she said she'd watch the Buzz Lightyear movie, but that was a stinker and she hasn't tried again since then.\n*.*.*.*\n\n\nMy wife has never enjoyed animated movies, so I'll usually watch any animated films on my own when they're released on a streaming service. She has just told me that I can pick any one animated film for us to watch together. Anime and any significantly older film (like classic Disney) won't fly. What should it be? I think it's got to be something that hits deep emotionally. Up? Wild Robot? What are your thoughts? \n\nThis could be my only chance to add animated films to out list of watchables.",
        "upvotes": 1007,
        "comments": 3646,
        "media": null,
        "permalink": "/r/movies/comments/1j6owdi/my_wife_not_an_animation_fan_has_told_me_i_can/"
    },
    {
        "id": "1j79lho",
        "author": "mab5084",
        "title": "The Wild Robot",
        "content": "Was anyone else completely blown away by this movie? I watch A LOT of movies, hadn’t really even heard of this, watched the trailer and immediately watched it. \n\nI have been preaching about this movie to quite a few people and several people have been like “eh it’s just okay.” \n\nI don’t get it. I’m a 38 year old man with no kids and it floored me. How are mothers with young kids unaffected by this?! lol Am I thinking too much into it? \n\nSpecifically the scene where Brightbill takes flight with the flock (can YouTube “I could use a boost”) is one of the top moments in any movie ever; between the beautiful cinematography and the powerful score. Who is watching THAT and not feeling emotion? ",
        "upvotes": 26,
        "comments": 19,
        "media": null,
        "permalink": "/r/movies/comments/1j79lho/the_wild_robot/"
    },
    {
        "id": "1j6r82y",
        "author": "HeatingsBackOn",
        "title": "\"The Wild Robot\" made me cry. It made me cry a lot.",
        "content": "Just finished watching. I heard this film will hit you hard as a parent, but i don't even have kids and fucking hell I was holding back tears from about 30 mins in every 5 minutes. So even you're just chronically single and alone like me, it doesn't matter, you will probably bawl. It hit me like, i don't know, i cant remember the last time i cried like that at a film. So watch it, actually don't it will make you cry, so do, but maybe don't. Oh i don't rightly fucking know. Im still shooketh.",
        "upvotes": 662,
        "comments": 113,
        "media": null,
        "permalink": "/r/movies/comments/1j6r82y/the_wild_robot_made_me_cry_it_made_me_cry_a_lot/"
    },
    {
        "id": "1j6ocgr",
        "author": "ChiefLeef22",
        "title": "Hollywood Flashback: When 22-year-old Tom Cruise Starred in Ridley Scott’s Unicorn Movie 'Legend' Hot off of ‘Risky Business'",
        "content": "",
        "upvotes": 865,
        "comments": 101,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qFeU8mYx5VDCAC-RJafL1SHrj2EtBspSxtQv4R-Z-5U.jpg?auto=webp&amp;s=a7cc09a1096f13ae5a68475cd061ae41d1a674ca"
        },
        "permalink": "/r/movies/comments/1j6ocgr/hollywood_flashback_when_22yearold_tom_cruise/"
    },
    {
        "id": "1j6ra16",
        "author": "ImJacksThrowaway",
        "title": "Re watched The Master recently I honestly think this \"The Processing Scene\" might be the most well acted scene ive ever seen. Phoenix &amp; Hoffman (RIP) put on a clinic",
        "content": "",
        "upvotes": 550,
        "comments": 68,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vCIXjqy3T3lGfT_W7gEHgww3HBWb9szA2pNHNi5taRQ.jpg?auto=webp&amp;s=fc22927338badb8a8628a8b1fabad2af1a8b5058"
        },
        "permalink": "/r/movies/comments/1j6ra16/re_watched_the_master_recently_i_honestly_think/"
    },
    {
        "id": "1j76p2h",
        "author": "NP_Wanderer",
        "title": "Sidney Poitier 1967 Trifecta: In the Heat of the Night, Guess Who's Coming to Dinner, and To Sir With Love",
        "content": "This may not resonate with some of our younger readers for whom race relations has been explored in detail over the past 50 years or so.  But try to go back 50 years.  Until 1967 interracial marriage was illegal in some states until  Loving vs Virginia where the Supreme Court struck down a 1883 decision legalizing these laws.  Jackie Robinson became the first black major league baseball player just 20 years earlier.\n\nSo looking from that point of view. let's look at these three movies and his performances.  \n\nIn the Heat of the Night has true vistuoso performances by Poitier and Rod Steiger.  Steiger as the bigoted sheriff, Poitier as the black detective Virgil Tibbs.  A must see for pure raw emotion.   After thoroughly demolishing the Sheriff's railroading of someone in front of the widow of the murder victim and the very important owner of the town factory.  Like other ignorant bullies, he falls back on name-calling and demonizing the other.\n\nSheriff: \"Virgil, that's a funny name for a nigger boy that comes from Philadelphia.  What do they call you there\" \n\nTibbs: \"They call me Mister Tibbs\"\n\nGuess Who's Coming to Dinner is a less emotional, more reasoned approach to race relations.  Also having Spencer Tracy and Katherine Hepburn was great.\n\nTo Sir With Love, may be best remembered now for the theme song by Lulu looks at disenfranchised youths and racism.  Shows the power of respect, for ourselves and others.",
        "upvotes": 26,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1j76p2h/sidney_poitier_1967_trifecta_in_the_heat_of_the/"
    },
    {
        "id": "1j77d8n",
        "author": "NstgElNino",
        "title": "What are the best Final girl/Female character movies ?",
        "content": "THE HUNT 2020 is so underrated. Betty Gilpin is a definition of beautiful and badass. She is a badass from the start untill the end. She also very funny in the film. She has a couple scene where she did a funny face out of a sudden and just start killing. She is the definition of you messed with a wrong person. I am very upset that she did not get more action roles after watching this movie. She single-handedly kills everyone in this movie. She also kinda looks like Sandra Bullock in my opinion, haha. I also loved the final girl from the movie YOU'RE NEXT.",
        "upvotes": 19,
        "comments": 39,
        "media": null,
        "permalink": "/r/movies/comments/1j77d8n/what_are_the_best_final_girlfemale_character/"
    },
    {
        "id": "1j70nz2",
        "author": "T_ChallaMercury",
        "title": "What's the last movie you watched on physical media (DVD, Blu-ray, VHS)?",
        "content": "I'm curious to see what people have been watching on DVD and/or Blu-ray Disk.  I'm curious if people are still buying DVDs.  I'm also curious to see who still owns a VCR and plays VHS tapes.  I know streaming and VOD have become the norm but I still think there is value in owning films (and TV shows) on disc or tape.",
        "upvotes": 66,
        "comments": 407,
        "media": null,
        "permalink": "/r/movies/comments/1j70nz2/whats_the_last_movie_you_watched_on_physical/"
    },
    {
        "id": "1j7a3gh",
        "author": "WorthPlease",
        "title": "Looking for movie recommendations similar to Prisoners (2013)",
        "content": "Finished watching this last night, one of my favorite movies I've seen in a long time. It really gave me True Detective Season 1 vibes (which is why it was recommended to me).\n\nSome people might recommend something like Nightcrawler, but not looking for a movie where the main character(s) are insane or psychopaths, but also not just obvious good guys.",
        "upvotes": 10,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1j7a3gh/looking_for_movie_recommendations_similar_to/"
    },
    {
        "id": "1j703vv",
        "author": "herewego199209",
        "title": "What's a movie that destroys you after watching it? For me it's BRIDGE TO TERABITHIA. The reveal both in the book and the movie had my entire high-school class including the teacher bawling our eyes out.",
        "content": "Movies with death in them, or you know the character is going to die, but you get an entire movie to relate to them. Sweet November and Marley and Me were movies I knew the plot of before watching, and it still destroyed me at the end of those movies. The thing that made Bridge to Terabithia so heartbreaking for me as a kid was that what happened could've happened to any one of our best friends.",
        "upvotes": 70,
        "comments": 100,
        "media": null,
        "permalink": "/r/movies/comments/1j703vv/whats_a_movie_that_destroys_you_after_watching_it/"
    },
    {
        "id": "1j7aitc",
        "author": "Trike117",
        "title": "Blockbuster versus Tentpole",
        "content": "(Get your “old man yells at cloud” meme out.)\n\nThis is kind of driving me to distraction, the misuse of the term “blockbuster” when what they mean is “tentpole”.\n\nA blockbuster is a movie that is a big hit; it refers to people lining up *around the block* waiting to buy tickets. The word itself derives from really big conventional bombs during WWII that would blow up a whole city block. It’s interesting to me that when a film is a hit it is named after a specific type of bomb, but when it’s not a hit it’s just called a bomb.\n\nAnyway, a film that hasn’t yet been released or has just recently released can’t be a blockbuster until it makes a ton of money.\n\nA tentpole film has traditionally meant the type of four-quadrant crowd-pleaser that is *most likely* to become a hit (and hopefully turn into a blockbuster) that earns enough money to pay for all the mid-list and lower-budget films the studio also releases during the year. They’ll make a prestige drama to win awards which might break even at the box office, but count on a film with mass appeal to draw the crowds and pay the bills. (Typically with associated ancillary sales of toys and other merch.) The moneymaker holds up the circus tent that the smaller, less-popular acts also play in. Hence “tentpole”.\n\n(Of course the problem these days is that it’s almost all tentpoles and few mid-budget movies. Every major studio is swinging for the fences like it’s a home run derby rather than releasing a mixed slate of films because streaming has changed the dynamics. Still, the definitions remain.)\n\nSide note: can we also stop saying “verse” when we mean “versus”? It’s one more syllable ya lazy nogoodniks! Same for “verbage” instead of “verbiage”. It makes one sound like the slow kid in class.\n\nOther side note: I get that language changes over time, but some changes are just dumb and should be resisted because it impedes communication. It’s like when people say “taunt” when they mean “taut”, or write “lead” when they mean “led”.",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1j7aitc/blockbuster_versus_tentpole/"
    },
    {
        "id": "1j6obz2",
        "author": "mrod35",
        "title": "My favorite opening title, from The Girl with the Dragon Tattoo. Fantastic song and visuals.",
        "content": "",
        "upvotes": 342,
        "comments": 58,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TV_xxAvLR4uvLLNKi-h4SDg1KB1a-sBNsKczKa3rlec.jpg?auto=webp&amp;s=33d11d0ab20d126d6b65c4adfb844f8bd9acd80f"
        },
        "permalink": "/r/movies/comments/1j6obz2/my_favorite_opening_title_from_the_girl_with_the/"
    },
    {
        "id": "1j6mhnt",
        "author": "ChiefLeef22",
        "title": "'Novocaine' - Review Thread",
        "content": "*\"When the girl of his dreams (Amber Midthunder) is kidnapped, everyman Nate (Jack Quaid) turns his inability to feel pain into an unexpected strength in his fight to get her back.\"*\n\n**Rotten Tomatoes:** [94%](https://www.rottentomatoes.com/m/novocaine_2025/reviews)\n\n**Metacritic:** [69/100](https://www.metacritic.com/movie/novocaine-2025/)\n\nSome Reviews:\n\n[The Hollywood Reporter - Frank Scheck](https://www.hollywoodreporter.com/movies/movie-reviews/novocaine-review-jack-quaid-1236157792/)\n\n&gt;The numerous fight scenes, which often lapse into extreme gore, are as amusing as they are exciting. *Novocaine*, which amusingly employs REM’s “Everybody Hurts” to accompany the opening credits, would probably have eventually worn out its welcome (it still feels overlong at 110 minutes) were it not for Quaid’s terrific performance.\n\n[IndieWire - Kate Erbland](https://www.indiewire.com/criticism/movies/novocaine-review-jack-quaid-1235101694/)\n\n&gt;The film makes a great case for Quaid as action hero, Midthunder as romantic charmer, and Berk and Olson as being ready to step out of their horror-centric background.\n\n[Collider - Jeff Ewing](https://collider.com/novocaine-2025-movie-review/)\n\n&gt;It’s a gory, bonkers action-comedy premise anchored by a set of strong performances and a surprisingly poignant meet-cute, making for a wildly memorable action outing.\n\n[Screen Rant - Rachel LaBonte](https://screenrant.com/novocaine-movie-review/)\n\n&gt;Suffice to say, *Novocaine* takes you on a rollicking adventure that, once it begins after Sherry's abduction, doesn't really let up. Sure, there's some tonal awkwardness with the actual bank heist scene — it's far more distressing than anything else in the movie — but between the humor and Quaid's performance, there's so much fun to be had here that it's easy to just sit back and enjoy the ride.\n\n[IGN - Lena Wilson](https://www.ign.com/articles/novocaine-review)\n\n&gt;Novocaine offers more depth than its gimmicky “man who feels no pain” premise may lead you to believe. This movie breathes new life into old ideas, with an original hero buoyed by the charm of Jack Quaid and a heroine who ably beats the damsel-in-distress allegations. Novocaine is smart, but not so self-aware that it’s likely to alienate anybody; sharp, but not without feeling.\n\n[Looper - Audrey Fox](https://www.looper.com/1806454/novocaine-movie-review/)\n\n&gt;Novocaine is packed full of inventive action set pieces that are alternately gruesome, goofy, and sometimes even both at once. It may not be for everyone, but it kind of feels like the gold standard for this very specific brand of action comedy.\n\n[DEADLINE - Gregory Nussen](https://deadline.com/2025/03/novocaine-review-jack-quaid-1236313943/)\n\n&gt;This is not the blistering action satire that *Hot Fuzz* is, but it’s not the somber, balletic revenge plot of *Wick*, either. *Novocaine* is, frequently, a riot, but one wishes Jacobsen’s script would have gone through another draft to iron out some flimsier details. It doesn’t help that some late plot developments feel bizarrely convenient or else invalidate much of its own setup.\n\n[Slant Magazine - Rocco T. Thompson](https://www.slantmagazine.com/film/novocaine-review-jack-quaid/)\n\n&gt;We’re used to heroes who can take a licking and keep on ticking, but *Novocaine* takes action-movie invulnerability to brutal comic extremes. Starring Jack Quaid as a timid not-quite-everyman on the trail of the bank robbers who kidnapped his would-be girlfriend, the film offers little novelty beyond its hero being a human pin cushion, but it’s stuffed with enough creative violence to make even jaded action fans squirm in their seats.",
        "upvotes": 347,
        "comments": 168,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/tVPm5U0uBRZKjJ7XYjBHbX9VlT5d3QCDKbeu0oQ1IwM.jpg?auto=webp&amp;s=22a21c757f2500435588e1183944d4108d6e72b2"
        },
        "permalink": "/r/movies/comments/1j6mhnt/novocaine_review_thread/"
    },
    {
        "id": "1j6z6f1",
        "author": "Hdhs1",
        "title": "What was the most unnecessary remake?",
        "content": "Many remakes aim to introduce classic films to a new generation, updating visuals, tweaking storylines, or modernizing themes. Some breathe new life into beloved stories, while others feel like a fresh take on a familiar concept. However, there are also remakes that seem to exist without a clear purpose—films that don’t improve upon the original, add anything meaningful, or even justify their own existence. These often leave audiences wondering: Why was this even made?\n\nWith that in mind, what do you think is the most unnecessary remake?",
        "upvotes": 52,
        "comments": 495,
        "media": null,
        "permalink": "/r/movies/comments/1j6z6f1/what_was_the_most_unnecessary_remake/"
    },
    {
        "id": "1j6czbi",
        "author": "Videowulff",
        "title": "I am sorry mate but Mortal Kombat's opening title is one of the best in cinema history. Fight me.",
        "content": "",
        "upvotes": 1802,
        "comments": 373,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IiO1JKpeAYan23LXMT9S9UrcivWHWa8zCOD6vZicOyU.jpg?auto=webp&amp;s=63da40a861fbedbee9430e4a94a222bd0cfaba7f"
        },
        "permalink": "/r/movies/comments/1j6czbi/i_am_sorry_mate_but_mortal_kombats_opening_title/"
    },
    {
        "id": "1j61ddb",
        "author": "FruitOrchards",
        "title": "Sky News: Gene Hackman's wife died from rare infectious disease around a week before actor's death, medical investigator says",
        "content": "",
        "upvotes": 15639,
        "comments": 1422,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QuwrqzJKgDUbIp81h2Q9mBa1z9VD61z0fgiE60ETskg.jpg?auto=webp&amp;s=0ac585932b6d93a5c13737d773a19ff0b9f0b41c"
        },
        "permalink": "/r/movies/comments/1j61ddb/sky_news_gene_hackmans_wife_died_from_rare/"
    },
    {
        "id": "1j74a96",
        "author": "NstgElNino",
        "title": "What are your favorite \"BASED ON A TRUE STORY\" movies ?",
        "content": "The Conjuring 2013 is my favorite based on a true story movies. That movie gave me nightmare when i was a kid. I was afraid to look up at my closet for years. It will be my forever favorite horror movies. I also loved the movies about a serial killer because you know it will definitely based on a true story. I know its not a movie but i really liked Monster: Jeffrey Dahmer Story. That show is dark and disturbing.",
        "upvotes": 12,
        "comments": 74,
        "media": null,
        "permalink": "/r/movies/comments/1j74a96/what_are_your_favorite_based_on_a_true_story/"
    },
    {
        "id": "1j6p1go",
        "author": "NYRangers1313",
        "title": "Why Was Congo So Hated On Release?",
        "content": "I'll be the first to admit, Congo isn't a great movie. But it's a lot of fun, well acted, good pacing and fun scenes. It seems like a great 90's Popcorn action-adventure movie. I do know that ever sense Congo came out it's been considered one of the worst movies ever. For a long while in the late 2000s to early 2010s, when list articles were more common, Congo would often appear on the lists of worst movies or biggest box office disappointments. \n\nBut why? I get it doesn't follow the book at all. The book has more of a darker/horror-adventure tone and the film is more light hearted PG-13 adventure. Is that basically why everyone choose to hate it? I am also going to go on a whim that most of the audience never read the book either and there are many other movie adaptations that don't follow the book closely and are still consider good movies.\n\nWas it basically all the same critics and audiences that also hated on Waterworld which for a long while was also considered a bad movie or the worst movie. \n\nCongo isn't perfect but I always rewatch it every few years and find myself enjoying it every time.",
        "upvotes": 127,
        "comments": 267,
        "media": null,
        "permalink": "/r/movies/comments/1j6p1go/why_was_congo_so_hated_on_release/"
    },
    {
        "id": "1j6h0zw",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for ‘The Assessment’ Starring Alicia Vikander, Elizabeth Olsen, &amp; Himesh Patel - In the near future where parenthood is strictly controlled, a couple's seven-day assessment for the right to have a child unravels into a psychological nightmare.",
        "content": "",
        "upvotes": 354,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gjta1avgvgne1.jpeg?auto=webp&amp;s=2597957e7baff4fb827601b7adbc8c6528f4ebb4"
        },
        "permalink": "/r/movies/comments/1j6h0zw/official_poster_for_the_assessment_starring/"
    },
    {
        "id": "1j74w2y",
        "author": "freezywaves",
        "title": "Tales of the Bizarre (1970)",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/o3GEAFg1pgH1azEgh0BsP57GmvfNeG4KuqbalrhJaX8.jpg?auto=webp&amp;s=b65d82eb9a5bc58bed96fe7214b212869db2ea5a"
        },
        "permalink": "/r/movies/comments/1j74w2y/tales_of_the_bizarre_1970/"
    }
]