[
    {
        "id": "1r75cpg",
        "author": "AUsefulGhostAMA",
        "title": "Hey r/movies! I’m Ratchapoom Boonbunchachoke, director of A USEFUL GHOST, my feature directorial debut. The film premiered last year in Cannes, where it won the Grand Prix at Cannes' Critics Week. It’s currently playing in select theaters. Ask me anything!",
        "content": "Hey r/movies! I’m Ratchapoom Boonbunchachoke, director of A USEFUL GHOST.  \n\nMy feature debut premiered last year in Cannes, where it won the Grand Prix at Cannes' Critics Week.  It's currently playing in select theaters across North America, and is now available to pre-order on digital.\n\n*Here's the trailer:*\n\n[https://www.youtube.com/watch?v=vcrx14GZ\\_Io](https://www.youtube.com/watch?v=vcrx14GZ_Io)\n\n*Synopsis*:  \n\n&gt;Worried about her husband being allergic to dust, Nat, a recently-dead woman, returns as a ghost possessing a vacuum cleaner to clean the house and protect her family from other vengeful ghosts in the house. To become a useful ghost, she needs to get rid of the useless ones.\n\n*Tickets/info:*\n\n[https://ausefulghost.com/](https://ausefulghost.com/) \n\n*You can pre-order &amp; buy the film here:*\n\n* [Apple TV ](https://tv.apple.com/ca/movie/a-useful-ghost/umc.cmc.2o1ot565stw3togealcc416gb)\n* [Fandango at Home](https://athome.fandango.com/content/browse/details/A-Useful-Ghost/4863807)\n* [Amazon](https://www.primevideo.com/detail/A-Useful-Ghost/0SNLEW4J9AWZL3MXLUCJLIDVJQ)\n\nAsk me anything, Reddit! Back at 4:30 PM PT/7:30 PM ET today (Tuesday 2/17) to answer your questions.",
        "upvotes": 123,
        "comments": 55,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qoz248l590kg1.png?auto=webp&amp;s=2206edcdde7224012d1cb1df950689bb1c301ad7"
        },
        "permalink": "/r/movies/comments/1r75cpg/hey_rmovies_im_ratchapoom_boonbunchachoke/"
    },
    {
        "id": "1r7lzba",
        "author": "SanderSo47",
        "title": "February 13-16 Box Office Recap – 'Wuthering Heights' debuts with a solid $37.5M domestically, but over-performs overseas with $88.5M worldwide. 'Goat' over-performs with $35.1M domestically and $50.7M worldwide. 'Crime 101' and 'Good Luck, Have Fun, Don't Die' flop with just $16M and $4.1M.",
        "content": "https://preview.redd.it/lj9ynhb0z4kg1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=de92957b9a4e838255b3ef6ef84ec09eb84d0133\n\nIt was a busy weekend at the movies, although it was a mixed bag for the newcomers.\n\n***Wuthering Heights*** topped the box office, although its performance was divided by a slightly below average performance domestically and an over-performance overseas. ***Goat*** surpassed its forecast, and even managed to dethrone the prior film on Sunday and Monday. The real losers were ***Crime 101*** and ***Good Luck, Have Fun, Don't Die***, with the former continuing another losing streak for star Chris Hemsworth.\n\nThe Top 10 earned a combined $127.5 million this weekend. That's down 23.9% from last year, when ***Captain America: Brave New World*** opened at #1.\n\nOpening in first place, there was WB's ***Wuthering Heights***, which amassed $32.8 million ($37.5 million four-day) in 8,908 theaters. That's the best debut for director Emerald Fennell, already outgrossing her prior films ***Promising Young Woman*** and ***Saltburn***. It's also Jacob Elordi's biggest ever debut as lead or co-lead.\n\nThis is a very solid debut, although the early forecasts for the film projected a four-day debut in the $40 million range (with some going as high as $50 million). But the truth is that it was a tough hill to climb for a film. It was the 33rd biggest debut in February, and it didn't come close to the figures of other high romance titles released during the month.\n\nA film like ***Wuthering Heights*** has a ceilling, given that period films aren't known for high openings. At the end of the day, it's not the first ***Wuthering Heights*** adaptation. So on its own, this is a solid debut. Although one could argue that it could've done a little better than this. Pre-sales were reportedly high, but poor walk-ups led to an over-estimated number. WB mounted a very extensive marketing campaign (Deadline said they spent $85 million on marketing), and it was plastered all over the world. But there were some challenges to overcome.\n\nFor starters, a property like ***Wuthering Heights*** was never going to open as high as other popular adaptations like ***Fifty Shades of Grey*** ($85 million). Some people may be aware of the novel, but that doesn't mean they'll feel compelled to pay a ticket for another version. That's why it had a ceilling. But then the film had some months of poor press when it was clear that this was not gonna be a faithful ***Wuthering Heights*** adaptation.\n\nSince its announcement, the film attracted controversy for casting Margot Robbie and Jacob Elordi in the lead roles, as it takes liberties with the stories and characterization. But perhaps it was the fact that this was going to be a radical new take on the property, deviating from the source material in some ways. That's why the film's title is stylized as ***\"Wuthering Heights\"***, explicitly telling you this won't be the novel you read. And it also indicated that this film would go on a more sexual and darker route, which would limit its potential. So the film lost some potential audience members who were hoping for a loyal adaptation to the novel.\n\nThere's also something to be said on how Fennell would execute this, based on the mixed word of mouth for ***Saltburn***. Although it started with some positive reviews, the scores for ***Wuthering Heights*** had been dropping. It's currently sitting at 60% on RT, and it's nearing the rotten status. If you really want people to care for a new ***Wuthering Heights***, you really need to deliver quality.\n\nAccording to WB, 76% of the audience was female, and 63% was in the 18-34 demographic. Even though it was sold as a Valentine's Day release, only 22% of the audience was dates or marriages. They gave it a so-so \"B\" on CinemaScore. Not a bad score for a film like this, but it also doesn't point to great word of mouth. ***Wuthering Heights*** is already seeing the effects of front-loaded box office, given its steep 43% drop on Sunday. Given the mixed word of mouth, it's likely that the film collapses over the next weeks. Right now, a $75 million domestic total is likely for ***Wuthering Heights***.\n\nIn second place, Sony's ***Goat*** over-performed projections with a pretty good $27.2 million ($35.1 million four-day). It's the best debut for an animated original since ***Elemental*** ($29.6 million). \n\nThe film cost $80-$90 million, so it will have to stay in here for a while before turning a profit, but this bodes very well for its prospects. With ***Zootopia 2*** slowing down and ***Hoppers*** still a few weeks ago, Sony was smart in placing the film over the Presidents' Day weekend, as families were starving for a new animated film. The story may have been simple, but it was fun and cute enough to win over audiences. Some good reviews (80% on RT) didn't hurt either.\n\nAccording to Sony, 51% of the audience was female, and 49% was in the 18-34 demographic. They gave it a great \"A\" on CinemaScore, signs of very good word of mouth. Even with ***Hoppers*** coming in early March, ***Goat*** should try to reach $100 million domestically. And it could get even higher. As a note, it's poised to overtake ***Wuthering Heights*** next week; it already topped the box office on Sunday and Monday. This goat's got game.\n\nDebuting in third place, Amazon MGM's ***Crime 101*** flopped with just $14.2 million ($16 million four-day) in 3,161 theaters. The debut is better than recent Amazon title ***Mercy*** ($12 million), but it's still an underwhelming figure considering its big $90 million budget.\n\nDespite an intriguing cast, ***Crime 101*** did not look much different from the countless crime thrillers we can find on streaming. Amazon spent considerably on marketing, but it still wasn't enough to fully connect with audiences. To the surprise of many, it was the week's highest rated newcomer with 86% on RT. \n\nThe failure once again highlights the difficulties of Chris Hemsworth at the box office. It continues his losing streak at the box office, following 2024's ***Furiosa*** and ***Transformers One***. In fact, Hemsworth hasn't had a single box office hit outside the MCU since ***Snow White and the Huntsman*** in 2012. Seems that despite being known as Thor, audiences aren't attracted to Hemsworth's projects.\n\nAccording to Amazon MGM, 59% was male, and 43% was 45 and older. They gave it a \"B\" on CinemaScore, suggesting the film's legs are up in the air. But it won't be enough to give it the legs it needs to survive. Given the trajectory of other titles, ***Crime 101*** will probably finish with $45 million domestically.\n\nAfter topping the box office for two weeks, ***Send Help*** dropped to fourth place with $8.8 million ($10.1 million four-day). This is an insane 2% drop from last week. The film has earned $47.8 million, surpassing Sam Raimi's ***Drag Me to Hell*** ($42.1 million) in the process. The film should reach almost $70 million by the end of its run.\n\nIn fifth place, Angel Studios' ***Solo Mio*** added $6.3 million ($7.2 million four-day). This is a drop of just 9%, indicating strong word of mouth. Through 11 days, the film has amassed $17.8 million, and it's poised to finish its run with around $30 million domestically.\n\n***Zootopia 2*** had another incredible drop. It eased just 2% for a $3.8 million weekend ($5 million four-day). With $420.6 million in the bank, the film is now guaranteed to pass ***A Minecraft Movie*** ($424 million), and it could do it as early as next week.\n\nDebuting in seventh place, Briarcliff's ***Good Luck, Have Fun, Don't Die*** flopped with just $3.6 million ($4.1 million four-day) in 1,610 theaters. It marked Gore Verbinski's worst ever debut, below his latest film ***A Cure for Wellness*** ($4.3 million).\n\nTo be fair, it would've been surprising if this broke out. Briarcliff is not a big distributor, for they lack the proper amount of money to give a film a successful marketing campaign. And the film's mix of science fiction, comedy and action was gonna be a challenge to entice viewers. And given the failure of other recent titles like ***Mercy***, it seems audiences aren't enthusiastic to watch a film over the dangers of AI. Great reviews (85% on RT), but it barely moved the needle.\n\nAccording to Briarcliff, 52% of the audience was in the 18-34 demographic. They gave it a middling \"B\" on CinemaScore, and with a sea of competition, it probably won't last long in theaters. It'd be surprising if ***Good Luck, Have Fun, Don't Die*** makes it past $10 million domestically. Given its $20 million budget, it will have to rely on ancilliaries to turn a profit.\n\n***Avatar: Fire and Ash*** increased a slight 1%, adding $3.5 million ($4.1 million four-day). The film's domestic total stands at $396.2 million.\n\n***Iron Lung*** dropped 50% for $3.4 million ($4 million four-day). The film has amassed $38.1 million so far.\n\nRounding out the Top 10 was Luc Besson's ***Dracula*** with $2.9 million ($3.4 million four-day). Through 11 days, the film has earned $9.4 million, and looks to finish with around $13 million.\n\n***The Strangers: Chapter 3*** has already left the Top 10, earning just $2.2 million ($2.5 million four-day). That's a drop of just 35%, which contrasts its terrible reception, although the fact that last week was Super Bowl weekend helped it. Through 11 days, it has earned a meager $7.2 million, and will close with less than $9 million.\n\nNeon released the comedy ***Nirvanna the Band the Show the Movie*** in 365 theaters, debuting with $1.2 million ($1.4 million four-day). A solid debut, and the film will continue expanding over the following weeks.\n\nThere was another wide release, ***Cold Storage***, but it flopped with just $966,446 in 1,041 theaters. Don't expect this to last long.\n\n***Melania*** continues freefalling. This time, it collapsed another 62%, earning just $893,047 this weekend. The film has earned a poor $15.4 million so far.\n\nA24 expanded ***The Moment*** to 1,119 theaters, but it flopped with just $447,922. It collapsed a brutal 73% from last week, despite playing in double the locations. It's also an abysmal $400 per-theater average. This number is only a little above what it made two weeks ago in 4 theaters ($427,960), indicating that audiences outside Charli XCX's fanbase chose to ignore this. The film has amassed $3.4 million, and it will probably close its run with less than $4 million domestically.\n\n#**OVERSEAS**\n\nEven though ***Wuthering Heights*** did not reach its forecast domestically, it more than made up for it with its performance outside America. It opened with $51 million through Monday, leading to a $88.5 million four-day debut. The best debuts were in the UK ($10.3M), Italy ($4.4M) and Australia ($4.3M), and also had solid debuts in Mexico ($3.3M), Germany ($2.4M), Spain ($2.2M), and Brazil ($1.1M). Although it disappointed in France ($1.9M), with negative word of mouth over the adaptation's changes. The film cost $80 million (along with another $85 million in marketing), so it'll be up to the overseas markets to get this to break even.\n\n***Goat*** debuted with $15.6 million overseas, for a $50.7 million worldwide debut. It had some pretty good debuts in the UK ($4.8M), Mexico ($1.8M), Spain ($1.2M), and France ($1.1M). Given how basketball films aren't big outside America, this is a very good place to start. Note that this was just 40% of its overseas markets, so there's still room for other markets to impress. \n\n***Crime 101*** mustered just $11.9 million overseas, for a weak $27.9 million worldwide debut. The film had so-so debuts in the UK ($2M) and Australia ($1.4M), and it disappointed in Saudi Arabia ($790K), Germany ($750K), Japan ($745K), UAE ($605K), Spain ($515K), Mexico ($400K), Netherlands ($340K), Italy ($310K), Poland ($245K), Kuwait ($240K), and Brazil ($206K). Given its hefty $90 million budget, it doesn't look like the film will get anywhere close to that figure. Even if Amazon can take the losses, it's still a very disappointing performance.\n\n***Zootopia 2*** added $11.7 million overseas, taking its worldwide total to an incredible $1.833 billion. For the curious, China has reached an insane $646.3 million alone.\n\n***Avatar: Fire and Ash*** added $9.4 million overseas, taking its worldwide total to $1.462 billion.\n\n***Send Help*** appears to lose steam outside America, as it dropped 50% for $3.8 million overseas, and $73.9 million worldwide. It opened in France with a disappointing $900K. Seems like the domestic market will have to do the heavy lifting.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Primate* | Jan/9 | Paramount | $11,155,908 | $25,635,665 | $40,735,511 | $21M\n\n- Paramount's ***Primate*** has closed with a meager $25 million domestically and $40 million worldwide, failling to recoup its $21 million budget. Despite some early positive reviews, the film didn't fully connect with audiences, vanishing quickly from theaters and having mediocre legs. I guess a lot of people weren't curious to learn what was wrong with Ben, huh.\n\n#**THIS WEEKEND**\n\nThere's three wide releases, but none are really looking to be a breakout.\n\nThe only one with a small chance of overtaking #1 is Lionsgate's ***I Can Only Imagine 2***, sequel to the 2018 sleeper hit. Even though the original film was a success, 8 years is quite long for a sequel, and the decline at the box office for Christian titles will put some pressure on this.\n\n20th Century Studios is releasing the thriller ***Psycho Killer***, starring Georgina Campbell as a police officer on her mission to take down a serial killer known as \"the Satanic Slasher\" after he murdered her state trooper husband. Buzz has been very low, thanks to a very small and unimpressive marketing campaign. It'd be surprising if it made it past $5 million this weekend.\n\nA24 is also releasing the dark comedy ***How to Make a Killing***, starring Glen Powell, Margaret Qualley, Jessica Henwick, Bill Camp, Zach Woods, Topher Grace, and Ed Harris. Disowned at birth by his obscenely wealthy family, blue-collar Becket Redfellow will stop at nothing to reclaim his inheritance, no matter how many relatives stand in his way. While there's recognizable names, Powell is coming off the big failure of ***The Running Man***, and the performance of dark comedies has been hit-and-miss lately. We'll see if this fares any different.\n\n#**STREAMING DATA**\n\nHow did Netflix do last week?\n\nFigures for the week February 2-8:\n\nNo. | Movie | Year | Studio | Weeks in Top 10 | Views | Runtime | Hours Viewed\n----------|----------|:--------:|:--------:|:--------:|:--------:|:--------:|:--------:\n1 | *The Investigation of Lucy Letby* | 2026 | Netflix | 1 | 12,900,000 | 1:35 | 20,500,000\n2 | *Dhurandhar* | 2025 | Jio Studios | 2 | 8,200,000 | 3:26 | 28,100,000\n3 | *Even If This Love Disappears From the World Tonight* | 2025 | By4M Studios | 1 | 7,800,000 | 1:46 | 13,800,000\n4 | *The Rip* | 2026 | Netflix | 4 | 7,400,000 | 1:53 | 13,900,000\n5 | *KPop Demon Hunters* | 2025 | Netflix | 34 | 6,100,000 | 1:40 | 10,100,000\n6 | *In the Land of Saints and Sinners* | 2024 | Netflix | 1 | 5,000,000 | 1:46 | 8,900,000\n7 | *Sweet Home Alabama* | 2002 | Disney | 1 | 4,400,000 | 1:49 | 8,000,000\n8 | *96 Minutes* | 2025 | Netflix | 2 | 3,600,000| 2:00 | 7,200,000\n9 | *Overboard* | 2018 | Lionsgate | 1 | 3,500,000| 1:53 | 6,500,000\n10 | *Death Whisperer 3* | 2025 | M Pictures | 1 | 3,300,000 | 1:44 | 5,800,000\n\n***The Investigation of Lucy Letby*** topped the Netflix charts with 12.9 million views. But perhaps surprising was the Bollywood title ***Dhurandhar***, which was #2 with 8.2 million and reaching 15.8 million views across its first two weeks.\n\nAfter topping the charts for three weeks, ***The Rip*** dropped to #4 with 7.4 million views. With this, the film has crossed 104 million views over the course of one month.\n\nAgain, ***KPop Demon Hunters*** is still in the charts on its 34th week, still attaining over 6 million views.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 105,
        "comments": 52,
        "media": null,
        "permalink": "/r/movies/comments/1r7lzba/february_1316_box_office_recap_wuthering_heights/"
    },
    {
        "id": "1r7pdog",
        "author": "MarvelsGrantMan136",
        "title": "Jane Baer, Animator on ‘Sleeping Beauty,’ ‘The Rescuers’ and ‘Who Framed Roger Rabbit,’ Dies at 91",
        "content": "",
        "upvotes": 3239,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hqCs_AkYzfyTXTsr5F9ktdHeG4XEZdOYvhyNtEF-1Hg.jpeg?auto=webp&amp;s=54ab134df8789a27e7df4a918bf2653f642c3a17"
        },
        "permalink": "/r/movies/comments/1r7pdog/jane_baer_animator_on_sleeping_beauty_the/"
    },
    {
        "id": "1r7uwsu",
        "author": "Fan387",
        "title": "Tom Noonan Dies: ‘Manhunter’ Villain and Sundance-Winning Indie Director Was 74",
        "content": "",
        "upvotes": 906,
        "comments": 136,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/adBFj-u9oqCOpE-98HkOIwIXBhLCcHbrInA3sc4JxmI.jpeg?auto=webp&amp;s=559a4abe4bc9b3cf4d144a6e4752a9bc4323251e"
        },
        "permalink": "/r/movies/comments/1r7uwsu/tom_noonan_dies_manhunter_villain_and/"
    },
    {
        "id": "1r7lqtz",
        "author": "bwermer",
        "title": "‘Muppet Treasure Island’ at 30: Tim Curry on His Pirate Role",
        "content": "",
        "upvotes": 1723,
        "comments": 69,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/r8NO1F8uNLA2LUhchc7Z_U3HzwHuXj39CbrWWagBFL4.jpeg?auto=webp&amp;s=d2b377ac0e2971f85edb253a47901a0956d8a054"
        },
        "permalink": "/r/movies/comments/1r7lqtz/muppet_treasure_island_at_30_tim_curry_on_his/"
    },
    {
        "id": "1r7cvjm",
        "author": "ChiefLeef22",
        "title": "Disney and LucasFilm have confirmed that Martin Scorsese is indeed starring in 'The Mandalorian And Grogu' as the voice of an Ardennian shopkeep",
        "content": "",
        "upvotes": 3430,
        "comments": 208,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EL4-axFw-wbeUme-4tFk-Kt1YouQrvcBSAm-Ufvf4V4.jpeg?auto=webp&amp;s=f744c6ba4f93ab0a10a3fd59e36ccdb92c60262a"
        },
        "permalink": "/r/movies/comments/1r7cvjm/disney_and_lucasfilm_have_confirmed_that_martin/"
    },
    {
        "id": "1r76rew",
        "author": "Skullghost",
        "title": "The Mandalorian and Grogu | Official Trailer | In Theaters May 22",
        "content": "",
        "upvotes": 4069,
        "comments": 1398,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wcFwk6ESAx_EynqWzZXAh-zXsDwNkAwfYazfWsTEslQ.jpeg?auto=webp&amp;s=dc0108e2c3689b6927861491c237101d4757b4a7"
        },
        "permalink": "/r/movies/comments/1r76rew/the_mandalorian_and_grogu_official_trailer_in/"
    },
    {
        "id": "1r7m3io",
        "author": "BunyipPouch",
        "title": "Writer's Guild of America West Staff Goes On Strike",
        "content": "",
        "upvotes": 593,
        "comments": 94,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jD78gzYAPrvCqMTFhhZawqyqe5Vx6aZh_WYiyMY5xlM.jpeg?auto=webp&amp;s=79f19813744f5784b81bf737bb5d4d59ad3603d8"
        },
        "permalink": "/r/movies/comments/1r7m3io/writers_guild_of_america_west_staff_goes_on_strike/"
    },
    {
        "id": "1r7p6k0",
        "author": "BunyipPouch",
        "title": "James Cameron to Receive 2026 Writers Guild’s Lifetime Achievement Award - The 'Titanic' and 'Avatar' filmmaker, who has never been nominated for a screenplay Oscar in his storied career, is being recognized for \"outstanding contributions to the profession.\"",
        "content": "",
        "upvotes": 369,
        "comments": 63,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3q6l4Yz8-V_SXPojlwV4eFUWt4dGeFRQyNVJIUiwmlo.jpeg?auto=webp&amp;s=c9153a24a379dc89353469046b0bdc4e51fe8967"
        },
        "permalink": "/r/movies/comments/1r7p6k0/james_cameron_to_receive_2026_writers_guilds/"
    },
    {
        "id": "1r7nsb3",
        "author": "lawrencedun2002",
        "title": "‘Heated Rivalry’s Connor Storrie Latest In Talks To Join A24 Comedy ‘Peaked’",
        "content": "",
        "upvotes": 445,
        "comments": 42,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fxCZK25BRIJhuqM41NyYrd-yw5egmmV5IxDg3SaiX48.jpeg?auto=webp&amp;s=35676ecca1eabd04c27865e16173049f312db760"
        },
        "permalink": "/r/movies/comments/1r7nsb3/heated_rivalrys_connor_storrie_latest_in_talks_to/"
    },
    {
        "id": "1r7sje1",
        "author": "MythicalSplash",
        "title": "I really miss Fred Willard 😞",
        "content": "The guy was in absolutely EVERYTHING. I can’t think of another actor that prolific…one quite likely to show up in whatever movie or TV show I happen to be watching. He was a great character actor too, with a distinctive voice that added so much to his roles. His presence in sitcoms alone was ubiquitous, whether as a lead actor or one-time character.\n\nHe was especially awesome in WALL-E.",
        "upvotes": 210,
        "comments": 62,
        "media": null,
        "permalink": "/r/movies/comments/1r7sje1/i_really_miss_fred_willard/"
    },
    {
        "id": "1r7su2x",
        "author": "vought-CEO",
        "title": "The Godfather Part II (1974) | Tom Hagen Visits Frank Pentangeli | Robert Duvall, Michael V. Gazzo | Dir. Francis Ford Coppola",
        "content": "",
        "upvotes": 155,
        "comments": 13,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/rhsjxb9ng6kg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1r7su2x/the_godfather_part_ii_1974_tom_hagen_visits_frank/"
    },
    {
        "id": "1r76rnp",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'The Mandalorian and Grogu'",
        "content": "",
        "upvotes": 1514,
        "comments": 298,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/73m986ev92kg1.jpeg?auto=webp&amp;s=0a2b2efae7a6a4104b175f070a9afbc9e6929bca"
        },
        "permalink": "/r/movies/comments/1r76rnp/new_poster_for_the_mandalorian_and_grogu/"
    },
    {
        "id": "1r7hc3x",
        "author": "theatlantic",
        "title": "Robert Duvall: A Different Kind of Leading Man",
        "content": "",
        "upvotes": 461,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6BjPYWGaDe77ULQSgmSJ3Vlq_TnbFs1ZenxXp-mCY6c.jpeg?auto=webp&amp;s=1a1b7f14682e503e238890538f4b62c5b33048a6"
        },
        "permalink": "/r/movies/comments/1r7hc3x/robert_duvall_a_different_kind_of_leading_man/"
    },
    {
        "id": "1r744pw",
        "author": "JonnyBunning",
        "title": "New poster for ‘The Cure’ - Horror-thriller where an adopted girl with billionaire biotech parents are harvesting her blood for sinister reasons.",
        "content": "",
        "upvotes": 1933,
        "comments": 151,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/q9yktnrgo1kg1.jpeg?auto=webp&amp;s=3c6d302b172fc2b98fec14374c2dde08e92af4f8"
        },
        "permalink": "/r/movies/comments/1r744pw/new_poster_for_the_cure_horrorthriller_where_an/"
    },
    {
        "id": "1r7n54l",
        "author": "RealJohnGillman",
        "title": "‘Exit 8’ — Official Trailer #2",
        "content": "",
        "upvotes": 204,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0UoiS7kIwZwdadCoPkISubKa8TRGvpu5S69LwqAV6rE.jpeg?auto=webp&amp;s=819d0e289d248fb6e31c653a77c2afe940dab4b1"
        },
        "permalink": "/r/movies/comments/1r7n54l/exit_8_official_trailer_2/"
    },
    {
        "id": "1r7fwzl",
        "author": "oldwhitelincoln",
        "title": "What is a film you enjoyed but have to be tactful about who you recommend it to?",
        "content": "Maybe because of content, maybe because of subject matter, maybe because of the style of humor, maybe for fear of being unnecessarily judged.\n\nIt doesn’t necessarily have to be anything disturbing or upsetting, but it could be.\n\nI might get roasted for this but, I watched the movie Butt Boy last year and thought it was absolutely hysterical. But, if you’ve seen it, you’ll understand it’s not something you can recommend to just anyone. Even the title alone would likely turn some people off.\n\nI chose wisely and recommended it to two people who I thought might appreciate it and got 10/10 responses from both.\n\nWhat are some other films that you enjoyed but feel like you can’t recommend to everyone?",
        "upvotes": 485,
        "comments": 1042,
        "media": null,
        "permalink": "/r/movies/comments/1r7fwzl/what_is_a_film_you_enjoyed_but_have_to_be_tactful/"
    },
    {
        "id": "1r7bfbv",
        "author": "MarvelsGrantMan136",
        "title": "Walton Goggins &amp; Chloë Grace Moretz To Star In Action-Comedy ‘Mister’ - Follows a man (Goggins) who wakes up in a strange house covered in blood and comes to realize his true identity while fighting off contract killers from his past, including everyone from his exes to his best friend.",
        "content": "",
        "upvotes": 730,
        "comments": 92,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jaIMdT7cdTTCLABtoCKQV5RUYottxOBEhvRiKFhQ_18.jpeg?auto=webp&amp;s=285686d63e6a87a17f442bd1876a2080c95ea41d"
        },
        "permalink": "/r/movies/comments/1r7bfbv/walton_goggins_chloë_grace_moretz_to_star_in/"
    },
    {
        "id": "1r7j85s",
        "author": "Formidable-Facts",
        "title": "Create the most unnecessary, ridiculous sequel to a standalone movie.",
        "content": "For example: Ghost 2 - Ghost 2 follows the adventures of  Sam Wheat as he navigates life after death. As he struggles to find his place in heaven, he is pleased to find out his friend Oda Mae Brown has arrived at the pearly gates. His happiness quickly turns to terror when Oda Mae explains that she was murdered - Willie Lopez and Carl Bruner have escaped from hell, and now they’re after Molly. ",
        "upvotes": 248,
        "comments": 499,
        "media": null,
        "permalink": "/r/movies/comments/1r7j85s/create_the_most_unnecessary_ridiculous_sequel_to/"
    },
    {
        "id": "1r7o1nl",
        "author": "Edm_vanhalen1981",
        "title": "The Who's Tommy Getting IMAX Re-Release for 50th Anniversary",
        "content": "",
        "upvotes": 137,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/d3WHC8Jut0qCIkwgaAO7SsAk2608VcRnaQlVogvSbHY.jpeg?auto=webp&amp;s=1dc459c6a23f059205b54a0b24df00c7de8d5e95"
        },
        "permalink": "/r/movies/comments/1r7o1nl/the_whos_tommy_getting_imax_rerelease_for_50th/"
    },
    {
        "id": "1r6viof",
        "author": "G_Marius_the_jabroni",
        "title": "Walton Goggins didn't even know at the start of filming \"The Hateful 8\" (2015) whether or not his character (Chris Mannix) really was the sheriff of Red Rock or not, and was given free reign by director QT on how to portray the character and the mystery of his being the sheriff or not.",
        "content": "[Chris Mannix](https://preview.redd.it/the-relationship-arc-between-major-marquis-warren-and-chris-v0-11v3uxkciw4g1.jpeg?auto=webp&amp;s=593d8169b26f278470c15428d26caf0446a81422) is one of my all-time favorite written characters (and one of QT's best written, no doubt). I dont think anyone, except Walton Goggins, could have pulled off bringing the character to life so unbelievably well from a bunch of words on paper. The guy just has so much range. He managed to be super raciest, extremely tolerant, dumber than a bag of rocks, smart as shit, really mysterious, [funny as hell](https://youtu.be/b2_OqofTZns), [even funnier (\"What's in the chair???\")](https://youtu.be/krxjTwujmFk?t=172), and above all else, [loyal to the very end](https://youtu.be/cwX5syZfWyU). \n\nI just recently read that at the start of filming, Goggins \"only had one question for Quentin: 'Is Mannix really the sheriff of Red Rock? Is that a bluff?' And QT's reply was: 'I need you to figure out the answer and never tell me what it is.' That was all I needed to know. And he never asked. He may be the only person to date who hasn't asked me that.\" Goggins said. [Here is the article.](https://www.slashfilm.com/1190522/quentin-tarantino-left-the-answer-to-a-hateful-eight-mystery-up-to-walton-goggins/) He 100% should have been nominated for best supporting actor (and won something) for his portrayal of Sheriff (????) Chris Mannix. 10/10, in my opinion, with one of the best ever character arcs as well.",
        "upvotes": 5665,
        "comments": 363,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Kn8v8Lp3DOIvjdZg1gHuPAEGruFi10qFziyWfRDkvB8.jpeg?auto=webp&amp;s=21f5dc8bd24c4521924eb49bd8a10abdc299ec4e"
        },
        "permalink": "/r/movies/comments/1r6viof/walton_goggins_didnt_even_know_at_the_start_of/"
    },
    {
        "id": "1r79pee",
        "author": "Successful-South-598",
        "title": "( Inglorious Basterds ) Does Landa use milk as an intimidation factor or he just love dairy product ?",
        "content": "I know both of them can be true at the same time but I was just wondering . He asked for milk twice in the farmhouse and order one for Shoshanna when they meet again in the hotel \n\nThey look like interrogation tactic , a power move to show domination but Landa never know Shoshanna face so it left me thinking if this guy is just a big fan of milk or not ",
        "upvotes": 431,
        "comments": 292,
        "media": null,
        "permalink": "/r/movies/comments/1r79pee/inglorious_basterds_does_landa_use_milk_as_an/"
    },
    {
        "id": "1r7czxc",
        "author": "joesen_one",
        "title": "Black Bear acquires fantasy romance film 'Wicker' from Sundance starring Olivia Colman, Alexander Skarsgård, Peter Dinklage &amp; Elizabeth Debicki - An ostracized fisherwoman commissions a husband made from wicker from the local basketmaker",
        "content": "",
        "upvotes": 285,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/48tyVl-CZWOuQL71gG-1MDhWDit_wV5WsdnwOtwxaM4.jpeg?auto=webp&amp;s=70ada88fa29655d97c816e1e14187c374747ac3e"
        },
        "permalink": "/r/movies/comments/1r7czxc/black_bear_acquires_fantasy_romance_film_wicker/"
    },
    {
        "id": "1r6sjxl",
        "author": "MEMEY_IFUNNY",
        "title": "Official Poster for The Whitest Kids U’ Know’s animated comedy film “MARS”",
        "content": "",
        "upvotes": 4071,
        "comments": 210,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3van4xgkkyjg1.jpeg?auto=webp&amp;s=938fc432f63875486da96fae572d49bd0ff8c9de"
        },
        "permalink": "/r/movies/comments/1r6sjxl/official_poster_for_the_whitest_kids_u_knows/"
    },
    {
        "id": "1r6gu1s",
        "author": "MarvelsGrantMan136",
        "title": "Robert Duvall, Oscar-Winning Acting Legend, Dies at 95",
        "content": "",
        "upvotes": 33203,
        "comments": 1533,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NB8Zakc4o6d-aOceJAvUe85E80Ry397-fzJgHs4K6LE.jpeg?auto=webp&amp;s=a84e3cd405efc563b7552868f45ba01c7f3bd974"
        },
        "permalink": "/r/movies/comments/1r6gu1s/robert_duvall_oscarwinning_acting_legend_dies_at/"
    },
    {
        "id": "1r74704",
        "author": "ICumCoffee",
        "title": "Warner Bros. Discovery Agrees to Engage With Paramount in Sales Talks, but for Now Still Backs Netflix Deal as It Sets March 20 Shareholder Vote",
        "content": "",
        "upvotes": 473,
        "comments": 92,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MWx54Odd1ClNMUT-CgzQQEU4B4Ua4JCPWd30bk_i20I.jpeg?auto=webp&amp;s=9078fab290a9eb9e67d498fabea5748156e589fe"
        },
        "permalink": "/r/movies/comments/1r74704/warner_bros_discovery_agrees_to_engage_with/"
    },
    {
        "id": "1r7copy",
        "author": "Vicinus",
        "title": "What scene in a movie that wasn't meant to be funny did you have to laugh at?",
        "content": "Some scenes in a movie, that are meant to be funny, fall flat and just aren't.\n\nBut there are also ones the other way around - you just had to laugh at despite them being serious, scenes that are inadvertently funny, that make you laugh.\n\nA good example would be Darth Vaders \"NOOOOOOOO!\", and there certainly some movies out there you could easily suggest as a whole.\n\nWhat would be your examples?",
        "upvotes": 125,
        "comments": 444,
        "media": null,
        "permalink": "/r/movies/comments/1r7copy/what_scene_in_a_movie_that_wasnt_meant_to_be/"
    },
    {
        "id": "1r7djw2",
        "author": "Bullingdon1973",
        "title": "‘The most dynamic actor of his generation’: David Fear’s tribute to the late Robert Duvall",
        "content": "",
        "upvotes": 102,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QdhHaTBJwvjWo1bN3xAg9ECA8Gpsxx-zN6XhHBDa30I.jpeg?auto=webp&amp;s=5c0c105327ce0a1c1e72ea48bf1f11d1980986a6"
        },
        "permalink": "/r/movies/comments/1r7djw2/the_most_dynamic_actor_of_his_generation_david/"
    },
    {
        "id": "1r7kuhz",
        "author": "Superman_Primeeee",
        "title": "A 70s film not given enough credit: Orca",
        "content": "What a \\*\\*\\*\\*ing cast.\n\nRichard Harris\n\nCharlotte Rampling\n\nWill Sampson\n\nKeenan Wynn\n\nand the soundtrack. Yes the fantastic, haunting Ennio Morricone soundtrack may as well be a character in and of itself.\n\nEven if you consider the film just “The best of the Jaws ripoffs” (it’s more) It’s worth seeing. And of course a great typical 70s film ending",
        "upvotes": 33,
        "comments": 43,
        "media": null,
        "permalink": "/r/movies/comments/1r7kuhz/a_70s_film_not_given_enough_credit_orca/"
    },
    {
        "id": "1r6xk13",
        "author": "BunyipPouch",
        "title": "‘Sinners’ Dominates Black Reel Awards With Record 14 Wins",
        "content": "",
        "upvotes": 787,
        "comments": 209,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/82wMdwW7jZm_GcFu_OQfD-w2ElhvcRJ8IdDnp8yI1uk.jpeg?auto=webp&amp;s=f1c2ea66dd494e49e6b62fd3f61b1f0521ef11b1"
        },
        "permalink": "/r/movies/comments/1r6xk13/sinners_dominates_black_reel_awards_with_record/"
    }
]