[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 12,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1osagjd",
        "author": "crazyirish71",
        "title": "End credits of House of Dynamite reveal what happened",
        "content": "Spoilers ahead…\n\nWe watched HoD and were loving the suspense but really disappointed by the ending.\n\nWe have the subtitles on all the time and if have English CC subtitles turned on around 1:14:00 when the “Music By” credits appear you hear an explosion in the distance and the subtitles say “explosion” so we took it as Chicago was hit.\n\nAnyone else hear this in the credits?",
        "upvotes": 15,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1osagjd/end_credits_of_house_of_dynamite_reveal_what/"
    },
    {
        "id": "1orin66",
        "author": "Budget_Lavishness707",
        "title": "Guillermo Del Toro Frankenstein",
        "content": "I just finished watching Del Toro’s Frankenstein adaptation. The monster is one of my most beloved OG horror characters, so I consume ALL the things related to said subject. So I was looking forward to this movie release for quite some time. And I have thoughts…\n  My husband fell asleep after an hour due to the slow pace of the story 😂, &amp; now I have no one to currently talk me through thoughts &amp; opinions I have.\n   Has anyone else watched this?",
        "upvotes": 314,
        "comments": 163,
        "media": null,
        "permalink": "/r/netflix/comments/1orin66/guillermo_del_toro_frankenstein/"
    },
    {
        "id": "1ose2y2",
        "author": "Curious_Natural_1111",
        "title": "Guillermo del toro Frankenstein is an aesthetic sight",
        "content": "One of the most cinematic movie I have watched this year. Right from the beginning, the way flame was captured in the frozen night was breathtaking. Loved he costumes, the lightening, the set, just brilliant. Oscar Isaac really pulled off the role of mad scientist. \n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ose2y2/guillermo_del_toro_frankenstein_is_an_aesthetic/"
    },
    {
        "id": "1osdz3j",
        "author": "Ban_Cheater_YO",
        "title": "Netflix's The Perfect Neighbor : How low can you go - United States - FLORIDA EDITION.",
        "content": "I understand that half of the country is full of smooth brained mouth breathing MORONs, but this one right here keeps outdoing any and all expectations of the basest bases someone's humanity can drown to.  \n[Susan Lorincz (Perfect Neighbor) is SUING AJ Owen's kids](https://youtu.be/w7GcEFFgSqs?si=pceNvIg3tmuVDPwe)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1osdz3j/netflixs_the_perfect_neighbor_how_low_can_you_go/"
    },
    {
        "id": "1osds3g",
        "author": "thequirkysquad",
        "title": "Netflix is too quiet",
        "content": "I watch Netflix on my web browser on my Mac. I turn up the volume to as high as it goes. It's still very quiet, especially the voices.\n\nI've read about how you can switch from English 5.1 to something else, and that this makes it louder, but I don't see English 5.1, just English \\[Original\\].\n\nI am at a loss as to what to do. Any help would be appreciated. I'd hate to cancel on account of something so seemingly fixable.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1osds3g/netflix_is_too_quiet/"
    },
    {
        "id": "1osdqk1",
        "author": "Pudix20",
        "title": "What are some newer shows based on the creation/backstory of older shows/movies/events (Like GLOW or A League of Their Own)",
        "content": "I’m not necessarily looking for shows *like* GLOW or ALOTO. I’m looking for shows that give some kind of backstory to how the original was formed, or for expansions.  \n\nYes I know ALOTO is based (loosely) on the All American Girls Professional Baseball League formation\n\nAnd GLOW is based on… well… GLOW: Gorgeous Ladies of Wrestling. \n\nI know there are a ton of other examples I really just can’t think of them right now. \n\nI know Tick Tick Boom also goes into this category but I’ve never seen it so I can’t really comment on it. \n\nAnyway, anything like that?  ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1osdqk1/what_are_some_newer_shows_based_on_the/"
    },
    {
        "id": "1osdjfn",
        "author": "jaylight555",
        "title": "How many devices can be logged in on with standard no ads?",
        "content": "This might be a silly question, but I am just wondering. I am a young adult and I was using my mom‘s Netflix account but recently she decided to cancel it so I made my own account but I don’t have the more expensive plan like she did. I just got the one with no ads. I know it says I can only stream on two devices at a time, but how many devices can I be logged in on? Is there a limit and if I log into more than a certain amount would my payment plan go up? Just curious how this works. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1osdjfn/how_many_devices_can_be_logged_in_on_with/"
    },
    {
        "id": "1ortt2g",
        "author": "bottlecoco",
        "title": "Looking for dark, dank, adult comedy movies &amp; shows",
        "content": "Hey guys,\nI’m in the mood for some good dark, twisted, adult humor — something that’s not your typical mainstream comedy. I love stuff that’s a bit edgy, sarcastic, or morally questionable but still hilarious.\nCan you recommend some movies or TV shows in that vibe?",
        "upvotes": 13,
        "comments": 91,
        "media": null,
        "permalink": "/r/netflix/comments/1ortt2g/looking_for_dark_dank_adult_comedy_movies_shows/"
    },
    {
        "id": "1oscao0",
        "author": "shoob420",
        "title": "Start Up, Fall Down From Billionaire to Convict",
        "content": "marked as spoiler because I've never heard of this case before and I've tried searching about him on Reddit and can't find much at all tbh - if you don't want to see details of the case/doc I would not read this post\n\nhas anyone watched this yet and what did you think? need to rant so bare with 😅\n\nFirstly, the speakers - I could not believe half of what I was hearing, the general air of victim blaming and downplaying and misogyny is absolutely insane - even from the women speakers to some extent - \"we convince ourselves that bad things only happen to bad girls\"?! no babe, **we** don't.\n\nThe guy who basically spent 80% of his time glorifying cocaine ??\nThe general idea that it was cocaine's fault and not Alberto's?? The whole \"boohoo he was bullied at school\" part? literally wtf was that about please \nThe part in ep 3 where it's fake Alberto basically crying in a room and his sob story is playing in the background😭 \n\nSecondly, his sentence?!! like are we actually so for real?? less than 8 years for the brutal assault and rape of the **4** girls they considered genuine, CP?!?, the what I can only assume was terabytes of footage from his parties, the texts?? I fully cannot comprehend how this man only got this tiny little sentence \n\nAnd finally on the documentary in general, I really don't think the camera footage (that may or may not have been real because there were a lot of disclaimers) added anything to the documentary at all tbh\n\nThe entire doc was a TRIP I can tell you that for sure and this case and the lack of justice the victims received and continue to *not* receive is absolutely abhorrent, nevermind the unknown number of girls he's done this to that weren't included in the case. This man should literally never be allowed in public again 😭",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oscao0/start_up_fall_down_from_billionaire_to_convict/"
    },
    {
        "id": "1oryu13",
        "author": "MovieReview_hub",
        "title": "Review of Baramulla Movie on Netflix",
        "content": "Where Kashmir’s Snow Hides Secrets and Shadows⭐⭐⭐ (3/5)\n\nSet against the haunting snowfields of Kashmir, Baramulla mixes mystery and horror as a cop investigates child disappearances while his family faces eerie happenings at home.\n\nPositives:\nHaunting visuals, strong performances by Manav Kaul &amp; Bhasha Sumbli, and a chilling atmosphere that captures the valley’s silence beautifully.\n\nNegatives:\nThe midsection drags, horror payoff feels weak, and emotional depth is missing. The story connects late, dulling the overall impact\n\nFinal Word:\nVisually gripping but uneven — a film that impresses more in mood than in emotion.\n\n",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oryu13/review_of_baramulla_movie_on_netflix/"
    },
    {
        "id": "1osa5al",
        "author": "katiebabie333",
        "title": "Show Recommendations Like ‘The Hunting Wives’",
        "content": "I just finished The Hunting Wives and now I’m on a country binge. I watched Echoes and I really liked that! The country vibe is what I’m searching for!! Does anyone have a country movie or show that is:\n\nSensual. \nMurder. \nMystery. \nRomance. \n\nAt least one of these. Or none. Whatever. Something country?!\n\nPlease help before I go through country withdrawal 😫 Any rec is appreciated!\n",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1osa5al/show_recommendations_like_the_hunting_wives/"
    },
    {
        "id": "1or4cc0",
        "author": "Repulsive_Knee9258",
        "title": "Frankenstein was beautiful",
        "content": "I won’t spoil anything but it was a truly beautiful movie, I love how they showed both perspectives of the story telling Victor’s and Frankenstein’s. The visuals in this movie were just amazing, you can tell Netflix spent a lot on this movie. I think this movie might be the best film I’ve seen come out on Netflix this year. Guillermo del Toro once again has proven he’s the best director for the dark fantasy genre of our generation. Highly recommend this film. Loved the acting of Oscar Isaac, Christoph Waltz and Jacob Elordi. excellent casting as well. I can see this even getting some Oscar nominations. 5/5 for me. ",
        "upvotes": 327,
        "comments": 71,
        "media": null,
        "permalink": "/r/netflix/comments/1or4cc0/frankenstein_was_beautiful/"
    },
    {
        "id": "1os7uko",
        "author": "RiseDelicious3556",
        "title": "Can Someone Tell me If  'Between Lands' is Worth Watching???",
        "content": "Yet another foreign language on netflix. It seems pretty slow so far and boring. Can someone please tell me if I am wasting my time?? And btw, if you happen to know of any good series on netflix, please let me know.I just loved Black Rabbit. Thanks in advance.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1os7uko/can_someone_tell_me_if_between_lands_is_worth/"
    },
    {
        "id": "1oqxuou",
        "author": "Jet_Jirohai",
        "title": "Why does it seem like Netflix is the only streaming service that knows how to make a functional user experience?",
        "content": "My main 3 streaming services are HBO, Hulu and Netflix(and YouTube premium, but that's a whole different beast), but I've used others before. I'm not talking about the content on these services or how any company manages their original content, etc. This is specifically about the UI and user experience\n\nWhen I boot up Netflix, it's always snappy, it's always easy to find what shows I've been watching and continue, the app lets me go to a series page BEFORE loading an episode, it's the best about knowing I want to restart a movie/show when the progress bar is near the end, the \"are you still watching?\" prompt is actually consistent. Nearly all of this stuff is either worse or non-existent on the other streaming services I use. Hulu makes me jump through hoops to get to a series page. HBO Max will throw up huge show banner ads I have to scroll through before I can start looking at my library\n\nMaybe there's other streaming services that compete with Netflix more in this regard, but it's something that's really been bothering me lately. If I'm bored and don't know what to watch, I'll boot up Netflix 95% of the time because browsing it feels good compared to my other options.\n\nDoes anyone else here share this opinion? I've tried googling it, but all the Reddit posts are complaining about what shows are available or just complaining about streaming in general",
        "upvotes": 570,
        "comments": 282,
        "media": null,
        "permalink": "/r/netflix/comments/1oqxuou/why_does_it_seem_like_netflix_is_the_only/"
    },
    {
        "id": "1orjaen",
        "author": "yippeee1999",
        "title": "GLOW (Gorgeous Ladies of Wrestling)",
        "content": "So I'm now watching GLOW and am well into Season Two.  Just before creating this particular post, I searched to see if there was already a GLOW discussion, and I saw some from discussions from...over 7 years ago??  Is it possible the series is that old?  And if so, maybe it means that Netflix periodically re-releases or puts certain shows (like GLOW) back in the queue for re-watching?  I say this because...I'd never heard of this show until recently, and likely it's because when I signed into Netflix one day...a few months ago...that GLOW appeared at the top of my feed, and so I naturally assumed it was new.\n\nAnyway, for those not familiar, while a show about female wrestling sounds tacky, they've really done a great job with the show...the cast (particularly the female leads, as well as Marc Maron - who is fantastic in his role) is great.  The show is clever...well-executed.\n\nFor those who've already seen the show, I'm curious if, like me, you had assumed that Season 2, Episode 7 was going to be the series finale?  (That was the episode that included a...er...broken ankle - I don't want to give too much away ...any spoilers.... )  Considering that episode, and the way that episode closed out, I actually think it would have been a perfect way to end the series.  So imagine my surprise when I saw 'Next Episode' loading up on my screen.\n\nEither way, if you've not yet watched GLOW, I highly recommend it.\n\nAlso....Hot Spot (with Japanese subtitles) and Pernille (Norwegian subtitles).",
        "upvotes": 24,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1orjaen/glow_gorgeous_ladies_of_wrestling/"
    },
    {
        "id": "1ordwpl",
        "author": "Hopeful74",
        "title": "Greiving KAOS",
        "content": "I know I am late in the game, but this was such an intelligent, soulful piece of entertainment.  Not a weak acting performance, amazing retelling of Greek Mythology.  I am so disappointed this show was cancelled, only found out just now upon finishing the series.  It is probably too late now to collect all of the amazing talent that made this happen, but I wish so much they would, or a different production company would.  Do you all think that is at all possible at this point?  One year out?  So often it takes series to become successful after 1 - 2 years into it… such an incredible shame to not have faith in this series, we need it now more than ever.\n\nI guess I just wish I understood the industry more than I do.  In my ignorant mind, I would think an old school, heavy clout, heavily connected actor like Jeff Goldblum, or any of the other high tier actors on the show, could call up Amblin Entertainment and the like and get it produced somewhere else if Netflix insisted on canceling it.  But again, I am ignorant to the entertainment industry and the way it works.",
        "upvotes": 53,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ordwpl/greiving_kaos/"
    },
    {
        "id": "1os4ieq",
        "author": "jackfuego226",
        "title": "Floor is Lava- Is there some sort of rule that only one player can move at a time?",
        "content": "Watched several episodes of the show, and in so many episodes, despite everyone knowing there's a time limit, they all just stand and watch their teammates make their own moves  before finally moving for themselves, even in episodes where there is little puzzle element that requires cooperation, they still just stand and watch instead of moving for themselves. Is there some kind of rule they don't mention that only one of them is allowed to move at a time?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1os4ieq/floor_is_lava_is_there_some_sort_of_rule_that/"
    },
    {
        "id": "1oqw0hh",
        "author": "Fun_Molasses5215",
        "title": "Chrishell Stause officially announces she's quitting Selling Sunset after nine seasons on the show",
        "content": "",
        "upvotes": 274,
        "comments": 91,
        "media": null,
        "permalink": "/r/netflix/comments/1oqw0hh/chrishell_stause_officially_announces_shes/"
    },
    {
        "id": "1orlrc9",
        "author": "AtomixMaster25",
        "title": "I need some series recommendation",
        "content": "I am bored and want some recommendations,I don't like very like heavy series I enjoyed watching young Sheldon,bbt,Kim's Convenience,suits etc. \n\nI also like basketball series \n\nJust told all this so that u guys can help🙏\n\nAlso I live in India so some shows might not be available.\n\nThanks ",
        "upvotes": 5,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1orlrc9/i_need_some_series_recommendation/"
    },
    {
        "id": "1orngg6",
        "author": "mugiwara_no_Soissie",
        "title": "Anyone else tired of shows not having the right language.",
        "content": "Like im dutch, and about 90% of the anime they have on Netflix has languages as german and Japanese, and subtitles as only german, which would be nice if we spoke german here... instead we speak Dutch lol.\n\nAnd im not talking about obscure stuff, im talking about shit like demon slayer, which is one of the most popular anime of the last decade.\n\nIt actually happens so often that we dont even have English subs, in a country which is known for having a very large bilingual population...",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1orngg6/anyone_else_tired_of_shows_not_having_the_right/"
    },
    {
        "id": "1os40yr",
        "author": "SedativePraise",
        "title": "AI generated B roll in shows on Netflix?",
        "content": "This is the first time I've noticed. In A Different World season 2 Ep. 22 there is an entirely ai generated transition sequence about a fourth of the way through the episode. I'm not sure if its anywhere else throughout the episodes and seasons, but this instance was so obvious and really quite bad. It almost made me want to just stop watching the show altogether though its one of my favorites. I understand AI is kind of a new wave and of course big companies want to jump on the bandwagon but it's really disappointing to see it so lazily and terribly implemented especially when it was completely unnecessary. It also makes me worry a bit for what to expect from the upcoming A Different World spinoff.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1os40yr/ai_generated_b_roll_in_shows_on_netflix/"
    },
    {
        "id": "1os3xgi",
        "author": "dbob624",
        "title": "Is it possible to work at Netflix without a technology background?",
        "content": "I am a Chief Nursing Officer with multiple years of hospital leadership experience, managing people, large departments/staff, multi million dollar budgets, process improvement, quality and safety initiatives, customer service, etc. Netflix seems to be open to outside the box leaders, but how about those not in the same industry? \nAfter reading No Rules Rules by Hastings and Meyer, just seems like a well aligned match with my leadership vision in hospitals. \nThought I’d see what Redditors with awareness would say to see if there’s actually a chance? ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1os3xgi/is_it_possible_to_work_at_netflix_without_a/"
    },
    {
        "id": "1orfxz5",
        "author": "EverySingleMinute",
        "title": "Can Netflix and every other streaming service, stop playing a preview of a show when my cursor is on the thumbnail for more than a second?",
        "content": "It is so irritating when I am trying to read about the show and suddenly it starts playing the preview.  If I want to watch a preview, I will click on it to play the preview.  \n\n",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1orfxz5/can_netflix_and_every_other_streaming_service/"
    },
    {
        "id": "1orgvn8",
        "author": "crooked_smile_49",
        "title": "Anyone Notice this?",
        "content": "I noticed how Ginny and Georgia already started filming after taking 1-1.2 year(s) to release other seasons, and Wednesday will start filming first quarter of next year after taking 3 years to release season 2. \n\nSo was Stranger Things slowing everything down? Which could be the reason they started leaning more into reality tv? (waste of money, leave it to peacock) \n\nHopefully this means they’ll stop turning in all these pasta noodle craft assignments labeling them series and actually produce SHOWS. #grandarmy #KAOS \n",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1orgvn8/anyone_notice_this/"
    },
    {
        "id": "1os1nak",
        "author": "The-Desk-Of-Forty-7",
        "title": "Why do the VIPs in Squidgame enjoy watching people die?",
        "content": "This is coming from someone who doesn't watch the show. \n\nI'm curious as to why the people in The masks enjoy watching these games that kill people. \n\nLike, would there be that many things that they tried before settling on this? Do they not feel guilt or shame?\n\nI'm not really thinking about the metaphorical or symbolic meaning of this. I'm trying to find an answer relating to it from an emotional character standpoint.",
        "upvotes": 0,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1os1nak/why_do_the_vips_in_squidgame_enjoy_watching/"
    },
    {
        "id": "1ormk9w",
        "author": "Iazysude",
        "title": "what will be the top global show of this week?",
        "content": "so im into prediction market and i wanna bet on which show is going to be top global show of this week and polymarket where i bet is showing 84% chance of witcher s4 but i dont think, So can we have discussion?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ormk9w/what_will_be_the_top_global_show_of_this_week/"
    },
    {
        "id": "1or3vqq",
        "author": "[deleted]",
        "title": "'KPop Demon Hunters' Get 3 Grammy Nominations for 'Golden'",
        "content": "",
        "upvotes": 15,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1or3vqq/kpop_demon_hunters_get_3_grammy_nominations_for/"
    },
    {
        "id": "1ork4b4",
        "author": "Arbegia",
        "title": "how do I permanently hide the Netflix interface when watching Fullscreen? (PC)",
        "content": "**FOUND THE SOLUTION**. **1). Download the Chrome addon Stylus. 2). add the script below to Stylus, then hit save. 3). Restart your browser**\n\n^(/\\* Netflix \\*/)\n\n^(:fullscreen .watch-video--back-container,)\n\n^(:fullscreen .watch-video--flag-container {)\n\n^(display: none !important;)\n\n^(})\n\n^(:fullscreen .watch-video--bottom-controls-container:hover {)\n\n^(cursor: auto !important;)\n\n^(})\n\n^(:fullscreen .watch-video--bottom-controls-container:not(:hover) {)\n\n^(opacity: 0 !important;)\n\n^(})",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ork4b4/how_do_i_permanently_hide_the_netflix_interface/"
    }
]