[
    {
        "id": "1igml0a",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 19,
        "comments": 625,
        "media": null,
        "permalink": "/r/realmadrid/comments/1igml0a/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1ifhmji",
        "author": "scoreboard-app",
        "title": "[Post Match Thread] Espanyol - Real Madrid",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1ifhmji)",
        "upvotes": 53,
        "comments": 805,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ifhmji/post_match_thread_espanyol_real_madrid/"
    },
    {
        "id": "1ihbo26",
        "author": "Total_Escape_9778",
        "title": "Even Carlo was telling Ceballos to pass the ball to Vini while he was free, but both him and Fran were loading it to the right flank instead...",
        "content": "",
        "upvotes": 733,
        "comments": 143,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/snnsffodi2he1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ihbo26/even_carlo_was_telling_ceballos_to_pass_the_ball/"
    },
    {
        "id": "1ihhjrg",
        "author": "SubjectTumbleweed216",
        "title": "[marca] Alaba was set to start tomorrow alongside Asencio to test the duo before the Atletico and City games. However, with his injury, Madrid are forced to start Asencio and Tchouameni, with no other choice possible",
        "content": "",
        "upvotes": 193,
        "comments": 74,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MXNK2QAJ0pmp4674MuS1S6QPoKAfzqvLgcbR93cHnNk.jpg?auto=webp&amp;s=483c985e2cb59122b7e4832eca991aac4e32092e"
        },
        "permalink": "/r/realmadrid/comments/1ihhjrg/marca_alaba_was_set_to_start_tomorrow_alongside/"
    },
    {
        "id": "1ihih25",
        "author": "10Core56",
        "title": "Siiuuuuu with Nvidia",
        "content": "Some stuff you can make with the new AI. We need some robot defenders.\n",
        "upvotes": 157,
        "comments": 9,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vkkkbjiwq4he1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ihih25/siiuuuuu_with_nvidia/"
    },
    {
        "id": "1iheg3y",
        "author": "fauxselection42",
        "title": "David Alaba diagnosed with an injury to the adductor in his left leg",
        "content": "",
        "upvotes": 309,
        "comments": 173,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aloQaUuYbKpsUR7YBuBxNRmtXeXz4ScGOzxFnEQNbVQ.jpg?auto=webp&amp;s=66cdf9425482679cd64997bb7d2566cbfcea7e93"
        },
        "permalink": "/r/realmadrid/comments/1iheg3y/david_alaba_diagnosed_with_an_injury_to_the/"
    },
    {
        "id": "1iheqkg",
        "author": "TheBiasedSportsLover",
        "title": "Cristiano Ronaldo: \"I'm the most complete footballer ever. I head well, I take set pieces well, I shoot well with my left foot, I'm fast &amp; strong, I jump. I respect if someone would prefer Messi, Pele or Maradona, But to say that CR7 isn't complete is a lie. I don't see anyone better than me\"",
        "content": "",
        "upvotes": 269,
        "comments": 77,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zNpeVUMp0mlrdyTppZ3K8sxZwCB9MjIOcET_3q6eVO8.jpg?auto=webp&amp;s=e56e07bdaaf8ee95734b2ed0d54349a2ef70feed"
        },
        "permalink": "/r/realmadrid/comments/1iheqkg/cristiano_ronaldo_im_the_most_complete_footballer/"
    },
    {
        "id": "1ihbp9t",
        "author": "Damned_chicken",
        "title": "He couldve played more",
        "content": "",
        "upvotes": 263,
        "comments": 43,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/xunvo5cui2he1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ihbp9t/he_couldve_played_more/"
    },
    {
        "id": "1ihcrqc",
        "author": "ImaginaryPoet_300",
        "title": "The season might be going down. But me knowing we are Real Freaking Madrid and can never be ruled out when it push comes to shove 🐼",
        "content": "Lots of negativity in this sub right now. People pointing fingers left, right and centre. Most of the criticism is deserved : The President, the Board, the Manager and the Players. (The Refs!)\n\nBut as fans let’s take a deep breath and just calm down. Look at the bigger picture. We just won the UCL last season. Our Team is young and FULL of world class potential and except a few positions we are set for a solid Decade!\n\nThis season has been terrible by Real standards but still we’re 1st in the league and are alive in the CDR and somehow surviving in the UCL. \n\nJust reminding when Real has its back against the wall, they find a way to dig themselves out of the hole. \n\nAs a fan, I might be sad, angry or elated depending on the situation of each match day. But I know full well that I can relax 😌 knowing that we, Real Madrid will give it our everything and even if we go down, it won’t be without putting up a fight. \n\nHalamadrid 💟",
        "upvotes": 186,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/p7m3fatww2he1.jpeg?auto=webp&amp;s=746fe6e578bab3571ab6a9b3b76f50720d846fb7"
        },
        "permalink": "/r/realmadrid/comments/1ihcrqc/the_season_might_be_going_down_but_me_knowing_we/"
    },
    {
        "id": "1ihbuf0",
        "author": "InformationPast1030",
        "title": "Good old days - 2015",
        "content": "U",
        "upvotes": 164,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9a90pi5mk2he1.jpeg?auto=webp&amp;s=82a92636d40ded4746bfbd98a89ebbadde959da9"
        },
        "permalink": "/r/realmadrid/comments/1ihbuf0/good_old_days_2015/"
    },
    {
        "id": "1igyng1",
        "author": "Masterguru147",
        "title": "12 years ago Ronaldo scored every team in La Liga even his own",
        "content": "He scored against 20 teams in La LiGa, even Messi couldn’t do it\nGOAT 🐐 for the reason 😂😂",
        "upvotes": 1127,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/fmudae2jezge1.jpeg?auto=webp&amp;s=db9df171202b86f9f58e62f75eb7a3f69fb70d0f"
        },
        "permalink": "/r/realmadrid/comments/1igyng1/12_years_ago_ronaldo_scored_every_team_in_la_liga/"
    },
    {
        "id": "1iheu0y",
        "author": "Sneijder4BallondOr",
        "title": "Raúl goal against Real Sociedad [Sep 13, 1997]",
        "content": "",
        "upvotes": 76,
        "comments": 10,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/nu2utw9to3he1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1iheu0y/raúl_goal_against_real_sociedad_sep_13_1997/"
    },
    {
        "id": "1ih46in",
        "author": "nicootimee",
        "title": "Real Madrid has been hacked",
        "content": "",
        "upvotes": 467,
        "comments": 31,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/p0cpclaoj0he1.jpeg?auto=webp&amp;s=609837f10f4464c078e2831e1c4d4371dd45d0d9"
        },
        "permalink": "/r/realmadrid/comments/1ih46in/real_madrid_has_been_hacked/"
    },
    {
        "id": "1ihhe2w",
        "author": "Maldo963",
        "title": "This is beyond aggravating and ridiculous.",
        "content": "With the news that Alaba is now injured our only CB options are Asencio and Vallejo, this club is building so much revenue and trying to get richer and richer each day as we play worse and worse as each matchday goes by, never been so upset and disappointed as a Real Madrid fan, not even the 18/19 season had me in this much disbelief, our squad depth us non existent, got no tactics and we play horrendous football, even Espanyol who beat us play better than us or at least have an idea of play somewhat, Perez splash the cash on Saliba or any top CB, bring back Miguel or better yet go for Theo since Davies will not come at the end most likely, go for Zubimendi sign Xabi Alonso or Zidane as coach next season, we want major changes we demand good football, we demand winning every major title, and I especially don’t want Barca and Atletico to humiliate us every season and laugh at us like a laughing stock we are now, mark my words if this team signs nobody next season and Carlo stays and keeps playing his boys Vazquez and Tchouameni in defense and keep playinh this atrocious football we will see new lows next season we will probably miss out on qualifying for Champions League positions. ",
        "upvotes": 37,
        "comments": 47,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ihhe2w/this_is_beyond_aggravating_and_ridiculous/"
    },
    {
        "id": "1iha0mq",
        "author": "SubjectTumbleweed216",
        "title": "Cristiano Ronaldo full interview (full transcript in body): “Real Madrid is the biggest and best club in the world”, “At Real Madrid I missed a penalty and locked myself in the room.”, “My son really likes Mbappe, Bellingham, Camavinga”",
        "content": "Full transcript: \n\nCristiano Ronaldo: \n“At Real Madrid, for example, I remember when I missed a chance or a penalty I would be so angry with myself. I didn't allow myself to make mistakes. I would go to bed without dinner, and talk to myself, wondering why I shot to the right or to the left. I don't regret being like that.\n\nEverything that happens on the field, stays on the field. I can't get home with my football problems with my family. But at first it was very difficult. I missed an opportunity or penalty and I locked myself in my room and talked to myself. I was sick.\n\nMbappé is fast, powerful, he has speed… He can’t wait in the box. He has to stay out and appear. If I did it, can’t Mbappé do it? Real Madrid have to protect him.\n\nVinícius should have won the Ballon d'Or, but I'm not surprised, there is no credibility, I was very disappointed, he deserved it.\n\nJude Bellingham reminds me a lot of Zidane, he has some Zidane elements. He will give a lot to Madrid, because he will be a star.\n\nI like the fact that Real Madrid fans miss me. My home is Spain, I played for Madrid for many years, it was where I was happiest. Real Madrid was always in my heart.\n\nMy son Mateo really likes Bellingham, Camavinga, Mbappé.\n\nI achieved beautiful things at Madrid and people don’t forget that, that makes me happy.\n\nI respect Perez, he is a trustworthy president and a serious person, and he treated me well. We won many titles with him, and I respect him a lot.\n\nI loved playing in the Camp Nou. They booed me, they insulted me, and I LOVED that.\n\nYou may prefer Pele, Messi, Maradona, I understand and respect that.\n\nI have a very good relationship with Messi, I was his translator at some awards ceremonies.\n\nAt one point I was at Sporting and I managed to go to Barcelona, ​​they wanted to sign me.”\n\nIt didn't happen, because they wanted to sign me the following year and United came and signed me.\n\nI enjoyed scoring goals more at the Camp Nou than at the Santiago Bernabéu. When you are warming up and they are already whistling at you, that’s what I love. That’s the best part of football for me.”\n\nMadrid - Barcelona atmosphere and the relationship with Messi?\n\nCristiano Ronaldo:\n\n“It was a historic rivalry, Madrid-Barcelona, ​​Cristiano-Messi, Ramos-Pique.\n\nIt was very nice I had a very good relationship with Messi and I once translated it into some awards and all that before the ceremony started He has always treated me well and I hope we see our numbers again, but I find it very difficult”\n\n“I appreciate and respect Florentino, I speak to him sometimes and I don't rule out coming back one day when I finish my career and do something great.”\n\n“I left Real Madrid because I wanted a new chapter.\n\nIn the negotiations phase when I was leaving Real Madrid, Florentino did not behave well with me. I understood that, because that is always his style.\n\nI told Perez about it, he accepted, but later he tried to come back, and there was no going back for me, because I had given my word to Juventus.”\n\n“I'm happy people still remember that I did important and beautiful things and that's why people don't forget when you leave a mark.”\n\n“Spain is my homeland, my children were born there, and I will always have Real Madrid in my heart.”\n\n“I really like Carlo Ancelotti, he is an amazing person, we have won a lot of things together.”\n",
        "upvotes": 153,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/x0v7AoWWUBiikUcVEZUCl4CTEMbYwcnDqihk4c2u0VQ.jpg?auto=webp&amp;s=b3f9dba0133991c18fd72b556601e2ccb18f98ab"
        },
        "permalink": "/r/realmadrid/comments/1iha0mq/cristiano_ronaldo_full_interview_full_transcript/"
    },
    {
        "id": "1ihl0o9",
        "author": "ace-s",
        "title": "The squad depth issues could have been avoided a long time ago, under Carlo a young Valverde would have never gotten any chances",
        "content": "Hear me out,\n\nAlot of the other top teams in Europe have been able to integrate their Youth players into their their starting team, except us.\n\nAncelloti's demands for the club to sign players to increase our squad depth is UNREALISTIC. Players like Asensio, Nico Paz, Ramon and many others have been in our Youth team for years. The integration should have started years ago, players like Ramon and Asensio should have been given solid minutes last year so that they have been ready to start this year.\n\nWe honestly wasted years of youth squad integration because Carlo only likes to play his fav. 14-15 players.\n\nThe players are there, our Youth System is as strong as ANY other team.\n\nI hate to say it but look at Barcelona, They have created gems out of their youth. couple of years ago even their most loyal fan did not know half of these starting players are. Look at them now, almsot their entire team is from their Youth Squad. Yamal, Cubarasi, Balde, Pedri, Gavi...etc.\n\n\\------------------------------------------\n\nSolution to long term injuries should ALWAYS be from the Youth System, It is Ancelloti's failure to not integrate our youth team.\n\nTop players like Militao, Alaba, Rudiger are still on the club's payroll. Expecting to sign a worldclass CB on a long contract is not realistic. \n\nAsensio has shown he can be a Main team material, we probably have couple of more players like that.\n\nOur youth players have been scouted by the very best, they deserve a chance. It is crazy that a player like Fortea forces himself to leave the club cuz he knows he wont get a chance here.",
        "upvotes": 18,
        "comments": 15,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ihl0o9/the_squad_depth_issues_could_have_been_avoided_a/"
    },
    {
        "id": "1ihcbhy",
        "author": "kefhen",
        "title": "Saldo de expulsiones en Liga - Siglo XXI",
        "content": "",
        "upvotes": 64,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/yfptnqupq2he1.jpeg?auto=webp&amp;s=8bfdbccd68f00965be24c97ae79f1065f7abd8b0"
        },
        "permalink": "/r/realmadrid/comments/1ihcbhy/saldo_de_expulsiones_en_liga_siglo_xxi/"
    },
    {
        "id": "1ih4fzo",
        "author": "Glittering-Strength2",
        "title": "I don’t know if this been posted already but this is crazy it’s usually the other way around 😂😂😂😂",
        "content": "",
        "upvotes": 228,
        "comments": 61,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qc8ww0nsl0he1.jpeg?auto=webp&amp;s=b9af3098690fca45c747bb56cc744f0d9616d4cd"
        },
        "permalink": "/r/realmadrid/comments/1ih4fzo/i_dont_know_if_this_been_posted_already_but_this/"
    },
    {
        "id": "1igwsi5",
        "author": "WakJu",
        "title": "All I want, is carvajal",
        "content": "",
        "upvotes": 544,
        "comments": 30,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/uu01xr481zge1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1igwsi5/all_i_want_is_carvajal/"
    },
    {
        "id": "1iguhr2",
        "author": "dark4403",
        "title": "🚨 THE LETTER FROM REAL MADRID TO THE FEDERATION AND THE ENTIRE REFEREE SYSTEM",
        "content": "",
        "upvotes": 696,
        "comments": 109,
        "media": null,
        "permalink": "/r/realmadrid/comments/1iguhr2/the_letter_from_real_madrid_to_the_federation_and/"
    },
    {
        "id": "1ihlevd",
        "author": "BrunoBenjamenta",
        "title": "When did you become a Real Madrid fan?",
        "content": "I'm old as fuck, so for me was in the eighties, when I was a child and felt in love with la \"quinta del Buitre\", the \"remontadas\" in the UEFA Cup and so. What is your story? Did you follow your family tradition or did you break it? There was a special match or moment that made you a madridista for life?",
        "upvotes": 9,
        "comments": 42,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ihlevd/when_did_you_become_a_real_madrid_fan/"
    },
    {
        "id": "1ign2qx",
        "author": "dark4403",
        "title": "🗣️ Cristiano Ronaldo: \"Kylian Mbappé is not a striker, if I were at Real Madrid I would teach him to play as a forward\"",
        "content": "",
        "upvotes": 1432,
        "comments": 119,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9h66sas4uwge1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ign2qx/cristiano_ronaldo_kylian_mbappé_is_not_a_striker/"
    },
    {
        "id": "1ignt5k",
        "author": "SubjectTumbleweed216",
        "title": "Cristiano Ronaldo: “I say to the Madrid fans, take care of Mbappe, take care of the young man. Protect him”",
        "content": "Full transcript:\n\nCristiano Ronaldo:\n\n“Take care of him, and I say to the Madrid fans, take care of the young man. He is very good and will go over the top. Madrid has to help him, protect him, and I have no doubt that he will give a lot of joy to the Real Madrid fans.”\n\n“I love him a lot because not only because of the history he had as a youngster where he loved Cristiano a lot and was his idol, but it is because I truly see him, I see him as a star and I think that he will give a lot of joy to Real Madrid.”",
        "upvotes": 872,
        "comments": 18,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9exi2ubd2xge1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ignt5k/cristiano_ronaldo_i_say_to_the_madrid_fans_take/"
    },
    {
        "id": "1igyt2n",
        "author": "Rumcajs23",
        "title": "Real Madrid 25-26 Third Kit Leaked [FootyHeadlines]",
        "content": "",
        "upvotes": 186,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8lu72pmnfzge1.jpeg?auto=webp&amp;s=68eefd058376276ba538de84c52af7cca58c19fa"
        },
        "permalink": "/r/realmadrid/comments/1igyt2n/real_madrid_2526_third_kit_leaked_footyheadlines/"
    },
    {
        "id": "1igqyko",
        "author": "I_did_it_4_Lemonz",
        "title": "Real Madrid- Espanyol referees punished.",
        "content": "",
        "upvotes": 441,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Wp_zPcrtqtdlk02UntVZ538cHbc28O9fG9h5B3C_3CE.jpg?auto=webp&amp;s=350d9c0dd5282dc8708fad3429f2c9dbf16e2e84"
        },
        "permalink": "/r/realmadrid/comments/1igqyko/real_madrid_espanyol_referees_punished/"
    },
    {
        "id": "1ih139q",
        "author": "The_Middle_Child_",
        "title": "Behind the scenes vs Espanol",
        "content": "NEGREIRA persists ",
        "upvotes": 88,
        "comments": 23,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/cgs3z2f1wzge1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ih139q/behind_the_scenes_vs_espanol/"
    },
    {
        "id": "1igs4v7",
        "author": "itsshpadoinkleday",
        "title": "RM is 7th team in top5 leagues when it comes to Points Per Game this season, despite dozens of injuries and holes in the squad.",
        "content": "",
        "upvotes": 141,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pnDGzYrHWH2n4AgRg7E-lvJAmjdJlDWzkQSqDRMndeY.png?auto=webp&amp;s=765cf8f2a6162306683f9457bf783ae761995578"
        },
        "permalink": "/r/realmadrid/comments/1igs4v7/rm_is_7th_team_in_top5_leagues_when_it_comes_to/"
    },
    {
        "id": "1igoalv",
        "author": "Inevitable_Sky398",
        "title": "Real Madrid on IG posted about the red card not given to Espanyol player for the horror tackle on Mbappé, thoughts ?",
        "content": "https://preview.redd.it/fseytit07xge1.png?width=2648&amp;format=png&amp;auto=webp&amp;s=0fd55dce1f5683729122519df8ace98b6cfaccb1\n\nI see in many comments that some of our fans are not happy with such a move. This is the first time I see the club doing something like this. The board must be furious after these decisions, it's not the first time the VAR is pretending to be asleep.. not only they turn blind eyes on these fouls, but the 2 times Mbappé was on side, yet the VAR checked only the frame AFTER the ball was passed and Mbappé is offside.. and this right here could have easily ended Mbappé's career. the tackle was horrible ! \n\nWhat are your thoughts on the club posting this ? ",
        "upvotes": 174,
        "comments": 51,
        "media": null,
        "permalink": "/r/realmadrid/comments/1igoalv/real_madrid_on_ig_posted_about_the_red_card_not/"
    },
    {
        "id": "1igtehd",
        "author": "chui77",
        "title": "[Post Match Survey Results] Real Madrid 0-1 Espanyol",
        "content": "",
        "upvotes": 63,
        "comments": 35,
        "media": null,
        "permalink": "/r/realmadrid/comments/1igtehd/post_match_survey_results_real_madrid_01_espanyol/"
    },
    {
        "id": "1igp3d5",
        "author": "Accurate_Advance6903",
        "title": "The way we lost Rudiger is exactly the same as when we lost Vini after the Leganes game - sheer ignorance.",
        "content": "Seriously what is this next level clowning. First Carlo risks and got Vini injured by making him a play a full 90 against leganes after international break with no rest making him miss key games and now against espanyol Rudiger is the latest victim, which may be the killer blow that ends our season. He chose not to give Rudiger any rest AT ALL. \n\n",
        "upvotes": 85,
        "comments": 31,
        "media": null,
        "permalink": "/r/realmadrid/comments/1igp3d5/the_way_we_lost_rudiger_is_exactly_the_same_as/"
    },
    {
        "id": "1igvr6l",
        "author": "nublanco",
        "title": "Why is it so difficult to sign new players lately? or why don't the management sign new players?",
        "content": "In the past 5 seasons Real Madrid hasn't purchased or signed new players as much as they used to in the last 2 decades, recently it was mostly loan returns or buy-back options or signing free players.\n\nfor example during 2010-2011 Winter market we brought Adebayor on loan despite having both Benzema and Higuain who were physically fine. and on 2008-2009 season Van nistelrooy, de la red, and Diarra missed out the remainder of the season due to injuries and the management brought replacements (Huntelaar, Lassana, Parejo, and Faubert) even though they weren't useful.\n\nbut now we don't have Carvajal and Militao for the remainder of this season and our management don't want to sign any new players even temporarily as loans.\n\nReal Madrid is entitled to have 25 players registered in the first team, but we have 22 now with shirt numbers 12,24,and 25 available. or maybe i should say 21 as Vallejo is a bench warmer and never used not even in easier copa games.\n\nso what are the reasons? is it money? is it greed of players and their agents? is it Ancelotti? is it Perez?",
        "upvotes": 37,
        "comments": 11,
        "media": null,
        "permalink": "/r/realmadrid/comments/1igvr6l/why_is_it_so_difficult_to_sign_new_players_lately/"
    },
    {
        "id": "1igi30n",
        "author": "TheGhost5322",
        "title": "I'm sorry but this is funny 😭",
        "content": "",
        "upvotes": 286,
        "comments": 51,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vefweh4j2vge1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1igi30n/im_sorry_but_this_is_funny/"
    }
]