[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 507,
        "comments": 276,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 20,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1k4azqt",
        "author": "no_wiz_hat_ho3",
        "title": "Bad Influence: The Dark Side of Kidfluencing",
        "content": "I have just got finished with watching this series. I am horrified. I’m only 18 myself and I feel sick just thinking about what these kids have had to endure. The manipulation. The lies. The cunning demeanour of Tiffany Smith. It’s all outrageous. How has a scandal of such great size been shoved down teen’s throats. \n\nInitially I had directed all my frustration towards Tiffany (the mother) but now I beginning to realise how sick household is.\n\nPiper Rockelle is most definitely a victim of pretty much anything you can think of. How child services have not stepped in is beyond me. \n\nI can see the pressure leading into her 18th birthday and we all know what turn folds. When she becomes of age, the exploitation will only skyrocket from there on out. \n\nMESSAGE TO PARENTS: GUIDE YOUR CHILDREN THROUGH HONEST AND MEANINGFUL CAREERS.",
        "upvotes": 33,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1k4azqt/bad_influence_the_dark_side_of_kidfluencing/"
    },
    {
        "id": "1k48gty",
        "author": "wibble1234567",
        "title": "The decline of quality content on streaming services",
        "content": "A decade or more ago there were only a small number of platforms, e.g. netflix, Amazon. \nThen when Disney for example decided they wanted their own platform, along with a dozen other companies, it resulted in a hugely diluted market place where no one or two subscriptions can provide any meaningful breadth of content that existed back then. \nYet each of the subscription options offer about 10-20% of the content that Netflix and Amazon used to, but still think it's appropriate to charge £10-15 a month.\n\nFor me, this did not result in any improvements as a consumer but represented potential increases from &lt;£20 a month to &gt;£50 a month, which I wasnt willing to spend on 5-6 subscriptions.\n\nI occasionally run an Amazon sub under student pricing and cancel it the second the content I wanted it watched. \n\nSomething else I found frustrating is having to scroll through pages of foreign content or even worse, foreign content that's not obviously foreign until you press play and see/hear the awful dubbing. \n\nI'm looking at you netflix, using foreign content to supplement your lack of new content over the past few years.\n\nI would suggest they have options to filter content in the same way you can by age rating or content type only selecting your preferred language it was filmed in, sifting out any content not in your preferred language or dubbed content if that's your preference. \n\nAt this stage, if that option ever appears I suspect it would be behind a pay wall.",
        "upvotes": 8,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1k48gty/the_decline_of_quality_content_on_streaming/"
    },
    {
        "id": "1k4g0s9",
        "author": "Creativedog1079",
        "title": "Peplum shows",
        "content": "Hi everyone, I wanted to ask for some recommendations for a new show to watch. I'm a big fan of peplum shows — my favourites are Vikings and The Last Kingdom. I've also watched Knightfall.\nDo you have any recommendations for similar shows? It's important that they don't have any fantasy elements, like Game of Thrones or similar.\n\nP.S. I'm Italian, if that matters for availability of shows",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k4g0s9/peplum_shows/"
    },
    {
        "id": "1k4al5h",
        "author": "throwRA-war",
        "title": "I struggle finding shows",
        "content": "Hi , I'd like a few suggestions on what to watch. Im not exactly sure what genre i like but I'll list shows I really enjoyed \n\nLucifer, the prodigal son , the mentalist,  the good doctor, the resident,  the big bang theory, the calling(on showmax though) , suits , bridgerton, queen Charlotte , the Lincoln lawyer,  harrow,  will trent, Wednesday \n\nThank you",
        "upvotes": 4,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1k4al5h/i_struggle_finding_shows/"
    },
    {
        "id": "1k4dawa",
        "author": "Somethingman_121224",
        "title": "'Ransom Canyon' Showrunner Talks About the Major Character Death that Shocked Fans",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k4dawa/ransom_canyon_showrunner_talks_about_the_major/"
    },
    {
        "id": "1k4gtad",
        "author": "MysteriousDelay6266",
        "title": "Bet | Official Trailer | Netflix | MAY 15",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k4gtad/bet_official_trailer_netflix_may_15/"
    },
    {
        "id": "1k4c4wy",
        "author": "Legitimate_Ad3625",
        "title": "Pride &amp; Prejudice director reveals writer Emma Thompson improvised much-memed 'no money, no prospects' speech",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k4c4wy/pride_prejudice_director_reveals_writer_emma/"
    },
    {
        "id": "1k4as6q",
        "author": "Fatxhy",
        "title": "No correct subtitles",
        "content": "Trying to watch Jujutsu Kaisen &amp; Demon Slayer but there are only foreign subtitles. For example Demon Slayer has ONLY French subtitles and Jujutsu Kaisen has ONLY German…\nMy account language is on English.. why is there no English sub on those two series?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k4as6q/no_correct_subtitles/"
    },
    {
        "id": "1k3elg5",
        "author": "user_promedio",
        "title": "Recommend very good Netflix series",
        "content": "I've already watched Better Call Saul, Dexter, Dark, and a few other series, and now I don't know what to watch. I'm anxiously waiting for the fifth and final season of YOU, and in the meantime, I'll start watching Ozark. But when I say good series, I mean really good.\n\nEdit:\nI'm open to anime, two of my favorites are Death Note and Monster",
        "upvotes": 219,
        "comments": 366,
        "media": null,
        "permalink": "/r/netflix/comments/1k3elg5/recommend_very_good_netflix_series/"
    },
    {
        "id": "1k42nv0",
        "author": "LaDeskWood",
        "title": "Ransom Canyon thoughts/problems",
        "content": "I thought the show was solid and definitely went through it faster than I thought I would consider considering I already watched all of it and it’s only been out a few days. The breakout stars of this are Garrett Wareing who played Lucas and Jack Schumacher who played Yancy. I thought Minka Kelly also did a good job and Josh Duhamel was fine but something tells me Yancy and Lucas will be getting more screen time.\n\nReid/Lauren: Unfortunately, from an appearance point of view; the actor portraying Reid is a total miscast. I could not stop thinking about it while watching any scene that he was in. He’s half the size of everyone, but somehow he’s the high school star quarterback? He’s just nowhere near as good looking as Lucas so it’s almost laughable that he’s in a love triangle with him and Lauren. Again, he’s half his size, I just kept thinking about how Lucas could flick him to the ground if he wanted to. They should have had the actor who played Tim play Reid. That would definitely be believable for that dude could be in a love triangle with Lucas and Lauren. Reid was also the only actor in this show that was portraying a high school student but didn’t actually look like one because he looked too old. Maybe it’s shallow of me, sorry, but just my honest thoughts. Seems like a nice guy.\n\nCap: I’m very intrigued to see what they do for comic relief in the second season that is inevitable to be ordered because he was the only person who consistently provided that this season. I feel like this is dangerous territory to be walking into because now that he’s gone, they’re going to have to bring in somebody else to fill the comic relief hole. If that person isn’t good, then that hole will become wider. It’s not like he was so laugh out loud funny all of the time, but it certainly was a piece of the puzzle that worked well that won’t be here anymore.\n\nStaten/Quinn: I don’t know, I don’t think they were bad, but they definitely didn’t have the best chemistry. I’m guessing that they didn’t get along great when the camera was off is the most likely answer. I wasn’t clamoring for them to end up together, it just seemed obvious the whole time that they were going to eventually, so it just felt a bit static.\n\nYancy/Ellie: They had great chemistry and I think this was a large part of what carried the show so well. I think Yancy will break out and become a huge star from this because it was always fun to watch him, but she was also fantastic.\n\nThe Mom twist: I understand what the show was doing because they kept hinting at the fact that Tim and Reid were the culprits of the death so I knew they weren’t going to end up having much to do with it and having the mom eventually be the one who did the killing just felt like it was so out of left field. I know they did this so it would be very hard to predict, but it just didn’t feel like it mattered all that much and left no impact on me. it’s also hard to believe that she would cheat on that chiseled chin cop with Kit. I wasn’t a fan of the fact that she was only in like the first episode early on and then she doesn’t appear again until way later. It just felt like cheating. It was also weird to me that she took what Lauren said to her while she was drunk and decided to get straight and sober.Typically these things don’t happen while you’re drunk and they are from conversations you have while you’re sober.\n\nLauren’s Dad: I think the actor did a pretty good job. I just thought it was so annoying how they had him ignoring Staten the first few episodes as if he’s crazy and you just knew exactly where it was going to go. How a piece that large from a truck in a crash could be sitting there for a year is pretty hard to believe, but the fact that he thought it didn’t matter at all and had nothing to do with anything and was so adamant and dismissive of Staten was pretty stupid. The fact he lost his wife to Kit is also hard to believe considering this is the best looking guy in the whole show. Hopefully they give him a storyline with some romance in the second season because that guy could steal anybody’s girl.\n\nThe bottom line is that the show is not going to win any Golden Globes but it was definitely entertaining and I watched all of it in less than two days. I look forward to the second season and look forward to what they’re going to do with it. I’m not going to read the books so it’s probably already predetermined, but I would be absolutely shocked if this show did not get picked up for at least another season and most likely a lot more\n",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1k42nv0/ransom_canyon_thoughtsproblems/"
    },
    {
        "id": "1k3wirp",
        "author": "Hopeful-Bee-4030",
        "title": "Million Dollar Secret on Netflix",
        "content": "SPOILER (season 1) \n\nIt hurts to see Kyle leave because of how much he truly needed the money and how fair he played the game. Cara was definitely threaten by him but honestly, that makes respect them both so much more for how smart they are playing the game, compared to other players like Jaimi and Sydnee (who irritated me the whole time). I want to know others’ thoughts and opinions about these specific players or even other players as a whole. ",
        "upvotes": 10,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1k3wirp/million_dollar_secret_on_netflix/"
    },
    {
        "id": "1k40wck",
        "author": "always_onward",
        "title": "Brightness problem",
        "content": "The brightness on my Netflix app when I watch on my Android phone keeps periodically dimming and then immediately brightening again. This seems to happen at random intervals as often as every few seconds. It makes it impossible to watch anything. Is this happening to anyone else? I cannot figure it out for the life of me.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k40wck/brightness_problem/"
    },
    {
        "id": "1k3yswo",
        "author": "NathalieDelReyes",
        "title": "Con mum",
        "content": "So many people have been saying that Graham was only interested in his mum for the money. Am I the only person who thinks that’s not true?\nHaving grown up not knowing one of my parents, you literally cling onto that fantasy of them above anything else. I met up with mine several times hoping that he would somehow become that superhero I had in my mind. That image which you form over the years is so hard to lose, it feels like grief.\nSo whilst the other people definitely wanted Dionne for her perceived wealth, I don’t think Graham was one of them, nor Heather.\n",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1k3yswo/con_mum/"
    },
    {
        "id": "1k4bryg",
        "author": "ReadyJournalist5223",
        "title": "Is the new black mirror season any good?",
        "content": "The last maybe like two seasons have been kinda hit or miss (maybe more miss honestly) and strangely I haven’t heard almost anything about the new season at all good or bad. Doesn’t anyone have any strong opinions on it? Should I give it a shot or maybe not",
        "upvotes": 0,
        "comments": 60,
        "media": null,
        "permalink": "/r/netflix/comments/1k4bryg/is_the_new_black_mirror_season_any_good/"
    },
    {
        "id": "1k37imf",
        "author": "Chance_Run3753",
        "title": "Why are some seasons backwards on shoes",
        "content": "",
        "upvotes": 157,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1k37imf/why_are_some_seasons_backwards_on_shoes/"
    },
    {
        "id": "1k3zqmg",
        "author": "llinusnepomuk",
        "title": "Show doesn’t appear on safari browser",
        "content": "I noticed the show 1883 doesn’t appear on Netflix when I’m using Safari but does show up in the app and on chrome. Even when I search for the direct Netflix link in safari it only shows the shows page without any pictures or episodes. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k3zqmg/show_doesnt_appear_on_safari_browser/"
    },
    {
        "id": "1k41hyl",
        "author": "Nukesnipe",
        "title": "How do I force Netflix to play in HD on desktop in 2025?",
        "content": "I've tried Chrome, Firefox, Edge and the Windows app, and all of them are stuck at 540p.  My download speed is like 300 mbps, every other streaming service else can do 1080p or better with no problem.  I read that Chrome and Firefox won't do more than 720p, but even that would be an improvement to what I'm getting!\n\nI've gone through all the Netflix settings, it's supposed to only play highest quality.  None of the other threads and posts I can find still work.",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1k41hyl/how_do_i_force_netflix_to_play_in_hd_on_desktop/"
    },
    {
        "id": "1k3vkpe",
        "author": "Fortunate-Zoo2831",
        "title": "Does netflix send the account holder a confirmation email if a pin lock is added to a profile?",
        "content": "My parents are the account holders and I think it's my father's email account. We all have separate profiles. I want to create a pin lock for my profile so they can't access it, but I don't want them to know right away that I've added the pin lock.\n\nIs a confirmation email sent when a pin lock is added?\n\nCan the account holder override pin locks?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k3vkpe/does_netflix_send_the_account_holder_a/"
    },
    {
        "id": "1k41dbv",
        "author": "dailystar_news",
        "title": "TNA star Joe Hendry answers Randy Orton's WWE WrestleMania 41 challenge",
        "content": "",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1k41dbv/tna_star_joe_hendry_answers_randy_ortons_wwe/"
    },
    {
        "id": "1k3e5hr",
        "author": "honeycomb1300",
        "title": "Million Dollar Secret Plot-hole?",
        "content": "SPOILER!! Tell me if I’m missing something here… when Cara got the box with the million dollars, Sam also got a clue. All the contestants knew there was 1 person getting a clue and 1 person getting the million that morning. Sam told Corey she got the clue, meaning she could not have gotten the million also. The box never moved again before the finale. So how did Corey not know it was Cara if it obviously wasn’t him and logically could not have been Sam? ",
        "upvotes": 13,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1k3e5hr/million_dollar_secret_plothole/"
    },
    {
        "id": "1k3rci8",
        "author": "Trigger-ZZZ",
        "title": "Slow burn Period Drama recs?",
        "content": "Hello! I'm looking for Period dramas with a slower romance development.\nIdm any country of origin, I'll happily watch with subtitles.\n\nI really liked first season of Bridgerton so I'm looking for stuff similar to that, or Anne with an E where the romance is a subplot and takes a while. I've tried The Empress but they fall for eachother way too quickly. Bonus points if he falls first though! ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1k3rci8/slow_burn_period_drama_recs/"
    },
    {
        "id": "1k41bvg",
        "author": "dailystar_news",
        "title": "Drew McIntyre takes mid-match WrestleMania 41 selfie as photo goes viral",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k41bvg/drew_mcintyre_takes_midmatch_wrestlemania_41/"
    },
    {
        "id": "1k2zvph",
        "author": "okaynowhat",
        "title": "How many of you just subscribe for a month, a few times a year?",
        "content": "I let my netflix subscription end last November. I'd always have the 4k plan through some deal, I believe the last year I had it through a verizon deal of like $140 bucks for the year with amc+. And I'd get something similar all previous years for the past like 5 years. But there have been zero deals this go around, and I'm now at a point where I'll be cancelling a couple other streaming services that are lacking or cheaper trials ending (i.e. apple 3 month trial). \n\nAnyway, the 4k plan is now $25 which is pretty insane to me. I did get a quality tv and sound system back in 2020 and am used to 4k on every other service. So I'm deciding if I want to do $25 a few months a year, or do $8/mo continuously for 1080p. Since netflix releases all episodes at once, it doesn't really create the weekly discussions the way a show like severance, last of us, white lotus, etc do. So I'm heavily leaning towards just subscribing for a month at $25, immediately cancel it so it ends that month, and rejoin when theres at least a few more new shows/seasons that actually appeal to me. Wondering how many other people just subscribe occassionally throughout the year. ",
        "upvotes": 57,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1k2zvph/how_many_of_you_just_subscribe_for_a_month_a_few/"
    },
    {
        "id": "1k3xexd",
        "author": "VDA_Killjoy",
        "title": "PG Programs showing as G",
        "content": "We have noticed that titles such as “Babysitters Club” or “The Good Witch” will have the G rating on their main page but once you start an episode and the details fade - it will then say “PG - Mild themes”\n\nWe have a rule that our daughter can only watch G rated programs and she is great with following this but not being able to tell from the initial information makes it pretty difficult. \n\nYesterday she was watching a G rated show about gymnastics and one of the characters died and there was a funeral. It was a bit much for something advertised as “G-Rated”\n\nRant over. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k3xexd/pg_programs_showing_as_g/"
    },
    {
        "id": "1k3qnrq",
        "author": "CookieBat666",
        "title": "Netflix app and TV too dark",
        "content": "Both on the mobile app and on my smart TV the screen is always too dark no matter what I do. How can I change it? Some shows are borderline unwatchable.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k3qnrq/netflix_app_and_tv_too_dark/"
    },
    {
        "id": "1k2urft",
        "author": "biascourt",
        "title": "Netflix will soon get a new design for its TV app",
        "content": "If the experiment gains traction, Netflix hopes to extend it to its broader audience over the coming months and quarters.",
        "upvotes": 74,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1k2urft/netflix_will_soon_get_a_new_design_for_its_tv_app/"
    },
    {
        "id": "1k3u4fl",
        "author": "radu_014",
        "title": "Just finished the mini-series \"Adolescence\" on Netflix",
        "content": "Hello, everyone! I want to review this series from my perspective. I felt shocked at the first episode, because it felt absolutely real, no act cuttings, just a camera filming the entire interactions... at some point it felt like it's boring to watch something so long from one perspective (don't blame me, i'm in gen z lol) but the subject is the most attractive thing that kept me watching. This series has rolled the effect of this masculine toxicity and it's a masterpiece because it's real and current. As Jamie said, when he was playing football and had a bad time, his dad didn't want to look him in the eye, so that I think he felt like he had no help and developped some defender conversațional behaviour (episode 3). An important lesson is that parents should be more involved in their children lives (ending of episode 4). Nothing can motivate what Jamie did, but he also lied about it! Jamie's parents thought that he can be safe when he is in his room. One of the most hard things that shocked me was the dad's suffering. He thought he failed as a parent and it's destroying him. As a future parent and husband, I want to raise my boy in order to respect women, protect them and not to make fun of them and not beating them! I am very curious to hear your thoughts guys! Thank you. 🙏",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k3u4fl/just_finished_the_miniseries_adolescence_on/"
    },
    {
        "id": "1k32315",
        "author": "Accomplished-Bug9930",
        "title": "On Netflix movie descriptions, not saying which country it is from if it is a foreign movie or show?",
        "content": "Recently I watched The Tailor. When I looked at the description on Netflix, it did not way what country it is from! It would be so nice if Netflix tells me (us) if it is a foreign movie and which country it is from! No?",
        "upvotes": 20,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1k32315/on_netflix_movie_descriptions_not_saying_which/"
    },
    {
        "id": "1k3i9gw",
        "author": "LONk_SLJr",
        "title": "What is going on with Netflix",
        "content": "I opened up Netflix today and one piece is gone, same with other shows I was watching, is something wrong with my Netflix or is it happening to anyone else ",
        "upvotes": 2,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1k3i9gw/what_is_going_on_with_netflix/"
    },
    {
        "id": "1k3gu5w",
        "author": "Zioticc",
        "title": "Behind the Scenes of FROM Freezing Temps Tireless Effort and Total Dedication",
        "content": "Not many people realize how brutal it was filming FROM. This short clip shows one of the cast members completely wiped out from shooting in freezing conditions. The whole team went through insane weather cold, wind, delays and still pulled through to deliver something amazing.\n\nIt’s easy to watch a show and forget how much work happens behind the scenes. But seeing moments like this reminds you just how much effort goes into making every scene perfect.\n\nBig respect to the cast ",
        "upvotes": 0,
        "comments": 4,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/x9ni5l1yuxve1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1k3gu5w/behind_the_scenes_of_from_freezing_temps_tireless/"
    }
]