[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 503,
        "comments": 274,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 18,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jsxsf7",
        "author": "Wild_Shallot_3618",
        "title": "Con Mum Arrested!",
        "content": "Courtesy of @mothershipsg IG",
        "upvotes": 188,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1jsxsf7/con_mum_arrested/"
    },
    {
        "id": "1jt4wcv",
        "author": "LightOver4599",
        "title": "CON MUM IRONY",
        "content": "does anyone else note the irony of Graham being abandoned as a child but also abandoning his own child- he grew up without parental love. This potentially led to his gullibility. He probably didn’t even try everything in his power make sure his kid grows up with a dad around. ",
        "upvotes": 11,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1jt4wcv/con_mum_irony/"
    },
    {
        "id": "1jt6ic8",
        "author": "ThatEcologist",
        "title": "Netflix saying that our device is not part of household when it is?",
        "content": "It is my girlfriend and I’s account. We have been using it on our one tv fine. Now all the sudden it says it is not part of the household?? My girlfriend logged out and logged back in and we are getting the same message! What is the deal?",
        "upvotes": 5,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1jt6ic8/netflix_saying_that_our_device_is_not_part_of/"
    },
    {
        "id": "1jt2bif",
        "author": "Hornkueken42",
        "title": "Can I see my Netflix watching statistics anywhere?",
        "content": "I've been watching (or rather listening to) the Big bang theory series every night continuously for more than 10 years. I use it to fall asleep, especially the first five seasons. I'd like to know how often I've watched every episode. ",
        "upvotes": 9,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jt2bif/can_i_see_my_netflix_watching_statistics_anywhere/"
    },
    {
        "id": "1jt92tf",
        "author": "Content_Whoarder",
        "title": "Is Netflix mobile worth its weight in storage? :P",
        "content": "I can’t count how many times I’ve stared at my phone, frustrated by the “Storage Full” notification popping up again. When I scroll through my apps to check which app is hoarding all the storage, it’s always Netflix (and some other apps) : [https://stackl.ist/3DWupMR](https://stackl.ist/3DWupMR)\n\nSometimes I think about deleting Netflix mobile, but then I hesitate. Not sure if convenience, addiction, or just FOMO is holding me back, hahaha! What about you—are these apps worth their weight, or are they just clutter? ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jt92tf/is_netflix_mobile_worth_its_weight_in_storage_p/"
    },
    {
        "id": "1jt8swk",
        "author": "NeitherAdvertising65",
        "title": "Website asking for card info?",
        "content": "My account got hacked, the email was changed, password, phone number. No way way to reset it, so I went to Netflix support and went on chat. They asked me for my card info? Some box pops up where I put my info in, seems a little weird, is this normal? ",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jt8swk/website_asking_for_card_info/"
    },
    {
        "id": "1jt7rqr",
        "author": "Highlight-Grand",
        "title": "The Residence: Some Questions",
        "content": "Just finished the series today and I’ve gotta say I agree with some of the opinions about the ending feeling anticlimactic. All that build-up… for that?\n\n(No spoilers but the questions below might give a hint about the killer) \n\nWhy didn’t the killer just hire a hitman? Given their background, they were definitely capable. \n\nAnd who was the grandmother referring to at the end when she mentioned that name to Detective Cupp? \n\nI feel like a few things were left unexplained, especially the motive. With their resources, they could’ve handled things differently or just fought it legally. Maybe it’s just me, but would love to hear your thoughts!",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jt7rqr/the_residence_some_questions/"
    },
    {
        "id": "1jt2ujc",
        "author": "capercrohnie",
        "title": "Karma",
        "content": "I really enjoyed this mini series. I binged it in one day and it has lots of twists and turns. I should mention i am a huge kdrama fan so pretty biased lol",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jt2ujc/karma/"
    },
    {
        "id": "1jszi8v",
        "author": "Noktis_Lucis_Caelum",
        "title": "Just watched the DMC anime",
        "content": "Hello everyone,\n\nI Just watched the \"Devil May Cry\" ANIME.\n\nIT was good. I am Not so deep in the DMC Franchise (played 3 and DMC reboot).\n\nNow i am kinda thinking, that they should also adapt \"Bayonetta\"",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jszi8v/just_watched_the_dmc_anime/"
    },
    {
        "id": "1jschg8",
        "author": "TimesandSundayTimes",
        "title": "Charlie Brooker: I’ve only let my kids watch one episode of Black Mirror",
        "content": "",
        "upvotes": 71,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1jschg8/charlie_brooker_ive_only_let_my_kids_watch_one/"
    },
    {
        "id": "1jt14gw",
        "author": "btwImVeryAttractive",
        "title": "TV screen goes black when I turn the zoom OFF. How do I fix it?",
        "content": "If I turn on the zoom, the video descriptions are easier to read but it throws the thumbnails off (I can’t scroll to the ones on the far right).\n\nBut when I turn the zoom off again the screen goes black and gets stuck like that. \n\nETA: I have a 24” Vizio. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jt14gw/tv_screen_goes_black_when_i_turn_the_zoom_off_how/"
    },
    {
        "id": "1jrz4ph",
        "author": "skummies",
        "title": "Con Mum arrested in Singapore",
        "content": "I’m from Singapore and it’s so surreal to see this in the news this morning. Just like in the documentary, Dionne attempted similar scams here. Victims only realised they were being cheated after they watched the documentary. ",
        "upvotes": 348,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1jrz4ph/con_mum_arrested_in_singapore/"
    },
    {
        "id": "1jsnsjf",
        "author": "Calebp24",
        "title": "Show recommendation",
        "content": "I need a new show to watch. The last show I watched was The Recruit and I loved it. I need something with action and excitment. Anyone know any shows maybe like the recruit or at least something exciting with a lot of action?",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1jsnsjf/show_recommendation/"
    },
    {
        "id": "1jt6z3f",
        "author": "Alan_Stamm",
        "title": "Netflix subscribers are furious controversial U.S. comedian Tony Hinchcliffe has been given specials [starting April 7]",
        "content": "",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1jt6z3f/netflix_subscribers_are_furious_controversial_us/"
    },
    {
        "id": "1jt4jed",
        "author": "everglowxox",
        "title": "Adolescence: Another piece of media more obsessed with the male psyche than with the experience of female victims",
        "content": "I can't seem to find this take anywhere, and I know the incels will descend and tear me to shreds, but I don't care. (And if there are folks out there making this argument and I just haven't found it, then please do point me towards that!)\n\nLook- I loved Adolescence on my first watch, just like everyone else. I was blown away by the teen boy's complex, contradictory psyche, and in particular, wowed by the skillset of the actor portraying him.\n\nBut I can't get past the fact that this series cares infinitely more about the interior struggle of a boy and what leads him to violence than it does about the girl that he KILLED? Katie's only role in this series is to literally DIE so that she can advance the killer's character development. Where is she in this story? Certainly not on the killer's mind: He did nothing wrong. He did nothing wrong. He tells us, over and over and over again.\n\nAt what point do we get to have media that says: Actually, I don't give a fuck why you decided to murder that girl or woman. She gets to have HER story told. And you get to rot in jail.",
        "upvotes": 0,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1jt4jed/adolescence_another_piece_of_media_more_obsessed/"
    },
    {
        "id": "1jslz3o",
        "author": "deonisgreatness_",
        "title": "In need of a show name",
        "content": "It was probably on netflix during the 2014-2015 range. I remember watching it as a kid but nothing more. It was sort of like horrid henry, there was a boy he had a younger sibling, 2 main friends, 2 parents and there was a school bully. Had relationships with his teacher. There was a episode where he and his classmates had like this race around the block with their gym coach. Please help me",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jslz3o/in_need_of_a_show_name/"
    },
    {
        "id": "1jrzfv4",
        "author": "Key-Highway9659",
        "title": "Did anybody really bored by Ozarks stick it out and it was good? Having trouble with it",
        "content": "Hello.\n\nI am not trying to insult The Ozarks. This is the fifth time I have tried to watch it as I've heard so much good stuff about it.\n\nBut every time I watch, I am bored to tears. The way the actors all act doesn't feel real and I care about the characters most of all in a show. \n\nI thought this is about a family thrown into extreme danger unexpectedly? \n\nIt's weird. I feel like I didn't get enough time with Marty or any of these people before they were genius hardened criminals and almost...bored/underwhelmed by all of it and any vulgarity.\n\nSo far, it feels like if Breaking Bad knew it was a TV show mixed with Mad Men or American Psycho but without the... I don't know!! Justification? Style?\n\nIts frustrating. I want to shake them and wake the whole show up. \n\n\n I ask... did anybody that was IMMENSELY bored by this stick it out and it was worthwhile for you? Thank you for any info\n\nOr does it get explained later why they're all like this and weirdly numb? Even the family members?",
        "upvotes": 65,
        "comments": 145,
        "media": null,
        "permalink": "/r/netflix/comments/1jrzfv4/did_anybody_really_bored_by_ozarks_stick_it_out/"
    },
    {
        "id": "1js4zds",
        "author": "TaleMother8466",
        "title": "The best reality show on netflix?",
        "content": "What is the best reality show on netflix? Something really suspenseful. I just watched Million Dollar Secret and I loved it. I know its not the real, but I would love something simmilar to watch. ",
        "upvotes": 19,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1js4zds/the_best_reality_show_on_netflix/"
    },
    {
        "id": "1jsnk21",
        "author": "awesomeAMP",
        "title": "Million Dollar Secret: good idea, stupid execution",
        "content": "Basically the title. \n\nSaw what was it about and it sounded interesting, however, it’s is completely stupid and easy for the contestants to know who the millionaire. The secret objectives are not subtle, and the clues given out by the producers are more than obvious. \n\nI understand why it must be like this: the average viewer is not that smart and more complex puzzles, objectives, and clues can be a turn off leading to less views, but it still makes me kind of angry knowing this could be so much fun with smarter rules. \n\nI’ll keep watching because I like crappy tv before bed, but still. \n\n\nWhat do you think. ",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1jsnk21/million_dollar_secret_good_idea_stupid_execution/"
    },
    {
        "id": "1jt1ymp",
        "author": "Relative_Recording47",
        "title": "Is ‘A Minecraft Movie’ Streaming on Netflix or Disney+?",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jt1ymp/is_a_minecraft_movie_streaming_on_netflix_or/"
    },
    {
        "id": "1jsg9c0",
        "author": "Kuchii_Kopii",
        "title": "Florida Man - Song in episode 2??",
        "content": "I'm desperatly looking for the song thats playing at 27:20 mins Episode 2.\nI only know he sings something like:\"So slooo-o-o-o-oow\" idk??\nCan u help me there its killing me aaah",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jsg9c0/florida_man_song_in_episode_2/"
    },
    {
        "id": "1jt25fs",
        "author": "himalaya2241",
        "title": "Did Jamie really do it?",
        "content": "In the Netflix series \"Adolescence\" , Did Jamie really kill the girl Katie? Because I could not get it at the end. What really happened? It's complex for me. Can anyone please tell? \nMan this series felt so real to me. I don't know if it's wrong , but I really felt connected with Jamie. I also feel sad for the girl. I wish..\n\nPS: Can anyone recommend this kind of series?",
        "upvotes": 0,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1jt25fs/did_jamie_really_do_it/"
    },
    {
        "id": "1jsahzz",
        "author": "surtrc",
        "title": "Movies stop about 7 minutes before the end?",
        "content": "Hello\n\nI watch movies via Playstation. When the movie is about to end (about &lt;7 minutes before the end of the movie) SOME movies stop playing. I can't do anything. I have to restart my Playstation. When I try to open the movie after and watch it it happens over and over again.\n\nDo anyone of you have the same problem or experienced this issue? Thanks so much for your help.\n\nIt happens with SOME movies, but not all... really weird.",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jsahzz/movies_stop_about_7_minutes_before_the_end/"
    },
    {
        "id": "1jsiyd4",
        "author": "slyr4scal",
        "title": "Netflix issue..",
        "content": "Hey, so, just started watching Naruto through Netflix.\n\nCurrently on season 2, episode 1 and my closed captions aren’t really “closed-captioning”… The subtitles aren’t showing what the characters are saying on screen, which isn’t TOO MUCH of an issue, but it’s extremely annoying. I watch dub with subtitles on because it feels comfortable (please don’t attack me for it) and I want to know if anyone else has had this issue watching Naruto on Netflix or if it’s just me.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jsiyd4/netflix_issue/"
    },
    {
        "id": "1jsrj5i",
        "author": "Renegade_Pawn",
        "title": "Prevent Netflix from auto-rewinding 30 seconds or so",
        "content": "For a while now, Netflix has been auto-rewinding episodes by \\~30 seconds when I resume watching them. I'm not talking about using the play/pause button, but rather when I've closed and then reopened the episode later.\n\nThis behavior seems to have become the trend (Youtube does the same), but I **really, really don't like it.** \n\nIt doesn't seem consistent. Sometimes it happens, sometimes it doesn't.\n\nI just want the episode to resume exactly where I left off. Does anyone know a way to disable this so-called feature?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jsrj5i/prevent_netflix_from_autorewinding_30_seconds_or/"
    },
    {
        "id": "1js7axp",
        "author": "Arppeggi",
        "title": "Netflix TV does not have a \"I'm traveling\" option anymore?",
        "content": "I recently bought a smart TV a month ago, and I think it had the traveling option, which worked great until today. Now, I’m stuck with having to change the Netflix household to use my TV.  \n  \nIs there any way I can use Netflix on my TV without changing the Netflix Household?",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1js7axp/netflix_tv_does_not_have_a_im_traveling_option/"
    },
    {
        "id": "1js4l15",
        "author": "BreathInTheWorld",
        "title": "Million dollar secret",
        "content": "Great show, could think of it similar to a popular game 'amoung us' BUT I'm sure the producer's didn't count on alliances to form instead of everyone collectively voting out the millionare.\n\nIt is possible the producers stepped in to tell the contestants they had to try vote out the millionaire. There was no downside for an alliance of 5 people voting out 4 others. That would then make it a boring and predictable show when you know who will be voted out.\n\nLet's say the contestant's voted out someone that is not the millionaire, then $100,000 is taken off the prizepool and given to the millionaire. This wiould make sure someone like Lauren isn't voted out and would create higher tensions petween players. Complete anarchy! What do you think?",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1js4l15/million_dollar_secret/"
    },
    {
        "id": "1jsoasv",
        "author": "Icy_Studio4485",
        "title": "adolescence",
        "content": "in adolescence when they discuss jamies attractions and feelings towards women and kate, and with the graffiti, are they implying that jamie also sexually assaulted kate at some point before or after the murder? or is it accusations towards the father, or towards jamie being an incel? ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jsoasv/adolescence/"
    },
    {
        "id": "1jrroxe",
        "author": "Jatmahl",
        "title": "Pulse",
        "content": "Started episode one and already turned off by the shitty CGI... like everything outside the hospital building is CGI. You are telling me the producers couldn't get back drops of a random real life hospital to use? It makes it look very cheap.",
        "upvotes": 42,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1jrroxe/pulse/"
    },
    {
        "id": "1jrwylx",
        "author": "fish_man77",
        "title": "Any good detective shows??",
        "content": "I'm currently watching unbelievable which is amazing btw if you haven't seen it watch it! But I'm really into these shows and I was wondering if there's any more? I have watched one but I forgot the name but they interview murders so I've only seen two good ones:))",
        "upvotes": 13,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1jrwylx/any_good_detective_shows/"
    }
]