[
    {
        "id": "1j44z7e",
        "author": "yahooentertainment",
        "title": "We're reporters from Variety and Yahoo Entertainment who covered the Oscars from the ground and watched the show to report on all the unusual stuff, what the results mean for film, and more. Ask us anything!",
        "content": "**From Kelsey:** I'm a senior entertainment reporter covering the best and worst of pop culture at Yahoo News. This year, I interviewed many of the Oscar nominees and wrote our weekly Best Picture Leaderboard — a [power ranking](https://www.yahoo.com/entertainment/we-correctly-predicted-anora-would-win-best-picture-at-the-oscars-heres-what-we-learned-from-our-formula-185203877.html) made from an original formula that correctly (!!) predicted *Anora* would win.\n\n**From Taryn:** I was on the ground covering the Oscars for u/yahooentertainment, and wrote about [plenty of things from the show you didn't see on TV](https://www.yahoo.com/entertainment/8-things-you-didnt-see-on-tv-at-the-2025-oscars-timothee-chalamet-and-kylie-jenner-get-cozy-the-conan-obrien-jokes-that-landed-with-the-crowd-and-a-gracious-demi-moore-171758152.html). I can also tell you anything you want to know about Taylor Swift, Justin Bieber, or the Kardashians at any given time.\n\n**Clayton Davis** is the Chief Awards Editor at u/Variety, where he has been a leading voice in awards forecasting since joining the esteemed Hollywood publication in September 2020. Davis is also a two-time Emmy-nominated host of PBS' Variety Studio: Actors on Actors and co-host of the award-winning Variety Awards Circuit Podcast.\n\n**PROOF:** [https://imgur.com/a/yahoo-entertainment-variety-ama-UZffFO7](https://imgur.com/a/yahoo-entertainment-variety-ama-UZffFO7)",
        "upvotes": 0,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/T84FDR47s33kvGeG7NWRi8jTUVGTShGF_prPZBdQRs0.jpg?auto=webp&amp;s=3b17f81b13d36e97254d0b870bbe2fed425d1889"
        },
        "permalink": "/r/movies/comments/1j44z7e/were_reporters_from_variety_and_yahoo/"
    },
    {
        "id": "1j3uct4",
        "author": "Sabiancym",
        "title": "Dad gets up during every movie without pausing.",
        "content": "My dad always does something I've only ever heard of people occasionally doing. No matter what movie or TV show he's watching at home, he will get up in the middle of it and with zero urgency, go to the bathroom, grab food, look out the window, or do any number of random things, all without pausing.  He'll then sit back down having missed 5-20 minutes without saying a word and never asks questions after the movie. \n\nIt used to drive me nuts when I lived at home over a decade ago and recently I stayed over one night and watched him do the same thing.  My mom doesn't even bother asking if she should pause. \n\nQuality doesn't matter either. It could be the greatest movie he's ever seen, but he'll still miss 10 minutes of it doing whatever. I've seen him take out the garbage, cook popcorn on the stovetop, and even fold laundry in another room all while a movie he wanted to watch was playing. \n\nThis is insane right? I understand not being in to a movie and getting bored, but in my 30+ years I've never seen or heard of him sitting through an entire movie.  This is the same guy who can sit on the porch for an hour or two doing nothing. I don't understand. \n\nTo be clear, I'm not trying to change him or anything. I just truly don't understand and want to see if anyone else knows someone like this.  \n&amp;nbsp;  \n****EDIT**** People keep saying it's about spending time with others or not wanting to interrupt. It's just my mom and dad at home, and if they disagree on what to watch she'll go upstairs to watch something while he watches what he wants alone....but still gets up without pausing.",
        "upvotes": 6709,
        "comments": 2661,
        "media": null,
        "permalink": "/r/movies/comments/1j3uct4/dad_gets_up_during_every_movie_without_pausing/"
    },
    {
        "id": "1j4514g",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'The Accountant 2'",
        "content": "",
        "upvotes": 318,
        "comments": 106,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ldhor3tmyvme1.jpeg?auto=webp&amp;s=3cbdaa867060d4075fca5d50d555523a645e2080"
        },
        "permalink": "/r/movies/comments/1j4514g/new_poster_for_the_accountant_2/"
    },
    {
        "id": "1j43fjg",
        "author": "CloseCalls4walls",
        "title": "I appreciate how openly emotional the men were in Godzilla Minus One",
        "content": "This was an interesting action movie experience for me. It was good! Something especially notable was how men interacted with each other, being sensitive toward each other and openly expressing their emotions, crying lots of times. It was a refreshing departure from American media where I honestly just don't see anything like it happening. \n\nTypical gender norms sadden me. It's like years of cultural norms have stunted people's growth in so many ways when they otherwise could be processing their emotions in more authentic and likely healthier ways. Here in GMO you see companionship and empathy and it really displays an openness to the way the characters functioned as people. It was almost off-putting, yet their actions would perhaps be true to life, under those circumstances. ",
        "upvotes": 388,
        "comments": 69,
        "media": null,
        "permalink": "/r/movies/comments/1j43fjg/i_appreciate_how_openly_emotional_the_men_were_in/"
    },
    {
        "id": "1j3f6yv",
        "author": "MarvelsGrantMan136",
        "title": "‘Shōgun’ Star Cosmo Jarvis Joins Christopher Nolan’s ‘The Odyssey’ With Filming Underway In Morocco",
        "content": "",
        "upvotes": 7400,
        "comments": 426,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cWoTFxLPOSFllCkmjFe3hdLM1sf7FJ77psP1uL6mIj0.jpg?auto=webp&amp;s=f50d13d7be55a935c8e179db6cd0e062048d0e33"
        },
        "permalink": "/r/movies/comments/1j3f6yv/shōgun_star_cosmo_jarvis_joins_christopher_nolans/"
    },
    {
        "id": "1j3yfjt",
        "author": "randomvegasposts",
        "title": "What's the fastest a character has said the name is a movie in the movie?",
        "content": "I just started in Bruges. The first word is \"Bruges\"\nI'm not counting that but a minute and a half later Colin Farrell says \"In bruges? Are you fucking kidding me?\"\n\nI just have to wonder what the fastest any character said the name of the movie organically (narrators and voice overs don't count) \n\nAnything faster than a minute 30?",
        "upvotes": 353,
        "comments": 108,
        "media": null,
        "permalink": "/r/movies/comments/1j3yfjt/whats_the_fastest_a_character_has_said_the_name/"
    },
    {
        "id": "1j3v3tv",
        "author": "sndwchss",
        "title": "i love when movies have those stupid in-universe tv shows",
        "content": "Like the ones where its the same exact premise, over and over again\n\nlike the “where are my pants” in the lego movie “ow my balls” in idiocracy, and “i got the shit kicked out of me” in sorry to bother you.\n\ni love how they insist this is the most popular show in universe i need more examples of this 😭😭😭",
        "upvotes": 697,
        "comments": 227,
        "media": null,
        "permalink": "/r/movies/comments/1j3v3tv/i_love_when_movies_have_those_stupid_inuniverse/"
    },
    {
        "id": "1j46sx6",
        "author": "ChocolateOrange21",
        "title": "'Movies don't change but their viewers do': Movies that hit differently when you watch them at an older age.",
        "content": "Roger Ebert had this great quote about movies and watching them at different points in your life. Presented in full below.\n\n“Movies do not change, but their viewers do. When I saw La Dolce Vita in 1960, I was an adolescent for whom “the sweet life” represented everything I dreamed of: sin, exotic European glamor, the weary romance of the cynical newspaperman. When I saw it again, around 1970, I was living in a version of Marcello’s world; Chicago’s North Avenue was not the Via Veneto, but at 3 a.m. the denizens were just as colorful, and I was about Marcello’s age.\n\nWhen I saw the movie around 1980, Marcello was the same age, but I was 10 years older, had stopped drinking, and saw him not as a role model but as a victim, condemned to an endless search for happiness that could never be found, not that way. By 1991, when I analyzed the film a frame at a time at the University of Colorado, Marcello seemed younger still, and while I had once admired and then criticized him, now I pitied and loved him. And when I saw the movie right after Mastroianni died, I thought that Fellini and Marcello had taken a moment of discovery and made it immortal.”\n\n\\*\\*\n\nWhat are some movies that had this effect on you? Based on a previous discussion, 500 Days of Summer was one for me. When I first watched it, I just got out of a serious relationship, and Tom resonated with me. Rewatching it with some time, I realized Tom was flawed, and he was putting Summer on a pedestal and not seeing her as a person.\n\nDiscuss away!\n\n",
        "upvotes": 71,
        "comments": 102,
        "media": null,
        "permalink": "/r/movies/comments/1j46sx6/movies_dont_change_but_their_viewers_do_movies/"
    },
    {
        "id": "1j3zssk",
        "author": "Ok-Impress-2222",
        "title": "Which movies are a good test of media literacy, but AREN'T \"You missed the point by idolizing them\" kind of movies?",
        "content": "The term \"media literacy\" is often brought up in modern fiction discussion. It refers to the viewer's ability to decipher what the author actually really meant to say with their work, and what should be the \"correct\" interpretation of it.\n\nBut most if not all examples of such works are ones where most people end up idolizing a certain character, but the whole point is supposed to be that you shouldn't idolize them. (Some examples being Tyler Durden in *Fight Club,* Patrick Bateman in *American Psycho* for some reason, Travis Bickle in *Taxi Driver,* etc. For works other than movies, I personally would also add Raskoljnikov from *Crime and Punishment* on that list.)\n\nAre there any movies that might be testing some different kind of media literacy, other than the aforementioned one? I personally can't think of any.",
        "upvotes": 227,
        "comments": 548,
        "media": null,
        "permalink": "/r/movies/comments/1j3zssk/which_movies_are_a_good_test_of_media_literacy/"
    },
    {
        "id": "1j3njnv",
        "author": "MarvelsGrantMan136",
        "title": "David Arquette Returning As Deputy Dewey Riley In ‘Scream 7’",
        "content": "",
        "upvotes": 1822,
        "comments": 242,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7O-5NYgn7PjLa4JNBAvtVM3hJATAV8zDxV_apztmYHI.jpg?auto=webp&amp;s=dfad7c157bf89739f57395241eb1bc3e0e160bad"
        },
        "permalink": "/r/movies/comments/1j3njnv/david_arquette_returning_as_deputy_dewey_riley_in/"
    },
    {
        "id": "1j43ja6",
        "author": "BunyipPouch",
        "title": "New Poster for Historical-Epic 'William Tell' - The Austrian Empire, desiring more land, invades neighboring Switzerland. William Tell, a peaceful hunter, finds himself forced to take action as his family and homeland come under threat from the oppressive Austrian King and his ruthless warlords.",
        "content": "",
        "upvotes": 104,
        "comments": 146,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/02kayo0jjvme1.jpeg?auto=webp&amp;s=71c1edcb8260728cdbf725966a0aaba8ad6dd65e"
        },
        "permalink": "/r/movies/comments/1j43ja6/new_poster_for_historicalepic_william_tell_the/"
    },
    {
        "id": "1j41pf2",
        "author": "RealJohnGillman",
        "title": "‘Bullet Train Explosion’ | Official Teaser | Netflix",
        "content": "",
        "upvotes": 104,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/h0b1XbUtGWFGWUxkigBgWb6h0b-Hsx3wj9vjr1t_KUA.jpg?auto=webp&amp;s=11f6f18f656dceaeb8a1a5d771aa5392bbab18d7"
        },
        "permalink": "/r/movies/comments/1j41pf2/bullet_train_explosion_official_teaser_netflix/"
    },
    {
        "id": "1j3zzuk",
        "author": "yanakozlova",
        "title": "What movie have you watched the most number of times?",
        "content": "All of us have movies that we love. Some we love because they remind us of different times of our lives. Others we love because they were truly excellent films.\n\nA brief comment or thought on the fact of rewatching movies and the difference you encount from watching the same movie but in different moment.\n\nWhat movie have you watched the most number of times?",
        "upvotes": 114,
        "comments": 607,
        "media": null,
        "permalink": "/r/movies/comments/1j3zzuk/what_movie_have_you_watched_the_most_number_of/"
    },
    {
        "id": "1j3m9ir",
        "author": "indiewire",
        "title": "Sean Baker's 'Anora' Editing Oscars Win Is Rare, but Not Unprecedented",
        "content": "",
        "upvotes": 1191,
        "comments": 171,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g8NwjERrSZY0uO9FWUiYZuA5vYVmhujVf29v_2bHmSE.jpg?auto=webp&amp;s=1fa36d1d2c32983aedb783800100a32d467335ba"
        },
        "permalink": "/r/movies/comments/1j3m9ir/sean_bakers_anora_editing_oscars_win_is_rare_but/"
    },
    {
        "id": "1j3goan",
        "author": "Stonewalled89",
        "title": "Sneakers: the cult ‘feelgood heist film’ with a hefty cast and a byzantine plot",
        "content": "",
        "upvotes": 2029,
        "comments": 286,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3ydbVYx_WRjwf6mBX_848Q4-48jYh0ofUG8l9SMUpFM.jpg?auto=webp&amp;s=cb10605249339983c77e548bc79ef0919480b28b"
        },
        "permalink": "/r/movies/comments/1j3goan/sneakers_the_cult_feelgood_heist_film_with_a/"
    },
    {
        "id": "1j45tv6",
        "author": "ujp567",
        "title": "Just finished threads 1984. I’m very unhappy.",
        "content": "I watch a lot of depressing shit. It’s like one of my favourite genres of film. But this. Jesus Christ. I think it’s cause one, I live in the UK and too, we are startlingly close to this becoming a reality. The way it just ends as well, no closure know anything oh my God. I genuinely don’t think you could pay me to watch that again, but I loved it.",
        "upvotes": 34,
        "comments": 36,
        "media": null,
        "permalink": "/r/movies/comments/1j45tv6/just_finished_threads_1984_im_very_unhappy/"
    },
    {
        "id": "1j41rcy",
        "author": "mofapilot",
        "title": "Question regarding \"Fargo\"",
        "content": "To clarify, I am German and therefore not a native American English speaker. \n\nI recently watched Fargo. It's a great movie and I really liked how Marge switched from nice lady to professional in an instant on many occasions. \n\nBut there is one thing, I really can't put my finger on it. I came to the impression, that almost all characters a little bit... dense? Or naive? Or is it just the weird dialect from Minnesota?  (Besides the obvious mistakes they made during the story of course)\n\nEDIT: Thank you all for your feedback! I wasn't aware, that \"Minnesota Nice\" was a thing! I guess, that this, combined with the lack of swearing, made up my impression. ",
        "upvotes": 41,
        "comments": 63,
        "media": null,
        "permalink": "/r/movies/comments/1j41rcy/question_regarding_fargo/"
    },
    {
        "id": "1j3j623",
        "author": "KillerCroc1234567",
        "title": "Updated Oscar Viewership - 19.7M Viewers",
        "content": "",
        "upvotes": 577,
        "comments": 91,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rYijIoOUxXHe-mRRNiH_qOc-WXrUv-htTKcGVkJHODg.jpg?auto=webp&amp;s=f012c1841ae412055767f6da9214f850d015ee10"
        },
        "permalink": "/r/movies/comments/1j3j623/updated_oscar_viewership_197m_viewers/"
    },
    {
        "id": "1j32rrn",
        "author": "gaporter",
        "title": "Michelle Trachtenberg, Shannen Doherty, Tony Todd Among Those Omitted From Oscars In Memoriam Segment",
        "content": "",
        "upvotes": 9937,
        "comments": 751,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/65wwYCPiIxkD8EIWLU4chm3juxNsnXxrMVDHn07mqD4.jpg?auto=webp&amp;s=0193f46fd07411682f37d7b0f8dd7166555e1ce2"
        },
        "permalink": "/r/movies/comments/1j32rrn/michelle_trachtenberg_shannen_doherty_tony_todd/"
    },
    {
        "id": "1j46n99",
        "author": "Puzzled-Tap8042",
        "title": "O’Shea Jackson Jr, Jennifer Ehle, Chet Hanks &amp; Spencer Garrett Join Lily Gladstone &amp; Bryan Cranston In Conspiracy Thriller ‘Lone Wolf’",
        "content": "",
        "upvotes": 11,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LRwM3XV_eB6ZrB_VtLBn-7gYWw7XC-Uhs_-se9xSy-I.jpg?auto=webp&amp;s=4bfa8ea0076f66c83a1c8803f6bb6606d6f92282"
        },
        "permalink": "/r/movies/comments/1j46n99/oshea_jackson_jr_jennifer_ehle_chet_hanks_spencer/"
    },
    {
        "id": "1j3dh79",
        "author": "Orson2077",
        "title": "Buster Scruggs: \"Do you need a count?\"",
        "content": "In the first episode of Buster Scruggs, Buster and the Kid both ask *\"Do you need a count?\"* during their shootouts. I don't know what to make of it. Is it some kind of trick to give an advantage to the asker? \n\n \\- If the opponent answers \"yes\", I presume a third party would count and they'd shoot (a fair match).\n\n \\- If the opponent answers \"no\", the asker can shoot immediately while the opponent is preoccupied with the question.\n\nIf it is a trick, is it supposed to imply that Buster isn't as honourable as he lets on? (\"Buster Scruggs don't shoot nobody in the back.\")",
        "upvotes": 800,
        "comments": 118,
        "media": null,
        "permalink": "/r/movies/comments/1j3dh79/buster_scruggs_do_you_need_a_count/"
    },
    {
        "id": "1j41ebt",
        "author": "No_Macaroon_7608",
        "title": "What's some instances where a director went to extreme length?",
        "content": "Just watched hearts for darkness, which is the making of apocalypse now. It''s really crazy what Francis coppola did to make apocalypse now.. So many struggles, literally everything they showed was real from helicopters, tiger to guns.. and he also put everything he owned on line to be able to fund that movie. Just a crazy making which I don't feel can be achieved nowadays. Do you know any other instance where a director went to extreme length?",
        "upvotes": 16,
        "comments": 57,
        "media": null,
        "permalink": "/r/movies/comments/1j41ebt/whats_some_instances_where_a_director_went_to/"
    },
    {
        "id": "1j46ytt",
        "author": "Minute-Necessary2393",
        "title": "Something I noticed about Ferris Bueller's Day Off.",
        "content": "Something i realized about Ferris Bueller's Day Off when I rewatched last night (great movie, as always, btw) is that Ferris doesn't actually have a character arc in the movie. Yes, he is the title character and the main POV throughout most of the film, but he doesn't have a clear character arc.\n\nIf anything, Cameron Fray, Ferris friend does. At the start of the film, Cameron is in bed sickly and not really confident in himself, but as the movie progresses, he starts to get more confidence, and by the end, he gains the courage to stand up to his father. \n\nIt's kindof wholesome, actually.",
        "upvotes": 7,
        "comments": 9,
        "media": null,
        "permalink": "/r/movies/comments/1j46ytt/something_i_noticed_about_ferris_buellers_day_off/"
    },
    {
        "id": "1j3g0jd",
        "author": "indiewire",
        "title": "'Jaws' to Celebrate 50th Anniversary with Academy Museum Exhibition",
        "content": "",
        "upvotes": 400,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/H955LyLsBfWEuMjh5EKUY-Fnm2H6mAY7JVGcyav4jyo.jpg?auto=webp&amp;s=613ae5cd586dec684167330073d5035a0263d581"
        },
        "permalink": "/r/movies/comments/1j3g0jd/jaws_to_celebrate_50th_anniversary_with_academy/"
    },
    {
        "id": "1j47ihw",
        "author": "RomanReignsDaBigDawg",
        "title": "Prince of Darkness is one of John Carpenter’s best",
        "content": "Though not without some 80s cheese (some of the acting and dialogue can be rough), its flaws are forgiven for the sheer ambition. Think this movie handles momentum and impending doom as well as any horror film and the slow burn approach really works in its favour. \n\nI love horror films but I find very few of them to be truly unsettling. Sequences in Prince of Darkness just freak me out, though. Those recurring dream messages from the future with the distorted voice and low-budget VHS footage get under my skin, and the “YOU WILL NOT BE SAVED!” scene is just a masterclass of tension. \n\nI also think it has an all-timer ending. The dream sequence repeats once more and the ambiguity of it all since you’re not sure if the evil is still out there or not is so well done. Prime example of show, don’t tell.\n\nWhile The Thing is the superior film, Prince of Darkness is scarier IMO. What do you all think of the movie? ",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1j47ihw/prince_of_darkness_is_one_of_john_carpenters_best/"
    },
    {
        "id": "1j2zpvd",
        "author": "MarvelsGrantMan136",
        "title": "Oscars Hit 18.1 Million Viewers, Down 7% From Last Year",
        "content": "",
        "upvotes": 7100,
        "comments": 1222,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/urAcLJ0-GLUZN5Dyw7dpZewLO5zzbWbaGHkCcMnXeTg.jpg?auto=webp&amp;s=e29e47281433551349ed395ab5a2dd480a289b77"
        },
        "permalink": "/r/movies/comments/1j2zpvd/oscars_hit_181_million_viewers_down_7_from_last/"
    },
    {
        "id": "1j3zadk",
        "author": "TechnicalTrash95",
        "title": "Does anyone remember Airwolf-The Movie?",
        "content": "This was basically the pilot episode for Airwolf the series from the 80s. I think eventually it was cut up into individual episodes for TV but I remember it as being an actual film you could rent out from the video shop during the 80s. If it actually made it to the cinema I'm not sure. But it was pretty good for a TV film and was also rated an 18 which was slightly bizarre. Much more adult themed than the TV series too.",
        "upvotes": 15,
        "comments": 16,
        "media": null,
        "permalink": "/r/movies/comments/1j3zadk/does_anyone_remember_airwolfthe_movie/"
    },
    {
        "id": "1j3ear3",
        "author": "Vanderlyley",
        "title": "Judge opens door to possible bidding war for Paramount as it scrambles to close $8B Skydance merger",
        "content": "",
        "upvotes": 336,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pvrIdDFEh1KIM9YvZhuIOrMocHCg_gtELjchh0IDuNU.jpg?auto=webp&amp;s=3f78b97e99c50b18413513966c1e4f31df1b3a82"
        },
        "permalink": "/r/movies/comments/1j3ear3/judge_opens_door_to_possible_bidding_war_for/"
    },
    {
        "id": "1j3k06o",
        "author": "Available-Cap7655",
        "title": "Is it ever revealed what Ingrid whispers to Gregorio? In Spy Kids 2001.",
        "content": "Rewatching my childhood. Spy Kids 2001 film. There is a part of the film where Gregorio Cortez decides to go on a mission and tells Ingrid she can’t go. Then, Ingrid whispers something to him and she is able to go with him.\nIs it ever revealed what she whispers to him? Is there a script or anything that reveals what she whispers?",
        "upvotes": 166,
        "comments": 26,
        "media": null,
        "permalink": "/r/movies/comments/1j3k06o/is_it_ever_revealed_what_ingrid_whispers_to/"
    },
    {
        "id": "1j3bfqa",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Celine Song's 'Materialists' Starring Dakota Johnson, Chris Evans, and Pedro Pascal - Follows a young, ambitious New York City matchmaker who finds herself torn between the perfect match and her imperfect ex.",
        "content": "",
        "upvotes": 452,
        "comments": 103,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ucqeys40jome1.jpeg?auto=webp&amp;s=1b0314ac94cefb82c17073935729c64d68495da0"
        },
        "permalink": "/r/movies/comments/1j3bfqa/official_poster_for_celine_songs_materialists/"
    },
    {
        "id": "1j3l3eb",
        "author": "parryfinkle",
        "title": "Which movies that aren't related that could potentially be unofficial sequels?",
        "content": "What's a trilogy or duology that isn't related but seems like it. I'll start. Serial Mom and Scream\n\nDeath Becomes Her and She Devil\n\nAddams Family and Edwards Scissorhands\n\nWitches of Eastwick and First Wives Club\n\nRomy and Michelle's High School Reunion and Legally Blonde \n\nWhat do you got? Can also be a trilogy! Extra points if it's a trilogy actually (;",
        "upvotes": 124,
        "comments": 439,
        "media": null,
        "permalink": "/r/movies/comments/1j3l3eb/which_movies_that_arent_related_that_could/"
    }
]