[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 485,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1hm18t3",
        "author": "AutoModerator",
        "title": "NFL Christmas Gameday Megathread",
        "content": "1:00pm ET - Kansas City Chiefs @ Pittsburg Steelers\n\n4:30pm ET - Baltimore Ravens @ Houston Texans",
        "upvotes": 31,
        "comments": 615,
        "media": null,
        "permalink": "/r/netflix/comments/1hm18t3/nfl_christmas_gameday_megathread/"
    },
    {
        "id": "1hn2ir0",
        "author": "alkosz",
        "title": "Squid Game Season 2 was actually good",
        "content": "i know a lot of people here hate the second season and admittedly sure its not as good as the first one, however its a pretty close tie. having our antagonist directly involved into the game a second time yet we now know the entire time who it is probably has to be the best writing switch in any series ive ever watched. it was very entertaining not knowing when he'll switch up back to his own side and felt oddly satisfying watching him do so at the end. granted there was barely any sad moments in the series like the first one had, not as memorable of characters but it still got the job done it set out to do. at the end of it all i still wanted to watch more and any series that makes me feel that way deserves a great score.\n\ni would rate the first season a definite 10/10\n\nthis new season is definitely a 8/10\n\ncould've done better, better pacing, better characters and more drama but definitely not bad at all.",
        "upvotes": 245,
        "comments": 229,
        "media": null,
        "permalink": "/r/netflix/comments/1hn2ir0/squid_game_season_2_was_actually_good/"
    },
    {
        "id": "1hn3b1j",
        "author": "Cheddar18",
        "title": "So La Palma absolutely sucked.. what other natural disaster movies or shows should I try next!? ",
        "content": "Talk about plot armor... damn what a disappointment of a show. \n\n\nBut now I'd love to watch any other natural disaster shows or movies- I've seen Greenland so many times but am not sure what else to watch that's actually good. I'd love any recommendations please!! \n\n\nEdit- thank you everyone for the recs, please keep them coming because I love this genre!! I started The Wave 🕺🏻",
        "upvotes": 62,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1hn3b1j/so_la_palma_absolutely_sucked_what_other_natural/"
    },
    {
        "id": "1hn4upw",
        "author": "Zeroyhme",
        "title": "Squid Game: Season 1 vs Season 2",
        "content": "",
        "upvotes": 21,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hn4upw/squid_game_season_1_vs_season_2/"
    },
    {
        "id": "1hn9l0b",
        "author": "EvelynClede",
        "title": "Squid Game's Season 2 - A Comprehensive Overview",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hn9l0b/squid_games_season_2_a_comprehensive_overview/"
    },
    {
        "id": "1hnajhg",
        "author": "mister_alma_raynard",
        "title": "problem with netflix on my browser",
        "content": "hi, so am using my netflix on browser and many movies dont appear that ive seen previosly. example i wanted to watch babylon. it aint there after i search. if i go to my mobile its there. i tired a different browser and same problem.\n\nsome more movies where is problem occurs are the other guys, gifted, the interview.........and so on\n\nive added these movies to my list before in the browser itself and one day many movies just dissapear. i tried searching them as well but they dont appear. any fix?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hnajhg/problem_with_netflix_on_my_browser/"
    },
    {
        "id": "1hmi2o0",
        "author": "Robemilak",
        "title": "Adam Sandler Shares the First Teaser for Netflix's Sequel ‘Happy Gilmore 2’",
        "content": "",
        "upvotes": 249,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1hmi2o0/adam_sandler_shares_the_first_teaser_for_netflixs/"
    },
    {
        "id": "1hn1u6j",
        "author": "Chaosjoint",
        "title": "Carry-on: Did I miss something?",
        "content": "When Ethan face-off with the antagonist at the end of sorting, Ethan find a similar case when the villain demands him to give him the case. \n\nMy thought is that he swapped the case by putting the ribbon on that random case and leave his earpiece there for him to take.\n\nLater, when the antagonist board the plane to DC, it was by the time he settle down that he found the case is slightly bigger than his design and even already tagged for transport.\n\nThen it is not the real one right?\n\nThen why the hell is the chem weapon still in the case? \n\nI just can't wrap my head around it. Am I missing something here?",
        "upvotes": 7,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1hn1u6j/carryon_did_i_miss_something/"
    },
    {
        "id": "1hmqmv2",
        "author": "DotOne4395",
        "title": "10 Highly Anticipated Netflix Movies Coming in 2025",
        "content": "* **Back in Action (January 17)**\n* **The Electric State (March 14)**\n* **Wake Up Dead Man: A Knives Out Mystery (2025)**\n* **The Old Guard 2 (2025)**\n* **Fear Street: Prom Queen (2025)**\n* **The Life List (2025)**\n* **Frankenstein (2025)**\n* **Happy Gilmore 2 (2025)**\n* **Havoc (2025)**\n* **Plankton: The Movie (2025)**\n\n[**View in Web**](https://www.cinemablind.com/highly-anticipated-netflix-movies-of-2025/) **|** [**Anticipated Netflix Shows**](https://www.cinemablind.com/highly-anticipated-netflix-shows-of-2025/)\n\n",
        "upvotes": 34,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hmqmv2/10_highly_anticipated_netflix_movies_coming_in/"
    },
    {
        "id": "1hn86yy",
        "author": "YRNERICK",
        "title": "Hear me out. ",
        "content": "I don’t know if this the right sub for this but Just hear me rant for a bit. \n\nWhen did TV series adopt this new format of waiting 2-5 years for a new season just to release 10 episodes or less?? I get that they are about an hour long but still.. What’s the point of waiting so long for a tv show for only to have such little episodes? When did this become the new norm?? What’s the reasoning for such long period of wait time for 10 episodes max? Compared to TV shows from the early 2000s and 2010s where they would have 20-30 episodes per season. Is it budget reasons? Or is it just to create more hype for the tv show? I hate it. -_-\n\nOr is it just me that feels this way?\n\nExample, season 2 of squid games released today with only 7 episodes, I finished it already and now going to have to wait several years for season 3… besides the rant I think season 2 was great. ",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hn86yy/hear_me_out/"
    },
    {
        "id": "1hn9qwb",
        "author": "aditya_35",
        "title": "Subscription issue?",
        "content": "I have Netflix basic which renews every 27th of the month. I was watching multiple series like When the phone rings, Dan da dan, etc.\n\nToday when I logged through my pc and mobile, it showed they are not available in my region(India). \n\nWhen I logged through Jio STB (TV) it showed they are available? \n\nWhat is the issue?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hn9qwb/subscription_issue/"
    },
    {
        "id": "1hn6jwk",
        "author": "Mingming_143",
        "title": "Netflix games not letting me log in?",
        "content": "\nWhen I try to select a profile when logging in, it gives me an error and doesn’t let me play the game. I’ve had this problem with all other or Netflix’s games, and I cannot fix it. This happened with Monument Valley 3 and Storyteller, but I’m sure it does the same with other games. No matter what profile I select or how many times I restart my phone, it still won’t work. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hn6jwk/netflix_games_not_letting_me_log_in/"
    },
    {
        "id": "1hmv9u7",
        "author": "sillysaegers",
        "title": "Any good Netflix movies/shows with Dutch Dubs?",
        "content": "I’m Belgian and I live in America and I use Netflix as one does but almost every show or movie I enjoy doesn’t have a Dutch dub, anyone have any recommendations?",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hmv9u7/any_good_netflix_moviesshows_with_dutch_dubs/"
    },
    {
        "id": "1hmxmnk",
        "author": "hamsamichhh",
        "title": "video game commercial?",
        "content": "hi friends, my dad saw an action video game commercial during the netflix christmas football game and can’t remember the name of it. wondering if anyone remembers the name of it ? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hmxmnk/video_game_commercial/"
    },
    {
        "id": "1hmhk3t",
        "author": "Robemilak",
        "title": "Carry-On pulled nice numbers",
        "content": "‘CARRY-ON’ had 97M views in its first 10 days of streaming. The biggest Netflix film release this year. What did you think of it? I'd says it's a decent addition to Christmas movie list.",
        "upvotes": 50,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1hmhk3t/carryon_pulled_nice_numbers/"
    },
    {
        "id": "1hn4jqn",
        "author": "Tedman6969",
        "title": "Carry-on Plot Hole?",
        "content": "In the movie it shows the tsa officer switch the gas bomb into another suitcase that had to be checked when Jason Bateman gets on the plane. The issue is did he put the smaller suitcase inside the larger suitcase or did he have time to move the bomb into the new suitcase?\n\nEither way there is an issue because the smaller suitcase wasn’t left at the baggage area but when they open the suitcase on the plane the bomb is only in one suitcase.\n\nNot sure if anyone has any clarity on this.\n\n",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hn4jqn/carryon_plot_hole/"
    },
    {
        "id": "1hm64x4",
        "author": "AnonymousUser8476249",
        "title": "Netflix needs a “Live” button / option",
        "content": "There needs to be a way to jump to the live action when viewing a live event such as an NFL game.  \nApple TV latest version, latest os, etc. \nWhen you switch away from the game and then come back, Netflix holds your spot.  Which is great when watching regular shows and movies, but sucks when watching a live event.\n\nI understand that this may be baked into the core architecture of Netflix, but they need to at least add a button to jump to the live action.  Currently the only way to do this is to fast forward until you reach the live spot.  \n\nHopefully someone from Netflix sees this and makes it happen.",
        "upvotes": 244,
        "comments": 116,
        "media": null,
        "permalink": "/r/netflix/comments/1hm64x4/netflix_needs_a_live_button_option/"
    },
    {
        "id": "1hmcjls",
        "author": "ohhhKid",
        "title": "Korean zombie movies are top tier",
        "content": "New show called Happiness out on Netflix, korean based, zombie theme show. I love zombie movies, but “all of us are dead” “kingdom” and “happiness” are awesome choices! Really hope to see more Korean zombie movies/shows in the future",
        "upvotes": 81,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1hmcjls/korean_zombie_movies_are_top_tier/"
    },
    {
        "id": "1hn0zvg",
        "author": "CarlosGaarher",
        "title": "Have a share account without living in the same home, didn't have a problema already. I'm gonna have problems one day? ",
        "content": "Yes, my girl and two of his friends share an account. They lived in an apartment together, I lived in another apartment. I have the account on my TV for like 3 weeks. With the Netflix restrictions, some day I'm gonna have the warning that I not lived in the same place that the owner of the account? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hn0zvg/have_a_share_account_without_living_in_the_same/"
    },
    {
        "id": "1hmuv8c",
        "author": "CAmiller11",
        "title": "Netflix social connections",
        "content": "As long time ago, before streaming, Netflix had a social function were you could sort of connect to your friends on the website. It made recommending movies really easy as you could just share to them. I wish Netflix would add this feature or something like it back. No, it wouldn’t be account sharing. But like I could “friend” my mom, and when I finish watching a movie I think she would like, I could “share the recommendation” with her. Same with friends (who tend to be more clued in on movies, why I used my mom as an example). It could even be added as a “friends recommend” list below the “my list”. And it would show the movies/shows/etc and then which “friend” recommended it. You scroll to a show/movie and it gives watch now, add to my list, dismiss, etc. If you watch it and rate it, it lets the person that recommended it know if you liked it. Netflix wants to keep people on the platform, this would help. ",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hmuv8c/netflix_social_connections/"
    },
    {
        "id": "1hmpyl4",
        "author": "True-Reserve4307",
        "title": "Squid game 2 is trash",
        "content": "theres no spoilers in this just my general review of sg2. I encourage you to watch the series to fully understand my review.\n\nIf i had to describe the series so far in one word itd be:\n\n1. repetitive\n2. frustrating\n\nI just finished watching all 7 episodes and I gotta say it was subpar. The events were too obvious, foreshadowing was shallow, plot twists were also obvious, their voting order was obvious. The show was made far too obvious. I think the games that the characters had to survive in were formed to be alot simpler, to accommodate for western viewers that arent familiar with korean games. Not alot of scenes actually made me surprised, nervous or excited. However, I did feel alot of frustration to the mc's inability to manipulate his peers better.\n\nAs I was watching the series I also realized that the 'surprise' factor was no longer present because of its reoccurring themes from sg1. i.e. the format of the episodes, the methods that characters were developed, how characters reacted in situations...\n\nImo the only good parts of the series were:\n\n1. some metaphors\n2. symbolism\n3. character development\n\nJust to conclude, if you watch this movie off pure dopamine its good. If you use your cognitive ability the series is trash. Imo movies like the joker, joker 2 have a lot more depth to the scenes and are significantly better.\n\n(i didn't want to include too many sections that I did enjoy so that you too can enjoy it. Im not shitting on the series just saying what i think of it).\n\nPlease tell me your thoughts on the movie in the comments.",
        "upvotes": 4,
        "comments": 75,
        "media": null,
        "permalink": "/r/netflix/comments/1hmpyl4/squid_game_2_is_trash/"
    },
    {
        "id": "1hmwyrp",
        "author": "PeaOk5697",
        "title": "My problem with La Palma",
        "content": "I will give lt a 5/0. It wasn't really bad, or good in my opinion. The acting could be better and the VFX/CGI wasn't terrible. The storyline was awful with the most unrealistic survival instincts. What bothered me the most was the tsunami hitting the plane. No way anyone would survive that. A good one time watch but they need better writers. What did you think? Also, i recommend watching it in Norwegian and not the dubbed version. If you like it, there is a much better movie named The Wave from 2015. Much better ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hmwyrp/my_problem_with_la_palma/"
    },
    {
        "id": "1hmwvts",
        "author": "Euphoric-Editor-6986",
        "title": "Wrong password and wrong email adress",
        "content": "Hi! So I have a problem. I have a netflix account,and I added a wrong E-mail adresss to my account,and I forgot the password.I want to change my password and Netflix send a code to my phone number but I didn’t get it many times.I write to Netflix,I didn’t get answer and I told the netflix costumer service that \nif it’s necessary, I will write down them to my card number or my full name,or my phone number that is linked to the Netflix account that I can't log into.So I \nI can prove that the account is mine…\nPlease help me because the gmail address is wrong and I can't change it because I don't know the password, so it's taking money from my card unnecessarily….thanks!!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hmwvts/wrong_password_and_wrong_email_adress/"
    },
    {
        "id": "1hn1hpi",
        "author": "treedoghill",
        "title": "Canadian Netflix movies with well done no quick multi cut camera work for  violent action ? ",
        "content": "Stuff like The Man From Nowhere , John Wick and Nobody (although I can’t remember how often the action in Nobody is done clearly Vs. with lots of cuts) . \n\nI’ve found several threads for great movies outside of these listed  ,but after googling 30+ films only those ones I mentioned are on Canadian Netflix .  \n\nI do have Disney and Tubi as well . \n\nSome other good films with the great violent scenes on Netflix are Bone Tomahawk and Brawl In Cell Block 99.  ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hn1hpi/canadian_netflix_movies_with_well_done_no_quick/"
    },
    {
        "id": "1hmwdi4",
        "author": "Alafandri",
        "title": "My thoughts on Squid Game new season",
        "content": "I have just finished watching season 2 of squid game, and well. I think it was short. It was really good tho but the 2 ep less we got made it feel so much shorter and everything happened so slow. I would have wanted more to happen. Get to know more about those clients. See more what everything looks like around that place. I'm not saying that I didn't like it cause I did really love it. I just wanted more to happen. But hey, at least we are getting another season already next year. So that makes stuff better. Thank you for reading all of this. This is just my opinion. Can't wait for season 3. yay!\n\n[random image from google. XD](https://preview.redd.it/wblnf8wlz89e1.jpg?width=1296&amp;format=pjpg&amp;auto=webp&amp;s=b684fdcf412568a216be8b0dfbc403de0c60c555)",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1hmwdi4/my_thoughts_on_squid_game_new_season/"
    },
    {
        "id": "1hmv44y",
        "author": "Shiroyasha466",
        "title": "Help",
        "content": "I keep getting your card is too low on funds error even though I have enough for the monthly payments. Been a member since may . Haven't happened in previous transactions.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hmv44y/help/"
    },
    {
        "id": "1hmq6c9",
        "author": "techfinpro",
        "title": "Netflix Brings ‘Carry-On’ Director Jaume Collet-Serra’s Crime Thriller ‘RUN ALL NIGHT’ to Streaming, After Chart-Busting Success",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hmq6c9/netflix_brings_carryon_director_jaume/"
    },
    {
        "id": "1hn2gkt",
        "author": "Therealscorp1an",
        "title": "What are your honest thoughts on The Crown?",
        "content": "Hello, everyone.\n\nLately I have been trying to find some new series to watch on Netflix and I have heard in the past a lot of talk about The Crown.\n\nI was wondering what some of your opinions on the show are and whether it is worth the watch.\n\nI like shows that are of a similar style to something like Suits, and I have a very fond interest in history and royalty.\n\nSo if you could please leave your honest thoughts, reviews, comments and opinions, that would be really appreciated!\n\nThank you all again!",
        "upvotes": 0,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1hn2gkt/what_are_your_honest_thoughts_on_the_crown/"
    },
    {
        "id": "1hn6kzp",
        "author": "Far_Historian2865",
        "title": "Which season was more disappointing from these 2",
        "content": "GoT S8 or Squid Games S2.\nHonestly GoT became unwatchable already in S7 so I didn't have any high expectations for S8.\nFor Squid Games I was actually very excited just to witness biggest disappointment ever since my cancelled prom in 2020. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hn6kzp/which_season_was_more_disappointing_from_these_2/"
    },
    {
        "id": "1hmu1cp",
        "author": "avgetonas",
        "title": "Password Correct But Also Incorrect",
        "content": "A few months ago i made an account for 2 devices to use with my sister. We both left our home and live in seperate cities and countries. Everything worked fine for a few months, i used the account on my pc she used the account for her pc. \n\nNow i have finally finished the uni and returned to my hometown and since then whenever i try to enter the account on my pc it says that the password for the email is wrong although it is the correct one. I tried it on my phone on the same wifi it works. She can still use the account with no problem. If I try to reset the password through email netflix gives an error \"something went wrong please try again later\". \n\nI believe i somehow f up the devices and now netflix recognises my phone instead of my pc. Anyone had the same problem in the past? Is it a geolocation thing and how do i fix it?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hmu1cp/password_correct_but_also_incorrect/"
    },
    {
        "id": "1hn5wuw",
        "author": "SF6-Manon",
        "title": "SPOILER: My thoughts on Squid Game Season 2",
        "content": "I'm not going to go super in-depth or make this spoiler-heavy but I thought I'd give my honest review on season 2 so... let's begin.\n\nFirst off, what would I rate this season? In comparison to the first season, I'm going to be generous and give it a 6/10. The pacing of the show felt slow at first. Starting off with scenes of Seong Gi-Hun then fast forwarding 2 years later. Pretty much emphasizing that Gi-Hun's on the hunt for the front man/the one in charge of the games to begin with. Puts up money and sends grunts to go on a wild goose chase to find the recruiter he came across in the subway back in season 1. After a long 2 years, they finally spot the recruiter then secretly follows him but things don't go as planned. Stuff happens, Gi-Hun then formulates a plan which failed and now we end up with end getting back into the game. Pretty much the \"I will find you, and I will kill you\" cliche except he doesn't plan on killing the head??... so... yeah. I'll leave it at that.\n\nNow that that's out of the way, let's fast forward. The failed plan that became an even bigger fail since there was a snake amongst him as he planned on going in and infiltrate the island with a group of people. This was realized during the first game that his backup no longer had a trace on him so his backup is... well... back on another goose chase. But instead of finding the recruiter, they're trying to find the island. And that's pretty much all we got out of them. Again, I'm not trying to spoil much.\n\nDuring the first game, Gi-Hun insists on helping everyone make it out in one piece. A lot more survived this time around compared to season one. Cool. After this, we now have a better look at the new players, a lot of which, are either just wimpy or plain annoying/obnoxious. Season 1 had its annoying characters too but they were done in a way where it felt just right and not over the top. A ton of \"high school bully\" type of characters. The new player(s) that were written well enough was the mom &amp; son duo. That's all I can say about the characters.\n\nNow, onto the primary reason people are watching season 2, the games. We're first introduced with red light green light since it's a staple of the show. The games that followed after that were different which was quite nice. But that's where it kind of stops being nice. The game now introduced a new thing where players could vote to either stay or leave after EACH game. If I'm going to be honest, I feel like this took away what made season 1 so good. The weight/burden of choice. In season one, players had only ONE opportunity to vote, it made scenarios a lot more impactful and gave the players an option of joining. With that, players bared the weight of \"the point of no return\". Once you were in, you're staying until the end. In this season, with players given the option to vote after every round, it eliminated that impact and made it more of a \"Don't join them, join me\" ordeal. Pair that with the high school bullying, you're left with kinda of an \"meh\" feeling. There isn't much fear since players can just stay for the money or they'll just pair with Gi-hun since he's played the game before. Follow the leader. \n\nOnce the games began, the pace suddenly sped up, leaving less room for you to have any sort of attachment to some characters. The games felt rushed/sped up making them not as fun and suspenseful to watch. With that, we're then back to scenes with Gi-Hun's muscle for hire are still looking for a way in and very little clue as to what's up with Triangle 11. The ending, being Gi-Hun's final plan which ALSO fails. Lots of gun fire, players are \"offed\", aaaaand we're left with a cliffhanger. \n\n  \nHonestly, I would have preferred they made an additional 2-3 episodes to flesh it out a bit more and conclude it all as a whole but nope... many questions a left unanswered and it seems we may have to wait for season 3. Wasn't a bad season, but it wasn't exactly great either. To those who are well-versed with celebrities in K-POP, you may enjoy it a bit more, maybe. Even then, it was okay. I'm not sure if I'll stick around for season 3 but yeah... what are your thoughts?",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1hn5wuw/spoiler_my_thoughts_on_squid_game_season_2/"
    }
]