[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1p9a8zh",
        "author": "dehia_anne",
        "title": "Stranger Things Season 5: Is it just me or…",
        "content": "Is it just me or has it been hard to get into season 5? We all know there’s sooooo much time in between seasons. I didn’t have it in me to re-binge the first four seasons, so I read recaps then started season 5 earlier today. \n\nI’m just getting lost in all of the nitty gritty details. Maybe my attention span isn’t what it used to be, but I just am not getting into this last season like previous seasons (and I was once a diehard ST fan). Just me?",
        "upvotes": 235,
        "comments": 331,
        "media": null,
        "permalink": "/r/netflix/comments/1p9a8zh/stranger_things_season_5_is_it_just_me_or/"
    },
    {
        "id": "1p9rkio",
        "author": "Temporary_Page_6476",
        "title": "How I get it to stop automatically playing?!?",
        "content": "I have no idea if this is because of an update, but Netflix used to have an option where you could see the info about a show or movie. You clicked on the show and it sent you to the info page and a preview would play. Now it automatically plays it and you have to go find the info button. This is making me upset because I have like 50 things in my recent watch with this setting. I turned off autoplay previews while browsing but that’s not what I wanted. Someone please help me.",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1p9rkio/how_i_get_it_to_stop_automatically_playing/"
    },
    {
        "id": "1p9i4en",
        "author": "casualnihilist_112",
        "title": "(SPOILERS) The Complete Stranger Things Season 5 Theory",
        "content": "Hey everyone,\n\nSo here is my full theory on how I think Season 5 is building toward the final showdown. I am connecting everything from the show, the new season, The First Shadow play, and the patterns we have seen over the years. I will go from the beginning and build the whole picture step by step so it flows and makes sense.\n\n⸻\n\n1. Vecna and Henry’s Origin and Why He Was Not Born Evil\n\nTo me, one of the most important things is the idea that Henry was not born evil. There are two pieces of canon that support this.\n\nThe first is the stage play, The First Shadow. In the play, we see Henry as a strange kid, but he is not violent or murderous. He only changes after an incident in the cave. He interacts with experimental equipment from Brenner’s project, and that accident sends him into Dimension X for the first time. That is the first moment where he is exposed to pure Dimension X energy and Mind Flayer particles.\n\nThe second piece of evidence comes from the show itself. In Season 2, when Will is possessed by the Mind Flayer, his behavior changes instantly. He becomes cruel, manipulative and cold. The scene where he leads the soldiers into the Demodogs is a perfect example. Will would never do that under normal circumstances. That tells us the Mind Flayer particles do not just control you physically. They change the way you think and feel.\n\nSo when Henry gets exposed in the cave, the same thing happens to him. He comes back from Dimension X with a completely different worldview. He starts seeing humans as lesser beings. He starts having thoughts about domination and reshaping reality. All of this lines up with the Mind Flayer’s ideology, not with Henry’s original personality.\n\nThis tells me Henry was not inherently evil. He was corrupted by Dimension X.\n\n⸻\n\n2. The Cave and Why Vecna Is Afraid of It\n\nThis detail is one of the most important clues in Season 5. Vecna refusing to enter that cave is not random at all.\n\nHere is the corrected canon interpretation based on the play and the show.\n\nIn The First Shadow, the cave is the exact place where Henry gets exposed to Dimension X. That is where the equipment malfunction happens. That is where he gets pulled in. That is where the corruption begins.\n\nSo when Vecna avoids that cave many years later, that fear comes from Henry buried deep inside him. That moment was traumatic. It was the moment he lost control of his life and mind. The fact that he still hesitates shows that Henry is still inside Vecna. This supports the idea that he was not born evil. He still has human fear.\n\nThere is also a second meaning here. Vecna’s fear of the cave hints at something else being inside Dimension X that even he does not want to face. If he were the top villain, he would not fear walking into any place. The fact that he avoids the location that connects to Dimension X tells us that there is something older and more dangerous than him.\n\nThis ties into the Dungeons and Dragons idea of the Thessalhydra and the possibility that the true final villain is the ancient creature that corrupted Henry in the first place.\n\nSo the cave symbolizes both Henry’s corruption and the existence of a bigger threat.\n\n⸻\n\n3. Will’s Powers and Why Will Is More Important Than Anyone Realizes\n\nSeason 5 finally makes it obvious that Will is not just connected to the hive mind. He has actual psychic abilities. These abilities come from all of the exposure he had in Season 1 and Season 2. He breathed in particles. He lived in the Upside Down longer than anyone else. He hosted the shadow monster inside him.\n\nHis connection is permanent, and it is deeper than Eleven’s.\n\nWhen Will kills the Demogorgons using telekinesis, it is real telekinesis. His nose bleeds which is what happens when someone uses psychic force. That is something we only saw with Henry, Eleven and the other Hawkins Lab kids.\n\nThe difference is that Will’s power comes from the hive. He amplifies his own psychic output with the network of Dimension X. That is why he can do it from miles away. He is basically using the hive as a power source.\n\nThis is why Vecna has always sensed Will. Will has access to the same pathways that Vecna uses. Will is the internal counter to Vecna’s control. He is the one person who can fight Vecna from inside the hive while Eleven fights from the outside.\n\n⸻\n\n4. Kali and Why She Still Matters\n\nKali, or Eight, being present in Season 5 and in the Upside Down base is a huge sign. Kali was always the next strongest psychic after Eleven and Henry. Her illusion abilities might be the only thing that can shield the kids from Vecna or confuse whatever creature is coming from Dimension X.\n\nKali was also created through the same project as Henry and Eleven, which lines up with the idea that children are the best psychic conduits. If there is going to be a final psychic battle, Kali has a real role in it.\n\n⸻\n\n5. The Kidnapped Children and Vecna’s Lair\n\nSeason 5 shows us that Vecna has kidnapped twelve children. We see this through Will’s visions. Vecna even tells Will that he likes the idea of children being intermediates.\n\nThis lines up with everything we know about the Hawkins Lab experiments. Children have more psychic sensitivity. Their minds are easier to link to other dimensions. Vecna wants to use these twelve kids as psychic amplifiers to open something big. The number twelve matters because it fits a pattern of ritualistic or structural stability that we have seen in the Upside Down.\n\nThis connects directly to the wormhole idea.\n\n⸻\n\n6. Wormhole Theory and the Fleshy Wall Around the Upside Down\n\nOne of the best scenes in Season 5 is when Dustin, Nancy, Steve and Jonathan break into the UD and crash into the fleshy wall surrounding Hawkins.. Dustin realizes that the wall is perfectly circular around Hawkins and that the center of the circle is Hawkins Lab. This lines up with the original gate from 1979. The Upside Down formed as a snapshot frozen in time from that event.\n\nWe also have the science teacher giving a lesson on wormholes. This is the Duffers telling us that we are dealing with a tunnel between realities. Which confirms cannon from the First Shadow. The Upside Down is not a world by itself. It is a bridge. A halfway point. A buffer.\n\nThen Will makes that red swirling drawing of Vecna’s lair. It looks exactly like the wormhole diagram from the science class. All of this is pointing toward the same direction.\n\nThe fleshy wall is blocking the path. It is designed to contain Dimension X energy so it does not spill out completely.\n\n⸻\n\n7. The Full Wormhole Plan and Vecna’s Real Goal\n\nVecna does not want another small portal. That is not enough. Demogorgons are dangerous but too slow. Vecna wants a direct wormhole from Dimension X to the Rightside Up.\n\nTo do that he needs to break the wall around the Upside Down. He needs the psychic power of the twelve kids. He needs the full hive network. He needs to weaken the membrane so Dimension X can push through.\n\nThis wormhole would allow the ultimate evil to enter. It could be the Thessalhydra or another massive creature from Dimension X. Vecna is building the bridge to bring this thing here. He is not the final villain. He is the one preparing the way for the real one.\n\nEpisode by Episode Breakdown and the Full Final Showdown\n\n(Part 2 of 2)\n\nNow that all the background is clear, everything starts falling into place when you look at how each episode moves the story toward the final fight in the Rightside Up.\n\nLet me go episode by episode and connect the dots.\n\n⸻\n\nEpisode 5: Shock Jock\n\nBy the time we reach this episode, the group already knows that the Upside Down is surrounded by that fleshy circular wall. Dustin figured that out earlier when they crashed into it. He also figured out that the center of that wall is Hawkins Lab, and that the wall is acting like a barrier to keep Vecna’s lair hidden and stop El from reaching the kids. It is also stopping something from Dimension X from leaking fully into our world.\n\nIn Shock Jock, the gang is not randomly sending out a big radio wave. They are doing it because they need to weaken that fleshy wall. They know Vecna has twelve children held inside his lair. Will has seen this in his visions. These kids are being used as psychic amplifiers. The gang understands that unless they break through the wall, they cannot reach Vecna’s lair and rescue the children.\n\nThe red radio wave is the attempt to blast the membrane. (Maybe). It will weaken. It might open just enough for them to get partial access. This is not the full wormhole yet. This is just the gang trying to break the blockade around the Upside Down.\n\nInside Hawkins Lab, they start finding clues. They discover old files, old devices, and remnants of Brenner’s experiments that hint at Dimension X being the real origin point. This confirms Dustin’s wormhole theory. It also matches what we saw in The First Shadow. The lab was messing with dimensional energy long before anyone realized what it was capable of.\n\nShock Jock ends with the barrier weakened but not destroyed. The gang realizes that Vecna is building something on the other side that they cannot fully see yet. Will senses that something massive is coming. The tension is now building toward a direct dimensional breach.\n\n⸻\n\nEpisode 6: Escape from Camazotz\n\nThis episode focuses heavily on Max and Holly. Holly has been reading A Wrinkle in Time earlier in the season. She uses the name Camazotz to describe the place where Max is stuck. Camazotz in that book is a world of mind control and psychic domination, which is a perfect description of Vecna’s mental realm.\n\nMax is trapped inside Vecna’s mind. Holly can see this because she has been exposed to particles earlier in the season, which has made her sensitive. It is not that Holly suddenly has full powers like Eleven or Henry, but she has enough psychic awareness to see and understand the mental traps.\n\n Max has already helped Holly navigate Vecna’s illusions. This episode reveals how powerful Vecna’s mind really is. He has built entire environments inside Camazotz that reflect his trauma, his corruption and the influence of Dimension X.\n\nAs Max and Holly fight their way out, their escape weakens Vecna. When someone escapes his mental realm, it forces him to redirect energy. That energy has to come from somewhere. Since Vecna is trying to build the wormhole during this same time, their escape disrupts his momentum.\n\nThis episode is important because it shows that Vecna can be weakened psychologically, not just physically. It also shows how Holly is now part of the larger fight. She is sensitive to Dimension X energy, and she becomes one of the keys to breaking Vecna’s control over the kids he kidnapped.\n\n⸻\n\nEpisode 7: The Bridge\n\nThis is the turning point episode. The title says it all. The Bridge is the moment where Vecna’s plan starts to succeed.\n\nWith the children acting as psychic nodes, Vecna begins to open a direct connection between Dimension X and the Rightside Up. This is not a portal like the ones we saw before. This is the wormhole Dustin was talking about. This is the tunnel between realities.\n\nThe membrane around the Upside Down starts tearing. Hawkins Lab begins to crack open. The air distorts. The sky changes color. Will’s connection to the hive mind becomes overwhelming. He starts seeing shapes and creatures from Dimension X that are trying to push through.\n\nThis is the episode where Will fully taps into the hive. We saw earlier that Will can now use telekinesis through the network. In The Bridge, he tries to stop Vecna from inside the hive, but Vecna fights back. This is the first time we see the two of them clash directly on the psychic plane.\n\nEleven and the others are fighting on the outside while Will fights on the inside. Kali might help counter illusions that Vecna uses against them. The children in Vecna’s lair begin to glow with Dimension X energy as the wormhole starts forming. The ground in Hawkins shakes. The barrier becomes thin enough that shadows start rising behind it.\n\nAt the end of the episode, the wormhole finally breaks open. Something massive is on the other side. A silhouette that looks like the Thessalhydra appears in the sky. Hawkins begins to collapse. This is where all the tension explodes into the final episode.\n\n⸻\n\nEpisode 8: The Rightside Up\n\nThe final showdown does not happen in the Upside Down. It happens in our world. That is why the episode is called The Rightside Up. The wormhole is fully open now. Dimension X energy floods into Hawkins. Dark clouds, red lightning, and shadow forms start pouring into our world.\n\nVecna steps into the Rightside Up. The children he kidnapped are still amplifying his power. The Thessalhydra or whatever ancient creature from Dimension X begins to break through the wormhole. Hawkins is almost unrecognizable.\n\nThis is where everything comes together.\n\nEleven fights Vecna physically.\nWill fights Vecna through the hive.\nKali uses her illusions to protect the group and distract the monster.\nHolly helps Max stay mentally grounded so Vecna cannot pull her back.\nThe gang fights the creatures entering Hawkins.\n\nThere is also a real possibility that Vecna does not remain loyal to the greater evil. When he sees the creature coming through, the same fear from the cave returns. He realizes he was never in control. He was only the door opener. This could push him to turn against the bigger villain during the final moments.\n\nThe finale ends with the wormhole collapsing after the ultimate villain is defeated through a combination of Eleven’s power, Will’s hive control, and the others fighting on the ground. The Upside Down stops functioning as a separate dimension. The final battle ends in the Rightside Up, which ties back perfectly to the episode title.\n",
        "upvotes": 23,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1p9i4en/spoilers_the_complete_stranger_things_season_5/"
    },
    {
        "id": "1p8vogh",
        "author": "Blue-Sea2255",
        "title": "Kevin hart special acting my age - it's worst than the war of the worlds ice cube movie.",
        "content": "\nIt’s terrible. I’m stuck eating the popcorn I made for this show while aimlessly watching random YouTube videos.\n\nHe's trying so hard, but those made up stories only make everything worse.",
        "upvotes": 247,
        "comments": 126,
        "media": null,
        "permalink": "/r/netflix/comments/1p8vogh/kevin_hart_special_acting_my_age_its_worst_than/"
    },
    {
        "id": "1p8yhn5",
        "author": "MelloCello7",
        "title": "Genuine question: are you guys really okay with paying for a service and still getting ads?",
        "content": "Its been a looong time since I've used a Netflix account, (I've been been using better alternatives) but since the release of one of the goats Stranger Things, I was, like you know what, lets get an account for old times sake, only to find that the modest 7.99 had ballooned out to 17.99 a month, and the familiar payed basic tier had become riddled with Ads... Payed streaming service with ads was something I simply could not believe. \n\nThis was the most fundamental difference between Cable and Internet: you don't pay for ads. Needless to say I'm back to my usual options, but for those of you who do, are you guys really truly okay with paying for ads?",
        "upvotes": 145,
        "comments": 249,
        "media": null,
        "permalink": "/r/netflix/comments/1p8yhn5/genuine_question_are_you_guys_really_okay_with/"
    },
    {
        "id": "1p9qklc",
        "author": "AlphaKoche",
        "title": "Is there a way to download a netflix episode?",
        "content": "I'm a french english teacher looking to make an oral comprehension out of a part of a netflix episode (ep 8 of the Usher series). I've tried downloading the episode on my pc or my phone through the app but it doesn't work. online converters are shady. Any idea? ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1p9qklc/is_there_a_way_to_download_a_netflix_episode/"
    },
    {
        "id": "1p9q1ql",
        "author": "Certified_Hummus_Boy",
        "title": "Horror movie suggestions",
        "content": "Hey yall, I just got Netflix and am looking for horror movie suggestions.     Even if they arent good, I’d love to have your thoughts because bad horror movies are still good lol.  Thank you all",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1p9q1ql/horror_movie_suggestions/"
    },
    {
        "id": "1p9gv1q",
        "author": "Sad_Masterpiece6137",
        "title": "Suggest me something",
        "content": "I’m honestly feeling really bored and a bit lonely after rewatching Stranger Things again. That Season 5 ending hit me all over again, and now I’m just stuck wondering what to watch next. I’m looking for something that actually feels like Stranger Things because nothing else really matches that mix of mystery, friendship, and weird supernatural stuff.\n\nAnd the wait for Stranger Things Vol 2 is still 26 days, which feels painfully long right now. I keep thinking about the characters, the whole vibe, the music, everything, and it’s making the wait even worse.\n\nIf anyone has a show that gives even a little bit of that same feeling, I’d really appreciate the suggestions. Otherwise I’ll probably end up rewatching it again out of desperation.\n",
        "upvotes": 10,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1p9gv1q/suggest_me_something/"
    },
    {
        "id": "1p9pxdi",
        "author": "QizaiBrown",
        "title": "Stranger Things Season 5 doesn't turn on Dolby Vision, all other seasons do",
        "content": "Don't know if this is happening only to me. \nApparently ALL stranger things seasons turn on dolby vision on my bravia 7 except for season 5.\nWhen playing season 5 dolby vision option is not showing. I tried to restart my television several times to no avail.\nDoes anyone have the same issue?\n\nThank you.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1p9pxdi/stranger_things_season_5_doesnt_turn_on_dolby/"
    },
    {
        "id": "1p8znc8",
        "author": "peoplemagazine",
        "title": "Netflix Actor Tony Germano Dies at 55 After Fatal Fall in Brazil: 'His Absence Will Be Deeply Felt'",
        "content": "",
        "upvotes": 43,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p8znc8/netflix_actor_tony_germano_dies_at_55_after_fatal/"
    },
    {
        "id": "1p8x845",
        "author": "winnneer",
        "title": "I was in depression for most of my life so i never watched any shows/movies. Recommend me some that i must watch before i die",
        "content": "My therapy is working and i am slowing gaining interest in the world around me so i took a Netflix subscription hoping to watch shows and movies and talk about them with others to cure and help in my depression journey. Please let me know shows/movies i must watch… Thank you &lt;3",
        "upvotes": 57,
        "comments": 90,
        "media": null,
        "permalink": "/r/netflix/comments/1p8x845/i_was_in_depression_for_most_of_my_life_so_i/"
    },
    {
        "id": "1p9kjsm",
        "author": "qsk8r",
        "title": "The Beast In Me intro",
        "content": "Does anyone know what other show that intro piece has been used in - just that strange alone guitar pluck or whatever it is. I've definitely heard it in something else. I thought it might have been a movie like 'Get Out' or 'Us' or something. It's bugging the hell out of me. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1p9kjsm/the_beast_in_me_intro/"
    },
    {
        "id": "1p9kfos",
        "author": "Whosachicken",
        "title": "Netflix keeps pausing a few minutes in. Tried everything! Help!!",
        "content": "I am at my wits end. Two days ago my Netflix started to freeze within 5-10 mins of watching. Maybe up to 20 if I’m lucky. It’ll just be spinning at 0%. \nI thought.. well my firestick is old let me replace that. Brand new one, same issue. Ok the tv is kind of old, buy a new one. I tried to sign into Netflix directly to the FireTV. Same thing. Plugged in the firestick. Same thing.\nTold it to forget my internet connection and signed in again. Worked for like 40 mins before it started again and now it’s back to 5 mins. Restarted both my router and modem and same thing. Hulu, Prime, Disney.. all running totally fine. \nAnyone have any suggestions? Myself and ChatGPT are out of ideas. ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1p9kfos/netflix_keeps_pausing_a_few_minutes_in_tried/"
    },
    {
        "id": "1p9lqxz",
        "author": "SecretEarl",
        "title": "Just finished watching suits and am looking for sum similarly light to watch",
        "content": "Suits was such a good time passer and not overly dark or emotional. Very easy to watch. Im looking for sum similar. Ive also watched the good place and ghosts, and they were pretty good too.",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1p9lqxz/just_finished_watching_suits_and_am_looking_for/"
    },
    {
        "id": "1p85gri",
        "author": "pleasestoptalkin",
        "title": "Millie Bobby Brown takes me out of every Stranger Things scene she’s in",
        "content": "I don’t know if it’s the bad acting or the fact she’s a grown woman, who has had work done on her face, playing a little girl, but I just start laughing every time she’s on screen. If David Harbour really did snap at her, I get it because it seems like she stopped trying and their emotional scenes together are really bad. ",
        "upvotes": 2280,
        "comments": 742,
        "media": null,
        "permalink": "/r/netflix/comments/1p85gri/millie_bobby_brown_takes_me_out_of_every_stranger/"
    },
    {
        "id": "1p9inj7",
        "author": "Johndoe13370",
        "title": "Absentia: Why they had to make Emily that one co worker who sleeps with everyone",
        "content": "this why i don't trust works relationships 😂 it so easy to catch feelings with people at jobs, how yall couples manage to do this when your partner at works? \n\nother then my funny rant 😂 overall show was good i feel like season 3 ending it was too easy to catch the bad guys like they didn't put up a fight ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p9inj7/absentia_why_they_had_to_make_emily_that_one_co/"
    },
    {
        "id": "1p9eidt",
        "author": "LifeguardDry1277",
        "title": "why is my old icon not showing up in my history??",
        "content": "i always though you could change the icon and the previous ones would show up in your icon history. i had the old demogorgan from stranger things and i can’t find it in my history when i changed it",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p9eidt/why_is_my_old_icon_not_showing_up_in_my_history/"
    },
    {
        "id": "1p99m43",
        "author": "hailey998",
        "title": "Best Sci-Movies or Shows?",
        "content": "Particularly, parallel universes, alternate realities, and time-travel shows. I loved Sliders very much; there's been nothing like it for me since... and it's been many years. I did enjoy Dark Matter and The Man in the High Castle, but are there any others worth watching?",
        "upvotes": 4,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1p99m43/best_scimovies_or_shows/"
    },
    {
        "id": "1p9dkuh",
        "author": "CarryFantastic6990",
        "title": "Amsterdam Empire",
        "content": "Did anyone see this series?  If so, how did you like it?  I watched it and found it amusing.  It stars Famke Janssen, and it was nice seeing her act in her native language. \n\nSynopsis: When the affair of Jack, the wealthy and notorious founder of the Jackal coffee shop empire, comes to light, his wife, Betty, becomes his greatest enemy; she devises a plan to ruin him and take his empire away from him.  \n\n[Trailer for those interested](https://www.youtube.com/watch?v=d8DOm2D_72U)",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p9dkuh/amsterdam_empire/"
    },
    {
        "id": "1p9hdeu",
        "author": "JohnnytheGreatX",
        "title": "Can't connect to netflix",
        "content": "Hi,\n\nNetflix suddenly stopped working on my insignia TV.  It was working yestwrday, but I am getting an error message before I even get to the login screen .  \n\nIt just says \"error.  Sorry we could not reach the Netflix service.  Please check network settings to connect to an available network and use Netflix. -100\".\n\nI am connected to the internet, other apps work.  Does anyone have any suggestions?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p9hdeu/cant_connect_to_netflix/"
    },
    {
        "id": "1p915vo",
        "author": "RiskAndReason",
        "title": "What are we watching today? 🫂",
        "content": "Is everybody focused on Stranger Things? What’s on your watchlist tonight, and would you recommend it?\n\nI’m looking for something, whether it’s a movie, a documentary or a fresh series to dive into.",
        "upvotes": 9,
        "comments": 56,
        "media": null,
        "permalink": "/r/netflix/comments/1p915vo/what_are_we_watching_today/"
    },
    {
        "id": "1p9grt7",
        "author": "harpreetthind",
        "title": "Question about movie",
        "content": "What does everybody think of the haunting of Bly Manor started watching it recently?\nWhat’s everybody’s thoughts on this? Does everybody enjoy it so far I’m enjoying it.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p9grt7/question_about_movie/"
    },
    {
        "id": "1p9g8c7",
        "author": "New_Cardiologist_539",
        "title": "When's Three Popes coming out?",
        "content": "What you waiting for Netflix, the script is already out there\n\nCancel Game of Thrones and make this",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p9g8c7/whens_three_popes_coming_out/"
    },
    {
        "id": "1p8pngo",
        "author": "ThePale99",
        "title": "Train Dreams",
        "content": "Watched Train Dreams and I wasn't expecting much but heard good things here and there and it hit me hard how incredibly Beautiful it is it's truly something special.",
        "upvotes": 35,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1p8pngo/train_dreams/"
    },
    {
        "id": "1p8tpoh",
        "author": "RiceResident308",
        "title": "Netflix editing/cutting movies ?",
        "content": "I just rewatched Mr. &amp; Mrs. Smith on Netflix. As its one of my favourite movies I've seen it quite a few times already including television and Dvd.\n\nAnd what i noticed on the Netflix version is that the sex scene between the two main characters ( played by Brad Pitt and Angelina Jolie ) is significantly shortened. Now it just looks akward in my opinion and it's obvious that it's altered.\n\nMy question is whether this is a common Netflix thing ? In some cases if a sex scene is too long or too explicit i would understand their reason. But in this case neither of the two applies.\n\n",
        "upvotes": 16,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1p8tpoh/netflix_editingcutting_movies/"
    },
    {
        "id": "1p9elj8",
        "author": "Devir_39",
        "title": "The cast screen to TV option is not appearing on my device",
        "content": "I use an Android cell phone and some options including screen transmission are simply disabled on my cell phone, the curious thing is that my plan is not the most basic with ads, it is the standard version, without ads, on another iPhone device, the option to transmit screen appears, this problem is only happening on my Android cell phone",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1p9elj8/the_cast_screen_to_tv_option_is_not_appearing_on/"
    },
    {
        "id": "1p90jn8",
        "author": "v2ikeemi",
        "title": "Netflix cuts straight to episode/movie instead of episodes list",
        "content": "Does anyone else have this issue? Recently my Netflix just starts playing the movie/show with no option to see the list of pisodes first.. So frustrating. ​Is there a way to change this somewhere? ",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p90jn8/netflix_cuts_straight_to_episodemovie_instead_of/"
    },
    {
        "id": "1p9cgc9",
        "author": "Darklaw_Game",
        "title": "WSIW",
        "content": "Hi everyone! A Teen Male here wondering for shows to watch, Enjoyed “Locke and key” and Squid game (not as much as some episodes had been slower pace) and as a gamer who watches shows whenever playing video games, I have ran out of shows to watch, I like thrillers (not too scary but like maybe Locke and key or squid game level thriller or maybe a little higher) don’t care for romance, I enjoy YA books if that helps, prefer shows over movies but will watch movies",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p9cgc9/wsiw/"
    }
]