[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1k71md4",
        "author": "nickbruckman",
        "title": "I’m Nicholas Bruckman — director of the new documentary on Netflix, MINTED: The Rise (and Fall?) of the NFT  — AMA on 4/28 @ 4pm ET!",
        "content": "What’s up r/netflix! I’m Nick, director of *MINTED*, now streaming on Netflix worldwide (well, North America, the UK, Australia/New Zealand, and Africa!)\n\nThe film is a front-row seat to the explosive rise of NFTs becoming a $40 billion digital gold rush, all the way through the market's dramatic crash. We spent years embedded in the digital art and crypto worlds, from NFT multimillionaires flipping JPEGs to the pioneering artists flipping the script on the traditional art market, plus the critics and journalists digging into the good, the bad, and bizarre of this new frontier.\n\nWhether you love or hate NFTs, I hope the film sparks some big questions about how art, tech, and finance are colliding. Beyond NFTs, it’s about pioneering artists trying to not just survive, but lead the way forward in how we use new technology as a society.\n\nWe premiered *Minted* at the Tribeca Film Festival, and its been a wild ride since. So whether you’re a collector, a skeptic, or just a fellow documentary nerd — AMA!\n\nproof: [https://www.instagram.com/p/DI12rZQz1BX](https://www.instagram.com/p/DI12rZQz1BX)\n\nnetflix: [https://www.netflix.com/title/81993558](https://www.netflix.com/title/81993558)",
        "upvotes": 17,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1k71md4/im_nicholas_bruckman_director_of_the_new/"
    },
    {
        "id": "1kfvs35",
        "author": "RGBLEDWill",
        "title": "Netflix allows children to upgrade plans.",
        "content": "Got home and saw an email from Netflix saying my account had been upgraded to the $25 4K plan. Seems one of my kids got a prompt and upgraded (from their child account). Netflix support was like, “yep, they can do that.” Wild",
        "upvotes": 30,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1kfvs35/netflix_allows_children_to_upgrade_plans/"
    },
    {
        "id": "1kfxzgi",
        "author": "Working-Blueberry-18",
        "title": "Why is Netflix suggesting these terrible games (desktop specifically)?",
        "content": "I understand from other posts that some of the mobile games are actually pretty good, and they don't have any in-game purchases unlike many other mobile games.\n\nHOWEVER\n\nThe desktop (browser) game selection is extremely limited. I'm just seeing 14 games? They're all really horrible, and seem to be intended for a much younger audience (what made Netflix think I'd enjoy these based on my viewing history?). \n\nOne of the games was literally intended to help very young readers. Each level consists of walking on top of the text for a 1\\~3 sentences story, and interacting with a few of the words along the way.\n\nMost of what I tried (5-6) all seemed like something a 3rd year computer science student did for a project-class over a quarter. They're taking up the second row as well as the background feature at the top. Seems like a really poor landing page experience.",
        "upvotes": 16,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kfxzgi/why_is_netflix_suggesting_these_terrible_games/"
    },
    {
        "id": "1kf8hlf",
        "author": "Sweaty-Toe-6211",
        "title": "‘TRAIN TO BUSAN’ and its Sequel ‘PENINSULA’ are both now Streaming on Netflix",
        "content": "",
        "upvotes": 201,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1kf8hlf/train_to_busan_and_its_sequel_peninsula_are_both/"
    },
    {
        "id": "1kfomrn",
        "author": "Upstairs_Hat_9131",
        "title": "Turning Point: the Vietnam War",
        "content": "Has anyone else watched this? I just watched the first episode And Im amazed at how little I learned about it in school.\n\nAnybody seen it and see parallels similar things happening?",
        "upvotes": 25,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1kfomrn/turning_point_the_vietnam_war/"
    },
    {
        "id": "1kfi7cj",
        "author": "GburnsJournal_",
        "title": "Netflix's latest series dubbed 'the next Walking Dead meets The Last of Us'",
        "content": "What do yous think of the new Netflix show The Eternaut, that just came out last week ?? ",
        "upvotes": 42,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1kfi7cj/netflixs_latest_series_dubbed_the_next_walking/"
    },
    {
        "id": "1kfz7u7",
        "author": "TA_loveafterdivorce",
        "title": "Keep getting “you’re not part of the household”",
        "content": "I typically use my phone to watch Netflix at work. For about 2 weeks (new phone), everything was fine. Suddenly, I got the “you’re not part of the X household” notification. Since it’s my husband’s email associated with the account, I didn’t try to get a code. The next day, I logged in to Netflix while at home using the WiFi. At work, I started watching a show and everything was working. I decided to change shows and the notification popped up again. I tried logging out and logging back in. But, I still get the same thing. What can I do??",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kfz7u7/keep_getting_youre_not_part_of_the_household/"
    },
    {
        "id": "1kfvdil",
        "author": "AnagnorisisForMe",
        "title": "The Seat",
        "content": "Really liked this movie on Mercedes new F1 driver Kimi Antonelli. To have gotten pole position in one of his first ever F1 races recently (Miami Grand Prix) is really impressive. I think he's got what it takes to win a driver's championship one day.",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kfvdil/the_seat/"
    },
    {
        "id": "1kfbkny",
        "author": "Internal-Bed-3150",
        "title": "The Eternaut lands season 2 renewal on Netflix as show's future determined",
        "content": "",
        "upvotes": 48,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1kfbkny/the_eternaut_lands_season_2_renewal_on_netflix_as/"
    },
    {
        "id": "1kfsxs2",
        "author": "Purple-Suspect6214",
        "title": "the society: ending theories",
        "content": "the society: i know i’m a little late to the show, but i wanted to hear the best ending theories that you guys have… it’s a really good show, it’s a shame it was cut off like that ",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kfsxs2/the_society_ending_theories/"
    },
    {
        "id": "1kfvwse",
        "author": "SnapDragon_2018",
        "title": "Netflix Watchlist/history glitches",
        "content": "Am I the only one who's Netflix glitches out and constantly doesn't save my place in the episode I was watching? Like for example I'm currently watching North of North and I'll be in the middle of episode 6, pause it, turn the TV off and go back to watch it the next day and it'll start me all over on episode 4 that I hadn't watched in days. Or for example ugly betty if I'm watching that and I go to Netflix to watch it, it won't even be in my watch history and I'll have to search it just to find it and watch it. Netflix is constantly doing this to me on all sorts of shows and movies on phones, laptops and TVs. I pay for Netflix but I have the cheapest tier with commercials. It makes me wonder if these glitches happen to make me try and upgrade?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kfvwse/netflix_watchlisthistory_glitches/"
    },
    {
        "id": "1kfpkcc",
        "author": "Sudden_Pop_2279",
        "title": "Squid Game: Season 3 | Official Teaser | Netflix",
        "content": "",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kfpkcc/squid_game_season_3_official_teaser_netflix/"
    },
    {
        "id": "1kfyohg",
        "author": "Successful_Sugar8882",
        "title": "Mark Twain Award for Comedy",
        "content": "Hoping that Netflix has contracted to air the ceremony in the future…but more curious who you think should receive the next award and/or be awarded within 5 years?!\n\nPersonally, having seen many of the “best standup comedians” in person and watching comedic films, here is my list of 5 people who should receive a Mark Twain Prize next within five years:\n\n-Bill Burr\n-Bill Burr\n-Bill Burr\n-Bill Burr\n-Bill Burr\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kfyohg/mark_twain_award_for_comedy/"
    },
    {
        "id": "1kfupp4",
        "author": "MqAbillion",
        "title": "Four Seasons - decent but I hoped for more comedy",
        "content": "I did enjoy this show, but it wasn’t what I was hoping for. Some good laughs, but not enough. Liz Lemon, Michael Scott, Trudy Weigel, and Paul/Jenna? Come ON, that’s a comedic actor fever dream. \n\nI guess I expected more over the top comedy like 30 Rock/Reno911\n\nI’ll still watch anything with Tina Fey or Kerry Kenney cuz they are comedy goddesses, I guess I just wish they went more wacky with it ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kfupp4/four_seasons_decent_but_i_hoped_for_more_comedy/"
    },
    {
        "id": "1kfjclj",
        "author": "Empty-Instruction282",
        "title": "Asterix &amp; Obelix: Smashing the Empire on Netflix!",
        "content": "Asterix is a beloved French comic book series created by writer René Goscinny and illustrator Albert Uderzo, first published in 1959. Set in 50 BC, it follows the adventures of a small village of indomitable Gauls as they resist Roman occupation. The titular hero, Asterix, is a diminutive but cunning warrior who, alongside his loyal, super-strong friend Obelix, defends their village with wit, bravery, and a magic potion brewed by the druid Getafix, granting temporary superhuman strength. Obelix, perpetually strong due to falling into the potion as a child, carries a menhir and loves wild boar and brawls.The series blends slapstick humor, clever wordplay, and historical satire, poking fun at Roman bureaucracy and cultural stereotypes while celebrating Gaulish camaraderie. Each album sees Asterix and Obelix embark on quests—whether thwarting Caesar’s schemes, exploring foreign lands like Britain or Egypt, or protecting their village from internal strife. The comics are renowned for their vibrant art, memorable characters like the tone-deaf bard Cacofonix, and timeless appeal across generations. Translated into over 100 languages, Asterix remains a cultural icon with comic books fans around the world!",
        "upvotes": 9,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kfjclj/asterix_obelix_smashing_the_empire_on_netflix/"
    },
    {
        "id": "1kfgp7x",
        "author": "PixiePower65",
        "title": "Can I gift Netflix to my 85 year old mother",
        "content": "Dont want her to have any view / access into my credit card.  But want to gift her a year subscription fully paid. \n\nAppreciate suggestions.  ",
        "upvotes": 8,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1kfgp7x/can_i_gift_netflix_to_my_85_year_old_mother/"
    },
    {
        "id": "1kfwcrc",
        "author": "Honest-Habit-1377",
        "title": "Does anyone recognize this poster from 13 Reasons why?",
        "content": "The poster is seen in season 1, episode 9- timestamp 57:23. I am searching for the full image. Any leads are helpful. ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kfwcrc/does_anyone_recognize_this_poster_from_13_reasons/"
    },
    {
        "id": "1kfrvub",
        "author": "DaVincisCoded",
        "title": "The Biggest Heist Ever Soundtrack",
        "content": "I just watched the first season of The Diamond Heist on Netflix. There's an upbeat song playing (first episode) with the lyrics along the line of, \"go through the cash and stack em up...\" But for the life of my I can't find it...even tried Shazam but nothing. Any ideas, anyone? Thanks!",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1kfrvub/the_biggest_heist_ever_soundtrack/"
    },
    {
        "id": "1kfui8y",
        "author": "The_peashooter_pro",
        "title": "Looking for a show",
        "content": "The show is between 2016 and 2019. It’s a murder mystery show where at one point in the story one of the characters is revealed to have fake glasses. Someone sees the word Charlie spelled in blocks in their dream they get locked in the basement at one point and at another point they discover tracker pills in their neck. I know this is extremely confusing, but I’m hoping someone can help.",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1kfui8y/looking_for_a_show/"
    },
    {
        "id": "1kfqhon",
        "author": "PalmTrees_City",
        "title": "Movies or shows",
        "content": "Hey everyone, I’m needing help on trying to find some new movies or shows. It can be action, crime/thriller, I’ll take anything!! Please and thank you. (not YOU) I got bored after season 2 LOL.. ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kfqhon/movies_or_shows/"
    },
    {
        "id": "1kfate4",
        "author": "style-addict",
        "title": "YOU (Series Finale)",
        "content": "Has anyone else seen the series finale of YOU? Binged watched it Saturday evening and was pleasantly surprised. I was a bit hesitant to watch because the last season was a tad boring but I’m glad I finished the series to completion.\n\nDo you think there’s going to be a sequel judging by how the series ended? 🤔🥴",
        "upvotes": 7,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1kfate4/you_series_finale/"
    },
    {
        "id": "1kfjemd",
        "author": "Empty-Instruction282",
        "title": "Lost Bullet: Turbo-Charged Showdown Action Movie On Netflix!",
        "content": "Lost Bullet (2020), the first film in the French action-thriller trilogy, directed by Guillaume Pierret, introduces Lino (Alban Lenoir), a talented mechanic with a criminal past. After a failed ram-car heist lands him in prison, Lino is recruited by Charas (Ramzy Bedia), head of a Marseilles police drug squad, to modify vehicles for high-speed pursuits. His skills make him invaluable, but when Charas is murdered by corrupt cop Areski (Nicolas Duvauchelle), Lino becomes a suspect. To clear his name, he must locate a missing bullet lodged in a crashed police car—the only evidence of Areski’s guilt. With time running out, Lino escapes custody, evading relentless cops and criminals in a gritty, high-stakes chase across southern France. Aided by Charas’s loyal colleague Julia (Stéfi Celma), Lino’s resourcefulness and driving prowess shine in adrenaline-pumping car chases and brutal fistfights. The film’s lean 92-minute runtime, practical stunts, and Lenoir’s intense performance deliver a raw, no-frills action experience. Lost Bullet sets the stage for the trilogy’s themes of betrayal, corruption, and vengeance, earning acclaim for revitalizing French action cinema with its relentless pace and authentic, car-centric thrills.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kfjemd/lost_bullet_turbocharged_showdown_action_movie_on/"
    },
    {
        "id": "1kfjacm",
        "author": "Empty-Instruction282",
        "title": "Last Bullet: Lost bullet trilogy Turbo-Charged Showdown on Netflix!",
        "content": "The Lost Bullet trilogy, a French action-thriller series, follows Lino (Alban Lenoir), a skilled mechanic and ex-convict turned police asset, navigating a world of corrupt cops and high-stakes car chases. In Lost Bullet (2020), Lino, imprisoned after a botched heist, joins a drug squad to modify police vehicles. When his mentor, Charas, is killed by crooked cop Areski (Nicolas Duvauchelle), Lino must find a bullet in a missing car to prove his innocence, delivering gritty action and practical stunts. Lost Bullet 2 (2022) sees Lino, now a cop, seeking revenge for Charas and his brother’s murder, leading a narcotics unit with Julia (Stéfi Celma). The sequel ramps up car chases and combat, exploring Lino’s moral dilemmas amidst corruption.Last Bullet (2025), the trilogy’s finale, premieres on Netflix May 7, 2025. Fresh from prison, Lino pursues Areski and a corrupt commander, forming fragile alliances in a chaotic chase across southern France. Packed with intense fights, a tram battle, and helicopter pursuits, it concludes Lino’s vendetta with explosive, practical stunts. The trilogy, directed by Guillaume Pierret, is celebrated for its raw action, lean storytelling, and Lenoir’s compelling performance, earning praise as a standout Euro-action franchise.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kfjacm/last_bullet_lost_bullet_trilogy_turbocharged/"
    },
    {
        "id": "1kfhvp7",
        "author": "eclipse-star230",
        "title": "Need my next tv show",
        "content": "Hey guys im sick of watching all my usual shows and I'm in dire need of a new one, specifically on netlifx, I recently watched Chicago med, B99 and Riverdale and I want another teeny core 4 one like riverdale, and also a longish one pls help!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kfhvp7/need_my_next_tv_show/"
    },
    {
        "id": "1kevzk3",
        "author": "Purple-Suspect6214",
        "title": "YOU: i actually liked bronte",
        "content": "Honestly, I liked Bronte. I know that might be an unpopular opinion, but I really thought she was messy, in a way that felt real, you know? She wasn’t trying to be perfect, and I didn’t find her annoying like a lot of people did. I honestly don’t get why they felt that way. I always thought she was pretty smart, especially since she was a writer and all.\n\nWhen we found out she was catfishing Joe, I won’t lie, I thought that was a little out of place at first. But once it became clear that she actually cared about him, I started liking her again. What bothered me though was how she seemed to lose herself along the way. She started off strong but kind of got lost in the middle, which was a little disappointing.\n\nThat said, I still thought she was the kind of character who kept you curious, like you wanted to know more about her. She knew how to flirt, knew what to say in the right moments. Her dynamic with Joe, especially in the beginning when they first started getting closer, was really intriguing to me. I just wanted to see more of them together. Maybe that’s just me, though.",
        "upvotes": 38,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1kevzk3/you_i_actually_liked_bronte/"
    },
    {
        "id": "1kezwfc",
        "author": "daveomen9217247",
        "title": "I have this weird situation, with Netflix, and not sure what to do about it.",
        "content": "I don't live with my ex-wife anymore. She has our son. I pay for the Netflix. I offered, and I am ok with it. So...it works just fine at their location. And mine, too. Without the extra home fee. Why? No idea. Yes, I visit   \nall the time, but I don't sign into Netflix on my phone. So who knows how.\n\nHere's the thing. \n\nI can watch it on my laptop.  But, no thanks. I DO have a smart TV. Ok, cool. No problem. I sign into netflix on the TV and.....it works for a little then tells me I am not the main home. Ok. fine. I guess. But then how can I watch it on my laptop. \n\nI have a better idea, Netflix. If youre letting me watch at my location, ditch the damn laptop and let me watch on the TV. \n\nHas ANYONE run into this? Or am I just lucky and unlucky at the same time? I COULD pay for an extra \"home\", just so I can watch it on my tv 10 feet in the other room, I guess haha ",
        "upvotes": 16,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1kezwfc/i_have_this_weird_situation_with_netflix_and_not/"
    },
    {
        "id": "1kequkq",
        "author": "SeaChickenNugget",
        "title": "The Four Seasons observations",
        "content": "I found it a really easy, light hearted, comedy show about a group of friends. It's not my usual style but I thought it was refreshing and nice to see lots of cool actors in one show.\n\nIt all got a bit dark when Nick died, OMG? I wondered if Steve Carrell already said he wouldn't film any more seasons so they killed him off. What a turn! But I guess his character was a bit messy, an older man leaving his wife for a younger model, and Anne also confirmed in the show that he cheated on her. I didn't feel as though the cheating confirmation was taken seriously enough, and was swept under the rug by the group and not really acknowledged. Just me? \n\nIt was nice to see Steve brought some Michael Scott humour vibes to Nick, if you know you know!\n\nFinally, my favourite was Domingo Coleman, I thought he was so sassy and funny, my favourite little scene was when they were all taking a photo with Ginny, and the photos would sync to Anne's iPad so he told everyone to pose like they aren't having a good time. And he's the only one doing it! \n\nFinally, a shout out to Anne for dealing with so much and trying to not let her hurt feelings turn to hatred towards Ginny and also reminding her and Nicks daughter that Ginny was a person.\n\nSo will they make a new season?\n\n ",
        "upvotes": 62,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1kequkq/the_four_seasons_observations/"
    },
    {
        "id": "1kf31jr",
        "author": "Scout1228",
        "title": "Dark. Should I continue?",
        "content": "I just started Season 2 and I have loved it so far! Loved it. Now though they’re in this post-apocalyptic stuff and I can’t stand it. I find it so monotonous and miserable. Should I continue?\nI don’t want to look ahead. \n",
        "upvotes": 10,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1kf31jr/dark_should_i_continue/"
    },
    {
        "id": "1kf6xj3",
        "author": "JewelleryLove",
        "title": "You: Did anyone notice ‘nirvana’ next to mooney’s?",
        "content": "Do you think it is intentional? As it is the opposite of Anavrin (Love &amp; 40’s store). \n\nNot sure it this has already brought up here or in some other sub. ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kf6xj3/you_did_anyone_notice_nirvana_next_to_mooneys/"
    },
    {
        "id": "1kexqcw",
        "author": "Purple-Suspect6214",
        "title": "i’m about to start watching baby reindeer",
        "content": "i’ve heard much about it, would like to know you guys’ thoughts. \nis it TOO dark? is it worth it? i fear ill be too in my head after if its “too heavy”. \n",
        "upvotes": 15,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1kexqcw/im_about_to_start_watching_baby_reindeer/"
    },
    {
        "id": "1kez239",
        "author": "Purple-Suspect6214",
        "title": "i love when everyone is watching a show",
        "content": "i love when everyone’s watching the same show at the same time. like it happened with the queen’s gambit, and now it’s happening with season five of you. but like, i especially love it when everyone’s just talking about it nonstop, it’s my favorite thing. \nand before, i didn’t use to watch stuff when it came out, i’d be like “oh i’ll watch it later.” but now i’m realizing that watching things at the same time as everyone else is actually so fun.\n\nit’s really cool how netflix does that thing where they recommend shows to everyone, like the whole “top 10 in the world” ranking thing. it’s fun seeing what everyone’s watching and kinda feeling like you’re part of something.",
        "upvotes": 13,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1kez239/i_love_when_everyone_is_watching_a_show/"
    }
]