[
    {
        "id": "1pb9xd4",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 16,
        "comments": 2113,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pb9xd4/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1pd9qq8",
        "author": "scoreboard-app",
        "title": "Match Thread: Athletic Bilbao vs Real Madrid Live Score | LaLiga 25/26 | Dec 3, 2025",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1pd9qq8)",
        "upvotes": 14,
        "comments": 63,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pd9qq8/match_thread_athletic_bilbao_vs_real_madrid_live/"
    },
    {
        "id": "1pd67l3",
        "author": "HgnX",
        "title": "Game time today vs Bilbao",
        "content": "",
        "upvotes": 558,
        "comments": 69,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zuthlm9e505g1.jpeg?auto=webp&amp;s=50c62164364dee3a453de706633daa36635886ff"
        },
        "permalink": "/r/realmadrid/comments/1pd67l3/game_time_today_vs_bilbao/"
    },
    {
        "id": "1pd51sl",
        "author": "Due_Inevitable_2784",
        "title": "One of the worst scandals in RM history; 10 years ago today",
        "content": "",
        "upvotes": 322,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8gdlv92fxz4g1.jpeg?auto=webp&amp;s=ae61104fc13c9ee502ac1c64456a33707fbb022a"
        },
        "permalink": "/r/realmadrid/comments/1pd51sl/one_of_the_worst_scandals_in_rm_history_10_years/"
    },
    {
        "id": "1pd99f2",
        "author": "basilkurian247",
        "title": "📋✅ Starting XI 🆚 Athletic Club",
        "content": "",
        "upvotes": 52,
        "comments": 139,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pd99f2/starting_xi_athletic_club/"
    },
    {
        "id": "1pcwkst",
        "author": "asensia-kopfschmerz",
        "title": "Player power at Real Madrid is bigger than ever. It’s an extra challenge for Xabi Alonso",
        "content": "Player power at Real Madrid is bigger than ever. It’s an extra challenge for Xabi Alonso \n\nReported by Dermot Corrigan, the Athletic. He’s not listed in the guide but personally Tier 2.\n\n&gt; The player’s [Vini’s] entourage has felt supported by the club through recent months, while Madrid sources pointed out to The Athletic that the club had not fined him for his angry reaction to being substituted in October’s Clasico at the Bernabeu. Conversely, multiple sources have said that the club has been concerned at times about Vinicius Jr becoming distracted by off-pitch issues, affecting his performance in the team.\n\nI also criticized Xabi for being weak and not asserting his authority by benching Vini after the El Clasico tantrum. Didn’t come to mind that he was probably just following suit given the club’s stance.",
        "upvotes": 164,
        "comments": 78,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/95TYCL7_utBc7c18rkr62eOngMDsjDAcmnJW8GOgaIA.jpeg?auto=webp&amp;s=8e1592800a1c3c1d0fad831c3d00d325f53fb4f5"
        },
        "permalink": "/r/realmadrid/comments/1pcwkst/player_power_at_real_madrid_is_bigger_than_ever/"
    },
    {
        "id": "1pczne6",
        "author": "Parking_Writer6719",
        "title": "Anyone else just relish the simpler times....? #CR7",
        "content": "",
        "upvotes": 49,
        "comments": 14,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/4gulyiq6iy4g1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pczne6/anyone_else_just_relish_the_simpler_times_cr7/"
    },
    {
        "id": "1pd3f2y",
        "author": "justpharaohlol",
        "title": "Nicholas Sebastien Anelka",
        "content": "",
        "upvotes": 25,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/comjngt4lz4g1.png?auto=webp&amp;s=6696f6dd5ed86727a1a177289950eb4bcecced07"
        },
        "permalink": "/r/realmadrid/comments/1pd3f2y/nicholas_sebastien_anelka/"
    },
    {
        "id": "1pd31mu",
        "author": "J0e717",
        "title": "Can I see bellingham build up in the next game?",
        "content": "Hi guys, I just wonder if MrXabi can play Jude in double pivot with tchouameni in the next match, cuz I think he will be more effective in helping the team in build up. he is also a good ball winner, and I saw him playing in this position wit Ozcan/Dahoud at BVB, and he was so good. Every time I see Güler dropping deep with Tchouameni while Jude plays higher in attack especially with Mbappe, Vini, and Mastantuono already there I feel it's a waste of Jude's and güler's value",
        "upvotes": 27,
        "comments": 39,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pd31mu/can_i_see_bellingham_build_up_in_the_next_game/"
    },
    {
        "id": "1pcobz7",
        "author": "RM-PostMatchSurveys",
        "title": "No Longer Doing Post Match Surveys",
        "content": "It's clear that the ratings for these matches are not being done objectively and this issue has only worsened this season with the amount of Player FC fans we have in the sub. I'm tired of seeing submissions that give 10s to Arda while rating Jude a 1 or vice versa, 10s for Mbappe and Vini even when it's clear they had a mid match, people giving 1s to every player if we lose a match, etc. Sorry to those who have enjoyed the surveys.",
        "upvotes": 234,
        "comments": 37,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pcobz7/no_longer_doing_post_match_surveys/"
    },
    {
        "id": "1pcbmwi",
        "author": "o6ohunter",
        "title": "A collective issue, not an individual one",
        "content": "",
        "upvotes": 633,
        "comments": 156,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/km0qvxj99t4g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pcbmwi/a_collective_issue_not_an_individual_one/"
    },
    {
        "id": "1pcjxvt",
        "author": "Snoo-30138",
        "title": "Why can’t we attack more centrally? Well here’s one reason why",
        "content": "I might be slightly over critical here but I’m finding it uneasy that Mbappe almost always bends his run to the left side. \n\nHis first touch here could’ve easily been towards the goal, but instead decides to go towards Vini and totally demolishes any chances of picking away the man on Vini.\n\nVini also could’ve done better here maybe with a cut back, but this is Mbappe’s mistake to start with. ",
        "upvotes": 161,
        "comments": 124,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/uuh7a7aoru4g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pcjxvt/why_cant_we_attack_more_centrally_well_heres_one/"
    },
    {
        "id": "1pc5685",
        "author": "CoolIsopod3095",
        "title": "Throwback to this amazing real madrid counterattack against Ajax. Commentary makes it 10x cooler",
        "content": "",
        "upvotes": 947,
        "comments": 64,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/udam7ogpqr4g1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pc5685/throwback_to_this_amazing_real_madrid/"
    },
    {
        "id": "1pcj1ld",
        "author": "Prestigious_Tax2069",
        "title": "The Holy Cow's Coach…! Congrats to Real Madrid’s Board",
        "content": "This isn't \"rage-after-a-draw\" talk or some reactionary street language. This is literally what Spanish journalists have been saying nonstop over the past hours. What's happening at Real Madrid is a full-on administrative disaster. Yes the chaos on the pitch and the disgusting behavior in midfield is 100% the board's fault. No debate.\n\nXabi Alonso is a very good coach, at least against small and medium teams. He started the season destroying them without mercy, which is exactly how you win a league comfortably. He showed personality, he didn’t care if he benched Bellingham or Vinicius , everyone saw it in the Club World Cup and the early weeks of the season.\n\nThen suddenly everything flipped the moment some of the \"holy cows\" in the locker room started acting up.\nYep  the board stepped in and basically told Xabi not to be too harsh on certain players. Or in other words: \"Find a middle ground between you and the players.\"\nThat might work in some random street café not in a football club.\n\nThis isn't even a defense of Xabi. He made mistakes, sure. But let's ask the million-dollar question:\n\n**Does the coach have complete freedom**?\nOf course not. Not even close. It's impossible for him to make any decision freely because if one of the \"holy cows\" drops in form, their market value drops with them  and the board can't have that.\n\nThese deadweight names aren't going to succeed. These lost players won't give you anything. They failed under the smiling  coach, and they failed under the strict and demanding one. They're rotting pieces that will drag down the whole club unless the board steps in.\n",
        "upvotes": 153,
        "comments": 53,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pcj1ld/the_holy_cows_coach_congrats_to_real_madrids_board/"
    },
    {
        "id": "1pctn2j",
        "author": "hawkmav",
        "title": "When Hala Madrid is life",
        "content": "",
        "upvotes": 12,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/o9htdmidtw4g1.jpeg?auto=webp&amp;s=23f89ae15726760ae62d71893237d4fbf8a3d682"
        },
        "permalink": "/r/realmadrid/comments/1pctn2j/when_hala_madrid_is_life/"
    },
    {
        "id": "1pc5yoq",
        "author": "Tuffyobro",
        "title": "Why is Endrick not getting a chance to prove  himself?",
        "content": "I think it’s very strange that Endrick isn’t getting enough minutes to prove himself. He was only subbed for one game this season with a total of like 12 minutes.\n\nHe was a real bright spark in the Copa del Rey last season, and every time he played, he looked like a genuine goal threat.\n\nHe scored a goal every 121 minutes last season, despite mostly coming on as a late substitute in la liga. He was the top scorer in the Copa del Rey and produced some really nice goals.\n\nI agree that his overall game still needs improvement, but he brings that goal threat which most of our attackers except Mbappé (and to some extent Gonzalo García) are lacking right now.\n\nYoung talent do not want to come to Madrid if they risk rotting on the bench for no reason.   \n",
        "upvotes": 192,
        "comments": 128,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pc5yoq/why_is_endrick_not_getting_a_chance_to_prove/"
    },
    {
        "id": "1pca18h",
        "author": "cyrusmancub",
        "title": "Mendy is out, having suffered a hamstring injury",
        "content": "",
        "upvotes": 95,
        "comments": 76,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pca18h/mendy_is_out_having_suffered_a_hamstring_injury/"
    },
    {
        "id": "1pca59u",
        "author": "Parking_Writer6719",
        "title": "Vini Jr x Bruno Mars",
        "content": "We want this Vini back :(",
        "upvotes": 53,
        "comments": 27,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/shm1mgahys4g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pca59u/vini_jr_x_bruno_mars/"
    },
    {
        "id": "1pc3uic",
        "author": "ColdAd3682",
        "title": "Real Madrid Transfer DealSheet: Rodrygo for sale, centre-back and midfield targets",
        "content": "",
        "upvotes": 114,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fnWmINrUxFPyvD-BlbzP6GNfya4F1JNfOQEODte4cjY.jpeg?auto=webp&amp;s=bf747cda2d05dd2bda25613c44c6f16c3bfaefaa"
        },
        "permalink": "/r/realmadrid/comments/1pc3uic/real_madrid_transfer_dealsheet_rodrygo_for_sale/"
    },
    {
        "id": "1pccu4w",
        "author": "No-Independent2522",
        "title": "Real Madrid and the Community of Madrid sign a collaboration protocol for the creation of Madrid Innovation District  It will generate 1.2 billion euros annually to the regional GDP and more than 23,000 permanent jobs",
        "content": "",
        "upvotes": 33,
        "comments": 4,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pccu4w/real_madrid_and_the_community_of_madrid_sign_a/"
    },
    {
        "id": "1pc416y",
        "author": "Fluffy-Management199",
        "title": "In Hindsight, was Carlo just unfairly treated ?",
        "content": "Now before everyone jumps at me for saying how terrible last season was, I’m not saying he was perfect but he did have a terrible defense all the year round because of injuries \n\nYes the football wasn’t pretty always but we didn’t have drama and well we did decent against smaller teams atleast even if the football wasn’t pretty necessarily. \n\nWas it unfair to be highly critical against Carlo in hindsight given that he had multiple injuries in the back line ?\n\nDo you think he would have succeeded if he had these new signings?\n\n\n\nEDIT: I also think that Xabi is given much more leniency when it comes to the results and football because he was a former player and a legend and if he wasnt, he would have a much higher repercussion in the fanbase",
        "upvotes": 62,
        "comments": 72,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pc416y/in_hindsight_was_carlo_just_unfairly_treated/"
    },
    {
        "id": "1pbpydm",
        "author": "Fit_Wrap_9580",
        "title": "Saw this video in X, why is real not playing like this,",
        "content": "It didn't matter who had to score, they played as a team, the important thing was to win no matter if it was with a goal from Fran García (who scored a goal), now it absolutely has to be just one player who scores because they can't be substituted either.\n\n  \nI was so happy to see this real madrid, my depression left my body lol, this real madrid had life in them. \n\nLook at Valverde who is playing so good, he is supposed to play like that.",
        "upvotes": 498,
        "comments": 87,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/qg0r2oerxn4g1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pbpydm/saw_this_video_in_x_why_is_real_not_playing_like/"
    },
    {
        "id": "1pc3twe",
        "author": "Total_Escape_9778",
        "title": "With 9 goals in only 5 matches, this is already the most prolific Champions League season of Mbappé’s career when it comes to goal scoring.",
        "content": "Just for context, the record of highest goal scoring season in the champions league is held by Cristiano Ronaldo with 17 goals in 11 games in the 2013-14 season.",
        "upvotes": 59,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/yndi1rckar4g1.png?auto=webp&amp;s=39d420a1ea4eb22e886704672055577fc3489b7e"
        },
        "permalink": "/r/realmadrid/comments/1pc3twe/with_9_goals_in_only_5_matches_this_is_already/"
    },
    {
        "id": "1pbifs9",
        "author": "o6ohunter",
        "title": "Zinedine Zidane playing some pick up. Safe to say he’s still got it",
        "content": "",
        "upvotes": 948,
        "comments": 36,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/53ip59ynkm4g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pbifs9/zinedine_zidane_playing_some_pick_up_safe_to_say/"
    },
    {
        "id": "1pbfu9r",
        "author": "Nakul03",
        "title": "Kylian Mbappé has now scored 60 goals in 2025, with five matches still to play. 🇫🇷🔥",
        "content": "",
        "upvotes": 1150,
        "comments": 122,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/lzno0bmh3m4g1.jpeg?auto=webp&amp;s=b3c6a4649afb0206f32fa614cd25045c36b4ebf5"
        },
        "permalink": "/r/realmadrid/comments/1pbfu9r/kylian_mbappé_has_now_scored_60_goals_in_2025/"
    },
    {
        "id": "1pcinp3",
        "author": "neauneau",
        "title": "Visiting Madrid on May, looking to go to a game",
        "content": "Hi all, we're in the Netherlands and we're planning to go to Madrid for a long weekend when we play against Athletic club. I'd love to get tickets to the game to go with my son who's 8 and a huge fan. \n\nI'm a bit concerned about ticket availability from searching and reading on this sub. I understand tickets will be available about a week before the game, but I take it it's not really worth it getting the Madridistas premium pack right? Do I have a chance to buy tickets on the official website or is everything scooped up by 3rd party resellers? \n\nThanks for your advice, Hala Madrid! ",
        "upvotes": 6,
        "comments": 8,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pcinp3/visiting_madrid_on_may_looking_to_go_to_a_game/"
    },
    {
        "id": "1pbj3ct",
        "author": "Saharan-Gladiator",
        "title": "Xabi is starting to seem like a hypocrite",
        "content": "During the CWC, he was praising Gonzalo Garcia but Gonzalo only gets brought in at the 89th minute. Benching Vini when he's having a bad game is great but Mbappé plays the whole game even if he's not having a good game. Gonzalo and Endrick must feel pretty discouraged right now. There's even a fake AI picture of Endrick crying during the Girona game, that's how he must feeling inside. Xabi has went back on all of his promises since the start of the season. So many questionable decisions from Xabi",
        "upvotes": 338,
        "comments": 173,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pbj3ct/xabi_is_starting_to_seem_like_a_hypocrite/"
    },
    {
        "id": "1pbmtik",
        "author": "sosephjr",
        "title": "Vini chance against Girona at 45’. Take a closer look to one player…",
        "content": "",
        "upvotes": 199,
        "comments": 176,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/bzkqoexycn4g1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pbmtik/vini_chance_against_girona_at_45_take_a_closer/"
    },
    {
        "id": "1pbg970",
        "author": "Nakul03",
        "title": "Xabi Alonso reaction to Mbappe miss vs Girona 90+4'",
        "content": "",
        "upvotes": 311,
        "comments": 58,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/33kv8un86m4g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pbg970/xabi_alonso_reaction_to_mbappe_miss_vs_girona_904/"
    },
    {
        "id": "1pc5mu7",
        "author": "Cursorium",
        "title": "Is Celta match sold out or am I using the site wrong?",
        "content": "I am visiting Madrid on Sunday, and I wanted to visit the match against Celta, but I am having trouble getting the tickets. I sometimes get the option to choose a seat, but whenever I try to choose a seat, there's a message that there are no seats available anymore. I refresh the site, and then there are new seats available. Am I doing something wrong?",
        "upvotes": 8,
        "comments": 16,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pc5mu7/is_celta_match_sold_out_or_am_i_using_the_site/"
    }
]