[
    {
        "id": "1if0swi",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://t.me/+K_tQ4Zzi0S80YjFk): Gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g30QJSClHjRAUvFBqKJa-Re4duFBniS6HkLBoJRdgOQ.jpg?auto=webp&amp;s=2c44cf9a902b77de7dce3b5cad542f22791fb32e"
        },
        "permalink": "/r/torino/comments/1if0swi/la_piola_friends_meetup/"
    },
    {
        "id": "1if0swb",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram group for apartment hunting: https://t.me/CaseStudentiTorino\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1if0swb/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1itgyf8",
        "author": "Top-Text-7727",
        "title": "Posto con più NPC di Torino",
        "content": "Secondo me INS di Corso Regina Margherita ",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1itgyf8/posto_con_più_npc_di_torino/"
    },
    {
        "id": "1itfmeg",
        "author": "chiaralupo",
        "title": "Non trovo nessun lavoro a Torino e soldi quasi finiti per vivere, non c'è economicamente più speranza?",
        "content": "",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1itfmeg/non_trovo_nessun_lavoro_a_torino_e_soldi_quasi/"
    },
    {
        "id": "1it25s8",
        "author": "Professional_Law28",
        "title": "Quanto sono vecchi gli alberi dei viali?",
        "content": "Sapete se c'è un sito, una mappa, un link, un qualunque ahahah per sapere quando sono stati piantati gli alberoni dei vari viali e corsi della città? \nCamminando per il mercato di corso Svizzera con mia nonna, lei mi ha chiesto da quanto potessero essere lì e sinceramente non ho saputo risponderle 😅 qualcuno può chiarirci questo dubbio? \nSu Google l'unica cosa che ho trovato è che in corso Svizzera il mercato c'è dal 1930 e già allora era alberato, ma saranno gli stessi alberi?\nGrazie a tutti",
        "upvotes": 11,
        "comments": 17,
        "media": null,
        "permalink": "/r/torino/comments/1it25s8/quanto_sono_vecchi_gli_alberi_dei_viali/"
    },
    {
        "id": "1itb5zr",
        "author": "PinoLG01",
        "title": "Dove comprare Jalapenos",
        "content": "Ciao, vorrei preparare delle ricette che prevedono gli jalapenos freschi (tipo gli jalapeno poppers) in cui difficilmente possono essere sostituiti con altro. Contando che ho girato vari supermercati e mercati rionali e non li ho mai trovati, se qualcuno li ha comprati sa indicarmi dove? Specifico che mi servono freschi e interi visto che all'esselunga li vendono in salamoia.",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1itb5zr/dove_comprare_jalapenos/"
    },
    {
        "id": "1it1kqs",
        "author": "carodiario24",
        "title": "Kombucha",
        "content": "\n\nCiao! Potrei chiedervi dei consigli rispetto la giusta esecuzione della ricetta? \n\nMi sono appassionata al Kombucha grazie ad un video del Dott. Stefano Vandrame. \nHo alcune curiosità : dove avete preso il vostro primo scoby? Quale the avete scelto? Come lo avete aromatizzato, dopo aver effettuato la prima fermentazione? State continuando la vostra autoproduzione? Avete comprato in uno store specifico l'occorrente per iniziare la fermentazione? \n\n",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1it1kqs/kombucha/"
    },
    {
        "id": "1isdwbt",
        "author": "Nice_Project9383",
        "title": "Nuove amicizie a Torino (parte 2)",
        "content": "Ciao a tutti, avevo già scritto 3 mesi fa un post e da quello siamo riusciti a creare un gruppo whatsapp ed organizzare qualche uscita. Il gruppo ad oggi è composto da persone che vanno dai 20 ai 33 anni. (circa, non ricordo bene 😅).  Se qualcuno volesse aggiungersi, mi scriva in privato che gli passo il link, o comunque s qualcuno ha voglia di uscire a fare un giro sono disponibile :) \n\nAggiungo una mia breve bio, così almeno capite subito se vi sto sul cazzo 😂: ho 26 anni, mi piace andare al cinema, uscire per una chiacchierata o fare qualche gioco da tavolo (anche se ne conosco 3 in croce 🥲). Non sono un videogiocatore, ogni tanto faccio qualche partita a smash, ma non ho switch con me (e comunque sono scarso lol)",
        "upvotes": 14,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1isdwbt/nuove_amicizie_a_torino_parte_2/"
    },
    {
        "id": "1is8489",
        "author": "geralthawke",
        "title": "Cerco qualcuno che abbia voglia di venire al concerto degli Oasis con me!",
        "content": "\nCiao a tutti!\n\nSono M, ho 35 anni e vivo in Italia da 7 anni, ma vengo dal Sud-est asiatico.\n\nHo esaurito tutta la mia fortuna riuscendo a prendere due biglietti per la reunion degli Oasis, che sarà il 4 luglio a Cardiff, in Galles.\n\nInizialmente dovevo andare con un’amica, ma per motivi familiari ha dovuto rinunciare al suo biglietto.\nScrivo qui perché mi piacerebbe trovare qualcuno che ami i Gallagher tanto quanto me a Torino! \n\nSarebbe bello scambiare due chiacchiere prima di organizzare il viaggio per Cardiff insieme—giusto per capire se siamo compatibili (e che tu non sia un razzista o uno/a stronzo/a! Hahaha).\n\nIl biglietto del concerto ovviamente si paga e costa 125 euro! Poi infine, Mi piacerebbe arrivare un giorno prima e restare anche il giorno dopo, così possiamo scoprire insieme cosa ha da offrire la città!\n\nQuindi, cerco qualcuno con cui vivere il concerto al massimo, cantando insieme le loro canzoni (prima che si litighino di nuovo! Hahaha). \n\nDo la priorità a chi non ha mai visto gli Oasis dal vivo come me!\n\nGrazie mille e Live Forever! ✌🏾",
        "upvotes": 10,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1is8489/cerco_qualcuno_che_abbia_voglia_di_venire_al/"
    },
    {
        "id": "1isn0dq",
        "author": "NerveIntelligent4185",
        "title": "Dove conviene prendere casa?",
        "content": "Ciao a tutti!\n\nSono uno studente in scambio e, come molti, sto cercando un appartamento a Torino per un solo semestre. Per motivi di budget e comodità del contratto, stavo per scegliere una stanza in Lungo Dora Napoli (numero 2 sulla mappa), ma da quello che ho letto sembra che la zona non sia tra le più sicure.\n\nLe altre opzioni che sto considerando sono segnate sulla mappa. So che Porta Palazzo ha una certa reputazione, ma le zone che sto valutando sono altrettanto problematiche o ce n’è una che risulta un po’ più sicura?\n\nOgni consiglio è ben accetto. Grazie mille! 😊\n\nhttps://preview.redd.it/julmh55wkyje1.png?width=564&amp;format=png&amp;auto=webp&amp;s=4f612abc803d4ffb072e4ab16f854b7d1868a57f\n\n",
        "upvotes": 1,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1isn0dq/dove_conviene_prendere_casa/"
    },
    {
        "id": "1is0u6v",
        "author": "daenaerys97",
        "title": "Amicizie che abbiano una malattia reumatica come me 🤞",
        "content": "Ciao! Questa è decisamente una domanda strana, ma nasce da una sensazione di solitudine relativa al sentirsi poco compresi nell'essere giovani e vivere una malattia invalidante e cronica. Premessa: F 27 anni.\nHo da poco ricevuto diagnosi di spondilite anchilosante, una malattia reumatica autoimmune che danneggia varie articolazioni, muscoli, tendini e varie cose in giro per il corpo.\nPer avere questa diagnosi ho visto tantissimi medici nell'arco di più di un anno, di cui 3 reumatologi, un immunologo e 2 neurologi a Torino, ma nessuno di loro ci ha capito nulla (mi hanno fatto diagnosi sbagliate o hanno candidamente ammesso di non sapere dove mettere mani). Quindi sono dovuta andare fuori regione. È una cosa tristissima che la mia amata città, tutt'altro che terzo mondo, non abbia nessun medico competente in questa e in tutte le altre mie malattie ahahaha.\n\nDetto ciò, mi farebbe piacere conoscere (anche solo online) persone di Torino o provincia che abbiano la stessa patologia o simili (spondiloartriti e artriti sieronegative) per scambiare consigli, esperienze, sfoghi e contatti di medici magari qui in piemonte così da non dover spendere centinaia di euro per i viaggi della speranza e relativi b&amp;b, oltre ovviamente alle centinaia di euro per le visite ed esami che l'ssn non mi ha gentilmente concesso.\nPer sentirsi meno soli ma anche darsi una mano concreta.\nPS: Soffro anche di endometriosi ed altre cose, se ti va di parlare scrivimi anche solo in DM.\nCiao!",
        "upvotes": 27,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1is0u6v/amicizie_che_abbiano_una_malattia_reumatica_come/"
    },
    {
        "id": "1isk3wr",
        "author": "7seasnail",
        "title": "venerdì centralino",
        "content": "ragazzi vorrei andare venerdì 21 al centralino x la serata between, ma nessuno dei miei amici ci vuole andare, c'è qualcuno che va a cui mi posso aggregare??",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1isk3wr/venerdì_centralino/"
    },
    {
        "id": "1irq3s8",
        "author": "Lagikrus",
        "title": "Giochi da tavolo rubati",
        "content": "Ciao a tutti,\nTra venerdì sera e domenica mattina mi è stata aperta la macchina, tra corso Francia e Via Cibrario direzione piazza Statuto.\nAll'interno non avevo nulla di valore, ma una grossa busta della spesa (della LIDL, gialla) con tutti i miei giochi da tavolo che, oltre ad essere una mia passione, erano anni e anni di regali ricevuti e ci tenevo sentimentalmente.\n\nPubblico qua la lista in speranza di non so che cosa onestamente, sia mai che è stata poi buttata in giro o che qualcuno li trovi nei vari mercatini. Giusto per togliermi il pensiero di averci provato.\n\nDorfromantik\nFlamecraft\nBetrayal At house on the hill 3°edizione\nBang! Pallottolone\nNome in codice 18+\nVudhulu\nDobble\nBang! Gioco di Dadi\nWilderfeast techniques deck",
        "upvotes": 54,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1irq3s8/giochi_da_tavolo_rubati/"
    },
    {
        "id": "1irwb6c",
        "author": "art-a77ack",
        "title": "Richiesta bizzarra: nessuna firma, timbro di “Ferrua belle arti” sulla cornice, titolo “Night club”, 1975, nessun altro indizio…qualcuno riconosce il tratto di qualche pittore torinese? Ben potrebbe essere uno studente o un amatoriale. Grazie a chi saprà darmi info",
        "content": "La richiesta può apparire insolita ed improbabile… ed infatti lo è. Possiedo questa tela e vorrei capire chi ne è l’autore. Ho già chiesto a Ferrua belle arti, ma negli anni la proprietà è cambiata e pertanto non riescono a fornirmi alcuno spunto.",
        "upvotes": 12,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1irwb6c/richiesta_bizzarra_nessuna_firma_timbro_di_ferrua/"
    },
    {
        "id": "1is9wdq",
        "author": "ProgressSad6238",
        "title": "Rent apartment",
        "content": "I came to Torino for one month for internship and I want to rent apartment for one month with documentation? How to do this?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1is9wdq/rent_apartment/"
    },
    {
        "id": "1is8j5m",
        "author": "Realistic_Exam_6242",
        "title": "Kill Team a Torino",
        "content": "Ciao! Qualche giocatore di Kill Team a Torino? ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1is8j5m/kill_team_a_torino/"
    },
    {
        "id": "1irrajk",
        "author": "SonKagito",
        "title": "Buying Lavazza coffee",
        "content": "Hi,\nDoes anyone know any shops that sell lavazza coffee as i really like it and though maybe to bring like a pack (100,200 mg) with me back to my own country. I saw theres a lavazza museum but idk whether you can buy there...\nThank you !!!",
        "upvotes": 2,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1irrajk/buying_lavazza_coffee/"
    },
    {
        "id": "1irhogu",
        "author": "return0000",
        "title": "Posto bici condominiale",
        "content": "Ciao! C’è qualcuno che ha un posto bici condominiale e vorrebbe condividerlo con un totale sconosciuto (me) ?\n\nSì, se suona come richiesta stramba, lo è. Il problema è che uso la bici per andare a lavoro e nel mio condominio, da regola, non si possono tenere le bici nel cortile 😄\n\nZona: mcfit porta susa \n\nPer chi vorrebbe offrirsi sentiamoci in PM per non dare ai quattro venti più info\n\nGrazie!",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1irhogu/posto_bici_condominiale/"
    },
    {
        "id": "1irh2un",
        "author": "InnamoratoPazzo",
        "title": "Via Giordano Bruno - rumore treni",
        "content": "Ciao a tutti, \n\nnella mia estenuante ricerca di una nuova casa in affitto sto valutando una soluzione all'inizio di via Giordano Bruno. \n\nLa casa mia piace molto, costa un po' cara rispetto al mio budget ma sono fortemente tentato di prenderla, perché sto cercando una casa dove passare 4 anni sapendo di poterci stare bene. \n\nC'è però una questione su cui non sono del tutto convinto: la casa affaccia proprio su via Bruno, che è vicinissima ai binari del treno della linea Lingotto - Porta Nuova. L'agente dice che grazie ad infissi ecc non si sente nulla, ma può essere davvero così? I binari mi sembrano troppo vicini per non sentire nulla. Poi con la finestre aperte d'estate il rumore lo do per certo, ma fortunatamente la casa ha l'aria condizionata quindi di notte non avrei bisogno di tenere aperto.\n\nC'è qualcuno che ha esperienza di quella zona che potrebbe darmi qualche consiglio?\n\nGrazie",
        "upvotes": 3,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1irh2un/via_giordano_bruno_rumore_treni/"
    },
    {
        "id": "1irgs4j",
        "author": "JimmyAngel5",
        "title": "Graduatoria Professioni Sanitarie 2024 Torino",
        "content": "Buongiorno,\n\nCome da titolo, vorrei recuperare la graduatoria dell'anno scorso di UNITO per conoscere il punteggio minimo per entrare a fisioterapia. \n\nSul sito dell'Università riesco a trovare solamente il bando, mentre la graduatoria non è più disponibile.\n\nQualcuno per caso che ha partecipato o è entrato potrebbe aiutarmi? \n\nGrazie! ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1irgs4j/graduatoria_professioni_sanitarie_2024_torino/"
    },
    {
        "id": "1irfrf3",
        "author": "Formal_Health_3674",
        "title": "Are There Chances of Admission in the Second Call for Master's Applications?",
        "content": "Hey everyone,\n\nI'm planning to apply for a Master's program in POLITO during the second call (or second round) of applications. I was wondering if anyone has experience with this—are the chances of getting in significantly lower compared to the first call?\n\nSome universities mention that fewer spots are available in later rounds, but I’m curious to know if anyone has successfully gotten in or if it’s generally much harder. Also, do funding opportunities and scholarships become more limited?\n\nWould love to hear your thoughts and experiences. Thanks!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1irfrf3/are_there_chances_of_admission_in_the_second_call/"
    },
    {
        "id": "1irfnkj",
        "author": "alikocbaskan",
        "title": "Trams",
        "content": "I dont know if its just me but since saturday trams feel significantly faster to me (10,15,16) is  \nit possible gtt pushed boundaries to keep up with demand or im just having a psyhcosis?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1irfnkj/trams/"
    },
    {
        "id": "1irh2f8",
        "author": "ConfidentToe5058",
        "title": "Looking for a second base, and Turin is on my list.",
        "content": "Ciao! I’m currently spending some time in San Sebastián (Basque Country), and while I enjoy how clean, **urban**, and surrounded by nature it is, I feel like it lacks cultural events, a more alternative vibe, and restaurant diversity. The humidity is also a bit too much for me. *I also appreciate that people here are not very loud.*\n\nSo, here are my questions:\n\n1️⃣ Is Turin a noisy city? Do you hear people, traffic, and neighbours late at night?\n\n2️⃣ How is the soundproofing—both in windows and walls—in newer buildings? Can you hear people walking, talking, or doing other things in the next apartment?  \n*I’ve stayed in places where the walls felt like paper, and cannot tolerate noise.*\n\n3️⃣ How is the summer climate? Research shows a dry climate with temperatures around 26°C, which seems reasonable. But I’ve seen people saying the heat (+ air pollution) can feel extreme?!  \n\\- Does it cool down at night?  \n\\- Are newer apartments usually equipped with AC?\n\n4️⃣ How’s the food diversity? Are international restaurants any good?  \n*I've serious gluten and lactose intolerance, so traditional Italian food isn’t always an option for me. ;/*\n\n5️⃣ Are supermarkets well-stocked with healthy products? I’m looking for no added sugars, no junk/chemicals ingredients, and a good selection of clean food options.\n\n6️⃣ I saw there are DM stores! 😍 Hope they offer the same variety of nutrition / natural products as in Germany?\n\n7️⃣ Any no-go areas for a woman to stay or visit? - By the way, I speak some Italian.\n\n(I know these questions are quite specific, but perhaps others might find them useful too—so please no judgements. Thx a lot! 😊)",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1irh2f8/looking_for_a_second_base_and_turin_is_on_my_list/"
    },
    {
        "id": "1iq58p1",
        "author": "Dodo8Fencing",
        "title": "Lingotto🪙",
        "content": "",
        "upvotes": 150,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/uib7gjx8zbje1.jpeg?auto=webp&amp;s=489210efc1c27363c36c11391ff782dee32c4365"
        },
        "permalink": "/r/torino/comments/1iq58p1/lingotto/"
    },
    {
        "id": "1ir3u0f",
        "author": "krasnyj",
        "title": "La prossima volta che Willie Peyote partecipa a Sanremo dobbiamo comprare le SIM",
        "content": "Tutto qua. Non è possibile che pure Cosenza ha fatto una campagna di voti per Brunori Sas e noi no. Lo stesso vale per qualsiasi altro torinese con una canzone decente. ",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1ir3u0f/la_prossima_volta_che_willie_peyote_partecipa_a/"
    },
    {
        "id": "1iqqscv",
        "author": "South-Bite5598",
        "title": "E-Biking in Torino",
        "content": "Ciao! \n\nStarò a Torino per 2 mesi e vorrei noleggiare una e-bike. Consigli di girare in bici? Le strade sono sicure e adatte ai ciclisti? Se sì, hai qualche consiglio su dove posso noleggiarne una a un prezzo conveniente? Ho visto un sito che affitta mensilmente per circa 60€, ma volevo controllare se ci sono opzioni ancora più economiche. \n\nGrazie mille!\n\nP.S. Sorry if the Italian translation is bad :) ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1iqqscv/ebiking_in_torino/"
    },
    {
        "id": "1iqwhrc",
        "author": "Repulsive-Yak-126",
        "title": "Night ladies",
        "content": "Is there any safe part of the city ( prefer near the parco del Valentino where I can meet the night ladies prefer around 22:00-23:00 pm )?",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1iqwhrc/night_ladies/"
    },
    {
        "id": "1iqcw8r",
        "author": "secondhandgaladriel",
        "title": "Erasmus a Torino",
        "content": "Ciao a tutti, sono una studentessa ed è la mia prima volta a Torino. Sono qui per studio (unito) e vorrei chiedere (anche se è un po strano) come faccio a incontrare altre persone o altri studenti? Si, la risposta ovvia è \"vai a lezione, parla con gli altri\" però sono molto timida. E inoltre sono in un quartiere tranquillo e un po lontano dal centro (circa un'ora di autobus o metro) quindi ho paura di sentirmi isolata. Studio italiano, ma quando devo parlare con qualcuno mi congelo. Sarò a Torino per 5 mesi, ovviamente voglio che sia divertente e incontrare persone, ma non sono sicura di come. Sembrerò drammatica ora perchè devo dire che sono qui solo da pochi giorni, ma non sono sicura di cosa fare (e inoltre non ho ancora visitato il centro perché sto cercando di capire come funziona l'autobus).\nInsomma, la mia domanda è come posso incontrare altri studenti (ci sono orginazzazioni, club...) e quali sono alcune cose divertenti da fare mentre sono qui? Grazie!\n\n++ Vorrei solo spiegare perché c'era un po' di confusione: Non c'è un autobus diretto per il centro, devo trasferire quindi ci vuole 45-60 minuti per arrivare alle mie lezioni ma se avessi una macchina ci vorrebbero solo circa 20 minuti 🥲🥲",
        "upvotes": 3,
        "comments": 34,
        "media": null,
        "permalink": "/r/torino/comments/1iqcw8r/erasmus_a_torino/"
    },
    {
        "id": "1iq1m69",
        "author": "alessia01_",
        "title": "Nuove amicizie",
        "content": "Ciao a tutti, sono una ragazza di 23 anni e mi sono trasferita da poco in città. Ho già un gruppo di amici, sia ragazze che ragazzi, ma mi farebbe piacere ampliare la compagnia e conoscere nuove persone.\n\nSe vi va di unirvi per un caffè, una passeggiata o una serata fuori, scrivetemi pure :).\n\n",
        "upvotes": 13,
        "comments": 17,
        "media": null,
        "permalink": "/r/torino/comments/1iq1m69/nuove_amicizie/"
    },
    {
        "id": "1iqru0u",
        "author": "NecessaryNext3372",
        "title": "qualcuno sa dove acquistare vaporizzatori o snus minorenni qui?",
        "content": "Sono qui ancora per qualche giorno prima di andare a sciare e sinceramente mi piacerebbe bere un po' di snus o un po' di nicotina visto che non avevo con me il pensiero che sarebbe stato facile uscire qui ma no",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1iqru0u/qualcuno_sa_dove_acquistare_vaporizzatori_o_snus/"
    },
    {
        "id": "1ipjovs",
        "author": "DirectInteraction825",
        "title": "Mi hanno fregato…",
        "content": "Ciao a tutti, \n\nRiporto di seguito uno scam che ho subìto e che probabilmente se me lo rifacessero mi fregherebbero di nuovo. \n\n2 settimane fa ho trovato una casa che mi piaceva su un sito online abbastanza comune per cercare case. Si trattava in particolare di un bilocale da 60m2 che si affacciava su Corso Francia a 550€ + utenze. Viste le spese generali di Torino, mi sembrava abbastanza in linea e contatto il numero di telefono la mattina successiva, riuscendo a strappargli un appuntamento la sera stessa dopo aver insistito. \n\nDopo la visita la casa mi piace talmente tanto che nonostante un po’ di rumore dovuto al fatto che si affacciasse su Corso Francia, decido di ricontattare il numero, dal momento che è pure un privato e che non avrei dovuto pagare l’intermediazione. \n\nCi parlo al telefono per circa mezz’ora e gli spiego che ho un contratto a tempo indeterminato e che sarei disposto ad affittare la casa alle stesse condizioni esposte poco prima durante la visita. Il ragazzo, sulla 30ina, lo stesso che mi ha presentato la casa, mi spiega molto gentilmente che fa parte di uno studio di Torino (esistente, perché ho controllato subito su internet) di amministratori condominiali che gestiscono gli affitti per i proprietari. Mi dice dunque di inviargli i documenti che la mattina seguente avrebbe proposto la casa al proprietario e mi avrebbe fatto sapere. \n\nIl giorno dopo arriva la conferma: il proprietario mi accetta! Mi viene girato un contratto di 8 pagine (classico contratto), con indirizzi e nomi DEL PROPRIETARIO (non del ragazzo con cui parlavo), e mi dice che per bloccare la casa avrei dovuto versare la cauzione entro 24h. Pago la cauzione di 1650€ e pochi giorni dopo mi invia la ricevuta dell’agenzia delle entrate, e mi chiede di pagare, quando avrei voluto ma prima del 10 febbraio, la prima mensilità. \n\nPagata la mensilità il tizio sparisce, e risulta irreperibile. La consegna delle chiavi sarebbe dovuta avvenire domani. Il telefono risulta spento e i messaggi su whatsapp non vengono consegnati. Premetto che non so chi sia il proprietario indicato sul contratto ma proverò comunque ad andare all’indirizzo di Torino che ha indicato sul contratto, e di non sapere neanche come questo abbia avuto le chiavi della casa. Ho fatto ricerche e tutte le referenze che mi aveva dato (e.g. studio di amministratori condominiali) esistono veramente, ma probabilmente ha aperto un conto corrente con carta di identità falsa e il proprietario non esiste. Mi rimane solo l’indirizzo della casa, che io conosco e che ho visitato. \n\nAndrò a fare denuncia nei prossimi giorni senza troppe speranze. Il bello è che ho pure rifiutato altre 5/6 fregature da quando sono arrivato a Torino (1 mese fa), ed é la prima volta che cerco casa in italia. Negli ultimi 2 anni ho cercato e trovato case senza problemi in germania, brasile, olanda e cina, senza mai cadere in una singola fregatura. \n\nQualche allarme che “a posteriori” mi avrebbe potuto far capire che era una fregatura: \n1) Sarei dovuto andare a controllare fisicamente in questo studio, oppure chiamare. Vedendolo esistere non mi sono fatto domande. \n2) Quando mi è arrivata la (falsa) registrazione all’agenzia delle entrate il codice fiscale non corrispondeva a quello indicato sul sito che mi aveva detto lui. \n3) L’accettazione da parte del proprietario é avvenuta alle 10 di mattina (troppo presto?) e tutto il processo in 2 giorni si era praticamente chiuso.\n\nNon insultatemi che sono già abbastanza distrutto psicologicamente. Sono uno stupido? Probabilmente si, ma questa fregatura è stata fatta davvero bene. ",
        "upvotes": 172,
        "comments": 55,
        "media": null,
        "permalink": "/r/torino/comments/1ipjovs/mi_hanno_fregato/"
    },
    {
        "id": "1iqd353",
        "author": "therealbrown01",
        "title": "AAA cercasi rifornimento di spezie",
        "content": "Ciao amici, sono un fuorisede in difficoltà. Da grande amante delle spezie cerco qualcuno che possa rifornirmi qua a Torino, poichè (sfortunatamente😔) il mio rivenditore non è più tra noi. Qualcuno saprebbe aiutarmi, pace. ",
        "upvotes": 0,
        "comments": 27,
        "media": null,
        "permalink": "/r/torino/comments/1iqd353/aaa_cercasi_rifornimento_di_spezie/"
    }
]