[
    {
        "id": "1on8se3",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 27,
        "comments": 3079,
        "media": null,
        "permalink": "/r/realmadrid/comments/1on8se3/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1opto7y",
        "author": "SaniaXazel",
        "title": "Gareth Bale on what it means to be a Madridista🤍",
        "content": "",
        "upvotes": 1000,
        "comments": 56,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zygowvs8mlzf1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1opto7y/gareth_bale_on_what_it_means_to_be_a_madridista/"
    },
    {
        "id": "1oq0c06",
        "author": "Plane_Outside5646",
        "title": "New CBs for REAL MADRID",
        "content": "since alaba and most probably rudiger are leaving this summer, whom would you prefer to be your next 2 cb signings?????\n\n\n1. Upamecano\n2. Marc guehi\n3. Konate\n4. Nico schlotterbeck \n5. Van de ven\n6. Saliba\n7. Bastoni \n\nYou can also name any other options .\nThese are just some names that came to my mind...\n",
        "upvotes": 50,
        "comments": 128,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oq0c06/new_cbs_for_real_madrid/"
    },
    {
        "id": "1opwsfm",
        "author": "cyrusmancub",
        "title": "Tchouameni has a muscle injury in his left leg",
        "content": "",
        "upvotes": 76,
        "comments": 44,
        "media": null,
        "permalink": "/r/realmadrid/comments/1opwsfm/tchouameni_has_a_muscle_injury_in_his_left_leg/"
    },
    {
        "id": "1oq48hm",
        "author": "Roids-in-my-vains",
        "title": "Ronaldo: For me it’s more easy to score goals in Spain, in La Liga… than score in Saudi.",
        "content": "",
        "upvotes": 22,
        "comments": 33,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zb8ttgka2ozf1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1oq48hm/ronaldo_for_me_its_more_easy_to_score_goals_in/"
    },
    {
        "id": "1oq1ylc",
        "author": "Midtharefaikh",
        "title": "Mbappe's positions over his career.",
        "content": "https://preview.redd.it/fh11wd1cmnzf1.jpg?width=554&amp;format=pjpg&amp;auto=webp&amp;s=6e54068b0b0dbc9acff8f94b03ecae432ef37716\n\nHe has played 299 matches as a striker, while only 82 as a Left Winger. He had left that position far behind before even coming to Madrid. Even at the 2020 Euros, when France had literally Benzema as a striker, they were still playing 3-4-1-2, with both Benzema and Mbappe as CF\n\nIt can also be seen that he has had better stats as CF too.\n\nCompare that to Vini, who won the best player in the world award(FIFA the Best) and came second in Ballon d'Or, being one of the main reason Real Madrid had their most succesful season since the 1960's, as a LEFT WINGER.\n\n  \nVini was straight up the best winger in football, for at least 3 years. Even now he has more G/A than any other winger in the world, except for Bayern's\n\n",
        "upvotes": 26,
        "comments": 22,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oq1ylc/mbappes_positions_over_his_career/"
    },
    {
        "id": "1opyj7h",
        "author": "thesenate14",
        "title": "Tired of some of the fans",
        "content": "This isn't aimed at everyone but why do so many so called \"fans\" have agendas with certain players and at certain players? its like people want us to lose want players to perform poorly so they can be \"right \" Mbappe stans Vini stans Jude Stans Rodrygo Stans   man i love this team i love all the players i get annoyed when we lose and criticism should always be welcomed but too many use it for own agendas it makes me want to stay off social media because I know there's barely gonna be any actual real discussions instead just a blame game.",
        "upvotes": 32,
        "comments": 18,
        "media": null,
        "permalink": "/r/realmadrid/comments/1opyj7h/tired_of_some_of_the_fans/"
    },
    {
        "id": "1opwyrr",
        "author": "cyrusmancub",
        "title": "Fede Valverde is not injured and should be fit to face Rayo",
        "content": "",
        "upvotes": 32,
        "comments": 3,
        "media": null,
        "permalink": "/r/realmadrid/comments/1opwyrr/fede_valverde_is_not_injured_and_should_be_fit_to/"
    },
    {
        "id": "1opgslg",
        "author": "CushtyDelBoy",
        "title": "I will just leave it here",
        "content": "Just imagine if we had this treatment tonight, I swear their PR is crazy…\n\nIf you didn’t watch Club Brugge - Barcelona match, please watch highlights. I don’t care about them, but everytime the get helped by referees no one talks about that, while they rip us apart every game. Tonight this and funny red card vs Olympiacos last game… crazy!",
        "upvotes": 321,
        "comments": 51,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/yu5hep9hhizf1.jpeg?auto=webp&amp;s=a8d120121e4c1f2011a96aecdc47fd625abf813c"
        },
        "permalink": "/r/realmadrid/comments/1opgslg/i_will_just_leave_it_here/"
    },
    {
        "id": "1op98yh",
        "author": "braveen10",
        "title": "The guts it took to call out the corruption like this",
        "content": "",
        "upvotes": 626,
        "comments": 42,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/1uvi6gcg4hzf1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1op98yh/the_guts_it_took_to_call_out_the_corruption_like/"
    },
    {
        "id": "1op6div",
        "author": "TheConnstant",
        "title": "WHERE WAS OUR STRIKER ?",
        "content": "Can't even find him in the Frame",
        "upvotes": 780,
        "comments": 185,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9w1k3t6vlgzf1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1op6div/where_was_our_striker/"
    },
    {
        "id": "1op4aeu",
        "author": "No-Independent2522",
        "title": "Its just a game, enjoy while you can 🤍",
        "content": "",
        "upvotes": 791,
        "comments": 58,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gfisnwuo7gzf1.jpeg?auto=webp&amp;s=5e975d4dc5ecb4a704be3e81ba4db609f6b76228"
        },
        "permalink": "/r/realmadrid/comments/1op4aeu/its_just_a_game_enjoy_while_you_can/"
    },
    {
        "id": "1opidzf",
        "author": "justpharaohlol",
        "title": "Zidane's Unforgettable, Carrier-Ending Headbutt Towards Materazzi — A Sacrifice For a Sister That Must Be So Beloved",
        "content": "",
        "upvotes": 105,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/lyc71qxisizf1.png?auto=webp&amp;s=47e1ab913b51ff8ef367394751860469de43cdbc"
        },
        "permalink": "/r/realmadrid/comments/1opidzf/zidanes_unforgettable_carrierending_headbutt/"
    },
    {
        "id": "1op1s3r",
        "author": "brownberriess1",
        "title": "Our wall! 🧱 We've honestly been blessed when it comes to keepers",
        "content": "",
        "upvotes": 582,
        "comments": 28,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/k48hiiv0pfzf1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1op1s3r/our_wall_weve_honestly_been_blessed_when_it_comes/"
    },
    {
        "id": "1oppoll",
        "author": "kafka_esque77",
        "title": "Master of Keeping Things Simple",
        "content": "https://preview.redd.it/x720nomzekzf1.jpg?width=960&amp;format=pjpg&amp;auto=webp&amp;s=b14caee2b2b843cccff4786463e2acb01eb10bda\n\n(Note: This post has nothing to do with Xabi. He will be fantastic for Real Madrid)\n\nCarlo had clearer instructions for defenders. For attackers, it was more about finding ways to liberate them, to find spaces for them to sign. No set philosophy, no strict tactical setup, no demand on what players to sign and what kind. But an old school manager with a good grasp of modern football. I think for big European nights, Carlo (along with Zizou- but they do have similar traits) will always be the one we think of for a long long time. It wasn't always pretty, but boy did they grind out results.. What a man!",
        "upvotes": 27,
        "comments": 23,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oppoll/master_of_keeping_things_simple/"
    },
    {
        "id": "1ooy1yw",
        "author": "dakdakdakp",
        "title": "Gareth Bale: \"Madrid need a number 9\"",
        "content": "“It was just a bit disappointing that final third there wasn’t really that kind of quality you’d expect from Real Madrid players.”  \n  \nThe main focus of Bale’s criticism fell on the attacking area. The Welshman lamented the **\"lack of quality\"** in the final third, directly pointing to figures like Mbappé and Vinicius Júnior: **\"They didn’t produce any magic. It was disappointing that in the final third there wasn’t the quality you expect from Real Madrid\"**. A statement that highlights the club’s reliance on individual brilliance that, on big nights, doesn’t always show up.\n\nThis offensive shortcoming led Bale to identify a structural need: the arrival of a reference center forward. The former footballer explained that crosses and attacking moves were left without a finisher, an obvious tactical gap. **\"Sometimes you need to go and test the defender. There was no one in the box for the crosses. Maybe you need a ‘9’\"**, he concluded, hitting the nail on the head regarding the role of a classic striker.",
        "upvotes": 826,
        "comments": 270,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LGldKGjhrYVUZ_uF5Q9rX1o-cH_mXbejKVyDxVXv0Vg.jpeg?auto=webp&amp;s=10031d6b23f6354635869c56f0d5d95967987363"
        },
        "permalink": "/r/realmadrid/comments/1ooy1yw/gareth_bale_madrid_need_a_number_9/"
    },
    {
        "id": "1op54zw",
        "author": "martino732",
        "title": "One year since this clip, no improvement whatsoever",
        "content": "",
        "upvotes": 259,
        "comments": 86,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/c3v94tpadgzf1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1op54zw/one_year_since_this_clip_no_improvement_whatsoever/"
    },
    {
        "id": "1op4zqb",
        "author": "TheFeatherDiaries",
        "title": "Real Madrid conceded 8 shots directly from set pieces yesternight. They recorded just two shots on target , their fewest in a UEFA Champions League game since their 1-0 win over Liverpool in the 2021-22 final (also 2)",
        "content": "",
        "upvotes": 113,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NqWFtiqgEnxHu_jsFAziLLobu6rsiep2cgGLhZ-KroQ.jpeg?auto=webp&amp;s=90afd7c96bae665d773234ff55904e857e4a1273"
        },
        "permalink": "/r/realmadrid/comments/1op4zqb/real_madrid_conceded_8_shots_directly_from_set/"
    },
    {
        "id": "1ooyzvn",
        "author": "Timothee_C02",
        "title": "Many fans on this sub have clearly never played 11v11 and it shows.",
        "content": "Have you never had a bad day at work? Seriously. How can one bad game suddenly mean we’re trash and need a lots of improvement? If Jude’s chance had gone in, or if Mbappé had just had a slightly better game, this sub would’ve been jerking off to “mentality monsters” posts right now. The hypocrisy is insane.\n\nJust saw a post with Mbappé circled in yellow like, “look, he didn’t close down on that Carreras run!” \n\nBro, have you even *played* football? You think it’s that fucking simple? You think all he had to do was magically predict the ball’s bounce and slot it in? Be serious.\n\nEveryone has off days man. You, me, and our players. Liverpool were just better yesterday. That happens. You can’t win every goddamn game. I wish we were the better team, we weren't. That's that.\n\nWhat really pisses me off though is the hate. The straight-up disrespect toward world-class players — it’s pure *small dick energy*. You don’t have to love everyone, but at least don’t act like you could do better sitting on your ass behind a keyboard.\n\nIf you love this club, act like it. Stop scapegoating. Stop turning on our own. You think throwing shit on a player makes you a smart? No it just makes you look like a clown.\n\nGo outside. Touch some fucking grass. Play an actual 11v11 game. Try tracking back, closing down, finding a smart pass (like Güler tried before getting chopped down in the box), or making a perfect run. You’ll realize half of what you complain about isn’t that simple.\n\nAnd sure let’s talk football, that’s fine by me. For instance, Valverde was uncomfortable at times? Yeah. But he wasn’t ass. He was just out of position. There’s a difference. \n\nThe quality of this sub has fallen off a cliff.\nIf you love this club act like it. Stop being salty little crybabies every time we lose. \n\nOur club is stacked with quality, and we have a top manager too. If it was some other manager and we weren't defensively disciplined it would've been much worse. I am still confident we're the best team in Europe. THE BEST! A 1-0 loss changes nothing.\n\nHala Madrid Y Nada Mas 🤍\n",
        "upvotes": 258,
        "comments": 93,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ooyzvn/many_fans_on_this_sub_have_clearly_never_played/"
    },
    {
        "id": "1op6q5s",
        "author": "cyrusmancub",
        "title": "Real Madrid have made Bayern’s Dayot Upamecano their CB priority and are in pole position to sign him. Konaté is still on the club’s radar but is no longer the priority.",
        "content": "",
        "upvotes": 75,
        "comments": 67,
        "media": null,
        "permalink": "/r/realmadrid/comments/1op6q5s/real_madrid_have_made_bayerns_dayot_upamecano/"
    },
    {
        "id": "1opzuvh",
        "author": "No-Distribution2942",
        "title": "Past and present midfielders at age 20",
        "content": "Just curious, other than Bellingham and Pogba, were there any midfielders at age 20 become superstar or world class?  \n  \nMidfield being an area/ a position where experience is needed the most to develop consistent vision, deep understanding of the overall game, all around technical skills and physical. Usually midfielders showed world class quality relatively late but peaked longer. Historically, I think we often relied on experienced midfielders, rarely providing regular starting chances for young midfield talents.   \n  \nSince the departure of Kroos and Modric, it's been a long time since we have to worry about our midfield. Nowadays, top midfield talents are rare in the market and the best midfielders are not for sale. Comparing with previous time, our club seems to invest more in youngsters mostly recent years, usually below age 20. We are lucky to have Bellingham, Guler, Camavinga in our squad now, who are still young and developing. But obviously expectations inside and outside the club is high as winning trophies is an absolute must every year.  \n  \nKnowing the difference of the expectation in our club (where success is needed immediately rather than rebuilding or long term developing) and other clubs (where long term developing is often emphasized), how do we compare our current midfielders when they were at age 20 - expecially our youngest midfielder Guler, with other midfielders past and present when they were still at age 20, such as Zidane, Modric, Kroos, Ozil, KDB, Iniesta, Xavi, Scholes, Lampard, Gerrard, Pirlo, Vitinha, Rodri, Pedri, and many more?",
        "upvotes": 0,
        "comments": 25,
        "media": null,
        "permalink": "/r/realmadrid/comments/1opzuvh/past_and_present_midfielders_at_age_20/"
    },
    {
        "id": "1oonh60",
        "author": "More-Judgment-9253",
        "title": "Bro did all that for nothing",
        "content": "",
        "upvotes": 1084,
        "comments": 259,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/8nbmpof9vbzf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1oonh60/bro_did_all_that_for_nothing/"
    },
    {
        "id": "1opg7y3",
        "author": "SuckerForSoccer2003",
        "title": "Bellingham Claims Liverpool Fans Don’t Really Hate Alexander-Arnold Despite Boos",
        "content": "",
        "upvotes": 17,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ezOAIJIu18Z1zomgzUXWiv45a3p2jTmcoTmGCqdAUQ8.jpeg?auto=webp&amp;s=1f0ff1a872d1fe996f95a58b0176a4265e250986"
        },
        "permalink": "/r/realmadrid/comments/1opg7y3/bellingham_claims_liverpool_fans_dont_really_hate/"
    },
    {
        "id": "1oozbkh",
        "author": "Gaengsa",
        "title": "Did anyone see how Rodrygo doesn't have the same spark as before when he used to come as sub?",
        "content": "Earlier, he was full of fancy feet. Looking to make darting runs in the middle, burst of energy like you rarely see from anyone. Effortlessly technical. \n\nYesterday, his eyes and body language looked so dull, like he was just doing things for the sake of it. Not sure what to do or how to create spark in the dullness. \n\nBy the way, has he gotten slightly chubbier? \nWhat do you reckon his market value is? ",
        "upvotes": 111,
        "comments": 71,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oozbkh/did_anyone_see_how_rodrygo_doesnt_have_the_same/"
    },
    {
        "id": "1oq2370",
        "author": "Mastermind_737",
        "title": "Just play Jude as a false 9 and let others take up the defensive duties",
        "content": "Jude as a 9 gave us a league and champions league. Let Mbappe and Vini operate on the wings and Jude be that reference. With Valverde back in midfield and Trent at tight back it can easily be done. The decision in attack should be between Arda and Vini similar to Ancelotti with Rodrygo or Valverde and Zidane with Isco or Bale. But Jude and Mbappe like Benzema and Vini before and before that Benzema and Ronaldo have to be there. Always need a big man like Benz and Jude to facilitate the play and bully defenders while creating magic for a goal scoring killer like Vini, mbappe, or Ronaldo to score. \n\nIf the game requires a 3rd attacker then play Vini if not play a midifelder like Arda. \n\nTough decisions, but respect to Zidane for making it work. Especially since he lived this situation under the galácticos where Figo, him, Raúl, and Ronaldo were all trying to fit which weakend the midfield. Casemiro, Modric, Kroos, and Benzema was key. And with Arda improving his defending everyday, could even see him in the Modric role, but still needs a lot of time and experience under pressure before that is an option. \n\nEdit: Think I've touched a midfielder/attacker Goals/assist argument nerve some dudes have with Barca pedri fans. Not my intention at all. I'm just seeing a lack of strength and creativity up top with Mbappe doing a lot of heavy lifting with Jude able to contribute more offensively if he was played in a more effective position for the team. ",
        "upvotes": 0,
        "comments": 27,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oq2370/just_play_jude_as_a_false_9_and_let_others_take/"
    },
    {
        "id": "1ookyt8",
        "author": "SaniaXazel",
        "title": "Despite the defeat, the Real Madrid players come to thank the supporters who made the trip",
        "content": "",
        "upvotes": 813,
        "comments": 29,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/dxlnecogdbzf1/DASH_270.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ookyt8/despite_the_defeat_the_real_madrid_players_come/"
    },
    {
        "id": "1ooiej0",
        "author": "No-Independent2522",
        "title": "Courtois crucial save to deny Liverpool the opening goal",
        "content": "",
        "upvotes": 849,
        "comments": 53,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/wxxavzhovazf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ooiej0/courtois_crucial_save_to_deny_liverpool_the/"
    },
    {
        "id": "1ool0jh",
        "author": "Sorry-Passenger4283",
        "title": "Anfield is crazy tbh",
        "content": "Weird game i'm not gonna lie, the ref was wilding too man\nbut we gotta talk about how insane the anfield atmosphere is, the pressure, the chanting and pretty much a different vibe from any other stadiums\n\nThe atmosphere and pressure at anfield has definitely took a big part in this match.. which leaves the question, how the hell do players handle this kind of pressure? or deal w it \n\nTrent has done nothing when he was subbed in, which of course may be understandable considering where he's playing and who he's playing against and man it must be awful listening to the fans chant whenever he just touches the ball lol\n\nLots of wrong passes and plays and missed chances aswell liverpool were ruthless, i gotta be honest vini went ghost mode aswell man their defense is on point specifically talking about bradley\n\nAnd the amount of tackles carreras was going for against salah is wild man\n\nGrateful for courtois bro saved us devastating and embarrassing goals that may have happend but it hasn't thanks to him, truly man of the match",
        "upvotes": 622,
        "comments": 130,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ool0jh/anfield_is_crazy_tbh/"
    },
    {
        "id": "1ooe8j7",
        "author": "brainybrit",
        "title": "Just leaving this out there🥲",
        "content": "",
        "upvotes": 1282,
        "comments": 64,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/yjb175qk4azf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ooe8j7/just_leaving_this_out_there/"
    },
    {
        "id": "1oogosp",
        "author": "[deleted]",
        "title": "A Real Madrid fan proposed to his girlfriend at Anfield.",
        "content": "❤️",
        "upvotes": 959,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/bu6vpzi6kazf1.jpeg?auto=webp&amp;s=e1bc65e539bf570b9101765bf898aed7b47497c4"
        },
        "permalink": "/r/realmadrid/comments/1oogosp/a_real_madrid_fan_proposed_to_his_girlfriend_at/"
    }
]