[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 10,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 607,
        "comments": 4672,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1ngbunt",
        "author": "Lonely_College2451",
        "title": "Breaking Bad, yay or nay? Bingeable or no?",
        "content": "I'm about to start Breaking Bad for no reason other than that I've heard it's good. \n\nI avoided it I think because my dad raves about it and y'know, when you're a teen and your dad starts raving about something, you're like ew I don't wanna watch that! Well now that I'm older, and I also have a better relationship with my dad, I've learned that I'm allowed to watch/listen to/read the same things he does and like it and it doesn't have to mean anything. \n\nI'm biting the bullet. I saw a reel the other day on Instagram with some dude from the show, played by Giancarlo Esposito, walking out of a room with HALF HIS FACE GONE??? And I was like DAMN! Apparently he knocks his role out of the park and I do love the guy. \n\nSo, am I in trouble? Is it really a great show? Will I find myself sucked in? Be honest lol I wanna know how bad I'm about to fixate on this shit. I wanna know how dynamic and bingeable it is. ",
        "upvotes": 212,
        "comments": 475,
        "media": null,
        "permalink": "/r/netflix/comments/1ngbunt/breaking_bad_yay_or_nay_bingeable_or_no/"
    },
    {
        "id": "1nfww65",
        "author": "Haunting_Tie_589",
        "title": "Are you actually joking?",
        "content": "How DARE they? Like ads aren't bad enough now they block some shows and films unless you go and free?\n\nI am genuinely so angry about this.\n\nWhat do you guys think???",
        "upvotes": 378,
        "comments": 155,
        "media": null,
        "permalink": "/r/netflix/comments/1nfww65/are_you_actually_joking/"
    },
    {
        "id": "1ngkfj4",
        "author": "Aware_Ad_1647",
        "title": "Anyone else planning to boycott the next Jake Paul fight?",
        "content": "They got me good with the Mike Tyson fight, saying all claims of it being rigged were illogical when there is clear footage of Mike Tyson pulling punches. I am for sure not watching anything else with that clown Paul. On top of that, the boxing matches last night had audio issues all night long. Fool me once Netflix....",
        "upvotes": 8,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1ngkfj4/anyone_else_planning_to_boycott_the_next_jake/"
    },
    {
        "id": "1ngs6ec",
        "author": "407ThroatChamp",
        "title": "Random Freezing",
        "content": "Hey! Does anybody else experience random freezing while watching programs? I was JUST watching Brett Favre documentary and it froze, then completely went back to my main home screen on my roku tv. This has been happening for over a year. I've deleted and re-installed the app multiple times. And this action only happens when watching a program on netflix. Hulu, paramount, peacock, prime are all working just fine.\n\n  \nUpdate: I was speaking with customer service via chat. The rep asked for my entire card number to verify my account. Before proceeding, I looked on reddit to see if this was legit and per some convos, it seemed to be. After confirming, the chat ended with the rep stating she sent a password reset link.....I never told her I needed my password reset. I told her I was having an issue with the netflix app freezing. Starting to think I just got scammed.....",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ngs6ec/random_freezing/"
    },
    {
        "id": "1ngd85i",
        "author": "Crackiller1733",
        "title": "Has Netflix not learned from the Tyson/Paul fight ?",
        "content": "Netflix not loading . Is it too many users trying to watch the fight? Like come on this is getting ridiculous. Trying to watch this fight and can’t load. Anyone else having issues?",
        "upvotes": 23,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1ngd85i/has_netflix_not_learned_from_the_tysonpaul_fight/"
    },
    {
        "id": "1ngvjx4",
        "author": "McKenna1981",
        "title": "Cancellations",
        "content": "When is netflix going to realise they're a streaming platform.  \n\nThis means new shows will not attract viewers the instant they drop, because they're already busy binging other shows.\n\nSo they need to stop cancelling new shows within weeks of their first season appearing.\n\nGetting very annoyed with netflix lately.  Rant over.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ngvjx4/cancellations/"
    },
    {
        "id": "1nghavv",
        "author": "Historical-Phrase106",
        "title": "Stand By Me rewatch",
        "content": "I’m rewatching Stand By Me… an iconic film in my opinion… \nThere is a scene where Chris (River Phoenix) tells Gordy (Wil Wheaton) about starting junior high and basically trying to get across to Gordy how intelligent he is… and how middle school will be different than grammar school and it will distance them because Gordy will meet smart guys, unlike the “shop guys” like Chris, Vern and Teddy… \nAnyway… it really reminded me of the scene in Good Will Hunting where Ben Affleck tells Matt Damon that he will kill him if he wastes his intelligence and ends up being a laborer like the rest of them.\nAnyway… I absolutely love both movies… \nClearly, Stand By Me preceded Good Will Hunting so perhaps it was a homage to Stand By Me. ",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nghavv/stand_by_me_rewatch/"
    },
    {
        "id": "1ngk9ba",
        "author": "OfflineBot5336",
        "title": "movie recommendation system",
        "content": "hi, i just wanted to watch some movie/series on netflix but did not find any that catches me. but that's not the reason i post here.   \nwhile looking out for new stuff i kinda got the feeling that a few movies go recommended me much more often on the same page. like one movie about 3 to 4 times? i felt like that's too much. if i don't click on it the first time i wont click on it the second or third time when showing up. this somehow got me look more into it.\n\ni counted them on the page. just the movies that were visible without using the arrows on the right to find more of that genre which resulted in about 100-120 movies/series on average (i counted multiple times). and about 10% of them were duplicates. so every 10th movie got already recommended.   \nafter counting again but with all movies withing a genre/row i got an average of 380 movies/series and from 25-33% duplicates. every third movie was already recommended twice. on average i got about 2-3 movies 4 times on the page. 9 different movies 3 times on the page. on my latest scan i got 35+ movies that showed up 2 times.  \ni always count one page. that means only the movies page, series page, starting page, ...  \none thing i found is that the worst stats were on the series page. the 33% of duplicates were from the series page. the movies page \"only\" went up to 25% at its peak. the starting page was pretty much the average from the series and movie page which should be expected (was at least for me). \n\nthis took me about an evening to figure out and im pretty sure my method is not optimal but i did not expect it to be that bad. like some movies being recommended twice is ok but a fourth of the movies and a third of the series being duplicates is pretty bad. or is this ok? when i want to discover movies i want as much as possible and not the same over and over again..\n\nwhat is your opinion on that?  \n(english is not my native language so sorry for mistakes)",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ngk9ba/movie_recommendation_system/"
    },
    {
        "id": "1nglgnf",
        "author": "EfficiencyHonest9381",
        "title": "Do you like Squid Game or Alice in Borderland more?",
        "content": "The third and final season of Alice in Borderland is just right around the corner. Been seeing an influx of people on YouTube reacting to the show. Squid Game, too, had just recently wrapped up and with a controversial finale at that. \n\nAnyway, I had just finished watching a reactor saying that Squid Game was \"way better produced\" and had \"way better casting\" than AiB. *To each their own* of course, but I guess I was a bit taken aback by this comment since I personally felt like AiB actually took the notch of the survival show genre higher. This is not to say that Squid Game was bad or anything. I also liked Squid Game, especially the first season. In fact, I think that Squid Game had more of a social commentary than AiB. It's just that when it comes to the games and overall premise, I'm definitely more biased towards AiB. \n\nBTW not saying that people should like AiB more than SG. I could see why some people would like SG over AiB. It's just my personal bias when I say that Squid Game is not in any way \"waaaay better\" than AiB. They might be equally good, but SG is definitely not far off better than AiB imo.\n\nFor those who have watched both, which one do you like better?",
        "upvotes": 1,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1nglgnf/do_you_like_squid_game_or_alice_in_borderland_more/"
    },
    {
        "id": "1ngfgui",
        "author": "Watchmethrowhim",
        "title": "Man the announcers on these Canelo Crawford fight have been the most biased weird takes I've ever heard.",
        "content": "Alakel was absolutely beating the brakes off of the Crawford and they couldn't stop talking about how he needed to gain back his focus. Every single round they kept talking about the other guy..",
        "upvotes": 6,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1ngfgui/man_the_announcers_on_these_canelo_crawford_fight/"
    },
    {
        "id": "1ngf709",
        "author": "Real_Bad7735",
        "title": "Why does Netflix not have different format for live sports events?",
        "content": "I have the Canelo Crawford fight playing live on Netflix and wanted to check (in-app) which fight it was on and how many to go to the main event, and the description section looks exactly like it does for movies and TV shows!\n\nEven if you forget about the fights over the last couple of days, there are 20 boxers fighting today, and the list of \"cast members\" on the Netflix description only includes 8 names.\n\nBro, this is one of the biggest boxing events of the century and they can't even do a customized blxing-centric description section that lists the full fight card and maybe even has betting odds, placement on the card, their boxing record or anything? It's boxing, not love island FFS, sort your shit out Netflix and put some effort into your sports entertainment.",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ngf709/why_does_netflix_not_have_different_format_for/"
    },
    {
        "id": "1ngnx2q",
        "author": "Shararizard",
        "title": "Cool series to watch on Netflix in Germany?",
        "content": "Hey I’m looking for some newish series I can find on Netflix Germany. Something kinda horror or thriller? I really liked to the lake, home sweet home, Alice in borderland, Resident Evil,\nDark, 1899 and into the night. Maybe I like to watch sort of sci fi, mystery, action, thriller or horror series… ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ngnx2q/cool_series_to_watch_on_netflix_in_germany/"
    },
    {
        "id": "1ngk1s2",
        "author": "Low-Entertainer7541",
        "title": "Adolescence 4th ep",
        "content": "Hey, so I finished this series last night and I've been reading about it online for the last couple of hours. I understood the whole context of the series- towards the whole anti women propaganda mivement thing that a 13 yo can be affected by through the internet, misogyny, toxic masculinity, bullying etc etc and the whole psychology behind it. but in the 4th ep, i did not understand the point of showing that whole car ride where the mum dad and sister are bonding while they go to the store. i mean... what was the point of those 15-20 mins? Was it to show how they're trying to live despite Jamie's actions? Or was it only like that because it's a one take show? i understood the coming back home ride when Jamie calls, but i'm very confused about the going to the store ride where the mum and dad talk about their first meet and stuff like that.",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ngk1s2/adolescence_4th_ep/"
    },
    {
        "id": "1ngegmq",
        "author": "khon24",
        "title": "Is anyone getting 4k on the Canelo Crawford stream?",
        "content": "I asked chat support earlier if the fight would be broadcast in 4K before I upgraded my account to premium and they had to go check with their team for 10 minutes but ultimately said yes it will be. So I upgraded and of course it’s still 1080p. Is anyone getting 4k?",
        "upvotes": 5,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1ngegmq/is_anyone_getting_4k_on_the_canelo_crawford_stream/"
    },
    {
        "id": "1ngepf5",
        "author": "Fancy_Dev",
        "title": "Anyone else having trouble watching the fight?",
        "content": "Been having trouble watching the fight. It keeps showing me the feed in 144p and it looks really awful. I have more than enough bandwidth to stream the event at max quality.",
        "upvotes": 4,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1ngepf5/anyone_else_having_trouble_watching_the_fight/"
    },
    {
        "id": "1ngbku7",
        "author": "CollectionOk8963",
        "title": "Can I get the boxing match tonight on a with ads subscription ? Don’t have Netflix so I’m just wondering what plan I’d need for the fight",
        "content": "Does the ad free subscription work for the fight tonight? I’m trying to watch the canelo fight I don’t have Netflix but just wanted to see if the 7.99 plan would still get the fight .. thanks ",
        "upvotes": 4,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1ngbku7/can_i_get_the_boxing_match_tonight_on_a_with_ads/"
    },
    {
        "id": "1ngd0l4",
        "author": "Fit-Force-9125",
        "title": "Should I watch Komi Can’t Communicate",
        "content": "  Recently got recommended and I watched the trailer , I want to know what you guys thought of this show and If I should check it out??? Let me know if it’s good!! ",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1ngd0l4/should_i_watch_komi_cant_communicate/"
    },
    {
        "id": "1ngb4cq",
        "author": "Financial-Wish-311",
        "title": "What is the big deal about Canelo Crawford?",
        "content": "Netflix is calling it 'once in a life time'. Crawford is going to get absolutely schooled. Crawford is punching above his weight here literally. Can see Canelo coasting to victory. But what I can't get is the hype. Why is this supposedly a ‘Super fight'",
        "upvotes": 4,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1ngb4cq/what_is_the_big_deal_about_canelo_crawford/"
    },
    {
        "id": "1nghfd3",
        "author": "FunnyStuff575",
        "title": "Canelo fight",
        "content": "So I can’t watch the fight live on my tv? I have to stream it from another device?  And, they can’t inform you when you try? This is literally the most fcked thing ever. It ranks right up there with Thursday night football on Amazon, always lagging the picture. I’d blame my connection, but I get gig speed. ",
        "upvotes": 0,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1nghfd3/canelo_fight/"
    },
    {
        "id": "1nfx3r9",
        "author": "Thick_Difficulty_247",
        "title": "Anyone Can Delete Profiles?",
        "content": "I have an adult account on Netflix and two child accounts. Is there anyway to stop the child accounts from being able to delete each other? They do this to spite and it’s a real inconvenience having to set it up all the time.\n\nI did look and the answer was no but this was 2 years ago so thought maybe I’d see if anything has changed!",
        "upvotes": 12,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1nfx3r9/anyone_can_delete_profiles/"
    },
    {
        "id": "1ngp88v",
        "author": "RevolutionaryRush717",
        "title": "The Witcher S4 - doomed?",
        "content": "S2 and S3 marginalized the Witcher in favor of the female characters, to a point where fans tuned out, and Henry Cavill removed himself from the series.\n\nNetflix's ability to screw up promising series, e.g., The Night Agent, with a horrible new season.\n\nAgainst this backdrop, will S4 even stand a chance? ",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1ngp88v/the_witcher_s4_doomed/"
    },
    {
        "id": "1ngelby",
        "author": "LaBeef73",
        "title": "What type of intro",
        "content": "Dana white’s stamp is all over the production for Canelo vs Crawford. But this dry intro for the announcer needs to be changed. Idk give a fly fuck if Voldemort sponsored this fight keep the camera on the fighters. And keep it short a sweet.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ngelby/what_type_of_intro/"
    },
    {
        "id": "1ng708n",
        "author": "NftxCrypto",
        "title": "Thoughts on Incantation",
        "content": "I found it to be a great Movie.I was hooked to the screen from the first minute.The visuals,lore,and acting were all great.I am more intrigued by these kind of traditional lores which are creepy rather than some cheap jumscares.But somehow i feel it heavily under appreciated.Let me know your thoughts on these and some recommendations too.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ng708n/thoughts_on_incantation/"
    },
    {
        "id": "1ngc1ub",
        "author": "Khyranos",
        "title": "Could watch movie yesterday, but not today. Now only giving me a 'reminder' option.",
        "content": "Was watching this yesterday/early this morning (I work overnight), and it won't let me watch it now, instead only giving me an option to 'remind' me. What gives?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ngc1ub/could_watch_movie_yesterday_but_not_today_now/"
    },
    {
        "id": "1ng6qfh",
        "author": "CWill4",
        "title": "Can I watch the Crawford vs Alvarez fight the next day?",
        "content": "The fight is Saturday night but im not available to watch it. Will I be able to go to it tomorrow and watch it? Im not sure how live events work and I can't find an answer.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ng6qfh/can_i_watch_the_crawford_vs_alvarez_fight_the/"
    },
    {
        "id": "1nfz519",
        "author": "Jealous-Car-151",
        "title": "Kpop Demon Hunters: Fireplace?",
        "content": "Anybody getting this when they search Kpop demon hunters? The images are the only things that pop up on the screen. There is no video or anything it’s just a blank screen. I searched on google and nothing is popping up either. ",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1nfz519/kpop_demon_hunters_fireplace/"
    },
    {
        "id": "1ngaftx",
        "author": "Karionnn",
        "title": "Netflix stuck at loading",
        "content": "As title says, Netflix is stuck on loading, already tried most suggestions like restarting internet, clearing cache, restarting phone, and clearing data\n\nYet this pos still wont work, any suggestions?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ngaftx/netflix_stuck_at_loading/"
    },
    {
        "id": "1nga0vi",
        "author": "kalat1979",
        "title": "Home For Christmas Season 3, New Locations",
        "content": "Any news on when season 3 is dropping? \n\nHave any new locations been announced? I loved both I Hate Christmas and Yoh! Christmas, I hope they keep redoing the story in new countries. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nga0vi/home_for_christmas_season_3_new_locations/"
    },
    {
        "id": "1ng9x2f",
        "author": "chaotic-kotik",
        "title": "Subtitles are missing on Dutch Netflix",
        "content": "Hey folks. I have a slightly strange question. I noticed that many shows on Netflix in the Netherlands have no Dutch or English subtitles. For instance, one punch man has only German subtitles and Demon Slayer has only French subtitles. Why is that?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ng9x2f/subtitles_are_missing_on_dutch_netflix/"
    },
    {
        "id": "1ng9s53",
        "author": "razor_guy",
        "title": "17-year .NET dev curious about making the leap to Netflix - realistic or pipe dream?",
        "content": "I’ve been a C# .NET developer for my entire 17-year career, primarily building domain-driven, object-oriented internal line-of-business web applications on smaller teams (never more than 10 people).\n\nI keep seeing Netflix salaries posted online and they’re significantly higher than what I’m making here on the east coast (Pennsylvania). It’s got me curious about what actually drives those compensation levels - is it the scale, the technical complexity, the culture, or something else entirely?\n\nI realize complexity probably varies wildly between teams at Netflix, so maybe this is impossible to answer broadly. But I guess what I’m really wondering is: do I have what it takes to work there?\n\nI don’t consider myself anything special - just a solid software engineer who enjoys problem-solving. But when I see those salary numbers, I can’t help but wonder if there’s a whole different level of engineering happening that I’m not exposed to in my current role.\n\nHas anyone made a similar transition from traditional enterprise development to a company like Netflix? What was the biggest adjustment?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ng9s53/17year_net_dev_curious_about_making_the_leap_to/"
    }
]