[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 35,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 9,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pr6ly8",
        "author": "TheMirrorUS",
        "title": "Anthony Joshua slammed as Netflix viewers claim Jake Paul fight was 'rigged'",
        "content": "# Anthony Joshua secured a sixth-round victory over Jake Paul, but fans claimed that the fight was rigged after barely any punches landed in the opening three rounds. Thoughts? ",
        "upvotes": 1901,
        "comments": 665,
        "media": null,
        "permalink": "/r/netflix/comments/1pr6ly8/anthony_joshua_slammed_as_netflix_viewers_claim/"
    },
    {
        "id": "1prc2ys",
        "author": "Notoriously_So",
        "title": "Netflix Has Stopped Allowing Streaming From Phone to TV: How to Watch Now",
        "content": "",
        "upvotes": 418,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1prc2ys/netflix_has_stopped_allowing_streaming_from_phone/"
    },
    {
        "id": "1prznk4",
        "author": "livvvo",
        "title": "AI Ads and Altered Scenes",
        "content": "I can't post the video here, but Netflix altering old movies to not only include AI ads, but also cutting and altering scenes to make their ads more apparent is way too far...especially when I pay for NO ads! \nThey cut/altered a scene within the first few minutes of Titanic — in the original, as they're letting the robot submarine out the guy says “I'm walking the dog” and on glasses/goggles that say “Snoop Dogg” and it's cuts to a robot with the same name.\nIn the Netflix upload, it cuts to some guy saying “I'm launching Dunkin' now\" and it's a robot with a Dunkin' sticker on it, and the guy's glasses say Dunkin'....then proceed to say “Snoop Dogg” for the rest of the scene which now makes no sense! And the movie is from 1997 when “Dunkin'” was still  “Dunkin Donuts”!! I'm sure this is just the tip of the iceberg (pun intended). This is just unacceptable. ",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1prznk4/ai_ads_and_altered_scenes/"
    },
    {
        "id": "1prv49x",
        "author": "lyndseyanne2020",
        "title": "Ripple",
        "content": "This show is so good! The cancer part is a bit phony, everyone looks too healthy. But i noticed Marci House is reading the Handmaids Tale in the scene with her gf! ",
        "upvotes": 11,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1prv49x/ripple/"
    },
    {
        "id": "1ps0jee",
        "author": "harpreetthind",
        "title": "Question about orange is the new black",
        "content": "What’s everybody’s favorite episode of Orange is the new black I like where DIA got killed by a statue\nWhat is everybody else think? Thanks for your replies. In the comments.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ps0jee/question_about_orange_is_the_new_black/"
    },
    {
        "id": "1ps0si2",
        "author": "Maleficent-Page-3064",
        "title": "The Greatest Business Moves of All Time",
        "content": "https://medium.com/write-a-catalyst/the-greatest-business-moves-of-all-time-explained-61ef1caf1130?sk=664a7ee12b7623ce8d2c3f67236ee183\n\nFind out why netflix is one of them.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ps0si2/the_greatest_business_moves_of_all_time/"
    },
    {
        "id": "1pr08s8",
        "author": "Southern-Brother5693",
        "title": "James Bond Films To Air On Netflix As Part Of Shock Deal With Amazon",
        "content": "",
        "upvotes": 318,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1pr08s8/james_bond_films_to_air_on_netflix_as_part_of/"
    },
    {
        "id": "1prfu83",
        "author": "PearBlaze",
        "title": "Shows like Teenage Bounty Hunters?",
        "content": "I watched this show and absolutely loved it but of course it got cancelled after a season, probably because of that stupid sounding title 😭. I need a show with the same vibes, similar setting, and similar chemistry between the leads. Thank you in advance.",
        "upvotes": 10,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1prfu83/shows_like_teenage_bounty_hunters/"
    },
    {
        "id": "1prn0jp",
        "author": "toodley-doodley-doo",
        "title": "Sweet Magnolias",
        "content": "I just started watching this series. Why is Dana Sue always grumpy and brooding and pouting and easily upset? Why? Why do they call her Dana Sue? Just Dana isnt okay? It’s so cringey too! 😩😫",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1prn0jp/sweet_magnolias/"
    },
    {
        "id": "1prsj0u",
        "author": "supe-not-so-smooth",
        "title": "Love Hard 2",
        "content": "IMO, “Love Hard” was one of the best Christmas movies to have come out in years…I was under the impression it was very successful - how have we not had a sequel?!  Was there something else at play blocking this, or was it never intended?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1prsj0u/love_hard_2/"
    },
    {
        "id": "1prvs0o",
        "author": "Ill_House_7721",
        "title": "Peaky Blinders….DV/Atmos???",
        "content": "So I just updated my whole home theater to the latest bells and whistles, and therefore upgraded my Netflix subscription to the 4K version. Yes, I totally notice a difference on Netflix titles that broadcast with Dolby Vision and Dolby Atmos. HOWEVER, with Peaky Blinders, it is advertised in the description as being DV/Atmos, yet it only displays as HD/5.1. I’ve called Netflix twice about the issue and they say they are ‘looking into it’. It’s been over two months now. So far this is the only title I’ve come across that has this issue. I just joined this group to see if anyone else is having this issue. Either no one has noticed or they don’t really care? Haha ….so, I’m just wondering, for those with the 4K subscription service, are you able to view Peaky Blinders in DV/Atmos??? I’m in Canada btw so I’d be interested to know that if it DOES work for you, what country are you in. Thanks!! 🙏🏻 ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1prvs0o/peaky_blindersdvatmos/"
    },
    {
        "id": "1prj2a6",
        "author": "AggravatingShow2028",
        "title": "Has anyone watched The Elixer? Thoughts?",
        "content": "WHAT WAS THAT?!? This movie had so much potential to be great and yet the characters made every single dumb decision known to man. Have they ever heard of a zombie? It kept me entertained but still. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1prj2a6/has_anyone_watched_the_elixer_thoughts/"
    },
    {
        "id": "1pr9cpj",
        "author": "angryrobot5",
        "title": "What are the best Korean films and movies to watch?",
        "content": "I'm going to be doing a computer science internship in Seoul in the upcoming summer, so I wanted to ask if anyone here had any good recommendations for Korean media on Netflix so I can get an idea of how Korea is before the summer!",
        "upvotes": 12,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1pr9cpj/what_are_the_best_korean_films_and_movies_to_watch/"
    },
    {
        "id": "1prg9u8",
        "author": "No-Syrup-3746",
        "title": "Volume drops after a loud scene",
        "content": "So many shows do the thing where there's a big action scene and then it cuts to a quiet dialogue scene. The dialogue is so low it's inaudible, and over the course of 30 seconds or so it fades back up to normal. I feel like this must a normalization issue, but maybe it's a buffering thing? I have fiber internet and no issues. This ONLY happens on Netflix so I assume the issue is not with my TV or setup.\n\nI have an old Samsung Smart TV, stereo setup. I have Netflix set to 2.0 audio out. I cannot change audio settings on my TV when using external speaker output. \n\nHas anyone else experienced this? Any ideas?",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1prg9u8/volume_drops_after_a_loud_scene/"
    },
    {
        "id": "1prnpye",
        "author": "Competitive-Buy4554",
        "title": "Previews",
        "content": "The trailers/ previews are suddenly in dub and I don’t know why. How do I turn this off? It’s really bothersome because I watch a lot of series and movies of other languages. I",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1prnpye/previews/"
    },
    {
        "id": "1ps08wr",
        "author": "satownsfinest210",
        "title": "The Dave Chapelle special.",
        "content": "If you don’t like Dave I get it. But these aren’t comedy specials he’s doing anymore, not how we are used to them.  I don’t have the words to describe it.  I want to say lecture but it’s not a lecture. Anyway special 5/5 content.  3/5 maybe 2/5 if you just want to laugh. ",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1ps08wr/the_dave_chapelle_special/"
    },
    {
        "id": "1prgqeb",
        "author": "ErSugo",
        "title": "netflix microlags worsen quality to 600p",
        "content": "Hello, I have been experiencing for a while now problems with netflix quality and I think it's not a netflix problem. I tried both chrome and edge(also netflix \"web app\" from w store) but after a minute of watching, a micro-lag worsen quality and audio is out sync until I go 10sec back to syncronize them back. It does these microlags again and again until 600p quality, even if it's set to max quality in netflix settings.\n\nI tried to deactivate all extensions, contact netflix about it, restart, activate and deactivate hardware acceleration, tried firefox, updated everything but it seems like I can't solve this problem. I have a surface pro x elite and internet connection is not the problem\n\nHas this ever happened to some of you guys? It's so annoying",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1prgqeb/netflix_microlags_worsen_quality_to_600p/"
    },
    {
        "id": "1prw16e",
        "author": "Only-burritos2019",
        "title": "Is there a way to turn off ads specific to the show you’re watching?",
        "content": "Me and my family are watching Stranger Things relatively spoiler free and the ads specific to the show/showing things related to the later seasons are kinda pissing us off because we’d want to not have any spoilers of any kind (no matter how minor they are), so kinda what I’m getting at is if there’s a way to stop showing Ads specific to the show without having to pay for a higher subscription.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1prw16e/is_there_a_way_to_turn_off_ads_specific_to_the/"
    },
    {
        "id": "1pqpo4u",
        "author": "ConversationHairy606",
        "title": "Looking for Netflix recommendations around crime, cybercrime, or privacy",
        "content": "I have been on a bit of a kick watching shows and documentaries about crime, cybercrime, hacking, data leaks, and privacy related topics.\n\nI have already seen a lot of the obvious ones, so I am hoping to find things that might be a bit less mainstream. Could be documentaries, docuseries, or even fictional shows that feel grounded in reality. Anything that explores how data is abused, how scams work, or how technology intersects with crime would be great.\n\nWhat are some good Netflix titles that fit that space",
        "upvotes": 74,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1pqpo4u/looking_for_netflix_recommendations_around_crime/"
    },
    {
        "id": "1prgn3t",
        "author": "ImJstHrBcMyBrowser",
        "title": "Yakamoz S-245 a sequel i wasn't expecting",
        "content": "So i was watching \"Yakamoz S-245\" on Netflix, wich was pretty new. and i was well a little enjoying it, its not perfect but its got its flare. and at the end of the season i saw something genius... i saw the ending playing into the ending of \"Into the Night\". a Series wich i freaking enjoyed the hell off, mostly cause it gave me those SCP-001 vibes and cause the direction was awesome. Netflix gave me my unofficial sequel to one of my favorite Netflix originals. thx for that, too bad i couldn't enjoy more since that was the last episode, but holy cow what a rollercoster of emotions. #ThanksNetflixKeepItUp",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1prgn3t/yakamoz_s245_a_sequel_i_wasnt_expecting/"
    },
    {
        "id": "1pqx2tt",
        "author": "ala_lala",
        "title": "Murder in Monaco: HELP",
        "content": "Just watched murder in monaco and there was no evidence presented. It was all people's personal opinions. Huge documentary watcher and typically we get evidence and facts but the only thing that was played was recorded calls with the nurse. Shout if you disagree but this was super subjective and I even tried to research after to no avail. Reddit pls do your thing and enlighten me 😭😭🙏🙏 (also tell me if you disagree, here for opposing viewpoints) ",
        "upvotes": 23,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1pqx2tt/murder_in_monaco_help/"
    },
    {
        "id": "1prea4b",
        "author": "ChapterScared3240",
        "title": "AJ vs Paul Replay?",
        "content": "On the replay it does not show the main event. Is my Netflix broken or are they not releasing that?\n\nI am trying to watch from the UK.\nI am pretty sure they have uploaded the Harvey vs Cervantes fight twice. \n\nAnyone experiencing the same thing? \nNetflix explicitly states that you can watch the replay on their service. \n",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1prea4b/aj_vs_paul_replay/"
    },
    {
        "id": "1prowyq",
        "author": "Sikno0h",
        "title": "I need help my Netflix not working",
        "content": "I use my Netflix from 2 countries one side of the fam uses it in a county the same account in another country one of them uses TV like log in immediately but now there’s this and it’s been like this for 2-3days now ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1prowyq/i_need_help_my_netflix_not_working/"
    },
    {
        "id": "1prlebe",
        "author": "baribanana",
        "title": "What was the point of the great flood?",
        "content": "I'm wondering if i missed something. What was the point of all that trauma? Is the new human race going to be about mothers and sons? Or surviving apocalyptic events? Is everyone going to have the same emotions? Where are the fathers? The men? How do they fit in this new world?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1prlebe/what_was_the_point_of_the_great_flood/"
    },
    {
        "id": "1pr0tbp",
        "author": "L0v3_1s_War",
        "title": "STEEL BALL RUN JoJo’s Bizarre Adventure | Official Trailer | Netflix | Premieres March 19, 2026",
        "content": "",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pr0tbp/steel_ball_run_jojos_bizarre_adventure_official/"
    },
    {
        "id": "1pqb7hx",
        "author": "Notoriously_So",
        "title": "‘Last Samurai Standing’ Renewed for Season 2 at Netflix",
        "content": "",
        "upvotes": 213,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1pqb7hx/last_samurai_standing_renewed_for_season_2_at/"
    },
    {
        "id": "1pqsryt",
        "author": "starmaxeros",
        "title": "Netflix acquires gaming avatar maker Ready Player Me | TechCrunch",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pqsryt/netflix_acquires_gaming_avatar_maker_ready_player/"
    },
    {
        "id": "1pri7cj",
        "author": "scoutishbeauty",
        "title": "Netflix UX is the worst for neurodivergent folks",
        "content": "It feels like the neurodivergent community has been completely left out of any/all UX research focus groups and with every change they make it just gets worse and more frustrating.\n\nDoes anyone else feel this way? \n\nIt seems like they’re prioritizing form over function. \n\nI won’t list all of the things that bother me, but some of the newest changes that are particularly frustrating are: \n\nWith these large photo arrays you are now unable to see if you’ve rated any of them. I have ADHD (and am likely AuDhd) so my memory is complete garbage. I am very ritualistic about rating each thing so that I’m aware if I’ve seen it already. So, not only can I not see if I’ve rated (watched) but now when you click on said pictures it just goes straight into playing it. Now I’m wasting a bunch of time on just figuring this out and that’s really frustrating.\n\nTied into the above, the recommendations are now showing A LOT of things I’ve already seen which makes zero sense to me especially considering that I rate them so it’s pretty clear I’ve seen it from a data standpoint. \n\nFellow neurodivergent folks - what bothers you?\n\nNetflix UX really needs to do specific focus groups to help us with accessibility. I’m at max annoyance and I’m sure I’m not alone. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pri7cj/netflix_ux_is_the_worst_for_neurodivergent_folks/"
    }
]