[
    {
        "id": "1lumzpk",
        "author": "LarryCharlesAMA",
        "title": "Hi reddit, I'm Larry Charles. You might know me as the director of BORAT, BRUNO, THE DICTATOR, and DICKS: THE MUSICAL. I’ve also directed many of your favorite episodes of CURB YOUR ENTHUSIASM &amp; wrote many of your favorite SEINFELD episodes. My new book, COMEDY SAMURAI, is out now. Ask me anything!",
        "content": "Hi reddit, I'm Larry Charles. You might know me as the director of BORAT, BRUNO, THE DICTATOR, RELIGULOUS, DICKS: THE MUSICAL, MASKED AND ANONYMOUS and ARMY OF ONE. I’ve also directed many of your favorite episodes of CURB YOUR ENTHUSIASM and wrote many of your favorite SEINFELD episodes. My new book, COMEDY SAMURAI, is out now. It chronicles my life and work in the battleground of American comedy. Please, I beg you, ask me anything!\n\n**Here's where you can purchase my book:**\n\n[https://www.hachettebookgroup.com/titles/larry-charles/comedy-samurai/9781538771549/?lens=grand-central-publishing](https://www.hachettebookgroup.com/titles/larry-charles/comedy-samurai/9781538771549/?lens=grand-central-publishing)\n\nAsk me anything! I'll be back at 3 PM ET today to answer your questions.\n\n**Bio and more information:**\n\nFrom Peabody, Golden Globe, and Emmy Award-winning writer/producer/director Larry Charles, COMEDY SAMURAI: 40 YEARS OF BLOOD, GUTS, AND LAUGHTER is a rollicking journey through modern American comedy, as he shares behind-the-scenes stories from his life\\&amp;#39;s work.\n\nGrand Central will publish Charles’s memoir on June 17, 2025. To tell Larry Charles’s life story is to tell the story of modern American comedy. Over the last 40 years, few comedians have been a part of so many iconic, beloved projects. Larry was one of the original writers and producers on the first five seasons of Seinfeld, executive produced both Curb Your\n\nEnthusiasm and Entourage while directing 18 episodes of Curb and served as the showrunner for Mad About You. His film directing credits include Borat, Bruno, and The Dictator, the comic documentary Religulous (starring Bill Maher), and Masked and Anonymous (which he co-wrote with Bob Dylan who stars).\n\nIn Comedy Samurai, Charles pulls back the curtain on the making of his successful projects, offering sharp, never-before-told anecdotes about Jerry Seinfeld, Sacha Baron Cohen, Bill Maher, Bob Dylan, Nic Cage, Mel Brooks, Julia Louis-Dreyfuss, and Larry David, among many others.\n\nLarry Charles rose from the mean streets of Brooklyn and the working-class housing projects of Donald Trump’s nefarious father Fred, to become the director of Borat, Bruno, The Dictator and Religulous amongst others. He directed Bob Dylan and an all-star cast (Jeff Bridges, John Goodman, Jessica Lange and Penelope Cruz among others) in the film, Masked an Anonymous which he and Dylan wrote together. He has also directed numerous episodes of Curb Your Enthusiasm and was one of the original writers and producers of Seinfeld. Larry is a Peabody, Golden Globe, and Emmy-award winner. Since the Malibu fires, he, and his wife and two dogs are vagabonds.\n\nBack at 3 PM ET to answer your questions!\n\n\n\n",
        "upvotes": 234,
        "comments": 248,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/pk0c6pt13nbf1.jpeg?auto=webp&amp;s=c5eb6c3d1705132602f36864169aaf4a15394d77"
        },
        "permalink": "/r/movies/comments/1lumzpk/hi_reddit_im_larry_charles_you_might_know_me_as/"
    },
    {
        "id": "1lv75s0",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Jeremy Sumpter - Monday 7/14 at 5:00 PM ET - Lead Actor of 2003's 'Peter Pan'",
        "content": "",
        "upvotes": 46,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/15qof5m2crbf1.png?auto=webp&amp;s=9f9f7412c4a557abd267de7366681d3b45895728"
        },
        "permalink": "/r/movies/comments/1lv75s0/amaqa_announcement_jeremy_sumpter_monday_714_at/"
    },
    {
        "id": "1lvfx6u",
        "author": "ICumCoffee",
        "title": "New Image of Josh O'Connor and Daniel Craig in Rian Johnson's 'Wake Up Dead Man: A Knives Out Mystery'",
        "content": "",
        "upvotes": 5232,
        "comments": 310,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/iakipqlxytbf1.jpeg?auto=webp&amp;s=097249bc2b195fc779006ea198cedf5e8470c454"
        },
        "permalink": "/r/movies/comments/1lvfx6u/new_image_of_josh_oconnor_and_daniel_craig_in/"
    },
    {
        "id": "1lvl0e8",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Ron Howard's 'EDEN'",
        "content": "",
        "upvotes": 1076,
        "comments": 316,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xu3h19595vbf1.jpeg?auto=webp&amp;s=1bcd11de71e2f1fec6b328647f6e50f55ddc5ed4"
        },
        "permalink": "/r/movies/comments/1lvl0e8/official_poster_for_ron_howards_eden/"
    },
    {
        "id": "1lvi6b8",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Darren Aronofsky’s 'Caught Stealing'",
        "content": "",
        "upvotes": 1343,
        "comments": 245,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5rinoptsjubf1.jpeg?auto=webp&amp;s=fc308deaa6ac15c2b64298393911b258a19c8c00"
        },
        "permalink": "/r/movies/comments/1lvi6b8/official_poster_for_darren_aronofskys_caught/"
    },
    {
        "id": "1lvgyop",
        "author": "MarvelsGrantMan136",
        "title": "A24 to Release Chinese Animated Blockbuster ‘Ne Zha 2’ in U.S. Theaters, With Michelle Yeoh Leading English Voice Cast (Opens August 22)",
        "content": "",
        "upvotes": 329,
        "comments": 51,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pF6re80f-JNqaqZASpzYXnCbHBtCm-SQLgP1SVRQ6O4.png?auto=webp&amp;s=f1e7fe1bc126af582d6b26c8f73643593ca7da8d"
        },
        "permalink": "/r/movies/comments/1lvgyop/a24_to_release_chinese_animated_blockbuster_ne/"
    },
    {
        "id": "1lut620",
        "author": "MarvelsGrantMan136",
        "title": "Denis Villeneuve’s ‘Dune 3’ Gets Official Title 'Dune: Part Three', Will Be Shot With Imax Cameras",
        "content": "",
        "upvotes": 14620,
        "comments": 1502,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/AIDadH49N1ZgX5rCrWnVJ--85poerbVbQtG43LY0_No.jpeg?auto=webp&amp;s=12132d558addd68a18682a884e7e49c2ddd04d5e"
        },
        "permalink": "/r/movies/comments/1lut620/denis_villeneuves_dune_3_gets_official_title_dune/"
    },
    {
        "id": "1lv1i7s",
        "author": "MarvelsGrantMan136",
        "title": "Max Will Change Back to HBO Max on Wednesday (July 9)",
        "content": "",
        "upvotes": 3023,
        "comments": 298,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sK7fuQBNLwofGFxTZpD4tO6ycgLavavpd_AOvY9-aEU.jpeg?auto=webp&amp;s=6fe96cae62f6d0454d58504b7faf20649e5f721e"
        },
        "permalink": "/r/movies/comments/1lv1i7s/max_will_change_back_to_hbo_max_on_wednesday_july/"
    },
    {
        "id": "1lux4kl",
        "author": "ICumCoffee",
        "title": "'Superman' - Review Thread",
        "content": "[**Rotten Tomatoes:**](https://www.rottentomatoes.com/m/superman_2025) **87% (135 Reviews) -**  ***Certified Fresh***\n\n* **Critics Consensus**: Pulling off the heroic feat of fleshing out a dynamic new world while putting its champion's big, beating heart front and center, this Superman flies high as a Man of Tomorrow grounded in the here and now.\n\n[**Metacritic**:](https://www.metacritic.com/movie/superman-2025/) **71 (42 Reviews) -** ***Generally Favorable***\n\nReviews:\n\n[Variety (80)](https://variety.com/2025/film/reviews/superman-review-james-gunn-david-corenswet-1236444126/)\n\n&gt;The super-busy quality of “Superman” works for it and, at times, against it. The movie rarely slows down long enough to allow its characters to meditate on their shifting realities. That’s one reason it falls short of the top tier of superhero cinema (“The Dark Knight,” “Superman II,” “The Batman,” “Guardians”). I’d characterize the film as next-level good (a roster that includes “Iron Man,” “Thor,” “Batman Begins,” “Captain America,” and the hugely underrated “Iron Man 3”). Yet watching “Superman,” we register the layered quality of the conflicts, and we’re drawn right inside them. Gunn constructs an intricate game of a superhero saga that’s arresting and touching, and occasionally exhausting, in equal measure\n\n[The Hollywood Reporter (80)](https://www.hollywoodreporter.com/movies/movie-reviews/superman-review-david-corenswet-rachel-brosnahan-james-gunn-1236305764/)\n\n&gt;What matters most is that the movie is fun, pacy and enjoyable, a breath of fresh air sweetened by a deep affection for the material and boosted by a winning trio of leads.\n\n[DEADLINE](https://deadline.com/2025/07/superman-review-james-gunn-reboot-1236450641/)\n\n&gt;Overall, Gunn might be trying to do too much here, basically throwing everything against the wall and hoping some of it sticks. More than enough does in this entertaining new direction, but at times *Superman* suffers from overload, much like Gunns’ *Guardians of the Galaxy* trilogy, which wore out its welcome with Vol. 3 where Rocket unfortunately got the *Babe: Pig in the City* treatment. Nevertheless he is a talented and skilled director, no question, and one with optimism himself. It will be interesting to see where the future lies for DC under his (and Safran’s) more hopeful vision.\n\n[Indiewire (58)](https://www.indiewire.com/criticism/movies/superman-movie-review-james-gunn-1235137386/)\n\n&gt;Gunn is right to recognize that a certain amount of silliness is key to Superman’s charm, but here it mostly just distracts from the seriousness of what’s at stake. It’s hard to make a comic book come to life at the same time as you’re trying to bring life into a comic book, just as it’s hard not to admire Gunn for trying. But it’s even harder to care if a man can fly when there isn’t any gravity to the world around him. Grade: C+\n\n[IGN (8)](https://www.ign.com/articles/superman-2025-review-james-gunn-david-corenswet-rachel-brosnahan-nicholas-hoult)\n\n&gt;Superman is a wonderfully entertaining, heartfelt cinematic reset for the Man of Steel, and a great new start for the DC universe on the big screen.\n\n[The Atlantic (90)](https://www.theatlantic.com/culture/archive/2025/07/superman-movie-2025-review/683462/)\n\n&gt;The First Superman Movie Worth Watching in Years. The newest take on the caped hero wisely embraces his corniness.\n\n[Consequence (83)](https://consequence.net/2025/07/superman-review-james-gunn-2025/)\n\n&gt;Grim and gritty are words this movie firmly rejects, instead leaning into the human side of everyone involved, even its villains. There are a few choices that work less well than others, but the end result is a movie that doesn't sacrifice its titular character in service to franchise-building. Instead, it focuses on celebrating the values that Superman himself has embodied from the beginning.\n\n[Collider (80)](https://collider.com/superman-2025-review-james-gunn-dc-david-corenswet/)\n\n&gt;Superman is a magnificent feat, a film that makes the Man of Steel fascinating in a way we’ve rarely seen on film, with a take on the hero that is trenchant, clever, and delightful. Gunn is paying tribute to the past while also making a very clear mark on this world’s future, crafting an introduction to the DCU that inherently makes the viewer want to know where this world goes from here. At this point, it’s rare for superhero films to give a sense of wonder and a reminder of how beautiful these films can be when executed well. But Gunn has brought optimism, hope, and care back to Superman. It ends up becoming one of the best DC films in years, and one of the best movies of the summer.\n\n[The Guardian - UK (2/5)](https://www.theguardian.com/film/2025/jul/08/superman-review-david-corenswet-james-gunn)\n\n&gt;From the very beginning, this new Superman is encumbered by a pointless and cluttered new backstory which has to be explained in many wearisome intertitles flashed up on screen before anything happens at all. Only the repeated and laborious quotation of the great John Williams theme from the 1978 original reminds you of happier times.\n\n[The Wrap (88)](https://www.thewrap.com/superman-2025-review-james-gunn-david-corenswet/)\n\n&gt;A fabulously smart and entertaining film whose flaws stem from trying too hard… which are the best flaws a film can have.\n\n[Entertainment Weekly (67)](https://ew.com/superman-review-david-corenswet-rachel-brosnahan-soar-kryptonite-script-11768207)\n\n&gt;Whether Gunn fell victim to the kryptonite of excessive studio notes, his desire to populate the film with his stalwart company of actors, or the hubris of not needing to offer reasons to be invested in these characters beyond the mere fact of their existence is unclear. Because there is an unquestionable love for the material and a passion for the goofier, larger-than-life scenarios of comic book lore. With a cast this excellent, there's a capacity for something truly super in a future film — if only Gunn chooses to put the characters' humanity first. **Grade: B-**\n\n[BBC (3/5)](https://www.bbc.com/culture/article/20250708-superman-review)\n\n&gt;It's a shame that Gunn didn't give his story more time to breathe. It's a shame, in particular, that he didn't devote more time to showing us that Superman really is the paragon that his supporters keep saying he is. Corenswet is well cast – he has plenty of all-American charm both as Superman and as his mild-mannered alter ego, Clark Kent – but we have to take it on trust that he is a selfless gentleman who helps his friends and enjoys Lois Lane's company. We don't see any of that. Indeed, Corenswet plays him as an oddly hot-headed manchild who can't get through a conversation with his girlfriend without shouting angrily at her. Was Gunn racing through his material so fast that he forgot to put in the scenes that show Superman's sweeter and nobler side? Maybe so. In a film that whirls with flying dogs and bright green baby demons, the most bizarre element is a Man of Steel who keeps having meltdowns.\n\n[Empire Magazine - UK (2/5)](https://www.empireonline.com/movies/reviews/superman-2025/)\n\n&gt;David Corenswet takes on the blue-and-red mantle admirably, and glimpses of Gunn’s signature sense of fun shine through — but a lack of humanity, originality and cohesion means the movie around them just doesn’t work.\n\n[Rolling Stone (80)](https://www.rollingstone.com/tv-movies/tv-movie-reviews/superman-review-james-gunn-dc-universe-1235374965/)\n\n&gt;It’s faint praise, even in the post-MCU era of the genre, to say that Superman is a solid superhero film; the caveat is hiding in plain sight. What Gunn has pulled off is something more complicated, more interesting, and far tougher: He’s given us a Superman movie that actually feels like a living, breathing comic book.\n\n[SlashFilm (80)](https://www.slashfilm.com/1906722/superman-james-gunn-movie-review/)\n\n&gt;Yes, \"Superman\" is a frequently corny movie because Superman is a corny character, a Kansas farm boy alien who saves squirrels in danger and listens to lame pop music. There's nothing grim or dark here, just a real sense of entertaining silliness that left a big, stupid smile on my face. In our current media landscape, such an approach feels surprisingly bold.\n\n[Independent - UK (4/5)](https://www.the-independent.com/arts-entertainment/films/reviews/superman-review-james-gunn-david-corenswet-b2782165.html)\n\n&gt;David Corenswet, Rachel Brosnahan and Nicholas Hoult lead a movie that doesn’t just serve as a referendum for superhero films, but for the cinematic future of DC as a whole.\n\n[New York Times (90)](https://www.nytimes.com/2025/07/08/movies/superman-review.html)\n\n&gt;As both a story on its own and a prequel to a whole bunch of others, this movie must introduce us to a variety of characters we’ll meet later, and it does it without feeling too much like fan service or exposition.\n\n[Vulture (90)](https://www.vulture.com/article/review-james-gunns-superman-cant-help-but-be-political.html)\n\n&gt;There’s a lot about how we complicate and obfuscate what should be obvious goods, such as saving the lives of children. But the film’s approach isn’t ham-fisted, and it makes room for gleefully fun stuff, too.\n\n[The Times - UK (2/5)](https://www.thetimes.com/culture/film/article/superman-film-review-david-corenswet-vbzrgpdhh)\n\n&gt;This migraine of a movie is superhero soup. David Corenswet is serviceable as Hollywood’s latest Man of Steel, but director James Gunn has turned the ninth big-screen film into an indigestible mush\n\n[The Irish Times (2/5)](https://www.irishtimes.com/culture/film/review/2025/07/08/superman-review-utterly-charmless-and-as-funny-as-toothache/)\n\n&gt;The cartoonish closing battles make it clear that, not for the first time, Gunn is striving for high trash, but what he achieves here is low garbage. Utterly charmless. Devoid of humanity. As funny as toothache.\n\n\\---\n\n**SYNOPSIS:**\n\n&gt;Follows Superman as he reconciles his heritage with his human upbringing. He is the embodiment of truth, justice and a brighter tomorrow in a world that views kindness as old-fashioned.\n\n**STARRING**:\n\n* David Corenswet as Clark Kent / Superman\n* Rachel Brosnahan as Lois Lane\n* Nicholas Hoult as Lex Luthor\n* Edi Gathegi as Michael Holt / Mister Terrific\n* Anthony Carrigan as Rex Mason / Metamorpho\n* Nathan Fillion as Guy Gardner / Green Lantern\n* Isabela Merced as Kendra Saunders / Hawkgirl\n* Skyler Gisondo as Jimmy Olsen\n* Wendell Pierce as Perry White\n* Beck Bennett as Steve Lombard\n* Mikaela Hoover as Cat Grant\n* Alan Tudyk as Superman Robot #4\n* Sara Sampaio as Eve Teschmacher\n* María Gabriela de Faría as Angela Spica / The Engineer\n* Pruitt Taylor Vince as Jonathan 'Pa' Kent\n* Neva Howell as Martha 'Ma' Kent\n\n**DIRECTED BY:** James Gunn\n\n**WRITTEN BY:** James Gunn\n\n**PRODUCED BY:** Peter Safran, James Gunn\n\n**CINEMATOGRAPHY:** Henry Braham\n\n**EDITED BY:** William Hoy, Craig Alpert\n\n**MUSIC BY:** John Murphy, David Fleming\n\n**RELEASE DATE:** July 11, 2025\n\n**RUNTIME:** 2h 9m\n\n**BUDGET:** $225 Million",
        "upvotes": 4853,
        "comments": 2368,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VYE8vfolHs_p2fjTta1mmepfwdQ5IPx6uykET6HisOk.jpeg?auto=webp&amp;s=7fb0bd6217cb5d08d0684ae338808edb236c7cdd"
        },
        "permalink": "/r/movies/comments/1lux4kl/superman_review_thread/"
    },
    {
        "id": "1lvhm7i",
        "author": "Mst3Kgf",
        "title": "What's an example of a movie that might have done better with a different title?",
        "content": "Never underestimate the ability of a good title to sell a film. And vice versa, a bad title can ward people off a movie as much as bad marketing or bad word of mouth. For example, William Friedkin's \"Sorcerer\" had the miserable luck of being released in the wake of the unexpected phenomenon that was \"Star Wars\", but it wasn't helped either by a title that many found quite misleading. People who expected a fantasy film with that title were surprised to find it was actually a new adaptation of \"The Wages of Fear\" and that \"Sorcerer\" actually referred to the name of a truck. (Friedkin later said he got the title from the Miles Davis album and that the \"sorcerer\" in question was the hand of fate.) So while \"Sorcerer\" had a bad hand dealt to it already, the title didn't help matters any.",
        "upvotes": 156,
        "comments": 477,
        "media": null,
        "permalink": "/r/movies/comments/1lvhm7i/whats_an_example_of_a_movie_that_might_have_done/"
    },
    {
        "id": "1lvjkmy",
        "author": "BunyipPouch",
        "title": "Rian Johnson's ‘Wake Up Dead Man: A Knives Out Mystery’ To Open London Film Festival on October 8 - The ensemble cast includes Daniel Craig, Josh O’Connor, Glenn Close, Josh Brolin, Mila Kunis, Jeremy Renner, Kerry Washington, Andrew Scott, Cailee Spaeny, Daryl McCormack, and Thomas Haden Church.",
        "content": "",
        "upvotes": 107,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/L3cMMx7MAAW59dPOJYKWbgFKdp4M-FHyH62l-sdyAAM.jpeg?auto=webp&amp;s=00a033252b888d98a245e324f88451340df85a1f"
        },
        "permalink": "/r/movies/comments/1lvjkmy/rian_johnsons_wake_up_dead_man_a_knives_out/"
    },
    {
        "id": "1lvmz8y",
        "author": "ThinWhiteDuke00",
        "title": "New Poster for \"WEAPONS\"",
        "content": "",
        "upvotes": 52,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gwxzclp2jvbf1.jpeg?auto=webp&amp;s=c5f28f411e0a66e9b4b299a2956858a1ac6c56d8"
        },
        "permalink": "/r/movies/comments/1lvmz8y/new_poster_for_weapons/"
    },
    {
        "id": "1lv5nmi",
        "author": "lnsknndy",
        "title": "Name a movie recommendation with a plot twist you 100% didn't see coming",
        "content": "I’m on the hunt for movies with plot twists that genuinely caught you off guard, you know something that would make you go \"wait, WHAT just happened?\" kind of twists. To give you an idea of what I’ve already seen, I watched Fractured a couple of years ago and thought it was really good, but I didn’t expect it to mess with my head the way it did. Recently, I watched Straw, and somehow I walked right into the same kind of twist again, still completely unprepared lmao. I guess enough time had passed for me to fall for it all over again which made it even better, honestly.. Would appreciate it if there's no spoilers tho! Just simply the title, genre, or maybe how you felt about it will do. Thank you!",
        "upvotes": 677,
        "comments": 1409,
        "media": null,
        "permalink": "/r/movies/comments/1lv5nmi/name_a_movie_recommendation_with_a_plot_twist_you/"
    },
    {
        "id": "1lv8v53",
        "author": "FelixStratton",
        "title": "Name a movie better than the book its based upon",
        "content": "I can think of a fair few, most notably L.A. Confidential and Jaws.\n\nL.A. confidential is an incredibly convoluted mess of a story, full of sideplots that try to flesh things out but only drag on. The film streamlines it immensly.\n\nJaws has pointless sideplots that have bearing on the story...but only serve to underline how unlikeable every single character is. Really, everyone in the book is terrible.\n\nAnyone else want to share?",
        "upvotes": 356,
        "comments": 1058,
        "media": null,
        "permalink": "/r/movies/comments/1lv8v53/name_a_movie_better_than_the_book_its_based_upon/"
    },
    {
        "id": "1lvi6f5",
        "author": "devenrc",
        "title": "The SpongeBob Movie: Search for SquarePants - Official Trailer",
        "content": "",
        "upvotes": 60,
        "comments": 40,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/opQ-ShHl7bdC5ZneDHjvKb5uSl3MYqWjJr31XcleHZ0.jpeg?auto=webp&amp;s=a4ad07a4d5b5b8c487b0587b3c423e3dfd915784"
        },
        "permalink": "/r/movies/comments/1lvi6f5/the_spongebob_movie_search_for_squarepants/"
    },
    {
        "id": "1luwlgq",
        "author": "chutlover69",
        "title": "What's a good movie where the \"Good guys\" lost?",
        "content": "I'm looking for movies where the protagonists (or the \"good guys\") don’t come out on top in the end — not just morally gray stories, but where things actually go wrong for them and the bad guys win (or at least don’t lose).\n\nCould be a total defeat, a bittersweet ending, or just a situation where things spiral out of control. Bonus points if it still feels satisfying or thought-provoking.\n\nWhat are your favorite films like this?",
        "upvotes": 1555,
        "comments": 2463,
        "media": null,
        "permalink": "/r/movies/comments/1luwlgq/whats_a_good_movie_where_the_good_guys_lost/"
    },
    {
        "id": "1luseg9",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Osgood Perkins' 'Keeper'",
        "content": "",
        "upvotes": 1916,
        "comments": 223,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ou0phvo1bobf1.jpeg?auto=webp&amp;s=92b0aa818f379b733781fb17572cd27ec3b7a2cf"
        },
        "permalink": "/r/movies/comments/1luseg9/official_poster_for_osgood_perkins_keeper/"
    },
    {
        "id": "1lv65ug",
        "author": "ggroover97",
        "title": "Turner Classic Movies Will Stay on David Zaslav’s Side of Warner Bros. (EXCLUSIVE)",
        "content": "",
        "upvotes": 321,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JWWCcoUlbUNac1e65dD-Dinft-uoZBPu5yb_dGw1T6M.jpeg?auto=webp&amp;s=1b59c4d7b549edce22483e329560e21e29529008"
        },
        "permalink": "/r/movies/comments/1lv65ug/turner_classic_movies_will_stay_on_david_zaslavs/"
    },
    {
        "id": "1lvlcw0",
        "author": "KillerCroc1234567",
        "title": "‘Anora’ Breakout Yura Borisov Confirmed for Luca Guadagnino’s ‘Artificial’ at Amazon MGM",
        "content": "",
        "upvotes": 26,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/u40xGtYdlBKDPdGr5OmyljTe7NNVrwMu2BNi6hQkaho.jpeg?auto=webp&amp;s=e82e1e5b8350490c54356390dffe098f32fd5862"
        },
        "permalink": "/r/movies/comments/1lvlcw0/anora_breakout_yura_borisov_confirmed_for_luca/"
    },
    {
        "id": "1lvlso5",
        "author": "Neo2199",
        "title": "European Cinema Giant Vue Launches 'Epic': The format features the new HDR by Barco laser projection combined with the Dolby Atmos sound system",
        "content": "",
        "upvotes": 21,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_TTTqn8y-gl8BUUecTwvGu3Tg4bi3juJdQYQFdMyJg8.jpeg?auto=webp&amp;s=4b7b82ae77be85229a29f1a7bf58caca04d97866"
        },
        "permalink": "/r/movies/comments/1lvlso5/european_cinema_giant_vue_launches_epic_the/"
    },
    {
        "id": "1lv4i8g",
        "author": "NoCulture3505",
        "title": "‘Devil Wears Prada 2’ Adds Lucy Liu, Justin Theroux, B.J. Novak, Pauline Chalamet and More to Cast",
        "content": "",
        "upvotes": 335,
        "comments": 51,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Fls315zq54xS2phg14wDEpjx66R7BoQnFIrdW0UE4Rs.jpeg?auto=webp&amp;s=14cb647980f2a2b5c10f6c669936c39c04e53fa7"
        },
        "permalink": "/r/movies/comments/1lv4i8g/devil_wears_prada_2_adds_lucy_liu_justin_theroux/"
    },
    {
        "id": "1lupdrg",
        "author": "MarvelsGrantMan136",
        "title": "Fandango Raises $1.3 Million to Send Members of Boys &amp; Girls Clubs of America to Movies",
        "content": "",
        "upvotes": 1724,
        "comments": 61,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0TYK_Jm5FOAm7h1QpK1tOA7YNzVD1MGOvBtWqCcty8A.jpeg?auto=webp&amp;s=4f1c6ac63360112a9809fd17da39e730e837c065"
        },
        "permalink": "/r/movies/comments/1lupdrg/fandango_raises_13_million_to_send_members_of/"
    },
    {
        "id": "1lvjh7s",
        "author": "AmigoDelDiabla",
        "title": "What's a great childhood friendship movie for girls?",
        "content": "Stand By Me and The Sandlot are often the GOAT of boyhood friendship movies, and my daughter loves them.  But I'm not really aware of similar movies focused on girls.  Sisterhood of the Traveling Pants, maybe? (I haven't seen it.)\n\nI'm just wondering if there's anything out that that captures the innocence of childhood and the importance of friends at that age but through the perspective of a girl.\n\nAnd if there isn't one, can one of you aspiring screenwriters get to work and have it produced before my daughter is too old?\n\nEdit:  Thoughts on *Man in the Moon*?",
        "upvotes": 20,
        "comments": 35,
        "media": null,
        "permalink": "/r/movies/comments/1lvjh7s/whats_a_great_childhood_friendship_movie_for_girls/"
    },
    {
        "id": "1luspim",
        "author": "TiredWithCoffeePot",
        "title": "Official Poster for ‘THE SPONGEBOB MOVIE: SEARCH FOR SQUAREPANTS’",
        "content": "",
        "upvotes": 973,
        "comments": 147,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ox8a5q46dobf1.jpeg?auto=webp&amp;s=b478e07ca79776858f301a80c8e92abd24a20fa0"
        },
        "permalink": "/r/movies/comments/1luspim/official_poster_for_the_spongebob_movie_search/"
    },
    {
        "id": "1luugzm",
        "author": "splader",
        "title": "Better Off Dead (1985) is Unhinged",
        "content": "Okay so I've been on a bit of a Cusack spree lately. Id seen 1408, Gross Point, 2012 etc, but I wanted to watch his older flicks.\n\nSo I watched High Fidelity (which was great) and ~~Don't~~ Say Anything, which was also really good. Next up was this one, Better off Dead. Which I thought would be another romcom.\n\nBro, what was this movie. It was unhinged in an incredible way, from the Airplane style jokes to the relentless paper boys, to the \"testicles all over me\". \n\nI'm pretty sure Lane killed at least like 3 people in this movie lol, and what was with the skiing obsession?! \n\nI need to look into the making/background of this movie because yeah wow, what the heck was that. And of course, endlessly quotable...\n\nEdit: while folks are commenting, any other Cusack recommendations? I'm definitely watching \"One Crazy Summer\", but I'm open to pretty much anything he's in that's also a good movie lol",
        "upvotes": 728,
        "comments": 518,
        "media": null,
        "permalink": "/r/movies/comments/1luugzm/better_off_dead_1985_is_unhinged/"
    },
    {
        "id": "1luv8bz",
        "author": "BunyipPouch",
        "title": "Due to a very successful limited release ($932K in 1,015 theaters last weekend), cult classic mockumentary 'This Is Spinal Tap' is extending its nationwide theatrical re-release, adding screenings on July 8, 9, and 10.",
        "content": "",
        "upvotes": 548,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TCpgPe9jo3nKybYHe1WOX4wFMBnpV_-udxv2mGFHSg0.jpeg?auto=webp&amp;s=9a052ea3904f2174b1442bcb807cb46fdc1c65b3"
        },
        "permalink": "/r/movies/comments/1luv8bz/due_to_a_very_successful_limited_release_932k_in/"
    },
    {
        "id": "1lvgtgp",
        "author": "Ordinary_Store1998",
        "title": "A film that rewired your brain?",
        "content": "Was scrolling through some low-budget sci-fi the other night and put on 'Coherence'.\n\nF\\*ck me, what a trip. The whole film is basically one long dinner party conversation but it gets so complicated, so fast. I had no idea what was happening half the time but I couldnt look away.\n\nIt really showed me how much you can do with a tiny budget and one room if the idea is solid enough. No huge CGI or anything, just pure concept messing with your head.\n\nGot me thinking about what other films are out there like that. The ones that aren't massive blockbusters but just stick with you because of the story or the way they were made.",
        "upvotes": 16,
        "comments": 46,
        "media": null,
        "permalink": "/r/movies/comments/1lvgtgp/a_film_that_rewired_your_brain/"
    },
    {
        "id": "1lv2toe",
        "author": "DemiFiendRSA",
        "title": "‘Bridgerton’ Actress Simone Ashley Struts Into ‘Devil Wears Prada 2’",
        "content": "",
        "upvotes": 137,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qPZV9T-QR42jGowKOc3kLprxMKgWNc9StvAd-Y93Fjo.jpeg?auto=webp&amp;s=186b9df8fdf29bf7a96808b0d77558fab9e09fb6"
        },
        "permalink": "/r/movies/comments/1lv2toe/bridgerton_actress_simone_ashley_struts_into/"
    },
    {
        "id": "1luu0pt",
        "author": "IReadTheWholeThing",
        "title": "What's a movie you went into blind and it completely blew you away?",
        "content": "For example I watched A beautiful mind and fight club without knowing anything about them, and I was mind blown by the stories. Some movies hit harder when you go blind. That's why I always try not to read much or watch trailer of the film before watching. \n\nCurious to know which films surprised you the most when you had no idea what to expect. P.S. no spoiler please. ",
        "upvotes": 331,
        "comments": 1021,
        "media": null,
        "permalink": "/r/movies/comments/1luu0pt/whats_a_movie_you_went_into_blind_and_it/"
    },
    {
        "id": "1lvi861",
        "author": "BunyipPouch",
        "title": "Acclaimed Sundance Indie ‘A Little Prayer’ (Starring David Strathairn and Jane Levy) Secures 2025 Theatrical Release With Music Box Films - Originally picked up &amp; scheduled to be released by Sony Pictures Classics in 2023, that deal fell through due to the dual actor &amp; writer strikes.",
        "content": "",
        "upvotes": 8,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rj1LluPZ2cbCTGmdwvHxHws1X5_Zc1VjN5IAQImABLM.png?auto=webp&amp;s=bc5e362738850faba51e099d51dee738a0a1d728"
        },
        "permalink": "/r/movies/comments/1lvi861/acclaimed_sundance_indie_a_little_prayer_starring/"
    },
    {
        "id": "1lvebjj",
        "author": "PM_Peartree",
        "title": "I didn't expect to be as moved by a film as I did with \"Awakenings\" (1990). Touching, occasionally emotionallly manipulative yet absorbing. Robert De Niro, as usual, surprises when not typecast",
        "content": "I like Robert De Niro as an actor, especially when he drifts away from the gangster roles he's famous for.  You usually don't associate Robert De Niro with sensitive roles or parts which demand a lot of emotional gravitas yet he did play those parts and always accomplished those demands. \n\nIn \"Awakenings\", he plays a longtime patient, Leonard, victim of encephalitis lethargica, which placed himself in a catatonic state for most of his life. When he gets a (temporary) cure which takes Leonard back into a state of rationality, he's faced with being \"normal\" again however with the realization of the years he lost and worse, with the possibility he might go back into being how he was. \n\nThe cast is excellent. Everybody delivers a stirring turn: De Niro, Robin Williams (a brilliant comedian who could surprise you as a wonderful dramatic actor), Julie Kavner (solid support for Williams), Penelope Ann Miller (underrated actress who shares with De Niro the saddest scene of the film) and Ruth Nelson (fabulous as a elderly parent whose personal identity is unraveled when her son gets well and she doesn't know how to cope). \n\nA beautiful and engrossing \"based on a true story\" drama which will keep you interested from beginning to end.",
        "upvotes": 12,
        "comments": 7,
        "media": null,
        "permalink": "/r/movies/comments/1lvebjj/i_didnt_expect_to_be_as_moved_by_a_film_as_i_did/"
    },
    {
        "id": "1lushol",
        "author": "Siir_Gamer",
        "title": "Whats one movie you have no shame in saying you cried to.",
        "content": "Mine has to be \"Million Dollar Baby\". The ending was just so so so heartbreaking and just the character interactions and development and relationships just got me. Its in my top 5 list of my favorite movies without a doubt. Everything about it is great and it needs to be more well-known and recognized.",
        "upvotes": 316,
        "comments": 895,
        "media": null,
        "permalink": "/r/movies/comments/1lushol/whats_one_movie_you_have_no_shame_in_saying_you/"
    }
]