[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 197,
        "comments": 718,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1o3iw2x",
        "author": "i_am_weesel",
        "title": "Disappointed in Netflix",
        "content": "Firstly, I’ve been a customer since the beginning and I have tremendous brand loyalty to Netflix, which will be a topic here.\n\nFor the last two-three years everyone I open the Netflix app on my TV all i feel is disappointment. I can never seem to find anything I want to watch or am interested in. Idk when it started but there was a time when basically every Netflix original I don’t dare to watch because I already know it’s going to let me down (except the Monster series like it ok.)\n\nI got a pretzel in my head due to simultaneously knowing that i should cancel and that i do have an attachment to the brand. Getting all the newest movies in the mail for me and the gang to watch was epic and being able to stream on my Xbox was epic in its own right. Does anybody feel similar?\n\nEdit: there has been some straight fire that I loved like All Quiet on the Western Front, Stranger Things, Haunting of Hill House/Bly Manor and others. It’s not all bad and i’m for sure not shitting on netflix",
        "upvotes": 78,
        "comments": 85,
        "media": null,
        "permalink": "/r/netflix/comments/1o3iw2x/disappointed_in_netflix/"
    },
    {
        "id": "1o3kxpv",
        "author": "nerfherder1620",
        "title": "Ed Gein Story is heinous",
        "content": "Is it no longer considered bad taste to make shows about murderers that almost exploits the suffering of others through glamorization? It is one of the most tasteless and disgusting shows I've ever seen. There are better ways to make an impact without having to watch 10 scenes of a dead bodies getting f***** and 600 people getting grotesquely murdered with every brutalized second on display.\n\nEdit: I have no problem with violence or gore in film, TV, video games etc. However, if im gonna have to watch some guy fuck a dead body for the love of the game every 10 seconds, the plot better be good and add something interesting to the conversation. If not, im not interested in some murder porn fantasy that isnt made in good faith to the people who actually suffered that freak. ",
        "upvotes": 26,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1o3kxpv/ed_gein_story_is_heinous/"
    },
    {
        "id": "1o3heyb",
        "author": "FG_Hydro",
        "title": "My Father the BTK Killer",
        "content": "Does anyone else strongly dislike Kerri Rawson? People are saying about how brave she is, the trauma, and the PTSD. The whole show just showed me how self centered and how everything is about her. She’s capitalizing off her dad. She brags about writing a bestseller, then posts a gofundme for herself, then does a Netflix special, also she gets paid for all her interviews. If she cared for anyone else portions would’ve gone to the actual victims of her father. The truth of the matter is her dad was actually a pretty good dad to her to the point nobody believed he was a killer.  He was a horrible person, I’m not downplaying that it had to be traumatic in some way. But the entitlement and woe is me is just so irritating every single scene was all herself. The victims barely got any attention. ",
        "upvotes": 27,
        "comments": 81,
        "media": null,
        "permalink": "/r/netflix/comments/1o3heyb/my_father_the_btk_killer/"
    },
    {
        "id": "1o3bum8",
        "author": "GoldDerby",
        "title": "‘Thank god she gets those routine checkups’: How ‘KPop Demon Hunters’ and Huntr/x owe everything to dental hygiene, plus talk the Oscars",
        "content": "",
        "upvotes": 32,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o3bum8/thank_god_she_gets_those_routine_checkups_how/"
    },
    {
        "id": "1o3hmv9",
        "author": "camwtss",
        "title": "im only half-way through Ed Gein, and although im enjoying it, i struggle to understand how some people are empathizing with him?",
        "content": "like hello? he murdered the babysitter for \"taking his job\", a job that he utterly failed at. how's it in any way her fault? \n\nhe murdered the bartender for no reason at all\n\nhe murdered that poor blonde woman. so what if she was the \"town pump\"? he could've rejected her advances. idk if she had an STD or not, but i'd much rather take her word for it versus the dead mothers. or better yet, just get tested before resorting to homicide?? she was open-minded with him cross dressing, gifted him lingerie, even invited him to move in, and thats how he repays her?\n\noh, and the chainsaw scene. cringe. like seriously how are people feeling bad for him? he found great pleasure in inflicting harm/discomfort onto others. mental illness or not, he still knew right from wrong. there wasn't a single instance where he was even remotely justified in his actions.\n\n(and yes, im aware that much of the show is fictitious. im mainly referring to the character, not the real-life Ed Gein)",
        "upvotes": 13,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1o3hmv9/im_only_halfway_through_ed_gein_and_although_im/"
    },
    {
        "id": "1o3msls",
        "author": "RealisticDiscipline7",
        "title": "The woman in cabin 10 discussion.",
        "content": "I enjoyed this movie so I want to discuss anything and everything ppl found interesting. \n\nIll start with one aspect that gave me a thrill:\n\nWhen it’s revealed that the real Anne went overboard and the one we’ve been watching is a fake, I thought “let me guess, the same actor plays both characters and we’re supposed to accept they found someone who looks identical to be an imposter? That’s lame.” \n\nThen they show the night Anne was killed and we clearly see there are two different actors depicting that moment. So my next thought was…”oh, and none of the passengers notice it’s not the same person??” So I rewound the movie to make sure they didnt cheat by using imposter Anne the whole time, to trick us, and only using two separate actors when they’re depicted in the same room together. They didnt cheat! That’s what was so neat, I didnt notice the swap either. Never crossed my mind. ",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1o3msls/the_woman_in_cabin_10_discussion/"
    },
    {
        "id": "1o3jn5l",
        "author": "prettylittlemurders",
        "title": "The Woman in Cabin 10 - the movie is good, but misses major points of the book",
        "content": "!!!Spoilers for both book and movie!!!\n\nI'm a huge fan of the book. If was one of the first that got me into the mystery/thriller genre.\n\nOverall, the movie was pretty good. I think that I would've enjoyed it way more if I hadn't read the book beforehand. The changes to the plot really bugged me😅\n\n1. Lo's arc is completely different but I find her more likeable in the movie.\n2. I think the movie should've included the home invasion and Lo's inability to cope with it. In the book, Lo gets drunk the evening before witnessing the body being thrown overboard, which is a major reason why people don't believe her. She's implied to be in a mostly sober state in the movie, which makes the gaslighting from Bullmer and the crew much more obvious.\n3. The movie completely changes Carrie's character. The movie makes her very innocent and fragile. In the book, she's a very morally grey character - she's much more in on Bullmer's plan and is harsher with Lo. I liked her character way more in the book and felt like her personality was much more interesting.\n4. However, something that the movie did perfectly was capturing the unsettling, too-flawless, cold vibes of the boat. The scenery was gorgeous. They did a great job with the aesthetics.\n5. Didn't love the ending change. I would've kept the original ending of the book but didn't leave it as open ended.\n6. The evil doctor felt like an unnecessary character.\n7. I did love how the movie really humanized Anne.\n\nAnyways, that's my review :)\n",
        "upvotes": 8,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1o3jn5l/the_woman_in_cabin_10_the_movie_is_good_but/"
    },
    {
        "id": "1o3kt4c",
        "author": "the-nomad-thinker",
        "title": "Netflix put my list at the very bottom",
        "content": "Today, I wanted to watch some shows, so I turned Netflix on, as I always do. But when I got on, my list was nowhere to be found! I continue watching was three rows down, but I had to scroll all the way to the bottom to find my list. I was so disgusted that I quit and turned on YouTube instead.\n\nWhy would they do this? It feels asinine for the sake of being asinine. Am I alone in this?",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1o3kt4c/netflix_put_my_list_at_the_very_bottom/"
    },
    {
        "id": "1o3gun4",
        "author": "RoxieMatthews",
        "title": "Boots - SUCH a good show I want more!!",
        "content": "Okay this was one of the best shows I’ve watched on nextflix recently!! Each and every character just touched my heart. I was not expecting the depth of emotion. \n\nWhat I love most is how it beautifully portrays how masculinity can still have softness. \n\nI love how beneath the tough exteriors and anger, all the characters have a kindness, depth and realness. You see that we’re all human - we feel, grieve, and love in our own ways. Our backstories, traumas, and insecurities may differ, but kindness exists in all of us. \n\nI just loved it so much!! I want more ",
        "upvotes": 10,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o3gun4/boots_such_a_good_show_i_want_more/"
    },
    {
        "id": "1o3ewtp",
        "author": "GooeyBones",
        "title": "Movies being edited/censored?",
        "content": "Watched an old favorite last night, Dodgeball, and found that a line was cut out about 35 minutes in, when a character says “I love the smell of queef in the morning”. Sure enough I looked it up and that whole bit was just cut from the Netflix version. It’s weird considering the vulgarity of the whole movie, which also has a line that includes the R slur, that they cut the line about queefs?  It’s weird and a little alarming that they’re just cutting movies up. What else are they removing? ",
        "upvotes": 10,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1o3ewtp/movies_being_editedcensored/"
    },
    {
        "id": "1o3qrbs",
        "author": "Accurate_Procedure43",
        "title": "why Starburster so popular in shows",
        "content": "I watched mobland and it’s the intro, right after I watched black rabbit and it’s in episode 7, RIGHT AFTER I watched house of Guinness and it’s used a few times, how is this new song by a somewhat random band being used so much in tv shows. I get it’s pretty good and goes good with a lot of scenes but it’s really random to me idk ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o3qrbs/why_starburster_so_popular_in_shows/"
    },
    {
        "id": "1o3qlur",
        "author": "daily_apprehensive",
        "title": "My Father the BTK Killer",
        "content": "First of all, kudos to Kerri Rawson for her attempt to decently navigate an impossible situation. It’s a reminder that oftentimes the family are victims too. I respect how she tried to come to terms with her experience honestly and with awareness. \n\nThat out of the way, I still cannot get over the neighbor of BTK’s family lot having the nerve to say “She doesn’t have to live with this every day!” when griping about Kerri and the crew’s visit to get footage. It seems like if anyone had the right to return, it would be the people who lived in that house. She’s not a gawker, she’s a living victim of her father’s insanity. \n\nSeriously? SERIOUSLY? I’m trying to give the person the grace of she probably specifically means the cars driving by because the idea that she doesn’t live with who her dad is every day is just ridiculous. \n\nThat was all I had to say, thanks for coming to my Ted talk 😂",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o3qlur/my_father_the_btk_killer/"
    },
    {
        "id": "1o3ig7k",
        "author": "JBFRESHSKILLS",
        "title": "Ed Gein episode 8…",
        "content": "Anyone else find it odd that he’s basically recreating Mindhunter in the first part of the show, going so far as to have the same actor that played Jerry Brudos in Mindhunter play him here? \n\nI know that John Douglas was a real detective (I’ve read many of his books,) but that was a straight up rip off of Mindhunter.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o3ig7k/ed_gein_episode_8/"
    },
    {
        "id": "1o3mfjg",
        "author": "Cliqey",
        "title": "In defense of Monster: The Ed Gein Story",
        "content": "First some acknowledgements. Yes, art is subjective. No, not everyone needs to like the same things. Yes, you can understand something and still not like it. No, you don’t misunderstand something because you don’t like it. My goal isn’t to convince you to like something you don’t.\n\nWith that out of the way, I want to address the low ratings and reviews/threads I’ve seen.\n\nWhen I first saw each of these “Monster” shows I didn’t know much about audience reception. I only tuned in because I knew there was some buzz, not what direction the buzz was in. While I did take some issues with each season, particularly with some indelicate clumsiness in handling some sensitive parts of the source material (the fractured records of real life,) I still thought each season was well crafted and doing something interesting with the stories.\n\nAfter watching Gein, I was surprised to see how disliked it was. Fine, I have enjoyed some low-quality pop garbage in the past, no shame in my game. \n\nBut then I looked at the discourse. I saw how many people were taking the narrative literally, and judging it as if it was attempting to portray itself as a literal face-value story—smearing the people and events of history.\n\nBut the central conceit of this show is that history has already been smeared. Repeatedly, over the many decades since these events took place. It is a show that is about the way our culture has absorbed the wild growth of urban mythology that spawned, echoing far and long, from those deeply disturbing reports (and rumors) coming out of rural Wisconsin in a time that was ripe for macabre sensationalism. Not meant to tell us exactly what really happened there, but what we have made of it since then, and why. \n\nThere is little we know with concrete certainty about this case, largely because of the very unreliable perpetrator with severe disconnection from reality. And a pretty quick skim of the wiki for Gein will give you the broad strokes. But what we see in the show goes beyond what has been confirmed and supported by official channels of justice and government. We see the products of many years of assumption, speculation, rumor, embellishment and yes, artistic license.\n\nWe see this in the way that the show goes out of its way to stylize most of the story that is not part of the confirmed record. It treats these moments as a hybrid of diegetic hallucination (that may be happening to Ed as he fantasizes what he’d like to do in the depths of his schizophrenic throes) and as a window into the assumptions society has made about the blanks in the official story and a raft of coinciding events that happened in the same general setting. \n\nIn much detail we see the reciprocal interplay between art that was made to reckon with, challenge, and exploit the remarkably fervent cultural reaction to this story and the figure that would eventually become a thing of nightmares; mythologized by our collective fears, biases, and morbid fascinations. I particularly enjoyed the anachronistic portrayal of iconic movie moments as a way of saying, ‘he may or may not have done this thing but this is what *you/we* imagined, or even needed, him to be’ for such and such reasons, depending on which iconography and from which era.\n\nOne could argue that the show, as written with its own artistic license, will lead people to believe falsehoods about history. That is valid, and evidently true. For me, it piqued my interest and got me to look up this pivotal bit of history I didn’t know much about… \n\nI’ll argue separately that one should never watch any one movie, show, or segment about any real life event and think they have the full picture. Even documentaries or journalism. One work can only contain so much information and perspective, and real life is often infinitely more complex and interconnected than any single story can capture.\n\nThere is also the risk of glorifying or undeservedly sympathizing with a murderer at the expense of real victims. Also valid. And if the show wasn’t so explicitly camp and stylized about the moments that stretch the truth and make commentary on the perception of the character and actions of Gein, I’d feel more wary than I do. (Just as an example; the end sequence that people see as glorification of a painted-as-sympathetic killer—which I’d argue was more a recognition of how this one tragic figure and the horrible things he had done had become this larger than life mythos that inarguably inspired and impacted so much of American culture in so many different ways, from copycat killers, to movies, to cultural discourse in all the years since.)\n\nI’ll also argue that anyone should watch this show understanding that it is not a literal telling of (even explicitly fictionalized) historical events. Rather it is a show that is interested in, and cognizant of, the unique cultural position that the extant stories of this event have in the history of American society. This doesn’t mean you have to enjoy the concept or its execution. But then, tell us the reasons you dislike it for what the show actually is, not what it’s misunderstood to be.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1o3mfjg/in_defense_of_monster_the_ed_gein_story/"
    },
    {
        "id": "1o36ug6",
        "author": "Cute_Note_3624",
        "title": "The woman in cabin 10 reviews",
        "content": "Is the movie watchable despite the many bad reviews?? I have nothing to watch this weekend and I'm extremely bored. Should I really watch it or no pls be honest ",
        "upvotes": 7,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1o36ug6/the_woman_in_cabin_10_reviews/"
    },
    {
        "id": "1o2zhgo",
        "author": "Round-Refrigerator99",
        "title": "Is \"Nailed It!\" canceled?",
        "content": "I really loved watching Nailed it when I was younger but it's been so long since a new season came out. I don't keep up with any of the host's social media so I don't know if they announced it being canceled or not",
        "upvotes": 17,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1o2zhgo/is_nailed_it_canceled/"
    },
    {
        "id": "1o3lkie",
        "author": "Bright-Ordinary-6829",
        "title": "My Father The BTK Killer",
        "content": "Did anyone else get really pissed off at that one off clip of the neighbor saying the crew had no respect for anyone’s privacy and that Kerri didn’t have to live with the horrors every day like she did?\n\nWe never saw her face, never learned the address, and yet she’s somehow still claiming that she had worse trauma (as a neighbor of a demolished house) than the daughter who’s still sorting through the trauma and still present death threats. ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1o3lkie/my_father_the_btk_killer/"
    },
    {
        "id": "1o3au5h",
        "author": "AssumptionFull531",
        "title": "Criminal UK: Similar show recommendations",
        "content": "Came across this underrated gem on Netflix. I loved the format, the twists and acting in these episodes gave me chills. Please recommend shows that are similar to this.\n\nAlso, should i watch the other country versions? I've heard they aren't as good. ",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o3au5h/criminal_uk_similar_show_recommendations/"
    },
    {
        "id": "1o3124f",
        "author": "N3DSdude",
        "title": "If Netflix really gets the Champions League, what happens to VPN users?",
        "content": "Let’s be real. Netflix and a few other platforms seem to be getting better at detecting and blocking VPNs.\n\nNow there’s talk about Netflix possibly landing the UEFA Champions League, which sounds exciting, but it also makes me wonder: if streaming services can reliably block encrypted or rerouted traffic, what does that mean for online privacy in general?\n\nAre we heading toward a future where it’s basically impossible to browse or stream without being fully visible to providers? Or will users and tech keep finding new workarounds like they always have?\n\nCurious where people think this is heading. Is it a losing battle, or just another round in the back-and-forth between privacy advocates and big streaming companies?",
        "upvotes": 11,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1o3124f/if_netflix_really_gets_the_champions_league_what/"
    },
    {
        "id": "1o3ji4i",
        "author": "Specialist-Put9634",
        "title": "I need Recs!",
        "content": "I need a new tv show! I just finished Sirens and enjoyed it! I like limited series, but regular series style is fine too. I like it when they are wealthy in the show! Thanks!",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1o3ji4i/i_need_recs/"
    },
    {
        "id": "1o3bexs",
        "author": "JollyToe440",
        "title": "Wayward and static noise",
        "content": "What is this? Wayward is actually a good show, i’m at episode 6 and all i can complain about - and oh my, am I about to complain - is that god forsaken static noise they edit into it sometimes! Like if the person is watching tv in the back, or just on the computer, they put the most ear-piercing static noise on. As if 2003 was seventy thousand years ago. As I write this, the noise still echoes in my ears like I got tinnitus. It’s corny at this point. Just typical netflix corniness. Anyone else hates the overdone static aggression? ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o3bexs/wayward_and_static_noise/"
    },
    {
        "id": "1o3bbhv",
        "author": "Spare_Fill6900",
        "title": "Samsung QLED Q80B TV and Q990F soundbar, Netflix won’t play Dolby Atmos",
        "content": "Guys I have the above setup for a while now, the soundbar is connected to HDMI eARC from Q990F to TV’s eARC original cable is used . The audio mode is “Auto” and not PCM, the pass through is grayed out as I have no external HDMI streamers.  I just usually play TV’s native Netflix app and the problem I see, even movies with Dolby Atmos available on it shows up as 5.1 or sometimes spatial audio ( I don’t have any apple device plugged in), and on the Soundbar’s ! Sign it shows “ Dolby Multichannel PCM” not Dolby Atmos.  What’s causing this?? If I change the audio source on TV to TV speaker instead of Q990F eARC the same movie immediately shows Dolby Atmos on Netflix!! My friends have TCL and LG TVs where they don’t have this issue, Dolby Atmos playing and visible in the ! LED screen Samsung to Samsung, what’s going wrong with my setup?? Is it the Native Netflix app not able to identify Q990F as a an Atmos supported hardware? I tried a 100 tweaks from wild surfing to no avail:(\n\nHope someone sheds a light!",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1o3bbhv/samsung_qled_q80b_tv_and_q990f_soundbar_netflix/"
    },
    {
        "id": "1o3ngy6",
        "author": "PaintingTheView",
        "title": "My thoughts on the show Monsters: Ed Gein",
        "content": "It seems as though people are clowning the show. They dislike it. I did not know who Ed Gein was until I watched the show. I understand it may not be accurate, okay. So I watched Monsters: the menendez brothers and dahmer, those were great, not amazing, but great. And I think when people talk about Ed Gein, they get mad and disappointed that it's not how they expected it to be. \n\nA part of me thinks this is because you have to consider that the director is trying to apply the show to a general mass audience, especially towards people who do not know who ed gein is. I do not know him. But can the negative people at least appreciate the cinematography? The acting? Like sure, ed gein does not sound like that, but do people not realize it's on purpose? Can you at least appreciate the effort that was put into the film? Can you appreciate the music? \n\nWhile it's not an accurate portrayal, one who know ed gein would know that you, as an audience member, can fill in the gaps with what you know to make your own story. That's the power of the imagination. The director needed to add scenes here and there for comedic effect, to make it interesting as well, to show there's texture. If you know already what Ed gein does, wouldn't it be boring to know everything that happened, as you're about to watch it unfold? Pretty boring, right? I would say so myself. \n\nI feel like people have such high expectations. And a lack of understanding and compassion for the director and the film crew. It's like some people find a negative thing and only focus on that while not addressing all of the positives. It's like everyone is a movie critic all of the sudden. \n\nI personally really enjoyed it. If they made one about Ted Bundy by the same director, and it wasn't accurate, I would still thoroughly enjoy it, especially the music and cinematography. I hate some people sometimes. I wish they understand. :/\n\nGreat show regardless! ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o3ngy6/my_thoughts_on_the_show_monsters_ed_gein/"
    },
    {
        "id": "1o3gdjs",
        "author": "Upper_Image3019",
        "title": "Black Rabbit storyline confusion (spoilers)",
        "content": "Hey everyone. Spoilers ahead. Why did Vince climb on Jake and demand the watch? This action just delayed the robbery, got Wes and Tony and Junior shot and simply made a simple con go wrong. Why was Jake not mad at Vince for doing this and doesnt even bring it up later? When Vince says Why did Wes step in to protect Jake doesnt ask him why he climbed on him and demanded the watch when they had the jewellery.\n\nMy partner said it was to make the robbery look realistic, but I dont think this is what they would have planned. Can someone share insights in to why they think this happened? Also how dysfunctional was their brotherly bond.....like why were they okay with each other despite bringing doom to each other over and over again.\n\nI think Junior and Vince were Mancuso's sons....",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o3gdjs/black_rabbit_storyline_confusion_spoilers/"
    },
    {
        "id": "1o3fjvl",
        "author": "Ok-Store4021",
        "title": "Monster: The Ed Gein Story",
        "content": "How much of this show was BS? I’ve read online and from what I’ve gathered the vast majority of things in this series were fictional. What were your thoughts on the series. No evidence of him being inspired by the nazi woman.\n",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1o3fjvl/monster_the_ed_gein_story/"
    },
    {
        "id": "1o309wz",
        "author": "Icy_Ad8228",
        "title": "There’s a Reason Billionaire Bunker Feels So Familiar, And It’s Not Just the Storyline.",
        "content": "I was watching it on Netflix and something about the vibe felt familiar: same tension, same obsession with power and control.\n\nThen I found out it’s by the Money Heist team. Makes total sense now. The whole “billionaires hiding underground while the system crumbles” angle suddenly feels like a continuation of the same story.\n\nWild connection, anyone else notice?\n",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1o309wz/theres_a_reason_billionaire_bunker_feels_so/"
    },
    {
        "id": "1o2sp97",
        "author": "Ok_fineidrcare",
        "title": "Just finished watching Boots!",
        "content": "It’s so refreshing to see a gay show about brotherhood and not much else! Thank god it didn’t turn tyler perry inside that bootcamp, I was afraid it’d be so soap opera-ish full of abuse and shits and was ready to skip the series but yeah💀 the tone and cinematography is so unserious too they made that whole 13 weeks less exhausting even as a viewer, that camp was intense asf. Hope we get another season!",
        "upvotes": 21,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1o2sp97/just_finished_watching_boots/"
    },
    {
        "id": "1o3d1qw",
        "author": "Pattyfface",
        "title": "Different wifi-network, same account. Help?",
        "content": "I live with my folks, a recent move-in where I brought my wifi network with me. I pay for it, and it's higher quality then my folks need. They have their own Netflix account, I shut my own down and signed into theirs to safe on funds which are all too short right now.\n\nI got the dreaded thing, demanding I bug them for a code for a 14 day pass. Solutions?\n\nEdit: Forgot to include crucial detail. The device I want to watch on is a PC, without Wifi capabilities. It's **wired** Only. And wiring into the network that my folks use isin't an option.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o3d1qw/different_wifinetwork_same_account_help/"
    }
]