[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 12,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 700,
        "comments": 5183,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1nybuog",
        "author": "TheCruelHand",
        "title": "What the hell did they do to the Ed Gein story?",
        "content": "I get taking some creative liberties, but holy shit did they do everything they could make stuff up. \n\nIt will take any common person two seconds of research to learn that this isn’t how his life really was. \n\nIt is a major known fact that after his mother died, he boarded up her room and left it the way it was the day she died. And that he never dug his mother up. \n\nBut somehow here that’s exactly what’s happened?\n\nIt’s known he made furniture, bowls and a skin suit out of the people he dug up. \n\nI’m only on episode 4 and it’s like pulling teeth trying to watch this show at this point. \n\nAlso what with parallel story about Alfred Hitchcock that wasn’t shown at all in the trailers?\n\nRyan Murphy should not be allowed to make shows anymore.  \n\n\nUpdate - I’ve been corrected, he turned one of his victims into his “mother” and put his mother’s clothes on her. That is my mistake \n",
        "upvotes": 156,
        "comments": 118,
        "media": null,
        "permalink": "/r/netflix/comments/1nybuog/what_the_hell_did_they_do_to_the_ed_gein_story/"
    },
    {
        "id": "1ny08z4",
        "author": "Last-Upstairs1387",
        "title": "Netflix Has Gone Downhill",
        "content": "I’m bracing for downvotes, but hear me out: Netflix has gone down. Not crash-and-burn down, but a steady slide from must-have to “I’ll resub when there’s a buzzy release.” I get that plenty of people still love it, but what used to feel like discovery now feels like searching, and that shift matters.\n\nThe biggest crack is trust. Too many promising shows get axed after a season or two, so viewers stop investing. It’s hard to recommend something when you might be setting a friend up for a cliffhanger that never gets resolved. Netflix still lands hits, but fewer cut through the noise, and the middle tier—the quirky, mid-budget series that built the brand—has thinned out. What’s left is an awkward mix of glossy tentpoles and disposable reality.\n\nPricing and policies haven’t helped. Between tier reshuffles, an ad-supported option, and the password-sharing crackdown, Netflix asks for more while delivering less certainty. If I’m paying premium, I want premium clarity: finished stories, a strong middle class of originals, and an interface that helps me find them. Instead, the algorithm cycles the same tiles, autoplay shouts at me, and the Top 10 often reads like a marketing strip rather than a reliable compass.\n\nThe binge model, once Netflix’s superpower, is showing its limits. A full-season drop creates a weekend of hype and a Monday of amnesia. Competitors that pace releases weekly keep conversation alive longer, which builds community and anticipation. Netflix’s experiments with split seasons feel more like damage control than a coherent strategy for keeping shows in the zeitgeist.\n\nI know the counterpoint: scale demands broad bets. Serving the whole world means optimizing for averages, and averages don’t produce many cult classics. There are still gems—especially international series—but they’re buried under repetition and generic thumbnails. Personalization should feel like a path that widens as you walk it, not a carousel that loops you back to the same five options.\n\nWhat would winning look like? Start with a renewed commitment to finishing stories—greenlight responsibly and communicate clearly about endpoints. Reinvest in the mid-tier that keeps people engaged between megahits. Rethink curation beyond raw engagement: elevate human-programmed shelves, surface more staff picks, and rotate true discovery rows weekly. On product, make autoplay opt-in, expand “because you watched” with smarter, transparent explanations, and let users pin interests so the home screen adapts to them, not the other way around.\n\nAnd if you disagree, that’s fine. I expect pushback, maybe even a pile-on. But the criticism comes from a place of former love. Netflix made streaming exciting because it felt bold and curious. Lately, it feels cautious and crowded. The audience is still here, willing to be surprised. The question is whether Netflix wants to be surprising again.\n\nIf you’re still all-in on Netflix, tell me what I’m missing and what’s genuinely great right now. I’d love to be convinced to stay subscribed year-round instead of hopping in and out for the next shiny release.\n\n",
        "upvotes": 413,
        "comments": 161,
        "media": null,
        "permalink": "/r/netflix/comments/1ny08z4/netflix_has_gone_downhill/"
    },
    {
        "id": "1ny0evj",
        "author": "bbrennann",
        "title": "Charlie Hunnam as Ed Gein is bad casting and this seasons first episode strikes a weird tone",
        "content": "The tone of this show is weird\n\nOnly on episode one but here's some thoughts.\n\nHunnam is a strange choice. He's too hot and can't do an american accent and accounting for the strangest voice choice of all time, it just comes off silly and \"simple jack-y\".\n\n  \nAnd the TONE??? The show so far plays less like an upclose look at a monster like dahmer and has been this hypersexual tease of teenage girls talking about bras, flashes of nazi BDSM imagery and concentration camps cut together in an exciting way. he gets the images from a girl who looks so sweet she's bound to be his first victim. \n\nGein is portrayed as a hot and muscular horny weirdo with a terrible voice, who fails to bring life to a character with the same kind of tv-watchability as Evan Peters's  cold, scary, planning, broken, psychopathic predator \n\nI'm writing this after watching the ridiculous scene at the Nazi BDSM party where Jewish prisoners are sexually humiliated against their will. And again- it's just the tone. It was off. And this show so fare seems kinda sexploitation-y and bad acting and bad casting and idk if i can keep going. \n\nThoughts?",
        "upvotes": 68,
        "comments": 104,
        "media": null,
        "permalink": "/r/netflix/comments/1ny0evj/charlie_hunnam_as_ed_gein_is_bad_casting_and_this/"
    },
    {
        "id": "1nxvtl8",
        "author": "peoplemagazine",
        "title": "Charlie Hunnam Says He Lost 30 Pounds to Transform Into Infamous Murderer Ed Gein for Netflix’s Monster — and Opens Up About How Else He Prepared for the Role",
        "content": "",
        "upvotes": 76,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1nxvtl8/charlie_hunnam_says_he_lost_30_pounds_to/"
    },
    {
        "id": "1ny4p3l",
        "author": "PokeHunterLasVegas",
        "title": "Monster: Ed Gein thoughts ?",
        "content": "Why do they have him talking like Derek Zoolander? Seriously, whenever he talks I just hear \"I think Ive got the black lung...all I ever wanted was to make you proud pop\"\n\nIdk, watched the first 4 episodes and aside from thinking the blonde gf is a complete smoke show, idk, show kinda sucks",
        "upvotes": 23,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1ny4p3l/monster_ed_gein_thoughts/"
    },
    {
        "id": "1nyedot",
        "author": "LongRefrigerator2756",
        "title": "Ed Gein",
        "content": "What do you think the purpose of the character Adeline in the show ? Is she a delusion to show the depth of his schizophrenia ?  A manifestation of his id ? Random fluff ? ",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nyedot/ed_gein/"
    },
    {
        "id": "1nydm35",
        "author": "Cailleach27",
        "title": "Steve movie",
        "content": "Bravo Netflix.  Just Bravo.\n\nThe world needs more movies like this right now.  Thank you for shedding a light on what it means to be a “throw away kid” and the true meaning of courage\n\nI’m blown away",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nydm35/steve_movie/"
    },
    {
        "id": "1nxx769",
        "author": "schi__zoid",
        "title": "Monsters: Ed Gein - there's something off about the show",
        "content": "I don't know how to describe it. I'm halfway through, and it feels like there's an exaggeratedly slow pace, with too many details and distractions meant to... increase the disgust? IDK - as if the story itself isn't  enough.\n\nAnyone else felt this way?\n",
        "upvotes": 40,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1nxx769/monsters_ed_gein_theres_something_off_about_the/"
    },
    {
        "id": "1nyfyeu",
        "author": "Significant-Fun-4235",
        "title": "Is true crime really true crime anymore?",
        "content": "Everyone is aware of how an entire generation/section of society has been more or less drawn into the true crime genre thanks to content from Netflix and similar platforms, but what I have been seeing a lot lately is that these stories have started getting more and more over the top. There are instances added to these documentaries (if I can even call them that) that arguably never happened. Not to mention the severe sensationalization that is being done for these insane people who commit horrors. \n\nEven this new Ed Gein show on Netflix with Charlie Hunnam, everyone is going on and on about the inaccuracies. I mean, why not just make a crime thriller instead of adding fiction elements to the stories that you claim are based on real events? That way you resolve everything in one go...",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nyfyeu/is_true_crime_really_true_crime_anymore/"
    },
    {
        "id": "1nxldkf",
        "author": "millzbill",
        "title": "Netflix loses $20 billion in value as stock drops in its worst week since April.",
        "content": "",
        "upvotes": 249,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1nxldkf/netflix_loses_20_billion_in_value_as_stock_drops/"
    },
    {
        "id": "1nybz54",
        "author": "GlassPudding",
        "title": "another wayward review",
        "content": "the concept for the show was fun and interesting, but i felt like it could have been twice as long with more interesting character/plot development or half as long with less plot holes. \n\nhowever - i am so sorry to say i think mae martins performance in this show is some of the worst acting i’ve ever seen. idk if its a botox thing, but i truly did not see a single expression cross their face besides (eyes wide, mouth slightly open) for basically the whole series. kudos for them for writing something interesting but maybe staying on the writing side is better",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nybz54/another_wayward_review/"
    },
    {
        "id": "1ny340o",
        "author": "Sweaty-Toe-6211",
        "title": "Halo TV Show Hits Netflix, Quickly Becomes One Of The Most Popular Shows On The Platform",
        "content": "",
        "upvotes": 11,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ny340o/halo_tv_show_hits_netflix_quickly_becomes_one_of/"
    },
    {
        "id": "1nych2n",
        "author": "PhotographOdd7120",
        "title": "Monster:Ed Gein",
        "content": "I just finished Monster: Ed Gein and while I do think that the story itself is sad not that I condone what he did but it was hard to stay with the story line. One minute you see Ed then you see the scenes jumping back and forth the movies Psycho, Texas Chainsaw Massacre, a scene from Silence with the lambs. With Dahmer and The Mendez brothers it’s straight to the point but with this one it’s hard to stay with the story line. The Adeline character doesn’t help any and she kinda bugged me but I don’t know why. ",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1nych2n/monstered_gein/"
    },
    {
        "id": "1nxhwz4",
        "author": "Organic_Caramel_8354",
        "title": "Wayward SUCKS",
        "content": "0/10. Weird. Uncomfortable. Good acting but terribly unpredictable script. I am so disappointed. I wasted 8 hours of my life for this. Unless there is a follow up season, I don’t see any rectification for this. \n\n",
        "upvotes": 250,
        "comments": 224,
        "media": null,
        "permalink": "/r/netflix/comments/1nxhwz4/wayward_sucks/"
    },
    {
        "id": "1nxjqgd",
        "author": "conzojay1",
        "title": "Ed gein story nonsense.",
        "content": "So he hits his brother over the head with a massive log (which didn’t actually happen in real life.) but somehow, the coroner misses the huge massive head wound the body would have and just blindly accepts asphyxiation as the cause of death without even checking the lungs either. Stupid logic, totally broke my immersion. ",
        "upvotes": 136,
        "comments": 99,
        "media": null,
        "permalink": "/r/netflix/comments/1nxjqgd/ed_gein_story_nonsense/"
    },
    {
        "id": "1nxeh8z",
        "author": "MelodicJello2099",
        "title": "Monster: Ed Gein is such a let down",
        "content": "Holy flip man this show blows. It’s wrenchingly slow paced, incredibly boring and all over the place. I don’t think I can make my way to another episode. I have no idea what the point in this is supposed to be but it’s horrid. Such a let down. ",
        "upvotes": 293,
        "comments": 451,
        "media": null,
        "permalink": "/r/netflix/comments/1nxeh8z/monster_ed_gein_is_such_a_let_down/"
    },
    {
        "id": "1nyfl15",
        "author": "SpaceHairy",
        "title": "Blindspot touched me in a way no show ever has.",
        "content": "I know what you’re thinking. It’s crazy that I’m saying this about an NBC show, and I don’t know if anyone will read this or care but I gotta get the words out. This show was beyond amazing. Say what you want about the filler, the repetitiveness, whatever. But Blindspot has arguably the most impressive full circle story, beginning to end, staying true to its core in ways that I feel like you don’t see in a lot of shows anymore. I couldn’t help but feel so deeply connected to the characters and their lives, and getting to see familiar faces through flashbacks/hallucinations was so comforting. Yes, the show is wildly farcical in literally every episode, but what’s the difference between accepting the realities of a sci-fi show and embracing strange realities in a show that takes place in “real life?” This show was extremely clear from the first 5 minutes that nothing it presented was going to be normal, and by god it wasn’t. But dammit I LOVE that about it. The creators and the cast cared so much about the depth of the plot and it really shows, and I am genuinely really sad that I have run out of episodes to watch and that the ending was so damn bittersweet. I really hope that any past or current watchers who saw it all the way through - because quitting at any point before the 100th episode is robbing yourself of the beautifully closed loop, complex and heartbreaking character arcs, and also knowing the truth that the story really does continue, but maybe not in the way you want - feel as touched as I do by the story, it’s amazing characters, and what it all meant in the end. It’s an isolated, hidden gem, that other amazing shows (like Lost - despite it’s brilliance) just cannot replicate in the same way. Or if they have, I haven’t seen them. \n\nThe craziest part of all this for me is that this show had been recommended to me by netflix for MONTHS, and I skipped over it because the poster looked too NBC and my assumptions got the better of me. What a fool I am. Never judge a show by it’s poster, you may be missing out on a truly touching experience. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nyfl15/blindspot_touched_me_in_a_way_no_show_ever_has/"
    },
    {
        "id": "1ny95q1",
        "author": "JicamaOdd2748",
        "title": "Riv4lries spin-off of Dia4ries",
        "content": "I just finished the show, and I honestly liked it. I found it really interesting. I tried watching Di4ries before, but I couldn’t get into it. I’m glad I at least finished this spinoff, though . Now I’m going back to Di4ries to give it another try and see if I like it this time. Has anyone else watched it? How did you feel about the show if you have?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ny95q1/riv4lries_spinoff_of_dia4ries/"
    },
    {
        "id": "1ny5ykw",
        "author": "yer_yeet_got_yote22",
        "title": "Monster: The Ed Gein Story",
        "content": "“Fornicating with a divorced woman. Drinking wine and eating these sinful cold cuts.” \n\nLMAO 😂😂😂\nI can’t stop laughing at this line. Who is writing this? Who wrote it? \nEvery character on this show is so weird it’s like the town has a gas leak. \n",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ny5ykw/monster_the_ed_gein_story/"
    },
    {
        "id": "1nyd5ks",
        "author": "morningstaaa",
        "title": "Alice in borderlands s3",
        "content": "I haven’t even finished episode 2 and im pissed off. I thought this would just be arisu and usagi living happily ever after and now they’re back in those god forsaken games?\n\nBanda never even met arisu or usagi- how would he know to invite him and WHY him? There were plenty of other survivors.\n\nWhy is Ann even here? Didn’t she die or am I making that up? Why couldn’t she just go back alone if she wanted to go so bad, why’d she have to drag arisu into it. \n\nUsagi is remembering the games and what happened, so she decides to go back? is she slow? Why would u go back there? Is she expecting to find her dad? cause If he’s been dead for months why would he just magically be in this in between world? What were the writers doing? I’m not watching this. ALSO these characters are boring.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nyd5ks/alice_in_borderlands_s3/"
    },
    {
        "id": "1ny80eo",
        "author": "Opening-Tomato9669",
        "title": "Fool me once (late review)",
        "content": "I watched this show today and what a waste of time and energy. I can't believe they made such of fuss over nothing. The acting was half decent but the plot does not make sense at all. Why did she go to such lengths at trying to find who killed Joe when she did it herself. A good thriller should be atleast a little bit if sense when you run it back in your head but this did not. She also comes across to me as a selfish mother . Why bring a child if you can not live for them. Time in time again , I have realised that living for love is more heroic than dying for it and this show is the exact example why. Her sister would not have wanted her to die to show the world the truth. It was stupid. Also how come Joe turned out to be a psycopath . Like do people not know the person they marry. He did not just kill once or twice. He probably killed more than shown in the show. What a rubbish show. I hated it maybe because I knew going in I was going to waste my time and I did it anyways. Okay bye!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ny80eo/fool_me_once_late_review/"
    },
    {
        "id": "1nybziq",
        "author": "Interesting_Form9194",
        "title": "Adeline in Monster: Ed Gein",
        "content": "I’m on the second to last episode of the show and I am so confused. Did Adeline actually know about what Ed Gein was doing in his house? Was she actually this disturbed girl who was way too much into dead bodies? In the beginning, I thought she would have been just someone who was nice to Ed from time to time and then drifted away but she ended up seeming like she aided in Ed’s fantasies. I tried doing so much research on her but I got nothing. The internet said that she changed her story so many times which just makes it even more suspicious. I want a more in-depth explanation on Adeline. I could care less about Ed Gein lol",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nybziq/adeline_in_monster_ed_gein/"
    },
    {
        "id": "1nxz9ex",
        "author": "Dadpod12",
        "title": "Halloween Movie Recs that Land Somewhere Between Disney and Freddy Krueger?",
        "content": "Looking for some Halloween movie recommendations that hit that sweet spot, not too cutesy Disney level, but also not full-on Freddy Krueger nightmare fuel.\n\nMy kids are getting older (around preteen age), and they’re at that stage where they want something a little scarier and more grown up, but I’d still like them to sleep through the night. 😅\n\nStuff like Ghostbusters, Gremlins, and have been hits in our house. Beetlejuice went over pretty well too. Trying to find more in that “fun spooky” category, things with monsters, mystery, or Halloween vibes without being too gory or depressing. Most recently we liked Hubie Halloween and The Curse of Bridge Hollow. Any recommendations for that middle ground? Bonus points for movies with adventure or humor mixed in! ",
        "upvotes": 6,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1nxz9ex/halloween_movie_recs_that_land_somewhere_between/"
    },
    {
        "id": "1nyb1gm",
        "author": "Mysterious_Beat_8533",
        "title": "Monster: Ed Gein story",
        "content": "I think Tom Hollander was absolutely abysmal as Alfred Hitchcock. The casting was just a complete misfire, not that the shows writing of Hitchcock was any better. Any time he’s on screen I’m genuinely tempted to just fast forward to the Gein parts, he’s just painfully bad. Was pretty excited to watch this considering how good the Dahmer season was, but the flash forwards are just so disjointed and completely ruin any flow the show gets into. IMO they could have done it in a way that made the Psycho storyline work, like do it in the second half of the season, but the flash forwards to this, combined with the episodes of Buchenwald psychosis just make the show a complete mess.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nyb1gm/monster_ed_gein_story/"
    },
    {
        "id": "1nyax60",
        "author": "WinterPomegranate297",
        "title": "You Season 5 and The Lost Bookshop by Evie Woods !Spoilers!",
        "content": "Yesterday I watched the last season of You. Part of the story was about Brontë, a randomly discovered employee of Joe’s.\nIt’s about a special bookstore that used to belong to his guardian (basically father) Mr. Mooney. Of course, the two of them fall in love, but it’s forbidden because he’s married and has a son.\n\nNow today I started reading the book, and I’m at chapter 19. Here, the married bookstore owner, who also has a son, inherited his antiquarian bookshop with old books from his father. He hires a female employee who just showed up out of nowhere, and they seem to be falling in love. Of course, that’s not really possible either. At the same time, the author Emily Brontë has already been mentioned several times.\n\nSo, for me it’s quite a coincidence that I’ve come across two such similar stories in a row. I know this isn’t such an unusual scenario, but honestly, I didn’t even know the name Brontë before, and I feel like the similarities are pretty striking, even though the rest of the story will probably play out differently.\n\nWhat do you think?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nyax60/you_season_5_and_the_lost_bookshop_by_evie_woods/"
    },
    {
        "id": "1nyati9",
        "author": "drywall_punching",
        "title": "Monster: The Ed Gein Story is legitimately one of the most disturbing things I've watched in a long time.",
        "content": "The way it's directed is better than most horror movies made of recently. The acting in it is also so good, it's so good it's disturbing. And this is coming from someone who has seem some dark shit on the internet and watched Cannibal Holocaust. Do not watch this if your squeamish or easily disturbed by gore or watching a guy straight up have sex with corpses.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nyati9/monster_the_ed_gein_story_is_legitimately_one_of/"
    },
    {
        "id": "1nxqnuv",
        "author": "anon9876543210nymous",
        "title": "It's ridiculous we have to wait 2-3 years for the next season !",
        "content": "I was eager for Wednesday and strange things to return \n\nAlso squid game. Upload ...\n\nBut I read online platforms will only renew a show once it's streamed for a year and shows ratings *good enough to renew*  which means filming can't really begin until much later to allow a timely release \n\nNetflix, prime all of them are doing this.\n\nI feel like they are trying so hard to save money that customer satisfaction isn't even considered ",
        "upvotes": 14,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1nxqnuv/its_ridiculous_we_have_to_wait_23_years_for_the/"
    },
    {
        "id": "1nxcw4k",
        "author": "Big-Sprinkles7377",
        "title": "Charlie Hunnam as Ed Gein",
        "content": "I cannot get over how absolutely absurd his voice is in this show. I understand that he’s trying to replicate Gein’s voice to the best of his ability, but…did he really need to sound like THAT?? It was definitely a choice, that’s for sure. Lori Metcalf rules though. ",
        "upvotes": 130,
        "comments": 235,
        "media": null,
        "permalink": "/r/netflix/comments/1nxcw4k/charlie_hunnam_as_ed_gein/"
    }
]