[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 11,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 694,
        "comments": 5103,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1nsrqsy",
        "author": "Ok_Kiwi_5692",
        "title": "I feel so bad for the dad in this show man",
        "content": "Adolescence (2025)",
        "upvotes": 1245,
        "comments": 276,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/95txb29ffxrf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1nsrqsy/i_feel_so_bad_for_the_dad_in_this_show_man/"
    },
    {
        "id": "1nt2mo2",
        "author": "Quiet-Example-8804",
        "title": "Haunting of hill house",
        "content": "This has to be one best Netflix series ever. I swear I’ve rewatch it a few times a year since it came out.. that’s all I had to say 😅 it’s just too good!! ",
        "upvotes": 47,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1nt2mo2/haunting_of_hill_house/"
    },
    {
        "id": "1nt9cfm",
        "author": "ItsMe_Chloee",
        "title": "Should I watch Gilmore Girls?",
        "content": "Honestly, the first episode seems interesting enough. But I'm still hesitating whether I should watch it or not. I've seen posts on Instagram about Rory and something about her studying techniques or something? I don't remember, but I plan on watching it because I need some motivation for studying but I just want to watch the show generally, regardless of the reason. Is the show good enough for me to be motivated to do stuff or not? Is it generally a fun show to watch? Need opinions!\n\n",
        "upvotes": 7,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1nt9cfm/should_i_watch_gilmore_girls/"
    },
    {
        "id": "1nsw9v9",
        "author": "AccomplishedPut5175",
        "title": "Wayward",
        "content": "What did I just watch\nI didn't have great expectations, but this series is so strong, that I was left without text.\nIn fact the emotions were mixed, did I just watch a masterpiece or something else.\nIn fact, you can't stay immune to the emotions that lead you through this series.\nThe actors are so amazing as the action of the series.\nFrom me any recommendation, with a note that the series is not for everyone.\n",
        "upvotes": 38,
        "comments": 118,
        "media": null,
        "permalink": "/r/netflix/comments/1nsw9v9/wayward/"
    },
    {
        "id": "1nt64sk",
        "author": "Loopy_Love",
        "title": "Need to laugh",
        "content": "What is the funniest movie you've ever seen? I really really could use a laugh so hard I cry movie. Netflix preferred but can be any streaming service. ",
        "upvotes": 6,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1nt64sk/need_to_laugh/"
    },
    {
        "id": "1nt2vc5",
        "author": "RiseDelicious3556",
        "title": "Is Wayward Worth Watching??",
        "content": "I watched the first two episodes and so far I'm not impressed, either by the acting or the plot. Just wondering if this thing picks up or stays the same. Reminds me of American Horror Story but with poorer acting.",
        "upvotes": 10,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1nt2vc5/is_wayward_worth_watching/"
    },
    {
        "id": "1nsrqxe",
        "author": "it-s-luminescent",
        "title": "Two men arrested after fight over Netflix account ends with gunfire",
        "content": "SAN ANTONIO - Two men have been arrested after a fight over a Netflix account ended with gunfire.\n\nBrian Travis Reynolds, 19, and Anthony Constante, 19, were taken into custody this week in connection with an incident outside a home on Calle Briseno, according to the Bexar County Sheriff’s Office.\n\nInvestigators said the confrontation started on September 23, after Reynolds changed the name on 20-year-old Vincent Munoz’s Netflix account to an insult. Munoz then agreed to fight Reynolds and Constante after feeling disrespected.\n\nWhen the pair showed up, they jumped a fence to get to Munoz. Reynolds had a handgun in his waistband, which he allegedly handed to Constante during the fight. At one point, Constante was seen on video striking Munoz repeatedly while holding the weapon, deputies said.\n\nThe fight continued after the gun was passed back to Reynolds. A shot was fired during the struggle, and Munoz was left bleeding from the head. It’s still unclear if he was struck by a bullet or injured another way.\n\nDeputies also noted the gun had been modified with an illegal device known as a “switch,” which turns it into a fully automatic weapon.\n\nReynolds and Constante were arrested.\n\n[Reynolds &amp; Constante: a cautionary tale in being careful re: sharing your Netflix password](https://preview.redd.it/ua398llofxrf1.jpg?width=1600&amp;format=pjpg&amp;auto=webp&amp;s=78e07955aabdf562b102294f9beeaff3b28df1ee)\n\n[news article link](https://foxsanantonio.com/newsletter-daily/two-men-arrested-after-fight-over-netflix-account-escalates-to-gunfire-gun-violence-switch-television)",
        "upvotes": 30,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1nsrqxe/two_men_arrested_after_fight_over_netflix_account/"
    },
    {
        "id": "1nt7az1",
        "author": "Comfortably_Numb_76",
        "title": "Question about Black Rabbit",
        "content": "In the last episode. Jake was attending the funeral and he  looked over at someone standing at a distance in the cemetery. Only showing the back of his head, standing by a headstone. Who was that? Anyone know? I'm sure I missed something. \n\nAbsolutely Loved this Series!! ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nt7az1/question_about_black_rabbit/"
    },
    {
        "id": "1ntcsc5",
        "author": "Beginning_Success127",
        "title": "Con mum",
        "content": "Am I the only one who felt bad for graham? Yes I feel that he was horrible for leaving his wife for the first few months n acting all normal coming back. However, I feel really bad that he didn’t have a mum for 45 years and when he did, she scammed him and left him high and dry. The documentary also said that his father was abusive and idk maybe it’s just me but I actually feel bad for him.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ntcsc5/con_mum/"
    },
    {
        "id": "1ntblds",
        "author": "GovernmentLess1991",
        "title": "What to watch on Netflix these days",
        "content": "I need some recommendations of what to watch on Netflix. These days, I have binged\n\n* Crime Scene Zero\n* Owning Manhattan\n* Cook at all costs\n* Sky Castle\n* Alice in Borderland\n* The Devil's Plan\n* Kian Bizarre B&amp;B\n* Bon Appetit Your Majesty\n* KPOP Demon Hunter\n* Easy Bake Battle\n* Next Gen Chef\n* Hell's Kitchen\n\nWell, yea I hope you could get a grasp of my watching style. No horror or thriller. Just lighthearted ones.\n\nSo recommend me some good shows please! I have run out of stuffs to watch.",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1ntblds/what_to_watch_on_netflix_these_days/"
    },
    {
        "id": "1ntbatp",
        "author": "Which_Mammoth9402",
        "title": "Shows or movies shot in NYC that give this exact vibe?",
        "content": "Looking for shows or movies that makes you wanna drop everything and move to New york lol. I want to watch something with really good cinematography and scenes that mainly takes place in the city. \n\nAny recommendations? 🤍",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ntbatp/shows_or_movies_shot_in_nyc_that_give_this_exact/"
    },
    {
        "id": "1ntb8r7",
        "author": "Winter_Emergency6179",
        "title": "On my third watch of Damsel, I noticed something.",
        "content": "When the queen takes Floria to throw her down, the prince refuses to let her cut his hand. She calls him weak and proceeds to cut Florias hand and her own hand. I'm unsure if it was intentional, but the queen cuts Florias hand a lot slower than she cuts her own. If it was intentional, she wanted to cause Floria more pain and herself less. And she had the audacity to call the prince \"weak\". It was just such a small detail that I noticed and really just shows how sick the queen is. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ntb8r7/on_my_third_watch_of_damsel_i_noticed_something/"
    },
    {
        "id": "1nt61g8",
        "author": "HenryStamper1",
        "title": "Next Gen Chef brought to you by Eco Lab",
        "content": "Great show. But the Eco Lab product placements are hilariously forced and heavy-handed. Nothing subtle about them. I bet we see more of this type adverting on Netflix moving forward. ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nt61g8/next_gen_chef_brought_to_you_by_eco_lab/"
    },
    {
        "id": "1ns5sby",
        "author": "No_Holiday5742",
        "title": "Black Rabbit is a masterpiece",
        "content": "I just finished Black Rabbit and honestly, I think it’s one of the best shows I’ve seen in a long while.\n\nExciting and unpredictable – Every episode had me hooked. There’s this constant tension and unease that made me lean in, waiting to see what would happen next.\n\nEmotionally provoking – It’s rare for a show to hit so many emotional notes; anger, sadness, empathy, anxiety and dread. All in the same arc. I found myself genuinely caring about what happened to the characters.\n\nCharacters you invest in – Even when they’re flawed or making questionable choices, I couldn’t help but root for them or at least understand them. That level of writing and acting is what kept me so engaged.\n\nActing – Top-tier. The performances felt layered, raw, and real, like you’re watching people rather than actors.\n\nCinematography – The dark, grey tones of NYC were such a perfect backdrop. It wasn’t just filmed in New York; the city itself felt like a character. That moody aesthetic pulled me in even deeper.\n\n\nWhat I don’t understand at all is why The Guardian gave it a negative review. Honestly, did we even watch the same show? For me, it delivered on every front; storytelling, visuals, acting, and atmosphere.\nEdited to add the music matched the dark and gritty theme so well also!\n\nOverall, Black Rabbit just worked. It’s one of those rare shows that stays with you long after the credits roll.\n\n\nAnyone else feel the same way, or equally baffled by the negative takes?\n\n",
        "upvotes": 256,
        "comments": 258,
        "media": null,
        "permalink": "/r/netflix/comments/1ns5sby/black_rabbit_is_a_masterpiece/"
    },
    {
        "id": "1nt663l",
        "author": "AccomplishedPut5175",
        "title": "Alice in Borderland",
        "content": "The first two seasons were almost perfect, while the third...\nI enjoyed this series, especially the last episode of season 2, where for a moment I didn't know what to believe.\nI have to admit that season 3 is perhaps the weakest season, and I was really annoyed that it ended like a squid game in America.\nDoes this mean we will have an American version of this series?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nt663l/alice_in_borderland/"
    },
    {
        "id": "1nt60fy",
        "author": "born_again_tim",
        "title": "Solteras - what’s up with the ending?",
        "content": "Wtf I thought there would at least be some closure with that dude she cat-fished. Or with the ex. It’s a good movie but just feels like things weren’t really tied up in the end (I guess that is in keeping with real life - maybe that’s what the writer / director was going for?)\n\nEdit: English title is ‘Ready to Mingle’",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nt60fy/solteras_whats_up_with_the_ending/"
    },
    {
        "id": "1nsmjra",
        "author": "Wylershipper09",
        "title": "The Ultimate Wyler Pitch: Scenes/Scripts For Wednesday Season 3 🖤",
        "content": "Don’t worry: no Season 2 spoilers here, just fan-made ideas and imagined Season 3 moments.\n\nPlease read all of my scenes, they aren’t in any particular order and before you start, here are pictures from Season 1 &amp; 2 that we need to see from Wednesday again 😉\n\nScene 1: Jealousy SparksA heated moment where jealousy shows, either from Wednesday or Tyler (or both). That enemies-to-lovers energy adds fire to their journey and deepens the tension.\n\nScene 2: The Woods, North of the Canadian BorderEnid is missing in her wolf form, and Wednesday refuses to give up searching. Tyler insists on helping. As they move through the dark woods together, the danger pulls them closer.Tyler: “She used to tell me the woods would protect me. But now it feels like they’ve turned against me.”Wednesday (coldly honest): “The woods don’t betray. People do. The trees are indifferent, like me. But indifference can be a shield if you know how to use it.”Tyler (dark laugh): “Trust you to make grief sound like survival training.”Wednesday (steps closer, voice low): “It is. And if you want to survive, stop seeing these woods as haunted… and start seeing them as ours.”\n\nScene 3: The Angry Love ConfessionSomeone insults Wednesday. Tyler steps in, furious.Tyler: “Say that again and I’ll make you regret it.”Wednesday (eyes flash with fire): “You didn’t have to—”Tyler: “Of course I did. Because I love you, Wednesday. And whether you like it or not, you’re mine… my Graveheart.”Wednesday (pauses, smirks): “Finally. It took rage to drag it out of you. I’m yours too…. my Ruin. I love you.”Tyler: “We really are two black-hearted souls ready to pillage the world together.” (smirks)Wednesday: allows the faintest ghost of a smile to slip through.Their first real kiss ignites.\n\nScene 4: Wednesday’s NarrationWednesday (voiceover):“I never believed in love, and I’ve always hidden my emotions because they reveal a weakness others could use against me. But Tyler saw through it. He’s seen the sides of me I promised I’d never show. And despite everything he’s done, I love him. I can’t bring myself to get through any day without him.”\n\nScene 5: Tyler’s GriefWednesday helps Tyler face his mother’s death, not with softness, but brutal honesty. She tells him grief never disappears, but it can sharpen you. For the first time, Tyler realizes she understands him better than anyone else.\nTyler (voice low, almost breaking): “You’re the only one left for me. No one sees me the way you do. I only have you.”\nScene 5.5: Tyler’s Apology\nTyler: “I’m so sorry for everything I’ve done. I know I don’t deserve forgiveness, but I need to hear it from you eventually so I can live without hating myself.”\nTyler’s narration: “I feel like such a hypocrite asking her for forgiveness, knowing I’ve done nothing to earn it… yet. I never realized how special she was before, but now I do. Wednesday deserved better than me, way better than me.”\n\nScene 6: Favourite TortureTyler: “You’re my favourite type of torture.”Wednesday (smirks): “The kind you won’t survive.”Tyler (leans closer, voice trembling, hands twitching as he resists touching her): “Then I’ll die happy.”\n\nScene 7: Kidnapping/DangerIf Wednesday is captured:Tyler: “If you think I’ll let her die, you’re dead wrong.”Wednesday (with her signature smirk): “Wednesday Addams doesn’t die, Tyler. You should know that by now.”\nIf Tyler is trapped:Tyler: “I thought you despised me. Turns out you can’t get rid of me that easily, Wednesday Addams.”Wednesday (rare flicker of emotion): “No. I can’t.”\n\nScene 8: Wednesday Takes Control (NEW SCENE)After being betrayed by Isadora or the Hyde pack, Tyler allows Wednesday to become his master, dark tension, power play, and Wyler chemistry at its peak.\n\nScene 9: Proving HimselfTyler earns Enid’s forgiveness by showing up when it matters most. Later, he saves not only Wednesday but also someone from her family, Pugsley, Thing, or even Uncle Fester. The ultimate way of proving his loyalty and securing his place in her world.\n\nScene 10: Gothic Romance Moments\n* The fiery kiss scored with a song like “Wrong” by Chris Grey (personal favourite, but many options).\n* A Phantom of the Opera inspired dance at Nevermore, gothic and hauntingly beautiful. Before they dance, Tyler greets her with a kiss to her hand.\n* Wednesday stumbles across a hidden drawing of herself in Tyler’s sketchbook, proof that he’s been haunted by her all along.\n\nScene 11: The Unspoken TruthTyler: “Tell me the real reason you missed.”Wednesday (eyes narrowing, voice low but teasing): “I missed because even someone like me can care… for someone like you, even when I shouldn’t.”\n\nScene 12: Choosing Her Over the PackTyler stands between his Hyde pack and Wednesday, torn for a moment but then resolute.Hyde pack: “Just leave her, Tyler. She’s not worth it.”Tyler (eyes blazing, voice steady): “That’s where you’re wrong. She’s worth more than every ruby, every diamond, every secret you hide behind. I’m choosing her. You were never even an option.”\n\nBonus Scenes &amp; Fan FavesThese are just a bit more standout Wyler moments. There are extra jealous sparks, emotional confessions, and suspenseful moments that add even more depth to their story. Each scene builds on their dark, emotional journey and shows why Season 3 could be the most talked-about chapter yet.\n\nWrap-upScenes like these keep Wyler gothic and emotional at its finest. This is a full pitch of Wyler that could make Season 3 unforgettable and trending online. Scenes like these could boost Netflix’s views, smash their own records, and satisfy Wyler fans everywhere.\nWyler isn’t just romance, it’s gothic history in the making.",
        "upvotes": 12,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1nsmjra/the_ultimate_wyler_pitch_scenesscripts_for/"
    },
    {
        "id": "1nt06yd",
        "author": "Conscious_Pie3987",
        "title": "Search for a Movie",
        "content": "This Movie was Abluft a women that betrails and cheats on her husband I dont remember to much but These was atleast one scene where she was naked in Front of a large Windows mache somone remembers great ballons its Like a lowkey trihller ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nt06yd/search_for_a_movie/"
    },
    {
        "id": "1nsw0tm",
        "author": "meyerovb",
        "title": "Anyone able to get the coupon code forthefans to work on the Netflix shop?",
        "content": "They advertise it on their homepage as still valid, but it doesn’t work. I saw an old Reddit thread saying it wasn’t working a few days ago either. No live support right now and says expires today ",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nsw0tm/anyone_able_to_get_the_coupon_code_forthefans_to/"
    },
    {
        "id": "1nsk7dj",
        "author": "alexthagreat98",
        "title": "Billionare's Bunker is actually Pretty Good",
        "content": "I'm in the US so maybe this show was released prior, but just discovered it now. If you liked Money Heist, you will probably like this series too. They did have one of the actors from Money Heist in this one. It's sort of a mystery, thriller meets telenovela. I hope they make a season 2. ",
        "upvotes": 15,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nsk7dj/billionares_bunker_is_actually_pretty_good/"
    },
    {
        "id": "1ns3tc5",
        "author": "Bunny2804",
        "title": "Alice in Borderland is better than Squid Games",
        "content": "I swear people are sleeping on Alice in Borderland.\n\nThe mindgames, the thrill and the overall tone, in my humble opinion is much better than Squid Games and it should have had the hype and success similar, if not greater than SG.\n\nI don't know if season 3 is the final one or not but man I really hope they can continue if there are more stories to tell. \n\nThis and One Piece are two of the best live action manga adaptations we have imo.",
        "upvotes": 188,
        "comments": 89,
        "media": null,
        "permalink": "/r/netflix/comments/1ns3tc5/alice_in_borderland_is_better_than_squid_games/"
    },
    {
        "id": "1nsrlo7",
        "author": "Upstairs-Ad6502",
        "title": "Season 1 tires review a light hearted hit",
        "content": "\n​I think Season 1 of Tires is simply an awesome watch from start to finish. The show is packed with light-hearted fun that makes it incredibly easy to binge. It has that great quality of being simple, pure entertainment without much heavy lifting. While the main story arc builds in a somewhat predictable way, the journey is still highly enjoyable. I was particularly impressed with the interpersonal conflict and sharp dialogue between the characters. The entire cast has been perfectly picked for their respective roles in the auto shop. Shane and Will are especially perfect, carrying the comedy with their brilliant chemistry. Their relationship is the heart of the show and provides most of the laughs. The comedic timing is insane to watch. I genuinely like the show's approach to covering various social subjects. It addresses them realistically and with a good sense of humor, which is refreshing. Crucially, it manages to bring a positive message to the world without ever feeling like a boring public service announcement. Overall, I really loved the first season of Tires and highly recommend it for a fun, quick watch.",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nsrlo7/season_1_tires_review_a_light_hearted_hit/"
    },
    {
        "id": "1nsehv0",
        "author": "Throwaway-1001-",
        "title": "Any good documentaries with plot twists?",
        "content": "Really liked Sweet Bobby, Tell me Who I Am and the recent one i can't name without getting this post taken down. Was looking for something with a good plot twist, any recs? No need for trigger warnings.",
        "upvotes": 37,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1nsehv0/any_good_documentaries_with_plot_twists/"
    },
    {
        "id": "1nt26ba",
        "author": "inspector-say10",
        "title": "logged out",
        "content": "is anybody else’s netflix logging out everytime they close the app?\n\nive had this problem for 2 days now on my phone and my TV. ive tried to logout and login myself, uninstalling and reinstalling the app but it’s not working and it’s fucking annoying logging in everytime i start the app up.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nt26ba/logged_out/"
    },
    {
        "id": "1nt1asy",
        "author": "GRB787",
        "title": "Trouble streaming",
        "content": "Just bought a new laptop. I try to stream on Edge or Chrome, and the little red circle just keeps floating. I don't have this problem with youtube or other streaming platforms. I was wondering if there was anybody that might know what might be going on?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nt1asy/trouble_streaming/"
    },
    {
        "id": "1nt0wt1",
        "author": "Character-Pen2345",
        "title": "bon appetite your magesty",
        "content": "A really really good show tbh\nI completed whole series in three days \nI was completely hooked \nEvery episode was worth watching and the story line ended on a really good plot \nIf you're someone who enjoys fiction thatbis the way to go ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nt0wt1/bon_appetite_your_magesty/"
    },
    {
        "id": "1nt8h73",
        "author": "Changed_Maniac65",
        "title": "Can Netflix stop doing the \"what if this happened in the US?\" (Squid Game and Alice in Borderland both S3 spoilers)",
        "content": "We don't need it. We never needed the \"what if this happened in America\" idea that gives a possibility of a spinoff. The interactions are always unnatural and it adds nothing.\n\nSeason 1 of Squid Game ended nearly perfectly, but gave way for a Season 2 and 3, both went to crap.\n\nAlice in Borderland was slow (as Netflix shows are) but was good until they threw in the last minute.\n\nNobody wants it. You're not gonna do it. Just stop.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nt8h73/can_netflix_stop_doing_the_what_if_this_happened/"
    },
    {
        "id": "1nsx5rt",
        "author": "Medytuje",
        "title": "Wrong Side of Tracks /Entrevillas Ending - 10/10",
        "content": "I have finally finished this series and i'm impressed by the quality of the series. It's one of those series where writers finished the show on a higher note than any other shows in the last 10 years of television.\n\nThey simply wrote Tirso perfectly from start to finish. His decisions were logical, smart, they were consistent with who he was and it was a pleasure watching this finale. Work of the camera, music, how we got the perfect closure. I had tears in my eyes. Thank you!\n\n  \nedit : Spanish title is ofc Entrevias.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nsx5rt/wrong_side_of_tracks_entrevillas_ending_1010/"
    }
]