[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 11,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 680,
        "comments": 5045,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1npazk0",
        "author": "Sweaty-Toe-6211",
        "title": "Netflix is reportedly fast tracking their 'DEMON SLAYER' live-action adaptation after the massive success of the 'Demon Slayer: Infinity Castle' movie",
        "content": "",
        "upvotes": 147,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1npazk0/netflix_is_reportedly_fast_tracking_their_demon/"
    },
    {
        "id": "1npcu0x",
        "author": "RandomTurkey247",
        "title": "Jason Bateman in Black Rabbit",
        "content": "When he first comes on the screen, I was like \"OMG, he's the Duderino!\"\n\nRon Howard's voice: \"he would quickly learn Vince was, in fact, not the Duderino.\"",
        "upvotes": 37,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1npcu0x/jason_bateman_in_black_rabbit/"
    },
    {
        "id": "1npm3sl",
        "author": "moon-1992",
        "title": "Lincoln lawyer or suits? What do you prefer?",
        "content": "Don’t know what to watch. I’m looking for the one that’s more brilliant and funnier to watch after work. Suits is the one that has been frequently recommended to me but that doesn’t mean anything.",
        "upvotes": 6,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1npm3sl/lincoln_lawyer_or_suits_what_do_you_prefer/"
    },
    {
        "id": "1npthej",
        "author": "fizzyjuices",
        "title": "Just finished Adolescence",
        "content": "Wow, I just sobbed at the very last scene of the Dad sobbing in Jamie’s room and tucking the teddy bear in. Facing what’s probably been his biggest fear since the day he found out what Jamie did - that he, as his father, should’ve done more. \n\nThere were so many emotions to hold while watching this show and I especially felt it during this episode. I wanted to be angry with his family, because that’s the easiest thing to do when a 13 year old boy does something like this. Assume his family/home life is terrible. But there was this mixture of love, shame, anger, and grief they were experiencing. I’ve seen other comments on here say that the dad was emotionally abusive. This may be my own blind spot coming out as the daughter of a man with anger issues, but I can’t tell whether that’s what the series was trying to depict or not. What I saw was a man with temper issues but that those issues were extremely exacerbated by trying to keep it together and being in denial about his son’s actions. Not that people are merely “good” or “bad,” but seeing his family be “good” people made it a more emotional watch for me. And it makes me wonder how it is Jamie became the way he did. \n\nI felt gutted by the last scene and I thought it did an excellent job of demonstrating the grief they are going through. They are grieving the son they once knew and who they thought he was. They were trying to make sense of how this happened even though they had the best of intentions and were, by all means, a pretty “normal” family. But as I felt gutted for his family, I had to remind myself what her family must be going through. And how what happened was tragic and Jamie’s actions wreaked havoc upon everyone around him - no one in his family did what Jamie did but they are paying for his actions. But at the end of the day his main victim, above all, is the girl whose life he felt entitled to take, and nothing can ever change that. It’s something his family will have to accept and her family will have to grieve forever. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1npthej/just_finished_adolescence/"
    },
    {
        "id": "1npece3",
        "author": "orionstarseed",
        "title": "What are some wild thriller series like Untamed, Fringe, Blacklist, Luther, True Detective and Hannibal?",
        "content": "Looking for some good suspenseful series like the ones I listed in the title. Grotesquerie was pretty good as well. I want too watch some more really dark thriller series with suspense, creative kills, fast paced and not slow burn, weird puzzles that the police have too folow in order too catch the killer.  Untamed, Fringe, Blacklist, Luther, True Detective and Hannibal all had perfect pilot episodes in my opinion that got me invested knto watching the shows fully. If the pilot, second or third episode doesn't hook me i'm out. Not going too waste my time waching a slow burn series with mostly talking and literally nothing happening for the whole episode(s)",
        "upvotes": 10,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1npece3/what_are_some_wild_thriller_series_like_untamed/"
    },
    {
        "id": "1noosxn",
        "author": "borderlineactivity",
        "title": "DARK",
        "content": "I can’t believe I slept in this absolute piece of art for SO long. Best show I have seen in a loooong time. If you haven’t watched it yet; you are definitely missing out! \n\n\n",
        "upvotes": 373,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1noosxn/dark/"
    },
    {
        "id": "1npu5e4",
        "author": "Oscarbear007",
        "title": "Age rating on a kids profile",
        "content": "I tried looking online with no luck, but is it possible to adjust the age ratings on a kids profile to NOT show y-7 but have PG shows?  I don't need my 9 year old watching toddler shows anymore, and it clogs up so much space.  I know you can bump it down to only show lower age, but I want to do the opposite and NOT show the lower age shows.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1npu5e4/age_rating_on_a_kids_profile/"
    },
    {
        "id": "1npszw0",
        "author": "Braska_the_Third",
        "title": "Sound issues?",
        "content": "This week I decided  screw it, you wanna push Franklin and Bash so hard. I'll try it.\n\nThere was no sound. So I changed it from 5.1 to original.  Worked.\n\nEpisode 2, neither worked, so I watched something else.\n\nI just started Spartacus episode one. No sound, I changed from 5.1 to to original audio and it works.\n\nShould I even bother? Or will episode 2 not have sound again?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1npszw0/sound_issues/"
    },
    {
        "id": "1nps9ki",
        "author": "NicDelMit",
        "title": "🥹help appreciated please",
        "content": "Does anyone know if I can watch WAYWARD now. It’s been released today 25th September on Netflix UK but I’ve been told it won’t be available to watch until 8am. This may sound strange as it’s only a few hours away but I’m really unwell and unable to sleep and was hoping to watch it. 😢🥹",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nps9ki/help_appreciated_please/"
    },
    {
        "id": "1npm7g8",
        "author": "fizzyjuices",
        "title": "Adolescence episode 3",
        "content": "Why do you think the psychologist cried at the end? Fear, disgust, sadness (for Katie or Jamie), thinking Jamie was too far gone, his reaction to her ending the interview abruptly, something else? Curious to hear since she doesn’t outright explain her thoughts at any point during this episode. ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1npm7g8/adolescence_episode_3/"
    },
    {
        "id": "1nppylo",
        "author": "BRAK3NN",
        "title": "My Netflix has a problem, in the top right corner there are some strange laughs, how can I fix it without uninstalling the app?",
        "content": "My Netflix has a problem, in the top right corner there are some strange laughs, how can I fix it without uninstalling the app? I use Android and this problem has been bothering me a lot lately because every time I watch something, including downloaded episodes, I get these scratches, I don't know what else to do",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nppylo/my_netflix_has_a_problem_in_the_top_right_corner/"
    },
    {
        "id": "1npk2i6",
        "author": "ssssss1218",
        "title": "Need shows recs!",
        "content": "Hi! I need some binge-worthy show recommendations, either on Netflix, Hulu or HBO Max. I do have Animal Kingdom and Black Rabbit in my queue, so not those, please! Thank you\n\nSome of my favorites I've watched and would like to watch something similar to:\n\n\\-Sopranos, Breaking Bad, Better Call Saul, Dexter, Ozarks, Six Feet Under, The Walking Dead, Stranger Things, Snowfall, Prison Break, Sex Education, Vampire Diaries, Oz, Shameless",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1npk2i6/need_shows_recs/"
    },
    {
        "id": "1npjz64",
        "author": "WeideMilch",
        "title": "Which film can I watch with my girlfriend?",
        "content": "I need quick help, we want to watch a movie in the next 30 min. We always have the problem to find something that we both like, maybe some of you can help. I want action, it need to be exciting, but I also want a depp Story not just explosions. My girlfriend hates blood, dont like sad movies and needs some \"girlie\" stuff in it. We both liked Bullet Train for example or the Panem Movies. And somehow she really likes horror, so that would be fine too. ",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1npjz64/which_film_can_i_watch_with_my_girlfriend/"
    },
    {
        "id": "1noqv2x",
        "author": "Sea-Procedure-7988",
        "title": "True crime psychological thriller",
        "content": "Hello, I’m looking for a tv series to get into, something that will hook me and keep me wanting more. I enjoy shows where it’s not obvious who committed the crime, etc. also please nothing tooo old or outdated :)\n\nHere’s a list of some of my favorite tv series: the sinner \nPresumed innocent \nUnbelievable \nAnimal kingdom \nOzark \nBlood lines \nHunting wives \nThe keeper \nKaren read trial \nMind hunter \nHeist \nThe program \nHe’ll camp \nMr robot \nUntamed \nBehind her eyes \nDexter \nBreaking bad \nYour honor \nSeven seconds \nThe infiltrator \nThe night of \nAmerican nightmare \nAccused \nWorst roommate ever \nLincoln lawyer \nYou \nMaid \nTell me lies \nPainkiller \nMaking a murder \nGinny &amp; Georgia \nSurviving black hawk down",
        "upvotes": 65,
        "comments": 135,
        "media": null,
        "permalink": "/r/netflix/comments/1noqv2x/true_crime_psychological_thriller/"
    },
    {
        "id": "1npin2j",
        "author": "SimilarSprinkles9588",
        "title": "Frontier, American Primeval reviews",
        "content": "has anyone watched the show frontier on netflix , i recently watched it and personally think it was a good watch . not the best but not bad either. I will probably watch american primeval next. thoughts on both of these shows",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1npin2j/frontier_american_primeval_reviews/"
    },
    {
        "id": "1npihrz",
        "author": "kppk_-",
        "title": "holy family series",
        "content": "my question would be what is your opinion on this series? I think sometimes it was mindblowing but sometimes it was like a bad spanish soap opera. I am interested in anything you could tell about this series, characters etc.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1npihrz/holy_family_series/"
    },
    {
        "id": "1npgqfd",
        "author": "Mary_Ellen_Katz",
        "title": "Netflix lowers movie/show quality while playing games in other monitor.",
        "content": "I have a PC with two PC's, and find when I'm playing a movie (netflix) on one monitor with a game on the other, Netflix will force the quality to downwards of 480p. I have a very good computer with fiber internet. It's not a bandwidth issue on my end, and suspect Netflix is giving me less quality because it recognizes I am not focused on it primarily. Other platforms do this as well.\n\nI want to know how to *force* Netflix to maintain its quality even while I am playing a game, tabbed onto a different tab, or even if I have the window minimized. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1npgqfd/netflix_lowers_movieshow_quality_while_playing/"
    },
    {
        "id": "1npg779",
        "author": "Affectionate_Bee_1",
        "title": "Do you have recommendations for comedy shows that aren’t too silly/dumb?",
        "content": "Shows I loved:\n\t•\tModern Family\n\t•\tYoung Sheldon\n\t•\tSuperstore\n\t•\tResident Alien\n\t•\tGhosts\n\t•\tHaunted Hotel\n\nThese shows are light-hearted, about family, friends, and bonding in general, and they have a heartwarming story.\n\nShows I didn’t like:\n\t•\tShameless\n\t•\tBrooklyn 99\n\nThey were too bold, vulgar, and had a kind of trailer-park humor that I didn’t enjoy.\n",
        "upvotes": 0,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1npg779/do_you_have_recommendations_for_comedy_shows_that/"
    },
    {
        "id": "1npr7kb",
        "author": "Eeebruheem",
        "title": "Scrolling through Streaming services is a nightmare. Here’s how I finally stopped",
        "content": "I don’t know if this happens to anyone else, but I’ll sit down after work ready to watch something… and then waste 30–40 minutes just scrolling through Netflix, Prime, Disney+, etc. By the time I finally pick something, I’m not even in the mood anymore. Super annoying. I feel like I spend more time scrolling than actually watching.\n\nI recently came across this tool called **AltFlicks** that actually fixes the problem. You just pick your mood, genre, time, and what streaming platforms you have, and it gives you a handful of solid recommendations right away.\n\nIt’s honestly been a game-changer for me. Instead of endless scrolling, I just set a vibe → get a few good options → actually start watching.\n\nIt’s free to try right now, so figured I’d share in case anyone else struggles with the same decision fatigue: its called **Altlficks**\n\n",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1npr7kb/scrolling_through_streaming_services_is_a/"
    },
    {
        "id": "1npel6j",
        "author": "South-Tone-1370",
        "title": "Uglies a Netflix movie",
        "content": "I want to talk about this movie because I have read the book many years ago and I rooted for its live action. But, I was sad about how they used characters that are already beautiful, they just made them haggard, because in the book they were very asymmetrical, and you can clearly imagine the difference between being ugly and pretty, in the movie they just gave the characters make up and wigs as an after surgery outcome. There was a highlight with the eyes being golden, but the book wasn't about that, the book emphasized the height, the symmetry, and how everybody(Pretties) looked the same. Also the plot twist Shay was her original best friend from the very beginning, not Peris. ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1npel6j/uglies_a_netflix_movie/"
    },
    {
        "id": "1npebin",
        "author": "EquivalentCivilian",
        "title": "No HDR on Windows 11 App",
        "content": "I've downloaded the HEVC extension on microsoft store, and enabled HDR even if HDR is off in settings, but the videos still won't play in HDR. How do I fix this?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1npebin/no_hdr_on_windows_11_app/"
    },
    {
        "id": "1np0yk9",
        "author": "bruhwhatshappenin",
        "title": "Ed Gein",
        "content": "After watching the full trailer that was released I think this is going to be much harder to watch than the Dahmer series 😳 I watch a lot of true crime shows and can stomach a lot but Dahmer literally gave me anxiety and it took me WEEEKS to finish. With any other series I’m a binge watcher and finish it relatively quickly. Just the trailer alone was hard to get through. Anyone else feel that it will be “better” for lack of a better term than Dahmer? Trailer below for anyone who hasn’t seen yet \n\nhttps://m.youtube.com/watch?v=EDBmpfbnLGk&amp;pp=ygUPZWQgZ2VpbiBuZXRmbGl4",
        "upvotes": 9,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1np0yk9/ed_gein/"
    },
    {
        "id": "1npdf0r",
        "author": "ElliotWilhelm",
        "title": "Help with these beer tap handles",
        "content": "I need some help, identifying which shows these beer handles belong to. They are all Netflix show, but some of them I can’t nail down. Specifically the 1st two handles. ",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1npdf0r/help_with_these_beer_tap_handles/"
    },
    {
        "id": "1notdw9",
        "author": "SerialSeriesQueen",
        "title": "Black Rabbit and the restaurant business",
        "content": "Black Rabbit did a phenomenal job at portraying life in a big city restaurant, especially its seedy underbelly. I grew up in Philadelphia with a step dad who owned multiple successful restaurants in the city and Jake reminded me so much of him as he was in the early 2000s. Charming, charismatic, ambitious but underneath, stressed out, under pressure, and constantly worrying about money trying to keep up appearances. Even the staff brought back early memories of my life as a hostess/bartender at some of those restaurants/nightclubs. Very close, very tight knit, but riddled with drug use and drama, and overlooking major red flags. I really appreciated the effort they went through in giving the viewer a realistic representation of that world. ",
        "upvotes": 21,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1notdw9/black_rabbit_and_the_restaurant_business/"
    },
    {
        "id": "1npcmdc",
        "author": "nowthatssuspish",
        "title": "Good time travel movies/shows?!",
        "content": "I was reading a post on here asking for recs for time travel movies, but most of the responses are over a decade old with so must watch shows that don't exist on Netflix anymore. \n\nJust finished the Lazarus project, and I want some other shows to watch in this genre on Netflix! ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1npcmdc/good_time_travel_moviesshows/"
    },
    {
        "id": "1npca8x",
        "author": "nowthatssuspish",
        "title": "How can we as fans revive the Lazarus Project for season 3?",
        "content": "Not just the fans want it brought back, the actors do too. How do we as fans push for this and speak up about wanting a 3rd and final season? We as viewers hold the power, but how do we use it? \n\nEvery episode had me wanting more. \nWhat happened to Bryson when he arrived in 2024? What happened to kid Bryson? Which Bryson made it back to 2025? Are there three Bryson's now? What happened to wes? What happened to Becky(s)? Does she go find her dad that made it through the last episode as his 2012 version? Does she raise herself? Did Archie survive the crash and stay stuck in 2012 with her lover? What happened to 2012 shiv and ross? What happened to 2024 shiv? Did they stay with the Lazarus Project and wait for George to come back? Why was the only person there Sarah? Does George kill her then? There were cups of water on desks that insinuates the project is still running, with multiple agents running it. \n\nWe deserve to know. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1npca8x/how_can_we_as_fans_revive_the_lazarus_project_for/"
    },
    {
        "id": "1nphwuv",
        "author": "fatedeclipse",
        "title": "Monster tv series season 4 should be Chris Benoit",
        "content": "I had this thought today. It was a high profile crime and something that could play out rather well over a tv series. I'm sure it's unlikely but its fun to think about. \n\nIf you're not familiar he's a pro wrestler who after dozens of bad concussions and hard steroid abuse ended up killing his wife and child before committing suicide the same weekend. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nphwuv/monster_tv_series_season_4_should_be_chris_benoit/"
    },
    {
        "id": "1npaepi",
        "author": "startupgirl1234",
        "title": "Introverts of Reddit: what’s your comfort movie that you never got to talk about?",
        "content": "So, not sure how many ppl know abt this one but there is a movie on Netflix, it's called Three of Us, and i love the subtle storyline it has and how the songs play a part in it. I would love some more recommendations and pls do tell why you love it. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1npaepi/introverts_of_reddit_whats_your_comfort_movie/"
    },
    {
        "id": "1npadt0",
        "author": "pokebabe2015",
        "title": "She's Gotta Have It",
        "content": "Okay so I watched these 2 recently and I just need to chat about them 😂  (this sub won't let me post about UnKN so)\n\n\n\nShe's Gotta Have It.\nSo I watched it all, but I found Nola (the main character) really unlikable. I don't have masses to discuss, but yeah, I read some reviews on IMDB afterwards and was pleased to see similar thoughts. \nShe seemed incredibly self absorbed and self righteous. And yeah, she was a lousy friend, lover and partner. I was 100% with Opal when they argued and split. I don't have children, I don't want them either, but there's no way in hell I'd take a child to get their ears pierced, against the parents wishes, and then not tell them. \nShe abused Mars' love for her and took advantage of him. She claimed she didn't want to be like anyone else but \"the struggling artist living in NYC\" is like most of the population there I assume, equally so overdone and cliche 😂\nI also think she was very privileged in comparison to what millions of other women go through. And she was taking advantage of her God mothers generosity. She was very fortunate, and still kept acting like a victim.\nThe actress herself is stunning though. What a beautiful women - her eyes are gorgeous.\nI don't know, I have very mixed feelings on the whole show. I wouldn't recommend it personally. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1npadt0/shes_gotta_have_it/"
    },
    {
        "id": "1npovxf",
        "author": "Brucef310",
        "title": "Just announced, Season 2 of Black Rabbit: The Redemption.",
        "content": "Not sure how they will do this after what happens in the end but I am looking forward to see what they can do to follow up an amazing season 1. What are your thoughts on this?\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \nBTW I made up this news but I do like the show.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1npovxf/just_announced_season_2_of_black_rabbit_the/"
    }
]