[
    {
        "id": "1jz2rfp",
        "author": "netflix",
        "title": "Hi, I'm Gareth Evans, writer/director of new Netflix film HAVOC, as well as The Raid, The Raid 2 and Gangs of London, AMA",
        "content": "In between doing press for my new film HAVOC (starring Tom Hardy, Jessie Mei Li, Forest Whitaker, Justin Cornwell, Timothy Olyphant and Luis Guzmán – coming to Netflix everywhere on 25 April) I’ve got time to answer some of your questions. So feel free to ask me anything…\n\nTuesday 15th April, 5.00pm BST/9am PDT\n\nhttps://preview.redd.it/g2dmphnxptue1.jpg?width=4281&amp;format=pjpg&amp;auto=webp&amp;s=878e864458de372b6a45d9da591c76087d005c5e\n\n  \n",
        "upvotes": 129,
        "comments": 138,
        "media": null,
        "permalink": "/r/movies/comments/1jz2rfp/hi_im_gareth_evans_writerdirector_of_new_netflix/"
    },
    {
        "id": "1jzb9wd",
        "author": "SanderSo47",
        "title": "April 11-13 Box Office Recap: On its second weekend, 'A Minecraft Movie' became the second biggest video game movie worldwide with $552 million. 'The King of Kings' over-performs projections, 'Warfare' opens decently, while 'The Amateur' and 'Drop' underwhelm.",
        "content": "https://preview.redd.it/5wk8mzvkhvue1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=9ba860803c8b374c941afb76643bcd1250c8556d\n\nDespite four wide releases this weekend, none of them could fight ***A Minecraft Movie*** for the top spot. ***The King of Kings*** delivered Angel Studios' second biggest debut, while stuff like ***The Amateur*** and ***Drop*** failed to light things up, although ***Warfare*** had a solid start.\n\nThe Top 10 earned a combined $145.1 million this weekend. That's up a colossal 112.4% from last year, when ***Civil War*** debuted with A24's biggest opener.\n\n***A Minecraft Movie*** was still at #1, adding $78.5 million. That's a 52% drop; not as bad as some other video game films, but it's also quite rough for a family flick. For contrast, ***The Super Mario Bros. Movie*** dropped 36.9% on its second weekend. Through 10 days, the film has earned $278.8 million, and it's still on track to finish with over $450 million domestically.\n\nIn second place, Angel Studios' ***The King of Kings*** earned $19.2 million in 3,200 theaters. That's the studio's second biggest debut, behind ***Sound of Freedom*** ($19.6 million). It's also the biggest debut for an animated bible film, surpassing ***The Prince of Egypt*** ($14.5 million), although ***Prince*** sold more tickets adjusted for inflation.\n\nThis is promising, and Angel Studios did a fantastic job with marketing. Not to mention having the film open with Easter around the corner, which should help it leg out. Like their prior films, they used the \"Pay It Forward\" feature, wherein someone can pay for a ticket for anyone else. The numbers reported are only those that were redeemed this weekend.\n\nAccording to Angel Studios, 59% of the audience was female. Despite middling critic reviews, the audience loved it more: they gave it a rare \"A+\" on CinemaScore, indicating strong word of mouth. The film should leg out all the way to $60 million at the very least, especially with no animated competition till June.\n\nIn third place, 20th Century Studios' ***The Amateur*** debuted with $14.8 million this weekend. This debut is lower than the recent action film ***A Working Man*** ($15.5 million), although that had a more bankable name in the lead role.\n\nWhile it's tough to get better numbers, one still thinks that the film could've opened higher than this. After all, Disney and 20th Century mounted an extensive campaign for the film, hoping to replicate other action film successes. But the thing with ***The Amateur*** is that it simply didn't offer anything new in the genre: a man loses his wife and sets out to get revenge. That's a genre that has been copied so many times, and it's tough to get excited for the 37th time it's played out. Even reviews (62% on RT) aren't really glowing.\n\nAccording to 20th Century Studios, 57% of the audience was male, and 47% was 25 and over. They gave it a so-so \"B+\" on CinemaScore, which doesn't exactly inspire confidence. With options like ***Sinners*** and ***The Accountant 2*** coming up, it'd be a surprise if ***The Amateur*** got close to $40 million lifetime.\n\nIn fourth place, A24's ***Warfare*** debuted with $8.3 million in 2,670 theaters. That's A24's sixth biggest debut, and while far off from Alex Garland's ***Civil War*** ($25.5 million), it wasn't ever going to come close to those numbers.\n\nAll in all, it's a solid start for the film. War films have been finding success in theaters, although films revolving around Iraq War have been quite inconsistent; some have succeeded (***American Sniper*** and ***The Hurt Locker***), others not so much (***Green Zone*** and ***Billy Lynn's Long Halftime Walk***). A24 did a great job in emphasizing the film's plot points: a real-time story of soldiers in Iraq. Some fantastic reviews (94% on RT) certainly helped as well.\n\nAccording to A24, 72% of the audience was male, and 53% was 25 and over. They gave it a great \"A–\" on CinemaScore, which is A24's best grade (their only other film to get this grade was ***The Iron Claw***). This is very encouraging, and suggests the film could leg out. For now, a $25 million domestic total is likely for ***Warfare***.\n\nIn fifth place, Universal/Blumhouse's ***Drop*** earned just $7.3 million in 3,085 theaters. That's below other Blumhouse titles like ***The Woman in the Yard*** ($9.3 million) and ***Wolf Man*** ($10 million). These numbers are also below director Christopher Landon's ***Happy Death Day 2U*** ($9.8 million), which was considered a disappointment back in 2019.\n\nEven though the film cost just $11 million, it feels like Universal simply didn't know what to do with the film. Even though they premiered it at SXSW, where it earned great reviews (83% on RT), it feels like they didn't push it hard enough. Or maybe the concept: a woman asked to kill her date to save her family didn't entice audiences. It's not unreasonable to believe that had the film come out during Blumhouse's golden years, it could've opened with $20 million or more. Are audiences giving up on Blumhouse? \n\nAccording to Universal, 53% of the audience was female and 35% was in the 25-34 demographic. They gave it a middling \"B\" on CinemaScore; this is not bad, but it's not great either. With some competition on the way, it's unlikely it save some face. It'd be a surprise if the film came anywhere close to $25 million lifetime.\n\n***The Chosen: Last Supper — Part 3*** earned $6 million this weekend. That's a 14% drop from ***Part 2*** ($6.9 million) last week. Across these 3 films, they have amassed $36.3 million domestically.\n\n***A Working Man*** was hit hard by the newcomers. It dropped a steep 59%, adding $3 million this weekend. The film has earned $33.4 million so far, and it looks like it will struggle to hit $40 million domestically.\n\nDisney's ***Snow White*** continues its freefall. The film now dropped 51%, adding just $2.8 million this weekend. Clearly, this film simply has no legs. The film has earned just $82 million so far, and it's guaranteed to finish below $90 million domestically. Terrible all around.\n\nNinth place belonged to Blumhouse's ***The Woman in the Yard***, which fell 54% and added $2 million this weekend. The film has earned $20.3 million so far, and it's finishing with something close to $25 million.\n\nRounding up the Top 10 was ***The Chosen: Last Supper — Part 2***. The film collapsed 86% this weekend, earning $961,861 this weekend. Through 10 days, it has earned $10.9 million so far.\n\n#**OVERSEAS**\n\n***A Minecraft Movie*** was still the #1 movie overseas. It added $79.6 million, taking its worldwide total to a colossal $552 million after just 2 weekends. The best markets are the UK ($39.8M), China ($20.3M), Germany ($18.9M), Mexico ($18.7M) and Australia ($18.5M). With this, it has already passed the ***Sonic*** movies to become the second biggest video game movie ever. The billion milestone is becoming more and more likely.\n\n***The Amateur*** slightly over-performed projections overseas, earning $17.2 million for a $32.2 million worldwide debut. The best debuts were in France ($1.6M), the UK ($1.4M), Mexico ($1.4M), Germany ($1.1M) and Japan ($1.1M). Based on the pattern of other action films, the film should hit the $100 million milestone, although some rough competition will put a challenge to that.\n\n***Snow White*** is nearing the end of its run worldwide. The film added just $4.7 million overseas, for a terrible $182.3 million worldwide total. Based on its drops, it looks like the film might go under $200 million worldwide. On a $270 million budget. Ouch.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Moana 2* | Nov/27 | Disney | $139,787,385 | $460,405,297 | $1,059,197,729 | $150M\n*Novocaine* | Mar/14 | Paramount | $8,809,436 | $19,861,854 | $33,545,800 | $18M\n\n- ***Moana 2*** has closed with $1.059 billion worldwide. Considering it was heading straight to streaming, that's a huge win for Disney Animation. Even if the quality of the film suffered as a result. The film debuted with a gigantic $389 million worldwide, which was the biggest debut for an animated title. But the film proved to be a bit front-loaded, especially for an animated film. A third film is inevitable, but Disney should really begin development as a film, not a half-assed TV show changed to a film.\n\n- No pain, no gain. Paramount's ***Novocaine*** closed with just $33 million worldwide, failing to recoup its $18 million budget. That's eerily close the numbers earned by Jack Quaid's previous film, ***Companion***. Despite hitting #1 on its opening weekend, the film simply couldn't find an audience in the weeks afterwards. Quaid may be popular online, but that doesn't mean people are paying to watch him lead a movie.\n\n#**THIS WEEKEND**\n\nOne film will try to challenge ***Minecraft*** for the top spot.\n\nThat film is Ryan Coogler's ***Sinners***, which stars Michael B. Jordan in a dual role in this horror title. Warner Bros. has backed up the film with an extensive marketing campaign, granting Coogler with his terms: the film's rights will revert back to him in 25 years. Coogler has had massive success with the ***Creed*** and ***Black Panther*** films, but this is his first major original film. And early reviews suggest he really cooked: it's sitting at a fantastic 100% on RT with 45 reviews so far. The big question is: will audiences support this?\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 184,
        "comments": 61,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4k9UJ5pF7VmXiIYGTBwKHDnKIuAK5DSP0EZFmp2ETFc.png?auto=webp&amp;s=568a7f69ddd0337a979ea82144fcdaabcd547e8f"
        },
        "permalink": "/r/movies/comments/1jzb9wd/april_1113_box_office_recap_on_its_second_weekend/"
    },
    {
        "id": "1jzebva",
        "author": "MarvelsGrantMan136",
        "title": "Alamo Drafthouse Strike Ends After Deal Is Reached in New York / All workers that were previously laid off at the lower Manhattan and downtown Brooklyn locations will be reinstated",
        "content": "",
        "upvotes": 1766,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/AtrDO93_gu5aUyyeVjz78Pqfpz6c7RXv9BGRsaAUVm0.jpg?auto=webp&amp;s=2a3019b0b16e365c31f1c7e0ad61d8e21c6b334d"
        },
        "permalink": "/r/movies/comments/1jzebva/alamo_drafthouse_strike_ends_after_deal_is/"
    },
    {
        "id": "1jyt5nj",
        "author": "OutrageousFootball10",
        "title": "Hollywood Is Cranking Out Original Movies. Audiences Aren’t Showing Up.",
        "content": "LOS ANGELES—When director Christopher Landon introduced his new thriller, “Drop,” before its premiere at the Chinese Theater on Hollywood’s Walk of Fame, he had a warning for the packed auditorium.\n\n“It’s really hard out there for an original movie,” he said, urging everyone who liked the Universal Pictures release to “scream it from the rooftops” and on social media.\n\n“Drop” opened this weekend to an estimated $7.5 million domestically, one of two new movies based on fresh ideas that fizzled at the box office. The other was Disney’s “The Amateur,” a spy thriller adapted from a little-known 1981 book, which opened to an estimated $15 million.\n\nAfter years of gripes from average moviegoers and Hollywood insiders alike about the seemingly nonstop barrage of sequels, spin-offs, and adaptations of comic books and toys, the film industry placed more bets on original ideas.\n\nThe results have been ugly. \n\nNearly every movie released by a major studio in the past year based on an original script or a little-known book has been a box-office disappointment. Before this weekend’s flops were Warner Bros. Discovery’s“Mickey 17” and “The Alto Knights,” Paramount’s “Novocaine,” Apple’s “Fly Me to the Moon,” Amazon’s “Red One,” and the independently financed “Horizon: An American Saga Chapter 1” and “Megalopolis.”\n\nJason Blum, who produced “Drop” and built his company Blumhouse largely on original horror franchises, said audiences’ preference for known properties has made it harder to release original movies in theaters, “even though that’s where some of the most exciting and risky storytelling still lives.”\n\nGetting people into theaters more frequently is a priority for a movie industry still recovering from the pandemic. Box-office revenue in the first three months of this year in the U.S. and Canada was the lowest it has been, excluding the pandemic, since 1996.\n\nAt the CinemaCon industry convention in early April, theater owners said they welcome more original films, but only if they are backed by robust advertising campaigns. Building buzz for a new film in a media environment fractured between YouTube, TikTok, streaming and sports is tough, particularly when it is an unknown title.\n\n“We’re opening films that have almost zero awareness,” said Bill Barstow, president of Main Street Theatres, a small Nebraska-based chain.\n\nMany consumers are content to wait until an original motion picture is available to rent online a few weeks after its theatrical release or to stream on a service like Netflix in a few months.\n\nThe only films succeeding in the current environment are those with built-in audiences, like “A Minecraft Movie,” which was released in early April and has grossed more than $280 million domestically. And these days, even franchises can be far from a sure thing. Long-running series such as Marvel and DC superheroes and live-action remakes of Disney animated classics are showing their age and proving unreliable at the box office.\n\nStudios say they have little choice but to make more original movies they hope will buck the odds.\n\n“Telling original stories and taking risks is the only path toward creating new global franchises,” Bill Damaschke, Warner Bros.’ head of animation, said at CinemaCon.\n\nSome of the increase in original film releases is attributable to Amazon and Apple, which are building film businesses with few well-established franchises. One of the biggest bets on an original film from any company this year is Apple’s “F1,” a June release starring Brad Pitt as a race-car driver.\n\nAmazon hyped 11 coming movies to exhibitors at CinemaCon, of which six were originals. Among traditional studios, Warner Bros. is taking the most risks on originals, with big budget films from directors Paul Thomas Anderson and Maggie Gyllenhaal. \n\nHollywood’s next original release comes Friday with Warner’s “Sinners,” a horror movie starring Michael B. Jordan. Next month even Marvel, home to Hollywood’s biggest franchises, is taking a gamble with “Thunderbolts,” about a super team brand new to all but the most devoted comic-book readers.",
        "upvotes": 7549,
        "comments": 3591,
        "media": null,
        "permalink": "/r/movies/comments/1jyt5nj/hollywood_is_cranking_out_original_movies/"
    },
    {
        "id": "1jziskj",
        "author": "doncesarito",
        "title": "Missing Subplot: Hot Fuzz: Why was the Cottage not ready and had to stay at Hotel?",
        "content": "In the movie, why is Sergeant Angel transferred to the hotel when he was promised a cottage? Is there a plot in the movie that explain what happened to the cottage? I cannot remember? Any help would be great because it was either never referred to later, or it was part of a deleted scene which I do not know about?",
        "upvotes": 128,
        "comments": 71,
        "media": null,
        "permalink": "/r/movies/comments/1jziskj/missing_subplot_hot_fuzz_why_was_the_cottage_not/"
    },
    {
        "id": "1jz0arv",
        "author": "KillerCroc1234567",
        "title": "New poster for “Another Simple Favor”",
        "content": "",
        "upvotes": 1400,
        "comments": 464,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3g86kfxo9tue1.jpeg?auto=webp&amp;s=405b1c36a1d679a12975f6e48057e27a023a16a4"
        },
        "permalink": "/r/movies/comments/1jz0arv/new_poster_for_another_simple_favor/"
    },
    {
        "id": "1jze4mq",
        "author": "02grimreaper",
        "title": "What is the best acting performance you have ever seen?",
        "content": "I think heath ledgers joker was such a shot out of the dark that it surprised a lot of us. Who is your nominee for this? Who took their acting role to the next level? I’m not really the biggest cinephile, so I would like to hear both the actors performance and the movie they were in. Another movie that makes me consider great actors is tombstone. Both Val Kilmer and Kurt Russell did a great job. ",
        "upvotes": 205,
        "comments": 814,
        "media": null,
        "permalink": "/r/movies/comments/1jze4mq/what_is_the_best_acting_performance_you_have_ever/"
    },
    {
        "id": "1jzk2fi",
        "author": "DefinitelyNotModMark",
        "title": "Cashback (2006) Kung Fu Scene",
        "content": "",
        "upvotes": 72,
        "comments": 3,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/mfug9o2noxue1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1jzk2fi/cashback_2006_kung_fu_scene/"
    },
    {
        "id": "1jyyb1g",
        "author": "MarvelsGrantMan136",
        "title": "Eddington | Official Trailer HD | A24",
        "content": "",
        "upvotes": 1450,
        "comments": 241,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pGfOvTdCDWm1IpjmsPzaTQT8qck2ZUfvNDpTkoH7OjE.jpg?auto=webp&amp;s=d3af50839dae87385099256bac4885e63064c423"
        },
        "permalink": "/r/movies/comments/1jyyb1g/eddington_official_trailer_hd_a24/"
    },
    {
        "id": "1jz5res",
        "author": "NoCulture3505",
        "title": "‘Severance’s Britt Lower To Topline Psychological Horror Film ‘Sender’ Produced By Jamie Lee Curtis",
        "content": "",
        "upvotes": 553,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MPoPrNwL5Nbfdc1AzRaKzs97tyVzEfoomsxcYOzR-9k.jpg?auto=webp&amp;s=0e9a5455fe3a385eb1140fd69296a8221aaee2f1"
        },
        "permalink": "/r/movies/comments/1jz5res/severances_britt_lower_to_topline_psychological/"
    },
    {
        "id": "1jyz71b",
        "author": "DamnThatsInsaneLol",
        "title": "‘House of the Dragon’ Star Emma D’Arcy Joins Tom Cruise in Alejandro Iñárritu’s New Film; Co-Starring John Goodman, Jesse Plemons, Sandra Hüller, Riz Ahmed, Sophie Wilde &amp; More",
        "content": "",
        "upvotes": 1207,
        "comments": 97,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GXcGRL7hBi8szeZjxICCRz5JybEsBPe2aMooCb-SfEU.jpg?auto=webp&amp;s=4290eb139e1f774afae0cde57bb738d8e411a5f1"
        },
        "permalink": "/r/movies/comments/1jyz71b/house_of_the_dragon_star_emma_darcy_joins_tom/"
    },
    {
        "id": "1jz4y43",
        "author": "mayukhdas1999",
        "title": "First Image from 'DANDELION'S ODYSSEY' - Four dandelion achenes survive nuclear devastation on Earth and are flung into space. Crash-landing on an alien planet, they embark on a quest to find soil to ensure their species’ survival — battling harsh elements, strange flora, fauna, and climate",
        "content": "",
        "upvotes": 555,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ooufzzku5uue1.png?auto=webp&amp;s=64092d44e5df7177d3cc92ad0bc22ea23f52ccbb"
        },
        "permalink": "/r/movies/comments/1jz4y43/first_image_from_dandelions_odyssey_four/"
    },
    {
        "id": "1jz4055",
        "author": "NoCulture3505",
        "title": "Johnny Depp &amp; Penélope Cruz ‘Day Drinker’ Unveils First Photo; Four Added To Cast Of Lionsgate &amp; 30WEST Pic",
        "content": "",
        "upvotes": 409,
        "comments": 162,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/O7SWA5cFDPv2ViM9poqYlJR5bC0GXBVwwIEwi5nWpic.jpg?auto=webp&amp;s=434c2654680b8e9ab5083067e8265ac06bc9d8e4"
        },
        "permalink": "/r/movies/comments/1jz4055/johnny_depp_penélope_cruz_day_drinker_unveils/"
    },
    {
        "id": "1jzexao",
        "author": "ItsADeparture",
        "title": "What happened with the 'Are You There God, It's Me, Margaret.' movie?",
        "content": "You have Kelly Fremon Craig, hot off of 'The Edge of Seventeen', one of the highest modern rated coming-of-age films. You have an absolute all-star cast with Rachel McAdams, Benny Safdie, and Kathy Bates, and you have arguably the most beloved women's coming-of-age story from the last century. It's like a literal match made in heaven. \n\nThen they don't market it, at all. Pretty sure I saw a trailer in an AMC theater once (as AMC theaters will typically show every trailer known to man before a movie) and passed it off as a cash-grab limited release since I hadn't even heard that it was happening. It did really well with the critics and even grossed more than Edge of Seventeen despite the lack of marketing (though failed to meet the higher budget).\n\nI feel like they could have had an absolute smash hit if they had marketed it even once. Just anything other than just a trailer would have made this movie a lot more money by capitalizing off of the Edge of Seventeen director and the fact that it's a beloved book.",
        "upvotes": 92,
        "comments": 39,
        "media": null,
        "permalink": "/r/movies/comments/1jzexao/what_happened_with_the_are_you_there_god_its_me/"
    },
    {
        "id": "1jyp8dp",
        "author": "leafs81215",
        "title": "Actors who were going to be the next big thing and then…just weren’t?",
        "content": "I consider Clive Owen to be in this category. Nothing wrong with him, he’s a very good actor. But in the 2000s this dude was everywhere. Oscar nominated for ‘Closer’, Children of Men was tremendous, I mean he was heavily favoured to be James Bond before Daniel Craig showed up. And then, he just faded. He still works and acts quite regularly but he never got even close to those heights again. What are some other actors that just fell off of the top tier but there’s no real reason why. ",
        "upvotes": 4780,
        "comments": 4331,
        "media": null,
        "permalink": "/r/movies/comments/1jyp8dp/actors_who_were_going_to_be_the_next_big_thing/"
    },
    {
        "id": "1jyzrze",
        "author": "NoCulture3505",
        "title": "Olivia Colman and Benedict Cumberbatch Fight to the Finish in 'The Roses' (First Images)",
        "content": "",
        "upvotes": 586,
        "comments": 62,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cdLGGPdGNX0X3O1cmg93Mg_XYlhHW4Exgje7Re6iYBk.jpg?auto=webp&amp;s=36cf5a99c8f45a4c3dde8c1c2198f4317d571c4b"
        },
        "permalink": "/r/movies/comments/1jyzrze/olivia_colman_and_benedict_cumberbatch_fight_to/"
    },
    {
        "id": "1jzg1ai",
        "author": "indiewire",
        "title": "The 24 Best Vampire Movies Ever Made, from ‘Nosferatu’ to ‘Sinners’",
        "content": "",
        "upvotes": 53,
        "comments": 51,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mTb1M2ISMTvS97QUoeieK4PM0PfyLtQ70ZlTV5j8E1o.jpg?auto=webp&amp;s=a8fce36f31920053bf3f08b9cec928c51bfd591c"
        },
        "permalink": "/r/movies/comments/1jzg1ai/the_24_best_vampire_movies_ever_made_from/"
    },
    {
        "id": "1jz5huk",
        "author": "mayukhdas1999",
        "title": "First Image from 'LEFT-HANDED GIRL' - A film by Shih-Ching Tsou, long-time collaborator of Sean Baker",
        "content": "&gt;A single mother and her two daughters return to Taipei after several years of living in the countryside to open a stand at a buzzing night market. Each in their own way, will have to adapt to this new environment to make ends meet and succeed in maintaining the family unity. Three generations of family secrets begin to unravel after the youngest daughter who’s left-handed is told by her traditional grandfather to never use her \"devil hand”.",
        "upvotes": 202,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/w8kmf14zauue1.jpeg?auto=webp&amp;s=5ec5cb9cfae21223fd3024b8fb735fca5a44a925"
        },
        "permalink": "/r/movies/comments/1jz5huk/first_image_from_lefthanded_girl_a_film_by/"
    },
    {
        "id": "1jzh536",
        "author": "Useful-Rough-6449",
        "title": "Need a rec for an Easter movie.. non-traditional.",
        "content": "My family is weird but we still like to get together on holidays and watch movies.  Last year we watched Donnie Darko. We like cheesy, funny, inappropriate, thriller, sci-fi, scary, nostalgic, etc just please no strictly romance ones. Please be creative! I’m open to anything that is not your typical Easter bunny movie !😂💃🏻 thanks in advance!!!!!!",
        "upvotes": 38,
        "comments": 168,
        "media": null,
        "permalink": "/r/movies/comments/1jzh536/need_a_rec_for_an_easter_movie_nontraditional/"
    },
    {
        "id": "1jzl6c4",
        "author": "Tennesseewhiskey-",
        "title": "Reign Over Me",
        "content": "This movie is so slept on. Sandler is raw in a way that’s almost uncomfortable, like you’re watching a real person spiral and heal in real time. It’s not showy grief, but it’s a sorta it’s muffled grief, which hits wayyyy harder IMO. The way he talks about his wife and kids, or more often doesn’t, is quietly devastating. Cheadle as well is phenomenal in this. He is always a perfect grounding force. In that scene in the courtroom where Sandler finally lets it out, feels like a cracked dam during a hurricane. Easily one of Sandler’s most emotionally truthful roles, it feels like he’s in the same headspace as like Uncut Gems but inverted. If that one is manic desperation then Reign Over Me is him suffering from a severe stillness in sorrow.\n ",
        "upvotes": 17,
        "comments": 8,
        "media": null,
        "permalink": "/r/movies/comments/1jzl6c4/reign_over_me/"
    },
    {
        "id": "1jze5a3",
        "author": "Nickosaurus",
        "title": "The Hangman (1964) – An animated adaption of a poem by Maurice Ogden, narrated by by Herschel Bernardi",
        "content": "",
        "upvotes": 56,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zqQBDGE9QI7jYvBn-8P-kwKA78yOgDqTjnicUifUlw0.jpg?auto=webp&amp;s=c94a1813d8cc6a20145b089b5d89e2df9354e4b5"
        },
        "permalink": "/r/movies/comments/1jze5a3/the_hangman_1964_an_animated_adaption_of_a_poem/"
    },
    {
        "id": "1jzls5s",
        "author": "FilmWaffle-FilmForum",
        "title": "What is the most aesthetically pleasing sci-fi movie of all time?",
        "content": "The sci-fi genre has so many visually stunning movies but which one stands out the most to you? Forget the story, characters, score etc. Tell me some sci-fi movies with visuals that left you literally speechless.\n\nRecent personal favourites of mine would be: Ex Machina, Blade Runner 2049 and Arrival. ",
        "upvotes": 16,
        "comments": 73,
        "media": null,
        "permalink": "/r/movies/comments/1jzls5s/what_is_the_most_aesthetically_pleasing_scifi/"
    },
    {
        "id": "1jz823h",
        "author": "IndyMLVC",
        "title": "Revisiting American Psycho’s theatrical run on its 25th anniversary (4/14/00)",
        "content": "",
        "upvotes": 117,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5kJvEzHOcLi0bkQxu3jVzh-cA0K9p46dECq5mlZty-w.jpg?auto=webp&amp;s=3139aa6cb621700e25783db7a0bf9cd91a22a877"
        },
        "permalink": "/r/movies/comments/1jz823h/revisiting_american_psychos_theatrical_run_on_its/"
    },
    {
        "id": "1jz9d3q",
        "author": "savingprivatedryan",
        "title": "Movies that just feel good at the end",
        "content": "I recently have been rewatching movies like The Truman Show and Bicentennial Man which sort of feel like a journey and just leave me with good vibes at the end. \nThey just feel very complete and cover uplifting stories that give me energy after watching. \nWhat are other movies like these? Im sure there are a million of them but would love some recommendations!",
        "upvotes": 91,
        "comments": 209,
        "media": null,
        "permalink": "/r/movies/comments/1jz9d3q/movies_that_just_feel_good_at_the_end/"
    },
    {
        "id": "1jzhq2i",
        "author": "Sonia341",
        "title": "‘Final Destination: Bloodlines’ Actress Anna Lore Joins ‘The Black Phone 2’",
        "content": "",
        "upvotes": 21,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/yt-W4pjLEgupC9CLREYXXAV-yWi4w13Mbqi4sY_YC-w.jpg?auto=webp&amp;s=84701023c62546e7c24a7cf6d8c0b2575a0bda4e"
        },
        "permalink": "/r/movies/comments/1jzhq2i/final_destination_bloodlines_actress_anna_lore/"
    },
    {
        "id": "1jzfzqn",
        "author": "saiyaniam",
        "title": "Highlander.",
        "content": "[https://www.youtube.com/watch?v=0YPtaqJqoHw](https://www.youtube.com/watch?v=0YPtaqJqoHw)\n\n  \nThis is one of, if not the absolute favorite movie of my adulthood, it has got hardcore Ideas like living forever yet losing everyone you care about. Who wants to live forever. Living for a long time has got major quirks to it. \n\n  \nIs it better to burn out and fade away?",
        "upvotes": 33,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9RcaAzBDucBIU89HuH2AAtNv8zT6IxDH88VNqKP8sOI.jpg?auto=webp&amp;s=17c11f70aaa96865cfdf2060cdfd284091b82920"
        },
        "permalink": "/r/movies/comments/1jzfzqn/highlander/"
    },
    {
        "id": "1jz4ovc",
        "author": "Gato1980",
        "title": "Bill Condon's 'Kiss of the Spider Woman' Sets Wide Theatrical Release for October 10",
        "content": "",
        "upvotes": 130,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Gmh9IF2UKl23UGCNJ9QkJbJjkoiH4ZOt3IczihHNBAM.jpg?auto=webp&amp;s=36cc6812ec05b9517c51b631bb630794f1814680"
        },
        "permalink": "/r/movies/comments/1jz4ovc/bill_condons_kiss_of_the_spider_woman_sets_wide/"
    },
    {
        "id": "1jzh2g1",
        "author": "YennyPincher",
        "title": "Recently started watching Wes Anderson’s movies chronologically",
        "content": "The first Wes Anderson movie I remember seeing in theaters was The Life Aquatic with Steve Zissou, and being 19 at the time it didn’t really click for me and I didn’t really understand the essence of the movie. At 19, I watched it because of the A-list cast honestly. After The Life Aquatic, the only other movie by him I’ve seen is Fantastic Mr. Fox which I really liked.\n\nFast forward 20ish years and I decided to sit down and watch Wes Anderson’s movies starting with Bottle Rocket. It was a good movie as his first. Last night I watched Rushmore and I thought it was really good. The quirkiness of Max and the character dynamics were done very well. I’ll watch The Royal Tenenbaums in the next couple days, and I wonder if I’ll appreciate The Life Aquatic this time around now that I’m older.\n\nEdit: Side note, I personally know the falconer Bill Robinson who had one of his trained falcons in The Royal Tenenbaums. ",
        "upvotes": 23,
        "comments": 48,
        "media": null,
        "permalink": "/r/movies/comments/1jzh2g1/recently_started_watching_wes_andersons_movies/"
    },
    {
        "id": "1jzk0f1",
        "author": "kpmateju",
        "title": "What film trailer that you think was very well done?",
        "content": "For me, I was very impressed with Take Me Home Tonight.\n\nhttps://youtu.be/5gYL9znVmGs?si=TMI-yt7IYYgi0C_t\n\nI think the scenes were chosen well, the music, all of it was just a chef kiss as far as how everything was done. I love that the title screen lined up with the music and how the ending was funny and delivered in classic deadpan Topher Grace sarcasm. ",
        "upvotes": 12,
        "comments": 50,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xjM2OgYkpV2PLqtlVjVw0xl8eFluFj8vePgyQhtkwWU.jpg?auto=webp&amp;s=a51168e6e7ab39163d3a267fc9c25ccdeea1e7c7"
        },
        "permalink": "/r/movies/comments/1jzk0f1/what_film_trailer_that_you_think_was_very_well/"
    },
    {
        "id": "1jzjrbh",
        "author": "Sisiwakanamaru",
        "title": "Rivers Cuomo Confirms Weezer Are Working on a Film",
        "content": "",
        "upvotes": 13,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JQDGWs3RgnAOK0FFKhjXh88XP030_RvfPKDxIMJEjuA.jpg?auto=webp&amp;s=d0a9ccef3803eb8466759979560a925c6876f74f"
        },
        "permalink": "/r/movies/comments/1jzjrbh/rivers_cuomo_confirms_weezer_are_working_on_a_film/"
    },
    {
        "id": "1jzmzel",
        "author": "These_Feed_2616",
        "title": "Gary Oldman is absolutely brilliant!",
        "content": "He is so versatile, he can play literally anything. He nailed Lee Harvey Oswald and played him perfectly, he completely became Sid Vicious to the point where you literally felt like you were watching Sid Vicious, he was absolutely fantastic as Norman Stansfield in Leon the professional, he played such a great psychopathic nutjob in that! He looked exactly like Beethoven, he looked exactly like Winston Churchill, he gave a great take on Dracula, and he was a great commissioner Gordon! His versatility is so unmatched, definitely a top 10 actor for me!",
        "upvotes": 8,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1jzmzel/gary_oldman_is_absolutely_brilliant/"
    },
    {
        "id": "1jzah47",
        "author": "Bennett1984",
        "title": "Russ Meyer's Motorpsycho and Up! coming to 4K Ultra HD from Severin Films",
        "content": "",
        "upvotes": 42,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/X0ki8MwjDatBUGpjtmttSsWgUO3PFXhJMpYcNZVB-hM.jpg?auto=webp&amp;s=cb9c8d6f53b91a5efcf159715c196248c40b8c06"
        },
        "permalink": "/r/movies/comments/1jzah47/russ_meyers_motorpsycho_and_up_coming_to_4k_ultra/"
    }
]