[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 505,
        "comments": 276,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 20,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1k3elg5",
        "author": "user_promedio",
        "title": "Recommend very good Netflix series",
        "content": "I've already watched Better Call Saul, Dexter, Dark, and a few other series, and now I don't know what to watch. I'm anxiously waiting for the fifth and final season of YOU, and in the meantime, I'll start watching Ozark. But when I say good series, I mean really good.\n\nEdit:\nI'm open to anime, two of my favorites are Death Note and Monster",
        "upvotes": 23,
        "comments": 68,
        "media": null,
        "permalink": "/r/netflix/comments/1k3elg5/recommend_very_good_netflix_series/"
    },
    {
        "id": "1k37imf",
        "author": "Chance_Run3753",
        "title": "Why are some seasons backwards on shoes",
        "content": "",
        "upvotes": 74,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1k37imf/why_are_some_seasons_backwards_on_shoes/"
    },
    {
        "id": "1k3e5hr",
        "author": "honeycomb1300",
        "title": "Million Dollar Secret Plot-hole?",
        "content": "SPOILER!! Tell me if I’m missing something here… when Cara got the box with the million dollars, Sam also got a clue. All the contestants knew there was 1 person getting a clue and 1 person getting the million that morning. Sam told Corey she got the clue, meaning she could not have gotten the million also. The box never moved again before the finale. So how did Corey not know it was Cara if it obviously wasn’t him and logically could not have been Sam? ",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1k3e5hr/million_dollar_secret_plothole/"
    },
    {
        "id": "1k2zvph",
        "author": "okaynowhat",
        "title": "How many of you just subscribe for a month, a few times a year?",
        "content": "I let my netflix subscription end last November. I'd always have the 4k plan through some deal, I believe the last year I had it through a verizon deal of like $140 bucks for the year with amc+. And I'd get something similar all previous years for the past like 5 years. But there have been zero deals this go around, and I'm now at a point where I'll be cancelling a couple other streaming services that are lacking or cheaper trials ending (i.e. apple 3 month trial). \n\nAnyway, the 4k plan is now $25 which is pretty insane to me. I did get a quality tv and sound system back in 2020 and am used to 4k on every other service. So I'm deciding if I want to do $25 a few months a year, or do $8/mo continuously for 1080p. Since netflix releases all episodes at once, it doesn't really create the weekly discussions the way a show like severance, last of us, white lotus, etc do. So I'm heavily leaning towards just subscribing for a month at $25, immediately cancel it so it ends that month, and rejoin when theres at least a few more new shows/seasons that actually appeal to me. Wondering how many other people just subscribe occassionally throughout the year. ",
        "upvotes": 50,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1k2zvph/how_many_of_you_just_subscribe_for_a_month_a_few/"
    },
    {
        "id": "1k2urft",
        "author": "biascourt",
        "title": "Netflix will soon get a new design for its TV app",
        "content": "If the experiment gains traction, Netflix hopes to extend it to its broader audience over the coming months and quarters.",
        "upvotes": 60,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1k2urft/netflix_will_soon_get_a_new_design_for_its_tv_app/"
    },
    {
        "id": "1k399ry",
        "author": "Meshynodes",
        "title": "Netflix, why can’t we pick our own video quality— and keep it that way?",
        "content": "I get that this is an unofficial sub, but honestly—how is manual resolution control still missing in 2025?\nWe’re paying subscribers, not freeloaders.\nYet, the moment bandwidth dips, your movie turns into a pixelated mess—and when it stabilizes, you have to hope that the app decides to bump the quality back up.\n\n\n“But there’s already a quality setting!”\nSure—under App Settings ➜ Video Playback you can choose (Good / Better / Best ) but those labels are just fuzzy bitrate targets—they don’t always guarantee 2160p.\n\nThey reset or get overridden by network “optimisation.”\n\nYou still can’t switch mid-stream.\n\nWe all lose under the current “trust us, we’ll auto‑select for you” approach.\n\nNetflix, if you’re listening: give us the basic checkbox that says, “Force 2160p” (or 1080p, or 480p—whatever we choose). Until then, we’re stuck paying premium prices for an experience that can drop to VHS quality without warning.\n\nWho else is tired of this?  ",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k399ry/netflix_why_cant_we_pick_our_own_video_quality/"
    },
    {
        "id": "1k3h9cp",
        "author": "t4ctic4lbeef",
        "title": "Terrifying Glitch",
        "content": "hey guys, on my Netflix mobile app every time i try to full screen and go sideways this terrifying monkey with a clock in the background appears and if i try to exit out it starts yelling at me. i threw my phone in water so it would turn off then did the rice thing and it’s back on but i’m scared to go back on the app right now. i was trying to watch The Electric State. has anyone else had this glitch?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k3h9cp/terrifying_glitch/"
    },
    {
        "id": "1k3gu5w",
        "author": "Zioticc",
        "title": "Behind the Scenes of FROM Freezing Temps Tireless Effort and Total Dedication",
        "content": "Not many people realize how brutal it was filming FROM. This short clip shows one of the cast members completely wiped out from shooting in freezing conditions. The whole team went through insane weather cold, wind, delays and still pulled through to deliver something amazing.\n\nIt’s easy to watch a show and forget how much work happens behind the scenes. But seeing moments like this reminds you just how much effort goes into making every scene perfect.\n\nBig respect to the cast ",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/x9ni5l1yuxve1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1k3gu5w/behind_the_scenes_of_from_freezing_temps_tireless/"
    },
    {
        "id": "1k32315",
        "author": "Accomplished-Bug9930",
        "title": "On Netflix movie descriptions, not saying which country it is from if it is a foreign movie or show?",
        "content": "Recently I watched The Tailor. When I looked at the description on Netflix, it did not way what country it is from! It would be so nice if Netflix tells me (us) if it is a foreign movie and which country it is from! No?",
        "upvotes": 8,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1k32315/on_netflix_movie_descriptions_not_saying_which/"
    },
    {
        "id": "1k3flhw",
        "author": "Kind-Crab-1564",
        "title": "Help me to fix this",
        "content": "Idk what happened ",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9fs4dqd0gxve1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1k3flhw/help_me_to_fix_this/"
    },
    {
        "id": "1k2yehm",
        "author": "Dear_Event3099",
        "title": "Wasn’t Expecting Much From Netflix’s Devil May Cry",
        "content": "I went into the new Devil May Cry anime with low expectations. Let’s be real — video game adaptations rarely hit the mark, and Netflix has a mixed track record.\n\nBut this one? It actually kinda worked.\n\nI’m still iffy on a few things, but there’s some solid animation, the action feels like DMC, and surprisingly… they didn’t butcher Dante.\n\nI broke down my thoughts in this short review if you’re on the fence about watching.\n\nCurious if anyone else was expecting a mess but ended up enjoying it too?",
        "upvotes": 10,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1k2yehm/wasnt_expecting_much_from_netflixs_devil_may_cry/"
    },
    {
        "id": "1k3cx1h",
        "author": "Dull-Animal5299",
        "title": "Settings?",
        "content": "Recently I’ve noticed that when I open my tv settings while Netflix is playing, it pauses whatever show I am watching until the settings are closed. Any one have similar problems? Or is this a tv issue ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k3cx1h/settings/"
    },
    {
        "id": "1k31p82",
        "author": "ProfessionalLife970",
        "title": "Why does Netflix automatically open on my TV at the same time every day?",
        "content": "No matter what other app (Prime, Disney) is on, Netflix opens up at 11:00 pm, everyday at the exact same time without any prompts, and doesn't close without me turning my TV on &amp; off.",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1k31p82/why_does_netflix_automatically_open_on_my_tv_at/"
    },
    {
        "id": "1k36kr8",
        "author": "GameOverBibo",
        "title": "I got a problem",
        "content": "When I tap on the screen, the buttons (the play button, +10, etc) don't go away and nothing goes away except for the brightness thingy.\nCould somebody help me?",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vu185kbkyuve1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1k36kr8/i_got_a_problem/"
    },
    {
        "id": "1k314mf",
        "author": "CheetahNervous7704",
        "title": "The animation in captain fall is pretty incredible",
        "content": "For such a deadpan show the animation is amazing. The characters are so expressive, even in the background when they're not focused on or speaking. It's one of the only animations with this style with so many facial expressions, such a shame it's cancelled. Netflix should include a deal or something that if a show is cancelled on a cliffhanger they get one last wrap up episode or something",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k314mf/the_animation_in_captain_fall_is_pretty_incredible/"
    },
    {
        "id": "1k26r5x",
        "author": "indiewire",
        "title": "Netflix CEO Ted Sarandos Says That AI Can Make Films 10% Better, Not Just Cheaper",
        "content": "",
        "upvotes": 97,
        "comments": 96,
        "media": null,
        "permalink": "/r/netflix/comments/1k26r5x/netflix_ceo_ted_sarandos_says_that_ai_can_make/"
    },
    {
        "id": "1k370fm",
        "author": "acatnamedtuna",
        "title": "UHD not supported anymore for Win10 devices...",
        "content": "This seems so new, that not even the customer support I contacted knew about it? Anyone know when this was introduced?\n\nI did notice that UHD is not showing up anymore on my HTPC on 4k TV...\n\nSo I went down that rabbit hole and started trouble shooting until I noticed that the requirement page states that Windows 11 is required. \n\nI contacted support via chat and asked them if Windows 11 is a hard requirement. Instead of replying to my question, the agent started going through the whole (and apparently old) trouble shooting flow... Even asked me if I am able to stream 4k on a browser other than edge... :/\n\nEventually the guy understood that my device indeed is not the issue and checked with somebody more knowledgeable and returned and confirmed that UHD is no longer available for Windows10 devices... \n\nIt really ain't that difficult to write a small notice on the requirements page that Windows 10 is no longer supported. Especially because its weird that anyone would make an Operating System that is not end of service life yet a hard requirement for streaming quality... ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k370fm/uhd_not_supported_anymore_for_win10_devices/"
    },
    {
        "id": "1k3d8y4",
        "author": "dailystar_news",
        "title": "WWE Wrestlemania 41 night one on Netflix results: New champions galore as CM Punk headlines",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k3d8y4/wwe_wrestlemania_41_night_one_on_netflix_results/"
    },
    {
        "id": "1k2s5wy",
        "author": "s853772",
        "title": "A show about mice?",
        "content": "I don't remember if it was on Netflix but I saw a show it was four short stock motion films featuring anthropomorphic rats or mice. I only remember two of the four films the first one was about a rat buying a place only to discover it was filled with squatters which I believe were bugs. And the last one was about a mouse building a flying aircraft of some kind in order to escape some type of flooding. If anyone knows what this show is and if it was on Netflix or not please let me know ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k2s5wy/a_show_about_mice/"
    },
    {
        "id": "1k2k2pe",
        "author": "MLP_QT",
        "title": "What is this show????",
        "content": "Someone PLEASE help I can’t remember what show this is. It was a house flipping show, I think it was on Netflix but I’m not positive. It’s fairly recent, I’d guess after 2018 and was hosted by a couple. There was an uncomfortable undertone between them and the show was only on for one or two seasons and they got divorced and it was cancelled. Also, the wife’s dad was weirdly involved and grouchy it was weird. The wife’s designs were all very colorful as well. Please help me find it!!!",
        "upvotes": 15,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1k2k2pe/what_is_this_show/"
    },
    {
        "id": "1k2x1iy",
        "author": "Majestic-Factor9390",
        "title": "Secret menu for better quality streaming",
        "content": "Lately I’ve noticed the quality of Netflix streams going downhill even though I pay for highest tier.  I think I’ve found the solution \n\nLogin to Netflix in a browser and go to your profile settings and change it from auto to high.  They are sneaky…",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k2x1iy/secret_menu_for_better_quality_streaming/"
    },
    {
        "id": "1k2odua",
        "author": "Strawberri-Bliss",
        "title": "Any series/movie recommendations?",
        "content": "I'm looking for something to watch like Fier Street, or Stranger Things. I like not too scary shows, with kind of mystery topics. I dont mind if it gets crazy unrealistic or too realistic.",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1k2odua/any_seriesmovie_recommendations/"
    },
    {
        "id": "1k377s3",
        "author": "MediterraneanMen",
        "title": "The Signal (2024, Germany) - worst show I have ever seen",
        "content": "I have lost count on how many times I yelled \"boring\" or \"dafak\" specially after the final episode.\n\nAbsolute waste of time. My recommendation is avoid this crap.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k377s3/the_signal_2024_germany_worst_show_i_have_ever/"
    },
    {
        "id": "1k37nch",
        "author": "dailystar_news",
        "title": "WWE WrestleMania 41 Night 1 LIVE on Netflix as Jey Uso gets ready while legend pulls out",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k37nch/wwe_wrestlemania_41_night_1_live_on_netflix_as/"
    },
    {
        "id": "1k2raaz",
        "author": "Pinky_devil1",
        "title": "Help! Trying to Find a Goofy Comedy Netflix Movie (2016-2018)",
        "content": "Hey everyone! I'm on a years-long quest to find a goofy comedy movie I watched on Netflix sometime between 2016 and 2018. The main character was a teenage guy who was always getting into trouble and secretly lived in an unused upstairs room without his parents knowing. I vividly remember a scene where he did something that involved the police, and his younger brother was always helping him out. There was also a scene where he ordered a pizza and had a crush on the delivery girl, and he ended up sitting on the roof while she was there. Does this sound familiar to anyone? I've been trying to remember the title forever!",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1k2raaz/help_trying_to_find_a_goofy_comedy_netflix_movie/"
    },
    {
        "id": "1k2u7vw",
        "author": "StrawberryInternal21",
        "title": "HELP:Different region is loaded when connected with wifi",
        "content": "All of a sudden, a different region’s Netflix is loaded when I’m connected to Wi-Fi. I know this because shows like Prison Break are on main page, they are not available in my region. I’ve checked on all of my devices, and the issue is consistent. However, when I use mobile data, Netflix loads content from my actual region.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k2u7vw/helpdifferent_region_is_loaded_when_connected/"
    },
    {
        "id": "1k23hmh",
        "author": "TheMirrorUS",
        "title": "Four-time major winner Brooks Koepka and his wife Jena Sims have rejected Netflix series 'like 30 times' due to 'safety'",
        "content": "",
        "upvotes": 68,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1k23hmh/fourtime_major_winner_brooks_koepka_and_his_wife/"
    },
    {
        "id": "1k32mh8",
        "author": "Hazel_NutHunny",
        "title": "The Residence - The Knife",
        "content": "If he died due to the clock (blunt force trauma), what was up with the cut wrists and knife the baker took away? I feel like that wasn't explained. \n\nI enjoyed the show but feel like there were several plot holes. ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1k32mh8/the_residence_the_knife/"
    },
    {
        "id": "1k2ribm",
        "author": "HighlyPossible",
        "title": "Just realized UHD contents on Netflix look MILES better on Samsung than on iPhones!",
        "content": "I just jumped ship from iPhone 15 pro max to Samsung s25 ultra. Today I started watching 4k content from Netflix on the s25, and omg! It looks so good! I can't even tell there are pixels! It looks as good as 4k on a 4k monitor! Then I watched the same content on my iPhone, it looks like 720p! Not even 1080p..... But the content title says \"Dolby Vision\" on my iPhone, and \"HDR+\" on my samsung phone. \n\niPhone won't tell me what the max resolution it was playing, but it looks like 720p; samsung tells me it was playing in 1080p in HDR+. \n\nI am 100% sure both phones were on the same wifi, with media quality switched to \"High\".\n\nWhy is that? I even tried it on my iPad Air ( newest gen), still the same thing! Like where have I been all these years paying for the Premium plan for nothing.... (other than the times I watch it in Safari on macbook). ",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1k2ribm/just_realized_uhd_contents_on_netflix_look_miles/"
    },
    {
        "id": "1k2x195",
        "author": "Consistent-File-1332",
        "title": "I need this episode",
        "content": "I just saw this on Instagram and I loved it. It's a fragment of a Netflix movie and I want to know the name of the series, the episode, and the names of the actresses in question. Greetings, beautiful community.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k2x195/i_need_this_episode/"
    }
]