[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 2,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 13,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1qnkt4p",
        "author": "Ancient_Tourist_4268",
        "title": "Secondo voi possiamo considerare Moncalieri quasi una parte di Torino?",
        "content": "Moncalieri è la città dell'hinterland di Torino meglio collegata.  \n  \nHa la stazione del treno, una stazione della metro, i bus : 67, 45, 70, 80, 81, 82 e 83  \nLa tangenziale che ti porta direttamente in corso unità d'italia in 3 secondi.  \n\n\nIl parco delle vallere che ti porta direttamente al parco del valentino.\n\nSe vivi nei pressi di Corso Roma dopo il ponte sei praticamente a Torino a piedi e camminando dritto da piazza bengasi in 40/45 min a piedi arrivi a porta nuova o in 15 min in bici.\n\nSecondo voi vista la vicinanza e le infrastrutture efficaci, potremmo considerare Moncalieri come quasi un ''quartiere'' di Torino? ",
        "upvotes": 6,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1qnkt4p/secondo_voi_possiamo_considerare_moncalieri_quasi/"
    },
    {
        "id": "1qnqkti",
        "author": "Imaginary_Hour6285",
        "title": "Train me up palestra costo",
        "content": "Qualcuno la frequenta? Avrei bisogno di sapere come vi trovate e quanto pagate?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qnqkti/train_me_up_palestra_costo/"
    },
    {
        "id": "1qnbjhr",
        "author": "Inevitable_Park_5571",
        "title": "Comprare casa a Torino",
        "content": "Buongiorno a tutti, due anni fa mi sono trasferita a Torino per lavoro e ora vorrei comprare casa. Ho trovato diversi appartamenti in Borgo Vittoria (principalmente Via Borgaro, Via Chiesa della Salute, Via Bibiana) uno in particolare è vicino a Piazza della Vittoria. Sapete dirmi se è una zona tranquilla? So che di giorno c'è un mercato molto carino, ma non so come sia di sera. Essendo una ragazza e vivendo da sola vorrei essere sicura di poter tornare a casa la sera senza problemi.  \nGrazie a tutti :)",
        "upvotes": 6,
        "comments": 22,
        "media": null,
        "permalink": "/r/torino/comments/1qnbjhr/comprare_casa_a_torino/"
    },
    {
        "id": "1qnbhn9",
        "author": "Relevant_Ad2728",
        "title": "Qual'è, quali sono...",
        "content": "Buongiorno a tutti, domanda da sconosciuto della zona in quanto provengo da un paesello in provincia di Cuneo che vorrebbe iniziare a frequentare di più la vita quotidiana e notturna di Torino. Qual è la zona, quali sono le zone, più frequentate dai giovani? (23-25+) Conosco giusto via Roma, via Garibaldi per lo shopping, ma volessi che ne so un giorno venire a farmi un aperitivo ecco non saprei dove andare. Conosco zona San Salvario ma non ho mai diciamo esplorato, conosco le panche che non so dove si trovino come zona, seguo turin_hub su Instagram ma funziona per le discoteche principalmente, mi piace molto andare al One e al pick up per esempio. Non voglio che il fatto One/pick up mi tolga diciamo la possibilità di conoscere altri locali con altri generi musicali in quanto sono molto aperto musicalmente, culturalmente e di idee. Insomma ho bisogno di nomi di zone, posti da poterci andare senza che sia necessariamente una disco. Grazie in anticipo!",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1qnbhn9/qualè_quali_sono/"
    },
    {
        "id": "1qmwrlz",
        "author": "SprinklesDue9894",
        "title": "My grandpa was from Torino, his name was Giovanni Francesco Prina, just wondering if anyone who lives there has the same last name and might be a possible relative",
        "content": "",
        "upvotes": 23,
        "comments": 30,
        "media": null,
        "permalink": "/r/torino/comments/1qmwrlz/my_grandpa_was_from_torino_his_name_was_giovanni/"
    },
    {
        "id": "1qno4zr",
        "author": "asilorepublic95",
        "title": "Non vado al McDonald's da un botto di tempo ,si può pagare con saty? se si ,alla cassa o spunta il QR code sul pos sotto al totem dopo l'ordine?",
        "content": "",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1qno4zr/non_vado_al_mcdonalds_da_un_botto_di_tempo_si_può/"
    },
    {
        "id": "1qn9dsd",
        "author": "eddz_",
        "title": "Any Italian language centers in Torino",
        "content": "Buongiorno, so i am a student here in Torino and i wish to learn the Italian language. Any Language Centers you guys recommend me to apply to here in Torino?\n\n",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1qn9dsd/any_italian_language_centers_in_torino/"
    },
    {
        "id": "1qnbc7r",
        "author": "Several-Exam3324",
        "title": "Ci sono dei buoni posti dove pranzare?",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qnbc7r/ci_sono_dei_buoni_posti_dove_pranzare/"
    },
    {
        "id": "1qmfieq",
        "author": "EatMeImAMuffin",
        "title": "GATTO SMARRITO CERCA STALLO",
        "content": "ciao a tutti, ieri sera ho trovato questo micetto dolcissimo che vagava perso in zona Aurora/Parco Dora. Ho chiesto in giro nel mio palazzo e quelli vicini, ma nessuno lo reclama. è un maschio, mi sembra non castrato. Ha un carattere davvero calmo e dolce, sicuro è domestico.\n\nIo purtroppo non posso tenerlo, ho già un cane che non va d’accordo con il gatto e temo per l’ incolumità di entrambi.\n\nQualche anima buona riesce a tenerlo in stallo?\n\nGrazie in anticipo anche se farete girare!",
        "upvotes": 64,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1qmfieq/gatto_smarrito_cerca_stallo/"
    },
    {
        "id": "1qn2wyo",
        "author": "DaMieleMiao",
        "title": "elettromiografo in prestito/ad un buon prezzo",
        "content": "buonasera, siamo due ricercatori autonomi che hanno pochi soldi ma tante idee di ricerca in mente e necessiteremmo l'aiuto di Torino",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1qn2wyo/elettromiografo_in_prestitoad_un_buon_prezzo/"
    },
    {
        "id": "1qnd3ij",
        "author": "Either-Durian3875",
        "title": "Buonjorno everyone!!! Im american and I'm gonna be in turino for a few days and REAAAALLY want to get my hair cut like this.... Does anyone have any hairdresser recs???? Grazie very much ❤️‍🔥🥺🥺",
        "content": "",
        "upvotes": 0,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/arlfyju4eofg1.jpeg?auto=webp&amp;s=de6f8bbe0b8eac3176d07d6c61166c68338c734d"
        },
        "permalink": "/r/torino/comments/1qnd3ij/buonjorno_everyone_im_american_and_im_gonna_be_in/"
    },
    {
        "id": "1qnd65c",
        "author": "Several-Exam3324",
        "title": "Consigliato per la colazione o per la merenda pomeridiana 💞",
        "content": "Si trova in Plaza XVII Dicembre",
        "upvotes": 0,
        "comments": 22,
        "media": null,
        "permalink": "/r/torino/comments/1qnd65c/consigliato_per_la_colazione_o_per_la_merenda/"
    },
    {
        "id": "1qmi4o9",
        "author": "Empty_Explorer8292",
        "title": "Fare amicizia a torino",
        "content": "Sono med ho 25anni mi piachi guardare amine e altri activita",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1qmi4o9/fare_amicizia_a_torino/"
    },
    {
        "id": "1qmjutm",
        "author": "zapatocaviar",
        "title": "Where to watch NFL tonight?",
        "content": "I live in Centro and I’m looking for somewhere that will show the early NFL playoff game tonight? It’s at 9pm. Anybody know somewhere? Grazie. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qmjutm/where_to_watch_nfl_tonight/"
    },
    {
        "id": "1qmfdoh",
        "author": "Current_Emu4588",
        "title": "Vi andrebbe di creare un club del libro(età 15-20)",
        "content": "Io sono M17 è penso che sia veramente figo creare un discord per condividere le nostre letture.\nSe c'è qualcuno interessato mi scriva :3",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qmfdoh/vi_andrebbe_di_creare_un_club_del_libroetà_1520/"
    },
    {
        "id": "1qluehy",
        "author": "Effective_Cherry_403",
        "title": "Truffa immobiliare Corso Chieri",
        "content": "Eh niente, mi hanno fatto firmare un contratto senza valore in CORSO CHIERI 168 e avendo visto la casa e preso le chiavi ho abbassato la guardia al livello -100. \n\nOggi ci vado e mi trovo i proprietari che mi spiegano che quella persona era semplicemente in affitto e se n'è andata via ieri. Arrivano altre persone anche loro vittime e si fa scena... \nSono stato truffato e (non) va bene, faccio denuncia e aspetto.\n\nPerò, più ci penso e più c'è qualcosa che non mi va giù. Tra il proprietario che arriva per caso 2 min dopo di me e mi dice che sono stato truffato e già sei mesi prima era successo.  Però non vuole fare denuncia perché non vuole avere problemi e non aveva pensato di mettere un qualche avviso??? \n\nTutto sommato, penso sia una truffa organizzata e vorrei saperne di più in modo da non denunciare anche i proprietari per niente.",
        "upvotes": 55,
        "comments": 19,
        "media": null,
        "permalink": "/r/torino/comments/1qluehy/truffa_immobiliare_corso_chieri/"
    },
    {
        "id": "1qmdrnt",
        "author": "Acrobatic-Opening286",
        "title": "CX Vanchiglia",
        "content": "Qualcuno di voi ha esperienze in merito (possibilmente recenti)? Sto valutando se prendere una stanza ma sento pareri troppo discordanti riguardo a staff e regole, sapete dirmi di più? \n\n ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qmdrnt/cx_vanchiglia/"
    },
    {
        "id": "1qlt7h1",
        "author": "Holiday_Song4022",
        "title": "Com’é questa zona? Sicura?",
        "content": "Non la conosco particolarmente, io ho sempre abitato più nelle zone metro bernini/racconigi.\n\nMi interessa particolarmente collegamenti (che teoricamente con la metro vicino sono a posto) sicurezza e supermercati/servizi in generale\n\nGrazie mille 🙏🏼 ",
        "upvotes": 26,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/p0qn59k72cfg1.jpeg?auto=webp&amp;s=eb5149d556dc391f349e4a84df38c381be599cdc"
        },
        "permalink": "/r/torino/comments/1qlt7h1/comé_questa_zona_sicura/"
    },
    {
        "id": "1qmf4kf",
        "author": "Exciting-Look-7721",
        "title": "Fair Priced Fashion:TORINO, 24/01/26",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qmf4kf/fair_priced_fashiontorino_240126/"
    },
    {
        "id": "1qmqflp",
        "author": "SirNo4151",
        "title": "State guardando la partita?",
        "content": "io la sto guardando a casa insieme ai miei colleghi. io guardo la partita e loro guardano la mia ragazza. Tutto perfetto ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1qmqflp/state_guardando_la_partita/"
    },
    {
        "id": "1qlj1z9",
        "author": "Obeah__Man",
        "title": "Torino, Piazza Castello, 23/01/2026",
        "content": "",
        "upvotes": 32,
        "comments": 64,
        "media": null,
        "permalink": "/r/torino/comments/1qlj1z9/torino_piazza_castello_23012026/"
    },
    {
        "id": "1qm3j6r",
        "author": "No-Carrot-8515",
        "title": "Torino Aeroprta to Torino Porta Susa Train Help",
        "content": "Hey all, \n\nWe travel to Turnin next week to go skiing in Sestriere which we are super excited about. \n\nI was doing some travel planning this evening to make sure everything is in place in order to catch connections to the mountains. \n\nLooking at the trains from Torino Aeroporta to Torino Porta Susa has me scratching my head. Checking TrenItalia and Google Maps for the date we arrive (31st Jan) it's only showing the option to catch a bus and train, totalling a travel time of 1hr13 mins......Looking at our return date (4th Feb) its showing 30 mins direct by train, which is correct from what I have read online. \n\nTL:DR, Are the trains running from Turin Airport to the city at the moment, or are there rail replacement buses running this route until Feb 4th 2026 (based on train schedules)? Or is this simply a tech error online? \n\nI cant see any SFM service updates, so if anyone in Turin knows about this, it would be greatly appreciated. \n\nThanks \n\nA fellow Redditer ",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1qm3j6r/torino_aeroprta_to_torino_porta_susa_train_help/"
    },
    {
        "id": "1qlj2ux",
        "author": "Opposite_Soil_3732",
        "title": "lo conoscete il ragazzo ?",
        "content": "ieri ero a porta sussa per prendere un treno e mi è capitato un ragazzo senzatetto sui 30 anni con capelli di rasta che mi chiedeva soldi ripetutamente e a un certo punto quando li dicevo che non avevo soldi per darli a un tratto si incazza e mi insulta. Mi chiedevo se qualcuno lo conoscesse e sapesse la su storia.\n\n",
        "upvotes": 19,
        "comments": 27,
        "media": null,
        "permalink": "/r/torino/comments/1qlj2ux/lo_conoscete_il_ragazzo/"
    },
    {
        "id": "1qllw1h",
        "author": "SpeakerEven6320",
        "title": "Nasty Club serata Erasmus stasera",
        "content": "Sono un ragazzo di 25 anni. \n\nQualcun* vorrebbe venire al nasty club con me stasera?\n\nC'è la serata universitaria Erasmus\n\nScrivetemi se siete interessat\\*",
        "upvotes": 10,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1qllw1h/nasty_club_serata_erasmus_stasera/"
    },
    {
        "id": "1qlxwsr",
        "author": "Temporary_Note5790",
        "title": "Curious where products from MD come from",
        "content": "I used to shop in places like Esselunga, Lidl, Conad, Coop, Pam, Ins, etc, and I found products in MD quite different from those places I’ve mentioned. \nI wonder why is that? \nEDIT: I mean its product-quality ratio is great, and I particularly like some of the products there, I just feel it has different style than other places ",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1qlxwsr/curious_where_products_from_md_come_from/"
    },
    {
        "id": "1qlvgoy",
        "author": "PipeOk5460",
        "title": "Carcere vita",
        "content": "Buona sera a tutti, avete qualche conoscente parente amico familiare che sta soggiornando per dire nel blocco B delle vallette di Torino?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qlvgoy/carcere_vita/"
    },
    {
        "id": "1qltz0w",
        "author": "AnnieUK2024",
        "title": "Chi si ricorda come si chiamava questo Istituto Tecnico negli anni '80?",
        "content": "Ciao a tutti. Sto cercando di rintracciare un contatto. So che negli anni ’80 frequentava l’ITIS che si trova in via Sansovino 150. Oggi si chiama Istituto Superiore Paolo Boselli. So per certo che un tempo era un Istituto Tecnico Industriale per periti, ma non ricordo il nome. Si trovava nello stesso edificio in cui oggi ha sede il Boselli. Era già chiamato Boselli all’epoca o aveva un altro nome? Grazie.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1qltz0w/chi_si_ricorda_come_si_chiamava_questo_istituto/"
    },
    {
        "id": "1qls3po",
        "author": "Wise-Accident3048",
        "title": "Passaggio Torino- Friuli Martedì",
        "content": "Scusate, non so se è il subreddit giusto ma cercavo qualcuno con cui condividere i costi di un viaggio verso il Friuli in macchina per Martedì! Quindi se qualcuno ha bisogno di un passaggio mi scriva pure c:",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1qls3po/passaggio_torino_friuli_martedì/"
    }
]