[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1oj9qs2",
        "author": "Independent-One-5164",
        "title": "what are some docs like dont fck with cats?",
        "content": "i am looking for some really disturbing docs from netflix.. i am curious person  and i am looking for docs. or even movies,...  can someone suggest me some true crime docs? i would really appreciate it ",
        "upvotes": 123,
        "comments": 185,
        "media": null,
        "permalink": "/r/netflix/comments/1oj9qs2/what_are_some_docs_like_dont_fck_with_cats/"
    },
    {
        "id": "1oja4nx",
        "author": "Objective-Move25",
        "title": "Drop your comfort shows.",
        "content": "The title, please drop your comfort shows. I can never re-watch something no matter how much I love it, so I'm running out of shows here, and I could use some easy to watch comfort shows for the fall and winter. I usually go for Killing Eve (not on Netflix), Brooklyn Nine Nine, The Lincoln Lawyer, sometimes Gilmore Girls, then stop after 3-5 minutes cause I can quote them line to line from the first watch. Up for new suggestions, give me anything.",
        "upvotes": 58,
        "comments": 197,
        "media": null,
        "permalink": "/r/netflix/comments/1oja4nx/drop_your_comfort_shows/"
    },
    {
        "id": "1ojoxrb",
        "author": "MsSamm",
        "title": "Nailed It! should be a permanent Netflix staple.",
        "content": "Somehow I found Nailed It episodes I hadn't seen. I laugh so much at this show that my face hurts. They need to bring it back with the full cast. Too much Nailed It! is never enough",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ojoxrb/nailed_it_should_be_a_permanent_netflix_staple/"
    },
    {
        "id": "1ojd0qc",
        "author": "neoprenewedgie",
        "title": "Plot question for House of Dynamite (not about the ending, spoilers inside)",
        "content": "&gt;!Why was the president pressured to make an immediate decision about a counter-strike?!&lt;\n\nI learned everything about Global Thermo Nuclear War from that great 80s documentary, War Games. The counter-strike dilemma was that if the US didn't launch its own nuclear weapons, the missile silos would be destroyed by the incoming attack. In House of Dynamite, that is not an issue. There was only one incoming missile, which might malfunction. The president still had no idea who launched the attack. And even if Chicago got nuked, the president would still have the full arsenal of missiles to launch 15 minutes later, an hour later, or two days later.\n\nIt felt like it was an artificial and unnecessary deadline to create tension, but maybe I missed something that explained it. If this was Independence Day I would just brush it off but Dynamite is (generally) a smart film. Any insights?",
        "upvotes": 25,
        "comments": 56,
        "media": null,
        "permalink": "/r/netflix/comments/1ojd0qc/plot_question_for_house_of_dynamite_not_about_the/"
    },
    {
        "id": "1oiuegs",
        "author": "Action_Jackson_777",
        "title": "A House of Dynamite…🤦🏻",
        "content": "What are we doing here honestly? When you really sit back and think about it, this was a movie about nothing. No it is not a psychological, open-ended thriller that is meant to leave you guessing and interpret your own meaning. We didn’t need that many angles, that many countdowns and that many different perspectives. To each their own but the entire time I was DYING to know who sent the missile and what the appropriate response would be. We were given none of this. It’s like eating your veggies expecting a steak will come later and then it never comes. I don’t know about you but a movie like this is essentially pointless if we don’t at least get some sort of simulation as to what would happen next. Not to mention, they never even actually confirmed or denied that the missile made impact! What?!? This movie was all suspense, all buildup and no drop. Disagree all you want, after all it’s just an opinion but this left me dissatisfied and disappointed. 👎🏻",
        "upvotes": 362,
        "comments": 356,
        "media": null,
        "permalink": "/r/netflix/comments/1oiuegs/a_house_of_dynamite/"
    },
    {
        "id": "1oj46rl",
        "author": "GRILT_CHEESE",
        "title": "The Asset on Netflix, really enjoyed this, it's a Danish crime thriller",
        "content": "The Asset , Danish title is Legenden and it was released just the other day,  I binged the whole thing\n\nWhen I say crime thriller, there's not a lot of violence or anything, but it's about an undercover cop who poses as a jeweler to befriend the rich wife of a big drug dealer and then it goes from there. It's well-acted, well-shot, good production values, and you get a full story from 6 episodes with a nice pathway for a season 2 at the very end.\n\nHighly recommend it!",
        "upvotes": 40,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1oj46rl/the_asset_on_netflix_really_enjoyed_this_its_a/"
    },
    {
        "id": "1ojoccl",
        "author": "elonthegenerous",
        "title": "Get Help to sign out??",
        "content": "It took me so long to figure out how to sign out of my Netflix account on my TV. It turns out it’s in the Get Help menu? How does that make sense? I feel like this UX needs to be revisited ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ojoccl/get_help_to_sign_out/"
    },
    {
        "id": "1ojlzm7",
        "author": "PossibleFlamingo3269",
        "title": "What shows/movies are unavailable with the ads plan? (US)",
        "content": "Looking to change my Netflix plan, and thinking about the cheapest option, but it says some content might be locked. Can I get some examples about what’s locked? I’m in the US. ",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ojlzm7/what_showsmovies_are_unavailable_with_the_ads/"
    },
    {
        "id": "1ojtz26",
        "author": "ventinove_dodici",
        "title": "Sense 8",
        "content": "After several years I am reviewing Sense8. To be honest, the first time I saw it I wasn't thrilled. Too full of intertwining stories and an initial mystery that stuck with me because I didn't know how to place it in the unfolding plot. That feeling is still there but I remain impressed by how our life can itself be a sense 8 because I have often wanted to see people from the past again, I wanted them to manifest themselves and live a moment of my life with me.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ojtz26/sense_8/"
    },
    {
        "id": "1ojq9w3",
        "author": "hybrid889",
        "title": "PC streaming issues chrome\\netflix video pauses and audio continues to play",
        "content": "9950x3d, 5080, 64gb of ram, hardware isn't the issue afaik, new build, no other issues other than this one. Fresh install of windows.  \nMultiple monitor set up, I have chrome running with netflix, periodically, could be in 5m or 50m, the video will freeze and audio keeps playing, after 10-20s all 3 monitors go black for a second and come back and i have to refresh the chrome tab with netflix to get it to play again. This ONLY happens with netflix, not hulu, peacock, etc.\n\nIs this just a netflix bug, I can't imagine i'm the only one here. No issues playing graphic demanding games, no issues with GPU that I'm aware of. I've installed multiple version of and latest graphic drivers. I'm ready to just unsubscribe to netflix.\n\nI do have hardware acceleration turned on in Chrome, don't really want to turn it off, everything performs better and more fluid with it on.\n\nAnyone else run into this and know how to fix it?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ojq9w3/pc_streaming_issues_chromenetflix_video_pauses/"
    },
    {
        "id": "1ojr9df",
        "author": "WelcomeEven567",
        "title": "Taken in Plain Sight - how is this on the top 10 movies?!",
        "content": "I felt like the movie was very fact paced and the acting was not very good. The mother constantly looks distressed, which made the acting seem even more inauthentic. I saw the ending coming from a mile away and it was very anti-climactic.. she struggles with the kidnapper for not even a minute before running off to the kids. Also, i felt we didn’t get much of an explanation at the end. i had high expectation for this movie after seeing it reach #3 for the top 10 movies but it was just a disappointment. all in all, the movie had mediocre acting (at best) and the storyline just wasn’t great. it never deserved to be in the top 10 movies.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ojr9df/taken_in_plain_sight_how_is_this_on_the_top_10/"
    },
    {
        "id": "1ojhxs5",
        "author": "Embarrassed_Dish_672",
        "title": "Looking for something good to binge watch !",
        "content": "I’m looking for something to binge I loved orange is the new black shameless workin moms good girls dead to me Ginny and Georgia never have I ever  … etc lol those are my all time favs .. what is just as good !? ty!!! ",
        "upvotes": 3,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1ojhxs5/looking_for_something_good_to_binge_watch/"
    },
    {
        "id": "1ojp6ll",
        "author": "Gloomy_Key_7320",
        "title": "is the mobile subscription (480p) good for netflix? or is the quality bad?",
        "content": "im planning to buy the mobile subscription for netflix tho the resolution is 480p. so idk if i should get that one or not. its the cheapest one and im thw only one who will be using it ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ojp6ll/is_the_mobile_subscription_480p_good_for_netflix/"
    },
    {
        "id": "1ojhwf0",
        "author": "Strong-Smoke7774",
        "title": "Won’t let me watch on bedroom TV at work",
        "content": "Hey guys, I’m a firefighter and obviously spend a significant amount of time at the fire station. \n\nAll of a sudden I can’t sign-in in my room anymore. I used to be able to select the “I’m traveling” option and it worked fine. Now it won’t even let me do that. The option is no longer there. \n\nI already pay for a premium account… I’m not sharing my login with anyone. I just want to be able to watch the account I already pay for. What the actual fuck, Netflix. \n\nAnyone know how I can watch it without paying even more?",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1ojhwf0/wont_let_me_watch_on_bedroom_tv_at_work/"
    },
    {
        "id": "1oj8qof",
        "author": "Sudden_Pop_2279",
        "title": "Wednesday season 2 surpasses Dahmer to become the #4 most viewed Netflix english show of all time",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oj8qof/wednesday_season_2_surpasses_dahmer_to_become_the/"
    },
    {
        "id": "1oiku9t",
        "author": "Rich-Masterpiece-156",
        "title": "Why has the quality of the shows gone downhill so bad vs previous years?",
        "content": "The shows use to be amazing, Dark, House of Cards, Ozarks, You (first and second season) Narcos, Archive 81. Compare these shows to what's out in the past year. There is a massive difference. Not just my opinion look at IMDB scores. Add to the fact Stranger Things is on its last season. ",
        "upvotes": 87,
        "comments": 114,
        "media": null,
        "permalink": "/r/netflix/comments/1oiku9t/why_has_the_quality_of_the_shows_gone_downhill_so/"
    },
    {
        "id": "1oiknua",
        "author": "Biskotos",
        "title": "Can we talk a bit about the ending of \"A House Of Dynamite\"?",
        "content": "The whole movie was very nerve-wracking and made me feel so anxious however the ending was super anti-climactic. If you have watched it yet, what do you think about ",
        "upvotes": 44,
        "comments": 199,
        "media": null,
        "permalink": "/r/netflix/comments/1oiknua/can_we_talk_a_bit_about_the_ending_of_a_house_of/"
    },
    {
        "id": "1oixkhh",
        "author": "SativaStrong",
        "title": "Billionaires' Bunker",
        "content": "I'm two episodes in and I can't be the only one. The acting of the film director and the Overseer lady's brother made me cringe more than I ever have from a higher budget show. They gave me the feeling that I was watching a couple guys trying too hard to impress their acting teacher. It breaks the illusion of the show for me everytime I see them.",
        "upvotes": 8,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1oixkhh/billionaires_bunker/"
    },
    {
        "id": "1oivs44",
        "author": "Electronic_Animal_32",
        "title": "Perfect Neighbor",
        "content": "I’ve mulling this over. How could the tragedy be prevented so many people did not help the situation. The police should've known that this was going on for too long and it needed to be resolved permanently with either with talking to with her or a warning or something. The parents should‘ve talked among themselves and decided to always have an adult out there with the kids. Maybe the landlord should've done something evicted her for harassing the neighborhood children. I don't think anyone did enough to prevent this.",
        "upvotes": 5,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1oivs44/perfect_neighbor/"
    },
    {
        "id": "1oin5nz",
        "author": "Training-Entry-743",
        "title": "Ray Romano Joins Netflix's 'Running Point' Season 2 In Recasting",
        "content": "",
        "upvotes": 21,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1oin5nz/ray_romano_joins_netflixs_running_point_season_2/"
    },
    {
        "id": "1ojhh8t",
        "author": "Agreeable_Yam225",
        "title": "Kendra Licari (Uknown Number Stalker documentary)",
        "content": "(F17)\n\nI just finished watching the Netflix documentary about Kendra Licari, and I genuinely don’t understand why not many people are talking about this. It’s one of the most disturbing cases I’ve seen in a while, not just because of what she did, but because of how quietly it’s being treated.\n\nWhat really gets me is how different the reaction would’ve been if the roles were reversed. If it had been a man (her father) who had been sexting his sons girlfriend, I feel like there would be nonstop coverage, public outrage, and discussions about grooming, power dynamics, and sexual harassment. He probably would’ve faced a much harsher punishment too.\n\nBut because it’s a woman, it feels like people are brushing it off or minimizing it a little bit even though what she did was completely predatory without any question. I get that the main focus right now is on Lauryn, which i 100% understand, but i don’t understand how her mother wasnt convicted for anything else. It’s honestly terrifying how much effort she put into the whole thing and how long it went on.\n\nWhat do you think?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ojhh8t/kendra_licari_uknown_number_stalker_documentary/"
    },
    {
        "id": "1oiw3jb",
        "author": "Rough_Abrocoma_5663",
        "title": "Horror!",
        "content": "Me and my girlfriend need a good scary movie to watch! we don’t watch much of them but trying to get more into the Halloween vibes! Can you recommend your favorite horror movie on Netflix pls and thank you!!",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1oiw3jb/horror/"
    },
    {
        "id": "1oikcdk",
        "author": "ISh0uldNotDoThat",
        "title": "Just watched Perfect Neighbor. Can someone confirm if Susan indeed searched \"Stand Your Ground\" laws on Google *before* the shooting?",
        "content": "Title. The cops strongly imply that she did during the interrogation, but it's never confirmed. If she did, then to me, this makes the incident a clear cut case of premeditated murder, rather than one of manslaughter.",
        "upvotes": 21,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1oikcdk/just_watched_perfect_neighbor_can_someone_confirm/"
    },
    {
        "id": "1oitrcz",
        "author": "Abandonedinternally",
        "title": "Baby bandito",
        "content": "Has anyone watched baby bandito? It is some fun but also has some of the weirdest storylines. I just need to know if anyone knows what panda did with the girl who took his money? They show him put his hand over her mouth and take her in episode 5 or 6 I believe but never anything after that. That plotline just disappeared.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oitrcz/baby_bandito/"
    },
    {
        "id": "1oi9lg0",
        "author": "Task_Force-191",
        "title": "‘One Piece’ Season 2 Sets March Release Date, Drops First Look at Luffy on Drum Island",
        "content": "",
        "upvotes": 32,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1oi9lg0/one_piece_season_2_sets_march_release_date_drops/"
    },
    {
        "id": "1ojdfjb",
        "author": "Equal_Beat_6202",
        "title": "Guys, don’t trust any reviews, WAYWARD is actually quite good!",
        "content": "I just finished the show and checked it out on IMDb and was SO perplexed to find a lower-than-expected rating. But of course, sifting through the reviews, I realised it’s a whole bunch of people who watched the first ten minutes, saw there was a trans actor, and decided to hate on the show.\n\nIt’s amazingly written, keeps you hooked and the cast are amazing. Good enough for a weekend binge!",
        "upvotes": 0,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1ojdfjb/guys_dont_trust_any_reviews_wayward_is_actually/"
    },
    {
        "id": "1oipqim",
        "author": "PudzMom",
        "title": "Is Virgin River available on the Standard with ads plan?",
        "content": "I know the majority of you don't like the plans with ads, but I'm trying to save money and basically just want to see season 6 of Virgin River right now  ",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1oipqim/is_virgin_river_available_on_the_standard_with/"
    },
    {
        "id": "1oi5546",
        "author": "wonhoppa",
        "title": "Physical: Asia - Discussion",
        "content": "Among the competitors are world-renowned icons:\n\n* **Korea:** UFC trailblazer Dong-hyun “Stun Gun” Kim leads a powerhouse squad featuring Olympic gold medalist Yun Sung-bin, famed ssireum champion Kim Min-jae, Amotti (Physical: 100 Season 2 winner), Jang Eun-sil, and Choi Seung-yeon. \n* **Japan:** Yushin Okami, one of Asia’s most decorated MMA fighters.\n* **Australia:** Former UFC Middleweight Champion Robert “The Reaper” Whittaker.\n* **Philippines**: Boxing icon Manny Pacquiao, the only eight-division world champion in history.\n* **Thailand:** Muay Thai world champion Superbon.\n* **Mongolia:** Traditional wrestling star Orkhonbayar Bayarsaikhan.\n* **Türkiye:** Four-time oil wrestling champion Recep Kara.\n* **Indonesia:** Physique powerhouse I Igedz “Executioner”.\n\n[Contestant Profiles](https://www.mykpopshows.com/physical-asia)",
        "upvotes": 18,
        "comments": 179,
        "media": null,
        "permalink": "/r/netflix/comments/1oi5546/physical_asia_discussion/"
    }
]