[
    {
        "id": "1m66wjd",
        "author": "Jorgemeister",
        "title": "Announcement: Kiyan Sobhani Chief Editor of Managing Madrid will be doing an AMA here this Wednesday, July 23rd, 1:00 PM EST | 7:00 PM CET",
        "content": "\nHello guys!\n\n\n**Kiyan Sobhani, chief editor of** [Managing Madrid](https://www.managingmadrid.com/)**, involved in many other sport related sites and podcasts including La Liga focused podcast** [Churros and tactics](https://soundcloud.com/churrosytacticas) will hold an AMA here at r/RealMadrid next wednesday, 1:00 PM EST | 7:00 PM CET\n\nA new thread will be created by him that day and he will be answering questions through the day. \n\n# This is not the AMA thread\n\nCheers!",
        "upvotes": 80,
        "comments": 15,
        "media": null,
        "permalink": "/r/realmadrid/comments/1m66wjd/announcement_kiyan_sobhani_chief_editor_of/"
    },
    {
        "id": "1m5euwz",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 13,
        "comments": 683,
        "media": null,
        "permalink": "/r/realmadrid/comments/1m5euwz/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1m6t4m8",
        "author": "menu07",
        "title": "How many emotion points can you give to the tenth?",
        "content": "",
        "upvotes": 461,
        "comments": 38,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/h3ik2awebief1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1m6t4m8/how_many_emotion_points_can_you_give_to_the_tenth/"
    },
    {
        "id": "1m6mnmm",
        "author": "Miserable-Subject-87",
        "title": "Kylian Mbappé will wear the number 10 at Real Madrid.",
        "content": "",
        "upvotes": 830,
        "comments": 265,
        "media": null,
        "permalink": "/r/realmadrid/comments/1m6mnmm/kylian_mbappé_will_wear_the_number_10_at_real/"
    },
    {
        "id": "1m69dej",
        "author": "AestheticEvan23",
        "title": "Throwback to when Nacho did this",
        "content": "",
        "upvotes": 3116,
        "comments": 50,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/otw0unn38eef1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1m69dej/throwback_to_when_nacho_did_this/"
    },
    {
        "id": "1m6jlnq",
        "author": "Effective_Captain611",
        "title": "Madrid Quotes That Cut Deep ❄️",
        "content": "",
        "upvotes": 573,
        "comments": 48,
        "media": null,
        "permalink": "/r/realmadrid/comments/1m6jlnq/madrid_quotes_that_cut_deep/"
    },
    {
        "id": "1m6coap",
        "author": "Right_Author8684",
        "title": "Lamine Yamal's all time XI includes 6 Madrid legends",
        "content": "",
        "upvotes": 1171,
        "comments": 153,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/l7odi87a5fef1.png?auto=webp&amp;s=7fe058490790570a377715c2cba2d5fd1f548b41"
        },
        "permalink": "/r/realmadrid/comments/1m6coap/lamine_yamals_all_time_xi_includes_6_madrid/"
    },
    {
        "id": "1m6eg9y",
        "author": "Messmers",
        "title": "I know Xabi got a plan for him",
        "content": "",
        "upvotes": 799,
        "comments": 42,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/sjl7mur6jfef1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1m6eg9y/i_know_xabi_got_a_plan_for_him/"
    },
    {
        "id": "1m6dlke",
        "author": "Icepiper_youtube",
        "title": "I trust this gang for the next season, I hope they will cook 🙏🙏",
        "content": "",
        "upvotes": 522,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/pwcereiscfef1.jpeg?auto=webp&amp;s=3aa317536d34b0370ab476f7c7558c5715dad2cf"
        },
        "permalink": "/r/realmadrid/comments/1m6dlke/i_trust_this_gang_for_the_next_season_i_hope_they/"
    },
    {
        "id": "1m6o26g",
        "author": "ReplacementUnited740",
        "title": "Unpopular opinion: I think there's a good chance Camavinga will become a starter next year, even replacing the Turkish army commander Arda Guler",
        "content": "I want to clarify that I really like Arda and I see what he is capable of doing offensively,I also don't forget that he's a young player and he needs to gain experience, and the best way to gain experience is to play BUT \nFor me, Camavinga has been trained for a long time in the position where everyone imagines Arda playing next season. \nFor those who remember him at Rennes, he played like Xabi would like.\nHis problem is injuries but we all agreed that he has enormous qualities. \nHe is much better defensively than Arda and he has more experience so I think that in matches where he does not want to take risks he will prioritize Camavinga \n\nMessage to the Turkish soldier: I am not a Mobutu soldier (in France we call him that) and I am not trying to threaten your commander, the great Arda Guler.",
        "upvotes": 106,
        "comments": 106,
        "media": null,
        "permalink": "/r/realmadrid/comments/1m6o26g/unpopular_opinion_i_think_theres_a_good_chance/"
    },
    {
        "id": "1m6lji6",
        "author": "Grouchy-Support-1019",
        "title": "Road to the 2015/16, 2016/17, and 2017/18 Champions League wins",
        "content": "Is there any document about Real Madrid winning the Champions League three times in a row in 2015/16, 2016/17 and 2017/18? Or something on YouTube? I know that 'Road to Win' videos exist for individual seasons, but do you know of anything where everything is together? Any recommendations are appreciated.",
        "upvotes": 138,
        "comments": 2,
        "media": null,
        "permalink": "/r/realmadrid/comments/1m6lji6/road_to_the_201516_201617_and_201718_champions/"
    },
    {
        "id": "1m6obuo",
        "author": "IcefoxX5",
        "title": "[@realmadrid] Comunicado Oficial: Álvaro Rodríguez",
        "content": "",
        "upvotes": 77,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aloQaUuYbKpsUR7YBuBxNRmtXeXz4ScGOzxFnEQNbVQ.jpg?auto=webp&amp;s=66cdf9425482679cd64997bb7d2566cbfcea7e93"
        },
        "permalink": "/r/realmadrid/comments/1m6obuo/realmadrid_comunicado_oficial_álvaro_rodríguez/"
    },
    {
        "id": "1m73xd2",
        "author": "OnlyAMuggle",
        "title": "What are your expectations this year",
        "content": "For me its very simple.\n\nWin La Liga.\n\nMaybe win the Champions league but most importantly win la Liga this year.\n\nWhat are yours.\n\nSecondly what are your expectations without winning any trophy?\n\nIs a second place in la liga enough or do you expect the team to at least have a semi final place in the Champions League.\n\nEither way if we don't win anything we should give Xabi the chance to get the tactics right \"At Least\".",
        "upvotes": 7,
        "comments": 7,
        "media": null,
        "permalink": "/r/realmadrid/comments/1m73xd2/what_are_your_expectations_this_year/"
    },
    {
        "id": "1m6ptpu",
        "author": "ace-s",
        "title": "The biggest positive that came from CWC was Xabi Alonso's willingness to make the best decision for the team",
        "content": "I really hope Flo and the board allow Xabi to do what he needs to do with the team, so we can transition into the next era.\n\nWe were performing better and better in the CWC and Xabi is trying to implement tactical football to a team that was never micromanaged. These things take time but honestly PSG game aside, I think the outcome was very positive. \n\nThe fact that Xabi was willing to play the best players for each role over bigger names and he was willing to bench Vini against PSG speaks volumes. I honestly think that youngsters like Arda and franco mastantuono will be able to shine this season, they are the type of players that Xabi loves, players that can play direct and fast paced football.\n\n3 incidents happened. Xabi was forced to play Vini as his intention was to bench him, and he was forced to play Valverde as an RB. On top of that, 2 stupid mistakes from our CBs made the situation even worse. We would have seen a different game if it werent for these incidents. \n\nIf Rodrygo gets sold, I think we could see Vini have a lesser role in the team unless he is able to turn his form around and adapt to Xabi ball. I think Xabi is willing to play Mbappe and Garcia together upfront with players like Arda, Bello and Franco to support them.",
        "upvotes": 53,
        "comments": 27,
        "media": null,
        "permalink": "/r/realmadrid/comments/1m6ptpu/the_biggest_positive_that_came_from_cwc_was_xabi/"
    },
    {
        "id": "1m6vj85",
        "author": "v3tr0x",
        "title": "What are your \"realistic\" predictions for the upcoming season?",
        "content": "I've put the word realistic in quotes because, since we're RM fans here, it's hard to look at things objectively and not from a point of wishful thinking but if you would give your best realistic predictions for the upcoming season in regards to our club, which ones would they be?\n\n  \nMy predictions are as follows:  \n1. we will be very inconsistent at the beginning of the season but as the season goes on, we'll adjust more to Xabi's tactics  \n2. almost all classicos will end in a draw  \n3. we won't any titles but towards end of the season we'll play some beautiful football\n\n",
        "upvotes": 19,
        "comments": 44,
        "media": null,
        "permalink": "/r/realmadrid/comments/1m6vj85/what_are_your_realistic_predictions_for_the/"
    },
    {
        "id": "1m5zgzd",
        "author": "EffectiveTie3144",
        "title": "Happy birthday to Federico Santiago Valverde Dipetta 🇺🇾",
        "content": "",
        "upvotes": 1124,
        "comments": 32,
        "media": null,
        "permalink": "/r/realmadrid/comments/1m5zgzd/happy_birthday_to_federico_santiago_valverde/"
    },
    {
        "id": "1m681jh",
        "author": "SoftClub7159",
        "title": "Endrick out for 2 months",
        "content": "",
        "upvotes": 229,
        "comments": 53,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1DfUZomTdogthjjgPabDHIgPssHd9t268PnRMP6N3Jc.jpeg?auto=webp&amp;s=c5a547c1655ba99292ada26147c67d92d5488c17"
        },
        "permalink": "/r/realmadrid/comments/1m681jh/endrick_out_for_2_months/"
    },
    {
        "id": "1m6akgc",
        "author": "kenstarfighter1",
        "title": "Abdellah Ouazane deemed fit and healthy by Amsterdam UMC Medical Center",
        "content": "Abdellah Ouazane recently \"failed\" his medical at Sanitas, but has now done 2 more medical exams in Amsterdam UMC Medical Center, and the results described him as perfectly HEALTHY &amp; FIT.\n\nThis guy is a generational and I am seriously starting to question our medical team.\n\nReal Madrid are now reviewing the results of Amsterdam’s Medical Center according to De Telegraaf",
        "upvotes": 85,
        "comments": 30,
        "media": null,
        "permalink": "/r/realmadrid/comments/1m6akgc/abdellah_ouazane_deemed_fit_and_healthy_by/"
    },
    {
        "id": "1m60azb",
        "author": "EffectiveTie3144",
        "title": "Happy birthday to club legend and one of our top goal-scorers Emilio Butragueño Santos 🇪🇦",
        "content": "",
        "upvotes": 378,
        "comments": 9,
        "media": null,
        "permalink": "/r/realmadrid/comments/1m60azb/happy_birthday_to_club_legend_and_one_of_our_top/"
    },
    {
        "id": "1m67lt1",
        "author": "Short_Mousse_6812",
        "title": "I don’t get why we don’t get stiller",
        "content": "   There has been a lot of names going around to replace Kroos. The first one being Rodri, he used to be great but I don’t see him as a game creator and line breaker. Not to mention his beef with the club. On the other hand we have Enzo, he is extremely expensive and has performed well already, but his price is not worth what he brings in my opinion. Great player, but he is not the best at game creation. Then we have Mac from Liverpool, who is my favorite. He has already proved himself and is also someone who can play deeper and also break lines. However, I don’t think he is the best option. He is too expensive and will be tough to buy. Then we have the obvious option (imo), Stiller. Stiller is not only great at creating game, and making long passes. But he is also young and cheap. Angelo Stiller this season had stats basically identical to Kroos. Having one of the highest percentage passes and making a lot of long passes. He is cheap, young and recommended by Kroos. If you ask me I don’t know why we wouldn’t go for him. Who do you think is the best option?",
        "upvotes": 81,
        "comments": 94,
        "media": null,
        "permalink": "/r/realmadrid/comments/1m67lt1/i_dont_get_why_we_dont_get_stiller/"
    },
    {
        "id": "1m5msn5",
        "author": "RioPlatense1996",
        "title": "Real Madrid any time a player with a recent injury becomes available",
        "content": "After reading a report that Real Madrid are heavily interested in Rodri I couldn’t help but think of this. Why are we always buying players that are injury prone? Alaba was already having injury issues at Bayern and we still decided to bring him on at 29 years old with a huge salary. Currently 2nd highest paid players. Rodri is now 29 and coming back from an ACL injury. I don’t think it would be a smart investment.  ",
        "upvotes": 293,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/nm1g8zur29ef1.jpeg?auto=webp&amp;s=3952dae751bbd13932d2b8a7caae449027b156f4"
        },
        "permalink": "/r/realmadrid/comments/1m5msn5/real_madrid_any_time_a_player_with_a_recent/"
    },
    {
        "id": "1m5g3go",
        "author": "EffectiveTie3144",
        "title": "Happy birthday to Endrick Felipe Moreira de Sousa 🇧🇷",
        "content": "",
        "upvotes": 397,
        "comments": 22,
        "media": null,
        "permalink": "/r/realmadrid/comments/1m5g3go/happy_birthday_to_endrick_felipe_moreira_de_sousa/"
    },
    {
        "id": "1m5nkwr",
        "author": "Low_Gap8692",
        "title": "Little Madrid edit I made for next season 🇪🇸🤍",
        "content": "Should I make another?",
        "upvotes": 127,
        "comments": 25,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/tg5ladul79ef1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1m5nkwr/little_madrid_edit_i_made_for_next_season/"
    },
    {
        "id": "1m5f4fj",
        "author": "Sl_PROXY",
        "title": "[Fabrizio Romano] Jacobo Ramón to Como, here we go! Deal agreed with Real Madrid for the defender. €2.5m fee plus add-ons based on the appearances. Real Madrid will have 50% sell-on clause and also 3 buy back clauses, same as Nico Páz deal.",
        "content": "",
        "upvotes": 303,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zJ_yVpKMI4mDio8VnogqUucD1e69nkLxzS_9kKFdsPU.jpg?auto=webp&amp;s=d13c17698d284b404dabf32fd7b1ae838f21b6d3"
        },
        "permalink": "/r/realmadrid/comments/1m5f4fj/fabrizio_romano_jacobo_ramón_to_como_here_we_go/"
    },
    {
        "id": "1m5f66e",
        "author": "Ineedhelpistaken",
        "title": "Who’s the most “Real Madrid-coded” player who never played for us?",
        "content": "Just curious what everyone thinks, who’s that one player who felt like they should’ve worn the white shirt but never actually did?\n\nCould be due to their playing style, mentality, aura, winning mindset, clutch moments, or even off-the-pitch charisma. Someone who just fits the Real Madrid DNA even though they never played a single minute for us.\n\nWho’s your pick and why?\n",
        "upvotes": 238,
        "comments": 269,
        "media": null,
        "permalink": "/r/realmadrid/comments/1m5f66e/whos_the_most_real_madridcoded_player_who_never/"
    },
    {
        "id": "1m5k6am",
        "author": "AjVine",
        "title": "The sense of an actual team these players transmitted. Everybody including Ronaldo running and defending together. Man we might never have a team like this again.",
        "content": "I think everyone except maybe Courtois in that team would not start over any of our current team. They’re legends of their own, you see them all pressing, running behind the ball. You even see Cristiano at minute 75 in our area defending a corner. That’s why we won 3 CL in a row. Nobody complained about anyone’s work rate and they all ran. That was a team. We have some of the best players in each position at this day and age and I believe things can work out but our team has an attitude problem not necessarily lack of quality or tactics and I do think even Vini and Mbappe can play together. I hope Xabi’s presence shows that he is not there to make friends but to mold a bunch of players into a team. If they all collectively put as much heart as Valverde does, we would steamroll most teams in La Liga and compete against the big ones in Europe. ",
        "upvotes": 95,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kyLrook_JR3tKYhk8tit3E4aBt2xxF0ukNWEpu9zuyE.jpeg?auto=webp&amp;s=cd4621020af5f5ea1c0276b4a9aa4861f4733607"
        },
        "permalink": "/r/realmadrid/comments/1m5k6am/the_sense_of_an_actual_team_these_players/"
    },
    {
        "id": "1m5cf88",
        "author": "Ready_Ad_1353",
        "title": "Toni Kroos: \"I retired at the peak of my powers. It's a great feeling as you’re the one who made the decision [...] Neither my coach, nor my family, nor my body were going to tell me when to retire. You can't stand it until you're 40. You have to leave football before football leaves you.”",
        "content": "**The full quote on his retirement:**\n\n'I spent several months thinking about this. I mean, I didn't just get out of bed one morning and suddenly say to myself, \"You have to retire!\" No, I thought about it a lot. I had already thought about retiring the year before, but in the end I decided to renew for another year with Real Madrid, they had been very insistent. But that didn't change my idea, which was always to retire like this, and luckily I've managed it. I think it's difficult to do better than I did in my last season with Real Madrid. I left after winning La Liga and the Champions League. Adiós.\"\n\nThe best thing is to leave at the very top. You walk away with a great feeling because you’re the one who made the decision. And before someone sent me to the bench because I wasn’t as good anymore or because I wasn’t as important to the team as I was right up to the end. I preferred to be the one to step away. I wanted to avoid all that. Neither my coach, nor my family, nor my body were going to tell me when to retire. You can't stand it until you're 40. You have to leave football before football leaves you\"",
        "upvotes": 291,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7JEBsboZJ78tME1pRegwa0sI89cFS0N6hMaaVQ5sllY.jpeg?auto=webp&amp;s=b0e3eec53058dccdc3b0578e83c1ecdb37e67a42"
        },
        "permalink": "/r/realmadrid/comments/1m5cf88/toni_kroos_i_retired_at_the_peak_of_my_powers_its/"
    },
    {
        "id": "1m58ig0",
        "author": "Thatone_Guy22",
        "title": "Thank you,Luka Modrić and Lucas Vasquez ❤️",
        "content": "So I  was chilling and there's a channel on my TV that shows nothing but Champions League, from classic matches, replays, etc, and since I was bored I clicked it and it happened to show our comeback against Dortmund on MD 3.\nI have to say when I saw that Luka and Vasquez were leaving  I  always try to stay composed (I've done that when other players left as well), but seeing what both did in that match again I did shed a tear.\nThese two were a part of my  football heroes list and they made football great and fun for me growing  up and I feel really  bad for Vasquez considering he was the one to get criticized  quickly (even tho was out of position  for most of the season.)\nEither way, since  I haven't been active in this community and haven't said it yet.\nThank you, Luka Modrić  and Lucas Vasquez  you'll always be legends \n🤍💙💛",
        "upvotes": 128,
        "comments": 3,
        "media": null,
        "permalink": "/r/realmadrid/comments/1m58ig0/thank_youluka_modrić_and_lucas_vasquez/"
    },
    {
        "id": "1m4hieh",
        "author": "menu07",
        "title": "How do I explain to my children that Gareth Bale's favorite sport is golf?",
        "content": "",
        "upvotes": 3666,
        "comments": 136,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zv194hkvyydf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1m4hieh/how_do_i_explain_to_my_children_that_gareth_bales/"
    },
    {
        "id": "1m4n9s4",
        "author": "Superb-Wolf1008",
        "title": "El capitano will forever be missed",
        "content": "",
        "upvotes": 780,
        "comments": 29,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/3qhh9jexr0ef1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1m4n9s4/el_capitano_will_forever_be_missed/"
    },
    {
        "id": "1m4imie",
        "author": "landofphi",
        "title": "Toni Kroos: \"I retired at the peak of my powers. It's a great feeling as you’re the one who made the decision. [...] Neither my coach, nor my family, nor my body were going to tell me when to retire. You can't stand it until you're 40. You have to leave football before the body asks you to stop.\"",
        "content": "**The full quote on his retirement:**\n\n'I spent several months thinking about this. I mean, I didn't just get out of bed one morning and suddenly say to myself, \"You have to retire!\" No, I thought about it a lot. I had already thought about retiring the year before, but in the end I decided to renew for another year with Real Madrid, they had been very insistent. But that didn't change my idea, which was always to retire like this, and luckily I've managed it. I think it's difficult to do better than I did in my last season with Real Madrid. I left after winning La Liga and the Champions League. Adiós.\"\n\nThe best thing is to leave at the very top. You walk away with a great feeling because you’re the one who made the decision. And before someone sent me to the bench because I wasn’t as good anymore or because I wasn’t as important to the team as I was right up to the end. I preferred to be the one to step away. I wanted to avoid all that. Neither my coach, nor my family, nor my body were going to tell me when to retire. You can't stand it until you're 40. You have to leave it before the body asks you to stop.\"",
        "upvotes": 917,
        "comments": 56,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FO-aHrpdzh49l4F7eW3CfK0EWegSxmSVAD2rBXqAF2E.jpeg?auto=webp&amp;s=2b88b82c1a7a37962d3beeadf12302e29356342d"
        },
        "permalink": "/r/realmadrid/comments/1m4imie/toni_kroos_i_retired_at_the_peak_of_my_powers_its/"
    },
    {
        "id": "1m4nnj1",
        "author": "More-Judgment-9253",
        "title": "Almost every goal we conceded in the CWC was because of Rudiger and Asencio💀.",
        "content": "Against Al Hilal: Pen conceded because of asencio ( to be fair huijsen kinda messed up the offside trap but still)\n\nAgainst Pachuca: Not directly anyone's fault but asencio getting a red card didn't help.\n\nAgainst Dortmund: Rudiger had a horrendous clearance for the first goal and then he lost guirassy for the second goal ( yes huijsen was reckless but rudiger really didn't do anything good either)\n\nAgainst PSG: We all know about the first 2 goals but I would also say the 3rd goal is rudiger's fault as well because he was nowhere to be seen ( or maybe we should just blame the whole team for that)\n\nNow I understand rudiger played with basically one knee last season so he deserves praise for that and asencio saved us a lot last season but we really need another CB. They should still start games tho but maybe against smaller teams first",
        "upvotes": 246,
        "comments": 33,
        "media": null,
        "permalink": "/r/realmadrid/comments/1m4nnj1/almost_every_goal_we_conceded_in_the_cwc_was/"
    }
]