[
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 73,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 19,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1lprd43",
        "author": "butterchickened",
        "title": "The Old Guard 2",
        "content": "Well, that sucked!\nIs it just me or did the sequel not live up to expectations? \nI was so hyped up but now I'm lying here in bed in utter disappointment. \nIs it just the sequel effect? Or was the movie genuinely bleh? \n\nBarely any Joe and Nicky screen time, no actual communication happening between people, Andy just looking away deeply at every moment, underwhelming fight scenes, a stupid ending. \nTo be fair, there were some good parts. I did like seeing Andy a little happier. I loved Quyns angst. Booker made me cry. But overall it was a disappointing sequel.\nI mean if you're going to take 467866 years to make it, at least get it right??\n",
        "upvotes": 34,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1lprd43/the_old_guard_2/"
    },
    {
        "id": "1lp8idy",
        "author": "BeautifulLeather6671",
        "title": "Tires renewed for season 3",
        "content": "",
        "upvotes": 142,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1lp8idy/tires_renewed_for_season_3/"
    },
    {
        "id": "1lp8qv3",
        "author": "PixlStarX",
        "title": "Need Some Netflix Gold Suggest Your Best Series!",
        "content": "Hey folks!\nI’m on the hunt for a solid Netflix series to dive into something that really pulls you in, episode after episode. \n\nI’m open to anything: thriller, drama, comedy, sci-fi, mystery, foreign language, even documentaries if they’re binge worthy.\n\nJust looking for something with great storytelling, strong characters, or a vibe that sticks. Drop your favorites old gems or recent drops I’ll take all the suggestions I can get!\n\nLet me know what blew your mind 👇🍿",
        "upvotes": 107,
        "comments": 356,
        "media": null,
        "permalink": "/r/netflix/comments/1lp8qv3/need_some_netflix_gold_suggest_your_best_series/"
    },
    {
        "id": "1lpvh6q",
        "author": "Akumakaji",
        "title": "Why can't I watch downloaded stuff on my device offline?",
        "content": "This is a rant post. On preparation of a 3h flight I downloaded the Netflix app and a couple of episodes. Then during flight (in flight mode of course), the app wouldn't let me watch my downloads and demanded me go log in. \n\nWhile I understand that Netflix would want periodic verifications that I am the viable user, doesn't this defeat the purpose of pre-downloading stuff? I would only download episodes if I expect to move out of WiFi range or even spotty internet. \n\nThen at the destination, two days later I had a 2h bus drive and thought \"well, maybe watch that stuff now?\", but now Netflix gives me an error with my login credentials. I requested a password change and it gave me a \"too many log in -56\" error. \n\nWow, what a terrible user experience. I really just want to watch an hour of my downloads that already exists on my device, now the premier opportunity for the Netflix app to do it's perfect thing will be over just to cool off it's \"too many log in\" shutdown.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lpvh6q/why_cant_i_watch_downloaded_stuff_on_my_device/"
    },
    {
        "id": "1lpzf4y",
        "author": "Ok_Slice5487",
        "title": "Do I get standard with ads?",
        "content": "I have used standard in the past. I am currently on Hulu and used to ads. But I want to switch to Netflix and wondering how the experience is with ads? Earlier, the ads version of Netflix had lower video quality but now I see that it is 1080p for standard with or without ads.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lpzf4y/do_i_get_standard_with_ads/"
    },
    {
        "id": "1lq11uo",
        "author": "Responsible-Sign3223",
        "title": "Where The Ultimatum: Queer Love season two couples are now",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lq11uo/where_the_ultimatum_queer_love_season_two_couples/"
    },
    {
        "id": "1loy3xm",
        "author": "feather-stone2353",
        "title": "Trainwreck: The cult of American Apparel",
        "content": "I am shocked at the level of abuse in this! How people were able to put up with that level of disrespect and emotional abuse is astonishing. This is the blueprint of a toxic work environment. I'm only 30 mins into the documentary and I'm beyond disgusted with Dov Charney...sleazy and shady. Why is it always the same type of men exploiting young people and popular culture.  ",
        "upvotes": 71,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1loy3xm/trainwreck_the_cult_of_american_apparel/"
    },
    {
        "id": "1lpbk7z",
        "author": "Top-Three-USA",
        "title": "‘Squid Game’ Season 3 Sets a New Netflix Record With 60.1 Million Views in Three Days, Becoming One of The Platform’s Top Non-English Series Ever",
        "content": "",
        "upvotes": 11,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lpbk7z/squid_game_season_3_sets_a_new_netflix_record/"
    },
    {
        "id": "1lpqpog",
        "author": "gsmemo",
        "title": "Poor support",
        "content": "I’ve been a Netflix customer since April 2015. Yesterday, I tried to set up a separate account for a family member using the extra member process. I enabled profile transfer and followed all the steps. It felt off when the system asked for a payment method, and even worse when it actually charged me for the account.\n\nLater, I received an email saying, “Your invitation was declined,” which wasn’t true. We carefully followed every step in the screen, including the unexpected ones like entering payment details. When I contacted support, the only solution offered was to start the entire process over again. No explanation, no mention of a refund, just that they can’t add the account for “security reasons.” Yet somehow, there was no issue letting someone accidentally complete steps they weren’t supposed to.\n\nAfter 10 years as a customer, this was too much. Poor support like this is exactly what drives people away. So I’m done. Netflix got an extra €9.49 from me but not a € more.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lpqpog/poor_support/"
    },
    {
        "id": "1lpq5si",
        "author": "Indoril-Nerevar337",
        "title": "‘Squid Game’ Season 3 Sets New Netflix Milestone with Unprecedented Worldwide Launch",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lpq5si/squid_game_season_3_sets_new_netflix_milestone/"
    },
    {
        "id": "1lppzok",
        "author": "laladugu",
        "title": "Any good series recs or movies where romance isn’t a major focus (or forced at all)?",
        "content": "I’m a fan of shows that stay focused on world-building, but sometimes it feels like a bait-and-switch and the first few episodes are just setup before it turns into a lead boy/lead girl dynamic... Would love recs where that doesn’t happen and the plot stands on its own.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lppzok/any_good_series_recs_or_movies_where_romance_isnt/"
    },
    {
        "id": "1low3ws",
        "author": "isa_bru",
        "title": "I have to confirm I live at my house everytime I want to use netflix",
        "content": "So, I still live with my parents, and my mother pays for this netflix account. Sometimes when I'm bored at my boyfriend's house, I log in to netflix in his computer and watch my favorite series, my boyfriend doesn't even use the account, as he says there is nothing good on netflix. Theres no illegal account sharing, I live at my house. Like, bro, I get it they really needed to save those few bucks they lost from people sharing accounts, but now every time i access netflix, whether at home or not, I have to call my mother to get that stupid confirmation code to confirm I actually live at my house.\nThat's ridiculous, we pay such a high price for a service we supposedly can use at any time, anywhere, but as soon as someone decides to watch netflix away from home they will annoy you into leaving the platform and getting a membership from one of their competitors. ",
        "upvotes": 75,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1low3ws/i_have_to_confirm_i_live_at_my_house_everytime_i/"
    },
    {
        "id": "1lpgmz9",
        "author": "TurbulentAd3429",
        "title": "Good movie or tv show",
        "content": "I just finished Elite. I must say it was kinda life-changing. I was never one to watch tv shows but now i’m on a nonstop grind to find another like it. What should I watch next?",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lpgmz9/good_movie_or_tv_show/"
    },
    {
        "id": "1lpg4mv",
        "author": "Rlliuorb",
        "title": "Ads on the Standard (no-ads) plan?",
        "content": "I am watching the replay of this week's RAW and starting this week, I am forced to watch ads even though I am on the Standard (no-ads) plan, when it always skipped them in the past. is anyone else experiencing this? ",
        "upvotes": 3,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1lpg4mv/ads_on_the_standard_noads_plan/"
    },
    {
        "id": "1lpomgf",
        "author": "_katsubaku",
        "title": "subs appearance",
        "content": "can someone pls help me, my subs appearance cant be changed im using ipad 10th gen\n\n  \nits alright with non animated movies, but the animated ones arent.\n\n  \nI tried the settings in my ipad where u enable the subs and captioning. I tried fixing the netflix subs in my browser too. is this a netflix app thing? cant this be changed? :(",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lpomgf/subs_appearance/"
    },
    {
        "id": "1lpkb22",
        "author": "Greensvenner1234",
        "title": "Recommend me some arthouse.",
        "content": "Recommend me some arthouse preferably melancholic or unique, series or movies are both fine. Something like Jagten, The house that Jack built, Deadly class, It's such a beautiful day, etc",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lpkb22/recommend_me_some_arthouse/"
    },
    {
        "id": "1lpnnlz",
        "author": "TheSquirrelLink",
        "title": "Netflix randomly skips a few seconds while watching a show",
        "content": "I am currently rewatching sex education and i've noticed that it keeps skipping a few seconds in a random scene switch. It skips about 5 to 7 seconds so when i rewind for 10 seconds it skips again on the same spot. So it seems it is not completely random. \nThe skip also happens without any UI indicator.\n\nOn a different post here i've seen that headphones was the cause for another user. I've turned bluetooth off but still have those skips. \n\nI am watching on my phone most of the time but the skips do not occur when i'm watching on the TV.\nCurrent android version: 15\n\nI don't know if the skips are only on sex ed or another show, didn't watch anything else recently\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lpnnlz/netflix_randomly_skips_a_few_seconds_while/"
    },
    {
        "id": "1lpapah",
        "author": "thewhippersnapper4",
        "title": "Squid Game Season 3 Smashes Another Viewing Record For Netflix",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lpapah/squid_game_season_3_smashes_another_viewing/"
    },
    {
        "id": "1lpahf0",
        "author": "Accomplished_Job1904",
        "title": "Guys suggest somethin like strangers things, The dragon prince, lockwood and co. wednesday typii",
        "content": "i have already watched most of the fanstasy stuff on netflix so dont know what to watch next.. Already watched shadow and bone, dark, carnival row, arcane, so suggest something like that ... really want to watch some fantasy kind of stuff.. also love animated ones too ...",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lpahf0/guys_suggest_somethin_like_strangers_things_the/"
    },
    {
        "id": "1lpl92t",
        "author": "Dains84",
        "title": "Auto play next episode doesn't work when casting to Google TV device",
        "content": "I recently upgraded from a 3rd Gen Chromecast to an Onn Google TV 4k Plus streaming device. When we used to cast from our Android phones to the 3rd Gen CC, Netflix would automatically play the next episode until the \"are you still there?\" Timer hit. With the GTV box, if we use the remote to start a show it will autoplay as before, however if we start it by casting from the Netflix app in our phones, it will play a single episode, then roll the extended credits for foreign languages and go back to the Netflix menu. Our profiles are already set to autoplay episodes.\n\nHas anyone found a way to fix this issue, or is there a way to report it to Netflix?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lpl92t/auto_play_next_episode_doesnt_work_when_casting/"
    },
    {
        "id": "1lpasit",
        "author": "Top-Three-USA",
        "title": "Netflix Renews Shane Gillis Comedy ‘Tires’ for Season 3, Set to Premiere in 2026",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lpasit/netflix_renews_shane_gillis_comedy_tires_for/"
    },
    {
        "id": "1lpe24h",
        "author": "PitchPlayful5139",
        "title": "Sirens explained from my POV - a show about mental illness",
        "content": "If you see the story from the point of view of Devon and Simone you can understand better that they were struggling with mental illness (both their parents did - pretty sure they both had psychosis, their parents showed symptoms of bipolar; schizophrenia, severe depression). These disorders are genetical so it makes sense that Devon and Simone struggled with mental health and they were also showing symptoms - remember that Devon also said to Simone that she is not taking her medication. At the end of the movie you see how Simone got very triggered by the fact that Kiki found out about the \"kiss\" and she got fired...Simone started to switch and got into a mixed, mania episode...\n\nKiki and her husband showed signs of Narcissim, manipulation etc\n\nI think this show is about mental illness and how mania, psychosis looks - a lot of people don't understand at all how bipolar, schizophrenia, schizoaffective disorders are like ( I am commenting as someone who has schizoaffective bipolar disorder). throughout the all episodes you can see hallucinations, the struggles etc. Even Devon thinking that Kiki has a cult...Devon gets very paranoid about Kiki and starts to have all this stories about cults, how she is killing people etc...when in reality Kiki is not an evil monster...she is just a woman with lots of money, and probably a bit narcissistic and manipulative.\n\nI think the show is also about trauma bonding between people whith mental illness like bipolar/schizophrenia with people who has narcissistic tendencies. It's well known that people on schizophrenia spectrum can be very easy to manipulate and usually are the victims. It's interesting to view the show as a person who has the disorder because throughout the whole show no one time is mentioned a disorder name. It is only mentioned that Simone and their Dad are taking medication or they should; Simone's and Devon's mom tried to kill them and then killed herself and that Devon struggles with addiction and now she is sober.  Throughout the whole show it has this feeling of everything being a hallucination, a mesmerizing or paranoia vibe ...seeing something that is not real...like a Siren - is how psychosis or mania can feel like, very good depiction. \n\nAs someone who experiences mania, depression it looks very similar with how Simone was. You can see her behavior throughout the show but especially in the end. She was shocked when she was fired and after that she got triggered when her dad said \"it will be us 2 again and we try again to be good\" she was so scared that she went back and this could also trigger a mania episode in her (mania can be triggered by high stress) and then she immediately and impulsively jumps into Peter's arms. Then the scene where she is all dressed up and she talks with her sister Devon - look at that scene where she appears like she is on drugs, like it is not real, everything moved so fast to her being the new wife, giving up her loyalty to Kiki so quickly, her being showed on that hill with the big house in her background, everything being so grandiose, quick, mesmerizing - this how mania feels",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lpe24h/sirens_explained_from_my_pov_a_show_about_mental/"
    },
    {
        "id": "1lotwqq",
        "author": "Historical-Phrase106",
        "title": "Dept Q",
        "content": "I’m absolutely loving Dept Q… \nWhat are your thoughts on this series?  I am rewatching it because I feel like I missed a lot of important parts the first time around… I know Matthew Goode’s character Carl gets a bad rap, but I feel like his cockiness and sarcasm makes the show.. ",
        "upvotes": 26,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1lotwqq/dept_q/"
    },
    {
        "id": "1lpp1qt",
        "author": "Illustrious_Skill182",
        "title": "NETFLIX TAX INCREASE",
        "content": "As a person a mahilig manuod ng movies I would say netflix talaga gagamitin ko kasi maganda ang netflix. Pero nag increase kasi ang vat so makakatipid sa bayarin eh hiwalay na ang bayad ko sa wifi tapos iba pa netflix. Meron bang mga promo na magkasama yan? Hayy grabe kana inflation pati netflix damay na",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lpp1qt/netflix_tax_increase/"
    },
    {
        "id": "1lpbj0t",
        "author": "Mateoooo808",
        "title": "How does netflix work if I dont have a Household",
        "content": "So i move around a lot for work I dont have a set place that I frequent often because im always driving from state to state. Am I still able to use netflix or nah",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1lpbj0t/how_does_netflix_work_if_i_dont_have_a_household/"
    },
    {
        "id": "1lox6gp",
        "author": "Artistic_Spinach_589",
        "title": "What is your favorite official Netflix TV show character?",
        "content": "BTW it is also okay if you put a kids character (like Gabby's Dollhouse) Also, make fanart of the character, but if you don't want to, that is okay, just put a picture of the character",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lox6gp/what_is_your_favorite_official_netflix_tv_show/"
    },
    {
        "id": "1lp73ea",
        "author": "OverthinkingMomo",
        "title": "Recommend some webseries based around sense of small town community and family.",
        "content": "My cousin just moved abroad and feels a sense of craving for neighbours, family etc being one tight knit community.\n\nSome shows she loves include Reply 1988, schitts creek, superstore, midnight diner.\nWondering if y’all could recommend some more of such shows that feel close to home?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lp73ea/recommend_some_webseries_based_around_sense_of/"
    },
    {
        "id": "1lo1clp",
        "author": "Weird-Personality-31",
        "title": "get rid of netflix games.",
        "content": "I want the option to disable games. I want it gone.\n\nI hate the fact that they use money which we paid to make stupid games. this is not what netflix is about.\n\nIf I want to game I will buy my AAA games.\n\nBe gone with this trash!!",
        "upvotes": 469,
        "comments": 95,
        "media": null,
        "permalink": "/r/netflix/comments/1lo1clp/get_rid_of_netflix_games/"
    },
    {
        "id": "1lohwhc",
        "author": "brianfagioli",
        "title": "NASA teams with Netflix to stream rocket launches and spacewalks this summer",
        "content": "NASA is bringing its live space content to Netflix this summer. From rocket launches to astronaut spacewalks, the streaming platform will now beam space directly into your living room.",
        "upvotes": 43,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lohwhc/nasa_teams_with_netflix_to_stream_rocket_launches/"
    },
    {
        "id": "1los067",
        "author": "EfficiencyPrudent330",
        "title": "Shark 🦈 Whisperer",
        "content": "So profound, emotional, intriguing &amp; educational. I recommend for the whole family and I hope this show gets more people interested in preserving our great animals of the sea ",
        "upvotes": 10,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1los067/shark_whisperer/"
    }
]