[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 10,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 32,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1klmctd",
        "author": "Impossible_Monk1853",
        "title": "A deadly american mariage: could Molly and Tom Martens face justice again after the last trial?",
        "content": "I honestly found the trial so unfair. Can’t believe they’re still free with all the evidence against them. You don’t smash someone’s skull and leave brain pieces all over the room just to defend yourself. Is there any chance the case could be reopened so they actually get a life sentence for such a brutal murder?",
        "upvotes": 116,
        "comments": 115,
        "media": null,
        "permalink": "/r/netflix/comments/1klmctd/a_deadly_american_mariage_could_molly_and_tom/"
    },
    {
        "id": "1klvfk2",
        "author": "me91981",
        "title": "Something fun",
        "content": "I am in college and have just started working and it's draining. In my lunch break and after my workday, I just need something that's not very dull, psychological superficial shit but still engaging. Have you watched \"The Residence\"? Yes exactly like that. Mostly thrillers are preferred but I'll also take other suggestions. Please don't suggest a sitcom. I've watched all of them. Just need something that I can't stop before ending the episode but can wait for starting the next one. ",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1klvfk2/something_fun/"
    },
    {
        "id": "1klzqmk",
        "author": "Holiday_Record2610",
        "title": "Continue Watching Gone @ Netflix’s Response",
        "content": "I called Netflix to get help with “continue watching” no longer existing (i know many have this issue) and was told to do the most elementary trouble shooting (log out then back in, unplug tv then plug back in) with them on the phone even though I’d already done those things multiple times. They tried to tell me I need to create a new profile and use it from now on, nope. Kept insisting that’s the only solution. So I created a new profile and guess what? No continue watching there either. They told me they don’t know how to fix it and exited conversation. I will not be renewing my membership next month.",
        "upvotes": 5,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1klzqmk/continue_watching_gone_netflixs_response/"
    },
    {
        "id": "1kldjbn",
        "author": "HERE-F0R-THE-TEA",
        "title": "The four seasons was okay??",
        "content": "I can definitely understand why a lot of people loved the show but it just didn’t fully do it for me.. yeah I was definitely laughing for many parts but my biggest issue was the pacing. Certain ends to episodes left me wanting to see how the chaos would play out but would just enter the next episode months into the future. \n\nI think the pacing wasn’t for me but entertaining cast. \n\nAnyone else ?!? ",
        "upvotes": 52,
        "comments": 58,
        "media": null,
        "permalink": "/r/netflix/comments/1kldjbn/the_four_seasons_was_okay/"
    },
    {
        "id": "1kltole",
        "author": "Mean-Flower823",
        "title": "What show is it?!",
        "content": "For the life of me I cannot figure out what show this is, I thought it was a black mirror episode but I think I’m wrong. It’s a zombie episode and it starts out in a neighborhood with a lot of military trucks driving by as people come out of the houses and start following along. ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kltole/what_show_is_it/"
    },
    {
        "id": "1klle60",
        "author": "Jjh09007",
        "title": "Four Seasons question *spoilers ahead*",
        "content": "Does anyone else think that Nick might have lived if that guy didn't cut him at the grocery store line? I feel like he might have been on the road a few minutes earlier, potentially saving him from the accident. Honestly hated the twist at first but ai feel like it perfectly depicts the randomness of life and how suddenly life can change\n\n",
        "upvotes": 11,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1klle60/four_seasons_question_spoilers_ahead/"
    },
    {
        "id": "1km28un",
        "author": "SeaCrafty3884",
        "title": "Help me Please with Warrior 2019",
        "content": "Hey i need to watch the show warrior with my brother but i need time stamps for the scenes involving nudity so we can skip them. PLEASE HELP ME. Due to religious reasons we dont wish to be bombard with nudity and the show is amazing and honestly the nudity doesn’t do anything for the plot. So help meee",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1km28un/help_me_please_with_warrior_2019/"
    },
    {
        "id": "1klzdz1",
        "author": "Gohomepatyouredrunk",
        "title": "Bad Thoughts Discussion - Who was this made for?",
        "content": "I am a fan of Tom Segura. Enjoy his stand up and listen to his podcasts on occasion. This show was something. It felt like they were just trying to see what they could get away with to get put on air. Very few of the jokes hit with me. I guess I was not the target audience for this show.\n\nWith that being said, who enjoyed this?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1klzdz1/bad_thoughts_discussion_who_was_this_made_for/"
    },
    {
        "id": "1klyz48",
        "author": "derpymurpy",
        "title": "Full screen glitch - bobbing with subtitles",
        "content": "As the title says and in video, whenever I go into full screen and have subtitles enabled this happens. \nI could turn subtitles off but preferably would like them on. \nI tried the fix for Mac where changing cursor size fixes it but I’m using windows app on a hp so didn’t have any effect.\n",
        "upvotes": 0,
        "comments": 2,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/qp3xrwfvhm0f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1klyz48/full_screen_glitch_bobbing_with_subtitles/"
    },
    {
        "id": "1kkxwi5",
        "author": "EthanWilliams_TG",
        "title": "Netflix's Hit Series 'Lupin' Is Coming Back for a Fourth Part",
        "content": "",
        "upvotes": 77,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kkxwi5/netflixs_hit_series_lupin_is_coming_back_for_a/"
    },
    {
        "id": "1klnpx0",
        "author": "Outrageous_Buddy1938",
        "title": "I feel more and more famous Hollywood titles are being removed from the platform and only NF original getting loaded",
        "content": "How far is this true … I see Hollywood classics which were easily available on NFlix no longer exist any more. And the platform adds more and more their movies and series. \n\nIs this my observation true or others too feel the same. ",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1klnpx0/i_feel_more_and_more_famous_hollywood_titles_are/"
    },
    {
        "id": "1klw3xg",
        "author": "TheWandererTomorrow",
        "title": "Netflix offline",
        "content": "Should I not be able to download content from Netflix to my iPad and watch it offline ? I succesfully did that on a flight but on my iPhone. Should be the same. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1klw3xg/netflix_offline/"
    },
    {
        "id": "1klklgx",
        "author": "EthanWilliams_TG",
        "title": "Netflix Releases Trailer for 'K.O.' Starring UFC Legend Ciryl Gane, Premieres in June",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1klklgx/netflix_releases_trailer_for_ko_starring_ufc/"
    },
    {
        "id": "1klyjvn",
        "author": "Motherfockajames",
        "title": "The number 1 is unexpected but the most brutal at all. Netflix definitely have balls to broadcast an animation like LD+R these days.",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1klyjvn/the_number_1_is_unexpected_but_the_most_brutal_at/"
    },
    {
        "id": "1klbr6x",
        "author": "ToonAdventure",
        "title": "Cells At Work! | Official Trailer | Netflix",
        "content": "",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1klbr6x/cells_at_work_official_trailer_netflix/"
    },
    {
        "id": "1kla37n",
        "author": "Chef__Goldblum",
        "title": "Million Dollar Secret",
        "content": "For the next season (if there is one) I’d love there to be an edit where we can play along. We don’t know who has it. We don’t see the confessionals of ‘I feel so guilty’ just a chance to be as shocked as the others when it is/isn’t who we all suspect! \n\nPlus not knowing the challenges would be so cool. \n\nWould be a hard edit, but I would watch twice. Once not knowing and once knowing with the commentary and agendas and things. ",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kla37n/million_dollar_secret/"
    },
    {
        "id": "1klyq4a",
        "author": "Plane-Cloud-5837",
        "title": "OnlyFans model vows to end incels with deranged plot after watching Netflix’s Adolescence",
        "content": "",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1klyq4a/onlyfans_model_vows_to_end_incels_with_deranged/"
    },
    {
        "id": "1kla8jz",
        "author": "Curious_Cranberry543",
        "title": "Relaxing lifestyle shows?",
        "content": "I really liked With Love, Meghan, because I thought it was relaxing. I know a lot of people are weirdly, passionately vitriolic towards it… but pls don’t comment any rants… I am just asking for a rec for another relaxing show that is lighthearted and calming after a stressful day. Feel free to share anything that you think is in that genre, but better. Thank u",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kla8jz/relaxing_lifestyle_shows/"
    },
    {
        "id": "1klo0lq",
        "author": "insightwithdrseth",
        "title": "Podcast  Fred &amp; Rose West: A Psychologist's 7 Chilling Insights into the...",
        "content": "Dr. Seth -- psychological insight into serial killers and Fred &amp; Rose West -- Netflix's A British Horror Story",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1klo0lq/podcast_fred_rose_west_a_psychologists_7_chilling/"
    },
    {
        "id": "1kkzaxk",
        "author": "indiewire",
        "title": "Madonna’s Life Story to Be Adapted Into Netflix Limited Series from Shawn Levy",
        "content": "",
        "upvotes": 15,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1kkzaxk/madonnas_life_story_to_be_adapted_into_netflix/"
    },
    {
        "id": "1klq09e",
        "author": "Cooltwou",
        "title": "I have a question about WWE Content and Netflix",
        "content": "Are the WWE PPV starting with the year 2021 on Netflix because I don’t know what is on Netflix because I no longer have access to Netflix so I have to access other people.\n\nAlso is WWE Raw from the end of 2020 on Netflix yet because when my brother was home last time I seen him that content was not on Netflix when he let me look and see what was on there ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1klq09e/i_have_a_question_about_wwe_content_and_netflix/"
    },
    {
        "id": "1kkj5a6",
        "author": "Upset-Look2811",
        "title": "Deadly American Marriage",
        "content": "The scene at 24:01 where Molly is filming the kids on the swing and asks Sarah how old she is and Sarah answers 2, then Molly says 2 and a half.  Then she pans pover to Jack and ask how old he is and he proudly  says 4 and a half , and she says,,,,, are you sure?  Are you sure ? because tyhose noises ahahah you make sound like a one and a half.. THAT IS EVERYTHING YOU NEED TO KNOW ABOUT HER.  DISGUSTING. MANIPULATIVE. ABUSIVE. NARCISSISTIC ",
        "upvotes": 207,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1kkj5a6/deadly_american_marriage/"
    },
    {
        "id": "1kllfsn",
        "author": "dohat34",
        "title": "iOS 16.7.1",
        "content": "Guys - is there a good chance Netflix will continue operating its older version on IOS 16.7.1? Family member is remote and I have no way to update the older iPad. All they use on the iPad is Netflix period. thanks",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kllfsn/ios_1671/"
    },
    {
        "id": "1klq7vg",
        "author": "Octopus_basketball",
        "title": "Netflix customer service is questionable…",
        "content": "I need to contact (anyone) from Netflix customer support, the internet tells me to contact them through the app. Issue is I can’t log in and get to the app. Well done Netflix. Anyone know the number I can call?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1klq7vg/netflix_customer_service_is_questionable/"
    },
    {
        "id": "1klf6xl",
        "author": "LoveOnPawzz",
        "title": "13 Reasons Why",
        "content": "I just finished reading the book and went on the the show.. I’m disappointed. One, why is there four seasons? Oh and spoilers if you haven’t read it. There should only be one season with episodes for each tape. Going through clays night. Not this having him go through by days, he did it in one night. Plus the facts in the tapes are wrong. Half the show is inaccurate and I was really expecting more… what are your opinions?",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1klf6xl/13_reasons_why/"
    },
    {
        "id": "1kl86wj",
        "author": "Itachi_uchiha_62",
        "title": "can't watch Raw live stream tonight, anyone else have this issue?",
        "content": "Hello, posting this on behalf of my dad as he is the one who watches Raw.\n\nfor some reason whenever he clicks on the raw watch live button the same error pops up saying \"this title is not available to watch instantly\" this only applies for raw and he can watch other movies just fine with no issues. If it's any help he is watching over the PS4 application\n\nSo is anyone else experiencing this issue?",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kl86wj/cant_watch_raw_live_stream_tonight_anyone_else/"
    },
    {
        "id": "1klcthc",
        "author": "Adorable_Fail_7974",
        "title": "Screen flickering on full screen mode",
        "content": "Whenever I try to watch something on my laptop and press full screen, the screen flickers and moves up and down. This literally only happens when I use netflix. Does this happen to anyone else and is there any way to fix it?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1klcthc/screen_flickering_on_full_screen_mode/"
    },
    {
        "id": "1klk67f",
        "author": "Dramatic_Pea4045",
        "title": "As podcast",
        "content": "Hello, I am writing this reddit post to get some series to listen to, yes I did say listen. For the little explanation, I like to put in the background when I clean and tidy up a video rather than music to listen to stories etc. Obviously I know the podcasts on Spotify but I did a little bit of a tour and I'm quite complicated to be satisfied lol. My favorite podcasts are \"sip and gossip\" (it's a french podcast) where you read anecdotes/stories and there are reactions I think it's really cool but there are no such masses. (PLUS I don't like true crimes, it seems there's only that)\n\nSo as an alternative I put on Netflix series and I listen but usually it's what I already know so I don't need to watch! I'm someone who watches the same series in a loop so it's easy but I want to again but I don't know where to go \n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1klk67f/as_podcast/"
    },
    {
        "id": "1kl405z",
        "author": "JackStraw388",
        "title": "Do we know who the next installment of the “Monster:” series will be about?",
        "content": "We’ve had Dahmer and the Menendez brothers. If Netflix’s decides to make another one I’m hoping for one about either John Wayne Gacy or Ted Bundy. I’d love to hear your thoughts.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kl405z/do_we_know_who_the_next_installment_of_the/"
    },
    {
        "id": "1kkrdbj",
        "author": "Robin__Throwaway",
        "title": "I Just Finished Watching Forever Y'all",
        "content": "&gt;! I'm not crying. You're crying!😩!&lt;\n\n&gt;!What did you guys think? I thought the show was well done. The relationship between Justin and Keisha was very endearing and tender when they were getting along.!&lt;\n\n&gt;!I know it was a realistic ending but with a name like forever I guess I was hoping my fairy tale happy ever after. Yes I know it's still happy in a sense but a bit bitter sweet. Do you think there we be another season?!&lt;\n\nAlways nice to see Wood Harris (Justin's dad). Overall I thought the acting was quite good.\n\nThoughts\n\nCovering my bases by covering everything with the spoiler cover. Wasn't sure if this should be tagged discussion or new on Netflix",
        "upvotes": 11,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1kkrdbj/i_just_finished_watching_forever_yall/"
    }
]