[
    {
        "id": "1o1cp2z",
        "author": "shiruken",
        "title": "The Nobel Prize in Chemistry 2025: Awarded to Susumu Kitagawa, Richard Robson, and Omar M. Yaghi \"for the development of metal-organic frameworks\"",
        "content": "The Nobel Prize in Chemistry 2025 was awarded to [Susumu Kitagawa](https://en.wikipedia.org/wiki/Susumu_Kitagawa), [Richard Robson](https://en.wikipedia.org/wiki/Richard_Robson_(chemist)), and [Omar M. Yaghi](https://en.wikipedia.org/wiki/Omar_M._Yaghi) \"for the development of metal-organic frameworks.\"\n\n* [Official Press Release](https://www.nobelprize.org/prizes/chemistry/2025/press-release/)\n* [Popular Information](https://www.nobelprize.org/prizes/chemistry/2025/popular-information/)\n* [Scientific Explanation of the Award](https://www.nobelprize.org/prizes/chemistry/2025/advanced-information/)\n* [Video of the Prize Announcement](https://www.youtube.com/watch?v=0d02ONEXWkc)\n\n&gt;Susumu Kitagawa, Richard Robson and Omar Yaghi are awarded the Nobel Prize in Chemistry 2025. They have developed a new form of molecular architecture. In their constructions, metal ions function as cornerstones that are linked by long organic (carbon-based) molecules. Together, the metal ions and molecules are organised to form crystals that contain large cavities. These porous materials are called metal–organic frameworks (MOF). By varying the building blocks used in the MOFs, chemists can design them to capture and store specific substances. MOFs can also drive chemical reactions or conduct electricity.\n\n&gt;“Metal–organic frameworks have enormous potential, bringing previously unforeseen opportunities for custom-made materials with new functions,” says Heiner Linke, Chair of the Nobel Committee for Chemistry.\n\n&gt;It all started in 1989, when Richard Robson tested utilising the inherent properties of atoms in a new way. He combined positively charged copper ions with a four-armed molecule; this had a chemical group that was attracted to copper ions at the end of each arm.\n\n&gt;When they were combined, they bonded to form a well-ordered, spacious crystal. It was like a diamond filled with innumerable cavities.\n\n&gt;Robson immediately recognised the potential of his molecular construction, but it was unstable and collapsed easily. However, Susumu Kitagawa and Omar Yaghi provided this building method with a firm foundation; between 1992 and 2003 they made, separately, a series of revolutionary discoveries. Kitagawa showed that gases can flow in and out of the constructions and predicted that MOFs could be made flexible. Yaghi created a very stable MOF and showed that it can be modified using rational design, giving it new and desirable properties.\n\n&gt;Following the laureates’ groundbreaking discoveries, chemists have built tens of thousands of different MOFs. Some of these may contribute to solving some of humankind’s greatest challenges, with applications that include separating PFAS from water, breaking down traces of pharmaceuticals in the environment, capturing carbon dioxide or harvesting water from desert air.",
        "upvotes": 318,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/po4f2DI5HsQ0ovq843rCJc4BklL2J1jHNqA9QpeP1Ug.jpeg?auto=webp&amp;s=6adf5958359418903698e14687385344af0faafe"
        },
        "permalink": "/r/science/comments/1o1cp2z/the_nobel_prize_in_chemistry_2025_awarded_to/"
    },
    {
        "id": "1o0hps8",
        "author": "shiruken",
        "title": "The Nobel Prize in Physics 2025: Awarded to John Clarke, Michel H. Devoret, and John M. Martinis \"for the discovery of macroscopic quantum mechanical tunnelling and energy quantisation in an electric circuit\"",
        "content": "The Nobel Prize in Physics 2025 was awarded to [John Clarke](https://en.wikipedia.org/wiki/John_Clarke_(physicist)), [Michel H. Devoret](https://en.wikipedia.org/wiki/Michel_Devoret), and [John M. Martinis](https://en.wikipedia.org/wiki/John_M._Martinis) **\"for the discovery of macroscopic quantum mechanical tunnelling and energy quantisation in an electric circuit.\"**\n\n* [Official Press Release](https://www.nobelprize.org/prizes/physics/2025/press-release/)\n* [Popular Information](https://www.nobelprize.org/prizes/physics/2025/popular-information/)\n* [Scientific Explanation of the Award](https://www.nobelprize.org/prizes/physics/2025/advanced-information/)\n* [Video of the Prize Announcement](https://www.youtube.com/watch?v=m9FUkAis62s)\n\n&gt;Quantum mechanics allows a particle to move straight through a barrier, using a process called tunnelling. As soon as large numbers of particles are involved, quantum mechanical effects usually become insignificant. The laureates’ experiments demonstrated that quantum mechanical properties can be made concrete on a macroscopic scale.\n\n&gt;In 1984 and 1985, **John Clarke**, **Michel H. Devoret** and **John M. Martinis** conducted a series of experiments with an electronic circuit built of superconductors, components that can conduct a current with no electrical resistance. In the circuit, the superconducting components were separated by a thin layer of non-conductive material, a setup known as a Josephson junction. By refining and measuring all the various properties of their circuit, they were able to control and explore the phenomena that arose when they passed a current through it. Together, the charged particles moving through the superconductor comprised a system that behaved as if they were a single particle that filled the entire circuit.\n\n&gt;This macroscopic particle-like system is initially in a state in which current flows without any voltage. The system is trapped in this state, as if behind a barrier that it cannot cross. In the experiment the system shows its quantum character by managing to escape the zero-voltage state through tunnelling. The system’s changed state is detected through the appearance of a voltage.\n\n&gt;The laureates could also demonstrate that the system behaves in the manner predicted by quantum mechanics – it is quantised, meaning that it only absorbs or emits specific amounts of energy.\n\n&gt;“It is wonderful to be able to celebrate the way that century-old quantum mechanics continually offers new surprises. It is also enormously useful, as quantum mechanics is the foundation of all digital technology,” says Olle Eriksson, Chair of the Nobel Committee for Physics.\n\n&gt;The transistors in computer microchips are one example of the established quantum technology that surrounds us. This year’s Nobel Prize in Physics has provided opportunities for developing the next generation of quantum technology, including quantum cryptography, quantum computers, and quantum sensors.",
        "upvotes": 368,
        "comments": 9,
        "media": null,
        "permalink": "/r/science/comments/1o0hps8/the_nobel_prize_in_physics_2025_awarded_to_john/"
    },
    {
        "id": "1o380ep",
        "author": "nohup_me",
        "title": "Soft drink consumption linked to major depressive disorder (MDD) diagnosis in women, in part due to changes in the gut microbiota: for each increase in daily soft drink intake, the odds of having MDD were about 8% higher",
        "content": "",
        "upvotes": 4505,
        "comments": 192,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vrqzVNJdvwf0Eb5O9tEP-JIrt0LvOs0OvfusWUWOWJc.png?auto=webp&amp;s=1946ae05b4f4fd942547c3e4ac52d4a27c287c6e"
        },
        "permalink": "/r/science/comments/1o380ep/soft_drink_consumption_linked_to_major_depressive/"
    },
    {
        "id": "1o2v0nj",
        "author": "mvea",
        "title": "A next-generation cancer vaccine has shown stunning results in mice, preventing up to 88% of aggressive cancers by harnessing nanoparticles that train the immune system to recognize and destroy tumor cells. It effectively prevented melanoma, pancreatic cancer and triple-negative breast cancer.",
        "content": "",
        "upvotes": 14905,
        "comments": 392,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Hy4z1H8ooxPtZ9X24UFL-104qSICnpOxZrnNe3PgX2A.jpeg?auto=webp&amp;s=39791e6e5e47c78e4b72ed0ada12f684933625a9"
        },
        "permalink": "/r/science/comments/1o2v0nj/a_nextgeneration_cancer_vaccine_has_shown/"
    },
    {
        "id": "1o3e6jk",
        "author": "mvea",
        "title": "Gaps in sex education can have lasting impacts in adulthood, including relationship struggles, lack of confidence, and reduced quality of life. 1/3 never had information on healthy relationships, consent, communicating with partners, pleasure, or dating in their youth from school, family or friends.",
        "content": "",
        "upvotes": 383,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/a-aL4bfZOgz-mug_hvhYCW95EOaHk66Lhj8v89vMt4w.png?auto=webp&amp;s=ff3ea4b07b92268a5622a8a86f0f8c898f97687e"
        },
        "permalink": "/r/science/comments/1o3e6jk/gaps_in_sex_education_can_have_lasting_impacts_in/"
    },
    {
        "id": "1o31qxr",
        "author": "chrisdh79",
        "title": "Moral absolutism explains support for bans better than conservative or liberal ideology | Research suggests that conservatives are more inclined to see morality as universal and absolute, while liberals tend to view it as relative and context-dependent.",
        "content": "",
        "upvotes": 1396,
        "comments": 182,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hXtvIyxuHDmv33DMiz6BtIQuAPMJKFW-xPRcl8e9fz0.jpeg?auto=webp&amp;s=bc98ca8c2fcd9176189be737ea8688edb0600791"
        },
        "permalink": "/r/science/comments/1o31qxr/moral_absolutism_explains_support_for_bans_better/"
    },
    {
        "id": "1o2xd35",
        "author": "chrisdh79",
        "title": "A healthy fatty acid in olive oil and nuts has been found to \"supercharge\" immune cells specialized to fight cancer in mice | Meanwhile, another kind of natural fatty acid undermines these cells and may diminish the body's ability to stave off tumor growth.",
        "content": "",
        "upvotes": 1762,
        "comments": 82,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dnUGJgwrqPJYam0JfSDIF6wpzMKWcYmMLIECviEwFrE.png?auto=webp&amp;s=786da6d26dc80d1c32c9839541d6d1c14ee769cf"
        },
        "permalink": "/r/science/comments/1o2xd35/a_healthy_fatty_acid_in_olive_oil_and_nuts_has/"
    },
    {
        "id": "1o37iah",
        "author": "ChallengeAdept8759",
        "title": "New AI tool can detect melanoma with 99% accuracy, outperforming existing models",
        "content": "",
        "upvotes": 471,
        "comments": 40,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Fsom7NGy119gANC8W6RQhUAqXckkcKG9TaRojLlafMQ.jpeg?auto=webp&amp;s=47bca53a9d839fec2f770f3516d57839a192d09c"
        },
        "permalink": "/r/science/comments/1o37iah/new_ai_tool_can_detect_melanoma_with_99_accuracy/"
    },
    {
        "id": "1o30a6g",
        "author": "noah2623",
        "title": "Dangerous ‘nitazene’ opioids are on the rise: researchers are worried",
        "content": "",
        "upvotes": 986,
        "comments": 224,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/CDJfq91t2a8W9FV-dByNqTD_hv700VglG9GUg-nxyQE.jpeg?auto=webp&amp;s=15a30e9316f79bfbca2b30b57a6610ff054cf2e8"
        },
        "permalink": "/r/science/comments/1o30a6g/dangerous_nitazene_opioids_are_on_the_rise/"
    },
    {
        "id": "1o36ubt",
        "author": "smurfyjenkins",
        "title": "Data on real estate prices in the US across 1890–2006 shows that real prices for rent have increased by 60% and real house prices have nearly quadrupled. Stringent land use and zoning regulations (e.g. bans on anything but single-family housing) are key contributing factors.",
        "content": "",
        "upvotes": 405,
        "comments": 35,
        "media": null,
        "permalink": "/r/science/comments/1o36ubt/data_on_real_estate_prices_in_the_us_across/"
    },
    {
        "id": "1o37ewy",
        "author": "Hashirama4AP",
        "title": "Association of Children’s screen time to academic achievement: according to an international study of more than 5000 kids, with each extra hour of screen time per day, as reported by parents, the children had about a 10% lower chance of high marks in standardized tests for mathematics and reading.",
        "content": "",
        "upvotes": 299,
        "comments": 30,
        "media": null,
        "permalink": "/r/science/comments/1o37ewy/association_of_childrens_screen_time_to_academic/"
    },
    {
        "id": "1o2w846",
        "author": "Wagamaga",
        "title": "A new study reveals that while we sleep, our brains quietly sort through the day’s experiences, keeping what we intend to remember and letting emotion-driven moments drift away.",
        "content": "",
        "upvotes": 889,
        "comments": 27,
        "media": null,
        "permalink": "/r/science/comments/1o2w846/a_new_study_reveals_that_while_we_sleep_our/"
    },
    {
        "id": "1o3763e",
        "author": "nohup_me",
        "title": "Newly discovered brain cells linked to uncertainty and decision making in the orbitofrontal cortex of rats could pave the way for treatments for anxiety and substance use disorders",
        "content": "",
        "upvotes": 157,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/UMdQ-wT-sGjDv9XuOOSn7QRnSgayY_JzAfkKeBMgtfY.jpeg?auto=webp&amp;s=72dc32e6be258cce541a4fc59f7c5581ccb427ea"
        },
        "permalink": "/r/science/comments/1o3763e/newly_discovered_brain_cells_linked_to/"
    },
    {
        "id": "1o3d2tt",
        "author": "J4Jc3",
        "title": "Homemaking improves mental health, but not for moms with small kids, study finds",
        "content": "",
        "upvotes": 74,
        "comments": 11,
        "media": null,
        "permalink": "/r/science/comments/1o3d2tt/homemaking_improves_mental_health_but_not_for/"
    },
    {
        "id": "1o2ic4c",
        "author": "mvea",
        "title": "Almost 55,000 preschool children in Gaza acutely malnourished, Lancet study estimates. Study shows clear link between Israeli aid restrictions and malnutrition among children aged between six months and five years.",
        "content": "",
        "upvotes": 5403,
        "comments": 421,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7C9_znJW_J_7C25aV9oNIVf0cEhEKwwl4Z52X_01pYw.jpeg?auto=webp&amp;s=4828247032f5e70e7235ee30d54c19059305b0c0"
        },
        "permalink": "/r/science/comments/1o2ic4c/almost_55000_preschool_children_in_gaza_acutely/"
    },
    {
        "id": "1o2tnj0",
        "author": "BrnoRegion",
        "title": "Bismuth, a cheap and biocompatible metal, has been proven to be a viable replacement for gold in plasmonic technologies, paving the way for more affordable biosensors and ultrathin optics",
        "content": "",
        "upvotes": 485,
        "comments": 8,
        "media": null,
        "permalink": "/r/science/comments/1o2tnj0/bismuth_a_cheap_and_biocompatible_metal_has_been/"
    },
    {
        "id": "1o36301",
        "author": "Dr_Neurol",
        "title": "Attachment anxiety, loneliness, and death anxiety in problematic social media use",
        "content": "",
        "upvotes": 58,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/x2LkJZIv4hvZuvnC4-TTeESTwbnAE_97zHLVYJNwEAg.jpeg?auto=webp&amp;s=270d464967f4fe7ca4ce4257e3916cf3316da252"
        },
        "permalink": "/r/science/comments/1o36301/attachment_anxiety_loneliness_and_death_anxiety/"
    },
    {
        "id": "1o345hf",
        "author": "Science_News",
        "title": "Researchers have generated muons using small particle accelerators driven by lasers",
        "content": "",
        "upvotes": 67,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aX4C5ql8BjKPSGVBbpFHel3wbY3pcXuG2uAwWgte2Bs.jpeg?auto=webp&amp;s=6a0bb76498d223423ac3d5c59fbaf390601e0b67"
        },
        "permalink": "/r/science/comments/1o345hf/researchers_have_generated_muons_using_small/"
    },
    {
        "id": "1o2sh7m",
        "author": "SupMyNameIsRichard",
        "title": "Doing almost anything is better with friends, research finds by analyzing how more than 40,000 participants felt during more than 100,000 instances when they were doing more than 80 activities.",
        "content": "",
        "upvotes": 403,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WQigB_NZcF9aVi_x4COB9v58Y95P4nFhMIdi6O4b7M8.jpeg?auto=webp&amp;s=8dd3ad6607bf3f7912893207455d857e9295685b"
        },
        "permalink": "/r/science/comments/1o2sh7m/doing_almost_anything_is_better_with_friends/"
    },
    {
        "id": "1o279wt",
        "author": "scientificamerican",
        "title": "Last season’s 2024–2025 mRNA COVID vaccines reduced people’s risk of emergency department visits by 29 percent, their risk of hospitalizations by 39 percent and their risk of death by 64 percent, according to a new study, published on Wednesday in the New England Journal of Medicine.",
        "content": "",
        "upvotes": 4542,
        "comments": 137,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bir4vhMHBz_uMb1FtHpT5bRlZ5UMieuXRScipShh9AM.jpeg?auto=webp&amp;s=eb7aa1208ecadf15ddc163b0b089f0b2fc85224e"
        },
        "permalink": "/r/science/comments/1o279wt/last_seasons_20242025_mrna_covid_vaccines_reduced/"
    },
    {
        "id": "1o3ih92",
        "author": "FunnyGamer97",
        "title": "Research gives insight into effect of neurodegenerative diseases on speech rhythm | Experiment finds speaking slowly helped those with neurodegenerative diseases be understood more than trying to speak clearly",
        "content": "",
        "upvotes": 5,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SkgPMc0BXN-_KU7nc07OJv2NEWCLt0rr9TbN0Qm_Caw.jpeg?auto=webp&amp;s=7a157e0b8f31a307c855825565ce08581e496fa6"
        },
        "permalink": "/r/science/comments/1o3ih92/research_gives_insight_into_effect_of/"
    },
    {
        "id": "1o2wkjp",
        "author": "Wagamaga",
        "title": "Short inspirational videos as effective as meditation at reducing stress. Findings suggest that strategically curated media, especially content that evokes hope, could be a practical, accessible tool for supporting stress relief, particularly during high-stress periods like the holiday season",
        "content": "",
        "upvotes": 71,
        "comments": 13,
        "media": null,
        "permalink": "/r/science/comments/1o2wkjp/short_inspirational_videos_as_effective_as/"
    },
    {
        "id": "1o2r7ct",
        "author": "calliope_kekule",
        "title": "A study in Estonia found two main kinds of vaccine-hesitant individuals: those distrusting mainstream medicine, and those who trust doctors but still doubt vaccines after poor public communication. Building trust, not blame, is key.",
        "content": "",
        "upvotes": 195,
        "comments": 24,
        "media": null,
        "permalink": "/r/science/comments/1o2r7ct/a_study_in_estonia_found_two_main_kinds_of/"
    },
    {
        "id": "1o22eyx",
        "author": "mvea",
        "title": "Political views, not sex and violence, now drive literary censorship. Progressives target books promoting racism, sexism and homophobia. The right attack books that promote diversity, or violate norms of cisgendered heterosexuality. The right through legislative action and the left use social media.",
        "content": "",
        "upvotes": 5638,
        "comments": 985,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/A6RBS7OivQDMaFsc4y5ufxD8Mmr47RUoh4qEers-IT4.jpeg?auto=webp&amp;s=59b4d15529e47c2aa147c5dd713449f59c59f4ee"
        },
        "permalink": "/r/science/comments/1o22eyx/political_views_not_sex_and_violence_now_drive/"
    },
    {
        "id": "1o232zv",
        "author": "chrisdh79",
        "title": "Green tea trains muscles to handle sugar better and boost metabolism | Mice receiving green tea had significantly improved glycemic control, suggesting that green tea boosts metabolic function.",
        "content": "",
        "upvotes": 3989,
        "comments": 154,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Qihh66CHwh_lIHW8bReSkJDBXizDtwMN1gTGGPRDdBI.jpeg?auto=webp&amp;s=a151c51e170246d683ecb7e0338488a1c27f7ac2"
        },
        "permalink": "/r/science/comments/1o232zv/green_tea_trains_muscles_to_handle_sugar_better/"
    },
    {
        "id": "1o31jaq",
        "author": "eduardpetiska1",
        "title": "New Study Challenges Link Between Sedentary Lifestyles and Age-Related Bone Weakening",
        "content": "",
        "upvotes": 26,
        "comments": 1,
        "media": null,
        "permalink": "/r/science/comments/1o31jaq/new_study_challenges_link_between_sedentary/"
    },
    {
        "id": "1o2zfp1",
        "author": "luxmoa",
        "title": "Analytical Review of Depression and Suicidality From Finasteride",
        "content": "",
        "upvotes": 34,
        "comments": 28,
        "media": null,
        "permalink": "/r/science/comments/1o2zfp1/analytical_review_of_depression_and_suicidality/"
    },
    {
        "id": "1o2uk0w",
        "author": "Shiny-Tie-126",
        "title": "Scientists capture an image of two black holes orbiting each other for the first time, the observation confirmed the existence of black hole pairs",
        "content": "",
        "upvotes": 65,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/DE3IEg9K_GGIIyOsZPO-QgXhsu5uae1Fyq1I8_zNEr4.jpeg?auto=webp&amp;s=f4d5b6450499141676c434aca0f6d792c32af877"
        },
        "permalink": "/r/science/comments/1o2uk0w/scientists_capture_an_image_of_two_black_holes/"
    },
    {
        "id": "1o32x1m",
        "author": "Euphoric_Regular5292",
        "title": "Application of edaravone-loaded nanogel in alleviating behavioral deficits and oxidative stress in schizophrenia rat model - Scientific Reports",
        "content": "",
        "upvotes": 17,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xUK7lWZ7T_gQcviJRNtZ1YNpp_Mcx7IH0srhpi3pmic.png?auto=webp&amp;s=ea03ab53a975ebba89fdc1f725b6038bc947b3e8"
        },
        "permalink": "/r/science/comments/1o32x1m/application_of_edaravoneloaded_nanogel_in/"
    },
    {
        "id": "1o2bl5p",
        "author": "nohup_me",
        "title": "Study links high school subject choice to future political preferences: humanities lean towards liberal and left-wing party support, while business and technical subjects incline towards right-wing support",
        "content": "",
        "upvotes": 852,
        "comments": 167,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/a-67dmvR3tUn7pa9KgV7YvevEh5IcbEMwM09tYbi0gU.jpeg?auto=webp&amp;s=d602377ddf13bc63336cc887a3dd8e0f3ef0541b"
        },
        "permalink": "/r/science/comments/1o2bl5p/study_links_high_school_subject_choice_to_future/"
    }
]