[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 12,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 195,
        "comments": 720,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1o49rdr",
        "author": "SerialSeriesQueen",
        "title": "Does Ryan Murphy hate women?",
        "content": "I finished Ed Gein the other day and the longer I sit on it, the more I realize just how much I hated it. Charlie Hunnam and Laurie Metcalf's performances were great but what really grinds my gears are the portrayals of the actual known murder victims. I get writers take artistic liberties for entertainment but what they came up with was just so perverse. Mary Hogan was a former madam in Chicago? Bernice was a desperate old kinky cougar looking for a sugar baby? Was this to make us feel less sorry for them? Like maybe they deserved it bc they weren't \"virtuous\"? There's very little background online about either of the victims, at least nothing I could find, so I cant understand why they made these choices for these women? The only thing I could come up with was Ryan Murphy really doesn't like women.",
        "upvotes": 55,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1o49rdr/does_ryan_murphy_hate_women/"
    },
    {
        "id": "1o4ffyl",
        "author": "YnotThrowAway7",
        "title": "I wish this many people had discovered Animal Kingdom years ago. I think it could have been up there with some of the biggest shows.",
        "content": "I know this show apparently did well on cable but I had genuinely never heard of it until this year. Although season 1 was good I feel once it really hits its stride it is right up there in my top 10 shows easily. It also had one of the best characters on TV period in Pope and I didn’t expect to be emotional by the end but damn I was more emotional than the final season of Breaking Bad. I’m so glad it’s getting a resurgence of viewers since coming to Netflix but I can’t help but wish it had been the type of phenomenon everyone was talking about while it was airing.",
        "upvotes": 22,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1o4ffyl/i_wish_this_many_people_had_discovered_animal/"
    },
    {
        "id": "1o3ra72",
        "author": "GlitteringAd6571",
        "title": "Victoria Beckham victimization",
        "content": "This girl grew up in a wealthy family and went to school in a Rolls Royce. Even if she wasn't such a great singer and dancer, she became part of the most successful girl bands in the 90s (i don't recall her singing very much in that band anyway).\nIn her 20s she met one of the most talented and considered sexy football player in the world. She married him, she has 4 beautiful children and she maintained her silhouette (I know her eating problems, but she's lucky to have a good health and not being affected by a hormonal problem, as many women are going through). She has the life and the opportunities that 99% of the planet couldn't even dream of. She is still very rich and she can pursue her passion, the fashion-she is very talented in this to be fair.\n\nI watched the documentary. It looks like she is not aware of none of these things. ",
        "upvotes": 510,
        "comments": 156,
        "media": null,
        "permalink": "/r/netflix/comments/1o3ra72/victoria_beckham_victimization/"
    },
    {
        "id": "1o4k0a7",
        "author": "Active_Rutabaga_4089",
        "title": "Inspired into action by TV show or film?",
        "content": "I’m a journalist with Vox media and I’m currently looking for stories of people inspired into action by a TV show or Film. Did you change job, move house, take up a new hobby or rediscover something after watching something on screen? I’d love to hear about it. Thanks so much ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o4k0a7/inspired_into_action_by_tv_show_or_film/"
    },
    {
        "id": "1o4gbe9",
        "author": "Connect_Serve2248",
        "title": "The Longest Yard Audio Issue",
        "content": "Popped on Adam Sandler's \"The Longest Yard\" on my PC and noticed the dialouge only comes through the right headphone. At first I thought it was my computer or my headphones, but after checking other movies on Netflix I found that the problem was only for The Longest Yard. Music and ambience plays thru the left headphone mainly with some bleed thru on the right headphone but the right headphone is only dialouge. Is this how the movie's audio actually plays? Anyone got a DVD or blu-ray copy to cross reference and could someone with headphones confirm that I'm not crazy in hearing this🤣\n\nFirst time I've ran into something like this with a movie...",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o4gbe9/the_longest_yard_audio_issue/"
    },
    {
        "id": "1o4j3rx",
        "author": "sammisshhh",
        "title": "Just discovered my dream roles - and I want to build something that gets Netflix’s attention!",
        "content": "Hey everyone!  \nI’ll be graduating with my **BBA in 2026**, and over the past couple of years, I’ve done several internships in **marketing, research, and HR**. Through all that, I recently discovered what I *truly love* \\- the idea of becoming a **Creative Director**, **Brand Strategist**, or **Innovation Consultant** someday.\n\nNetflix has such fascinating positions in **Content Creation and Acquisition**, and I even read their article on work culture (beautifully written, by the way!). It made me realize - *this is where I want to be.*\n\nNow, I want to create something unique to catch their team’s attention - maybe a **portfolio or concept project** that reflects Netflix’s creative energy. I’m also planning to **cold email** them, but before that, I’d love some advice:\n\n* What should I include in my portfolio to stand out for creative/branding roles?\n* Any tips on how to write a great cold email that actually gets noticed?\n\nWould really appreciate your insights or experiences!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o4j3rx/just_discovered_my_dream_roles_and_i_want_to/"
    },
    {
        "id": "1o4ihji",
        "author": "LatteMermaid",
        "title": "Red flags or underrated masterpiece?",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o4ihji/red_flags_or_underrated_masterpiece/"
    },
    {
        "id": "1o4ifoo",
        "author": "Hot-Manufacturer7619",
        "title": "If its not available why recommend it?",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o4ifoo/if_its_not_available_why_recommend_it/"
    },
    {
        "id": "1o3kxpv",
        "author": "nerfherder1620",
        "title": "Ed Gein Story is heinous",
        "content": "Is it no longer considered bad taste to make shows about murderers that almost exploits the suffering of others through glamorization? It is one of the most tasteless and disgusting shows I've ever seen. There are better ways to make an impact without having to watch 10 scenes of a dead bodies getting f***** and 600 people getting grotesquely murdered with every brutalized second on display.\n\nEdit: I have no problem with violence or gore in film, TV, video games etc. However, if im gonna have to watch some guy fuck a dead body for the love of the game every 10 seconds, the plot better be good and add something interesting to the conversation. If not, im not interested in some murder porn fantasy that isnt made in good faith to the people who actually suffered that freak. But, I shouldn't expect anything more from the company that also released catering to pedos.",
        "upvotes": 154,
        "comments": 88,
        "media": null,
        "permalink": "/r/netflix/comments/1o3kxpv/ed_gein_story_is_heinous/"
    },
    {
        "id": "1o4h4jr",
        "author": "cluelesslancelot",
        "title": "Where did all the anime go",
        "content": "I checked my Netflix (UK) and I swear there was way more anime on here and now it's all just gone. Like all the ones I was interested in and wishlisted aren't there anymore. Demon Slayer, Hajime no Ippo, I think Jujustu Kaisen was on there, pretty sure Frieren was on there but I already watched that on Netflix I'm so sure. Where'd it go???? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o4h4jr/where_did_all_the_anime_go/"
    },
    {
        "id": "1o43z19",
        "author": "LadyCauliflower",
        "title": "A Rollercoaster of Emotions with Monster: Ed Gein (I actually liked it — and here’s why)",
        "content": "After the second episode, I started to doubt how accurate the show would really be (I hadn’t read any spoilers, but I knew a lot about the real case). At first, I was honestly annoyed by the whole Adelaine storyline —his supposed girlfriend and accomplice— and the murders of victims that were never actually proven to be his. Even the depiction of the *real* victims wasn’t that precise (Bernice’s death scene was… embarrassing, omg).\n\nBut around episode six or seven, I started to *get it*. It finally clicked that everything we’d seen before was meant to show what it’s like to be **inside Ed Gein’s head**: confusing, hyper-sexualized, disturbing, and suffocating. What’s real? What’s a lie?\n\nThe scenes that directly referenced horror films —like the chainsaw one and the babysitter Evelyn (clearly nodding to *The Texas Chainsaw Massacre*)— added a clever extra layer. They reminded us that we’re not only trapped in Ed’s confusion, but also in **Hollywood’s own distortion** of reality through the “creativity” of its horror movies inspired by killers like him.\n\nFor me, the turning point —and the reason I ended up really appreciating the show— was the final stretch. It hits you with a cold dose of reality, showing the heartbreaking truth about mental illness and how it gets minimized and worsened in a violent, repressive family or social environment.\n\nPsychiatric disorders are not only hard for others to understand —they’re also hard for the person living with them. And the way the show portrayed his schizophrenia diagnosis (wow) felt incredibly authentic. The imaginary communication with Ilse and Christine Jorgensen —with them saying things that were actually coming from his doctor and his own mind— was such a genuine representation of a brain desperately looking for answers but simply not working right. It truly felt like a drowning man reaching for anything to hold on to.\n\nMaybe we all expected it to follow the same style as *Dahmer*, but the fact that this one actually makes you **think** (and even research what was real and what wasn’t, instead of just buying whatever a show tells you) really impressed me. I’d even say it’s more suited for *true crime* and horror fans —the kind of viewers who can catch those deeper layers more easily.",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o43z19/a_rollercoaster_of_emotions_with_monster_ed_gein/"
    },
    {
        "id": "1o3tfcx",
        "author": "photoshop_2023",
        "title": "The Diplomat: Season 3",
        "content": "Is anyone else looking forward to The Diplomat: Season 3? The ending from season 2 was a real surprise and i wasn't expecting it. What do you think will happen this season?",
        "upvotes": 25,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1o3tfcx/the_diplomat_season_3/"
    },
    {
        "id": "1o3iw2x",
        "author": "i_am_weesel",
        "title": "Disappointed in Netflix",
        "content": "Firstly, I’ve been a customer since the beginning and I have tremendous brand loyalty to Netflix, which will be a topic here.\n\nFor the last two-three years everyone I open the Netflix app on my TV all i feel is disappointment. I can never seem to find anything I want to watch or am interested in. Idk when it started but there was a time when basically every Netflix original I don’t dare to watch because I already know it’s going to let me down (except the Monster series like it ok.)\n\nI got a pretzel in my head due to simultaneously knowing that i should cancel and that i do have an attachment to the brand. Getting all the newest movies in the mail for me and the gang to watch was epic and being able to stream on my Xbox was epic in its own right. Does anybody feel similar?\n\nEdit: there has been some straight fire that I loved like All Quiet on the Western Front, Stranger Things, Haunting of Hill House/Bly Manor and others. It’s not all bad and i’m for sure not shitting on netflix",
        "upvotes": 160,
        "comments": 137,
        "media": null,
        "permalink": "/r/netflix/comments/1o3iw2x/disappointed_in_netflix/"
    },
    {
        "id": "1o46rpi",
        "author": "Present-Treacle2755",
        "title": "Boots (Netflix) – Thoughts on LGBT representation and overall tone [No Spoilers]",
        "content": "Hey everyone, I just finished watching Boots on Netflix and wanted to share some thoughts.\n\nWhat really stood out to me was how the show treats LGBT characters in a natural, realistic way. Unlike series like Heartstopper, it’s not overly sweet or romanticized  it has humor and light moments, but it doesn’t sugarcoat everything. The LGBT aspect feels like one part of the characters’ lives rather than the sole focus, and, at least from my perspective, it avoids stereotypes.\n\nI’m curious to hear what others think about this approach. Did you notice how the show handles LGBT representation without making it the only focus? Did this affect how you connected to the characters and the story? Personally, I found this more realistic style refreshing compared to more “feel-good” shows, and I’d love to know if others felt the same. Were there particular moments that felt especially natural or well-balanced to you?\n\nLooking forward to reading your thoughts and hearing how others experienced the series!\n",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o46rpi/boots_netflix_thoughts_on_lgbt_representation_and/"
    },
    {
        "id": "1o4fty3",
        "author": "Atlast_2091",
        "title": "Jurassic World Chaos Theory | Season 4 Trailer | Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o4fty3/jurassic_world_chaos_theory_season_4_trailer/"
    },
    {
        "id": "1o3heyb",
        "author": "FG_Hydro",
        "title": "My Father the BTK Killer",
        "content": "Does anyone else strongly dislike Kerri Rawson? People are saying about how brave she is, the trauma, and the PTSD. The whole show just showed me how self centered and how everything is about her. She’s capitalizing off her dad. She brags about writing a bestseller, then posts a gofundme for herself, then does a Netflix special, also she gets paid for all her interviews. If she cared for anyone else portions would’ve gone to the actual victims of her father. The truth of the matter is her dad was actually a pretty good dad to her to the point nobody believed he was a killer.  He was a horrible person, I’m not downplaying that it had to be traumatic in some way. But the entitlement and woe is me is just so irritating every single scene was all herself. The victims barely got any attention. ",
        "upvotes": 120,
        "comments": 259,
        "media": null,
        "permalink": "/r/netflix/comments/1o3heyb/my_father_the_btk_killer/"
    },
    {
        "id": "1o4cr6m",
        "author": "Successful-Mode-1727",
        "title": "Question about the Household limits",
        "content": "So my parents and I have been using the same Netflix account since Netflix was first released. We have consistently lived together (I’m 21), but in the last 2 years we have sort of split out. I’ll explain. We live in a very cramped house and my dad started renting an apartment across the road, and all three of us spent time over there. Sometimes just my parents, sometimes just me, sometimes one of them, sometimes all three of us. It was like an extension to our house and literally 50 metres away or so. This was before the Household Restrictions really came about so we never had issues. \n\nPost Netflix introducing the Household Restrictions, my mother and I bought an apartment about 50 metres from my family home in the other direction. Like the last place, all three of us come and go from this apartment. All three of us use the TV interchangeably. But the Household Restrictions are really screwing it now. It will disable at either our house or at the apartment semi constantly. Every single time we try and use it, no matter which house we’re using it from, we have trouble getting into it. My dad is the only one with access to the email and if either my mother or i want to use the account, and hes busy, at work, or asleep, we simply can’t access Netflix at all. \n\nIs there any way to get around this? Is it worth emailing Netflix customer service and explaining this? Can they do anything? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o4cr6m/question_about_the_household_limits/"
    },
    {
        "id": "1o3lkie",
        "author": "Bright-Ordinary-6829",
        "title": "My Father The BTK Killer",
        "content": "Did anyone else get really pissed off at that one off clip of the neighbor saying the crew had no respect for anyone’s privacy and that Kerri didn’t have to live with the horrors every day like she did?\n\nWe never saw her face, never learned the address, and yet she’s somehow still claiming that she had worse trauma (as a neighbor of a demolished house) than the daughter who’s still sorting through the trauma and still present death threats. ",
        "upvotes": 55,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1o3lkie/my_father_the_btk_killer/"
    },
    {
        "id": "1o44i2z",
        "author": "Smashers086",
        "title": "Gold standard true crime on Netflix - my fave 3 pics",
        "content": "I think Netflix has done some amazing true crime over the years (my absolute favourite genre) and here are my 3 faves - let me know which ones you love. \n\n1) Into the fire - the search for the lost daughter - a totally underrated gem, the biological mother was an incredible woman and the story is twisty, tragic and also pretty fast paced. Can be binged in one evening. The plot just gets more wild and sad and baffling. \n\n2) The Keepers - just incredibly good - the women in the show who never gave up were inspiring and the editing etc is sooo good. I’ve re-watched easily around 4 times. Absolutely love it. \n\n3) Tell me who I am - a haunting and chilling documentary about twin brothers and their vastly different recollections of what it was like growing up in an upper class family in England within an abusive family unit. The one brother had an accident and had complete memory loss, the other was burdened with a complete memory of their childhood \n\n",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o44i2z/gold_standard_true_crime_on_netflix_my_fave_3_pics/"
    },
    {
        "id": "1o4ge2c",
        "author": "Accomplished_Mode639",
        "title": "ed not a monster",
        "content": "I was watching the series in chapter 2 and there is a scene of the psychosis director spying on some girls through a hole and in conjunction with the murderer, I did not understand the scene to which he refers.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o4ge2c/ed_not_a_monster/"
    },
    {
        "id": "1o3msls",
        "author": "RealisticDiscipline7",
        "title": "The woman in cabin 10 discussion.",
        "content": "I enjoyed this movie so I want to discuss anything and everything ppl found interesting. \n\nIll start with one aspect that gave me a thrill:\n\nWhen it’s revealed that the real Anne went overboard and the one we’ve been watching is a fake, I thought “let me guess, the same actor plays both characters and we’re supposed to accept they found someone who looks identical to be an imposter? That’s lame.” \n\nThen they show the night Anne was killed and we clearly see there are two different actors depicting that moment. So my next thought was…”oh, and none of the passengers notice it’s not the same person??” So I rewound the movie to make sure they didnt cheat by using imposter Anne the whole time, to trick us, and only using two separate actors when they’re depicted in the same room together. They didnt cheat! That’s what was so neat, I didnt notice the swap either. Never crossed my mind. ",
        "upvotes": 24,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1o3msls/the_woman_in_cabin_10_discussion/"
    },
    {
        "id": "1o47ajb",
        "author": "Rudransh25",
        "title": "Question regarding fps",
        "content": "Bought Netflix yesterday but i noticed that i am unable to watch content in 60fps on mobile, pc but on tv it does. Is there a way to fix it?\n\nAnd yes i watched the same thing on all devices to verify.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o47ajb/question_regarding_fps/"
    },
    {
        "id": "1o46n7b",
        "author": "Lofi-yyk",
        "title": "Any tv shows that have similar concepts as Animated show exception ?",
        "content": "Are any show similar to this show?\nMusic really good.\n\nContext: a advanced spaceship made by ai sent before the colonyship in cryosleep arriving to planet.  so this spaceship can print humans with their memories of the original.\n\n Because human can't go hyperspace so they have clone people to do task of terraforming planet with help of advanced spaceship. After solar flare their misprint with one clones. Their race against time find where misprint has escaped and what happing to spaceship and\nTheir journey terraform planet cool twist.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o46n7b/any_tv_shows_that_have_similar_concepts_as/"
    },
    {
        "id": "1o3jn5l",
        "author": "prettylittlemurders",
        "title": "The Woman in Cabin 10 - the movie is good, but misses major points of the book",
        "content": "!!!Spoilers for both book and movie!!!\n\nI'm a huge fan of the book. If was one of the first that got me into the mystery/thriller genre.\n\nOverall, the movie was pretty good. I think that I would've enjoyed it way more if I hadn't read the book beforehand. The changes to the plot really bugged me😅\n\n1. Lo's arc is completely different but I find her more likeable in the movie.\n2. I think the movie should've included the home invasion and Lo's inability to cope with it. In the book, Lo gets drunk the evening before witnessing the body being thrown overboard, which is a major reason why people don't believe her. She's implied to be in a mostly sober state in the movie, which makes the gaslighting from Bullmer and the crew much more obvious.\n3. The movie completely changes Carrie's character. The movie makes her very innocent and fragile. In the book, she's a very morally grey character - she's much more in on Bullmer's plan and is harsher with Lo. I liked her character way more in the book and felt like her personality was much more interesting.\n4. However, something that the movie did perfectly was capturing the unsettling, too-flawless, cold vibes of the boat. The scenery was gorgeous. They did a great job with the aesthetics.\n5. Didn't love the ending change. I would've kept the original ending of the book but didn't leave it as open ended.\n6. The evil doctor felt like an unnecessary character.\n7. I did love how the movie really humanized Anne.\n\nAnyways, that's my review :)\n",
        "upvotes": 31,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1o3jn5l/the_woman_in_cabin_10_the_movie_is_good_but/"
    },
    {
        "id": "1o3qlur",
        "author": "daily_apprehensive",
        "title": "My Father the BTK Killer",
        "content": "First of all, kudos to Kerri Rawson for her attempt to decently navigate an impossible situation. It’s a reminder that oftentimes the family are victims too. I respect how she tried to come to terms with her experience honestly and with awareness. \n\nThat out of the way, I still cannot get over the neighbor of BTK’s family lot having the nerve to say “She doesn’t have to live with this every day!” when griping about Kerri and the crew’s visit to get footage. It seems like if anyone had the right to return, it would be the people who lived in that house. She’s not a gawker, she’s a living victim of her father’s insanity. \n\nSeriously? SERIOUSLY? I’m trying to give the person the grace of she probably specifically means the cars driving by because the idea that she doesn’t live with who her dad is every day is just ridiculous. \n\nThat was all I had to say, thanks for coming to my Ted talk 😂",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o3qlur/my_father_the_btk_killer/"
    },
    {
        "id": "1o3gun4",
        "author": "RoxieMatthews",
        "title": "Boots - SUCH a good show I want more!!",
        "content": "Okay this was one of the best shows I’ve watched on nextflix recently!! Each and every character just touched my heart. I was not expecting the depth of emotion. \n\nWhat I love most is how it beautifully portrays how masculinity can still have softness. \n\nI love how beneath the tough exteriors and anger, all the characters have a kindness, depth and realness. You see that we’re all human - we feel, grieve, and love in our own ways. Our backstories, traumas, and insecurities may differ, but kindness exists in all of us. \n\nI just loved it so much!! I want more ",
        "upvotes": 31,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1o3gun4/boots_such_a_good_show_i_want_more/"
    },
    {
        "id": "1o3hmv9",
        "author": "camwtss",
        "title": "im only half-way through Ed Gein, and although im enjoying it, i struggle to understand how some people are empathizing with him?",
        "content": "like hello? he murdered the babysitter for \"taking his job\", a job that he utterly failed at. how's it in any way her fault? \n\nhe murdered the bartender for no reason at all\n\nhe murdered that poor blonde woman. so what if she was the \"town pump\"? he could've rejected her advances. idk if she had an STD or not, but i'd much rather take her word for it versus the dead mothers. or better yet, just get tested before resorting to homicide?? she was open-minded with him cross dressing, gifted him lingerie, even invited him to move in, and thats how he repays her?\n\noh, and the chainsaw scene. cringe. like seriously how are people feeling bad for him? he found great pleasure in inflicting harm/discomfort onto others. mental illness or not, he still knew right from wrong. there wasn't a single instance where he was even remotely justified in his actions.\n\n(and yes, im aware that much of the show is fictitious. im mainly referring to the character, not the real-life Ed Gein)",
        "upvotes": 26,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1o3hmv9/im_only_halfway_through_ed_gein_and_although_im/"
    },
    {
        "id": "1o3kt4c",
        "author": "the-nomad-thinker",
        "title": "Netflix put my list at the very bottom",
        "content": "Today, I wanted to watch some shows, so I turned Netflix on, as I always do. But when I got on, my list was nowhere to be found! I continue watching was three rows down, but I had to scroll all the way to the bottom to find my list. I was so disgusted that I quit and turned on YouTube instead.\n\nWhy would they do this? It feels asinine for the sake of being asinine. Am I alone in this?",
        "upvotes": 11,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1o3kt4c/netflix_put_my_list_at_the_very_bottom/"
    }
]