[
    {
        "id": "1gwj4n3",
        "author": "ThePianoLessonAMA",
        "title": "Hi, /r/movies! I am Malcolm Washington, director and co-writer of 'THE PIANO LESSON', starring Samuel L. Jackson, John David Washington &amp; Danielle Deadwyler. It will be released on Netflix tomorrow— Ask me anything!",
        "content": "",
        "upvotes": 200,
        "comments": 80,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ggeqp7uu5a2e1.jpeg?auto=webp&amp;s=9268aa985f3b12b6467a944b05f5a56dd9daca98"
        },
        "permalink": "/r/movies/comments/1gwj4n3/hi_rmovies_i_am_malcolm_washington_director_and/"
    },
    {
        "id": "1h0uf7h",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Gladiator II / Wicked: Part I / Moana 2)",
        "content": "[Gladiator II](https://old.reddit.com/r/movies/comments/1gwxxwd/official_discussion_gladiator_ii_spoilers/?)\n\n[Wicked: Part I](https://old.reddit.com/r/movies/comments/1gwxxy1/official_discussion_wicked_part_i_spoilers/?)\n\n[Moana 2](https://old.reddit.com/r/movies/comments/1h0uevk/official_discussion_moana_2_spoilers/?)",
        "upvotes": 57,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1h0uf7h/official_discussion_megathread_gladiator_ii/"
    },
    {
        "id": "1h3owte",
        "author": "indiewire",
        "title": "Cannes: 17 Unsimulated Sex Scenes in the Festival's History",
        "content": "",
        "upvotes": 4581,
        "comments": 550,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/klhSSzn9TFAttOFbgAdQifduNyaRMdsHu6zBIsqyXy4.jpg?auto=webp&amp;s=a68a320fc8faeb2986a0f53760b14a04c8901ebf"
        },
        "permalink": "/r/movies/comments/1h3owte/cannes_17_unsimulated_sex_scenes_in_the_festivals/"
    },
    {
        "id": "1h3fv4e",
        "author": "LosIsosceles",
        "title": "\"Hundreds of Beavers\" review: This bizarre movie about beavers is a clarion call for human creativity in the age of AI",
        "content": "Reposting with movie title in the header. ",
        "upvotes": 3695,
        "comments": 239,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ZSMVMENVMcY80gwE889Ogj75YPogDrbzeCVt8I5WJNA.jpg?auto=webp&amp;s=06ed4251d6c7d6ed2938f3b80e59b9ad9aa66146"
        },
        "permalink": "/r/movies/comments/1h3fv4e/hundreds_of_beavers_review_this_bizarre_movie/"
    },
    {
        "id": "1h3phtg",
        "author": "dvsinla",
        "title": "Saw Moonraker last night first time and in a theater. What a ridiculous fun movie. Anyone else a fan?",
        "content": "Saw it last night at  midnight screening in a really great palace theater in LA called the Vista owned by Tarantino so it was an original 35mm print. He only screens movies on film. A bit faded and a few cuts but I love that stuff. \n\nA few things I know of the Roger Moore bond movies is that they were a little sillier and they had the best songs... and I tend to like them a lot.  \n\n* Moonraker was the only one I never saw and wow it's so crazy like one silly crazy set piece after another with nothing much in between. \n* The jaws guy was hilarious. \n* Bond hits on women so fast in this one it's a little odd even for him.\n* Holly Goodhead... great name.\n* The space station stuff so great with the laser blasts totally going for a star wars thing. \n* The villain keeps trying to kill bond in the most ridiculous elaborate ways instead of just shooting him in the head. \n* Feels like Austin Powers got a ton of their gags from this movie.\n\nLoved it.  Though I suspect people who like a more serious bond are not fans? ",
        "upvotes": 257,
        "comments": 139,
        "media": null,
        "permalink": "/r/movies/comments/1h3phtg/saw_moonraker_last_night_first_time_and_in_a/"
    },
    {
        "id": "1h3nwpo",
        "author": "KillerCroc1234567",
        "title": "Jeff Nichols Reveals He Is Writing New Original Script Alongside Cormac McCarthy Adaptations",
        "content": "",
        "upvotes": 289,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rklGyTd6sjkMN1--kXzDd0rz3Cy_Z3zhi_E8UeBOTJE.jpg?auto=webp&amp;s=13c0282ba9739ec6ba459444ed9f3c87f7ef0ecb"
        },
        "permalink": "/r/movies/comments/1h3nwpo/jeff_nichols_reveals_he_is_writing_new_original/"
    },
    {
        "id": "1h3v4gk",
        "author": "Browns_Bucks78",
        "title": "What Silly/Stupid movie just gets you",
        "content": "For some reason The Eurovision Song Contest just gets me in the feels every time when she starts singing My Hometown.  The rest of the movie is fine but for some reason that part always gives me goosebumps and brings tears to me eyes and I can't explain it. There are many more obvious tear jeans jersey type movies out there so what silly/stupid movie just gets you for some reason?",
        "upvotes": 93,
        "comments": 168,
        "media": null,
        "permalink": "/r/movies/comments/1h3v4gk/what_sillystupid_movie_just_gets_you/"
    },
    {
        "id": "1h3m2s4",
        "author": "BunyipPouch",
        "title": "First Poster for Comedy 'Heavier Trip' - Metal band Impaled Rektum breaks out of prison to perform at a major festival and save their guitarist's home, facing obstacles from police and a record exec.",
        "content": "",
        "upvotes": 342,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0ld4xtmdq34e1.jpeg?auto=webp&amp;s=62297253a741ce1351e0d77c6dbdabc0c1b33e1f"
        },
        "permalink": "/r/movies/comments/1h3m2s4/first_poster_for_comedy_heavier_trip_metal_band/"
    },
    {
        "id": "1h3j1gv",
        "author": "HeyAriAxyss",
        "title": "What did you think of Big Trouble in Little China (1986)?",
        "content": "I just finished watching Big Trouble in Little China for the first time! I hit 'Play' and went into it pretty much completely blind with no context - and what a ride LOL!\n\nWas a fun watch - had some good laughs and funny WTF moments. It had a fun amount of absurd and cheesy moments as well 😆 I really respect the amount of creativity that went into the writing and set design, and fun characters too!\n\nWhat were your thoughts on the movie when first seeing it? 🙂 Keen to hear, and thanks for reading!\n\nUpdate: WOAH, over 100+ comments in just over an hour! Love it and thanks again for sharing the enthusiasm guys lol! 😆😄👌\n\n  \nUpdate: Wow, almost 250 comments! Let's go!! 😆 haha",
        "upvotes": 469,
        "comments": 369,
        "media": null,
        "permalink": "/r/movies/comments/1h3j1gv/what_did_you_think_of_big_trouble_in_little_china/"
    },
    {
        "id": "1h3dn4i",
        "author": "Rebel_bass",
        "title": "I had no idea that Kevin Smith and Scott Mosier produced Good Will Hunting ",
        "content": "Digging deep this weekend for good movies that I haven't seen for a while, saw their names pop up in the opening credits. No wonder Affleck and Damon are still showing up for Smith all these decades later. \n\nAny other Hollywood connections like this you guys can think of, where relations spanning so many years have shaped the face of cinema?",
        "upvotes": 686,
        "comments": 139,
        "media": null,
        "permalink": "/r/movies/comments/1h3dn4i/i_had_no_idea_that_kevin_smith_and_scott_mosier/"
    },
    {
        "id": "1h3wdub",
        "author": "starbycrit",
        "title": "Watching The Sound of Music all the way thru instead as an adult ",
        "content": "Not even halfway thru and I was sobbing. This movie is so beautiful. It is literally perfect. It ebbs and flows with happiness and the bittersweet human experience and optimism + building connection with children in such a wholesome way. Really soothing to my inner child. This is the kind of movie that can be played while sleeping or cooking or on a movie night when it’s like a slumber party or smth. This is just the best most wholesome and artistically lovely movie everrrrrrrr\n\nETA: I see now why Julie Andrews made it to like Superstar Status after this movie. This is like a cinematic gem. If we could leave movies behind from earth, like 10 movies from each category, this would be up there with Forrest Gump &amp; The Wizard Of Oz for wholesome, nostalgic artistic masterpieces fr",
        "upvotes": 42,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1h3wdub/watching_the_sound_of_music_all_the_way_thru/"
    },
    {
        "id": "1h3f28t",
        "author": "Odd_Advance_6438",
        "title": "I loved the little things in the Substance that makes Dennis Quaid’s character extra gross.",
        "content": "Specifically the way he ate the shrimp and the fact that he never washes his hands.\n\nPretty great performance relative to how little screentime he has. He plays an incredibly sleazy, misogynistic, douchey tv show executive. However, I like the less crazy things about him that add to what a creep he is. The way he eats the shrimp was pretty gross, which is impressive in a movie that’s full of so many disgusting moments. I didn’t even notice the bathroom thing until someone pointed it out, but it really emphasizes how dirty he is both figuratively and literally",
        "upvotes": 505,
        "comments": 100,
        "media": null,
        "permalink": "/r/movies/comments/1h3f28t/i_loved_the_little_things_in_the_substance_that/"
    },
    {
        "id": "1h3l4ct",
        "author": "kanna172014",
        "title": "Movies during the 70s-80s weren't very optimistic for the future",
        "content": "You have all kinds of movies like Logan's Run, Soylent Green, Blade Runner, Escape from New York, The Running Man and Robocop, all set in dystopian hell-holes. New York City especially got it bad. It was so bad that movies back then thought it would eventually become little more than a prison city as shown in Escape From New York. I wonder what the writers and producers/directors would think if they got a glimpse of what cities like New York are like now?",
        "upvotes": 201,
        "comments": 182,
        "media": null,
        "permalink": "/r/movies/comments/1h3l4ct/movies_during_the_70s80s_werent_very_optimistic/"
    },
    {
        "id": "1h3bchy",
        "author": "aucunautrefeu",
        "title": "Which movie influenced you to make a decision in your life after watching it",
        "content": "Is there a movie you’ve seen that moved you so profoundly that it actually impacted your personal life and influenced you to make a change or decision? If so, what aspect about the film influenced it?\n\nFor me it was the being buried alive monologue in I Saw the TV Glow. I went back to the theaters three days in a row and sobbed in the theater each time. I have never felt more seen or exposed by a film in my life. After that; I started unmasking more around people in my life.\n\n",
        "upvotes": 713,
        "comments": 910,
        "media": null,
        "permalink": "/r/movies/comments/1h3bchy/which_movie_influenced_you_to_make_a_decision_in/"
    },
    {
        "id": "1h3mly2",
        "author": "dave_tk421",
        "title": "Remember when Michael Paré was the “it” actor?",
        "content": "\nEddie and The Cruisers - A television newswoman picks up the story of a 1960s rock band whose long-lost leader Eddie Wilson may still be alive, while searching for the missing tapes of the band's never-released album.\n\nStreets of Fire - A mercenary is hired to rescue his ex-girlfriend, a singer who has been kidnapped by a motorcycle gang.\n\nThe Philadelphia Experiment - A United States Navy destroyer escort participates in a Navy \"invisibility\" experiment that inadvertently sends two sailors forty years into the future.\n\nHe had a pretty good run for a flash of an eye",
        "upvotes": 115,
        "comments": 150,
        "media": null,
        "permalink": "/r/movies/comments/1h3mly2/remember_when_michael_paré_was_the_it_actor/"
    },
    {
        "id": "1h3nl0p",
        "author": "nbaisbest4",
        "title": "Found out Steve Buscemi tried to make Queer in the early 2000s, it's in the last question of the article. ",
        "content": "",
        "upvotes": 99,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/T7qvzeDuCgok1oHbqfhoWrui2xBjiX-BtsUBwnF02c4.jpg?auto=webp&amp;s=e55124fa6c6eaea423959850eed3b4782edb70df"
        },
        "permalink": "/r/movies/comments/1h3nl0p/found_out_steve_buscemi_tried_to_make_queer_in/"
    },
    {
        "id": "1h3awx1",
        "author": "Strawb3rryflowers",
        "title": " Which role(s) do you think Leonardo Dicaprio should have gotten an Oscar for instead of The Revenant? ",
        "content": "I've never seen The Revenant (edit not saying he didn't deserve that win since i've obviously haven't seen it, i'm simply asking those of you who did see it) anyway, in my opinion Leo should have definitely gotten an Oscar for his roles in What's Eating Gilbert Grape and Django Unchained. I've recently watched Django Unchained again and he was really briliant in it.\n\nHe was obviously also great in The Departed, Catch Me If You Can, Revolutionary Road, etc but those are his stand-out performances in my personal opinion\n\nedit: not sure why some people want to argue with me and are downvoting this? I can still think he deserved Oscar wins for his other roles, especially because him not winning an Oscar for so long became a meme for the longest, his smirk when he finally won for The Revenant at the Oscars said everything. ",
        "upvotes": 526,
        "comments": 567,
        "media": null,
        "permalink": "/r/movies/comments/1h3awx1/which_roles_do_you_think_leonardo_dicaprio_should/"
    },
    {
        "id": "1h3jgz1",
        "author": "McNasty420",
        "title": "They just made Ghost World free on youtube",
        "content": "This movie is fantastic.  It stars Thora Birch, Scarlett Johansson and Steve Buscemi.  They play two girls who just graduated from high school and have no plans for the future.  They befrend Steve Buscemi's character.  I recommend giving it a watch, it's so great!\n\n[https://www.youtube.com/watch?v=pmW61ytcI18](https://www.youtube.com/watch?v=pmW61ytcI18)",
        "upvotes": 141,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/42F7Qe_zAH40Qd8bV3ErdXMbzIs6eg0dBoUiDC0TSVA.jpg?auto=webp&amp;s=e45898297eeb73d0eb9046556f16d996a34cd786"
        },
        "permalink": "/r/movies/comments/1h3jgz1/they_just_made_ghost_world_free_on_youtube/"
    },
    {
        "id": "1h330ci",
        "author": "Bennett1984",
        "title": "Robert Downey Jr., Mickey Rourke, Demi Moore and the Great Hollywood Comeback Performances",
        "content": "",
        "upvotes": 2496,
        "comments": 198,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/oOIjNJkceH1NAhXSkox7ROcsoFkUubMOXaglACGcva8.jpg?auto=webp&amp;s=4f955233d1c910bffa01f48ead81e8f8843f6281"
        },
        "permalink": "/r/movies/comments/1h330ci/robert_downey_jr_mickey_rourke_demi_moore_and_the/"
    },
    {
        "id": "1h3o7al",
        "author": "otter-otter",
        "title": "What was the first film to use the trope of criminals going to a vet when they get shot etc?",
        "content": "I get the reason behind the plot point, to not draw attention of authorities etc etc, but have always wondered what the first film a criminal went to a vet to get stitched up after being shot. \n\nI can think of films in 70’s/80’s/90’s/00’s that had the vet trip. Any earlier? Any one know the first? \n\nSide quest - do you think it’s based on any fact?",
        "upvotes": 61,
        "comments": 37,
        "media": null,
        "permalink": "/r/movies/comments/1h3o7al/what_was_the_first_film_to_use_the_trope_of/"
    },
    {
        "id": "1h3vlpu",
        "author": "Fairy-Styles1999",
        "title": "Do you think Jeff Goldblum’s character in Earth Girls are Easy fits the “born sexy yesterday” trope usually given to naive female characters?",
        "content": "I’m rewatching the movie tonight and Mac’s naivety is obvious and I was thinking about those characters who are often naive or a little bit dense but have a lot of sex appeal. Zeebo and Wiploc are the same but they seem a lot more aware than Mac, despite Mac being the more intellectually intelligent one.",
        "upvotes": 17,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1h3vlpu/do_you_think_jeff_goldblums_character_in_earth/"
    },
    {
        "id": "1h3i52x",
        "author": "BunyipPouch",
        "title": "1974's Classic Slasher 'Black Christmas' Getting 50th Anniversary 4K Theatrical Re-release Starting December 7th",
        "content": "",
        "upvotes": 114,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/scqYhDm44Ugrb_w2KCQOynkcyrFIjVu24ZJzODfNWHQ.jpg?auto=webp&amp;s=a46c3e36f6db01b4a527d7e469a371f9d57087ef"
        },
        "permalink": "/r/movies/comments/1h3i52x/1974s_classic_slasher_black_christmas_getting/"
    },
    {
        "id": "1h3hzqi",
        "author": "nofuture09",
        "title": "The Girl Next Door (2004) deserves more love!",
        "content": "Just finished rewatching The Girl Next Door and had to share why it’s so great:\n\nElisha Cuthbert absolutely shines in this role. Her charcater Danielle isnt just eye candy...she’s confident but also vulnerable. Elisha makes you care about her journey and choices. She is the heart of the movie. \n\nTimothy Olyphant (Kelly).....Easily one of the coolest villains in any teen movie. He is both funny and intimidating. Every scene with him is a highlight.\n\nAlso have to call out Elis best friend \"Matthew\"... he is hilarious and chaotic. He brings so much energy to every scene, whether its his wild schemes or over-the-top reactions. Definitely one of the funniest parts of the movie.... especially when he gets interviewed in front of the college after his success \"SHUT THE FUCK UP ... Next\" at the end\n\nthe movie balances humor with some surprisingly emotional moments so well and it captures the early 2000s vibes in the best way possible. The soundtrack, the style, the overall feel. it really is a time capsule in the best way.\n\n\nRemember... the juice is worth the squeeze.",
        "upvotes": 108,
        "comments": 43,
        "media": null,
        "permalink": "/r/movies/comments/1h3hzqi/the_girl_next_door_2004_deserves_more_love/"
    },
    {
        "id": "1h32fqx",
        "author": "fungobat",
        "title": "The Professional - 30 Year Anniversary 4K Restoration - Official Trailer",
        "content": "",
        "upvotes": 1689,
        "comments": 414,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vZkkjiDs9z03gYQ2AtphhwTAXSvkxJjub_lZS1desB8.jpg?auto=webp&amp;s=2a81674d42a9e932a498c76bd435cce7127ad597"
        },
        "permalink": "/r/movies/comments/1h32fqx/the_professional_30_year_anniversary_4k/"
    },
    {
        "id": "1h3t6rw",
        "author": "WorldEaterYoshi",
        "title": "Do you find that you enjoy movies more alone or with others?",
        "content": "I watch movies alone all the time, but if I have the opportunity to watch it with someone else I take it. For some reason though, I feel like I'm more critical of movies when I'm watching them with others rather than when I'm alone. I also think I'm less likely to have a strong emotional response. Would love to hear other takes.",
        "upvotes": 18,
        "comments": 42,
        "media": null,
        "permalink": "/r/movies/comments/1h3t6rw/do_you_find_that_you_enjoy_movies_more_alone_or/"
    },
    {
        "id": "1h3vis7",
        "author": "newredditaccount_24",
        "title": "What \"true\" movie did the greatest injustice to its main character?",
        "content": "As in, most people who see the movie will come away with the completely wrong belief about that real person? Either the movie emphasized the wrong things, bungled facts, filled in a lot of blanks, or just straight up lied.\n\nI imagine ones about world leaders or hugely impactful figures will necessarily attract a ton of controversy, but there's definitely got to be ones where there's no question about how wrong the portrayal was.",
        "upvotes": 13,
        "comments": 70,
        "media": null,
        "permalink": "/r/movies/comments/1h3vis7/what_true_movie_did_the_greatest_injustice_to_its/"
    },
    {
        "id": "1h3hwey",
        "author": "indiewire",
        "title": "‘Blitz’ Star Saoirse Ronan Shares What Makes Steve McQueen and Adam Stockhausen the Perfect Collaborators",
        "content": "",
        "upvotes": 74,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VAT9Dt54vNH8BQCEUjOVLVi-mWpF8pomvoonRvRNw-Y.jpg?auto=webp&amp;s=785f6b8c156587820029a7a349f1493ce1adbdee"
        },
        "permalink": "/r/movies/comments/1h3hwey/blitz_star_saoirse_ronan_shares_what_makes_steve/"
    },
    {
        "id": "1h3cike",
        "author": "Business_Ad_6816",
        "title": "Paul Bettany. Seriously",
        "content": "I just finished watching Journey's End, a lesser known WW1 drama. Truly a masterpiece, and Paul Bettany is just so good in it. I was left in awe by Sam Claflin and Paul Bettanys acting, but especially Bettany. \n\nI always knew Bettany was good, but damn. He blew me away in Journey's End. If you haven't seen it, I highly recommend it. ",
        "upvotes": 155,
        "comments": 108,
        "media": null,
        "permalink": "/r/movies/comments/1h3cike/paul_bettany_seriously/"
    },
    {
        "id": "1h2n6jj",
        "author": "herewego199209",
        "title": "The death of R rated comedies or even comedies in general that get wide releases never made sense to me. In the 2000s those comedies were made relatively cheaply, IE Superbad was made for 20 million and made well over $170 million. You'd think studios would love this.",
        "content": "I don't get why we don't have more rated R comedies or even romantic or sex comedies anymore. The one romantic comedy that they marketed really well recently and made a shit ton of money was Anyone but you and that movie was made for $25 and made $225 million. I don't get the excuse that comedies don't  make a lot of money overseas or that blu-rays don't sell anymore. ",
        "upvotes": 14132,
        "comments": 2165,
        "media": null,
        "permalink": "/r/movies/comments/1h2n6jj/the_death_of_r_rated_comedies_or_even_comedies_in/"
    },
    {
        "id": "1h3vfiu",
        "author": "Last_Canary_6622",
        "title": "Problemista is One of My Favorite Movies of 2024",
        "content": "I loved the quirkiness of it all. It reminded of the hipster vibe of the late 2000s - early 2010s in the best way possible, although I'm not sure that's what the film was going for. I miss movies like this and Scott Pilgrim vs. The World. It also really made me miss TV shows like Whitest Kids U Know and Portlandia.\n\nAre there any other TV shows and movies with this vibe that I should watch?",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1h3vfiu/problemista_is_one_of_my_favorite_movies_of_2024/"
    },
    {
        "id": "1h3ltsb",
        "author": "herequeerandgreat",
        "title": "cujo from cujo is a tragic villain.",
        "content": "in my opinion, one of the most tragic fictional villains of all time is cujo from the novel and movie cujo.\n\nfor starters, both works make it abundantly clear throughout that cujo is a very loving and good dog, like most saint bernards. but then, he gets bitten by a rabid bat and gets rabbies himself. and this prompts him to go crazy and start attacking people. if you think about it, the rampage and deaths aren't really cujo's fault and are a by product of a horrible degenerative disorder.\n\nthings get even sadder if you read the book. there are portions of the novel that take place from cujo's perspective. after he gets bitten, he's worried that his owners will be mad at him for getting bitten. but, as the story goes on and his psyche begins to crack, he starts to irrationally believe that his owners made him sick. not to mention that these portions make it extremely clear that cujo is in pain. not to mention, there's the final paragraph which is one of the saddest things i've ever read in any book. \"it would perhaps not be amiss to point out that he had always been a good dog. he had tried to do all the things his man and his woman and most of all his boy has asked or expected of him. he would have died for them if that had been required. he had never wanted to kill anybody. he had been struck by something. possibly destiny or fate or only a degenerative nerve disease called rabies. free will was not a factor.\"\n\nthere's also a part of the movie that adds to the tragedy. it happens after cujo has become rabid. he encounters the son of his owner brett. knowing that he's about to succumb to rabids, cujo uses the last bit of sanity that he has left to get away from brett before he can hurt him. my heart!\n\neven though cujo dies at the end of the story, there's a strong possibility that his suffering still hasn't ended. in king's 1991 novel needful things, the character of polly enters an abandoned house but is chased out by a malevolent ghost dog. a popular fan theory is that the house is the camber residence and the ghost dog is cujo's restless spirit. god damn it stephen king! stop being mean to cujo!",
        "upvotes": 35,
        "comments": 10,
        "media": null,
        "permalink": "/r/movies/comments/1h3ltsb/cujo_from_cujo_is_a_tragic_villain/"
    },
    {
        "id": "1h3poir",
        "author": "I_Sleep_In_Pajamas",
        "title": "Theory on Netflix’s “The Ritual”",
        "content": "Just got done watching it and I know I’m a bit late. Im sure people have talked about this already but I want to say it anyway. Near the end of the movie the girl tells Luke he’s being chosen because he has experienced a lot of pain, implying that it’s a matter of respect. I think in reality the entity chose Luke to become a follower because he is the biggest coward of the group, based on his experience at the convenient store. The entity believed he would be the most likely to submit and comply to it’s commands. It shows Luke hallucinations of the event in order to try and make him react as he did in the store. I bet this is what every follower had in common.",
        "upvotes": 18,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1h3poir/theory_on_netflixs_the_ritual/"
    }
]