[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 10,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 574,
        "comments": 4391,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1ne6xhd",
        "author": "rohanad1986",
        "title": "Eunice Kim Out as Netflix’s Chief Product Officer",
        "content": "",
        "upvotes": 161,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1ne6xhd/eunice_kim_out_as_netflixs_chief_product_officer/"
    },
    {
        "id": "1neok6u",
        "author": "Frank3634",
        "title": "Netflix &amp; AMC Networks Expand Branded Deal With New Seasons Of ‘Interview With The Vampire’, ‘Dark Winds’ &amp; ‘The Walking Dead’ Shows",
        "content": "[https://deadline.com/2025/09/netflix-amc-networks-expand-deal-with-1236529094/#comments](https://deadline.com/2025/09/netflix-amc-networks-expand-deal-with-1236529094/#comments)",
        "upvotes": 9,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1neok6u/netflix_amc_networks_expand_branded_deal_with_new/"
    },
    {
        "id": "1nebtxb",
        "author": "Fun_Molasses5215",
        "title": "Lisa Rinna revealed the hardest part about playing Kendra Licari in film about shocking case",
        "content": "",
        "upvotes": 20,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1nebtxb/lisa_rinna_revealed_the_hardest_part_about/"
    },
    {
        "id": "1ndyzg8",
        "author": "Pretend_Mark_5143",
        "title": "I loved Wednesday Season 1 but this second season is so annoying to me.",
        "content": "The first season had all the charm anyone could want in a show like this. It was quirky with a darker tone and I greatly enjoyed all the slight nods to the original Addams Family. It seemed like such a strong show. Every episode was good until the season final which I felt was a little over the top and lame. I thought it would pick back up for season two but my gosh was I wrong. The episodes are uncreative and unnecessarily long and to my dissatisfaction all the characters were butchered to an extreme. It hurt so bad to witness Eugene and Pugsley spend all there time causing issues with Slurp. Also, don’t expect Wednesday to show any signs of improvement she seemed to have sorta gained at the end of the first season. Not only is that work erased but it actually feels like it’s declining steadily. It’s like she’s supposed to be a badass but her character seems to have a bad case of main character syndrome. Bringing Tyler back to continue being a whiny jerk was not pleasant either and it was made worse for leaving Zavier out. Don’t even get me started on the writing. It’s some of the cringiest stuff I’ve heard in a while. This is a lot of negative stuff but I can say some good things about the show too. Season 2 was mildly entertaining. Oh, wait. That’s all I’ve got. Feel free to disagree with my opinion but for me this season was a joke.",
        "upvotes": 182,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1ndyzg8/i_loved_wednesday_season_1_but_this_second_season/"
    },
    {
        "id": "1ndtq67",
        "author": "ProteinPapi777",
        "title": "What is a film series you watched where you just couldn’t stop yourself from clicking “next episode”",
        "content": "I really want to find film series where every time I finished an episode I just couldn’t stop myself from going for the next episode even tho I should have been sleeping or something that’s how much I was excited what was gona happen. I honestly only felt that for 4-5 film series’:\n\nMoney heist\n\n\nBreaking bad\n\n\nBetter call Saul\n\n\nSquid game\n\n\nQueen’s Gambit\n\n\n(I know, I am basic)\n\nSo what is a film series where you did/felt the same way?",
        "upvotes": 394,
        "comments": 771,
        "media": null,
        "permalink": "/r/netflix/comments/1ndtq67/what_is_a_film_series_you_watched_where_you_just/"
    },
    {
        "id": "1nel4ay",
        "author": "Unhappy_Interview_93",
        "title": "Wolf king season 2 ending",
        "content": "There’s no subreddit for Wolf King, so I guess I might as well write it in this one. After watching the last episode and finding out that there won’t be a third season, and that Wolf King Season 2 is the final season, I think they could have just made the ending differently, giving us viewers closure on the story. But instead, they leave us on a cliffhanger and imply that another season might come. But no, there won’t be a third season, ’cause it’s canceled according to news outlets. So, given this info, the people who made the second season shouldn’t have done that at all. Now I’m just disappointed.",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nel4ay/wolf_king_season_2_ending/"
    },
    {
        "id": "1ne0qi7",
        "author": "Repulsive-Dog3371",
        "title": "Aka Charlie Sheen",
        "content": "I loved this two part docuseries! Of course most of his fallouts have occurred in the public eye. But at the end of the series, he lets out a wild secret and I loved that for him! I hope he stays with his sobriety. \n\nI also didn’t realize that there is another brother in the clan, while Emilio and their dad Martin are not a part of this, the other brother is. ",
        "upvotes": 57,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1ne0qi7/aka_charlie_sheen/"
    },
    {
        "id": "1neqak6",
        "author": "Mel-Fleetwood",
        "title": "Is there going to be a wolf king season 3?",
        "content": "And if not can some tell me where the book picks up or somewhere I can just read  a summary of the ending?I was under the impression from some thing I read in the past that it would tie up the whole story.Sorry if this sounds like a rant.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1neqak6/is_there_going_to_be_a_wolf_king_season_3/"
    },
    {
        "id": "1nek42r",
        "author": "Squasome",
        "title": "Canada Netflix:  Is Fatherhood available?",
        "content": "There's usually a big different between what is available in Canada vs other countries so, if you're not in Canada, please don't respond.\n\nI've recently become aware of the movie, \"Fatherhood\", with Kevin Hart.  I haven't had Netflix for a while but intend to get it next month to watch s02 of Wednesday.  I'm really hoping this movie will be available.  Can any Canadians please tell me?",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nek42r/canada_netflix_is_fatherhood_available/"
    },
    {
        "id": "1neo1u0",
        "author": "Osc4r_spidy",
        "title": "Estos son todos los iconos?",
        "content": "Se que algunas series y películas solo están disponibles en algunas regiones y me gustaría saber si de esas series o películas hay más iconos de perfil? Porque me gustaría utilizar alguno de attack on titan o Spiderman ",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/bhlhrdqhfmof1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1neo1u0/estos_son_todos_los_iconos/"
    },
    {
        "id": "1nengvm",
        "author": "Designer-Tea-7777",
        "title": "Wednesday Season 1 and 2",
        "content": "Just started Wednesday Season 1 not too long ago, and I'm absolutely loving it so far. Especially Tyler and Wednesday dynamic. Edin and Wednesday friendship, and I can't forget the Adams Family of course. \n\nBut I keep seeing mixed reviews on season 2. Also, I don't mind spoilers since I've seen them all over social media 😅😅😅",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nengvm/wednesday_season_1_and_2/"
    },
    {
        "id": "1nec0c3",
        "author": "peoplemagazine",
        "title": "Ben Affleck and Matt Damon Play Miami Cops Who Discover Millions in The Rip Trailer",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nec0c3/ben_affleck_and_matt_damon_play_miami_cops_who/"
    },
    {
        "id": "1nel29u",
        "author": "Agent_Hola",
        "title": "Can’t watch past the hour mark",
        "content": "I’m currently trying to watch Murder Mystery with Adam Sandler in it. Once the movie reaches the one hour mark it freezes and then closes out of the movie. I can’t skip past the one hour mark as it does the same. If I try to click back into the movie once is closed out it just loads and doesn’t do anything. I have to close the Netflix app and then reopen it then I can watch any other show or movie. The only movie I’ve had this issue with is Murder Mystery. Any ideas on what the issue is?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nel29u/cant_watch_past_the_hour_mark/"
    },
    {
        "id": "1neobwd",
        "author": "Rachelgal2",
        "title": "Are people just not googling their date? Love Con Revenge - spoiler",
        "content": "Each episode, the con person made a claim that a simple google search would have shown them to be lying.\n\nI just don’t get it.  Someone says they work at a major institution, you have their first and last name, and you don’t google them?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1neobwd/are_people_just_not_googling_their_date_love_con/"
    },
    {
        "id": "1ndkken",
        "author": "RoboticStaticShock",
        "title": "What will scare me shitless?",
        "content": "I need horror suggestions that will fuck me up and scare me. I am not an easily scared person when it comes to movies but I wamna watch something deeply creepy.  I love psychological thrillers.  I also have prime if that helps.  Thank you!!!",
        "upvotes": 69,
        "comments": 185,
        "media": null,
        "permalink": "/r/netflix/comments/1ndkken/what_will_scare_me_shitless/"
    },
    {
        "id": "1neobub",
        "author": "Rachelgal2",
        "title": "Are people just not googling their date? Love Con Revenge - spoiler",
        "content": "Each episode, the con person made a claim that a simple google search would have shown them to be lying.\n\nI just don’t get it.  Someone says they work at a major institution, you have their first and last name, and you don’t google them?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1neobub/are_people_just_not_googling_their_date_love_con/"
    },
    {
        "id": "1nebqlt",
        "author": "Sad-Rush-4269",
        "title": "Netflix Account Information",
        "content": "Hi everyone.\nI was in India and created a Netflix account, but I need to return to Italy. The account has an Indian credit card. Can I continue using it in Italy?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nebqlt/netflix_account_information/"
    },
    {
        "id": "1neobyo",
        "author": "Rachelgal2",
        "title": "Are people just not googling their date? Love Con Revenge - spoiler",
        "content": "Each episode, the con person made a claim that a simple google search would have shown them to be lying.\n\nI just don’t get it.  Someone says they work at a major institution, you have their first and last name, and you don’t google them?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1neobyo/are_people_just_not_googling_their_date_love_con/"
    },
    {
        "id": "1nddsmr",
        "author": "punchtheface",
        "title": "Kaos - What a disappointment!",
        "content": "Not in the show of course, but disappointed I am to hear it was cancelled and we may never reach a conclusion. I loved every minute of it. It was such an authentic and original take on a story as old as we can remember.\n\nThe cast was amazing, every character was so rich and engaging I could not honestly pick a favourite… apart from Dionysus of course.\n\nI was wondering what the majority of people felt about it though, it appears to not have drawn in the audience numbers to keep going.",
        "upvotes": 120,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1nddsmr/kaos_what_a_disappointment/"
    },
    {
        "id": "1nea42p",
        "author": "Icy_Cold-View",
        "title": "I can't wait to see what will happen in Beauty in Black Season 2",
        "content": "\nI finished the first season last week -- the ending was amazingly satisfying, but I felt sad for Angel, and I’m excited to see where the story goes next!!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nea42p/i_cant_wait_to_see_what_will_happen_in_beauty_in/"
    },
    {
        "id": "1ndu6se",
        "author": "Deanno0",
        "title": "Need a good series to watch that is actually entertaining!",
        "content": "Please list something that is actually entertaining to watch and somewhat addicting . So hard to find something decent to watch that actually catches my attention !! Just list your favorites from best to worst don’t need to go into detail . Thanks netflixers!",
        "upvotes": 13,
        "comments": 188,
        "media": null,
        "permalink": "/r/netflix/comments/1ndu6se/need_a_good_series_to_watch_that_is_actually/"
    },
    {
        "id": "1ne8phk",
        "author": "Healthy-Rent-5133",
        "title": "If you miss a Netflix boxing fight live can you watch later or is it only live?",
        "content": "Gonna miss the Canelo Alvarez versus Terence Crawford fight, wondering if I should find a way to record it or if I can just stream it after the fact. \n\n\n\nThanks",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ne8phk/if_you_miss_a_netflix_boxing_fight_live_can_you/"
    },
    {
        "id": "1ndwnia",
        "author": "Corrupt_Echo",
        "title": "What’s a good show or movie series for a 13YO Boy",
        "content": "LF something decent - have seen raising Dion, and a few others and now looking for a new show to binge or just watch even if it’s in a different series",
        "upvotes": 5,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1ndwnia/whats_a_good_show_or_movie_series_for_a_13yo_boy/"
    },
    {
        "id": "1ne589r",
        "author": "historyinprogress",
        "title": "Justin from Fenn’s Treasure",
        "content": "Watching Gold and Greed: The Hunt for Fenn’s Treasure and noticed the treasure hunter Justin Posey, the software engineer. Hot nerd appreciation post. Love nerdy guys. That is all. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ne589r/justin_from_fenns_treasure/"
    },
    {
        "id": "1neh83l",
        "author": "Few_Ad_1848",
        "title": "New format fir Netflix on TV",
        "content": "I don’t know if all of you have new format on TV, but I can’t get used to. 🫠 Everything is larger, the menu is on top of the screen, scrolling isn’t clear, covers are bigger and categories are shown one at the time. \n\nI’m praying to go back to original format, or to zoom out a little bit to have better view. This is a bit “too much into your face”.\n\nThat’s all folks. What do you think? ",
        "upvotes": 0,
        "comments": 2,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/oof8w1p21lof1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1neh83l/new_format_fir_netflix_on_tv/"
    },
    {
        "id": "1ndr9ky",
        "author": "Wonderful_Cost4856",
        "title": "Autumn Vibes Only — Best Netflix Series &amp; Movies to Cozy Up With?",
        "content": "Hey everyone!\n\nWith autumn almost here, I’m on the hunt for the **perfect Netflix series or movies** that give off those cozy, warm, and slightly nostalgic vibes. Think falling leaves, rainy afternoons, blankets, and hot coffee.",
        "upvotes": 7,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1ndr9ky/autumn_vibes_only_best_netflix_series_movies_to/"
    },
    {
        "id": "1ne1ms8",
        "author": "Parking_Honeydew2523",
        "title": "pausing subscription",
        "content": "i applied a gift card to my netflix account when i signed up, and it auto applied 2 months worth so my subscription lasts until oct 22. is it possible for me to pause sep 22 and resume oct 22 so the subscription runs aug 22-sep 22 and oct 22-nov 22? ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ne1ms8/pausing_subscription/"
    },
    {
        "id": "1neayco",
        "author": "Every-War-9595",
        "title": "Nikki Rodriguez: 33 and Playing a 15/16-Year-Old in Netflix Show",
        "content": "https://preview.redd.it/09rdqjbwsjof1.png?width=2294&amp;format=png&amp;auto=webp&amp;s=1cd28c7e6c77cd584cd951213a1bf6b56be75f74\n\nI wanted to share my thoughts on Nikki Rodriguez, who plays Jackie (lead) in My Life with the Walter Boys. I recently found out that she’s actually **33 years old**! This makes sense because her vibe feels much more **mature** than her character, who’s supposed to be **15 or 16**.\n\nYou can definitely tell she’s older in some ways. For example, the lines around her eyes and her smile lines really show her age and add to that mature impression. Plus, the way she carries herself feels much more adult. She graduated from Roseville Area High School in Minnesota in **2010**, which fits with her being older.\n\nI’ve noticed that older actors sometimes take on teenage roles, but it feels off for someone **over 30** to be playing a teenager, and this casting choice detracts from the **authenticity** of the show. Honestly, her acting is **subpar,** and she feels too mature for the role and struggles to embody a teenage character, especially given that it's almost **20 years** since she was that age.\n\nETA: Her real age is in the public domain and has been reported on social media and news sites.\n\n  \nEdit to add: My observations were about acting authenticity, not a personal attack. Physical characteristics matter when an actor is portraying a much younger character. This is a legitimate critique of casting and performance.",
        "upvotes": 0,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1neayco/nikki_rodriguez_33_and_playing_a_1516yearold_in/"
    },
    {
        "id": "1ndm513",
        "author": "SlightlyBoringCat",
        "title": "yo i watched never have i ever",
        "content": "real good and fun to watch. teenage stuff and all shown good. Would recommend to people who're looking for something not too serious and will make them feel good.",
        "upvotes": 5,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ndm513/yo_i_watched_never_have_i_ever/"
    },
    {
        "id": "1ndfz91",
        "author": "hestooopinionated",
        "title": "Love Con Revenge Is A Joke",
        "content": "I thought this documentary series was a joke and I was surprised to Cecilie again, but I guess she would be an expert in this subject since she willingly gave away all her money too. ",
        "upvotes": 7,
        "comments": 6,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9t6v8f4hmcof1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1ndfz91/love_con_revenge_is_a_joke/"
    }
]