[
    {
        "id": "1jo4p54",
        "author": "ParvulosAMA",
        "title": "Hi, /r/movies! I am Isaac Ezban, director of PÁRVULOS: CHILDREN OF THE APOCALYPSE, an upcoming post-apocalyptic horror film. It's out in theaters this weekend. Ask me anything!",
        "content": "",
        "upvotes": 10,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vvnhx7eqd1se1.png?auto=webp&amp;s=1387fb720a15ced26a6a4b6745e610569c610215"
        },
        "permalink": "/r/movies/comments/1jo4p54/hi_rmovies_i_am_isaac_ezban_director_of_párvulos/"
    },
    {
        "id": "1jo48wo",
        "author": "MarvelsGrantMan136",
        "title": "‘Coyote vs. Acme’ Lives: Ketchup Entertainment to Release Shelved WB Film",
        "content": "",
        "upvotes": 6801,
        "comments": 475,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qGWE-9r6bYF_74CiGcIx3vqKhYEFeQ91OdDEF0sMmmQ.jpg?auto=webp&amp;s=3e62cc36193ae76f2f6951127068b76eaad24944"
        },
        "permalink": "/r/movies/comments/1jo48wo/coyote_vs_acme_lives_ketchup_entertainment_to/"
    },
    {
        "id": "1jo2ybl",
        "author": "ze11ez",
        "title": "Who’s a TERRIBLE actor/actress that improved exponentially with time?",
        "content": "Like the title, someone that sucked but has become 100000% better.  Maybe they were just starting out and couldn’t act.   Did some terrible movies, and over time they improved themselves into greatness.\n\nUsually someone starts out terrible and stays terrible.  Or they were great and are now not even trying",
        "upvotes": 830,
        "comments": 1447,
        "media": null,
        "permalink": "/r/movies/comments/1jo2ybl/whos_a_terrible_actoractress_that_improved/"
    },
    {
        "id": "1jo2ma4",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for A24's 'Bring Her Back', Directed by Danny and Michael Philippou",
        "content": "",
        "upvotes": 836,
        "comments": 65,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/oug438vpw0se1.jpeg?auto=webp&amp;s=c052d4e001263dd02025389f8a52f72ee625f85c"
        },
        "permalink": "/r/movies/comments/1jo2ma4/official_poster_for_a24s_bring_her_back_directed/"
    },
    {
        "id": "1jo3ckv",
        "author": "bawlhie62a2",
        "title": "I took an edible before Mulholland Drive, thinking it was going to be a lesbian romance. Holy. Shit.",
        "content": "My partner suggested we watch it and based on his description of it, I thought I was settling in for a dreamy lesbian love story with a bit of mystery. 30 minutes in I’m rolling with it. 60 minutes in there’s some unsettling moments (the espresso scene, the diner alleyway scene, the dead body in “Diane’s” apartment) where we’re like, “Did I understand what just happened?” and had to rewind. By the end I felt like my emotions and trust were violated by David Lynch.\n\nThe edible peaked right as Rita opened the blue box and my soul left my body. The last 15-20 minutes was the craziest mindfuck I’ve ever experienced in a movie. I don’t know who I am anymore. Is Mulholland Drive even real? Are we real?? I had to stop thinking of Betty and Rita as real people for the longest time. It’s officially one of my favorite movies ever made, hands down. \n\nI don’t know if this makes sense but I just need to get this out there.",
        "upvotes": 372,
        "comments": 117,
        "media": null,
        "permalink": "/r/movies/comments/1jo3ckv/i_took_an_edible_before_mulholland_drive_thinking/"
    },
    {
        "id": "1jo0qzw",
        "author": "Amaruq93",
        "title": "It's Tough to Be a God: Dreamworks' \"The Road to El Dorado\" at 25",
        "content": "",
        "upvotes": 525,
        "comments": 66,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JrAC0cL9BiNJbReS2wWO2QgEkj83uS6O3WK1EzWkxBc.jpg?auto=webp&amp;s=789543abc1d50159d891d066e3fcd5d5ea02b087"
        },
        "permalink": "/r/movies/comments/1jo0qzw/its_tough_to_be_a_god_dreamworks_the_road_to_el/"
    },
    {
        "id": "1jnzn2e",
        "author": "KillerCroc1234567",
        "title": "Michael Mann Gives Update on ‘Heat 2’",
        "content": "",
        "upvotes": 461,
        "comments": 156,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GbU6rBEaP3EU2QeCcFU-4egsdguG9n4frVjuHMv32R8.jpg?auto=webp&amp;s=18bc4d9e1fd3e296e6e67b689760a0c29308f8b7"
        },
        "permalink": "/r/movies/comments/1jnzn2e/michael_mann_gives_update_on_heat_2/"
    },
    {
        "id": "1jo09uu",
        "author": "CNNsWorstEnemy",
        "title": "I was NOT expecting Pan’s Labyrinth to end like that",
        "content": "This movie has been on my watchlist for a long time and I finally got around to seeing it tonight.\n\nI thought the special effects were rly well done, especially the CGI given the time this\ncame out.\n\nI also loved the way this is more of a war period piece than a straight up fantasy, and how it blends aspects of fantasy into its very ground story!\n\nI was honestly expecting for it to be like a Tim Burton-esque “Labyrinth [circa 1986]” where after she first goes into the labyrinth it takes her on a magical journey, but I was pleasantly surprised how much of the storyline is just between the drama of fascists and the resistance. The moments of fantasy act as a nice addition to how Ofelia sees the world as a coping mechanism to the trauma around her (war, her mother’s sickness, etc.)\n\nI am so curious as to what was real and what was just in Ofelia’s head, because Vidal physically picked up the baby Groot fetus thing and threw it into the fire… but then the Pale Man wasn’t there from Vidal’s perspective when he chased her through the labyrinth, so can only she see these spiritual entities or..?\n\nI also just.. I was not expecting for her to die at the end let alone getting shot point blank like that. I haven’t been this shocked watching a movie in a long time, I was lying down and when that happened I shot my head up and sat up in pure disbelief, mouth agape, eyes watering. The ending made me cry fr seeing her in the afterlife reunited with her family and having the “prophecy” fulfilled for the “princess to return to the land of spirits/leave the land of mortals” wrapped up the fantasy aspects of the movie in such a way that made me rethink the meaning of everything fantasy-related that I just watched. \n\nWhat i didn’t like about the movie was that there are a few little blunders with the audio syncing  and also seeing someone who’s dead breathe for a slit second mildly takes me out of the movie for a sec, but other than that I give nothing but praise for this film. Praise for the costume designers who adorned the rich environments that brought colorful life into each scene, esp. the fantasy set pieces! Praise for the adult acting and the NOT god-awful child acting muchísimas gracias a Ivana Baquero por darnos un gran performance fr. Praise to how Del Toro worked his craft and made such a unique, eerie, curious, intense work of art that pushes boundaries and major took risks with its characters. Mad respect to u for that Sr. del Toro. What a wonderfully melancholic movie, I can’t wait to see it again with actual subtitles this time when i buy the blu-ray\n ",
        "upvotes": 343,
        "comments": 108,
        "media": null,
        "permalink": "/r/movies/comments/1jo09uu/i_was_not_expecting_pans_labyrinth_to_end_like/"
    },
    {
        "id": "1jo3nv7",
        "author": "Warm_Prompt_6911",
        "title": "Inglourious Basterds Ending",
        "content": "Just finished watching and I’ve seen a lot of people say Hans’ betrayal didn’t make sense but to me this ending was practically perfect.\n\nIn the first scene Hans harps on the importance of perception. The difference in treatment between rodents (rats and squirrels), and he also revels in the nickname awarded to him by the french (the jew hunter).\n\nHe also describes his ability to think like two different beasts, the hawk and the rat, which make him perfect for his role. For most of the film, he is positioned as a hawk as it’s beneficial but by the end we see his ability to align his identity with that of the rat to carve his name on the right side of history.\n\nI also noticed the constant readjustment of his badges throughout the film which I attributed to his receptivity to public opinion and general desire for respect. It makes why he’d prefer to be seen as a double agent rather than a soldier turned halfway through the war.\n",
        "upvotes": 174,
        "comments": 46,
        "media": null,
        "permalink": "/r/movies/comments/1jo3nv7/inglourious_basterds_ending/"
    },
    {
        "id": "1jnasrw",
        "author": "MarvelsGrantMan136",
        "title": "YouTube Turns Off Ad Revenue For Fake Movie Trailer Channels After Deadline Investigation",
        "content": "",
        "upvotes": 19716,
        "comments": 744,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fyOYJ48U4ZwZWFfi2tSW9BvW03M9so4B4zgM9lVmk70.jpg?auto=webp&amp;s=f90277025adb5c696c3d7c47d638a8583ee33a9a"
        },
        "permalink": "/r/movies/comments/1jnasrw/youtube_turns_off_ad_revenue_for_fake_movie/"
    },
    {
        "id": "1jo5as0",
        "author": "NoCulture3505",
        "title": "‘Star Wars' and ‘Ghostbusters' props among top-selling items at entertainment auction; Chewbacca's Bowcaster was top selling item ($768,000)",
        "content": "",
        "upvotes": 59,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bt-NOPgDX3B7CVxM_oPJkeZT7umLcana7Xtvq5VB64s.jpg?auto=webp&amp;s=6240c628313b1263b67feec3c804aa4b988259f8"
        },
        "permalink": "/r/movies/comments/1jo5as0/star_wars_and_ghostbusters_props_among_topselling/"
    },
    {
        "id": "1jnod5c",
        "author": "Bynairee",
        "title": "Blade Runner (1982) | Tears In Rain Monologue",
        "content": "",
        "upvotes": 1100,
        "comments": 71,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/46H2o7ZybCKDQ-PGBf5wGfY8OFHb_ginUnzHVCgaL-I.jpg?auto=webp&amp;s=d3f181dd142c96c57a8f097bfb99d273db7eebcc"
        },
        "permalink": "/r/movies/comments/1jnod5c/blade_runner_1982_tears_in_rain_monologue/"
    },
    {
        "id": "1jo2vys",
        "author": "KillerCroc1234567",
        "title": "AMC, Dolby Ink Deal to Fuel Expansion of Dolby Cinema at AMC Locations",
        "content": "",
        "upvotes": 63,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XDh3myJPV3dDzPZgWICgsYXrRFbmCypmid_CdqvBrok.jpg?auto=webp&amp;s=05271c0f1b925439cd02385066a35400ce0713e6"
        },
        "permalink": "/r/movies/comments/1jo2vys/amc_dolby_ink_deal_to_fuel_expansion_of_dolby/"
    },
    {
        "id": "1jnnkcs",
        "author": "KillerCroc1234567",
        "title": "David Zaslav Meeting With Candidates to Replace Mike De Luca and Pam Abdy as Warner Bros. Heads (Report)",
        "content": "",
        "upvotes": 871,
        "comments": 151,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jjbtDijXTPZBW1YeeSgH-kFTA9sJGhZMOSz4ckNj7xQ.jpg?auto=webp&amp;s=11e29e18edb7fd6cb16f5f470f88041f5bfaeefc"
        },
        "permalink": "/r/movies/comments/1jnnkcs/david_zaslav_meeting_with_candidates_to_replace/"
    },
    {
        "id": "1jnnjkq",
        "author": "WorldsWeirdestidiot",
        "title": "Ever seen a movie that's had such a good premise. Such a good idea but was executed so poorly?",
        "content": "Ever seen a movie that you were really interested in? You really like the idea. Let's say it's a cool idea for a super hero movie. But everything that could go wrong. Went wrong. It wasn't a necessarily \"BAD\" Idea. You actually REALLY liked it. But the execution was just done so badly. All the characters were written badly, and plot made little to zero sense. BUT if it was executed differently... And written differently the idea could be a masterpiece, it was just a victum of bad writers who have zero idea of what thier doing.",
        "upvotes": 684,
        "comments": 1572,
        "media": null,
        "permalink": "/r/movies/comments/1jnnjkq/ever_seen_a_movie_thats_had_such_a_good_premise/"
    },
    {
        "id": "1jo448b",
        "author": "1whoisconcerned",
        "title": "My movie rewatch: The Town",
        "content": "I cannot speak highly enough about this movie. The movie posters make it look like a generic crime thriller but I can assure you it is anything but.\n\nThe acting, particularly from Renner and Affleck, is sublime, the script packs a surprisingly big emotional punch and the direction is artful without becoming corny.\n\nAbsolutely riveting from start to finish and - in a rare instance for me - every bit as good as the first time I watched it. 10/10 go watch if you haven't already",
        "upvotes": 32,
        "comments": 37,
        "media": null,
        "permalink": "/r/movies/comments/1jo448b/my_movie_rewatch_the_town/"
    },
    {
        "id": "1jo42mi",
        "author": "Ok_Response_6886",
        "title": "Dystopian sci-fi recommendations",
        "content": "I am into futuristic dystopian universes like blade runner, ghost in the shell, matrix etc. My criteria is it should have a main character in existential crisis and/or the main character should be kinda lost. Any movie recommendations? Series or books are also acceptable.\n\n(I dont know why I am specifically into this stuff)",
        "upvotes": 17,
        "comments": 72,
        "media": null,
        "permalink": "/r/movies/comments/1jo42mi/dystopian_scifi_recommendations/"
    },
    {
        "id": "1jnsrk3",
        "author": "SortaMixed",
        "title": "First Blood in Theaters Must Have Been a Hell of an Experience",
        "content": "Finished the movie again, today, and can't help but noticed how a sherrif from a small US town would say \"with that flag on your jacket... you're asking for trouble\" to a war vet. Which got me thinking, given the time of release, political atmosphere, and general opinion of the Vietnam war, how impactful was First Blood if any on the general public? \nWas it an instant classic or did it take time to build a following? Did seeing a badass war hero suddenly be vulnerable do anything? \nTo those who had been around to see it in theaters and after, what's your experience?\n\nEdit for grammar.",
        "upvotes": 149,
        "comments": 69,
        "media": null,
        "permalink": "/r/movies/comments/1jnsrk3/first_blood_in_theaters_must_have_been_a_hell_of/"
    },
    {
        "id": "1jnei4t",
        "author": "synnrman",
        "title": "Richard Chamberlain Dead: Star of Dr. Kildare, Shogun, Thorn Birds Was 90",
        "content": "",
        "upvotes": 1028,
        "comments": 98,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0AlxHwbvOXKNPucy1fzu0MF2LMBvoOAFkc1eXrwGyGs.jpg?auto=webp&amp;s=8d57f85cd879fdfa564101dfa34c0dbd831500d6"
        },
        "permalink": "/r/movies/comments/1jnei4t/richard_chamberlain_dead_star_of_dr_kildare/"
    },
    {
        "id": "1jnj4x5",
        "author": "IIMsmartII",
        "title": "Is there a better single year stint in directing than Schindler's List and Jurassic Park in 1993?",
        "content": "I was just a kid but it just sounds crazy to me how these movies could be released within a 5 month timeframe. Especially given how drastically different yet timelessly well done they are. John Williams and Spielberg were operating at the top of their game. Do any other directors have similar feats, even if in back to back years?",
        "upvotes": 318,
        "comments": 94,
        "media": null,
        "permalink": "/r/movies/comments/1jnj4x5/is_there_a_better_single_year_stint_in_directing/"
    },
    {
        "id": "1jo7p4e",
        "author": "Emeraldsinger",
        "title": "What original plans for a movie have you heard about that made you say to yourself \"thank God they didn't do that!\"",
        "content": "I watched a YouTube video where they talked about the original plans the writers had thought up for Back to the Future 2, and man it just sounds weird and very derivative of the first. Could've very much ended up being one of those bad 80's sequels to a beloved classic that everyone chooses to ignore today. But luckily, we got the brilliant sequel that part 2 is.\n\nWhat are your picks?",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1jo7p4e/what_original_plans_for_a_movie_have_you_heard/"
    },
    {
        "id": "1jnqr4g",
        "author": "EntertainerTop3451",
        "title": "Charlie Chaplin - The Kid (1921) | Iconic Fight Scene",
        "content": "",
        "upvotes": 96,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cdiWrKzEyCOaiwq9UKS3oUcGxmHwFfSVIz5Ws5NTj50.jpg?auto=webp&amp;s=49bc99e5f5abaa0f2587856d5a057acfe62eea8c"
        },
        "permalink": "/r/movies/comments/1jnqr4g/charlie_chaplin_the_kid_1921_iconic_fight_scene/"
    },
    {
        "id": "1jnl30c",
        "author": "AcabAcabAcabAcabbb",
        "title": "What are the best Courtroom/Legal movies of all time?",
        "content": "A few come to mind, 12 angry men, a few good men, to kill a mockingbird, my cousin Vinny … but I really want to know if I’ve missed watching any. I want to see great writing and legal jargon, and I’m interested in logical arguments and performances. could be dramas or comedies.  I’m less interested in intrigue and conspiracy and more so in the actual nitty gritty of real life legal battles. ",
        "upvotes": 210,
        "comments": 514,
        "media": null,
        "permalink": "/r/movies/comments/1jnl30c/what_are_the_best_courtroomlegal_movies_of_all/"
    },
    {
        "id": "1jnlf6f",
        "author": "ElenaTGold",
        "title": "Fright Night 1985: The Ultimate Vampire Movie",
        "content": "My partner made this video essay about Fright Night. What are your thoughts on the movie, if you’ve seen it? And even if you haven’t, what is the vampire movie you’re making this video about (hypothetically, of course)?\n\nI feel like mine would be Girl Walks Home Alone at Night, or maybe The Lost Boys, but then I am a pretentious wench. ",
        "upvotes": 190,
        "comments": 90,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vlh0yXNsLLxRoaspW_NowGlFYagMyvm41kaVmlFPzVA.jpg?auto=webp&amp;s=c77b44df8e0ddbe52745d726b2229723d537fe85"
        },
        "permalink": "/r/movies/comments/1jnlf6f/fright_night_1985_the_ultimate_vampire_movie/"
    },
    {
        "id": "1jncen9",
        "author": "udar55",
        "title": "Martial arts legend Richard Norton dies, aged 75",
        "content": "",
        "upvotes": 631,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YCp-nn5KtPT6LZ3i6iVDTZhvVWDNXst54apjSO-cpn8.jpg?auto=webp&amp;s=88020de582b893c7bba63da8115366cb5420e313"
        },
        "permalink": "/r/movies/comments/1jncen9/martial_arts_legend_richard_norton_dies_aged_75/"
    },
    {
        "id": "1jo73eb",
        "author": "PhilosopherHot3983",
        "title": "Anyone else still waiting for Douglas Preston - Lincoln Child techno-horror fiction to be made into movies?",
        "content": "I been a longtime fan of these paperbacks.  But only one of them, Relic, was ever made into a movie.  Not great but not bad.  But that was a long time ago and nothing since.  These authors have a wide selections of mysteries, some with interesting reoccurring characters, set in places from the frigid Arctic to the deepest jungles.  Better yet, these  stories usually end up having twist endings with rational explanations, more or less, for the unspeakable horrors encountered.  And yet no movies to groove on.  The unconventional FBI agent Pendergast would have made an interesting franchise character.  (I think he could have been played by a young Johnny Depp twenty years ago.)  I really like Thunderhead and Still Life with Crows.  Which books would you like to see made into movies?  ",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1jo73eb/anyone_else_still_waiting_for_douglas_preston/"
    },
    {
        "id": "1jnt6s8",
        "author": "UK_UK_UK_Deleware_UK",
        "title": "What’s your “comfortable shoes” movie?",
        "content": "What’s the movie that you love so much you could watch it any time? When you don’t have the attention span for something new. When it’s late. When you’re half drunk. When you’re doing chores. When you’re avoiding chores. Watch part of it. Watch all of it. It doesn’t matter. Some of my picks…\n\nEdge of Tomorrow \n\nAny Jason Borne movie\n\nAny Red Movie\n\nThe Princess Bride\n\nCaptain America: the Winter Soldier\n\nStar Trek: First Contact\n\nGroundhog Day\n\nI know there are others, but these are off the top. What makes you speak quotable lines along with the actors? What will you just put on to do your thing? I realize this has probably been asked over and over, but I just blew across my husband’s skin to raise goosebumps and now we’re watching First Contact. \n\n",
        "upvotes": 39,
        "comments": 196,
        "media": null,
        "permalink": "/r/movies/comments/1jnt6s8/whats_your_comfortable_shoes_movie/"
    },
    {
        "id": "1jnmu8p",
        "author": "NefariousnessOk274",
        "title": "Romantic sad movies",
        "content": "I want a movie that’s a romance but angsty. I want to cry and throw up after I finish watching it, I want to be emotionally disturbed, I want to get nightmares.\n\nI’m also open to any movies that are just romance or just sad. I have cried during the titanic but I want something that is like 10000 times worse.\n",
        "upvotes": 105,
        "comments": 395,
        "media": null,
        "permalink": "/r/movies/comments/1jnmu8p/romantic_sad_movies/"
    },
    {
        "id": "1jnra2g",
        "author": "bi_polar2bear",
        "title": "What movies have we never heard of knock it out of the park?",
        "content": "I just finished Tokyo Cowbow, and it was fantastic! It was something new, unique, and corporate left alone. I was wondering what other movies out there are worth renting that help you rediscover the joy of movies. I'm usually an action, sci-fi, or comedy, so this was something I stumbled upon, found it had great ratings, and over delivered between the acting, story, and no bullshit we've come to accept. ",
        "upvotes": 45,
        "comments": 177,
        "media": null,
        "permalink": "/r/movies/comments/1jnra2g/what_movies_have_we_never_heard_of_knock_it_out/"
    },
    {
        "id": "1jo7ihx",
        "author": "BillyThe_Kid97",
        "title": "The rights for Bourne are up for grabs, how should they proceed with the character in your opinion? Should it stay on the big screen or move to the small screen?",
        "content": "I love The Bourne franchise. The  mystery, slowly uncovering who this mysterious character is, high ocatine chases, brutal hand to hand combat, lavish globe trotting locations. Its true Legacy and Jason Bourne did not live up to the first three, but they weren't that bad. But they really sqeezed a lot out of the character so is there more to squeeze? Matt Damon is up there age-wise and it would make no sense to continue the franchise with him as the lead. Problem is they already tried a passing of the batton with Legacy and the box office returns just weren't there. They tried a short lived show called Treadstone. In terms of format I believe the character should stay on the big screen. One of the best parts of the movies was the pacing. I think with a show the pacing would be a bit off. In terms of the content...I think they need to go the Legacy route again. Keep the lore and focus on a new character. Jason Bourne is Matt Damon, Matt Damon is Jason Bourne. Recasting feels weird. But they need to move beyond the scop story-wise. We've already had the whole, agent realizes he works for bad people, goes on the run, they try to kill him cause otherwise its all gonna come out bla bla. Like get a room of really imaginative writers and craft a new direction. What do you guys think?",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/movies/comments/1jo7ihx/the_rights_for_bourne_are_up_for_grabs_how_should/"
    },
    {
        "id": "1jnctxl",
        "author": "PopsicleIncorporated",
        "title": "Enough of these \"what tropes do you hate\" threads: what tropes does Reddit hate that you don't mind at all?",
        "content": "I'll go first.\n\nEvery time the usual \"what trope do you hate\" thread shows up, someone mentions the protagonist letting the villain live - bonus points if they mention that the protagonist killed henchmen on the way to the final fight. This sort of comment has become cliched in its own right.\n\nTo me, this has never bothered me; usually henchmen are killed in self-defense while the antagonist is typically disarmed and vulnerable.\n\nAdditionally: maybe killing the villain in cold blood is the \"right\" move to protect others, but I can't really fault the protagonist for not wanting to do that. I know I wouldn't want to have to deal with the psychological ramifications of that.\n\nAny other tropes you don't mind that Reddit really seems to hate?",
        "upvotes": 247,
        "comments": 530,
        "media": null,
        "permalink": "/r/movies/comments/1jnctxl/enough_of_these_what_tropes_do_you_hate_threads/"
    }
]