[
    {
        "id": "1j0tp5q",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1j0tp5q/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1j0tp69",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1j0tp69/la_piola_friends_meetup/"
    },
    {
        "id": "1j9fhws",
        "author": "cresta42",
        "title": "Arrampicata al C.A.T. - cercasi compagni",
        "content": "Ciao a tutti, come dice il titolo sto cercando gente con cui arrampicare al Centro Arrampicata Torino (C.A.T.). Sono arrivato da poco a Torino e non conosco nessuno che faccia corda e che sappia fare sicura.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1j9fhws/arrampicata_al_cat_cercasi_compagni/"
    },
    {
        "id": "1j8tpql",
        "author": "Desperate_Question50",
        "title": "Consigli su come fare amicizia a Torino 😂",
        "content": "Ciao a tutti :) so che fa un pochino ridere ma chiedo consiglio a voi popolo di reddit 😂 sono amy e ho 29 anni, mi sono trasferita da un mese nel quartiere di mirafiori nord a Torino, e non so proprio come fare per conoscere nuove persone, sono una ragazza molto solare, mi piace ridere, scherzare, amo tantissimo leggere e sono anche un tantino nerd, perciò amo i videogiochi e anche i giochi da tavolo😂 ho ancora la mia vecchia compagnia di amici ma ci metto 4 ore tra andata e ritorno e non posso farlo tutti i weekend, mi piacerebbe conoscere altre persone con cui uscire la sera o anche solo per un caffè o un aperitivo, perciò vi prego consigliatemi perché le uniche altre persone con cui ho fatto amicizia sono i vecchietti che si siedono sulle panchine del parco dove porto il cane perciò la situazione inizia ad essere tragica ahhahahaha ",
        "upvotes": 17,
        "comments": 41,
        "media": null,
        "permalink": "/r/torino/comments/1j8tpql/consigli_su_come_fare_amicizia_a_torino/"
    },
    {
        "id": "1j91qc7",
        "author": "ConsistentLook8198",
        "title": "Dove posso trovare delle lavagne",
        "content": "Cerco una lavagna (preferibilmente di quelle usate in ardesia, ma va bene anche una un po’ più recente ma di buona qualità. Prenderei in considerazione anche lavagne bianche carine. Dove posso trovarle a Torino? Ho provato balon ma per ora ho trovato solo quelle grandi grandi da scuola (bellissima, ma non ho spazio 🥲)",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1j91qc7/dove_posso_trovare_delle_lavagne/"
    },
    {
        "id": "1j8n9ql",
        "author": "Affectionate_Neck354",
        "title": "Corsi gratuiti / Eventi a Torino",
        "content": "Buongiorno a tutti! Qualcuno conosce qualche sito interessante per partecipare ad eventi e/o a corsi gratuiti? Vorrei trovare qualcosa di interessante da fare durante le giornate di pausa dall'università! Grazie in anticipo per le risposte!",
        "upvotes": 5,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1j8n9ql/corsi_gratuiti_eventi_a_torino/"
    },
    {
        "id": "1j8wllk",
        "author": "According-Tension-54",
        "title": "Quando cercare affitto per università?",
        "content": "Salve, anno prossimo pensavo di frequentare il politecnico di Torino per la magistrale e abitando in Toscana avrei bisogno di affittare un appartamento (ovviamente condiviso). Penso di laurearmi ad ottobre di quest'anno. Secondo voi quando sarebbe meglio iniziare a cercare un posto?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1j8wllk/quando_cercare_affitto_per_università/"
    },
    {
        "id": "1j8u5pt",
        "author": "Sleepy_tooth678",
        "title": "Consigli su come fare l’ amicizia in università a Torino",
        "content": "Salve a tutti ho 20 anni e sono da un mese a Torino e frequento l’ universita di Torino da poco ci sono consigli come posso fare amicizia con i compagni di corso o in generale con gli universitari?",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1j8u5pt/consigli_su_come_fare_l_amicizia_in_università_a/"
    },
    {
        "id": "1j8n71m",
        "author": "fallaceo",
        "title": "Compagnia per andare alle feste",
        "content": "So che forse questo non è il posto adatto ma abito in provincia e mi miei soci non vanno più in festa, da 3 anni ormai vado praticamente con conoscenti o gente che conosco da solo e finisco per farmi la festa da solo (non male ma adesso è frustrante).\nDetto ciò vediamoci dove volete, organizziamoci e partiamo per la festa creando una bella ciurma, le info le ho io, la macchina posso metterla, guido tranquillamente per ore ma la compagnia sesso è fondamentale, scrivetemi in dm per organizzarci ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1j8n71m/compagnia_per_andare_alle_feste/"
    },
    {
        "id": "1j881bi",
        "author": "Inevitable-Spray-592",
        "title": "Help deciding which italian city to move to",
        "content": "Ciao 🙂\n\nI’m planning to move to Italy next October and I’m making my mind around the city I wanna live in. I already have italian citizenship and codice fiscale. I’m still deciding between Rome, Firenze and Turin.\n\nThe things that I’d value the most when deciding in which city to live would be the availability of job opportunities (nothing in particular since I do not have a degree), social activities (I’ll be arriving all alone and I’m keen on meeting people around my age 25-30 yo), safety and cost of living.\n\nCurrently I’m more inclined to Turin due to the job opportunities and average rent prices.\n\nI’d appreciate if somebody could provide me an insight of their experience in these cities.\n\nThanks! 🫶🏼",
        "upvotes": 7,
        "comments": 34,
        "media": null,
        "permalink": "/r/torino/comments/1j881bi/help_deciding_which_italian_city_to_move_to/"
    },
    {
        "id": "1j88cu0",
        "author": "Varnavipra",
        "title": "Mercati per vestiti usati a poco a Torino",
        "content": "Salve, é da ormai 3 anni che vivo a Torino e ho sempre fatto affidamento su corso racconigi per comprare i miei capi vintage. \nAlmeno fino a una settimana fa, quando hanno tolto l'80% dei banchi di vestiti.\nQualcuno conosce qualche mercato particolare in cui vendono vestiti a poco stile corso Racconigi?\nOvviamente conosco già i vari Suk, Balon ecc. \nI negozi mercatino li evito perché ormai ricaricano troppo.\n\nGrazie mille!! ",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1j88cu0/mercati_per_vestiti_usati_a_poco_a_torino/"
    },
    {
        "id": "1j7l770",
        "author": "Aseae",
        "title": "Just the woman I am: cringiata vera",
        "content": "Sono stata alla manifestazione JTWIA a Torino.\n\n Tolta la disorganizzazione generale, alla partenza hanno speso qualche parola sull'evento, sebbene non una sulle donne. Hanno iniziato salutando il pubblico: \"ciao a tutti!!! ... e a tutte!” (maccome?) \n\nPoi hanno continuato con i ringraziamenti, va bene. Segue un breve discorso del sindaco, ma ancora nessun accenno alla questione femminile, mm..  Grandi applausi e poi si è passati al riscaldamento con una tizia che gridava \"su le mani popolo!\" (popolo?) \"marciamo popolo!!\" (già, proprio così). \n\nIl riscaldamento di grazia si conclude e un ragazzo prende la parola, inizialmente armeggiava con qualcosa e si scusa con il pubblico \"scusate, sapete, sono un uomo... \" (aiuto), boh! poi prosegue e inizia a dire che c'è un fuori programma... Nel frattempo, da un altro microfono, in mezzo alla folla un tizio gli parla sopra rivolgendosi al pubblico (o popolo come dir si voglia) :  ”Dovete sgomberare l'area della partenza, scusate! Spostatevi!\" \n\nOk. Quell'altro sul palco prova a riprendere la parola ed ecco, colpo di scena: chiede alla ragazza che aveva esortato il \"popolo\" ad alzare le braccia e a marciare di sposar... Ma non fa in tempo a fare la proposta (di cui onestamente non ci importava nulla) perchè, di nuovo, l'altro in mezzo alla folla riprende: \"Spostateviii!! Dobbiamo iniziare, forzaa\" Ancora qualche protesta da parte del palco che aveva deciso ormai di tenere in ostaggio il suo \"popolo\", ma niente, parte il countdown: \" Tre..  Due..\" - \"Sì lo voglio\" - \"... Uno... Bang!”\n\nLa folla parte: impossibile correre, perchè la maggior parte della gente avrebbe fatto il percorso camminando. Perciò chi voleva correre ha iniziato a farlo su per le collinette del parco del Valentino, tutto completamente a caso. \n\nC'era tanta gente, qualcuno vuole spendere una parola a proposito di ciò che è stato detto e non detto sul palco? Era la prima volta che partecipavo, davvero cringe.\n\n Trovo che abbia avuto molto più senso la manifestazione dell'8 organizzata da Non Una Di Meno. \n\nCosa ne pensate? ",
        "upvotes": 100,
        "comments": 42,
        "media": null,
        "permalink": "/r/torino/comments/1j7l770/just_the_woman_i_am_cringiata_vera/"
    },
    {
        "id": "1j7thar",
        "author": "SuddenElection7379",
        "title": "Musica dal vivo?",
        "content": "\n\nDopo essere stato a Parigi mi sono preso bene con la musica dal vivo, ho visto un sacco di locali che fanno serate jazz, o pub con gruppi country/rock/indie, e lo trovo un modo molto piacevole di passare la serata, anche senza aver necessariamente il \"gruppo famoso\".\n \n Per caso conoscete dei locali a Torino che fanno musica dal vivo? Musica jazz, o gruppi emergenti, o pub con musica?",
        "upvotes": 17,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1j7thar/musica_dal_vivo/"
    },
    {
        "id": "1j82xyh",
        "author": "Ok-Path6614",
        "title": "Feste alternative con musica elettronica, discoteca italiana, musica brasiliana, ecc.",
        "content": "Vengo da San Paolo dove ci sono molte feste alternative con musica elettronica varia e non commerciale. Volevo sapere se posso trovarlo a Torino, faccio il dj e suono per divertimento, è possibile trovarlo?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1j82xyh/feste_alternative_con_musica_elettronica/"
    },
    {
        "id": "1j82knt",
        "author": "Intelligent-Bell-120",
        "title": "Photo e video",
        "content": "Sono un produttore di musica hard techno e sto cercando un artista emergente nel suo campo per collaborare alla realizzazione di cover per album, foto promozionali e immagini per eventi. C'è qualcuno qui interessato?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1j82knt/photo_e_video/"
    },
    {
        "id": "1j81opn",
        "author": "Antiquityyy",
        "title": "consigli disco",
        "content": "io e le mie amiche staremo a torino per 3 giorni e stiamo cercando una disco non troppo cara (per questo sabato), possibilmente non techno o trap e in una zona abbastanza sicura, qualcuno ne avrebbe da consigliare? ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1j81opn/consigli_disco/"
    },
    {
        "id": "1j7ygo3",
        "author": "eventi_del_tano",
        "title": "KARAOKE",
        "content": "Buongiorno ci sono appassionati di Karaoke nella community?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1j7ygo3/karaoke/"
    },
    {
        "id": "1j7vya3",
        "author": "Alarmed-Carpenter975",
        "title": "Torino Spazio Pubblico | Turin",
        "content": "",
        "upvotes": 1,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/W_Qhq_ISXcWi5X6sY_MzH-fvur9Q0V7KCH7pT-XrXww.jpg?auto=webp&amp;s=9d355132b60566887e62c3c5798e7a99f159052d"
        },
        "permalink": "/r/torino/comments/1j7vya3/torino_spazio_pubblico_turin/"
    },
    {
        "id": "1j7uqwl",
        "author": "MonPorridge",
        "title": "Negozio informatica / assistenza per Surface Microsoft?",
        "content": "Come da titolo, avete un negozio da consigliarmi per portare il mio surface laptop in assistenza? Purtroppo è fuori garanzia da un po', e credo che la batteria vada sostituita.\n\nPunti in più per luoghi in centro.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1j7uqwl/negozio_informatica_assistenza_per_surface/"
    },
    {
        "id": "1j6r7cn",
        "author": "selalleroo",
        "title": "\"Si affitta a solo studenti\"",
        "content": "Nel pieno della disperazione da lavoratrice in cerca di una stanza decente e con prezzi decenti in cui stare, vi chiedo: perché molti padroni di casa prediligono gli studenti per fare contratti di affitto? Ma poi, fanno pure i controlli per vedere se effettivamente la persona che vuole affittare è studente o meno? No perché io sto cominciando a pensare seriamente di fingermi tale, non ne posso più. ",
        "upvotes": 48,
        "comments": 53,
        "media": null,
        "permalink": "/r/torino/comments/1j6r7cn/si_affitta_a_solo_studenti/"
    },
    {
        "id": "1j7attj",
        "author": "dani-foxy",
        "title": "Mobili usati",
        "content": "Qualcuno conosce opzioni valide per recuperare mobili di seconda mano in buone condizioni? Parlo in particolare di mercatini dell'usato specifici di arredamento o simili, che vendano divani, letti, tavoli ecc, di qualità. Una cosa che non sia\" mobili destinati alla discarica\" ma neanche \"mobili di design dell'800 che costano più di uno nuovo\".\n\nGrazie mille 🙏",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1j7attj/mobili_usati/"
    },
    {
        "id": "1j75qdx",
        "author": "IlKayMosca",
        "title": "Boati zona centro commerciale lingotto",
        "content": "Ciao a tutti, stanotte tra mezzanotte e l'1 di notte si sono sentiti 4/5 forti boati in zona centro commerciale lingotto.\nQualcuno sa cos'è stato?",
        "upvotes": 2,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1j75qdx/boati_zona_centro_commerciale_lingotto/"
    },
    {
        "id": "1j73aj5",
        "author": "ivlia-x",
        "title": "Auto Moto Turin Show - ne vale la pena?",
        "content": "Ciao, ho visto che fra un paio di settimane ci sarà questo evento. I prezzi sono alti (18€ per un giorno, 35€ abbonamento per tre giorno). \n\nQualcuno di voi ci è già stato? Ne vale la pena o è una truffa?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1j73aj5/auto_moto_turin_show_ne_vale_la_pena/"
    },
    {
        "id": "1j74xyl",
        "author": "_L_-",
        "title": "Corso di Teatro: lezione di prova",
        "content": "Ciao, qualcuno conosce dei corsi di teatro validi come passatempo da ventenne?\nE in genere fanno una prima lezione di prova? \n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1j74xyl/corso_di_teatro_lezione_di_prova/"
    },
    {
        "id": "1j74mzz",
        "author": "gbbarbaro",
        "title": "Gran Baloon",
        "content": "Oggi a porta palazzo c'è il Gran Baloon: vale la pena farci un giro?\nGrazie in anticipo 🙂",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1j74mzz/gran_baloon/"
    },
    {
        "id": "1j73b91",
        "author": "giokim77",
        "title": "Insegnante bachata cercasi",
        "content": "Ciao, \nConoscete qualche insegnante di bachata disponibile per lezioni private? Non ho trovato nulla online. Livello base.\n\nGrazie ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1j73b91/insegnante_bachata_cercasi/"
    },
    {
        "id": "1j72nfd",
        "author": "fabi-to",
        "title": "Cerco educatore cinofilo",
        "content": "Ciao :) io e il mio compagno abbiamo adottato un cucciolo un paio di settimane fa. Ora stiamo cercando un educatore/educatrice cinofilo/a che ci dia delle guide generali e ci supporti nel crescere un cucciolo felice e tranquillo. Per caso qualcuno ha una persona da raccomandare? Grazie!",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1j72nfd/cerco_educatore_cinofilo/"
    },
    {
        "id": "1j756jw",
        "author": "Pretty_State_1913",
        "title": "Ultima sciata dell'anno",
        "content": "M25, è da un po' che non scio più, ma prima che termini la stagione sciistica mi piacerebbe ritornare a fare qualche discesa sulla neve. A qualcuno interesserebbe? ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1j756jw/ultima_sciata_dellanno/"
    },
    {
        "id": "1j6lzna",
        "author": "No-Nobody584",
        "title": "Getting to Sacra Di San Michele?",
        "content": "Hi! I am visiting Turin this weekend and am curious if anyone knows how to get to the Sacra Di San Michele. Of course I picked the weekend b fore the shuttle services are actually running 🙄 so I'm curious if anyone can offer advice on how to reserve a taxi for this and roughly how much it should cost (the official Sacra website says taxi by reservation and about 25 euros). Any help is appreciated!",
        "upvotes": 5,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1j6lzna/getting_to_sacra_di_san_michele/"
    },
    {
        "id": "1j6d7mv",
        "author": "dkroods",
        "title": "Stiamo aggiungendo news sui trasporti GTT in Take It Easy TO! 🚋📢",
        "content": "Ciao a tutti! 👋\n\nSiamo il team di Take It Easy TO e stiamo lavorando a una nuova funzionalità: presto sarà possibile visualizzare notizie sui trasporti pubblici GTT, come scioperi, interruzioni del servizio e altre informazioni utili direttamente nell’app.\n\nCosa ne pensate? Vi sembra una funzione utile? Avete suggerimenti su cosa vi piacerebbe vedere? Fatecelo sapere nei commenti! 😊\n\nGrazie per il vostro supporto! La funzionalità sarà disponibile presto! 🚀\n\nAndroid: https://play.google.com/store/apps/details?id=com.takeiteasy.torino.app&amp;hl=it",
        "upvotes": 16,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nnQwOdFPDhG66upzOUX8tpygSBrrCbAym8Jn9SOS4gI.jpg?auto=webp&amp;s=44e52737a24a4ce0d5f7adb7f20f5ea1e5f986e6"
        },
        "permalink": "/r/torino/comments/1j6d7mv/stiamo_aggiungendo_news_sui_trasporti_gtt_in_take/"
    },
    {
        "id": "1j6edqk",
        "author": "mario_grondaia",
        "title": "Cercasi compagnia per serata tranquilla",
        "content": "Come da titolo stasera pensavo di fare un giro in centro o zona lingotto se qualcuno non avesse niente da fare e volesse aggiungersi mi scriva pure, niente di impegnativo anche soltanto fare due passi e fermarsi in un locale a prendere due birre a parlare del più e del meno. \n\nVi lascio un po' di info personali così capite se vi faccio schifo o abbiamo interessi in comune ahah.\nM22 quasi 23, da poco a Torino, fuorisede per la magistrale, appassionato di cinema, videogiochi (anche se principalmente tutti singleplayer), gareggio nel powerlifting quindi conosco bene l'ambito palestra, mi piace molto disegnare ma sono autodidatta (non manga ahimè per quello ho zero interesse ma sono disposto a ricredermi), ascolto musica tipo Gorillaz, Daft Punk, Strokes, Nirvana per citarne alcuni e sono Toscano se ci sono altri compaesani ahah",
        "upvotes": 12,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1j6edqk/cercasi_compagnia_per_serata_tranquilla/"
    },
    {
        "id": "1j6g6xs",
        "author": "CristianPiovano",
        "title": "Negozio di casalinghi di alta qualità",
        "content": "Ciao a tutti! Mi serve aiuto su dove comprare piatti, bicchieri da whisky smerigliati e tazzine da caffè di qualità a Torino o dintorni: magari un posto di forniture per ristoranti? Mi servono molto belli, quindi non il classico Casanova o Coin Casa, e possibilmente dove non sia necessaria partita IVA per comprare. Qualche suggerimento?",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1j6g6xs/negozio_di_casalinghi_di_alta_qualità/"
    }
]