[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mce7ep",
        "author": "Whobitmyname",
        "title": "‘Untamed’ Renewed for Season 2 at Netflix",
        "content": "",
        "upvotes": 357,
        "comments": 119,
        "media": null,
        "permalink": "/r/netflix/comments/1mce7ep/untamed_renewed_for_season_2_at_netflix/"
    },
    {
        "id": "1mcqsfu",
        "author": "GingerVix666",
        "title": "If there’s one show on Netflix you could recommend…",
        "content": "…to someone who just joined the platform, what would it be? And why? Please don’t say Riverdale 😂😭 I’m just rejoining after a bit and want to know what’s worth watching ",
        "upvotes": 13,
        "comments": 154,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqsfu/if_theres_one_show_on_netflix_you_could_recommend/"
    },
    {
        "id": "1mcmqiv",
        "author": "kay-pii",
        "title": "Help. I need a show to binge or movie.",
        "content": "I can't find anything new to grasp my attention. I finished untamed in two days. Finished Brick. I've tried Dept Q but I just don't know wtf is going on and it seems so slow to get to the plot. I just rewatched Queens Gambit because I couldn't find anything else. I like thrillers, sci-fi. Seen ST. Not sure if I should start Mindhunters because of how heartbroken you guys are it was cancelled. Tried Dark but it's a bit confusing. Suggestions for shows or movies would be great. ",
        "upvotes": 14,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1mcmqiv/help_i_need_a_show_to_binge_or_movie/"
    },
    {
        "id": "1mclemt",
        "author": "ToonAdventure",
        "title": "‘Untamed’ Leads Netflix English TV List Again As ‘The Hunting Wives’ Puts Up Impressive Debut; ‘Happy Gilmore 2’ &amp; ‘KPop Demon Hunters’ Dominate Film",
        "content": "",
        "upvotes": 10,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mclemt/untamed_leads_netflix_english_tv_list_again_as/"
    },
    {
        "id": "1mc523p",
        "author": "Neat_Suit3684",
        "title": "Trainwreck Area 51",
        "content": "Im just finding this series and I gotta say rewatching the Area 51 madness is making me howl! 😂 like Im loving how crazy people got into this.\n\nIdk what the other trainwreck documentaries are but im hoping theyre as funny as this.\n\nI still can't believe a dude made this whole thing up outta boredom. Like that just blows my mind how crazy it got and he wasnt even trying to do anything serious 😂 ",
        "upvotes": 47,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1mc523p/trainwreck_area_51/"
    },
    {
        "id": "1mbxvig",
        "author": "BeckettWilderness",
        "title": "Happy Gilmore 2 … rate it",
        "content": "I have seen so many great reviews for this movie and I know taste is completely subjective but I just didn’t like it - am I the only one? I am happy to see a lot of classic actors in this film though. \n\nPost Edit* After a little bit of reflection: I think it wasn’t horrible but the original is such a great classic - maybe subconsciously I had a very high expectation. ",
        "upvotes": 116,
        "comments": 351,
        "media": null,
        "permalink": "/r/netflix/comments/1mbxvig/happy_gilmore_2_rate_it/"
    },
    {
        "id": "1mctqrq",
        "author": "ArchAesthetics2046",
        "title": "Sanctuary is like an adult version of ippo",
        "content": "This show's full of heart, inspiration, and manliness. It's like the darker, adult version of hajime no ippo mixed with the yakuza game series. I'm not into sumo at all, but the writing of this show pulled me in. In desperate need for a second season. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mctqrq/sanctuary_is_like_an_adult_version_of_ippo/"
    },
    {
        "id": "1mctnr7",
        "author": "jaimelee1235",
        "title": "Squidward Games",
        "content": "painted Squidward Tentacles into the Squid Games , using sized 2.88mm rhinestones. \n\ni combined two patterns that i found here: \n\nhttps://www.braceletbook.com/patterns/alpha/49900/\n\nhttps://www.braceletbook.com/patterns/alpha/105915/\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/iry2eng60xff1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1mctnr7/squidward_games/"
    },
    {
        "id": "1mco5u7",
        "author": "Ok_Acanthocephala425",
        "title": "Happy Gilmore 2 Visual Question",
        "content": "Ok so in some of the scenes of the movie I noticed things disappearing from the picture. Like a ball would be rolling across the green, then for a few frames be invisible then in a few frames, reappear on the same trajectory. This happens multiple times and on other objects. So I guess my question is: is this a problem with my television, or is this something with the way the movie was produced? ",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1mco5u7/happy_gilmore_2_visual_question/"
    },
    {
        "id": "1mcnrql",
        "author": "Classic-Session-3490",
        "title": "Need show recs for my emotions",
        "content": "Hi, so my boyfriend and I just broke up, he was dating three other girls at the same time. Really slimy stuff. I have stared at the wall all day. I wanna try to eat something and find a show to watch, any recommendations? ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mcnrql/need_show_recs_for_my_emotions/"
    },
    {
        "id": "1mcnovh",
        "author": "True-Suggestion-6358",
        "title": "Recommendations",
        "content": "I’m a stressed out nursing student who doesn’t know how to relax. I need a Netflix (or prime or Disney plus) show to use as a getaway and distraction that I can enjoy as treat. Preferably something addictive and not too short to and not healthcare related.\n\nPrevious shows I’ve liked (some of them weren’t on Netflix): desperate housewives, Jane the virgin, Good girls, dead to me.\n\nThanks",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1mcnovh/recommendations/"
    },
    {
        "id": "1mcblm2",
        "author": "ToonAdventure",
        "title": "Fixed | Official Trailer | Netflix",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mcblm2/fixed_official_trailer_netflix/"
    },
    {
        "id": "1mbi3pw",
        "author": "restrictednumber1996",
        "title": "I can’t lie anymore. The Hunting Wives is sleazy, twisty and a hell of a summer binge.",
        "content": "Look, it isn’t Emmy award winning TV. The acting only ranges slightly fair. The characters are terrible people. \n\nBut I’d be lying if I said I wasn’t sucked in from the very first episode. It’s got everything a good summer binge should have for me. Like a trashy beach read. A mystery, sex, lies, and twists. It’s a super fun romp. \n\nAlso: I see some comments stating that Brad and Jamie are underage, thus making some scenes uncomfortable. Idk about the book, but they are 18 years of age on the show. Still taboo because he is a student, but I did want to mention that. Malin did an interview on it recently. \n\nAll in all, if you want a quick and breezy watch with some bonkers moments, take a watch. ",
        "upvotes": 259,
        "comments": 158,
        "media": null,
        "permalink": "/r/netflix/comments/1mbi3pw/i_cant_lie_anymore_the_hunting_wives_is_sleazy/"
    },
    {
        "id": "1mcmz5d",
        "author": "Worth_Seaweed7420",
        "title": "thirteen coming soon",
        "content": "thirteen is coming back on friday (and wednesday season 2 august 6th thank goodness), and I’m kind of excited? I know its a tough watch, but i haven’t seen the film since i was 13 ish myself, and i remember how much it messes with my brain still. i’m weirdly excited to be able to watch it again but this time with a full developed brain. i feel like it’ll be worse, in different ways. \n\npeople are saying the “coming soon” is missing for them though, so in case you’re curious and can’t find it, some others are \n\nMy Oxford Year (movie) - Friday \nThirteenth - Friday\nWednesday S2 - August 6\nLeanne (series) - Thursday\nPerfect Match new episode - August 1\nLove Live new season - August 5\nMarry Me - August. 10\nJim Jeffries 2 Limb Policy - August 12th ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mcmz5d/thirteen_coming_soon/"
    },
    {
        "id": "1mclqr7",
        "author": "Ok-Roll3954",
        "title": "Rebel ridge",
        "content": "mannnn oh mannnnn terry is such a beasttttt the scene of him vs the police department near the ending was INSANEEEE\n\nI just wish the ending was a bit more interesting. The end scene was comforting but I feel like they could have done better \n\nNevertheless terry is such an amazing actor!!!! The beginning racism of him being pulled over by cops pissed me off!! it’s so unfortunate and unfair.. truly shows the reality of being non white \n\n10/10 movie ",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1mclqr7/rebel_ridge/"
    },
    {
        "id": "1mbhoob",
        "author": "Nexfinity",
        "title": "Bad Influence Season 2 - Passes",
        "content": "Has anyone else heard rumors of Netflix doing a second season and covering all the child exploitation and CSAM legal troubles that Passes is facing? Would be interesting to see how they handle as I thought season 1 was fascinating and abhorrent. \n\n\n\nI like how they focused on the blame the parents share, which would be interesting with Passes since they required parental consent for the under 18 creators, though there's claims they allowed a few creators around that. Also a platform making $$$ off of selling bikini pics of 12-year-old girls is wild. Would be pretty explosive as Alec Celestin recruited and partnered with Lucy Guo who is now the \"youngest self-made female billionaire\".\n\n  \nAny other ideas for a second season?",
        "upvotes": 279,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1mbhoob/bad_influence_season_2_passes/"
    },
    {
        "id": "1mcl8sn",
        "author": "Cherry_xvax21",
        "title": "Hitmakers",
        "content": "What y’all think about this show? On episode 3 and so far impressed with the singer and songwriters. I never realized how many talented people work behind the scenes especially on some of my favorite hit songs. I really respect the choice to stay out of the spotlight and let the music speak for itself and still make that money!  \n\nNot a fan of Jhart though. There’s a thin line between confident and cocky. He came in way too cocky claiming to be a “fashion icon”. Excuse me but most of us don’t even know who you are. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mcl8sn/hitmakers/"
    },
    {
        "id": "1mch81b",
        "author": "Yuck_Few",
        "title": "Sneaky Pete",
        "content": "This show is confusing and I still don't get what the original scam was supposed to be. \n\nHe was supposed to pretend to shoot the card cheater dude and then that was supposed to somehow lead to Vince getting arrested and Pete getting some money? I don't get it \n\n",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1mch81b/sneaky_pete/"
    },
    {
        "id": "1mc74ss",
        "author": "Cool_Peace_822",
        "title": "Shows like dark",
        "content": "So i am looking for shows that are like the netflix german series dark and i want the shows to be german aswell because i am trying to learn the language, so anybody got some similar style shows that are also german?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mc74ss/shows_like_dark/"
    },
    {
        "id": "1mcdbkm",
        "author": "leyy_pink1997",
        "title": "Just finished Baby Reindeer — I have so many thoughts 😳",
        "content": "Wow. I just binge-watched Baby Reindeer and I’m honestly speechless. The acting, the pacing, the fact that it’s based on real events — everything just hit so hard. I didn’t expect it to be this intense.\n\nHas anyone else watched it?\nNo spoilers, pero grabe yung emotional impact. I had to pause a few times just to process. 😅\n\nWhat did you think of it? Also open to similar show recos!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mcdbkm/just_finished_baby_reindeer_i_have_so_many/"
    },
    {
        "id": "1mc2fcb",
        "author": "Mapl3nt",
        "title": "A Good Girls Guide to Murder",
        "content": "I was reading a lot of reddit discussions about AGGGTM and a lot of them complained about the show and how unrealistic it was for a 17 year old girl to be getting herself involved with r*pist and drug dealers ect. and IDK I loved the show so much and I can’t wait for a second season. \nWhy, if any reason, do you not like any part of the show? \nalso what was your favorite part of the show?",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mc2fcb/a_good_girls_guide_to_murder/"
    },
    {
        "id": "1mcbhzm",
        "author": "dontcallmeshazzam",
        "title": "2x speed in the mobile app?",
        "content": "Will netflix mobile app ever bring 2x speed instead of just 1.5x? \n\nEvery other ott app in which you can increase speed has 2x. So any idea when Netflix going to bring it?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mcbhzm/2x_speed_in_the_mobile_app/"
    },
    {
        "id": "1mcaqz0",
        "author": "leopard_trainer9",
        "title": "WWE Streaming Quality Issue on Netflix",
        "content": "\nDoes anyone else face streaming quality issues while watching WWE on Netflix\n\nIt's a very particular issue that I have been facing, Live Streams work great, recaps of WWE shows which happened few days ago also work great, but whenever I stream the show just a few hours after the Live episode has ended the quality is very bad\n\nI have good speed internet and all my Netflix account settings are adjusted correctly\n\nI think Netflix edits the shows after they are live streamed and uploads them the next day, when the quality is decent. But if I want to watch Raw just a few hours after it ended the quality goes down almost all the time\n\nFor example rn if I play the last weeks episode of Raw (July 21) the stream quality would be good, but if I play yesterday's episode (July 28) the stream quality will always be bad\n\n\nNeed help cause there must be more people facing this issue",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mcaqz0/wwe_streaming_quality_issue_on_netflix/"
    },
    {
        "id": "1mcabo0",
        "author": "EmilyKonocti52",
        "title": "Critical: Between Life and Death",
        "content": "Anyone watching this new series about work in the London trauma centers?  I was hesitant about watching this series but found it pretty inspiring.  Amazing what those front line emergency doctors and other medical professionals do.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mcabo0/critical_between_life_and_death/"
    },
    {
        "id": "1mb0szl",
        "author": "wayowayooo",
        "title": "Cruise director in Amy Bradley documentary receiving tons of backlash",
        "content": "Looks like Kirk Detweiler is getting tons backlash for his comments in the Amy Bradley is Missing documentary. He’s completely deleted his social media. I was surprised to see he didn’t express more empathy and remorse for how the situation has unfolded - so I think the criticism is deserved. What do you think?",
        "upvotes": 803,
        "comments": 329,
        "media": null,
        "permalink": "/r/netflix/comments/1mb0szl/cruise_director_in_amy_bradley_documentary/"
    },
    {
        "id": "1mckg2d",
        "author": "Next_Suggestion_7770",
        "title": "Thanks Netflix",
        "content": "So Netflix randomly deleted my downloads (downloaded the entirety of cyberpunk to binge), and when I tried to redownload them, they said I had reached my maximum monthly downloads. Wtf",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mckg2d/thanks_netflix/"
    },
    {
        "id": "1mc8vhw",
        "author": "TheMirrorUS",
        "title": "Amy Bradley case could see 'renewed investigation' thanks to Netflix series",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mc8vhw/amy_bradley_case_could_see_renewed_investigation/"
    },
    {
        "id": "1mc8u60",
        "author": "Historical-Bee710",
        "title": "Squid Game | Dissecting Fan Complaints",
        "content": "**Season 1:**\n\nWhy Gi-hun didn't get on the plane: he literally watched 444 people die right in front of his eyes (excluding Il-nam, who died in the hospital), including his childhood best friend. That much PTSD and trauma piled on in six days isn't something one can just shake off. If he *did* go to America, even with his new wealth, he still wouldn't be able to be the dad Ga-yeong deserved, and I think he knew it, too. Besides, what else could he do -just *forget* that the games are still going on, and try to live a happy life knowing 455 more people will get massacred every single year?\n\n  \n**Season 2:** \n\nThe Rebellion: Believe it or not, it was actually the only option. In-ho's suggestion was an illusion of choice -we see the 'O's creeping across the floor barely ten seconds after the lights go out. Even if the 'X's *had* tried to attack first, there would still have been a huge fight, and who's to say none of the main gang wouldn't have been killed accidentally in the chaos? Gi-hun isn't *supposed* to have perfect logic or foolproof planning -he's just as human as anyone else, which is part of what makes him such a great character.\n\n\n\n**Season 3:**\n\nStrangling Dae-ho: Both of them could have handled things a helluva lot better. From Gi-hun's POV, it's all his fault Jung-bae and the others are dead. Geum-ja was right about one thing in '222': *good people beat themselves up about the smallest things*. It's survivor's guilt. Then, at his lowest point ever, he's surrounded by his only surviving friends, who tell him it's Dae-ho's fault. All that guilt and grief reached such a crescendo, he had no idea what to *do* with himself anymore -he'd probably have tried strangling himself in the night but for the possibility of revenge. Admittedly, Dae-ho doesn't really help his case -he stuffs his face with potato, makes no visible effort to approach any of the others and apologise for being too scared to bring the ammo, and sleeps like a log. Before Hide-and-Seek, he also honestly shouldn't have yelled at Gi-hun -that was a dumb call. He thought he could be brave when the rebellion came, but when it was his moment, his courage failed him. He's understandable, really, and tragic because of it -but honestly, who *wouldn't* be like Gi-hun in this situation? He's so overwhelmed with guilt after killing Dae-ho, he almost stabs himself right there in the maze.\n\nJun-hee dying: She didn't really *need* to have a broken ankle -she just went into labour *yesterday*\\- but I suppose there had to be *some* extra handicap for those people who don't understand how hard giving birth is. The fact she was able to walk at all in the last minutes of the maze game was amazing, and it took a huge toll on her strength even without her fractured ankle. She was already fading fast by the time Jump Rope began, and she knew her limits -she already tried practicing tiny hops on the starting platform before Myung-gi approached her, and her ankle gave out on the second shuffle. She also indirectly saved Gi-hun a little while longer -that baby was just about the last thing left tethering him to life.\n\nGi-hun dying: If there's someone who can think to press a button when you're busy in the middle of fighting for your life with a two-day-old baby at stake, I'd honestly like to meet them. Also, how can people talk so casually of him throwing the baby off the tower and walking out alive? (I guarantee most of you wouldn't have the guts to do it yourselves.) He had nothing left in the outside world anymore, not really -the three years between Seasons 1 &amp; 2, his whole life was stopping the games. Dying on his own terms was actually the kindest, most peaceful, and most dignified way he could've gone. He wasn't eliminated by the games. He was set free by himself. *Humans are*… Whatever *most* humans are, *this* one was worthy of respect.\n\nSquid Game USA: this was actually foreshadowed by the VIPs all the way back in Episode 7 of Season 1. If you don't like it, don't watch the potentially upcoming spinoff.\n\n\n\n\n\nSorry for the monster post, but I just had to get it all off my chest. Thanks for coming to my unofficial Ted Talk, guys!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mc8u60/squid_game_dissecting_fan_complaints/"
    },
    {
        "id": "1mcgg8v",
        "author": "Singidi",
        "title": "Kim Possible adaptation",
        "content": "Do y’all remember in the early 2000s, there was a cartoon on Kim Possible. Netflix should pick up a Carmen Sandiego style adaptation of Kim Possible. \n\nWould be quite a hit today. Just a thought ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mcgg8v/kim_possible_adaptation/"
    },
    {
        "id": "1mbv0s3",
        "author": "Alive-Side2551",
        "title": "Scandal and Grey’s Anatomy disappeared off of Netflix today",
        "content": "\nFINAL UPDATE: well I uninstalled and reinstalled the apps on my phone and iPad, signed out of the tv and turned everything off and back on and no change when I booted it all back up. I gave up and went back to living my life and about an hour later came back to check and it all reappeared. Thank you everyone for coming on this very unimportant journey with me 😂\n\nEDIT/UPDATE: this does appear to just be my Netflix account (US West Coast) and it’s just slowly removing all the shows in my “Continue Watching” list from my Netflix altogether. I can’t find them at all searching for them in Netflix. It will only give me shows “like” the one I’m searching for. This is consistent across all devices: iPhone, iPad Pro, and a LG OLED tv. Very strange. I hope I get my shows back eventually 😭\n\nOriginal text:\nI was watching Scandal through again as a passive watch while doing chores and such, and after this last episode (I was somewhere in season three) it didn’t play the next episode and it just…went away completely off of Netflix. Off my continue watching list, and I can’t find it searching either. I googled it and there was a Netflix link announcement from last month, that it was coming back, and that link took me to a “remind me” page for the show on Netflix, essentially saying they will remind me when it’s available. I also noticed (though I don’t watch it) that Grey’s Anatomy is gone too. \n",
        "upvotes": 7,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1mbv0s3/scandal_and_greys_anatomy_disappeared_off_of/"
    }
]