[
    {
        "id": "1pguynj",
        "author": "scoreboard-app",
        "title": "Post Match Thread: Real Madrid vs Celta, Match 15 ",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1pguynj)",
        "upvotes": 128,
        "comments": 1829,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pguynj/post_match_thread_real_madrid_vs_celta_match_15/"
    },
    {
        "id": "1pb9xd4",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 23,
        "comments": 5306,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pb9xd4/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1ph6umu",
        "author": "Chance-Weather-8157",
        "title": "Same situation, different outcomes. The players have a point to be upset.",
        "content": "",
        "upvotes": 77,
        "comments": 21,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/gik9z2tysx5g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ph6umu/same_situation_different_outcomes_the_players/"
    },
    {
        "id": "1pgy8pv",
        "author": "No-Independent2522",
        "title": "Official Referee notes for red cards against Carvajal, Endrick and Carreras",
        "content": "",
        "upvotes": 302,
        "comments": 133,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pgy8pv/official_referee_notes_for_red_cards_against/"
    },
    {
        "id": "1ph4son",
        "author": "Scary-Procedure-6018",
        "title": "Only a matter of time till he responds.",
        "content": "",
        "upvotes": 106,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gw96xt9c6x5g1.jpeg?auto=webp&amp;s=2e1084f27e71867f6b8909589ea0406e3db05574"
        },
        "permalink": "/r/realmadrid/comments/1ph4son/only_a_matter_of_time_till_he_responds/"
    },
    {
        "id": "1pgzp6c",
        "author": "Slowpokebread",
        "title": "I still think Xabi deserves more time and trust.",
        "content": "It's not like his stuff never worked, his stuff worked. As long as we can press with intensity.\n\nbut he couldn't keep it for certain reasons. Even in the CWC he had used Fran Garcia quite well, letting him charge into the box to create threat.\n\nHe was also right to use Franco as RM to bring more balance/pressing and let Rodygo rotate with Vini as a LW, where he played much better. But things all changed.\n\nLike Rodrygo, Xabi was right to use him rotate Vini on the left, where he plays much better. And use Franco as RM to bring balance. But now he used him as RW and it didn't work well at all.\n\nIt has to do with his decision ,but most likely the dressing room also played the part, if we just fire him now. The problem would not be solved. I think his top priority is to let the players do what he had asked instead of being too easy on the stars and harsh on the youngsters(Endrick).  Remember 2019? Lopetegui was sacked so quickly also because he was too afraid to touch the star players. Solari could at least let the things work for a while because he had the balls to take off players and use youngsters. Till this day I still thank him.\n\nI really think a big mistake Xabi had made was being too easy on Vini after the Barca incident. I'm not saying Vini did something super evil or not playing well after. But no punishment(starting up in the Valencia game) simply let the players think \"hi we can do whatever we want without consequences\" Hiddink also mentioned it in the ESPN interview.\n\nWhat can save Xabi now is himself, he got to have the guts to do what he wanted the players to play, at the same time improve on the structure in time. If he couldn't do that, then he 100% would need to leave.",
        "upvotes": 186,
        "comments": 108,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pgzp6c/i_still_think_xabi_deserves_more_time_and_trust/"
    },
    {
        "id": "1ph6bm6",
        "author": "basedzone",
        "title": "Vini is so washed...",
        "content": "My god, just watching him play makes my eyes bleed. Like, how are you gonna be losing and diving for penalties, that too outside the box? \n\n0 shots that could result in a goal. And if he does shoot, it's straight at the keeper. You can just tell that Vini is not THAT guy for quite a long time. It's the same BS each match: dribble, dribble, lose the ball at the edge of the box, and try again for like 50 times, while the result stays the same.\n\nSELL HIM. PLAY MBAPPE ON LW. BUY A STRIKER.\n\nHe rants and cries too much anyway. And before you come at me, this is not a hate post. These are just my true feelings regarding him. He is not that guy, he's just not. You can watch every match 10 times, and this is the conclusion you'd come to. ",
        "upvotes": 60,
        "comments": 52,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ph6bm6/vini_is_so_washed/"
    },
    {
        "id": "1ph75ko",
        "author": "redsenjui",
        "title": "What does he means by this ?? The players are lazy ?",
        "content": "",
        "upvotes": 38,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xaxs7dlhwx5g1.png?auto=webp&amp;s=c7ec7c36b80c09d0d33b188f8b7ffafe0e56c54e"
        },
        "permalink": "/r/realmadrid/comments/1ph75ko/what_does_he_means_by_this_the_players_are_lazy/"
    },
    {
        "id": "1ph13fe",
        "author": "WhyChemistry",
        "title": "We have to get rid of the untouchables mentality",
        "content": "The biggest issue we have right now is the untouchables problem. We have a group of players who know they will start every game no matter how they perform. When players feel safe from being benched, intensity drops. They play without urgency, they stop tracking back, they stop making the extra effort, and the whole team suffers for it.\n\nThis is exactly what is happening with Vini, Mbappe, Jude, and Fede. These are great players, but they have reached a point where they are never held accountable. They know they will not get subbed off, even when they are having a bad game. That creates a culture where performance becomes optional. It is one of the reasons we struggle when we dominate possession. The players become too relaxed because they know nothing will happen if they lose the ball or waste chances. It doesn't click in their minds that playing like this will cause us to lose a game until the 80th minute. Then suddenly there is urgency to win.\n\nYou could see the difference in today’s game against Celta. We only started playing well and actually running after the red card reduced us to ten men. Suddenly, the team had no choice but to attack with urgency. The reason we played well against barca is because they dominate possession therefor we are forced to attack the moment we win the ball. Urgency changes everything. When the team feels pressure, players push themselves. Without it, the effort drops.\n\nThe solution is simple and necessary. We need to make it clear that no player is above the club. If someone is playing poorly, they come off. If someone is not defending, they get subbed. If someone keeps losing the ball, they sit on the bench next game. It does not matter how talented they are or how many trophies they have won. Other top clubs treat their stars the same way. Even Yamal gets subbed when he is off his game. So why do we protect our players like they are untouchable?\n\nUntil we fix this mentality, nothing will change. Talent alone will not win us games when hunger disappears. The club must come first. Always. Hala madrid! ",
        "upvotes": 98,
        "comments": 73,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ph13fe/we_have_to_get_rid_of_the_untouchables_mentality/"
    },
    {
        "id": "1ph37cf",
        "author": "More-Judgment-9253",
        "title": "Alonso's gotten outcoached in every game here except for valencia and bilbao.",
        "content": "Listen I understand that some of the players are part of the problem but please tell me how that excuses us getting outplayed by all of these teams? Just look at the liverpool game, he put cama on the RW and arda as a DM against szoboszlai and gravenberch, that's basically suicide, we stood no chance. And then against vallecano we couldn't create more than once chance, and the elche game was also bad. Against olympiacos we weren't even that good, and they would've equalized or even won if it wasn't for some great saves from lunin. That girona game was the worst match of football I've seen in the past few years. The bilbao game was good but they didn't play a low block and their defense is terrible, either way I thought it was good but today I got reminded that our coach still has zero solutions for teams that sit back. Elche beat girona 3-0 and we needed a pen to draw with them. At least last season carlo had an excuse since he had terrible defenders but there's no excuse for a coach with these players to be getting dominated like this. How can you look completely toothless against celta vigo at home?? He still doesn't even have a starting 11 and he makes terrible subs. At the end of the day a manager that gives 2025 brahim diaz so many minutes is questionable to me.  It's funny how he saw every team realize we only have attackers on the left and just shut us down, yet he NEVER gave endrick a chance on the RW. It's hard to feel bad for a coach like this honestly, but I'm not saying he should get sacked yet, I just don't like seeing everyone make excuses for him and act like he's been good or something.",
        "upvotes": 48,
        "comments": 31,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/m6rq7gjuqw5g1.jpeg?auto=webp&amp;s=c45735f155a74b5734d232ecbe6c9241acb0c519"
        },
        "permalink": "/r/realmadrid/comments/1ph37cf/alonsos_gotten_outcoached_in_every_game_here/"
    },
    {
        "id": "1ph29of",
        "author": "rohanshelby",
        "title": "More than loss can't bear this sub",
        "content": "For me more than the loss I won't be able to tolerate looking at this sub coming week. I'm pretty sure there will be few posts about vini and Mbappe. Some going to blame Arda. Forget about garcia. Some are going cry and ask for signing 5 back up CB. Don't even get me started regarding Xabi.Some will blame perez. Other day I saw one podt calling out thibau for clearing ball into opposite half and not passing. There will be posts calling out all starting XI . Man why can't we take loss as it is? I know it's Real Madrid anything less than champions league is failure here, Just chill and enjoy game let team figure out themselves.",
        "upvotes": 46,
        "comments": 30,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ph29of/more_than_loss_cant_bear_this_sub/"
    },
    {
        "id": "1ph3t7o",
        "author": "Ash799",
        "title": "This is not the team i’ve known my entire life.",
        "content": "If anything is certain regarding the culture of this club throughout its entire existence is that Real Madrid FC does not care or attempt to even protect the stars, often times through its history sacrificing the stars for the longevity, excellence, and image of this Club. \n\nJust in the recent years, \nLuka Modric was benched,\nMarcelo was benched,\nSergio Ramos thrown out the door when asking for too much money,\nPepe was thrown out the door when asked for long contracts. \nCR7 as well. \nBale, Isco, Benzema, Raul, Figo, Beckham, Owen, Ronaldo, Hierro, Kaka, and many many more were benched, when they showed drop of performance or lack of trying to win and give 100% every game. \n\nFootball in this decade is not much about tactics as it is about effort. If one thing Xabi showed during his short tenure as a coach is his team always fights. Leverkusen were playing like 11 dogs until the 95th minute every single game with relentless mentality. \n\nIf my dear lovely smiley Vini does not feel like running and pressing and dying on the field with no complaints every single game then he’s not my star, neither the club’s star, and he Must be benched, ignored or shown out the door…\nSo goes for every other name in this team, \n\nEvery squad player no matter their status, recent successes, or accolades, if they don’t press and run for 95 minutes every game they should be shown out the door. Period. \n\n\nLiverpool have been struggling massively lately in the premier league. \nWhen we played them, Courtois saved us from a historical defeat. Not because Arne Slot is a better manager, but because Liverpool played in a different stratosphere of relentless football being used to the culture currently in the premier league, and we played like spoiled brats like we are. \n\n\nStop blaming the manager, a fury should be unleashed towards every single player not running their hearts out every single game like every generation of Real Madrid players did. Simple as that. ",
        "upvotes": 33,
        "comments": 22,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ph3t7o/this_is_not_the_team_ive_known_my_entire_life/"
    },
    {
        "id": "1pghnxf",
        "author": "Messmers",
        "title": "18 year old Gabri Valero from our academy Juvenil A, plays RW and is backed by Marcello -- our future Right Winger?",
        "content": "",
        "upvotes": 626,
        "comments": 78,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ia65f5ew3s5g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pghnxf/18_year_old_gabri_valero_from_our_academy_juvenil/"
    },
    {
        "id": "1ph2ekt",
        "author": "Bunchdawg",
        "title": "Just as a note, we are in the same position as last year, with worst GD",
        "content": "Xabi can now be judged more fairly against Don Carlo because he’s facing the same type of adversity Ancelotti dealt with. With several of his key signings, many of the same profiles Carlo requested, lost to injury or suspension, Xabi is finally experiencing what it means to scramble for solutions in real time. He now understands the frustration of preparing for big games with half a squad unavailable and being forced to rely on players like Lucas Vázquez, who always steps up but isn’t meant to be the centerpiece of a title-chasing team. This stretch will reveal Xabi’s adaptability, man-management, and tactical creativity in the same pressure cooker Carlo survived for years, making the comparison between the two far more legitimate.",
        "upvotes": 39,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/d1un44tvjw5g1.jpeg?auto=webp&amp;s=2a33f0f599fd31592117fe340d648ca27d3aa05f"
        },
        "permalink": "/r/realmadrid/comments/1ph2ekt/just_as_a_note_we_are_in_the_same_position_as/"
    },
    {
        "id": "1pgm46g",
        "author": "Swastik1504",
        "title": "Past is the Present.",
        "content": "Camavinga or Arda Guler: Who will fit the Xabi project long term?\nMy take:\nIts 2016 all over again. Zidane had a tough choice to make between Casemiro and James Rodriguez. Fans wanted James, some news portals said the then attackers liked James too(more goal scoring chances for them), fans even called the Brazilian 'Cancermiro' but Zidane took a bold decision and chose  defensive stability over offensive threat. \nResult: The legendary KCM trio, one of the most successful periods in club history.\n\nThe Camavinga and Arda Guler story rings a similar bell.\nBut its different. Though James and Arda Guler are prolific #10s but Casemiro was a CDM and Camavinga is an all phase monster. \n\nArda Guler is good but out of the two only Camavinga is generational. Arda Guler is well liked by fans and Mbappe but Camavinga is not far behind, he is liked by fans and Mbappe is his compatriot. \n\nWhen the time comes, Xabi will have to make the big decision , it remains to be seen if he has the nerves of steel that Zidane had. I wish the decision comes sooner rather than later.\n\nTell me your thoughts.",
        "upvotes": 185,
        "comments": 40,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pgm46g/past_is_the_present/"
    },
    {
        "id": "1pgtjjj",
        "author": "Specialist_Doctor_34",
        "title": "Militao Injury againat celta vigo",
        "content": "[https://x.com/realfrance\\_fr/status/1997764787002888540](https://x.com/realfrance_fr/status/1997764787002888540)\n\nWith militao out we don't even have enough centerback to play against city. Dean huijsen is most likely to participate in the training session but there is no way he start after a long week out. Rudiger and asencio are our most likely centerback against city.",
        "upvotes": 77,
        "comments": 58,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pgtjjj/militao_injury_againat_celta_vigo/"
    },
    {
        "id": "1pgqck5",
        "author": "scoreboard-app",
        "title": "Match Thread: Real Madrid vs RC Celta de Vigo Live Score | LaLiga 25/26 | Dec 7, 2025",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1pgqck5)",
        "upvotes": 94,
        "comments": 5813,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pgqck5/match_thread_real_madrid_vs_rc_celta_de_vigo_live/"
    },
    {
        "id": "1ph4ifc",
        "author": "SushanX",
        "title": "Only two defenders in the next LaLiga game. Talk about being F*****",
        "content": "",
        "upvotes": 12,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nlJZgg8dzUSsSFY9OKnBz4eUnsoDDIin-ZNQxZRRA9c.jpeg?auto=webp&amp;s=de5b4b55d6a60004140514c358b6f67968dca7d9"
        },
        "permalink": "/r/realmadrid/comments/1ph4ifc/only_two_defenders_in_the_next_laliga_game_talk/"
    },
    {
        "id": "1ph76ww",
        "author": "NotoriousYY",
        "title": "Who do you think is the right coach?",
        "content": "I’ve always defended Xabi, but i think it’s too early for him to manage Real Madrid. That season he had with Leverkusen made me think that he’s the one but i guess he can’t handle the pressure of managing a high tier club.\n\nSo let’s say he’s going to get sacked, who do you think is the right man for this job ? Do y’all want Zizou or another one ?",
        "upvotes": 6,
        "comments": 21,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ph76ww/who_do_you_think_is_the_right_coach/"
    },
    {
        "id": "1ph6xmi",
        "author": "chunchunmaru1129",
        "title": "Please just use 3-5-2 again",
        "content": "We were doing so well in the club world cup with this formation.We basically did a midfield overload with how many players we had there. \n\nAnd we dominated possession in every match in the club world cup except for that PSG game where we changed formation to 4-3-3 and got absoulutly destroyed. \n\nPlease use 3-5-2:\n\nBack 3 of Huijsen, Tchoumeni and Militao. \n\nWing backs being Trent and Carreras. \n\nDouble Pivot being Camavinga and Valverde.\n\nCam being Güler. \n\nAnd the 2 strikers being Jude and Mbappe with Gonzalo and Vini being the replacement. \n\nPlease Xabi just bench One of Mbappe or Vini because you absoulutly can't use both in the same playing 11 at the same time heck even CR7 came of the bench while playing under Zidane. \n\nPlease Xabi show some guts and use the tactic that worked the best for you. \n\nPlease just go back to using 3-5-2 again. ",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ph6xmi/please_just_use_352_again/"
    },
    {
        "id": "1pgpwtg",
        "author": "Sl_PROXY",
        "title": "Starting XI vs Celta Vigo",
        "content": "",
        "upvotes": 42,
        "comments": 69,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pgpwtg/starting_xi_vs_celta_vigo/"
    },
    {
        "id": "1pgqj78",
        "author": "AbuElKess",
        "title": "Real Madrid vs. Monaco - reasonable tickets",
        "content": "Hello,\n\nI am looking to buy tickets for the match against Monaco in Champions Leauge and was wondering what is the best way to get tickets? I found some for the seats above for 430 euro and was wondering if it was a reasonable price.\n\nNever been to Real Madrid match before. So I have no idea of what is considered reasonable anyone have an idea?",
        "upvotes": 24,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8l4elj2ayt5g1.jpeg?auto=webp&amp;s=6f8103c7e4157a9a75c861dc9fb37100658b4344"
        },
        "permalink": "/r/realmadrid/comments/1pgqj78/real_madrid_vs_monaco_reasonable_tickets/"
    },
    {
        "id": "1pgmrp9",
        "author": "IcefoxX5",
        "title": "Zamora CF 1-[2] Real Madrid Castilla - Jorge Cestero 67'",
        "content": "",
        "upvotes": 38,
        "comments": 4,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/4mze28za8t5g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pgmrp9/zamora_cf_12_real_madrid_castilla_jorge_cestero_67/"
    },
    {
        "id": "1pgmck4",
        "author": "IcefoxX5",
        "title": "Zamora CF 1-[1] Real Madrid Castilla - Dani Yáñez 48'",
        "content": "",
        "upvotes": 25,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/e24bwl975t5g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pgmck4/zamora_cf_11_real_madrid_castilla_dani_yáñez_48/"
    },
    {
        "id": "1ph7lv1",
        "author": "IhaveNocluereallyy",
        "title": "The Real reasons it is not working",
        "content": "I see here a lot of comments - \"Vini needs to go\" or \"Xabi's time is up\", the nature of humans is to look for a \"huge problem\" that causes everything instead of admitting that there are a lot of problems.\n\nThe Real reasons everything is not working is that the player's influence on each other is not positive, even if they are unaware of that. Each and every one of them is a good player don't be fooled by our performance, but the set of skills each of them brings to the table doesn't correlates with the set of skills the players' needs in order to thrive. For my example I will take Camavinga, he is a great tackler, fast but maybe alongside Tchou and Bellingham which also own the same set of skills, they need someone much more creative and pushing forward kind of player, which is why Guler is being played, but if guler is playing bad at this role everything collapse like a house of cards in the midfield. In the attack the set of skills Mbappe brings is not correlated to what Vini needs. Mbappe nature is to go to the wings or stay on the edge of the box while vini needs someone inside the box. Finally the fact that there is no natural right wing just narrows the creativity of all players because they feel like nothing could happen on this side, opponents are aware of that and it makes their life much easier.\n\nThe truth is that we need to let go to atleast 4-6 players (again not because they aren't good) in order to have a chance of building a team that plays like a unit.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ph7lv1/the_real_reasons_it_is_not_working/"
    },
    {
        "id": "1ph7bj4",
        "author": "Ineedhelpistaken",
        "title": "Yesterday’s loss is on Xabi and Fran, not the ref",
        "content": "Look, the refereeing decisions yesterday were debatable, sure, but we can’t hide behind that. With 10 men we actually played better football and looked more dangerous. That alone says everything.\n\nFor me this game is on two people: Xabi and Fran García.\n\nI really appreciate Xabi, but we’re approaching mid-season and the level has just dropped. The lineup was wrong. Rodrygo should’ve started, simple. When he came on he created chance after chance and actually threatened them. And if Xabi wanted more coverage wide, he could’ve pushed Valverde to full-back. We’ve seen that work before. Instead we just looked flat from the start.\n\nAnd Fran García, man… I appreciate him too, especially because last year when we had no fullbacks, he stepped up and even had a big role in that CWC run, but yesterday that red card was just stupid. No reason to tackle like that right after getting a yellow and kill the game when we were starting to get control.\n\nYeah, some calls were questionable, but honestly, focusing on the ref every week is just tiring. We need to fix ourselves first. \n\nWhat frustrates me the most is this: our players actually played amazing with 10. The energy, it was all there. So why can’t we start games like that from minute one? We shouldn’t have to wait for a disaster to wake up.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ph7bj4/yesterdays_loss_is_on_xabi_and_fran_not_the_ref/"
    },
    {
        "id": "1ph792n",
        "author": "BookHour5516",
        "title": "The Timeless Tale of Misplaced Blame",
        "content": "Reading the sub these days is probably the hardest part of being a Madridista. My dear friends, Vini is not 'washed'; Fede is not 'lazy'. They're just forced to play in a system that doesn't suit them. Players don't lose their calibre in a year, and miraculously find it under a good manager. \n\nFootball may appear individualistic to the naive, however, it is an incredibly tactical game. Blaming a player is akin to blaming a pawn for losing a chess match. \n\nXabi has been stubborn about his 4-4-2, while managing some of the world's best wingers. A 4-4-2 by design allows less space for the wingers, who often find themselves double-marked even before they touch the ball. It's painful to watch a player of Vini's calibre trapped in the box and forced to invert as a striker, and then get blamed for a poor performance. This stubbornness has led to the downfall of Rodrygo and the apparent inflation of Arda, who clearly needs more time to adapt to such a high responsibility. \n\nEven Gareth Bale, upon returning from injury in 2018, was benched for Isco to accommodate Zidane's 4-4-2. Oldies in this sub like me (beg your pardon) would all too well remember Isco's re-emergence under Lopetigui, whose setup is not quite dissimilar to Xabi's. \n\nWe need to revert to the familiar 4-3-3 (which Xabi is inept at), or it may take a year or so to get used to this Barcelona-esque system. Until then, I pray our players are spared the vitriol.",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ph792n/the_timeless_tale_of_misplaced_blame/"
    },
    {
        "id": "1ph6gqi",
        "author": "serbiangandalf",
        "title": "What do you think about Xabi?",
        "content": "In my opinion Real just doesn't work with strict coaches like Xabi through history. We alaways had the best results with coaches who were great at man management rather than being master tacticians, like Zidane, Carlo, Del Bosque. I don't think Xabi's strict football will work with the likes of Vini or Rodrygo.",
        "upvotes": 1,
        "comments": 34,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ph6gqi/what_do_you_think_about_xabi/"
    },
    {
        "id": "1pgjj28",
        "author": "ManuMora98",
        "title": "[Basket] Sergio Llull wins the game in the last second against La Laguna Tenerife (70-71)",
        "content": "",
        "upvotes": 21,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4hs9EYjVJTH-f8qv1cfcV-qhtQ1YU-yCRV-DHscAjdM.jpeg?auto=webp&amp;s=e0c65ba140aedb51af87da97a38b1323193da091"
        },
        "permalink": "/r/realmadrid/comments/1pgjj28/basket_sergio_llull_wins_the_game_in_the_last/"
    },
    {
        "id": "1ph4ceu",
        "author": "Brawn132",
        "title": "Mastantuono could be a threat",
        "content": "Earlier today I heard somebody say that we need to be a threat on both sides of the pitch and right now we are too left dominant. I feel like going back Mastantuono could fill that position. People complained about him so much but something about him is he does put the effort in. Perhaps with a little development he can film the right wing void. What do you guys think??",
        "upvotes": 0,
        "comments": 25,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ph4ceu/mastantuono_could_be_a_threat/"
    }
]