[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 489,
        "comments": 258,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1ia3wns",
        "author": "krazykatz911",
        "title": "Cancelling after 20 years",
        "content": "Price increase again.   $24.99 a month.  $300 a year.  Just plain ripoffs.  \n\nI’ve been a customer for 20 years.  Never again.  \n\nThe content is garbage.  \n\nA lot of the shows/movies are in different languages.  Which is fine but allow the user to select what languages they only want to see.  Not mix it all together and you have to start playing it to find out. \n\nA lot are old and available free on prime anyway.  \n\nThe keep raising the rates like it’s something people can’t live without. \n\nI got 4 streaming services for less than half of what Netflix wants a year. \n\nGoodbye greedy Netflix. ",
        "upvotes": 2248,
        "comments": 442,
        "media": null,
        "permalink": "/r/netflix/comments/1ia3wns/cancelling_after_20_years/"
    },
    {
        "id": "1iafu8x",
        "author": "johnppd",
        "title": "Netflix won the streaming wars, and we’re all about to pay for it",
        "content": "",
        "upvotes": 233,
        "comments": 128,
        "media": null,
        "permalink": "/r/netflix/comments/1iafu8x/netflix_won_the_streaming_wars_and_were_all_about/"
    },
    {
        "id": "1iagsqk",
        "author": "cu_when_i_cu",
        "title": "Netflix will keep raising prices, they want you to downgrade because they make more money off ads.",
        "content": "Old DVD subscriber here, unsubscribed this weekend. Won't won't sign back up until there's a number of shows to watch, binge and then disconnect again.",
        "upvotes": 209,
        "comments": 72,
        "media": null,
        "permalink": "/r/netflix/comments/1iagsqk/netflix_will_keep_raising_prices_they_want_you_to/"
    },
    {
        "id": "1ia2zgv",
        "author": "stellacampus",
        "title": "Anyone else think \"WTF is \"Emilia Pérez\"?\" when they saw 13 Oscar nominations?",
        "content": "Emilia Pérez got 13 Oscar nominations, more than any other movie, and I had never even heard of it until recently.  In all the time it's been on Netflix, I've never seen it suggested in any of the lists I've perused on my home page.  If I had seen it, I probably wouldn't have watched it - I mean it's a French movie, in Spanish only, about a trans gangster in Mexico, and it's a musical to boot.  Now of course I have to at least give it a shot!",
        "upvotes": 406,
        "comments": 77,
        "media": null,
        "permalink": "/r/netflix/comments/1ia2zgv/anyone_else_think_wtf_is_emilia_pérez_when_they/"
    },
    {
        "id": "1iav59m",
        "author": "darkdevilxy",
        "title": "Something like Dark and 1899.",
        "content": "Hi, can you guys please suggest me shows like Dark, 1899 and Three Body Problem. A big and mysterious event is slowly unraveled over the course of the series. Something with not more than 3 seasons.",
        "upvotes": 7,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1iav59m/something_like_dark_and_1899/"
    },
    {
        "id": "1iah0t1",
        "author": "Original2021",
        "title": "Night agent season 2 worked against the entire premise of the show",
        "content": "The entire show is built around a premise that a night agent is the most elite intelligence officer that exists. Yet Rose, with no training is running around meddling in highly sensitive missions. I couldn't even finish the season. Its obvious the writers wanted Rose to have a presence during the season but this made the plot unbelievable. It's too bad because the lead actor could  have easily carried the series without the other character helping him. ",
        "upvotes": 17,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1iah0t1/night_agent_season_2_worked_against_the_entire/"
    },
    {
        "id": "1iappis",
        "author": "ExistanceIsKeyToLife",
        "title": "Drop your best drama shows!",
        "content": "I've really enjoyed Unorthodox, Maid, Caliphate, Yellowjackets, Baby Reindeer, Unbelievable, The Hijacking of Flight 601, Pantheon and The Mothers of Penguins, so I'm looking for similar vibes. I also liked Black Mirror (except for the last season), Love, Death and Robots and Blue Eye Samurai.\n\nGlow, Beef and The Glory were also decent watches.\n\nThanks in advance!",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iappis/drop_your_best_drama_shows/"
    },
    {
        "id": "1iapfqz",
        "author": "South_Advantage2461",
        "title": "Movies/Series suggestions",
        "content": "Okay so I watched Anne with an E and i loved it. I want to watch similar or even better movies or series romantic,fantasies, dramatic,old school and yea 🍒 on top if it's british so suggest me some. And yea I don't watch series that often I've only watched few and would like to watch more so movies appreciated and if series then I'll be thankful. ( I get bored easily and quit watching so please suggest me something which will grab all of my attention and get me excited  I prefer old school romance and delusional people in love)...",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iapfqz/moviesseries_suggestions/"
    },
    {
        "id": "1iamjxk",
        "author": "stelio_contos68",
        "title": "Consider pausing your subscription​",
        "content": "I enjoy a lot of the original conflict Netflix offers but I don't need twelve months of subscription to watch it. So, a couple times a year I go to account settings and pause my subscription. \n\nIf you're just looking for something to watch then use a free or cheap platform. If you like Netflix-specific content then subscribe but take a month off here and there.\n\nI know it's petty but it make me feel like I'm winning lol \n\nAlso, I downgraded to standard on the last price hike and didn't notice a difference.\n\nHow this helps someone.",
        "upvotes": 5,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1iamjxk/consider_pausing_your_subscription/"
    },
    {
        "id": "1ia2id7",
        "author": "HehroMaraFara",
        "title": "Night Agent Season 2 = Massive Disappointment",
        "content": "I loved the first season and did not expect much from it, which might have been key. \n\nI was hoping for more of the same understated approach with brief bursts of action and situational resolution. \n\nThis was not that. This was a convoluted mess of overly complicated ideas and plot lines, with random characters that are just an inch deep on development. I’m not even gonna mention the whole first couple of episodes of him being a basketball coach protecting a kid from an abduction. They sooooo loosely tied it in with the main story that they might as well of labeled it as the “Peter is a great guy, remember?” Prologue. \n\nThe story is generally boring. They made Rose sadly annoying and inexplicably demanding and entitled. It got so stupid and lost that the head of the program was forced to say, in literal dialogue “Night Agent missions often hit deadends” as if accidentally being caught on a hot mic trying to explain away why there are so many dumb unnecessary twists. \n\nWatch season one and pretend this doesn’t exist. ",
        "upvotes": 97,
        "comments": 130,
        "media": null,
        "permalink": "/r/netflix/comments/1ia2id7/night_agent_season_2_massive_disappointment/"
    },
    {
        "id": "1iaq7yw",
        "author": "Emotional-Pop-4621",
        "title": "The night agent",
        "content": "It seems like rose is on the same page as some of us also",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iaq7yw/the_night_agent/"
    },
    {
        "id": "1iatv5s",
        "author": "Usual_Fig_1438",
        "title": "I'm seeing no anime and very little shows in general, on Netflix, that aren't Netflix originals.",
        "content": "Am I just experiencing a glitch or is this an established thing that Netflix does every once in a while? Because I have tried on both my phone and Xbox, and I'm seeing the exact same thing: the majority of the content being Netflix originals. I also experienced this a couple weeks ago, but it went back to normal like an hour later, which is why I'm asking if it's an established thing or not.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iatv5s/im_seeing_no_anime_and_very_little_shows_in/"
    },
    {
        "id": "1iaslmd",
        "author": "Joker_JG",
        "title": "Vikings no subs at certain points",
        "content": "Netflix always do this and its annoying. When they speak a foreign language they don't put the subs in those parts like they do on tv or box set. Vikings switch between English and other languages it's cool but it's pointless if you don't speak them ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1iaslmd/vikings_no_subs_at_certain_points/"
    },
    {
        "id": "1iasceu",
        "author": "onlyeckles_",
        "title": "Kicked out on all devices - can't find active account to log back in",
        "content": "So we went to watch netflix tonight, and have been logged out of the app on the TV.  We tried to log back in but couldn't remember the password, checked on our phones and have been logged out there also.\n\nPassword has been reset, but now when logging in we get a 'Finish signing up to start watching' page, when we're been subscribers for years and most recent payment was less than a month ago.\n\nAny idea what's happened or might be causing this?  Don't wanna just follow the finish signing up process and end up paying 2 subscriptions 🤷🏼",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iasceu/kicked_out_on_all_devices_cant_find_active/"
    },
    {
        "id": "1iam7nv",
        "author": "OrthodoxPrussia",
        "title": "English subtitles not available in my location?",
        "content": "Not US. English subs are usually available for TV shows, but I've started watching an anime and they're not there, only local subs and a neighour country, and Japanese. I tried changing the language settings for no effect. The subs in the local language are really bad, and sometimes I'm somewhere I don't speak the language at all. \n\nAnything I can do to add English subs to the sub list. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iam7nv/english_subtitles_not_available_in_my_location/"
    },
    {
        "id": "1iam60w",
        "author": "s168501",
        "title": "Choose love 2023 Poland",
        "content": "So I've heard about these interactive movies recently and wanted to give a try out for the one in the title... I cannot open it though now... I am based in PL. Is it avaialable only in US? \n\nKind regards, thanks\n\nhttps://preview.redd.it/z1z1ylx0tdfe1.png?width=2096&amp;format=png&amp;auto=webp&amp;s=5f0c6974165eb190e3bb712cebb9ea055a749357\n\n",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iam60w/choose_love_2023_poland/"
    },
    {
        "id": "1iapu2j",
        "author": "HydrateEveryday",
        "title": "(SPOILERS) All The Light We Cannot See is an offensively poor representation of the story told in the book",
        "content": "I haven’t had Netflix for an extremely long time. Like a decade or more. Recently I finished reading All The Light We Cannot See. It’s an outstanding story that deserves the Pulitzer Prize it was awarded. I learned that Netflix made a 4 episode mini series and couldn’t want to watch it. So I actually subbed for a month JUST to watch this. \n\nVery early into episode 1 and I was already saying “uh oh”. It’s got some pretty cheesy acting. The actress that plays Marie looks nothing like how she’s described in the book. Nobody has an accent that makes sense. I know people say Mark Ruffalo had the worse accent, but ignoring that I thought he actually played the role decently well. All of that is stuff I can ignore, though. \n\nThe real issue is half the story didn’t end up in the show. Like minimum half the story. Probably more is missing in reality. And with it, half the characters are gone, too. The story that did manage to make it into the show had nearly every aspect of it changed. I can’t think of anything original from the book that made its way into the show. Characters who never met in the book have screen time together. Who lives and dies is changed. Characters who don’t kill anybody are suddenly gunning people down. The ending is changed. I mean it’s seriously almost an entirely different story. Which is frustrating when you know the amazing story that this was sourced from. \n\nHad I never read the book, I’d probably have watched it and thought “meh”. But knowing what they did to butcher this, I have to call it a complete failure. It doesn’t manage to capture anything about the original story it’s supposed to represent. \n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iapu2j/spoilers_all_the_light_we_cannot_see_is_an/"
    },
    {
        "id": "1iaj75g",
        "author": "Dynleran",
        "title": "Can’t get Netflix audio captions to turn off. Help!",
        "content": "Thiis just happened to us last night. Suddenly when we attempted to watch a movie, Audio Captions came on. We watch Netflix all the time and this has never happened. It’s on both TV’s and our laptop. AND we can’t get it to turn off. Even if we check “English” (without CC) it doesn’t turn off. Instructions say to go device settings …BUT WHAT DEVICE? We use a  fire stick and we can’t find a “settings” so annoying. Popcorn ready…friends over…couldn’t watch any movie!!!\n\nAny help would be greatly appreciated. ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1iaj75g/cant_get_netflix_audio_captions_to_turn_off_help/"
    },
    {
        "id": "1iaeo5m",
        "author": "katheryn_gamer_girl",
        "title": "household questions",
        "content": "hii\n\nSo I used to live in Philippines for a year and half and setup my Netflix account there because I have a girlfriend and we share the account and I opened on June 2022\n\nI had to return home to the states in Nov 2023 and it didn't give my girlfriend a temporary access code until Nov or Oct 2024 and I gave it to her and I stopped using Netflix at that point and she is the one mainly using it now\n\nmy question is I logged in yesterday and started watching a movie I can only find on Netflix, will my girlfriend still get a temporary code again or will I or will the systems not even notice?\n\nI checked and she had logged in after I had watched last and the temporary code would be sent to me if she tried to log in for a temporary duration but that never happened \n\nThanks!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iaeo5m/household_questions/"
    },
    {
        "id": "1iaebol",
        "author": "luddecrous",
        "title": "Netflix changing age rating when changing profile picture",
        "content": "I have age restrictions on my kid’s profile, 10+ and down. Recently my kid discovered that when they change their profile picture, suddenly they have access to everything, no restrictions. I received an email from Netflix saying age restrictions had been removed and subsequently started digging into why this was. \n\nAfter some digging I realized that when a profile with age restrictions on changes their profile picture, the age restriction disappears. It didn’t fail once. Has anyone else had this bug/problem? I have an LG TV with WebOS if it makes a difference. I tried changing the profile picture on my kid’s profile on my phone and nothing happened, so it seems to be an LG problem perhaps?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iaebol/netflix_changing_age_rating_when_changing_profile/"
    },
    {
        "id": "1i9lgow",
        "author": "Whobitmyname",
        "title": "‘Pantheon’ Season 2 to Stream For The First Time on Netflix, All 8 Episodes Premiere February 21",
        "content": "",
        "upvotes": 107,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1i9lgow/pantheon_season_2_to_stream_for_the_first_time_on/"
    },
    {
        "id": "1ia6z3z",
        "author": "BearFluffy",
        "title": "Security breach and server down?",
        "content": "Was having trouble logging into my TV that's setup. Tried logging in but my account email couldn't be found, then saw I had an email that my email changed. I tried contacting but huge likes they're just redirecting...was I hacked or were a bunch of people?",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ia6z3z/security_breach_and_server_down/"
    },
    {
        "id": "1iablph",
        "author": "Additional_Thanks927",
        "title": "Dragon ball daima",
        "content": "Dragon ball was released in English on crunchy roll and in theaters but netflix only has the Japanese version when can we expect them to release the English dub or are they only permitted to show the Japanese original?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iablph/dragon_ball_daima/"
    },
    {
        "id": "1iab2pa",
        "author": "Horror-Perception792",
        "title": "Unable to watch anime",
        "content": "Whenever i try to watch anime on netflix i always get pardon the interruption error .While other series work fine and i never get that error but this happens only while watching anime. Please help to resolve this is issue",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iab2pa/unable_to_watch_anime/"
    },
    {
        "id": "1ia2hfp",
        "author": "gullzway",
        "title": "When does the price increase happen?",
        "content": "My Standard no Ads plan renews on Feb. 7th. No indication that the price is increasing, nor communication from Netflix about it.  \n\nWill it just charge me $17.99 on 2/7?\nIf so I may change to the ads plan before then.",
        "upvotes": 5,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1ia2hfp/when_does_the_price_increase_happen/"
    },
    {
        "id": "1iargq9",
        "author": "Sudden_Pop_2279",
        "title": "Squid Game Actor Might Have Accidentally Revealed Their Season 3 Demise",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iargq9/squid_game_actor_might_have_accidentally_revealed/"
    },
    {
        "id": "1ias5op",
        "author": "nomanskyprague1993",
        "title": "Thank you for absolutely destroying the movie business",
        "content": "I can’t remember the last time I put some movie on Netflix and was blown away or even interested in the story, plot, twist or even script. I just don’t believe even a little bit what I’m watching.\n\nJamie Foxx and Cameron Diaz are spies but turns out the Cameron has issues with her mum so in the middle of some mission they now deal with this issue of not being loved. Then Cameron’s and Jamie’s  kids get kidnapped and they all bond together with the mum  too save the kids and save London….(mind blasting!) \n\nFight scenes are so unbelievable corny we literally watched one guy in the background just punch the air 😂 \n\nOf course it’s most important to get the key buzz words in there like boomer and gen z. \n\nWhat happened to movies like law abiding citizen for example? \n\nBecause that movie was not made for Netflix! \n\nActors are barely acting, there hasn’t been an original story line in bloody years! It’s so sad watching such great actors just sell out for such mediocre projects. \n\nPlus the overload of sex scenes is a whole other level. Every time my partner puts on some movie in 10 min they’re having sex. Last time I got so angry because some guy is describing in horrific details how his father r**** him and how he kind of started to enjoy it so I turned it off because this toxic shit there putting into movies for “attention” is absolute trash and it’s gone way too far. \n\nStep up Netflix &amp; Associates. ",
        "upvotes": 0,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1ias5op/thank_you_for_absolutely_destroying_the_movie/"
    },
    {
        "id": "1i9tqqv",
        "author": "AmericanFurnace",
        "title": "Are the Turning Point documentaries any good?",
        "content": "These documentaries look interesting to me, especially the 9/11 one. But I do know that Netflix documentaries don't have that good of a reputation. So I'd like to know if these Turning Point documentaries are good documentaries or just outright terrible.",
        "upvotes": 12,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1i9tqqv/are_the_turning_point_documentaries_any_good/"
    },
    {
        "id": "1ia4n0f",
        "author": "DarkSoulCarlos",
        "title": "Question about show called \"freaks\"?",
        "content": "This is a long shot, but does anybody recall a show that was on Netflix called \"Freaks\"? I was going through my to watch list and I had written down \"Freaks\" but when I type in \"Freaks\", all I get are two movies, but no TV show. I tried searching on Google and all I find are the movies and Freaks and Geeks, except for one wiki which says that it was an HBO show about people with powers, but I can't find anything else about it. If anybody has any info, it would be greatly appreciated. Thank you for your time :)\n\n  \nEdit: [https://ideas.fandom.com/wiki/Freaks\\_(TV\\_Series)#Antagonists](https://ideas.fandom.com/wiki/Freaks_(TV_Series)#Antagonists) This seems similar to what I saw but I cannot find this credited on the IMDB page of any of the cast members mentioned on the Wiki. And there are some big names on that list. It makes no sense. What a mystery. ",
        "upvotes": 1,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1ia4n0f/question_about_show_called_freaks/"
    },
    {
        "id": "1iaj2rc",
        "author": "ZainVstar456",
        "title": "Netflix SpongeBob Glitch",
        "content": "I was watching SpongeBob, The Legend of Boo-kini Bottom in Netflix, when SpongeBob And Patrick were shaking, I paused it, so I saw SpongeBob had 4 eyes? And Patrick Had Three? And an Extra Mouth? And Hemet. So anyone discuss about it?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iaj2rc/netflix_spongebob_glitch/"
    }
]