[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 2,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 13,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1r0ea4s",
        "author": "TheOstrich369",
        "title": "A small act of kindness in Torino that I won’t forget",
        "content": "Last week I was in Torino for a conference, and Friday, February 6, was my last day in the city — and it ended with a really beautiful moment. I was traveling with my mother and we tried to buy tickets for tram 16 using the app, but it didn’t work, so I did what everyone does and asked a guy nearby if there was another way to pay (SMS, card inside the tram, anything). He was incredibly kind, explained everything patiently, and told me we could try paying by card on the machines inside the tram. Well… surprise — they weren’t working either. So what did this awesome stranger do? He offered to pay for both our tickets. After that, I tried to give him the money (cash or Revolut), but he wouldn’t accept anything and simply said it was nothing. Maybe this doesn’t sound like a huge deal to some people, but I was truly touched. I come from a modest family and I work hard for every penny, so this gesture meant a lot to me personally — it wasn’t about the price of the tickets, it was about the kindness. I also feel a bit disappointed with myself because I didn’t get to talk to him more; I was nervous leaving my mom alone (she understands Italian but doesn’t speak English, and she’s older), so I had to move down the tram. But honestly, this guy made my day. He was warm, smiling, genuinely interested in talking — just a really good human being. So this is why I’m writing here: I don’t know if you’ll ever see this, but if you’re reading, thank you for your help, your generosity, and your kindness. You said the tickets weren’t expensive, but for me, the gesture was powerful. Please stay exactly the awesome person you are.",
        "upvotes": 119,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1r0ea4s/a_small_act_of_kindness_in_torino_that_i_wont/"
    },
    {
        "id": "1r0jqfb",
        "author": "New-Trifle-7544",
        "title": "Book club a Torino!",
        "content": "Ciao! Mi sono da circa un mesetto trasferita a Torino, sono una ragazza di 24 anni al primo anno magistrale, mi piacerebbe molto trovare un club del libro a cui andare, io vivo in San Salvario. Ogni consiglio è ben accetto! Grazie :)",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1r0jqfb/book_club_a_torino/"
    },
    {
        "id": "1r098de",
        "author": "OverhandLake69",
        "title": "mi hanno rubato la bici. Se qualcuno ha informazioni, mi contatti!!!",
        "content": "Sorry my italian isn't very good, I moved here a few months ago. \nIt was parked in my courtyard, the bike lock was stuck so it had been sitting there for a while. This is in the Centeo area.",
        "upvotes": 14,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1r098de/mi_hanno_rubato_la_bici_se_qualcuno_ha/"
    },
    {
        "id": "1r0i7oq",
        "author": "-xGarnet99x-",
        "title": "Per disegnare..",
        "content": "Conoscete qualche negozio piuttosto serio che venda articoli per disegnare/dipingere/chi più ne ha ne metta? \n\nIl classico negozio dove un appassionato spenderebbe tutto il suo stipendio se potesse.\n\nIn sostanza stavo cercando dei buoni Sketchbook e matite, grazie! ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1r0i7oq/per_disegnare/"
    },
    {
        "id": "1r03xao",
        "author": "Hungry_Kale8330",
        "title": "Oneshot di Dragonbane in biblioteca - cercasi players",
        "content": "Ciao gente!  \n  \nMi chiamo Massimo, faccio il bibliotecario e sono un nerdone. Nella biblioteca dove lavoro sto cercando di organizzare un appuntamento ricorrente per delle sessioni di GDR aperte a chiunque, a prescindere dal grado di esperienza.   \n  \nSiccome in questo subreddit ho letto parecchi post di persone che cercano un party per giocare, ho pensato di condividere la locandina dell'evento. Faremo una oneshot di Dragonbane, personaggi pregenerati e partecipazione completamente gratuita.\n\nSe vi va, ci sono ancora un paio di posti liberi. Ciao!",
        "upvotes": 10,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/sm8pnpkaxgig1.png?auto=webp&amp;s=7ae2a674f2082a24feafbf45506283c3fffa6721"
        },
        "permalink": "/r/torino/comments/1r03xao/oneshot_di_dragonbane_in_biblioteca_cercasi/"
    },
    {
        "id": "1r0m61i",
        "author": "startcinematography",
        "title": "Turin is more than a collection of sights; it is an experience where light, history, silence and an indescribable beauty come together.........Torino nem csupán látnivalók sora, hanem élmény: fény, történelem, csend és egy megfoghatatlan szépség találkozása.",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/l8aYCpwdsHIp7XyYCjvfXnlhwkOZnIlPBVzpJpmUmoc.jpeg?auto=webp&amp;s=556c90f90019df5c3b3e9e1ea040e1257eb9ac02"
        },
        "permalink": "/r/torino/comments/1r0m61i/turin_is_more_than_a_collection_of_sights_it_is/"
    },
    {
        "id": "1r0m30x",
        "author": "lilyssmx",
        "title": "chi vuole far parte di una band?",
        "content": "ciao a tutti, mi chiamo isabella e cerco qualcuno che sia disposto a creare una band, io vivo in zona alessandria, ma posso muovermi. \n\ncanto  e scrivo, solo che non sono capace a suonar nulla (disposta ad imparare uno strumento), il genere che vorrei fare é indie pop, ma sono aperta a sperimentare più di un genere, ascolto tanta musica diversa quindi mi piacerebbe non fermarmi a un genere solo. \n\ngli artisti da cui prendo più ispirazione sono: baby bugs, we are dirt, her’s, the neighbourhood, mitski, bambi baker ecc, per menzionarli pochi.\n\nsolitamente scrivo testi che hanno una melodia soft, dolce, ma le parole sono più sul macabro e tristi, per me quello che dico devo avere sempre un grande impatto emotivo e per la maggior parte dei testi, sono in inglese, un paio in italiano, ma fare un mix non é una cattiva idea.\n\nho una marea di testi pronti per chi fosse interessato! ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1r0m30x/chi_vuole_far_parte_di_una_band/"
    },
    {
        "id": "1r0c3a3",
        "author": "IzanamiNoCane",
        "title": "Consigli ristoranti per questo weekend? Tutto pieno 😅",
        "content": "Ciao a tutti, sto bestemmiando.\n\nQuesto weekend andrò a torino  per la prima volta in vita mia.  \nSto cercando un posto carino dove andare a mangiare venerdì e sabato sera, ma dopo aver chiamato un po’ di ristoranti che avevo in mente ho trovato praticamente tutto occupato.\n\nAvete qualche consiglio su posti dove si mangia bene e dove magari si riesce ancora a trovare posto all’ultimo?  \nVorrei qualcosa di tipico, zona centro/San Salvario/Crocetta ma ho la macchina e mi sposto senza problemi se ne vale la pena.\n\nGrazie mille a chi risponde 🙏",
        "upvotes": 3,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1r0c3a3/consigli_ristoranti_per_questo_weekend_tutto_pieno/"
    },
    {
        "id": "1r077cv",
        "author": "DDDDAZED",
        "title": "Rimappo centralina ECO (da professionisti) su Torino",
        "content": "Ciao Reddit,\n\nsto pensando di ri-mappare la centralina del mio GLK, non lo voglio fare per fare le fiamme e mettere i neon, vorrei una mappa ECO perché praticamente è una petroliera, ma la macchina ha pochi KM e obiettivamente è troppo comoda, se riuscissi ad abbattere i consumi sarei contento.\n\nQualcuno conosce centri specializzati e seri che fanno questi lavori?  \nNon proponetemi cugini\\\\amici\\\\parenti perché non li prenderei in considerazione.\n\nGrazie",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1r077cv/rimappo_centralina_eco_da_professionisti_su_torino/"
    },
    {
        "id": "1qzx8vd",
        "author": "Putrid_Vegetable8735",
        "title": "Due settimane vuote",
        "content": "Ciao ho 22 anni, sono uno studente fuorisede. Ho finito gli esami della sessione e ora mi restano due settimane completamente vuote qui a torino prima dell'inizio delle lezioni. Praticamente non ho amici e penso che la noia si farà sentire. Che cosa potrei fare nei prossimi giorni? Ci sono dei luoghi carini da visitare nei dintorni di Torino? Esistono gruppi che fanno escursioni facili? \n(Se qualcuno/a vuole scrivermi per due chiacchiere io ci sono)",
        "upvotes": 7,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1qzx8vd/due_settimane_vuote/"
    },
    {
        "id": "1qzfxv1",
        "author": "Individual_Bug_517",
        "title": "Domanda forse stupida sul nuoto a Torino",
        "content": "    CIAO. Mi scuso in anticipo, non parlo italiano (ancora), quindi ho dovuto Google Translate. Allora sono a Torino da qualche mese e vorrei andare a nuotare in una delle piscine pubbliche come Aquatica o Palazzo del Nuoto, ma sono aperto a consigli. Le mie domande principali sono le seguenti:\n    1. Per nuotare da solo è necessario avere un certificato medico?\n    2. Quali piscine consiglieresti per le corsie di nuoto (25 o 50 m) un paio di volte a settimana la sera?\n    3. Ho cercato delle piscine e le tariffe mi sembravano molto alte solo per il nuoto (8,50 euro più 40 euro di quota di iscrizione) NUOTO ASSOCIATIVO è solo l'ingresso in piscina o è una specie di corso?  \n    \n    Grazie mille",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1qzfxv1/domanda_forse_stupida_sul_nuoto_a_torino/"
    },
    {
        "id": "1qzyxgj",
        "author": "Naso_Coraggioso",
        "title": "Come sarebbero delle ipotetiche olimpiadi estive 2036 Milano - Torino - Genova ?",
        "content": "Sarebbe fattibile ?\n\nSe non erro a Milano no n hanno uno stadio olimpico con la pista d'atletica per questo molti sport da stadio potrebbero essere divisi tra Milano e Torino, invece gli sport acquatici a Genova.\n\nChe ve pare come proposta ?\n\nSe ci fate caso tutti stanno facendo i complimenti per le olimpiadi invernali italiane",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1qzyxgj/come_sarebbero_delle_ipotetiche_olimpiadi_estive/"
    },
    {
        "id": "1qze20h",
        "author": "asilorepublic95",
        "title": "Boxe sacco",
        "content": "ciao,ci sono delle palestre di boxe dove andare e magari sfogarti solo a fare il sacco? senza dover pagare chissà cosa.",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1qze20h/boxe_sacco/"
    },
    {
        "id": "1qzq9sk",
        "author": "Tony_zer0five",
        "title": "Lego e cate",
        "content": "C'è un posto dove posso scambiare o vendere carte bakugan e pezzi lego?\nA Torino o in provincia.\nPerché ho delle carte bakugan \nE un sacco di pezzi lego diversi che vorrei vendere ho scambiare\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qzq9sk/lego_e_cate/"
    },
    {
        "id": "1qzp0oh",
        "author": "Mauriizio",
        "title": "portare 🍃 in treno",
        "content": "",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1qzp0oh/portare_in_treno/"
    },
    {
        "id": "1qzocnz",
        "author": "VelvetUltramarine",
        "title": "Qualcuno conosce la band Neon Strays di Torino?",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6VKUtKEAs4-DvIKDLhoW1nRMSVJ7EZtW4BOaMzYXQQs.jpeg?auto=webp&amp;s=1c8fc4f57bd6c4ad678fb23e9d7ad92a60c06041"
        },
        "permalink": "/r/torino/comments/1qzocnz/qualcuno_conosce_la_band_neon_strays_di_torino/"
    },
    {
        "id": "1qzihuo",
        "author": "asilorepublic95",
        "title": "Palestre",
        "content": "delle palestre che non siano mcfit, Orange,Virgin,, tutte queste commerciali che più che palestre sembrano sfilate di moda ,montati ,brlinnantinati e fili nel culo..per carità tutto lecito...però qualche palestra stile old School o qualcosa di simile zona santa Rita ,mirafiori ,san paolo?.grazie .",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1qzihuo/palestre/"
    },
    {
        "id": "1qzadah",
        "author": "AleSatt",
        "title": "Quartiere torino",
        "content": "Ciao! Mi sto trasferendo a Torino per alcuni mesi e ho trovato casa a Moncalieri corso roma ma verso piazza bengasi (di cui mi hanno parlato male) e un’altra a via beaulard. Io lavoro all’ospedale sant’anna ma piu che la vicinanza vorrei sapere quale mi consigliereste come zona per quanto riguarda la sicurezza",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1qzadah/quartiere_torino/"
    },
    {
        "id": "1qz7l4g",
        "author": "the-n-bit",
        "title": "Alimentari francesi a Torino?",
        "content": "Ciao, qualcuno sarebbe a conoscenza di posti dove comprare degli ingredienti francesi per cucinare (burro, formaggi, ecc.)?\n\nGrazie",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1qz7l4g/alimentari_francesi_a_torino/"
    },
    {
        "id": "1qzn4m1",
        "author": "alessia_1818281",
        "title": "Ciaooo cerco amicizia mi chiamo Alessia ho 26 anni",
        "content": "Ciaooo cerco amicizia mi chiamo Alessia ho 26 anni",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1qzn4m1/ciaooo_cerco_amicizia_mi_chiamo_alessia_ho_26_anni/"
    },
    {
        "id": "1qz9eib",
        "author": "NoYogurtcloset3227",
        "title": "LAUREA MAGISTRALE IN COMUNICAZIONE E CULTURE DEI MEDIA UNITO",
        "content": "Sto valutando questo corso di laurea magistrale UNITO e mi piacerebbe capire meglio com’è l’esperienza, sia dal punto di vista delle lezioni che dell’organizzazione in generale.  \nSe qualcuno ha voglia raccontarmi la sua esperienza o darmi qualche consiglio, gliene sarei davvero grato. Grazie mille!\n\nI'm evaluating UNITO master's degree program and would like to better understand what the experience is like, both from the perspective of the lessons and the organization as a whole.  \nIf anyone would like to tell me about their experience or give me some advice, I would really appreciate it. Thank you very much!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qz9eib/laurea_magistrale_in_comunicazione_e_culture_dei/"
    },
    {
        "id": "1qz6bug",
        "author": "Over_Conference_9528",
        "title": "Should I take til or sat?",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qz6bug/should_i_take_til_or_sat/"
    },
    {
        "id": "1qzixhd",
        "author": "ConstructionAny6977",
        "title": "Fumo reperibile???",
        "content": "Ciao, avete posti tipo santa giulia dove si trova fumo facilmente? ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1qzixhd/fumo_reperibile/"
    },
    {
        "id": "1qyl4tp",
        "author": "Ostr2",
        "title": "Curiosità sulla cena con scambio di coppia a 'Il cucinino di Torino'",
        "content": "E' pura curiosità. Quel tipo di serata viene solitamente organizzata in locali appositi. Ma questo è un ristorante 😁\n\nSi fanno davvero scambi di coppia o è una \"esagerazione pubblicitaria'?\n\nQualcuno ha partecipato?",
        "upvotes": 13,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1qyl4tp/curiosità_sulla_cena_con_scambio_di_coppia_a_il/"
    },
    {
        "id": "1qyricv",
        "author": "monkfishmafia",
        "title": "Can anyone help me find where this is in Torino?",
        "content": "https://preview.redd.it/22jxklyef5ig1.jpg?width=1008&amp;format=pjpg&amp;auto=webp&amp;s=b021ea4efe06b8a2582614198b853da6af8c12d4\n\nIrish guy here and I'm hoping to recreate an image a friend made standing under this 30 years ago.\n\n",
        "upvotes": 5,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1qyricv/can_anyone_help_me_find_where_this_is_in_torino/"
    },
    {
        "id": "1qylsn9",
        "author": "Exact_History6219",
        "title": "Carte Pokémon e Magic: dove posso venderle?",
        "content": "Ciao! Ho ritrovato un po’ di carte di quando giocavo da bambino a Pokémon e a Magic e vorrei vedere se c’è qualcosa che abbia senso vendere. \n\n**C’è qualche negozio fisico che mi consigliate?**",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1qylsn9/carte_pokémon_e_magic_dove_posso_venderle/"
    },
    {
        "id": "1qy9vg1",
        "author": "Comfortable_Room6619",
        "title": "La mia psicologa mi ha ghostato",
        "content": "Ciao a tutti, \n\nÉ una settimana che provo a contattare la mia psicologa ma non mi risponde piu. Possibile l’abbia fatta impazzire? Haha\n\nAd ogni modo, qualcuno conosce degli psicologi economici a torino per studenti e disoccpati?\n\nGrazie ",
        "upvotes": 15,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1qy9vg1/la_mia_psicologa_mi_ha_ghostato/"
    },
    {
        "id": "1qyciqv",
        "author": "Sara7121",
        "title": "affitare casa",
        "content": "Ciao a tutti che legono questa . E la mia ultima speranza😂. Se qualcuno affita un trilocale a comune di torino tprg scrivetemi.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qyciqv/affitare_casa/"
    }
]