[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 485,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1hvlmba",
        "author": "EthanWilliams_TG",
        "title": "Watch Hulk Hogan Get Booed by Fans During WWE's Netflix Debut",
        "content": "",
        "upvotes": 2709,
        "comments": 388,
        "media": null,
        "permalink": "/r/netflix/comments/1hvlmba/watch_hulk_hogan_get_booed_by_fans_during_wwes/"
    },
    {
        "id": "1hw2xuq",
        "author": "Ill_Dependent1389",
        "title": "Love these BTS Squid Game 2 🫰",
        "content": "",
        "upvotes": 38,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hw2xuq/love_these_bts_squid_game_2/"
    },
    {
        "id": "1hwciq1",
        "author": "coolkid3621",
        "title": "Non-Wrestling fans: how many of you watched WWE for the first time this week?",
        "content": "With WWE finally moving to Netflix &amp; heavily promoting it, I’m wondering how many new people actually watched wrestling for the first time this week &amp; if this was your first time, what did you make of it?",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hwciq1/nonwrestling_fans_how_many_of_you_watched_wwe_for/"
    },
    {
        "id": "1hvtr13",
        "author": "anonymous-user1234",
        "title": "Why wasn't Steve Wilkos brought up on Netflix Jerry Springer documentary?",
        "content": "Title says it all. Just finished the Netlix documentary and not sure why such an integral aspect and figurehead of the show wasn't mentioned once. Weird. ",
        "upvotes": 62,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1hvtr13/why_wasnt_steve_wilkos_brought_up_on_netflix/"
    },
    {
        "id": "1hvvtl5",
        "author": "daily_mirror",
        "title": "Netflix's Squid Game fans debunk viral theory linking Front Man to surprise character",
        "content": "",
        "upvotes": 23,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hvvtl5/netflixs_squid_game_fans_debunk_viral_theory/"
    },
    {
        "id": "1hw8upz",
        "author": "Internal_King_9747",
        "title": "Parenthood look a like?",
        "content": "How did I just found Parenhood on Netflix? Im in Canada. Was it on before? Found it just this week. Never actually heard of it before!\n\nThats such a good show!\n\nAny show that looks like it?\n\nI love when there are lots of seasons too! ",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hw8upz/parenthood_look_a_like/"
    },
    {
        "id": "1hwch45",
        "author": "amandaasous",
        "title": "Netflix “set household” can’t stream while traveling for work",
        "content": "I read an old post when searching for this subject but my situation is different from most of the replies and the post itself. I’ve contacted Netflix support twice today and a few other times in the past about this dumb household limitations. You can only request a vacation code in advance and only a few times a year. I travel for work often and Netflix ALWAYS force closes every minute in all  hotels. At first I thought it was Marriott hotels all having shitty TVs but finally caught onto the pattern that it is a NETFLIX issue. Prime and Max work perfectly fine in all my hotels. But I cannot use Netflix in my hotel rooms while my husband uses it at home. (I pay for more than 1 screen btw.) even if my husband is not at home and I log out of every single device and only log into my mobile phone and the hotel tv, Netflix still force closes every minute on the tv. There’s no option to update household on the TV Netflix. It just doesn’t exist. Does ANYONE have anything they’ve done that has helped with this or advice? Do I just cancel Netflix atp?\n\nTL;DR Netflix “set household” isn’t an option on my hotel tv, I cannot stream Netflix while I travel for work, and I travel often. Any tips/advice?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hwch45/netflix_set_household_cant_stream_while_traveling/"
    },
    {
        "id": "1hw62aq",
        "author": "RockyPS2Glitches",
        "title": "Gabriel Iglesias: Legend of Fluffy",
        "content": "Just got done watching Gabriel Iglesias' new Netflix special, \"Legend of Fluffy\", and as someone who was a big fan of Gabe in the past, this special was so disappointing. Outside of the usual \"thank you\" and \"name drop shout outs\" he gives, he had a few jokes that went on for way too long (the gun shop bit with Jim), along with some recycled jokes from past specials, like the themed weeks and Krispy Kreme jokes, as well as the story about how he flashed the old couple.\n\nPlus not to mention the constant bragging about having fans, being famous, being rich. Like, we get it, dude. I swear, it seems like his material hasn't been interesting since he got the divorce and Frankie moved out, and I think plenty of people probably feel the same way also. And the crowd got annoying at times during the special too. Like almost ever word he said evoked an applause from the audience, and I think he got more cheers than laughs that night there were so many!",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hw62aq/gabriel_iglesias_legend_of_fluffy/"
    },
    {
        "id": "1hvp43v",
        "author": "MonkeyTacoBreath",
        "title": "So this may just be a personal pet peeve, but the show/movie playing when you just want to read the description bugs the heck out of me.",
        "content": "My main issue is that because the show/movie started playing as I read the description, even if I back out 3 seconds later, that title is now in my continue watching tab. And I have to manually go remove it. \n\nI have auto play trailers and shows turned off. This happens on all platforms that I have access to, Xbox, PC, and Android.\n\nAnyone else get bugged by this \"feature\" or some other pet peeve?",
        "upvotes": 47,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1hvp43v/so_this_may_just_be_a_personal_pet_peeve_but_the/"
    },
    {
        "id": "1hwecpk",
        "author": "kitanaaaa26",
        "title": "Can i use netflix on holiday?",
        "content": "I have a netflix account that my family use, i am going away next month and want to watch netflix while im there, can i login on a new TV in a completely different city? I know you cant share accounts but i still want to use it while im away.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hwecpk/can_i_use_netflix_on_holiday/"
    },
    {
        "id": "1hwbqkm",
        "author": "Miserable-Tax3192",
        "title": "Someone help me find this movie",
        "content": "Does anyone remember a cheesy coming of age movie about a boy who’s in his senior year? He starts a trend online or it has something to do with the internet. It starts a huge movement. He has the news at his house. He was being pressured to get into good colleges by his parents. He meets a blonde girl and they go to the beach with her friends. It’s based in california. She wants to be a model. The movie ends with him following her to europe as she’s trying to become a model. It was on netflix maybe a few years ago. I feel like the front cover of the movie was of him with like a bright aqua light blue background. It was super underground but i’ve been looking for it everywhere and want to make sure i’m not crazy.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hwbqkm/someone_help_me_find_this_movie/"
    },
    {
        "id": "1hwbpy7",
        "author": "RealCanadianDragon",
        "title": "Downgrade plan?",
        "content": "I have the standard ad free tier in Canada for $16.50 and after comparing it to the standard with ads (I think its about $6?), I don't believe there's a huge difference seeing as the stuff I'm watching isn't impacted by the ad vs no ad tiers\n\n\nWith that said, given I just signed up for the ad free tier a few days ago, can I downgrade to the ad tier and get my money back pro rated to the date of the change, or will I still be on the hook for the entire month of the ad free tier I signed up for?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hwbpy7/downgrade_plan/"
    },
    {
        "id": "1hvxlsm",
        "author": "indiewire",
        "title": "The 7 Best New Shows on Netflix in January",
        "content": "",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hvxlsm/the_7_best_new_shows_on_netflix_in_january/"
    },
    {
        "id": "1hwb2vo",
        "author": "SolidStep4016",
        "title": "Jerry Springer Doc",
        "content": "I loved this documentary becauseI grew up watchingthe Springer show. When I would stay home from school sick this show and the Price is Right were my go tos.\n\nNetflix should air all the episodes of the Springer show uncensored. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hwb2vo/jerry_springer_doc/"
    },
    {
        "id": "1hvmdi7",
        "author": "Robemilak",
        "title": "Hwang Dong-hyuk praises T.O.P's performance in ‘SQUID GAME’ Season 2 after the actor got no work in the Korean entertainment industry for 9 years after he was arrested for smoking weed. ",
        "content": "",
        "upvotes": 39,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hvmdi7/hwang_donghyuk_praises_tops_performance_in_squid/"
    },
    {
        "id": "1hvt0cj",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix’s Terrifying German AI Horror Show 'Cassandra' sets February 6 release date and showcases new teaser",
        "content": "",
        "upvotes": 11,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hvt0cj/netflixs_terrifying_german_ai_horror_show/"
    },
    {
        "id": "1hw81jw",
        "author": "amigoreview",
        "title": "Netflix Ultra HD - Australia: question",
        "content": "Anyone in Australia using Netflix’s Ultra HD plan? \n\nAre you experiencing resolution issues with 4K content? Dolby Vision isn’t kicking in for me… it’s stuck in HD SDR for 4 days now. My devices are fine.\n\nCould anyone confirm (check playback info for Dolby Vision or HDR, if your TV has no DV) if they’re facing the same?\n\nThanks!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hw81jw/netflix_ultra_hd_australia_question/"
    },
    {
        "id": "1hvwshq",
        "author": "pennywise1988",
        "title": "Strangest thing ever",
        "content": "Since the start of the new year I started binge watching Schitt's Creek on my German Netflix. I got to the beginning of season 4. All of a sudden, last night, on the app on my Smart TV the card for Schitt's Creek is there, but it says \"Remind me when it is released\" and I no longer can play it. I checked and the same happened now with Young Sheldon.\n\nAre the rights disputes and they removed shows just as they were added to German Netflix??",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hvwshq/strangest_thing_ever/"
    },
    {
        "id": "1hw24x9",
        "author": "Intotheparadigmshift",
        "title": "Jerry Springer Documentary",
        "content": "For almost 25 years, Jerry springer aired and entertained me as a child and I loved it! I was in for it. I’ve been having Netflix since when it came out. And I am in absolute love with Netflix documentaries. But damn did they do a horrible job on this documentary. I mean everyone on this project has to be fired it was horrible.\nFor 25 years all they got was, JS in a 3sum, a murder that took place after the show and criticism of hate about the show for cancellation. That’s it!? That’s all this crew got? Disrespectful. Shameful. I disliked this documentary and Netflix was like whaaaaaat? You disliked this doc? lol cause it wasn’t saving my dislike. Jerry springer episode was more interesting than this trash of a documentary. I have bad taste?\n• into the fire\n•don’t fuck with cats\n•marduagh murder\n• I am a killer\n• Last Chance U\n• The disappearance of Madelienne McCann\n• The Trial of Gabriel Fernandez\n• American Nightmare\n• Tiger King\n• Chefs Table\n• the Last Dance\n• The Nightcrawler\n• American Murder\n• The Tinder Swindler\n• The Hatchet Wielding Hitchhiker\n• Bitconned\n•Our Father\n• How to Rob a Bank\n• Why Did You Kill Me\n• Athlete A\n• Long shot\n• The 3 deaths of Marisela Escobedo\n• Tupelo\n\n\nJust a bit to reference off of so yall know what kind I like and watch. ",
        "upvotes": 2,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1hw24x9/jerry_springer_documentary/"
    },
    {
        "id": "1hvshpq",
        "author": "South_Drawer_9551",
        "title": "Weird Issue with Netflix",
        "content": "There's this weird issue I am having with Netflix (desktop and mobile). On my profile, it shows only season 2 of ninjago dragons rising, but on my sister's profile it shows both seasons.\n\nBoth are in the same region (US) and under the same account.",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hvshpq/weird_issue_with_netflix/"
    },
    {
        "id": "1hw3jc0",
        "author": "KGNickl",
        "title": "Profile maturity rating changed on its own?",
        "content": "Just recently my my sons profile changed from pg to all maturity. I went onto the computer and switched it back. Today the same switch has occurred. My kid does not have access to the computer to be able to log into my account to change it. Also, when I went in to change it on the computer I had to type in my full password each time I adjusted the maturity settings. \n\nI understand most replies will be one of my kids is doing it.... watch your kid.... which is not needed. He was actually confused why his TV had all sorts of new options that didn't look like his shows....\n\nI'm just asking if there is another way to change or update this setting other than logging into a computer? I could not find a way on our Roku Smart TV that he uses that I'm just overlooking to allow this. Or if there is some Netflix glitch that can cause this to occasionally occur?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hw3jc0/profile_maturity_rating_changed_on_its_own/"
    },
    {
        "id": "1hwdi4o",
        "author": "Distinct_Lifeguard77",
        "title": "LOST SEASON 2 JACK, SAWYER &amp; MICHAEL👎🏽👎🏽",
        "content": "Anyone else annoyed by these characters?? Sawyer for obvious reasons, he’s been purposely getting under peoples skins. I feel like Jack is on a power stunt, not like a lot but it seems like he’s starting to. \nMichael, I am so pissed he shot Ana Lucia &amp; Libby. \nI’m only up to that episode so I still don’t know why Michael did that, but it’s getting pretty annoying how selfish these dudes are getting. What do you guys think? ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hwdi4o/lost_season_2_jack_sawyer_michael/"
    },
    {
        "id": "1hwd9r2",
        "author": "abhilash512",
        "title": "6 Failures with the First Episode of WWE Raw Netflix",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hwd9r2/6_failures_with_the_first_episode_of_wwe_raw/"
    },
    {
        "id": "1hweb7q",
        "author": "Robemilak",
        "title": "First trailer for ‘KINDA PREGNANT’, a film starring Amy Schumer as a woman pretending to be pregnant. Releasing February 5 on Netflix.",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hweb7q/first_trailer_for_kinda_pregnant_a_film_starring/"
    },
    {
        "id": "1hvhytx",
        "author": "DontWanaReadiT",
        "title": "Anyone watching The Later Daters??",
        "content": "I’m only 31 but I’m finding this show so incredibly refreshing!! It feels so real, authentic but also I’m learning a lot of things about myself just by watching this. This is light years better than any other dating show for people my age and younger. These adults know what they want and aren’t afraid of being vulnerable like they used to be when younger. ",
        "upvotes": 21,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1hvhytx/anyone_watching_the_later_daters/"
    },
    {
        "id": "1hw9j6p",
        "author": "Bingo_is_my_name_o",
        "title": "My account is on my ex's TV?",
        "content": "My ex and I live completely apart, all of my electronics were purchased after I moved away but he texted me after getting home from work to let me know that my daughter updated the profile pics on his account. \nI didn't think too much of it, because she just did that to my account here today, too. Well, it turns out that his TV is running my account. I've never logged in at his house, haven't been to his house since Friday when I picked up my daughter, and I saw her change the profile pics to add wrestlers this morning. \nWhat could have happened here? \nAgain, we don't share passwords or accounts for anything and live several miles away. ",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1hw9j6p/my_account_is_on_my_exs_tv/"
    },
    {
        "id": "1hw71rk",
        "author": "BriefSurround6842",
        "title": "Season 2 of Squid Games (no spoilers)",
        "content": "Wow. The initial episode and scenes before the games were kind of a drag and I immediately looked up online \"Season 2 Squid Games boring\". I saw a lot of people complaining so I almost didn't want to watch and lost interest. I kept watching through my boredom, and once it got to the games, I was so glad I didn't quit. This season was extremely edge of your seat, anxiety inducing, and emotional.\n\nI cried multiple times and became attached to some characters hoping that they would survive. Some scenes I quite literally had to skip through, because they gave me so much anxiety and heart racing anticipation I couldn't stand it... in a good way. I felt sick to my stomach at points and felt like I was almost there in the games. It was a great mix of fear, sadness, and desperation. The characters were developed with such personality.\n\nI was kind of disappointed at the cliff hanger and hoping for more soon. I can't say it was better than the first season because I felt like the first was interesting throughout and left such a lasting impact. But for a second season... I am pleased. I was a little confused about the story line but I think it's funny that the characters I ended up liking, became the main characters.\n\nThey did great with the development and action. They kept me guessing what was going to happen. I rate it an 8/10! It would be 10/10 for me, if the beginning was shortened a little and more to the point. It's amazing that a show and actors can cause you to genuinely feel for the characters and root for them and that's something I always look for in a show.\n\nWho was your favorite character(s)? Mine were #222, #120, #095, and the mother son duo. I liked #456's whole squad! ",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1hw71rk/season_2_of_squid_games_no_spoilers/"
    },
    {
        "id": "1hvo702",
        "author": "Robemilak",
        "title": "Medical Drama ‘The Trauma Code: Heroes on Call’ Gets a Teaser: Releasing January 24",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hvo702/medical_drama_the_trauma_code_heroes_on_call_gets/"
    },
    {
        "id": "1hvqyvv",
        "author": "shapy_d_livery",
        "title": " Help! Why Does Netflix Pause When Skipping",
        "content": "I'm having an issue with Netflix on my MacBook when using Safari. Whenever I press the forward or backward buttons to skip ahead or rewind, the video pauses instead of playing smoothly. I have to press play again manually every time, which is super annoying.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hvqyvv/help_why_does_netflix_pause_when_skipping/"
    },
    {
        "id": "1hvoew2",
        "author": "WhyThaFuck",
        "title": "Standard with ads",
        "content": "Hi, guys i wanna get back on netflix again but i have a question does anyone use the standard with ads sub? Its say \"ads: less then you might think\" so i was wondering how many ads does 1 ep or 1hr movie have?",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hvoew2/standard_with_ads/"
    }
]