[
    {
        "id": "1i2k69y",
        "author": "Prathu_RM",
        "title": "[Pre-Match Thread] Real Madrid vs Celta Vigo | Copa Del Rey | Round Of 16 ",
        "content": "",
        "upvotes": 82,
        "comments": 82,
        "media": null,
        "permalink": "/r/realmadrid/comments/1i2k69y/prematch_thread_real_madrid_vs_celta_vigo_copa/"
    },
    {
        "id": "1i0biuo",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 19,
        "comments": 2018,
        "media": null,
        "permalink": "/r/realmadrid/comments/1i0biuo/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1i2p10h",
        "author": "Damned_chicken",
        "title": "Raúl Asencio before every match",
        "content": "",
        "upvotes": 511,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/e21pe6dfzcde1.jpeg?auto=webp&amp;s=10d5bde6210cefe7dc84e538026b0c0c07c874be"
        },
        "permalink": "/r/realmadrid/comments/1i2p10h/raúl_asencio_before_every_match/"
    },
    {
        "id": "1i2k3s4",
        "author": "Prathu_RM",
        "title": "Trent Alexander-Arnold says \"YES\" to Real Madrid, Trent Alexander-Arnold to Real Madrid is DONE. Decision pending on a January or July move.",
        "content": "",
        "upvotes": 523,
        "comments": 122,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/eO_jMuHTZvkifVpvV4wdh0wudcAvAJ6ynxQ03tlIxSs.jpg?auto=webp&amp;s=4e4d78d52a496658d67f6a8df3322b9acffa2b0e"
        },
        "permalink": "/r/realmadrid/comments/1i2k3s4/trent_alexanderarnold_says_yes_to_real_madrid/"
    },
    {
        "id": "1i2qkro",
        "author": "FlyingWaterMen",
        "title": "[Footmercato] Real Madrid really appreciate Saliba. His name is on the list, but Real Madrid are taking their time and are also aware of his contract until 2027.",
        "content": "",
        "upvotes": 115,
        "comments": 63,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/tFwadvjkIYvhTwEQiQ7dFTx5aZzkMiRdY4rhiMBpK5s.jpg?auto=webp&amp;s=a51e88367bf684b2f0eabd80734373d6acc8c952"
        },
        "permalink": "/r/realmadrid/comments/1i2qkro/footmercato_real_madrid_really_appreciate_saliba/"
    },
    {
        "id": "1i23xc1",
        "author": "BakaPhilosopher",
        "title": "Just saw this on insta ",
        "content": "Credit: kymb.fr on instagram ",
        "upvotes": 1766,
        "comments": 89,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/rvb5uize97de1.png?auto=webp&amp;s=1ed9af26f6de72e3ba6fd45522a589fe75ee50ee"
        },
        "permalink": "/r/realmadrid/comments/1i23xc1/just_saw_this_on_insta/"
    },
    {
        "id": "1i2pjqj",
        "author": "ace-s",
        "title": "The LB/CB situation is taking focus away from a much bigger problem",
        "content": "Yes, We do not have an RB and Carlo refuses to depend on Asensio, which makes us not have a CB aswell. \n\nI personally think that we have a much bigger problem which is that we solely rely on individual performances to win games. We always have to get bailed out by players like Jude, Vini, Tbo, Fede, Rodrygo...etc.\n\n**This shows how amazing our players are and how weak we are as a TEAM.**\n\nI can't remember a single game this season and the majority of last season where we actually outclassed an opponent as a team. \n\n The fact that some of our players can create a goal out of nothing is fantastic but when we depend on individual players to change the fate of the game and they are not able to show up in that game is why we were unable to replicate the success we had previously.\n\nEven if we somehow managed to sign trent and a CB this window, it does not solve the biggest problem we have which is that do not play well as a team.\n\n",
        "upvotes": 36,
        "comments": 28,
        "media": null,
        "permalink": "/r/realmadrid/comments/1i2pjqj/the_lbcb_situation_is_taking_focus_away_from_a/"
    },
    {
        "id": "1i2tf8a",
        "author": "FlyingWaterMen",
        "title": "Real Madrid's optimism grows regarding Alphonso Davies: He will meet with the club and Bayern are already considering replacements. The board of directors at the club thought at Christmas that the full-back was going to renew his contract with their team, but things have changed in just a few days.",
        "content": "",
        "upvotes": 10,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zUPtTnkx1MVBJCVf_SGbwWFTohUB8Mjp3D4c9nKxyn0.jpg?auto=webp&amp;s=a234353820f29099f13939708ae9c04af4829249"
        },
        "permalink": "/r/realmadrid/comments/1i2tf8a/real_madrids_optimism_grows_regarding_alphonso/"
    },
    {
        "id": "1i2mtzo",
        "author": "ManuMora98",
        "title": "[Basket - Official] Dennis Smith Jr. joins Real Madrid ",
        "content": "",
        "upvotes": 24,
        "comments": 9,
        "media": null,
        "permalink": "/r/realmadrid/comments/1i2mtzo/basket_official_dennis_smith_jr_joins_real_madrid/"
    },
    {
        "id": "1i1wwko",
        "author": "Henry-Doe",
        "title": "Completely forgot this beauty of a kit existed",
        "content": "",
        "upvotes": 1086,
        "comments": 54,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/asqhbh1qo5de1.jpeg?auto=webp&amp;s=6cc8fdace27b60bbf0c85e44c3af420db1df8ab6"
        },
        "permalink": "/r/realmadrid/comments/1i1wwko/completely_forgot_this_beauty_of_a_kit_existed/"
    },
    {
        "id": "1i25i3y",
        "author": "seekingabeauty",
        "title": "As a Brazilian who has followed Vini throughout his whole career, I wanted to share my views on the problems that he faces and the way he's been acting on and off the pitch.",
        "content": "Vini's case is more complex and nuanced that football fans and all the passion involved (both for and against clubs and players) are used to dealing with.\n\n* Vini started here as a relatively shy boy with lots of talent but little end product. Many used to laugh at him for his performances. It was clear that the world was still too big for him, and he worked in silence.\n* Then he developed massively and became one of the best players in the world, especially in the Champions League. He gained confidence and started expressing himself, especially during goal celebrations. What was an easy target for jokes became a serious threat against most teams, and so, opposition fans began to antagonize him more.\n* His expression of the (broadly speaking, of course) Brazilian black culture, like dancing, the haircuts and so on, didn't bode well for a significant part of Spain, which **does have** racism problems. Of course, I'm not targeting every single Spanish person, but this is a very clear problem.\n* Vini plays for the biggest club in Spain, a club that's used to beat most if not all other teams in the league. When someone beats you, you tend to dislike them and what the do to a certain point. What could already be viewed by some as a disrespect to the opponents (the dances, dribbling and so on) became more exacerbated by Vini's skin color. And so, Vini became a target for criticisms that border racism or were fully racist.\n* Not as shy as before, Vini faced this head on, seeking criminal sentences for those who abused him, which made his \"opposition\" even angrier, who started targeting him more, and he became more affected by this as well, which is natural.\n* This situation began to affect him on the pitch. It was rare to see Vini involving himself in fights against another players or referees before 2021/2022, but today this is extremely common. The abuse affected his head and he can't seem to control it. This only serves as fuel for neutrals to dislike Vini and, of course, for those who already hated him to do so even more.\n* This has factually affected the votings on the Ballon D'Or, something that Vini clearly wanted to him. Some will point out structural racism as the problem, while others will say that Vini doesn't behave well enough. Usually, one side never agrees with the other. The root of all of this seem to be lost in people's minds at this point.\n\nIt's a very delicate situation. We can't solely put the blame on Vini for the things that he does, because most players don't deal with what he does, but he's not blameless either. I just hope that he can get some serious professional help because it seems to be getting worse.",
        "upvotes": 290,
        "comments": 58,
        "media": null,
        "permalink": "/r/realmadrid/comments/1i25i3y/as_a_brazilian_who_has_followed_vini_throughout/"
    },
    {
        "id": "1i1xwcu",
        "author": "dark4403",
        "title": "Ancelotti comments about Asencio",
        "content": "",
        "upvotes": 324,
        "comments": 93,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/sglti595y5de1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1i1xwcu/ancelotti_comments_about_asencio/"
    },
    {
        "id": "1i1tagc",
        "author": "Pionel_Pepsi",
        "title": "Everything has been going wrong ever since he stopped travelling with the team",
        "content": "",
        "upvotes": 619,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/if99wjsif4de1.jpeg?auto=webp&amp;s=cff65bfbc8b4ad63863831ce677c8b6096a852b7"
        },
        "permalink": "/r/realmadrid/comments/1i1tagc/everything_has_been_going_wrong_ever_since_he/"
    },
    {
        "id": "1i1y0tl",
        "author": "dark4403",
        "title": "Ancelotti claims Tchouaméni has done a good job as a CB",
        "content": "",
        "upvotes": 124,
        "comments": 86,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/de4yy406z5de1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1i1y0tl/ancelotti_claims_tchouaméni_has_done_a_good_job/"
    },
    {
        "id": "1i200kc",
        "author": "Any_Warthog_5655",
        "title": "What do you guys think about this? I don't think it's his fault that Carlo keeps playing him as CB",
        "content": "https://madriduniversal.com/real-madrid-fans-hijack-midfielders-social-media-post-telling-him-to-leave-after-horrid-performance-vs-barcelona/",
        "upvotes": 83,
        "comments": 62,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/De9NP9KBN6FK_80ioSpmCtnjqMtjMRnCo9ToSjOtr5c.jpg?auto=webp&amp;s=54d9c7a577b1414ecdd559a889c85baecb8267f0"
        },
        "permalink": "/r/realmadrid/comments/1i200kc/what_do_you_guys_think_about_this_i_dont_think/"
    },
    {
        "id": "1i1x7hr",
        "author": "mkxvish",
        "title": "Real Madrid manager admits lack of team commitment in Barcelona loss",
        "content": "Real Madrid manager Carlo Ancelotti has admitted that his side did not commit to the plan they had against Barcelona in the Spanish Supercup final, suffering a chastening defeat. Los Blancos face Celta Vigo in the Copa del Rey on Thursday night, but the Galician side were barely mentioned in the aftermath of the Clasico.\n\nAncelotti was heavily criticised in the hours following their 5-2 defeat, but noted that it was just one game, and his side was still in all of their other competitions, and in good position to win them. One of the things he did highlight about the Clasico was that his side lacked ‘team commitment.’\n\n“The lack of commitment is collective, it is not an individual commitment. The evaluation of the match has been a poor defensive plan in all areas of the pitch. Nothing more to add.”\n\nOn several occasions he was asked to diagnose the issues that led to their second heavy defeat to Barcelona of the season.\n\n“I have to clarify one thing, this is a press conference and not a debate. We have already had that with our players and the coaching staff. Doing it here does not seem like the most appropriate thing to me.”",
        "upvotes": 86,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xX6v3AMW2d7QBXWq8agyAtMNIi4d0Iepx29Hh2a8PyI.jpg?auto=webp&amp;s=27129e142f43e1d49c3ae566a8f34a7ab9877515"
        },
        "permalink": "/r/realmadrid/comments/1i1x7hr/real_madrid_manager_admits_lack_of_team/"
    },
    {
        "id": "1i1w9m6",
        "author": "somewansreddit",
        "title": "What did we do with the ball against Barcelona? A first half nightmare review",
        "content": "# Introduction:\n\nI tortured myself by rewatching our recent game against Barcelona. I just wanted to count the number of long balls we threw away. I left you here a \"play-by-play\" of our possessions, and how Barça ended theirs. No need to read all of it unless you want to do it while watching/reviewing the game yourself. The play-by-play could also serve as a point to discuss a particular play. Then a little comment about the second half. Finally, a soft conclusion based on the play-by-play.\n\n# Play by play:\n\n**(1:25)** Recovered ball from Gavi by Camavinga and Vini on our left side in Barça’s half, close to the half-line (good pressing). Valverde immediately loses the ball (Camavinga passed it to Jude, who passed it back to Fede), which allows Barça to counterattack and Courtois has to save Lamine’s shot from outside the box. What a save to start the match (**!!**).\n\n**(2:48)** Goal-kick, Lamine tried too many dribbles. Tchouaméni short pass to Courtois, who throws a long ball. **1st gift**.\n\n**(3:05)** Good press, Mbappé (**!**) is able to cut Íñigo’s pass to Casadó in Barça’s half. Ball goes to Bellingham who passes it to Vinicius. He miserably loses the possession.\n\n**(3:50)** Barça touches the ball comfortably while we look at them (14 passes, none challenged) until Gavi gains the goal-line and puts a cross for Raphinha, who heads it to the goal as he is completely alone. Courtois’ second save, an impressive one (**!!**).\n\n**(4:20)** Barça’s corner is bad, Vinicius wins the ball against Casadó and gives it to Mbappé, who makes a 70m run to score. **Golazo, 1-0**.\n\n**(6:05)** Rodrygo deflects Íñigo’s pass and the ball meekly arrives to Tchouaméni. To Rüdiger, to Courtois… and bam. Long ball to nowhere (Barça’s GK hands). **2nd**.\n\n**(6:47)** Mendy cuts a pass and kicks the ball to Mbappé. Play? Mbappé runs and almost gets injured by Koundé. The fucking Gil Manzano asshole doesn’t call the clear yellow foul.\n\n**(9:05)** New goal-kick, after Raphinha's shot (he had a very narrow angle, but Barcelona only needed 4 passes to end their play inside our area with a dangerous shot). We are one man down because Mbappé is receiving medical attention. Our play? Tchouaméni short pass to Courtois, who sends another long ball. Directly to Cubarsí. **3rd**. Barça is unable to control the possession, tho, and we get a throw-in.\n\n**(9:25)** For the first time, we string more than one pass (**!**). Mendy to Vini, who switches to Lucas. Back to Courtois. Lobbed ball to Mendy, who controls and passes it to Camavinga. Camavinga is pressed by Lewandowski (**!!**) and has to pass it back to Courtois, who sends a lobbed ball to Mendy again. This time, Mendy has to head it… and Koundé gets the ball in our own third of the pitch, with many meters in front of him to freely control and advance, despite of being close to our area (**!!**). Not exactly an unforced long ball but...\n\n**(10:18)** After Lamine dribbles two of our players, Valverde finally stops him in the border of our box… Valverde himself throws a long ball to nowhere after his recovery.\n\n**(10:38)** For once, the idea of raffling the ball serves us, as our pressing on the second ball is able to force Barça’s mistake. Casadó stops any further danger with a fast foul on Camavinga. Our free kick resulted in nothing and Camavinga stops the counter with a foul. *1st time the long ball gives us “something”*.\n\n**(12:08)** Rodrygo wins the duel against Balde on our right side in our own third, recovering the ball. He gets us a throw-in.\n\n**(??:??)** Cameras didn’t show what happened, but we sent another long ball, as Barcelona pressed the throw-in. I guess it wasn't a gift, but… Barça got the ball. The defense in the following possession is as passive as it can get, Pedri enters our area jogging. Fortunately, Lucas finally blocks his advance. Throw-in.\n\n**(13:12)** Rodrygo and Lucas win the ball against Balde and Pedri, close to our right corner after the throw-in. Another one, this time for us.\n\n**(13:30)** Valverde puts the ball in orbit. It's forced since Barça is high pressing. Íñigo’s missed control let us make a fast play through our right side, as Bellingham finds Rodrygo with open space to run. After a couple of dribbles, he switches the ball to Vinicius, who crosses to the area looking for Bellingham, but the ball directly goes to Barça’s GK. Our idea of play is clear. Kick the ball and hope the opponent makes a mistake. What a masterplan.\n\n**(14:30)** Rodrygo cuts a pass (from the “magician” Pedri to Balde) in our own third, as we had let Barcelona freely advance (10 passes). Our counterattack? It lasts 3 passes, and that’s counting Rodrygo’s cut as the first one.\n\n**(14:49)** Mbappé lies on the ground, his foot is damaged. Fucking Gil Manzano and fucking Barcelona ignores the issue as much as they can (10 seconds, actually).\n\n**(17:02)** Game is resumed after two minutes. Despite of being one man down with 1-0 in our favor and the rest of the team holding back in a low block, Bellingham decides that it is a good idea to press. Useless efforts, obviously; we should be more clever. Fortunately, he realizes about the situation soon. Barça tries a play we will “like”: a player (Raphinha) moves, offering himself to receive the ball, while a second one (Pedri) runs into the space left by the first player. It’s 2025 and we don’t know how to fucking defend this simple play (**!!**). This time, it only ends in a corner, as Tchouaméni deflects Pedri’s shot.\n\n**(18:40)** Casadó’s shot is off, goal-kick. You know the play. Tchouaméni to Courtois. Long ball. At least this time Bellingham is able to control the ball before losing it. **4th gift**.\n\n**(20:22)** After a couple of non-dangerous plays (one corner, tho) in which we can’t recover the ball but clear it, another goal-kick. You know the play. **5th gift**. To make things worst, after we passively watched their build up, Lewandowski moves to receive the ball, Rüdiger leaves a hole in our back line and Lamine wins Mendy’s back. Like I said, it’s 2025 and we are defending like amateurs. Barça only needed 7 passes to destroy whatever shit mid block we pretended to set. Only 2 of those 7 passes were actually forward passes (**!!!**): Koundé (alone!) to Lewandowski (alone!), to Lamine (alone!). **1-1, ridiculous defense**. Rüdiger and Mendy are abysmal, the general passivity is horrible to watch.\n\n**(22:18)** After the goal, we build up from the back. For the first time, we string more than 10 (**!!**) passes (before, we hit 7 passes at the 9:25 play). Great, right? Almost all happen between Courtois, Tchouaméni and Lucas. On the 11th pass the ball arrives to Rüdiger… and he kicks it away. Fortunately, Szczesny is clumsy and concedes a throw-in. *I guess we can count it as the 2nd time an unforced long ball works*.\n\n**(23:00)** Decent fast play, we get a corner kick.\n\n**(23:40)** Szczesny saves Tchoauméni’s header. New corner.\n\n**(24:01)** Casadó clears the ball, another corner.\n\n**(24:23)** Tchouaméni’s half bycicle kick. Cleared ball goes to Camavinga, who passes it back to Mendy, who does the same, to Courtois… When the ball arrives to Courtois, Barça’s offside is almost in the half-line. Our players? 5 are clear offside (they were also offside when Mendy had the ball!!), with Rodrygo in a doubtful position, next to our right sideline. Search a picture at 24:36 mark…  It’s… Fuck. FUCK. Courtois, of course, sends a long ball. Throw-in for Barça, but it would have been an offside. **6th**.\n\n**(25:21)** Rüdiger wins the ball after a deep pass to Raphinha. He passes it to Lucas, who makes a stupidly risky pass to Courtois. Fortunately, the Belgium reaches the ball before Lamine and kicks it away. It’s not as unforced as others, but **7th** in my count.\n\n**(25:55)** Cubarsí makes a terrible pass thanks to our pressing. It goes directly to Fede. The Uruguayan is a gentleman and passes it back… to Lamine.\n\n**(26:35)** After Barça’s rondo (12 passes, barely challenged), Koundé appears completely alone (Vini?) on their right and shots from outside of the box. Rüdiger blocks it and Vini starts a counterattack. He tries to dribble through Koundé, Pedri and Cubarsí in the half-line. If my mother had been around, he would have also tried to dribble her. At least the rebound favors us and we can build from the back more calmly. **(26:58)** Íñigo injured.\n\n**(28:12)** Game resumed. A few passes between our back line before Lucas sends a long pass. Casadó heads it but Valverde wins the second chance. Our masterplan firing at full cylinders. Valverde’s ball goes to Mbappé, who opens it to Vini. Then, Vini’s deep pass goes directly to Araújo. Peak football. *Third time our masterplan gets us “something”*.\n\n**(28:46)** Mbappé presses Koundé, who concedes a throw-in. Rüdiger and Tchouaméni pass the ball to each other a couple of times. Surprisingly, we don’t send a long ball (**!**). I guess they could see several players in offside (**!!**). Finally, a forward pass from our back line to our midfield pivots, when we are almost at 30th minute (**!!!**): Tchouaméni to Camavinga. It happens that Camavinga is actually Raphinha. I guess now we know why we were kicking away the ball.\n\n**(29:08)** Fortunately, instead of capitalizing the chance, Raphinha slows the play trying to dribble Camavinga, who makes his only good play of the match and wins the ball. It goes to Lucas, who gives it to Fede… and another long ball to nowhere. **8th** unforced long ball missed.\n\n**(29:26)** Koundé turns back the favor, and Mendy controls the ball. He fast find Mbappé, who dribbles past Koundé and Gavi… just to try to dribble them again towards our goal. I don’t really understand, but Barça gets the ball back. \n\n**(29:45)** Lamine is feeling generous himself and gives away the possession in the half-line, as he also tries impossible dribbles. We don’t elaborate much, but Camavinga finds Mbappé open on the left side. Then a deep pass to Vini’s run, who does a good play on the wing (**!**). His cross is cleared, and Camavinga shots the ball to the skies in the second chance.\n\n**(31:47)** We get a throw-in near our area thanks to Mendy’s good defense on Koundé; we didn’t suffer, but it took us 1min 30s to get the possession back. Play? Mendy hands the ball to Rüdiger, who sends a long pass to Vini. Araújo easily wins the duel (**9th**). Back to defend, in a low block. (32:45) Our very passive defense (24 passes, interrupted once by a Rüdiger clearance, his header immediately went to Barça as they were much better positioned and active) let Koundé receive the ball on the side (Vinicius watches Koundé from distance, walking), his cross to Gavi results in Camavinga’s penalty and a yellow card after a VAR review. Camavinga’s amateur level and our passivity (both in general and Vinicius in particular) **give Barça the 1-2**. I don’t know if we don’t have attitude or we don’t have legs (both, I guess), but our level is mediocre.\n\n**(37:05)** After the goal, Mbappé to Camavinga, back to Tchouaméni, to Rüdiger, to Courtois. You know the play. *One of the rare occasions in which we win the second chance ball (4th), it let us advance and create danger*. However, Mbappé is clearly offside (**!!**) when Lucas crosses the ball into the area, so even if Szczesny hadn’t caught the ball, nothing. Sometimes, you inexplicably find yourself offside; I reject to make further comments about this play.\n\n**(38:13)** After Barça makes a few passes, Cubarsí sends a long ball to Lamine, but it goes directly to Courtois’ hands. Play? Ball to Tchouaméni, who gives it back to the GK. Under the pressure of 37 years old Lewandowski (**!!**), Courtois has to throw another long ball. **10th, this time, it directly costs us a goal**. [Here](https://www.reddit.com/r/realmadrid/comments/1i0biuo/comment/m6zbdnu/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button) is the full sequence of the coming events… **1-3**. Blame on Lucas (unfair), but it’s impossible for him to recover the distance with Raphinha. Blame on Tchouaméni (fair), who decides to worry about Lewandowski instead of Raphinha. **But not knowing what to do with the ball is what is harming us. Who is responsible for that?**\n\n**(39:52)** After the goal, we make a few passes till the ball goes back to Courtois. Result? After a couple of duels, throw-in for Barça. **11th**.\n\n**(43:30)** Cameras were repeating Barça’s third goal while we started our play with a goal-kick after Lewandowski headed the ball out (he required medical services); it was a clear chance for them, our passive defense let Raphinha get the ball inside our area to put the cross. Another possession immediately given away with a long ball, this time to Szczesny’s hands. **12th**. \n\n**(45:47)** After Barça’s played with us for 2 fucking minutes (we conceded a throw-in and committed two fouls between plays), in which Gil Manzano saved Camavinga of a clear second yellow when he hugged Lamine (**!!**), Balde miscontrols the ball in his run and Lucas gets it. Casadó cuts any chance of a counterattack by fast fouling Bellingham. It is a clear yellow, but Gil Manzano ignores it as he ignored Camavinga’s.\n\n**(46:09)** Play after the foul? For once, we don’t pass it back to Courtois. Tchouaméni opens it for Valverde on the right side… And he throws a long ball, directly to Szczesny’s hands. **13th**. It’s pointless to say anything.\n\n**(47:17)** We get the possession back as Lamine is offside, almost in the half-line. We comfortably touch the ball, as Barça lower their pressing a bit with a 1-3 in their favor and the halftime closing in. We don’t advance much, but we aren’t forced to pass it back to Courtois. **(47:59)** After 40s of timid passes with little intention, Rüdiger sends a long ball behind Barça’s defensive line. Result? Szczesny gets it. **14th**. Sigh.\n\n**(48:43)** We are unable to recover the possession till Mendy blocks Lamine’s shot. Vini fights with Casadó, wins the ball and searches Mbappé, who has to slow down the play and switches to the right side. Bellingham, Rodrygo and Lucas create a decent play that ends with Balde making a bad clearance. Gavi heads the ball to Szczesny, who catches it in two efforts, as Rodrygo cannot properly connect with it.\n\n**(50:36)** Rüdiger cuts a pass with his head (Gavi kicks him in the face in that play, but Gil Manzano ignores it). The ball goes to Bellingham, who makes a run. He is fouled by Koundé (but Gil Manzano ignores it). The following play is Barcelona doing a rondo (16 passes) as our forwards are wasted and don’t defend at all. It ends in a corner for Barça as Courtois makes his third impressive save (**!!**) of the day to Balde’s shot.\n\n**(52:03)** Courtois directly gets the ball from Raphinha’s corner-kick. He hands it to Rodrygo, but Casadó is too fast and stops the counter before it starts. Throw-in for us.\n\n**(52:14)** Rodrygo tries to advance through the right, but Casadó fouls him.\n\n**(53:13)** We take the foul with a long cross to the area. After some rebounds, the ball arrives to Valverde, who opens it to Rodrygo, still on the right after taking the foul. He dribbles, but eventually he and Lucas find no space and pass it back to Fede, who switches it again. Mendy and Mbappé advance through the left and Araújo concedes a corner. Bloody corner.\n\n**(54:15)** Rodrygo took our previous three corners, from our right side, directly to the area (**!!**). They were dangerous. This time, Camavinga offers himself for a short pass. Why? I don’t know, but Rodrygo decides it’s a good idea, despite stoppage time is over. Camavinga’s pass to Rodrygo is quite bad, but Rodrygo’s pass is even worse, as it directly goes to Lamine. The rest is an easy counterattack for Barcelona that ends with **an unsurmountable 1-4** and the feeling we can receive 4 or 5 more goals in the second half. \n\n# Second half:\n\nIf the first half is a calamity, the second half is even worse. We played 40 minutes with one more player and it looked like we were the ones with one less man. Against 11 we only threw long balls. Against 10, we didn’t create any real chance, bar a couple of fantastic Mbappé actions in stoppage time: one missed by Bellingham, one saved by Peña. \n\n# Conclusion:\n\n18 unforced long balls. 4 of them served us to advance thanks to the second option ball, but nothing else. 14 times were gifts to Barça, one of them turned into the third goal against us. If I'm not mistaken, we disputed a single aerial duel from these balls, the rest went directly to Barça. Were we hoping Barça failed? Was our plan to throw long ball after long ball? A total failure at all levels, whether it was planned or not. \n\nAnd makes me wonder, if we were doing that, why didn't we put pressure on Barça's half with more men? Why did we start our goal-kicks with a short pass (with 6 of our players close to our area) instead of a direct long ball? I don't share that plan as I think we have the capacity to build up plays from the back without raffling the ball, but if we are going to throw long balls... try to find Jude or Tchouaméni and support it with our players around them, don't put most of our guys next to Courtois.\n\nBesides the \"countless\" gifts, the rest of our possessions mainly consisted on impossible runs just after we recovered the ball. Yes, one of these \"recovery and run\" plays allowed us to score the first goal, but it must be noticed that it happened after a Barça corner, not when they were structured.\n\nI don't know if it's a coaching problem, an attitude problem, a tiredness problem, the height of the grass or the temperature of the seas, but we didn't know what to do with the fucking ball. And it's not the first, nor the second, nor the third time it happens this season.\n\nThis is just regarding what we did with the possession. The grotesque show we performed without the ball would require gasoline and fire. \n\nFortunately, this was a tinpot trophy and we are still alive in the important titles. I think we should still trust in our team stepping up when it matters the most (Champions League knockouts and Liga), even if they failed last weekend. \n\nHala Madrid!",
        "upvotes": 96,
        "comments": 16,
        "media": null,
        "permalink": "/r/realmadrid/comments/1i1w9m6/what_did_we_do_with_the_ball_against_barcelona_a/"
    },
    {
        "id": "1i1j6zl",
        "author": "dark4403",
        "title": "Rudiger has injured his knee",
        "content": "According to Mario Cortegana, Rüdiger has discomfort in one of his knees, a circumstance that may be due to the enormous load of games and minutes. The German adds 2,527 so far this season (93.5% of the minutes of the season) and is the second footballer with the most minutes only surpassed by Valverde (93.9%)",
        "upvotes": 375,
        "comments": 139,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xpFYVlVn-RdTlsiL1sw0PMDohp7Vzrig2ViZIpIpwds.jpg?auto=webp&amp;s=f0cb851a13ea1d2d71642ade72bf04a1951516fe"
        },
        "permalink": "/r/realmadrid/comments/1i1j6zl/rudiger_has_injured_his_knee/"
    },
    {
        "id": "1i1sg0h",
        "author": "GuestZealousideal228",
        "title": "We are a deeply unserious club if we don't sign a defender",
        "content": "Second humiliation against Barca this season &amp; still no talk of a defensive signing. I don't get it, our board watched us get absolutely HAMMERED at HOME &amp; they still persist with not signing a defender. If the previous Classico wasn't proof enough, there's the Milan game. Our board were negligent for not signing a defender after Militao tore his ACL, I wonder what they thought would happen going into the season with Rudiger, Militao &amp; Tchouameni (I know I know). We deserve to go trophyless (y'know what I mean) if we don't learn from these losses.",
        "upvotes": 54,
        "comments": 62,
        "media": null,
        "permalink": "/r/realmadrid/comments/1i1sg0h/we_are_a_deeply_unserious_club_if_we_dont_sign_a/"
    },
    {
        "id": "1i1oapd",
        "author": "Moreplatesmoregains",
        "title": "Aren’t we missing someone like my man JOSELU",
        "content": "I know our problem now is more the defence not the attack. But someone like joselu is needed in these times when you need a goal from a header or any cross a real pure striker. We don’t have that endrick can be a very good player but he can’t add ao much when teams are parking the buss in the last minutes of the game. I think we need to fix our defence first but also a supersub striker who is not 5’5 and can head a ball is needed.",
        "upvotes": 98,
        "comments": 24,
        "media": null,
        "permalink": "/r/realmadrid/comments/1i1oapd/arent_we_missing_someone_like_my_man_joselu/"
    },
    {
        "id": "1i151ev",
        "author": "dark4403",
        "title": "We need to talk about Vinicius",
        "content": "",
        "upvotes": 1387,
        "comments": 299,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/o9esfgcicyce1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1i151ev/we_need_to_talk_about_vinicius/"
    },
    {
        "id": "1i13wrt",
        "author": "Damned_chicken",
        "title": "Carlo in every match",
        "content": "",
        "upvotes": 1331,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/z46zkiri1yce1.jpeg?auto=webp&amp;s=4de117526f9b7090bce5fa4d1a2defe0e1f92293"
        },
        "permalink": "/r/realmadrid/comments/1i13wrt/carlo_in_every_match/"
    },
    {
        "id": "1i1got5",
        "author": "dark4403",
        "title": "Alphonso Davies doubts, not satisfied with Bayern's renewal offer.",
        "content": "",
        "upvotes": 160,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8OmuyfLVhXv6KvnReSdQhRi8U73fqszBdEBAqFlZRJU.jpg?auto=webp&amp;s=806541f5a4339ef0cea4a938f4126148dd947733"
        },
        "permalink": "/r/realmadrid/comments/1i1got5/alphonso_davies_doubts_not_satisfied_with_bayerns/"
    },
    {
        "id": "1i1sr7b",
        "author": "Frustatedketa",
        "title": "Who can be the best choice for a defender?",
        "content": "While talking about how lame is our defense system. We all can be sure that our club will buy a new Rb a defender and possibly also a Cb. So who can be the possible target and suits for the club ? The rumours are widespread with Trent Alexander Arnold from Liverpool but I think we will ruin our club more than the current state. Dude doesn't know how to defend , he makes numerous mistakes from which Virgil Van Djik Always remains frustrated. So what you guy's think ? Except TAA who can be the better target for real Madrid ?",
        "upvotes": 22,
        "comments": 82,
        "media": null,
        "permalink": "/r/realmadrid/comments/1i1sr7b/who_can_be_the_best_choice_for_a_defender/"
    },
    {
        "id": "1i1ilf0",
        "author": "blueXwho",
        "title": "Ancelotti may be wrong, but he's certainly not a dummy coach",
        "content": "I understand people are angry, especially after that terrible Clásico, but people need to stop talking nonsense. There's no way a manager is hired and is successful in top elite teams, winning more UCL than any other manager in history, and not know tactics.\n\nYou might not like them, you might want a Guardiola or Cholo just yelling the whole game, micromanaging the team (for real or for show), but that doesn't mean Ancelotti doesn't analyze the game.\n\nThis season, there's a clear disconnect between what's needed and what happens on the field. There are many possible reasons:\n1. the team is unbalanced after Kroos departure and the injuries, without proper signings\n2. the team is exhausted\n3. the team has no motivation after winning big last season\n4. too many players out of their natural position\n\nYes; 1, 3, and 4 are mostly the manager's fault. We know Ancelotti is stubborn, he has an idea and won't change it, especially mid-game. That's why he doesn't make subs until we're behind and why he has the team playing low block the first half, slowing down the game. But it has worked for him, so he won't change his ways.\n\nHe's totally able to change the tactical scheme, but he rarely does it during the game. He studies the rivals and makes mistakes, but this season those mistakes outweigh the good choices.\n\nThis is probably the end of his cycle, we might get Xabi Alonso, whose style is more direct and fast-paced, but that's doesn't mean he's just a grandpa Florentino Pérez hired so he is told who you play, that's simply not true. His colleagues and former players can attest to that.",
        "upvotes": 116,
        "comments": 98,
        "media": null,
        "permalink": "/r/realmadrid/comments/1i1ilf0/ancelotti_may_be_wrong_but_hes_certainly_not_a/"
    },
    {
        "id": "1i1elbz",
        "author": "PlantComprehensive77",
        "title": "We played just as poorly last season as we are now",
        "content": "Some of the revisionism I'm seeing on this sub lately is crazy, especially regarding the absence of Kroos. I love Kroos, and he played at a world-class level last season, but we still played shit football most of the time.\n\nIn the first half of the season, we had to rely on Bellingham turning into prime CR7 to squeeze past the likes of Celta Vigo, Getafe, Union Berlin, etc. We were bailed out by set piece goals against bottom teams like Deportivo Alaves and Mallorca. \n\nDon't get me started on our run in the CL knockout stages. We were comprehensively outplayed in every single match, apart from the 2nd leg against Bayern. Fucking RB Leipzig could have scored 8 goals against us if it wasn't for Sesko shooting like a donkey and Lunin turning into god. If Leipzig knocked us out in the RO16, all of a sudden last season looks a lot worse.\n\nNo wonder we're struggling this season. Last year we had Kroos playing like he's 20 years younger, Bellingham having one of the greatest debut seasons ever, and Vinicius putting up Ballon D'or performances, and yet we still played fugazi football most of the time, especially against big teams. The issue isn't the individual players (apart from Vasquez and Tchouameni), it's Ancelotti's non-existent tactics and an unbalanced squad ",
        "upvotes": 148,
        "comments": 83,
        "media": null,
        "permalink": "/r/realmadrid/comments/1i1elbz/we_played_just_as_poorly_last_season_as_we_are_now/"
    },
    {
        "id": "1i1tci6",
        "author": "Aladeen911MF",
        "title": "Can we really sign a CB in Jan ?",
        "content": "It seems unlikely to find a good enough CB to sign right now and when do we even sign someone in Jan\n\nWe do have 4CBs (Not Including Jesus Vallejo) but only Raul Asencio (22 in Feb) is fit ,Militao (26 in few days) Injured,  Alaba (33 in June) just came back,  Rudiger(32 in March) is playing with knee problems and also the man of the hour Tchouameni (25 in few days).\n\nIf we have to sign a CB then we must look for a Left footed CB who can be on the level to start NOW and also be part of future plans so aged 22-25 OR a Veteran on a loan or even 1.5 yr contract if we have to delay CB signing till 2026. So logical options are:-\n\nSchlotterback - Left- footed 6'3 Just turned 25 in Dec, on Madrid's radar for sometime, playing consistently     on high level since 2022 for Dortmund and Germany (will make amazing pairing with Rudiger)\n\nLukeba (RB Leipzig) - Left footed (184cm) Just turned 22 in Dec Had a decent 2023-24 season, rumoured to be linked with us but this season he was also injured 2 times and is out till Feb                                          {{was in memes that our CB duo Militao,Alaba ACL, Carvajal who can play CB ACL, youngster Joan Martinez ACL,  makeshift CB Tchouameni got injured then Lukeba linked to us also got injured }}                         anyway he started 13 out of 26 games this season.\n\nBoth are valued at 40-50 Mil which seems like a good deal for Jan and or Summer but both are important for their respective clubs\n\nAs for RB, Perez has his eyes on Trent (I don't like him) and will probably sign him in coming summer so it is like a psychological thing that he wouldn't think of signing any RB right now whereas fullback is a position to easily find players on loan",
        "upvotes": 13,
        "comments": 51,
        "media": null,
        "permalink": "/r/realmadrid/comments/1i1tci6/can_we_really_sign_a_cb_in_jan/"
    },
    {
        "id": "1i0w63t",
        "author": "Damned_chicken",
        "title": "miss him already man ",
        "content": "",
        "upvotes": 1646,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1qnq2pcjivce1.jpeg?auto=webp&amp;s=861b71e7e5e368fda695e333157e686d15055b28"
        },
        "permalink": "/r/realmadrid/comments/1i0w63t/miss_him_already_man/"
    },
    {
        "id": "1i1c37s",
        "author": "Nikhil__1012",
        "title": "What goes through the mind of Florentino Perez.?",
        "content": "Like everyone knows how his idea of “the galacticos” failed back in 2002 .. the sole reason being not spending on defense.. we got a generational defense in carvajal ramos pepe varane and marcelo.. but now looking at the state of defense .. like every team literally every team is reinforcing.. it’s not as if we are out of funds or something..like what’s the deal man..? We were interested in yoro.. and we offered lille 15 million.? Like i am genuinely confused what is actually the transfer strategy here man.? We still have the entirety of the jan transfer window.. can still sign a defender and heck trust our own academy players for once.. i dont recognise my club anymore dawg..",
        "upvotes": 83,
        "comments": 87,
        "media": null,
        "permalink": "/r/realmadrid/comments/1i1c37s/what_goes_through_the_mind_of_florentino_perez/"
    },
    {
        "id": "1i0xmf8",
        "author": "Henry-Doe",
        "title": "The German Sniper: You can try to replace him, but you can never replicate him.",
        "content": "",
        "upvotes": 1042,
        "comments": 23,
        "media": null,
        "permalink": "/r/realmadrid/comments/1i0xmf8/the_german_sniper_you_can_try_to_replace_him_but/"
    },
    {
        "id": "1i130z2",
        "author": "AestheticEvan23",
        "title": "Kylian Mbappé vs Barcelona in the super Copa de España ",
        "content": "",
        "upvotes": 323,
        "comments": 36,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/njx2ogkbqxce1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1i130z2/kylian_mbappé_vs_barcelona_in_the_super_copa_de/"
    },
    {
        "id": "1i12e6v",
        "author": "Nyghl",
        "title": "LaLiga YT Channel Made A \"The BEST of ARDA GÜLER | 2024\" Video",
        "content": "",
        "upvotes": 187,
        "comments": 13,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/duxi4ihyhxce1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1i12e6v/laliga_yt_channel_made_a_the_best_of_arda_güler/"
    }
]