[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 497,
        "comments": 271,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 10,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1j9imbd",
        "author": "Somethingman_121224",
        "title": "Netflix's Former Gaming Boss Mike Verdu Has Officially Left The Company Following Earler AI Role",
        "content": "",
        "upvotes": 17,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j9imbd/netflixs_former_gaming_boss_mike_verdu_has/"
    },
    {
        "id": "1j8z6lh",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix to Adapt Stephen King's \"Cujo\" into a New Film",
        "content": "",
        "upvotes": 143,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1j8z6lh/netflix_to_adapt_stephen_kings_cujo_into_a_new/"
    },
    {
        "id": "1j9n4cr",
        "author": "MysteriousDelay6266",
        "title": "The Clubhouse: A Year with the Red Sox | Official Trailer | Netflix",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j9n4cr/the_clubhouse_a_year_with_the_red_sox_official/"
    },
    {
        "id": "1j9k528",
        "author": "SocialNetwooky",
        "title": "why a reboot of \"Welcome to the Family\"",
        "content": "some years ago, netflix had a fantastic spanish show called 'Welcome to the Family' with a perfect cast (Melani Olivares was great, and Yolanda Ramos as Victoria was the highlight) and, of course, a cliff-hanger. \n\nCue today : an all new show called 'Welcome to the Family' is released, with a cast that (at least judging from the trailers), doesn't hold the water to the original cast, and apparently the exact same story as the original S.1.\n\nAnybody knows why? When I saw the title my hopes went up for a long-due second season, but this is just stupid :(",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j9k528/why_a_reboot_of_welcome_to_the_family/"
    },
    {
        "id": "1j9e1x9",
        "author": "ProtossLiving",
        "title": "Court of Gold: More than just Team USA",
        "content": "I watched this miniseries mostly because I'm a fan of Steph Curry and I knew how things were going to go at the end. Given the name of the series, I expected that it would be mostly a documentary about Team USA, which wasn't necessarily my primary interest, but I was fine with if I got to see some Curry highlights.\n\nI was pleasantly surprised at how the other countries were featured just as significantly, probably pretty close to even time with the US (in accordance with the depth of their run in the tournament). Besides interviews with the players and coaches talking about their lives and about the games, they also followed the teams in the locker room, training sessions, and off the court before and during the Olympics. Team France and Team Serbia were followed very extensively. Team Canada was highlighted quite a bit too. Only Team Germany got the shaft in terms of how much it was featured given their 4th place.\n\nI think the players that were followed the most (in terms of interviews, behind the scenes camera time, family life, etc) were probably (in no particular order) Durant (USA), Batum (FRA), and Bogdanovic (SRB) followed by 2-3 other players and coaches from each of those countries and Canada.\n\nDon't be turned off from this Obama executive produced miniseries because you thought it would just be a Team USA chest thumping piece. It's much more than that.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j9e1x9/court_of_gold_more_than_just_team_usa/"
    },
    {
        "id": "1j9kupq",
        "author": "DDkils",
        "title": "The streaming quality is real bad",
        "content": "I've been watching dark and this happened once before that for some reason in playback specs it said SD quality and the show looked shit cuz of that I cleared app data it fixed itself but now it has happened again and now clearing app data and cache ain't working.ive got a s23fe btw it's listed as supported devices ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j9kupq/the_streaming_quality_is_real_bad/"
    },
    {
        "id": "1j9f2nl",
        "author": "Thin_Giraffe8599",
        "title": "Night agent season 2",
        "content": "I’m a bit late to the game but I just finished watching night agent season 2 and I gotta say, I liked season 1 better but this season wasn’t bad. Some things I could easily predict. Idk why people are hating on Rose’s character, I actually liked her. And I gotta say Farad really annoyed me, smh he literally was risking everyone’s lives FOR A GIRL….\n\nBut i have to say THANK YOU for including the Palestinian flag in the last episode 🇵🇸🇵🇸🇵🇸🇵🇸\n\n",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j9f2nl/night_agent_season_2/"
    },
    {
        "id": "1j9hx0t",
        "author": "romrotten",
        "title": "Language in rebel moon soundtrack",
        "content": "Hi guys! Does anyone know what language “a call to courage” is sung in? I imagine it’s a language made up for the film but can’t find anything anywhere.\n\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j9hx0t/language_in_rebel_moon_soundtrack/"
    },
    {
        "id": "1j9560b",
        "author": "VaniZaviBoBani",
        "title": "What is the name of this show?",
        "content": "I saw a show a while ago on Netflix,  it was a competition game show where strangers were fighting for money, but there was a saboteur amongst them. At the end of the challenges they took a quiz and answered questions about the saboteur. The player with the least correct answers got a red light via text. ",
        "upvotes": 9,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1j9560b/what_is_the_name_of_this_show/"
    },
    {
        "id": "1j97h0a",
        "author": "yeswab",
        "title": "I actually want to see the closing credits of Zero Day, episode 6",
        "content": "Does anybody know how to turn off the automatic jump to previews of other programs? For what it’s worth, I was trying to finish Zero Day on a Samsung Android tablet, and we usually watch on a Google Chromecast. I couldn’t readily find any settings. THANK YOU!",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1j97h0a/i_actually_want_to_see_the_closing_credits_of/"
    },
    {
        "id": "1j95ubi",
        "author": "NMokay",
        "title": "Just rewatched Purple Hearts. missing part? Did I make this up?",
        "content": "Am I making this up or was there a part where Cassie and Luke get interviewed by authorities or someone and are asked questions about each other to find out if the marriage is legit. I think immigration is brought up when talking to Cassie and Luke tells them about Cassie’s tattoo and the meaning. I think it happened before the court hearing or before they confessed there love for each other. Maybe I’m thinking of a different movie. ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j95ubi/just_rewatched_purple_hearts_missing_part_did_i/"
    },
    {
        "id": "1j9curf",
        "author": "Ok-Boysenberry2129",
        "title": "Old Netflix show",
        "content": "It was like a TEDTALK type show, with different stories and animations and it was called something like \"Please Start Recording\" and in the intro it was this voice and I remember it saying \"And please take out your phones, and start recording\" something along those lines, I've tried searching Google but it just gives me tutorials ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j9curf/old_netflix_show/"
    },
    {
        "id": "1j87k40",
        "author": "Internal-Bed-3150",
        "title": "Greta Gerwig wants Charli XCX in her Narnia movies",
        "content": "",
        "upvotes": 367,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1j87k40/greta_gerwig_wants_charli_xcx_in_her_narnia_movies/"
    },
    {
        "id": "1j8tx2g",
        "author": "theTexans",
        "title": "Any documentaries or shows that focus on the Ukraine war?",
        "content": "Is there any content on Netflix or outside that focuses on the current ongoing war in Ukraine? Trying to get a better understanding of what is going on, the history behind it, and really, how did Russia turn out to be such a paper tiger after decades of fear mongering being the big bad wolf and their spectacular failure in Ukraine. ",
        "upvotes": 7,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1j8tx2g/any_documentaries_or_shows_that_focus_on_the/"
    },
    {
        "id": "1j9m7is",
        "author": "Immediate_Check_74",
        "title": "Great Alexander \"Documentary\" on Netflix Utter Hollywood Fan Fiction",
        "content": "Disgusting interpretations and revisionist history. Great Alexander detested homosexuality as did many Greek thought leaders and prominent individuals at the time",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1j9m7is/great_alexander_documentary_on_netflix_utter/"
    },
    {
        "id": "1j8ulk5",
        "author": "S4v1r1enCh0r4k",
        "title": "Cristin Milioti has joined the cast of Netflix’s ‘In Your Dreams’ alongside Simu Liu and Craig Robinson.",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j8ulk5/cristin_milioti_has_joined_the_cast_of_netflixs/"
    },
    {
        "id": "1j9h108",
        "author": "StefanStandUp",
        "title": "I'm using Netflix with ads",
        "content": "For some reason on my Netflix subscription where I use my laptop and my smart tv....i only get ads on my TV...why is that...and on my laptop there is a still add only when I press pause",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j9h108/im_using_netflix_with_ads/"
    },
    {
        "id": "1j8ttyt",
        "author": "Gabe_H_Cuod24",
        "title": "Manhunt: Osama Bin Laden still not available?",
        "content": "So I’ve been waiting for the new Manhunt documentary to drop. Said it was coming March 10. So yesterday morning I went to watch and it wasn’t popping up in my watch list. I searched and it came up as coming soon. So I waited and today is same thing. Does anyone know why it hasn’t dropped yet? Or have they had this experience with any other show? I never have… usually by midnight on date they say the show always drops.",
        "upvotes": 4,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1j8ttyt/manhunt_osama_bin_laden_still_not_available/"
    },
    {
        "id": "1j96a7y",
        "author": "Pitiful_Mechanic9837",
        "title": "Account on hold after cancellation",
        "content": "Hello, everybody.\n\nI've had Netflix for about 6 years, and have cancelled a few times but have never had this issue before.\n\nBasically, i automatically paid for a subscription on March 7th, on March 8 decided to cancel.\nIt said that i was able to watch until April 6th, however, today, March 12 (first time since cancelling), i logged into my Netflix account and it says that it's on hold, until I update my payment info, I'm guessing because i don't have enough money to pay, and now I'm worried if they will double charge me when i receive my salary tomorrow.\n\nHas anyone else had this problem? Do i just hope for the best, or try to contact Netflix support, which is also a problem, since I haven't been able to contact them about previous issues.\n\nAny help would be kindly appreciated, thank you.\n",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1j96a7y/account_on_hold_after_cancellation/"
    },
    {
        "id": "1j8ivi0",
        "author": "Way-of-Kai",
        "title": "How do we feel about 3-4 years for subsequent seasons",
        "content": "On one hand I understand the time required to deliver quality work, but a decade to conclude a story is really exhausting. Like people just move-on in life and even stop caring about something they watched 5 years ago. \n\nOnce concluded it will obviously be looked back as a peak animation that redefined its genre. But it’s frustrating for us bunch waiting for it to come out.\n\nIt’s similar case as spiderverse films, just notice how much your life has changed between each film.",
        "upvotes": 36,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1j8ivi0/how_do_we_feel_about_34_years_for_subsequent/"
    },
    {
        "id": "1j95ez8",
        "author": "Admirable_Hat_4344",
        "title": "Is there anyway to turn off the slideshow that starts up when a show is paused for a while?",
        "content": "I’m using the app on a Sony smart tv. \n\nWhenever it’s paused it goes into a slideshow with cards displaying shows Netflix is trying to promote. I get that it’s a screensaver, but it does this really fast and if I’m trying to concentrate on other things the changing image and light in the room gives me a headache for some reason. I feel like it’s timed to be as distracting as possible. I just want to write an email without having to exit the show or app every time. ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1j95ez8/is_there_anyway_to_turn_off_the_slideshow_that/"
    },
    {
        "id": "1j951j5",
        "author": "Alan_Stamm",
        "title": "'Let us rejoice:' Everybody's Live with John Mulaney Again [12-week series starts March 12]",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j951j5/let_us_rejoice_everybodys_live_with_john_mulaney/"
    },
    {
        "id": "1j8owc5",
        "author": "Spider-ManWasTaken",
        "title": "What show am I thinking about?!",
        "content": "I remember I watched it 2023 and it was about two girl best friends, one of them dies, only the best friend can see the dead one and they have to figure out a bunch of stuff and there’s drama etc, I think it was one blonde and one brunette. It had a plot twist at the end as well.\n\nEdit: it was a limited series!",
        "upvotes": 10,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1j8owc5/what_show_am_i_thinking_about/"
    },
    {
        "id": "1j85l1m",
        "author": "Last_Weird0717",
        "title": "American Manhunt Osama bin Laden: Not coming up on my Netflix??",
        "content": "I'm in the US and had this on my list to watch for today. Now it's suddenly not showing up at all. Anyone else having this issue? I know the release date was today, March 10th. \n\n",
        "upvotes": 187,
        "comments": 347,
        "media": null,
        "permalink": "/r/netflix/comments/1j85l1m/american_manhunt_osama_bin_laden_not_coming_up_on/"
    },
    {
        "id": "1j8y7uv",
        "author": "ditzy-feet_o",
        "title": "Appreciation post",
        "content": "I really love netflix. I have been a customer since forever. Over the years I have really found some shows and movies that have stuck with me, that  I continue to watch today. Some I've even bought the DVD! (Just in case) When I turn on netflix,  I feel like I am turning on excitement, happiness and comfort. I appreciate it, and I just want to say thank you for existing! And also thank you to the creators of all the wonderful shows and movies! ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1j8y7uv/appreciation_post/"
    },
    {
        "id": "1j93hqj",
        "author": "KhajiitHasWares2077",
        "title": "Standard With Ads Locked Content Eventually Unlock?",
        "content": "Pretty straightforward but I got the standard with ads tier so my wife and I can watch the new John Mulaney Everybody is Live Show. I was told certain content like The Walking Dead, The Good Place and Peaky Blinders were locked but I currently have full access to these shows. On the other hand some things like The Hateful Eight Extended and Baby Driver are locked which is a bummer but since the previously locked content I mentioned before are now available, does that mean Netflix is able to roll out unlocks to specific content eventually? And if so is there a certain pattern to when a new wave of unlocks occur?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j93hqj/standard_with_ads_locked_content_eventually_unlock/"
    },
    {
        "id": "1j8ebhl",
        "author": "cuzforwhy",
        "title": "Recommend Netflix shows or movies for a dental office",
        "content": "I work in a dentist office and I like to keep the tv in my operatory on, most of my patients are older folks and I need some Netflix shows or movies to play throughout the day that are appropriate and don’t have any awkward sex scenes or something, thank you.😂",
        "upvotes": 46,
        "comments": 92,
        "media": null,
        "permalink": "/r/netflix/comments/1j8ebhl/recommend_netflix_shows_or_movies_for_a_dental/"
    },
    {
        "id": "1j925gp",
        "author": "cniniq",
        "title": "error while trying to watch downloaded episodes",
        "content": "okay so my internet has been trash lately and i downloaded a episode of oshi no ko a while back and earlier i started watching the first episode and all was fine but then i clicked off it to go shower and when i came back and tried to put it back on the error in the screenshot showed up what should i do? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j925gp/error_while_trying_to_watch_downloaded_episodes/"
    },
    {
        "id": "1j89yi7",
        "author": "Josh1923",
        "title": "American Manhunt: Osama bin Laden",
        "content": "Just spoke with support and they’re saying there’s no official release date. This is annoying ",
        "upvotes": 75,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1j89yi7/american_manhunt_osama_bin_laden/"
    },
    {
        "id": "1j91ang",
        "author": "tiemeupinribbons",
        "title": "Issue with WWE RAW playback - UK Netflix",
        "content": "I’m watching March 10’s event, but the playback starts midway through, right at The Judgement Day’s skit (for lack of a better word), skipping some early matches. The show still has the “previously streamed live” tag instead of the “edited” tag.\n\nIs this an editing error, or is anyone else seeing the same issue?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j91ang/issue_with_wwe_raw_playback_uk_netflix/"
    }
]