[
    {
        "id": "1n5koa1",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 20,
        "comments": 789,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n5koa1/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1n80scb",
        "author": "zains43",
        "title": "The season has started guys, we take their girls we take the trophies too",
        "content": "",
        "upvotes": 366,
        "comments": 75,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xlj5bobbt2nf1.jpeg?auto=webp&amp;s=ac2bee463bc41030d508f0797d19e0f259a95408"
        },
        "permalink": "/r/realmadrid/comments/1n80scb/the_season_has_started_guys_we_take_their_girls/"
    },
    {
        "id": "1n7r1d5",
        "author": "Midnight_Thoughts77",
        "title": "Let’s be fair to Carlo",
        "content": "Every other day, I see our fanbase saying something harsh about Carlo and it breaks my heart. I understand some people never liked the brand of football he offered and last season in particular. I hear you guys. But acting like he was good for nothing and a big problem is such a harsh way to see him.\n\nBut let’s be fair to him please.. On his first stint, he cane to Madrid from PSG when we weren’t at our best. We had won one league title in 5 years and it seemed like we were never gonna win La Decima. He was the manager to finally deliver the league title to PSG and had unlimited money to push for CL there. He came over and he delivered the biggest night in the club history this century. And the reward he got- unfairly dackedyfor Rafa freaking Benitez next season. All the players publicly said they wanted him to stay.. Did he ever say anything bad about us? Nope, he said he is a Madridista just like us.\n\n2022- Zidane had just quit. Real Madrid were struggling to find a manager. Even Max Allegri snubbed us having said yes before. Who comes to the rescue? Carlo Ancelotti. And what does he do? Win us the Champions League against all odds and the league title too. Remember how far away we seemed from the CL title in 2021? And he does it again the best GK in the world, 2 starting CBs out with ACL and no striker other than Joselu..\n\nYes he had bad moments and difficult times.. Is some of his criticism fair? Yes, absolutely.. Does he deserve the abuse we give him? Absolutely not! He came from Milan and became a Madridista. He is very vocal about it. We owe so much to him. And above all, he was a gentleman. He is my favorite manager along with Zidane. Gracias Carlo ❤️",
        "upvotes": 843,
        "comments": 49,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/fxi8t7qsl0nf1.jpeg?auto=webp&amp;s=4a58d7f1b6f0b08c40ec500b73b563990578f54c"
        },
        "permalink": "/r/realmadrid/comments/1n7r1d5/lets_be_fair_to_carlo/"
    },
    {
        "id": "1n83gg1",
        "author": "brainybrit",
        "title": "The type of defending that makes defenders more likable than attackers",
        "content": "",
        "upvotes": 122,
        "comments": 8,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/4lerd05am3nf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1n83gg1/the_type_of_defending_that_makes_defenders_more/"
    },
    {
        "id": "1n7pvjm",
        "author": "EndouShuuya",
        "title": "CARRERAS THE LEGEND!⚔️",
        "content": "",
        "upvotes": 469,
        "comments": 28,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/owjz12pyc0nf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1n7pvjm/carreras_the_legend/"
    },
    {
        "id": "1n84ecq",
        "author": "landofphi",
        "title": "Trent Alexander-Arnold: \"Leaving Liverpool was one of the hardest decisions of my life. But Real Madrid is the right step, at the right time. I am excited to learn the Spanish language\"",
        "content": "",
        "upvotes": 43,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6XcyeE13j5LTZtJMZudutlSce3I6oFZ86J8tbfubc4s.jpeg?auto=webp&amp;s=000118f19d0e6af2d4f5d2add0b92ad820ab88ec"
        },
        "permalink": "/r/realmadrid/comments/1n84ecq/trent_alexanderarnold_leaving_liverpool_was_one/"
    },
    {
        "id": "1n7dmcs",
        "author": "Disastrous-Duty-8152",
        "title": "Players who were the number 10 shirt before Luka modric, Who is Ur fav number 10 among them",
        "content": "Ofc I won't Include Luka cause ofc he is the fav and legend \n\nAnd won't Incldue Kylian Also As he just got the shirt\n\nFor me it is Ozil, He was a magician for us in the midfield, He would always play consistently well across all competitions and also he would become stand out player for us in some matches\n\nSo it is mesut for me, my fav number 10 shirt holder ofc after Luka modric, What Abt u",
        "upvotes": 645,
        "comments": 170,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n7dmcs/players_who_were_the_number_10_shirt_before_luka/"
    },
    {
        "id": "1n7b7ot",
        "author": "chunchunmaru1129",
        "title": "He still needs to work on his defensive game but honestly let Güler cook",
        "content": "",
        "upvotes": 707,
        "comments": 51,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/n5km3tjigxmf1.png?auto=webp&amp;s=a91efd12d9555f3cdee089c77e5da478d35994f9"
        },
        "permalink": "/r/realmadrid/comments/1n7b7ot/he_still_needs_to_work_on_his_defensive_game_but/"
    },
    {
        "id": "1n7d6ob",
        "author": "ace-s",
        "title": "In his first three LaLiga games as Real Madrid manager, Xabi Alonso has only allowed 17 shots, the lowest tally by a manager in the competition since Josep Guardiola with FC Barcelona in 2008 (12). Exciting.",
        "content": "",
        "upvotes": 410,
        "comments": 54,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n7d6ob/in_his_first_three_laliga_games_as_real_madrid/"
    },
    {
        "id": "1n84bzk",
        "author": "flashscoreofficial",
        "title": "Scaloni on Mastantuono: \"He is a boy who shows maturity. It's clear that he has a huge future ahead of him.\"",
        "content": "Scaloni spoke exclusive to Flashscore and Mastantuono was on of the topics.\n\nHere is the part:\n\n**Franco Mastantuono made his debut in Real Madrid and revolutionised everything. How did you see all this evolution that he had until he arrived in the white team and all this process that he is going through?**\n\n\"Franco's situation is a bit similar to that of Nico Paz. He is a very young boy, even younger than Nico, who has taken a giant step in his career, to a club that is huge, and all in due time.\n\n\"Luckily, his coach understands him, he knows very well what is there, and they are going to take him in the way they see fit. Let's not forget how old he is, let's not forget the step he's taken, and I think Real Madrid are aware of that and they're going to take him in the way they see he can move up. Let's understand that he is a young boy and that he needs to adapt.\n\n\"We, as a coaching staff, believe in his possibilities, and as far as we think it's convenient and that he can contribute, we will use him. And if we see that it's not yet the right time, we'll do that too, but it's clear that he has a huge future ahead of him.\n\n**Do you see him mature at the age of 18, and that he really feels football as if he has always played for Real Madrid, in these first matches?**\n\n\"Yes, he is a boy who shows maturity, he shows that he wants to learn, and it is clear that he has fantastic conditions and that he has to exploit them, as long as the club, his teammates and the coach understand that he is 18 years old.",
        "upvotes": 7,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/yE2MXENzrh7IkTwZUJR-Eg4K1m1VhUoUu7ZEJcaPabY.jpeg?auto=webp&amp;s=41af586c6c81dc7ccd1a397d7552443e9486398f"
        },
        "permalink": "/r/realmadrid/comments/1n84bzk/scaloni_on_mastantuono_he_is_a_boy_who_shows/"
    },
    {
        "id": "1n7pwu0",
        "author": "Bunchdawg",
        "title": "Are we being to hard on Asencio?",
        "content": "I feel his struggles are all mental. From a shining light last year to zero minutes now. It was no fluke that he was called up to Spain national team last season. It was no fluke that he was respected by big players like KDB. Our CBs besides Dean are either on the older side or injury prone. I'm not saying we should forgive everything, but he will never build back his confidence if he rides the bench. Maybe easing him into late games against smaller teams or rotating him with Alaba.\n\nI'm just traumatized from last year's backline situation. We are an injury or two away from being in that position again.",
        "upvotes": 59,
        "comments": 49,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n7pwu0/are_we_being_to_hard_on_asencio/"
    },
    {
        "id": "1n7bl0b",
        "author": "ivololtion",
        "title": "To everyone bashing Ancelotti and others",
        "content": "https://www.reddit.com/r/soccer/s/a0BTuLQlwR\n\nCame across above post in r/soccer. Couldn’t agree more with Salah here: why do we need to bash former players and staff when they’re replaced? \n\nEspecially when it comes to Ancelotti being replaced by Xabi. Carletto is one of the most impactful coaches for RM ever. Last season was a stinker, and he carries responsibility for that. But let’s not put dirt on our own.\n\nIn before people react to this with “criticism should be possible”: yes, absolutely, but do it respectfully. There’s simply no way Ancelotti is some clueless fool that was lucky enough to win more CL titles than any other manager ever.",
        "upvotes": 139,
        "comments": 59,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n7bl0b/to_everyone_bashing_ancelotti_and_others/"
    },
    {
        "id": "1n6vnh5",
        "author": "heykevin08",
        "title": "Rodrygo post: Home 🤍",
        "content": "",
        "upvotes": 1075,
        "comments": 68,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/wes2zrxtgtmf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1n6vnh5/rodrygo_post_home/"
    },
    {
        "id": "1n778ao",
        "author": "New-Ad-9981",
        "title": "La Liga: The Most “Elite” Amateur League in the World",
        "content": "Honestly, how does La Liga still market itself as one of the top leagues in the world when every week there's another scandal?\n\n**Referee scandals everywhere** – First the Negreira case, where Barcelona paid a former referees’ official for “consulting” over years. And the story of a ref whose company allegedly had business ties with Atlético Madrid, or another ref who had a painting of Messi on his garden wall. And of course, there’s supposedly no conflict of interest, and the fact that these refs keep making the most questionable decisions against Madrid is just a coincidence. And those were just two of the bigger scandals from last season that involved Real Madrid. Every single week there are smaller controversies — and bigger ones affecting other teams too — with absolutely no sign of things improving anytime soon.\n\n**No goal-line technology in 2025** – Every other major league solved this problem a decade ago. Meanwhile in Spain, you’re still relying on VAR guesswork and dodgy camera angles to decide if a ball crossed the line in billion-euro competitions.\n\n**Offside tech behind the times** – The Premier League uses thicker lines to account for the 2–5 cm margin of error in frame rates and calibration. La Liga? Paper-thin lines and decisions made down to a single pixel, even though the technology itself admits it isn’t that precise. Just look at Mbappé’s goal in the last match — it was clearly onside. How can anyone in this league seriously rule a player offside by 1 mm when experts agree the system has a 2–5 cm error margin?\n\n**And sometimes, VAR just… \"doesn’t work\"** - Somehow, in 2025, there are still games where VAR goes completely offline for \"technical reasons\", leaving clubs in billion-euro competitions at the mercy of human error like it’s 1995.\n\n**Home advantage? Let’s sell it to the US** – Instead of fixing officiating or infrastructure, La Liga wants to stage league games in the United States, stripping smaller clubs of one of the only equalizers they have: home turf advantage.\n\n**Then there’s the racism** - Week after week, Black players — especially stars like Vinícius Júnior — face racist abuse from the stands, and the response from the league is embarrassingly weak. No other top-five league even comes close to this level of repeated incidents with so little action taken.\n\nCorruption scandals, outdated technology, decisions made with zero regard for sporting fairness, racism, and bizarre scheduling issues — this league needs a complete overhaul before it can even be called professional. But Tebas seems to care more about money than about “unnecessary” things like fairness and integrity.\n\n**\"This isn’t football. This is La Liga.\"**\n\n\n*Edit: I’ve added the racism issue as well. Sorry for forgetting this other unique feature of La Liga.*",
        "upvotes": 197,
        "comments": 48,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n778ao/la_liga_the_most_elite_amateur_league_in_the_world/"
    },
    {
        "id": "1n78gli",
        "author": "thewonderkid004",
        "title": "I got my first tattoo",
        "content": "",
        "upvotes": 136,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mljcaqazkwmf1.jpeg?auto=webp&amp;s=ffea7913259de8da7b24812790f122984d94daba"
        },
        "permalink": "/r/realmadrid/comments/1n78gli/i_got_my_first_tattoo/"
    },
    {
        "id": "1n6r0i9",
        "author": "Bosphore9",
        "title": "OTD 12 years ago Mesut Özil left Real Madrid for joining Arsenal for 50M€",
        "content": "Mesut Özil, the playmaker and no.10 of Real Madrid leaved the club for Arsenal in 2nd September 2013, the last day of the transfer window. His departure shocked everyone (RM players, fans and even Barca players) and was heavily criticised. \nHis teammate Khedira considered that he was top5 at his prime. Fabregas said « They sold their second best player ». Throughout his carrer at Madrid, he made 80 assists in 3 seasons.\nHis last games for Madrid were those of preseason and first two journeys of 2013/14 season. He later revealed that he never wanted to leave.\nWould you have kept him ?",
        "upvotes": 840,
        "comments": 82,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n6r0i9/otd_12_years_ago_mesut_özil_left_real_madrid_for/"
    },
    {
        "id": "1n6teh6",
        "author": "alleged_loyalty",
        "title": "Big chances conceded by LaLiga teams 25/26 [Managing Madrid]",
        "content": "",
        "upvotes": 293,
        "comments": 40,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9vu8hc2p1tmf1.jpeg?auto=webp&amp;s=d8ce2902f07b9444970ab72b7af67ba9950c7911"
        },
        "permalink": "/r/realmadrid/comments/1n6teh6/big_chances_conceded_by_laliga_teams_2526/"
    },
    {
        "id": "1n6ni8b",
        "author": "NickyBrain_2",
        "title": "just found this on wplace. holy. shit🔥",
        "content": "",
        "upvotes": 549,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5qnmtc1eyrmf1.jpeg?auto=webp&amp;s=bca59243d4e09d1b7f524eb4bafd9f2d2162a8d9"
        },
        "permalink": "/r/realmadrid/comments/1n6ni8b/just_found_this_on_wplace_holy_shit/"
    },
    {
        "id": "1n7kgco",
        "author": "ExtraSafeForWork",
        "title": "Would you recommend RM Play?",
        "content": "I'm in the US and a die-hard fan, but the live game times often don't work for my schedule. I've been seeing a lot of content from RM Play and I'm seriously considering signing up for the premium/paid version, but I have a few questions for those of you who already have it.\n\nCondensed Replays: I've heard they have 30-minute condensed match replays. How good are they? Do they do a good job of showing the flow of the match and not just the goals and highlights? Is this the best way to catch up on a match you missed without committing to the full 90?\n\nHistorical Content: One of the big selling points for me would be the historical archives. What's the content like? Are there a lot of full matches from past seasons, or is it mostly documentaries and short clips? I'd love to re-watch some of the classic Champions League finals.\n\nSpoilers: This is a big one. For those of you who watch replays, is it easy to navigate the app and find the game without getting spoiled by the score in the thumbnail or title? How long does it take for the replays to post?\n\nApp Functionality (Roku): Since I'm in the US and primarily use a Roku, I'm concerned about the app's performance. Does the app work well on Roku devices? Is it buggy? Does it buffer a lot? I've seen some mixed reviews for other platforms.\n\nAny and all feedback would be super helpful. Just want to make sure the value is there before I commit. Thanks in advance and Hala Madrid!",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n7kgco/would_you_recommend_rm_play/"
    },
    {
        "id": "1n7ax5z",
        "author": "Pale-Boysenberry1719",
        "title": "Why isn't there a phisical card and welcome package in Madridista premium anymore?",
        "content": "I wanted to go to Bernabeu for some time now and I thought I'd buy premium to have a better chance to get tickets. But I'm pretty sure last year when I checked it, it was not only cheaper, but it involved a phisical card and a welcome package and people where pretty hyped when they got it\n\nIs there a way to get those? Maybe when I get to the stadium?",
        "upvotes": 15,
        "comments": 10,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n7ax5z/why_isnt_there_a_phisical_card_and_welcome/"
    },
    {
        "id": "1n6me2j",
        "author": "Disastrous-Duty-8152",
        "title": "All of our players that are leaving for international duty",
        "content": "",
        "upvotes": 494,
        "comments": 50,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n6me2j/all_of_our_players_that_are_leaving_for/"
    },
    {
        "id": "1n6jeq4",
        "author": "TheFeatherDiaries",
        "title": "LA LIGA August 2025 TEAM OF THE MONTH features Kylian Mbappe , Arda Guler and Dean Huijsen [Whoscored.com]",
        "content": "",
        "upvotes": 491,
        "comments": 60,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1l60ozuz5rmf1.jpeg?auto=webp&amp;s=85b0a09367102244e0ac5c8fe926d85f41605f2c"
        },
        "permalink": "/r/realmadrid/comments/1n6jeq4/la_liga_august_2025_team_of_the_month_features/"
    },
    {
        "id": "1n6etuq",
        "author": "choker_18",
        "title": "In Madrid there is no \"I want to\"..... It's always \"I have to\".",
        "content": "",
        "upvotes": 1029,
        "comments": 47,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2jf3469ezpmf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1n6etuq/in_madrid_there_is_no_i_want_to_its_always_i_have/"
    },
    {
        "id": "1n6sxhe",
        "author": "cyrusmancub",
        "title": "Rodrygo: “Historia por hacer”",
        "content": "",
        "upvotes": 138,
        "comments": 7,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n6sxhe/rodrygo_historia_por_hacer/"
    },
    {
        "id": "1n6nyn2",
        "author": "mikesartwrks",
        "title": "Artist from Ireland. Painting of Cristiano I finished a couple of months back 👍",
        "content": "",
        "upvotes": 239,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/6scdbvwf1smf1.jpeg?auto=webp&amp;s=d14b6c66fcd06a1816ad808dd264aa90aafba829"
        },
        "permalink": "/r/realmadrid/comments/1n6nyn2/artist_from_ireland_painting_of_cristiano_i/"
    },
    {
        "id": "1n6n5uq",
        "author": "sankethan3",
        "title": "Feel bad for Fran Garcia",
        "content": "Fran García’s journey at Real Madrid hasn’t been easy. Despite his talent and dedication, he struggles to get consistent minutes due to fierce competition in the squad. It’s tough to see a player with such potential sidelined so often. You can’t help but feel bad, as he truly deserves more chances. What are your views on this?",
        "upvotes": 229,
        "comments": 84,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n6n5uq/feel_bad_for_fran_garcia/"
    },
    {
        "id": "1n6bz6n",
        "author": "EffectiveTie3144",
        "title": "OTD September 2nd 2013, Gareth Bale was presented at the Santiago Bernabéu as a new Real Madrid player.",
        "content": "",
        "upvotes": 1216,
        "comments": 51,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n6bz6n/otd_september_2nd_2013_gareth_bale_was_presented/"
    },
    {
        "id": "1n6k9zu",
        "author": "Fluffy-Walrus3866",
        "title": "Marc Guehi for free is ideal",
        "content": "I wonder how people feel about this. I imagine most people will think meh because he’s not the big flashy signing like konate, saliba, etc. HOWEVER, this guy is the type of personality we want. Calm guy. Has stepped up to every level he’s been asked to. Like when he stepped up to playing for the English national team which is a pressure cooker. He’s got a great, professional personality. Just look at how he handled his potential transfer to Liverpool all summer, continuing to put his head down and playing til the last game for crystal palace. If we can get him for free, I know this guy is not the type to come in demanding Alaba-like wages. I regularly watch the prem and I’m a big fan. Would love to see this. \n",
        "upvotes": 121,
        "comments": 84,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n6k9zu/marc_guehi_for_free_is_ideal/"
    },
    {
        "id": "1n5tyk1",
        "author": "zains43",
        "title": "Deadline day as a madrid fan",
        "content": "",
        "upvotes": 1334,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/c2k7nub62lmf1.jpeg?auto=webp&amp;s=c61e7e978b3a8c8521e28e9fcc8c929c349852aa"
        },
        "permalink": "/r/realmadrid/comments/1n5tyk1/deadline_day_as_a_madrid_fan/"
    },
    {
        "id": "1n6a5my",
        "author": "clantz8895",
        "title": "Let's talk about it one of the most underrated players of the three peat era. It is Isco",
        "content": "I would have posted a picture too but it got removed. Isco was fundamental for like 4 years straight. One of the best footballers and I know people appreciate him at Betis but wow was this dude something else. I feel bad for anybody who didn't get to see his peak. Dude was doing shit only a handful of players can. Go watch his highlights and tell me he is not one of the most technical footballers of all time",
        "upvotes": 78,
        "comments": 33,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n6a5my/lets_talk_about_it_one_of_the_most_underrated/"
    },
    {
        "id": "1n5up1w",
        "author": "SeamenMobster",
        "title": "Xabi convincing Rodrygo to stay and challenge Vini for his position will end up one of the most important decisions by end of season.",
        "content": "Now that the market is closing and we can confirm that Rodrygo is staying (at least till Jan), I want to point out how important it is to have 2 world class wingers fight for the same position. They should push each other's level beyond what being a guaranteed starter can get you and WE WILL BE HERE FOR IT!",
        "upvotes": 436,
        "comments": 95,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n5up1w/xabi_convincing_rodrygo_to_stay_and_challenge/"
    }
]