[
    {
        "id": "1hqxs0r",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://t.me/+K_tQ4Zzi0S80YjFk): Gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[LA TAVERNA DELLO STUDENTE](https://t.me/latavernadellostudente/5207): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g30QJSClHjRAUvFBqKJa-Re4duFBniS6HkLBoJRdgOQ.jpg?auto=webp&amp;s=2c44cf9a902b77de7dce3b5cad542f22791fb32e"
        },
        "permalink": "/r/torino/comments/1hqxs0r/la_piola_friends_meetup/"
    },
    {
        "id": "1hxqlql",
        "author": "Amazing_Constant_405",
        "title": "Torino, io ti voglio bene, ma che aria di merda che hai",
        "content": "foto dal faro della maddalena ",
        "upvotes": 322,
        "comments": 70,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/pdgf06rnz1ce1.jpeg?auto=webp&amp;s=c29ef7a2d94f4316f1971c91b79248be1e12651e"
        },
        "permalink": "/r/torino/comments/1hxqlql/torino_io_ti_voglio_bene_ma_che_aria_di_merda_che/"
    },
    {
        "id": "1hydgd3",
        "author": "Top_Entrepreneur620",
        "title": "Ma di estate Torino è come una qualunque città italiana ? Caldo torrido o lo stare al nord aiuta il fresco ?",
        "content": "",
        "upvotes": 5,
        "comments": 28,
        "media": null,
        "permalink": "/r/torino/comments/1hydgd3/ma_di_estate_torino_è_come_una_qualunque_città/"
    },
    {
        "id": "1hy78wt",
        "author": "Ambitious_Home8801",
        "title": "Aurora",
        "content": "Hello /torino!\n\nI’ve been offered an apartment (650€) in Aurora, but I read a lot of negative stuff about the area online. Is this a good place to live? I would be staying there for 6 months.\n\nGrazie Mille 👏🏽",
        "upvotes": 9,
        "comments": 48,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/87iiqwmss6ce1.jpeg?auto=webp&amp;s=d34a4ba712017098223414f2f72edd49c109a30d"
        },
        "permalink": "/r/torino/comments/1hy78wt/aurora/"
    },
    {
        "id": "1hy6rkl",
        "author": "One_Chart_3100",
        "title": "Quanto guadagna un autista gtt? ",
        "content": "Buondì, come da titolo sarei curioso di sapere quanto guadagna un autista gtt. Conoscete qualcuno che lo fa di lavoro? Lo fate voi stessi?\nHo conosciuto un signore che mi diceva di guadagnare 30k netti l'anno contando tutte le mensilità e il bonus di produzione che gli davano praticamente tutti gli anni. Questo signore ci ha lavorato 27 anni. ",
        "upvotes": 5,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1hy6rkl/quanto_guadagna_un_autista_gtt/"
    },
    {
        "id": "1hydhwz",
        "author": "Stoploss888",
        "title": "Affitto - dove cercare?",
        "content": "Salve a tutti,\n\nDa febbraio dovrei iniziare a cercare casa a torino, possibilmente ben collegata con il PoliTo. Sapreste suggerirmi zone dove si possono trovare monolocali a cifre ragionevoli?\n\nCom'è in generale la situazione affitti a torino? Su che piattaforme consigliate di cercare (facebook, idealista, immobiliare etc.)?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1hydhwz/affitto_dove_cercare/"
    },
    {
        "id": "1hydtjj",
        "author": "infinis_",
        "title": "Parrucchiere per tinta ",
        "content": "Buonasera, qualcuno potrebbe consigliarmi un buon parrucchiere esperto nella gestione dei capelli colorati, sia per il processo di schiaritura che per la tinta? (se possibile uno ad un prezzo accessibile🥲)\nGrazie in anticipo!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1hydtjj/parrucchiere_per_tinta/"
    },
    {
        "id": "1hybua9",
        "author": "LudWitt98",
        "title": "English Book Club in Torino?",
        "content": "Hi everyone, does anyone know of an English-speaking book club in Torino?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1hybua9/english_book_club_in_torino/"
    },
    {
        "id": "1hy9ufl",
        "author": "Tribox_",
        "title": "Erasmus pub crawl",
        "content": "Tomorrow?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1hy9ufl/erasmus_pub_crawl/"
    },
    {
        "id": "1hy9t18",
        "author": "Sospettosamente",
        "title": "Quale pescheria mi consigliate ? ",
        "content": "Buonasera, domani vorrei acquistare un po’ di pesce di buona qualità. Posso spostarmi su tutta torino, quale pescheria mi consigliate ? Quale pensate sia la migliore per qualità prezzo? ",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1hy9t18/quale_pescheria_mi_consigliate/"
    },
    {
        "id": "1hy875d",
        "author": "Leonix2329",
        "title": "ENTRATO IN UN GRUPPO WHATSAPP DI SBIRRI",
        "content": "È successo questa mattina, alle 12 circa quando sono entrato in auto per la pausa pranzo, ho acceso il telefono che non accendevo dalle 8 (per il mio lavoro non devo stare al telefono) e ho visto che mi hanno fatto entrare in un gruppo:\"Torino in moto\". Io abito a Torino. Praticamente mi davano il benvenuto e hanno cominciato a chattare degli orari dei poliziotti torinesi. Dicevano che mi dovevo recare alle 21.00 di fronte a Stura (stazione di treni a torino) in moto. Io non sapevo, abito da solo in un bilocale in centro e non ho una moto ma una Fiat che mi va meglio delle moto. E boh, dopo dei rapidi screen sono uscito dal gruppo.\nGrazie della lettura (^_^)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1hy875d/entrato_in_un_gruppo_whatsapp_di_sbirri/"
    },
    {
        "id": "1hy4ius",
        "author": "Prestigious_Use9038",
        "title": "CREW PER CORTO",
        "content": "Ciao ragazzi! Faccio parte di una band, siamo di Torino, e avremmo intenzione di girare un piccolo corto (al momento non abbiamo la durata precisa, ma sarebbe intorno ai 10/15 minuti); abbiamo anche già dei probabili attori e un concept ben definito per il soggetto.\n\nOra, non ci stiamo rivolgendo ad agenzie perchè sinceramente non abbiamo idea di come ci si muova, ma vorremmo capire se esistesse 1/2 videomaker (non so se è la figura giusta da cercare per questo tipo di filmato) per poter finalmente concretizzare il tutto. \n\nSiete/conoscete gente che potrebbe aiutarci?\n\nGrazie mille in anticipo (spero di non esser andato fuori flair)",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1hy4ius/crew_per_corto/"
    },
    {
        "id": "1hy4i6d",
        "author": "Debsandmangos",
        "title": "Abiti cerimonia",
        "content": "Holaa, sono stata invitata a un matrimonio a fine Maggio, ma non ho assolutamente idea di dove si compri un abito elegante da cerimonia!\nQualcuno di voi conosce un negozio in zona Centro, San Donato o San Paolo ? ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1hy4i6d/abiti_cerimonia/"
    },
    {
        "id": "1hxx252",
        "author": "gwelloween",
        "title": "Nollegiare una bici?",
        "content": "Sarò a Crocetta per studiare Odontoiatria. Qual è il meglio mezzo di trasporto in questo caso?\nDove posso trovare, como funziona il noleggio biciclette a torino?\n",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1hxx252/nollegiare_una_bici/"
    },
    {
        "id": "1hxqzes",
        "author": "Sorry_Carrot7537",
        "title": "serate tecno qui a Torino?",
        "content": "Buonasera a tutti, sono un ragazzo di 19 anni e da poco mi sono trasferito qui a Torino, non sono il tipo che va spesso a ballare o a serate, ma ultimamente sento il bisogno di dovermi fare una serata tecno, qualcuno sa consigliarmi un posto dove andare? accetto anche gente per compagnia in tal caso, giuro sono simpatico ",
        "upvotes": 2,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1hxqzes/serate_tecno_qui_a_torino/"
    },
    {
        "id": "1hxhah6",
        "author": "West_Conclusion_1239",
        "title": "Quartieri più ricchi o benestanti di Torino??",
        "content": "Per pura curiosità, quali sono i quartieri più ricchi o benestanti di Torino??\n\nQuali sono le zone in cui vivono le persone o famiglie ricche, benestanti, o anche classi medio-alte della città??\n\nGrazie alla disponibilità di chi mi risponderà.\n\n",
        "upvotes": 6,
        "comments": 28,
        "media": null,
        "permalink": "/r/torino/comments/1hxhah6/quartieri_più_ricchi_o_benestanti_di_torino/"
    },
    {
        "id": "1hxmhhu",
        "author": "TIHISTW",
        "title": "Odontoiatra a Torino",
        "content": "Ciao, \nDevo farmi l'apparecchio e ho già il mio dentista di fiducia, ma mi piacerebbe farmi fare un preventivo e valutazione da altri esperti.\nSapete consigliarmi qualcuno di molto bravo (che non costi un capogiro).\nGrazie",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1hxmhhu/odontoiatra_a_torino/"
    },
    {
        "id": "1hxqz9e",
        "author": "Pul_in",
        "title": "Parcheggiare in quadrilatero",
        "content": "Ciao ragazzi, dove mi consigliate di parcheggiare per uscire in quadrilatero romano?\nVorrei o un parcheggio coperto a pagamento (aperto 24H) oppure un posto il più vicino possibile dove si trova parcheggio abbastanza facilmente di sera ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1hxqz9e/parcheggiare_in_quadrilatero/"
    },
    {
        "id": "1hx8yg1",
        "author": "Vik91N",
        "title": "Oculista a Torino",
        "content": "Ispirato da una vignetta vista da qualche parte (\"Da quando frequento reddit non riesco a comprare una bottiglia d'acqua senza prima chiedere pareri nel fottuto subreddit delle bottiglie d'acqua\"), chiedo consiglio per un oculista in città.\n\nM33+F29, non ricchissimi, entrambi occhialuti, tanto per chiarire target e budget. Chiaramente non mi aspetto di trovare niente sotto le tre cifre ma mi piacerebbe stare più al di qua possibile. \n\nAspetto i vostri consigli, grazie in anticipo!",
        "upvotes": 11,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1hx8yg1/oculista_a_torino/"
    },
    {
        "id": "1hxjgt5",
        "author": "AnisBambuk",
        "title": "Quando vengono pubblicati solitamente i risultati per l'Università di Torino?",
        "content": "Ciao! Sono uno studente non-UE e ho intenzione di candidarmi per il corso di laurea triennale in Business and Management presso l'Università di Torino. La finestra di candidatura è dal 24 febbraio al 30 aprile.\n\nLa mia domanda è: quando posso aspettarmi di ricevere i risultati? Ho visto sul loro sito che la graduatoria dell'anno scorso è stata pubblicata solo a settembre, il che non ha senso: è troppo tardi, anche per gli standard italiani.\n\nSarò molto grato per qualsiasi risposta, grazie!",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1hxjgt5/quando_vengono_pubblicati_solitamente_i_risultati/"
    },
    {
        "id": "1hxglcs",
        "author": "fuckbrexit84",
        "title": "Bardonecchia",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/D3kWFGQ3qaeSZm1tnDrqsg79lqY0ijJJqEkZq2rkGYM.jpg?auto=webp&amp;s=94ea5c44dd95db784ccaa19973d07c818bd9256a"
        },
        "permalink": "/r/torino/comments/1hxglcs/bardonecchia/"
    },
    {
        "id": "1hx9qi3",
        "author": "beaciiice",
        "title": "Attività divertenti da fare al proprio compleanno",
        "content": "Questo mese compio 25 anni e il compleanno verrà di sabato. Vorrei passarlo facendo qualche attività particolare e interessante, che sia da sola, in coppia o con gli amici. Avrei bisogno di qualche suggerimento",
        "upvotes": 4,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1hx9qi3/attività_divertenti_da_fare_al_proprio_compleanno/"
    },
    {
        "id": "1hwvqjn",
        "author": "maschera84",
        "title": "Quanto cambia la tua vita il clima di Torino",
        "content": "Io e la mia famiglia stiamo pensando seriamente di trasferirci a Torino.\n\nNon per lavoro, visto che siamo indipendenti, ma puramente per ragioni di lifestyle. Ci siamo innamorati del suo carattere, eleganza e cortesia della gente.\n\nE abbiamo vissuto in città come Barcellona, Londra, Dubai e Sydney, quindi non siamo nuovi a bellezza urbanistica.\n\nLe stelle sono allineate, eccetto per la parte clima. Siamo stati in città a Novembre quando c'erano 3-4 gradi ed anche un giorno di nebbia. Non ci è sembrato un gran dramma, nonostante oggi viviamo in una città dove ci sono 20 gradi a Gennaio. Anzi, con il surriscaldamento del pianeta, chissà che vivere in un posto con inverni più rigidi non sia una buona cosa.\n\nQuello che però mi domando, quanto questo fantomatico brutto clima (e inquinamento) di Torino di cui tutti si lamentano, è veramente così impattante sulla vostra vita, umore e deprimente come alcuni descrivono?\n\nOppure si tende ad esagerare con le lamentele?\n\nOnestamente, non mi sembra di aver visto \"facce depresse\" per strada come invece (generalizzando e stereotipizzando) in UK o Norvegia. Anzi, la gente sembra leggera e soddisfatta.\n\nCome vivete la cosa?",
        "upvotes": 24,
        "comments": 72,
        "media": null,
        "permalink": "/r/torino/comments/1hwvqjn/quanto_cambia_la_tua_vita_il_clima_di_torino/"
    },
    {
        "id": "1hx8be2",
        "author": "fuckbrexit84",
        "title": "Sauze sunset ",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bFcervlQxIh8kolf5mSmMnKrW-vi-lB5hHBjTQJOU6M.jpg?auto=webp&amp;s=fe2faca98d8fc038780ace0c84257e147c77890a"
        },
        "permalink": "/r/torino/comments/1hx8be2/sauze_sunset/"
    },
    {
        "id": "1hxap5d",
        "author": "-xGarnet99x-",
        "title": "Cinematografia",
        "content": "Esistono delle istituzioni che fanno dei corsi inerenti al montaggio video-cameraman? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1hxap5d/cinematografia/"
    },
    {
        "id": "1hxdeah",
        "author": "realcvnce",
        "title": "Salve a tutti avrei una domanda ",
        "content": "ci sono produttori o siti cinesi di maglierie e maglioni di bassa media qualità in Italia? precisamente a torino ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1hxdeah/salve_a_tutti_avrei_una_domanda/"
    },
    {
        "id": "1hx0yz5",
        "author": "bompiwrld",
        "title": "Qualcuno conosce meglio la storia?",
        "content": "",
        "upvotes": 1,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/sz54p4j2fvbe1.jpeg?auto=webp&amp;s=41707d1b901de383c2285a8076e975d172755ccf"
        },
        "permalink": "/r/torino/comments/1hx0yz5/qualcuno_conosce_meglio_la_storia/"
    },
    {
        "id": "1hwqpgz",
        "author": "borisbanana77",
        "title": "Come asciughi il bucato?",
        "content": "Può volerci fino a una settimana per asciugare il bucato all'aperto. \nCome si asciuga il bucato senza asciugatrice a casa?  Stavo pensando di lavare i miei chiusi a casa e di andare in lavanderia self-service solo per asciugarli.",
        "upvotes": 5,
        "comments": 27,
        "media": null,
        "permalink": "/r/torino/comments/1hwqpgz/come_asciughi_il_bucato/"
    },
    {
        "id": "1hwsytt",
        "author": "Ambitious_Home8801",
        "title": "Corsica Principe Oddone",
        "content": "Hello!\n\nI’m staying in Torino for 6 months and have to book a place to stay ahead of arrival. I’ve found a guy that seems trustworthy (a lot of listings seem to be made by scammers) with a place along Corsica Principe Oddone.\n\nIs that a really noisy location for a ground floor apartment?\n\nGrazie Mille!",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1hwsytt/corsica_principe_oddone/"
    },
    {
        "id": "1hwziwq",
        "author": "Forsaken_Wasabi4632",
        "title": "Raccomandazioni meccanico di bici economico? ",
        "content": "Buonaseraa, qualcuno conosce un negozio di riparazione biciclette economico qui a Torino? Ho comprato questa bici da una mia amica, che mi ha consigliato di farla controllare prima di usarla. Cerco uno economico perché forse c’e più di una cosa danneggiata e il mio budget è limitato ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1hwziwq/raccomandazioni_meccanico_di_bici_economico/"
    },
    {
        "id": "1hwmaan",
        "author": "Thecrazypacifist",
        "title": "Come trovo una casa per tre persone? ",
        "content": "Allora Io e due di miei amici stiamo cercando un appartamento. Siamo tutti studenti e cerchiamo una casa con 3 letti singoli. Il problema è che sui siti italiani non puoi scegliere il numero di camere da letto, ma solo il numero di locali! Quando scelgo \"trilocali\" mi mostra case con una cucina, un soggiorno e una camera da letto. Provo quadrilocali ma ci sono non più di due letti. E se vorrei scegliere 5 locali, non ci sono case! Allora cosa devo fare? Anche su Facebook e Telegram vedo solo stanze e posti di letto. ",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1hwmaan/come_trovo_una_casa_per_tre_persone/"
    },
    {
        "id": "1hwndjw",
        "author": "fuckbrexit84",
        "title": "Sauze d’ oulx",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YuGV4jILLO25vsDqL9wy_dw8AfPEg_4hrHKAkseBVPE.jpg?auto=webp&amp;s=c563265470582722407dd6f6fc136d95aea44e64"
        },
        "permalink": "/r/torino/comments/1hwndjw/sauze_d_oulx/"
    }
]