[
    {
        "id": "1lyzknn",
        "author": "JeremyAMA",
        "title": "Hey /r/movies! I'm Jeremy Sumpter. You might know me as Peter Pan from 2003's Peter Pan or from Friday Night Lights. I'm starring in Oxy Morons, a new, raunchy, crime-action-comedy. Ask me anything!",
        "content": "Hey r/movies! I'm Jeremy Sumpter. You might know me as Peter Pan from 2003's Peter Pan or from Friday Night Lights. I'm starring in Oxy Morons, a new, raunchy, crime-action-comedy. Ask me anything!\n\nHere's our trailer:\n\n[https://www.youtube.com/watch?v=WPOdTwvSlUE&amp;pp=0gcJCfwAo7VqN5tD](https://www.youtube.com/watch?v=WPOdTwvSlUE&amp;pp=0gcJCfwAo7VqN5tD)\n\n&gt;A nobody and a crew of underachievers hatch a half-baked plan to strike it rich by out hustling a large pharmaceutical company at their own game.\n\nIt's out now on digital. It's directed by Sarah Cayce (who will also be doing an AMA tomorrow), and also stars Jeremy Holm (AMA tomorrow as well!), Laura Ashley Samuels, Rae Gray, John Pirruccello.\n\nI've also been in Frailty, Into the Storm, Soul Surfer, An American Crime, and more.\n\nFull list of credits:\n\n[https://www.imdb.com/name/nm0838911/?ref\\_=tt\\_ov\\_3\\_1](https://www.imdb.com/name/nm0838911/?ref_=tt_ov_3_1)\n\nI'll be back Monday at 5 PM ET to answer your questions. Ask me anything reddit!\n\n",
        "upvotes": 96,
        "comments": 53,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/auk3zre5mocf1.jpeg?auto=webp&amp;s=4928f6d6f60b8933efdc7b0bfa70b8652fb3cb24"
        },
        "permalink": "/r/movies/comments/1lyzknn/hey_rmovies_im_jeremy_sumpter_you_might_know_me/"
    },
    {
        "id": "1lwuvsq",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Superman) plus Throwback Discussions!",
        "content": "**New In Theaters**:\n\n* [Superman (2025)](https://old.reddit.com/r/movies/comments/1lwutny/official_discussion_superman_2025_spoilers/?)\n\n**25th Anniversary Throwback Discussion Threads**:\n\n* [Scary Movie](https://old.reddit.com/r/movies/comments/1lwutxk/official_throwback_discussion_scary_movie_spoilers/?)\n* [Disney's The Kid](https://old.reddit.com/r/movies/comments/1lwutyi/official_throwback_discussion_disneys_the_kid/?)\n* [But I'm a Cheerleader](https://old.reddit.com/r/movies/comments/1lwutzo/official_throwback_discussion_but_im_a/?)\n\n**Still In Theaters**:\n\n* [Jurassic World Rebirth](https://old.reddit.com/r/movies/comments/1lqdtaw/official_discussion_jurassic_world_rebirth/)\n* [F1: The Movie](https://old.reddit.com/r/movies/comments/1lli8lz/official_discussion_f1_the_movie_spoilers/?)\n* [M3GAN 2.0](https://old.reddit.com/r/movies/comments/1lli8nm/official_discussion_m3gan_20_spoilers/?)\n* [28 Years Later](https://www.reddit.com/r/movies/comments/1lfsc91/official_discussion_28_years_later_spoilers/)\n* [Elio](https://www.reddit.com/r/movies/comments/1lfscb2/official_discussion_elio_spoilers/)\n* [The Life of Chuck](https://www.reddit.com/r/movies/comments/1la4c8g/official_discussion_the_life_of_chuck/)\n* [Materialists](https://www.reddit.com/r/movies/comments/1la4c8n/official_discussion_materialists/)\n* [How to Train Your Dragon](https://www.reddit.com/r/movies/comments/1la4c8v/official_discussion_how_to_train_your_dragon/)\n\n\n**New On Streaming:**\n\n* [Heads of State](https://old.reddit.com/r/movies/comments/1lr5yb4/official_discussion_heads_of_state_spoilers/?)\n* [The Old Guard 2](https://old.reddit.com/r/movies/comments/1lr5ycn/official_discussion_the_old_guard_2_spoilers/?)\n* [Ice Road: Vengeance](https://old.reddit.com/r/movies/comments/1lr5ye1/official_discussion_ice_road_vengeance_spoilers/?)\n* [KPop Demon Hunters](https://www.reddit.com/r/movies/comments/1lghony/official_discussion_kpop_demon_hunters_spoilers/)\n* [Echo Valley](https://www.reddit.com/r/movies/comments/1lar0eb/official_discussion_echo_valley/) \n* [Deep Cover](https://www.reddit.com/r/movies/comments/1lar0ej/official_discussion_deep_cover/)",
        "upvotes": 111,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1lwuvsq/official_discussion_megathread_superman_plus/"
    },
    {
        "id": "1lz3ahl",
        "author": "ihopnavajo",
        "title": "What's the worst case of a movie breaking its own rule",
        "content": "I remember when It Follows came out, Quentin Tarantino made a post about how the movie broke its own rule (having the \"It\" touch someone without killing them). \n\nHowever, my top pick for a movie that broke its own rule is The Butterfly Effect. \n\nThe whole premise of the movie is that, with time travel, the smallest changes can have enormous consequences. You change one little thing and the future can change drastically. \n\nAnd yet ... The main character, in a situation where he wants to prove to someone that he has special Jesus like powers, goes back to his own childhood to a moment in class and makes a drastic change by violently mutilating himself in front of everyone, and then *ZIP* somehow we're back to the same point in the future and the only thing that changed was that he now has scars on his hands?!?\n\nWHACK\n\nAnyone have some other candidates?",
        "upvotes": 5833,
        "comments": 2265,
        "media": null,
        "permalink": "/r/movies/comments/1lz3ahl/whats_the_worst_case_of_a_movie_breaking_its_own/"
    },
    {
        "id": "1lz0nr6",
        "author": "ChiefLeef22",
        "title": "Christopher Nolan's 'Inception' Turns 15: A Look Back At The \"BRAAM\" Sound From Nolan's Film that Invaded the Hollywood Soundtrack",
        "content": "",
        "upvotes": 4038,
        "comments": 361,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/tPmBuLJN4CkgIraMn22dRvUTCxviibyVDEnVM8x16Ao.jpeg?auto=webp&amp;s=00f269dcdeef227ef297573e677e9c9ece1f472a"
        },
        "permalink": "/r/movies/comments/1lz0nr6/christopher_nolans_inception_turns_15_a_look_back/"
    },
    {
        "id": "1lyv5u5",
        "author": "MarvelsGrantMan136",
        "title": "New Images of Daniel Bernhardt in ‘Deathstalker’, Directed by Steven Kostanski (‘Psycho Goreman’)",
        "content": "",
        "upvotes": 3091,
        "comments": 244,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/swudib2sqncf1.jpeg?auto=webp&amp;s=ea6d32408b4be5859055faee36896bc2f7ffd38c"
        },
        "permalink": "/r/movies/comments/1lyv5u5/new_images_of_daniel_bernhardt_in_deathstalker/"
    },
    {
        "id": "1lz40xn",
        "author": "MaxRichter_Enjoyer",
        "title": "Samurai duel from the movie Twilight Samurai. Featuring Hiroyuki Sanada. Movie was amazing too.",
        "content": "",
        "upvotes": 602,
        "comments": 77,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/60AOixlrYBOYwi6rF21_BLBYCXvOyxIW2ZfGAsiJ1A4.jpeg?auto=webp&amp;s=94b4dfed40a0d839203b9a06a130c60b419425b8"
        },
        "permalink": "/r/movies/comments/1lz40xn/samurai_duel_from_the_movie_twilight_samurai/"
    },
    {
        "id": "1lyz4wl",
        "author": "15052025",
        "title": "Suggest me some \"Go in blind\" movies.",
        "content": "I'm in the mood for something fresh and surprising—can you suggest me some amazing “go in blind” movies? I’m talking about those kinds of films where the less you know, the better the experience. No spoilers, no trailers—just pure, unexpected movies. What do you recommend?\n\nWould prefer it in English language.",
        "upvotes": 916,
        "comments": 2342,
        "media": null,
        "permalink": "/r/movies/comments/1lyz4wl/suggest_me_some_go_in_blind_movies/"
    },
    {
        "id": "1lz9912",
        "author": "MrGittz",
        "title": "What movie did you always just assume was a big hit but turned out not to be? For me it’s the 2003 Peter Pan film.",
        "content": "I use to love looking up box office numbers for movies and there were so many times I would be surprised a movie i thought was a huge hit turned out to be a flop or barely made a profit. \n\nA big one is the 2003 Peter Pan movie. I just assumed it was a big hit. Like…how could it not be? Releases during the Harry Potter LOTR era? English kids with awesome visuals, flying, pirates? This should’ve been huge. \n\nThe original Tron is another movie I thought was a big hit. I guess that’s why it took them so long to make a sequel.",
        "upvotes": 236,
        "comments": 215,
        "media": null,
        "permalink": "/r/movies/comments/1lz9912/what_movie_did_you_always_just_assume_was_a_big/"
    },
    {
        "id": "1lywl03",
        "author": "retired-tweeter",
        "title": "What's a movie trope that is stupid but you still enjoy it anyway",
        "content": "I love the end of disaster movies when, like millions of people have died, we still get the scene of the protagonist being happy and saying some corny one-liner. The \"Roland Emmerich' specialty. San Andreas. 2012. Day After Tomorrow. Moonfall (lol). A catastrophic event that changes the entire globe/area can occur, but if a few group survives, hey, it's all good. \n\nI love the \"random character says one thing out of context that pushes the plot forward\". Like in Die Hard with a Vengeance, some kid is like \"it's Christmas, you could steal City Hall\" and McClane is like \"OHHHHHHH, that's what the bad guys are doing\". Contrived way to push a plot forward, but I can enjoy it for being \"movie\" logic.",
        "upvotes": 1060,
        "comments": 686,
        "media": null,
        "permalink": "/r/movies/comments/1lywl03/whats_a_movie_trope_that_is_stupid_but_you_still/"
    },
    {
        "id": "1lz5kjr",
        "author": "Independent_Act_8054",
        "title": "Movies where the good guys are just good?",
        "content": "Having watched superman last night, what are some other movies where the good guys are just good because its the right thing to do?  It was so refreshing.  I don't need compelx motivations, it is just the right thing to do because its the right thing to do? I can't think of many examples that do this - everything seems to have a complex back story. ",
        "upvotes": 178,
        "comments": 115,
        "media": null,
        "permalink": "/r/movies/comments/1lz5kjr/movies_where_the_good_guys_are_just_good/"
    },
    {
        "id": "1lz2zwj",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Nick Offerman - Thursday 7/17 at 3:00 PM ET - Actor in 'Parks and Recreation', 'Civil War', 'The Last of Us', 'Mission Impossible: The Final Reckoning', 'Dumb Money', 'Devs', 'Dicks: The Musical', 'Sovereign', 'The Founder', and lots more.",
        "content": "",
        "upvotes": 217,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0876fszjbpcf1.png?auto=webp&amp;s=459df7b8c04748ed90658b0f5cbb5bcd2fd23e11"
        },
        "permalink": "/r/movies/comments/1lz2zwj/amaqa_announcement_nick_offerman_thursday_717_at/"
    },
    {
        "id": "1lz77y9",
        "author": "Express_Basis_8710",
        "title": "2001: A Space Odyssey completely broke my Rating System",
        "content": "Usually when I watch a movie, I can figure out my rating pretty quickly, either right after or within a day or two. I always land on some score out of 5. But with 2001: A Space Odyssey, I’m just stuck. I’ve been left in awe, confusion, and something I can’t even put into words.\n\nI’ve already watched breakdowns and analyses of the film and its ending, and yet I still can’t decide if I absolutely love it or just really like it. I’ve never had a movie make me feel this way, like the issue is that I’m not even sure how to process it, let alone rate it.\n\nDoes anyone else feel this way about the movie? If so is it because it’s some sort of masterpiece or is just rlly good cinema?",
        "upvotes": 126,
        "comments": 218,
        "media": null,
        "permalink": "/r/movies/comments/1lz77y9/2001_a_space_odyssey_completely_broke_my_rating/"
    },
    {
        "id": "1lz778k",
        "author": "Galaga68",
        "title": "The Wraith • 1986 • Theatrical Trailer",
        "content": "",
        "upvotes": 104,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mRycd5KAZ2nA-IGOTyh9o7SZ_zbowiGxlmyYce1hj8o.jpeg?auto=webp&amp;s=d2ae4083c5fc49ac169b26263646433044a85ca9"
        },
        "permalink": "/r/movies/comments/1lz778k/the_wraith_1986_theatrical_trailer/"
    },
    {
        "id": "1lypkex",
        "author": "DontDeleteMee",
        "title": "What movie quote was transformed by a pause?",
        "content": "I recently caught The Truman Show on TV again. I'd forgotten how that show-runner says to Truman, \"I am the creator...of a tv show\"...\nThat pause communicates so much. \n\nNot quite the same, but just as delightful is the ever famous, \"It's not a tumor...not a tumor at all\" \n\nCan anyone think of any other examples?\n\n",
        "upvotes": 938,
        "comments": 395,
        "media": null,
        "permalink": "/r/movies/comments/1lypkex/what_movie_quote_was_transformed_by_a_pause/"
    },
    {
        "id": "1lyul78",
        "author": "keepfighting90",
        "title": "'Apocalypse Now' is one of the greatest - if not THE greatest - cinematic experiences I've ever had",
        "content": "An ever-degrading fever dream. That's what watching Apocalypse Now I felt like. It probably didn't help that I watched it while coming down from a fever, sweating and a little uncomfortable, with an overcast, drizzling sky outside - but damn, the *atmosphere* this movie creates is second to none.\n\nIt's a bad trip that gets worse and worse, as Willard and his crew undertake their hellish odyssey down the river to find Kurtz. I've read Joseph Conrad's Heart of Darkness, and I was aware that Apocalypse Now is loosely based on that story. It's a masterful interpretation of that story, widening the scope and scale and making it feel somehow even more sinister.\n\nA lot of this is due to how the movie *looks.* Apocalypse Now might be the most visually stunning movie I've ever watched. It's frankly insane to me that it came out almost *50* years ago because it would still blow away pretty much anything released by even the best directors today. It looks so bold, lush and vibrant, with incredible shot composition and lighting. A sickly orange-yellow glow suffuses the landscape, and mist and fog always shrouds the horizon. It's like the characters are traversing through hell, and it adds to the dreamlike feel of the movie.\n\nIt also has one of my favourite cinematic interpretations of war in a movie. Sure, it shows war as bad, and Americans as imperialists and all of that. But more than that, in Apocalypse Now, war is much more abstract, a dark, primordial force that acts as both catalyst and conduit for humanity's darkest urges. It affects everyone. Killgore, Kurtz, the boys on the boat, Willard. Everyone becomes a beast prowling through the jungle. \n\nMarlon Brando's limited screen time is as impressive as advertised - both the writing and his performance, along with how he's shot - portray him as almost a mythical figure out of a twisted fairy tale. Kurtz is more a concept and an idea than a man. Martin Sheen is more restrained, but you can always see the madness just under the surface.\n\nAnd there's that steadily escalating nightmare-feel of the movie, and what makes it so damn incredible. Each sequence and set piece feels more surreal, bleak and unhinged than the last, culminating with the ritual slaughter/assassination at the temple that's one of the most jaw-dropping scenes I've seen in a long time. Honestly, even if you choose not to overanalyze the movie or interpret what it's trying to say, I think it would still be a 5-star watch based simply on the power of its audiovisual presentation alone. It's such a staggering achievement in filmmaking, I can't say enough about it.\n\nNote: I watched the 2 hr 27 min. theatrical cut. At some point in the future I'll probably check out Redux or The Final Cut",
        "upvotes": 387,
        "comments": 111,
        "media": null,
        "permalink": "/r/movies/comments/1lyul78/apocalypse_now_is_one_of_the_greatest_if_not_the/"
    },
    {
        "id": "1lzc9wn",
        "author": "WantonReader",
        "title": "What superhero movie should be the industry gold standard?",
        "content": "Cinemas today truly live in the age of superheroes. But they aren't actually new. We've seen major superheroes in cinemas since at least the 70s.\n\nBut looking back at all past superhero movies, and to all those that will be made in the future, which one should be considered the industry's gold standard?\n\nWhat movie has the right balance of all necessary parts, understands its characters the best and executes its vision the best? In other words, which superhero movie should be the inspiration for future movies to learn from?\n\nAll admit that I thought of this question after leaving the new Superman. NO SPOILERS....but I will admit that I still think another should be considered the industry gold standard: Spider-Man 2.\n\nA film so well planned, understood and executed that (according to some I've heard) it basically made it cool to like comics. And over 20 years later, it still holds up so well.\n\n.\n\nBut what does other people think should be the gold standard?",
        "upvotes": 30,
        "comments": 261,
        "media": null,
        "permalink": "/r/movies/comments/1lzc9wn/what_superhero_movie_should_be_the_industry_gold/"
    },
    {
        "id": "1lzaeuv",
        "author": "jeejeeviper",
        "title": "Copycat (1995) has the most incompetent cops I’ve ever seen in a serious thriller",
        "content": "- allowing Sigourney Weavers character to get attacked in the first scene by being piss-poor at checking bathroom stalls \n- continually leaving Sigourney Weaver’s character alone throughout the rest of movie when she’s supposed to protected from an active serial killer\n- cops letting a suspect steal their gun while the suspect is in their police station and handcuffed\n- a detective not taking a kill-shot when said suspect with the stolen gun takes her detective partner hostage, leading to the detective getting fatally shot\n- main female detective discovered Weaver’s apartment was broken into and covered in blood and went in alone without immediately calling for backup \n- female detective almost dies at the end because she’s also piss-poor at clearing out bathroom stalls\n\n- I have to reiterate the second point. There are four separate times in the movie where they leave Weaver alone and the killer either breaks into her place, stalks her, or kidnaps her. 4 times.",
        "upvotes": 38,
        "comments": 12,
        "media": null,
        "permalink": "/r/movies/comments/1lzaeuv/copycat_1995_has_the_most_incompetent_cops_ive/"
    },
    {
        "id": "1lz9flr",
        "author": "BoneMachine427",
        "title": "“Get Shorty”",
        "content": "“Get Shorty” is one of the smoothest films to digest on a night with no worries. Looking for a fun and quirky comedy with a tinge of drama? Check. Everyone involved in this movie from Travolta to Sonnenfeld deserved their flowers for this kitschy little ode to Hollywood. \n\nThey did the source material justice. \n\nWhy doesn’t Hollywood make these kinds of movies anymore?\n",
        "upvotes": 44,
        "comments": 26,
        "media": null,
        "permalink": "/r/movies/comments/1lz9flr/get_shorty/"
    },
    {
        "id": "1lzaauf",
        "author": "zachiscool7",
        "title": "If you could go back in time to watch any movie for the first in theaters again, what year is it and what's the movie?",
        "content": "Summer, 2012. The Dark Knight Rises. Opening night. Leading up to that night as a teen, I've never seen a movie better than this( and unbeknownst to me that Christopher Nolan would become one of my favorite movie directors). It was the first time it seemed the entire crowd clapped in unison when the credits started rolling. There are still very few movies that have rivaled or were better than the DKR in my opinions since seeing it. Some would be Godzilla-1, Bumblebee, The Dark Knight(even though I was 10 when the dark knight came out and I didn't see it in theaters), and I wanna say sinners. I've seen countless movies since then and I'm sure there could be some ones that I'm forgetting but as far as a first-time, memorable movie experience, DKR was for sure the best time for me.\n\n\nI'm interested in the responses from all the varying age groups. ",
        "upvotes": 36,
        "comments": 228,
        "media": null,
        "permalink": "/r/movies/comments/1lzaauf/if_you_could_go_back_in_time_to_watch_any_movie/"
    },
    {
        "id": "1lyzj9l",
        "author": "Belze-Bong97",
        "title": "K-PAX (2001): Was Prot Really an Alien or a Traumatised Human?",
        "content": "Just saw K-PAX (2001) for the first time and I'm honestly not sure what to think. Prot acts and talks like he really could be from another planet, but the stuff about Robert Porter's past makes the trauma angle pretty convincing too.\n\nSo what do you think? \nWas Prot truly an alien, or was it all a coping mechanism for something terrible he went through?\n\nWould love to hear how others interpreted it.",
        "upvotes": 99,
        "comments": 89,
        "media": null,
        "permalink": "/r/movies/comments/1lyzj9l/kpax_2001_was_prot_really_an_alien_or_a/"
    },
    {
        "id": "1lz3kv3",
        "author": "DarkBehindTheStars",
        "title": "Most Difficult Film Shoots",
        "content": "What films are notable for having incredibly difficult and tough shoots? With things like weather conditions, cast or crew not getting along, special effects not working properly, delays, just a generally unpleasant experience, etc.\n\nThe original Texas Chainsaw Massacre comes to mind right away. That film's Hellish shoot has practically become the stuff of legends. [The Shocking Truth documentary](https://tubitv.com/movies/559826/texas-chain-saw-massacre-the-shocking-truth) goes into tremendous detail about it. It's incredible what the crew put up with during the shoot, but at least an important and influential film came out of it.\n\nJaws is another that's well-known for it's incredibly tough shoot. Especially in regards to shooting the Orca scenes in the ocean, and the frequently malfunctioning mechanical shark. Which of course led to one of the film's greatest strengths as the shark's presence was instead psychologically suggested rather than shown, which made the shark's more numerous appearances during the third act that much more impactful when you hadn't seen too much of it up to that point and by then were so invested in the story and characters. Another film that despite the difficult production, the end result speaks for itself.",
        "upvotes": 52,
        "comments": 97,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8mozGe2J8H6MQDMo_FJSE0PgireCDWz6gncxcVRovXs.jpeg?auto=webp&amp;s=ff4e64206420b9a7a905eeefaefff199bb15ab1f"
        },
        "permalink": "/r/movies/comments/1lz3kv3/most_difficult_film_shoots/"
    },
    {
        "id": "1lyh2l2",
        "author": "BunyipPouch",
        "title": "First Poster for Sci-Fi Adventure 'The Man Who Shrinks' - Starring Jean Dujardin ('The Artist') - A shipbuilder inexplicably shrinks &amp; gets trapped in a basement. He must fight for survival in now-hostile ordinary household environment.",
        "content": "",
        "upvotes": 1603,
        "comments": 156,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ng7pkydyrjcf1.jpeg?auto=webp&amp;s=746dcad7f8667e2634c814aeb8cd1cb0ad965fcb"
        },
        "permalink": "/r/movies/comments/1lyh2l2/first_poster_for_scifi_adventure_the_man_who/"
    },
    {
        "id": "1lzch81",
        "author": "lockerbiestreet",
        "title": "What Panned Movie Do You Love?",
        "content": "I came across a thread that centered around \"what's a film that's very popular that you don't like\" on the flip side - what's a film you love that isn't well regarded or semi universally loathed. \n\nFor me, I was shocked how much I really enjoyed the new \"Snow White\". I was fully expecting to dislike it. I dislike the majority of Disney live action remakes, but had such a fun time. ",
        "upvotes": 12,
        "comments": 93,
        "media": null,
        "permalink": "/r/movies/comments/1lzch81/what_panned_movie_do_you_love/"
    },
    {
        "id": "1lyktj5",
        "author": "XiskeletoniX",
        "title": "What film had an amazing concept but failed to execute it well?",
        "content": "I’m a huge fan of in time and I honestly still love the film now even with its story and plot issues, the poker scene is very memorable to me and I’m very interested in the criminal underworld that is hinted at with Alex Pettyfer (Alex rider as I know him), I wish there was more stories to be told on the big screen but i was wondering if anyone knows a film or even series where they feel the same as I do :)",
        "upvotes": 756,
        "comments": 964,
        "media": null,
        "permalink": "/r/movies/comments/1lyktj5/what_film_had_an_amazing_concept_but_failed_to/"
    },
    {
        "id": "1lzchee",
        "author": "Low_Insurance_1603",
        "title": "Bonnie and Clyde (1967)",
        "content": "Absolutely love this movie! Stellar cast! Likely in my top 10. Imo one of those movie that is a classic with any remake being DOA.  The film sets the stage quite perfectly with its austere cinematography depicting that era. Beatty and Dunaway give a  peak performance. I’ll have to google to see what cinematic awards this movie received? That ending is climatic cinematic gold! And Beatty cast against type proclaiming “He ain’t no lover boy.” 😛 Great movie! ",
        "upvotes": 11,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1lzchee/bonnie_and_clyde_1967/"
    },
    {
        "id": "1lz7u5x",
        "author": "Fragrant_Ninja5538",
        "title": "Good Male/Female Friendship Movies",
        "content": "Good Male/Female Friendship movies\n\nWhat are some great movies that have both male and female protagonists that aren’t based on “will they/won’t they””one is in love with the other” situations? I want good platonic relationships where they’re actually best friends. Could be romance, action, buddy comedy, etc, but they don’t have an intimate relationship with each other.",
        "upvotes": 18,
        "comments": 57,
        "media": null,
        "permalink": "/r/movies/comments/1lz7u5x/good_malefemale_friendship_movies/"
    },
    {
        "id": "1lzfvst",
        "author": "keysgetbusy",
        "title": "If you can save any movie character who would it be?",
        "content": "If you can save any movie character from dying who would it be and why? Or even just save them from a certain situation. \n\nSome basic examples; imagine saving tony stark from dying and he continued to mentor Peter Parker and give him stark tech. \n\nOr imagine saving Anakin Skywalker from joining the dark side and him and Luke take down the empire together. \n\nI know these events would change the movies completely and in the case of Anakin star wars would just be a completely different film but I want to hear your opinions!!",
        "upvotes": 5,
        "comments": 39,
        "media": null,
        "permalink": "/r/movies/comments/1lzfvst/if_you_can_save_any_movie_character_who_would_it/"
    },
    {
        "id": "1lz9qvm",
        "author": "TigerTerrier",
        "title": "IJW Wind River (2017). Finally got around to watching this movie recommended by multiple comments on movies to watch discussions. If you haven't seen it I would highly recommend it. What did you think of it?",
        "content": "This was such a great movie. It blew me away and I was not prepared for the ending. I would like to hear from those that have seen it before. what did you think? I never heard about this movie when it was released. I finally found it to watch on fawesome but I intend to buy a copy on blu-ray or dvd so I can have. ",
        "upvotes": 11,
        "comments": 9,
        "media": null,
        "permalink": "/r/movies/comments/1lz9qvm/ijw_wind_river_2017_finally_got_around_to/"
    },
    {
        "id": "1lymnwv",
        "author": "justinsluss",
        "title": "Airplane II The Sequel on 4K in September",
        "content": "The 1982 film “Airplane II: The Sequel” is being released on 4K UHD Blu-ray and Special Edition Blu-ray on September 23rd via KL Studio Classics.\n\nKen Finkleman directed and co-wrote the film. It starred Robert Hays, Julie Hagerty, Lloyd Bridges, William Shatner, Peter Graves, Raymond Burr, and Chuck Connors. The cast also included Rip Torn, John Dehner, Chad Everett, Kent McCord, John Vernon, and Sonny Bono.",
        "upvotes": 315,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/D2Jtu2cl615Dk69rwQjRqTjDAzPYNmQxMb6X3z_Clpo.jpeg?auto=webp&amp;s=3773084ed1a4a19148fb566a7d4911b822268b94"
        },
        "permalink": "/r/movies/comments/1lymnwv/airplane_ii_the_sequel_on_4k_in_september/"
    },
    {
        "id": "1lxxilb",
        "author": "MarvelsGrantMan136",
        "title": "Sean Astin To Run For SAG-AFTRA President",
        "content": "",
        "upvotes": 24791,
        "comments": 682,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YmrkcFw5TRizVeSRtdI1PBcPGtlKMR6LA5irFvxPW88.jpeg?auto=webp&amp;s=ddbf15755cb20d87cc88cc409a034fbd654fcb9e"
        },
        "permalink": "/r/movies/comments/1lxxilb/sean_astin_to_run_for_sagaftra_president/"
    },
    {
        "id": "1lze9vu",
        "author": "KingLance123",
        "title": "Favorite movie by Asian country: Cambodia",
        "content": "For those who haven't seen, I am seeking to find the [best movie from each country around the globe](https://www.reddit.com/r/movies/comments/1lth326/favorite_movies_from_each_country_asia_afghanistan/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button), starting in Asia. We were just on the fifth day with [Brunei](https://www.reddit.com/r/movies/comments/1lyj2x8/favorite_movie_by_asian_country_brunei/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button). Today is Cambodia.\n\nOur fifth day winner, from Brunei, is **Travellers and Magicians (2003) directed by Khyentse Norbu.** It was the first feature film shot entirely in Bhutan. \n\nOkay let's do **Cambodia.**\n\nIt is located in southeast Asia. With such an ancient and rich history of Buddhism, as well as, being notable for adopting full communism in he 70s under the brutal Pol Pot regime. With as much history as Cambodia, I am hoping for some great film suggestions that capture the rich culture and identity of this country. I can also imagine there's plenty of great English language movies set in the jungles of Cambodia.\n\nThe rules:\n\nI) It's not important if the movie was made in the given country, but it *has* to be set there (e.g. the movie can be set in Paris, but hasn't to be a french movie after all). Mainstream American made movies are totally okay, but let's always try to prioritize movies with the native language, if possible. If a movie is split between a few locations I’m looking for where it’s rooted.\n\nII) Animated movies are okay but not documentaries.\n\nIII) On ties I'll just pick the movie with less reviews on imdb to spotlight the lesser known films.\n\nIV) After 24 hours, whatever movie comment gets the most upvotes, wins. make sure that the film is not already mentioned before creating a new comment.\n\nDay 5: Brunei- Travellers and Magicians (2003) directed by Khyentse Norbu \n\nDay 4: Bhutan - Lunana: A Yak in the Classroom (2019) directed by Pawo Choyning Dorji\n\nDay 3: Bangladesh- The Clay Bird (2002) directed by Tareque Masud\n\nDay 2: Bahrain- Hamad and the Pirates (1971) directed by Richard Lyford\n\nDay 1: Afghanistan- Osama (2004) directed by Siddiq Barmak",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1lze9vu/favorite_movie_by_asian_country_cambodia/"
    },
    {
        "id": "1lzgzgm",
        "author": "Soggy_General-boi",
        "title": "Poison Ivy 2 is surprisingly good(hear me out)",
        "content": "The first hour of the movie is terrible. The music sucks, the love scenes are cheesy, lots of deadend characters, and a lot of filler. Honestly, the first half of the movie and the second half of the movie feels like there were two different directors...but IF you watch it, the last 30-35 minutes are definitely worth it. Xander Berkeley is great during the Thanksgiving dinner scene and Alyssa Milano was pretty damn good herself. I watched the Trilogy(not the cheesy made-for-tv fourth one) and the first one was good all around.. the third one was dogsh**.. but the second one just had the best ending of the three. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1lzgzgm/poison_ivy_2_is_surprisingly_goodhear_me_out/"
    }
]