[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 483,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1gsenwg",
        "author": "AutoModerator",
        "title": "JAKE PAUL v. MIKE TYSON Fight Megathread",
        "content": "&amp;#x200B;\n\nhttps://preview.redd.it/w8ywthvqp61e1.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=95e740ea33c09fcd4e8c898ea8b46958cd88635d",
        "upvotes": 120,
        "comments": 5782,
        "media": null,
        "permalink": "/r/netflix/comments/1gsenwg/jake_paul_v_mike_tyson_fight_megathread/"
    },
    {
        "id": "1gyhqsm",
        "author": "waseijin",
        "title": "They killed a Goat in a japanese reality show",
        "content": "There is a reality show in Japan called \"Ai no Sato\".\nIn Season 2, they brought a miniature goat into an old, rotting house with no vet or specialist.\nAfter a month outside on a cold winter night, with little or no food, the miniature goat died.\nIt's unbelievable, absurd, and unrealistic.\nJapanese production company are terrible, but for Netflix to approve this and release the show is crazy.\nI contacted support and cancelled my subscription.\nI can't believe they would kill animals like this.\nI'm so angry rn...",
        "upvotes": 28,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1gyhqsm/they_killed_a_goat_in_a_japanese_reality_show/"
    },
    {
        "id": "1gybd2g",
        "author": "ChirrBirry",
        "title": "Arcane is EXCEPTIONAL ",
        "content": "I don’t just want more seasons of Arcane…I *need* it. This show fills a content gap I didn’t know could be satisfied. \n\nNormally I hate character development and over the top attempts to connect the viewer with characters, but Arcane makes the endeavor a pleasure. The animation style fills me with joy, it’s like when the first season of Avatar: The Last Airbender came out and we all had our jaws drop to the floor.\n\nI’ve never played a single second of LoL but now I’m fully immersed in a world that I’m pissed might come to an end as I finish the last episode of season 2. More please.",
        "upvotes": 47,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1gybd2g/arcane_is_exceptional/"
    },
    {
        "id": "1gyfyis",
        "author": "Senturos",
        "title": "Arcane... A fucking masterpeace!",
        "content": "Man, what to write about this show. Because well, I love it. I mean I've never played or will ever play League of Legends. But the characters, the story, it was all fucking perfect. I'm a 30-year-old man, and this shit brought me to tears. Every emotion I was meant to feel, I did.  \nAs a man, I'm not meant to, you know, feel these feelings out there, but with shows like this, I can. I remember swallowing nothing when a character was betrayed. I felt that same anger in my pit.\n\n  \nI know deep down there is more to this, and I can't wait to see where the story goes from here and what characters come out from it. But to the writing team and all those that made this show, hold your head up high because you guys did a top fucking job! The animation, the characters, the story was fucking on point all the time. Can't wait to see more from this team.",
        "upvotes": 11,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1gyfyis/arcane_a_fucking_masterpeace/"
    },
    {
        "id": "1gyj58r",
        "author": "Proof_Cable_310",
        "title": "Any feel good stuff out there that's not Hallmark cheesy?",
        "content": "I feel enough toxicity, drama, and bad influence in the world as is. I'd like to escape that with some feel good tv. Ideally, no cake wars, nor anything \"off script\", nor reality. Any recommendations?",
        "upvotes": 5,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1gyj58r/any_feel_good_stuff_out_there_thats_not_hallmark/"
    },
    {
        "id": "1gyklsn",
        "author": "philomatic",
        "title": "A man on the inside",
        "content": "Show by Michael Schur starring Ted Danson\n\nJust finished it and it was great. I was expecting it to be 80% comedy, but I’d say it’s more 50% comedy and 50% feeling with a mystery built in. I’d say similar to the final couple seasons of The Good Place.\n\nI was not expecting to like it as much as I did. ",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gyklsn/a_man_on_the_inside/"
    },
    {
        "id": "1gyjxpe",
        "author": "FeistyBat3571",
        "title": "1 account, 2 profiles, watch different shows simultaneously ?",
        "content": "hi, im new to Netflix in general.\n\njust need some clarification around the sharing rules.\n\ni currently have the Premium plan and im trying to share this with my family.\n\ni have 1 account and 2 profiles for this.\n\nis it possible to stream 2 different shows simultaneously on those 2 profiles (different devices and same household obviously) without affecting each other?\n\nor does it limit it to the same show even for both profiles*?\n\nthanks!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gyjxpe/1_account_2_profiles_watch_different_shows/"
    },
    {
        "id": "1gyjubt",
        "author": "Proof_Cable_310",
        "title": "Fatherhood",
        "content": "Just started episode 1, and only a few minutes into it. But, I have to commend the show for the tasteful sound appeal. A woman's delivery of her baby (one of the most horrid sounds to hear) was simply a few soft spoken words, and when the baby started to cry, soft music faded in over the cries. They made this scene literally music to my ears, instead of an anxiety enducing experience that's hard to listen to or watch. I wish more shows were like this.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gyjubt/fatherhood/"
    },
    {
        "id": "1gyj7sm",
        "author": "Afraid-Profession395",
        "title": "Penelope: the ending ",
        "content": "I powered through the episodes hoping I would get more out of each one, and really thought it was going somewhere in the last episode, but I felt it was a completely empty ending.\n\nWhat do you think happened after End Scene?\n- did she go back to surviving on her own\n- did she go back home after one of her parents died\n- did she stick around in that little random town to be unknown but helpful for what she had learned\n- or something completely different?\n\nI would like to hope if she went back into the woods she at least reached out to her family to let them know and stop being so selfish about not letting them know. But I really don’t know what to think\n\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gyj7sm/penelope_the_ending/"
    },
    {
        "id": "1gy338w",
        "author": "Fishersalt",
        "title": "Any way to save frames?",
        "content": "Maybe a stupid question, but there’s a specific scene in the series Arcane that I desperately want as my wallpaper on my phone and PC, but I have no idea how to save said frame. I obviously can’t screenshot it, so how do I go about it? I’ve tried searching for the frame online but to no avail. ",
        "upvotes": 10,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1gy338w/any_way_to_save_frames/"
    },
    {
        "id": "1gyif7v",
        "author": "Pincg",
        "title": "Weird static when people talk in Dexter?",
        "content": "I’ve been watching Dexter and whenever people are having a somewhat quiet conversation, there’s a weird almost windy/static noise during speech. I’m assuming it’s increased volume to make the voices louder, but it sounds like the microphones fuzziness was also made even louder than the voices. What’s going on?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gyif7v/weird_static_when_people_talk_in_dexter/"
    },
    {
        "id": "1gxwsqf",
        "author": "Automatic-Attorney96",
        "title": "Movies and tv shows I love because of how bad they are ",
        "content": "",
        "upvotes": 22,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1gxwsqf/movies_and_tv_shows_i_love_because_of_how_bad/"
    },
    {
        "id": "1gy9z8l",
        "author": "PericardiumGold",
        "title": "Why the single or 3 episode releases? I miss when they would release a whole season so I could binge. Also years between seasons leaves me forgetting shows and what occurred.. ",
        "content": "Genuinely curious is it from a marketing standpoint or sales, to do these slow releases? Keeping people subscribed for longer if they are only present to view the show then cancel? \n\nI get that’s how it’s being done now (Amazon as well) ",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1gy9z8l/why_the_single_or_3_episode_releases_i_miss_when/"
    },
    {
        "id": "1gy8yxd",
        "author": "Desperate_Carry_8422",
        "title": "Account issue advice ",
        "content": "Hi all, really weird one here. \n\nBusy day done and wanted to relax and Netflix. I then find that I've been signed out, password is wrong so I reset. \n\nI log back in and it says continue sign-up. \n\nBut...\n\nI've had an account for years, never missed a payment, last Payment left my account 7 days ago as usual. \n\nBut I follow the prompts and it's asking for payment again. \n\nI've had a really bad day today and this is a frustrating mess. \n\nThanks all.",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1gy8yxd/account_issue_advice/"
    },
    {
        "id": "1gy643m",
        "author": "BestWidowTaiwan",
        "title": "Have not been able to change my password for 3 days now",
        "content": "Is anyone else having an issue with changing their password? I have a habit of changing them every few months for security reasons but i havent been able to change it for the last few days. Netflix just gives the same generic error over and over. ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gy643m/have_not_been_able_to_change_my_password_for_3/"
    },
    {
        "id": "1gydnxj",
        "author": "GreattFriend",
        "title": "How to stop automatically skipping the opening when I click \"next episode\"",
        "content": "I'm watching the new season of Pokemon Horizons. I don't remember this being a problem when I watched the last new episodes a few months ago. But when the credits roll and it says \"next episode\" and i click it, it skips the opening of the next episode. I love anime openings and never skip them, and i'm wondering how to get it to stop doing that? I checked the settings on my computer and it doesn't look like there's a setting for it. I have autoplay the next episode turned off, so i don't know if maybe I turn it on it'll autoplay the next episode from the actual beginning as a temporary fix? But i'd rather fix the actual problem i'm having with my current settings intact.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gydnxj/how_to_stop_automatically_skipping_the_opening/"
    },
    {
        "id": "1gycp7h",
        "author": "Overall-Word4952",
        "title": "Does anyone know why i have access to shows on netflix that others in my country do not?",
        "content": "For example Dan Da Dan, i wanted a friend of mine to watch it, i saw him search for it on his phone and not appearing, it wasn’t available. This is taking place in Norway, I don’t use a VPN or anything. The only difference is that my phone (and thus my Netflix) was set on Norwegian while his was on Norwegian. Does Netflix hide shows if they don’t have a “your” language in either dub or sub? (My best theory)",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1gycp7h/does_anyone_know_why_i_have_access_to_shows_on/"
    },
    {
        "id": "1gycilu",
        "author": "Resident-Walrus-66",
        "title": "Netflix defaults to dub...",
        "content": "How do I set original audio with subtitles to be automatic on netflix? Whenever I have set a show to be in original audio with english subtitles in the past, it always automatically had the subsequent episodes of the show with the same setting. I never had to change it, and other shows would even have the same setting. I have rarely had to touch the language settings after that. \nRecently, I began watching a new show and found that it would be dubbed automatically no matter how many times I change it. The next episode plays and it's back to dub. Is there something that I can do to ensure that the sub will be the default option on every show? I watch all shows in all languages with subtitles as I have trouble understanding just audio, even in languages that I speak, and it's quite annoying if this is something I'm going to have to constantly do for every episode. Any tips or if anyone knows if this is a new thing netflix does? Thanks!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gycilu/netflix_defaults_to_dub/"
    },
    {
        "id": "1gxp54w",
        "author": "Russkafin",
        "title": "Ad-supported tier also limits content",
        "content": "We recently downgraded to the ad-supported tier to save money. I understood that this meant I would have ads and could only stream on one device at a time. What I didn’t realize is that some content would now be locked. \n\nMy kids went to watch Captain Underpants Hack-O-Ween and Boss Baby Back In The Crib, only to find they were locked with a message saying they are not available on the ad-supported plan due to licensing issues. I feel like they were not transparent about this when changing plans. \n\nI went on the Netflix customer service chat to complain about this. The response I got was, “I suggest you to please upgrade the plan.”\n\nIf it wasn’t for my kids I would absolutely cancel Netflix. ",
        "upvotes": 33,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1gxp54w/adsupported_tier_also_limits_content/"
    },
    {
        "id": "1gy8p29",
        "author": "Beneficial-Lake2756",
        "title": "Add Netflix accounts",
        "content": "My two siblings who live at home are paying for their Netflix together. They have the version with ads which is like $7?\n\nI asked my brother if I could pay them some money and watch a tv show on the tv when I come home for winter break. He said I'd have to pay $7 and probably more to add a profile? Does it cost money to add a profile? Then I said I could just use one of theirs and he said I couldn't watch it when they're watching it then and I was kinda like ok? Bc I doubt all three of us will watch Netflix at the same time. So idk... help? What would be the best and most cost effective way to share Netflix with two siblings?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1gy8p29/add_netflix_accounts/"
    },
    {
        "id": "1gxzcta",
        "author": "Schwimp",
        "title": "The Helicopter Heist is streaming now! Being a 15year old at the time, this was the coolest thing to ever happen in Sweden. It's not a documentary, but it shows what went down accurately. ",
        "content": "",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1gxzcta/the_helicopter_heist_is_streaming_now_being_a/"
    },
    {
        "id": "1gygdu3",
        "author": "lecyrix",
        "title": "Netflix’s Killers from Worst Ex Ever and Worst Roommate Ever Analyzed",
        "content": "Dorothea Puente: Antisocal Personality - She fits the profile more than any other, especially with the many marriages and different names - her biography also mentioned suicidal behaviour, so she could have had Borderline traits too.\n\nK.C. Joy: Possible Borderline Personality, but I find it more likely that he has Avoidant Personality and was pushed to the end of his rope by socioeconomic status. His temper is something we might attribute to Intermittent Explosive Disorder, making it a complicated stress response, but he is otherwise quite enigmatic without more background info.\n\nYoussef Khater: Narcissistic Personality. It seems clear that most of his crimes were committed in order to uphold his superiority, and he had one hell of a victim complex. He may have antisocial traits, but it’s hard to be sure without more background information.\n\nJamison Bachman: Narcissistic Personality, and possible C-PTSD after having witnessed the murder of his friend. It was a very sad case to me all around.\n\nJanie Lynn Ridd: Avoidant Personality - the only thing that seems amiss about her was the apparent delusion that she was the rightful mother of Ryder, however this may be a manifestation of pathological envy in Avoidant Personality\n\nScott Pettigrew: Paranoid Personality - in my opinion, he could have qualified for the insanity defence if it had been considered. Most likely, Anita also had some dementia because of her gullibility leading up to the murder.\n\nTammy Fritz: Antisocial Personality - without a doubt, Tammy Fritz is the only one on this list to meet the designation of psychopath in the forensics world. Unlikely that her accomplices were ill - just chronic substance abuse.\n\nMichael Dudley: Schizotypal Personality - everything he did seemed to come from paranoid ideation, and he also could have stood a good chance of using the insanity defence if he had tried.\n\nBenjamin Foster: Borderline Personality - possibly the worst case of it I’ve ever seen in a documentary, and because of the things I’ve seen myself in group DBT, it makes me feel sad.\n\nJerry Ramrattan: Narcissistic Personality - again, his primary concern was for his image. His three accomplices were just regular people swayed by money.\n\nRosa Hill and Mei Li: Narcissistic Personality - some may argue that Rosa managed to manipulate Mei into being her accomplice, but I’d argue that Mei had passed those traits on to Rosa and that Mei herself didn’t put people off as much because she had more time to learn how to mask her symptoms.\n\nKevin Lewis: Borderline and Narcissistic Personality, given especially by his vindictiveness and overconfidence. Jerradon Phelps may not be mentally ill at all, but Alexis Hale does undoubtedly have Antisocial and Histrionic Personality, the latter of which led to them being caught.\n\nLet me know what you think. Thanks for reading! ~Sincerely, the hyperfixated autistic forensic psychology student",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gygdu3/netflixs_killers_from_worst_ex_ever_and_worst/"
    },
    {
        "id": "1gy1auv",
        "author": "RevolutionaryLion384",
        "title": "Recommend me some spanish language shows or movies that are about narcos/criminals.",
        "content": "I have already seen Narcos and narcos Mexico, Somos, Chapo, the inmate and enjoyed them all very much. Are there any other shows like these on netflix or even another streaming platform that are just as good? I just want the show to be predominantly in spanish because I am trying to learn",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1gy1auv/recommend_me_some_spanish_language_shows_or/"
    },
    {
        "id": "1gxrtec",
        "author": "HypnoToadVictim",
        "title": "Pantheon is a great!",
        "content": "It’s like a William Gibson novel set in the contemporary if not slight future. Just binged the season. The animation is neither bad nor nothing to write home about. The main draw is for sure the plot. Would give it a strong 8.5/10\n\nIf you liked ghost in the shell, ergo proxy, irobot, akira, cyberpunk edge runners, scavengers reign, there’s probably aspects of this show you’ll enjoy. ",
        "upvotes": 12,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gxrtec/pantheon_is_a_great/"
    },
    {
        "id": "1gxt49e",
        "author": "FamBamJam78",
        "title": "Empress Season 2",
        "content": "Am I missing something? This feels like a different show to me. Maybe it’s English dub? It’s not the way anyone looks….bit the writing and maybe even acting?  Curious if I’m alone here. ",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gxt49e/empress_season_2/"
    },
    {
        "id": "1gxsuqr",
        "author": "Fit_Conversation_151",
        "title": "Midnight gospel",
        "content": "I hate to be corny as fuck but this is one of my favorite cartoons that has ever existed. I rewatch it every year or so. This cartoon is so well thought out. Its so deep. Its so good. Its made me cry. Its made me laugh. The creators need to kiss themselves to sleep. \n\nJesus is right here dont be afraid.\n\nEpisode two always reminds me to chill the fuck out.\n\nGod this show is so deep it makes me ill. ",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gxsuqr/midnight_gospel/"
    },
    {
        "id": "1gy02hz",
        "author": "MalpighialesLeaf",
        "title": "Annoying navigation whoosh",
        "content": "Netflix seem to have added a feature where every time you tab between shows, it makes a 'whoosh' sound.\n\nIs there a way to turn this off before I throw my TV out the window?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gy02hz/annoying_navigation_whoosh/"
    },
    {
        "id": "1gya5yq",
        "author": "progtfn_",
        "title": "Chestnut man ending SUCKED",
        "content": "Kastenjenmanden was not bad at all until I got to the last episode, the plot armor was crazy and unrealistic.\\\nRosa and the other guy were in the basement **drenched** in gasoline and were still able to survive, the fire spread soooo slow, one of them should have died there.\\\nAnother scene that didn't make sense was Thulin making the car crash, why didn't the murderer just shot her after she ALREADY tried to choke him.\nKristin, however, had biggest plot armor. Why on earth would him and Astrid keep her alive for that long? Why would Astrid say she was dead already? \nThe episode looked like a sad attempt at a good ending, that doesn't fit one bit the context of the situation, bad endings are \"good\" too.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gya5yq/chestnut_man_ending_sucked/"
    },
    {
        "id": "1gxzj9c",
        "author": "Military_collectorx",
        "title": "Help ",
        "content": "I remember watching this show in like the mid 2010’s on Netflix it’s been taken down a while ago and all I can remember is the into. Which started with these 2 guys one dressed something like a Viking and the other that looked like a scientist or wizard and they were following this clock on a conveyer belt and tinkering with other stuff along the way, I also remember they lived in a brick castle like building ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gxzj9c/help/"
    },
    {
        "id": "1gxdpkp",
        "author": "indiewire",
        "title": "Everything Coming to Netflix in December 2024",
        "content": "",
        "upvotes": 27,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1gxdpkp/everything_coming_to_netflix_in_december_2024/"
    },
    {
        "id": "1gxim2c",
        "author": "rdv100",
        "title": "The blue eyed Samurai is fantastic, kind of like lord of the rings, check it out! #bingewothy",
        "content": "I came across it because Netflix mentioned it as one of the most popular TV series. I started watching and couldn’t stop.  \nIt’s a truly wonderful story with excellent direction and fantastic character development. The plot revolves around a person seeking revenge for her mother’s murder.\n\n  \nIt kind of reminds me of *The Lord of the Rings* in the sense that the entire story focuses on someone on a journey to defeat the villain.\n\n  \nAnyway, definitely check it out!\n\n\n\n[https://www.netflix.com/title/81144203](https://www.netflix.com/title/81144203)  \n\n\n",
        "upvotes": 14,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1gxim2c/the_blue_eyed_samurai_is_fantastic_kind_of_like/"
    }
]