[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 48,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 17,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1raslqc",
        "author": "689Dementia",
        "title": "Did Tyra Banks make this documentary thinking it would improve her image?",
        "content": "Because if that was the goal, it honestly just makes her seem incredibly egocentric.\n\nUnless she genuinely didn’t realize what the full documentary would look like including the former contestants’ perspectives and discovered everything at the same time we did?\n\nEither way, it really bothers me how she talks to the contestants like they’re children, as if “Miss Tyra Banks” holds all the ultimate truth and authority.\n\nAnd did she make a statement yet?",
        "upvotes": 167,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1raslqc/did_tyra_banks_make_this_documentary_thinking_it/"
    },
    {
        "id": "1ranxe7",
        "author": "CHEZ0673",
        "title": "ANTM",
        "content": "Shandi was date raped and they made her look like a cheater instead of giving her the support she needed or even stopping it before it  happened. Tyra saying she isn't part of production but then playing along and bringing up cheating is appalling. \nShandi was raped and then made to look like the one at fault, fucking disgusting 🫣 ",
        "upvotes": 141,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1ranxe7/antm/"
    },
    {
        "id": "1ra6jev",
        "author": "theindependentonline",
        "title": "We were all rooting for Tyra Banks to give us some answers – but this America’s Next Top Model documentary gaslights its audience",
        "content": "",
        "upvotes": 524,
        "comments": 62,
        "media": null,
        "permalink": "/r/netflix/comments/1ra6jev/we_were_all_rooting_for_tyra_banks_to_give_us/"
    },
    {
        "id": "1ra1uv4",
        "author": "According-Volume9315",
        "title": "Reality Check: America’s Next Top Model",
        "content": "i am just heartbroken and livid for Shandi. each of these stories is sickening, and as a little girl watching and idolizing the girls on this show, so much of it just went right over my head (except how mean they all were- the cruelty made me upset, even as a kid).\n\nbut SHANDI!?????? this girl was basically R\\*\\*\\*D ON TELEVISION. she was blackout dr\\*\\*k. she could not consent. she was barely old enough to drink, she was impressionable, and she was innocent… they filmed her being taken advantage of in the very most disgusting way.\n\nTHEN, they filmed Tyra and the girls shaming her and talking smack about her… then filming her in fetal position on the floor, sobbing to her boyfriend on the phone while she “fesses up to cheating on him”… and him degrading her… all on Global TV.\n\ni just feel like this was the sickest story of all and it was barely glossed over. Tyra barely acknowledged it. just sick. Justice for Shandi.",
        "upvotes": 398,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1ra1uv4/reality_check_americas_next_top_model/"
    },
    {
        "id": "1r9zqoc",
        "author": "King-Baratheon",
        "title": "My wife and I were browsing Netflix when she recommended \"Adolescence\".",
        "content": "Not going to try and mangle my words; this was one of the best mini series I've ever watch. The way it's filmed with the one shots for each episode, the acting, all of it.\n\nThe last episode completely wrecked me. I have two sons that are 12, and placing myself in that situation in my head had me literally bawling my eyes out for close to 20 minutes. NEVER had a movie or show break me like this.\n\nIt also makes me realize how I can become a better father for my kids. Now, I'm going to check out other Stephen Graham stuff.\n\n10/10 show IMO.",
        "upvotes": 374,
        "comments": 91,
        "media": null,
        "permalink": "/r/netflix/comments/1r9zqoc/my_wife_and_i_were_browsing_netflix_when_she/"
    },
    {
        "id": "1ra7evr",
        "author": "lyn73",
        "title": "Famous Last Words:Eric Dane",
        "content": "This is the documentary everyone needs to see and should be talking about...not the ANTM. You will come away feeling like you've learned something &amp; appreciative for having spent the time watching it as opposed to being annoyed by highlighting abusive culture that has permeated our society.  ",
        "upvotes": 86,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1ra7evr/famous_last_wordseric_dane/"
    },
    {
        "id": "1raqhfl",
        "author": "Fluffy_Tie5709",
        "title": "El Jardinero(the gardeners)",
        "content": "I'm watching this on Netflix right now and it's worth watching.\n\nespecially Violeta... she's really beautiful🖤\n\nActually, it's my first time seeing her in this series, and she's really fascinating, even though I don't know what u think✌️",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1raqhfl/el_jardinerothe_gardeners/"
    },
    {
        "id": "1rav341",
        "author": "LilNello1",
        "title": "New AMA with Colby Day",
        "content": "Thought it might be of some interest to some folks in this subreddit to check it out.  Since he did the Netflix movie, Spaceman, starring Adam Sandler.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rav341/new_ama_with_colby_day/"
    },
    {
        "id": "1ra358f",
        "author": "Orion-Parallax",
        "title": "Do you ever…",
        "content": "Do you ever start a show or movie but lose interest in it and continue to watch it to the end just so it doesn’t stay on your ‘Continue Watching’ list for months before you eventually remove it. ",
        "upvotes": 44,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1ra358f/do_you_ever/"
    },
    {
        "id": "1racihd",
        "author": "Nadidi88",
        "title": "Any suggestions?",
        "content": "Looking for something exciting to watch, a drama with an amazing plot twist or a fun &amp; exciting thriller. I also really love horror movies that aren't slashers. \nOr anything else that you've seen recently and by the end you went \"WOW\"! \nThanks in advance! :)",
        "upvotes": 7,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1racihd/any_suggestions/"
    },
    {
        "id": "1ra1z32",
        "author": "IamJustJessica",
        "title": "How do they make specials so quickly?",
        "content": "Eric Dane ( greys anatomy/euphoria) just passed away yesterday. How does Netflix already have a 50min special about him? How do they manage to make these specials/docs so quickly?! ",
        "upvotes": 13,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1ra1z32/how_do_they_make_specials_so_quickly/"
    },
    {
        "id": "1raee74",
        "author": "NoIntroduction1017",
        "title": "Help find a movie",
        "content": "So there’s a movie I saw on Netflix, maybe 10 or less years ago, that involved a murderer. In the movie he’d make them choose between two ways to die. No it’s not would you rather, it’s so much better. The only thing I remember is he was masked and one of the victims survived. Please help!\n\nUpdate: Found it, the movie is “Choose”! ",
        "upvotes": 2,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1raee74/help_find_a_movie/"
    },
    {
        "id": "1r9syi3",
        "author": "rebelsoul_8",
        "title": "Bloodline",
        "content": "Just finished the first season of Bloodline. I'm really liking it so far and think the actors play their parts well especially John and Danny. Story is keeping me intrigued and I hope the following season's are just as good.",
        "upvotes": 24,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1r9syi3/bloodline/"
    },
    {
        "id": "1rai139",
        "author": "Comfortable-Bad3521",
        "title": "Suggestions for Thriller/Psychological/Suspense Series",
        "content": "Hey guys, I absolutely love watching thriller, psychological, and suspense series (and movies too). Recently, I’ve also started getting into sci-fi and crime.\n\nI’m looking for recommendations similar to Behind Her Eyes and Clickbait, something with mind-bending twists.\n\nOpen to both series &amp; movies!! ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1rai139/suggestions_for_thrillerpsychologicalsuspense/"
    },
    {
        "id": "1rad4ox",
        "author": "MourningWood1942",
        "title": "Can I use Netflix in two different places?",
        "content": "I know Netflix changed their policy a while back where you can’t share accounts, but I hate constantly having to go through process of changing home location to every time I go to my gfs house. Kinda a headache. \n\nIs there a way around this?",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1rad4ox/can_i_use_netflix_in_two_different_places/"
    },
    {
        "id": "1ra51xc",
        "author": "olive_branch_wall",
        "title": "Any romance anime recomandations?",
        "content": "I'm just looking to watch a some romance anime, preferablly with little fanservice if posible. For reference some of my favorites are Horimya and Dandadan (I know it's mostly a shonen but I lone the romance in it).",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ra51xc/any_romance_anime_recomandations/"
    },
    {
        "id": "1rao8zt",
        "author": "ORYXTHETAKENCUNT",
        "title": "AI Voices",
        "content": "I've been binging all of The Rookie recently, and just finished the first season. Completely in the original english audio with subtitles, and theres been no problems. I've just started up the second season and in the first episode theres been multiple VERY distinct and obvious AI edited voicelines, all specifically from one of the actors.\n\nThe most notable is at 24:46 in when Officer Chen says \"Uh, yes, sir, out of car 26\"\n\nTo me it sounds like either bad noise suppression for her lines or an AI model trained off her performance thats redone that specific line.\n\nIts seriously ugly to hear and I just want to know if this is a problem with other shows? Is there a way to opt out of hearing redone lines like this? Is it just baked into the playback of the episode?\n\nRegardless of what can or cant be done this is really pathetic on Netflix's part",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1rao8zt/ai_voices/"
    },
    {
        "id": "1rao74n",
        "author": "murphy_tom1",
        "title": "Netflix’s Strip Law Is the Most Demented Adult Animated Debut Since Rick &amp; Morty",
        "content": "",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1rao74n/netflixs_strip_law_is_the_most_demented_adult/"
    },
    {
        "id": "1rad5ix",
        "author": "Puzzleheaded-Gur3167",
        "title": "Does anyone else remember this show or know the name of it?",
        "content": "It might've been on Netflix at one point. It's a show with a young boy with a bit darker skin, he lives with a village and he has magic powers(fire I think) and a pink armadillo who is like his spirit animal. They go on adventure together. It's a cartoon. I watched it somewhere between 2014-2020, I can't remember. Does anyone else remember this show or know the name of it?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rad5ix/does_anyone_else_remember_this_show_or_know_the/"
    },
    {
        "id": "1rabyjw",
        "author": "harpreetthind",
        "title": "Need suggestions?",
        "content": "Just got done watching season three of the night agent. What else does everybody recommend my Google Home which is powered by Gemini‘s recommending that I watched the recruit since it has a similar vibe to the night agent what are your guys’s thoughts of that show? is it worth watching since I’m looking for something similar to the night agent?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1rabyjw/need_suggestions/"
    },
    {
        "id": "1r98inm",
        "author": "6ftToeSuckedPrincess",
        "title": "It's infuriating when I google a movie + streaming and Netflix comes up as if it's actually available to stream and every time I fall for it, but when you click it's just a \"remind me when this is available to stream\" Very frustrating!",
        "content": "I have multiple streaming apps like many people so when I get a hankering to watch a movie I'll google it rather than go to each streaming site and typing it in to save time. For whatever reason every other streaming service only seems to have results pop up if the movie is available there, but Netflix will get your hopes up and generate a search which makes you think it's available for streaming but it's happened like a dozen times now that the title isn't available and to \"remind\" me later when it's available. It feels like just a way to drive traffic to Netflix with hopes that they will just look for something else to watch via Netflix rather than scouring the internet looking the thing they were originally trying to watch. ",
        "upvotes": 71,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1r98inm/its_infuriating_when_i_google_a_movie_streaming/"
    },
    {
        "id": "1r9c2s9",
        "author": "TylerSpicknell",
        "title": "Where did the One Piece series succeed where the Cowboy Bebop series fail?",
        "content": "You'd think fans would hate live-action adaptations but the One Piece series is getting a 3rd Season. So how come that show succeeded and the Cowboy Bebop series lasted only one season?",
        "upvotes": 29,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1r9c2s9/where_did_the_one_piece_series_succeed_where_the/"
    },
    {
        "id": "1ra8257",
        "author": "SomeIdea_UK",
        "title": "Cuffs",
        "content": "I just binge watched Cuffs and it’s far, far too good to be cancelled after one season. I think it was a BBC production originally but I really hope Netflix picks it up and continues it. Great characters, great mix of plot and character development and great setting in Brighton. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ra8257/cuffs/"
    },
    {
        "id": "1r9150c",
        "author": "Baapofmovies_123",
        "title": "‘The Night Agent’ Season 3 Review (2026) – Is This the Best Season Yet?",
        "content": "The Night Agent Season 3 is easily the most complete and confident season of The Night Agent so far. The season may not reach the prestige level of crime dramas like The Wire or Ozark, but it is executed well enough to stand comfortably alongside modern mainstream thrillers such as The Blacklist.",
        "upvotes": 57,
        "comments": 71,
        "media": null,
        "permalink": "/r/netflix/comments/1r9150c/the_night_agent_season_3_review_2026_is_this_the/"
    },
    {
        "id": "1r9u37d",
        "author": "Puzzleheaded_Duck132",
        "title": "I just watch army of the dead after army of the thieves",
        "content": "And honestly army of the dead first half was good and then we got to the second half there were so many problems with it and how the ending was basically nothing although im kinda shocked and sad how they “killed off” my favorite character ludwig dieter but after a few search there was supposed to be another movie planet of the dead that got canceled and how ludwig manage to survive and now on the quest to find his beloved girlfriend which im very thankful of that his still alive😭 anyways what did u watch first and what are your thoughts on the movie? ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1r9u37d/i_just_watch_army_of_the_dead_after_army_of_the/"
    },
    {
        "id": "1r9sp45",
        "author": "Royal_Reality",
        "title": "Netflix PC app problems",
        "content": "Hi I'm using netflix app on windows 11 that I downloaded from microsoft store and I have the full subscription that supports 4k streaming. but when I try the watch the shows it looks like sh\\*t. I opened up the streaming details (ctrl + shift + alt + d) and it even says I'm watching it on 2560x1440 (2k) resulation but it's more like 480p or even 360p looking. Does anyone know how to fix it?\n\n  \n",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1r9sp45/netflix_pc_app_problems/"
    },
    {
        "id": "1r9f11p",
        "author": "Aggravating_Budget_6",
        "title": "Account stolen, Netflix wants me to pay a second time",
        "content": "Around Christmas a scammer removed my extra member and added themselves. I called, changed all passwords, and was told extra security was added.\nToday I got the “your email was changed” notification in Spanish. I called immediately.\nSupport says because I don’t know the new email and my card is no longer on file, they can’t verify me. My only option is to make a new account and pay again.\nProblem is:\n• My card was just charged for the new month \n• I had access after the first incident\n• The attacker clearly changed the email and payment method\nThey refused to escalate or transfer me.\nHas anyone successfully gotten Netflix to trace a specific charge to the account or reach billing/fraud instead of being told to start over? ",
        "upvotes": 4,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1r9f11p/account_stolen_netflix_wants_me_to_pay_a_second/"
    },
    {
        "id": "1r8m788",
        "author": "Pluckyplatypus26",
        "title": "Reality Check - Jay is also a villain",
        "content": "I feel like everyone is focusing on Tyra, and don’t get me wrong, she’s terrible. But Jay saying that Tyra wouldn’t talk to him off camera so he was being mentally tortured by having to work there for another season…. All while he’s watching teenage girls be actually mentally tortured. So out of touch. He’s at least getting paid to be there. He’s making a career out of it still. Those girls had no idea what they were signing up for.",
        "upvotes": 231,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1r8m788/reality_check_jay_is_also_a_villain/"
    }
]