[
    {
        "id": "1qdvz3j",
        "author": "reddituser0912333",
        "title": "Reminder: use the Open Thread for random thoughts, frustrations, ideas on where to go from here, etc.",
        "content": "Hey, everyone. No one is happy with the current happenings at the club with regard to the recent losses, sacking of Xabi, effort from some players, etc. I want to remind this sub of our rule to use the open thread (OT) for these posts. The purpose of the OT is to have these discussions, and allows for the home page to stay relatively clean. Sometimes we will keep posts up that have 'gained enough traction' (i.e., enough comments, upvotes) but we will be removing posts that do not fit the home page no matter what at this time. Thank you.",
        "upvotes": 31,
        "comments": 15,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qdvz3j/reminder_use_the_open_thread_for_random_thoughts/"
    },
    {
        "id": "1qarzcp",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 21,
        "comments": 5963,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qarzcp/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1qds3xc",
        "author": "Oblongcashew",
        "title": "This is what indiscipline and impatience does to this club",
        "content": "",
        "upvotes": 2800,
        "comments": 213,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ntqsbm397kdg1.jpeg?auto=webp&amp;s=c10abc6e551a3dd820cdc29d037521408b6b55c9"
        },
        "permalink": "/r/realmadrid/comments/1qds3xc/this_is_what_indiscipline_and_impatience_does_to/"
    },
    {
        "id": "1qe4t9d",
        "author": "AccomplishedWatch834",
        "title": "Vini and Bale stats for Madrid!",
        "content": "",
        "upvotes": 265,
        "comments": 108,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/m1xljx58qmdg1.jpeg?auto=webp&amp;s=b1be9b6d6ec9640de091d8d32513070d16d125b9"
        },
        "permalink": "/r/realmadrid/comments/1qe4t9d/vini_and_bale_stats_for_madrid/"
    },
    {
        "id": "1qdz5o3",
        "author": "Downtown-Anything960",
        "title": "Vini got frustrated with his teammates because they didn't understand his moves. He went to protest to Arbeloa coach suggested him patience.",
        "content": "",
        "upvotes": 526,
        "comments": 158,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/oan1e6vbildg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qdz5o3/vini_got_frustrated_with_his_teammates_because/"
    },
    {
        "id": "1qdq028",
        "author": "dakdakdakp",
        "title": "Alvaro Arbeloa has decided that Federico Valverde will not play RB anymore, as he tries to ease locker room tensions. Valverde had already complained to the board about this issue previously, under Ancelotti &amp; Alonso. When Trent &amp; Carvajal are both injured, Arbeloa will now rely on academy players",
        "content": "",
        "upvotes": 553,
        "comments": 286,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xv7VGR7coa30V58iWjiFf2QtRLCt1nfDgdhu_C8JH90.jpeg?auto=webp&amp;s=4ae454e538e28d3a8f15590e8c607af2d594d924"
        },
        "permalink": "/r/realmadrid/comments/1qdq028/alvaro_arbeloa_has_decided_that_federico_valverde/"
    },
    {
        "id": "1qe2ecl",
        "author": "asensia-kopfschmerz",
        "title": "Real Madrid hierarchy concluded after loss to Albacete that Xabi Alonso should’ve been fired earlier",
        "content": "There is a thought installed in Valdebebas and he talks about the moment of the change of coach. Some bet on having done it in the first days of December. Others, that of prolonging the situation (they were the ones who won) waiting for that change that did not come. What happened in Albacete comes to give reason to those who thought after the match against Celta it was time for change. \"The decision to dispense with Xabi Alonso and recruit Álvaro Arbeloa should have been made earlier,\" was the most talked about on the tragic night of Wednesday, the one that began with fog and ended in darkness.",
        "upvotes": 122,
        "comments": 67,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3dL5n8I3KLyCA44bk6APzn17luMhQe050wyFHBnc1pI.jpeg?auto=webp&amp;s=376d9383592569b75514226d9447623ed7bf0b76"
        },
        "permalink": "/r/realmadrid/comments/1qe2ecl/real_madrid_hierarchy_concluded_after_loss_to/"
    },
    {
        "id": "1qdtwqq",
        "author": "ace-s",
        "title": "The club executives are now blaming the players for the defeat last night. There could be very surprising decisions this summer. (My opinion: Then why sack Xabi then?)",
        "content": "",
        "upvotes": 330,
        "comments": 98,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BPtEp_97lvWnPXVVFvlTbk0cFf-dr85zxMJ_Dmbmis0.jpeg?auto=webp&amp;s=e4d134ceb45ff5b05cd6739b81709724c3c8accd"
        },
        "permalink": "/r/realmadrid/comments/1qdtwqq/the_club_executives_are_now_blaming_the_players/"
    },
    {
        "id": "1qea5am",
        "author": "Big-Treacle-9203",
        "title": "List of decisions Jose Mourinho took when he was given complete control of the club by Florentino",
        "content": "People often forget our Golden period only started after Jose Mourinho took Over Real Madrid and demanded literally complete control over the club including staff, transfers, youth, and management. There is no other manager who Perez surrendered the club to other than Jose.\n\nWhen Jose arrived, he wanted us to play counter attacking football to compete against Barcelona tiki taka and here are some decisions he took..\n\n* Firstly changed the formation of Real’s 442 that they played since 2000s to a 4231 or 433.\n* Got rid of Guti, who had issues with managers before..and Raul,by promising only a bench role and nothing more..even though Jose wanted him to stay.\n* Signed Ozil to play no 10, and benched a Balon D’or winner Kaka.\n* Signing Di Maria as a winger, Khedira as CDM despite having Lassana, Gago and Granero and signing Ricardo Carvalho despite having Pepe, Garay and Raul Albiol. Important to note Ricardo Carvalho was got to bring in some leadership to the group \n* Got the Castilla coach Alberto Toril sacked because he didn't like how Jese and Nacho were being developed, and wanted to play a young Dani Carvajal in the copa Del Rey in 2011\n* Got Jose Valdano Sacked cause he had criticised Mourinhos tactics before he even joined Madrid. Mourinho eventually became head of Football operations\n* Got Zidane to Be director of football, then got him demoted because of Zidane's criticism\n* Benched Iker Casillas for performance and other reasons, and played Adan.. A Castilla GK to show Iker that nobody is bigger than the team. Then made Diego Lopez his starter even after Iker returned from Injury.\n* Partially converted Ronaldo to a Striker, and Ramos to a full time CB and unleashed a monster out of Ramos and promoted him to captain despite having a feud with him\n* Showed several players their place.. Iker is one example, Replacing Pepe with a young Varane, Made Arbeloa permenant RB in the second half of 2013, Replaced Marcelo for Coentrao to suit his tactics\n* Literally Fought for and got Luka Modric over Santi Carzorla, and David Silva\n* Starting 11 was purely merit based, Benzema had to compete Higuain, Pepe with Varane, Kaka with Ozil, Marcelo with Coentrao. Each place was earned through merit.\n* He went out of the dugout before the game started so that the Bernabeu could boo him and not the players.. for 40 minutes.\n* Openly took on players in the dressing room such as Ozil, Kaka, Benzema, Pepe, Granero, Ramos, Iker, and even Ronaldo if they weren't chasing, tracking back, or making defensive errors.\n* Benched his whole defence in 2013 Jan after seeing it wasn't working..from Iker, Arbeloa,Pepe, Carvalho, Marcelo..to Deigo Lopez, Arbeloa, Ramos, Varane and Coentrao.\n\nUltimately, Ramos and Iker threatened to leave and the entire dressing room revolted against Mourinho. Once he left, Mourinho mentioned that its more about dealing with politics than with football at Real. Just goes to show the problems a manager has to face when he manages the club.\n\nNot advocating a Mourinho return, just highlighting the politics he had to endure and the decisions he took when he was here. If any manager took one of the decisions today, he will have terrible consequences for any manager.\n\nFrom 8 consecutive R16 UCL eliminations to teams like Lyon and Roma, to 3 consecutive UCL SEMIs is a big achievement.\n\nAncelotti succeded cause Mourinho had already prepared the players mentally and tactically. But even he followed what the management ordered him to\n\n* Played Diego Lopez as his La Liga GK, but eventually had to play the worst GK of the 2014 WC, Iker Casillas as his main GK\n* Changed the whole formation to accommodate James Rodriguez and played Odegaard For PR. (Mentions in his book)\n\nAt the end, Real is now all about egos and politics..and sadly it looks like the Galacticos era is back where players hold the ultimate powers, then the club management and last is the manager",
        "upvotes": 33,
        "comments": 22,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qea5am/list_of_decisions_jose_mourinho_took_when_he_was/"
    },
    {
        "id": "1qdpqjt",
        "author": "Ornery_Self_8758",
        "title": "Florentino Pérez's goal is to bring José Mourinho back to coach Real Madrid. Mourinho is currently causing a stir at Benfica to get himself sacked. He was the only coach Pérez has been happy with. Although he had arguments with Zidane, Ancelotti, Del Bosque etc, he always got along well with José",
        "content": "",
        "upvotes": 465,
        "comments": 155,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/PVWpB4YQ9PLqinqfkMyH3YItPuSBISSXRGAoi9d3GvE.png?auto=webp&amp;s=a0c8135f0031b6b7a8dc9710f95005b06e58faf6"
        },
        "permalink": "/r/realmadrid/comments/1qdpqjt/florentino_pérezs_goal_is_to_bring_josé_mourinho/"
    },
    {
        "id": "1qdhfgk",
        "author": "tfisthh",
        "title": "Real Madrid’s Standard Has Hit Rock Bottom.",
        "content": "remember Cristiano Ronaldo getting booed.\nremember him being whistled even after scoring hat-tricks and winning Ballon d'Ors.\nand what did he do? \nhe stood in the middle of the stadium and listened to the boos like a man. no drama. no tantrums. no victim role.\ntoday, players with 1 goal in 20 games are openly clashing with a proven manager and acting bigger than the club \nthat tells you everything.\nReal Madrid's standards have hit rock bottom.",
        "upvotes": 1237,
        "comments": 108,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/61fk7xa24idg1/CMAF_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qdhfgk/real_madrids_standard_has_hit_rock_bottom/"
    },
    {
        "id": "1qdkiuw",
        "author": "GreatAngel10",
        "title": "Historic booing at the Santiago Bernabéu on Saturday",
        "content": " I’ve been following Real Madrid for almost 20 years, and these divas who think they’re superstars should thank Florentino Pérez every single morning for banning the Ultras Sur.\nI’ve seen Casillas get booed for poor performances. I saw Mourinho bench him, and he left like any other player. I saw Kaká a legend at Milan sit on the bench quietly, without drama or public complaints.\n\nI watched Cristiano Ronaldo, Özil, Sergio Ramos, Xabi Alonso, Di María, Benzema give everything for this club. I saw Benzema benched for Higuaín. I saw Marcelo lose his place. I saw Gareth Bale lose his place. And you know what? None of them gave interviews attacking the coach. None of them acted bigger than the club.\n\n\nI’m not talking only about Vinícius Jr, no no, I’m talking about all those players who step into the pitch just to show off, constantly demanding privileges and questioning the coach publicly.\nI’m not here to defend Xabi Alonso, Ancelotti, or anyone else. I’m here for the club. For REAL MADRID.\n\nThis is not Ibiza Beach FC. This is Real Madrid. Even when we lost, rivals respected us because of who we were. I remember when the Bernabéu erupted just by seeing the players walk onto the pitch because they transmitted hunger, intensity, and pride.\nNow we’re forced to watch players with egos bigger than Cristiano Ronaldo’s, but with the level of Lucas Vázquez with all due respect to him. These players don’t feel what we feel.\n\nAfter a bad match, they board planes, return to their mansions, sleep with supermodels, and wake up worried only about which Lamborghini, BMW, or Ferrari to drive to training. They want to win without running, without fighting, because they believe they’re untouchable.\nThey don’t respect the fans.\n\nAnd here’s a message for those who started “supporting” Real Madrid in 2018, 2019, or especially in 2022: this club did not start with Valverde, Vinícius, Courtois, Hazard, or anyone else.\nStop blindly defending players at all costs. Cristiano Ronaldo left this club for much less, after giving us years of joy and historic performances and even he didn’t get special treatment on the way out.\n\nDo you honestly believe anyone in this current squad has done even 30% of what CR7, Marcelo, Ramos, or Benzema did? Of course not.\nSo stop defending laziness. At Real Madrid, effort is non-negotiable. Some players deserve to be booed loudly until they understand the weight of this shirt and some need to be booed to the point of asking to be substituted.\nThis is REAL MADRID.\n\nI have much more to say, but that’s for another time.\nThank you to everyone who read this far.",
        "upvotes": 758,
        "comments": 103,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qdkiuw/historic_booing_at_the_santiago_bernabéu_on/"
    },
    {
        "id": "1qe81xm",
        "author": "International_Oil189",
        "title": "Toni Kroos: when did Real Madrid fans start appreciating him?",
        "content": "Hi,\n\nI am a Bayern fan from Germany and I am curious:\n\nHow has the view of Kroos as a Madrid player evolved over time?\n\nbecause in Germany, he was long disrespected as „Sidepass-Toni“, someone who could only play passes from side to side. Only late in his career did the general German public start to respect Toni as a great midfielder.\n\nSo I would like to know from Madrid fans:\n\nWas Toni always highly respected and appreciated? Or was he initially considered just a squad player to complement the Galacticos?\n\nAnd how do you view him today after his retirement in light of the current lack of playmaking + leadership in the team?",
        "upvotes": 38,
        "comments": 37,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qe81xm/toni_kroos_when_did_real_madrid_fans_start/"
    },
    {
        "id": "1qdt2z7",
        "author": "Immediate-Drink2196",
        "title": "So we sacked xabi so that Arbeloa can copy Carlo's management style when we had Carlo and sacked him lol this club man",
        "content": "As above so below,  I can't believe the decision making of this club. Sacked Carlo Ancelotti because \"the vibes\" approach wasn't working so we get a tactician, who we sack for being a tactician then hire our reserve team coach who says he will try and copy Ancelotties \"vibes approach\". If neither structure and fluidity work, there is something wrong at much more deeper level. ",
        "upvotes": 209,
        "comments": 39,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qdt2z7/so_we_sacked_xabi_so_that_arbeloa_can_copy_carlos/"
    },
    {
        "id": "1qdgjhe",
        "author": "ace-s",
        "title": "Not even one Real Madrid player(including captains Carvajal, Fede and Vini) took the responsibility and spoke in the locker room after the match to lift morale. All the players were silent. Arbeloa had to come in and console them, saying they have to regroup and that he is the most to blame.",
        "content": "",
        "upvotes": 800,
        "comments": 114,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qdgjhe/not_even_one_real_madrid_playerincluding_captains/"
    },
    {
        "id": "1qdke6g",
        "author": "FinancialWolverine94",
        "title": "Brahim enjoying the AFCON while RM having a hard time",
        "content": "Brahim Diaz really escaped what is happening to RM during these days, I cant imagine the presure and the frustration inside the team, they got knocked out of la copa del rey and lost another final against FCB.\n\nBrahim is living a career highlight with his national team, he scored during five games in a row, yesterday Morocco got the the AFCON final after beating Nigeria in a very difficult game, they will play the final against Senegal, two african giants ! his joy after the final whistle tells it all, he was in tears as well !\n",
        "upvotes": 438,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ke1e6dxjsidg1.png?auto=webp&amp;s=d48e4fec4048628ae29edceccb746e7f0efc4753"
        },
        "permalink": "/r/realmadrid/comments/1qdke6g/brahim_enjoying_the_afcon_while_rm_having_a_hard/"
    },
    {
        "id": "1qdoa7g",
        "author": "OwnWitness2836",
        "title": "Real Madrid believes they hit rock bottom in Albacete and are preparing important decisions for next season.",
        "content": "The club's management believes the defeat is historic and will demand an extra effort from the players to fight for the two remaining titles. Changes are expected for next season.\n\n--------------------------------------------------------------------------------------\n\nReal Madrid lost to Albacete in the Copa del Rey round of 16 on Wednesday. Álvaro Arbeloa 's tenure began in the worst possible way with a heavy defeat in the final minute and further doubts surrounding the team. They have lost two titles in just three days, and on Saturday they host Levante at the Bernabéu with the fans on edge and a chorus of boos hanging over them in the lead-up to the match.\n\nWhat does the club say after the elimination?\nAccording to Melchor Ruiz, there is great displeasure at Real Madrid because they consider the defeat against Albacete historic , on par with those against Alcorcón or Alcoyano, also in the Copa del Rey. They believe the performance at the Carlos Belmonte stadium was unbecoming of a club like Real Madrid. Furthermore, they see the players as primarily responsible for the club's current situation. They feel that the Albacete defeat marked the lowest point, and they are convinced that they must make important decisions for next season, some of which could be surprising. They now hope that Arbeloa, in whom they have complete confidence , will be able to turn things around and fight for the two remaining titles: La Liga and the Champions League. However, no signings will be made in the winter transfer window.\n\n--------------------------------------------------------------------------------------\n\nArancha Rodríguez added that Real Madrid were clear that a change of direction was needed , which is why Xabi Alonso was sacked. The defeat is painful, but Arbeloa will be judged on his performance in the upcoming matches, not on the Albacete game, as he had only been at the club for a day. There is indeed concern about the players' fitness, and it is believed that the team will improve once this issue is addressed. The belief is that they can compete for La Liga and the Champions League , and that most of the players are underperforming, with the exception of Courtois and Mbappé.\n\n--------------------------------------------------------------------------------------\n\nAt Real Madrid , the players, including Arbeloa, will be asked to make an extra effort for this final stretch. This will happen before the match against Levante, and one of the club's senior figures will be in charge. They will be told that the situation is critical and that from now on they must give 100%. They know they are being targeted on social media , and a chorus of boos is expected. This is the angriest moment for Real Madrid fans in recent years.",
        "upvotes": 279,
        "comments": 95,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BPtEp_97lvWnPXVVFvlTbk0cFf-dr85zxMJ_Dmbmis0.jpeg?auto=webp&amp;s=e4d134ceb45ff5b05cd6739b81709724c3c8accd"
        },
        "permalink": "/r/realmadrid/comments/1qdoa7g/real_madrid_believes_they_hit_rock_bottom_in/"
    },
    {
        "id": "1qdy20u",
        "author": "No-Independent2522",
        "title": "[Albacete] Club expresses its complete condemnation of the disgusting xenophobic chants that a small group of fans uttered in the vicinity of the Carlos Belmonte stadium hours before the match and which, we insist, in no way represent our values.",
        "content": "",
        "upvotes": 64,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XnCbEgm6ZstNFVIpz2P8YGynanCGejnWKei1zAyS9Mg.png?auto=webp&amp;s=eb6900f8a005272bfbba719f359e17b8f375a612"
        },
        "permalink": "/r/realmadrid/comments/1qdy20u/albacete_club_expresses_its_complete_condemnation/"
    },
    {
        "id": "1qdou6m",
        "author": "Resident-Stretch9723",
        "title": "and real madrid 🤍!!!",
        "content": "",
        "upvotes": 159,
        "comments": 22,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/t51hvw8emjdg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qdou6m/and_real_madrid/"
    },
    {
        "id": "1qdiyrw",
        "author": "Hus-9",
        "title": "Been following Real Madrid for 30 years, and this meltdown is wild",
        "content": "Been following this team for 30 years and honestly I have never seen a meltdown like this. Its kind of amazing to watch. Feels like a mix of gold-diggers and fans who only started following Real Madrid because of a certain player. They have no idea what a real rough patch feels like.\n\nLet me tell you something, what we are seeing now is nothing compared to what real fans have gone through.\n\nThink early 2000s. Galacticos everywhere. Figo, Zidane, Ronaldo, Beckham. Everyone expected trophies every season. And yet we had some brutal heartbreaks. Losing the 2002 Champions League semi-final on penalties to Bayern. 2003 La Liga slipping at the worst possible moment. 2005 losing the Champions League quarter-final to Juventus after dominating the league. Fans endured it. We survived it.\n\nMid to late 2000s. The round of 16 curse in the Champions League became a nightmare. Year after year we got knocked out early by Lyon, Roma, Bayern, Liverpool. Champions League expectations were sky-high, but the team kept hitting the wall. La Liga wasnt easy either. We dominated most of the season only to have Barcelona snatch it at the end multiple times. Fans went through heartbreaks, outrage, and frustration. We learned patience the hard way.\n\nEven the first few years after the Galacticos era were rough. Coaching changes every season, big-money signings failing to deliver, rival clubs laughing at us. Every setback felt personal. And still, the true Madridistas stuck with the team.\n\nThen 2013-14. Finally, after years of suffering through that round of 16 curse, we lifted La Decima. Pure relief, pure joy. Everything before that heartbreak suddenly made sense. That’s what it feels like to survive the tough times.\n\nNow, I see a lot of people calling for Perez to resign. Really? Look at where Real Madrid was before him and where he took the club. Do not forget what he has achieved. The man built one of the greatest clubs in the world over and over. La Decima, La Undecima, multiple Champions Leagues, dominating Europe for decades. Criticize all you want, but calling for him to leave in a rough patch shows how little some people know or remember what this club went through before he arrived.\n\nAnd another thing. Stop comparing Real Madrid to Manchester United. Like really? Are you joking? Look at the last decade. United have struggled in PL and Champions League. Real Madrid have won 5 Champions Leagues in 9 years under Zidane and beyond. Winning La Liga, dominate in Europe. Revenue? Brand? Squad depth? History? Real Madrid is in a different league. You cannot compare the two, and anyone saying otherwise clearly does not understand football.\n\nSo yes, the situation is messy. Fans are upset. But relax, this chaos is nothing new. The real test of being a Madridista isnt celebrating wins, its surviving the tough times. And we have done it before, we will do it again, and we will laugh at these meltdowns.",
        "upvotes": 323,
        "comments": 174,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qdiyrw/been_following_real_madrid_for_30_years_and_this/"
    },
    {
        "id": "1qd909h",
        "author": "OwnWitness2836",
        "title": "Xabi : I’m doing very well, I’m calm.",
        "content": "",
        "upvotes": 1459,
        "comments": 65,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/jcsqbosgqfdg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qd909h/xabi_im_doing_very_well_im_calm/"
    },
    {
        "id": "1qdnv1k",
        "author": "Ineedhelpistaken",
        "title": "If people still don’t boo at the Bernabéu this Saturday after everything, I don’t know what it’ll take",
        "content": "Look, I’m not just talking for drama, there’s legitimate reasons why the atmosphere should be tense this weekend.\n\nWe just got knocked out of the Copa del Rey by Albacete, a second-division side, in one of the most humiliating results in recent history. That was Arbeloa’s debut as coach and it wasn’t even close to respectable.\n\nXabi Alonso is gone after only seven months,a manager who was supposed to be the next big thing, and we’re already in managerial chaos.\n\nMeanwhile the fans inside the club are already openly questioning Florentino. On Reddit threads today people are demanding Perez step down, calling his decisions ego-driven and disconnected from what this team actually needs.\n\nAnd don’t forget the wider fallout:  \n• The squad looks completely lost on the pitch, no identity, no consistency, even longtime supporters are calling this a meltdown unlike anything they’ve seen.  \n• There’s tension over plans to potentially open up ownership structures and bring in outside investment, something a lot of socios aren’t happy about.  \n• Florentino’s constant attacks on refereeing and the whole Negreira saga have drawn public pushback from the Spanish referees’ association.\n\nSo yeah, if the Bernabéu doesn’t let them hear it with whistles and boos this Saturday, I’ll be genuinely surprised.\n\nLet’s see if these people inside the club actually feel the pressure they’ve created.",
        "upvotes": 142,
        "comments": 36,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qdnv1k/if_people_still_dont_boo_at_the_bernabéu_this/"
    },
    {
        "id": "1qd0qvp",
        "author": "dark4403",
        "title": "and we lose the match....",
        "content": "",
        "upvotes": 3505,
        "comments": 522,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/50acr01qzddg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qd0qvp/and_we_lose_the_match/"
    },
    {
        "id": "1qdd5k3",
        "author": "TheFeatherDiaries",
        "title": "Arda Güler's deliveries yesterday",
        "content": "",
        "upvotes": 498,
        "comments": 101,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/k6qmt4d7tgdg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qdd5k3/arda_gülers_deliveries_yesterday/"
    },
    {
        "id": "1qe032b",
        "author": "yonetimistifa",
        "title": "Mourinho and my perspective, as a Fenerbahçe fan",
        "content": "I am a Fenerbahce fan, and I have seen Mourinho and how he works in the modern day. He is egotistical and tactically inept. I was very excited when he came to Fenerbahce, and said stuff like “this shirt is my skin” and “your dreams are now my dreams” but then a year later the guy leaves and says “I’m back at my level in Benfica.” Mourinho back at Madrid would be a big failure. He hasn’t won a single league title since 2015 for any of his teams and has only done damage. Mourinho will clash with the egos at Madrid and he will never win a single league title at Madrid. Save Arda please if he does go to you guys 🙏",
        "upvotes": 20,
        "comments": 37,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qe032b/mourinho_and_my_perspective_as_a_fenerbahçe_fan/"
    },
    {
        "id": "1qd1wny",
        "author": "Due_Requirement_1170",
        "title": "Oh how I so badly miss this",
        "content": "",
        "upvotes": 2116,
        "comments": 172,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/1xm3n9wq7edg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qd1wny/oh_how_i_so_badly_miss_this/"
    },
    {
        "id": "1qdchqe",
        "author": "arthur_kane",
        "title": "Real Madrid helping financially struggling club battling relegation in Segunda Divisón",
        "content": "",
        "upvotes": 310,
        "comments": 5,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ftvtnr8kmgdg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qdchqe/real_madrid_helping_financially_struggling_club/"
    },
    {
        "id": "1qe0dbn",
        "author": "Agreeable-Stage-6896",
        "title": "The Perception of Real Madrid",
        "content": "I don’t want to simply add to the negativity around the club at a time like this, but I genuinely no longer recognise the Real Madrid that I love. Not in its image, its decision making, or its identity\n\nOver the past year, several things have happened that I never would have expected. Frankly, they’ve left a sour taste in my mouth, and my hope is to start a discussion around it. Real Madrid was once feared across Europe for its dominance and class. Today, it feels as though our public conduct have done more damage to that image than our actual results. There seems to be a frantic fear of rebuilding, to the point of both rushed and undignified decisions.\n\nA few Examples:\n1. Treatment of Managers\nBlaming Ancelotti and sacking Alonso have in my opinion been truly disgraceful. Every single club in the world goes trough rebuilds at some point, and there is truly merit in the expression that ’Madridistas don’t know pain’. We’re a club that has won 6 champions league in 10 years, but that is still never enough. The way we’ve handled both Ancelotti, who’s brought us infinite happiness, and our club legend in Xabi Alonso has truly been surprising. It to me showcased an image of desperation, greed, and ungratefulness. The way we sacked Xabi to then settle for Arbeloa feels nothing but frantic and irrational. \n\n2. Recruitment Strategy\nEqually concerning is how our recruitment strategy has reshaped Madrid’s image across Europe. The phrase of ”Once Madrid knocks on the door” seem to have dwindled in recent times. We used to be a club that most people would dream to play for, and we were never afraid to spend money or make big transfers. Nowadays, we’re solely focused on long pursuits such as Mbappe; Contract expiration such as Trent; and young talent with no intention of playing them, such as Guler, Endrick, and Mastantouno. As a result, many European clubs distrusts us for our opportunistic behaviour, and rightfully so. Constantly waiting to steal players such as Konaté creates an image of both greed, and a lack of honor. Clubs fear us the same we one would fear a common thief, quite frankly. And it’s increasing causing friction with clubs such as psg and liverpool.\n\n3. PR and Arrogance\nPublicly targeting referees and embracing narratives like ”90 minutes at the Bernabéu” has been uncharacteristic, arrogant, and aged horribly. It is probably the first times that I’ve felt somewhat ashamed of my club. And our players are increasingly perceived as divas and influencers, reflecting a failure in leadership and culture.\n\nOverall, it feels as though Real Madrid has shifted greatly in just a few years. Long gone is the image of football royalty, class, and maturity. I find that change deeply disappointing, and I think it’s worth discussing why it happened\n",
        "upvotes": 14,
        "comments": 13,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qe0dbn/the_perception_of_real_madrid/"
    },
    {
        "id": "1qdiet0",
        "author": "Finn_Madridista",
        "title": "From Gegenpressing to Depressing 🫩 (OC)",
        "content": "",
        "upvotes": 106,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/p0vrkqz4didg1.jpeg?auto=webp&amp;s=5644268b2368e0f481cb6c3757d459f9906bada2"
        },
        "permalink": "/r/realmadrid/comments/1qdiet0/from_gegenpressing_to_depressing_oc/"
    },
    {
        "id": "1qdknsp",
        "author": "Alert-Raccoon-5075",
        "title": "A fan has died from a heart attack when he found out real madrid lost the game el classico.",
        "content": "Like in the picture thats hes brother talking to the reporter saying how much hes brother loved real madrid and he was a top fan of real madrid and when he found out real lost he got reaally really depressed and later on he died of a stroke/heart attack the man was a genuiene fan of realmadrid and the man is from kurdistan and hes kurdish and a source: https://www.facebook.com/share/v/1BcoJKfPbK/?mibextid=wwXIfr",
        "upvotes": 71,
        "comments": 28,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qdknsp/a_fan_has_died_from_a_heart_attack_when_he_found/"
    }
]