[
    {
        "id": "1joono2",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1joono2/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1joonon",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1joonon/la_piola_friends_meetup/"
    },
    {
        "id": "1jr5iyi",
        "author": "your_freaky_neighbor",
        "title": "Corteo notturno di ciclisti",
        "content": "Ciao, ieri sera intorno alle 21:10 ho visto passare sotto casa mia (via Roccavione) una specie di corteo alquanto lungo di gente in bicicletta, alcuni anche in pattini e monopattini, a ritmo di *Just do it* dei Chemical Brothers e scortati dalla polizia, quindi penso fosse autorizzato. Qualcuno sa di cosa si tratta? Sembrava interessante e non mi dispiacerebbe partecipare. Sui vari social non ho trovato niente a riguardo.",
        "upvotes": 13,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1jr5iyi/corteo_notturno_di_ciclisti/"
    },
    {
        "id": "1jrivba",
        "author": "Sundalo0",
        "title": "Sushi ayce",
        "content": "Esiste ancora qualche ayce buono senza spendere un rene la sera? Oramai trovo solo posti da 30 a 34€ a persona",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jrivba/sushi_ayce/"
    },
    {
        "id": "1jrcy6r",
        "author": "LadyXulia",
        "title": "Day trip on weekends from Torino?",
        "content": "Hello, I am in Torino for the next few days and wanted to know if there are any 1-day or 2-days trips that could be done on the weekends that leave from Torino? Like, is visiting Milano worth it? Or Lago Como? Or any group trips/tours around Piemonte? Any suggestions are welcommed hahaha",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1jrcy6r/day_trip_on_weekends_from_torino/"
    },
    {
        "id": "1jqe4q1",
        "author": "Spiritual_Cake_9127",
        "title": "Sono stanca capo",
        "content": "",
        "upvotes": 188,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/h5u56vkpblse1.png?auto=webp&amp;s=c7176db06533106f85a461efddb9d652d167bffd"
        },
        "permalink": "/r/torino/comments/1jqe4q1/sono_stanca_capo/"
    },
    {
        "id": "1jrcfzi",
        "author": "lucapoison",
        "title": "NWA American Wrestling - Purgatory a Collegno (Torino) con Nick Nemeth e Jack Hager",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jrcfzi/nwa_american_wrestling_purgatory_a_collegno/"
    },
    {
        "id": "1jrc18x",
        "author": "Carlossss11",
        "title": "Team workout all’aperto Vinchiglietta/Vanchiglia e limitrofi",
        "content": "L’estate si avvicina e i giorni per provare a essere un po’ più in forma sono sempre meno. Dal 15 aprile vivrò a Vanchiglietta. Sono un freelancer quindi posso allenarmi quando voglio e dove voglio. Visto che cominciano le belle giornate e che risparmiare un po’ di soldi non fa proprio schifo, che ne dite di creare un gruppo per fare workout nei parchi a Vanchiglietta, vanchiglia, oltrepo o zone limitrofe? \nGli allenamenti li farei in una di queste fasce orarie:\nMattino 8-9\nPranzo 12-13\nCena 19-20\nIo vorrei allenarmi tutti i giorni visto che agosto è tra 4 mesi. \nSe ci mettiamo costanza e impegno in 4 mesi diventiamo dei figuriniiiiiii. \n\nNon sono un allenatore ma sono sicuro che insieme potremmo riuscire a creare un bel circuito da fare. \n\nPer chi si volesse unire mi scriva in chat che vi aggiungo in un gruppo telegram.\nL’invito è aperto anche a quelli che vengono da altre zone ma, tenente conto che ci alleneremo a Vanchiglietta o comunque nei quarti limitrofi non troppo lontani. \nBye ✌🏼",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jrc18x/team_workout_allaperto_vinchigliettavanchiglia_e/"
    },
    {
        "id": "1jr7lqi",
        "author": "weedkidd",
        "title": "Best places to eat in Turin?",
        "content": "I am staying in Turin for the next few days and I’d love to experience some truly local, traditional cuisine(pasta/pizza) while I’m here. I’m especially interested in places that are popular with locals rather than touristy spots.\n\nWould appreciate a lot any recommendations!",
        "upvotes": 2,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1jr7lqi/best_places_to_eat_in_turin/"
    },
    {
        "id": "1jqpqa5",
        "author": "SignificanceNeat5931",
        "title": "Torino attiva",
        "content": "Ho notato che Torino a livello di centri sociali e vari movimenti giovanili e non è una tra le più attive tra le città , vivendoci  (pochi mesi) ho visto che tra i giovani le ideologie sono belle distinte , sembrano esserci pochi disinteressati all attualità e alla politica in generale . \n\nInsomma mi sembra una città rispetto alle altre meno “edonistica” non so come dire , forse sto dicendo cazzate ma vorrei capire se questa mia impressione sia corretta . ",
        "upvotes": 12,
        "comments": 32,
        "media": null,
        "permalink": "/r/torino/comments/1jqpqa5/torino_attiva/"
    },
    {
        "id": "1jql6cq",
        "author": "Qf98",
        "title": "2 biglietti per Blacklight!",
        "content": "Ciao a tutti, con alcuni amici abbiamo preso dei biglietti per partecipare domani all'evento Blacklight a Torino. https://www.openthegate.it/blacklight/dreamcatchers/\n\nL'evento è un format caccia al tesoro all'aperto nel centro di Torino, con qualche modifica per renderlo più eccitante :)\n\nPurtroppo due persone non possono più venire, quindi abbiamo due spazi liberi! \n\nIl gruppo è super amichevole, siamo 3 ragazzi e una ragazza (tutti nel range 26-32 anni).\n\nCosto biglietto €20, si parte alle 22.00 da Piazza Vittorio e l'evento dura circa 2 ore.\n\nDm per chi è interessato/a! ",
        "upvotes": 2,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9gqlmUNFJGFWgAnt07t3h-oEj5jKbNhPcjvayGFIkyw.jpg?auto=webp&amp;s=ae9ea91bc10e9005a0c42aff062c572f93f3204e"
        },
        "permalink": "/r/torino/comments/1jql6cq/2_biglietti_per_blacklight/"
    },
    {
        "id": "1jqwkof",
        "author": "hernxnc",
        "title": "Cannabis in Turin? Any thoughts?",
        "content": "Hello everyone! I hope you are all doing well.\nI’m an erasmus student from Barcelona, I’m currently living in Riga, Latvia and I wanted to know if someone can help me to find some good flowers in Torino!\nI know.. I know.. is illegal and whatever but that’s why I’m coming here to see if a good soul can help me out!\nAlso, it’s a nice opportunity to really discuss WHY this is still hard to find in Italy? Like wtf? It’s time to have open legislation and allow consumers to enroll themselves into clubs like Catalunya and rest of Spain is doing it.\nHere in Riga, Latvia.. the level of prohibition is insane. In the Baltics is very very hard to find!\n\nThanks for the help and I hope someone can share some light upon this Redditer !!\n\nPeace!",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1jqwkof/cannabis_in_turin_any_thoughts/"
    },
    {
        "id": "1jql9xl",
        "author": "Ok-Palpitation-1086",
        "title": "Cerco amicizie lgbt",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jql9xl/cerco_amicizie_lgbt/"
    },
    {
        "id": "1jqbq2x",
        "author": "Top-Text-7727",
        "title": "Piola buona ma non troppo impegnativa",
        "content": "Ciao! A Pasqua mi raggiungono dei parenti. Ho prenotato a Vitel Toné in centro. Tuttavia ho pensato che ci potrebbero essere ristorantini più economici ma comunque buoni. Consigli?",
        "upvotes": 3,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1jqbq2x/piola_buona_ma_non_troppo_impegnativa/"
    },
    {
        "id": "1jpyn4n",
        "author": "Inevitable-Room9048",
        "title": "Dove posso comprare una cintura in pelle di alta qualità a Torino?",
        "content": "Ciao! Sapete dove posso acquistare una cintura uomo in pelle di ottima qualità? Vorrei sostenere un produttore locale, ma la mia priorità assoluta è la qualità. Cerco solo cinture in pelle pieno fiore.\n\nGrazie!",
        "upvotes": 4,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1jpyn4n/dove_posso_comprare_una_cintura_in_pelle_di_alta/"
    },
    {
        "id": "1jprefu",
        "author": "ClockNarrow6953",
        "title": "TEATRO - ALTALENE - io, tu, noi, gli altri",
        "content": "Due creature, due esseri umani molto diversi tra loro che si guardano per conoscersi a vicenda...ma anche e soprattutto per conoscere se stessi. Chi sono io? Chi è davanti a me? Qual è il mio specchio e di cosa io sono specchio?\n\nGiacomo Gallerio e Walter Revello provano a rispondere a questa domanda attraverso l'uso del proprio corpo, delle proprie emozioni e dei silenzi: un progetto di ricerca, che usa i linguaggi del teatrodanza fondato da Pina Bausch, in un'elaborazione imprevista e irripetibile, senza testo, senza struttura, interamente calibrata sulla presenza del pubblico.\n\nLo spettacolo è presentato IN PRIMA ASSOLUTA.\n\n05 apr 2025, 20:45 - Teatro Fratelli Cervi, Via G. Mazzini, 60, 10072 Caselle Torinese TO\n\nIngresso gratuito, prenotazione obbligatoria su [https://www.liberegabbie.org/event-details/altalene-caselle](https://www.liberegabbie.org/event-details/altalene-caselle)",
        "upvotes": 5,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/orZm_ol76kXzgEl8QMNBoC6z1ACV8nCQ8wKljmRxvR0.jpg?auto=webp&amp;s=b786a842ca45d60e0093abfa0cc61669a9fef10a"
        },
        "permalink": "/r/torino/comments/1jprefu/teatro_altalene_io_tu_noi_gli_altri/"
    },
    {
        "id": "1jpztg0",
        "author": "Kikto_jkk",
        "title": "Luoghi di ritrovo/locali dove si fa freestyle rap o battaglie a torino?",
        "content": "anche centri sociali e cose varie",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1jpztg0/luoghi_di_ritrovolocali_dove_si_fa_freestyle_rap/"
    },
    {
        "id": "1jovxy6",
        "author": "bonny-95",
        "title": "Sacra di San Michele",
        "content": "",
        "upvotes": 153,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1jovxy6/sacra_di_san_michele/"
    },
    {
        "id": "1jplfqn",
        "author": "DottorGonzo",
        "title": "Consiglio ristoranti non turistici",
        "content": "Ciao a tutti, a fine mese passerò alcuni giorni a Torino con la mia ragazza e mi piacerebbe avere da voi qualche consiglio su dove mangiare cucina torinese (o più in generale piemontese). Alloggeremo in zona Porta Palazzo e vorrei evitare opzioni troppo costose. Vi ringrazio anticipatamente per i consigli.",
        "upvotes": 3,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1jplfqn/consiglio_ristoranti_non_turistici/"
    },
    {
        "id": "1jprf1p",
        "author": "ClockNarrow6953",
        "title": "CONCERTO - ANTONIO PALUMBO LIVE",
        "content": "Dopo l’esperienza con la band neo folk Nebel, Antonio Palumbo nel 2017 esordisce come solista con l’EP “Altaguardia”. Nel novembre 2024 esce “Che cosa dicono le canzoni”, prodotto da Edoardo Romano, che fonde pop, elettronica e dance.\n\nAntonio si è chiesto: “ha senso che io continui a fare musica? Che cosa voglio dire con le canzoni? Non sarebbe più facile spegnere tutto e ciao?”\n\nEcco, che fare musica ha sempre senso, ce lo dimostra al quarto appuntamento di Come in cameretta, progetto dedicato a band e artisti emergenti, che permette di portare i propri pezzi in live in un’atmosfera intima e coinvolgente, quasi come un incontro tra amici nella propria stanza.\n\n04/04/2025 h. 21 - EcoMuseo Nesta, Via Norberto Rosa, 13, 10154 Torino\n\nIngresso gratuito, prenotazione obbligatoria su [https://www.liberegabbie.org/event-details/antonio-palumbo-live](https://www.liberegabbie.org/event-details/antonio-palumbo-live)",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NZJbfhDqn7b7wiYTomRLeMsxFhbGVGPh1zNppqy7itM.jpg?auto=webp&amp;s=62fbe049f60df796d909c799a95363a155874a18"
        },
        "permalink": "/r/torino/comments/1jprf1p/concerto_antonio_palumbo_live/"
    },
    {
        "id": "1jpqkcw",
        "author": "Odorico7",
        "title": "Trip to Torino",
        "content": "Hey there, me and my girlfriend are from Denmark, and we are going to Torino over the Easter. I’m a Big Juventus fan, so i have been there a couple of times, but so far I haven’t found a great place to eat, or a big street to shop. So are there anyplace we need to eat?, or a place we need to go when shopping?. Because so far walking though random streets haven’t gotten me much :) thank you in advance.",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1jpqkcw/trip_to_torino/"
    },
    {
        "id": "1jpnu09",
        "author": "Il-volo-di-icaro",
        "title": "Salve sono un assistente al infanzia e cerco lavoro a Torino. Cerco un asilo nido per agosto. C’è qualcuno qui che mi porterebbe aiutare o suggerire qualcosa",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jpnu09/salve_sono_un_assistente_al_infanzia_e_cerco/"
    },
    {
        "id": "1jog8tq",
        "author": "DiamondbackArmadillo",
        "title": "cos'è questo??",
        "content": "Tana del pesce...?",
        "upvotes": 645,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/j161c5wyq3se1.png?auto=webp&amp;s=3e5d661e1e17da68cb0be170515471bc681a06a7"
        },
        "permalink": "/r/torino/comments/1jog8tq/cosè_questo/"
    },
    {
        "id": "1jpklw8",
        "author": "Fabulous-Programmer1",
        "title": "Application Fee",
        "content": "Can someone help me please, i applied for the bachelor in civil engineering with the sat and it still says pending, do i need to pay a fee to get it going? or do i pay a fee after getting accepted for enrolment?\n\nhttps://preview.redd.it/6ih2jjl96ese1.png?width=1376&amp;format=png&amp;auto=webp&amp;s=bdaab49ffd2ab53048962746f7a7de114e4ced9b\n\nIt says submitted but i did not pay anything because i did not get any email or even something to pay.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jpklw8/application_fee/"
    },
    {
        "id": "1jp31ra",
        "author": "Particular-Glove-225",
        "title": "Cerco nuove amicizie",
        "content": "Ciao a tutti. Sono di Torino ma ultimamente avrei voglia di fare nuove amicizie. Ho 35 anni, donna, mi piacciono molto le materie artistiche, ho studiato al liceo artistico e pratico ancora disegno e pittura. Inoltre mi piacciono le materie umanistiche in generale, in particolare storia, filosofia e psicologia. Sono tendenzialmente introversa, mi piace più che altro fare attività tranquille con poche persone. Non sono esattamente una cinefila, ma non mi dispiace passare una serata a guardare un film o semplicemente ad ascoltare un po' di musica e chiacchierare un po'. Se avete piacere, scrivetemi pure. Buona serata a tutti! ",
        "upvotes": 15,
        "comments": 31,
        "media": null,
        "permalink": "/r/torino/comments/1jp31ra/cerco_nuove_amicizie/"
    },
    {
        "id": "1jpjnpv",
        "author": "[deleted]",
        "title": "Dove comprare vestiti per andare a la palestra?",
        "content": "Sto cercando vestiti economici per andare a la palestra, dove posso trovare? ",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1jpjnpv/dove_comprare_vestiti_per_andare_a_la_palestra/"
    },
    {
        "id": "1jpaje7",
        "author": "Ready-Concept4047",
        "title": "Corsi Formativi",
        "content": "Ciao a tutti, vorrei cambiare lavoro, ho una laurea triennale L-36 conseguita ormai 3 anni fa, dopo la laurea mi sono concentrato esclusivamente sul lavoro ma penso sia arrivato il momento di cambiare realtà. La mia domanda è: conoscete o avete fatto corsi formativi qui a Torino che secondo voi sono davvero validi per quanto riguarda la formazione e la conseguente immissione sul mercato del lavoro? Sia a pagamento che finanziati da enti pubblici/UE, ed eventualmente con stage finale in azienda\nQualsiasi cosa vi venga in mente\nGrazie",
        "upvotes": 4,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1jpaje7/corsi_formativi/"
    },
    {
        "id": "1jp68hq",
        "author": "HeadphoneGirly",
        "title": "vecchietto con musical techno",
        "content": "RAGA continuo a vedere un vecchietto con la cassa attaccata al collo che mette la musica Techno\n(Porta nuova)\nSono l'unica??",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1jp68hq/vecchietto_con_musical_techno/"
    },
    {
        "id": "1jorqda",
        "author": "autumnshimmer",
        "title": "Negozio riparazioni oggetti elettronici datati?",
        "content": "Salve gente, come va? Come da titolo sto cercando un negozio dedicato alla riparazione di oggetti elettronici abbastanza datati. Per essere specifico sto cercando di riparare un walkman WM-EX606 del 1992. Grazie mille!🫶🏻",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1jorqda/negozio_riparazioni_oggetti_elettronici_datati/"
    },
    {
        "id": "1jo9md0",
        "author": "tarkinn",
        "title": "How is living in Torino / Turin",
        "content": "",
        "upvotes": 41,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vrhg3pco7tre1.jpeg?auto=webp&amp;s=8f5869ae5942d91e7371d2585903597a6518f04b"
        },
        "permalink": "/r/torino/comments/1jo9md0/how_is_living_in_torino_turin/"
    },
    {
        "id": "1jp2t0u",
        "author": "Dry-Eye1685",
        "title": "Controllori metro",
        "content": "Salve, volevo chiedere se qualcuno di voi avesse mai incontrato i controllori dentro la metro... Per sapere se nel momento in cui uno passa i tornelli senza biglietto poi ci fosse qualche rischio di essere beccato oppure no.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1jp2t0u/controllori_metro/"
    },
    {
        "id": "1jo400o",
        "author": "Original_Draw_9492",
        "title": "Negozi cinesi zona Lingotto",
        "content": "Come da titolo, non sono di Torino e ancora non conosco benissimo la zona ma cercavo negozi in stile cinesi che hanno un po di tutto per ogni evenienza, per intenderci in zona vicino al Centro Commerciale\nNegozi di merceria di ogni genere, cose di casa, ufficio, un minimo di elettronica, fai da te ecc.",
        "upvotes": 7,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1jo400o/negozi_cinesi_zona_lingotto/"
    }
]