[
    {
        "id": "1izhqr1",
        "author": "TheMonkey-OzPerkins",
        "title": "Hey /r/movies! - I'm  Osgood Perkins, writer and director of THE MONKEY. I've also directed films like LONGLEGS, THE BLACKCOAT'S DAUGHTER, and GRETEL &amp; HANSEL. Ask me anything.",
        "content": "",
        "upvotes": 614,
        "comments": 471,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/49qb0gy35ple1.png?auto=webp&amp;s=1cf54149a7ac092a886bd63476e190dec00535d4"
        },
        "permalink": "/r/movies/comments/1izhqr1/hey_rmovies_im_osgood_perkins_writer_and_director/"
    },
    {
        "id": "1j0i4dk",
        "author": "LiteraryBoner",
        "title": "Oscar Bingo XII Game Card Pickup Thread",
        "content": "#[Here is the gamecard generator.](https://print-bingo.com/reddit/oscars2025.php) if you want to just nab one and skip the wall of text.\n\n---\n\nAlright everyone, Oscar Sunday is quickly approaching and with it the growing anticipation to simultaneously be enthralled and disappointed by the glamour and politics of Hollywood. Well, to make it all a little more interesting we are doing Oscar Bingo again this year. A week ago we [asked you guys to come up with things that might happen during the ceremony](https://old.reddit.com/r/movies/comments/1itlqyx/oscar_bingo_xii_submission_thread/) and vote for your favorites. We then collected the top 65 plausible and non redundant submissions and our friends over at www.print-bingo.com made us a Bingo game card generator that has a ton of game cards for you fine folks to download.\n\n- Feel free to get however many you want for your needs but please don't waste them! \n\n- [Here is the gamecard generator.](https://print-bingo.com/reddit/oscars2025.php) Just do the captcha and your card will be generated via **link to a pdf.** You will have to click the link for the card, don't do the captcha a bunch of times because it's not automatically downloading. That wastes cards and each one could be a winner!\n\n- Check out [last year's game thread](https://old.reddit.com/r/movies/comments/1bbnpzr/oscar_bingo_game_thread_xi/) for reference.\n\nEveryone is welcome to participate. On Oscar Sunday we will make an official game thread for everyone to discuss their cards and the game. The game thread will also serve as a referee zone for me and participating users to make judgement calls on the more ambiguous answers. Here are some things to know about the \"competition\" side of this little shindig:\n\n- If you win just be sure to yell \"BINGO\" really loud wherever you are. And if you wanna post your gamecard to the game thread that would be fine too.\n\n- This thread will be stickied until Oscar night when we make the game thread. There will also be an official Oscar discussion thread separate from the Bingo game thread.\n\n\nFinally, none of this ridiculousness could have been possible for such a large-scale website without print-bingo.com, and they have a message for us!\n\n*\"Print-Bingo.com is used by hundreds of teachers, event hosts, party organizers, and ex-pats in all corners of the globe to make both traditional and custom bingo cards through a web browser. We are happy to help Reddit with this fun, specialized, use of our website.\"*\n\nSo hey! Pick up a gamecard. Pick up 5. Play with your friends. Play alone with your cat. And let this be a reminder to all of us not to take the Oscars too seriously.",
        "upvotes": 21,
        "comments": 11,
        "media": null,
        "permalink": "/r/movies/comments/1j0i4dk/oscar_bingo_xii_game_card_pickup_thread/"
    },
    {
        "id": "1j17tas",
        "author": "MarvelsGrantMan136",
        "title": "Harrison Ford drops out as presenter at 2025 Oscars after shingles diagnosis",
        "content": "",
        "upvotes": 6629,
        "comments": 331,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/omd8CskG_zMc72cfv5I4ayCTBUVFeBDXAtTM3t_u9do.jpg?auto=webp&amp;s=d294acf6d9fcb067f7464efb9f3534eea19daaab"
        },
        "permalink": "/r/movies/comments/1j17tas/harrison_ford_drops_out_as_presenter_at_2025/"
    },
    {
        "id": "1j11xs7",
        "author": "MarvelsGrantMan136",
        "title": "Jack Black &amp; Paul Rudd’s ‘Anaconda’ Reboot Has Officially Wrapped Filming",
        "content": "",
        "upvotes": 4723,
        "comments": 421,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/O5ZLJjrTe2ebagyjbcNQjlTRQqmYdFV6JyXdkZtN_zo.jpg?auto=webp&amp;s=873cf66a2460e369f77660d41ef2215e138d9437"
        },
        "permalink": "/r/movies/comments/1j11xs7/jack_black_paul_rudds_anaconda_reboot_has/"
    },
    {
        "id": "1j17euu",
        "author": "SamLarsons",
        "title": "What is the greatest animated film of all time?",
        "content": "See title. What is your greatest animated, not live action, movie? One that you could watch over and over again and never get tired of it?\n\nIn honour of Miyazaki’s latest (and maybe final) film, my friend and I got into a discussion about what the best animated film ever was. Is it a given that it is a Miyazaki?",
        "upvotes": 1952,
        "comments": 3606,
        "media": null,
        "permalink": "/r/movies/comments/1j17euu/what_is_the_greatest_animated_film_of_all_time/"
    },
    {
        "id": "1j17ke6",
        "author": "vatred",
        "title": "David Johansen Dies: New York Dolls Singer &amp; ‘Scrooged’ Actor Was 75",
        "content": "",
        "upvotes": 827,
        "comments": 59,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xVQevtK49414QLXniq04HMjX_u69zEVqlnBF0mYpgYY.jpg?auto=webp&amp;s=b11003dc2d58aa5cc02246a927856de105fdb821"
        },
        "permalink": "/r/movies/comments/1j17ke6/david_johansen_dies_new_york_dolls_singer/"
    },
    {
        "id": "1j169er",
        "author": "NstgElNino",
        "title": "What are the best revenge movies ?",
        "content": "For me the best and underrated revenge movies is Law Abiding Citizen. This movie got so much potential to be a masterpiece if the ending is different. My next favorite revenge movies is I Saw The Devil. The guy that played the bad guy is so convincing in his character and made me so angry watching him. ",
        "upvotes": 189,
        "comments": 590,
        "media": null,
        "permalink": "/r/movies/comments/1j169er/what_are_the_best_revenge_movies/"
    },
    {
        "id": "1j0ujc0",
        "author": "Lets_Go_Why_Not",
        "title": "Best Examples of Bringing an Audience Up to Speed in a Movie",
        "content": "I just finished watching Deepwater Horizon, which is generally fine, but one thing I really appreciated was the way it found to explain what was happening on Deepwater Horizon and what Marky Mark's company did, thus allowing the rest of the movie to be a lot easier to understand from both a technical and political perspective. Basically, an early scene has Marky Mark's young daughter practicing her speech for class on what her Dad does, with a Coke can as a demonstration. \n\nThat got me wondering, in an era where so many movies seem to just plunk two characters down and have them talk about things that they are both already aware of solely for the audience's benefit (\"Wow, I can't believe it's been 5 years since you had that car accident where you lost your young son named Michael, after which your wife left you because she couldn't process her grief, and you moved back in with your estranged father....\"), do you have any other examples where a movie found an elegant or effective way to deliver some complicated backstory or foundational knowledge required to understand the specifics of the story?",
        "upvotes": 670,
        "comments": 380,
        "media": null,
        "permalink": "/r/movies/comments/1j0ujc0/best_examples_of_bringing_an_audience_up_to_speed/"
    },
    {
        "id": "1j0bb00",
        "author": "MarvelsGrantMan136",
        "title": "2025 Razzie Award Winners: 'Madame Web' Wins Worst Picture",
        "content": "",
        "upvotes": 22257,
        "comments": 1327,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TrjA45g8bevmcbEPBwoeUgCorGq1g1AiVG3_kS5o20k.jpg?auto=webp&amp;s=f0bba2d99bbe6bb0d3553ad85720479b94b6aa31"
        },
        "permalink": "/r/movies/comments/1j0bb00/2025_razzie_award_winners_madame_web_wins_worst/"
    },
    {
        "id": "1j15p6d",
        "author": "TinStingray",
        "title": "Looking for \"good versions\" of movies like National Treasure and The Da Vinci Code—historical-conspiracy sort of mystery",
        "content": "I loved The Da Vinci Code and National Treasure as a kid.  I'm not sure they hold up quite as well to my adult eyes, but I still like the general vibe—a historical mystery with roots going back centuries, secret groups of people, etc.\n\nWhat other movies are like that, but maybe a little more acclaimed?",
        "upvotes": 94,
        "comments": 141,
        "media": null,
        "permalink": "/r/movies/comments/1j15p6d/looking_for_good_versions_of_movies_like_national/"
    },
    {
        "id": "1j0x1ju",
        "author": "Biomilch1",
        "title": "I don’t get Anora",
        "content": "I mean I get the movies story and stuff, but I don’t get why it is so popular and hyped. I personally thought the movie was good, not the 10/10 masterpiece I see people hail it to be. \n\nThe camerawork was incredible, as well as the performances but I thought the story, while dealing with an important topic, was told in an extremely shallow way. I couldn’t connect to any of the characters and didn’t feel much during the entire movie. The only time I really thought „yeah this is great storytelling“ was that last scene in the car. \n\nSo if anyone who really really loves Anora would explain to me why you do I‘d greatly appreciate it.",
        "upvotes": 300,
        "comments": 246,
        "media": null,
        "permalink": "/r/movies/comments/1j0x1ju/i_dont_get_anora/"
    },
    {
        "id": "1j0wnp2",
        "author": "DemiFiendRSA",
        "title": "Poster for 'Demon Slayer: Kimetsu no Yaiba Infinity Castle Chapter 1'",
        "content": "",
        "upvotes": 226,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1ms6vl8w22me1.jpeg?auto=webp&amp;s=fc913e982e5c8c5996cd0964efd4c3bf9a377c40"
        },
        "permalink": "/r/movies/comments/1j0wnp2/poster_for_demon_slayer_kimetsu_no_yaiba_infinity/"
    },
    {
        "id": "1j0jy41",
        "author": "DemiFiendRSA",
        "title": "First image of June Squibb in Scarlett Johansson’s directorial debut ‘Eleanor the Great’ - The story follows a 90-year-old woman trying to rebuild her life after the death of her best friend. As a result, she moves back to New York City after living in Florida for decades.",
        "content": "",
        "upvotes": 1957,
        "comments": 67,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/d6da21exfyle1.jpeg?auto=webp&amp;s=9714c92e5f13f995148cf35032bfdd7970b32f64"
        },
        "permalink": "/r/movies/comments/1j0jy41/first_image_of_june_squibb_in_scarlett_johanssons/"
    },
    {
        "id": "1j0ppbt",
        "author": "um_yeahok",
        "title": "\"Why you flanking me?\" What films and tv shows hit with the intensity of this scene from Wind River?",
        "content": "I'm an avid movie/tv junky and have been since my teen years in the 80's'.\n\nThere are a number of films that i rewatch, usually about once a year, and a few weeks ago I watched **Wind River** (2017) and it still impresses me as such a great film. I was thinking about other films and tv shows that have intense scenes like the flanking scene, and came up with a few. I'm posting to see what ya'll can add to my small list so far.\n\n**13 Hours: The Secret Soldiers of Benghazi** (2016)  \n\\- I'm watching this right now and the movie manages to maintain such intensity throughout, i just love it.\n\n**Sicario** (2015)  \n\\- The border crossing scene is so great.\n\n**Heat** (1995)  \n\\- I haven't rewatched in a while, but i do remember the big shoot-out scene as being pretty intense. It's time for a rewatch i think.\n\n**Bone Tomahawk** (2015)  \n\\- I don't want to spoil anything for those that haven't seen it, but my recommendation if you have not is to go in blind and not read anything about it. It's just a great film.\n\n**The Revenant** (2015)  \n\\- The bear attack is pretty riveting. The entire movie is pretty intense and a bit depressing, but i do like that there is a bit of justice in the end.\n\n**Saving Private Ryan** (1998)  \n\\- The Knife kill scene is etched in my memory for all time.\n\nI will also mention **Black Hawk Down** (2001) and **Band of Brothers** (2001) which both have many such scenes, too many to list here. Also time for a rewatch i thinks.",
        "upvotes": 748,
        "comments": 227,
        "media": null,
        "permalink": "/r/movies/comments/1j0ppbt/why_you_flanking_me_what_films_and_tv_shows_hit/"
    },
    {
        "id": "1j1dayc",
        "author": "BunyipPouch",
        "title": "Upcoming /r/movies AMAs/Q&amp;As",
        "content": "",
        "upvotes": 14,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ery8ipyq06me1.png?auto=webp&amp;s=a558d3b75e7f73bf4c89f62b1719d32f4216a92d"
        },
        "permalink": "/r/movies/comments/1j1dayc/upcoming_rmovies_amasqas/"
    },
    {
        "id": "1j0mpkw",
        "author": "Tall_Ant9568",
        "title": "In the Kingdom of Heaven (2005) Director’s Cut, the priest at the beginning who buried Balian’s wife and steals her necklace is actually his brother. This and other vastly important details are left out of the theatrical edition to make the movie short enough for viewers.",
        "content": "The original movie was cut greatly to appease Fox for standard viewers. The movie may as well be two different films. Ridley Scott’s Director’s cut has clarity, pace, and depth. The theatrical edition is a hack and slash film cut to have a start and an end. I recommend the first if you want to be on the edge of your seat for 3 hours! \n\nOther missing details: \n\n\n&gt;!Balian and his wife lost a baby in the beginning, she killed herself because of it, Balian was placed in custody for madness in his grief. He burned the baby’s unfinished shirt she had been sewing before killing his brother in a rage. This shows why he felt he had nothing left and went on the crusade. Also, Balian had other family in the crusades, including his uncles! His father’s backstory is further discussed and there is an entire plot about Sybilla and her son being king Baldwin that is left out!&lt;",
        "upvotes": 998,
        "comments": 124,
        "media": null,
        "permalink": "/r/movies/comments/1j0mpkw/in_the_kingdom_of_heaven_2005_directors_cut_the/"
    },
    {
        "id": "1j0jjf5",
        "author": "Oldschoolhollywood",
        "title": "The Parenting - Official Trailer - MAX",
        "content": "",
        "upvotes": 1311,
        "comments": 105,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6tPUnbZIZEMaEyL-x2fSXXQ2esOfiaETHHdIhXCHqsc.jpg?auto=webp&amp;s=2bdb2fbce0e59582a19f00abf6ccf375ac1fda9c"
        },
        "permalink": "/r/movies/comments/1j0jjf5/the_parenting_official_trailer_max/"
    },
    {
        "id": "1j0kuzm",
        "author": "AKL_wino",
        "title": "‘I spent 12 hours a day for 16 months with Gene Hackman – but never met him’: The Conversation’s Walter Murch pays tribute",
        "content": "",
        "upvotes": 992,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/334_IPtoMb5iw5zM8LAHSQrHSqvvxzumlucDuAn9UDQ.jpg?auto=webp&amp;s=d46bc4bdc82fdb2afc941d41bd435958926853e1"
        },
        "permalink": "/r/movies/comments/1j0kuzm/i_spent_12_hours_a_day_for_16_months_with_gene/"
    },
    {
        "id": "1j1bkcu",
        "author": "LordOfTheFishFingers",
        "title": "Non-central Love Triangles In Old Movies",
        "content": "I recently finished watching Butch Cassidy and The Sundance Kid. It was the third older movie that I've seen semi-recently, where two central (male) characters share a love interest or are somehow romantically linked to the same (female) character. The two other movies are Deer Hunter and Lonely Are The Brave. In all of these titless this is depicted as not that big of a deal and is never a central event or point of conflict in the movie. Especially in Butch Cassidy and The Sundance Kid the two male protagonists seem to be into the same lady quite openly. \n\nSo my question is, why is this theme present in these movies and, especially,  why is it not depicted as that big of a deal? It comes across as somewhat strange as a modern viewer so I was wondering if anone had any insight. I hope I made my point clear and thank you for sharing your thoughts.",
        "upvotes": 9,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1j1bkcu/noncentral_love_triangles_in_old_movies/"
    },
    {
        "id": "1j0l6co",
        "author": "suddenly-scrooge",
        "title": "Ben Stiller on Gene Hackman’s Simple Truth",
        "content": "",
        "upvotes": 577,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bMgyic8nUKHLdHMTRte8pyiPwJW44V7XhNCyJFY0vMA.jpg?auto=webp&amp;s=fe5351da87ba85a3247a66bf51109624c5772369"
        },
        "permalink": "/r/movies/comments/1j0l6co/ben_stiller_on_gene_hackmans_simple_truth/"
    },
    {
        "id": "1j0wtlf",
        "author": "LadyLycanVamp13",
        "title": "I think I am going back to physical media",
        "content": "I just bought the Blu-ray discs for The Substance and Wicked. Because I loved them so much and I want to explore all the special features. Especially in the substance, as I am starting to learn filmmaking after being inspired by it, and how the director seamlessly incorporated elements from her favourite directors.\n\nIn wicked I'm excited for the cast commentary and singalong version.\n\nI will still use streaming services and... *Stuff*... But for my favourite movies and series I'm going to get Blu-rays again wherever possible. \n\nI still have heaps of DVDs that I had to shove into those CD folders. I wish I had cases for them still.\n\nI feel as though streaming was great while it was affordable. And there are heaps of great original stuff on there. But we all complain about the ads now... And I agree... But my main gripe is the lack of special features. Unless it's one of their original shows. And then they can just take stuff away or axe stuff at any time.",
        "upvotes": 38,
        "comments": 44,
        "media": null,
        "permalink": "/r/movies/comments/1j0wtlf/i_think_i_am_going_back_to_physical_media/"
    },
    {
        "id": "1j1di9k",
        "author": "spirited_unicorn_",
        "title": "movies similar to Arrival?",
        "content": "What are some movies similar to Arrival where the main theme of the movie is about not being able to communicate or speak the same language? It doesn’t have to be about aliens and trying to communicate with aliens in a language that is foreign to humans, it could be about people trying to communicate with other humans and not being able to for whatever reason either because they don’t speak one another’s same language or because there are other barriers like maybe health related obstacles or maybe someone or some organization or group of people is blocking the communication or anything like that where the theme is lack of communication and struggle to communicate for whatever reason. Thank you. ",
        "upvotes": 4,
        "comments": 35,
        "media": null,
        "permalink": "/r/movies/comments/1j1di9k/movies_similar_to_arrival/"
    },
    {
        "id": "1j0rblw",
        "author": "uncre8tv",
        "title": "Did 'The Boy Who Could Fly' just wreck anyone else's child mind? Just me?",
        "content": "I was 9 years old when that movie came out, and it was an acid trip before I knew what an acid trip was. The kid could fly. \n\nOf course I also didn't get the metaphor in The Life of Pi (the book) until someone pointed it out to me, so maybe my mind is just too literal for the movie. The visuals of the roof scene haunted me for at least a decade. Just such a weird, weird movie. ",
        "upvotes": 89,
        "comments": 40,
        "media": null,
        "permalink": "/r/movies/comments/1j0rblw/did_the_boy_who_could_fly_just_wreck_anyone_elses/"
    },
    {
        "id": "1j0s7ci",
        "author": "PharaohCleocatra",
        "title": "Movies to watch with my grandma?",
        "content": "I am looking to watch a movie with my grandma, and wondering if people have some good suggestions. Nothing too graphic or violent, she likes movies that are a bit of an easy watch. Nothing too complex in storyline (she’s 85 and can get a bit lost). Nothing too silly either, something that does tug on the heartstrings a bit with good characters, told from a female perspective is nice too. \n\nHere are some examples of movies that she likes:\n- best exotic marigold hotel (2011, 2015)\n- calendar girls (2003)\n - guernsey literary and potato peel pie society (2018)\n- Brooklyn (2015)\n- she liked Downton Abbey (I know it’s a show) \n\nI appreciate all suggestions! I know my nana will be thrilled, and I love spending time with her. She’s 80% deaf now so we watch everything with closed captioning, snuggled close on her couch. I adore her. Thanks for helping bring a smile to her face ◡̈ ",
        "upvotes": 71,
        "comments": 252,
        "media": null,
        "permalink": "/r/movies/comments/1j0s7ci/movies_to_watch_with_my_grandma/"
    },
    {
        "id": "1j0k1bl",
        "author": "KillerCroc1234567",
        "title": "Joseph Wambaugh, Creator of ‘Police Story’ and ‘Onion Field’ Writer, Dies at 88",
        "content": "",
        "upvotes": 235,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/U98DF6l82K-px5F9L3KyrdJOHKtf9BZbIWmXr8g5tJQ.jpg?auto=webp&amp;s=53fd0d20a4fd05b7019f5877456d251ee451996a"
        },
        "permalink": "/r/movies/comments/1j0k1bl/joseph_wambaugh_creator_of_police_story_and_onion/"
    },
    {
        "id": "1j1d4bw",
        "author": "Independent_Egg_1854",
        "title": "Intro theme in Mandy (2018)",
        "content": "I was trying what is  the name of this song that plays in the background when movie starts I was trying to use shazam but I only showed me a remixed version of this(etheral by **i.believe.in.angels)** can anybody help me with that? I loved ost for this movie but this track was not listed sadly. Thanks in advance",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1j1d4bw/intro_theme_in_mandy_2018/"
    },
    {
        "id": "1j14hq1",
        "author": "antantantantantant",
        "title": "Cast Away (2000)",
        "content": "Tom Hanks is the man. This isn’t going to be the first time I write about a movie this year where he is a main character, but this is the movie I think of first when I am asked, “What is your favorite Tom Hanks’ performance?” In this over two hour long movie, there is over an hour in the middle where he is the only character on screen. He only interacts with coconuts, rocks, ice skates, wood, water, and yes, a volleyball named Wilson. Wilson also gives the single greatest performance by an inanimate object of all time. During this over an hour stretch, most of the time I would imagine that a movie would lose the attention of an audience, but with Hanks running the show, everything remains interesting. It’s not all Tom’s doing though; the story holds us in too. I do it - so I imagine others do too - I ask myself, “What would I do in this situation?”, “Why doesn’t Chuck (Tom Hanks’ character) do X, Y, or Z?”, “How is this survivable?”, “Would I go *this* crazy?”, “Would I go even crazier?”. Not only is Cast Away great entertainment, but it can also be seen as a great learning experience.\n\nHow would you survive alone on a deserted island? Cast Away teaches us to be resourceful. One of the nitpicks I have from this movie is that Chuck doesn’t open the last FedEx package that washes ashore. I realize that it is all part of the larger narrative of the story, but really man, if I’m lost at sea, I’m opening everything. Chuck opens up the others though, and he uses the ice skates as cutting tools, and the dress to help him catch fish. He also uses the skates to perform some dental surgery. How he doesn’t get an infection and die is another nitpick, but we can let it pass. The best package he gets contains his new best friend, Wilson the volleyball. Yes, it’s silly at first, but when you really think  about it, loneliness can be the hardest thing to overcome, and using his resourcefulness, he can overcome it by talking to a volleyball. It’s not that much different from when we are kids and interact with stuffed penguin or polar bear toys.\n\nMy favorite sequence in the movie is when he makes fire. After writing out “HELP” in the sand, only to have it washed away by the incoming tides, a little lesson, and then using logs to write his message, he decides to start a signal fire. The ability to control fire is one thing that separates humans from all other species, but it doesn’t mean that we all are knowledgeable on the process of making it. Watching Chuck fail for so long, but keep up the determination to keep going, is inspiring. Never give up. By taking so long to get it going, the film really makes you feel proud of him once he really has it roaring. “Look what I’ve created! I…..have made fire.” Chuck says while puffing out his chest on the beach.\n\nWe all have hardships in our lives. Maybe not lone survivor of a plane crash and lost on an island levels of hardship, but nonetheless, we all have something. When Chuck finally gets home, he has a moment where he explains, “I know what I have to do now. I’ve got to keep breathing because tomorrow the sun will rise. Who knows what the tide could bring?” Life is hard no matter what. Some days are great, some not so great. I currently have a cold, but it won’t last forever. I get depression sometimes, but it also does not last forever. In the moment, it’s hard to remember sometimes that that is the case, but we always must remember that tomorrow the sun will rise, no matter what else happens in the world, this is going to happen. You never know what will come next.\n\nThis leads me to what I believe to be the most creative part of this film's storytelling. Once Chuck gets off the island, he lives happily ever after, right? Well, not really. Turns out his fiancé married his dentist and had a kid. Life moved on without him. Why wouldn’t it? But as Chuck learned on the island, “...keep breathing because tomorrow the sun will rise. Who knows what the tide could bring?” If you’re ever having a hard time, remember this. Keep going, life ahead awaits. There will be ups and downs, but you have to keep going.",
        "upvotes": 5,
        "comments": 16,
        "media": null,
        "permalink": "/r/movies/comments/1j14hq1/cast_away_2000/"
    },
    {
        "id": "1j0gj8p",
        "author": "N1CK_STALK3R",
        "title": "Has Streaming Ruined An Ending's Impact For You?",
        "content": "Wanted to show the gf Before Sunset. One of my favorite movies with one of my favorite endings. First time I saw it I didn't expect it to end like that and absolutely loved it. Tried showing her and right before you realize the movie is ending suddenly the \"next up\" recommendations pop up. Completely distracting and ruined the impact of a beautiful ending. Anyone else had the mood spoiled by streaming and their popups at the end?",
        "upvotes": 292,
        "comments": 88,
        "media": null,
        "permalink": "/r/movies/comments/1j0gj8p/has_streaming_ruined_an_endings_impact_for_you/"
    },
    {
        "id": "1j0ho07",
        "author": "Hi_Im_zack",
        "title": "What are some controversial or even hated casting choices you're not mad at?",
        "content": "This isn't about choices that were initially met with negativity and later praise when the film came out (Heat Ledger). I'm talking casting choices people talk shit about even today but you kinda like\n\nFor me it's easily Scarlett Johansson as the lead in Ghost in a Shell (2017). I think she really channels the vibe of the animation and brought Motoko to life. despite not being Japanese. You can tell she did her homework on the character and it wasn't just an easy paycheck\n\nI'd say her biggest sin was being too big. she quickly became the female face of Hollywood, especially as an action star, aside from Black Widow I think Lucy came out before this and was critically panned. It also doesn't help that this movie wasn't great and didn't live up to the astronomical standards set by the anime. However, Scarjo did live up to it. I'll stand by that.",
        "upvotes": 224,
        "comments": 502,
        "media": null,
        "permalink": "/r/movies/comments/1j0ho07/what_are_some_controversial_or_even_hated_casting/"
    },
    {
        "id": "1j1flzh",
        "author": "fireflydrake",
        "title": "I didn't like Flow.",
        "content": "I apologize if this has already been expressed elsewhere and I'm beating a dead horse. I just finished it and ran to Reddit to scream, but every thread I've seen is, instead, glowing about it. So here I am to be contrarian!   \n\nLook--I love dreamy, surreal, go with the flow type stuff. I loved The Boy and the Heron. I drink that good Ghibli juice all day. Conceptually, this movie could've been giddy good stuff. I love secretary birds, and capybaras, and cats, and dogs, and weird surreal films with beautiful imagery. What's not to love?    \n\nWell, in my opinion. A LOT!   \n\n- I've seen a lot of glowing reviews for the art style. It was pretty, but came off as very \"indie video game cutscene.\" I felt like I was playing Lost Ember on the PS4. A lot of the textures felt kind of... undefined, for lack of a better word. Everything was artsy and pretty but not in a way that felt substantial. There was one scene when our crew first finds some solid land where I thought the water was starting to recede before realizing nope, it was just cutting against the water in a weird way. There's a scene late on where cat backs into a rope and it cuts through their leg. This is still a highly impressive work if it was done by a small studio (which I believe it was), but groundbreaking or award winning? Eh.   \n\n- It felt like the film couldn't decide whether it wanted to be a guided meditation, a spiritual metaphor, or something meant for kids. You have some scenes like the bird ascending that felt like they had deeper meaning, but then you also have pretty on the nose scenes like the lemur giving up material goods or the dog not following his dumb pack mates that felt like they were trying to teach kids simple moral lessons. Great movies can provide lessons for adults AND kids simultaneously; this felt like it veered between tottering on pretentious and \"Aesop's Fables for your young child.\" You also have the cat falling into the water so often that the movie descended into a snooze fest of artificial feeling peril. Stop walking on the edge of the boat, kitty!\n\n- What was that ending?! What?! WHAT?! Again it felt like it wanted to be open for interpretation or what have you, but more than that it felt like it was being intentionally vague just to, like the secretary birds, feel smug and better than you. Arghhh!   \n\nOverall I would've liked it more if it leaned into being more vague and artsy without such obvious moral lessons OR if it had embraced just being a mystical fun for all ages adventure with a lot left for interpretation. Unfortunately for me it feels like it tried to do both and failed to land comfortably in either boat. \n\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1j1flzh/i_didnt_like_flow/"
    },
    {
        "id": "1j1fkhj",
        "author": "nerdybynature",
        "title": "I just started streaming Companion on Amazon and bummed.",
        "content": "Title above and the description of the movie when ordering on Amazon ruins the whole movie. Basically everything is ruined. What woulda been a cool surprise is explained in the description before ordering and all the little details spoil the the movie. I'm not sure I can finish now. Wow. \n\nIf I was the producer of this movie I'd be pissed. So absolutely disrespectful to the watcher. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1j1fkhj/i_just_started_streaming_companion_on_amazon_and/"
    },
    {
        "id": "1j0jesv",
        "author": "sometimesifeellikemu",
        "title": "Going to rewatch “Air Force One” today- what’s your another good 90s action flick?",
        "content": "Perfect movie for a day off. Just sit back and let the score and the hard dialogue wash over you. I’m always wondering what people watch when they reminisce about this era, especially if you saw it in theaters. It really helps if it has one of those strong, thumping music scores that you can recognize from the next room through the walls and that draw you in….",
        "upvotes": 163,
        "comments": 440,
        "media": null,
        "permalink": "/r/movies/comments/1j0jesv/going_to_rewatch_air_force_one_today_whats_your/"
    }
]