[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1lszagc",
        "author": "Apoworld",
        "title": "Ho deciso di trasferirmi fuori città",
        "content": "Voi avete mai considerato di uscire dalla città? \n\nUn po’ di contesto, M32 con famiglia (moglie e due bambini molto piccoli).\n\nNato e cresciuto in città: mi sono trasferito in diversi quartieri (Centro da bambino, poi San Salvario da Adolescente, poi Crocetta e ora da diversi anni risiedo in zona Parco Dora (quartiere che adoro).\n\nAbitando al 13esimo piano, ho la fortuna di vedere tutta Torino dall’alto, e, per la sfortuna invece, di poter scorgere ogni mattina la kappa (non festival purtroppo) di smog che ingloba la città.\n\nHo deciso dunque, un po’ per l’inquinamento (fattore che personalmente mi influenza tantissimo), un po’ per la calura insopportabile d’estate ed un po’ per poter dare uno spazio che non sia il solito appartamento ai bimbi, di trasferirmi.\n\nPer lavoro devo rimanere nelle vicinanze della città: ho dunque preso in considerazione le zone che vedete sulla mappa (le più vicine sopra ai 400m o comunque in rilievo con una buona esposizione). \n\nDopo tantissime perlustrazioni, l’indecisione era forte tra Almese (inizio Val di Susa), Villarbasse (collina Morenica) e Front (inizio Canavese). \n\nAll’ultimo poi è spuntata una casa tra Sciolze e Marentino (collina Torinese, lato alto) e mi sono perdutamente innamorato del contesto, del collegamento con Torino (bretella di Gassino sull’A4 + tangenziale) e della natura che la fa da padrona.\n\nQuindi dopo 32 anni dico addio alla città, aprendo così una nuova fase, tutta nuova della mia (nostra) vita.\n",
        "upvotes": 49,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/13hvsr0zr8bf1.jpeg?auto=webp&amp;s=3e38d926cbac76c9b16689f6e42694b863602fb5"
        },
        "permalink": "/r/torino/comments/1lszagc/ho_deciso_di_trasferirmi_fuori_città/"
    },
    {
        "id": "1lsmtaf",
        "author": "AcousticBassGuitar",
        "title": "Una bella giornata, una cima e una paperella molto piccola che vuole mangiarsela",
        "content": "il Paperoide ",
        "upvotes": 39,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/dfuukpng15bf1.jpeg?auto=webp&amp;s=4cd7513948496f362abd25dd10a66135c11ddca4"
        },
        "permalink": "/r/torino/comments/1lsmtaf/una_bella_giornata_una_cima_e_una_paperella_molto/"
    },
    {
        "id": "1lsympr",
        "author": "BobbyBubble777",
        "title": "Mercati",
        "content": "Salve, quali mercati alimentari sono aperti dal lunedì al venerdì nel centro di Torino ? Passiamo la settimana a Torino e vorremmo pranzare con prodotti freschi e locali. Grazie.",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1lsympr/mercati/"
    },
    {
        "id": "1lszqiy",
        "author": "DependentPost9445",
        "title": "Zaino per viaggio in Norvegia",
        "content": "Ciao, dovrò fare un viaggio in Norvegia questa estate, spostandomi con i treni. Devo comprare uno zaino da Backpacking sui 60 L. Conoscete qualche negozio che offre un buon assortimento per questa tipologia di zaini (al netto dei vari decathlon/cisalfa).\nGracias\n",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1lszqiy/zaino_per_viaggio_in_norvegia/"
    },
    {
        "id": "1lsxn0e",
        "author": "Confident-Art-8800",
        "title": "Bei posti dove festeggiare una laurea",
        "content": "Ciao ragazzi,\nSono il tizio del posto in cui portare la propria ragazza a ristorante. Visto il successo del ristorante  e della serata, ora vuole chiedere a Reddit posti molto bellini dove festeggiare una laurea.\n\nL’unico criterio è che siano zona Valentino \n\nGrazi a tutti ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lsxn0e/bei_posti_dove_festeggiare_una_laurea/"
    },
    {
        "id": "1lsjx53",
        "author": "allexj",
        "title": "Torinesi, si pronuncia \"toret\" o \"turet\"",
        "content": "",
        "upvotes": 11,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1lsjx53/torinesi_si_pronuncia_toret_o_turet/"
    },
    {
        "id": "1lswbzf",
        "author": "Cira94",
        "title": "Palestre poco affollate",
        "content": "Buongiorno vorrei consigli per palestre poco affollate in orario di punta avete consigli? \nAnni fa frequentavo Anytime Fitness in via Bogino ed era perfetta, so che ha aperto anche in zona Lancia avete info? L'unica cosa che ho sentito è che costa 75 euro al mese e per quel prezzo di va alla Virgin no?\n\nZona preferibilmente non troppo lontana dal centro ma mi posso spostare",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1lswbzf/palestre_poco_affollate/"
    },
    {
        "id": "1lsj9su",
        "author": "AcousticBassGuitar",
        "title": "Amo i miei ricircoli d’aria minimi orari",
        "content": "",
        "upvotes": 9,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/te8zpxx184bf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/torino/comments/1lsj9su/amo_i_miei_ricircoli_daria_minimi_orari/"
    },
    {
        "id": "1lslq0r",
        "author": "emiliooow",
        "title": "Kappa futur festival",
        "content": "Vorrei prendere i biglietti in rivendita per la domenica da gente su instagram/telefram, ecc..sapete se esiste un modo per confermare che i biglietti siano veri?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1lslq0r/kappa_futur_festival/"
    },
    {
        "id": "1ls87tk",
        "author": "DirectInteraction825",
        "title": "Luoghi dove poter fare smart working",
        "content": "Tra poco inizierò a fare smart working e vorrei trovare un posto comodo dove poter parlare (a volte mi chiamano o devo fare meeting, quindi no biblioteche o posti silenziosi), siccome a casa d’estate non ci voglio stare. Suggerimenti? ",
        "upvotes": 13,
        "comments": 27,
        "media": null,
        "permalink": "/r/torino/comments/1ls87tk/luoghi_dove_poter_fare_smart_working/"
    },
    {
        "id": "1lsjx5v",
        "author": "allexj",
        "title": "Torinesi, si pronuncia \"toret\" o \"turet\"",
        "content": "",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1lsjx5v/torinesi_si_pronuncia_toret_o_turet/"
    },
    {
        "id": "1lsnjlk",
        "author": "Vandumurugan007",
        "title": "Festa del laurea",
        "content": "Ciao tutti. Mi laureo tra poco e vorrei festeggiare con i miei amici. Quindi cerco un posto dove ci possiamo festeggiare tranquilamente, mangiando, bevendo, tipo un aperitivo. Ma non posso spendere tanto, cioè, forse 10€ una testa, e siamo in 20. Conoscete i posti vicino Poli così? Grazie✨\nP.S - Non sono Italiano, sono un studente internazionale, quindi vi chiedo scusa se sbaglio con la lingua, sto ancora imparando l'italiano.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lsnjlk/festa_del_laurea/"
    },
    {
        "id": "1ls6iho",
        "author": "Murky_Giraffe8700",
        "title": "Vivere in Campidoglio, Torino",
        "content": "Sto cercando casa in affitto e mi interessa Campidoglio e dintorni. Ho visto che è una zona popolare abbastanza tranquilla ma colegata\n\nProprio questa zona\n\nhttps://preview.redd.it/4xh5arpf51bf1.png?width=1093&amp;format=png&amp;auto=webp&amp;s=83d508a3d4114672f58ea9dab36c53e4d822299d\n\nCom’è davvero viverci? È sicura? Rumorosa? Vale la pena rispetto ad altre zone tipo Cit Turin o San Donato?",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1ls6iho/vivere_in_campidoglio_torino/"
    },
    {
        "id": "1lsc4ot",
        "author": "Bulky-Sink8917",
        "title": "Alloggio a Torino per laurea magistrale",
        "content": "Salve a tutti, ho intenzione di iniziare a settembre una laurea magistrale a Torino come fuori sede ed ho quindi in programma di trasferirmi. Forse potrei risultare assegnatario di un alloggio universitario, avete consigli al riguardo? Com’è alleggiare in una residenza universitaria? Ci sono regole stringenti? Quali dormitori consigliate (considerando che la magistrale che vorrei fare è ingegneristica e non so dove si svolgano le lezioni)? È forse meglio cercare un alloggio in maniera autonoma evitando quelli universitari? Qualsiasi consiglio, anche relativo alla città/università è ben accetto!",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1lsc4ot/alloggio_a_torino_per_laurea_magistrale/"
    },
    {
        "id": "1ls5qco",
        "author": "Interesting_Cry1672",
        "title": "Corsi motocross",
        "content": "Ciao, qualcuno di voi ha esperienza con corsi di motocross in zona da raccomandare, anche per gente più anziana? Mi piacerebbe provare, ho 32 anni.",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1ls5qco/corsi_motocross/"
    },
    {
        "id": "1lrr75i",
        "author": "Fancy_Explorer_43",
        "title": "amici in fitactive corso svizzera",
        "content": "mi sono appena trasferito e son sempre da solo ad allenarmi :(\nqualche bro per farmi compagnia? offro sorsi di monster e magari una j ",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1lrr75i/amici_in_fitactive_corso_svizzera/"
    },
    {
        "id": "1ls3jbt",
        "author": "borisbanana77",
        "title": "Cerco Cafè Locale",
        "content": "\nCiao tutti!\nCerco una torrefazione locale da cui acquistare il caffè.\n\nConosco Orso (a San Salvation) e San Domenico (la Bottega è  Palazzo Carignano, da Susa).\n\nSe non si tratta di un caffè prodotto localmente, un negozio con un buon caffè a prezzi ragionevoli potrebbe essere una buona idea.\n\n\nHo diversi tipi di macchine da caffè, ma uso principalmente una macchina per espresso manuale a livello.",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1ls3jbt/cerco_cafè_locale/"
    },
    {
        "id": "1lrxwe8",
        "author": "Usual_Ad8650",
        "title": "Torino.",
        "content": "",
        "upvotes": 2,
        "comments": 19,
        "media": null,
        "permalink": "/r/torino/comments/1lrxwe8/torino/"
    },
    {
        "id": "1lre9hq",
        "author": "ArtistaFortunato",
        "title": "Torino nuova Milano, sento dire un po' ovunque",
        "content": "Ciao a tutti, io non sono torinese ma ho zii a Torino e sono andato lì col mio ragazzo, innamoratissimo (soprattutto perché mi ricorda la mia infanzia in Sicilia) da qualche anno a questa parte pensavo di comprare casa lì più avanti, ma da circa due anni vedo le case salire come folli, fino a due anni fa potevo permettermi quartieri come crocetta, ho visto ora e me lo sogno, ora non più e vedo online video che parlano di come \"Torino è la nuova Milano\" e quando parlo di Torino qui in veneto (dove sono adesso) mi dicono tutti che diventerà la nuova milano",
        "upvotes": 12,
        "comments": 101,
        "media": null,
        "permalink": "/r/torino/comments/1lre9hq/torino_nuova_milano_sento_dire_un_po_ovunque/"
    },
    {
        "id": "1lricn5",
        "author": "Impossible_Big3207",
        "title": "suggerimento per le giornate calde",
        "content": "Ciao a tutti, cosa fate in queste giornate calde? Sono uno straniero che ha sempre avuto l'aria condizionata per tutta l'estate e non sopporto più questo caldo. Avete qualche consiglio? C'è un posto con l'aria condizionata dove posso andare a stare per studiare e lavorare?",
        "upvotes": 6,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1lricn5/suggerimento_per_le_giornate_calde/"
    },
    {
        "id": "1lrgyrm",
        "author": "syosetsu02",
        "title": "IELTS",
        "content": "Qualcuno sa dove si possono fare mock exam IELTS per avere una valutazione oggettiva prima di fare il test definitivo?\n(se possibile non un corso, ma solo un test con valutazione)",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lrgyrm/ielts/"
    },
    {
        "id": "1lrn92q",
        "author": "Local_Repair_6787",
        "title": "Gin particolari?",
        "content": "Buonasera, conoscete negozi che hanno una buona varietà di bottiglie di gin? Magari artigianali, di nicchia ecc ecc...  \nGrazie in anticipo per qualsiasi consiglio :)",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1lrn92q/gin_particolari/"
    },
    {
        "id": "1lrl4f4",
        "author": "Alarming-Sand-4555",
        "title": "Prezzo delle 2002-2003",
        "content": "Ciao vorrei sapere le case quando costavano nel 2002 e 2003 ",
        "upvotes": 0,
        "comments": 30,
        "media": null,
        "permalink": "/r/torino/comments/1lrl4f4/prezzo_delle_20022003/"
    },
    {
        "id": "1lr0rd9",
        "author": "Renzo_Candido",
        "title": "AAA Cercasi giocatori di Magic (Pauper)",
        "content": "Ciao a tutti!\n\nSono mesi che vorrei iniziare a giocare a Magic cartaceo (ho giocato per un po' su Arena, ma essendo amante dei giochi da tavolo volevo provare a giocare dal vivo) ma non conosco nessuno che già ci giochi e ai miei amici non interessano molto i tcg. \n\nSo che ci sono vari locali a Torino (Jolly joker, Magic Lair ecc) che organizzano tornei, ma iniziare diretto con dei tornei competitivi non mi sembra il caso (conosco le regole ma sono abbastanza un neofita). \n\nErgo - c'è qualcuno che vorrebbe organizzarsi/qualche gruppo che già frequenta questi posti e vuole espandere il proprio pool di giocatori? Preferirei pauper perchè qualche tempo fa mi ero già costruito un mazzo pauper (per non giocarci mai).\n\nPer rompere gli stereotipi sono un nerd di 27 anni ma giuro che mi lavo e so stare in società.",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1lr0rd9/aaa_cercasi_giocatori_di_magic_pauper/"
    },
    {
        "id": "1lqoho3",
        "author": "Intelligent-Deal-759",
        "title": "Personale riflessione sul concerto dei Tamango del 28/06",
        "content": "Non sono solito scrivere recensioni di concerti e, a dirla tutta, non credo nemmeno di esserne capace. Tuttavia, al concerto dei Tamango dello scorso 28 giugno ho avuto occasione di respirare un’energia particolare, e vorrei ascoltare altri punti di vista.  \n  \n**Smosso** dal fatto che su instagram e tiktok ho trovato solo recensioni entusiaste, prive della minima sfumatura critica. Questo mi ha lasciato un dubbio: sono io che non capisco nulla o siamo sempre più immersi in una bulimia produttiva, musicale e artistica, dominata dall’ego, dall’autoreferenzialità e dall’ostentazione culturale?\n\n  \nL’evento, è graficamente bellissimo. Sito originale. Indicazioni per raggiungere il luogo precise e chiare. La comunicazione, soprattutto sui social, originale e con un tocco teatrale che in Italia raramente si vede. Una ventata di creatività e stile che aveva alimentato le aspettative.  \n  \nIl concerto si è svolto a Pino Torinese, in un campo da calcio dilettantistico. Scelta simpatica, che strizzava l’occhio al “sogno stadio”, pur restando con i piedi ben piantati nella dimensione del gruppo.\n\nSi parte intorno alle 21:40, con un’introduzione poetica e originale che, ahimè, ha già messo in luce il primo grande problema della serata: il **sound**. Il volume della voce era mal calibrato, spesso impastato nella base musicale (questo vale quasi per tutto il concerto). Nei momenti di silenzio o transizione tra un brano e l’altro si percepiva un fastidioso rumore di fondo.   \nLa qualità del suono degli strumenti soprattutto nelle prime file, lasciava a desiderare, rendendo faticoso seguire le canzoni.\n\nDurante il concerto presentano prevalentemente brani nuovi, alternati a momenti più teatrali. A ogni canzone corrispondeva un cambio d’abito del frontman, che sembrava più interessato a ostentare la propria poliedricità (o presunta tale) che a cantare.  \nEsempio: “Guardate, indosso la gonna, sono anticonformista!”, o “Ecco il taglio alla Taxi Drive, sono un cazzo di ribelle!”\n\nPeccato che il canto non arrivasse al pubblico.\n\nIl concerto è durato circa tre ore. TRE ORE. TRE. ORE.  \nTre ore confuse, sfilacciate, senza un reale filo conduttore. Tranne in due sporadiche canzoni, il gruppo non è mai riuscito a creare un vero legame col pubblico. Quando finalmente sembrava che il feeling stesse per nascere, il cantante si è messo a fare il buffone, spezzando la magia e riportando il tutto a un livello amatoriale, se non proprio dilettantesco.\n\n Più che un concerto, è sembrata la classica recita di fine anno di quinta elementare, condita da qualche loro canzone famosa che giustifica l’incasso del biglietto e la sottrazione di oltre quattro ore di vita ai presenti.\n\nE a proposito di organizzazione: 600 persone (o forse 800 o forse 1000 non so) e solo due banconi per la birra. Le code oscillavano tra i 20 e i 40 minuti (DURANTE IL CONCERTO), per poi ricevere una birra già sgasata, preparata a slot, che somigliava al mio piscio.\n\nUn concerto che ha lasciato più interrogativi che emozioni. Un accumulo o, per meglio dire, un cumulo di messaggi, canzoni, oggetti, outfit, suoni e presunzione, difficile da digerire.\n\n \n\nCi tengo a precisare che la critica riguarda esclusivamente l'evento in sé e riflette un punto di vista personale. Rimane fuori discussione che il gruppo torinese abbia un potenziale altissimo e continui a dimostrarsi un ottimo creatore di canzoni.",
        "upvotes": 16,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lqoho3/personale_riflessione_sul_concerto_dei_tamango/"
    },
    {
        "id": "1lqyw2p",
        "author": "Individual-Cow-4422",
        "title": "Posti carini primo appuntamento",
        "content": "Ciao ragazzi, mi consigliate qualche posto carino per un primo appuntamento (aperitivo) \nZona centro (Via Roma, Piazza San Carlo, ecc) \n\nSi lo so che il primo appuntamento si può fare anche dal kebabbaro sotto casa e che non è tanto il luogo ma la persona e il momento che condivi, però comunque vorrei trovare un posto carino",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1lqyw2p/posti_carini_primo_appuntamento/"
    },
    {
        "id": "1lqufnz",
        "author": "ArtistaFortunato",
        "title": "Via alberata in centro o vicino al centro, con poche o nessuna auto, perdonabile (con il marciapiede fra alberi e case)",
        "content": "Top se case basse ma a Torino è chiedere la luna",
        "upvotes": 6,
        "comments": 34,
        "media": null,
        "permalink": "/r/torino/comments/1lqufnz/via_alberata_in_centro_o_vicino_al_centro_con/"
    },
    {
        "id": "1lqmf93",
        "author": "Confident-Art-8800",
        "title": "Ristoranti a Torino dove portare la propria ragazza",
        "content": "Ciao a tutti torinesi,\nSto cercando un posto a Torino dove mangiare qualcosa di buono ma che abbia anche un’atmosfera super carina per portare la propria ragazza. Magari qualche cortile interno con le lucine appese o simili.\n\nVi viene niente in mente?",
        "upvotes": 13,
        "comments": 37,
        "media": null,
        "permalink": "/r/torino/comments/1lqmf93/ristoranti_a_torino_dove_portare_la_propria/"
    },
    {
        "id": "1lqv90o",
        "author": "NearTheLoris",
        "title": "Nuove conoscenze",
        "content": "Ciao a tutti, sono un ragazzo di 22 anni e vivo a Torino e ho origine latine. Mi piacerebbe conoscere nuove persone (sia ragazzi che ragazze) e fare amicizia specialmente se hanno le mie stesse passioni e gusti. Sono appassionato di anime, manwha,musica e videogiochi e attualmente sto entrando anche nel mondo dei giochi di ruolo come D&amp;D. ",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1lqv90o/nuove_conoscenze/"
    },
    {
        "id": "1lqv5jy",
        "author": "blinx00",
        "title": "Persone interessate ai musei",
        "content": "Salve, cerco persone interessate a visitare i musei in compagnia, essendo io un ragazzo di 21 anni indicativamente cerco persone intorno ai 18/28 anni, se chi sta leggendo è interessato mi faccia sapere ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lqv5jy/persone_interessate_ai_musei/"
    }
]