[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 485,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1hvlmba",
        "author": "EthanWilliams_TG",
        "title": "Watch Hulk Hogan Get Booed by Fans During WWE's Netflix Debut",
        "content": "",
        "upvotes": 1098,
        "comments": 239,
        "media": null,
        "permalink": "/r/netflix/comments/1hvlmba/watch_hulk_hogan_get_booed_by_fans_during_wwes/"
    },
    {
        "id": "1hvtr13",
        "author": "anonymous-user1234",
        "title": "Why wasn't Steve Wilkos brought up on Netflix Jerry Springer documentary?",
        "content": "Title says it all. Just finished the Netlix documentary and not sure why such an integral aspect and figurehead of the show wasn't mentioned once. Weird. ",
        "upvotes": 8,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hvtr13/why_wasnt_steve_wilkos_brought_up_on_netflix/"
    },
    {
        "id": "1hvp43v",
        "author": "MonkeyTacoBreath",
        "title": "So this may just be a personal pet peeve, but the show/movie playing when you just want to read the description bugs the heck out of me.",
        "content": "My main issue is that because the show/movie started playing as I read the description, even if I back out 3 seconds later, that title is now in my continue watching tab. And I have to manually go remove it. \n\nI have auto play trailers and shows turned off. This happens on all platforms that I have access to, Xbox, PC, and Android.\n\nAnyone else get bugged by this \"feature\" or some other pet peeve?",
        "upvotes": 16,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hvp43v/so_this_may_just_be_a_personal_pet_peeve_but_the/"
    },
    {
        "id": "1hvt0cj",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix’s Terrifying German AI Horror Show 'Cassandra' sets February 6 release date and showcases new teaser",
        "content": "",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hvt0cj/netflixs_terrifying_german_ai_horror_show/"
    },
    {
        "id": "1hvmdi7",
        "author": "Robemilak",
        "title": "Hwang Dong-hyuk praises T.O.P's performance in ‘SQUID GAME’ Season 2 after the actor got no work in the Korean entertainment industry for 9 years after he was arrested for smoking weed. ",
        "content": "",
        "upvotes": 18,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hvmdi7/hwang_donghyuk_praises_tops_performance_in_squid/"
    },
    {
        "id": "1hvvtl5",
        "author": "daily_mirror",
        "title": "Netflix's Squid Game fans debunk viral theory linking Front Man to surprise character",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hvvtl5/netflixs_squid_game_fans_debunk_viral_theory/"
    },
    {
        "id": "1hvndtt",
        "author": "RedditM0ds",
        "title": "Squid Game 2 &gt; Squid Game",
        "content": "Yes the original was good! But this second one really floored me! So much witty editing and camera work. Really fantastic cast. Everything turned on its side, and very tastefully, naturally. A deconstruction that isn’t hamfisted!  Also really great character stuff in 2. If anything I wish there was more resolution to the shootas on the boat (knew it was the Captain immediately lol). But I am looking forward to seeing the third season! I like that it leaves you feeling a bit neurotic about what comes next. And I think it will age incredibly well. What an incredible job that this crew did! Also, visually very fun / horrifying to watch unfold. \nThe games appear extra cold, sterile and sinister. \n\nI really haven’t seen editing this sharp since S6 of Sopranos. It’s like a character in its own right. \n\nI am sure this season will hit a lot harder upon rewatches! I implore those of you somewhat dissatisfied to give it another try before this summer.",
        "upvotes": 7,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hvndtt/squid_game_2_squid_game/"
    },
    {
        "id": "1hvhytx",
        "author": "DontWanaReadiT",
        "title": "Anyone watching The Later Daters??",
        "content": "I’m only 31 but I’m finding this show so incredibly refreshing!! It feels so real, authentic but also I’m learning a lot of things about myself just by watching this. This is light years better than any other dating show for people my age and younger. These adults know what they want and aren’t afraid of being vulnerable like they used to be when younger. ",
        "upvotes": 16,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1hvhytx/anyone_watching_the_later_daters/"
    },
    {
        "id": "1hvshpq",
        "author": "South_Drawer_9551",
        "title": "Weird Issue with Netflix",
        "content": "There's this weird issue I am having with Netflix (desktop and mobile). On my profile, it shows only season 2 of ninjago dragons rising, but on my sister's profile it shows both seasons.\n\nBoth are in the same region (US) and under the same account.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hvshpq/weird_issue_with_netflix/"
    },
    {
        "id": "1hvo702",
        "author": "Robemilak",
        "title": "Medical Drama ‘The Trauma Code: Heroes on Call’ Gets a Teaser: Releasing January 24",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hvo702/medical_drama_the_trauma_code_heroes_on_call_gets/"
    },
    {
        "id": "1hvjqq2",
        "author": "retlem",
        "title": "Commercials firming RAW on Netflix",
        "content": "Anyone catch RAW on Netflix tonight? I’m wondering how it was for the people that have the Netflix plan with ads and if it was overkill. \n\nWhat’s your thoughts on the advertisements on a paid platform?\n\nEdit: the title should say “Commercials during RAW on Netflix”. Autocorrect won this time. ",
        "upvotes": 5,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1hvjqq2/commercials_firming_raw_on_netflix/"
    },
    {
        "id": "1hvhm8l",
        "author": "OkieDokie-Artichokey",
        "title": "What should I watch right now?",
        "content": "Movie or TV show. Preferably in english. If TV, preferably not a ton of seasons.\n\nOpen to either a drama or something chill/funny. I appreciate good acting.\n\nBut also feel free to stray from the parameters and recommend whatever if you think it's really good.\n\nThanks!",
        "upvotes": 5,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1hvhm8l/what_should_i_watch_right_now/"
    },
    {
        "id": "1hvqyvv",
        "author": "shapy_d_livery",
        "title": " Help! Why Does Netflix Pause When Skipping",
        "content": "I'm having an issue with Netflix on my MacBook when using Safari. Whenever I press the forward or backward buttons to skip ahead or rewind, the video pauses instead of playing smoothly. I have to press play again manually every time, which is super annoying.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hvqyvv/help_why_does_netflix_pause_when_skipping/"
    },
    {
        "id": "1hvfhbu",
        "author": "Corey0619",
        "title": "Korean Show from 2020 name?",
        "content": "I’m trying to find a super interesting show I saw a few years ago. It was a Korean show (I believe) about a guy that would meet with the most dangerous people in the world and chat with them over some food. \n\nOne episode he went to a really dangerous place and ended up attending a dinner with all the mafia leaders of the area\nIt was called something like “Super soup time” or something silly\n\nBonus tidbit. Gus from the rooster teeth podcast mentioned it once around 2020. \n\nPlease help me find this amazing show again Reddit 🥲\n\nUPDATE\nOmg I found it. It’s called “Hyper HardBoiled Gourmet Report”. Unfortunately isn’t on USA Netflix anymore. The documentarians pretend to film a food show in order to meet extremely dangerous people around the world. It’s so good. Thank y’all for the help and suggestions for similar shows! ",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hvfhbu/korean_show_from_2020_name/"
    },
    {
        "id": "1hvoew2",
        "author": "WhyThaFuck",
        "title": "Standard with ads",
        "content": "Hi, guys i wanna get back on netflix again but i have a question does anyone use the standard with ads sub? Its say \"ads: less then you might think\" so i was wondering how many ads does 1 ep or 1hr movie have?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hvoew2/standard_with_ads/"
    },
    {
        "id": "1hvnae8",
        "author": "Objectionne",
        "title": "Does anybody know how long it typically takes for live events to become downloadable on Netflix?",
        "content": "WWE RAW and Smackdown are now streaming live on Netflix every week, but as they air at 2am in my country I'm never going to be watching them live.\n\nI was hoping to be able to download them on the mobile app first thing in the morning and then watch while I take my usual morning walk, but unfortunately I found this morning when I went to download RAW that it seems that live events aren't downloadable right away.\n\nI've checked other live events though (such as the Netflix Slam) and seen that they're downloadable, so I assume that live events become downloadable *eventually* and there's just a delay.\n\nDoes anybody have an idea of how long it typically takes live events to become downloadable?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hvnae8/does_anybody_know_how_long_it_typically_takes_for/"
    },
    {
        "id": "1hvn24h",
        "author": "UnbasedDoge",
        "title": "Civilization VI (Netflix) incompatible on my device ",
        "content": "Hello everyone! As the title states: Civ VI seems to be incompatible with my device. However, the non Netflix version seems to work fine. How do I manage to download it without having to sideload? I don't want to install the APK and put my Netflix credentials on an untrustworthy APK found online. \n\nThanks in advance!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hvn24h/civilization_vi_netflix_incompatible_on_my_device/"
    },
    {
        "id": "1hvshgx",
        "author": "golb_",
        "title": "Where are the other netflix content and how to access",
        "content": "Just bought the yearly subscription for netflix for mt smart tv. Most of the show and movies i like arent there, example: dune 2, castlevania etc. Was devastated to find out that the boys and invincible are not on netflix so i just stick to the rest but for some reason its not there too. How yall fix this (if youre facing this problem at all) please 🙏 even some batman movies are missing.",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1hvshgx/where_are_the_other_netflix_content_and_how_to/"
    },
    {
        "id": "1humnmr",
        "author": "Safe-Adhesiveness713",
        "title": "How do I turn my language to English? It randomly turned to this language and I don’t know how to switch it",
        "content": "",
        "upvotes": 300,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1humnmr/how_do_i_turn_my_language_to_english_it_randomly/"
    },
    {
        "id": "1hvm1vn",
        "author": "GoldBurn95",
        "title": "Wwe content ",
        "content": "So tonight i was waiting for raw to start and when i refresh to see if the live was ready, all of wwe content disappeared from my profile. I check another family member profile to see if it was there and it’s showing all the wwe contents that was on mines. I switch back to my one and still the same. I try logging out and log back in and nothing. What the hell is going on? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hvm1vn/wwe_content/"
    },
    {
        "id": "1hvhmt0",
        "author": "The_Firmament",
        "title": "Ads During Live",
        "content": "This is the first time I have checked out a live event on Netflix and the ads are RIDICULOUS. I was prepared for some, I can handle having to deal with them being in there, but the amount is ludicrous. They cut away to them in the middle of the main action, wtf?!\n\nIt's such an egregious attempt to force people to pay via annoying them to death with the ads. Not to mention people in other countries don't get those ads which makes it feel even worse. I don't know if this will be as big a money grab as they think it will or it'll just be a massive deterrent. If this is how it'll always be for lives I don't plan on watching another. ",
        "upvotes": 1,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1hvhmt0/ads_during_live/"
    },
    {
        "id": "1hvl72z",
        "author": "abhilash512",
        "title": "WWE Raw on Netflix: Bold Takeaways from Debut",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hvl72z/wwe_raw_on_netflix_bold_takeaways_from_debut/"
    },
    {
        "id": "1hvo4aa",
        "author": "HyperTech2008",
        "title": "Netflix household not working",
        "content": "I told my friend I had Netflix, and when he asked me to share my account, I couldn’t say no directly. I thought Netflix Household would prevent him from watching anything since I had already set it up. However, when I asked him, he said it was working. I was giving him the OTP instead of sharing the password. Why isn’t Netflix Household blocking him? He lives miles away from my location and has never connected to my Wi-Fi.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hvo4aa/netflix_household_not_working/"
    },
    {
        "id": "1hvgscr",
        "author": "Tongatapu",
        "title": "Netflix keeps reloading or buffering streams every 10/20 seconds (Google gave me no answer)",
        "content": "I've not seen anyone else having this problem. It only happens on my PC, not on my girlfriends PC. \n\nThe buffering bar keeps resetting every 10/20 seconds, leading to the stream loading for a split second every time that happens.\n\nI've turned off every add-on I can, it's still happening. It's like this for at least a month now.\n\nCan anybody help me fix this?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hvgscr/netflix_keeps_reloading_or_buffering_streams/"
    },
    {
        "id": "1hvkina",
        "author": "johnreese421",
        "title": "Squid Game subtitles difference",
        "content": "1. English audio and English CC.\n2. English audio and English.\n3. Korean audio and  English CC.\n4. Korean audio and  English.\n\nIdeally, shouldn't 4 be the ideal one for english viewers to understand the original Korean audio translated directly to english ? so this would mean subtitles of 4th should be same as 2nd. ?\n\nbut I am seeing 1 and 2 as same ...and 3 and 4 as same...and each of it as a group different from other group.\\[meaning 1 &amp; 2 are showing same which together is different from 3 &amp; 4 but 3 &amp; 4 together are same\\].\n\n  \nDo I make sense ? or am I missing something here?\n\nExample Reference : Squid Game season 2 episode 5 timestamp 19:05 to 19.07 dialogue.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hvkina/squid_game_subtitles_difference/"
    },
    {
        "id": "1hvkavu",
        "author": "Brilliant-Ad6881",
        "title": "Am I the only one who thought Zara was right in a Family Affair? ",
        "content": "Like your mom getting with you boss(16yr difference) is inappropriate. I'm watching it now and I'm just infuriated with it. Like I get the message of being understanding of others feelings and realizing people are more than surface level stuff but c'mon it is inappropriate and Zara was right, her mom could have gotten anyone and went for her boss. Then when she confronts her mom and boss about chris having the earrings and stuff(all valid) her mom gets mad. \nThe only person who actually should be mad at Zara in the movie is her friend when Zara didn't ask about the breakup. \nMy goodness this movie sucks and I love joey king but d***",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hvkavu/am_i_the_only_one_who_thought_zara_was_right_in_a/"
    },
    {
        "id": "1hvjpzy",
        "author": "skyerosebuds",
        "title": "I keep falling asleep and losing my place.  Sharing my winning strategy",
        "content": "I don't know if it's just me but I like to watch Netflix in bed and invariably I fall asleep while watching then the next day struggle to find my last conscious and memory-encoding position in the series.  What I'm doing now is taking a screenshot when I first find myself drifting off -  head-nod, woah, where am I moment - ensuring it stores the episode and progress bar.  Then carry on watching, usually pretty soon-after falling asleep. Next day it's easy as to find where I left off from the screenshot.\n\nDon't suppose this will win a Nobel Prize but I've found it handy and hope you might too.  Please no Karens commenting about sleep hygiene, blue light, blah blah blah, don't wanna hear it thanx anyway, heard it all before.  Happy watching/sleeping!",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hvjpzy/i_keep_falling_asleep_and_losing_my_place_sharing/"
    },
    {
        "id": "1hvcie6",
        "author": "mycatiseverywhere",
        "title": "looking for more series with 40+ minute episodes",
        "content": "i’ve already watched sex education, heartbreak high, asoue, anne with an e, gilmore girls, bridgerton, the decameron, and i just finished outlander.  i’m looking for more historical shows but i’m also open to most suggestions (not the crown or ginny and georgia. also not interested in medical dramas.) also, i usually watch tv while eating dinner and/or before bed, so nothing more violent than outlander :)",
        "upvotes": 1,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1hvcie6/looking_for_more_series_with_40_minute_episodes/"
    },
    {
        "id": "1hvgqvv",
        "author": "orange-black-tea",
        "title": "Can’t login to Netflix Germany with US credentials",
        "content": "I am traveling in Germany now and just tried to log in to Netflix Germany with my Netflix US username and password like I used to do every time I went back to Germany. It did not work.\n\nAnd then, I used “send code” option to log in, I was able to log in, but it seemed to just direct me back to Netflix US which didn’t have certain German shows I wanted to watch instead of Netflix Germany. Kinda an odd experience.\n\nI did some research and read that people had similar problems, but those posts did not go into details of what exactly didn’t work. \n\nIs it true that the login credentials are locked to one country/region now and cannot be used to log into other region’s Netflix?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hvgqvv/cant_login_to_netflix_germany_with_us_credentials/"
    },
    {
        "id": "1huy2wc",
        "author": "Whobitmyname",
        "title": "The Sequel to Jean-Claude Van Damme's Revenge Thriller Is Topping Netflix Charts",
        "content": "",
        "upvotes": 12,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1huy2wc/the_sequel_to_jeanclaude_van_dammes_revenge/"
    }
]