[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1m7yfl2",
        "author": "manzworld",
        "title": "Netflix urged to prepare for 'long and messy' Baby Reindeer legal battle\nThe woman who claims to be the real life Martha from the hit Netflix show Baby Reindeer is suing the streaming giant for $170 million, with a pretrial conference taking place",
        "content": "Article - A woman claiming to be the real life Martha from Baby Reindeer [is suing Netflix for $170 million](https://www.themirror.com/entertainment/celebrity-news/baby-reindeers-real-life-martha-524997) and one legal advisor has warned [the streaming giant](https://www.themirror.com/all-about/netflix) to expect a \"long\" court battle.\n\nFiona Harvey [filed a lawsuit against Netflix last year for defamation](https://www.themirror.com/entertainment/golden-globes-netflix-baby-reindeer-882144), intentional infliction of emotional distress, negligence and violation of her right of publicity, according to court documents obtained by The Mirror US. She alleged Netflix \"created an easily accessible road map to allow viewers to track her down in real life and connect the dots to her identity.\" In the show, the character Martha is played by Jessica Gunning.\n\nHarvey claimed she was \"tormented\" after [the show, in which she isn't named](https://www.themirror.com/entertainment/celebrity-news/baby-reindeers-richard-gadd-issues-462748), was released. She said she suffers from \"anxiety, nightmares, panic attacks, shame, depression, nervousness, stomach pains, loss of appetite and fear, extreme stress and sickness,\" according to the court documents. She's seeking $170 million in damages.\n\nA pretrial conference will be taking place in regards to the case today. Legal advisor James Pipe has spoken to The Mirror US and shared what he thinks Netflix could expect as the case begins.\n\nPipe told us, \"This lawsuit between Fiona Harvey and Netflix is already making headlines, and honestly, it's got all the ingredients of a long, messy legal battle. Harvey is suing for $170 million, claiming Baby Reindeer is basically a version of her life, and that Netflix defamed her, violated her privacy, and acted negligently by letting it air. But is she likely to win? That's not so easy to say.\"\n\nHe continued, \"First, she’ll need to prove that viewers could clearly tell she was the inspiration behind the character, and that what was shown was both false and harmful to her reputation. That's a tall order.\"\n\nThe expert explained, \"Netflix hasn't named her, and the show is billed as a dramatized 'true story', meaning some parts are based on real life, but others are fictionalized.\" When suggesting how Netflix will respond, Pipe said they will \"likely lean hard on freedom of speech.\"\n\nHe added, \"They'll argue that the show is protected artistic expression, that names and details were changed, and that no reasonable viewer would assume the character was a 100% accurate portrayal of a real person, especially someone never named.\"\n\nPipe also suggested Harvey might find it difficult to win the negligence parts of her case. \"They'll argue they didn’t act recklessly and took steps to fictionalize the story,\" he said.\n\nThe trial could be a long one, according to Pipe. \"With a claim this size and the level of media attention, we're probably looking at least a year or two before there's any final decision, unless they settle early, which can happen if both sides want to avoid a drawn-out court fight,\" he suggested.\n\nThe expert concluded, \"Bottom line: Harvey has a shot, but Netflix has deep pockets and strong legal arguments. It’s going to come down to whether the court sees this show as storytelling, or something more damaging.\"\n\nBaby Reindeer tells the dramatized story of comedian Richard Gadd's experience of being stalked, with the character Martha ending up with a nine-month jail sentence for her harassment against him. In a statement shared with The Mirror US, Harvey previously said, \"Earlier in 2024, Netflix released a program called 'Baby Reindeer', which they billed and marketed as a 'true story'. One of the two main characters, 'Martha', was clearly intended to be based on me.\"\n\nJames Pipe is a legal advisor who spoke with The Mirror US on behalf of [Free Grants For Felons](https://www.freegrantsforfelons.org).",
        "upvotes": 1301,
        "comments": 173,
        "media": null,
        "permalink": "/r/netflix/comments/1m7yfl2/netflix_urged_to_prepare_for_long_and_messy_baby/"
    },
    {
        "id": "1m8kgjz",
        "author": "Arr0zBlanco",
        "title": "SANDMAN and DEPT Q are must watch shows",
        "content": "Pretty much what the headline reads. Sandman is truly a marvelous production. Tom Sturridge IS Morpheus. Voice, demeanor, everything. The cinematography is gorgeous. \n\nAnd Dept Q—my gosh, I could watch it for just Karl and Akram’s bickering alone🤣🤣 ",
        "upvotes": 31,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m8kgjz/sandman_and_dept_q_are_must_watch_shows/"
    },
    {
        "id": "1m8qnrt",
        "author": "WPJHtx",
        "title": "Help me find a new show to watch",
        "content": "Hey I’m looking for a new show to watch. I really like all American, one tree hill, on my block, never have I ever So teen dramas are kinda what I’m into. Any recommendations will be appreciated \n\nEdit: I really want something with that summer vibe ",
        "upvotes": 6,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1m8qnrt/help_me_find_a_new_show_to_watch/"
    },
    {
        "id": "1m8pu62",
        "author": "DanSnowStark91",
        "title": "I wanna talk about the hunters wife",
        "content": "What’s everybody opinion on that show? If you watched it I thought it was really good. The show hooked me right from the first episode with the mystery element. But I thought the acting was great all across-the-board the two main leads were amazing and had major chemistry of each other. What did everyone think? \n\nAnd I shall add I did not like Sophie‘s husband. He’s the worst. What is everyone opinions on him? ",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m8pu62/i_wanna_talk_about_the_hunters_wife/"
    },
    {
        "id": "1m86v7l",
        "author": "Odd_Eye_8730",
        "title": "Just finished Blue Eye Samurai. What a fantastic show!",
        "content": "Just finished Blue Eye Samurai and I’m honestly blown away. The animation is absolutely stunning — every frame feels like a piece of art, blending traditional Japanese aesthetics with a cinematic, modern flair. The fight choreography is some of the best I’ve seen in adult animation — fluid, intense, and grounded in real emotion. But it’s not just eye candy. The storytelling is layered and powerful, exploring identity, vengeance, and isolation with remarkable depth. The voice acting (especially Maya Erskine) brings so much weight to the characters, making them feel heartbreakingly real.\n\nWhat really impressed me was how Blue Eye Samurai balances action with emotion. The writing never talks down to the audience — it trusts you to understand the character’s internal struggles without spoon-feeding exposition. The historical setting adds another layer of richness without feeling forced or preachy. It’s raw, mature, and unafraid to be brutal when the story calls for it. Easily one of the most compelling shows Netflix has dropped in a long time, and I truly hope it gets the recognition (and second season) it deserves.",
        "upvotes": 33,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1m86v7l/just_finished_blue_eye_samurai_what_a_fantastic/"
    },
    {
        "id": "1m803tg",
        "author": "Personal_Bus_758",
        "title": "Why am I sure Amy Bradley fell off board",
        "content": "\nI personally believe that more than one eyewitness is lying. Besides the two girls in the ship I really don't buy the other stories. What makes me doubt whether she was trafficked or not is her leaving her wallet and shoes behind. A missing pair of shoes would prove she exited the room by her own feet. Usually people don't bring too much shoe wear to a week trip in a ship- mostly sandals and something for the nightclubs. If my sister were missing and she left her shoes behind, I would search in the wardrobe in case she picked another pair of shoes. If this was the case, they would have mentioned it. \n\n And if she was promised drugs like the navy said (I personally don't like that guy for a million reasons. Like wdym you didn't report it to extra military authorities asap. He's just, and I apologize for the language, a selfish scum) she would have taken her wallet and ID with her. In many trafficking operations victims are asked to bring along such documentation, especially cash money. Also, I found it weird her friends and family didn't mention any past history with drugs. The brother said she just smoked and drank, but not even a single thing about weed or some stronger stuff. Nor did her friends. Even there were some pictures in which she held pills, I wouldn't take that as a definitive hint.\n\nAnother important point, the pictures on the prostitution website were proven not to be her, since the tattoos don't match with other pictures that weren't shown on the doc. I don't know why they left that out. I feel like they left a lot of things out \n\nThe easiest explanation is that she  fell off the board, (maybe she felt a bit sick and wanted to puke or something), but then the two girls that saw her would have been confused or lying. If these girls are being truthful, then the father never saw her in the balcony, since one can't just teleport in so little time. They recently interviews yellow, who I noted didn't appeared on the doc, and some people noted that he lied about when he came back to his room. I haven't watched the video so I can't confirm myslef. That's something I read on the brother's X, who talks about scientology and shit... how the hell does someone get to that conclusion?\n\nThe trafficking narrative is overly complicated and has so many gaps were one has to fill with wondering and subjective eyewitnesses that might have been influenced by the phycosis of the media surrounding the case. It's not new people coming forward claiming to see someone who was already dead by then. The taxi driver, the tourist, the navy and the woman... I don't know, the way they told their stories was too fantastical to believe. \n\nBut if she did in fact fell off board, why haven't they found the body? Some people say she was eaten by fish, but I don't believe that. They mentioned in the doc that some mafias, more likely drug dealers or traffickers of all sorts (remember Curacao is relatively near to Venezuela and Colombia) operated there. Perhaps the body was found by someone who didn't report to the authorities, maybe because of fear of because they worked with this associations.\n\nPerhaps there are more witnesses who either are afraid to come forward or just didn't know it was her, or didn't care. I just found out about the case on Netflix. I hope the doc brings more leads to the case, and justice is brought to her and all similar victims. My family after watching the doc blamed Amy for her stupidity, selfishness and nativity. But I don't believe she was the kind of person to leave for drugs in such a shady situation without at least telling someone she was leaving, or writing a note. \n\nEDIT: I also forgot, was her key card in the cabin? That would be the first question I'd ask her brother. If the key card was missing, she either \n\nA) left and planned to come back\n\nB) fell off the balcony with the key card\n\nIf the key card was in the room\n\nA) she either left and didn't plan to come back, which doesn't make sense since she wanted to stay in the boat\n\nB) she left and forgot about it \n\nC) she fell off the balcony \n\nDoes anyone know whether her key card was found and if Brad knows about it? ",
        "upvotes": 85,
        "comments": 212,
        "media": null,
        "permalink": "/r/netflix/comments/1m803tg/why_am_i_sure_amy_bradley_fell_off_board/"
    },
    {
        "id": "1m8mwlb",
        "author": "LupeStealLikeLupin3",
        "title": "HITMAKERS [ALL] - Reality show about songwriters - Thoughts?",
        "content": "Just started watching this after being suggested it when I finished watched BUILDING THE BAND. \n\nIf you've seen it, what did you think of it?\n\nI found it quite interesting to see people involved in the pop-music process that I totally overlooked.\n\nAs a TV show, however, I think it might've been more interesting if the format was more a reality-tv gameshow like BUILDING THE BAND, with song-writers trying to get their song claimed by a hit recording artist.",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m8mwlb/hitmakers_all_reality_show_about_songwriters/"
    },
    {
        "id": "1m8mw24",
        "author": "G_rdenofRoses",
        "title": "JOPLIN TWISTER",
        "content": "Just finished this documentary and OMG. What horrific things that town experienced! And they got quite a bit of footage as well. So much devastation made me emotional. I can’t even begin to imagine what they went through. For some reason I can’t remember this happening. Anyway, I must admit the kid forecaster and his mom kinda pissed me off … thoughts? ",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m8mw24/joplin_twister/"
    },
    {
        "id": "1m8oj38",
        "author": "Fatalisticfortuneguy",
        "title": "New Netflix Home Screen",
        "content": "Ewwww wtf did they do to the Home Screen setup. It was just fine as it was why’d they have to go and change it. Hate when companies to changes to layouts like we asked for it. ",
        "upvotes": 3,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1m8oj38/new_netflix_home_screen/"
    },
    {
        "id": "1m8qmpg",
        "author": "Acrobatic-Berry7392",
        "title": "The Hunting Wives",
        "content": "I am looking for similar shows. I couldn’t stop watching it! So much drama, kink, &amp; killing. I can’t lie though, I got the biggest ick from the minors in the show. I felt like that could have been left out. Thoughts/Recommendations ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m8qmpg/the_hunting_wives/"
    },
    {
        "id": "1m8u2ye",
        "author": "Professional_Ad_4885",
        "title": "Happy gilmore 2",
        "content": "Just started jt so spoilers ahead if u havent started the movie yet. Dont read on after this point unless youve seen it\n\n  Killing off his wife virginia in the beginning was def a mistake. I was excited to see her come back as she was big for the first one. I thought his grandmas death was going to start off this film and maybe thats why he stopped golf or looks poor and depressed in the begging. But i love julie bowen and i would have loved to see them together for another film.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m8u2ye/happy_gilmore_2/"
    },
    {
        "id": "1m8tw5l",
        "author": "Gullible_Use_9063",
        "title": "Untamed (SPOILER) discussion on plot continuity.",
        "content": "The one thing I don’t get is when the girl originally fell onto the climbers, she was already dead. Like blue faced dead. As Paul was retelling the story, you can clearly see that she jumped off the cliff, very much alive as she was being chased. Also… in the beginning, when they originally did an autopsy, they didn’t even see the bullet wound in her leg because it was so scratched up, they thought it was an animal attack. It wasn’t until Kyle saw a bullet lodged into a log where they went back and saw the bullet wound. So we don’t get an explanation on how she got all scratched up like that? Also Paul saying “I knew Lucy would think I was trying to kill her once I shit her in the leg”. Like yeah!! No fucking shit!!?? Just sloppy writing, no consistency, no plot continuity. 3/10. Cool scenery I guess. (I know everyone else also says it, but heavily feels AI writing).",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m8tw5l/untamed_spoiler_discussion_on_plot_continuity/"
    },
    {
        "id": "1m8eggu",
        "author": "EstateDesperate2654",
        "title": "PI Moms were actually psychos?",
        "content": "Apologies in advance if anyone else has said this, but is it just me or was that whole show an attempt at gaining sympathy for the moms' sob stories, yet as soon as they start talking about an actual missing child, they don't once mention how happy they were that the kid could be reunited with her family, it's anger and hatred towards Carl for ruining the show?\n\nThere wasn't a single likable person in this show. ",
        "upvotes": 9,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m8eggu/pi_moms_were_actually_psychos/"
    },
    {
        "id": "1m88o55",
        "author": "khargooshekhar",
        "title": "A Deadly American Marriage - the bizarre lies",
        "content": "I just watched this documentary on Netflix, and I am thoroughly disgusted with the outcome. While I understand that it would be distressing for Molly to think that the children she was helping to raise could be taken away from her, particularly after experiencing a miscarriage. I also can empathize with the fact that the refusal to formally adopt the children made her feel illegitimate and sidelined in their role as mother figure (even though Jason’s family maintained that he *was* taking steps to move forward with the adoption, but he was concerned about custody - which I find to be completely legitimate). \n\nHowever, trying to effectively erase the biological mother of two small children and late wife of her current husband is inexcusable. I believe both of the children’s accounts that she was overbearing and needed constant reinforcement that they loved her and saw her as their mother. It’s a tough spot to be in, but she displayed such utter disrespect (to put it lightly) to the memory of Mags that I just cannot fathom this. I myself lost my father to illness at a very young age, and I cannot imagine my mother trying to replace another man as my father. That doesn’t mean a child can’t accept a new person as a parental figure in their life, but it should never be at the expense of someone’s memory and legacy. \n\nMy real discussion point, however, is the bizarre lies she told about going to Ireland to be their godmother, as if they already had a very close relationship with the family prior to Mags’ death. Why was this just mentioned and then glossed over? That is a HUGE lie! Then also telling a book group that she gave birth to Sarah?! I found these to be very significant details that speak to her propensity to tell flat-out lies that she could never back up. That is just pathological. \n\nWhat does everyone make of this omission? They mentioned it and then didn’t elaborate at all. There was also something, if I’m not mistaken, about him being a professional boxer or something? What the hell? ",
        "upvotes": 12,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1m88o55/a_deadly_american_marriage_the_bizarre_lies/"
    },
    {
        "id": "1m8plkh",
        "author": "killwish_",
        "title": "To Watch or Not to Watch: The Old Guard 2 Dilemma",
        "content": "Hello r/Netflix!\nI'm in a bit of a cinematic pickle and hoping you all can help me out. I absolutely loved The Old Guard – seriously, it was a fantastic watch! But here's my issue: it's been a while, and while I remember enjoying it immensely, some of the finer details have faded. Now The Old Guard 2 is out, and I'm hesitant.\nYou see, like many of you, I've been burned by sequels that feel like cash grabs, ultimately diluting the magic of the original. I really don't want to tarnish the good memories I have of the first Old Guard if the second one doesn't live up to it.\nSo, to those of you who've already dived into The Old Guard 2, what's the verdict? Is it worth the watch? Does it maintain the quality and spirit of the first film, or should I just stick with my fond memories? Any spoiler-free thoughts or opinions would be greatly appreciated!\nCheers,\nu/killwish_\n",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1m8plkh/to_watch_or_not_to_watch_the_old_guard_2_dilemma/"
    },
    {
        "id": "1m898ml",
        "author": "Huseynov26",
        "title": "Any quick watch movies that are a great one and done? (Example: Red Eye, Speed, Fall)",
        "content": "Movies that dont need too much thinking and does not get boring with needless exposition and boring middle or beginning portions. Best examples that I can give is movies like Red Eye, Speed, Fall, Phone Booth). My wife gets bored too quick watching movies unless the movie is like 90-100 minutes long with not a lot of exposition that keeps you on the edge. ",
        "upvotes": 7,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1m898ml/any_quick_watch_movies_that_are_a_great_one_and/"
    },
    {
        "id": "1m8jkqv",
        "author": "TheMelnibonean",
        "title": "New Layout",
        "content": "Is there any way I can revert the tv layout? They just maxed everything and now I don’t feel I can explore the catalogue. Anyone knows if this is only an a/b test or are they rolling out for all users?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m8jkqv/new_layout/"
    },
    {
        "id": "1m7ybka",
        "author": "begentlebutrough",
        "title": "Six feet under, underrated",
        "content": "Watch it right now if you haven’t. It’s about a family that owns a funeral home, and delves deep into basically any topic and experience you can imagine. The show is truly unique and made me cry more than I care to admit, especially the finale. \nThe sound track is beautiful, the characters are dynamic and you love and hate them, the cast is amazing. It’s real world, it’s an experience that I haven’t seen done so beautifully other than with this show. \nWatch it now \n",
        "upvotes": 33,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1m7ybka/six_feet_under_underrated/"
    },
    {
        "id": "1m8neqj",
        "author": "LittleMonito",
        "title": "Games like Rainbox Six Siege Smol can not be played any longer?",
        "content": "I really liked it, but my phone wasn't great enough to play it for too long. However, I'm seeing that it was removed, I was wondering, are those games completely unavailable now? They can't be played never again? It was one of the funniest and amazing shooters I've played. Thank you",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m8neqj/games_like_rainbox_six_siege_smol_can_not_be/"
    },
    {
        "id": "1m77f2i",
        "author": "Legitimate_Ad3625",
        "title": "KPop Demon Hunters has made Netflix history by breaking an unlikely record 5 weeks after its release",
        "content": "",
        "upvotes": 932,
        "comments": 110,
        "media": null,
        "permalink": "/r/netflix/comments/1m77f2i/kpop_demon_hunters_has_made_netflix_history_by/"
    },
    {
        "id": "1m88rj3",
        "author": "MysteriousDelay6266",
        "title": "Train Dreams | Official Teaser | Netflix",
        "content": "Starring Joel Edgerton, Felicity Jones, with Kerry Condon and William H. Macy.\n\nFrom the Academy award nominated co-writers of Sing Sing.\n\nBased on Denis Johnson’s beloved novella, Train Dreams is the moving portrait of Robert Grainier, a logger and railroad worker who leads a life of unexpected depth and beauty in the rapidly-changing America of the early 20th Century.\n\nTrain Dreams, in select theaters this **November 7** and on Netflix **November 21**.",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m88rj3/train_dreams_official_teaser_netflix/"
    },
    {
        "id": "1m8fo4t",
        "author": "Zealousideal_Map5074",
        "title": "Need a verdict on A Killer Paradox (2024) – worth the watch?",
        "content": "\nI watched Mask Girl and honestly, up until the second episode, it felt pretty slow and meh like nothing much was happening. So I asked on Reddit whether I should continue or drop it. Everyone said it’s worth sticking with, so I listened and I’m glad I did. I ended up loving the show.\n\nNow it’s a no brainer that I’m back for another recommendation. Is Killer Paradox worth watching?\n\nFor context, I’m someone who loves fast-paced thrillers with plot twist.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m8fo4t/need_a_verdict_on_a_killer_paradox_2024_worth_the/"
    },
    {
        "id": "1m8f42f",
        "author": "Internal-Bed-3150",
        "title": "The Waterfront season 2 renewal now feels all but guaranteed",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m8f42f/the_waterfront_season_2_renewal_now_feels_all_but/"
    },
    {
        "id": "1m8deww",
        "author": "No-Interaction-8213",
        "title": "Trying to find old Netflix preview music.",
        "content": "I can’t say I remember it entirely but it played when I watched the old Johnny test on it. The music had a guitar playing in it. If anyone can remember or find it, I’d be grateful.  ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m8deww/trying_to_find_old_netflix_preview_music/"
    },
    {
        "id": "1m8d7lf",
        "author": "TH3_FALL1N1",
        "title": "Need help finding the piece of Music during this scene please! Sandman season 2 part 2 (episode 7-37 mins onwards)",
        "content": "\nHey everyone, need help finding the piece of music during this scene season 2 part 2 episode 7 (37 mins onwards in the episode), already tried Shazam, not much help... please can anyone help me, its so beautiful and serene.",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/cfbtdmegevef1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1m8d7lf/need_help_finding_the_piece_of_music_during_this/"
    },
    {
        "id": "1m8c5k5",
        "author": "Superhero1996",
        "title": "Netflix household",
        "content": "My mother pays for the Netflix and I live with but I’m unable to access the Netflix account. We live in Maryland, we have family in Pittsburgh who are able to access using the same account with no problems. Has anybody had this problem?",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1m8c5k5/netflix_household/"
    },
    {
        "id": "1m8ksog",
        "author": "Spirited-Region-2611",
        "title": "Trainwreck: Balloon Boy.",
        "content": "One thing that doesn’t make sense to me, and why the neighbours would think the family was lying, is they heard all the same commotion that was on the video, of the boy flying away, and in real time, they then looked for the boy. But then people say the video was recorded after the incident to make it look like they weren’t lying? \nWhich makes me wonder if it was true all this time. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m8ksog/trainwreck_balloon_boy/"
    },
    {
        "id": "1m76lde",
        "author": "Double-Reputation151",
        "title": "so...just finished watching building the band",
        "content": "ngl im massively dissapointed that szn4 didnt win but ngl they also lowkey messed up in episode 10...\n\nidk why for episode 10, the performance to win it ALL, they chose to stay pretty static on stage :/ the song choice was just lackluster tbh I was pretty confused when they chose \"Human\" which is a pretty repetitive song that says the same phrase like 50 times. not the greatest choice for a competition to win 500k\n\nI already started to see szn4's loss coming as I watched episode 8 and 9 because they didn't choose great songs at all :/ believer didn't have enough vocal range and complexity to show the uniqueness of szn4 and I forgot what other song they sang (speaks volumes)\n\nits just so disappointing because earlier in the game, somebody that I used to know and sweet love ate SOOOOOO hard and listening to them sing those songs gave me goosebumps. they really missed the mark with song selection - don't get me wrong tho, they sounded great still and their uniqueness still makes them a superior band\\~\n\nmeanwhile 3quency definitely chose very fitting songs - they had dynamic choreo and they just looked and sounded like what someone would typically think of when you say \"girl group\" - the fact that they just fit the image probably played a role in their ultimate win",
        "upvotes": 252,
        "comments": 448,
        "media": null,
        "permalink": "/r/netflix/comments/1m76lde/sojust_finished_watching_building_the_band/"
    },
    {
        "id": "1m8ak6d",
        "author": "ccr87315",
        "title": "The Sandman",
        "content": "Just finished the last episodes. Although they were not exciting as ending was already spoiled for me, they're satisfying. It was good to actually see series ended properly. Although I am bit sad that it has ended. ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m8ak6d/the_sandman/"
    },
    {
        "id": "1m8nkls",
        "author": "Cold_Reaction7590",
        "title": "People who complain about the new UI",
        "content": "Can any person who decided to cancel the subscription after the new UI release explain their reasoning?\n\nI get that you might not like the new looks or were used to the old one so much but I mean it is still 100% functional and, I dare to say, better than any other streaming service.\n\nSaying that you are going to cancel because of this looks like a big overreaction, bordering in childish behavior. It is literally just a different layout, who cares? It is the same content 🤷‍♂️\n",
        "upvotes": 0,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m8nkls/people_who_complain_about_the_new_ui/"
    }
]