[
    {
        "id": "1kbfzp8",
        "author": "JennyJueAMA",
        "title": "Hi /r/movies! I’m Jenny Jue, casting director for The Wedding Banquet (now in theaters), Okja, Snowpiercer, Inglourious Basterds, The Brother's Sun, Netflix's Avatar: The Last Airbender season 2, and more. I love discovering breakout talent and building unforgettable ensembles. AMA!",
        "content": "Hi r/movies! I’m Jenny Jue, casting director for The Wedding Banquet (now in theaters), Okja, Snowpiercer, Inglourious Basterds, The Brother's Sun, Netflix's Avatar: The Last Airbender season 2, and more. I love discovering breakout talent and building unforgettable ensembles. AMA!\n\nI'll be back at 8 PM ET today (Wednesday 4/30) to answer your questions. Ask me anything!\n\nView the official trailer for “The Wedding Banquet” here: \n\n[https://www.youtube.com/watch?v=kWy\\_IzW04YM](https://www.youtube.com/watch?v=kWy_IzW04YM)\n\nMy credits:\n\n[https://www.imdb.com/name/nm1937563/](https://www.imdb.com/name/nm1937563/)\n\nUp next: \"Untitled Avatar: The Last Airbender\" (Paramount/Avatar Studios), \"Mike and Nick and Nick and Alice\" (20th Century Studios), and \"Ballerina Overdrive\" (Amazon Studios).\n\nMore bio information:\n\nCSA Award-winning Casting Director Jenny Jue, whose two-decade career includes standout collaborations with Quentin Tarantino (\"Inglourious Basterds\"), Bong Joon Ho (\"Okja\", \"Snowpiercer\"), and Netflix’s \"The Brother’s Sun.”\n\nJenny’s latest project, \"The Wedding Banquet\" (Bleecker Street), is a 2025 reimagining of the Ang Lee classic, directed by Andrew Ahn and starring Lily Gladstone, Bowen Yang, Kelly Marie Tran, Joan Chen, and Youn Yuh-jung. Premiering to rave reviews at Sundance and in theaters nationwide April 18, 2025, the film explores queerness, chosen family, and generational identity with depth and humor. Jenny spent two years casting the project, navigating the unique challenges of post-strike independent filmmaking while shaping an ensemble that feels instinctive and human.\n\nJenny’s path to casting was anything but conventional. Raised in Southern California by a family of engineers, she initially pursued a pre-law track at UCLA. But a last-minute internship with iconic casting director Johanna Ray (\"Mulholland Drive\", \"Twin Peaks\") changed everything. Jenny spent nearly a decade under Ray’s mentorship before founding her own company, Downtown Casting, in 2012. Since then, she’s become the go-to casting director for auteurs seeking global talent and emotional authenticity—balancing the demands of prestige cinema with stories that feel intimate, lived-in, and often underrepresented. Her work spans genres, from the from the stylized action of \"Kate\" to the unsettling realism of the BAFTA-nominated documentary \"The Social Dilemma.\"",
        "upvotes": 317,
        "comments": 145,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/dyejt4pooyxe1.png?auto=webp&amp;s=28396645fb9dbaf970d914489d041062666a2b95"
        },
        "permalink": "/r/movies/comments/1kbfzp8/hi_rmovies_im_jenny_jue_casting_director_for_the/"
    },
    {
        "id": "1k79rk2",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (The Accountant 2 / The Legend of Ochi / Until Dawn) plus Throwback Discussions!",
        "content": "# New Theatrical Releases\n\n[The Accountant 2](https://old.reddit.com/r/movies/comments/1k79o5r/official_discussion_the_accountant_2_spoilers/?)\n\n[The Legend of Ochi](https://old.reddit.com/r/movies/comments/1k79o78/official_discussion_the_legend_of_ochi_spoilers/?)\n\n[Until Dawn](https://old.reddit.com/r/movies/comments/1k79o90/official_discussion_until_dawn_spoilers/?)\n\n\n# 25th Anniversary Throwback Discussion Threads\n\n[Love &amp; Basketball](https://old.reddit.com/r/movies/comments/1k79oaq/official_throwback_discussion_love_basketball/?)\n\n[The Virgin Suicides](https://old.reddit.com/r/movies/comments/1k79och/official_throwback_discussion_the_virgin_suicides/?)\n\n[U-571](https://old.reddit.com/r/movies/comments/1k79oe1/official_throwback_discussion_u571_spoilers/?)\n\n# Still in Theaters\n\n[Sinners](https://www.reddit.com/r/movies/comments/1k1tsoo/official_discussion_sinners_spoilers/?)\n\n[The Wedding Banquet](https://www.reddit.com/r/movies/comments/1k1tsqm/official_discussion_the_wedding_banquet_spoilers/?)\n\n[Warfare](https://www.reddit.com/r/movies/comments/1jwev1e/official_discussion_warfare_spoilers/)\n\n[The Amateur](https://www.reddit.com/r/movies/comments/1jwev63/official_discussion_the_amateur_spoilers/)\n\n[Drop](https://www.reddit.com/r/movies/comments/1jwevax/official_discussion_drop_spoilers/)\n\n[Freaky Tales](https://www.reddit.com/r/movies/comments/1jwevev/official_discussion_freaky_tales_spoilers/)\n\n[A Minecraft Movie](https://www.reddit.com/r/movies/comments/1jr0qff/official_discussion_a_minecraft_movie_spoilers/?)\n\n\n\n\n# On Streaming\n\n**I'm a bit behind on streaming releases so here's a bunch of them from the last few weeks**\n\n[Havoc](https://old.reddit.com/r/movies/comments/1k7zfyi/official_discussion_havoc_spoilers/?)\n\n[G20](https://old.reddit.com/r/movies/comments/1k7zfzp/official_discussion_g20_spoilers/?)\n\n[2073](https://old.reddit.com/r/movies/comments/1k7zg0y/official_discussion_2073_spoilers/?)\n\n[Holland](https://old.reddit.com/r/movies/comments/1k7zg30/official_discussion_holland_spoilers/?)",
        "upvotes": 33,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1k79rk2/official_discussion_megathread_the_accountant_2/"
    },
    {
        "id": "1kbk322",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'Together' Starring Alison Brie &amp; Dave Franco",
        "content": "",
        "upvotes": 12727,
        "comments": 1282,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/a8gtiwg6wzxe1.jpeg?auto=webp&amp;s=1752e029f4ccfabafed06b526d987943df120e4c"
        },
        "permalink": "/r/movies/comments/1kbk322/official_poster_for_together_starring_alison_brie/"
    },
    {
        "id": "1kbp1vb",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for ‘Wick is Pain’, a Documentary Charting the Rise of the ‘John Wick’ Franchise",
        "content": "",
        "upvotes": 1754,
        "comments": 150,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/slw37bluw0ye1.jpeg?auto=webp&amp;s=a8c377168600efd3629e42e460694b49e557266b"
        },
        "permalink": "/r/movies/comments/1kbp1vb/official_poster_for_wick_is_pain_a_documentary/"
    },
    {
        "id": "1kbfw02",
        "author": "NoCulture3505",
        "title": "First Poster for \"Sorry, Baby\"",
        "content": "",
        "upvotes": 5587,
        "comments": 490,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qw42qus20zxe1.jpeg?auto=webp&amp;s=3c0a365174fb36f03398937c9225320709329f31"
        },
        "permalink": "/r/movies/comments/1kbfw02/first_poster_for_sorry_baby/"
    },
    {
        "id": "1kbwbri",
        "author": "lawrencedun2002",
        "title": "Takashi Miike To Direct Neon’s ‘Bad Lieutenant: Tokyo’ Starring Shun Oguri, Lily James, &amp; Liv Morgan; Film To Hit International Market At Cannes—The Dish",
        "content": "",
        "upvotes": 244,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LJUu9aMEkIwo5eeU5XesrRFJp-ZlLJrC2BUA-qqgD_w.jpg?auto=webp&amp;s=e81273c1775dc16b69e4b15fe3de0430dcd1b049"
        },
        "permalink": "/r/movies/comments/1kbwbri/takashi_miike_to_direct_neons_bad_lieutenant/"
    },
    {
        "id": "1kbv5hj",
        "author": "CaptainPunisher",
        "title": "What's a slightly lesser known movie that gives you some great quotes?",
        "content": "I was just thinking about [Captain Ron](https://youtu.be/RlFXddu3HJ0?si=QvhQTTumLgqqC15F), which is a great movie, but I didn't think it's as well known as it should be. A pair of my favorite quotes come from it in the form of \"Shit happens. Cough it up.\" Also \"gorillas vs guerillas\". \n\nSo, I ask you my movie-loving brethren and sistren, what are some of your favorite movies that just don't get the love they should, and what are some of your favorite scenes and quotes? \n\n",
        "upvotes": 272,
        "comments": 559,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/eCH5mZOv3XMKcD1Mx-6iblt8HmdfZU2wJrdv3-tynZE.jpg?auto=webp&amp;s=9d27228e1ec80b380f9498032296e3387e802f26"
        },
        "permalink": "/r/movies/comments/1kbv5hj/whats_a_slightly_lesser_known_movie_that_gives/"
    },
    {
        "id": "1kbxulq",
        "author": "herequeerandgreat",
        "title": "many members of the cast of house of 1000 corpses died before the film turned 20 years old.",
        "content": "rob zombie's 2003 horror movie house of 1000 corpses holds the dubious honor of being one of the very few movies in existence where many members of it's cast died before it turned 20 years old. before the film's 20th anniversary in 2023, 7 members of it's cast died. \n\nthe first was dennis fimple who was actually sick from heart disease at the time, hence why his character sits down for most of the movie. however, it was not the disease that claimed his life but a car crash in 2002. house of 1000 corpses would be fimple's final movie, releasing the year after his death.\n\nthen came matthew mcgrory, a man who is largely known for holding the guinness book of world records for the tallest actor, standing at 7 feet tall and 6 inches. mcgrory's career was relatively short with only a few film credits and television credits to his name. most people will likely know him as karl the giant from tim burton's big fish. it's worth noting that he was one of only 4 actors from house of a 1000 corpses to return for the film's sequel the devil's rejects, reprising his role as tiny firefly. the same year that movie came out, mcgrory would pass away from congestive heart failure at the age of 32. the devil's rejects is dedicated to his memory. \n\nthen came karen black, a woman who needs no introduction if you're a fan of horror. she stars in house of 1000 corpses as mama firefly, the matriarch of the firefly family. she did not return for the sequel the devil's rejects due to demanding too high a salary to come back. after house of 1000 corpses, she continued to get steady work in both film and television until her 2013 death from cancer at the age of 74.\n\nthen there was tom towles. towles was a character actor who broke out into mainstream success with his portrayal of otis in henry portrait of a serial killer. throughout his career, he starred in many different movies and tv shows. house of 1000 corpses wasn't even his final collaboration with rob zombie as towles later starred in the devil's rejects, halloween, and the fake trailer for werewolf women of the SS. towles died in 2015 at the age of 65 from a stroke. \n\nthen there was irwin keyes, an actor who took full advantage of his towering height to play larger then life characters. throughout his career, he starred in many movies of many different genres and played many different roles. in 2015, keyes died at the age of 63 from complications of acromegaly.\n\nthen there was sid haig, who despite his long career in both film and television is likely forever destined to be known as captain spaulding, one of the greatest killer clowns in film history. his performances as spaulding is often considered to be among the strongest parts of those movies. in september of 2019, haig died at the age of 80 from pneumonia. his final performance as captain spaulding was in 3 from hell.\n\nfinally, there was michael J pollard, a famous character actor who had been acting since the 1950s. he was known for playing quirky and off beat supporting characters. he had a respectable career and even earned an academy award nomination for best supporting actor for his role in bonnie and clyde. after house of 1000 corpses, pollard went into semi retirement, only making 2 more movies before his 2019 death from cardiac arrest at the age of 80. \n\nRIP to them all.",
        "upvotes": 176,
        "comments": 28,
        "media": null,
        "permalink": "/r/movies/comments/1kbxulq/many_members_of_the_cast_of_house_of_1000_corpses/"
    },
    {
        "id": "1kbj189",
        "author": "Magik-Mina-MaudDib",
        "title": "Rachel Zegler to Star Alongside Marisa Tomei in Comedy Drama ‘She Gets It From Me’",
        "content": "",
        "upvotes": 1153,
        "comments": 357,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/l8V0q2eH0KyQzHE66IIIhL40Wws78RdnODU8a2fGMZw.jpg?auto=webp&amp;s=44df704ed1a05bbe7ab3ce2d702740ede3ae4147"
        },
        "permalink": "/r/movies/comments/1kbj189/rachel_zegler_to_star_alongside_marisa_tomei_in/"
    },
    {
        "id": "1kbzqma",
        "author": "dicedtomatoes55",
        "title": "‘The Surfer’ Might Just Be Nicolas Cage’s Best Movie of 2025",
        "content": "",
        "upvotes": 102,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/e3JfCSM1moP6GSPjlV-fA8HfDYx2V3uGBNPVqVodSyE.jpg?auto=webp&amp;s=129cce2e54e04c20aa99685b11bd7882fa35b323"
        },
        "permalink": "/r/movies/comments/1kbzqma/the_surfer_might_just_be_nicolas_cages_best_movie/"
    },
    {
        "id": "1kbhoi5",
        "author": "ebradio",
        "title": "The Rocky Horror Picture Show Returning to Theaters in 4K for 50th Anniversary",
        "content": "",
        "upvotes": 1061,
        "comments": 116,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/DCjHC2HvbZONkAjgoBpt0tkeZbMkSpzhTzcZ55xr9oc.jpg?auto=webp&amp;s=cb7807506f08299d25593e051f0147a0d2464f9c"
        },
        "permalink": "/r/movies/comments/1kbhoi5/the_rocky_horror_picture_show_returning_to/"
    },
    {
        "id": "1kbqtym",
        "author": "HoldsworthMedia",
        "title": "F. Murray Abraham - Amadeus",
        "content": "Having just watched the Amadeus theatrical cut in 4K (which is wonderful, everyone should check it out if they can), I think I feel confident to say that Murray’s performance in this film is the best performance in film history, that I’ve seen. \n\nI’ve seen the film many times, and there are so many great all time performances out there but I don’t think I’ve seen one better. You could argue he doesn’t get to do anything that reaches into, say, DDL level emotion for There Will Be Blood for abandoning his child or De Niro smashing up a concrete wall in darkness in Raging Bull, but the scene where Murray reads Mozart’s music for the first time is the best acting I think I have seen in a film. \n\nComes down to personal taste rather than anything objective I suppose. Thoughts?",
        "upvotes": 284,
        "comments": 93,
        "media": null,
        "permalink": "/r/movies/comments/1kbqtym/f_murray_abraham_amadeus/"
    },
    {
        "id": "1kbpuds",
        "author": "JustAposter4567",
        "title": "Has there ever been a modern day genre switchup similar to Alien - &gt; Aliens?",
        "content": "Alien and Aliens are both in my top 5 movies of all time (not a surprise very basic bitch choices) but one thing I tell people is that the real genius of Aliens was just the decision to switch up the genre/style of the movie. Obviously it was executed perfectly, but just the idea to do that seems insane to me. I haven't really been able to think of a movie series that did that today. Especially going from a slow-loomthing-methodical build up horror movie like alien to a non-stop action/horror/thriller in aliens.\n\nedit - By modern I'm gonna arbitrarily say like post 2005~",
        "upvotes": 312,
        "comments": 345,
        "media": null,
        "permalink": "/r/movies/comments/1kbpuds/has_there_ever_been_a_modern_day_genre_switchup/"
    },
    {
        "id": "1kbz710",
        "author": "MayHeim10",
        "title": "How the hell did they make the sets in the second half of Full Metal Jacket???",
        "content": "I watched Full Metal Jacket earlier today, and was absolutely blown away by the sets that the characters ran through in Vietnam. The fire; the rubble, the full scale buildings. Did they really build nearly an entire town for the movie? Because they run through so much of it that it can’t be a matte painting or miniatures right?? If anyone has the answer or knows any behind the scenes videos I could watch, that would be greatly appreciated. 10/10 movie by the way",
        "upvotes": 76,
        "comments": 36,
        "media": null,
        "permalink": "/r/movies/comments/1kbz710/how_the_hell_did_they_make_the_sets_in_the_second/"
    },
    {
        "id": "1kblsy2",
        "author": "MarvelsGrantMan136",
        "title": "Luca Guadagnino's 'Sgt. Rock' DC Movie Scrapped at Warner Bros.",
        "content": "",
        "upvotes": 479,
        "comments": 107,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Nwia72wrcMFGK4Fvev-v1FUAK4VPylnAkIAQtcr2dvE.jpg?auto=webp&amp;s=7c4ca12fe3efc34dbf03d513923f6ae158f3298a"
        },
        "permalink": "/r/movies/comments/1kblsy2/luca_guadagninos_sgt_rock_dc_movie_scrapped_at/"
    },
    {
        "id": "1kbspwr",
        "author": "BunyipPouch",
        "title": "Poster for the Theatrical Re-Release of 'This Is Spinal Tap' - The cult classic mockumentary directed by Rob Reiner is being re-released ahead of the premiere of 'This Is Spinal Tap II' in September.",
        "content": "",
        "upvotes": 185,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ey62l58go1ye1.jpeg?auto=webp&amp;s=a624e38addc0b9a9f45a560ae1af9a02d75472b4"
        },
        "permalink": "/r/movies/comments/1kbspwr/poster_for_the_theatrical_rerelease_of_this_is/"
    },
    {
        "id": "1kbnd7t",
        "author": "MarvelsGrantMan136",
        "title": "‘Road House 2’: Guy Ritchie to Direct Sequel to Amazon MGM’s Hit Action Movie",
        "content": "",
        "upvotes": 381,
        "comments": 190,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7cSCx4vbuUIQ4d3dOYYhO6uqo2Tdtz2daQ3n3HlJIUw.jpg?auto=webp&amp;s=51851d85635a17f8c0cf1962f40f15e9c6d874e7"
        },
        "permalink": "/r/movies/comments/1kbnd7t/road_house_2_guy_ritchie_to_direct_sequel_to/"
    },
    {
        "id": "1kbdcbt",
        "author": "InspectorMendel",
        "title": "What's a single shot that tells a whole story?",
        "content": "[George Miller (of Mad Max) once said that one of his favorite shots is from The Godfather](https://youtu.be/raX0pJDKOEc?si=QE54J_DhMnynvrMN&amp;t=363), when Michael is in Italy and takes a girl out on a date. Michael and the girl walk past the camera bashfully flirting, followed by a group of female relatives chaperoning and chatting amongst themselves, and then followed by two guys with shotguns. You can see the whole story of Michael's time in Italy in a single moment.\n\nIt's a great shot, and funnily enough I can totally see the resemblance to some shots in Fury Road -- where the camera kinda lingers and lets different characters and groups fall in and out of frame, in a way that tells an effective mini-story.\n\nWhat are some of your favorite shots that tell their own stories?",
        "upvotes": 1421,
        "comments": 316,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6LKnfKgs0yTPaT0nmsPa4Ny9Ei8ejpdtyg7hGqVDYRo.jpg?auto=webp&amp;s=5c006dcfc5514550f2d40325873194c17430e741"
        },
        "permalink": "/r/movies/comments/1kbdcbt/whats_a_single_shot_that_tells_a_whole_story/"
    },
    {
        "id": "1kc0xpg",
        "author": "Crandin",
        "title": "Takashi Miike to Direct Bad Lieutenant: Tokyo With Shun Oguri, Lily James, and Liv Morgan",
        "content": "",
        "upvotes": 40,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-Z7igBxg8TJQ4jAZjhBPhTIW4gWlLJBmst7V2fepfCg.jpg?auto=webp&amp;s=cba4e40a9276cd2468dbe801c2c7a7eba7826a11"
        },
        "permalink": "/r/movies/comments/1kc0xpg/takashi_miike_to_direct_bad_lieutenant_tokyo_with/"
    },
    {
        "id": "1kby0jx",
        "author": "BackShotsErrDay",
        "title": "Rewatching Man of steel 4k in 2025",
        "content": "Holy shit, say whatever you want about this movie. But if there’s one thing I’m pretty sure we all can agree on, is that zack synder is a visual fx genius. \nRewatching all the action scenes in crisp 4k is a very breathtaking and immersive experience.  It blows my mind on how everything went downhill after the release of BVS.\nI do however think it’s fair to say, synder had a pretty good run with DC though. After seeing the new super man trailer today, I’m excited to see what gun is going to do.\n\nif you seen the new trailer, what are your thoughts?",
        "upvotes": 48,
        "comments": 135,
        "media": null,
        "permalink": "/r/movies/comments/1kby0jx/rewatching_man_of_steel_4k_in_2025/"
    },
    {
        "id": "1kbl1v4",
        "author": "MichaelGMorgillo",
        "title": "Have you ever experienced a film that was a sequel before seeing the original?",
        "content": "In my case it wasn't a sequel per-se, but I saw the \"Serenity\" film when it was on television about 5 years before I'd even heard of Firefly.\n\nI remember a few scenes that were memorable; but I also remember that it didn't really leave any sort of emotional impression on me. When I watched it again much later with context after watching the series, I was certainly more engaged then the first one since I understood the characters and the overall world, but also didn't have much of an emotional reaction as I expected, and I've always wondered whether that was just down to me having seen it before without realising it, or if it was down to my tastes and the way I think about films just being different then it was before.\n\nBut that's just my experience; has anyone else been in this situation, and what was your experience during or after?",
        "upvotes": 248,
        "comments": 875,
        "media": null,
        "permalink": "/r/movies/comments/1kbl1v4/have_you_ever_experienced_a_film_that_was_a/"
    },
    {
        "id": "1kb0d0q",
        "author": "BostonNewEngland",
        "title": "Oscars’ New Rule Requiring Voters to Watch All Nominees, but Academy Members Already Found Loopholes",
        "content": "",
        "upvotes": 4609,
        "comments": 297,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rHHTLDZekkPOW3u9Vr7CC6QkkA6ZO3gRjRzglc9bpWQ.jpg?auto=webp&amp;s=849a84143a386d9dee2d7d71095ab92a98443288"
        },
        "permalink": "/r/movies/comments/1kb0d0q/oscars_new_rule_requiring_voters_to_watch_all/"
    },
    {
        "id": "1kbp5vy",
        "author": "BunyipPouch",
        "title": "'The School Duel' - First Trailer - Dystopian-Thriller - Set in near-future Florida, schoolchildren are recruited to take part in a deadly, statewide competition known as “The School Duel”, in order to try to curb the rise of school shootings.",
        "content": "",
        "upvotes": 81,
        "comments": 67,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vTywTeha-mTiEdRIlj0xYBhUllkTcvVM5TbPSmduZRo.jpg?auto=webp&amp;s=af9992990372f2d8e10052398b46aa37e69f0fdf"
        },
        "permalink": "/r/movies/comments/1kbp5vy/the_school_duel_first_trailer_dystopianthriller/"
    },
    {
        "id": "1kbh8od",
        "author": "MarvelsGrantMan136",
        "title": "Deep Cover - Official Trailer | Prime Video",
        "content": "",
        "upvotes": 217,
        "comments": 49,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/U7AwB93e1CLxDzc5dTRgYEcYwq_-2M4n_-IlfkOYaeg.jpg?auto=webp&amp;s=51fdc8abea66c7234fb6c27218d2cb14e4683d0b"
        },
        "permalink": "/r/movies/comments/1kbh8od/deep_cover_official_trailer_prime_video/"
    },
    {
        "id": "1kasuaw",
        "author": "RobotiSC",
        "title": "Official Poster for 'Now You See Me: Now You Don't'",
        "content": "",
        "upvotes": 16226,
        "comments": 1890,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/nqonufbu0txe1.png?auto=webp&amp;s=e88c525aae436e1cf58e2f07ba0f34e197388347"
        },
        "permalink": "/r/movies/comments/1kasuaw/official_poster_for_now_you_see_me_now_you_dont/"
    },
    {
        "id": "1kblws2",
        "author": "NoCulture3505",
        "title": "Chris Hemsworth to Star in Submarine Thriller ‘Subversion’ for Amazon MGM",
        "content": "",
        "upvotes": 89,
        "comments": 31,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cjLxA_yTuYI5yvm3EL-1Z2et2IrI_ZFRe4oYHJ7PO_4.jpg?auto=webp&amp;s=1897c01a0d9dc1f4804de7de580829532637a12c"
        },
        "permalink": "/r/movies/comments/1kblws2/chris_hemsworth_to_star_in_submarine_thriller/"
    },
    {
        "id": "1kbwwp8",
        "author": "Sonia341",
        "title": "Jacki Weaver To Star In Horror Feature ‘Pendulum’ From Producer Darren Aronofsky",
        "content": "",
        "upvotes": 20,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/tjDuBqQ4WUypBzDcvnZ0sqNWziEtTXxfp8UyLSgXHZk.jpg?auto=webp&amp;s=cb7fe8dc98fd4bb19ffdaf8c5575c25f5ff916f1"
        },
        "permalink": "/r/movies/comments/1kbwwp8/jacki_weaver_to_star_in_horror_feature_pendulum/"
    },
    {
        "id": "1kbr9qt",
        "author": "cmaia1503",
        "title": "Martin Scorsese to Honor Pope Francis With ‘Aldeas — A New Story’ Documentary, Featuring His Last On-Camera Interview",
        "content": "",
        "upvotes": 37,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/UkXSOwsFMQFNZdORYd_EZV4i3BB8EANSJsNJ27uPwFo.jpg?auto=webp&amp;s=cb8a2b7694774b69452d67bbc5314dbb02b9bf5e"
        },
        "permalink": "/r/movies/comments/1kbr9qt/martin_scorsese_to_honor_pope_francis_with_aldeas/"
    },
    {
        "id": "1kby0ss",
        "author": "KillerCroc1234567",
        "title": "Chris Hemsworth, Halle Berry's 'Crime 101' Lands Presidents' Day Weekend 2026 Release",
        "content": "",
        "upvotes": 14,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kfyew86G77cW2e-cJdYgp7zOih4E0fJ4-_3ema-TBxs.jpg?auto=webp&amp;s=0c1a741f1c03fcadbabfb3af618d41aad71e595a"
        },
        "permalink": "/r/movies/comments/1kby0ss/chris_hemsworth_halle_berrys_crime_101_lands/"
    },
    {
        "id": "1kbv9zy",
        "author": "bell-town",
        "title": "What movie set in your city does everyone need to see?",
        "content": "I live in Seattle and Mexico City. 50/50 is my favorite Seattle movie. (Even if it's actually in Vancouver.)\n\nThere's a lot of good movies set in Mexico City, but I think more people should see Somos lo que hay (2010). It's an art film about a cannibal family that suddenly has to learn to hunt for themselves when their patriarch dies.",
        "upvotes": 18,
        "comments": 87,
        "media": null,
        "permalink": "/r/movies/comments/1kbv9zy/what_movie_set_in_your_city_does_everyone_need_to/"
    },
    {
        "id": "1kbz1j3",
        "author": "geekteam6",
        "title": "Ryan Coogler talks \"Sinners\" on Elvis Mitchell's The Treatment",
        "content": "Best, deepest Coogler / *Sinners* interview I've heard so far IMO. At one point he even says, \"I've never talked about this in the media before but...\"",
        "upvotes": 9,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zIJ2zCF0nMyNc6XwkC7lpX-qpGqMuWv1Cti4I2993sc.jpg?auto=webp&amp;s=9fa57018051f9f7706b0761c0fea2f308ecf5a05"
        },
        "permalink": "/r/movies/comments/1kbz1j3/ryan_coogler_talks_sinners_on_elvis_mitchells_the/"
    },
    {
        "id": "1kb0rp8",
        "author": "Xano74",
        "title": "I finally saw the Conan The Barbarian movies and they were nothing like I expected",
        "content": "I recently bought Mortal Kombat 1 on sale with all the DLC and was trying to figure out who to play.\n\nI decided to go in reverse order on the character select menu which made me choose Conan first. I knew very little about the movies or character other than Arnold plays him\n\nSo after playing Conan I really started enjoying him and decided I needed to see where he came from.\n\nMy expectations were that Conan The Barbarian and Destroyer were just dumb 80s action movies and there would be a lot of violence and bravado without much substance.\n\nBoy was I wrong. Instead I found its an Epic Dark Fantasy movie with awesome music, tons of camp, and a great performance by the late James Earl Jones.\n\nBoth movies reminded me of a DnD campaign. I did not expect the movies to be so nerdy in the fantasy element. I was expecting Expendables level of dumb but instead I got Lord of the Rings movie before Lord of the Rings.\n\nI liked how the movies did little to explain things or even hype up certain moments. There's a part in Conan 1 where Conan gets crucified. Any other movie would have a super hyped up, dark and depression lead up to him getting tortured, etc.\n\nIn the actual movie, James Earl Jones says \"crucify him\" and it immediately just jumps to Conan on a tree with 0 build up.\n\nSimilarly Conan somehow sneaks into the enemy stronghold at the end with absolutely no fighting any guards and gets all the way to Thulsa Doom to kill him with 0 explanation. \n\nIt doesn't feel the need to baby the audience and I like that.\n\nConan 2 felt more like a standard fantasy adventure until the end. I did not expect the final battle to be against a giant fish monster god.\n\nMy wife and I ended up really enjoying the movies and I can tell why they are cult classics. \n\nI really enjoyed all the side Characters. Valeria was badass. Subotai was a total bro helping Conan after just meeting him. Malak made a good comedy relief while being super helpful in key moments. Zulu was a badass and had some awesome goofy facial expressions throughout.\n\nI'm glad I decided to finally watch these cult classics. Is the 2010 reboot with Jason Mamoa any good?",
        "upvotes": 1768,
        "comments": 518,
        "media": null,
        "permalink": "/r/movies/comments/1kb0rp8/i_finally_saw_the_conan_the_barbarian_movies_and/"
    }
]