[
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 23,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1lyb0yq",
        "author": "Altruistic_Lad",
        "title": "Dear Netflix: Registering Is Now Worse Than Tedious",
        "content": "Netflix apparently has never heard that folks can have more than one residence. Does it learn that you visit the same places over and over. Oh no. You have to jump through all the registration and security hoops OVER AND OVER despite the fact that you've paid for unlimited use. Wake up, Netflix. You're not irreplaceable. ",
        "upvotes": 271,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1lyb0yq/dear_netflix_registering_is_now_worse_than_tedious/"
    },
    {
        "id": "1lyjmqm",
        "author": "Yaaaargh",
        "title": "The OA",
        "content": "Holy shit, just bring back the OA and finish the series already.  You know that's what everyone wants and the only reason we are keeping our subscriptions.  C'mon.",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lyjmqm/the_oa/"
    },
    {
        "id": "1ly50vd",
        "author": "STARRIMS",
        "title": "LUPIN is my most favorite series ever.",
        "content": "I have tried so many series in Netflix, and I don't even last one episode; from Money Heist to House of Cards to Dark. Whereas I was so Intrigued to Lupin in 2023, I login Netflix just to Re-Watch LUPIN again and again.\n\nI even stared reading Arsene Lupin and love my time in it. Eagerly waiting for Lupin part 4.\n\n  \nI am just asking who explore Netflix a lot, is there anything alike LUPIN?",
        "upvotes": 46,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1ly50vd/lupin_is_my_most_favorite_series_ever/"
    },
    {
        "id": "1lyi1um",
        "author": "Beastmaster122810",
        "title": "It has no right to be as good as it is",
        "content": "",
        "upvotes": 7,
        "comments": 5,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/p0n96mk91kcf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1lyi1um/it_has_no_right_to_be_as_good_as_it_is/"
    },
    {
        "id": "1ly3h6v",
        "author": "BackgroundEscape9250",
        "title": "Wtf should I watch",
        "content": "I have been trying to find a good series on Netflix (located in EU) but after the first episode I can’t focus because it’s so boring. \n\nWhat i like to watch: \n\n- Brooklyn 99\n- Ghosts  \n- Tires \n- The residence \n- Arrested development \n- A shop for killers \n- Sirens \n\nSomething like the above, please. Yesterday I ate my whole burrito just surfing Netflix trying to find something. My food gets cold. Pls help. ",
        "upvotes": 41,
        "comments": 113,
        "media": null,
        "permalink": "/r/netflix/comments/1ly3h6v/wtf_should_i_watch/"
    },
    {
        "id": "1lyml7v",
        "author": "choco_covered_mango",
        "title": "ESLs how are the English subtitles for shows in your primary language?",
        "content": "I enjoy a lot of the Korean variety shows on Netflix. I am fluent in Korean but for my wife, Korean is her third language so she likes to have English subs on. I grew up watching a lot of foreign tv with subtitles and when it comes to Korean, I can both hear and passively read every word. I am baffled by some of the subtitles. it's not just bad, they straight up make up entire sentences that were not said. like someone will say \"hmm\" and the subtitle will say something like \"oh that's terrible\" I understand not translating puns or expressions or culturally specific things. but sometimes they add unnecessary fillers that change the context. sometimes it feels like someone who barely understands Korean is using google translated english and making up fillers here and there.\n\nhow are the English subs are for other languages? I'm mostly asking about variety tv shows, not dramas or movies. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lyml7v/esls_how_are_the_english_subtitles_for_shows_in/"
    },
    {
        "id": "1lym7iq",
        "author": "Classic_Mix_3126",
        "title": "Building a band",
        "content": "I love the show, and even more cause Aj McLean is the host. However the fact that some of the contestants keep bringing up being like NSYNC, growing to be like them or like them. DONT DESERVE TO MOVE FORWARD. Cause they already wanna fail in life. NSYNC failed. And they’re in the presence of a Boy Band legend AJ from Backstreet Boys. A band that’s thriving through the decades. Like NSYNC has one okay song and you wanna be a one hit song breakable dumb band? Already talking like failures ngl. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lym7iq/building_a_band/"
    },
    {
        "id": "1lyjgk6",
        "author": "Fangirl365",
        "title": "Having trouble searching for games",
        "content": "Hi, my friend wants to play Cozy Grove, but for whatever reason, it's not showing up for him in the game section. I'm not sure if it's a search issue on Netflix's end, but it seems like the game isn't even being shown because the algorithm doesn't think it's his interest. Has anyone else found a way around this and been able to download a game they aren't easily presented with?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lyjgk6/having_trouble_searching_for_games/"
    },
    {
        "id": "1lyj3i6",
        "author": "0xw00t",
        "title": "Which Netflix plan is better to watch a series from iPhone?",
        "content": "Hey, I know it’s going to be the most preposterous question ever but am going to purchase a Netflix plan for the first time, I usually *cough* download *cough* from somewhere. But sideloading an app now and doing all those things take unnecessary time so I just thought I will purchase a subscription to watch one specific series. \n\nAm someone who always likes to watch the series in highest quality only. Because of this, now am confuse that I should go for Basic (720p), Standard (1080p) or Premium (4K + HDR). Just to be precise, I have iPhone 14 Pro Max, am not sure which plan I should take. \n\nOn a side note, if you wonder why I created such an absurd post then I like to highlight that am indecisive person so… 😅",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lyj3i6/which_netflix_plan_is_better_to_watch_a_series/"
    },
    {
        "id": "1lxmun8",
        "author": "Few_Substance_705",
        "title": "\"Too much\" is just \"Girls\" repackaged and its cringe and out of touch.",
        "content": "HOT TAKE!! I am yet to meet the Lena Dunham/ Girls Stans. \n\nFor the life of me I couldn't understand who resonated with \"Girls\" the entire premise was a selfish, spoiled jewish chick who made terrible decisions and then became the victim of her own sabotage. Fast forward to I was on a 9 hour flight last night and downloaded \"too much\" on Netflix, within the first few mins it felt familiar. And then when I saw Lena Dunham in the second episode It hit me. The main character is Lena Dunham in \"Girls\" and this entire show is \"Girls\" repackaged and set in London. EVEN her love interest looks and acts like exactly Adam!! \n\nThe worst part is in an interview Lena Dunham said this show was meant to resonate with Gen Z. How???!! I am a millennial who works in marketing and even I know Its so out of touch! ",
        "upvotes": 149,
        "comments": 394,
        "media": null,
        "permalink": "/r/netflix/comments/1lxmun8/too_much_is_just_girls_repackaged_and_its_cringe/"
    },
    {
        "id": "1lyi8lm",
        "author": "smetwz2112",
        "title": "Subtitles appearance",
        "content": "Hii, hope I did the right flair!\n\nSo I just signed up today after two years of not using Netflix at all (now is my own account, not shared) and I have come across an inconvenience: I can't change the subtitles appearance.\n\nI have tried changing them like 10 times now from my browser and it shows the same one on the app regardless.\nIt's a bit annoying since I remember in the past I could just change it on the browser, refresh and it would show the new one now selected. And it's a problem for me since I watch a lot of foreign content with english subtitles (I'm learning) and the one font it has now it's hard for me to read haha\n\nI'm on my phone. iPhone device. Is there something I'm doing wrong?\n\nSorry for any mistakes ;)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lyi8lm/subtitles_appearance/"
    },
    {
        "id": "1lxv5kx",
        "author": "S4v1r1enCh0r4k",
        "title": "Squid Game Creator Keeps Door Open for Season 4: \"Never Say Never\"",
        "content": "",
        "upvotes": 29,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1lxv5kx/squid_game_creator_keeps_door_open_for_season_4/"
    },
    {
        "id": "1ly62op",
        "author": "Second-Fickle",
        "title": "Too much on Netflix",
        "content": "What a beautiful series !!! \nLove every scene every episode \nFlashbacks of past lives , memories , emotions and the characters \nWhat are your fav scenes \n",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ly62op/too_much_on_netflix/"
    },
    {
        "id": "1lygv14",
        "author": "PrimaryMental7068",
        "title": "Where has everything gone",
        "content": "I was going to continue watching my movie and all the movies and shows not made by Netflix are gone for some reason \nPlease help I just Want to watch the matrix🙏",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lygv14/where_has_everything_gone/"
    },
    {
        "id": "1lyglk0",
        "author": "ladybug188",
        "title": "Cant log in",
        "content": "I have my Netflix account opened on me and siblings mobile but when im trying to open on my pc it keep leading me to making new account/membership \nLike asking card details and saying start membership \nI just wanna log in into my existing account ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lyglk0/cant_log_in/"
    },
    {
        "id": "1ly6ka4",
        "author": "Makuta_Servaela",
        "title": "Suggestions for Drama Shows like House that are good for Listening",
        "content": "I need something to listen to while I work, that I don't have to watch directly. I've watched through House and The Resident so far, the former being perfect for what I needed (The Resident's romancy side-plots were a bit boring for me). The things that made House perfect was:\n\n- Serious overall show with some comedy/wittiness. (No Sitcoms or pure comedies or whatnot. I like a good plot).\n\n- Each hour episode has its own story. The season has an overall storyline, but each episode itself has its own story that is concluded by the end of the episode. (So, no Audiobooks or Podcasts)\n\n- The mystery element, where the protagonists are spending the episode trying to figure something out, and the something is satisfyingly figured out by the end of the episode.\n\n- Most importantly: The protagonists describe what's going on. In House, the characters would describe down to the detail each symptom they were seeing, the ways the diseases affected the patient, etc. \n\n- Also, I know there's one or two that are basically \"House, but it's about Psychiatry\". None of that. I am in the field of Psychology, I would be too offput by the inaccuracies.\n\nAny suggestions?\n\nI might try out one of those lawyer detective ones, like Law and Order or whatnot, but I don't know which ones of those would be a good fit. But open to other suggestions as well.\n\nThank you!",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ly6ka4/suggestions_for_drama_shows_like_house_that_are/"
    },
    {
        "id": "1lyg5lv",
        "author": "Eastern-Rabbit-3696",
        "title": "Brick (2025)?",
        "content": "I swear to god this movie has been on Netflix's \"worth the wait\" list for what has been like 4 years now and they put out a trailer only a week or so ago.\n\nThey gave some sort of vibe that it was going to be a chamber piece w/ a couple stuck in an apartment with a brick wall but it just turns out to be some kind of Temu Cube mess. I wonder what happened?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lyg5lv/brick_2025/"
    },
    {
        "id": "1ly2uid",
        "author": "DependentWise9303",
        "title": "The real Project X",
        "content": "Spoiler alert! So many things to say here. \n\nFirst of all are these grown as* men so proud of themselves so many years later. Also this POOR girl whose birthday has now been forever connected with the death of two innocent women. \n\nWhen she said the line at some point my dad was called and told two girls died and hee facial expressions from knowing shes filmed to wanting to break down to trying to numb herself man I felt this in my core. \n\nMy cousin died on my birthday 10 years ago - she was sick her entire life and I still have nightmares about it. \n\nBut one thing that impressed me is how the Dutch no thanks to the useless major and cops cleaned up their own town the day after. This is something I see in Netherlands/ Sweden that I really feel we can learn from. \n\nResponsibility and community. \n\nAnyway overall i enjoyed the entire series one by one and the ones i didn’t know about even more than Astro world which I already knew about. \n\nPoop cruise ie prob still number one but its a good series albeit filled with what not to do. Unfortunately we know humans and history has a way if repeating itself. ",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ly2uid/the_real_project_x/"
    },
    {
        "id": "1lye0xf",
        "author": "SoMuchEpic95",
        "title": "Ads while watching Netflix.",
        "content": "Sometimes I feel like I hit the jackpot and I don’t see any ads at all while I’m watching something. And then other times there’s a two or three minute ad sequence every 10 or 15 minutes during my show.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lye0xf/ads_while_watching_netflix/"
    },
    {
        "id": "1lydsbh",
        "author": "bailsjay19",
        "title": "Algorithm",
        "content": "Surely there is a way of making the algorithm realise that I have watched certain shows and to stop them coming up again and again, \nthe only section this should be in is watch again but so many shows will show up in every category of the algorithm even though I have completed the series years ago….\nI feel it’s hard to even concentrate on finding a new show to watch as all the subscription services seem to have made such a mess of there algorithms \nAgree or disagree? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lydsbh/algorithm/"
    },
    {
        "id": "1lyd6ts",
        "author": "Kjayden69420",
        "title": "Looking for more shows to watch, suggestions?",
        "content": "We have more than just Netflix, so far my fiance and I have watched Ginny &amp; Georgia, shameless, the last of us, and you. We have very different tastes but are looking for middle grounds, we want shows similar to these but we love the chaos of shameless. We will look into any recommendations, but she does not watch movies so just stick to shows. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lyd6ts/looking_for_more_shows_to_watch_suggestions/"
    },
    {
        "id": "1lyd5bx",
        "author": "JamesMason580",
        "title": "Netflix Household Issue",
        "content": "Bit of backstory, currently living in RV for work a few states away, traveling home when I can \\~once per month.\n\nMy wife and I have been watching Grey's Anatomy on Netflix together for along time now, however as of \\~one month ago, we cannot do this anymore, one of us gets a message saying the TV is not part of the Netflix household. If we change the household, it kicks the other person off and makes them do the same thing. I cannot even AirPlay to the TV or Cast anymore, Netflix blocks it in app or just won't play the episode.\n\nI may have dealt with this until the point where I called customer service on the Netflix app, and after going back and forth with the CSR for a bit, with them trying to tell me I could click the \"I'm away from home\" option (which there was not on the TV), then telling me there was absolutely nothing they can do, no one to escalate to, and that the only thing he could do was \"educate (me) on the way Netflix works now)\". I hung up at that point, and canceled my subscription.\n\nSorry Mr. No-Name CSR, I don't require your education, we'll find something else.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lyd5bx/netflix_household_issue/"
    },
    {
        "id": "1lycl7t",
        "author": "ResolutionPretty8249",
        "title": "Netflix glitching for only one show",
        "content": "Hey guys thought this was fun (not really). Wanted to watch The Girl in the Mirror but every time I click it it starts playing the first episode and I can't see the menu or synopsis or episodes. And it just starts over not even from the beginning. I can't fast-forward or rewind. Thought you guys would love to see it.",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/hot6p2yzoicf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1lycl7t/netflix_glitching_for_only_one_show/"
    },
    {
        "id": "1ly1xc6",
        "author": "Intelligent-Law-5066",
        "title": "Fubar Season 3? Donnie and Carter",
        "content": "I am not sure everyone feels about Season 2 but although there is the ridiculous aspects of it (bumping off satellite etc.) I still generally enjoyed the show and hope there is a Season 3. \n\nBut what I kinda of liked was Donnie and Carter 'adventure' I mean I wouldn't mind like a spinoff for them. Not sure how those 2 will return for Season 3 lol.",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ly1xc6/fubar_season_3_donnie_and_carter/"
    },
    {
        "id": "1lxyv51",
        "author": "Horror_Low_6881",
        "title": "Want some suggestions being new on netflix",
        "content": "what are some shows and movies would you recommend I also like animes. I have not used netflix before so I was wondering what is worth watching I already know popular names like money heist, demon slayer, squid game etc.. Still curious recommend me your favs and some underrated and niche titles as well",
        "upvotes": 6,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1lxyv51/want_some_suggestions_being_new_on_netflix/"
    },
    {
        "id": "1ly86q2",
        "author": "crosstheroom",
        "title": "Does King of Tupelo get any better?",
        "content": "It was a struggle just to get thru the first episode.  Seemed like a lot of nothing happening and Elvis nonsense and didn't get any better by the end, but if it does get better let me know.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ly86q2/does_king_of_tupelo_get_any_better/"
    },
    {
        "id": "1lxjvp7",
        "author": "No_Restaurant9741",
        "title": "Just started watching Alice in borderland",
        "content": "Wanted to fill the empty hole I had since Squid Game ended so started watching Alice in borderland. Currently on episode 3 and I am going into the series completely blind.",
        "upvotes": 40,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1lxjvp7/just_started_watching_alice_in_borderland/"
    },
    {
        "id": "1ly5uy3",
        "author": "UnlitBlunt",
        "title": "Why does the brightness slider only effect subtitles and not the actual brightness of the picture?",
        "content": "On mobile (Google Pixel 9) when adjusting the brightness slider on the side of the screen only the subtitles and menu get brighter while the picture does not. Changing the brightness on my actual phone does nothing either. This has been going on for years across various devices, is there a fix for this? ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ly5uy3/why_does_the_brightness_slider_only_effect/"
    },
    {
        "id": "1ly5uos",
        "author": "filipduki1222",
        "title": "Top Characters in Squid Game",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ly5uos/top_characters_in_squid_game/"
    },
    {
        "id": "1lxzm1p",
        "author": "Significant_Two_7727",
        "title": "Netflix recommendations",
        "content": "Iso documentary true crime recommendations on Netflix. I just recently went back to Netflix cause it had got boring after awhile but I see it has hooded some  good stuff to it now.. I just watched last night the documentary of Fred &amp; rose west &amp; I never heard of them before.. it was a good one &amp; I love true crime, so looking for more to watch that haven't seen yet. ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lxzm1p/netflix_recommendations/"
    }
]