[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 28,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pgdmxt",
        "author": "Swamp_Hawk420",
        "title": "Canceling my subscription, this is too ridiculous",
        "content": "I’m traveling right now about a thousand miles from home. It’s late, I can’t sleep, tried to throw on a movie, and got notified that Netflix has decided that I’m trying to commit fraud by watching tv outside of my house. The account is linked to my wife’s email so I can’t get the temporary password. The fact that they treat us like we’re trying to steal from them after paying so much is just a bridge too far. ",
        "upvotes": 73,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1pgdmxt/canceling_my_subscription_this_is_too_ridiculous/"
    },
    {
        "id": "1pfrgbk",
        "author": "Large-Weight6213",
        "title": "Most pointless update ever: casting",
        "content": "Netflix has removed the ability to cast from our devices to our TV. I'm actually raging and wondering if this is just a trial, because even if this was a cash grab it does not even make sense.\n\nCasting is the only way I can watch shows with my partner. What is the point of even having a subscription in this case?",
        "upvotes": 191,
        "comments": 82,
        "media": null,
        "permalink": "/r/netflix/comments/1pfrgbk/most_pointless_update_ever_casting/"
    },
    {
        "id": "1pfzosx",
        "author": "Odd_Campaign_2031",
        "title": "Diddy documentary- US jury system?",
        "content": "I’m watching the last episode of the Diddy doc and as someone not from the US, I’m quite confused by the whole jury thing.\n\nMy countrys legal system does not have juries, so to me it seems weird that 12 random people decided on Diddys fate and this case. Is there not a judge present or a team of judges that gets to decide the final verdict?\n\nI find the two jurors in the episode don’t seem that smart and like they could easily be coerced/ that their subjective values played a huge role in their decision. I always thought that the foundation of a solid legal system is that we have highly intelligent professionals who have been trained and educated for years, who chose to dedicate their lives to upholding the law, and have gone through a rigorous process to become a judge, making important decisions over people’s lives. So I’m quite shocked by the idea of just choosing random people from the general population, to make decisions like this..\n\nBut maybe someone can explain more about the legal side of how the jury system works and why it is in place in the US.",
        "upvotes": 38,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1pfzosx/diddy_documentary_us_jury_system/"
    },
    {
        "id": "1pfphza",
        "author": "perpetualsadnes1",
        "title": "Sean Combs: The Reckoning Documentary",
        "content": "What was your take on the documentary?\n\nWas anyone else absolutely livid at the jurors for what they were saying? I dont think justice was served at all.",
        "upvotes": 116,
        "comments": 124,
        "media": null,
        "permalink": "/r/netflix/comments/1pfphza/sean_combs_the_reckoning_documentary/"
    },
    {
        "id": "1pgaqgl",
        "author": "Cool_Class657",
        "title": "Why am i getting no ads with the ads plan?",
        "content": "Im not complaining about getting no ads, it's just that im confused since i usually never get this ever on netflix since my subscription, is it because of the month or is it just like that?",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pgaqgl/why_am_i_getting_no_ads_with_the_ads_plan/"
    },
    {
        "id": "1pfy1qj",
        "author": "LilNello1",
        "title": "Jay Kelly",
        "content": "I ended up watching last night the new Jay Kelly movie starring George Clooney and Adam Sandler and really enjoyed it a lot.  Easily among my favorite movies of the year and both George as Jay Kelly and Adam Sandler as his manager Ron were absolutely brilliant in it.  Clooney was tailor made for Kelly and I don’t think anyone else could have played him as brilliantly as he did.  The movie itself is such a fun rollercoaster ride of emotions and depth that nearly brought me to tears towards the ending.  I think partially cause of how many of my own memories are tied to movies throughout the years and how film and/or movies were a big part of mine and my Dad’s (R.I.P. 🙏🏼) relationship over the years prior to his unfortunate passing a little over 5 1/2 years ago.  Without giving away too many spoilers, if any, for those who have not watched it yet.  What are people who have seen its thoughts on the movie and what did you like or not like about it?",
        "upvotes": 25,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1pfy1qj/jay_kelly/"
    },
    {
        "id": "1pg0ryb",
        "author": "Global-Citron-56",
        "title": "Is \"THE NIGHT AGENT\" the most compulsive Netflix series in a long time?",
        "content": "began with \"one episode\" and ended up halfway through the season 😅  \nEvery episode makes you click \"Next\" because of its quick plot, lack of filler, and constant tension.  \n  \nHave you also binge-watched it?  \nWhich other Netflix series made you want to watch \"just one more episode\"?",
        "upvotes": 16,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1pg0ryb/is_the_night_agent_the_most_compulsive_netflix/"
    },
    {
        "id": "1pg7835",
        "author": "bunnylover50",
        "title": "What are your favourite shows? I need recommendations since I just finished stranger things lol",
        "content": "My favourite show is stranger things and I want to find a show similar to stranger things since I just finished it lol. I’m looking to find a horror themed show to watch any recommendations will be appreciated!",
        "upvotes": 5,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1pg7835/what_are_your_favourite_shows_i_need/"
    },
    {
        "id": "1pg82wr",
        "author": "MamaMia1325",
        "title": "Brockmire...",
        "content": "Is it worth watching? I'm a huge baseball fan and I'm halfway through the 1st episode. I like it so far. Who has watched this and would you recommend? Hank Azaria has been great in everything I've seen him in.",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pg82wr/brockmire/"
    },
    {
        "id": "1pgaif7",
        "author": "No_Calligrapher2005",
        "title": "Jay Kelly",
        "content": "Recently read a short article written by Lia Beck, Cosmopolitan and the article discussed the last line that Jay Kelly recited ….  “Then, looking directly in the camera, he says, \"Can we go again?\" Lia stated that “Obviously, this time it’s about his actual life. Oof!” The quotes were taken from Lia’s article.\n\nI thought his realization was the opposite of Lia’s. I thought as he looked around, although he saw family’s faces in the audience, I think he was more enamored with the fact of the adoration of him as an actor. Although affected by his family, I think he realized in the end his familial attachment was not as important to him as the adoration of him being one of the last “Clark Gable”\nmovie stars &amp; that was his gotcha moment. Am I totally off base? ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pgaif7/jay_kelly/"
    },
    {
        "id": "1pgdpxe",
        "author": "Supermacropenis",
        "title": "The beast in me",
        "content": "Would it be wrong to suggest that the majority of the main events in this series were set in motion due to the fact that Nile Jarvis wanted a jogging path?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pgdpxe/the_beast_in_me/"
    },
    {
        "id": "1pgaldh",
        "author": "legacykollection",
        "title": "Maybe Netflix releases Batgirl and Batman Forever: Schumacher Cut",
        "content": "I'll 100% support that deal if they do it. Not sure who exactly holds the rights of the latter, but something could be done I'm sure. A little victory for the common people and fans lol",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pgaldh/maybe_netflix_releases_batgirl_and_batman_forever/"
    },
    {
        "id": "1pfqxdk",
        "author": "No-Tooth-1882",
        "title": "Sean combs documentary and the spiritual side of things",
        "content": "\nDiddy  continued to sacrifice people around him. He SAd people, drugged people, attempted to kill people, never paid people, his very \n, over the top LUSTFUL mindset. \n\nAnd i  just wanna know spiritually did no one feel his dark energy?\nDid no body connect the dots to him being  connected to something demonic?\n\nThis man had no humanity. And i hated how he read the bible and listened to sermons even after doing all of that \n\nHis whole life is a display of mocking god\nWith his “god complex” with his “I’m above everyone” mind set. With doing evil things and doing it in the name of god. It’s disgusting \n",
        "upvotes": 14,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1pfqxdk/sean_combs_documentary_and_the_spiritual_side_of/"
    },
    {
        "id": "1pg9ntm",
        "author": "fredyouareaturtle",
        "title": "What's your favorite storyline in Love Actually?",
        "content": "After about 20 years of re-watching every Christmas, I have come to the conclusion that my favorite storyline is the couple who meets while they're working as stand-ins for a sex scene in a movie. They  have such a great connection, and of course, it's so funny that they are naked and simulating sex while casually chatting about traffic, etc.  I just found them really sweet. \n\nWhich storyline or couple is your favorite?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pg9ntm/whats_your_favorite_storyline_in_love_actually/"
    },
    {
        "id": "1pfxqfe",
        "author": "Salem1690s",
        "title": "This show never got a fair chance",
        "content": "",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pfxqfe/this_show_never_got_a_fair_chance/"
    },
    {
        "id": "1pg8odr",
        "author": "Shiny_Mewtwo_Fart",
        "title": "How to holster your weapon on red dead redemption?",
        "content": "I can’t find any options to holster my weapons. Sometimes the game will automatically holster sometimes not. I don’t want to just draw my weapon all the time to be killed by others? Also couldn’t find my inventory either. \n\niOS 17 pro max ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pg8odr/how_to_holster_your_weapon_on_red_dead_redemption/"
    },
    {
        "id": "1pfrbx8",
        "author": "Li3Ch33s3cak3",
        "title": "Looking for long medical shows like grey’s anatomy",
        "content": "I’ve already seen Grey’s Anatomy, Dr. House, and The Good Doctor, but I’m in the mood for another long medical show. I love getting invested in the characters and the drama, especially when there’s a bit of real medical content mixed in.\n\nAny recommendations for shows that dive deep into medicine and have lots of seasons to keep me hooked?",
        "upvotes": 9,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1pfrbx8/looking_for_long_medical_shows_like_greys_anatomy/"
    },
    {
        "id": "1pfstlt",
        "author": "Due_Lock_4967",
        "title": "Looking for a good movie for a family movie night",
        "content": "I’m trying to find a movie that everyone in my family will enjoy. The age range is from 15 to 48, so it’s a bit tricky to find something that appeals to everyone. We like a mix of genres, but nothing too heavy or too childish.\n\nAny suggestions for a great family movie on Netflix that hits the sweet spot for all ages?",
        "upvotes": 7,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1pfstlt/looking_for_a_good_movie_for_a_family_movie_night/"
    },
    {
        "id": "1pfrd99",
        "author": "Timewilltell755",
        "title": "I wanted to like Jay Kelly?",
        "content": "But the dialogue was just not natural.  I didn’t feel much chemistry with between anyone.  The dialogue between Adam Sandler and Laura Dern about her leaving him at the Eiffel Tower 19 years ago was just so contrived and kind of ridiculous.  ",
        "upvotes": 8,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1pfrd99/i_wanted_to_like_jay_kelly/"
    },
    {
        "id": "1pg6h7f",
        "author": "xLUNCHTREYx",
        "title": "Netflix on Xfinity Flex Box Won’t Show 4K — Only HD Even With Premium Plan",
        "content": "I’m having an annoying issue with Netflix on my Xfinity Flex box and I’m hoping someone here has run into this before.\n\nI’m paying for the Netflix Premium plan, which includes 4K streaming, but on the Flex box Netflix only shows content as HD, not 4K/UHD. No “Ultra HD” tags show up anywhere.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pg6h7f/netflix_on_xfinity_flex_box_wont_show_4k_only_hd/"
    },
    {
        "id": "1petx4m",
        "author": "TheMirrorUS",
        "title": "BREAKING: Netflix acquires Warner Bros in $83 billion deal after tense bidding war",
        "content": "",
        "upvotes": 959,
        "comments": 244,
        "media": null,
        "permalink": "/r/netflix/comments/1petx4m/breaking_netflix_acquires_warner_bros_in_83/"
    },
    {
        "id": "1pg1qv1",
        "author": "slybutshyyy",
        "title": "Netflix Games",
        "content": "I have the TCL 55 Inch 55P6K Smart 4K UHD HDR DLED TV, which I think is a relatively up to date smart tv? I cant play the netflix games. It showed up on my netflix a few weeks ago and then disappeared. I have to use the search bar to find the games offered as it doesn't show on my home screen but when I click on them it'll say \"can only be played on selected tvs\". Any advice?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pg1qv1/netflix_games/"
    },
    {
        "id": "1pfkqhc",
        "author": "DismalShallot2513",
        "title": "Addictivness of TV shows",
        "content": "I assume everybody here is aware of the release of the new season of \"Stranger Things\", so I'm no different and decided to watch it as soon as someone told me about it.\n\nI'm not a big a fan of watching any kind of TV shows — at most I would watch a movie once a month and that's pretty much it. And the thing that got me really confused about this new season of Stranger Things is that it's not even the plot, or atmosphere that makes you binge watch it as soon as you finish 1st episode — it's the effects, cuts, timing and how it's put together that makes you want to watch it.\n\nLet me cllarify it for you: when you watch movies (or some TV shows too, like Better Call Saul) from 10-20 years ago like Matrix, Inception, Shutter island you just want to keep watching it because of how amazed you are by the plot and the twists are so unpredictable that you have these \"a-ha\" moments where you picture the whole image in your head with the wow effect.\n\nIn case with this new season though, the plot itself seemed okay to me, but while watching it I had a feeling that I'm watching tiktok lol. Just how fast-paced it seemed to me and the constant change of the enviroment, going back and forth between characters. As soon as you supposed to get bored and chill, produecer hits you with another dopamine hit to keep you engaged. So after watching first episode I turned it off as I knew where it was leading — watching it until 4 am.\n\nIf that't the case, it's not necessarily a bad thing — they are just evolving to attention span of its users and that's it.\n\n**Is it just my observation or there's somebody else who also felt that way? How do they make them so addictive to keep watching and what are the tricks that are using?**",
        "upvotes": 12,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pfkqhc/addictivness_of_tv_shows/"
    },
    {
        "id": "1pfnlwk",
        "author": "dee_palmtree",
        "title": "Does anyone have a list of -true- Netflix original series and movies?",
        "content": "There are a lot of movies and TV shows on Netflix that are aquired or produced by another studio and Netflix just puts them out on their service (Kpop demon hunters for example, which was actually created by Sony). But I'm wondering about true Netflix movies and series that are distributed by Netflix themselves. Shows like Orange is the New Black, House of Cards, The Crown, Stranger Things, etc. Or, more recent films like Jay Kelly, Train Dreams etc. Then there are also a lot of shows that are aired on other streaming platforms or networks but are labelled as \"Netflix Originals\" in other countries (like Riverdale etc). \n\nI just like to watch more Netflix originals (movies + shows) that are really by them. There are a lot of movies released on Netflix almost weekly and I'd just want to make it easier to search. Thank you!",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pfnlwk/does_anyone_have_a_list_of_true_netflix_original/"
    },
    {
        "id": "1pfgn40",
        "author": "Dark_Schneider28",
        "title": "\"I Am Not Okay With This\" deserves a second Season ong",
        "content": "Jjst finished watching it (ik im veryyyy latee), and the ending was crazy, I mean ik they stopped it cause of covid but didn't they continue after the pandemic stopped? Like did they just forget abt it? Shd Ik smt that I dont?. I just need a season 2😭😭",
        "upvotes": 19,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pfgn40/i_am_not_okay_with_this_deserves_a_second_season/"
    },
    {
        "id": "1pg6nl8",
        "author": "Vast-Finding9107",
        "title": "Netflix Theme Park!",
        "content": "With Netflix acquiring Warner Bro’s, imagine if there next big move was to announce a rival to universal. \n\nWhat films/shows would get a ride and what lands would there be? ",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1pg6nl8/netflix_theme_park/"
    },
    {
        "id": "1pfyldq",
        "author": "enzxswrld",
        "title": "TV House",
        "content": "So I’m using my uncles account for watching Netflix on my TV. Back then it didn’t work because of the house plan issue, sometimes it works and lets me watch an episode sometimes it doesn’t and there’s a pop up.\n\nAnyone know why this happens? Or if there’s a fix?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pfyldq/tv_house/"
    },
    {
        "id": "1pfxa4i",
        "author": "Fit_Bee367",
        "title": "I need quick recs :)",
        "content": "Hi \n\n\nI want an English TV series (preferably British), just one or two seasons, and it has to be enjoyable. I like romance and **drama** in general but I will be fine with anything good, I also like slow burn \n\n\nI liked the gentlemen, dead poet society, and me before you, the hating game, divergent (Ik there’re movies but I like this vibe) ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1pfxa4i/i_need_quick_recs/"
    }
]