[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 490,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1hvlmba",
        "author": "EthanWilliams_TG",
        "title": "Watch Hulk Hogan Get Booed by Fans During WWE's Netflix Debut",
        "content": "",
        "upvotes": 2231,
        "comments": 368,
        "media": null,
        "permalink": "/r/netflix/comments/1hvlmba/watch_hulk_hogan_get_booed_by_fans_during_wwes/"
    },
    {
        "id": "1hw2xuq",
        "author": "Ill_Dependent1389",
        "title": "Love these BTS Squid Game 2 🫰",
        "content": "",
        "upvotes": 27,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hw2xuq/love_these_bts_squid_game_2/"
    },
    {
        "id": "1hvtr13",
        "author": "anonymous-user1234",
        "title": "Why wasn't Steve Wilkos brought up on Netflix Jerry Springer documentary?",
        "content": "Title says it all. Just finished the Netlix documentary and not sure why such an integral aspect and figurehead of the show wasn't mentioned once. Weird. ",
        "upvotes": 41,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1hvtr13/why_wasnt_steve_wilkos_brought_up_on_netflix/"
    },
    {
        "id": "1hw71rk",
        "author": "BriefSurround6842",
        "title": "Season 2 of Squid Games (no spoilers)",
        "content": "Wow. The initial episode and scenes before the games were kind of a drag and I immediately looked up online \"Season 2 Squid Games boring\". I saw a lot of people complaining so I almost didn't want to watch and lost interest. I kept watching through my boredom, and once it got to the games, I was so glad I didn't quit. This season was extremely edge of your seat, anxiety inducing, and emotional.\n\nI cried multiple times and became attached to some characters hoping that they would survive. Some scenes I quite literally had to skip through, because they gave me so much anxiety and heart racing anticipation I couldn't stand it... in a good way. I felt sick to my stomach at points and felt like I was almost there in the games. It was a great mix of fear, sadness, and desperation. The characters were developed with such personality.\n\nI was kind of disappointed at the cliff hanger and hoping for more soon. I can't say it was better than the first season because I felt like the first was interesting throughout and left such a lasting impact. But for a second season... I am pleased. I was a little confused about the story line but I think it's funny that the characters I ended up liking, became the main characters.\n\nThey did great with the development and action. They kept me guessing what was going to happen. I rate it an 8/10! It would be 10/10 for me, if the beginning was shortened a little and more to the point. It's amazing that a show and actors can cause you to genuinely feel for the characters and root for them and that's something I always look for in a show.\n\nWho was your favorite character(s)? Mine were #222, #120, #095, and the mother son duo. I liked #456's whole squad! ",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hw71rk/season_2_of_squid_games_no_spoilers/"
    },
    {
        "id": "1hvvtl5",
        "author": "daily_mirror",
        "title": "Netflix's Squid Game fans debunk viral theory linking Front Man to surprise character",
        "content": "",
        "upvotes": 16,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hvvtl5/netflixs_squid_game_fans_debunk_viral_theory/"
    },
    {
        "id": "1hvp43v",
        "author": "MonkeyTacoBreath",
        "title": "So this may just be a personal pet peeve, but the show/movie playing when you just want to read the description bugs the heck out of me.",
        "content": "My main issue is that because the show/movie started playing as I read the description, even if I back out 3 seconds later, that title is now in my continue watching tab. And I have to manually go remove it. \n\nI have auto play trailers and shows turned off. This happens on all platforms that I have access to, Xbox, PC, and Android.\n\nAnyone else get bugged by this \"feature\" or some other pet peeve?",
        "upvotes": 35,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hvp43v/so_this_may_just_be_a_personal_pet_peeve_but_the/"
    },
    {
        "id": "1hvxlsm",
        "author": "indiewire",
        "title": "The 7 Best New Shows on Netflix in January",
        "content": "",
        "upvotes": 9,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hvxlsm/the_7_best_new_shows_on_netflix_in_january/"
    },
    {
        "id": "1hvmdi7",
        "author": "Robemilak",
        "title": "Hwang Dong-hyuk praises T.O.P's performance in ‘SQUID GAME’ Season 2 after the actor got no work in the Korean entertainment industry for 9 years after he was arrested for smoking weed. ",
        "content": "",
        "upvotes": 38,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hvmdi7/hwang_donghyuk_praises_tops_performance_in_squid/"
    },
    {
        "id": "1hvt0cj",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix’s Terrifying German AI Horror Show 'Cassandra' sets February 6 release date and showcases new teaser",
        "content": "",
        "upvotes": 9,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hvt0cj/netflixs_terrifying_german_ai_horror_show/"
    },
    {
        "id": "1hw81jw",
        "author": "amigoreview",
        "title": "Netflix Ultra HD - Australia: question",
        "content": "Anyone in Australia using Netflix’s Ultra HD plan? \n\nAre you experiencing resolution issues with 4K content? Dolby Vision isn’t kicking in for me… it’s stuck in HD SDR for 4 days now. My devices are fine.\n\nCould anyone confirm if they’re facing the same?\n\nThanks!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hw81jw/netflix_ultra_hd_australia_question/"
    },
    {
        "id": "1hvwshq",
        "author": "pennywise1988",
        "title": "Strangest thing ever",
        "content": "Since the start of the new year I started binge watching Schitt's Creek on my German Netflix. I got to the beginning of season 4. All of a sudden, last night, on the app on my Smart TV the card for Schitt's Creek is there, but it says \"Remind me when it is released\" and I no longer can play it. I checked and the same happened now with Young Sheldon.\n\nAre the rights disputes and they removed shows just as they were added to German Netflix??",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hvwshq/strangest_thing_ever/"
    },
    {
        "id": "1hvshpq",
        "author": "South_Drawer_9551",
        "title": "Weird Issue with Netflix",
        "content": "There's this weird issue I am having with Netflix (desktop and mobile). On my profile, it shows only season 2 of ninjago dragons rising, but on my sister's profile it shows both seasons.\n\nBoth are in the same region (US) and under the same account.",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hvshpq/weird_issue_with_netflix/"
    },
    {
        "id": "1hw62aq",
        "author": "RockyPS2Glitches",
        "title": "Gabriel Iglesias: Legend of Fluffy",
        "content": "Just got done watching Gabriel Iglesias' new Netflix special, \"Legend of Fluffy\", and as someone who was a big fan of Gabe in the past, this special was so disappointing. Outside of the usual \"thank you\" and \"name drop shout outs\" he gives, he had a few jokes that went on for way too long (the gun shop bit with Jim), along with some recycled jokes from past specials, like the themed weeks and Krispy Kreme jokes. \n\n\n\nPlus not to mention the constant bragging about having fans, being famous, being rich. Like, we get it, dude. I swear, it seems like his material hasn't been interesting since he got the divorce and Frankie moved out, and I think plenty of people probably feel the same way also. And the crowd got annoying at times during the special too. Like almost ever word he said evoked an applause from the audience, and I think he got more cheers than laughs that night there were so many!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hw62aq/gabriel_iglesias_legend_of_fluffy/"
    },
    {
        "id": "1hw52fw",
        "author": "Ileryon3000",
        "title": "Captain Fall heroes. Gather up .hear me out.",
        "content": "I personally spoke with director. He needs around 50 or 60k. Right now I am gathering as many fans as possible before setting it up!!! We have a discord server if interested.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hw52fw/captain_fall_heroes_gather_up_hear_me_out/"
    },
    {
        "id": "1hw3jc0",
        "author": "KGNickl",
        "title": "Profile maturity rating changed on its own?",
        "content": "Just recently my my sons profile changed from pg to all maturity. I went onto the computer and switched it back. Today the same switch has occurred. My kid does not have access to the computer to be able to log into my account to change it. Also, when I went in to change it on the computer I had to type in my full password each time I adjusted the maturity settings. \n\nI understand most replies will be one of my kids is doing it.... watch your kid.... which is not needed. He was actually confused why his TV had all sorts of new options that didn't look like his shows....\n\nI'm just asking if there is another way to change or update this setting other than logging into a computer? I could not find a way on our Roku Smart TV that he uses that I'm just overlooking to allow this. Or if there is some Netflix glitch that can cause this to occasionally occur?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hw3jc0/profile_maturity_rating_changed_on_its_own/"
    },
    {
        "id": "1hw24x9",
        "author": "Intotheparadigmshift",
        "title": "Jerry Springer Documentary",
        "content": "For almost 25 years, Jerry springer aired and entertained me as a child and I loved it! I was in for it. I’ve been having Netflix since when it came out. And I am in absolute love with Netflix documentaries. But damn did they do a horrible job on this documentary. I mean everyone on this project has to be fired it was horrible.\nFor 25 years all they got was, JS in a 3sum, a murder that took place after the show and criticism of hate about the show for cancellation. That’s it!? That’s all this crew got? Disrespectful. Shameful. I disliked this documentary and Netflix was like whaaaaaat? You disliked this doc? lol cause it wasn’t saving my dislike. Jerry springer episode was more interesting than this trash of a documentary. I have bad taste?\n• into the fire\n•don’t fuck with cats\n•marduagh murder\n• I am a killer\n• Last Chance U\n• The disappearance of Madelienne McCann\n• The Trial of Gabriel Fernandez\n• American Nightmare\n• Tiger King\n• Chefs Table\n• the Last Dance\n• The Nightcrawler\n• American Murder\n• The Tinder Swindler\n• The Hatchet Wielding Hitchhiker\n• Bitconned\n•Our Father\n• How to Rob a Bank\n• Why Did You Kill Me\n• Athlete A\n• Long shot\n• The 3 deaths of Marisela Escobedo\n• Tupelo\n\n\nJust a bit to reference off of so yall know what kind I like and watch. ",
        "upvotes": 1,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1hw24x9/jerry_springer_documentary/"
    },
    {
        "id": "1hvhytx",
        "author": "DontWanaReadiT",
        "title": "Anyone watching The Later Daters??",
        "content": "I’m only 31 but I’m finding this show so incredibly refreshing!! It feels so real, authentic but also I’m learning a lot of things about myself just by watching this. This is light years better than any other dating show for people my age and younger. These adults know what they want and aren’t afraid of being vulnerable like they used to be when younger. ",
        "upvotes": 22,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1hvhytx/anyone_watching_the_later_daters/"
    },
    {
        "id": "1hvo702",
        "author": "Robemilak",
        "title": "Medical Drama ‘The Trauma Code: Heroes on Call’ Gets a Teaser: Releasing January 24",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hvo702/medical_drama_the_trauma_code_heroes_on_call_gets/"
    },
    {
        "id": "1hvqyvv",
        "author": "shapy_d_livery",
        "title": " Help! Why Does Netflix Pause When Skipping",
        "content": "I'm having an issue with Netflix on my MacBook when using Safari. Whenever I press the forward or backward buttons to skip ahead or rewind, the video pauses instead of playing smoothly. I have to press play again manually every time, which is super annoying.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hvqyvv/help_why_does_netflix_pause_when_skipping/"
    },
    {
        "id": "1hvndtt",
        "author": "RedditM0ds",
        "title": "Squid Game 2 &gt; Squid Game",
        "content": "Yes the original was good! But this second one really floored me! So much witty editing and camera work. Really fantastic cast. Everything turned on its side, and very tastefully, naturally. A deconstruction that isn’t hamfisted!  Also really great character stuff in 2. If anything I wish there was more resolution to the shootas on the boat (knew it was the Captain immediately lol). But I am looking forward to seeing the third season! I like that it leaves you feeling a bit neurotic about what comes next. And I think it will age incredibly well. What an incredible job that this crew did! Also, visually very fun / horrifying to watch unfold. \nThe games appear extra cold, sterile and sinister. \n\nI really haven’t seen editing this sharp since S6 of Sopranos. It’s like a character in its own right. \n\nI am sure this season will hit a lot harder upon rewatches! I implore those of you somewhat dissatisfied to give it another try before this summer.",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hvndtt/squid_game_2_squid_game/"
    },
    {
        "id": "1hvoew2",
        "author": "WhyThaFuck",
        "title": "Standard with ads",
        "content": "Hi, guys i wanna get back on netflix again but i have a question does anyone use the standard with ads sub? Its say \"ads: less then you might think\" so i was wondering how many ads does 1 ep or 1hr movie have?",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hvoew2/standard_with_ads/"
    },
    {
        "id": "1hvfhbu",
        "author": "Corey0619",
        "title": "Korean Show from 2020 name?",
        "content": "I’m trying to find a super interesting show I saw a few years ago. It was a Korean show (I believe) about a guy that would meet with the most dangerous people in the world and chat with them over some food. \n\nOne episode he went to a really dangerous place and ended up attending a dinner with all the mafia leaders of the area\nIt was called something like “Super soup time” or something silly\n\nBonus tidbit. Gus from the rooster teeth podcast mentioned it once around 2020. \n\nPlease help me find this amazing show again Reddit 🥲\n\nUPDATE\nOmg I found it. It’s called “Hyper HardBoiled Gourmet Report”. Unfortunately isn’t on USA Netflix anymore. The documentarians pretend to film a food show in order to meet extremely dangerous people around the world. It’s so good. Thank y’all for the help and suggestions for similar shows! ",
        "upvotes": 11,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hvfhbu/korean_show_from_2020_name/"
    },
    {
        "id": "1hvhm8l",
        "author": "OkieDokie-Artichokey",
        "title": "What should I watch right now?",
        "content": "Movie or TV show. Preferably in english. If TV, preferably not a ton of seasons.\n\nOpen to either a drama or something chill/funny. I appreciate good acting.\n\nBut also feel free to stray from the parameters and recommend whatever if you think it's really good.\n\nThanks!",
        "upvotes": 6,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1hvhm8l/what_should_i_watch_right_now/"
    },
    {
        "id": "1hvhmt0",
        "author": "The_Firmament",
        "title": "Ads During Live",
        "content": "This is the first time I have checked out a live event on Netflix and the ads are RIDICULOUS. I was prepared for some, I can handle having to deal with them being in there, but the amount is ludicrous. They cut away to them in the middle of the main action, wtf?!\n\nIt's such an egregious attempt to force people to pay via annoying them to death with the ads. Not to mention people in other countries don't get those ads which makes it feel even worse. I don't know if this will be as big a money grab as they think it will or it'll just be a massive deterrent. If this is how it'll always be for lives I don't plan on watching another. ",
        "upvotes": 5,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1hvhmt0/ads_during_live/"
    },
    {
        "id": "1hvkina",
        "author": "johnreese421",
        "title": "Squid Game subtitles difference",
        "content": "1. English audio and English CC.\n2. English audio and English.\n3. Korean audio and  English CC.\n4. Korean audio and  English.\n\nIdeally, shouldn't 4 be the ideal one for english viewers to understand the original Korean audio translated directly to english ? so this would mean subtitles of 4th should be same as 2nd. ?\n\nbut I am seeing 1 and 2 as same ...and 3 and 4 as same...and each of it as a group different from other group.\\[meaning 1 &amp; 2 are showing same which together is different from 3 &amp; 4 but 3 &amp; 4 together are same\\].\n\n  \nDo I make sense ? or am I missing something here?\n\nExample Reference : Squid Game season 2 episode 5 timestamp 19:05 to 19.07 dialogue.",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hvkina/squid_game_subtitles_difference/"
    },
    {
        "id": "1hvo4aa",
        "author": "HyperTech2008",
        "title": "Netflix household not working",
        "content": "I told my friend I had Netflix, and when he asked me to share my account, I couldn’t say no directly. I thought Netflix Household would prevent him from watching anything since I had already set it up. However, when I asked him, he said it was working. I was giving him the OTP instead of sharing the password. Why isn’t Netflix Household blocking him? He lives miles away from my location and has never connected to my Wi-Fi.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hvo4aa/netflix_household_not_working/"
    },
    {
        "id": "1hvnae8",
        "author": "Objectionne",
        "title": "Does anybody know how long it typically takes for live events to become downloadable on Netflix?",
        "content": "WWE RAW and Smackdown are now streaming live on Netflix every week, but as they air at 2am in my country I'm never going to be watching them live.\n\nI was hoping to be able to download them on the mobile app first thing in the morning and then watch while I take my usual morning walk, but unfortunately I found this morning when I went to download RAW that it seems that live events aren't downloadable right away.\n\nI've checked other live events though (such as the Netflix Slam) and seen that they're downloadable, so I assume that live events become downloadable *eventually* and there's just a delay.\n\nDoes anybody have an idea of how long it typically takes live events to become downloadable?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hvnae8/does_anybody_know_how_long_it_typically_takes_for/"
    },
    {
        "id": "1hvjqq2",
        "author": "retlem",
        "title": "Commercials firming RAW on Netflix",
        "content": "Anyone catch RAW on Netflix tonight? I’m wondering how it was for the people that have the Netflix plan with ads and if it was overkill. \n\nWhat’s your thoughts on the advertisements on a paid platform?\n\nEdit: the title should say “Commercials during RAW on Netflix”. Autocorrect won this time. ",
        "upvotes": 2,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1hvjqq2/commercials_firming_raw_on_netflix/"
    },
    {
        "id": "1hvn24h",
        "author": "UnbasedDoge",
        "title": "Civilization VI (Netflix) incompatible on my device ",
        "content": "Hello everyone! As the title states: Civ VI seems to be incompatible with my device. However, the non Netflix version seems to work fine. How do I manage to download it without having to sideload? I don't want to install the APK and put my Netflix credentials on an untrustworthy APK found online. \n\nThanks in advance!",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hvn24h/civilization_vi_netflix_incompatible_on_my_device/"
    },
    {
        "id": "1hvgscr",
        "author": "Tongatapu",
        "title": "Netflix keeps reloading or buffering streams every 10/20 seconds (Google gave me no answer)",
        "content": "I've not seen anyone else having this problem. It only happens on my PC, not on my girlfriends PC. \n\nThe buffering bar keeps resetting every 10/20 seconds, leading to the stream loading for a split second every time that happens.\n\nI've turned off every add-on I can, it's still happening. It's like this for at least a month now.\n\nCan anybody help me fix this?",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hvgscr/netflix_keeps_reloading_or_buffering_streams/"
    }
]