[
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 77,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 20,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1lqtwej",
        "author": "murderedbyaname",
        "title": "The Residence cancelled after one season",
        "content": "",
        "upvotes": 398,
        "comments": 165,
        "media": null,
        "permalink": "/r/netflix/comments/1lqtwej/the_residence_cancelled_after_one_season/"
    },
    {
        "id": "1lqpcog",
        "author": "TudorNut",
        "title": "Netflix show you started with zero expectations but ended up loving?",
        "content": "When I clicked *The Queen’s Gambit*  out of curiosity&lt; didn't intent to watch to the end since I am not into chess. But I ended up completely hooked by the story, the acting, and how intense they made a quiet game feel. Totally surprised me!",
        "upvotes": 518,
        "comments": 461,
        "media": null,
        "permalink": "/r/netflix/comments/1lqpcog/netflix_show_you_started_with_zero_expectations/"
    },
    {
        "id": "1lqf06k",
        "author": "Spiritual_Kiwi_4521",
        "title": "I’m done starting new Netflix shows. They cancel everything good.",
        "content": "I just finished Insatiable and found out it was canceled after Season 2, with no proper ending. And for what? It was a hit show, it had a following, it wasn’t hidden in the depths of the platform. It could’ve grown even more if Netflix actually supported it.\n\nThis isn’t just about one show. This is about the pattern. They cancel everything good, especially original, weird, dark, or risky stuff, and replace it with endless reality shows or bland reboots.\n\nWhy do they think viewers will keep trusting them with our time and emotional investment if they pull this every time?\n\nIt’s like they only care about new signups, not long-term fans. They greenlight 100 shows and abandon 98 of them. How is that sustainable?\n\nI genuinely wish I could flood their inbox with 40,000 complaints, because clearly they’re not hearing how angry people are. There’s no point in starting new shows anymore if we know there’s no closure. Same with keeping a subscription. What a waste of a company they are. \n\nI hope I can get so many views on this post that Netflix sees this 😭  \n\nAnyone else feel like this?",
        "upvotes": 580,
        "comments": 191,
        "media": null,
        "permalink": "/r/netflix/comments/1lqf06k/im_done_starting_new_netflix_shows_they_cancel/"
    },
    {
        "id": "1lrasgi",
        "author": "Ok_Let_893",
        "title": "OLD GUARD 2",
        "content": "WOW WHAT AN ABSOLUTE DOGSH1!T of a movie.\n\nI waited for part 2 and I was super hyped by the trailer just to be disappointed by the movie.\n\nEven an allstar cast cant save this ass wound of a movie.\n\nUMA THURMAN deserved better as this was her first action movie post kill bill.\n\nVery cheesy plot, below average fight scene, korny dialogue uncessary death and a glaring plot hole. Cinematography looks like it was shot by an iphone. It was too bright with no mood tones just on plain vivid filter.\n\nScene 1: \nBooker doesnt need to die! He saw Andy became immortal again, I dont understand why he have to face soldiers alone and die. Its not like he savrificed himself so Andy can go on a time sensitive situation. She just stood there and screamed. Him and Andy could have killed all of them really fast and the end result would still be the same: still trapped on the room until it was opened by Discord in which they can have 2v1\n\nScene 2:\nDiscord fleeing but not really fleeing on helicopter? She could just flee and go on with plan. I dont understand why she came back?\n\nScene 3:\nhow did Niles became proficient with ancient weapons at 6 mos? The dont teach them in the Marines. \"YoUre nAturAl, nILe\"\n\nScene 4:\nNo guns allowed nuclear reactor but explosive booby traps are allowed.\n\nScene 5\nLegend? I thought they were like a secret society? How did they theorize that the last amd the first was able to take and give immortality when last old guard was Nile? It didnt happen yet imorder for them to speculate it.\n\n\nWhat do you guys think?\n\n\n\n",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lrasgi/old_guard_2/"
    },
    {
        "id": "1lrcw1m",
        "author": "Indoril-Nerevar337",
        "title": "‘Squid Game’ Creator Reveals Original Plan for the Series Finale",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lrcw1m/squid_game_creator_reveals_original_plan_for_the/"
    },
    {
        "id": "1lqxogl",
        "author": "ToonAdventure",
        "title": "'KPop Demon Hunters' Will Submit 'Golden' For Awards Consideration",
        "content": "",
        "upvotes": 16,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lqxogl/kpop_demon_hunters_will_submit_golden_for_awards/"
    },
    {
        "id": "1lralzj",
        "author": "Locksmith9000",
        "title": "Your device isn’t part of the Netflix Household for this account randomly, why?",
        "content": "I own the account, been using netflix and paying for the past 4 years, then today I get this notification that won't go away when I was literally on netflix before I went to go get dinner. Why would this happen?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lralzj/your_device_isnt_part_of_the_netflix_household/"
    },
    {
        "id": "1lqqm2m",
        "author": "Dave_Boi_237",
        "title": "Anyone else disappointed by the Old Guard sequel?",
        "content": "Just finished The Old Guard 2, and while I didn’t quit halfway through (so it wasn’t completely unwatchable), I was definitely disappointed by how lazy and inconsistent the lore is. For a story about immortals from completely different parts of the world who are actively hiding from the rest of the world, it’s weirdly convenient that they all seem to find each other across centuries with no real explanation of how or why. Still with that alone I would have been ok after all they all have centuries to run into each other, right?\n\nWhat really broke it for me was the mentioned connection between the first and last immortal (further explained only by a birthmark they both have for some reason) as well as the whole “legend” about the last immortal which would be born with the power to remove or transfer immortality. A legend someone somehow formulated likely thousands of years before the last immortal was even close to existing. How can there be legends about someone completely unique among a group of already special people nobody should even know about in the first place? The writing just didn’t try at all to make the world feel coherent or believable, which is a shame because IMHO the premise definitely had some potential. If only they made the story based on a somewhat plausible lore (written first) rather than creating a garbage lore based on what they needed it to be to accomodate a raise of stakes for the sequel or whatever.\n\nAnyway what are your opinions random redditors?",
        "upvotes": 28,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1lqqm2m/anyone_else_disappointed_by_the_old_guard_sequel/"
    },
    {
        "id": "1lqo4h6",
        "author": "S4v1r1enCh0r4k",
        "title": "‘Squid Game’ Creator Says Shocking Finale Scene Wasn’t Written to Launch U.S. Spinoff",
        "content": "",
        "upvotes": 37,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1lqo4h6/squid_game_creator_says_shocking_finale_scene/"
    },
    {
        "id": "1lrcx18",
        "author": "ConnectionStrong8385",
        "title": "SANDMAN INTERVIEW: Donna Preston on playing DREAM's sister DESPAIR, the iconic family dinner scene, having a WhatsApp group with Tom Sturridge and fellow castmates, and what we can expect from The SANDMAN SEASON 2 finale!",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lrcx18/sandman_interview_donna_preston_on_playing_dreams/"
    },
    {
        "id": "1lrahav",
        "author": "ShadowNinjaAce",
        "title": "Incorrect Subtitles",
        "content": "I dont claim to be an expert in Japanese, but over time Ive learnt the words, sentences and phrases and I can discern what they mean without having to read the subtitles. Is Netflix doing a bad job translating or are they changing it so it portrays the show better? The show in question is Alice In Borderland",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lrahav/incorrect_subtitles/"
    },
    {
        "id": "1lradzy",
        "author": "SovikPan",
        "title": "Volume is very low on Netflix Android app, when connected to bluetooth TWS.",
        "content": "Recently I have noticed that whenever I view use Netflix Android app the volume is too low.\n\nIt's fine when not connected to bluetooth.\n\nI noticed this recently. Not sure if this a new bug after update.\n\nAnyone facing same issue on Android?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lradzy/volume_is_very_low_on_netflix_android_app_when/"
    },
    {
        "id": "1lqwyp7",
        "author": "_Kabr",
        "title": "“Your device isn’t part of the Netflix household for this account”",
        "content": "Opened the Netflix app on my phone to look for something. Have had this phone for almost 2 years, 0 issues from Netflix. Have had the sim for like 6 years. App says my phone isn’t a part of the household (wtf even is that?). Try again. Same issue. Open with my wifi on. No issue. So now I have to be using my house’s wifi to watch stuff on MY account that I set up years ago and have had 0 issues with since doing so? wtf is that bs ",
        "upvotes": 7,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1lqwyp7/your_device_isnt_part_of_the_netflix_household/"
    },
    {
        "id": "1lr9mb5",
        "author": "dewdropvelvet1",
        "title": "How to contact support (preferably email) here?",
        "content": "Is there a way to contact Netflix customer service by email? I have some feedback I want to get off my chest and deliver and I found an email listed by google but it got sent back.  The main thrust is about them repeating/stealing popular shows from other streaming sites. I get that not everybody has a Hulu or Max or Amazon account but I wish they would seek out some obscurer good shows instead. Not Sex and the City or Greys Anatomy for the third time and then get rid of golden stellar material like Jane The Virgin or Crazy Ex Girlfriend.  How do I contact them for feedback? And no I dont want to take a freaking survey. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lr9mb5/how_to_contact_support_preferably_email_here/"
    },
    {
        "id": "1lr05ch",
        "author": "PaperFennKhat",
        "title": "Papercraft Derpy Cat from KPop Demon Hunters",
        "content": "A bit rough around the edges but I like how it turned out! Hope you enjoy it too!",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lr05ch/papercraft_derpy_cat_from_kpop_demon_hunters/"
    },
    {
        "id": "1lr6xnh",
        "author": "MahnlyAssassin",
        "title": "Netflix keeps signing me out!",
        "content": "Even though there are no other devices signed into netflix rn, every time I sign in and try to watch a show, it signs me out! this is unbelievably annoying. Any way to fix?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lr6xnh/netflix_keeps_signing_me_out/"
    },
    {
        "id": "1lr17so",
        "author": "twirling_daemon",
        "title": "Opinions on whether premium is worth it please?",
        "content": "I’ve had premium for ages for the additional devices/profiles etc but now wondering if it’s worth it \n\nI watch it on a 120” screen which makes me think even I would notice the difference if I downgrade. However I’m streaming through Amazon Fire TV Stick 4K Max (Newest gen) so would that mitigate the downgrade in quality?\n\nI’m potentially adding a couple of accounts for other places/people and the drop in main sub would make me feel a little more comfy!",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1lr17so/opinions_on_whether_premium_is_worth_it_please/"
    },
    {
        "id": "1lr5yp8",
        "author": "Handsome_ketchup",
        "title": "Many movies only available at 1080p on Premium tier?",
        "content": "Edit: if you downvote, please leave a comment why, so I learn something.\n\nEdit 2: nope, not even when you ask nicely, lol. I'm sure they did their best, bless them.\n\nRecently I subscribed to the Premium tier to watch content in quality 4k HDR format. While shows like Squid Game actually display in 4k HDR and look great, I find that the vast majority of big movies are only offered in 1080p, and a few 4k ones often without HDR. These are movies that have commonly available Blueray 4k HDR releases, so it's not a matter of the content not existing. One example would be 1917, which has been released on Blueray in both Dolby Vision and HDR10+, but only seems to play at 1080p. The television is configured to display 4k HDR content, the Chromecast 4k is as well, and the subscription is the Premium tier. Some content is offered in 4k HDR, so the technology seems to work as intended.\n\nIs something wrong on my end, or is Netflix not offering 4k HDR versions for a lot of movies, even on the Premium tier?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lr5yp8/many_movies_only_available_at_1080p_on_premium/"
    },
    {
        "id": "1lqghyr",
        "author": "SFTHfan24",
        "title": "The Old Guard 2",
        "content": "I just finished watching the Old Guard 2 and to say I’m disappointed is a massive understatement. \n\nLike what was the point of this movie even? Barely anything happened. Little to no character development and a complete waste of my time and excitement for it. \nLiterally almost 2 hours of crap. \n\nI actually really loved the first movie and based on how it ended I was really excited to see what was going to happen next and the character development for Andy and Nile especially but we got nothing. ",
        "upvotes": 32,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1lqghyr/the_old_guard_2/"
    },
    {
        "id": "1lqfnyd",
        "author": "bongoverlander",
        "title": "Is it just me or did the last season of Squid Game completely lose the plot?",
        "content": "Okay, I just finished the latest season of Squid Game and… wow, what a letdown. I really wanted to like it, I tried to like it—but somewhere between the recycled plot points and painfully predictable twists, I felt like the magic of the first season just vanished.\n\nThe original had unpredictability, emotional stakes, and that gritty commentary on capitalism and human desperation. But this one? It felt like they were trying to shock us, but you could see it coming from a mile away. The tension just wasn’t there.\n\nAlso, character development took a nosedive. Instead of complex personalities making morally grey choices, we got caricatures running through a checklist of betrayals and “surprises” that weren’t surprising at all.\n\nEven the games lacked originality this time. One of them was so absurdly over-the-top that it felt more like a bad parody of Squid Game than the real thing.\n\nAnyone else feel this way? Was I expecting too much? Or has the show just become another victim of its own success?",
        "upvotes": 29,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1lqfnyd/is_it_just_me_or_did_the_last_season_of_squid/"
    },
    {
        "id": "1lr18op",
        "author": "Scoutius",
        "title": "Netflix broken/acting up??",
        "content": "Hello, so I’m from the UK and have Netflix on my tvs as well as phone. There seems to be an issue when I enter Netflix on my tv where I can’t see some shows that are definitely on in the uk- for example Black mirror, killing eve, shera, and arcane. \n\nI can access all of these on my phone and it’s only happening with certain shows (these are just the ones I’ve noticed but I’m sure there is more).\n\n As well as this some of my profile pictures have defaulted to that fluffy smiley face profile picture- these avatars are from the shows mentioned above (Catra, jinx, and glimmer) so seems to be linked to the issue. These profile pictures appear on my phone fine. \n\nIs anyone else having this issue? Perhaps it is an issue with Sky or something? \n\nI have no idea why this glitch has suddenly occurred- I was watching Netflix fine a few hours ago. \n\nI’ve tried resetting Netflix and my skybox but so far nothing has worked. As far as I’m aware it’s only my Netflix that has been affected and no other streaming apps.  \n\nUpdate: ok we’ve worked out it is just one profile that is glitched? For some reason mine is broken but all the other accounts (my family) are fine. We are all under the same roof so I don’t see any reason to why this should be happening??",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lr18op/netflix_brokenacting_up/"
    },
    {
        "id": "1lr123y",
        "author": "HehroMaraFara",
        "title": "Countdown: Taylor vs. Serrano",
        "content": "First off, their last fight was 🔥. That being said, I just watched that preview show Netflix released today and YIKES. \n\nAmanda Serrano sounds so punch drunk already that I’m legitimately scared for how her health will decline the next 5-10 years. How it’s not even being mentioned at all is insane and feels crazy irresponsible by anyone who cares about her. \n\nKatie was interviewed as well and she sounded remarkably more cognizant. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lr123y/countdown_taylor_vs_serrano/"
    },
    {
        "id": "1lqexqo",
        "author": "cuckoocraftbyjam",
        "title": "Rumi of kpop demon hunters",
        "content": "Just finished making her pattern as well!! Had so much fun making and hoping to finish zoey and miras next!! Maybe I should do Jinu next or the derpy cat? What do you guys think?",
        "upvotes": 26,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lqexqo/rumi_of_kpop_demon_hunters/"
    },
    {
        "id": "1lqr48b",
        "author": "Extension_Bit4323",
        "title": "Has anyone watched squid game conversation?",
        "content": " Where the director and the guys who play gi hun and the front man talk about season 2 and 3 and there's another one about series 1 where the director and the cast talk about it.\n\nIt's gives insight to the decisions the director made and how the cast thought about it. \n\nAlso I feel like I'm the only one that liked series 3. 😅",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lqr48b/has_anyone_watched_squid_game_conversation/"
    },
    {
        "id": "1lq7e24",
        "author": "ggroover97",
        "title": "Netflix Freshmen ‘Pulse’ &amp; ‘The Residence’ Canceled, ‘No Good Deed’ On Indefinite Pause",
        "content": "",
        "upvotes": 65,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1lq7e24/netflix_freshmen_pulse_the_residence_canceled_no/"
    },
    {
        "id": "1lqthmc",
        "author": "MysteriousDelay6266",
        "title": "Catalog | Official Trailer | Netflix | July 17",
        "content": "**JULY 17 on Netflix.**\n\nIn this heartwarming and uplifting take on grief, a widowed father uses his late wife's online parenting tips to guide his many — many — parenting hiccups.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lqthmc/catalog_official_trailer_netflix_july_17/"
    },
    {
        "id": "1lqebzy",
        "author": "Sudden_Pop_2279",
        "title": "‘Squid Game’ Season 3 Becomes First Show To Debut No. 1 On Netflix Across 93 Countries With 60.1M Views",
        "content": "",
        "upvotes": 24,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lqebzy/squid_game_season_3_becomes_first_show_to_debut/"
    },
    {
        "id": "1lqmobu",
        "author": "Humble_Dog_1644",
        "title": "Recommendations for a mini series preferably British, but I'm open to all recommendations.",
        "content": "Hey! I usually don't have a lot of time, but my girlfriend is currently pregnant and we're trying to slow down a bit and would like to start on a short series, but we have nooo idea where to begin? We watched the new *Department Q* on Netflix and enjoyed that a lot, so something similar to that if anyone can recommend something? \n\n\n\nthanks in advance!! :) ",
        "upvotes": 4,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1lqmobu/recommendations_for_a_mini_series_preferably/"
    },
    {
        "id": "1lqygug",
        "author": "indiewire",
        "title": "The 7 Best New Shows on Netflix in July",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lqygug/the_7_best_new_shows_on_netflix_in_july/"
    },
    {
        "id": "1lqxzq1",
        "author": "Timely-Hovercraft-76",
        "title": "Is the new show the waterfront  any good?",
        "content": "My gf and I are thinking of starting it Friday. We both have seen and liked ozark and I’ve heard it carries kinda similar vibes. I also like one of the actors( he played in mindhunter , fight club, shot caller etc) . Just wanna know some ppls thoughts. Any good cinematography?",
        "upvotes": 1,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1lqxzq1/is_the_new_show_the_waterfront_any_good/"
    }
]