[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 8,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 51,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1l6nyt5",
        "author": "Apprehensive_Ask1279",
        "title": "The Four Seasons",
        "content": "Is there really any point of a season 2???!!!\n\nI thought this series was ok &amp; an easy enough watch but I didn’t really think there was enough substance in it to do another series on it &amp; no characters I was remotely invested enough in to want to follow up on. Am I in the minority here?! ",
        "upvotes": 35,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1l6nyt5/the_four_seasons/"
    },
    {
        "id": "1l6pe3s",
        "author": "CatSheeran16",
        "title": "Sirens",
        "content": "So I just finished the series, and at first I thought: what the hell did I just watch? At first I was kinda disappointed that it didn’t turn into a cult revelation thing. But then I thought about it, and it has a lot of depth. Maybe I‘m overthinking this, but this series shows us how easy it is to make the women the villain, how to frame them and how we do so easily believe it. Looking back, I just ignored the signs of Kiki being just nice without any agenda. The whole time I expected her behaviour to be calculating and cunning. I  jumped to the conclusion that she must be the bad guy as the show wanted us to believe at first. Even her behaviour contradicting this assumption didn’t sway me at first. But now I see the man who manipulates the viewers perspective. I so easily believed Peter when he talked about his alienation from his kids and it being kikis fault. But when she talked about how small the marriage made her and how horrible the kids were to her, it didn’t quite resonate as much. Frightening tbh, particularly because I would go as far as saying I have definitely and massively educated myself about the patriarchy and intersectional feminism. Maybe I’m interpreting too much, but if you look at it from a feminist perspective then it - amongst other things - shows us the sway of men’s opinion’s still and the smear campaign that always hits the women ten times harder. It shows us the dangers of dependency, especially as a woman. So, I kind of liked the show. I liked how it was over the top mostly and also sometimes even a bit satirical while dealing with heavier topics.  Let me know what you think and what your interpretation is",
        "upvotes": 10,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l6pe3s/sirens/"
    },
    {
        "id": "1l6kbo8",
        "author": "Longjumping_Bowl_403",
        "title": "Archive 81: 8️⃣/1️⃣0️⃣",
        "content": "If you have even the slightest interest in horror, storytelling, or mystery, this show is for you. Strong narrative, engaging from start to finish, and enough depth to keep you hooked.\n\nThe reason it's an 8/10 is because:\n\n1. It is a bit drawn out, some dialogue and scenes feel unnecessary and 'unreal'- acting didn't make it feel 'real'.\n2. It lacked a sense of urgency, a fear factor. The kind of feeling you get when you’re caught between wanting to witness horror and wanting to escape from it.\n\nIf you haven't watched it, give it a shot. You likely won't be disappointed unless you have Fast &amp; Furious posters in your room.",
        "upvotes": 19,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1l6kbo8/archive_81_810/"
    },
    {
        "id": "1l6gs94",
        "author": "Champloo-",
        "title": "New ui on tv",
        "content": "Is there any way to see more than 3-4 items on my huge ass tv screen? Who thought that was a good idea?\n\nAlso, is there any way to quicky access the \"new/soon on netflix\" tabs? Do they not want people to notice their new releases anymore?\n\nI normally don't really care about app uis being updated, but the new netflix ui makes browsing the app just so much worse.",
        "upvotes": 16,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1l6gs94/new_ui_on_tv/"
    },
    {
        "id": "1l6kx8f",
        "author": "Tagglit2022",
        "title": "Looking for light shows",
        "content": "**I've had a rough  couple of monts when my mother passed  away .. I'm looking for light  series that I can watch after a loong day to decompress .**\n\nI've watched Ginny and Gerogia , Firefly lane, Virgin river and sweet Magnolias\n\nI did like sweet magnolias  most and the rest were'nt bad\n\nI read that Sirens is kinda ok to decompress with?\n\nAny other recommendations?\n\nTIA",
        "upvotes": 6,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1l6kx8f/looking_for_light_shows/"
    },
    {
        "id": "1l65loo",
        "author": "phaffgiraffe",
        "title": "Dept Q - Season 2?",
        "content": "When does Netflix typically announce they’re renewing a series for season 2? I NEED a second dept q series - and fear I won’t sleep until it’s announced. Netflix put me out of my misery please, or help me manage my expectations. 😅 \n\nDoes anyone have any example timelines from other similar shows? \n\n",
        "upvotes": 48,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1l65loo/dept_q_season_2/"
    },
    {
        "id": "1l6t1g1",
        "author": "stuffandplayx",
        "title": "Death Note | Clip: Light Meets Ryuk [HD] | Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l6t1g1/death_note_clip_light_meets_ryuk_hd_netflix/"
    },
    {
        "id": "1l6t07x",
        "author": "Dad4897623",
        "title": "Shows for when my daughter is in the room",
        "content": "I want to find more shows/movies on Netflix to watch that have PG ratings. I’m an adult and I enjoy watching all kinds of shows, but on the weekends I want to watch Netflix while I’m working out and my 4yo daughter is in the room playing, so I can’t have any bad dialogue or mature subject matter coming up.\n\n In the past I’ve really enjoyed watching a lot of ESPN 30 for 30 documentaries, but I’ve pretty much exhausted all the PG rated ones in that series. I’ve also watched movies like My All American, Home Team, and The Long Game, which have a sports theme but are family friendly. It doesn’t *need* to be a sports show though. Any suggestions?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l6t07x/shows_for_when_my_daughter_is_in_the_room/"
    },
    {
        "id": "1l6sf59",
        "author": "stravocadomf",
        "title": "“Mercy for None” is a really good show if you want a recommendation!!",
        "content": "It’s a show about a brother who goes on a rampage to kill his brothers murderer. \n\nSuper bloody, lots of deaths, broken bones, etc. it’s genuinely so good. \n\nThe plot isn’t just some bs either. Twists and turns in this Mf. it’s super good. Idk how many times I can say it ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l6sf59/mercy_for_none_is_a_really_good_show_if_you_want/"
    },
    {
        "id": "1l5yp3d",
        "author": "Inevitable-Scar-2982",
        "title": "Please give me some good mind bending shows!",
        "content": "I love shows that make you think and leave you stunned. I wanted to be genuinely shocked!\nLike I’ve seen Dark and it was the best shows I’ve EVER EVER SEEN! I need shows like Dark, The OA, Umbrella Academy, Love, death and robots, Black Mirror and Years and Years. I can’t explain what you’d call these but just ones with twists and that aren’t predictable. \nPlease give me some actual good shows along these lines, I tried ‘From’ and I just found it too boring and couldn’t get into it. Please no detective dramas! I lot of these shows are going in an AI direction which is really cool. \n\nI just need something gripping from start to finish, no predictability. ",
        "upvotes": 96,
        "comments": 137,
        "media": null,
        "permalink": "/r/netflix/comments/1l5yp3d/please_give_me_some_good_mind_bending_shows/"
    },
    {
        "id": "1l6etap",
        "author": "Level_Most_2903",
        "title": "Recommendations",
        "content": "Just bought Netflix and was wondering if there is anything decent to watch on Netflix at the moment? I have just Started watching adolescence. Give me recommendations peeps ",
        "upvotes": 5,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1l6etap/recommendations/"
    },
    {
        "id": "1l6qvvh",
        "author": "InSoupWeTrusted",
        "title": "Adolescence",
        "content": "Can someone help me settle an argument with my wife on this series. \n\nWe both agree that the show is highlighting the effects of online bullying, toxic masculinity such as Tate etc has on young boys, but what we don't agree on is whether the show was trying to portray Jamie's father's treatment of his wife as a potential factor in how Jamie turned out. \n\nI believe the scenes showing interactions between Jamies parents in the last episode are that of only grief - not grief and highlighting a power dynamic between Jamie's father and mother.\n\nMy wife believes how Jamie's dad spoke to his mother when he's trying to clean the van was alluding to how this display of masculinity overpowering femininity in the house had contributed to Jamie's actions.\n\nI believe it was a pure display of grief, anger and confusion being displayed via agression - at the bucket, the cleaning of the van etc. The show was not trying to portray this being directed at his wife, but the situation they are facing.\n\nWhat are your thoughts? ",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1l6qvvh/adolescence/"
    },
    {
        "id": "1l5zkqa",
        "author": "Movingskyclub",
        "title": "Parents stayed over for a week watching Korean dramas. How do I delete that history so I stop getting recommended shows similar to those?",
        "content": "I have no taste for Korean dramas, sadly, and now I’m getting lots of recommendations for “internationally acclaimed romantic dramas”. How do I stop this, short of resetting my watch history?",
        "upvotes": 75,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1l5zkqa/parents_stayed_over_for_a_week_watching_korean/"
    },
    {
        "id": "1l6qivy",
        "author": "United_Credit_6264",
        "title": "ginny and Georgia Season 3 discussion",
        "content": "From the title, you should already know that there will be spoilers at least somewhat. So please be prepared.\n\nFor the people that have watched the whole new season, can we please talk about how we feel about this season? And how we feel about the characters in this season?\n\nGet ready for spoilers \n\n1\n💥\n💥 \n💥 \n💥 \n💥 \n💥 \n💥 \n💥 \n2\n💥 \n💥 \n💥 \n💥 \n💥 \n💥 \n💥 \n💥 \n3\n💥 💥 💥 💥 \n\nTo start off nicely, I want to say I really liked Hunters character in this season and I also liked him with Padma. That’s really all I can say that’s nice because everyone else’s character was pretty much the exact same or got worse.\n\nPaul: I lost all respect in him. I lost it as soon as he walked up angrily to Georgia and slammed his hand on the wall right next to her head. Before then, I could understand where he was coming from. But to act like that is unacceptable. And he didn’t apologize.\n\nGeorgia: I have so many mixed feelings and thoughts on her. Like she’s selfish but yet she isn’t because she cares deeply for people. She definitely thinks she’s all that. Not like she has money, but like you can’t touch her. Like she could do anything and get away with that. Which is what happened. I couldn’t decide if I thought she deserved to go to prison or not. And not even for the last murder because that one I can actually understand and I wouldn’t have blamed her honestly. But for the other two murders. Like three murders in total is a lot to get away with for a person. \n\nGinny: I really grew to not like her. I didn’t like how judgmental she was on her mom. Like yes, I understood where she was coming from for the most part… but she didn’t have to be so judgmental. Like let’s understand that your mom had a terrible life and this is all she knew how to survive. And she did everything she thought she could to keep her kids safe and with her. And the way Ginny turned Austin against his dad. Like I know her thought process with everything but still she should have thought about how it would affect her little brother. What she had him do is going to stay with him for the rest of his life. And then obviously the way she treated Maxine. The scene between her and Maxine talking at the party in the last episode. I was not OK with how she was looking at Maxine or the way she talked to her. I lost a lot of respect in ginny because of that. I understand in the show Maxine‘s attitude is overwhelming, but the way Ginny acted towards her just wasn’t it for me. I also couldn’t stand how rude Abby was to Maxine either. But that was more predictable and not surprising from Abby. I felt really bad for Maxine and all the stuff she was going through and didn’t have her friends to talk to. I know how that is and it sucks.  So yeah boo Ginny and Abby.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l6qivy/ginny_and_georgia_season_3_discussion/"
    },
    {
        "id": "1l6qar8",
        "author": "hashtagdumplings",
        "title": "The Replacement…um?",
        "content": "Just watched the mini series The Replacement which I believe originally came out in 2017. Set in Scotland, good cast - good first episode. Then what the hoot happened! \n\nThat was the most scrambled, messy holey plot of nonsense I think I’ve ever watched? \n\nCan someone please explain at the very least the following? Or explain what the writer might have been thinking??\n\n- Georgia. Why is she helping Paula if the police already know what happened? Why did Kay contact her in the first place? \n\n- So Paula killed Kay just because she wouldn’t stop talking about her daughter? That’s that thread wrapped up? Really?\n\n- The amount of unsafe baby things happening in the show that go completely unmentioned and normalised - infant sleeping in a crib with blankets, mum driving with baby in the front seat (!!!), placing basket bassinet on a ledge and walking away…! What is going on here.\n\n- Did the niece just play along? \n\n- How did Ellen overcome taking all those pills? At this point I was ready for the episode to end o admittedly I was fast forwarding - maybe this is explained and I missed it. \n\n- We’re supposed to believe Ellen just all of a sudden learned/ figured out how to hot wire a car? \n\n- How did the police end up in the library? They didn’t believe Ellen before so why would they now believe it was Paula who took the baby and not Ellen? \n\nI was so excited about this after the first episode so am a bit flabbergasted at how off the rails it got. Would love to hear what everyone else thought \n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l6qar8/the_replacementum/"
    },
    {
        "id": "1l6elvj",
        "author": "S4v1r1enCh0r4k",
        "title": "Bunch of Arcane season 2 storyboards, concept art &amp; sketches has been exhibited during Annecy Festival this year",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l6elvj/bunch_of_arcane_season_2_storyboards_concept_art/"
    },
    {
        "id": "1l6j4rx",
        "author": "AffectionateDig9453",
        "title": "Sunday Afternoon Movies",
        "content": "\nHi, I’m Looking for a great movie to watch this Sunday afternoon—something in the fantasy or sci-fi genre. Open to suggestions that are exciting and immersive!\n\n\n—————————————————\n",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l6j4rx/sunday_afternoon_movies/"
    },
    {
        "id": "1l6nq9s",
        "author": "ThrowRAvolt",
        "title": "Ways to stream in steam?",
        "content": "trying to do a watch party with online friends and can’t figure out how to share my screen. Anyone have a way I can do that? Or does Netflix not allow it at all? A few years ago I know they had a website you could use but I don’t remember the name ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l6nq9s/ways_to_stream_in_steam/"
    },
    {
        "id": "1l6ayhm",
        "author": "BigAgreeable6052",
        "title": "English dubbing - why so terrible in comparison to other languages?",
        "content": "So I can speak German and English fluently. However, whenever I opt to dub a show I pick German as it tends to be a lot better.\n\nThe English dubbing usually feels like it's been recorded in a tin can, with 0 intonation.\n\nPart of me wonders whether I'm both more used to German dubbing and German dubbing is more developed because they do a lot.\n\nIn contrast, I feel like English speakers don't usually watch dubbed content. Hence English dubbing has less effort in it?\n\nAlso English dubbing also has such heavvvyyy American accents. Sometimes I wish that if it's a Spanish show they'd dub with Spanish English accents to keep it more authentic?\n\nWhat do people think? I literally can't listen to English dubbing as it's sooooo bad.",
        "upvotes": 4,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1l6ayhm/english_dubbing_why_so_terrible_in_comparison_to/"
    },
    {
        "id": "1l6dgsr",
        "author": "absolute_bodies23fan",
        "title": "Love death and robots",
        "content": "Coming from someone who loves Sci-fi, drama, and stuff like Black Mirror/1899/Bodies/Hannibal (I know some of these might not correlate, but it's what I'm into), would you recommend Love, Death and Robots to me? \n\nAlso if anyone has any other shows that link in with my interests to recommend I'd love to hear them (and don't say Dark I tried to watch it and I was bored) \n\nBut I would love to hear some recs!! ",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1l6dgsr/love_death_and_robots/"
    },
    {
        "id": "1l66hoa",
        "author": "0980988890",
        "title": "Similar shoes to Sirens?",
        "content": "I loved Sirens so so much. Perfectly silly, entertaining and a complete disconnect from real life while watching it. \n\nAre there any other shows that you recommend that are similar to it? I love shows where I switch off from the world and was truly sad when it ended LOL. ",
        "upvotes": 7,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1l66hoa/similar_shoes_to_sirens/"
    },
    {
        "id": "1l6pplv",
        "author": "glamuary",
        "title": "Straw Netflix Movie Review | Tyler Perry | Taraji P. Henson | Sherri She...",
        "content": "Tyler Perry's new movie Straw is now streaming on Netflix. It stars Taraji P. Henson as a long-suffering single mother who spirals into a vengeful rage while disassociating from a life changing tragedy.\n\nHere's my movie review.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l6pplv/straw_netflix_movie_review_tyler_perry_taraji_p/"
    },
    {
        "id": "1l6hdd1",
        "author": "CommercialHeat4218",
        "title": "Is there a way to mark a show as unwatched so I can watch it again?",
        "content": "Recently watched LD+R 4th season (wasn't great!) but made me want to go back and rewatch the other seasons. It doesn't show up on my homescreen so I have to search for it every time, which is another whole thing, but it also never keeps track of where I have most recently left off. It just has the entire series marked as watched for me, so it doesn't bring up S0105 after I've just watched S0104 for example. Very frustrating process every episode. ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1l6hdd1/is_there_a_way_to_mark_a_show_as_unwatched_so_i/"
    },
    {
        "id": "1l5n21b",
        "author": "Five50am",
        "title": "Anyone else watch Netflix less since they updated the layout?",
        "content": "I personally can't stand it. I loved how you could see many options on the screen and now it's like your zoomed in and have to scroll for days to see everything. I don't understand why they tried to fix what wasn't broken.",
        "upvotes": 83,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1l5n21b/anyone_else_watch_netflix_less_since_they_updated/"
    },
    {
        "id": "1l6n09e",
        "author": "Mysterious_Shoe_5893",
        "title": "How to recover deleted Netflix profile?",
        "content": "I accidentally deleted one of the four profiles on Netflix and created a new one on top of it. this was an accident. How do I recover the deleted profile?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l6n09e/how_to_recover_deleted_netflix_profile/"
    },
    {
        "id": "1l6jh3d",
        "author": "Curious_Natural_1111",
        "title": "Is Ozark slow paced?",
        "content": "Tried watching it twice but just couldn't get by the first half of S1E1.\n\nI can watch anyything like GoT, BB, mindhunter, Dark, stranger things, severance, bridgerton, the last of us etc so it's not like I've a very specific taste. Idk why I can't seem to get into Ozark when I've heard Soo much about this show. \n\nIs it really not everyone's cup of tea or should I give it another try?  ",
        "upvotes": 0,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1l6jh3d/is_ozark_slow_paced/"
    },
    {
        "id": "1l6hr80",
        "author": "Negative_Two2893",
        "title": "Breaking bad not available",
        "content": "Was watching breaking bad on holidays for the last week and had no problems.  For some reason today breaking bad and better call saul have disappeared from the platform. Any information about this?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1l6hr80/breaking_bad_not_available/"
    },
    {
        "id": "1l5v4np",
        "author": "Remote_Nature_8166",
        "title": "I wish they could fix that annoying issue",
        "content": "So if i’m watching a show and it only has three minutes left, if I accidentally exit it and go back to it, it just winds up back at the beginning even though I wasn’t done with the episode and I gotta scroll all the way back. That’s such a stupid feature. It should just be doing that when it hits the credits.",
        "upvotes": 18,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l5v4np/i_wish_they_could_fix_that_annoying_issue/"
    },
    {
        "id": "1l6ania",
        "author": "Lumpy-Addendum8288",
        "title": "watching netflix on pc i get bad video quality",
        "content": "i have a Standard plan and i watch stuf, but the is a weird thing, then i watching netflix on my pc the video quality degrades like then i start playing it shows in 1080p but over a few min it degrades to really bad quality no mater if i'm on web and pc app ver. off netflix. i don't have this problem on my phone, tablet and laptop (same web or app no problem). and yes my internet is really good (i would probably even abile to stream 4k is i had premium plan) and in netflix playback Settings i made data usage to high but still same probem on my pc. any ideas ?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1l6ania/watching_netflix_on_pc_i_get_bad_video_quality/"
    },
    {
        "id": "1l5j6ro",
        "author": "jerkoff1610",
        "title": "The story of Raymond West and his link to the Tylenol Murders",
        "content": "Watched The Tylenol Murders, the Netflix doc about a week ago and I still can’t shake the Raymond West story. Everyone talks about the Tylenol poisonings but the way the doc weaves in Ray's disappearance from 1978 is seriously haunting.\n\nHe was this retired truck driver who knew James Lewis and then just… vanished. What they eventually found in his house is wild. And the connection to Lewis is super sketchy.\n\nHonestly feels like this should’ve raised way more red flags back then. Makes the Tylenol case even creepier in hindsight.\n\nAnyone else still thinking about that part? Curious what others make of it, coincidence or something bigger?",
        "upvotes": 70,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1l5j6ro/the_story_of_raymond_west_and_his_link_to_the/"
    }
]