[
    {
        "id": "1ic3s0h",
        "author": "rotogimp",
        "title": "AMA about the totally self-funded feature \"Suicide Tuesday\" is out soon! We're Jocke and Sven, starting Wednesday 1/29 at 10 AM ET (4 PM +1GMT).",
        "content": "Jocke wrote and directed the film, Sven handled the photography and together we produced the film on a shoestring budget. It's our first feature, made totally independently and it's taken us about three years to complete. \n\nCheck out the [Trailer!](https://youtu.be/nPQiEFkzpgE)\n\n&gt;Tove is teetering on the edge of self-destruction. Burdened by the weight of her past, her life seems to be spiraling out of control with no way out. That is, until she crosses paths with Jesse.\n\n&gt;Jesse is everything Tove isn't — calm, grounded, and full of hope. Their unexpected meeting becomes the catalyst for change, igniting a spark of possibility in Tove's dark world. As the two grow closer, Tove is forced to confront the very demons she's been running from. Can Jesse's unwavering support and love be enough to pull her back from the brink? Or will Tove’s inner turmoil ultimately push her further into the abyss?\n\n&gt;In a story about second chances, healing, and the power of connection, Tove must decide if she’s ready to rewrite her story before it’s too late.\n\n![img](wya1ggph3rfe1)\n\nWe're an open book and look forward to your questions!\n\nJocke and Sven",
        "upvotes": 46,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bsL0Z0Bt6QnTcJ5b4vSvfkmOUnzn_TmlzL_dniYS218.jpg?auto=webp&amp;s=93fbd0096bc5f78571a9d70c7a6d1040cabdc349"
        },
        "permalink": "/r/movies/comments/1ic3s0h/ama_about_the_totally_selffunded_feature_suicide/"
    },
    {
        "id": "1ic5vtg",
        "author": "NoYoureACatLady",
        "title": "In the Jumanji universe, it's entirely possible that if you die in the game, you're simply returned to reality unharmed and escape. We never find out because all characters assume that you die IRL if you die in the game.",
        "content": "In the Jumanji universe, it's entirely possible that if you die in the game, you're simply returned to reality unharmed and escape. We never find out because all characters assume that you die IRL if you die in the game.\n\nIt's funny to think that in the reboot movies, they could possibly have escaped the game in a few seconds by simply dying a few times. Of course the original movie required going through the entire gameplay sequence but it's still possible that dying wouldn't have killed you in real life.",
        "upvotes": 4122,
        "comments": 341,
        "media": null,
        "permalink": "/r/movies/comments/1ic5vtg/in_the_jumanji_universe_its_entirely_possible/"
    },
    {
        "id": "1icjxk8",
        "author": "Aqueraventus",
        "title": "What do you think was the most snubbed non-nominee for the Oscar’s ever?",
        "content": "Personally for me it was Hereditary.\n\nToni Collette delivered one of the most Oscar worthy performances I have ever seen, all of the actors were fantastic, the music, the direction, the symbolism, it all worked in perfect harmony to create one of the best movies ever made.\n\nBut also horror movies are traditionally overlooked and snubbed at the academy awards.\n\nWhat would some of your picks be? ",
        "upvotes": 397,
        "comments": 379,
        "media": null,
        "permalink": "/r/movies/comments/1icjxk8/what_do_you_think_was_the_most_snubbed_nonnominee/"
    },
    {
        "id": "1icdqgg",
        "author": "soalone34",
        "title": "‘No Other Land’ receives Best Documentary Oscar nomination despite no U.S. distribution deal",
        "content": "",
        "upvotes": 648,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/be7E0Dx5evEzFbtwaOC2_966xrb2hviV_QmnAmf2l_U.jpg?auto=webp&amp;s=08f62270c15a8351ff99b6951e6e879c4ee87019"
        },
        "permalink": "/r/movies/comments/1icdqgg/no_other_land_receives_best_documentary_oscar/"
    },
    {
        "id": "1ic88pp",
        "author": "flamehead243",
        "title": "Movies where the main character is NOT a badass?",
        "content": "Inspired by [this thread from yesterday](https://old.reddit.com/r/movies/comments/1ibmd79/movies_where_the_main_character_is_secretly_a/), what are some examples of movies where main character(s) are thrown into situations where they don't have any special skills? Two movies that come to mind are United 93 (2006) and Blue Ruin (2013). IMO, both solid movies for different reasons.",
        "upvotes": 1050,
        "comments": 1325,
        "media": null,
        "permalink": "/r/movies/comments/1ic88pp/movies_where_the_main_character_is_not_a_badass/"
    },
    {
        "id": "1ic68x9",
        "author": "MarvelsGrantMan136",
        "title": "SINNERS | Official Trailer 2",
        "content": "",
        "upvotes": 1090,
        "comments": 363,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/RJECwi0NogrwS7_SM6wlABiukoi3EkXhstvnob-gLps.jpg?auto=webp&amp;s=f1cf6d51a19d052f1536ba26a634f5a986ffda4e"
        },
        "permalink": "/r/movies/comments/1ic68x9/sinners_official_trailer_2/"
    },
    {
        "id": "1icefbu",
        "author": "BunyipPouch",
        "title": "Ruben Östlund’s Dark-Satire ‘The Entertainment System Is Down’ Begins Filming &amp; Adds to Cast - The set has been built around a real Boeing 747. About a long-haul flight where the entertainment system fails, the film will see passengers forced to face the horror of being bored.",
        "content": "",
        "upvotes": 327,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/C4PoOoiNxoFLCf7a0dIkTT7ecR0apHUyamrD0zhfFBg.jpg?auto=webp&amp;s=7278cc3aff957603798dc19eaae2a5433a3cda7d"
        },
        "permalink": "/r/movies/comments/1icefbu/ruben_östlunds_darksatire_the_entertainment/"
    },
    {
        "id": "1ic1dvk",
        "author": "dickbilliamson",
        "title": "33 years before Alien: Earth, 'Alien 3' was set to be the introduction of the xenomorph to our planet. The concept was teased in a trailer and then abandoned.",
        "content": "",
        "upvotes": 1401,
        "comments": 290,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/esK1pIFTb6uyIpLlfncnZ6PPipOZFmsiEeMsXNvfrVk.jpg?auto=webp&amp;s=262edd651f8cc59f28b4ff64ec3de7b075386744"
        },
        "permalink": "/r/movies/comments/1ic1dvk/33_years_before_alien_earth_alien_3_was_set_to_be/"
    },
    {
        "id": "1ic78pb",
        "author": "outremer_empire",
        "title": "Alien: Romulus NEW Version Comparison",
        "content": "",
        "upvotes": 602,
        "comments": 316,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QFNHqd6nUZyqLwLUNry_LPLAX6R4NVjE03KRZilUY5k.jpg?auto=webp&amp;s=71dd6cb5cf471daf450493921dd803dae7d9bbbd"
        },
        "permalink": "/r/movies/comments/1ic78pb/alien_romulus_new_version_comparison/"
    },
    {
        "id": "1ic50oa",
        "author": "SanderSo47",
        "title": "Robert Eggers’s Criterion Movie Closet Picks",
        "content": "",
        "upvotes": 787,
        "comments": 136,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TollomFyEYnOUzdTkEsvBVy5f9-RE5tCWmvIxRh1HFg.jpg?auto=webp&amp;s=8319a02f85997f44fa4e0f5ecb4bf0f19526e3e9"
        },
        "permalink": "/r/movies/comments/1ic50oa/robert_eggerss_criterion_movie_closet_picks/"
    },
    {
        "id": "1ic9rbv",
        "author": "Alternative-Cake-833",
        "title": "The Mission: Impossible movies are some of the best action movies of all-time.",
        "content": "A while back, I finally decided to bit the bullet and finally watch some movies that I didn't get around to watching (e.g. Jason Bourne and Jack Ryan). I still haven't gotten around to the James Bond and John Wick films though.\n\nBut oh man, the Mission: Impossible movies might be some of the best action movies of all-time. The first one may be the slow one out of the whole series but even 2 isn't a bad movie in general despite being the worst of the Mission: Impossible movies. Fallout even blows most of the Marvel movies out of the water besides for Captain America: The Winter Solider and Spider-Man: No Way Home. It's surprising to me that Tom Cruise does his own stunts for all of the Mission: Impossible movies, if someone like Brad Pitt or Bruce Willis were Ethan Hunt, they wouldn't do most of their own stunts. And the most divisive movie of the series, Dead Reckoning is still actually a really good movie besides for IIsa's death. Just really good movies around.\n\nI really hope that Mission: Impossible - The Final Reckoning is actually the best Mission: Impossible just because of how good it looks.",
        "upvotes": 365,
        "comments": 159,
        "media": null,
        "permalink": "/r/movies/comments/1ic9rbv/the_mission_impossible_movies_are_some_of_the/"
    },
    {
        "id": "1ic9w2c",
        "author": "bitbot",
        "title": "Star Trek: Section 31 - re:View",
        "content": "",
        "upvotes": 321,
        "comments": 171,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pt-x2d-YhskQGxM8dyNN4Hqn6UAeNWYNqzCzD16zxCo.jpg?auto=webp&amp;s=3a3b3d0146335371c9af3ccd9497e97825fda57b"
        },
        "permalink": "/r/movies/comments/1ic9w2c/star_trek_section_31_review/"
    },
    {
        "id": "1icmfdi",
        "author": "EggsyBenedict",
        "title": "What makes some actors look \"period\" or \"modern\"?",
        "content": "The other day I read someone saying that Ben Affleck has \"a face that knows about emails\", which I though was hilariously apt. He was excellent in The Last Duel, but I definitely feel his look doesn't lend to roles in period films. \n\nOn the other end of the spectrum, actors like Tobias Menzies and Mark Rylance seem to blend into period settings more than contemporary ones. \n\nThis makes me wonder, what makes some actors look more \"period\" than others? I think super neat dental veneers and plastic surgeries play a role here (for example, Nicole Kidman in The Northman looked distinctly modern), but I don't think that's the full answer. What are your thoughts? ",
        "upvotes": 43,
        "comments": 37,
        "media": null,
        "permalink": "/r/movies/comments/1icmfdi/what_makes_some_actors_look_period_or_modern/"
    },
    {
        "id": "1ichfvu",
        "author": "ThingsAreAfoot",
        "title": "Whoopi Goldberg in Ghost",
        "content": "Famous romantic movie of course, the music, the pottery, etc. That early scene with Unchained Melody is one of the most romantic sequences ever filmed. \n\nAnd it’s also not novel to highlight Whoopi, who won the Oscar here. \n\nBut upon rewatch, it really is an impressive performance.  Whoopi is absolutely electric in this movie. She bursts in like lightning and so smoothly carries the tone from comedy to drama and back again and she pulls that off effortlessly even in individual scenes. She doesn’t even show up in the movie at all till 40 minutes in. \n\nIt’s a brilliant performance and again she won the Oscar so it’s not underrated or anything, but I think it’s often viewed as a sort of silly performance or even a Magical Negro (ess) one, but it isn’t anything like that. She’s just so warm and just so alive, it’s wonderful to rewatch after so long. ",
        "upvotes": 86,
        "comments": 49,
        "media": null,
        "permalink": "/r/movies/comments/1ichfvu/whoopi_goldberg_in_ghost/"
    },
    {
        "id": "1ichvh9",
        "author": "The_Flash_20",
        "title": "Please Recommend me some Time Travel Movies",
        "content": "I have seen Back to the future, Primer, Timecrimes etc.\n\nI really want to see movies from this genre as it is quite unexplored in my opinion. \n\nPlease recommend me some who are lesser known or were not received well during their release.\n\nMovies from Non - English languages are welcome as well.\n\nMuch appreciated.\n\n**Edit:- Thanks Everyone who suggested PROJECT ALAMANAC. This movie has been haunting me for last 8 years. I always remembered a movie about a guy who went to see his father back in time whose building a time machine and comes back to the same day. Was disappointed in that movie when I saw it in 2016. Couldn't remember it's name even after trying hard.** \n\n\n**Interestingly enough I made this post so that someone would recommend me that movie as I knew it was around 2014-16.**\n\n**I have finally found the movie which has been haunting me.**\n\n**Thanks everyone. Sincerely**",
        "upvotes": 63,
        "comments": 662,
        "media": null,
        "permalink": "/r/movies/comments/1ichvh9/please_recommend_me_some_time_travel_movies/"
    },
    {
        "id": "1ic04o2",
        "author": "Hermit0fAlbion",
        "title": "Save The Prince Charles Cinema",
        "content": "",
        "upvotes": 546,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cpv5db4pyinwALoPV859CTfcRjAOXylfzS6HgCK__6U.jpg?auto=webp&amp;s=9ba1b75ce897995d0259fccecbd4bef2dab63563"
        },
        "permalink": "/r/movies/comments/1ic04o2/save_the_prince_charles_cinema/"
    },
    {
        "id": "1ibw46c",
        "author": "Tehgumchum",
        "title": "Pointless movie facts!",
        "content": "Anybody up for some pointless movie facts? I will start\n\n- Marty McFly never makes it back to his original timeline in any of the Back to the Future movies and finishes his life in an alternate timeline\n\n- Sigourney Weaver has played basketball in outer space in 2 different movies involving aliens and neither of them were Spacejam or its sequel\n\n- If you remove all of Millie Bobby Browns scenes from Kong vs Godzilla, it will have no impact on the movie/plot at all\n\nEdit: have another one to add\n\n- When Captain America travels to the past by himself to live his life, he completely ignores the fact Bucky is being tortured somewhere, or he cold prevent JFKs assassination\n\nEdit 2: One more to add\n\n- Mary Steenburgen has a tendency to seduce time travellers!",
        "upvotes": 1268,
        "comments": 1168,
        "media": null,
        "permalink": "/r/movies/comments/1ibw46c/pointless_movie_facts/"
    },
    {
        "id": "1icdggl",
        "author": "Cultural-Glass6729",
        "title": "What’s the most otherworldly movie you’ve seen?",
        "content": "I’m not just asking about what movies were amazing, I’m asking what movies made you question if the director, actors, and/or crew were human? What movies transcended the media and became something else? What movie made you question everything you thought you knew by the end of it? After watching the movie you couldn’t move for minutes, just thinking about what you just consumed.",
        "upvotes": 77,
        "comments": 270,
        "media": null,
        "permalink": "/r/movies/comments/1icdggl/whats_the_most_otherworldly_movie_youve_seen/"
    },
    {
        "id": "1ic46wt",
        "author": "indiewire",
        "title": "Paul Newman’s Best Performances: ‘Cool Hand Luke,’ ‘The Hustler,’ and More",
        "content": "",
        "upvotes": 245,
        "comments": 77,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nNkYPG_xmmQmP8Wsb9pG9Lu_WxpjHrT_B7Oz-gRDYzs.jpg?auto=webp&amp;s=6c5701449078a9ad80be1d3e3357fc3aee56a045"
        },
        "permalink": "/r/movies/comments/1ic46wt/paul_newmans_best_performances_cool_hand_luke_the/"
    },
    {
        "id": "1ic3sxy",
        "author": "BunyipPouch",
        "title": "First Poster for Drama 'Long Day's Journey Into Night' - Starring Jessica Lange, Ed Harris, and Ben Foster - Over the course of a day, a married couple and their two sons grapple with the mother's morphine addiction and confront each other over the past in a series of tense and volatile exchanges.",
        "content": "",
        "upvotes": 255,
        "comments": 42,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/u8czpez63rfe1.jpeg?auto=webp&amp;s=55a71f479a20f1a1adac601734743fa589185ee2"
        },
        "permalink": "/r/movies/comments/1ic3sxy/first_poster_for_drama_long_days_journey_into/"
    },
    {
        "id": "1ibz6hs",
        "author": "Radulno",
        "title": "Fantasy Epic 'The Stolen Child' Releases New Trailer",
        "content": "",
        "upvotes": 522,
        "comments": 56,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/O-gAMPdGFnSU9WNsgOHIHczuqxYm4AOaNBqjkOJRec8.jpg?auto=webp&amp;s=88b1225ca7aa77fe608d31a991c43f616f9028a0"
        },
        "permalink": "/r/movies/comments/1ibz6hs/fantasy_epic_the_stolen_child_releases_new_trailer/"
    },
    {
        "id": "1ic9ctn",
        "author": "throwawabud",
        "title": "Mena Suvari, Skeet Ulrich, Elizabeth Marvel Starring in Horror Film ‘Devoted’",
        "content": "",
        "upvotes": 110,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/m6uVDWK46oR-gM9cMLOhE-IR6qMNhmkI0JPDO2khF7E.jpg?auto=webp&amp;s=8e358e28dd99d04d66d935f515b893e552a5c5bd"
        },
        "permalink": "/r/movies/comments/1ic9ctn/mena_suvari_skeet_ulrich_elizabeth_marvel/"
    },
    {
        "id": "1ibues5",
        "author": "boib",
        "title": "Barbara Billingsly discusses JIVE talking in AIRPLANE",
        "content": "",
        "upvotes": 1294,
        "comments": 110,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SdJK0OZpMyzKQJRecawFcywGLeKMqveOHbgjvEqDUnI.jpg?auto=webp&amp;s=116786a39471aec8884cbf37c55431a459f78087"
        },
        "permalink": "/r/movies/comments/1ibues5/barbara_billingsly_discusses_jive_talking_in/"
    },
    {
        "id": "1icn7m4",
        "author": "Wulfey7",
        "title": "What movie moment/character still gives you chills, even after re-watching the film?",
        "content": "I'll go first...\n\nI’m currently recovering from a respiratory infection because asthma is dumb. It’s been rough and I’ve been feeling pretty down. To cheer myself up, I decided to have a Disney movie marathon while coughing my lungs up.\n\nDisney’s animated Tarzan was among the movies I re-watched. For me, the soundtrack remains a masterpiece. I feel like it was perfectly interwoven with the narrative and just amazing in general.\n\nThe opening scene still hits me in the feels, especially with the accompanying music.\n\nSabor herself still gives off a deadly ambiance also. The terrifying sounds she makes and her overall vibe feel incredibly intense, especially with it being a Disney movie,. The way her claws are animated and the fluidity of her movements just feel super deadly, even after all these years. Combined with the background music, her scenes still give me chills, even with the occasional touches of humor thrown into them.\n\nThat's my movie moment/character that still gives me chills, even after re-watching the movie. What's yours?",
        "upvotes": 12,
        "comments": 40,
        "media": null,
        "permalink": "/r/movies/comments/1icn7m4/what_movie_momentcharacter_still_gives_you_chills/"
    },
    {
        "id": "1ibzo9q",
        "author": "Lionel_Hislop",
        "title": "\"Bowfinger\" (1999) is such a genius parody of the move business. It's impossible not to laugh at the hijinks and the shade directed at the industry",
        "content": "It's unfortunate it didn't do as well as some of the more popular Eddir Murphy movies because Bowfinger is probably among his top 5 movies ever. Then again, thank god it didn't do a lot or else we would have had a couple of mediocre sequels. \n\nThere isn't a single flaw in this movie. Even the set-up of the unknown dorky twin works because the writing is so good and Murphy plays it up so well, either as the narcissistic egomaniacal asshole Kit Ramsey with his endless rants about not being appreciated or racist paranoia (he mistakes Shakespeare for Shake a Spear), or the geeky Jiff who's used by the untalented director, Bobby Bowfinger (Steve Martin), as a occasional body double for Kit Ramsey, in his movie \"Chubby Rain\". Bowfinger decides to direct a movie by filming Ramsey without him knowing about it.\n\nHe also has aging actress Carol (Christine Baranski), who doesn't know when to overact and wants to have sex with Kit Ramsey, Daisy (Heather Grahame), an aspiring and ambitious actress who can't act but will do anything to go up in her career (said to be a diss directed at Anne Heche whom Steve Martin used to date), Afrim (Adam Alexi Malle), a Videostore owner who helps fund Bowfinger's ambitions among others. \n\nThe film also features strong supporting turns from Robert Downey Jr (during his \"I'm cancelled Junkie\" phase) and Terence Stamp. \n\nA highlarious movie. The highway scene is a classic. It always gives its audience an uproarious laughter.",
        "upvotes": 299,
        "comments": 78,
        "media": null,
        "permalink": "/r/movies/comments/1ibzo9q/bowfinger_1999_is_such_a_genius_parody_of_the/"
    },
    {
        "id": "1ibqtyq",
        "author": "impeccabletim",
        "title": "New poster for Ryan Coogler's 'Sinners' starring Michael B. Jordan",
        "content": "",
        "upvotes": 1536,
        "comments": 291,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0sgumvwf7nfe1.jpeg?auto=webp&amp;s=f20eb782f16d13536c470182268eb92f7dde2370"
        },
        "permalink": "/r/movies/comments/1ibqtyq/new_poster_for_ryan_cooglers_sinners_starring/"
    },
    {
        "id": "1icmwnz",
        "author": "These_Feed_2616",
        "title": "Gary Oldman",
        "content": "Gary Oldman is one of my top 10 favorite actors, dude is a chameleon, what is your guy’s favorite Gary Oldman performance? I thought he was fantastic as Sid Vicious in “Sid and Nancy” and also was awesome as Dracula in “Bram Stoker’s Dracula” but for me personally, he was so fun to watch in “Leon the Professional” as Norman Stansfield!",
        "upvotes": 8,
        "comments": 33,
        "media": null,
        "permalink": "/r/movies/comments/1icmwnz/gary_oldman/"
    },
    {
        "id": "1ic88o1",
        "author": "corkanocy",
        "title": "Movies dealing with grief &amp; loss?",
        "content": "Hi! Can you recommend me some films with themes of death/loss/grief/some kind of afterlife? I'm in desperate need for comfort. The more melancholic, subtle and contemplating the better. Bonus points if they're Korean/Japanese (or Asian cinema in general). \n\nTo give you a better example of what I'm looking for here's a couple I can think of I've seen already: Bleak Night, After My Death, A ghost story, Aftersun, Arrival, Taste of Cherry, Knockin' on Heaven's Door, I'm Thinking of Ending Things, Fountain, Synecdoche New York, Nine Days, Stand by Me, Demolition, The Father, Another Earth, Third Star. ",
        "upvotes": 54,
        "comments": 436,
        "media": null,
        "permalink": "/r/movies/comments/1ic88o1/movies_dealing_with_grief_loss/"
    },
    {
        "id": "1icieoc",
        "author": "herequeerandgreat",
        "title": "if they actually make any of ray harryhausen's unmade movies, the effects should be stop motion.",
        "content": "in the world of movies, there is no bigger name in special effects then ray harryhausen. despite stop motion not being used as much nowadays, his films continue to astound and entertain. i am a big fan of his work and it was actually his work that partially inspired my love of film.\n\nharryhausen made 16 feature films over the course of his career, not counting short films. however, it's not for lack of trying on his part. harryhausen had numerous ideas for films that never ended up materializing. there's even a whole book about them called harryhausen the lost movies.\n\nconsidering how many filmmakers have been influenced by harryhausen's work, it's only a matter of time before someone tries to make one of these projects that harryhausen planned. if that happens, they should go all the way with the tribute and use stop motion animation instead of CGI animation.",
        "upvotes": 15,
        "comments": 4,
        "media": null,
        "permalink": "/r/movies/comments/1icieoc/if_they_actually_make_any_of_ray_harryhausens/"
    },
    {
        "id": "1ibwml2",
        "author": "PrithvinathReddy",
        "title": "Ralph Ineson is another weapon in Robert Eggers cinematic arsenal.",
        "content": "Willem Dafoe often gets spotlight for his collaborations with Eggers (Thomas Wake - The Lighthouse, Heimir the fool - Northman, Prof. Albin Eberhart Von Franz - Nosferatu) and Eggers recently revealed that he has also offered Dafoe roles in his next two movies but another frequent collaborator of Eggers that has quietly delivered powerhouse performances in the director's films is \"Ralph Ineson\". \n\nKnown for his deep and imposing voice, Ineson got his break into the mainstream by appearing as Death Eater Aymcus Carrow in the later Harry Potter films and as House Greyjoy advisor, Dagmer Cleftjaw, in the 2nd season of Game of Thrones. A prolific character actor, he's even set to appear as the leading villain in a Marvel films as Glacactus in the new “Fantastic 4” movie. \n\nHere's a look at his roles in Eggers movies : \"William - The Witch\", \"Captain Volodymryr - Northman\", \"Dr. Wilhelm Sievers - Nosferatu\". ",
        "upvotes": 307,
        "comments": 111,
        "media": null,
        "permalink": "/r/movies/comments/1ibwml2/ralph_ineson_is_another_weapon_in_robert_eggers/"
    },
    {
        "id": "1icb8iu",
        "author": "CombatLightbulb",
        "title": "Most satisfying revenge sequences.",
        "content": "I recently watched Wind River again which is what prompted me to ask this question. I enjoy pretty much everything about that movie but damn if Renner taking that last guy up the mountain, taking his shoes, and giving him “the same chance she had” isn’t just a phenomenal cherry on top of a triple scoop of slow burn sadness. \n\nWhat are some other *chefs kiss* revenge scenes?",
        "upvotes": 30,
        "comments": 90,
        "media": null,
        "permalink": "/r/movies/comments/1icb8iu/most_satisfying_revenge_sequences/"
    }
]