[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 13,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1ol015l",
        "author": "PureRaisin",
        "title": "C2C buddy",
        "content": "Sto andando al C2C da solo, sia alla serata di oggi che domani. Arrivo col treno da Trieste. Se ci sono altre persone che vanno da sole e vogliamo andare assieme, scrivetemi. \n\n\nGoing to C2C tonite and tomorrow, travelling alone from Trieste. If you are also going to C2C alone and fancy going with someone let's meet up!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ol015l/c2c_buddy/"
    },
    {
        "id": "1okif9f",
        "author": "cake1066",
        "title": "Is Piedmontese worth studying, or just stick to Italian?",
        "content": "(Title) + sorry for the English",
        "upvotes": 8,
        "comments": 31,
        "media": null,
        "permalink": "/r/torino/comments/1okif9f/is_piedmontese_worth_studying_or_just_stick_to/"
    },
    {
        "id": "1oksyty",
        "author": "Difficult_Leek_5693",
        "title": "È sicuro prendere l’autobus alle 5 del mattino da via Frejus e Racconigi?",
        "content": "Ciao a tutti! Sono nuovo in città e devo prendere un autobus verso l’aeroporto intorno alle 5 del mattino, partendo dalla zona di via Frejus e corso Racconigi.  \nQualcuno sa se è sicuro muoversi a quell’ora? \n\nGrazie mille!",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1oksyty/è_sicuro_prendere_lautobus_alle_5_del_mattino_da/"
    },
    {
        "id": "1ojzf46",
        "author": "SteamPaz",
        "title": "Una Cometa su Borgata Frassati",
        "content": "C/2025/A6 (Lemmon) a magnitudine apparente +4.2 in cielo con indice Bortle 8 (27/10/25, ore 18:30-19:00).\n\n55mm f/6.3 su sensore aps-c (Canon EOS 2000D), ISO800, 198x10s (33min).",
        "upvotes": 52,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/z2zepueo19yf1.jpeg?auto=webp&amp;s=751f3384dd48ddc220bdbd1d6db0b11f63a0b159"
        },
        "permalink": "/r/torino/comments/1ojzf46/una_cometa_su_borgata_frassati/"
    },
    {
        "id": "1okog4l",
        "author": "Top-Text-7727",
        "title": "Prezzi dentro al c2c?",
        "content": "Ciao, sarò al festival in questi giorni e ho scaricato la app. Quanto costeranno dentro le consumazioni?  ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1okog4l/prezzi_dentro_al_c2c/"
    },
    {
        "id": "1ok7m1b",
        "author": "Wyvern57",
        "title": "M1S non accetta pagamento con carta?",
        "content": "Ciao, mi è scaduto l’abbonamento sulla tessera BIP e non intendo rinnovarlo.\nQualche sera fa ho preso un sostitutivo della metro e nessuna delle due obliteratrici ha accettato la mia carta. \n\nSono stato sfortunato o sono tutti così? \nQuali altre linee hanno questo problema?",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1ok7m1b/m1s_non_accetta_pagamento_con_carta/"
    },
    {
        "id": "1ok6yki",
        "author": "CheloCochelo07",
        "title": "Consigli per fare amicizia a Torino ♥",
        "content": "Ciao! Sono Marcelo, da 3/4 anni vivo a Torino, e sento di averne un giro di conosciuti molto piccolo; vorrei conoscere gente con voglia di fare qualcosa. Sono argentino, ho 24 anni, mi sono separato poco fa e mi piacerebbe fare qualcosa fuori casa. Mi piace la pallavolo, i giochi online, e per me qualsiasi tematica di conversazione e interessante, Se vuoi mi puoi scrivere direttamente al IG (@Marcheleyn) Sennó anche un comment in questo post mi piacerá leggerlo. Grazie mille comunitá!",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1ok6yki/consigli_per_fare_amicizia_a_torino/"
    },
    {
        "id": "1ok34yu",
        "author": "sixlaneve4_0",
        "title": "Lungo dora Firenze.",
        "content": "Per chi è di Torino.\nNon entro nei dettagli, ma lungo dora Firenze - zona Aurora, che zona è?\nHo trovato un annuncio per una casa per studenti al n'31, ma su Google Maps, mi sembra più una pseudo casa popolare.",
        "upvotes": 2,
        "comments": 20,
        "media": null,
        "permalink": "/r/torino/comments/1ok34yu/lungo_dora_firenze/"
    },
    {
        "id": "1okb7n1",
        "author": "Historical-Baby-6345",
        "title": "Selling 1 Golden pass to C2C festival for 31 october!",
        "content": "Hello, I sadly can't make it tomorrow because my flight tickets to Turin were way too expensive :(\n\nDM if interested! \n\nhttps://preview.redd.it/n56o4dwx9byf1.png?width=539&amp;format=png&amp;auto=webp&amp;s=92538a9975710cb129a387b1bfacaa5b3647763e\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1okb7n1/selling_1_golden_pass_to_c2c_festival_for_31/"
    },
    {
        "id": "1ojwran",
        "author": "ZayaBt-",
        "title": "C'è qualcuno che non ha ancora ricevuto la pergamena?",
        "content": "Mi sono laureata all'Università di Torino ad aprile. Non mi hanno ancora dato la pergamena, ho inviato un paio di ticket, mi avevano detto di ricontattare fine ottobre ma adesso non mi rispondono più.\n\nMi serve questa cosa per rinnovare il mio permesso di soggiorno, la questura mi chiede se non è pronta la pergamena, almeno una certificazione di laurea timbrata da segreteria, ma non mi rispondono da un mese. \n\nMa davvero richiede così tanto tempo per dare la pergamena? Molto fastidiosa questa situazione. ",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1ojwran/cè_qualcuno_che_non_ha_ancora_ricevuto_la/"
    },
    {
        "id": "1ok9qoi",
        "author": "Tough-Assistant-9740",
        "title": "Furgoncino per trasloco",
        "content": "Ciao a tutti! Dovrei portare giusto un divano smontato e qualche altra cosetta da casa vecchia. Contavo di usare i furgoni di enjoy dato che hanno dei prezzi molto competitivi, ma sono due settimane che gli stalli sono vuoti (per chi non lo sapesse ora i furgoncini non sono più disponibili in giro).. sapete come mai? Avete qualche alternativa da propormi? Grazie mille",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1ok9qoi/furgoncino_per_trasloco/"
    },
    {
        "id": "1ok270z",
        "author": "Gullible_Drummer_246",
        "title": "Dove comprare lepre?",
        "content": "Come da titolo cercavo un posto dove comprare una lepre.\n\nMi vengono a trovare e vorrebbero comprarla ma essendo io grossomodo vegetariano non ho la benché più minima idea di dove potrebbero trovarla.",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1ok270z/dove_comprare_lepre/"
    },
    {
        "id": "1ok7ya8",
        "author": "SpanishPilot",
        "title": "Best places to rent for a 30M?",
        "content": "Hi all, \n\nI'm moving to Torino for work starting on the 1st of January and I know nothing about the city. \n\nI'll be working at the airport and have to be at work at 5am some days and finish very late other days so I'm looking for something no further than 30' away, I will also have a car available so public transport is not a must. \n\nIdeally I'd love to find a 1-2 bedroom apartment to rent for around 6 months initially. I like the feel of a small town with good restaurants and a fun vibe. I'd also like to be close enough to the centre of Torino (15-20' by car or public transport).\n\nI was also wondering how much I can expect to pay in things such as gas/electricity/water/internet for 1 person and if there's any extra things like council tax that I'll have to pay as a tenant. \n\nMy budget for rent+bills is around 1300€/month. \n\nThank you for your help! ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ok7ya8/best_places_to_rent_for_a_30m/"
    },
    {
        "id": "1ok7ocf",
        "author": "Accprova",
        "title": "Dove fare pranzo in periodo natalizio?",
        "content": "Amici!  \nIn periodo natalizio (weekend 20/21 dicembre) devo organizzare un pranzo a Torino con dei parenti.\n\nMia moglie è straniera, e vorrei farle provare della cucina piemontese BUONA.\n\nConoscete dei posti tipici dove fare pranzo a Torino, che facciano cucina piemontese? Posti dove siete stati e che potete raccomandare.\n\nL'unico dettaglio importante è che dev'esserci parcheggio, perché alcuni parenti (noi compresi) arrivano in macchina da fuori Piemonte.\n\nMerci!\n\nEDIT: Grazie a tutti! Mi avete dato ottimi suggerimenti",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1ok7ocf/dove_fare_pranzo_in_periodo_natalizio/"
    },
    {
        "id": "1okc3v5",
        "author": "Dense-Knee547",
        "title": "Casa in affitto senza busta paga",
        "content": "Mi è sorto un dubbio, sicuramente molto banale, dettato dalla mia inesperienza in materia. Ipotizziamo che voglia prendere in affitto un monolocale/bilocale e che io non abbia buste paga da poter mostrare come garanzia economica in quanto ho appena finito gli studi. Inoltre, ipotizziamo che io abbia appena stipulato un contratto di lavoro a tempo determinato avrei delle possibilità di trovare qualcuno che mi dia una casa un affitto?\nPremetto non nessuno che mi possa fare da garante ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1okc3v5/casa_in_affitto_senza_busta_paga/"
    },
    {
        "id": "1ojtfsd",
        "author": "Ok_Swordfish_5870",
        "title": "barbiere torino 10€",
        "content": "Ciao! Cerco un barbiere in centro che mi tagli i capelli per 10 o max 15€  \nAvete consigli?  \nGrazie!",
        "upvotes": 6,
        "comments": 24,
        "media": null,
        "permalink": "/r/torino/comments/1ojtfsd/barbiere_torino_10/"
    },
    {
        "id": "1ok44kc",
        "author": "IlKayMosca",
        "title": "Abbonamento parcheggio Zona Lingotto",
        "content": "Ciao a tutti, volevo sapere se i parcheggi blu di fronte il centro commerciale lingotto ricadono in qualcuno degli abbonamenti relativi ai parcheggi oppure sono solamente soggetti a tariffe orarie. Chiedo perché dal sito GTT sembra non ricadano in nessuna delle zone soggette ad abbonamento ",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/oub3ffc5y9yf1.jpeg?auto=webp&amp;s=391bdef5be9950ad92f0a0050883130df99e9322"
        },
        "permalink": "/r/torino/comments/1ok44kc/abbonamento_parcheggio_zona_lingotto/"
    },
    {
        "id": "1ojxesk",
        "author": "nickname1917",
        "title": "Lavori per ciclabile di via FIladelfia",
        "content": "Stanno allargando la ciclabile di via Filadelfia e fin qui tutto ok (almeno per me che uso la bici). C'è un tratto di marciapiede che sarà lungo si e no 20 o 30 metri su cui stanno scavando, trapanando, dissestando, scusate non conosco i termini tecnici da 12 - DODICI - giorni lavorativi. C'è qualche esperto di lavori stradali che mi possa illuminare sui passaggi necessari, perché non capisco come mai il marciapiede è ancora distrutto e non c'è traccia della posa del nuovo asfalto (o come si chiama)... i lavori sulla via vanno infatti avanti da prima dell'estate perché per ogni tratto è così. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ojxesk/lavori_per_ciclabile_di_via_filadelfia/"
    },
    {
        "id": "1ojv701",
        "author": "Cotolettadipoll0",
        "title": "halloween 2025",
        "content": "questo è il mio primissimo post su reddit e ammetto che non me ne intendo molto!! \nComunque quest’halloween dovevo fare una festa con dei miei amici, solo che ieri mi hanno balzato all’ultimo…. \nSe qualcuno ha idee o consigli su cosa potrei fare sono ben accetti!! \nIn generale volevo passare una serata diversa non fare il solito giro in centro (non so se ci sono eventi o festini dove posso aggiungermi all’ultimo) ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ojv701/halloween_2025/"
    },
    {
        "id": "1ojv45p",
        "author": "_L_-",
        "title": "Escursioni x Via degli Dei",
        "content": "Ciao! Cerco consigli su escursioni da fare in zona in preparazione alla Via degli Dei Bologna-Firenze che vorrei fare ad aprile. \n\nNon faccio trekking e non ho nemmeno le scarpe, fisicamente sono messo bene ma non cammino spesso. \n\nMi sapete consigliare scampagnate da fare in giornata in zona raggiungibili con mezzi pubblici? \n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ojv45p/escursioni_x_via_degli_dei/"
    },
    {
        "id": "1ojy921",
        "author": "RainDesigner",
        "title": "puntura con ago a secco a Torino",
        "content": "Ciao a tutti, mi chiedevo se fosse possibile sottopormi a un trattamento di puntura con ago a secco da qualche parte a Torino e farlo coprire dall'assicurazione. Ho un dolore piuttosto persistente che sono sicuro sia causato da alcuni punti trigger, poiché i modelli di dolore sono una copia esatta dei comuni modelli di dolore riferito dai punti trigger, ma farlo di tasca mia è un po' troppo costoso. Nel mio paese sapevo come farlo coprire dall'assicurazione, ma non sono sicuro di come funzioni qui. Qualsiasi aiuto è molto apprezzato, se qualcuno ha avuto un problema simile in passato e sa come procedere",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1ojy921/puntura_con_ago_a_secco_a_torino/"
    },
    {
        "id": "1ojkuxj",
        "author": "Icy_Sand_1453",
        "title": "Best food a Torino",
        "content": "What food should I not miss in Turin?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ojkuxj/best_food_a_torino/"
    },
    {
        "id": "1ojdxva",
        "author": "ElectricalVegetable6",
        "title": "Come bippare su SFM?",
        "content": "Ho fatto una tessera Bip Universitaria, che mi permette di usare i servizi urbani/suburbani e i treni nel comune di Torino. La mia domanda è: come si fa a bippare la carta nelle stazioni ferroviarie? Non trovo una macchina per bippare, a parte la macchina verde Tap&amp;Tap di Trenitalia.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ojdxva/come_bippare_su_sfm/"
    },
    {
        "id": "1ojj7o8",
        "author": "Haunting_Hat5975",
        "title": "partiboi69 in turin",
        "content": "Hey, is anybody going to partiboy69 on friday?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ojj7o8/partiboi69_in_turin/"
    },
    {
        "id": "1oj6ha0",
        "author": "Rascoyho",
        "title": "Soffiafoglie",
        "content": "\nScusate, ma anche a voi danno fastidio quei maledetti soffiafoglie a benzina che rompono i timpani e soprattutto i cog.. ni? \nIl comune non può bandirli a favore di quelli a batteria? ",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1oj6ha0/soffiafoglie/"
    },
    {
        "id": "1ojepzk",
        "author": "EstablishmentFit7936",
        "title": "Carte Pokémon Torino",
        "content": "Ciao a tutti!\nSono nuovo a Torino e sto cercando di completare il pokedex, sapete di qualche negozio o mercatino qui a Torino che vende carte singole ? Mi servono tutti i tipi di carte solo che non so dove trovarle",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1ojepzk/carte_pokémon_torino/"
    },
    {
        "id": "1oj4lt6",
        "author": "Hot-Garage-4536",
        "title": "Scrittori a Torino e dintorni",
        "content": "Ciao a tutti! Starei scrivendo una storia per un fumetto, solo che scrivere non é una gran passione per me, quindi far uscire qualcosa di buono ci metto un po’. \nSe qualcuno avesse voglia di mettersi in gioco e aiutarmi a portare avanti sto progetto, vi sarei grata :)\n\nNon saprei neanche da dove partire per rendere più intrigante la mi proposta, quindi se avete delle domande fate pure :,)",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1oj4lt6/scrittori_a_torino_e_dintorni/"
    },
    {
        "id": "1oj897t",
        "author": "reddithatsick",
        "title": "AAA cercasi squadra calcio a 7",
        "content": "Ciao Raga, io e un mio amico avremmo voluto fare tornei di calcio a 7 ( ma anche sporadiche partite ) ma mi sono reso conto che mi viene veramente difficile contattare squadre. Qualcuno di voi ha qualche dritta?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1oj897t/aaa_cercasi_squadra_calcio_a_7/"
    }
]