[
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 75,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 19,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1lqf06k",
        "author": "Spiritual_Kiwi_4521",
        "title": "I’m done starting new Netflix shows. They cancel everything good.",
        "content": "I just finished Insatiable and found out it was canceled after Season 2, with no proper ending. And for what? It was a hit show, it had a following, it wasn’t hidden in the depths of the platform. It could’ve grown even more if Netflix actually supported it.\n\nThis isn’t just about one show. This is about the pattern. They cancel everything good, especially original, weird, dark, or risky stuff, and replace it with endless reality shows or bland reboots.\n\nWhy do they think viewers will keep trusting them with our time and emotional investment if they pull this every time?\n\nIt’s like they only care about new signups, not long-term fans. They greenlight 100 shows and abandon 98 of them. How is that sustainable?\n\nI genuinely wish I could flood their inbox with 40,000 complaints, because clearly they’re not hearing how angry people are. There’s no point in starting new shows anymore if we know there’s no closure. Same with keeping a subscription. What a waste of a company they are. \n\nI hope I can get so many views on this post that Netflix sees this 😭  \n\nAnyone else feel like this?",
        "upvotes": 298,
        "comments": 113,
        "media": null,
        "permalink": "/r/netflix/comments/1lqf06k/im_done_starting_new_netflix_shows_they_cancel/"
    },
    {
        "id": "1lqebzy",
        "author": "Sudden_Pop_2279",
        "title": "‘Squid Game’ Season 3 Becomes First Show To Debut No. 1 On Netflix Across 93 Countries With 60.1M Views",
        "content": "",
        "upvotes": 21,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lqebzy/squid_game_season_3_becomes_first_show_to_debut/"
    },
    {
        "id": "1lq7e24",
        "author": "ggroover97",
        "title": "Netflix Freshmen ‘Pulse’ &amp; ‘The Residence’ Canceled, ‘No Good Deed’ On Indefinite Pause",
        "content": "",
        "upvotes": 51,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1lq7e24/netflix_freshmen_pulse_the_residence_canceled_no/"
    },
    {
        "id": "1lqfnyd",
        "author": "bongoverlander",
        "title": "Is it just me or did the last season of Squid Game completely lose the plot?",
        "content": "Okay, I just finished the latest season of Squid Game and… wow, what a letdown. I really wanted to like it, I tried to like it—but somewhere between the recycled plot points and painfully predictable twists, I felt like the magic of the first season just vanished.\n\nThe original had unpredictability, emotional stakes, and that gritty commentary on capitalism and human desperation. But this one? It felt like they were trying to shock us, but you could see it coming from a mile away. The tension just wasn’t there.\n\nAlso, character development took a nosedive. Instead of complex personalities making morally grey choices, we got caricatures running through a checklist of betrayals and “surprises” that weren’t surprising at all.\n\nEven the games lacked originality this time. One of them was so absurdly over-the-top that it felt more like a bad parody of Squid Game than the real thing.\n\nAnyone else feel this way? Was I expecting too much? Or has the show just become another victim of its own success?",
        "upvotes": 12,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1lqfnyd/is_it_just_me_or_did_the_last_season_of_squid/"
    },
    {
        "id": "1lqghyr",
        "author": "SFTHfan24",
        "title": "The Old Guard 2",
        "content": "I just finished watching the Old Guard 2 and to say I’m disappointed is a massive understatement. \n\nLike what was the point of this movie even? Barely anything happened. Little to no character development and a complete waste of my time and excitement for it. \nLiterally almost 2 hours of crap. \n\nI actually really loved the first movie and based on how it ended I was really excited to see what was going to happen next and the character development for Andy and Nile especially but we got nothing. ",
        "upvotes": 11,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lqghyr/the_old_guard_2/"
    },
    {
        "id": "1lqexqo",
        "author": "cuckoocraftbyjam",
        "title": "Rumi of kpop demon hunters",
        "content": "Just finished making her pattern as well!! Had so much fun making and hoping to finish zoey and miras next!! Maybe I should do Jinu next or the derpy cat? What do you guys think?",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lqexqo/rumi_of_kpop_demon_hunters/"
    },
    {
        "id": "1lprd43",
        "author": "butterchickened",
        "title": "The Old Guard 2",
        "content": "Well, that sucked!\nIs it just me or did the sequel not live up to expectations? \nI was so hyped up but now I'm lying here in bed in utter disappointment. \nIs it just the sequel effect? Or was the movie genuinely bleh? \n\nBarely any Joe and Nicky screen time, no actual communication happening between people, Andy just looking away deeply at every moment, underwhelming fight scenes, a stupid ending. \nTo be fair, there were some good parts. I did like seeing Andy a little happier. I loved Quyns angst. Booker made me cry. But overall it was a disappointing sequel.\nI mean if you're going to take 467866 years to make it, at least get it right??\n",
        "upvotes": 156,
        "comments": 259,
        "media": null,
        "permalink": "/r/netflix/comments/1lprd43/the_old_guard_2/"
    },
    {
        "id": "1lqkfrz",
        "author": "Artistic_Spinach_589",
        "title": "What are your favorite Netflix show characters?",
        "content": "BTW it's okay if you include characters from kids cartoons (like Gabby's Dollhouse and Word City)",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lqkfrz/what_are_your_favorite_netflix_show_characters/"
    },
    {
        "id": "1lqdkho",
        "author": "kk_in_a_good_way",
        "title": "The Old Guard 2 makes no sense",
        "content": "The whole logic around Nile hurting Andy in the first movie and causing her to become mortal is false. Andy heals from the stab wood that Nile did in the desert. Meanwhile in 2, Booker doesn't heal from the very first cut cause my Nile.\n\nJust don't make sense",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lqdkho/the_old_guard_2_makes_no_sense/"
    },
    {
        "id": "1lqivlh",
        "author": "LeeCheeRodriguez",
        "title": "Why do some movies on Netflix have scenes cut?",
        "content": "US based watcher (LA) Just re-watched Horrible Bosses, the \"Handies for the Three Musketeers\" scene has a few good lines removed.. kind of weird. I assume its not a censorship thing since the rest of the movie doesn't have much more raunchy stuff removed...",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lqivlh/why_do_some_movies_on_netflix_have_scenes_cut/"
    },
    {
        "id": "1lqiu1k",
        "author": "hot_maria_clara",
        "title": "The Society Season 2 WHEN??",
        "content": "I hope they consider to continue and release even just another season. It's been years and I'm still waiting for it. They made this good cliffhanger and ends with. ++ why do Netflix keeps discontinuing good series like wtf?? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lqiu1k/the_society_season_2_when/"
    },
    {
        "id": "1lqexgg",
        "author": "Straight-Amphibian34",
        "title": "Old Guard 2 Loophole",
        "content": "Was eagerly looking forward to the sequel. 50 minutes in, severely underwhelmed.\n\nBut the part which infuriates me the most is the stupid story about immortality transfer, which is ridiculous in itself. How did the immortal die in the first movie, when Nile wasn't around then?\n\nI DNFd after this, because I have been burned by this before, and it can only get worse from here.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lqexgg/old_guard_2_loophole/"
    },
    {
        "id": "1lq398c",
        "author": "Familiar-Mammoth-753",
        "title": "Medical series recommendations?",
        "content": "I’ve noticed that house MD is more focused on actual medicine while on the other hand greys anatomy and Chicago med and more focused on drama rather than actual medicine,any good medical series?\nThanks!",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1lq398c/medical_series_recommendations/"
    },
    {
        "id": "1lqetw4",
        "author": "slumper",
        "title": "Streaming quality",
        "content": "On the highest plan available but ever since Squid Games season came out my streams have been terrible in quality. They even start out perfect but then degrade. Nothing is wrong with my internet speed and other streaming services are fine. My theory is it’s related to a large number of other people using the service. Anyone else run into the issue?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lqetw4/streaming_quality/"
    },
    {
        "id": "1lqemwu",
        "author": "G0Sp0rts",
        "title": "Tour De France: Unchained | Season 3 is out now on Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lqemwu/tour_de_france_unchained_season_3_is_out_now_on/"
    },
    {
        "id": "1lqe2wp",
        "author": "Gitzburgle",
        "title": "Old Guard 2 Filming locations. House at 31:44",
        "content": "I think filming locations are some of the best bits of Old Guard and they seem to keep an eye out for singular locations like Casa Sperimentale. \n\nThere is a house that pops up when the are supposedly in Rimini Italy.  It seems as singular as other locations, abstract design like something out of Dr. Seuss, no straight walls round hobbit doors, but I can't find a name for it.\n\nBe glad to hear if anyone knows anything about it. Ariel shot at 31:44.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lqe2wp/old_guard_2_filming_locations_house_at_3144/"
    },
    {
        "id": "1lqbv9r",
        "author": "Iconclast1",
        "title": "A show i watched on Netflix a couple of years ago:Horror/Strange European/English/Celtic. Pale woman inherits families house (?) Finds recording equipment in basement, strange song keeps playing",
        "content": "Finds recording equipment in basement, strange song keeps playing\n\nThe song was very important to the story, i believe. Recording of ghosts? Fairies? Believe had little childrens voices in the song\n\nVery good cinematography. Very low key and mysterious rather than straight horror, if it you can even describe it as horror. Mystery?\n\nIt was perhaps even closer to a castle that they inherited. Lots of greenery and sunlight. More in line with spirits and the faye rather than monsters, i think",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lqbv9r/a_show_i_watched_on_netflix_a_couple_of_years/"
    },
    {
        "id": "1lqaxt7",
        "author": "GoldDerby",
        "title": "How the new season ‘Squid Game’ will impact its Emmy hopes for previous seasons:",
        "content": "",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lqaxt7/how_the_new_season_squid_game_will_impact_its/"
    },
    {
        "id": "1lp8idy",
        "author": "BeautifulLeather6671",
        "title": "Tires renewed for season 3",
        "content": "",
        "upvotes": 156,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1lp8idy/tires_renewed_for_season_3/"
    },
    {
        "id": "1lqgw09",
        "author": "buildingthebandnews",
        "title": "a girl group with two lead singers??! can it be done? BUILDING THE BAND premieres in 1 week!",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7iswivdhalaf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1lqgw09/a_girl_group_with_two_lead_singers_can_it_be_done/"
    },
    {
        "id": "1lp8qv3",
        "author": "PixlStarX",
        "title": "Need Some Netflix Gold Suggest Your Best Series!",
        "content": "Hey folks!\nI’m on the hunt for a solid Netflix series to dive into something that really pulls you in, episode after episode. \n\nI’m open to anything: thriller, drama, comedy, sci-fi, mystery, foreign language, even documentaries if they’re binge worthy.\n\nJust looking for something with great storytelling, strong characters, or a vibe that sticks. Drop your favorites old gems or recent drops I’ll take all the suggestions I can get!\n\nLet me know what blew your mind 👇🍿",
        "upvotes": 141,
        "comments": 429,
        "media": null,
        "permalink": "/r/netflix/comments/1lp8qv3/need_some_netflix_gold_suggest_your_best_series/"
    },
    {
        "id": "1lq50ei",
        "author": "Blue-Steel1",
        "title": "The Waterfront - Ending",
        "content": "Did the Buckleys all get what they wanted at the end?\n\nHarlan - Grady is no longer a problem\n\nBelle - land deal is not an issue with the bank\n\nCane - is back with Peyton\n\nBree - finally feels accepted with their family.\n\nShane - feels part of the Buckley family. \n\nSeems too good of an ending in the Buckley's favor.   Does anyone else feel this way?  Or am I missing? \n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lq50ei/the_waterfront_ending/"
    },
    {
        "id": "1lpzf4y",
        "author": "Ok_Slice5487",
        "title": "Do I get standard with ads?",
        "content": "I have used standard in the past. I am currently on Hulu and used to ads. But I want to switch to Netflix and wondering how the experience is with ads? Earlier, the ads version of Netflix had lower video quality but now I see that it is 1080p for standard with or without ads.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lpzf4y/do_i_get_standard_with_ads/"
    },
    {
        "id": "1lppzok",
        "author": "laladugu",
        "title": "Any good series recs or movies where romance isn’t a major focus (or forced at all)?",
        "content": "I’m a fan of shows that stay focused on world-building, but sometimes it feels like a bait-and-switch and the first few episodes are just setup before it turns into a lead boy/lead girl dynamic... Would love recs where that doesn’t happen and the plot stands on its own.",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lppzok/any_good_series_recs_or_movies_where_romance_isnt/"
    },
    {
        "id": "1lqajcn",
        "author": "Amethyst-Flare",
        "title": "Kpop Demon Hunters was really good! But also really disappointing...?",
        "content": "Just watched KPop Demon Hunters, and I've got a lot of really positive things to say about it. Fun animation and action, the Huntrix girls are really charming, and the music is a bop. I really liked how Celine wasn't forgiven for her catastrophic errors as an adoptive mother.\n\nYet, at the same time, I'm kind of left cold by other aspects. \n\nFor instance, why doesn't Rumi's father ever get brought up? I feel like understanding what drew her parents together would have been really relevant to this theme of split identity.\n\nSpeaking of, the entire \"demons are enslaved to Grima\" plot point is never explored in any great depth. We don't see demons other than Jinu who struggle with being controlled by him, and there are no free demons at the end of the movie who get to decide what their fates will be. The tiger and bird feel like different classes of being with no ability to speak anyway. They spent centuries/millennia being forced to feed him at no benefit to themselves, and it just doesn't matter. None of the demons other than Jinu get any development. \n\nGrima himself was fun at first, but he's boring in his final appearance.\n\nRumi's coming out and embracing herself moment doesn't actually feel like it matters - they complete the spell and the result is exactly the same as if they had never revealed it. The only difference is that, now, she has cool scars she isn't ashamed of, but she and the world are completely unchanged otherwise.\n\nI dunno how to describe it, like this could have been an 8/10 or 9/10 but it's missing a chunk of movie.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lqajcn/kpop_demon_hunters_was_really_good_but_also/"
    },
    {
        "id": "1lpvh6q",
        "author": "Akumakaji",
        "title": "Why can't I watch downloaded stuff on my device offline?",
        "content": "This is a rant post. On preparation of a 3h flight I downloaded the Netflix app and a couple of episodes. Then during flight (in flight mode of course), the app wouldn't let me watch my downloads and demanded me go log in. \n\nWhile I understand that Netflix would want periodic verifications that I am the viable user, doesn't this defeat the purpose of pre-downloading stuff? I would only download episodes if I expect to move out of WiFi range or even spotty internet. \n\nThen at the destination, two days later I had a 2h bus drive and thought \"well, maybe watch that stuff now?\", but now Netflix gives me an error with my login credentials. I requested a password change and it gave me a \"too many log in -56\" error. \n\nWow, what a terrible user experience. I really just want to watch an hour of my downloads that already exists on my device, now the premier opportunity for the Netflix app to do it's perfect thing will be over just to cool off it's \"too many log in\" shutdown.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lpvh6q/why_cant_i_watch_downloaded_stuff_on_my_device/"
    },
    {
        "id": "1lpbk7z",
        "author": "Top-Three-USA",
        "title": "‘Squid Game’ Season 3 Sets a New Netflix Record With 60.1 Million Views in Three Days, Becoming One of The Platform’s Top Non-English Series Ever",
        "content": "",
        "upvotes": 20,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1lpbk7z/squid_game_season_3_sets_a_new_netflix_record/"
    },
    {
        "id": "1loy3xm",
        "author": "feather-stone2353",
        "title": "Trainwreck: The cult of American Apparel",
        "content": "I am shocked at the level of abuse in this! How people were able to put up with that level of disrespect and emotional abuse is astonishing. This is the blueprint of a toxic work environment. I'm only 30 mins into the documentary and I'm beyond disgusted with Dov Charney...sleazy and shady. Why is it always the same type of men exploiting young people and popular culture.  ",
        "upvotes": 99,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1loy3xm/trainwreck_the_cult_of_american_apparel/"
    },
    {
        "id": "1lq9ccg",
        "author": "Classic-Bathroom-427",
        "title": "My thoughts on Every episode of Squid Game now it's over",
        "content": "Going in a ranking from worst to best\n\n22. Season 3 Episode 5\n\nThe characters in this episode are bafflingly incompetent and it drags on for way too long and they could have easily had this and episode 6 be the same episode and taken out about 20 minutes of it \n\n21. Season 3 Episode 6\n\nDisappointing, player 333 is probably the most miswritten character I've seen in a while and they really didn't take his character in the right direction and it was all around a pretty underwhelming ending\n\n20. Season 2 Episode 7\n\nAgain just a pretty underwhelming episode not necessary even that bad but it just falls flat\n\n19. Season 2 Episode 2\n\nNot bad just not that interesting \n\n18. Season 2 Episode 5\n\nI honestly couldn't even tell you what happened in this episode apart from the beginning \n\n17. Season 3 Episode 4\n\nOff to a decent start but a bit too long\n\n16. Season 1 Episode 2\n\nNot a bad episode at all but objectively I feel like I can't put it higher\n\n15. Season 3 Episode 1\n\nNot a great episode but it gives season 3 a decent start\n\n14. Season 2 Episode 4\n\nGood idea and we'll executed but they're better episodes\n\n13. Season 3 Episode 3\n\nPretty much same as s2 e4\n\n12. Season 1 Episode 9\n\nMostly solid episode and I honestly would've preferred if it had ended here and left in ambiguous\n\n11. Season 2 Episode 3\n\nOpens the new games well but I prefer other episodes way more and I wasn't hugely invested in most of the characters this episode introduced which is strange considering they all had more screentime than the side characters in season 1 (who were wat better)\n\n10. Season 1 Episode 1\n\nJust a solid pilot episode\n\n9. Season 1 Episode 3\n\nIconic episode that expands its side characters well\n\n8. Season 1 Episode 4\n\nMore build up than anything but it's food build up so I don't mind\n\n7. Season 1 Episode 5\n\nJust a good episode\n\n6. Season 2 Episode 1\n\nSuch a good start so it's a shame the season goes mostly downhill after it\n\n5. Season 2 Episods 6\n\nThis is just a really solid idea for a game and it's really good\n\n4. Season 1 Episode 8\n\nSets up the s1 finale perfectly and if you didn't already, will definitely make you care about these characters\n\n3. Season 1 Episode 7\n\nI know the VIPs suck but if you ignore that, this episode is really great\n\n2. Season 3 Episode 2\n\nIt's so frustrating how great this episode is because it proves season 3 overall could've been so much better\n\n1. Season 1 Episode 6\n\nAbsolutely no explanation needed",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lq9ccg/my_thoughts_on_every_episode_of_squid_game_now/"
    },
    {
        "id": "1lpqpog",
        "author": "gsmemo",
        "title": "Poor support",
        "content": "I’ve been a Netflix customer since April 2015. Yesterday, I tried to set up a separate account for a family member using the extra member process. I enabled profile transfer and followed all the steps. It felt off when the system asked for a payment method, and even worse when it actually charged me for the account.\n\nLater, I received an email saying, “Your invitation was declined,” which wasn’t true. We carefully followed every step in the screen, including the unexpected ones like entering payment details. When I contacted support, the only solution offered was to start the entire process over again. No explanation, no mention of a refund, just that they can’t add the account for “security reasons.” Yet somehow, there was no issue letting someone accidentally complete steps they weren’t supposed to.\n\nAfter 10 years as a customer, this was too much. Poor support like this is exactly what drives people away. So I’m done. Netflix got an extra €9.49 from me but not a € more.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lpqpog/poor_support/"
    }
]