[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1o8wc2o",
        "author": "BradyPhoenix",
        "title": "The Perfect Neighbour",
        "content": "Just finished watching this and more than anything it was just so sad. Those poor babies.\n\nIt did warm my heart a bit to see how much the community cared for one another’s children though. I hope they’re all doing alright.",
        "upvotes": 243,
        "comments": 376,
        "media": null,
        "permalink": "/r/netflix/comments/1o8wc2o/the_perfect_neighbour/"
    },
    {
        "id": "1o9fgki",
        "author": "Previous-Boss-1480",
        "title": "boots 🥾",
        "content": "is anyone else obsessed with boots!? I absolutely love the show finally finished last night and I wish it had more already lol! I’m so curious where did Sargent Sullivan go? I wonder if next season it’ll actually show them in “war” I have sooo many unanswered questions 😅 did anyone else love the show?? also like why did James kinda lead cam on that irritates me so bad I truly thought they would do good together .. also love cams progress I feel like he needed that camp more than the others \nsorry for the spiraling just need someone to talk to about it 🤣",
        "upvotes": 17,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1o9fgki/boots/"
    },
    {
        "id": "1o9dkr8",
        "author": "PlantNerdxo",
        "title": "‘You purchased an extra member slot’ - wait what?",
        "content": "I just got this email from Netflix. I absolutely did not purchase an ‘extra member slot’. I immediately logged on to cancel this.\n\n\nHas this happened to anyone else?",
        "upvotes": 10,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1o9dkr8/you_purchased_an_extra_member_slot_wait_what/"
    },
    {
        "id": "1o9439z",
        "author": "throughthequad",
        "title": "The next Monster Series",
        "content": "I would love to see Netflix go for an Ed Kemper story and resurrect Cameron Britton as Kemper. He was so good in MindHunter, I would love an entire miniseries seeing him portray Kemper. ",
        "upvotes": 29,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1o9439z/the_next_monster_series/"
    },
    {
        "id": "1o9cru3",
        "author": "njdotcom",
        "title": "See all the Netflix Christmas movies premiering in 2025",
        "content": "",
        "upvotes": 11,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o9cru3/see_all_the_netflix_christmas_movies_premiering/"
    },
    {
        "id": "1o9fryn",
        "author": "Alexfd1971",
        "title": "Maze Runner: The Scorch Trials could have easily have been the end of that (ps: haven't seen the 3rd one)",
        "content": "The first Maze Runner was perfect and could have been left at that, but it was great that they made Scorch Trials to give fans more and maybe add a bit because of how cliff hang the end felt, and it was good up until TERRASSA RATTED OUT THE RIGHT ARM!!\nIt was a dumb decision and the way they paced it towards the whole crew getting jumped was faster than Wally West, I'm just saying from what I currently see that the 3rd one was just a cash grab (about to watch 3rd one anyway to see if it's worth it)",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1o9fryn/maze_runner_the_scorch_trials_could_have_easily/"
    },
    {
        "id": "1o8jkte",
        "author": "Routine-Asparagus-16",
        "title": "The Diplomat Is Back.",
        "content": "I've been  waiting for season 3 of the Diplomat.... It wasn't a long wait and at least there's 8 episodes. Season 2 was a longer wait with 6 episodes... I dnt think 10 episodes is a thing anymore.",
        "upvotes": 130,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1o8jkte/the_diplomat_is_back/"
    },
    {
        "id": "1o9h83z",
        "author": "VelvetOrbitXO",
        "title": "Suggest netflix series",
        "content": "HI, anyone to suggest good Netflix series that will be worth my time watching 😉 any genre that will be worth it to watch, kind of get bored when I am doing nothing during my free time 😁 ",
        "upvotes": 1,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1o9h83z/suggest_netflix_series/"
    },
    {
        "id": "1o91djd",
        "author": "SufficientPrice7633",
        "title": "3 years ago, Extraordinary Attorney Woo was released",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o91djd/3_years_ago_extraordinary_attorney_woo_was/"
    },
    {
        "id": "1o9fbx0",
        "author": "Dunder6002",
        "title": "In Creeped Out, episode \"A Boy Called Red\" did the aunt know Vincent travelled back in time?",
        "content": "**ENDING SPOILERS D:** plz watch it before continuing!!!\n\nI rewatched Creeped Out after a few years, and now just finished watching s1 ep9 \"A Boy called Red\" and in the end, Vincent's aunt gives him a wink and it got me thinking; Did she know Vincent was Red the entire time and that he changed the past? Instead of falling into the well where the ball of light (the portal) was, he teleported back to the future (his timeline) by touching the portal while it was in the garden?\n\n(She told Vincent his dad changed after he saw his childhood friend called Red fall into the well and disappeared forever. She also witnessed it too.)\n\nLike, did she know? Did she know that originally, Red fell into the well, but then decided to change the future by not doing it? Hinting the wink in the ending scene? Or at least she was somehow aware Vincent (Red) changed the future? And also, how did they not notice that Vincent looked exactly like his dads childhood friend? (...they don't know he time travelled and was the same person.) Cuz there's gotta be more than just her believing there was something weird with the house, right?\n\nOr am I just overthinking it over a PG-rated series?\n\nTL;DR I'm wondering if Vincent’s aunt knew he was actually Red and that he changed the past. The wink at the end got me thinking that if she aware of the altered timeline and that Vincent was Red?\n\nIt's all speculations and theories, I wanna hear what you guys think! Gimme your opinions :P",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o9fbx0/in_creeped_out_episode_a_boy_called_red_did_the/"
    },
    {
        "id": "1o9ed5i",
        "author": "graemeisverytired",
        "title": "Ross Duffer doubts that streaming will ever see another story like Netflix's Stranger Things",
        "content": "\"When we started,\" Duffer said, \"It was very early Netflix, \\[...\\] And I don’t know how many more opportunities there are going to be to tell stories of this length on that size canvas. So whenever I have the regrets that Matt was saying, I’m excited that we were able to take advantage of this very specific period of time in the industry.\"\n\nMore: [https://www.thepopverse.com/tv-stranger-things-season-5-ross-duffer-netflix-streaming-spin-off/](https://www.thepopverse.com/tv-stranger-things-season-5-ross-duffer-netflix-streaming-spin-off/)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o9ed5i/ross_duffer_doubts_that_streaming_will_ever_see/"
    },
    {
        "id": "1o8aq54",
        "author": "Dariusgamer2007",
        "title": "Anyone else just can’t seem to watch Netflix anymore?",
        "content": "I don’t know if I’m going through a ‘burnt out’ phase with Netflix but I just can’t bring myself to watch new things anymore. Plenty of movies and series but when I try to watch one I just exit Netflix. Is it possible to be burnt out from watching movies &amp; series? ",
        "upvotes": 210,
        "comments": 113,
        "media": null,
        "permalink": "/r/netflix/comments/1o8aq54/anyone_else_just_cant_seem_to_watch_netflix/"
    },
    {
        "id": "1o9bcry",
        "author": "bloomdaleaddict",
        "title": "Travelling and can’t watch netflix on TV",
        "content": "I travel a lot and sometimes a few weeks at a time. All these times, I can always access netflix on my hotels or apartment TV. But last night, it says that it wasn’t part of my household network (yea, cuz I am out of town). \n\nI reached out to the customer service and they said I can just update my household and it will give me 2 weeks while my family at home won’t be affected. I did what he instructed and my partner just called me saying that our netflix is not working at home.\n\nI reached out again and the agent said that I can only log in to tvs on the same network at a time and I should only watch through other media like phone or tablets while I am traveling. Then what’s the point of paying for multiple devices when I can’t even watch comfortably when I am traveling?? Aren’t their slogan watch anything from anywhere?\n\nDoes anyone know if there is a way to bypass it?\n\nThank you!",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1o9bcry/travelling_and_cant_watch_netflix_on_tv/"
    },
    {
        "id": "1o9b8cz",
        "author": "purplerain0411",
        "title": "I just finished Olympos and… I HATE Amaia. Here’s why.",
        "content": "First off — yes, her mom is horrible. Nobody deserves that.\n\nBut can we stop excusing everything Amaia does just because her mother pressures her? She’s not the only one under pressure.\n- Zoe gets it from her parents.\n- Christian lives in his brother’s shadow.\n- Renata’s fighting her own battles.\n- The coaches never stop pushing everyone.\n\nThey all deal with it differently. Some even dope (which is bad, obviously).\nBut Amaia? She goes beyond cheating — she sabotages people.\n\nIt’s one thing to dope to be better.\nIt’s another to literally endanger your teammates just to feel superior.\n\nHer ego is insane:\n- Always needs to be the center of attention.\n- Gave Zoe a hard time for no reason.\n- Treats her “best friend” Roque like trash.\n- Constantly yells and criticizes instead of motivating her team.\n\nWhen Nuria broke her record, the first thing Amaia thought was “she must be doping.” Her ego just couldn’t handle being outperformed.\n\nAnd then? She almost drowned a teammate because she didn’t get the info she wanted. Fatima literally had to stop her. Like… WHAT.\n\nShe’s also a total hypocrite.\n- Preaches anti-doping but spikes Fatima’s drink and even pushes her down the stairs?!\n- Visits Fatima in the “hospital” and doesn’t even care about her — only about the duet and her own image.\n\nHonestly, sabotaging others is way worse than doping.\n\nI’ll give her credit: calling NADA was the right thing to do. Fair play matters.\nBut let’s be real — with all the awful stuff she’s done, Amaia’s no better than the rest of the cheaters.\n\nShe’s selfish, reckless, and completely lost in her own ego.\n\nSorry not sorry, but Amaia is the villain of the show. 😤",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o9b8cz/i_just_finished_olympos_and_i_hate_amaia_heres_why/"
    },
    {
        "id": "1o9b1dn",
        "author": "ilovemeloball",
        "title": "Cassandra vs Cobweb",
        "content": "I watched the show Cassandra a few months ago and I really enjoyed it, and last night I watched the new movie Cobweb. However, I noticed the ending with the sister being hid in the walls by her parents for being deformed was literally the same as Cassandra’s daughter in that show. Just found it interesting and I think it lowkey ruined the ending of Cobweb. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o9b1dn/cassandra_vs_cobweb/"
    },
    {
        "id": "1o8rk3m",
        "author": "Adolfo1980",
        "title": "Favorite series with episodes 40 min or less",
        "content": "Work nights have been getting longer and some days the wife and I don't have time for a 60 min episode before we have to get to bed.\n\nWhat are some good recommendations for series with episodes 30-40 minutes in length?",
        "upvotes": 19,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1o8rk3m/favorite_series_with_episodes_40_min_or_less/"
    },
    {
        "id": "1o9atte",
        "author": "Scared_Report3009",
        "title": "Dystopian rec",
        "content": "I need some good dystopian movies or shows I’m currently watching the 100 and just finished the divergent series. I loved the hunger games. So anything that is similar to those I think I’d enjoy? ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1o9atte/dystopian_rec/"
    },
    {
        "id": "1o9arlz",
        "author": "Sad_Engineering_802",
        "title": "In search of a removed movie",
        "content": "Hey guys, I vaguely remember this movie from long ago in Netflix when I got really into animation as a child (The Secret of Kells was my go to when I was little!). I was wondering if I could describe this film and see if anyone could identify the movie:\n\nI don’t remember very much about the plot of the movie, but I do remember that it was hand drawn possibly before 2009 and it was one of the suggestions on Netflix right after you finished the secret of Kells. It recommended this movie it was a full length feature and extremely colorful, and for some reason in my mind, it was kind of surrealist/ multi genre. I know that it was taken off Netflix ~10 years ago so this may be a long stretch.\n\nDoes this ring a bell with anybody? It could’ve been a foreign language film, but I’m pretty sure that it was dubbed in English.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o9arlz/in_search_of_a_removed_movie/"
    },
    {
        "id": "1o9aqs3",
        "author": "littleL37",
        "title": "Aileen Queen of Serial Killers",
        "content": "Having seen the trailer, I'm a tad conflicted with with it's portrayal of Wuronos. It feels very lich like they are portraying her as a victim (in which she was in many ways) however, from previous documentaries and my knowledge of the case (which could be incorrect) she didn't just kill rapists and John's, she also killed innocents. I'll be interested to see if the full series gives a balanced view but with the trailer (and the comments I saw) it seems like people really believe her to be solely a victim. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o9aqs3/aileen_queen_of_serial_killers/"
    },
    {
        "id": "1o8rj29",
        "author": "tyblake02",
        "title": "The Residence needs a season 2",
        "content": "I'm not done with the show yet so please no spoilers but I hate that Netflix canceled this show! How do you cancel a Emmy nomination show after only one season? ",
        "upvotes": 18,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1o8rj29/the_residence_needs_a_season_2/"
    },
    {
        "id": "1o8iyhk",
        "author": "CaptPeterlolol",
        "title": "The Haunting Of...",
        "content": "Was curious if the Haunting Of Hill House &amp; Bly Manor was worth a watch? Or if one is better than the other? It's hard to make out what kind of horror it is from the trailer. For example I really enjoyed the Conjuring films by James Wan and don't mind Supernatural elements as long as it doesn't take a front seat ahead of everything else too much.",
        "upvotes": 42,
        "comments": 187,
        "media": null,
        "permalink": "/r/netflix/comments/1o8iyhk/the_haunting_of/"
    },
    {
        "id": "1o95t68",
        "author": "alwayzhope",
        "title": "\"continue watching\" constantly having a non human watching show reflected",
        "content": "another show is constantly \"playing\" while i am playing a show. viewing activity shows continuously my currently played series and something else mixed in. that series is usually played from ep 1 and \"ghost playing\" till last ep until it moves on to another series. other times, it's random few eps here and few eps there. perhaps when i clicked \"next episode\" i was actually clicking another series underneath the (quote steam related) \"outlay\". \n\nthere are no other active/recent devices. it's like there's a ghost watching a show at the same time with me on the same computer (one window, one netflix tab, zero chances). however, one time, the same thing happened while my pc was not even switched on. WOW!  \n  \nhad already reported so many times under viewing history. do netflix IT or whichever dept staff actually read and reflect issues reported?\n\n\n\nTLDR: seems like no one else is reporting this similar issue (seems like an outlay, constantly playing 2 shows at any point on PC chrome) on reddit. possible plugins, other software/chrome addons interference? can anyone suggest a solution then since it looks like i will never get any support from netflix directly? TIA.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o95t68/continue_watching_constantly_having_a_non_human/"
    },
    {
        "id": "1o8itsw",
        "author": "Ember_Grove20",
        "title": "Any Netflix show or movie where you really loved the soundtrack?",
        "content": "I was rewatching Bridgerton, and I just love the music in it. It made me wonder what other Netflix shows or movies have soundtracks you really enjoyed.",
        "upvotes": 31,
        "comments": 76,
        "media": null,
        "permalink": "/r/netflix/comments/1o8itsw/any_netflix_show_or_movie_where_you_really_loved/"
    },
    {
        "id": "1o8v82i",
        "author": "moonstruck_x",
        "title": "True Haunting - This house Murdered Me",
        "content": " I just finished watching True Haunting - This House Murdered Me. I would say that the series is good, it was a slow burn but I cant help to notice its similarity to Insidious, Not the story but the people that helped them, 2 guys that are using technologies, Jeremy and Bill Spencer (Specs and Tucker from Insidious) and an old powerful clairvoyant lady, Debbie (Elise from Insidious).\n\nI laughed so hard after realizing this lol",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1o8v82i/true_haunting_this_house_murdered_me/"
    },
    {
        "id": "1o927bp",
        "author": "No-Stage5463",
        "title": "💔 Help me find this Netflix mug",
        "content": "Hey everyone,\n\nI could really use some help finding this mug. It was gifted to me when I worked for Netflix, but unfortunately it broke.\n\nhttps://imgur.com/a/PURyuIf\n\nI know this might sound like a strange request, but it has sentimental value and I’d love to replace it. I’ve searched online everywhere, but I couldn’t find anyone selling the same one.\n\nIs there anyone who currently works at Netflix who could possibly help me get another one?\n\nReally appreciate any help! ❤️",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o927bp/help_me_find_this_netflix_mug/"
    },
    {
        "id": "1o9hjbn",
        "author": "throwcvf",
        "title": "The Perfect Neighbor: Unpopular Opinion",
        "content": "What happened to that mom, her kids, and the whole family is absolutely awful. It’s just heartbreaking on every level.\n\nThe neighbor using racial slurs toward the kids is beyond disgusting. There’s no excuse for that — period.\n\nBut watching the documentary, I couldn’t shake the feeling that it was super one-sided. It really pushed a specific story and didn’t even try to explore other angles. For something that’s supposed to be journalism, that’s not great.\n\nHere’s what I kept thinking: what if the neighbor was autistic or had health issues that made her super sensitive to noise and screaming? That’s not something you can control. Ask me how I know. Now imagine kids constantly running around your yard, yelling, leaving trash, and ignoring when you ask them to stop. In pretty much any neighborhood — even diverse ones — that would be considered disrespectful. Would you be okay with that? Be honest.\n\nIf you’re repeatedly asking for boundaries and people keep ignoring you, that’s incredibly frustrating. The doc didn’t show what happened before things blew up either — for all we know, she could’ve tried to be friendly at first.\n\nAs someone who’s been through a sexual assault, I also get how unsafe it can feel when someone’s pounding on your door at any time of day, let alone at night. If she had trauma, that could’ve easily triggered panic. The cop’s “jeez” reaction just made her out to be unstable right away. Like dude, you showed up at night — what reaction were you expecting?\n\nCould she have moved? Maybe, but maybe she couldn’t afford to. And let’s be real — older, childless women living alone often get painted as “crazy.” That stereotype is so misogynistic and lazy.\n\nI guess my main issue is how the documentary completely flattens the story. It makes it look black and white when real life is almost never that simple.\n\nLet me be clear: it’s not okay to throw stuff at kids or to use racist language against anyone, and especially children. But it’s also not okay to ignore someone’s personal space or call them crazy for wanting peace and quiet. And “they’re just kids” doesn’t make it fine.\n\nIf you step back and take race out of it for a second, the whole situation feels a lot more complex. Netflix really leaned into the race angle when in reality, this could happen in any kind of neighborhood.",
        "upvotes": 0,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1o9hjbn/the_perfect_neighbor_unpopular_opinion/"
    },
    {
        "id": "1o8mdzc",
        "author": "Fragrant-Job-1889",
        "title": "Good scary movies ?",
        "content": "Has anyone seen any Good scary movies on Netflix? Any recent ? Wondering if there is anything good I haven’t seen. I also like suspenseful movies of anyone has any good suggestions on those. \n",
        "upvotes": 4,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1o8mdzc/good_scary_movies/"
    },
    {
        "id": "1o7qh13",
        "author": "lithdemi",
        "title": "So many Netflix shows get cancelled before their story is done — which one still haunts you?",
        "content": "I was talking with some friends about how shows like Warrior Nun and The OA got pulled even with solid fanbases.\n\nCurious what everyone here thinks:\n\n– Which cancellations hurt the most?\n– Which one could actually come back if fans organized?\n\n(I’m helping run a community that’s discussing this across fandoms, so I’m collecting opinions.)",
        "upvotes": 522,
        "comments": 1178,
        "media": null,
        "permalink": "/r/netflix/comments/1o7qh13/so_many_netflix_shows_get_cancelled_before_their/"
    }
]