[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 8,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 54,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1l9wag6",
        "author": "ggroover97",
        "title": "Netflix Users Say They Dislike New Layout; Research Says Otherwise",
        "content": "",
        "upvotes": 209,
        "comments": 79,
        "media": null,
        "permalink": "/r/netflix/comments/1l9wag6/netflix_users_say_they_dislike_new_layout/"
    },
    {
        "id": "1l9hv75",
        "author": "turnipsnbeets",
        "title": "Just got the new layout. It’s unusable. Thinking of switching services.",
        "content": "I just tried to browse for a movie to watch and turned off my tv after about 45 seconds. Had to look up what this layout shift was all about. What makes finding a title easy is to categorize and condense the list so you can see a lot of things at once; that's what makes for a good experience. I'm now literally browsing to find something 3 titles at a time I have no comprehension of what I looked at a few clicks back.. no ability to see a group of titles at once and make that nerve wracking decision of should I watch John Wick again or Interstellar? I fucking hate having to decide on a movie sometimes and always love when I find just what I'm looking for, and right now I'm not even going to attempt to find anything on this constricting layout that's just going to frustrate me and not provide literally the experience I'm paying for which is to REALX. Whoever thought this was a good idea..I hope you're reading the feedback. At least give me an option to switch back to the old layout. Shopping other streaming services immediately after I post this.",
        "upvotes": 71,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1l9hv75/just_got_the_new_layout_its_unusable_thinking_of/"
    },
    {
        "id": "1la3dig",
        "author": "airbear13",
        "title": "New layout",
        "content": "Hi Netflix if you are reading this, I just wanted to let you know that the new layout is genuinely ass and I hate it. It’s too zoomed in to see stuff I want, and browsing shows is a pain now. Old layout was perfect, why change it? Just go back to that or at least give the option to.\n\nAlso, before you guys smarmily say “oh you foolish consumer, you will like it in a few months quee quee quee” you should know that I still think Hulu is fucking stupid for the change it made years ago, it just didn’t make anything better and it actively made me use the app less.\n\nOk that’s all in closing please revert back or give users an option to change their view 🥰",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1la3dig/new_layout/"
    },
    {
        "id": "1l9x7e2",
        "author": "Kindly_Dot_7006",
        "title": "Trainwreck Astroworld",
        "content": "I thought the doc was really well done. It’s crazy how much cell phone footage they have of how crazy the crowd became. It really is crazy that just a few years later it seems all is forgiven for Travis Scott and Live Nation just for settling law suits with the families of the deceased outside of court. Do you think this documentary will stir this up again especially for Travis?",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l9x7e2/trainwreck_astroworld/"
    },
    {
        "id": "1la34nu",
        "author": "WuzzWuzz",
        "title": "Arnold Schwarzenegger talks Season 2 of 'FUBAR', 'Twins' and his iconic catchphrases",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1la34nu/arnold_schwarzenegger_talks_season_2_of_fubar/"
    },
    {
        "id": "1la44gx",
        "author": "mjmilian",
        "title": "This journalist gets it",
        "content": "Rather than an article just quoting from reddit and twitter, she goes into details why this is causing such complains and the mistake Netflix may have made to approaching the redesign like they have\n\n\n\n[https://rollingout.com/2025/06/12/netflix-update-gets-backlash-from-users/](https://rollingout.com/2025/06/12/netflix-update-gets-backlash-from-users/)  \n\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1la44gx/this_journalist_gets_it/"
    },
    {
        "id": "1l8pzf4",
        "author": "S4v1r1enCh0r4k",
        "title": "David Harbour Says Goodbye to Stranger Things: \"After 10 Years, It’s Time to Move On\"",
        "content": "",
        "upvotes": 1125,
        "comments": 153,
        "media": null,
        "permalink": "/r/netflix/comments/1l8pzf4/david_harbour_says_goodbye_to_stranger_things/"
    },
    {
        "id": "1l9y4nl",
        "author": "elldivino69",
        "title": "Netflix Billing Issue - how do you get to talk to anyone? UK here",
        "content": "Hi all. \n\nI have a billing issue and on the Netflix contact us page is just sending me round in circles. Web chat never seems to be available…how can you contact anyone from there!?\n\nAny help would be awesome! \n\nThanks. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l9y4nl/netflix_billing_issue_how_do_you_get_to_talk_to/"
    },
    {
        "id": "1l9xmsd",
        "author": "NotNowCrazyBob",
        "title": "Mecha and card type anime I can’t find",
        "content": "I remember seeing these two anime on Netflix, one was this mecha anime were the main characters use these small robots that has like sentience and they use disk that insert into the robots to use like a power up or projectiles, there were toys for the anime as well; \n\nand there was a anime that I would best describe it like a mix between yugioh and pixelmon, we’re in the world they play a card game like yugioh and the MC had a this cat thing that’s also a card that can turn into this giant lion at the end of the series, and I really liked both of the shows when I was younger and I can’t find them ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l9xmsd/mecha_and_card_type_anime_i_cant_find/"
    },
    {
        "id": "1l9pxut",
        "author": "oceanicitl",
        "title": "Dept. Q is based on Jussi Adler-Olsen's books",
        "content": "He's written a series of 10 Department Q books based in Copenhagen. I highly recommend them. No the series isn't exactly like the book but it was a very good adaption. Edinburgh had a similar vibe to the Nordic city and the casting was excellent.\n\nIf you enjoyed the show please check out the books and read them in order. ",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1l9pxut/dept_q_is_based_on_jussi_adlerolsens_books/"
    },
    {
        "id": "1la2ccr",
        "author": "hulkbuster2511",
        "title": "Why is everyone depressed on Ginny&amp;Georgia season3?",
        "content": "I know the show is mainly about awareness and trauma but s3 is too much. They managed to decently balance the storyline in s1&amp;2 but feels like literally every single character is in depression in s3 and they made the entire season about a friggin lawsuit which also ended in a very anti-climactic way! What a bummer.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1la2ccr/why_is_everyone_depressed_on_ginnygeorgia_season3/"
    },
    {
        "id": "1l9m60o",
        "author": "Remarkable-Toe-4413",
        "title": "Ginny and Georgia",
        "content": "Season 3 really left me dissatisfied and disappointed. The same drama was dragged out for over 7 hours with only a few twists to keep it going. Georgia, as usual, was busy with her endless rants and chaotic sex life—constantly yapping without much depth.\n\nGinny looked sexy but stayed low-key throughout the season, which felt like a missed opportunity to develop her character. As for Paul, I couldn’t tolerate his forced masculinity and lack of real emotions. He seemed to be living in a bubble of idealism—felt bad for him at times, but not enough to care deeply.\n\nOn the brighter side, I loved Lynette’s character. She was a truly supportive mother and mother-in-law, probably one of the few genuine personalities this season. Meanwhile, Georgia’s so-called friends proved they’re not even loyal to each other, let alone to her. That dynamic felt hollow.\n\nOverall, compared to the previous seasons, this one gets a 6/10 from me. Wouldn’t recommend wasting time on it.\n",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l9m60o/ginny_and_georgia/"
    },
    {
        "id": "1l9q2je",
        "author": "indiewire",
        "title": "The Best Indie Movies on Netflix: 36 Films Streaming",
        "content": "",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l9q2je/the_best_indie_movies_on_netflix_36_films/"
    },
    {
        "id": "1l9w9vb",
        "author": "Junior_Apartment6388",
        "title": "Ginny and Georgia creator reveals Austin won’t be recast even though he’s too old",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l9w9vb/ginny_and_georgia_creator_reveals_austin_wont_be/"
    },
    {
        "id": "1la1x7w",
        "author": "Brief-Buy9191",
        "title": "American Primeval",
        "content": " I just finished American Primeval.   The portrayal of Brigham Young and the early Mormons in American Primeval is more gothic fiction than historical fact. While the show touches on real elements like the persecution the Mormons faced and Brigham Young’s powerful leadership, it leans heavily into a dark, cult-like depiction that distorts the truth for dramatic effect. The show’s intensity is magnetic, but its loose attachment to actual history feels irresponsible. Folks who may not be aware of the real story could easily walk away with a completely inaccurate and unfair depiction of Mormons. \n\nOn the other hand, the depiction of how Indigenous people were treated through violence, displacement, and dehumanization is likely much closer to historical reality. If you’re watching American Primeval, enjoy the gripping drama, but remember, it’s not a history lesson.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1la1x7w/american_primeval/"
    },
    {
        "id": "1l9slw4",
        "author": "visionofscarlet",
        "title": "The House",
        "content": "I've just finished watching this stop motion adult animated TV special/movie. It's rather strange but rather interesting. I'm actually a little creeped out by it but I definitely recommend it to you. It also gives me a horror vibe, so if you're into that sort of thing you will definitely love it. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l9slw4/the_house/"
    },
    {
        "id": "1l9rumu",
        "author": "Painfully-Stupid",
        "title": "Suddenly can't watch Netflix on PC?",
        "content": "My Roku on my TV works just fine, both on the same network and both are hard lined. Now it's telling me my Netflix isn't a part of the household. I've tried incognito and a different browser with no luck. Anyone else have this issue?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l9rumu/suddenly_cant_watch_netflix_on_pc/"
    },
    {
        "id": "1l9q6ed",
        "author": "Full-Metal-Jake-it",
        "title": "Missing program",
        "content": "Last night, I noticed the addition of the docuseries “turning point: the Vietnam war” and I really wanted to watch it but I was laying down to go to sleep. I just tried to find it again about five minutes ago and it won’t pull up anywhere. It was added April 30  2025 so I wouldn’t think it was already taken off. Any ideas?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l9q6ed/missing_program/"
    },
    {
        "id": "1l9o3vs",
        "author": "Thin_Environment_244",
        "title": "In Your Dreams | Official Teaser | Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l9o3vs/in_your_dreams_official_teaser_netflix/"
    },
    {
        "id": "1l9o3pi",
        "author": "Pogrebnik",
        "title": "Netflix Reveals Trailer for 'The Diplomat' Season 3, Confirms Fall Release",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l9o3pi/netflix_reveals_trailer_for_the_diplomat_season_3/"
    },
    {
        "id": "1l9fr38",
        "author": "Illustrious-Royal162",
        "title": "Shows like Mercy For None",
        "content": "I recently watched Mercy For None and loved how action-packed and fast-paced it was. Do you have any recommendations with a similar vibe?\nI enjoy crime, thriller and revenge action. Movies or series will do. Thank you.",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l9fr38/shows_like_mercy_for_none/"
    },
    {
        "id": "1l9bvmx",
        "author": "Single_Pressure9715",
        "title": "Behind Her Eyes",
        "content": "I finally gave in last Friday, after it kept popping up in my “Top Picks for You.”\n\nThrew on while I was on the stairmaster, just to pass time. But what the hell?! Talk about mind bending\n\nDid anyone else feel really bad for Adam?\nLosing his mom— not physically, of course. But the person she became? He clearly knew she wasn’t the same anymore.\n\nRob is crazy and the whole time I’m thinking Adele was the problem! I can’t imagine wanting someone that badly.\n\nDefinitely a great binge.\n",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l9bvmx/behind_her_eyes/"
    },
    {
        "id": "1l95sum",
        "author": "Steerpike58",
        "title": "Department Q - question about Lyle - SPOILERS",
        "content": "I just finished Dept. Q and loved it!  I loved the writing/dialog, the characters, and the acting.   At first I thought Matthew Goode (Mr nice guy in Downton Abbey) was too 'soft' for this role as Carl, but he turned out great.  And of course, Rose and Ackram nailed it.   I do have a question, which came up already in a response to another thread, but I want to post it here as a new question so it gets more eyeballs.\n\nThe question relates to Lyle (Harry's brother, Ailsa's son), and Sam Haig. I THINK I've got it mostly figured out now, so most of this is how I think it happened, but there are still some questions.\n\nMerritt as a teenager was 'dating' Harry.  She didn't see much of Lyle (Harry's brother) - he just came over occasionally and 'interrupted' them. So I guess there's no reason to think she was that familiar with Lyle.  Meritt, Willliam, Lyle and Harry all live on the remote island of \"Mohr\" - an island that is now in decline due to the demise of the oil industry.\n\nHarry robbed Merritt's household, and during that event, Harry first struck William, but then we later discover that it was Lyle who severely beat William.   The local policeman pursued the event, but mistakenly thought Harry was the culprit and chased him to his death on the ferry.   Merritt came back to Mohr to attend Harry's funeral (and presumably met Lyle again there).\n\nMany years later (10, 15 years?) ('current time'), Lyle is obsessed with Merritt (as a romantic target? Sexual? - not clear).\n\nLyle has spent a lot of time in an institution, and while there, encountered 'Sam Haig', another inmate.  Sam was smart, and taught Lyle the art of deception / investigation / etc.  Now, Sam and Lyle are both out of captivity and working.  Sam was now an investigative journalist, doing well, driving a Porsche.  Lyle was struggling, working as a grunt on the local ferry.\n\nLyle decides he wants to get closer to Merritt. He knows she is a prosecutor (she's been on TV a few times so 'well known') and decides to impersonate Sam Haig, claiming to want to share information about corruption, etc with Merritt. Merritt finally meets him in a cafe, and 'warms' to him. She has no idea that it is Lyle and she's never met Sam Haig before so has no reason to doubt who he is.  So this is 'issue/question 1' - is it feasible that Merritt would not recognize Lyle 15 years later?  Lyle (as Sam) sleeps with Merritt.  'question 2' - is the real Sam Haig still alive at this point?\n\nIn addition to meeting with Merritt at the hotel on a regular basis for sex, Lyle is spying on her at her home - he's seen by William through the window one night.  So that explains how Lyle knows Merritt's movements.\n\nMerritt loses the case she's working on, and on the spur of the moment, decides to leave, with William, for Mohr on the ferry.\n\nLyle has followed Merritt onto the ferry (since he's been following her in general, this makes sense) and kidnaps her.  But - also on the ferry is Ailsa - Lyle's mum - who assists with the kidnapping.  How could Ailsa be on the ferry that day, given that it was a spur of the moment decision by Merritt to go that day?  Plot Hole?\n\nHaving kidnapped Merritt, Lyle then goes to kill the real Sam Haig at the 'cliff face' to tie up any loose ends, since he's been impersonating him.  Is this the correct timeline for Sam's death - AFTER the kidnap of Merritt?\n\nI don't normally pay this much attention to a show but there was something about the 'style' of this show that really connected with me, so I got really invested.  Now we have to wait to see if there's a second season!\n\nI thought the first 8 episodes were fantastic; I though E9 was a bit 'happy ever after', with the therapist showing up at Carl's house, soft music, etc but it was still great, and did set up for a second season - with the team well-funded and now respected.\n\nEdit reason - corrected 'spare' to 'spur' thanks to a poster for pointing it out! ",
        "upvotes": 16,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1l95sum/department_q_question_about_lyle_spoilers/"
    },
    {
        "id": "1l9l4ff",
        "author": "muchtoomuch123",
        "title": "us and them chinese movies",
        "content": "i have read a lot of good reviews about this or chinese movie US AN THEM. Can anybody tell if i should really give my 2 hrs to this movie ? is it worth watching or should i skip it ? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l9l4ff/us_and_them_chinese_movies/"
    },
    {
        "id": "1l8uxy5",
        "author": "CuntHuntingBull",
        "title": "How famous Mindhunter among this group?",
        "content": "I have been watching Mindhunter again like 7th time now. I just wonder how famous this  really since I heard it didn't get attention as it needed to be. Also it is costly interms of production.  \n\nI would say it is one of the gold in Netflix and definitely the following seasons would be more catchy. Anyone else thinks the same?",
        "upvotes": 37,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1l8uxy5/how_famous_mindhunter_among_this_group/"
    },
    {
        "id": "1l8nuv1",
        "author": "ApolloApex",
        "title": "“Why ‘OceanGate: The Avoidable Disaster’ would be a more accurate title than ‘tragedy’”",
        "content": "The Netflix documentary frames this as a tragedy, but the reality is that many safety concerns were ignored, and it was a high-risk luxury expedition. The story highlights how ego and money can cloud judgment, leading to preventable disasters. I’m annoyed that they advertise it as a tragedy.",
        "upvotes": 100,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1l8nuv1/why_oceangate_the_avoidable_disaster_would_be_a/"
    },
    {
        "id": "1l9rjkc",
        "author": "animalloverforlife22",
        "title": "Netflix do better",
        "content": "I understand the whole Netflix household thing is so that Netflix can make more money so that people who used to share passwords now have to pay for their own account or pay more for an account they already have to add more members but a lot of people are getting kicked off of the Netflix household who are part of the Netflix household. My mom pays extra so that people who aren't in the house like me can use Netflix when we are not in the house I feel like instead of this whole IP nonsense a you know multi-million dollar company that has multiple people with you know function in brain cells can just give everyone who's a part of the household a code and so anytime they accidentally get kicked off they can just use that code because it really doesn't make sense why people who pay for the streaming service are always struggling with the service they pay for it just doesn't make any sense to me why a company would want their own customers to struggle as much as they do it just generally doesn't make sense. Why make people's life harder especially in the times that we are in now.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l9rjkc/netflix_do_better/"
    },
    {
        "id": "1l9gc96",
        "author": "S4v1r1enCh0r4k",
        "title": "Here’s What’s Coming to Netflix in July 2025",
        "content": "",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1l9gc96/heres_whats_coming_to_netflix_in_july_2025/"
    },
    {
        "id": "1l9mfit",
        "author": "InvestigatorOk9521",
        "title": "How to lock profile settings",
        "content": "Recently, my brother keeps changing my profile settings like my profile picture and my profile language to one that I do not understand on the TV. I have a profile lock set but it seems like the profile settings can be changed without the pin. Is there a way to stop him from changing my profile settings? Thanks in advance.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l9mfit/how_to_lock_profile_settings/"
    },
    {
        "id": "1l8zh5t",
        "author": "PatienceNo417",
        "title": "Just Finished Anne with an E…",
        "content": "…and I’m so upset it’s OVER. CANCELLED. DONE WITH. I know. I’m late on the bandwagon, but this is truly such a lovely show. It’s just what I needed to watch with all that is going on in this world. \n\nI’m so upset this show was cancelled. Can someone contact Amybeth McNulty to get a movie going? 🥲 I have to see the story of Anne and Gilbert unfold! I want to see Diana grow older! And what about Ka’kwet? Matthew’s chest pain? C’mon Netflix. Let’s partner with whatever Canada wants and make it happen. I’ll be part of the production team if you need help. ",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1l8zh5t/just_finished_anne_with_an_e/"
    }
]