[
    {
        "id": "1njcod7",
        "author": "ShashaAndRichAMA",
        "title": "Hi /r/movies! We’re Rich Williamson &amp; Shasha Nakhai. Our film BOTS just premiered at TIFF and is now available for free on YouTube. We also made SCARBOROUGH (TIFF People's Choice Runner Up in 2021), TAKE LIGHT, and FRAME 394. Ask us anything!",
        "content": "Hi r/movies! We’re Rich Williamson &amp; Shasha Nakhai. Our film BOTS just premiered at TIFF and is now available for free on YouTube. We also made SCARBOROUGH (TIFF People's Choice Runner Up in 2021), TAKE LIGHT, and FRAME 394. Ask us anything!\n\n\\-------------------------------------------------------------------------------------\n\n**About the film:**\n\nA unit of dedicated bots scheme chaos and divisiveness from their office desks in Rich Williamson’s wickedly humorous and sharp satirical take on the absurd amount of power relinquished to the unhinged forces steering world politics.\n\n* Written and directed by Rich Williamson\n* Story and Concept by Paul Holub and Rich Williamson\n* Produced by Shasha Nakhai\n* Starring Tim Dowler-Coltman, Dillon Casey, Suzanne Pratley, Christian Meer, Adam Fawns,\n* Alexandra Rada, and Gordon S. Miller\n\n\\-------------------------------------------------------------------------------------\n\nWatch the trailer: [https://youtu.be/m1XAKGboG24](https://youtu.be/m1XAKGboG24)\n\n\\-------------------------------------------------------------------------------------\n\nWatch the film: [https://youtu.be/75CtJktAE2w](https://youtu.be/75CtJktAE2w)\n\n\\-------------------------------------------------------------------------------------\n\n***About us:***\n\nShasha Nakhai and Rich Williamson are Toronto-based filmmakers with Compy Films. Our scripted and unscripted work has taken us to the Hawaiian coastline, the ski slopes of Davos, a Cold War bunker, the engine room of a decaying ship, Philippine sugar mills and the front lines of Nigeria’s energy crisis.\n\nOur body of work over the past 15 years includes the TIFF breakout hit SCARBOROUGH, adapted from the novel by Catherine Hernandez, and the Oscar-shortlisted FRAME 394.\n\n**Our work has:**\n\n* Screened at festivals worldwide  \n* Aired on the BBC, CBC, ZDF and Arte\n* Been named TIFF\\&amp;#39;s Top 10\n* Shown at the Museum of Modern Art (MoMA)\n* Released on Crave, Apple TV, iTunes, Prime Video, Tubi, Kanopy and Paramount+\n* Gone viral and been awarded Vimeo Staff Pick and Short of the Week\n* Nominated for 17 Canadian Screen Awards, with 8 wins including Best Picture\n* Shortlisted for an Academy Award (Oscar)\n\n\\-------------------------------------------------------------------------------------\n\n**Past credits:** \n\nhttps://www.imdb.com/name/nm3083808/ + https://www.imdb.com/name/nm4365701/ \n\n\\-------------------------------------------------------------------------------------\n\nWe’ll be back at 3pm ET today (Wednesday, Sep 17) to answer your questions. No bots allowed!   \n\n",
        "upvotes": 10,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/c9kimgne2qpf1.png?auto=webp&amp;s=b78e842035eb6cb6b24834623d5b106768b70ea9"
        },
        "permalink": "/r/movies/comments/1njcod7/hi_rmovies_were_rich_williamson_shasha_nakhai_our/"
    },
    {
        "id": "1njcitv",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'ANACONDA' Starring Paul Rudd &amp; Jack Black",
        "content": "",
        "upvotes": 3712,
        "comments": 383,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qffrd4as3qpf1.jpeg?auto=webp&amp;s=0d707785a046d989baaa6fe8fdd5e3508bf3ee99"
        },
        "permalink": "/r/movies/comments/1njcitv/official_poster_for_anaconda_starring_paul_rudd/"
    },
    {
        "id": "1njgwc8",
        "author": "ChiefLeef22",
        "title": "Paul Thomas Anderson's 'One Battle After Another' - Review Thread",
        "content": "*Bob is a washed-up revolutionary who lives in a state of stoned paranoia, surviving off-grid with his spirited and self-reliant daughter, Willa. When his evil nemesis resurfaces and Willa goes missing, the former radical scrambles to find her as both father and daughter battle the consequences of their pasts.*\n\nCast: Leonardo DiCaprio, Teyana Taylor, Benicio Del Toro, Sean Penn, Chase Infiniti, Regina Hall\n\n**Rotten Tomatoes:** [98%](https://www.rottentomatoes.com/m/one_battle_after_another)\n\n**Metacritic:**  [99 / 100](https://www.metacritic.com/movie/one-battle-after-another/)\n\nSome Reviews:\n\n[HighOnFilms - Liam Gaughan](https://www.highonfilms.com/one-battle-after-another-2025-movie-review/) \\- 5 / 5\n\n&gt;“One Battle After Another” is a hyperkinetic thrill ride that surprisingly never loses momentum throughout its nearly three-hour running time, yet never feels weighed down by its scope. The action has the same eye-popping practicality of “John Wick” or “Mad Max: Fury Road,” with the charm that none of its characters are particularly skilled. DiCaprio often appears as a bumbling hero in the vein of Buster Keaton or Charlie Chaplin, even if he shows a capacity for delivering snarky one-liners not seen since his work in “The Wolf of Wall Street.”\n\n[BBC - Caryn James](https://www.bbc.com/culture/article/20250917-one-battle-after-another-review) \\- 5 / 5\n\n&gt;Salman Rushdie, reviewing Pynchon's Vineland 35 years ago, called it \"a major political novel about what America has been doing to itself.\" And at a Q&amp;A with Anderson several weeks ago, Steven Spielberg praised the film as \"increasingly more relevant than perhaps even when you finished the screenplay\". American society, in all its strengths and missteps, has been a major theme for both Pynchon and Anderson, and it grounds Anderson's dazzler of a film, giving it an emphatic, unmistakable political charge.\n\n[Next Best Picture - Matt Neglia](https://nextbestpicture.com/one-battle-after-another/) \\- 10 / 10\n\n&gt;Ambitious, urgent and personal storytelling from Paul Thomas Anderson, blending many different genres to create an engaging and vital new masterwork. Relentless pacing, strong performances, technical and visual excellence, with multi-layered depth and inspiring relevance to bring about change for our overwhelmingly dark times.\n\n[IGN - Michael Calabro](https://www.ign.com/articles/one-battle-after-another-review-leonardo-dicaprio-pta?utm_source=threads,twitter) \\- 10 / 10\n\n&gt;Even the things PTA whole-cloth invented for the film, like the harmony transponders, Bob forgetting the code words, the Christopher Reeve Superman poster in Sensei Sergio’s dojo, semen demon, the car chases, the stunt fall off a building down a tree… There are so many little details, seemingly inconsequential touches – the filmmaker’s style, if you will – that all add up bit by bit to turn this amazing movie into a masterpiece.\n\n[IndieWire - David Ehrlich](https://www.indiewire.com/criticism/movies/one-battle-after-another-movie-review-paul-thomas-anderson-1235151707/) \\- 'A'\n\n&gt;With “One Battle After Another,” Anderson concedes that he’s no different than his most enduring creations. On a long enough timeline, maybe none of us are.\n\n[The Guardian - Peter Bradshaw](https://www.theguardian.com/film/2025/sep/17/one-battle-after-another-review-paul-thomas-andersons-thrillingly-helter-skelter-counter-culture-caper) \\- 5 / 5\n\n&gt;One Battle After Another is at once serious and unserious, exciting and baffling, a tonal fusion sending that crazy fizz across the VistaVision screen – an acquired taste, yes, but addictive. The title itself hints at an unending culture war presented as a crazily extreme action movie with superbly managed car chases and a final, dreamlike and hypnotic succession of three cars through the undulating hills. And is the central paternity crisis triangle an image for an ownership dispute around the American melting-pot dream? Maybe. These ideas are very unfashionable in the US right now, which only makes this film more interesting: it is about dissent and discontent, and the lonely heroism of not fitting in.\n\n[RogerEbert - Brian Tallerico](https://www.rogerebert.com/reviews/one-battle-after-another-movie-review-2025) \\- 4 / 4\n\n&gt;It’s also, crucially, a deeply humanist movie. Anderson cares about these characters deeply. Bob’s frustration becomes our own, as does his concern for Willa. So many “films of our moment” have felt angry or cynical, but Anderson’s movie transcends that by being human and even offering optimism. It’s not one loss after another. It’s one battle. Keep fighting.\n\n[The Playlist - Rodrigo Perez](https://theplaylist.net/one-battle-after-another-review-paul-thomas-anderson-declares-war-in-thrilling-comical-moving-take-on-revolution-personal-evolutions-20250917/) \\- 'A'\n\n&gt;From one generation to the next, the struggle endures. Fierce and unrelenting, Paul Thomas Anderson’s “One Battle After Another” burns as both an incendiary action epic and a tender family drama, alive with humor, conviction, and revolutionary spirit. And amid all its pandemonium, Sergio’s reminder that “freedom is no fear” lingers as the film’s quiet truth, a mantra passed down like a torch. Few films this year feel so vital, so breathtaking in scope and soul. Viva la revolución, indeed.\n\n[London Evening Standard - Nick Howells](https://www.standard.co.uk/culture/film/one-battle-after-another-review-paul-thomas-anderson-leonardo-dicaprio-teyana-taylor-b1247490.html) \\- 5 / 5\n\n&gt;What Anderson has turned out is something of a cinephile’s visual symphony. If there were Proms devoted to films instead of music in the future, One Battle After Another would be one of the first movies to join the repertoire. And yes, Oscars must be coming...\n\n[The Telegraph - Robbie Collins](https://www.telegraph.co.uk/films/2025/09/17/one-battle-after-another-thriller-leonardo-dicaprio/) \\- 5 / 5\n\n&gt;Eyes shielded by Terminator shades, tatty dressing gown flapping in the breeze, Leonardo DiCaprio tumbles through One Battle After Another looking like he’s fighting several conflicts simultaneously, on physical and mental fronts...This madcap urban warfare thriller has heists, showdowns and two of the best car chases in years.",
        "upvotes": 631,
        "comments": 184,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-Y5cyiADkxYGc2WgIsoZKlPzMTTnnQ1MG5XvjeMqOVU.jpeg?auto=webp&amp;s=8148c9121142af5542e81e4090da5e82ca351be1"
        },
        "permalink": "/r/movies/comments/1njgwc8/paul_thomas_andersons_one_battle_after_another/"
    },
    {
        "id": "1njchwd",
        "author": "MarvelsGrantMan136",
        "title": "ANACONDA | Official Trailer",
        "content": "",
        "upvotes": 716,
        "comments": 258,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pIkPMSfWOzxqFIuuQgq8a53G8IHLf1arVqKdkpCaea8.jpeg?auto=webp&amp;s=31a95e7ed3d65771f5e0c25282c883ac2af4ed84"
        },
        "permalink": "/r/movies/comments/1njchwd/anaconda_official_trailer/"
    },
    {
        "id": "1njf65o",
        "author": "darth_vader39",
        "title": "‘Elio’ Is Now Streaming on Disney+",
        "content": "",
        "upvotes": 136,
        "comments": 94,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9nqvsGogWbu3prF-XgYGLxhe_yRdRMYC5-wnrc8jmRE.jpeg?auto=webp&amp;s=998c3fcc63ea1e63d01e4422e3ee0936dcde24a9"
        },
        "permalink": "/r/movies/comments/1njf65o/elio_is_now_streaming_on_disney/"
    },
    {
        "id": "1njapon",
        "author": "TheExpressUS",
        "title": "Paula Shaw, who famously stepped in for Betsy Palmer to portray Pamela Vorhees in Freddy vs Jason, has died at the age of 84",
        "content": "",
        "upvotes": 229,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NHYrgfvK8rB-yD7CRCoQFYcZeWRT46hxu_R8QBNWTP4.jpeg?auto=webp&amp;s=71872dac3b188863c728393f215eb75994a4fc0e"
        },
        "permalink": "/r/movies/comments/1njapon/paula_shaw_who_famously_stepped_in_for_betsy/"
    },
    {
        "id": "1njgtsm",
        "author": "KillerCroc1234567",
        "title": "‘Bring Her Back’ Sets October 3rd Premiere Date On HBO Max",
        "content": "",
        "upvotes": 98,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1KxTSP8y1MFmOtOPuIMfk0b7ZMux1gSxkuLZF6lEnxs.jpeg?auto=webp&amp;s=5309befd92ce06f6f1b812d61b725c4debc94d28"
        },
        "permalink": "/r/movies/comments/1njgtsm/bring_her_back_sets_october_3rd_premiere_date_on/"
    },
    {
        "id": "1nj361s",
        "author": "CosmosisJones42",
        "title": "What’s your favorite example of a movie being way better than it had any right to be?",
        "content": "Every once in awhile a movie comes along that should of been forgettable. Maybe it was based on an existing brand or toy or it just had a tiny budget and no big names attached. For whatever reason the expectations were low, but then the film turns out to be suprisingly great.\n\nI recently rewatched The Lego Movie and found it a great example of this, and am looking for more suggestions. So whats your pick? Which movie shocked you by being way better then you thought it would be?",
        "upvotes": 699,
        "comments": 1152,
        "media": null,
        "permalink": "/r/movies/comments/1nj361s/whats_your_favorite_example_of_a_movie_being_way/"
    },
    {
        "id": "1nifpvw",
        "author": "Ifeel-likepablo",
        "title": "Robert Redford, Screen Idol Turned Director and Activist, Dies at 89",
        "content": "",
        "upvotes": 22703,
        "comments": 1370,
        "media": null,
        "permalink": "/r/movies/comments/1nifpvw/robert_redford_screen_idol_turned_director_and/"
    },
    {
        "id": "1nigwgv",
        "author": "MarvelsGrantMan136",
        "title": "First Images of Paul Rudd, Jack Black, Thandiwe Newton, &amp; Steve Zahn in 'Anaconda' - A group of childhood friends facing mid-life crises head to the rainforest to remake their favorite film from their youth, only to encounter a variety of dangers.",
        "content": "",
        "upvotes": 10168,
        "comments": 922,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7jzfh7ibzipf1.jpeg?auto=webp&amp;s=bc7c8305d2fce9a1f7fd83ff6aba239e07564ea2"
        },
        "permalink": "/r/movies/comments/1nigwgv/first_images_of_paul_rudd_jack_black_thandiwe/"
    },
    {
        "id": "1njbme7",
        "author": "Amaruq93",
        "title": "Behind the Scenes footage from 1965, during the filming of \"Dracula: Prince of Darkness\" with Christopher Lee",
        "content": "",
        "upvotes": 110,
        "comments": 7,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/l2za74mdwppf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1njbme7/behind_the_scenes_footage_from_1965_during_the/"
    },
    {
        "id": "1nixjyc",
        "author": "Neon_Biscuit",
        "title": "Movies CAN be magical. After watching Big Fish, the strangest thing happened to me.",
        "content": "This just happened to me 10 minutes ago. I am making this post because I think sometimes some people can forget the power of movies.\n\nI just finished a rewatch of Tim Burton's Big Fish after maybe 15 years, which without ruining is essentially a father/son themed film. In the film, Will is estranged from his father for 3 years, and then they get closer as the story goes on. I, myself, have been estranged from my father for a similar stretch of time. As the final scene comes to a close, as the movie transitions to the credits, my phone lights up. It's my father. He hasn't called me in years. Before I could answer, the call disconnects. I stare at my phone for 5 minutes trying to comprehend the situation and I call him back. ...It goes to voicemail.\n\nI can't help but think at the moment the film ended there was a strong cosmic push, an inkling, for my father to pick up the phone and reach out but he quickly ended the call. No happy ending here, but still.....very eerie. The timing couldn't have been spookier. It couldn't have been a coincidence. Movies are magic.",
        "upvotes": 1020,
        "comments": 81,
        "media": null,
        "permalink": "/r/movies/comments/1nixjyc/movies_can_be_magical_after_watching_big_fish_the/"
    },
    {
        "id": "1nil6bz",
        "author": "MarvelsGrantMan136",
        "title": "James Gunn's 'Superman' Sets HBO Max Release Date - September 19",
        "content": "",
        "upvotes": 3446,
        "comments": 279,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/K8i-Js5aNusbRJTxt_l4YlyGNzdOFyDZtc022rq_zlo.jpeg?auto=webp&amp;s=83a2b20ae83fe9f59be0c00fde660bf7dd404dca"
        },
        "permalink": "/r/movies/comments/1nil6bz/james_gunns_superman_sets_hbo_max_release_date/"
    },
    {
        "id": "1ninymr",
        "author": "NoCulture3505",
        "title": "Movie Theater Chains Spent $1.5 Billion in Renovations Over the Past Year, Cinema United Says",
        "content": "",
        "upvotes": 1365,
        "comments": 156,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6KzExErKQ10qndIkolvn6Dd56MD9peo4GD9Gr_ji8B8.jpeg?auto=webp&amp;s=fcb57393f96143f5c73c48a5f2a970571636cd67"
        },
        "permalink": "/r/movies/comments/1ninymr/movie_theater_chains_spent_15_billion_in/"
    },
    {
        "id": "1nixcxm",
        "author": "BunyipPouch",
        "title": "First Poster for South Korean Sci-Fi Disaster Film 'The Great Flood' - A disastrous great flood sweeps the planet. On what may be the last day on Earth, a desperate fight ensues to save a child from a flooding apartment.",
        "content": "",
        "upvotes": 393,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/kgs8im163mpf1.jpeg?auto=webp&amp;s=151ab6b0a07e86bd5c7a3f19088779ecc9245689"
        },
        "permalink": "/r/movies/comments/1nixcxm/first_poster_for_south_korean_scifi_disaster_film/"
    },
    {
        "id": "1niqma3",
        "author": "Lovecraft_Penguin",
        "title": "Every Hallmark movie opens exactly the same way as a horror film, except when the \"turn\" would happen, something nice happens instead.",
        "content": "- Susan is a high powered business woman and she's just been given a special job by her boss...who is also her dad.\n- She has to go to a remote town in a frozen wilderness where the people rarely leave.\n- She travels alone, by car, through this vast wilderness.\n- Her car breaks down by the side of the road.\n- A mysterious stranger comes, offering help.\n- It's getting dark and a storm is coming, so he offers to take her back to his home...in the forest.\n- He gives few details, and is oddly evasive about what he does for a living or who his family is.\n- Reluctantly, she enters the stranger's car, and he takes her back to his home, as the storm rolls in...\n\n...and everyone is extremely nice and things work out just fine! His mom bakes her a pie. His dad is Santa Claus. She quits her job, marries him, and becomes a professional tree decorator. ",
        "upvotes": 777,
        "comments": 41,
        "media": null,
        "permalink": "/r/movies/comments/1niqma3/every_hallmark_movie_opens_exactly_the_same_way/"
    },
    {
        "id": "1nj0ue4",
        "author": "Due_Toe6417",
        "title": "When you where a kid what's the One film you rewatched over over again.?",
        "content": "For context my brother watched a taped version of The wedding singer multiple times in One day simply because he had a crush on Drew Barrymore.\n\nMy most rewatched film as a kid was probably back to the future 3.. oddly we only had part 3 on VHS but but not part 1 or 2.. but I'd seen part 1 on TV multiple times only actually got round to watching part 2 in My like mid 20s..\n\nAnyone have any similar stories regarding sequels?\n\n \n\n\n\n",
        "upvotes": 198,
        "comments": 1093,
        "media": null,
        "permalink": "/r/movies/comments/1nj0ue4/when_you_where_a_kid_whats_the_one_film_you/"
    },
    {
        "id": "1nijple",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for the 4K Restoration of 'Jacob's Ladder', Returning to Theaters in October",
        "content": "",
        "upvotes": 1372,
        "comments": 173,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/o9s4d5fvijpf1.jpeg?auto=webp&amp;s=96b7c7e20ae329c7ae182b3ca7ba3ddfdf87c598"
        },
        "permalink": "/r/movies/comments/1nijple/official_poster_for_the_4k_restoration_of_jacobs/"
    },
    {
        "id": "1nii613",
        "author": "darth_vader39",
        "title": "\"The Fantastic Four: First Steps\" releases on digital September 23rd",
        "content": "",
        "upvotes": 1613,
        "comments": 336,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/yScs_Bse3lXQYFy3NoX7-PT7W9T2ORtdUeXYses8JUw.jpeg?auto=webp&amp;s=29390fc636cb8f548146e9ffbcaea199494da7b3"
        },
        "permalink": "/r/movies/comments/1nii613/the_fantastic_four_first_steps_releases_on/"
    },
    {
        "id": "1nimpsg",
        "author": "Neo2199",
        "title": "'Collateral' 2004: You know the folks in Culiacán and Cartagena?",
        "content": "",
        "upvotes": 923,
        "comments": 208,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cKOmYc-CTFdNTWjXlKA7OUCUiIO0cr9sms6zTj3HzoE.jpeg?auto=webp&amp;s=cecdb62783ca16ea252db0ff08a40be33d47efb8"
        },
        "permalink": "/r/movies/comments/1nimpsg/collateral_2004_you_know_the_folks_in_culiacán/"
    },
    {
        "id": "1njb100",
        "author": "TPowers16z",
        "title": "Classic movies with \"downer\" endings",
        "content": "I find that have always enjoyed those classic 60's and 70's movies with the \"downer\" endings. They include;\n\n\"The wild bunch\"\n\"Easy Rider\"\n\"Dirty Mary, Crazy Larry\"\n\"Race with the devil\"\n\"Beneath the Planet of the apes\"\n\"Vanishing point\"\n\"Wicker man\"\n\"Night of the living dead\"\n\"One flew over the cuckoo's nest\"\nand\n\"Children shouldn't play with dead things\" (a personal favorite!)\n\nCan you guys think of any more?",
        "upvotes": 22,
        "comments": 162,
        "media": null,
        "permalink": "/r/movies/comments/1njb100/classic_movies_with_downer_endings/"
    },
    {
        "id": "1nixdqa",
        "author": "BunyipPouch",
        "title": "'The Great Flood' - Official Trailer - Netflix's South Korean Disaster Film",
        "content": "",
        "upvotes": 154,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/k2B-xydCl-KvbJQMqFQVNIMwQat5EeWDBM--e1DyzyY.jpeg?auto=webp&amp;s=9b1f816050938233516501379ae15984f2001250"
        },
        "permalink": "/r/movies/comments/1nixdqa/the_great_flood_official_trailer_netflixs_south/"
    },
    {
        "id": "1niafcl",
        "author": "dorgoth12",
        "title": "Materialists effect: mentions of A24 film studio up 65% in dating app profiles",
        "content": "",
        "upvotes": 3012,
        "comments": 389,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Mdoseo_B9kw62rJtOSoD21WiDYC6ROl5HvtEDgPJoQw.jpeg?auto=webp&amp;s=bb62171e0792cde76911eff0f09629d02edd219f"
        },
        "permalink": "/r/movies/comments/1niafcl/materialists_effect_mentions_of_a24_film_studio/"
    },
    {
        "id": "1njdgpo",
        "author": "JamieReleases",
        "title": "Vicious | Trailer | Paramount+",
        "content": "",
        "upvotes": 10,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/se3daHHr68blTmrsQUWZXsQlBGS_mqQRxnSpt1fcUYA.jpeg?auto=webp&amp;s=7dd142c2c49519d18909b38598063ccacbcfaec8"
        },
        "permalink": "/r/movies/comments/1njdgpo/vicious_trailer_paramount/"
    },
    {
        "id": "1nijkmv",
        "author": "MoneyLibrarian9032",
        "title": "Disney, Warner Bros. Discovery, NBCU Sue Chinese AI Company MiniMax, Alleging It ‘Pirates and Plunders’ Studios Copyrighted Works on ‘Massive Scale’",
        "content": "",
        "upvotes": 643,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6RCaW_Z8f9Jp3qFV3tKCh50gBVifga1SnZzlqrU1ujo.png?auto=webp&amp;s=b2326446ec9fda505786e0fdef1489950709a2a4"
        },
        "permalink": "/r/movies/comments/1nijkmv/disney_warner_bros_discovery_nbcu_sue_chinese_ai/"
    },
    {
        "id": "1nigzm0",
        "author": "CueTheLaughTrack",
        "title": "THE SIMS movie will be inspired by THE LEGO MOVIE and BARBIE, confirms producer Roy Lee",
        "content": "",
        "upvotes": 815,
        "comments": 219,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3eiFrSenJ5Ok1TZUWzKLoLChlH7oi3schP9XQ20d-pI.jpeg?auto=webp&amp;s=1d85bbdaf250b296c09e978f7ee56d07484bdfb6"
        },
        "permalink": "/r/movies/comments/1nigzm0/the_sims_movie_will_be_inspired_by_the_lego_movie/"
    },
    {
        "id": "1njibu1",
        "author": "BunyipPouch",
        "title": "Denmark has selected 'Mr. Nobody Against Putin' as its official Oscar submission for International Film. A Russian teacher secretly documents his small town school's transformation into a war recruitement center during the Ukraine invasion. Critically acclaimed at Sundance, 100% on Rotten Tomatoes.",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/p0FrBYnvZH1DED-h4fi3dP0k-mxJWZsy0jvKDxQ4I5g.jpeg?auto=webp&amp;s=34a2680f451d45f8f96d1790fc80c47fce93417f"
        },
        "permalink": "/r/movies/comments/1njibu1/denmark_has_selected_mr_nobody_against_putin_as/"
    },
    {
        "id": "1ni6wue",
        "author": "G_Marius_the_jabroni",
        "title": "Ryan Gosling's character's personality flipping a switch in Drive was pretty eerie.",
        "content": "Nothing against Ryan Gosling, but before \"Drive\" I didnt think much of his acting abilities. But i'lll be damned if [if the dude straight up flipped a switch](https://youtu.be/u2YbMUcdElc) in his character's personality that is pretty rare in movies these days. He was just chilling by himself in a cafe, eating some pie, minding his own business, and all of a sudden that random dude cramps up in his space, pissing him off and causing a switch to flip, revealing his character's true, extremely dangerous  personality. Top-notch, in my opinion.",
        "upvotes": 3097,
        "comments": 366,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KHl8-5t_fBG5YAv4O061rVKdlMOEu30n2pOLKjdWvjg.jpeg?auto=webp&amp;s=9861823b36a3e86dad4ac212e5e1beb161d56c40"
        },
        "permalink": "/r/movies/comments/1ni6wue/ryan_goslings_characters_personality_flipping_a/"
    },
    {
        "id": "1nji4mx",
        "author": "Bullingdon1973",
        "title": "Fascinating interview with 'Boorman and the Devil' director David Kittredge, about the legacy of John Boorman's much-reviled 'Exorcist II: The Heretic'",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rpoXptu5iHcXZnrfpnOIis7PJK4usD-f-TOLF1B1k-0.jpeg?auto=webp&amp;s=1a4c3a60c1e4666581bbf0938bbfcc1c8a883246"
        },
        "permalink": "/r/movies/comments/1nji4mx/fascinating_interview_with_boorman_and_the_devil/"
    },
    {
        "id": "1nji41w",
        "author": "MoneyLibrarian9032",
        "title": "Good Boy | Tickets On Sale | IFC",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ew2PxZTFH0kB4GbJp7cgZDw8OWaQcn6XJWtV7qr_nX0.jpeg?auto=webp&amp;s=0483493c3adc93c789ca9ae4c4d54097914fd575"
        },
        "permalink": "/r/movies/comments/1nji41w/good_boy_tickets_on_sale_ifc/"
    },
    {
        "id": "1nimxr0",
        "author": "ChiefLeef22",
        "title": "'A Big Bold Beautiful Journey' - Review Thread",
        "content": "*Through a surprising twist of fate, single strangers Sarah and David get to relive important moments from their respective pasts, illuminating how they got to where they are in the present.*\n\nDirector: Kogonada\n\nCast: Margot Robbie, Colin Farrell\n\n**Rotten Tomatoes:** [55%](https://www.rottentomatoes.com/m/a_big_bold_beautiful_journey)\n\n**Metacritic:** [39/100](https://www.metacritic.com/movie/a-big-bold-beautiful-journey/)\n\nSome Reviews:\n\n[The Independent - Clarisse Loughrey](https://www.the-independent.com/arts-entertainment/films/reviews/big-bold-beautiful-journey-review-margot-robbie-b2827639.html) \\- 3 / 5\n\n&gt;Kogonada neither wrote nor edited A Big Bold Beautiful Journey, and so we’re largely lacking in the sophistication department, or the soft musicality he’s been able to construct in his earlier films.\n\n[AV Club - Jesse Hassenger](https://www.avclub.com/a-big-beautiful-journey-review) \\- 'C+'\n\n&gt;Is *A Big Bold Beautiful Journey* a piece of wannabe creativity with a yawning hollowness at its center, or an A-list romance with some welcome aesthetic sensitivity? Like the outcome of a first date, it will ultimately be determined by chemistry.\n\n[The Guardian - Peter Bradshaw](https://www.theguardian.com/film/2025/sep/16/a-big-bold-beautiful-journey-review-margot-robbie-and-colin-farrell-play-the-game-of-love) \\- 3 / 5\n\n&gt;This film, in its mainstream way, weirdly also has something Kaufmanesque as well … or almost. You might expect Kline and Waller-Bridge’s characters to be revealed as techno-sapien robots, as well as Farrell and Robbie and Kogonada and everyone involved with the film. But no. The unreality of the film never quite equates to dishonesty about what exactly happens when two people not in the first flush of youth decide to be in love, but it takes an effort of will to suspend disbelief and submit to a well-intentioned fantasy.\n\n[Variety - Tomris Laffly](https://variety.com/2025/film/reviews/a-big-bold-beautiful-journey-review-1236520085/)\n\n&gt;The film’s tonal inconsistencies hurt its impossibly talented co-leads considerably. Most of the time, both Farrell and Robbie seem detached and surprisingly cold when they are supposed to be embracing intimate, vulnerable feelings audiences know they’re more than capable of projecting.\n\n[IndieWire - Ryan Lattanzio](https://www.indiewire.com/criticism/movies/a-big-bold-beautiful-journey-review-kogonada-1235151392/) \\- 'D+'\n\n&gt;“A Big Bold Beautiful Journey” is miscalculated as a romance and a fantasy, and while I’m loath to blame a craftsman as intelligent as Kogonada entirely for the outcome, he did, after all, agree to direct this lousy script. A big, bold, beautiful bore indeed.",
        "upvotes": 229,
        "comments": 78,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mI1zTNboO7VUpMQEEXjY5TXe5ZtPVE4PviJQN4XQT4c.jpeg?auto=webp&amp;s=6de09c64b6cffa75087bdf16949abbddd1d532fa"
        },
        "permalink": "/r/movies/comments/1nimxr0/a_big_bold_beautiful_journey_review_thread/"
    }
]