[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 9,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 35,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1knlzdf",
        "author": "Working_Branch_751",
        "title": "Here to say I'm mad af Netflix cancelled Lockwood and Co.",
        "content": "Yeah, it's been over 2 years, but I just watched season 1 for the first time and can't fathom why Netflix would cancel a show with a shedload of potential and the perfect Anthony Lockwood -- Cameron Chapman! 😩",
        "upvotes": 38,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1knlzdf/here_to_say_im_mad_af_netflix_cancelled_lockwood/"
    },
    {
        "id": "1kng9wq",
        "author": "Brutal-Juice",
        "title": "Netflix will show generative AI ads midway through streams in 2026",
        "content": "",
        "upvotes": 53,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1kng9wq/netflix_will_show_generative_ai_ads_midway/"
    },
    {
        "id": "1knm6el",
        "author": "Sufficient_Ebb_5694",
        "title": "Whats your favorite Netflix original?",
        "content": "I'm looking for a captivating show that will keep me interested so im curious of your favorites. So far I think Stranger Things or Altered Carbon S1 are my favorites",
        "upvotes": 18,
        "comments": 73,
        "media": null,
        "permalink": "/r/netflix/comments/1knm6el/whats_your_favorite_netflix_original/"
    },
    {
        "id": "1knlkfo",
        "author": "Illustrious_Cry9722",
        "title": "American Manhunt - Osama Bin Laden",
        "content": "I just finished watching the new series and what an emotional roller coaster ride. I usually don’t get too caught up on documentaries but this one had me on edge. Partly bc 9/11 is deeply personal for me and even to this day, my eyes tear up when I see images of the planes hitting the towers. And they always trigger my memories of how the city smelled (I lived in Brooklyn) the days following 9/11. Anyway, I’m no history bluff and I’m sure people will debate on the accuracy of the events that unfolded but from my standpoint, I thought the documentary was well-made and yes, I wish it was a little longer.",
        "upvotes": 14,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1knlkfo/american_manhunt_osama_bin_laden/"
    },
    {
        "id": "1knicni",
        "author": "Feeling_Fox_5426",
        "title": "New show recommendations please!!!",
        "content": "Looking for a new show to binge.... for reference, I'll list below my favorite series I've watched so far (on and off Netflix):\n\n* Breaking Bad\n* Ozark\n* Severance\n* The Witcher\n* Peaky Blinders\n* The Sinner\n* Mindhunter (R.I.P)\n* Queen's Gambit\n\nHopefully based on these you can get an idea of my interests. Drop me your favorites below and tell me why you love them!!!\n\n",
        "upvotes": 17,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1knicni/new_show_recommendations_please/"
    },
    {
        "id": "1kmypq5",
        "author": "abelldeez",
        "title": "The Liver King documentary is an advertisement. He's duped you all again",
        "content": "This is a brilliant AD for ancestral supplements. Here's how they did it.\n\n1. Paint liver king as a broken, troubled, but \"just trying to get a good message out\" guy who takes all the blame and is the only bad person in this story. Heck, he was a major fraudster it makes sense he would lie, right?\n\n2. Portray the nine ancestral tenets and liver as positively as possible... People saying it changed their life, his kids are healed with no other details given, Brian started the company when he figured out liver was good.  All this can be true as whole foods and better lifestyle choices are good.  No one on the marketing team or ancestral supplements knew about the steroids, he told them he didn't use so they had no idea remember? \n\n3. Separate the brilliant but evil marketing plan that made ALL his supplement companies exorbitant amounts of money from the scam that grew his companies immensely. \n\n4. A mutant physique going viral by taking $12,000 worth of GH per month, eating raw testicles for shock value and denying steroid use to generate more chatter.  He did this to grow his company.  Sure, spreading the word of better living is good, but the main goal is to grow the company.  And they did just that.  Now just make LK the sole evil person and make everyone feel for LK.  \n\n3. Did anyone else notice the beautiful shelf of ancestral supplements the camera panned to right at the end? How convenient, I mean we know liver king lied but he wanted to help and it saved both kids.  Organs and carnivore diets are the key to great health.  Don't want to eat raw organs, let us show you this lovely display of products from ancestral supplements, they are good people who were not in on the scam just profited immensely what a coincidence. Don't buy from ancestral he owns multiple supplement companies. They only told you about one, think that was a mistake? \n\n4. HE LITERALLY TELLS EVERYONE HE'S A FRAUDSTER RIGHT TO YOUR FACE. HE LIED TO EVERYONE.  YOU THINK HE STOPPED BEING FRAUDULENT? C'MON PEOPLE! THE GUY WAS PRINTING MONEY AND DOING FRAUDULENT RECIEPTS.  LITERALLY DOING IMMORAL ASS SHIT TO MAKE MORE MONEY AS HES DOING WITH THIS DOCUMENTARY.\n\nSeriously if anyone thinks this is anything but an advertisement I feel bad for you.  He's duping you AGAIN\n",
        "upvotes": 243,
        "comments": 74,
        "media": null,
        "permalink": "/r/netflix/comments/1kmypq5/the_liver_king_documentary_is_an_advertisement/"
    },
    {
        "id": "1kmz2vq",
        "author": "lIlI1lII1Il1Il",
        "title": "Netflix’s ad tier is growing really fast — and that means more ads",
        "content": "",
        "upvotes": 83,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1kmz2vq/netflixs_ad_tier_is_growing_really_fast_and_that/"
    },
    {
        "id": "1kmwjq8",
        "author": "y1314_",
        "title": "The Deadly American Family",
        "content": "I am just finishing up the documentary, and the only thing I can think of is Molly’s obsession with having custody over kids that she DID not bring into this world. It’s very weird imo! I understand raising the kids but to feel so entitled to them is… crazy! \nIt’s like Molly was using the kids to help herself look like the victim. And Molly knew these kids didn’t have anyone else to go to so she seized her moment and forced herself onto the kids in becoming their mother. \nJust my opinion! \n",
        "upvotes": 89,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1kmwjq8/the_deadly_american_family/"
    },
    {
        "id": "1kn3srs",
        "author": "EthanWilliams_TG",
        "title": "'Rebel Moon 3' Seems Unlikely, Says Writer Kurt Johnstad, It Will Happen\"With some luck and an act of God\"",
        "content": "",
        "upvotes": 17,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1kn3srs/rebel_moon_3_seems_unlikely_says_writer_kurt/"
    },
    {
        "id": "1knngut",
        "author": "kittycaatttt",
        "title": "New Show \"Bet\" based on Kakegurui",
        "content": "Thoughts??? I'm watching this and it's really hard to watch... What do y'all think. It's really cringe from my perspective and the actors are all kinda weird.  ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1knngut/new_show_bet_based_on_kakegurui/"
    },
    {
        "id": "1knlrqj",
        "author": "KitchenBeneficial302",
        "title": "Five Films from Netflix Animation in 2026",
        "content": "# Upcoming Films from Netflix Animation\n* Untitled Stanley Moore film\n* Untitled Glen Keane and John Kahrs film\n* Untitled Robert Marianetti, Robert Smigel and David Wachtenheim film\n* Untitled Charlie Bean, Paul Briggs and John Ripa film\n* Untitled Don Bluth, Gary Goldman and Dexter Fletcher film",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1knlrqj/five_films_from_netflix_animation_in_2026/"
    },
    {
        "id": "1knlkz4",
        "author": "fabdab501",
        "title": "Low quality on Netflix when using a playback speed extension",
        "content": "For some reason I get low quality on Netflix when using a playback speed extension. The extension is called \"Global Speed\". Anyone know a fix to the problem?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1knlkz4/low_quality_on_netflix_when_using_a_playback/"
    },
    {
        "id": "1knl31t",
        "author": "Apprehensive-Bank636",
        "title": "How do I support good tv?",
        "content": "Just watched new season of LDR and some episodes are pure genius.\n\nIn films my support usually is pay for the ticket, rate it good(on LB), recommend people.\n\nBut in tv it’s difficult, because I don’t know how they make money. So how to support the shows on Netflix that I like.\n\nBecause it’s all on same platform, it all feels equal.\n\nScavengers Reign for example belongs in some next league, also Blue Eye Samurai.\n\nI just want to support it so that they can get some positive feedback and keep making good shit and don’t get discouraged.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1knl31t/how_do_i_support_good_tv/"
    },
    {
        "id": "1kmfc6h",
        "author": "Then-Scholar1748",
        "title": "Netflix’s A Deadly American Marriage: Jack and Sarah Corbett’s full victim impact statements",
        "content": "",
        "upvotes": 329,
        "comments": 213,
        "media": null,
        "permalink": "/r/netflix/comments/1kmfc6h/netflixs_a_deadly_american_marriage_jack_and/"
    },
    {
        "id": "1kn2rim",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix Renewed Bridgerton, The Diplomat, Love on the Spectrum and bunch of other shows for new seasons",
        "content": "",
        "upvotes": 11,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kn2rim/netflix_renewed_bridgerton_the_diplomat_love_on/"
    },
    {
        "id": "1kmx5o6",
        "author": "ACSportsbooks",
        "title": "Netflix breaks ground on $900M movie studio at former NJ Army base",
        "content": "",
        "upvotes": 25,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kmx5o6/netflix_breaks_ground_on_900m_movie_studio_at/"
    },
    {
        "id": "1kn3d9a",
        "author": "puccappucinno",
        "title": "Can anyone recommend a Netflix movie similar to Bullet Train Explosion?",
        "content": "So I just watched this movie recently and kinda liked it!! Now I’m in the mood for something similar. Would be awesome if it’s Japanese, but I’m open to anything really. Anyone got some recs? I’m into suspenseful plots hehe\n\nhttps://preview.redd.it/cut7gn3esw0f1.jpg?width=1500&amp;format=pjpg&amp;auto=webp&amp;s=fae85cf10ebd29c18c92f1009affc642dbc6ee2d\n\n",
        "upvotes": 7,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1kn3d9a/can_anyone_recommend_a_netflix_movie_similar_to/"
    },
    {
        "id": "1knac5r",
        "author": "EthanWilliams_TG",
        "title": "Volume IV of 'LOVE DEATH + ROBOTS' Is Out, and There's a Special David Fincher RHCP Episode to Enjoy",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1knac5r/volume_iv_of_love_death_robots_is_out_and_theres/"
    },
    {
        "id": "1kmw2po",
        "author": "highangryvirgin",
        "title": "Thoughts on American Manhunt Osama Bin Laden?",
        "content": "I personally think it was a great piece of history. It really showed the fear and terror people felt about Bin Laden on 9/11. It focuses on the US government efforts to capture him before 9/11,the attack itself, and during it. The documentary could have gone more into depth at what intelligence agencies were missing about the terrorist threat in that era and why red flags weren't taken seriously back than. But other than that great piece of history. ",
        "upvotes": 18,
        "comments": 66,
        "media": null,
        "permalink": "/r/netflix/comments/1kmw2po/thoughts_on_american_manhunt_osama_bin_laden/"
    },
    {
        "id": "1knnr12",
        "author": "_Luna_00",
        "title": "Pleeeese yall sign this? I need a season 4 - 6 😭 (also anyone that loves bridgerton/ ladies companion - watch \"the great\" youll love it!)",
        "content": "Pleeeese yall sign this? I need a season 4 - 6 😭\n(How they originally planed it)\n\nhttps://chng.it/YdnBDJ8X5Q\n\nLink to sign!\nI think we need way more than 200 so everyone taking out just a second of their day is highly appreciated\nLove this show so much\n\nIk Im probably late but hey better late then never right - huzzah! (Just in love with that word sorry for mb using it wrong 😂)\n\n\n\n\nI googled and there were many shows that got renewed after people signed stuff like this, and Im an optimist, so my hopes remain high\nYalllll pls watch it, pls sign, Ill be forever gratefull for any signature if that means we can finally see more of the show\nIts just realllllllly good",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1knnr12/pleeeese_yall_sign_this_i_need_a_season_4_6_also/"
    },
    {
        "id": "1kn9br1",
        "author": "No_Demand_2454",
        "title": "See Which Of The Latest 13F Filers Holds NFLX   r/netflix",
        "content": "Most analysts are saying HOLD!!!   \n\nYet I’m thinking about buying? The thing holding me back is that the majority of the analysts are saying HOLD! Netflix is my second favorite stock. I trade daily. My banker said,”I haven’t run into one of you in years.”. I’ve been in the positive column since the day I first started buying it. I’m retired. Have one friend I discuss trades with. Then we compare results. I wasn’t sure which flair box to check. Trading stocks and art are my sorta jobs 😊. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kn9br1/see_which_of_the_latest_13f_filers_holds_nflx/"
    },
    {
        "id": "1kn8jmw",
        "author": "Lime_in_the_Coconut_",
        "title": "Meatball Lasagna made by Jon Favreau and Roy Choi in The Chef Shiw",
        "content": "I am desperately looking for a printable recipe for this, does anyone have this, or know how to go about finding it? I did the obvious Google searches but no luck. Any help massively appreciated!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kn8jmw/meatball_lasagna_made_by_jon_favreau_and_roy_choi/"
    },
    {
        "id": "1kn7upo",
        "author": "Aggravating_Lack_140",
        "title": "Love death and robots s4",
        "content": "Yep i'll be 100% honest this is fire\nEpisode 1 already added on my playlist\nProbably Best Episode would be 5\nOther than that all episode is fcking great",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kn7upo/love_death_and_robots_s4/"
    },
    {
        "id": "1kn6tx0",
        "author": "WildestDream34",
        "title": "Recommendations.",
        "content": "For the lover girl in me, drop in some recommendations as to what to watch on Netflix. It seems like there's nothing to watch anymore.\n\nFor the lover girl in me, drop in some recommendations as to what to watch on Netflix. It seems like there's nothing to watch anymore.\n\nFor the lover girl in me, drop in some recommendations as to what to watch on Netflix. It seems like there's nothing to watch anymore.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kn6tx0/recommendations/"
    },
    {
        "id": "1knhlfk",
        "author": "MarThread",
        "title": "The recruit cancelled?",
        "content": "Today I've learned that The night Agent was renewed for a season 3 while the recruit was cancelled after season 2.\n\nIf you watched both we can probably agree that the Recruit season 2 was amazing while the NA was pretty shit and very boring.\n\nI don't understand, was the recruit too expensive? Are Netflix users allergic to good shows? What happened and how is it possible to make such random decisions?",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1knhlfk/the_recruit_cancelled/"
    },
    {
        "id": "1kmtz1z",
        "author": "Twinkie_Heart",
        "title": "Garbo Where Did You Go",
        "content": "\nHas anyone watched this yet? I’m hoping someone could explain to me why the blonde woman narrating is whispering? Greta Garbo has such a fascinating life story and it’s so distracting the way she’s narrating. ",
        "upvotes": 10,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1kmtz1z/garbo_where_did_you_go/"
    },
    {
        "id": "1kmqwu4",
        "author": "rushdisciple",
        "title": "Fred &amp; Rose West: A British Horror Story",
        "content": "The problem with having so many different documentaries about the same subject is that when another one comes along you don't really learn much you didn't know before and that happened here. Saying that, the audio and video recordings I don't think I'd seen/heard before so I liked that and overall it was alright but nothing much more than that.",
        "upvotes": 14,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1kmqwu4/fred_rose_west_a_british_horror_story/"
    },
    {
        "id": "1kmx55a",
        "author": "Laura_Fantastic",
        "title": "Why does Netflix keep asking me to confirm my household?",
        "content": "I havent had any issues for the longest time, but about once a week since I have been on a buisness trip I have been needing to update my household. The thing is, I havent used Netflix myself since I have been on my trip, and haven't updated it to anything outside of my household. The only people who have been on it are in my household and use it on my households wifi. \n\nI need to confirm it for the people in my houshold so they can still use it. Even though I am not using it myself. ",
        "upvotes": 4,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1kmx55a/why_does_netflix_keep_asking_me_to_confirm_my/"
    },
    {
        "id": "1km7q0j",
        "author": "Mscharlita",
        "title": "Liver King- what did I just watch?",
        "content": "Within the first couple minutes his teenage son says “tooken days off” instead of “taken” and I knew it was bad news bears. \nI feel SO sorry for those boys. Truly. Did they even go to school? Or were they homeschooled by drug addled, morally bankrupt grifters spewing toxic masculinity? The mother seems to be from another country so maybe she’s not the best teacher of English but yikes, you know they had enough money to maybe hire a tutor.\nAnd I found it interesting that his dad was depicted as a sweet, veterinarian (which takes an amount of studiousness) and instead of maybe trying to be like that he makes up this extreme version of what a man is that seems polar opposite of his dad. Odd choice. (Just as odd as smoking cigars which seems completely counter to his “natural” lifestyle.)\nAnd the brother he says he looked up to is never mentioned as far as where he is now. Maybe they left that out bec he was involved in the criminal enterprises mentioned. I don’t care enough about the guy to look it up, I just think it would have been interesting in the doc. It also would have been interesting if they addressed the children’s allergies. Was that all made up too? If not, in what way were they resolved? As someone who has never heard of him but has a masters degree in food science and applied nutrition I was interested and it was so bad I had to increase the speed halfway through just to finish it quickly. It could have easily been nutshelled into a ten minute YouTube video.",
        "upvotes": 222,
        "comments": 185,
        "media": null,
        "permalink": "/r/netflix/comments/1km7q0j/liver_king_what_did_i_just_watch/"
    },
    {
        "id": "1kmuk3s",
        "author": "ToonAdventure",
        "title": "Lost in Starlight | Official Trailer | Netflix [EN SUB]",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kmuk3s/lost_in_starlight_official_trailer_netflix_en_sub/"
    }
]