[
    {
        "id": "1k8w2vz",
        "author": "BunyipPouch",
        "title": "Upcoming /r/movies AMAs/Q&amp;As",
        "content": "",
        "upvotes": 7,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/a55b7mek6bxe1.png?auto=webp&amp;s=49b20434d100cc85bec6fb84750f2c22297259d3"
        },
        "permalink": "/r/movies/comments/1k8w2vz/upcoming_rmovies_amasqas/"
    },
    {
        "id": "1k79rk2",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (The Accountant 2 / The Legend of Ochi / Until Dawn) plus Throwback Discussions!",
        "content": "# New Theatrical Releases\n\n[The Accountant 2](https://old.reddit.com/r/movies/comments/1k79o5r/official_discussion_the_accountant_2_spoilers/?)\n\n[The Legend of Ochi](https://old.reddit.com/r/movies/comments/1k79o78/official_discussion_the_legend_of_ochi_spoilers/?)\n\n[Until Dawn](https://old.reddit.com/r/movies/comments/1k79o90/official_discussion_until_dawn_spoilers/?)\n\n\n# 25th Anniversary Throwback Discussion Threads\n\n[Love &amp; Basketball](https://old.reddit.com/r/movies/comments/1k79oaq/official_throwback_discussion_love_basketball/?)\n\n[The Virgin Suicides](https://old.reddit.com/r/movies/comments/1k79och/official_throwback_discussion_the_virgin_suicides/?)\n\n[U-571](https://old.reddit.com/r/movies/comments/1k79oe1/official_throwback_discussion_u571_spoilers/?)\n\n# Still in Theaters\n\n[Sinners](https://www.reddit.com/r/movies/comments/1k1tsoo/official_discussion_sinners_spoilers/?)\n\n[The Wedding Banquet](https://www.reddit.com/r/movies/comments/1k1tsqm/official_discussion_the_wedding_banquet_spoilers/?)\n\n[Warfare](https://www.reddit.com/r/movies/comments/1jwev1e/official_discussion_warfare_spoilers/)\n\n[The Amateur](https://www.reddit.com/r/movies/comments/1jwev63/official_discussion_the_amateur_spoilers/)\n\n[Drop](https://www.reddit.com/r/movies/comments/1jwevax/official_discussion_drop_spoilers/)\n\n[Freaky Tales](https://www.reddit.com/r/movies/comments/1jwevev/official_discussion_freaky_tales_spoilers/)\n\n[A Minecraft Movie](https://www.reddit.com/r/movies/comments/1jr0qff/official_discussion_a_minecraft_movie_spoilers/?)\n\n\n\n\n# On Streaming\n\n**I'm a bit behind on streaming releases so here's a bunch of them from the last few weeks**\n\n[Havoc](https://old.reddit.com/r/movies/comments/1k7zfyi/official_discussion_havoc_spoilers/?)\n\n[G20](https://old.reddit.com/r/movies/comments/1k7zfzp/official_discussion_g20_spoilers/?)\n\n[2073](https://old.reddit.com/r/movies/comments/1k7zg0y/official_discussion_2073_spoilers/?)\n\n[Holland](https://old.reddit.com/r/movies/comments/1k7zg30/official_discussion_holland_spoilers/?)",
        "upvotes": 26,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1k79rk2/official_discussion_megathread_the_accountant_2/"
    },
    {
        "id": "1k93p47",
        "author": "AbbreviationsAway500",
        "title": "Name Good Low-Budget Movies.",
        "content": "It doesn't matter what genre.  There have been some solid movies made on a shoestring budget.  What are your top low-budget movies?\n\nI'll open with the 1979 Mad Max.  It had a budget of 350K  and launched Mel Gibson's career and created a long running franchise.\n\nMy Second Offering is Rocky.  Only a 1 Million Dollar Budget and won the Oscar for the best picture and sent Stallone's career in orbit.",
        "upvotes": 268,
        "comments": 698,
        "media": null,
        "permalink": "/r/movies/comments/1k93p47/name_good_lowbudget_movies/"
    },
    {
        "id": "1k942gr",
        "author": "FilmWaffle-FilmForum",
        "title": "If you could change one movie ending, what would it be and why?",
        "content": "First one that comes to mind is Law Abiding Citizen. Why on earth they thought it would be a good idea to let the lawyer “win” is beyond me. I would have preferred both of them to go down in the midst of their own selfish, personal desires.\n\nIf you had the opportunity to change one movies ending, what would it be and why? ",
        "upvotes": 229,
        "comments": 574,
        "media": null,
        "permalink": "/r/movies/comments/1k942gr/if_you_could_change_one_movie_ending_what_would/"
    },
    {
        "id": "1k95ms2",
        "author": "ConsistentTadpole861",
        "title": "Overdone improv in comedies...",
        "content": "I'm sure there's a million posts about this but.  This thing where they stand there and say the same sort of improv joke over and over and over again. With ever increasing shock value or whatever. In an attempt to be shocking and wacky is horrible.\n\nLike when there's two characters insulting another character and they alternate and scale up the the same insult, like: \n\n\"You look like a turd\" \n\n\"You look like turd that all the other turds don't like because you live in your turd-mom's turd-basement.\"\n\n\"You look like a turd that banged another turd and then had a turd baby out of its butt.\"\n\nEtc... they usually do five or six. I kept it to three.  They keep scaling up the same joke but are still saying the same joke over and over.  Yes, he's looks like turd haha. Let's move on.  \n\nThese are things that they used to do in movies and then pick the best one and use that in the movie and now they just leave them all in there and it's pathetic. \n\nWatching hot tub time machine 2 and they they keep doing this and then they're actually making references to the fact that they keep doing this which doesn't actually make it any funnier.  Hanging a lamp on laziness and stupidity is not comedy. \n\nJudd Apatow turned this into the regular and it's horrible. He's done some good stuff and it was fine that he was doing this in his movies. We don't need it in every other comedy movie made since. It's what comprised about 65% of the 2016 Ghostbusters movie's dialogue.  \n\nI want well-written comedy, not a brainstorming session on film.",
        "upvotes": 105,
        "comments": 78,
        "media": null,
        "permalink": "/r/movies/comments/1k95ms2/overdone_improv_in_comedies/"
    },
    {
        "id": "1k8cfid",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for the 25th Anniversary Re-release of Kevin Smith’s ‘DOGMA’",
        "content": "",
        "upvotes": 13490,
        "comments": 496,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xt2e8nxmg6xe1.jpeg?auto=webp&amp;s=90e3b947bc38737b496179d7767cc64a11ccb8d1"
        },
        "permalink": "/r/movies/comments/1k8cfid/new_poster_for_the_25th_anniversary_rerelease_of/"
    },
    {
        "id": "1k95szv",
        "author": "Kudoshinichi0007",
        "title": "Perfect Days hit me harder than I expected...pure life lessons hidden in silence.",
        "content": "So today I watched *Perfect Days* (Japanese movie) and honestly...I didn't expect it to leave such a strong impact.\n\nAt first, it feels so simple... just a guy living his everyday life, cleaning toilets, listening to old cassettes, taking pictures of trees. But the more you watch, the more you realize how much peace and depth there is behind his routine.\n\nOne thing that stood out to me was how he smiles at the sky every morning. Like he’s genuinely grateful for another day. No rush, no complaints, just...existing with full heart.\n\nHe doesn’t talk much unless necessary, but when he does interact (like with his niece or that random guy he plays shadow games with), you can feel how much he enjoys human connection too. He’s not *avoiding* people...he just doesn't *need* noise to be happy.\n\nThere’s this beautiful bittersweetness. He’s not \"choosing loneliness\" in a sad way...it's more like, life took him down this path, and instead of fighting it, he embraced it with full acceptance. That’s powerful in today’s world where everyone feels pressure to chase something constantly.\n\nThe scene where his niece leaves... and he quietly cries...man, that hit different.  \nNot because he's weak or regretting, but because even the strongest hearts carry a little sadness somewhere deep.\n\nAnd that final drive...the way he smiles and then tears up while listening to music, that was pure *life itself*. Happiness, sadness, memories, gratitude...all flowing through him at once.\n\nHonestly gave me the same vibe I felt after watching Shawshank Redemption...the idea that freedom and peace are an inside job. No matter what life gives or takes away.\n\nOne of the most beautiful movies I’ve ever watched without trying to be \"loud\" about it. I liked the whole silent treatment vibe\n\nAlso, I’m surprised how not many people talk about this movie.\n\nWould love to hear what you guys felt after watching it.",
        "upvotes": 82,
        "comments": 16,
        "media": null,
        "permalink": "/r/movies/comments/1k95szv/perfect_days_hit_me_harder_than_i_expectedpure/"
    },
    {
        "id": "1k94i2l",
        "author": "Celestialstardust17",
        "title": "What are some courtroom/crime movies where we never actually find out if the person is guilty or innocent?",
        "content": "I really enjoy movies where it's almost irrelevant whether or not the person accused actually committed the crime, because the primary focus of the story is the trial itself (or the aftermath of the verdict). The only ones I can think of are Anatomy of a Fall, 12 Angry Men, and Shawshank Redemption. Are there any others besides these three that exist?\n\n**EDIT**: I misremembered Shawshank Redemption. My apologies.\n\nEdit: It doesn't need to fit crime in the traditional sense, since Doubt also fits this category.",
        "upvotes": 74,
        "comments": 162,
        "media": null,
        "permalink": "/r/movies/comments/1k94i2l/what_are_some_courtroomcrime_movies_where_we/"
    },
    {
        "id": "1k8jbf9",
        "author": "DamnThatsInsaneLol",
        "title": "‘Sinners’ Star Jack O’Connell Explains the Whole Irish-Vampire Thing; Talks Playing the Villain in ‘28 Years Later’",
        "content": "",
        "upvotes": 2189,
        "comments": 192,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mYaw1LhpIx-dQJKydgsBVVE2G7hksBTjS6FS5juqtxY.jpg?auto=webp&amp;s=31ffa3d1b102244f381adc585ad347c1072cb6c3"
        },
        "permalink": "/r/movies/comments/1k8jbf9/sinners_star_jack_oconnell_explains_the_whole/"
    },
    {
        "id": "1k95y34",
        "author": "Lokitusaborg",
        "title": "I forgot how much I love Wedding Crashers",
        "content": "Sometimes I can get stuck in a rut on movies. Lately movies have seemed to take themselves way too seriously and even comedies are dry and witless. I haven’t watched Wedding Crashers for years and I just fired it up this morning. I laughed so hard, it has just the right amount of awkward moments, fun dialogue, and Isla Fisher is absolutely amazing.\n\nNow I’m putting Meet the Parents and There’s Something About Mary on the re-watch agenda.",
        "upvotes": 49,
        "comments": 55,
        "media": null,
        "permalink": "/r/movies/comments/1k95y34/i_forgot_how_much_i_love_wedding_crashers/"
    },
    {
        "id": "1k8m01y",
        "author": "Wonderful_Draft8401",
        "title": "What’s the most visually stunning movie you’ve ever seen?",
        "content": "There are some movies that are just pure eye candy no matter when you watch them. Whether it’s the cinematography, the colors, the special effects, or just the way everything looks on screen, some films leave a lasting impression visually. What’s the most visually stunning movie you’ve ever seen, and what scenes or moments really stood out to you?\n",
        "upvotes": 1353,
        "comments": 2089,
        "media": null,
        "permalink": "/r/movies/comments/1k8m01y/whats_the_most_visually_stunning_movie_youve_ever/"
    },
    {
        "id": "1k8kptn",
        "author": "Ghostmoderator",
        "title": "What movie did you think people would talk about forever, but fell off?",
        "content": "Now there's those movies that just seem to be timeless that no matter how old they get, they always seem to come up in topics of discussion or get referenced or come up in to top Ten lists. Good examples of this are Back to the future, wizard of oz, and even a movie like office space. But what's a movie that you thought was gonna get talked about for a long time, but now nobody seems to talk about it at all. \n\nFor me it's gotta be Sin City, when I first saw that at the theater  I thought it was not even just a movie, that it was an experience. I thought it was just gonna be a movie that people talked about for ages. But I can't remember the last time I  heard Anyone talk about Sin City. And in fact, it's not even a movie I would wanna go back to, maybe it was just too mid 2000s.",
        "upvotes": 1554,
        "comments": 1057,
        "media": null,
        "permalink": "/r/movies/comments/1k8kptn/what_movie_did_you_think_people_would_talk_about/"
    },
    {
        "id": "1k8ta0g",
        "author": "ordrius098",
        "title": "The scene uncovering the truth of what Will Bill did to the twin children in \"The Green Mile\" is something else.",
        "content": "The bile coming up in my gut.... wow.... chills. Horrifying. Sam Rockwell nailed it as Wild Bill, Tom Hanks nailed at is Paul Edgecomb, Michael Clarke Duncan nailed at as John Coffey. Blood-curdling moment in a great film, to say the least. Even Stephen King said this movie was a phenomenal adaptation of his book.",
        "upvotes": 359,
        "comments": 48,
        "media": null,
        "permalink": "/r/movies/comments/1k8ta0g/the_scene_uncovering_the_truth_of_what_will_bill/"
    },
    {
        "id": "1k96ayw",
        "author": "BunyipPouch",
        "title": "‘The Wretched’ Sequel to Begin Shooting in September",
        "content": "",
        "upvotes": 30,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fZ7Pk5e2kAosSNPf1U4wXCGehQw5t5_rGn_P9qcJACU.jpg?auto=webp&amp;s=9da245bc7fadf33a51ff06f9ac2d94482ab489d9"
        },
        "permalink": "/r/movies/comments/1k96ayw/the_wretched_sequel_to_begin_shooting_in_september/"
    },
    {
        "id": "1k8xqxr",
        "author": "BigglesFlysUndone",
        "title": "Just discovered Tubi and I re-watched the 2011 movie \"Paul\"...So many laughs, so many re-discovered homages. It is just brilliant.",
        "content": "[https://en.wikipedia.org/wiki/Paul\\_(2011\\_film)](https://en.wikipedia.org/wiki/Paul_(2011_film))\n\nI love Sigourney Weaver as a villain. She does it so well! (Also in [*The Cabin in the Woods*](https://en.wikipedia.org/wiki/The_Cabin_in_the_Woods))\n\nBut when she says \"Step aside, f\\*g!\" to Nick Frost's nerd character...It just made me howl with laughter even though I've always identified as a gay nerd.\n\nEdit: (spoilers!) [https://youtu.be/DicS-Rxjt9I?t=48](https://youtu.be/DicS-Rxjt9I?t=48)\n\nThat's odd, isn't it? I'm still trying to process it.\n\nWhen the same term is used in other mainstream movies (like [*Teen Wolf*](https://en.wikipedia.org/wiki/Teen_Wolf)) it seems offensive.\n\nWhat do you think?\n\nAlso...Jason Bateman is a terrific actor, but I forgot how frickin' long he has been acting until I accidentally stopped on Pluto TV's \"Little House on the Prairie\" channel and there he was as a kid.",
        "upvotes": 105,
        "comments": 35,
        "media": null,
        "permalink": "/r/movies/comments/1k8xqxr/just_discovered_tubi_and_i_rewatched_the_2011/"
    },
    {
        "id": "1k96cf2",
        "author": "BunyipPouch",
        "title": "Bleecker Street Acquires Thriller ‘Relay’ Starring Riz Ahmed, Lily James and Sam Worthington from Director David Mackenzie ('Hell or High Water', 'Outlaw King') - Planning 2025 Theatrical Release",
        "content": "",
        "upvotes": 20,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/PKlzlt6hNChyG0_rZTSsgadRSmRM2uH54sIn4y0xgPU.jpg?auto=webp&amp;s=2df8bd8b8ff11d5029f53aadda68420e55194935"
        },
        "permalink": "/r/movies/comments/1k96cf2/bleecker_street_acquires_thriller_relay_starring/"
    },
    {
        "id": "1k92p7l",
        "author": "Interesting-Noise191",
        "title": "Moving out, feeling a bit scared, any films with a similar premise?",
        "content": "I live in a fairly quiet area, and I've gotten really comfortable here. I'm going to move to London soon, and I've never moved out before, so I'm scared about how I'll adjust to it all. I'm worried about how different people are going to be and how overwhelming it might get. If there's any films that touch on this, or maybe some 'coming-of-age' type of stuff, send it my way! Anything you think has an important message that's worth a watch.",
        "upvotes": 20,
        "comments": 53,
        "media": null,
        "permalink": "/r/movies/comments/1k92p7l/moving_out_feeling_a_bit_scared_any_films_with_a/"
    },
    {
        "id": "1k8cjse",
        "author": "theatlantic",
        "title": "Ryan Coogler channeled the things that terrify him into his new movie, “Sinners,” by David Sims",
        "content": "",
        "upvotes": 1392,
        "comments": 144,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MUcs8pZr2XeIF7-uY9WJXEDjy-ro3bCwYjpLjGF28SQ.jpg?auto=webp&amp;s=9e9971840240ac5c8192ff4711bdba386fbaa81f"
        },
        "permalink": "/r/movies/comments/1k8cjse/ryan_coogler_channeled_the_things_that_terrify/"
    },
    {
        "id": "1k8rirg",
        "author": "Mean_Lingonberry_355",
        "title": "What is an infuriating example of a protagonist not being believed?",
        "content": "Basically, the protagonist is not believed no matter how evidence they may try to look for, not even given the benefit of the doubt most of the time.   \nOrphan, where the husband John doesn't believe his wife Kate at all about Esther being a potential problem child. I might be skeptical as well, but I would give her the benefit of the doubt. It's not helped that he IMMEDIATELY prioritizes attention on his new adopted daughter and neglects his son, and even TELLS off Sister Abigail who visits to warn them of Esther's presence near questionable situations. They were obviously just trying to make him the cliched idiot horror character to advance the plot.",
        "upvotes": 165,
        "comments": 218,
        "media": null,
        "permalink": "/r/movies/comments/1k8rirg/what_is_an_infuriating_example_of_a_protagonist/"
    },
    {
        "id": "1k8osu7",
        "author": "ThrowAwayGayNJ",
        "title": "What's an under-appreciated twist?",
        "content": "What's a twist that's not talked about enough? I don't mean \"The Usual Suspects\" or \"The Sixth Sense\" but lesser known movies with a genuinely surprising twist(s) that you didn't see coming AND holds up on repeat viewings. For me it would be the end of FINAL DESTINATION 5 when you find out it's actually a prequel to the original. \n",
        "upvotes": 243,
        "comments": 451,
        "media": null,
        "permalink": "/r/movies/comments/1k8osu7/whats_an_underappreciated_twist/"
    },
    {
        "id": "1k979d6",
        "author": "greatfiction",
        "title": "Slow burners for you",
        "content": " Was makin a list of slow burners for myself, mostly unpopular thrillers (mostly), and decided to share.\n\n----------------\n\n* The Standoff at Sparrow Creek\n \n* Blue Ruin\n \n* Cold in July\n \n* Dragged Across Concrete\n \n* Brawl in Cell Block 99\n \n* Cop Car\n \n* A History of Violence\n \n* Blood Simple \n \n* Coherence \n \n* The Drop\n \n* Killing Them Softly\n \n* Nightcrawler  \n \n* The Rover  \n \n* The Invitation  \n \n* The Ninth Gate \n \n* Don't Breathe\n \n* Under the Silver Lake\n \n* No Way Out",
        "upvotes": 8,
        "comments": 15,
        "media": null,
        "permalink": "/r/movies/comments/1k979d6/slow_burners_for_you/"
    },
    {
        "id": "1k8hgik",
        "author": "ScottyBondo",
        "title": "Movie trope of bouncing a ball against the wall while in solitary confinement",
        "content": "Done originally and brilliantly in Great Escape, showing how Steve McQueen would take his ball and glove into the “hole” giving him something to keep from going mad. \n\nI’ve seen it redone so many times, my favorite was Saul Goodman, stuck in his cell phone store, sitting and bouncing a ball against the window. Great way to show the tedious boredom he was going through. I have seen it many many times I just can’t remember all the movies.\n\nWhat show shows the movies have you seen them do this in? ",
        "upvotes": 561,
        "comments": 112,
        "media": null,
        "permalink": "/r/movies/comments/1k8hgik/movie_trope_of_bouncing_a_ball_against_the_wall/"
    },
    {
        "id": "1k8o70x",
        "author": "amn70",
        "title": "Sean Astins Goonies audition.",
        "content": "",
        "upvotes": 206,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/B4TwUMTuo2cmzEQ4byRuMuCAtIviFg5RitOvv0I96K0.jpg?auto=webp&amp;s=bd6a96c62c9a6feb596f0c71708e81db9a74c9a4"
        },
        "permalink": "/r/movies/comments/1k8o70x/sean_astins_goonies_audition/"
    },
    {
        "id": "1k8too9",
        "author": "These_Feed_2616",
        "title": "8MM is a great thriller",
        "content": "I love this film, I’m a huge fan of both Nicolas Cage and Joaquin Phoenix, and they are both fantastic in it. Written by Andrew Kevin Walker, same guy who wrote Se7en, and you can definitely tell it’s the same guy. This film, is so dark and disturbing, but at the same time, so rewatchable. I love slowly watching Nicolas Cage solve the mystery of the snuff film. All the performances are great as well, James Gandolfini is so good in this film, he was such a great actor and made even small roles memorable. I love dark thrillers and this is one of my favorites!",
        "upvotes": 84,
        "comments": 23,
        "media": null,
        "permalink": "/r/movies/comments/1k8too9/8mm_is_a_great_thriller/"
    },
    {
        "id": "1k8j1bo",
        "author": "Wonderful_Draft8401",
        "title": "What movie do you think has the best ending of all time?",
        "content": "It might sound a bit cliche because of how popular it is, but I love Fight Club. I’m especially drawn to the psychological depth and the poetic  way the story is written. The movie isn’t just about rebellion or violence, it dives deep into identity, consumerism, and the search for meaning in a world that feels empty. Every time I watch it, I find something new to appreciate.",
        "upvotes": 295,
        "comments": 833,
        "media": null,
        "permalink": "/r/movies/comments/1k8j1bo/what_movie_do_you_think_has_the_best_ending_of/"
    },
    {
        "id": "1k8g45w",
        "author": "BunyipPouch",
        "title": "Poster for Sci-Fi Adventure 'Watch the Skies' - A rebellious teenager who believes her missing father was abducted by aliens joins forces with a quirky UFO club of endearing misfits. They embark on a high-stakes adventure that defies the law and challenges the very fabric of reality.",
        "content": "",
        "upvotes": 400,
        "comments": 83,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0wx57yzua7xe1.jpeg?auto=webp&amp;s=de4015b0d3e5c3e8a285e6e9ae89af155bd0299f"
        },
        "permalink": "/r/movies/comments/1k8g45w/poster_for_scifi_adventure_watch_the_skies_a/"
    },
    {
        "id": "1k90a77",
        "author": "icedtea027",
        "title": "What movie do you think has the best opening scene or dialogue?",
        "content": "Could be any movie of all time! intrigued to watch more reccs! Could think of a few - Goodfellas, Star Wars, some of the sequences of Pixar movies like Up, Disney ones like Lion King…. Feel free to add on to the list! \n\nAlways enamoured by the work that goes into these openings - although Marvel has some good lead ups, personally think only the title portion was cool to see, no super huge impact. What do you think?",
        "upvotes": 12,
        "comments": 136,
        "media": null,
        "permalink": "/r/movies/comments/1k90a77/what_movie_do_you_think_has_the_best_opening/"
    },
    {
        "id": "1k98cn6",
        "author": "Deep_Selection_3069",
        "title": "What Instrument plays Agape?! In If Beale Street Could Talk",
        "content": "Hello all! I was just wondering if anyone knows what instrument and musician is playing in the piece Agape by Nicholas Britell written for the film If Beale Street Could Talk.\n\nI have searched the web near and far and still do not know! It’s a beautiful piece of music and I’d love to find out. Current guesses are soprano saxophone or piccolo trumpet. Please enlighten me!!!",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1k98cn6/what_instrument_plays_agape_in_if_beale_street/"
    },
    {
        "id": "1k8mego",
        "author": "Wonderful_Draft8401",
        "title": "What movie has stuck with you the longest after watching it?",
        "content": "Some movies end and you move on but others stick in your mind for days, weeks, or even years. Whether it’s the powerful storytelling, breathtaking visuals, or unforgettable characters. What made it stand out for you, was it the ending, a particular scene, or the overall theme/message? and how has it stayed with you since?",
        "upvotes": 110,
        "comments": 326,
        "media": null,
        "permalink": "/r/movies/comments/1k8mego/what_movie_has_stuck_with_you_the_longest_after/"
    },
    {
        "id": "1k7uygz",
        "author": "MarvelsGrantMan136",
        "title": "Ousted Paramount CEO Bob Bakish Received $69.3 Million in Severance",
        "content": "",
        "upvotes": 10553,
        "comments": 615,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/awnkfIx3JhVKiAtxSt3E-CPwlFuu6XS4hrhpNMZN3Yc.jpg?auto=webp&amp;s=1a860a780172383c1054a64dc26a3b99179ed51d"
        },
        "permalink": "/r/movies/comments/1k7uygz/ousted_paramount_ceo_bob_bakish_received_693/"
    },
    {
        "id": "1k8r6sk",
        "author": "Present_Cry1268",
        "title": "What is your favourite movie poster of all time?",
        "content": "I've just moved into a new apartment with my wife and want to jazz it up with some cool movie posters. Open to recommendations on iconic ones that stand out. Currently leaning towards the Matrix and A New Hope but very open to suggestions!! Other great ones I can think of are Pulp Fiction, Jaws and Goodfellas. Thanks!",
        "upvotes": 31,
        "comments": 163,
        "media": null,
        "permalink": "/r/movies/comments/1k8r6sk/what_is_your_favourite_movie_poster_of_all_time/"
    },
    {
        "id": "1k8s6rg",
        "author": "Significant-Basket76",
        "title": "Bullet Train Explosion is the speed 2 I wish we got in the 90s.",
        "content": "This movie is so good and so fun. It's the 90s type action movie that I enjoy. In the 1990s we got Speed. Dumb, fun movie. And then they followed that up with speed 2. Such a disappointment. This movie that takes place in Japan, reminds me of that type of 90s over the top, bad plot, fun movie. The only thing the movie is missing is a one liner. ",
        "upvotes": 27,
        "comments": 21,
        "media": null,
        "permalink": "/r/movies/comments/1k8s6rg/bullet_train_explosion_is_the_speed_2_i_wish_we/"
    }
]