[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 10,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 501,
        "comments": 3619,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1nawp65",
        "author": "AlanisBeauty",
        "title": "I’ve lost three snacks, one sock, and approximately an hour of my soul scrolling Netflix.",
        "content": "I need a show or movie so addictive it’ll make me forget I have a job, friends, and basic human responsibilities. Something that pulls me in, traps me on my couch, and convinces me that showering and eating are optional. Give me the content that will ruin my productivity, devour my free time, and leave me questioning all my life choices—but in the best way possible.",
        "upvotes": 349,
        "comments": 189,
        "media": null,
        "permalink": "/r/netflix/comments/1nawp65/ive_lost_three_snacks_one_sock_and_approximately/"
    },
    {
        "id": "1nbcr1b",
        "author": "Best_Blake",
        "title": "The one year anniversary of Kaos' cancellation is in a month and I'm still sad about it :(",
        "content": "I miss this show. Literally my favorite show of all time and it's just cancelled I'll never get to know what happens. The writing was sooooo clever and the cinematography and colors were beautiful. I wish I could have it back but it's hard for me to rewatch without crying because I know I'll never find out what happens.",
        "upvotes": 26,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1nbcr1b/the_one_year_anniversary_of_kaos_cancellation_is/"
    },
    {
        "id": "1nat1a2",
        "author": "TheMirrorUS",
        "title": "All the Netflix shows canceled after one season in 2025 including The Waterfront",
        "content": "",
        "upvotes": 183,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1nat1a2/all_the_netflix_shows_canceled_after_one_season/"
    },
    {
        "id": "1nb5h7m",
        "author": "snobodyknows",
        "title": "Something fishy with the Dr Wilkerson episode of Love Con Revenge",
        "content": "Just watched the episode on Shereza and Dr Wilkerson, so I decided to look up the reviews of the Best U Now clinic myself and it seems like Shereza was WAY more involved in the clinic than Netflix shows on screen. There are multiple complaints that actually cite her specifically and her interactions with patients.\n\nI’m not saying that she herself didn’t get scammed by Wilkerson, but it seems she was clearly way more “in the know” then she says (in the episode she just says the business “took a downturn” or something even thought there are years of reviews basically showing the entire business itself was a borderline scam).\n\nAlso, Cecile and Brianne say they “investigated the reviews” on his clinics yet they somehow completely missed these reviews?? And then they were “shocked” when they learned someone died there from a doctor that worked there even though it is brought up in multiple reviews that someone died at the clinic??",
        "upvotes": 23,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1nb5h7m/something_fishy_with_the_dr_wilkerson_episode_of/"
    },
    {
        "id": "1nbenib",
        "author": "GulfStormRacer",
        "title": "Why Do So Many People Like \"Wild, Wild Country\"?",
        "content": "I'm almost through the second episode and so far it's like a bunch of people with main-character syndrome. \"We were this, we were that, we were building stuff, we were special, blah blah.\" Do I need to keep watching for something to \\*happen\\*? ",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nbenib/why_do_so_many_people_like_wild_wild_country/"
    },
    {
        "id": "1navlwb",
        "author": "Witty-Swing3196",
        "title": "give really good recommendations worth watching.",
        "content": "hey everyone,\ni just got a new netflix subscription and i wanna make the most out of it. can you all recommend me the must-watch movies and series (any genre) that i should definitely not miss? basically the ones worth the money and give the best value of the subscription. also, if there are some shows or movies that are considered “must watch in order” kinda stuff, let me know too. thanks.",
        "upvotes": 53,
        "comments": 110,
        "media": null,
        "permalink": "/r/netflix/comments/1navlwb/give_really_good_recommendations_worth_watching/"
    },
    {
        "id": "1nayoek",
        "author": "peoplemagazine",
        "title": "Julie Andrews Wins 2025 Emmy for Bridgerton Voice-Over Performance as Lady Whistledown After 3 Previous Nominations",
        "content": "",
        "upvotes": 32,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nayoek/julie_andrews_wins_2025_emmy_for_bridgerton/"
    },
    {
        "id": "1nbdezd",
        "author": "BillSuperb9404",
        "title": "Recommendations",
        "content": "Honestly, I’ve noticed Netflix doesn’t have as many classic or top-tier comedy series/movies as it used to. Whenever I search, I end up finding titles they don’t even have anymore. So, can anyone suggest some must-watch Netflix shows or movies? I’m especially looking for comedy, or mystery or Any recommendations u have would be great!",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nbdezd/recommendations/"
    },
    {
        "id": "1nb8mpk",
        "author": "leijido",
        "title": "Last Samurai Standing Teaser",
        "content": "",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nb8mpk/last_samurai_standing_teaser/"
    },
    {
        "id": "1nb9kq0",
        "author": "bigguys45s",
        "title": "Any thoughts/ opinions on: “Bad Influence: The Dark Side of Social Media Influencers”?",
        "content": "I honestly just feel absolutely terrible and horrible for the kid/ teenage victims of these disgusting adult acts/ actions. But than again, it’s also their parents/ caregivers responsibility/ cares in the first place as well. \n\nIt was a very interesting, if also (obviously) shocking and disturbing at times documentary as well. Take care of your kids, parents! And watch what they do on social media/ gaming networks/ platforms!",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nb9kq0/any_thoughts_opinions_on_bad_influence_the_dark/"
    },
    {
        "id": "1nb7f68",
        "author": "mamamuse71",
        "title": "Cheer me up",
        "content": "My senior doggy with heart failure tried to die yesterday. Vet recommended euthanasia. I left AMA and doggy is doing ok but I’m exhausted and stressed and need to stay home with the pup to watch him. Having a cozy couch day. Give me your best cheery/heartwarmjng/non stressful Sunday afternoon shows or movies 🍿 ",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1nb7f68/cheer_me_up/"
    },
    {
        "id": "1nam8vf",
        "author": "_PonchoMan_",
        "title": "I Know This Is a Bit Old, But I Hate The New Layout/Setup for Netflix.",
        "content": "The titles and covers are so much larger, and I can't see as many series and/or movies that I used to. Plus, instead of the handy way of just going to the left for the options like Shows, Movies, and Search, I got a scroll all the way back up to select it. It's just a bit annoying. Why did they even do this? Did they think it would be a good change? It was perfect as is 😭 they somehow managed to make it worse in most/all aspects.\n\nEdit: my stupid brain just figured out that using \"back\" auto selects the search bar for me. Still mad about the larger titles tho lmao",
        "upvotes": 73,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1nam8vf/i_know_this_is_a_bit_old_but_i_hate_the_new/"
    },
    {
        "id": "1nbf05a",
        "author": "Covenant1138",
        "title": "Ugh. NZ Netflix suuuuucks",
        "content": "NZ Netflix sucks!\n\nThey don't even have the 2nd season of Yellowjackets!\n\nI know there are always region limitations but the selection in NZ looks like it might be something out of North Korea.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nbf05a/ugh_nz_netflix_suuuuucks/"
    },
    {
        "id": "1nb5lk1",
        "author": "cassthebadass13",
        "title": "Sync problem",
        "content": "My Netflix doesn’t sync to from my iPad to my TV. It doesn’t pick up on one device where I left off on the other. I’ve logged out and logged back in. Anyone having this issue?",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nb5lk1/sync_problem/"
    },
    {
        "id": "1napjqs",
        "author": "Financial-Nail3191",
        "title": "How do I remove a user without logging out everyone else?",
        "content": "Just found out my ex best friend has been leeching off my Netflix account for years and I’m pissed. She doesn’t have an account, she is logged in but watches stuff on my account (so the stuff she watches shows up on my account) I gave her the password in secret and I can’t tell my parents to disable/change the password because they would be pissed if they knew I gave the pass to other people. How do I boot her out? Any help appreciated, thanks.",
        "upvotes": 23,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1napjqs/how_do_i_remove_a_user_without_logging_out/"
    },
    {
        "id": "1nb2qnp",
        "author": "Future_Tough5072",
        "title": "Recommend me shows!",
        "content": "I’m really into a lot of limited series stuff, but I don’t mind something longer with multiple seasons. Here’s some things I’ve watched\n\n-Ginny and Georgia \n-Wednesday\n-Safe\n-The Haunting of Bly Manor \n-Never Have I Ever\n-Sweet Magnolias (haven’t finished, watch it passively) \n-The watcher (started, not sure if I’ll finish it) \n-The Midnight Club\n-Stranger things\n\n\nBonus points if it’s horror! I also like coming of age dramas \n",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1nb2qnp/recommend_me_shows/"
    },
    {
        "id": "1natg7s",
        "author": "PakistaniSenpai",
        "title": "Can't find One Piece (season 1) on Netflix Singapore?",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1natg7s/cant_find_one_piece_season_1_on_netflix_singapore/"
    },
    {
        "id": "1nb75kh",
        "author": "JustCallMeMambo",
        "title": "why is George Mullen’s list of prescriptions suspicious?",
        "content": "first of all, i know this question probably has a better home on some other corner of Reddit, so apologies up front. &gt;!i’m watching Zero Day and in Ep. 3, Mullen is looking over his list of medications and the insinuation seems to be that that there’s something off about it. i recognize almost all of these medications because my dad heart disease and high cholesterol. is this just a red herring?!&lt;",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nb75kh/why_is_george_mullens_list_of_prescriptions/"
    },
    {
        "id": "1na08er",
        "author": "Putrid_Care_9888",
        "title": "wednesday jenna ortega portrait, by me",
        "content": "",
        "upvotes": 336,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1na08er/wednesday_jenna_ortega_portrait_by_me/"
    },
    {
        "id": "1na7bk1",
        "author": "SlowAerie3866",
        "title": "Good murder suspense, thriller shows to watch?",
        "content": "Recently watched the Residence, Dept Q, Untamed which were good shows. Any other shows like these? I also tried watching the hunting wives and that show was not good at all.\n\nThank you all for recommending great shows that i didn’t even know existed! ",
        "upvotes": 113,
        "comments": 183,
        "media": null,
        "permalink": "/r/netflix/comments/1na7bk1/good_murder_suspense_thriller_shows_to_watch/"
    },
    {
        "id": "1nb2yt3",
        "author": "littleL37",
        "title": "(UK) The Gathering",
        "content": "Just finished watching this and curious what others thoughts are. I liked it, liked the characters but feel it was possibly a little too much going on meaning the actual event and aftermath seemed very rushed? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nb2yt3/uk_the_gathering/"
    },
    {
        "id": "1nb2tox",
        "author": "Diligent_Gift_9281",
        "title": "noticed a weird thing with the iphone app",
        "content": "so every single time i boot up a show on netflix, if my wifi is on it will try to automatically connect to my tv. i do absolutely nothing to tell netflix i want the picture to be displayed on my tv yet it does it anyways. i just click on my profile, click on a show and then it tries to connect which can be problem if im doing something in an xbox game while trying to put a show on in the background. \n\njust wondering how the hell i get this stop. its really not that much of a quantifiable problem but i really dont like the idea of the technology i pay for disobeying me. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nb2tox/noticed_a_weird_thing_with_the_iphone_app/"
    },
    {
        "id": "1nb2qvt",
        "author": "Puzzleheaded_Mix1658",
        "title": "Too many screen",
        "content": "I was watching last 2 episode of series and suddenly now in middle of it keep saying someone else is watching and i should upgrade. I have personal one screen plan even (though I do share it). Everyone in my family is sleeping it's 1 am rn. Who else can be watching ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nb2qvt/too_many_screen/"
    },
    {
        "id": "1namn3x",
        "author": "RudeGate1791",
        "title": "Movies/Series to watch on a long flight!",
        "content": "hi! I have a flight of around 7 hours upcoming soon. \n\nI don't like long flights that much, and I can't sleep that well on flights so, can you guys please recommend some good movies or series that I can watch on flight?\n\nI like anime (slice of life, maybe a bit of romcom, action like DS, JJK..)...\n\nNormal movies/series which are interesting and can hook you from the beginning...(Not horror or tragedies please)\n\nThank you. ",
        "upvotes": 10,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1namn3x/moviesseries_to_watch_on_a_long_flight/"
    },
    {
        "id": "1nbeabq",
        "author": "aalibey",
        "title": "To watch or not to watch: Adolescence TV series",
        "content": "Here is a very short recommendation:\nIf you're a parent, it's a good show.\nIf you're not a parent, it's an absolute shit show.\nThe actors were good but that's all about it.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nbeabq/to_watch_or_not_to_watch_adolescence_tv_series/"
    },
    {
        "id": "1nb0kqs",
        "author": "googler1994",
        "title": "Warning: Netflix locking accounts based on location/currency mismatch — even if prepaid!",
        "content": "Hey everyone,\n\njust a heads-up: Netflix has figured out when people are paying in Turkish Lira without actually being in Turkey. If your location doesn’t match, they’re now deactivating accounts — even if you’ve already paid in advance.\n\nI did it for years and now they blocked my account  (prepaid for a couple of months via gift card). Now I need to pay again in Euro or it does not work anymore. Money is lost.\n\nThis is hilarious when someone is a world traveller like me. Do I need to pay in every single country again?!\n\nJust wanted to share this so nobody gets blindsided.\n\nCustomer service just said: „Sry we are blocking all those accounts and sry for the inconvenience. Just pay again in the currency of your current location“",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nb0kqs/warning_netflix_locking_accounts_based_on/"
    },
    {
        "id": "1nay0eu",
        "author": "Srsovrchl",
        "title": "Is the one piece live action good?",
        "content": "As someone who never watches anime and probably never will, is the one piece live action good? I've seen it has got good ratings but what i mean to ask is that  is the story/show good for people who don't have any clue about what one piece is or is it just appealing for the anime fans? I saw the trailer and i can't decide whether to watch it or not..Any reviews from non anime fans would be appreciated :)",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nay0eu/is_the_one_piece_live_action_good/"
    },
    {
        "id": "1nax2ld",
        "author": "LMysterio",
        "title": "Looking for a show I watched",
        "content": "Around 2018/2019 I watched a supernatural, eerie anime. I can't remember the name, but I know that there was a character who got crushed by a wooden panel with his dog and became half dog-half man. And some old guy who may have been an older version of a certain character that the mc kept meeting in a gas station store. There also may have been a gumball machine by a tree. On Netflix. Hope you can help.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nax2ld/looking_for_a_show_i_watched/"
    },
    {
        "id": "1naicd5",
        "author": "Smooth-Extent3897",
        "title": "Does anyone else lock their profile because of their parents?",
        "content": "My parents frequently, I guess more specifically my dad, doesn't really care what profile he uses to watch his things, and because I have set up most of our streaming services for our house my profile comes up first. He frequently uses mine even when he has his own and it messes up my show and movie algorithm. I locked them. He can no longer access my profiles. He grumbled about it at first but accepted my reasoning surprisingly quick. It's not like we never use my account at all to watch things as a family but it was a little annoying that his movie suggestions took over my profile. ",
        "upvotes": 12,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1naicd5/does_anyone_else_lock_their_profile_because_of/"
    },
    {
        "id": "1nan50u",
        "author": "bingbongsf",
        "title": "The Residence: Bruce &amp; Elsyie",
        "content": "I may have been missing something, but in the final episode, just before Cupp could identify Lily as the killer, Lily spins a whole tale about protecting Bruce and Elsyie, wouldn’t Bruce &amp; Elsyie then immediately know she was the killer, as she was making up this story that they know is not true?",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nan50u/the_residence_bruce_elsyie/"
    }
]