[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 13,
        "comments": 85,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 65,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1lh9ft8",
        "author": "Less_Manufacturer218",
        "title": "Dept. Q on Netflix best show",
        "content": "One of the best shows I’ve seen in a while. Characters, plot and ending all really stuck with me. Almost as much as Young Wallander. Hoping for a second season. ",
        "upvotes": 239,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1lh9ft8/dept_q_on_netflix_best_show/"
    },
    {
        "id": "1lhef2v",
        "author": "Creative-Ad-1363",
        "title": "Sweet Bobby",
        "content": "I'm re-watching Sweet Bobby and I'm still as shocked as the first time seeing it.\n\nWhat I'm seeing in the show this time around is how Kirat fell into an unverified fantasy so easily. We live in a romance obsessed culture, and some people will ignore hard facts and red flags to claim a relationship. Our obsession with romance is what makes women such easy victims to predatory personalities. \n\nMy hope is for women especially in marriage obsessed cultures, is to wake up and realize they're more worthy endeavors in life. It's so silly and I'm just so sooo sad for women like Kirat who are stigmatized for being single, and through their desperation are easily fooled.",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lhef2v/sweet_bobby/"
    },
    {
        "id": "1lhhj9a",
        "author": "Santon-Koel",
        "title": "Thoughts on boeing documentary on netflix after boeing crash in india",
        "content": "People, politicians, flight crew, airlines saw the documentary. Still they chose or allowed boeing to run? What's happening. Are human life not valuable?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lhhj9a/thoughts_on_boeing_documentary_on_netflix_after/"
    },
    {
        "id": "1lhj8g6",
        "author": "Odd_Level9850",
        "title": "Wtf is up with the new TV layout?",
        "content": "I just turned on my tv and saw that the entire layout changed. There’s no new and upcoming section, you can only see a few titles at a time and it’s scattered all over the place, categories are harder to find and it just overall feels uncomfortable and uneasy to use. Netflix had the best UI compared to other streaming services but now it seems like they have the worst. Is this going to be a permanent change? Is so, wtf are they thinking? I’m on the verge of canceling my subscription.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lhj8g6/wtf_is_up_with_the_new_tv_layout/"
    },
    {
        "id": "1lhj0fp",
        "author": "No-Opportunity-8964",
        "title": "KPop Demon Hunters could have worked as a Mini-Series",
        "content": "Yeah after watching the movie... I love it to bits! The music, the characters, I could instantly rewatch it again :D \n\nBut it also felt rushed. There is so much plot potential, but it seemed like they didn't really had the time to go in depth with the different characters.. \n\nWhile the Movie was good, I think it would have been better as a mini series, like with 5-6 Episodes. To give those deep plots more screentime.\n\nActually when I first heared about it I thought it would become an Anime like Series. \n\nWhat do you guys think? ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lhj0fp/kpop_demon_hunters_could_have_worked_as_a/"
    },
    {
        "id": "1lhisqf",
        "author": "SnapSketchStudios",
        "title": "Intresting",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lhisqf/intresting/"
    },
    {
        "id": "1lhiepr",
        "author": "CrikeyKillz",
        "title": "Why did the Monsters true-crime movie series get so much backlash?",
        "content": "I thought the Dahmer series was done wonderfully, I feel it did a good job at telling the story while still being entertaining to the viewer. I agree on the other hand that the Lyle and Erik Menendez series was kind of weird trying to push the incest narrative which made it seem like a shitty fan fiction in some parts but that aside it felt like it was done somewhat well. Can anybody give me some insight?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lhiepr/why_did_the_monsters_truecrime_movie_series_get/"
    },
    {
        "id": "1lh3m7t",
        "author": "adiosamigo15",
        "title": "Prepping for a Product Interview — What Can Netflix Do Better or Add?",
        "content": "Hey everyone! I’m currently prepping for a product management interview and would love to get some outside perspectives.\n\nSpecifically, I’m curious — what do you think Netflix could be doing better? Are there features you wish they had or pain points you’ve experienced using the platform? Anything you’ve seen competitors doing that you think Netflix should adopt?\n\nWould really appreciate your insights — thanks in advance!",
        "upvotes": 6,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1lh3m7t/prepping_for_a_product_interview_what_can_netflix/"
    },
    {
        "id": "1lh5q00",
        "author": "Character_Map9480",
        "title": "\"new season coming soon\" how long until release",
        "content": "hi! I was just wondering how long netflix usually takes to release when a show has \"new season coming soon\" on it. \n\nspecifically i'm interested in yellowjackets season 2. i figured if netflix will release season two within the next few weeks it probably isn't worth it to sign up for another streaming service rn.",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lh5q00/new_season_coming_soon_how_long_until_release/"
    },
    {
        "id": "1lhgcl5",
        "author": "_AvgCanadianEh_",
        "title": "Audio Cutting Out",
        "content": "Ok well im gonna post this again since over 1k people looked at it but said nothing. There were even some down votes for no reason. I'm just asking a question and need a little help\n\nSo here is what I am using. LG C1 Oled smart TV. Got Netflix downloaded on it. And for audio, I have a pair of Sony Wireless Headphones connected through bluetooth to my tv\n\nMy issue is, everytime I watch Netflix with this exact set up, the audio always cuts out while whatever im watching keeps playing. Ive looked it up before and something about turning off 5.1 surround or something, but thats not even an option. the only options are subtitles and audio language. Thats all. I need to know why this is happening and if there is a fix please 🙏 😭",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lhgcl5/audio_cutting_out/"
    },
    {
        "id": "1lh3957",
        "author": "5256chuck",
        "title": "Justin Willman: Magic Lover",
        "content": "This special shines (you'll catch the reference after you watch)! Serendipity brought me to it, I suppose (you'll catch that ref, too). This is a very, very good, funny and entertaining magic act/comedy show. Looking forward to seeing more from Justin. And also waiting to see him get zip code stumped, finally. That's a pretty amazing talent, in itself. There are a lot of surprising laughs. Do yourself a favor.",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lh3957/justin_willman_magic_lover/"
    },
    {
        "id": "1lhbqgo",
        "author": "ilovebeardsss",
        "title": "Murder on the Internet - WOW.",
        "content": "So I've just started watching this series... literally less than 10 minutes into episode 1 and this so-called psychologist is something else. Did anyone else find her incredibly irritating? She came across as being rather uneducated and very presumptuous, neither of which are great traits in a psychologist. \n\nFirst of all, she states that the guy being paralytic was intentional because he wanted to make his date vulnerable (what?! He was the drunk one  not her) or because he wanted some dutch courage so that he could get away with his evil plan. Surely if it was all part of his plan, he wouldn't have gotten black out drunk? \n\nSecondly, she said that him having pre-booked a hotel is a clear sign that he wanted to control the night and has a sense of ownership. There are SO many other reasons as to why someone might book a hotel. \n\nI think what irritated me most (so far) is that she claimed that people with EUPD like Carl are often violent and spontaneous. That's just not true. I have EUPD (aka BPD) and these kind of claims can be SO damaging. I know several others with a similar diagnoses, none of whom are violent or spontaneous. I wouldn't hurt a fly, and schedules are everything. Saying he was undoubtedly dangerous because of his EUPD diagnosis was ridiculous. As if what he did was down to his personality disorder. \n\nDon't get me wrong, the guy is absolute scum and I really feel for Katie's family. This psychologist though... I'd love to know more about her credentials. ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lhbqgo/murder_on_the_internet_wow/"
    },
    {
        "id": "1lhfnqa",
        "author": "Bulky-Employer-1191",
        "title": "Naked Gun",
        "content": "This was new on netflix earlier this week, did it just disappear now?  Was going to watch it this weekend and i didn't think Netflix would remove it that fast. Is this going to be common with movies and shows now, only there for 2 days?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lhfnqa/naked_gun/"
    },
    {
        "id": "1lhfa6g",
        "author": "PunkKittenNails",
        "title": "Animation treated so poorly when it pulls lots of views",
        "content": "With the consensus that animation is just as popular as movies and regular shows, why are streaming companies still treating animation like it's a niche category when in actuality it's only going to grow in popularity as Gen z and aplha get older?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lhfa6g/animation_treated_so_poorly_when_it_pulls_lots_of/"
    },
    {
        "id": "1lhf3zw",
        "author": "MutedIndependent1236",
        "title": "America’s Sweethearts Dallas Cowboys and Body Dysmorphia ???",
        "content": "Is this documentary promoting or trying to shed light on body dysmorphia? \n\nThis organization really gives me cult vibes and it feels like this should be illegal. Either way - crazy respect for these girls, their discipline and dedication is out of this world ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lhf3zw/americas_sweethearts_dallas_cowboys_and_body/"
    },
    {
        "id": "1lh8413",
        "author": "UniqueEnigma121",
        "title": "Your Account on hold email. “Just two day left to easily restart Netflix”",
        "content": "What will happen after two days if I don’t add a payment method or add credit via gift card. \n\nThis is for my Turkish Netflix account, which I was hoping to use for a month every three months. As I don’t need Netflix every month &amp; would like to dip back in when I want. ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lh8413/your_account_on_hold_email_just_two_day_left_to/"
    },
    {
        "id": "1lgy4bx",
        "author": "towel_hair",
        "title": "Netflix automatically updated my payment information without my consent",
        "content": "4:17am Netflix emailed me three times. The first two times saying my payment information was updated. Both times using old card information. The third email saying my payment information was updated using my brand new card information. Everything was correct including expiration. How could this be possible? My card is not compromised. \n\nWell I learned that Netflix utilizes something called Visa Acount updater. This is a service offered by VISA card Issuers(your bank). They claim it’s to reduce customers calling in to update payment information.\n\nTo be fair, I DO I want my Netflix subscription to continue, but I had no clue this was even a thing. ",
        "upvotes": 10,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lgy4bx/netflix_automatically_updated_my_payment/"
    },
    {
        "id": "1lgu3bp",
        "author": "Select-Effort8004",
        "title": "Netflix Sirens - Staff celebrating Simone’s departure",
        "content": "I didn’t understand why the staff would celebrate Simone being fired. But now that I’m done watching, I wondered if they were glad for her that she was going to be free. They made fun of her, but did they not like her? Would they be better off if she were gone? Their positions were another facet of the show, hating Kiki, clearly not respecting Peter (Jose’s “Here we go again”), but a decent job with a famous employer and surely getting paid well.   \n\nSo why was Simone’s departure celebrated?",
        "upvotes": 15,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1lgu3bp/netflix_sirens_staff_celebrating_simones_departure/"
    },
    {
        "id": "1lh41pz",
        "author": "Mysterious_Menu2481",
        "title": "Why No Westerns or Concerts?",
        "content": "Is it just my poor searching - or it is true? Why don't I see any western movies or a \"Westerns\" category in category search or see any Live concerts? Does anyone experience the same thing? Can anyone guess why that is?",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lh41pz/why_no_westerns_or_concerts/"
    },
    {
        "id": "1lgb1dl",
        "author": "ER-841",
        "title": "Mindhunter Star Reveals How the Netflix Series Might Finally Return 6 Years Later",
        "content": "Mindhunter was in my opinion one of the best series Netflix ever produced. So when I learned it was cancelled after the second season it was such a disappointment. In this article, they discuss how the series might return in the form of movies. I think this is really great. David Fincher would be returning with the same cast theoretically if he likes the scripts… Fingers crossed. 🤞",
        "upvotes": 276,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1lgb1dl/mindhunter_star_reveals_how_the_netflix_series/"
    },
    {
        "id": "1lghjht",
        "author": "suhpriseshawtyyy_",
        "title": "What did you think about the AstroWorld documentary?",
        "content": "Just watched the documentary yesterday and I’m honestly speechless. So many things throughout didn’t sit right with me. So much led up to the tragedy, things that could have been prevented from the very beginning. The complete lack of accountability was one of the most unsettling parts. And the lack of awareness or care for his fans, who he clearly saw struggling in the crowd…Just an insane documentary overall. No words.",
        "upvotes": 77,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1lghjht/what_did_you_think_about_the_astroworld/"
    },
    {
        "id": "1lh2jjb",
        "author": "Eastern_Time1373",
        "title": "Kpop demon Hunter Promotional Truck",
        "content": "   Ran into a Netflix truck doing promotional work for kpop demon hunters (great movie!) says there may be a prize if we share the hashtag. Is there an actual prize lol? A lady at the truck took a picture of me, was wondering where they might post things like this at.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lh2jjb/kpop_demon_hunter_promotional_truck/"
    },
    {
        "id": "1lh52gh",
        "author": "Ariolace",
        "title": "K-pop Demon Hunters Music Help",
        "content": "Hey everyone, just finished watching K-Pop Demon Hunters and I absolutely loved it. There's a background music that plays at the very start of the movie when Celine is explaining the origin and history of the Hunters and the Honmoon. I can't seem to find it in the offical music list for the show but maybe I just missed it. Can someone help me?  \n\nThe music starts around 0:54 and lasts till around 02:04. Thank you very much! ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lh52gh/kpop_demon_hunters_music_help/"
    },
    {
        "id": "1lg0bvl",
        "author": "MelodyHearts678",
        "title": "What do you guys think of K-Pop Demon Hunters?",
        "content": "Now that it’s out and I watched the movie.\n\nI must personally say that I love it so freaking much!\n\nAnd consider it as my all time favourite movie of 2025\n\nPlus just to make sure that you also watched it, what’s your favourite song from that movie.\n\nFor me I could only pick three because I love every single songs from it.\n\nAnd that would be: Golden, Takedown and Free.",
        "upvotes": 424,
        "comments": 270,
        "media": null,
        "permalink": "/r/netflix/comments/1lg0bvl/what_do_you_guys_think_of_kpop_demon_hunters/"
    },
    {
        "id": "1lhbgv5",
        "author": "namedmypupwarren2020",
        "title": "Anyone else feel like some recent Netflix originals were made without any passion?",
        "content": "Just finished *DCC* Season 2 and the newest *Fear Street* movie, and both left me feeling like they were made without much enthusiasm. The *Fear Street* film especially felt phoned in, like there was no real interest in the horror genre at all.\n\nIs this just a symptom of Netflix rushing content to maintain volume? Are tighter budgets and shorter production timelines part of the issue? Curious if others have felt this way about recent releases and whether there’s a larger trend here.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lhbgv5/anyone_else_feel_like_some_recent_netflix/"
    },
    {
        "id": "1lgxlfz",
        "author": "Kitchen_Discussion56",
        "title": "Does anyone know if you can watch movies downloaded abroad when you go back home",
        "content": "So basically, I’m in Italy for vacation/holiday at the moment and saving more Italian films for when I go back home. I’m just wondering if I’ll need to get nordVPN in order to watch them back in my home country (UK) or will I be okay to watch them if I download/save to my list?",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lgxlfz/does_anyone_know_if_you_can_watch_movies/"
    },
    {
        "id": "1lgsaji",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix Drops First Look at 'Outer Banks' Season 5",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lgsaji/netflix_drops_first_look_at_outer_banks_season_5/"
    },
    {
        "id": "1lheqz8",
        "author": "Koffenut1",
        "title": "Netflix bait &amp; switch?",
        "content": "Since I have closed both my FB and Insta and X accounts, I don't seem to have a way to reach Netflix customer service (other than waiting 20 mins for chat). So maybe someone has some ideas. \n\nI was on the standard with ad plan.  I wanted to watch Star Trek Enterprise and when I searched, it said it was not available to the ad supported plan due to licensing. This indicates the no-ad plan has it as an option.  \nI switched to the standard no ad plan on my account.  This show is not available - period.  \nThis is misleading at best and actually dishonest in my opinion.    \nNow it only cost me 64 cents because my plan renewed in 2 days and I set it to resume with ads.  \nBut if it had been earlier in the month it would have cost me $10 - this level of deceit is not acceptable.  \nI expect you to be honest about what is available at each price level.  \nI’ve been a customer a very long time and this now has me thinking about other options.  \nI would like to receive some explanation of how this happened and how you will prevent it from happening to me and  \nothers in the future.  \n",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1lheqz8/netflix_bait_switch/"
    },
    {
        "id": "1lh38ib",
        "author": "Ultrasshops",
        "title": "Unpopular opinion, but I did NOT like kpop demon hunters",
        "content": "The movie just came out yesterday, and I wanted to do a mini review on it. I’ll get the obvious out of the way, animation was great, no comments on that, I liked the visuals and the character designs too.\n\nNow I’ve read quite a few reviews on it quite alot of them seem to be positive, and I feel like I’m in the minority that believes that this movie was mid at best? Personally I felt that the pacing, character stories and actual plot were all lacking substance. \n\nZoe and Mira: \n\nI’ll start of with the characters, I’ll be real, the movie did not do enough for me to care about them and their conflict. While watching I feel like I got tonal whiplash, because while the movie was obviously trying to dive into emotional arcs for each of the girls, it didn’t provide strong enough development for characters like Zoey and Mira who were mostly just comic relief up until the climax. We know that Zoey is hotheaded and Mira is a people pleaser because that’s what was told to us, it was rarely ever shown and when it was, it was played off as comic relief (up until the climax). I mean we never even got to find out why these girls are the way they are, and in the end their arcs were resolved to quickly, which made the ending feel overly convenient. \n\nRumi: \n\nRumi’s arc was done slightly better than the other two, albeit she was the main character so it is expected, however by the end of the movie I was left with more questions than answers. I felt that Rumi’s background of being half demon, isn’t fully explored. Rather than exploring themes of fear and shame in depth a lot of her struggles are just shown to you through some quick flashbacks. I think these themes could’ve been better explored, by touching more upon the relationship between Rumi and her aunt/adoptive mother? Given the ending her aunt obviously had a pretty big influence on the girls, yet this relationship is never really fleshed out, aside from that one flashback, (where she’s telling Rumi to not share her secret )and so many questions were left, with their final interaction at the end of the movie, like why she’s so afraid of Rumi’s demonic side? How that relates to loosing Rumi’s mother, or whether she herself doubts her judgement? \n\nJinu: \n\nSimilar complaint as the girls, emotional arc was way too rushed and not fleshed out to its full potential. Also while I won’t deny Rumi and Jinu having some sort of chemistry, their romantic build up, in my opinion was paced oddly, and I wasn’t a fan of the “insta-love” dynamics. \n\nAside from that, it had some cute friendship scenes between the girls, I won’t get into the music, since I’m not the biggest k-pop fan so anything I say about it would be biased. I’d probably rate this movie a 4.5-5/10\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lh38ib/unpopular_opinion_but_i_did_not_like_kpop_demon/"
    },
    {
        "id": "1lhdak5",
        "author": "bykpoloplaya",
        "title": "I hate Netflix's voice actors",
        "content": "Their foreign made shows all seem to have the same few actors and actresses. I think like 3-5 women, and about the same for men. Maybe if I watched the credits I'd figure out how many for real.\n\nTheir performances are clearly annunciated, with a slight but I discernable accent. However they are pretty deadpan.\n\n",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1lhdak5/i_hate_netflixs_voice_actors/"
    }
]