[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 13,
        "comments": 85,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 64,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1lh9ft8",
        "author": "Less_Manufacturer218",
        "title": "Dept. Q on Netflix best show",
        "content": "One of the best shows I’ve seen in a while. Characters, plot and ending all really stuck with me. Almost as much as Young Wallander. Hoping for a second season. ",
        "upvotes": 100,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1lh9ft8/dept_q_on_netflix_best_show/"
    },
    {
        "id": "1lh5q00",
        "author": "Character_Map9480",
        "title": "\"new season coming soon\" how long until release",
        "content": "hi! I was just wondering how long netflix usually takes to release when a show has \"new season coming soon\" on it. \n\nspecifically i'm interested in yellowjackets season 2. i figured if netflix will release season two within the next few weeks it probably isn't worth it to sign up for another streaming service rn.",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lh5q00/new_season_coming_soon_how_long_until_release/"
    },
    {
        "id": "1lh3m7t",
        "author": "adiosamigo15",
        "title": "Prepping for a Product Interview — What Can Netflix Do Better or Add?",
        "content": "Hey everyone! I’m currently prepping for a product management interview and would love to get some outside perspectives.\n\nSpecifically, I’m curious — what do you think Netflix could be doing better? Are there features you wish they had or pain points you’ve experienced using the platform? Anything you’ve seen competitors doing that you think Netflix should adopt?\n\nWould really appreciate your insights — thanks in advance!",
        "upvotes": 5,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1lh3m7t/prepping_for_a_product_interview_what_can_netflix/"
    },
    {
        "id": "1lgy4bx",
        "author": "towel_hair",
        "title": "Netflix automatically updated my payment information without my consent",
        "content": "4:17am Netflix emailed me three times. The first two times saying my payment information was updated. Both times using old card information. The third email saying my payment information was updated using my brand new card information. Everything was correct including expiration. How could this be possible? My card is not compromised. \n\nWell I learned that Netflix utilizes something called Visa Acount updater. This is a service offered by VISA card Issuers(your bank). They claim it’s to reduce customers calling in to update payment information.\n\nTo be fair, I DO I want my Netflix subscription to continue, but I had no clue this was even a thing. ",
        "upvotes": 10,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lgy4bx/netflix_automatically_updated_my_payment/"
    },
    {
        "id": "1lh41pz",
        "author": "Mysterious_Menu2481",
        "title": "Why No Westerns or Concerts?",
        "content": "Is it just my poor searching - or it is true? Why don't I see any western movies or a \"Westerns\" category in category search or see any Live concerts? Does anyone experience the same thing? Can anyone guess why that is?",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lh41pz/why_no_westerns_or_concerts/"
    },
    {
        "id": "1lh3957",
        "author": "5256chuck",
        "title": "Justin Willman: Magic Lover",
        "content": "This special shines (you'll catch the reference after you watch)! Serendipity brought me to it, I suppose (you'll catch that ref, too). This is a very, very good, funny and entertaining magic act/comedy show. Looking forward to seeing more from Justin. And also waiting to see him get zip code stumped, finally. That's a pretty amazing talent, in itself. There are a lot of surprising laughs. Do yourself a favor.",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lh3957/justin_willman_magic_lover/"
    },
    {
        "id": "1lgu3bp",
        "author": "Select-Effort8004",
        "title": "Netflix Sirens - Staff celebrating Simone’s departure",
        "content": "I didn’t understand why the staff would celebrate Simone being fired. But now that I’m done watching, I wondered if they were glad for her that she was going to be free. They made fun of her, but did they not like her? Would they be better off if she were gone? Their positions were another facet of the show, hating Kiki, clearly not respecting Peter (Jose’s “Here we go again”), but a decent job with a famous employer and surely getting paid well.   \n\nSo why was Simone’s departure celebrated?",
        "upvotes": 15,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1lgu3bp/netflix_sirens_staff_celebrating_simones_departure/"
    },
    {
        "id": "1lh8413",
        "author": "UniqueEnigma121",
        "title": "Your Account on hold email. “Just two day left to easily restart Netflix”",
        "content": "What will happen after two days if I don’t add a payment method or add credit via gift card. \n\nThis is for my Turkish Netflix account, which I was hoping to use for a month every three months. As I don’t need Netflix every month &amp; would like to dip back in when I want. ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lh8413/your_account_on_hold_email_just_two_day_left_to/"
    },
    {
        "id": "1lhbqgo",
        "author": "ilovebeardsss",
        "title": "Murder on the Internet - WOW.",
        "content": "So I've just started watching this series... literally less than 10 minutes into episode 1 and this so-called psychologist is something else. Did anyone else find her incredibly irritating? She came across as being rather uneducated and very presumptuous, neither of which are great traits in a psychologist. \n\nFirst of all, she states that the guy being paralytic was intentional because he wanted to make his date vulnerable (what?! He was the drunk one  not her) or because he wanted some dutch courage so that he could get away with his evil plan. Surely if it was all part of his plan, he wouldn't have gotten black out drunk? \n\nSecondly, she said that him having pre-booked a hotel is a clear sign that he wanted to control the night and has a sense of ownership. There are SO many other reasons as to why someone might book a hotel. \n\nI think what irritated me most (so far) is that she claimed that people with EUPD like Carl are often violent and spontaneous. That's just not true. I have EUPD (aka BPD) and these kind of claims can be SO damaging. I know several others with a similar diagnoses, none of whom are violent or spontaneous. I wouldn't hurt a fly, and schedules are everything. Saying he was undoubtedly dangerous because of his EUPD diagnosis was ridiculous. As if what he did was down to his personality disorder. \n\nDon't get me wrong, the guy is absolute scum and I really feel for Katie's family. This psychologist though... I'd love to know more about her credentials. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lhbqgo/murder_on_the_internet_wow/"
    },
    {
        "id": "1lgb1dl",
        "author": "ER-841",
        "title": "Mindhunter Star Reveals How the Netflix Series Might Finally Return 6 Years Later",
        "content": "Mindhunter was in my opinion one of the best series Netflix ever produced. So when I learned it was cancelled after the second season it was such a disappointment. In this article, they discuss how the series might return in the form of movies. I think this is really great. David Fincher would be returning with the same cast theoretically if he likes the scripts… Fingers crossed. 🤞",
        "upvotes": 267,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1lgb1dl/mindhunter_star_reveals_how_the_netflix_series/"
    },
    {
        "id": "1lghjht",
        "author": "suhpriseshawtyyy_",
        "title": "What did you think about the AstroWorld documentary?",
        "content": "Just watched the documentary yesterday and I’m honestly speechless. So many things throughout didn’t sit right with me. So much led up to the tragedy, things that could have been prevented from the very beginning. The complete lack of accountability was one of the most unsettling parts. And the lack of awareness or care for his fans, who he clearly saw struggling in the crowd…Just an insane documentary overall. No words.",
        "upvotes": 69,
        "comments": 60,
        "media": null,
        "permalink": "/r/netflix/comments/1lghjht/what_did_you_think_about_the_astroworld/"
    },
    {
        "id": "1lh2jjb",
        "author": "Eastern_Time1373",
        "title": "Kpop demon Hunter Promotional Truck",
        "content": "   Ran into a Netflix truck doing promotional work for kpop demon hunters (great movie!) says there may be a prize if we share the hashtag. Is there an actual prize lol? A lady at the truck took a picture of me, was wondering where they might post things like this at.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lh2jjb/kpop_demon_hunter_promotional_truck/"
    },
    {
        "id": "1lhbgv5",
        "author": "namedmypupwarren2020",
        "title": "Anyone else feel like some recent Netflix originals were made without any passion?",
        "content": "Just finished *DCC* Season 2 and the newest *Fear Street* movie, and both left me feeling like they were made without much enthusiasm. The *Fear Street* film especially felt phoned in, like there was no real interest in the horror genre at all.\n\nIs this just a symptom of Netflix rushing content to maintain volume? Are tighter budgets and shorter production timelines part of the issue? Curious if others have felt this way about recent releases and whether there’s a larger trend here.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lhbgv5/anyone_else_feel_like_some_recent_netflix/"
    },
    {
        "id": "1lh52gh",
        "author": "Ariolace",
        "title": "K-pop Demon Hunters Music Help",
        "content": "Hey everyone, just finished watching K-Pop Demon Hunters and I absolutely loved it. There's a background music that plays at the very start of the movie when Celine is explaining the origin and history of the Hunters and the Honmoon. I can't seem to find it in the offical music list for the show but maybe I just missed it. Can someone help me?  \n\nThe music starts around 0:54 and lasts till around 02:04. Thank you very much! ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lh52gh/kpop_demon_hunters_music_help/"
    },
    {
        "id": "1lh38ib",
        "author": "Ultrasshops",
        "title": "Unpopular opinion, but I did NOT like kpop demon hunters",
        "content": "The movie just came out yesterday, and I wanted to do a mini review on it. I’ll get the obvious out of the way, animation was great, no comments on that, I liked the visuals and the character designs too.\n\nNow I’ve read quite a few reviews on it quite alot of them seem to be positive, and I feel like I’m in the minority that believes that this movie was mid at best? Personally I felt that the pacing, character stories and actual plot were all lacking substance. \n\nZoe and Mira: \n\nI’ll start of with the characters, I’ll be real, the movie did not do enough for me to care about them and their conflict. While watching I feel like I got tonal whiplash, because while the movie was obviously trying to dive into emotional arcs for each of the girls, it didn’t provide strong enough development for characters like Zoey and Mira who were mostly just comic relief up until the climax. We know that Zoey is hotheaded and Mira is a people pleaser because that’s what was told to us, it was rarely ever shown and when it was, it was played off as comic relief (up until the climax). I mean we never even got to find out why these girls are the way they are, and in the end their arcs were resolved to quickly, which made the ending feel overly convenient. \n\nRumi: \n\nRumi’s arc was done slightly better than the other two, albeit she was the main character so it is expected, however by the end of the movie I was left with more questions than answers. I felt that Rumi’s background of being half demon, isn’t fully explored. Rather than exploring themes of fear and shame in depth a lot of her struggles are just shown to you through some quick flashbacks. I think these themes could’ve been better explored, by touching more upon the relationship between Rumi and her aunt/adoptive mother? Given the ending her aunt obviously had a pretty big influence on the girls, yet this relationship is never really fleshed out, aside from that one flashback, (where she’s telling Rumi to not share her secret )and so many questions were left, with their final interaction at the end of the movie, like why she’s so afraid of Rumi’s demonic side? How that relates to loosing Rumi’s mother, or whether she herself doubts her judgement? \n\nJinu: \n\nSimilar complaint as the girls, emotional arc was way too rushed and not fleshed out to its full potential. Also while I won’t deny Rumi and Jinu having some sort of chemistry, their romantic build up, in my opinion was paced oddly, and I wasn’t a fan of the “insta-love” dynamics. \n\nAside from that, it had some cute friendship scenes between the girls, I won’t get into the music, since I’m not the biggest k-pop fan so anything I say about it would be biased. I’d probably rate this movie a 4.5-5/10\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lh38ib/unpopular_opinion_but_i_did_not_like_kpop_demon/"
    },
    {
        "id": "1lg0bvl",
        "author": "MelodyHearts678",
        "title": "What do you guys think of K-Pop Demon Hunters?",
        "content": "Now that it’s out and I watched the movie.\n\nI must personally say that I love it so freaking much!\n\nAnd consider it as my all time favourite movie of 2025\n\nPlus just to make sure that you also watched it, what’s your favourite song from that movie.\n\nFor me I could only pick three because I love every single songs from it.\n\nAnd that would be: Golden, Takedown and Free.",
        "upvotes": 370,
        "comments": 250,
        "media": null,
        "permalink": "/r/netflix/comments/1lg0bvl/what_do_you_guys_think_of_kpop_demon_hunters/"
    },
    {
        "id": "1lgxlfz",
        "author": "Kitchen_Discussion56",
        "title": "Does anyone know if you can watch movies downloaded abroad when you go back home",
        "content": "So basically, I’m in Italy for vacation/holiday at the moment and saving more Italian films for when I go back home. I’m just wondering if I’ll need to get nordVPN in order to watch them back in my home country (UK) or will I be okay to watch them if I download/save to my list?",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lgxlfz/does_anyone_know_if_you_can_watch_movies/"
    },
    {
        "id": "1lgsaji",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix Drops First Look at 'Outer Banks' Season 5",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lgsaji/netflix_drops_first_look_at_outer_banks_season_5/"
    },
    {
        "id": "1lgy04x",
        "author": "SpecificRespect7444",
        "title": "WHEN will The naked gun movies arrive on Netflix? Today is saturday June 21 as scheduled and I still don't see it.",
        "content": "Does anyone know anything about it? It was available on June 15, and I started watching and it suddenly dissapeared. Later I saw they delay it to June 21. Still nothing....",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lgy04x/when_will_the_naked_gun_movies_arrive_on_netflix/"
    },
    {
        "id": "1lgjzhd",
        "author": "Silent_Piccolo_5670",
        "title": "Lost",
        "content": "I was listening to morning radio and the guy was talking about a documentary on Netflix about a man accused of murdering women. And the wife didn’t believe it. And there was a secret room in the house that no one was allowed to go into. And the murders always happened when the wife and kids were out of town. And he supposedly renovated the bathroom. I never heard the name of the documentary, can anyone help? I tried Google with keywords and nothing……  Thanks in advance for the help if you can ",
        "upvotes": 11,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1lgjzhd/lost/"
    },
    {
        "id": "1lfqj1f",
        "author": "Proof-Pollution454",
        "title": "I just finished watching Trainwreck : Astroworld Tragedy. I am beyond digsuted",
        "content": "I just finished watching this documentary and I beyond disgusted how to this day no one was held accountable , let alone Travis Scott being serious of the aftermath, the company not holding their responsbility of planning this even right. to then see footage of scott telling fans to engage in dangerous behavior is just awful. Like where is the common sense ? Where is the importance of safet when anything could go wrong . To then want fans to go crazy is wrong",
        "upvotes": 969,
        "comments": 182,
        "media": null,
        "permalink": "/r/netflix/comments/1lfqj1f/i_just_finished_watching_trainwreck_astroworld/"
    },
    {
        "id": "1lg43e5",
        "author": "TheMirrorUS",
        "title": "High-end real estate agent Netflix star found dead aged 40 after being struck in hit-and-run",
        "content": "",
        "upvotes": 82,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1lg43e5/highend_real_estate_agent_netflix_star_found_dead/"
    },
    {
        "id": "1lh1l76",
        "author": "sinay12",
        "title": "I need shows to watch",
        "content": "So I have recently bought a Netflix subscription with my cousins and I'm running out of stuff to watch I've watched all of the recent movies and shows including Wonka, plankton the movie,good times, Asterix and Obelix, the FNAF movie, and big mouth. But I ran out of stuff to watch I tried watching Braking bad but I Personally don't really like it so if y'all have some recommendations for things to watch it'll be greatly appreciated ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lh1l76/i_need_shows_to_watch/"
    },
    {
        "id": "1lgnvtx",
        "author": "Freshxmangos",
        "title": "Why are the gaps between shows with under 15 episodes so lengthy?",
        "content": "I am not sure if this has been asked before but why is it that it takes so long for another season to come out? Two years is bizarre to me. So many times I've finished a season and then forget or lose interest in the show because it's taking so long. ",
        "upvotes": 5,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1lgnvtx/why_are_the_gaps_between_shows_with_under_15/"
    },
    {
        "id": "1lgmop1",
        "author": "messengers1",
        "title": "AMA Reminder: Tomorrow's Livechat With Carlos Rafael Rivera at 3PM PST/11PM UTC on June 21 at R/DeptQ",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lgmop1/ama_reminder_tomorrows_livechat_with_carlos/"
    },
    {
        "id": "1lgkduv",
        "author": "No-Camp-3736",
        "title": "New Recommendations",
        "content": "I have all the free time in the world for the next couple weeks i’m so looking for something to binge.\n\nShows I love: Desperate housewives, friends, black mirror, the office, Schitts creek\n\nShows I like : The good place, bojack horseman, F is for family, You\n\nI feel like there’s nothing good in my recommendations so anything is appreciated :)",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lgkduv/new_recommendations/"
    },
    {
        "id": "1lgo29f",
        "author": "Historical_Log1275",
        "title": "Dallas cowboys cheerleaders?",
        "content": "I usually enjoy a good trash tv (e.g. selling sunset, LIB, etc.) but DCC has just given me ick vibes. I feel like it may be the coaches and weird power/control stuff. Thoughts? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lgo29f/dallas_cowboys_cheerleaders/"
    },
    {
        "id": "1lgr5wa",
        "author": "Educational-Table331",
        "title": "Video game adaptations on Netflix?",
        "content": "I’ve been watching Netflix’s game-based shows like Castlevania and Devil May Cry, and it got me thinking — why are they so consistently good compared to other video game adaptations?\n\nIt feels like Netflix cracked some kind of code. The animation is top-tier, the writing respects the original lore, and the pacing actually works. Even Arcane (though not technically a Netflix production) followed a similar winning formula.\n\nWhat do you think is the “secret sauce”? Is it the teams they hire? The animation style? The freedom they give the writers?\n\nCurious to hear your thoughts — especially if you’ve watched Cyberpunk: Edgerunners, Tomb Raider, or Captain Laserhawk too. Are we witnessing a new golden age of game adaptations?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lgr5wa/video_game_adaptations_on_netflix/"
    },
    {
        "id": "1lg7drq",
        "author": "peoplemagazine",
        "title": "Million Dollar Beach House Realtor Sara Burack Dies After Hampton Bays Hit-and-Run",
        "content": "",
        "upvotes": 19,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lg7drq/million_dollar_beach_house_realtor_sara_burack/"
    },
    {
        "id": "1lgqfjh",
        "author": "spzdrhrsn",
        "title": "What often gets forgotten about the new UI",
        "content": "It's the fact that I can no longer swipe left to the menu to quickly navigate to My List when I couldn't find something interesting in the categories or vice versa. Now I have to scroll all the way up because some masterminds decided to put the menu at the top. \n\nI just can't understand how you can develop something new without considering how it's used. I mean, do the people in charge even use Netflix themselves? \n\nThe Netflix UI, like any other streaming service UI, was always bad and kept getting worse, but this is certainly a new low I never would have thought possible. \nIf I hadn't gotten a good deal last year for a combo subscription of Waipu+Netflix, I'd cancel Netflix for sure.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lgqfjh/what_often_gets_forgotten_about_the_new_ui/"
    }
]