[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 477,
        "comments": 249,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1gpxwsn",
        "author": "D01211",
        "title": "Netflix offers lower quality  for extra members ",
        "content": "I’ve noticed that 4K isn’t available on my account that has been invited as an extra member to a 4K account. Looks like Netflix lowers the quality on the extra account if you purchased the plan with ads even if the main account is 4K. This isn’t communicated anywhere on the website as the website clearly says:\n\nThe same video and audio quality as the member who invited them.\n\nI asked the customer service and apparently you have to contact them in order to find out that the plan you’ve purchased is different to what Netflix advertises. ",
        "upvotes": 41,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1gpxwsn/netflix_offers_lower_quality_for_extra_members/"
    },
    {
        "id": "1gpynmr",
        "author": "opheliasdinosaur",
        "title": "Stop first season cliffhangers",
        "content": "Is anyone else ever really frustrated with a good, unique first series that ends on a cliff hanger and then gets cancelled because it didn't hit the top 5 viewing figures in week 1 or 2?\n\nNetflix needs to stop this crap. Either have a rule that all first seasons have a closed story arc or give shows time to build viewership.\n\nGood example - dead boy detectives = I'm devastated there's no season 2, but it was a closed arc, all major ploy points resolved and I don't feel that netflix stole 8 hours of my life.\n\nBad example - the midnight club, or a whole bunch of others that I had on a watch list and then removed when I found out they were cancelled but left on a cliff hanger. I have no incentive to watch them now. \n\nAt least where there is a closed arc, I may still go and watch a cancelled show.\n\nDoes anyone else feel like this?",
        "upvotes": 36,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1gpynmr/stop_first_season_cliffhangers/"
    },
    {
        "id": "1gq7ja4",
        "author": "ColleenLotR",
        "title": "Why do people fall for fake Netflix posters?",
        "content": "Like I just saw a CLEARLY non-official page post about Wednesday coming out on November 23rd and im like, this poster is clearly fake, it doesn't even look professionally edited, the outfits are from the first season, and there is nothing about the page even in the title alone to indicate its a credible source, so people should know better right?\n\nWrong. So many people commenting \"Finally!\" \"Oh I can't wait i will have to set a reminder!\" \"So excited!\" \"I hope this is real!\" Etc like I genuinely don't understand how *so many people* are *that* gullible. ",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1gq7ja4/why_do_people_fall_for_fake_netflix_posters/"
    },
    {
        "id": "1gpas31",
        "author": "Kamala_lost",
        "title": "Enough Mark Wahlberg!",
        "content": "He plays the same character in every movie! He's not that charasmatic and in my opinion can't carry a movie alone. He's fine in something like The Departed. He must have one hell of an agent - he is the star in half the movies on Netflix. \n\nAlso, Chris Pratt is not a good voice actor. I wanted to watch the new Garfield movie but can't tolerate his voice acting. \n\nBoth Wahlberg and Pratt are better off in ensemble casts - they're not interesting enough on their own.  ",
        "upvotes": 636,
        "comments": 162,
        "media": null,
        "permalink": "/r/netflix/comments/1gpas31/enough_mark_wahlberg/"
    },
    {
        "id": "1gq7w5h",
        "author": "tiredandstressedokay",
        "title": "Pandemic is Over: Is Re-renewing \"I Am Not Okay With This\" a possibility?",
        "content": "What do you all think? I came across an article stating that \"I Am Not Okay With This\" could have filled the void left by \"Stranger Things\" but it was squandered due to Covid. I think it could still work. There was concerns of cast member aging out of their roles. For most of the cast members they hadn't aged a day (Exception for Aidan Wojtak-Hissong who plays Liam). It was genuinely a great show, the reason it was probably renewed initially before Covid. They had already been working on the script. Do you think it's possible to produce a Season 2?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gq7w5h/pandemic_is_over_is_rerenewing_i_am_not_okay_with/"
    },
    {
        "id": "1gq8a05",
        "author": "Historical-Pizza6330",
        "title": "Need some help",
        "content": "\n\nHey everyone, I’m having a frustrating issue with Netflix and hoping someone here can help. Whenever I try to watch certain shows or movies \"mostly happens using the netflix app\", instead of giving me the “Play” option, it just says “Remind Me.” I’m unable to watch anything I want because it keeps showing this button, even on shows I’ve watched before. I’ve tried logging out and back in, restarting my device, and even uninstalling and reinstalling the app, but nothing seems to fix it. It happens across multiple devices, so I don’t think it’s a problem with just one. Has anyone experienced this, or does anyone know what’s causing it and how to fix it? Any advice would be greatly appreciated – I just want to be able to watch my shows again! Thanks in advance!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gq8a05/need_some_help/"
    },
    {
        "id": "1gpqr6c",
        "author": "AffectionateBit5872",
        "title": "Why is every new show 6 eps?",
        "content": "The diplomat is my favorite show on Netflix and it's 6 ep run was way to short compared to it's 8 ep first season which also felt to short. As well as the excellent new show Territory was only 6 eps. I was also looking ahead and 2 shows I'm insanely excited for Black Doves and American Primevil are also going to be only 6 eps. It's insane that every few years it feels like they push the ep count lower. Which is extra crazy because they count shows on minutes watched which basically sets new shows up to fail and is the reason we have no new shows.",
        "upvotes": 13,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1gpqr6c/why_is_every_new_show_6_eps/"
    },
    {
        "id": "1gq7a6x",
        "author": "LetterheadFun3697",
        "title": "'Avatar: The Last Airbender' Season 2 Finds Its Joo Dee, Long Feng, The Boulder and Casts 'Sympathizer' Star Hoa Xuande",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gq7a6x/avatar_the_last_airbender_season_2_finds_its_joo/"
    },
    {
        "id": "1gq6zdx",
        "author": "TomorrowPitiful2410",
        "title": "Netflix take my story",
        "content": "Let me be the next Baby Reindeer ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gq6zdx/netflix_take_my_story/"
    },
    {
        "id": "1gq6ih3",
        "author": "dr_van_nostren",
        "title": "Downloads gone?",
        "content": "Anyone else have this issue? I’m travelling and knew I’d be in China for some long layovers so I downloaded some content. Worked fine for a few days. Now they’re all gone. They shouldn’t have expired cuz I only downloaded them like a week before. \n\nThe only thing I found online was that your downloads get wiped if the app gets updated? Ok my fault I guess for not knowing that and having auto update on. But then I go to download something and it says I’ve hit my monthly limit. You mean you wiped my downloads and are still holding me to that limit? Seems rather stupid. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gq6ih3/downloads_gone/"
    },
    {
        "id": "1gpx9ea",
        "author": "TheDadThatGrills",
        "title": "The Rise of the Golden Idol (released today- $20) is available as part of your Netflix membership.",
        "content": "Tried posting this to /r/Games but the mods removed it as not being relevant to their sub. Understand that most subscribers sleep on the game portion of their membership, but give this one a serious look if you enjoy murder mysteries. ",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gpx9ea/the_rise_of_the_golden_idol_released_today_20_is/"
    },
    {
        "id": "1gpvz68",
        "author": "Vojvodjanin110",
        "title": "I watched majority of crime documentaries.",
        "content": "I watched majority of crime documentaries. What should I do now, buy HBO or something? Are there any documentaries that are different than on Netflix?\nOnly interested in real life one, not series and dramas.",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gpvz68/i_watched_majority_of_crime_documentaries/"
    },
    {
        "id": "1gpl3gt",
        "author": "KimScotte",
        "title": "Any good horror series on Netflix? Looking for something scary!",
        "content": "Hey everyone! I’m in the mood for some seriously scary and thrilling web series to binge on Netflix. I’m into a mix of supernatural, psychological, and even gory horror—basically anything with a strong story and plenty of chills. If you've got any recommendations that will keep me up at night, I’d love to hear them!",
        "upvotes": 12,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1gpl3gt/any_good_horror_series_on_netflix_looking_for/"
    },
    {
        "id": "1gq0buo",
        "author": "galiumgirl",
        "title": "Can't Find Scene",
        "content": "Hi! I just watched Metal Lords and I swear Netflix used to preview it with a scene that wasn't in the movie.\n\nThe scene was of the protagonists (Hunter) while in black and white metal makeup. He was sitting at his desk when a trio of girls approached to ridicule his appearance. But he claps back and skillfully ridiculed their outfits in return.\n\nAm I thinking of the wrong movie? Is there another movie on Netflix with this scene? I swore it was Metal Lords but it wasn't in there! Please help, I have been ceaseless trying to find where it's from but I cant figure it out.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gq0buo/cant_find_scene/"
    },
    {
        "id": "1gpme55",
        "author": "MovieGuyTravis",
        "title": "New Trailer for Carry-On with Taron Egerton and Jason Bateman",
        "content": "",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1gpme55/new_trailer_for_carryon_with_taron_egerton_and/"
    },
    {
        "id": "1gpnyzp",
        "author": "Simple-Ceasar",
        "title": "How can a non Netflix user see a list of currently available movies and series on Netflix in Spain?",
        "content": "Hi,\n\nI had Netflix before. I live in Spain.\n\nBefore i first subscribed to Netflix I saw a list of available movies on Netflix. When i took Netflix i saw that a good amount of those movies were not available on Netflix in Spain.\n\nI don't have Netflix anymore but I am thinking about subscribing again.\n\nThe ones found on Google just show a general list. Therefore is there a list that shows specifically what available in Netflix Spain? \n\n\nThank you.\n",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1gpnyzp/how_can_a_non_netflix_user_see_a_list_of/"
    },
    {
        "id": "1gp72oi",
        "author": "OriginalSammy",
        "title": "Windows lagging?",
        "content": "Just a quick question \nIs anyone elses netflix lagging and not showing the controls on the web ?\n\nIt was working fine yesterday for me and now it isn’t. I have tried restarting the laptop and a different browser. \n\nIts fine on the app and tv. \n\nEdit:\n It’s the next day for me and so far it is fixed.\nThank you all for sharing and relieving the stress of one another :)",
        "upvotes": 70,
        "comments": 89,
        "media": null,
        "permalink": "/r/netflix/comments/1gp72oi/windows_lagging/"
    },
    {
        "id": "1gpxfyq",
        "author": "sensesalt",
        "title": "New Netflix Original Movies Coming in 2025 [Global]",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gpxfyq/new_netflix_original_movies_coming_in_2025_global/"
    },
    {
        "id": "1gptul5",
        "author": "disdkatster",
        "title": "Who is responsible for recommendations on Netflix?",
        "content": "I have more shows show up on my recommendations that I have down voted that ones I have upvoted. It isn't just recommendations though. They have a sorting of \"Because you liked....\" and do the same thing. I sometimes wonder if they are trying to justify bad shows they have put on the site by pushing people to watch them. Honestly Netflix, when I say I don't like it I really meant I don't like it. I will bend over backwards to not do a thumbs down on a show. Do others notice this or am I just too difficult to profile?",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1gptul5/who_is_responsible_for_recommendations_on_netflix/"
    },
    {
        "id": "1gpypxj",
        "author": "IrishStarUS",
        "title": "Netflix announces hugely popular cheerleading show is back for round two",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gpypxj/netflix_announces_hugely_popular_cheerleading/"
    }
]