[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 2,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 13,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1qifhrd",
        "author": "verdemanzia",
        "title": "Amici Mirafiori Nord",
        "content": "Ciao!! Qualche mese fa mi sono trasferita a Torino per l’università e vorrei conoscere gente della mia età (sulla ventina) in zona Mirafiori Nord così da avere qualche amichettx per passeggiate tranquille senza essere sempre costretta a prendere l’autobus per andare in centro :)",
        "upvotes": 8,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1qifhrd/amici_mirafiori_nord/"
    },
    {
        "id": "1qis1mj",
        "author": "akaciccio",
        "title": "Mercatini usato/antiquariato",
        "content": "Ciao a tutti\nvorrei vendere delle stampe, di mero valore decorativo ma che mi sembrano belle. Qualcuno mi saprebbe indicare dei mercatini dell'usato/antiquariato? Cercando su Internet non ho trovato informazioni attendibili: per esempio mi dava che c'era il mercato ogni terza domenica del mese alla Gran Madre, ci sono andato e non c'era. Vorrei evitarmi tanti giri a vuoto.\nGrazie!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qis1mj/mercatini_usatoantiquariato/"
    },
    {
        "id": "1qirs5v",
        "author": "SarahS2222",
        "title": "Physical books",
        "content": "Hi all,   \nI've recently moved to Turin &amp; absolutely love this city.  \nI've got a huge bookcase I'd love to fill with physical books, English or Italian.  \nI'm buying from second hand dealers and markets but just wondering if there are options for free ones, maybe places I could collect from to get them off peoples hands.\n\nFacebook Marketplace and Subito haven't been much help.\n\nAny tips?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1qirs5v/physical_books/"
    },
    {
        "id": "1qhwjsb",
        "author": "OkPattern1144",
        "title": "Il livello della speculazione a Torino",
        "content": "https://preview.redd.it/jkkcfjpe2heg1.png?width=1579&amp;format=png&amp;auto=webp&amp;s=0a4242aa99eeb9e0a3def9763128d61b6df66ab0\n\nhttps://preview.redd.it/pmz81m3i2heg1.png?width=1579&amp;format=png&amp;auto=webp&amp;s=7ea9472c18e8d6e0b4556864917d9210c0fe0aec\n\nhttps://preview.redd.it/tvdcpfj03heg1.png?width=1119&amp;format=png&amp;auto=webp&amp;s=c15e0b7fa37b58bcbf1c6f246a9bab8e25a3a483\n\nSolo due esempi ma se siete come me su immobiliare o idealista quotidianamente, potete vedere voi stessi la quantitá di palazzinari che provano a fare centinaia di euro di creste.  \nPoi possiamo disquisire quanto vogliamo sulla posizione strategica degli immobili, ma 840 euro senza spese per stare in Corso Giulio...  \n ",
        "upvotes": 19,
        "comments": 54,
        "media": null,
        "permalink": "/r/torino/comments/1qhwjsb/il_livello_della_speculazione_a_torino/"
    },
    {
        "id": "1qi775k",
        "author": "NoraPinkUniverse",
        "title": "Quartieri di Torino sicuri/collegati bene con i mezzi ma non troppo costosi?",
        "content": "Buon pomeriggio, dovrei trasferirmi a Torino per la magistrale, però non conosco bene la città.\n\nQuali sono dei quartieri sicuri (per una donna single sui 30), serviti bene dai mezzi/servizi ma non troppo costosi/centrali? Vi ringrazio",
        "upvotes": 1,
        "comments": 32,
        "media": null,
        "permalink": "/r/torino/comments/1qi775k/quartieri_di_torino_sicuricollegati_bene_con_i/"
    },
    {
        "id": "1qhy837",
        "author": "AfterReaction5000",
        "title": "Looking for music connexion in Torino",
        "content": "Ciao a tutti!\n\nSono Zecchinetta, DJ e producer di base a Parigi con radici italiane. Suono Italo Disco, Italo Body e Progressive House – roba da dancefloor emotiva con una sensibilità europea.\n\nSto cercando di connettermi con la scena torinese – che siate DJ, promoter, gestori di locali, o semplicemente qualcuno che conosce bene la comunità musicale elettronica locale. Mi piacerebbe sapere dove questo tipo di sound può trovare spazio in città, e magari suonare qualche set.\n\nQualche sample se siete curiosi:\n\n* Italo Disco: [https://youtu.be/1siqPYoU\\_lQ?si=egkZN-xDGM6WM0tU](https://youtu.be/1siqPYoU_lQ?si=egkZN-xDGM6WM0tU)\n* Italo Body / Progressive House: [https://on.soundcloud.com/sK2eK0LvSQvGlSfEBv](https://on.soundcloud.com/sK2eK0LvSQvGlSfEBv)\n\nScrivetemi nei commenti o in DM – felice di parlare di musica, scambiare dritte, o semplicemente connettermi con gente sulla stessa onda.\n\nGrazie mille! ",
        "upvotes": 3,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KUFuu6DieymP_nafmhLkXv8ThAqxDr0sQpbx6s5FEZI.jpeg?auto=webp&amp;s=6ffa24829979dabe5014819ca17e591862ef891f"
        },
        "permalink": "/r/torino/comments/1qhy837/looking_for_music_connexion_in_torino/"
    },
    {
        "id": "1qhtxmf",
        "author": "Acceptable_Tip6221",
        "title": "Percorsi running Torino",
        "content": "Da qualche mese sto correndo sempre più spesso e vorrei sapere se qualcuno può consigliare dei percorsi di circa 10 km (tra andata e ritorno arrivo alla quota del lungo settimanale di circa 20 km) a Torino e dintorni.\n\nIo sono di Torino sud, quindi conosco molto bene il LungoPo, la zona Valentino e le Vallere.\nCorro anche al Parco Colonnetti in settimana, ma è un percorso di circa 5 km.\n\nVorrei qualche idea nuova per poter variare il tragitto.\n\nGrazie, ciao!",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1qhtxmf/percorsi_running_torino/"
    },
    {
        "id": "1qhyw0x",
        "author": "Z_fede",
        "title": "consigli weekend a Torino",
        "content": "Buongiorno a tutti!!\n\nil 14 marzo sarò a Torino per un evento al lingotto fiere, da tardo pm fino a domenica mattina (circa)\n\nprobabilmente arrivo in treno (al momento sono da solo, quindi è mooolto probabile via treno visto i costi), e sto valutando se valga la pena magari partire il giorno prima per visitare la città dal venerdi, ci sono stato credo 20 anni fa quindi ricordo praticamente nulla.\n\nAvete consigli su cosa si può fare? che mezzi di trasporto comodi ci sono? vale la pena trovare alloggio in zona lingotto e spostarsi verso il centro con i mezzi?\n\nqualsiasi consiglio è ben accetto!!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1qhyw0x/consigli_weekend_a_torino/"
    },
    {
        "id": "1qhyift",
        "author": "RushImpossible3644",
        "title": "Zona San Salvario - Vivibilità",
        "content": "Ciao a tutti\\*, sto cercando casa e zona San Salvario sembra abbordabile anche con i prezzi. Ho trovato un paio di appartamenti, uno all'incrocio tra Via Giuseppe Baretti e V. Ormea e uno in Via Thesauro poco distante da Via Nizza. Opinioni sulla zona, pericolosità, etc?? grazie mille!",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1qhyift/zona_san_salvario_vivibilità/"
    },
    {
        "id": "1qhxfql",
        "author": "Artistic_Engineer819",
        "title": "Gruppi Spartan Race a Torino",
        "content": "Ciao, mi sono iscritta alla Spartan Race di Orte (il 25 aprile 2026), prima volta per me, la Sprint da 5km, ma dato che non frequento palestre specializzate non conosco nessuno che la faccia.  \nCi sono squadre/gruppi a Torino in cui possa conoscere altra gente iscritta?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qhxfql/gruppi_spartan_race_a_torino/"
    },
    {
        "id": "1qhuubf",
        "author": "Hot-Community-8827",
        "title": "Galles a Torino - Consigli per il mercatino delle pulci?",
        "content": "Ciao, visiterò la splendida città di Torino dal 7 al 9 febbraio e non vedo l'ora di andarci per la prima volta. Uno dei miei hobby è il \"thrifting\" e mi piacerebbe visitare i mercatini delle pulci per trovare souvenir, come abiti vintage di stilisti italiani come Armani, Stone Island e CP Company. Qualcuno ha qualche consiglio da darmi su Amy? Grazie",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1qhuubf/galles_a_torino_consigli_per_il_mercatino_delle/"
    },
    {
        "id": "1qhjfme",
        "author": "MathExpress2768",
        "title": "Con un punteggio di 35,71 al TIL-I del Politecnico di Torino, è possibile laurearsi, o vuol dire che non si è addatto?",
        "content": "Se uno ottiene questo punteggio, vuol dire che non potrà mai laurearsi e che è meglio fare un'altra scelta?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1qhjfme/con_un_punteggio_di_3571_al_tili_del_politecnico/"
    },
    {
        "id": "1qhattk",
        "author": "BlackCastle77",
        "title": "\"corsi\" (?) serali di cinema",
        "content": "Ciao a tutti, sono un ragazzo di 20 anni, di lavoro faccio il fotografo e il mio sogno nel cassetto sarebbe lavorare nel cinema. Ho iniziato a lavorare nel mondo della fotografia subito dopo le superiori (ho studiato audiovisivi) ed è un mondo che mi piace ma vorrei sapere se esistono realtà più piccole delle università in cui ci sono gruppi di persone che fanno cinema indipendente o comunque corsi di cinema serali in cui continuare ad imparare in questo ambito per fare crescere questa mia passione.\nÈ una richiesta forse un po' strana ma fatemi sapere se conoscete realtà simili, grazie in anticipo\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qhattk/corsi_serali_di_cinema/"
    },
    {
        "id": "1qh53ta",
        "author": "cazzadinho777",
        "title": "Vale a pena comprar Polimi/Polito?",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qh53ta/vale_a_pena_comprar_polimipolito/"
    },
    {
        "id": "1qgjd11",
        "author": "Aggravating-Rise-770",
        "title": "Abitare con un anziano in cambio di aiuto: come trovare queste opportunità?",
        "content": "Ciao a tutti\n\nVorrei evitare il classico affitto che oggi, tra canoni e bollette, mangia gran parte dello stipendio senza lasciare nulla per il futuro.\n\nL’idea è quella della coabitazione: offrirei la mia presenza, compagnia e aiuto concreto (spesa, commissioni, piccola manutenzione, assistenza tecnologica) a una persona anziana che vive sola e ha una stanza vuota, in cambio dell’alloggio.\n\nVolevo chiedervi:\n\nConoscete associazioni o enti che gestiscono questi \"match\" in modo sicuro?\n\nQualcuno di voi ha avuto esperienze simili o conosce qualcuno che lo fa?",
        "upvotes": 8,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1qgjd11/abitare_con_un_anziano_in_cambio_di_aiuto_come/"
    },
    {
        "id": "1qg7o3z",
        "author": "Low-Lie3408",
        "title": "Torinesi: cosa amate e cosa cambiereste del vostro quartiere (e di Torino)?",
        "content": "Ciao a tutti! \nSto cercando di raccogliere opinioni su Torino direttamente da chi la vive ogni giorno. Mi piacerebbe sapere cosa pensate del vostro quartiere e della città in generale — sia in positivo che in negativo.\nSe vi va di rispondere, potete seguire queste domande (anche solo alcune):\n1️⃣ Sul vostro quartiere\nIn che quartiere vivete?\nQual è la cosa che vi piace di più del vostro quartiere?\nCosa invece vi piace meno o cambiereste?\n2️⃣ Su Torino in generale\nQual è la cosa che amate di più di Torino?\nQual è invece il problema più grande della città secondo voi?",
        "upvotes": 14,
        "comments": 58,
        "media": null,
        "permalink": "/r/torino/comments/1qg7o3z/torinesi_cosa_amate_e_cosa_cambiereste_del_vostro/"
    },
    {
        "id": "1qgeggd",
        "author": "notnecessarily_here",
        "title": "Aromantici?",
        "content": "ho bisogno di conoscere gente aromantica come me, ma non conosco eventi o cose simili. Consigli?\n\n(20M)",
        "upvotes": 3,
        "comments": 23,
        "media": null,
        "permalink": "/r/torino/comments/1qgeggd/aromantici/"
    },
    {
        "id": "1qgd53z",
        "author": "PotentialMountain374",
        "title": "Trasferimento a torino",
        "content": "Buonasera,\n\nSono un ragazzo di 31 anni che dovrà trasferirsi per lavoro a Torino (stellantis) da maggio/giugno.\n\nSto ancora valutando se prendermi un appartamento da solo o una camera singola.\n\nVorrei avere la vostra opinione su quali zone considerare, magari ben connesse sia con il centro che con l ufficio e non troppo periferiche. Ho una macchina e avró bisogno di parcheggio nelle immediate vicinanze.\n\nGrazie mille!",
        "upvotes": 4,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1qgd53z/trasferimento_a_torino/"
    },
    {
        "id": "1qgbmle",
        "author": "Lamarta19",
        "title": "Comprare casa a Mirafiori Nord",
        "content": "Ciao a tutti! Io e il mio compagno stiamo cercando casa da comprare e volevo avere qualche opinione su Mirafiori Nord, cosa ne pensate della zona? Come sicurezza, vivibilità,  zone verdi ecc? In alternativa stiamo valutando anche Moncalieri, Grugliasco oppure altri quartieri come Parella e Pozzo strada (oltre a Santa Rita e Crocetta dove però non stiano trovando nulla al nostro budget)\nGrazie \n\nUPDATE nello specifico stiamo considerando la zona tra Corso Cosenza e Corso Tazzoli",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1qgbmle/comprare_casa_a_mirafiori_nord/"
    },
    {
        "id": "1qgcedk",
        "author": "SirNo4151",
        "title": "Palestre torino",
        "content": "Buonasera a tutti, vorrei qualche consiglio sulle palestre a Torino. Qual è la migliore secondo voi?",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1qgcedk/palestre_torino/"
    },
    {
        "id": "1qg6qtf",
        "author": "New_Strength27",
        "title": "Partner palestra",
        "content": "Ciao a tutti! Quest'anno vorrei iniziare un percorso di allenamento, in palestra o a casa, tuttavia ho difficoltà ad essere costante perciò cerco qualcun× con cui spronarci a vicenda e iniziare il percorso insieme. L'obiettivo è migliorare la composizione corporea e tonificare.. possiamo organizzare sessioni in presenza o remoto, basta non mollare!! Mood e vibes tranquille, sentiamoci! ✨💪🏼 ",
        "upvotes": 7,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1qg6qtf/partner_palestra/"
    },
    {
        "id": "1qg54um",
        "author": "Critical-Ruin-4059",
        "title": "I giardini reali sono aperti fino a che ora?",
        "content": "Ieri poco prima delle 18 sono entrato dall'ingresso di palazzo reale perché volevo vedere come erano i giardini reeali di sera. Vedevo tutti che stavano uscendo ho sentito anche uno mormorare tra sé qualcosa tipo \"a quest’ora che sta per chiudere…”. Però online risulta che chiudano alle 19, quindi doveva mancare più di un'ora. Ad ogni modo non sono più entrato perché avevo paura di essere rimproverato 😂",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1qg54um/i_giardini_reali_sono_aperti_fino_a_che_ora/"
    },
    {
        "id": "1qg7vux",
        "author": "HardLollo",
        "title": "Bar aperitivo crocetta",
        "content": "Migliori bar dove posso fare un aperitivo in zona crocetta?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1qg7vux/bar_aperitivo_crocetta/"
    },
    {
        "id": "1qfmbok",
        "author": "Free_Particular_1054",
        "title": "Curiosità palazzo via Roma",
        "content": "Ciao a tutti! Lavorando in via Roma mi capita sempre di trovare guide turistiche davanti al palazzo dove si trovano lego store/guess/swatch. Non sono mai riuscito a sentire cosa dicessero e su internet non ho trovato assolutamente nulla, qualcuno sa dirmi perché è così attrattivo per le guide turistiche e se ha una storia particolare? Grazie mille! ",
        "upvotes": 67,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2ryonh0hnydg1.jpeg?auto=webp&amp;s=633bbabbfdae039c54eeb77325418241a7f318e8"
        },
        "permalink": "/r/torino/comments/1qfmbok/curiosità_palazzo_via_roma/"
    },
    {
        "id": "1qg4acz",
        "author": "Garaad252",
        "title": "Looking for weekend hiking groups in Turin?",
        "content": "Hey everyone! I’m based in Turin these days and was wondering if there are any hiking groups that go out on weekends.\n\nAlso, is winter hiking around here generally doable/safe, or do most people wait for spring? I’m used to hiking but not very familiar with the local conditions yet.\n\nThanks in advance!",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1qg4acz/looking_for_weekend_hiking_groups_in_turin/"
    },
    {
        "id": "1qfphp1",
        "author": "Low-Lie3408",
        "title": "Migliori e peggiori zone di Torino",
        "content": "Sto valutando di trasferirmi  a Torino e vorrei sentire l’opinione di chi la città la vive davvero.\nVi chiederei, se possibile, di condividere:\nLa vostra TOP 5 delle migliori zone dove vivere a Torino, spiegando brevemente perché le ritenete valide (es. servizi, sicurezza, trasporti, vita di quartiere, costo della vita, ecc.).\nLe zone che secondo voi è meglio evitare, sempre motivando la scelta (rumore, sicurezza, degrado, collegamenti, ecc.).\nNon cerco risposte “giuste o sbagliate”, ma punti di vista personali basati sull’esperienza.\nGrazie ",
        "upvotes": 12,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1qfphp1/migliori_e_peggiori_zone_di_torino/"
    },
    {
        "id": "1qfe2k2",
        "author": "mart1na71",
        "title": "fare amicizia in uni è tremendo",
        "content": "è da due anni che vivo a Torino e ho veramente pochissimi amici, sará perchè spesso non riesco ad andare all'università perchè vivo lontano (Grugliasco) ma le volte che sono andata ho notato che fare amicizia è davvero stra complicato, sará perché sono terrona ma nel mio corso avrò fatto amicizia con 1/2 persone.. consigli?",
        "upvotes": 23,
        "comments": 45,
        "media": null,
        "permalink": "/r/torino/comments/1qfe2k2/fare_amicizia_in_uni_è_tremendo/"
    },
    {
        "id": "1qffgdk",
        "author": "mart1na71",
        "title": "è cosí complicato trovare lavoro",
        "content": "è da 6 mesi che io e il mio ragazzo stiamo cercando lavoro perché lui essendo di Taranto vorrebbe trasferirsi qui a Torino per stare con me ma nulla, non riusciamo a trovare un lavoro mandando curriculum.. a lui andrebbe bene qualsiasi lavoro è molto intraprendente, ha venti anni e certificazione da bagnino e sta prendendo la certificazione per il muletto. ha diploma aziendale e vorrebbe fare il contabile ... \ncome deve fare per trovare un lavoro da remoto??",
        "upvotes": 15,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1qffgdk/è_cosí_complicato_trovare_lavoro/"
    }
]