[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 11,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 714,
        "comments": 5203,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1o13lj2",
        "author": "BunnyBunny777",
        "title": "California bans loud commercials on Netflix (and others)",
        "content": "Newsom singed the bill effective 2026.  This should be a federal law.  Watching a show only to have a commercial suddenly start blaring 25 db louder is just menacing.  ",
        "upvotes": 61,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1o13lj2/california_bans_loud_commercials_on_netflix_and/"
    },
    {
        "id": "1o0zet1",
        "author": "Individual-Cut9977",
        "title": "Need new Netflix show recs that actually keep you hooked",
        "content": "I just finished my last series and now Im stuck scrolling for something good Everything either feels too slow or gets boring after a few episodes\n\nWhat are some shows on Netflix that pulled you in right away and actually stayed good till the end",
        "upvotes": 100,
        "comments": 264,
        "media": null,
        "permalink": "/r/netflix/comments/1o0zet1/need_new_netflix_show_recs_that_actually_keep_you/"
    },
    {
        "id": "1o0s46h",
        "author": "Substantial_Copy_576",
        "title": "Anyone else stopped new TV shows until it has finished?",
        "content": "It’s not just Netflix but every single streaming platform out there are taking 2-3 years per season.\n\nIt’s super annoying, by the time the new season arrives, I barely remember anything about the show and all hype is long gone.\n\nHonestly, I’m skipping a lot of shows until it’s pretty much confirmed for final season or nearing it.\n\nAnd I definitely skip Netflix’s 2 part releases until they are all out. E.g. Wednesday season 2\n\n",
        "upvotes": 129,
        "comments": 56,
        "media": null,
        "permalink": "/r/netflix/comments/1o0s46h/anyone_else_stopped_new_tv_shows_until_it_has/"
    },
    {
        "id": "1o1beem",
        "author": "La_hOley",
        "title": "Did nobody in the town know that Ed Geins mother was dead in Monster?",
        "content": "Just couldn’t help but notice that even after she died he just kept referring to her as Mother as if she was still alive and the town didn’t seem to bat an eye. Wouldn’t the town of known in some way? It’s not like she died somewhere secluded and she had an actual funeral with her own gravestone. Is this a mistake or does this have any relevance to Ed Geins story?",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o1beem/did_nobody_in_the_town_know_that_ed_geins_mother/"
    },
    {
        "id": "1o0w83p",
        "author": "sbailey7643",
        "title": "I actually enjoyed the Ed Gein Story",
        "content": "I have seen a lot of negative back lash regarding the series, but I actually enjoyed this season. \nFrom researching a bunch of the case, I find a lot of accuracy, and less inaccuracies. \nWhat are your thoughts?",
        "upvotes": 49,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1o0w83p/i_actually_enjoyed_the_ed_gein_story/"
    },
    {
        "id": "1o1fvdq",
        "author": "Sudden_Pop_2279",
        "title": "Alice In Borderland Achieves Rare Streaming Feat With Season 3",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o1fvdq/alice_in_borderland_achieves_rare_streaming_feat/"
    },
    {
        "id": "1o1fa7g",
        "author": "ToonAdventure",
        "title": "The Bad Guys: Breaking In NEW SERIES Trailer | Netflix Family",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o1fa7g/the_bad_guys_breaking_in_new_series_trailer/"
    },
    {
        "id": "1o0kro4",
        "author": "croissantdeprived",
        "title": "Finally, Nurse Jackie is on Netflix!",
        "content": "7 seasons, 80 episodes of absolutely bingeable, brilliant tv.\n\nI've been waiting forever for this to stream on a service with no ads.\n\nIf you haven't seen it, you should. Witty dialog, complex storylines, well developed characters. Amazing acting, especially by Edie Falco and Merritt Wever. ",
        "upvotes": 135,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1o0kro4/finally_nurse_jackie_is_on_netflix/"
    },
    {
        "id": "1o1dxcz",
        "author": "JamieReleases",
        "title": "Train Dreams | Official Trailer",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o1dxcz/train_dreams_official_trailer/"
    },
    {
        "id": "1o1gmt1",
        "author": "izsgHD",
        "title": "Should I go inside?",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ffn4pk1d8xtf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1o1gmt1/should_i_go_inside/"
    },
    {
        "id": "1o1g0a8",
        "author": "ElLucifer666_",
        "title": "Black Rabbit RANT!",
        "content": "RANT! I only watched Black Rabbit because I saw reviews on here saying the ending was such a mind twist!\n\nFirst off the when I found out Jules had sexually assaulted Anna which - was ignored by Jake.WHO IS JULES. I literally had to restart all over from episode one to find out who Jules IS. There is no character build up. \n\nThis series is very vague and all over the place the only reason I kept watching was because users on here said the ending was a plot twist. Honestly the whole reason why I watched was waiting for this twist that never came. I was expecting some psychological thriller by the way people talked about it and this series was so BLAND. Waste of time. Not sure how this got any good reviews. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o1g0a8/black_rabbit_rant/"
    },
    {
        "id": "1o1elk2",
        "author": "rohanad1986",
        "title": "First Festive Look at Rowan Atkinson in Netflix's 'Man vs Baby'",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o1elk2/first_festive_look_at_rowan_atkinson_in_netflixs/"
    },
    {
        "id": "1o1e6di",
        "author": "Leo1951",
        "title": "New to Netflix",
        "content": "Yes, I'm old and only recently got rid of cable and started streaming. I just watched the first two seasons of The Way Home and really liked them. I know that I can purchase season 3 on Prime, but will it eventually be available on Netflix?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o1e6di/new_to_netflix/"
    },
    {
        "id": "1o1e3qg",
        "author": "Atlast_2091",
        "title": "Train Dreams | Official Trailer | Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o1e3qg/train_dreams_official_trailer_netflix/"
    },
    {
        "id": "1o1e0qd",
        "author": "Sad-Procedure-8160",
        "title": "Demon Slayer Age question",
        "content": "The Question:\nHey, I am 12 years old would yous any I could watch demon slayer or is it to violent? Also this question is related to guys who watched demon slayer. Also thanks if somebody of you helped me",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1o1e0qd/demon_slayer_age_question/"
    },
    {
        "id": "1o1caoe",
        "author": "onigidi",
        "title": "TV series on murderers",
        "content": "I guess I'm going to get backlash on this, but here we go:\n\nA few years ago the TV series on Jeffrey Dahmer came out. It got a ton of criticism for romantisising Dahmer and his story. I really enjoyed it, even if it made me feel kinda yucky for liking it so much. Haven't rewatched it tho, because it felt wrong in some way. Idk. \n\nWhy aren't people giving the same energy to other TV series on other murderers, like Ed Gein? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o1caoe/tv_series_on_murderers/"
    },
    {
        "id": "1o16ixa",
        "author": "Most_Yesterday9014",
        "title": "Epic Shows Ending in 2025",
        "content": "In 2025 we got the final seasons of Squid Games, You, Alice in Borderlands, Sandman, and Stranger Things. Seems like the end of an era even though some of those shows were around much earlier than others.",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1o16ixa/epic_shows_ending_in_2025/"
    },
    {
        "id": "1o118jb",
        "author": "No_Resolution315",
        "title": "\"Never Have I Ever\"- the only show where they show high school as it is?",
        "content": "As a fan of american teen dramas, i feel like \"Never have i ever\" is the only show where they show school like as it is. And where teenagers behave like teenagers not some 35 year olds with bunch of experience and shit. \n\nAlso, in this show, there are like class breaks, projects, extra credits and everything. And other shows be like girls trying hard to be the \"it\" girl. Cross-Sleeping with everyone in a particular gang. Drugs, bullying, and everything but actualy studying or schooling. \n\nOr does schools in america are actually like that? As an indian myself, \"Never have i ever\" was the only show that comes comparitively close to how we knew school as. ",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1o118jb/never_have_i_ever_the_only_show_where_they_show/"
    },
    {
        "id": "1o10vjr",
        "author": "NjXLoneWolf",
        "title": "The Ed Gein Story. Didn’t love it. Didn’t hate it.",
        "content": "I just finished the last episode, and I believe the show was intended to be more of a social commentary, almost borderline satire. I didn’t hate it but didn’t love it either. At first I was getting annoyed by the clear inaccuracies, or embellishments and what seemed like lazy writing. It feels more like the show was designed to critique modern fascination with blood lust, and the twisting of stories by the media, authors, writers, movies, etc. for entertainment. The girlfriend seemed more like a schizophrenic hallucination or possibly a symbol of a textbook female lover in a horror story. She didnt feel like a real character. Her dialogue was off, she was inconsistent, and unrealistic. I think that was the point. They didn’t want to spell the underlying message out for the viewers. \n\nNow with all that said, I wish they didn’t go about it this way. This show had real potential to be great. It was shot well, the music was good, good actors, interesting dialogue at times, the real story was crazy enough. But there were many scenes that were forced in there with no significance. Pulling you out of the story and into one of Ryan Murphy’s strange fantasies. Also the title is misleading, the title “The Ed Gein Story” gives the impression this is a somewhat accurate representation of the actual Ed Gein Story. It is far from that. While i finished the show, i lost interest halfway through episode 6. I honestly wouldn’t recommend it. Watch Mindhunter or American Primeval instead lol. \n",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o10vjr/the_ed_gein_story_didnt_love_it_didnt_hate_it/"
    },
    {
        "id": "1o19qs9",
        "author": "littleplantmama",
        "title": "Can someone help me identify this show based in Thailand?",
        "content": "In the mid 2010s I watched a show on Netflix about a woman who moves to or is visiting Thailand. It was a very cozy feeling show in the beginning and I’ll be honest I don’t full remember everything that happens but I remember loving it and being in awe of Thailand. I do remember her having a nice little house by the beach. If anyone knows what I’m talking about please help! Sorry for the lack of details. ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o19qs9/can_someone_help_me_identify_this_show_based_in/"
    },
    {
        "id": "1o0qibm",
        "author": "Sudden_Pop_2279",
        "title": "I think what makes Alice in Borderland one of my favorite shows is that it ACTUALLY has a justified reason for having such insane plot armor",
        "content": "Alice in Borderland has some... pretty crazy plot armor. ESPECIALLY in season 2 episode 7, where we had Heiya straight up take a full mag of a machine gun and survive HOURS later (while funnily enough, Ann \"died\" from two shots).\n\nNiragi was by far the craziest example. Dude got lit on fire, fell off the building into the pool, tackled into a burning building, was coughing up blood all of seaosn 2 and then took a shotgun blast, ALL of which he survived.\n\nWhat I love so much is that the show ACTUALLY has an explination for such insane plot armor; the will to live. The Borderland's are a test of how much each character wants to survive (the games). The stronger your will, the more likely you are to live. That's why someone like Heiya can take so much punishment, because she's made it clear she does NOT intend to die\n\nIt makes moments when you're on rewatch hit different, like when Usagi tells Arisu in episode 2 \"I know I'll do anything to stay alive\".",
        "upvotes": 12,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o0qibm/i_think_what_makes_alice_in_borderland_one_of_my/"
    },
    {
        "id": "1o1bg84",
        "author": "LADbible",
        "title": "Charlie Hunnam explains bizarre Ed Gein dance sequence in Netflix show finale: Exclusive",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o1bg84/charlie_hunnam_explains_bizarre_ed_gein_dance/"
    },
    {
        "id": "1o183if",
        "author": "Objective-Move25",
        "title": "Need shows featuring rich, ambitious people.",
        "content": "So I'm someone who gets motivated by watching people work hard, scheme, talk about ambition, and all that. But in a lived in way, not in a Ted talk or reality TV way. I've slowed down a bit in the past few months, feels like I haven't been doing as much as I should do. Can you recommend me shows that would get me working harder again? I'm talking about shows like Queen's Gambit, Self Made, Suits, etc.",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1o183if/need_shows_featuring_rich_ambitious_people/"
    },
    {
        "id": "1o142qx",
        "author": "TopTierProphet",
        "title": "I just watched the katseye show on netflix and here's my review of the girls who didn't make it to the final six.",
        "content": "First off, all of these girls are much more talented than 99% of people in the world. They are the most talented of the talented, and would completely blow average joe or sue out of the water in terms of musical ability. So when I am criticizing these girls, i'm criticizing them relative to other girls on the show.\n\n**Brooklyn:** Brooklyn always seemed out of place compared to the other girls. She was like a cross country runner in a room full of sprinters, she just seemed like she didn't belong. That doesn't mean she was untalented, it just meant that she didn't fit the overall vibe compared to other girls. I think that's a big reason why she was eliminated so early.\n\n**Iliya**: She was similar to Brooklyn in that she seemed like a cross country runner trying to be a sprinter, meaning she seemed out of place compared to the other girls. There's no doubt that Iliya is a talented singer, but she doesn't fit the k-pop vibe. I feel like she'd have been a more successful solo artist instead.\n\n**Emily:** Emily has a very distinctive look about her. Her face is distinctive looking but not in an unappealing sort of way. No doubt, she is a very talented dancer and was easily the best out of the entire group. I could see her becoming a very good backup dancer somewhere.\n\n**Karlee:** I think she was eliminated simply because she's a step or two lower compared to other girls. She didn't stand out as being attractive, didn't stand out as being a really good dancer, or stand out as being a really good singer. There were girls who were simply better looking and more talented compared to her across all aspects. Her chances of making the final squad were going to be low.\n\n**Lexi:** Lexi had such a cute and innocent looking face and demeanor about her. Her face is quite cute and neotenous and when combined with her soft spoken personality, this made her stand out in terms of charisma and star power. While not a top singer or top dancer, she was good enough to not look completely out of place. If she'd have never left, she probably would have made the team.\n\n**Hinari:** I didn't see anything wrong with Hinari but I think she was a little bit too young. If she'd have been a couple years older, she may have had a better chance of making it.\n\nThat's everyone who stood out to me.\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o142qx/i_just_watched_the_katseye_show_on_netflix_and/"
    },
    {
        "id": "1o0bnmo",
        "author": "ADMlN-",
        "title": "Ed Gein series felt insulting and narcissistic",
        "content": "From a purely horror, acting and even artistic standpoint, this was well done, but it was just wayyyy too try-hard. \n\nIt feels as if Ryan Murphy is insulting us as viewers. He thinks we are too dumb to understand what he's trying to deliver, so he repeats his messages in as many drawn out disturbing ways as possible.  \n\nAnyone else feel this way?  ",
        "upvotes": 36,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1o0bnmo/ed_gein_series_felt_insulting_and_narcissistic/"
    },
    {
        "id": "1o12se7",
        "author": "miyyukii",
        "title": "Any websites to recommend that allows me to watch love island au/usa/uk from season 1?",
        "content": "i’m from singapore and i really like this series but i’m only able to watch seasons 4 &amp; 5 from netflix :( i have been trying to find a website that works and has episodes from season 1 but can’t, please help! ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o12se7/any_websites_to_recommend_that_allows_me_to_watch/"
    },
    {
        "id": "1o0e7iq",
        "author": "ElectroElk31",
        "title": "Catch Me If You Can, would a Frank Abagnale style con work today or would tech stop it?",
        "content": "Just finished rewatching Catch Me If You Can and I keep getting stuck on how much of Abagnale’s success relied on people trusting a confident story and paper records. He forges checks, pretends to be pilots and doctors, and basically wins on smooth talk, timing, and exploiting gaps in how institutions verified things back then. Looking at 2025, there are two clear directions. Modern banks, airlines, and employers have more automation, KYC checks, instant database lookups, and cross-referenced ID services that can flag fakes in seconds. A fake resume or a paper letter seems much harder to use to fool those systems. Digital trails and audit logs make it easier to trace and stop suspicious activity.\n\nBut there’s also a huge amount of real personal data out there from breaches and data brokers, and that can be stitched together to build very believable identities ( I myself try and remove and monitor these with privacy apps like Cloaked). Deepfakes and AI can clone voices or make convincing video snippets. Human trust is still a major vulnerability: social engineering works because people rush, want to help, or assume an authority figure is legitimate. A modern operator could combine old-school charm with new tech  build an online persona first, then use carefully timed phone or in-person moves to close the deal. Some targets would be harder today and others are still shockingly soft. Big finance, enterprise HR, and major airlines are much tighter. Small hospitals, local businesses, and customer-support teams at smaller services often rely on phone calls and quick checks, which feels like low-hanging fruit. Logistics and delivery systems can also be manipulated if you know the right touchpoints.\n\nMy mental image of a 2025 Abagnale is someone who layers things: scraped data to bootstrap a backstory, polished social media and LinkedIn history, AI-generated voice clips for cold calls, and then a confident in-person moment where people fill in the blanks. Or it could be less theatrical and more distributed: exploit gaps in onboarding flows, trick CS systems, and collect many small wins across dozens of targets instead of one big caper.  \nWould a charismatic impersonator still pull it off today, or has tech made that kind of con obsolete? If someone tried something like this now, where would you expect them to succeed first and where would modern verification stop them quickly? Any examples of modern scams that felt like a Catch Me If You Can remake but for the internet age?",
        "upvotes": 23,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1o0e7iq/catch_me_if_you_can_would_a_frank_abagnale_style/"
    },
    {
        "id": "1o1fmi2",
        "author": "jayraj__",
        "title": "Stranger Things show worth watch?",
        "content": "I haven’t even watched the trailer, but my guess is this is a kids’ show where some unrealistically lucky kids get adventure, and the whole world revolves around them. Nothing else going on in the outside world. Completely just a writer’s fantasy. Typical cringe shit-ass show, similar to Indian serials, lol.",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1o1fmi2/stranger_things_show_worth_watch/"
    }
]