[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 14,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1p1suvv",
        "author": "chunkybonks",
        "title": "The Beast in Me - Matthew Rhys is perfection",
        "content": "I have been a huge fan of Matthew Rhys for years. Hello Brothers and Sisters and The Americans. He usually plays the good guy. What a departure this role was. His facial expressions alone are so telling. He definitely pulled off the suave sociopathic part hands down. \n\nNow Claire Danes was something else. I kept wishing she would have reined her face in at least 50%. It was just too much. Too much quivering. Too much warbling. Get it together woman. \n\nBrittany Snow is in everything these days. \n\nThis was one of the best Netflix original series in awhile. They’ve been pumping out a lot of junk lately. I was genuinely excited to hit play on the next episode and see how this all ended up. ",
        "upvotes": 277,
        "comments": 100,
        "media": null,
        "permalink": "/r/netflix/comments/1p1suvv/the_beast_in_me_matthew_rhys_is_perfection/"
    },
    {
        "id": "1p1w5jd",
        "author": "TwlightPrincess",
        "title": "Looking for something not depressing to watch on Netflix",
        "content": "Any suggestions for something to watch that is not depressing on Netflix? Could be a show or movie. I’m depressed so I need to find something interesting, possibly funny just not depressing please",
        "upvotes": 41,
        "comments": 125,
        "media": null,
        "permalink": "/r/netflix/comments/1p1w5jd/looking_for_something_not_depressing_to_watch_on/"
    },
    {
        "id": "1p250yu",
        "author": "SisterPERIOD",
        "title": "TV isn't apart of the household?? We're in the same house",
        "content": "For the past two days, when I try to watch it says my TV isn't apart of the household. It's my mom's account but I live with her?? \n\nI looked it up and all I got was you have to live together and be on the same wifi. We do have two wifi boxes but I've tried connected to both and still nothing. \n\nAlso, it's just us. Only three TVs are logged into the account. Idk what plan we have but it was literally just fine so?\n\nI just wanna watch demon slayer bro 😭😭",
        "upvotes": 5,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1p250yu/tv_isnt_apart_of_the_household_were_in_the_same/"
    },
    {
        "id": "1p1uzt4",
        "author": "CheesecakeExotic5713",
        "title": "The beast in me",
        "content": "I finished the whole season in my 8 hour overnight shift 😭 i was so into it and honestly i kept flip flopping between Nile being guilty or not. I also keep seeing a lot of Aggie hate but i thought the role was played very well and i would also be freaking out is a presumed murderer brought me out to his “running path”",
        "upvotes": 23,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1p1uzt4/the_beast_in_me/"
    },
    {
        "id": "1p28i4p",
        "author": "fvcklight",
        "title": "who would have ended up with who? THE SOCIETY",
        "content": "\nugh. i just rewatched this show and im so dissappointed in netflix. like come on atleast give us a proper ending man :(\n\nanyway i was thinking about it and lowk i feel like im kinda dissappointed in the allie/will dynamic. like i get she liked him but him liking her out of nowhere is js like weird. i mean personally i wouldn't wanna be with someone who slept with a girl he's liked for a long time and automatically like me out of nowhere. \n\ni personally think allie and harry were a much better fit. trust me ik harry's problematic, but when they were playing fugitives he was really worried about allie and i lowk think they would be a very good couple. solid endgame couple. i think they balance each other out in the best way possible.\n\nsam and grizz. omg i love them. honestly wish they had more screen time as a couple. i love them sm. they are the cutest. definately endgame couple. also, helena and luke. i love them too. i wish we got to see their wedding :(\n\nnext one is js my personal opinion (very unpopular or popular idk) i was watching ep 9 and the conversarion between gordie and kelly had some vibes? idk i feel like they'd be a great couple or friends who knows? i wish we got more of that dynamic. but if i wanted kelly to end up with someone it would probably be gordie, i really like their dynamic.\n\nwhat do you guys think? who would have ended up with who?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p28i4p/who_would_have_ended_up_with_who_the_society/"
    },
    {
        "id": "1p27z2w",
        "author": "Korkova_Zatka",
        "title": "why doesnt changing my resolution preference work??",
        "content": "so i go into profile settings, all that, set the resolution to high, then return back to my show and its fine, 10 seconds later its back in 144p for some reason. help",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p27z2w/why_doesnt_changing_my_resolution_preference_work/"
    },
    {
        "id": "1p220wy",
        "author": "quitofilms",
        "title": "The Carmen Family Deaths",
        "content": "Interesting, on one hand the police acknowledge his autism diagnosis but on the other hand they skip over it in making their case and make him out to be a criminal mastermind. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p220wy/the_carmen_family_deaths/"
    },
    {
        "id": "1p27feu",
        "author": "OctoberIsBetter",
        "title": "If you want to feel a little better about keeping your Netflix subscription, this might help.",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p27feu/if_you_want_to_feel_a_little_better_about_keeping/"
    },
    {
        "id": "1p25lmn",
        "author": "RioDeIdeas",
        "title": "Frankenstein",
        "content": " 62 millones de vistas en sus primeros 10 días en Netflix!  \r\nGrande Guillermo del TORO!! Frankenstein”  es hermosa 🥰\nMuchas felicidades, que viva el cine! \r\n\r\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p25lmn/frankenstein/"
    },
    {
        "id": "1p248iu",
        "author": "KeysEffect",
        "title": "Verification BS",
        "content": "With all of the internet security issues going on in the world, it's not a good idea to email for verification and FORCE YOUR CUSTOMERS TO CLICK AN EXTERNAL LINK TO GET A TEMPORARY CODE!!!! I don't mind being asked for verification, but doesn't look legit and makes us question if we're getting scammed.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p248iu/verification_bs/"
    },
    {
        "id": "1p1w1bd",
        "author": "Mustard-cutt-r",
        "title": "Carman Family Deaths",
        "content": "This documentary that has it all: money, murder and autism! Did he do it? He’s definitely Autistic as all get out, but that doesn’t make him psycho- but it doesn’t make him not psycho either. If he needed to be on meds and he wasn’t on them, especially with so much childhood trauma, I could see him cracking. And from what I understand, physical oceanography and the study of currents is not “junk science” and has led to many rescues and sunken boats for a long time now. I feel his defense was reaching pretty hard to bring in one random navy seal to counter a bulk of the marine scientist’s claims. ",
        "upvotes": 5,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1p1w1bd/carman_family_deaths/"
    },
    {
        "id": "1p1hlnq",
        "author": "Emergency_Air4575",
        "title": "Am I the only one…",
        "content": "Am I seriously the only human left out here crossing my fingers and hoping, praying even, that LOUDERMILK gets a fourth season? Because I’m not ready to let this show go just yet.",
        "upvotes": 26,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1p1hlnq/am_i_the_only_one/"
    },
    {
        "id": "1p1hrkr",
        "author": "Playful_Copy_4255",
        "title": "the Beast in Me - props",
        "content": "No spoilers, but super random question- currently on ep 4; anyone know where that blue tea/coffeepot set that Madison’s family has is from? I love it lol ",
        "upvotes": 10,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p1hrkr/the_beast_in_me_props/"
    },
    {
        "id": "1p1tpo5",
        "author": "Jason2648",
        "title": "movie like frankenstein 2025",
        "content": "i was thinking about watching this but i dont know if i could sit through a 2 and a half hour movie(maybe that sounds bad,lol)i do like oscar issac and mia goth though",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1p1tpo5/movie_like_frankenstein_2025/"
    },
    {
        "id": "1p0xovx",
        "author": "Rednit69",
        "title": "Why so dark?",
        "content": "Is it just me or is anyone else tired of intentionally darkly lit movies and or series? I get the intent is to create a mood but so many new shows have gone too far. I.E. Frankenstein, Black Rabbit etc. Thoughts?",
        "upvotes": 159,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1p0xovx/why_so_dark/"
    },
    {
        "id": "1p1w5z8",
        "author": "MysteriousAd3954",
        "title": "Can’t remember the title of this strange show",
        "content": "I swear about a year or two ago Netflix had this ambiance “show” that was just really strange almost trippy visuals to music and I can’t remember what it was called or if it still exists I swear it was called like “ambiance TV” or something. Any help would be amazing ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p1w5z8/cant_remember_the_title_of_this_strange_show/"
    },
    {
        "id": "1p1tm9b",
        "author": "le-chat-blase",
        "title": "Movie Playlist Needed",
        "content": "I don’t know who I need to send this to, but in case a person with power reads this, Netflix needs to create movie playlist options. Say I have a family Christmas and I want certain movies to play back to back without anyone needing to search for the next one. I would create a Christmas movie playlist in the Netflix app so they play one after the other. \nI’ve been thinking this for years, but never typed it into the information superhighway. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p1tm9b/movie_playlist_needed/"
    },
    {
        "id": "1p1ojf2",
        "author": "islandhpper",
        "title": "Simply Alice/Simplemente Alicia",
        "content": "I’m so surprised with how great this show is! At first, it seemed a bit ridiculous from an American perspective. But watch it past the first couple episodes, and it grows in depth and maturity.  The plot twists are great and there’s a wide cast of interesting characters. It handles complicated situations and feelings with empathy, a very human and without cruelty. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p1ojf2/simply_alicesimplemente_alicia/"
    },
    {
        "id": "1p1l6lf",
        "author": "Hungarian_menace",
        "title": "Can't watch the walking dead.",
        "content": "Every time I try to open the walking dead tab on netflix on my phone it just says \"Can't connect to netflix\" every other show still works and the show is still on netflix where I live. Is there any way I can fix this?",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p1l6lf/cant_watch_the_walking_dead/"
    },
    {
        "id": "1p1iz0l",
        "author": "FreeRangeThinker",
        "title": "Billionaires Bunker",
        "content": "What if Max’s biological father is Guillermo Falcone? \n\nAfter all Max and Guillermo look alike and Max’s mom was banging Guillermo for twenty-eight years.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p1iz0l/billionaires_bunker/"
    },
    {
        "id": "1p1vrp3",
        "author": "General0urumov007",
        "title": "4 minutes into the Night Agent - Season 2 and I just can't even with the acting",
        "content": "There were some horrible characters like Farr in season 1 who were miscast but season 2 already started off hot. The female agent working with Cody Banks aka Sutherland, is the most unconvincing agent I've seen. Just the way she walks with the gun. I genuinly wonder how these things even happen. It's such low production quality that gets the green light and makes it's way onto netflix. \n\nThis show's premise is actually pretty cool but the acting and other minor stuff are make this show completely unwatchable. Also, the way Sutherland runs is comical. He runs like he shit his pants. I have zero desire to continue this show future",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1p1vrp3/4_minutes_into_the_night_agent_season_2_and_i/"
    },
    {
        "id": "1p1a3g1",
        "author": "fanofmets12",
        "title": "Netflix ad plan &amp; Stranger Things",
        "content": "I don't have Netflix at the moment. I haven't had Netflix in over three years. \n\nWould the ad plan include the upcoming Stranger Things season 5 or no? ",
        "upvotes": 9,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1p1a3g1/netflix_ad_plan_stranger_things/"
    },
    {
        "id": "1p17bpa",
        "author": "Cold_Link_1057",
        "title": "suggest some cozy movies to watch",
        "content": "can y'all Please suggest some good movies/series with winter vibes.\n\n\nany genre will work fantasy, muder mystery, thriller, rom com.\n\nAnything with good story\n\n\n\n\n\n",
        "upvotes": 10,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1p17bpa/suggest_some_cozy_movies_to_watch/"
    },
    {
        "id": "1p21oze",
        "author": "No_Juggernaut1405",
        "title": "what the fuck is 2 screens",
        "content": "NOW ONLY ONE PERSON CAN WATCH?? like youre giving me more reasons to give up on netflix. its so annoying like what the heck happened to you netflix. its used to be fun to watch and easy to use like!!!! 😪\n",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1p21oze/what_the_fuck_is_2_screens/"
    },
    {
        "id": "1p1oefc",
        "author": "Lenasthoughts",
        "title": "Series Until you Burn Languages",
        "content": "I keep seeing so many posts about how good Until You (or Until You’re Born) is on Netflix, so I finally wanted to check it out for myself. But when I opened it, there’s literally no English audio option showing up for me. I’ve refreshed, checked all my settings, and even tried different devices, but it still doesn’t appear.\n\nIs anyone else dealing with this or know why the English language isn’t available?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p1oefc/series_until_you_burn_languages/"
    },
    {
        "id": "1p1lrq3",
        "author": "its_jb",
        "title": "The Longest Yard (audio issue)",
        "content": "I don’t think that this is necessarily a Netflix issue but since they are streaming it and I’m trying to watch it, I’m going to write it hear (pun intended).\n\nThe voice lines are currently only playing in the right side of my headset but all other audio (music, background sound, etc.) play in both. I didn’t know what else to do with this information.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p1lrq3/the_longest_yard_audio_issue/"
    },
    {
        "id": "1p1lf8w",
        "author": "bid0u",
        "title": "What's wrong with Weeds subtitles being all over the place?",
        "content": "Seriously, it's not even for impaired people since even when the character is in the middle of the screen, they're all fucked up to the side: [https://i.snipboard.io/GQxNMn.jpg](https://i.snipboard.io/GQxNMn.jpg)",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1p1lf8w/whats_wrong_with_weeds_subtitles_being_all_over/"
    },
    {
        "id": "1p1l03g",
        "author": "HELLFIRECHRIS",
        "title": "Physical Asia episode 8",
        "content": "Spoilers up to episode 8\n\nI’m Not the only one who thinks they handled the problem with Japan incredibly badly right ?\n\nThey spend most of episodes 7 and 8 saying we’d see Japan retry the statues event because of a technical glitch, then it jumps straight from turkey losing the ball throwing to Japan losing the statue retry.\n\nYou don’t get to see the end of the ball throwing to see if Mongolia or Japan win it (based on the points I’m assuming it was Japan), it goes straight to the Japanese team saying they’ll try to hold on to be in the top 3 then immediately cuts to them letting go not even showing us what time they managed and the Japanese captain celebrating even though they apparently did the worst in that event out of all 6 teams ?\n\nWere Japan just really bad at the statue event or did they give up because they knew they were already safe ? None of this is explained.\n\nI get that the glitch messed them up but it was handled terribly and turned into a confused mess.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p1l03g/physical_asia_episode_8/"
    }
]