[
    {
        "id": "1it67cb",
        "author": "SimonWestAMA",
        "title": "Hello reddit! I am Simon West, the Director of OLD GUY, an upcoming action-comedy starring Christoph Waltz, Cooper Hoffman, and Lucy Liu. You may know me from my previous films - CON AIR, LARA CROFT: TOMB RAIDER, THE EXPENDABLES 2 to name a few. Here to answer your questions, ask me anything!",
        "content": "",
        "upvotes": 264,
        "comments": 186,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/023deaz4r3ke1.png?auto=webp&amp;s=70e227faa5c31b7b4f9cbed549e2467efa343032"
        },
        "permalink": "/r/movies/comments/1it67cb/hello_reddit_i_am_simon_west_the_director_of_old/"
    },
    {
        "id": "1itlqyx",
        "author": "LiteraryBoner",
        "title": "Oscar Bingo XII Submission Thread",
        "content": "#Welcome to Oscar Bingo XII. I'll be your host, [LiteraryBoner](https://images.fineartamerica.com/images/artworkimages/mediumlarge/3/well-dressed-animal-10-lizard-matthias-hauser.jpg). For over a decade now we keep coming back to this silly game in which **YOU, the users** suggest things that might actually happen at the live ceremony of the Academy Awards. Then our friends over at www.print-bingo.com create us a game card generator so we can all play in real time on March 10th.\n\nOkay, let's get in to it!\n\n* [Last year's submission thread](https://www.reddit.com/r/movies/comments/1b3c4fv/official_oscar_bingo_submission_xi_thread/)\n* [Last year's card pickup thread](https://www.reddit.com/r/movies/comments/1ba54d1/oscar_bingo_game_card_pickup_thread_xi/)\n* [Last year's game thread](https://www.reddit.com/r/movies/comments/1bbnpzr/oscar_bingo_game_thread_xi/)\n* [List of nominees for this year](https://www.oscars.org/oscars/ceremonies/2025)\n\nHere's how it works!\n\n**Submit ideas for things that might happen during the Oscars.**\n\n* **Max 80 characters** as to fit on in the bingo squares\n\n* Do **NOT** put more than one submission in a single comment. That cannot be voted on properly and will be removed. \n\n* Live ceremony only, no red carpet or off camera awards\n\n* Predicting specific wins, such as Emilia Perez wins Best Picture, will not be considered as they limit possibilities (And who wants to wait until the final five minutes to get a Bingo?)\n\n* Please try and keep submissions within reason and not too specific. \n\n* Use the list of presenters to try and guess what the bits or featured films will be!\n\n* This thread will be randomized and votes hidden. If there's lots of suggestions be sure to refresh a few times or scroll for a bit to spread the love!\n\n**Once we have collected submissions for a couple of days, we will un-sticky the thread and start to make game cards with your suggestions. Our friends over at *www.print-bingo.com* will again be doing some specialty work with us for this.**\n\n* We will post a gamecard pickup thread the Friday before the Oscars (the 28th). All you will have to do is follow the link in the thread, do the captcha, and a small link will appear to your gamecard PDF. \n\n**We'll post the game thread Oscar Sunday. The point of the Game Thread is to discuss game related things and for me to make final decisions on the more open to interpretation squares. It will be stickied as will all these threads.**\n\n---\n\nHost:\n\n* Conan O'Brien\n\nList of presenters:\n\n* Robert Downey Jr.\n* Da'Vine Joy Randolph\n* Cillian Murphy\n* Emma Stone\n* Halley Berry\n* Penelope Cruz\n* Elle Fanning\n* Whoopi Goldberg\n* Scarlett Johansson\n* John Lithgow\n* Amy Poehler\n* June Squibb\n* Bowen Yang\n* Joe Alwyn\n* Sterling K. Brown\n* Willem Dafoe\n* Ana De Armas\n* Selena Gomez\n* Lily-Rose Depp\n* Goldie Hawn\n* Connie Nielsen\n* Ben Stiller\n* Oprah Winfrey\n\n\n#Submit in the comments and have fun!",
        "upvotes": 4,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rUj9cNUXRKL6B7MpVtPHZfMrpba0Sp-qw_Huw363WaM.jpg?auto=webp&amp;s=1eb25b8818ed611b0682bb57ab397f9aee0bb190"
        },
        "permalink": "/r/movies/comments/1itlqyx/oscar_bingo_xii_submission_thread/"
    },
    {
        "id": "1itbdyk",
        "author": "MarvelsGrantMan136",
        "title": "First Image of John Krasinski in the New 'Jack Ryan' Movie",
        "content": "",
        "upvotes": 5590,
        "comments": 913,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/i497pk7ot4ke1.jpeg?auto=webp&amp;s=bbf6dde1c9013599813cc612d3a16d3f2a4bd57d"
        },
        "permalink": "/r/movies/comments/1itbdyk/first_image_of_john_krasinski_in_the_new_jack/"
    },
    {
        "id": "1itdyy3",
        "author": "MarvelsGrantMan136",
        "title": "Norm Macdonald Documentary in the Works at Netflix with Judd Apatow Directing",
        "content": "",
        "upvotes": 2142,
        "comments": 128,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mYzBP-8DOoMrmp2d6nWUi9e829h_qWF-lJZ7H-kdDWQ.jpg?auto=webp&amp;s=19dc8aa3e60012fec8bcc28420cf89a8e288da31"
        },
        "permalink": "/r/movies/comments/1itdyy3/norm_macdonald_documentary_in_the_works_at/"
    },
    {
        "id": "1itl5xc",
        "author": "MarvelsGrantMan136",
        "title": "Daniel Craig Drops Out of DC Studios War Movie ‘Sgt. Rock’",
        "content": "",
        "upvotes": 604,
        "comments": 64,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/yH3pCFOZcRnQ6azgpDObLoMiGpfcT3e9jm_xChxNGho.jpg?auto=webp&amp;s=4258eac19a035db9cde13ba69ccbeaca4a49ebb1"
        },
        "permalink": "/r/movies/comments/1itl5xc/daniel_craig_drops_out_of_dc_studios_war_movie/"
    },
    {
        "id": "1itd7dh",
        "author": "mille73",
        "title": "What movie could you not maintain your suspension of disbelief?",
        "content": "Suspension of Disbelief is when we ignore logical thought to enjoy superhero movies, superhuman assassins, romantic comedies, animatronic serial killers, aliens, and the like.\n\nMost recently Ridley Scott's Gladiator II took me right outta the game.\n\nDid Riddley Scott really ask himself, what was the first Gladiator missing and come up with &gt;!SHARKS! Fucking Sharks. He really said we need great white sharks in the Colosseum! I have never jumped back into reality so fast.!&lt;\n\nMe and my husband paused the movie because we just had to take the time to digest what we were watching. We even tried to Mythbuster this to see if it's even plausible and all we could come up with was &gt;!that someone had to raise baby great white sharks. But everyone knows great whites don't survive in captivity. Was ancient Rome even capable of building a tank big enough to support multiple sharks. what about one shark? And if they weren't in captivity then fishermen caught them? and then transported them to the Colosseum? Nah. Not to mention, the next day the arena was bone dry.!&lt;\n\nI really can't remember when a movie irked me this much. I am very for suspension of disbelief; I WANT to enjoy the story. But that was just too much for me. So what whacky scene took you right outta the movie.",
        "upvotes": 1426,
        "comments": 1933,
        "media": null,
        "permalink": "/r/movies/comments/1itd7dh/what_movie_could_you_not_maintain_your_suspension/"
    },
    {
        "id": "1it6gw6",
        "author": "NoCulture3505",
        "title": "Cheech &amp; Chong's Last Movie [Official Trailer]",
        "content": "",
        "upvotes": 2284,
        "comments": 141,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ir5GnYlPfvxX6QzVDOy5fkomnOpAz0CsbEvS7La9VTE.jpg?auto=webp&amp;s=f5f03f8d8bbb10afeb158aa65fb58f8a733a8004"
        },
        "permalink": "/r/movies/comments/1it6gw6/cheech_chongs_last_movie_official_trailer/"
    },
    {
        "id": "1it78t0",
        "author": "KillerCroc1234567",
        "title": "Prince’s ‘Purple Rain’ to Be Re-Released in AMC Theaters with Dolby Atmos for One Night Only (March 5th)",
        "content": "",
        "upvotes": 757,
        "comments": 42,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/k8Lj6D5sB3IqzKYc_IuJAPO_qurQ5CUKt8XS416fJgE.jpg?auto=webp&amp;s=0736a8bdb82e7d6a6b52f13925c2b0fc9263ed1f"
        },
        "permalink": "/r/movies/comments/1it78t0/princes_purple_rain_to_be_rereleased_in_amc/"
    },
    {
        "id": "1itdr7b",
        "author": "Big-Sheepherder-9492",
        "title": "“20 Days in Mariupol” (2023) is a documentary I think everyone needs to see.",
        "content": "The documentary really doesn’t shy away from what it’s depicting with the Ukrainian invasion. I think we’ve been quite separated from what’s going on over there with what we see on the news (etc.) but the documentary really doesn’t pull its punches when it shows you what an Invasion looks like from the people being invaded. In light of recent (literally hours ago) events — I think that people need to see the type of shit that poor country is dealing with. No Mods - this ain’t political. ",
        "upvotes": 310,
        "comments": 14,
        "media": null,
        "permalink": "/r/movies/comments/1itdr7b/20_days_in_mariupol_2023_is_a_documentary_i_think/"
    },
    {
        "id": "1itin4f",
        "author": "precita",
        "title": "Anyone think \"Jingle all the Way\" with Arnold Schwarzeneggar feels like a Simpsons episode in live-action?",
        "content": "Just rewatched the movie and the whole thing reminded me of a live-action Simpsons episode. Swap Arnold for Homer Simpson looking for the favorite toy for Christmas at the last-minute and that's what it is. But also the humor/comedy of the movie felt exactly like Simpsons in the late 90's (when the movie came out).\n\n They have the santas singing only for Arnold to punch them all out, the neighbor is literally a more annoying version of Ned Flanders, you have Arnold rushing through the mall crashing into customers looking for toys getting beaten up by women calling him a pervert, you have the older police officer on the motorcycle who Arnold keeps crashing into and getting into trouble with, etc. Then you have Sinbad's role and everything else. It's just literally a live-action Simpsons episode.\n\n(also props to Jake Lloyd here for his movie role right before The Phantom Menace only 2 years later)",
        "upvotes": 152,
        "comments": 21,
        "media": null,
        "permalink": "/r/movies/comments/1itin4f/anyone_think_jingle_all_the_way_with_arnold/"
    },
    {
        "id": "1it9c9z",
        "author": "Drink____Water",
        "title": "Morbid question: What is the newest movie in which all the actors of named characters are all dead?",
        "content": "I was following a movie podcast and they noted how all the actors in their 100+ year old movie were dead. I get that dissonance sometimes when I watch old movies, too. It had me wondering what is the newest movie in which all the actors are all passed? What are some of the edge cases? \n\nI have literally no idea how to research this! ",
        "upvotes": 430,
        "comments": 277,
        "media": null,
        "permalink": "/r/movies/comments/1it9c9z/morbid_question_what_is_the_newest_movie_in_which/"
    },
    {
        "id": "1it65li",
        "author": "NoCulture3505",
        "title": "Bring Her Back | Official Teaser",
        "content": "",
        "upvotes": 547,
        "comments": 90,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/O7v3wodMCRA7A6ct2R57Y-EM51-Yv3fOev1SVGOqR-w.jpg?auto=webp&amp;s=63b23e2694f25306bf5d878c1c66e4315eee00c9"
        },
        "permalink": "/r/movies/comments/1it65li/bring_her_back_official_teaser/"
    },
    {
        "id": "1itludd",
        "author": "Puzzleheaded_Bus_112",
        "title": "It Happened One Night (1934) blew me away",
        "content": "\"It Happened One Night\" was the first film to ever win all 5 major academy awards: Best Picture, Best Director, Best Actor, Best Actress, and Best Adapted Screenplay. To this day it still remains one of only 3 total films to do so. And it surely does deserve that regard.\n\nAs a man who, like most other men, isn't exactly a big fan of the romance genre, and surely not rom-coms, this film is an instant all time favorite for me. I was honestly blown away by it as I was watching it, as cheesy as that may sound. I've seen a few romance movies myself, and while some are decent to good, none of them have ever stuck with me, and none of them have ever came close to being labeled an \"all time favorite\". This film takes everything I may dislike, or thought I would dislike about the romance genre and it does it perfectly. \n\nThe story was so damn compelling that even I was rooting for them to get together at the end, and was certainly affected by the emotional rollercoaster Frank Capra took us on. If you would have ever asked me if I would be invested in the romance and relationship of two film characters before this, the answer every single time would have been a solid no. This film managed to take that line of thought and completely throw it out of the window. \n\nThe acting from Clark Gable and Claudette Colbert was simply amazing, and there's no secret as to why both of them managed to take home major awards on the night of the Oscars. To go along with that, the chemistry between them both when they were on screen together was unbelievable. The comedy may be hit-or-miss, but I'm more than willing to excuse that as you can't necessarily expect 1930's comedy to hold up well almost a century later. \n\nOverall, \"It Happened One Night\" is a masterfully written, directed, acted, and shot film that stands the test of time unbelievably well and it's influence has been evident a century later. This, for me, is truly the definition of \"genre-defining\" and will have me viewing romance films in a complete different light from now on. Truly a masterpiece that deserves all the praise it gets.",
        "upvotes": 61,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1itludd/it_happened_one_night_1934_blew_me_away/"
    },
    {
        "id": "1itk2mk",
        "author": "KillerCroc1234567",
        "title": "Jack O’Connell Joins Legendary’s Next Monsterverse Movie",
        "content": "",
        "upvotes": 72,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qSgfr_9r0qFTCgJjglii5tq7TqN-8wyc0VkA1lNkh0k.jpg?auto=webp&amp;s=03b48936ee66ece3e4c597a8570ddc9c2ec3275f"
        },
        "permalink": "/r/movies/comments/1itk2mk/jack_oconnell_joins_legendarys_next_monsterverse/"
    },
    {
        "id": "1itizn5",
        "author": "ForeverBlue101_303",
        "title": "Disney Hires Paramount’s Daria Cercek to Lead Film Studio’s Live-Action Division",
        "content": "",
        "upvotes": 60,
        "comments": 91,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jSwbUkAe_DtRl_AxMH0L6BG7vEZLQPAfGPqjDhUWF3Y.jpg?auto=webp&amp;s=47942ee899899660ac926c274fc485556b0e3945"
        },
        "permalink": "/r/movies/comments/1itizn5/disney_hires_paramounts_daria_cercek_to_lead_film/"
    },
    {
        "id": "1it6ey9",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for A24's 'Bring Her Back', Directed by Danny &amp; Michael Philippou - “A brother and sister uncover a terrifying ritual at the secluded home of their new foster mother (Sally Hawkins).\"",
        "content": "",
        "upvotes": 255,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/f9vkurs8t3ke1.jpeg?auto=webp&amp;s=0b55727a9afb78527e15c30dbeb0a0f584d6340a"
        },
        "permalink": "/r/movies/comments/1it6ey9/official_poster_for_a24s_bring_her_back_directed/"
    },
    {
        "id": "1itahgb",
        "author": "Task_Force-191",
        "title": "Official Poster for 'The Actor' starring Andre Holland, Gemma Chan from Academy Award-nominated director Duke Johnson",
        "content": "",
        "upvotes": 110,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/iqfaschmn4ke1.jpeg?auto=webp&amp;s=e90538f7a702e916ac0362d17e46b81507771178"
        },
        "permalink": "/r/movies/comments/1itahgb/official_poster_for_the_actor_starring_andre/"
    },
    {
        "id": "1isuv1r",
        "author": "OverHeat6321",
        "title": "What’s with the ketchup bottle twist in Goodfellas?",
        "content": "After they halfway kill Billy Bats, the crew stops off to pick up some supplies to bury him. During dinner with Tommy's mother at 2am, Jimmy twists a glass ketchup bottle on his meal. If I ever see these actual glass bottles at the store I'd get one and try it to see what happens. There's so many stories behind this masterpiece of a movie. There has to be a story about this. ",
        "upvotes": 1324,
        "comments": 204,
        "media": null,
        "permalink": "/r/movies/comments/1isuv1r/whats_with_the_ketchup_bottle_twist_in_goodfellas/"
    },
    {
        "id": "1itcr9k",
        "author": "NoCulture3505",
        "title": "‘Street Fighter’ Movie Finds Its Director in Kitao Sakurai",
        "content": "",
        "upvotes": 68,
        "comments": 64,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HH4KbEA7jRmJtuk25n_7ngQc-G2a2da2cxKR021LrUI.jpg?auto=webp&amp;s=c8ca2dffb57ca545a64343631a47e28f2d12d165"
        },
        "permalink": "/r/movies/comments/1itcr9k/street_fighter_movie_finds_its_director_in_kitao/"
    },
    {
        "id": "1itb2gg",
        "author": "Lumina_Amaryllis",
        "title": "What’s a Movie You Loved the First Time But Didn’t Enjoy on Rewatch?",
        "content": "I’m curious if anyone else has had this experience. There are movies that hit hard the first time you watch them, but when you go back to them, they just don’t have the same magic. Whether it’s because of the plot twist being spoiled or just not connecting to it the second time, some movies just don’t hold up.\n\nWhat’s a movie you loved initially but didn’t enjoy as much on a rewatch? What do you think changed for you?",
        "upvotes": 68,
        "comments": 468,
        "media": null,
        "permalink": "/r/movies/comments/1itb2gg/whats_a_movie_you_loved_the_first_time_but_didnt/"
    },
    {
        "id": "1itg5kv",
        "author": "SparklePony3",
        "title": "Horror Movie ‘Marshmallow,’ Starring ‘Ted’ Actress Georgia Whigham, Lands Spring Release",
        "content": "",
        "upvotes": 31,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aVsyCydXuAgLwDggdGDXfDU24MLfKkHrtHpEozs4_ls.jpg?auto=webp&amp;s=e632cfca977ad16dae51c13ac7ab4d7871146d4d"
        },
        "permalink": "/r/movies/comments/1itg5kv/horror_movie_marshmallow_starring_ted_actress/"
    },
    {
        "id": "1ishmwk",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'Bong Joon-Ho's 'Mickey 17'",
        "content": "",
        "upvotes": 4903,
        "comments": 211,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mujv35p7jxje1.jpeg?auto=webp&amp;s=448f80076e3dd1177825e15e7b8d883d24399309"
        },
        "permalink": "/r/movies/comments/1ishmwk/new_poster_for_bong_joonhos_mickey_17/"
    },
    {
        "id": "1iscomv",
        "author": "whitemilkythighs",
        "title": "Chinese film Ne Zha 2 beats Inside Out 2 ($1.699 Billion) and becomes highest-grossing animated film of all time globally",
        "content": "",
        "upvotes": 9418,
        "comments": 1225,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TuWtLF2KJGQ6TLMMz9UZaJQwnGyOI5sajBJbhmQswig.jpg?auto=webp&amp;s=e23207a81fd2df0fe105a59169921727f65e8718"
        },
        "permalink": "/r/movies/comments/1iscomv/chinese_film_ne_zha_2_beats_inside_out_2_1699/"
    },
    {
        "id": "1isz0k3",
        "author": "NChSh",
        "title": "\"Blue Streak\" is the perfect action movie to utilize a comedy star",
        "content": "If you look at the reviews for Martin Lawrence &amp; Luke Wilson's [Blue Streak](https://www.rottentomatoes.com/m/blue_streak), you will see a lot of bad critic reviews and pretty good but not amazing audience reviews.  It appears to be just a regular action/comedy.  I mean Martin's gotten some big success with the Bad Boys franchise, but most of what he does doesn't exactly have broad appeal.  From afar, this movie again seems like just some generic TNT at 3 pm movie.\n\nThe thing though is that it takes [Saves the Cat](https://www.amazon.com/Save-Last-Book-Screenwriting-Youll/dp/1932907009) to the absolute extreme.  Basically, the idea is you have your hero literally save a cat so that the audience likes them more for doing a heroic/cool act.  This movie's formula is a constant string of Saves the Cat scenes but they use Martin's comedy to carry each scene.  Like it has him in a heist where he's an expert safe cracker, then to a bizarre [pizza man](https://www.imdb.com/title/tt0181316/mediaviewer/rm475174912/?ref_=tt_ph_1_1) alias, to pretending to be a cop and pick pocketing Luke Wilson, to talking his way onto the police force, to finding a bunch of stolen hubcaps, to disarming Dave Chapelle as as a criminal in back-to-back-to-back scenes.  He's just an incredibly charismatic guy pulling off things in incredible ways.  You take the basic idea of a scene and then just let Martin freelance.  The \"stolen hubcaps\" scene is also a Chekhov's gun!\n\nI think that this is **the** blueprint for approaching an action movie where you have a comic star.  Just set them up to \"Save the Cat\" or do something bad ass over and over and over again and just let them cook.  Like shouldn't Martin be getting a salary or something?  The answer is who cares!  It takes away from the pacing.  They kind of address it...but not really.  I'd rather have him solving crimes every three minutes in imaginative ways instead of giving that kind of backstory.\n\nAlso having an almost A list actor in Luke Wilson act as straight man is no small part to the success of this movie.  I have to imagine he loved filming it too.  Anyway I recommend the living shit out of this movie, it's awesome",
        "upvotes": 304,
        "comments": 89,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zuBZR2_ftRU4Eb7JxBpZd2sO_euyzcsiNHTOF-RS3GE.jpg?auto=webp&amp;s=569f87bb7c3f635294ac5ccdbcb7fdc593950708"
        },
        "permalink": "/r/movies/comments/1isz0k3/blue_streak_is_the_perfect_action_movie_to/"
    },
    {
        "id": "1issb7e",
        "author": "MarvelsGrantMan136",
        "title": "UFO Conspiracy Thriller From Joseph Kosinski, Jerry Bruckheimer Ignites Bidding War",
        "content": "",
        "upvotes": 725,
        "comments": 83,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SEiTxesYyT5_osOrSmV5ITZ_Nc_Ub4cr3u_tRu-WXzo.jpg?auto=webp&amp;s=5add0b919a75327c8fb3c9ab0768c25682e6cb46"
        },
        "permalink": "/r/movies/comments/1issb7e/ufo_conspiracy_thriller_from_joseph_kosinski/"
    },
    {
        "id": "1itjury",
        "author": "lawrencedun2002",
        "title": "Lionsgate Dates Jason Statham Action Thriller ‘Mutiny’",
        "content": "Lionsgate announced today that Mutiny, its action thriller produced by and starring Jason Statham, will be released on January 9, 2026.",
        "upvotes": 12,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4cZPhQiGRNnZ-VvQDvth0v7bwiIDwpeoyN_UqXaIQWw.jpg?auto=webp&amp;s=05d4ca5f79ed8fa32b2f279879b829f203f56e3c"
        },
        "permalink": "/r/movies/comments/1itjury/lionsgate_dates_jason_statham_action_thriller/"
    },
    {
        "id": "1itaqai",
        "author": "SonnyJoeFoxx",
        "title": "This is niche: I learned that one of the first direct-to-video erotic thrillers, BODY CHEMISTRY (1990), was shot on campus at UCLA, so I retraced the filming locations",
        "content": "",
        "upvotes": 33,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/oKN5rhwVBdp0sayIvmYP63Rly7huc-nV9fowO7ufR88.jpg?auto=webp&amp;s=8e4981eeb6efe3e13b4e4e9c8b9a060f3634546f"
        },
        "permalink": "/r/movies/comments/1itaqai/this_is_niche_i_learned_that_one_of_the_first/"
    },
    {
        "id": "1ish4ps",
        "author": "NoCulture3505",
        "title": "First Poster for 'Freaky Tales'",
        "content": "",
        "upvotes": 2766,
        "comments": 426,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/rr9yreznfxje1.jpeg?auto=webp&amp;s=a918b2a2ce8de35c29d6dc515e988b4a4fc190b0"
        },
        "permalink": "/r/movies/comments/1ish4ps/first_poster_for_freaky_tales/"
    },
    {
        "id": "1itku5p",
        "author": "Fart_lngredients",
        "title": "Movies like Mallrats?",
        "content": "I love the Mallrats movie, aswell as all the spin offs (clerks, jay and silent bob…etc) \n\nI’m looking for more movies with fun music, funny awkward characters etc. \nfor reference I also love SLC Punk, UHF (weird Al) and movies like dumb and dumber, Wayne’s world, bill and Ted \n\nI’m craving a really good movie in this region. Just don’t know where to look. ",
        "upvotes": 9,
        "comments": 33,
        "media": null,
        "permalink": "/r/movies/comments/1itku5p/movies_like_mallrats/"
    },
    {
        "id": "1itai3u",
        "author": "Task_Force-191",
        "title": "The Actor - Official Trailer - In Select Theaters March 14",
        "content": "",
        "upvotes": 29,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2Ic7Hr_zSMWfooK0la_vUYzP8IsXkIzJvVKLxPIloXc.jpg?auto=webp&amp;s=596a174d36f9f2d5d3901d1da791c67c574b6f3d"
        },
        "permalink": "/r/movies/comments/1itai3u/the_actor_official_trailer_in_select_theaters/"
    },
    {
        "id": "1iss7vx",
        "author": "Okilokijoki",
        "title": "North America and Oceania release poster for Nezha 2",
        "content": "",
        "upvotes": 587,
        "comments": 61,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4gr120lorzje1.jpeg?auto=webp&amp;s=d898c0fa87bb9c323247bf58dfba0212270fffe5"
        },
        "permalink": "/r/movies/comments/1iss7vx/north_america_and_oceania_release_poster_for/"
    },
    {
        "id": "1iso0ki",
        "author": "Psykpatient",
        "title": "Troy - Achilles vs Hector, original audio",
        "content": "",
        "upvotes": 943,
        "comments": 261,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/AUZ8ytkMnWDSeoQ_X32Q8P890w7YQkWbQRL-p1ImngU.jpg?auto=webp&amp;s=9f37c7e1dda192d25290ba1d6426f30366655590"
        },
        "permalink": "/r/movies/comments/1iso0ki/troy_achilles_vs_hector_original_audio/"
    }
]