[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 488,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1hm18t3",
        "author": "AutoModerator",
        "title": "NFL Christmas Gameday Megathread",
        "content": "1:00pm ET - Kansas City Chiefs @ Pittsburg Steelers\n\n4:30pm ET - Baltimore Ravens @ Houston Texans",
        "upvotes": 33,
        "comments": 607,
        "media": null,
        "permalink": "/r/netflix/comments/1hm18t3/nfl_christmas_gameday_megathread/"
    },
    {
        "id": "1hmi2o0",
        "author": "Robemilak",
        "title": "Adam Sandler Shares the First Teaser for Netflix's Sequel ‘Happy Gilmore 2’",
        "content": "",
        "upvotes": 185,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1hmi2o0/adam_sandler_shares_the_first_teaser_for_netflixs/"
    },
    {
        "id": "1hmqmv2",
        "author": "DotOne4395",
        "title": "10 Highly Anticipated Netflix Movies Coming in 2025",
        "content": "* **Back in Action (January 17)**\n* **The Electric State (March 14)**\n* **Wake Up Dead Man: A Knives Out Mystery (2025)**\n* **The Old Guard 2 (2025)**\n* **Fear Street: Prom Queen (2025)**\n* **The Life List (2025)**\n* **Frankenstein (2025)**\n* **Happy Gilmore 2 (2025)**\n* **Havoc (2025)**\n* **Plankton: The Movie (2025)**\n\n[**View in Web**](https://www.cinemablind.com/highly-anticipated-netflix-movies-of-2025/) **|** [**Anticipated Netflix Shows**](https://www.cinemablind.com/highly-anticipated-netflix-shows-of-2025/)\n\n",
        "upvotes": 9,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hmqmv2/10_highly_anticipated_netflix_movies_coming_in/"
    },
    {
        "id": "1hmhk3t",
        "author": "Robemilak",
        "title": "Carry-On pulled nice numbers",
        "content": "‘CARRY-ON’ had 97M views in its first 10 days of streaming. The biggest Netflix film release this year. What did you think of it? I'd says it's a decent addition to Christmas movie list.",
        "upvotes": 40,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1hmhk3t/carryon_pulled_nice_numbers/"
    },
    {
        "id": "1hm64x4",
        "author": "AnonymousUser8476249",
        "title": "Netflix needs a “Live” button / option",
        "content": "There needs to be a way to jump to the live action when viewing a live event such as an NFL game.  \nApple TV latest version, latest os, etc. \nWhen you switch away from the game and then come back, Netflix holds your spot.  Which is great when watching regular shows and movies, but sucks when watching a live event.\n\nI understand that this may be baked into the core architecture of Netflix, but they need to at least add a button to jump to the live action.  Currently the only way to do this is to fast forward until you reach the live spot.  \n\nHopefully someone from Netflix sees this and makes it happen.",
        "upvotes": 227,
        "comments": 113,
        "media": null,
        "permalink": "/r/netflix/comments/1hm64x4/netflix_needs_a_live_button_option/"
    },
    {
        "id": "1hmcjls",
        "author": "ohhhKid",
        "title": "Korean zombie movies are top tier",
        "content": "New show called Happiness out on Netflix, korean based, zombie theme show. I love zombie movies, but “all of us are dead” “kingdom” and “happiness” are awesome choices! Really hope to see more Korean zombie movies/shows in the future",
        "upvotes": 56,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1hmcjls/korean_zombie_movies_are_top_tier/"
    },
    {
        "id": "1hmrjj8",
        "author": "HearshotKDS",
        "title": "Your Friend, Nate Bargatze - Spin to Win?",
        "content": "Watched the first 25 minutes of this special last night. I generally like Nate's comedy, but was surprised to see him come out to a weird technicolor fishbowl stage. Then the camera starts slowly spinning around him as he kind of continually turns to face it as it moves. And he keeps doing that for as long as I could watch. Jokes were pretty good suburb Dad observational humor stuff. But I couldn't get over the constant spinning, a bit of a strange choice on how they filmed this. What do you think /r/Netflix?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hmrjj8/your_friend_nate_bargatze_spin_to_win/"
    },
    {
        "id": "1hmqa5z",
        "author": "Imaginary_Stomach139",
        "title": "Netflix doesn't work anymore since 4 days. Smart TV too old?",
        "content": "Hi, me and my parents share a Netflix account together. Everyone has a seperate profile. I use it via my PC via internet browser, my Dad uses it via his LG smart TV, and my mom uses it via her Panasonic Smart TV.\n\nMy parents live together in the same house, and the smart TVs are connected via Wlan to the internet. But since like 4 days the Netflix App doesn't work anymore on my mothers TV. It always shows like no connection. Even though the TV has internet, because the YouTube app still works just fine.\n\nIt shows a error code: NW-4-8 ( if i remember correctly, if not will update you tomorrow). Then I read you should put the power away from the TV and from the Internet router. So I did that for like 1 Minute and put the power back on, but still the same. It's still not working and still same error code.\n\nCan someone help? Anyone has a solution? If you need the excact panasonic model, I can tell you tomorrow.\n\nThanks and merry christmas\n\nHave a nice evening\n\nPS: My mom said she did update the TV, but still didn't help\n\nPS2: On the TV I just turned off the power strip (cause you don't really have access to the cable itself without moving the TV), and on the internet router I unplugged the power cable\n\n  \nUpdate: So she just took a few pictures. But she said she tried to delete the app, but didn't work. But coulnd't test it myself, but i belive her 😅\n\nShe said TV is around 10 years old. Didn't expect it to be that old.. So is the TV really to old now to get Netflix access?\n\n  \nHere the pictures - [https://ibb.co/pKYNnYF](https://ibb.co/pKYNnYF)",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hmqa5z/netflix_doesnt_work_anymore_since_4_days_smart_tv/"
    },
    {
        "id": "1hmq6c9",
        "author": "techfinpro",
        "title": "Netflix Brings ‘Carry-On’ Director Jaume Collet-Serra’s Crime Thriller ‘RUN ALL NIGHT’ to Streaming, After Chart-Busting Success",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hmq6c9/netflix_brings_carryon_director_jaume/"
    },
    {
        "id": "1hmp903",
        "author": "JigglyMoly",
        "title": "Squid Game Hustle (Squid Game Movie Netflix Song Lyrics 🎶)",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hmp903/squid_game_hustle_squid_game_movie_netflix_song/"
    },
    {
        "id": "1hmbxt7",
        "author": "jwmoz",
        "title": "Black mirror white Christmas ",
        "content": "I would go as far to say that this episode is a masterpiece. Multiple concepts combined, multiple threads of the story that meet at the end, and a fantastic ending that leaves me smiling at the music, horror and execution. ",
        "upvotes": 13,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hmbxt7/black_mirror_white_christmas/"
    },
    {
        "id": "1hm5mb8",
        "author": "Impossible_Good4644",
        "title": "Looking for some good netflix series recommendations.",
        "content": "\nI recently watched Ozark and it was the best series i have ever seen. I like thriller, romance and feel good series. I would love some recommendations. Thanks",
        "upvotes": 28,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1hm5mb8/looking_for_some_good_netflix_series/"
    },
    {
        "id": "1hmmqsb",
        "author": "MentalWolverine8",
        "title": "Has Netflix Resolved The Windows App Issue?",
        "content": "Hello everyone, \n\nI own a Dell XPS 17 and used to watch Netflix in 4K DoVi without any issues. \n\nHowever, after the update where they basically replaced the native app of Windows with the browser extension, I was unable to watch anymore, so I cancelled the subscription. \n\nCan anyone confirm if that issue is resolved? \n\nI would like to hear from XPS owners especially, who faced this issue. \n\nThank you. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hmmqsb/has_netflix_resolved_the_windows_app_issue/"
    },
    {
        "id": "1hma0e6",
        "author": "tokyographer",
        "title": "Any thoughts on the One Hundred Years of Solitude series?\n",
        "content": "Just been watching the series after reading the book several times. The series seems pretty accurate to the book, although Gabriel Garcia Marquez never wanted the book to be put into a movie. It seems that stretching the book into an 8 episode series gave a lot of opportunity to make it very faithful to the book.",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hma0e6/any_thoughts_on_the_one_hundred_years_of_solitude/"
    },
    {
        "id": "1hmkqpr",
        "author": "Lost-Leading",
        "title": "Netflix subtitles too bright in HDR (S95B) OLED TV",
        "content": "Is there a way to change the brightness of the subtitles?\nI tried to change through the Netflix website but it isn’t working for HDR tv shows or movies only for SDR for some reason\n https://www.netflix.com/settings/subtitles/ATIIYHXDDNC4VPGWZBY5XOMSRY\n\nIs there any other way to fix this?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hmkqpr/netflix_subtitles_too_bright_in_hdr_s95b_oled_tv/"
    },
    {
        "id": "1hm8a8e",
        "author": "Dry-Detective-8933",
        "title": "Can’t stream live sports from phone to tv",
        "content": "I have a Chromecast I can normally stream Netflix shows from my iPhone to Chromecast just fine but when it comes to live sports it won’t stream anyone know why? Restrictions? If so it’s dumb!",
        "upvotes": 11,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1hm8a8e/cant_stream_live_sports_from_phone_to_tv/"
    },
    {
        "id": "1hmc04d",
        "author": "Feanixxxx",
        "title": "Would a VR headset make the Bird Box Monsters irrelevant?",
        "content": "I mean to the outside, your eyes can't be seen. And you can't see the world. \n\nYou can have the world be shown in a cartoonish style or with modern cameras see the world just like you would with your own eyes.\n\nSo just get a good amount of power banks onto you, use the VR headset and you are good to live again?",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hmc04d/would_a_vr_headset_make_the_bird_box_monsters/"
    },
    {
        "id": "1hmp2np",
        "author": "royalcrown28",
        "title": "Too much CoD:MW2 for me not to know that a barret semi auto sniper rifle fires .50 caliber rounds, not .30",
        "content": "",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hmp2np/too_much_codmw2_for_me_not_to_know_that_a_barret/"
    },
    {
        "id": "1hmqrbk",
        "author": "DotOne4395",
        "title": "10 Highly Anticipated Netflix Shows Coming in 2025",
        "content": "* **American Primeval (January 9)**\n* **The Night Agent Season 2 (January 23)**\n* **The Recruit Season 2 (January 30)**\n* **Zero Day (February 20)**\n* **Wednesday Season 2 (2025)**\n* **You Season 5 (2025)**\n* **One Piece Season 2 (2025)**\n* **Squid Game Season 3 (2025)**\n* **Nobody Wants This Season 2 (2025)**\n* **Stranger Things Season 5 (2025)**\n\n[**View in Web**](https://www.cinemablind.com/highly-anticipated-netflix-shows-of-2025/) **|** [**Highly Anticipated Netflix Movies**](https://www.cinemablind.com/highly-anticipated-netflix-movies-of-2025/)",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hmqrbk/10_highly_anticipated_netflix_shows_coming_in_2025/"
    },
    {
        "id": "1hmjjnf",
        "author": "MollysBlooms",
        "title": "Filtering by English speaking only ",
        "content": "Feel free to delete if this question has already been asked. \n\nDoes Netflix offer a way to filter out all foreign/subtitle films? Don’t get me wrong, I occasionally enjoy a good subtitle only film or a dubbed film that is well done, but lately it seems my entire feed is all foreign films and shows and it’s getting annoying. I’d prefer a way to filter and see all English speaking options that are not dubbed or contain subtitles every now and then. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hmjjnf/filtering_by_english_speaking_only/"
    },
    {
        "id": "1hmq7g8",
        "author": "fionaapplelover101",
        "title": "Unfortunately, Squid Game Season 2 was Disappointing. ",
        "content": "I just finished watching the entirety of the new season of Squid Game, and to say I was sorely disappointed would be an understatement. It is not bad by any means, but in comparison to its glowing predecessor, it falls short in every way. It felt like I was watching a new action/thriller movie halfway through, and there are so many underdeveloped storylines mixed in. What has occurred in the years that have gone by since the last season? I get that 456 became immersed in hunting down the creators of the game and stocked up on weaponry, but that’s basically all the info the show gives us. \n\nAnyways, without giving away spoilers, I thought the ending of the season felt extremely out of place and even unfinished. I genuinely had to look up if Netflix was releasing the new season in 2 separate parts because of how unfinished it felt. So much is left unanswered, and so many new storylines are created when the old ones have not even been finished yet. Season one felt immersive and created emotional connections in relation each character; season two just feels like a cash grab for a show that never needed a second seqson. ",
        "upvotes": 0,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1hmq7g8/unfortunately_squid_game_season_2_was/"
    },
    {
        "id": "1hmpyl4",
        "author": "True-Reserve4307",
        "title": "Squid game 2 is trash",
        "content": "theres no spoilers in this just my general review of sg2. I encourage you to watch the series to fully understand my review.\n\nIf i had to describe the series so far in one word itd be:\n\n1. repetitive\n2. frustrating\n\nI just finished watching all 7 episodes and I gotta say it was subpar. The events were too obvious, foreshadowing was shallow, plot twists were also obvious, their voting order was obvious. The show was made far too obvious. I think the games that the characters had to survive in were formed to be alot simpler, to accommodate for western viewers that arent familiar with korean games. Not alot of scenes actually made me surprised, nervous or excited. However, I did feel alot of frustration to the mc's inability to manipulate his peers better.\n\nAs I was watching the series I also realized that the 'surprise' factor was no longer present because of its reoccurring themes from sg1. i.e. the format of the episodes, the methods that characters were developed, how characters reacted in situations...\n\nImo the only good parts of the film were:\n\n1. some metaphors\n2. symbolism\n3. character development\n\nJust to conclude, if you watch this movie off pure dopamine its good. If you use your cognitive ability the series is trash. Imo movies like the joker, joker 2 have a lot more depth to the scenes and are significantly better.\n\n(i didn't want to include too many sections that I did enjoy so that you too can enjoy it. Im not shitting on the series just saying what i think of it).\n\nPlease tell me your thoughts on the movie in the comments.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hmpyl4/squid_game_2_is_trash/"
    },
    {
        "id": "1hmolms",
        "author": "ellaryyyy",
        "title": "Squid Game Season 2, who's this Filipino actor?",
        "content": "I'm still in episode 1 but had to pause because I knew his face is very familiar because I've seen him on TV growing up. What's his name? ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1hmolms/squid_game_season_2_whos_this_filipino_actor/"
    },
    {
        "id": "1hm4ouy",
        "author": "CanIStopAdultingNow",
        "title": "Horribly placed commercials",
        "content": "I'm so annoyed. I decided to get Netflix with commercials and they placed a commercial in the middle of the song \"I'm Just Ken\" in the Barbie movie. \n\nHow hard is it to place commercials in programs so they don't ruin what you are watching? ",
        "upvotes": 7,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1hm4ouy/horribly_placed_commercials/"
    },
    {
        "id": "1hmjcum",
        "author": "abhilash512",
        "title": "WWE Raw Netflix 2025: New Shows, Runtime &amp; Returns",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hmjcum/wwe_raw_netflix_2025_new_shows_runtime_returns/"
    },
    {
        "id": "1hm9dcl",
        "author": "aWicca",
        "title": "Extra member from another country and activation?",
        "content": "I am trying to add another household (my parents that live in another country) as an extra member but I am being blocked by country restriction.\n\nI read a lot of posts and what I’ve gathered is that the account only needs to be activated in a OG country, but after that it can be used whenever.\n\nSo realistically can I send a request to my mom, log in to her email through my laptop, activate it, and then give her access?\n\nWould that work?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hm9dcl/extra_member_from_another_country_and_activation/"
    },
    {
        "id": "1hm67r1",
        "author": "OkAdagio4389",
        "title": "Easier way to login and other issues?",
        "content": "Hi so first of all, is there an easier way to login that typing the email and password on the TV? It was so laggy even though I have the best internet around.\nSecondly, as I watch the KC game, different family members at different TVs around the house, one is far behind the other. Why is that? Can it be rectified?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hm67r1/easier_way_to_login_and_other_issues/"
    },
    {
        "id": "1hm3rh5",
        "author": "Extreme_Homework7936",
        "title": "Richard Curtis on Crafting Holiday Magic with \"That Christmas\"",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hm3rh5/richard_curtis_on_crafting_holiday_magic_with/"
    },
    {
        "id": "1hmkp99",
        "author": "Desperate-Skirt-2273",
        "title": "SQUID GAME Season 2",
        "content": "Season 2 of Squid Game just dropped, and I'm curious to hear everyone's thoughts! Did it live up to the hype? Let’s discuss what you liked, didn’t like, or found surprising!",
        "upvotes": 0,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1hmkp99/squid_game_season_2/"
    },
    {
        "id": "1hllhly",
        "author": "techfinpro",
        "title": "The Sandman Star Jenna Coleman Confirms Return for Season 2, Teases 'Cinematic' Scale",
        "content": "",
        "upvotes": 146,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1hllhly/the_sandman_star_jenna_coleman_confirms_return/"
    },
    {
        "id": "1hmbd96",
        "author": "Amos_FR",
        "title": "Prenium membership was paid but when I log in it asks me to finish signing up and choosing a plan",
        "content": "Got 20 bucks removed from my bank account December 24th for the prenium account membership I already had, and now when I connect to my account it says I have to pay. So I'm pretty confused. Did the membership stop? Why? Should I contact Netflix somehow to get my 20 bucks worth back or something?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hmbd96/prenium_membership_was_paid_but_when_i_log_in_it/"
    }
]