[
    {
        "id": "1n6hto7",
        "author": "ObsessionAMA",
        "title": "Hey /r/movies! I'm filmmaker Curry Barker (MILK &amp; SERIAL). My new film, OBSESSION, is premiering this Friday 9/5 at the Toronto International Film Festival as a Midnight Madness selection. Ask me anything!",
        "content": "Hey reddit, I'm filmmaker Curry Barker, and my new film, OBSESSION, is heading to TIFF this week! You might know my directorial feature debut, MILK &amp; SERIAL (2024). \n\nOBSESSION will have its World Premiere at the Toronto International Film Festival this Friday, September 5, as part of the Midnight Madness program. The film stars Michael Johnston, Inde Navarrette, Cooper Tomlinson, and Megan Lawless.\n\nAsk me anything!\n\n**Synopsis:** \n\nObsession plunges into a fever dream of longing, delusion, and the chilling cost of getting exactly what you desire. Bear, a hopeless romantic, gets pulled into a spiral where passion and terror become inseparable.\n\nFrom Curry Barker (Milk &amp; Serial), this visceral, atmospheric thriller fuses psychological horror with a haunting supernatural edge. Starring Inde Navarrette (Superman &amp; Lois), Michael Johnston (Teen Wolf), Cooper Tomlinson (Milk &amp; Serial), and Megan Lawless (The Death That Awaits), Obsession is a twistedlove story that dares to ask: How far would you go to be loved back?\n\n\\-----------------------------------------------------------------------------------------\n\n**TIFF's write-up of the film:**\n\nWoe is Bear (Michael Johnston), who has long carried a torch for his childhood friend Nikki (Inde Navarrette). When another attempted profession of love fizzles, Bear wistfully wishes for romantic reciprocation, unfortunately doing so while in possession of a trinket with supernatural properties of The Monkey’s Paw variety.\n\nSuddenly, Nikki is all over Bear, and he is quick to indulge in this long-desired turnabout while ignoring the ramifications of her intensifying fixation. Before long, Bear’s fantasy turns to nightmare as Nikki’s personality begins to twitch with a disturbing dysphoria that sinisterly suggests her autonomy has been usurped by a malignant entity that wants them both, body and soul.\n\n“Be careful what you wish for” may be a staple in the horror genre, but writer-director Curry Barker enlivens this well-worn premise by lacing its inherent irony with a wickedly wry tone and an anxious tension that’ll plummet the stomach of even hardened Midnighters. Having honed high-concept absurdism and creeping dread from his online productions, Barker deftly demonstrates a savvy command of tone and terror reminiscent of fellow sketch comedian Zach Cregger’s Barbarian.\n\nAs with that auspicious debut, Barker’s first feature preserves an uncomfortable relatability in its hyperbolic scenario. Though literally featuring a customer service call from (and possibly to) Hell, Obsession cuts to the quick as it lays bare the innate violence in romantic objectification with an unforgiving candidness. That's made all the more disarming, thanks to exceptionally nuanced performances, particularly from Navarrette whose “Freaky Nikki” oscillates between doe-eyed desire and devastating torment that will chill you to the bone.\n\n\\----------------------------------------------------------------------------------------------------\n\n**My bio:**\n\nCurry Barker is a writer-director with a bold, visceral style. His work blends raw emotion with psychological horror and dark comedy. He co-created That’s a Bad Idea, his sketch comedy channel, and directed Milk and Serial, both known for their brutal honesty and striking, cinematic visuals.\n\nAsk me anything! Back at 5 PM ET today (Tuesday 9/2) to answer any questions.",
        "upvotes": 65,
        "comments": 48,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qcio23ghiqmf1.png?auto=webp&amp;s=9c6f7be58a60078897704b6190383d562023ba1b"
        },
        "permalink": "/r/movies/comments/1n6hto7/hey_rmovies_im_filmmaker_curry_barker_milk_serial/"
    },
    {
        "id": "1n6mf61",
        "author": "TheCutAMA",
        "title": "Hey reddit, I'm Sean Ellis, director of THE CUT starring Orlando Bloom (The Lord of the Rings franchise), Caitríona Balfe (Outlander) and John Turturro (Severance) in theaters 9/5. It premiered at TIFF 2024. You may know me from my previous films THE CURSED, CASHBACK, &amp; ANTHROPOID. Ask me anything!",
        "content": "Hey reddit, I'm Sean Ellis, director of THE CUT starring Orlando Bloom (The Lord of the Rings franchise), Caitríona Balfe (Outlander) and John Turturro (Severance) in theaters 9/5. You may know me from my previous films THE CURSED, CASHBACK, &amp; ANTHROPOID. Ask me anything!\n\nThe film had its World Premiere at the Toronto International Film Festival last year. Here to answer your questions.\n\nRepublic Pictures will release THE CUT In Select Theaters September 5th!\n\nCheck out the Trailer: [https://paramnt.us/TheCutTrailer](https://paramnt.us/TheCutTrailer)\n\nSYNOPSIS: After a career-ending defeat, a former champion trains for redemption – but as obsession takes hold and reality unravels, he may be spiraling into something far more terrifying.\n\nHere are all of my credits:\n\n[https://www.imdb.com/name/nm1193346/](https://www.imdb.com/name/nm1193346/)\n\nAsk me anything! I'll be back at 11:00 AM ET tomorrow (Wednesday 9/3) to answer your questions!",
        "upvotes": 43,
        "comments": 67,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wdz0f96wqrmf1.jpeg?auto=webp&amp;s=d5685cf32f3353080b4a130229ceb6f076d98877"
        },
        "permalink": "/r/movies/comments/1n6mf61/hey_reddit_im_sean_ellis_director_of_the_cut/"
    },
    {
        "id": "1n7k4gv",
        "author": "MarvelsGrantMan136",
        "title": "James Gunn Announces 'Man of Tomorrow', Releasing in Theaters July 9, 2027",
        "content": "",
        "upvotes": 10269,
        "comments": 1121,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xhIM7IbY8yvGg0vY5Tjn4gGrOhfGWrq1vXJrWdXBxYs.jpeg?auto=webp&amp;s=72c6eac74476f294b30f890173db1a095fe7aef4"
        },
        "permalink": "/r/movies/comments/1n7k4gv/james_gunn_announces_man_of_tomorrow_releasing_in/"
    },
    {
        "id": "1n7h6b1",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'Rental Family'",
        "content": "",
        "upvotes": 5030,
        "comments": 130,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/6ekjoe8fsymf1.jpeg?auto=webp&amp;s=3c8b8bb9e442e1ff52866ebc1ab812865d28bed2"
        },
        "permalink": "/r/movies/comments/1n7h6b1/new_poster_for_rental_family/"
    },
    {
        "id": "1n7isk0",
        "author": "SpeedForce2022",
        "title": "Official Poster for Emerald Fennell’s ‘Wuthering Heights’",
        "content": "",
        "upvotes": 2088,
        "comments": 512,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/6bfmfdb63zmf1.jpeg?auto=webp&amp;s=13b3153d5ba6632de09f540d27828f286db43088"
        },
        "permalink": "/r/movies/comments/1n7isk0/official_poster_for_emerald_fennells_wuthering/"
    },
    {
        "id": "1n7kv42",
        "author": "godgamesgov",
        "title": "Which movie did everyone LOVE but you HATED?",
        "content": "For me it was La La Land.  I think I fell asleep.  It won awards:\n\n*La La Land* received widespread critical acclaim, with high praise directed towards Chazelle's direction and screenplay, cinematography, music, the performances of Gosling and Stone and their chemistry.\n\nI even really do love a good musical.  I've seen quite a few, for example I really liked Moulin Rouge, love much of Broadway, so it's not the musical thing.  I just hated this movie while everyone around me loved it.\n\nWhat movies did you trudge to get through while everyone else sat in rapt attention?",
        "upvotes": 1326,
        "comments": 4100,
        "media": null,
        "permalink": "/r/movies/comments/1n7kv42/which_movie_did_everyone_love_but_you_hated/"
    },
    {
        "id": "1n7r8r3",
        "author": "Cptawesome23",
        "title": "Thunderbolts*",
        "content": "Just watched the Thunderbolts* on Disney+ and I have completely loved it. Whether taken as a whole seperate work or as the culmination of several of the darker heroes storylines, this movie was a treat. The main character Yelena narrates the opening with a realization “there is something wrong with me” and the direction of the movie explores the idea of inner reflection with gusto. Every character in this film has something they are dealing with. Some dark regret they have to deal with, and it culminates in a shared realization of the method by which to deal with one’s pain: friends. The movie implicitly prescribes friends as the cure for depression. It’s heartwarming in every sense and also gives the team an unshakeable bond that was both fun to watch form as well as believable. This was a good movie. It doesn’t have the best storyline in marvel, that honor still belongs to Nebula, but it does tell a coherent and touching story about why we all need friends.",
        "upvotes": 628,
        "comments": 164,
        "media": null,
        "permalink": "/r/movies/comments/1n7r8r3/thunderbolts/"
    },
    {
        "id": "1n7jrlr",
        "author": "darth_vader39",
        "title": "Paris Jackson Says She Had ‘0% Involvement’ in Michael Jackson Biopic After Star Colman Domingo Praises Her Support: They ‘Didn’t Address’ My Script Notes",
        "content": "",
        "upvotes": 1211,
        "comments": 190,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ei5-vzyVYIh17Gc50H9BVqmnIXEajNV_Lt4AUpR2ftM.png?auto=webp&amp;s=c911246d6771329d2d5e55361c8900d99c9c371b"
        },
        "permalink": "/r/movies/comments/1n7jrlr/paris_jackson_says_she_had_0_involvement_in/"
    },
    {
        "id": "1n7zsze",
        "author": "InExactEnds",
        "title": "Dumb Logic ≠ Plot Hole",
        "content": "Plot Holes: Inconsistencies and narrative gaps within a film’s logic or “rules”\n\nDumb Logic: Lazy explanation for something occurring within a story\n\nExample of a Plot Hole: A person is said to have gone missing on the 23rd of July even though earlier in the film, the kidnapper was in a different city on the 23rd of July.\n\nExample of Dumb Logic: A person goes missing, the movie explains the cops are bad at their jobs, and a few months pass. The person is later found in a major character’s basement (after he spent all those months there), and that character was previously a suspect.\n\nPeople often mixed these two up and I thought I’d just share this. You can hate something for having dumb or lazy logic, but that DOESN’T make it a plot hole. This is majorly the case w/ the new film WEAPONS and it drives me up a wall.",
        "upvotes": 138,
        "comments": 79,
        "media": null,
        "permalink": "/r/movies/comments/1n7zsze/dumb_logic_plot_hole/"
    },
    {
        "id": "1n7qd7o",
        "author": "Psykpatient",
        "title": "Bring back dark fantasy you cowards // A look at the history of fantasy movies",
        "content": "",
        "upvotes": 445,
        "comments": 64,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dsxhV20Vqcyy0F1QjOgqta2U7nBjpEeO29_R2Wy4aXA.jpeg?auto=webp&amp;s=ce60bb16c1809690cb4eb48386a7a68802e54a3f"
        },
        "permalink": "/r/movies/comments/1n7qd7o/bring_back_dark_fantasy_you_cowards_a_look_at_the/"
    },
    {
        "id": "1n7h7j9",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'ANEMONE' Starring Daniel Day-Lewis, Sean Bean, and Samantha Morton",
        "content": "",
        "upvotes": 1223,
        "comments": 169,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/244uk8dnsymf1.jpeg?auto=webp&amp;s=e435cdef60e14da2857bfa9c71581aec8452949f"
        },
        "permalink": "/r/movies/comments/1n7h7j9/official_poster_for_anemone_starring_daniel/"
    },
    {
        "id": "1n7isp6",
        "author": "KillerCroc1234567",
        "title": "New Poster for \"Roofman\"",
        "content": "",
        "upvotes": 964,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/fp00x2b43zmf1.jpeg?auto=webp&amp;s=39aa7ee83d8281e3ab2423c70755ea246d9fb748"
        },
        "permalink": "/r/movies/comments/1n7isp6/new_poster_for_roofman/"
    },
    {
        "id": "1n820xe",
        "author": "Yogurtcloset_Choice",
        "title": "The live action speed racer movie was a fantastic piece of media and its awful how it was panned",
        "content": "I remember when the speed racer movie came out I was so excited initially because I loved all the iterations of speed racer, all the cartoons, the manga, the comics, I found the story interesting and the world so different from any other series. Then the reviews came out, and it was panned, even today on rotten tomatoes has a 42% critic and a 60% viewer score. Disappointed I didn't see it until years later when it was available on streaming and I cannot believe I denied myself that long. I don't know why people seem to hate when a movie is heavily stylized or just trying to be fun but it's EXACTLY what it should have been. It captured the feeling of the cartoon and manga very well, all the cheeseyness included. The story was fine if predictable, but who doesn't know the story of speed racer to some extent. The actors who were part of it were very clearly giving 110% to it. The world, as I said before, was EXTREMELY stylized. Beyond even that they had some crazy interesting shots. All while managing to keep the tone of the movie fun BUT serious to the characters even if we would find it ridiculous.\n\nI'm not gonna sit here and say it's a need to watch movie, it's not telling some crazy story that everyone needs to experience. It's not ground breaking in effects, or visuals, or acting. That being said the fact this movie was PANNED on release is criminal. So if you're looking for a movie where the people who made it cared 100% and the actors were giving everything they had and is such a fun time you'll wonder where the time went you should watch it.",
        "upvotes": 63,
        "comments": 34,
        "media": null,
        "permalink": "/r/movies/comments/1n820xe/the_live_action_speed_racer_movie_was_a_fantastic/"
    },
    {
        "id": "1n77xge",
        "author": "MarvelsGrantMan136",
        "title": "28 Years Later: The Bone Temple | Official Trailer",
        "content": "",
        "upvotes": 3864,
        "comments": 777,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GXBV8vTLwxKQ0_qmVJoX2xBdf2tHHbBEBC7lM_Xgid0.jpeg?auto=webp&amp;s=7466492a76c5e1c8e1e6bfa2a2ba29d622397b84"
        },
        "permalink": "/r/movies/comments/1n77xge/28_years_later_the_bone_temple_official_trailer/"
    },
    {
        "id": "1n7hg51",
        "author": "Sunflower13Poppy",
        "title": "Which movie felt like a total slog to get through?",
        "content": "For me, it was The Irishman. I get that it’s well-made and the cast is stacked, but the pacing just dragged, it felt like it was stretching a story that could’ve been told in half the time. I found myself checking the time way too often. It wasn’t bad, but it honestly felt more like an endurance test than a movie at points.\n\nWhat about you?.\n What movie just completely drained your attention?",
        "upvotes": 623,
        "comments": 1416,
        "media": null,
        "permalink": "/r/movies/comments/1n7hg51/which_movie_felt_like_a_total_slog_to_get_through/"
    },
    {
        "id": "1n7eikv",
        "author": "MarvelsGrantMan136",
        "title": "A HOUSE OF DYNAMITE | Official Teaser | Netflix",
        "content": "",
        "upvotes": 717,
        "comments": 202,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Yrms5pEBMRq3AjPuJGId12bhRSfqfo2N5tOeaUhtw4A.jpeg?auto=webp&amp;s=0aaff4adfeed51fe10c80a967856969e92e1708f"
        },
        "permalink": "/r/movies/comments/1n7eikv/a_house_of_dynamite_official_teaser_netflix/"
    },
    {
        "id": "1n7qyk4",
        "author": "Interesting-Swimmer1",
        "title": "What’s the single funniest moment in any comedy movie that still cracks you up every time? Bonus points for awkward or unintentionally hilarious scenes!",
        "content": "We all have that one comedy movie moment that makes us burst out laughing no matter how many times we see it. Maybe it’s a perfectly timed line, a ridiculous stunt, or a scene so awkward it’s comedy gold. For me, it’s the Corvette scene in The Big Lebowski—I laugh every single time!\n\nWhat’s yours? I want to build the ultimate list of the funniest scenes ever captured on film. And if you have a movie that’s so bad it’s laugh-out-loud great, drop that too. Let's fill the comments with belly laughs and debate the true kings and queens of comedy moments!",
        "upvotes": 168,
        "comments": 892,
        "media": null,
        "permalink": "/r/movies/comments/1n7qyk4/whats_the_single_funniest_moment_in_any_comedy/"
    },
    {
        "id": "1n77xz3",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for '28 Years Later: The Bone Temple'",
        "content": "",
        "upvotes": 1941,
        "comments": 226,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/q1tjzpbyewmf1.jpeg?auto=webp&amp;s=14a7ea8db08077fc3c3dadb218edc8fb19f7cd15"
        },
        "permalink": "/r/movies/comments/1n77xz3/official_poster_for_28_years_later_the_bone_temple/"
    },
    {
        "id": "1n7gewx",
        "author": "NoCulture3505",
        "title": "Official Poster for \"Queens of the Dead\": The film follows a group of drag queens, club kids, and frenemies who must put aside their personal dramas and use their unique skills to fight the brain-thirsty undead when a zombie apocalypse breaks out on the night of a giant warehouse party.",
        "content": "",
        "upvotes": 443,
        "comments": 50,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ic8vonc5nymf1.jpeg?auto=webp&amp;s=228338bf3e236a82890701b4c41336cf663ea05e"
        },
        "permalink": "/r/movies/comments/1n7gewx/official_poster_for_queens_of_the_dead_the_film/"
    },
    {
        "id": "1n7p9ld",
        "author": "SpeedForce2022",
        "title": "Wuthering Heights | Official Teaser",
        "content": "",
        "upvotes": 145,
        "comments": 92,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/l0-9gq2TclTdIf9IXuR_4PFV3FuSr9AaC7YOeXAlLmQ.jpeg?auto=webp&amp;s=371b93b0e178157856c14b91acab04c6e2fa7363"
        },
        "permalink": "/r/movies/comments/1n7p9ld/wuthering_heights_official_teaser/"
    },
    {
        "id": "1n81jpw",
        "author": "Routine-Dirt9634",
        "title": "name a sports movie/inspirational movie that actually had a bad lesson to teach",
        "content": "i would say Angels in the Outfield. the championships have to be won on their own rule. The angels help the baseball team cheat. They screw better teams out of wins and a chance at a championship but it is okay if they dont help the California Angels baseball team win a championship that they should not have been playing for ",
        "upvotes": 24,
        "comments": 42,
        "media": null,
        "permalink": "/r/movies/comments/1n81jpw/name_a_sports_movieinspirational_movie_that/"
    },
    {
        "id": "1n7ko0q",
        "author": "TheWor1dsFinest",
        "title": "Have you ever been totally pulled out of the movie immersion experience by just how attractive one of the characters was on screen?",
        "content": "I remember watching The Mask of Zoro when it came out and seeing Catherine Zeta Jones. I must have been thirteen at the time. The scene where they’re having the playful sword fight in the barn left me just stunned by her beauty. I was with a friend and he whispers to me “dude she’s like perfect” and I just nodded in agreement. Totally forgot about the movie for like a minute or two.\n\nI still say her face game in that movie is unmatched in the history of cinema. ",
        "upvotes": 205,
        "comments": 294,
        "media": null,
        "permalink": "/r/movies/comments/1n7ko0q/have_you_ever_been_totally_pulled_out_of_the/"
    },
    {
        "id": "1n7b1xe",
        "author": "NewPossibility4268",
        "title": "What’s a scary movie you watched way too young?",
        "content": "We’ve all been there—sneaking a peek at a movie we definitely weren’t old enough for. For me, it was Jaws. I saw it too young, and it made even swimming in the deep end of the pool terrifying. The music as really haunting as well.\n\nWhat about you? Which horror movie scarred you early and stuck with you long after? Any in particular scene too?",
        "upvotes": 668,
        "comments": 2277,
        "media": null,
        "permalink": "/r/movies/comments/1n7b1xe/whats_a_scary_movie_you_watched_way_too_young/"
    },
    {
        "id": "1n7h832",
        "author": "NoCulture3505",
        "title": "Jeremy Irons Returning For Miramax &amp; Amazon MGM Studios’ ‘The Beekeeper 2’",
        "content": "",
        "upvotes": 263,
        "comments": 56,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KG5qQxYnbczVandi2n3NYROJgxw5kyw4RBMcFO3wmuo.jpeg?auto=webp&amp;s=46716728d438f2776dd1a5c3dda045a9e9854035"
        },
        "permalink": "/r/movies/comments/1n7h832/jeremy_irons_returning_for_miramax_amazon_mgm/"
    },
    {
        "id": "1n7rlev",
        "author": "EuphoricButterflyy",
        "title": "First image of Theo James in ‘Fuze’- the discovery of an unexploded World War II bomb, sparking a mass evacuation, giving the perfect cover for a heist.",
        "content": "",
        "upvotes": 83,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vchj8b9sp0nf1.jpeg?auto=webp&amp;s=4933df15cef795bcd1731b297ff02eaa564187b1"
        },
        "permalink": "/r/movies/comments/1n7rlev/first_image_of_theo_james_in_fuze_the_discovery/"
    },
    {
        "id": "1n7sj4t",
        "author": "BaronGikkingen",
        "title": "Poster for new 2D animation Little Amélie or The Character of Rain",
        "content": "New animated film from France. It premiered at Cannes this year and won the audience prize at Annecy - the same prize FLOW won last year. Plays this week at TIFF and is also an official selection at London FF. It’s one of the highest reviewed films of the year on Letterboxd, since it came out already in France: https://boxd.it/JMI5w",
        "upvotes": 68,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/266u0hbgw0nf1.jpeg?auto=webp&amp;s=0673c4b548ed08061438bd2ddc5bb245971804b7"
        },
        "permalink": "/r/movies/comments/1n7sj4t/poster_for_new_2d_animation_little_amélie_or_the/"
    },
    {
        "id": "1n82mxh",
        "author": "laxusdreyarligh",
        "title": "Angel's Egg 4k Remaster Trailer",
        "content": "",
        "upvotes": 12,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YR9ALgNImz051OaP-f3fF-6nu-i6-M6CezF1pbNDqtY.jpeg?auto=webp&amp;s=fb0a541b51e4e77206c482f07329115893a2393b"
        },
        "permalink": "/r/movies/comments/1n82mxh/angels_egg_4k_remaster_trailer/"
    },
    {
        "id": "1n6vp8r",
        "author": "dottiedanger",
        "title": "I expected Edge of Tomorrow to be forgettable… but it blew me away. What’s your surprise favorite?",
        "content": "When Edge of Tomorrow released, I assumed it was just another Tom Cruise action movie. I skipped it in theaters because the marketing didn’t grab me. Months later, I finally gave it a shot, and it completely flipped my expectations. The part that hooked me was when Cruise’s character keeps dying during training with Rita. It’s darkly funny watching him try to get it right and failing in ridiculous ways, yet slowly improving. \n\nThat experience made me realize how many films I might dismiss too quickly based on trailers or hype. So now I’m curious. What’s a movie you thought would be “meh,” but ended up loving?",
        "upvotes": 5432,
        "comments": 1496,
        "media": null,
        "permalink": "/r/movies/comments/1n6vp8r/i_expected_edge_of_tomorrow_to_be_forgettable_but/"
    },
    {
        "id": "1n7oicw",
        "author": "NoCulture3505",
        "title": "Sam Raimi, Roy Lee Tackling Remake of Ventriloquist Dummy Horror Movie ‘Magic’ for Lionsgate",
        "content": "",
        "upvotes": 80,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6oVn741A3vD26aZjO1He1430pacVEJRQr_1y1PizYSc.jpeg?auto=webp&amp;s=2976ae477597fd35aebc22dadb1a9fbd15c60ad8"
        },
        "permalink": "/r/movies/comments/1n7oicw/sam_raimi_roy_lee_tackling_remake_of/"
    },
    {
        "id": "1n7n43x",
        "author": "chindilani",
        "title": "What is a movie pet peeve of yours?",
        "content": "I’m currently watching a film and was reminded of my pet peeve. It’s a small thing but I hate it when they show an animal on screen and then add the sound the animal makes EVEN IF IT IS BLATANTLY NOT CURRENTLY MAKING THAT SOUND. Like a cat is licking its paw and there’s a ‘meow’ sound. Or they show a dog and play a whining sound even though the dog VISIBLY ISN’T WHINING. \n\nAnd breathe. Obviously not at all important but it drives me potty. Anyone got similar pedantic peeves? (Despite the title they do not need to be pet related 😉) ",
        "upvotes": 76,
        "comments": 299,
        "media": null,
        "permalink": "/r/movies/comments/1n7n43x/what_is_a_movie_pet_peeve_of_yours/"
    },
    {
        "id": "1n7tfte",
        "author": "phironuthi",
        "title": "What’s your favorite self-surgery scene in a movie?",
        "content": "Rambo sewing up his own arm in First Blood, Ah-nold repairing the torn flesh and mechanical parts of his arm and eye in The Terminator and Anton Chigurh painfully tending to his gunshot wound in No Country for Old Men are all unforgettable. Out of all the intense self-surgery moments in movies, which one do you personally consider the most memorable or your favorite, and why?",
        "upvotes": 36,
        "comments": 126,
        "media": null,
        "permalink": "/r/movies/comments/1n7tfte/whats_your_favorite_selfsurgery_scene_in_a_movie/"
    },
    {
        "id": "1n83272",
        "author": "Appropriate-Tank-658",
        "title": "The Bikeriders, 2024 (rewind)",
        "content": "Hello guys\n\nI recently saw The Bikeriders, starring Tom Hardy, Jodie Comer and Austin Butler. Upon release it made little to no money and the audience didnt like it either. I had friends who have seen it and they said it was lackluster to say the least. Overall it was called a mediocre movie.\nSo as you can imagine, I had no high hopes seeing it, but since Jeff Nichols (the director) is one of my favourites since Mud (2013) and I like all the actors in it I was thrilled a little bit still. \nTo my biggest surprise it was so good, I would even call it one of the best films Ive seen in a while, meaning \"best\" in a traditional movie way.\n\nI didnt quite manage to discover the flaws that the others mentioned, mainly the absence of the story.\nAs I see it theres a clear and straightforward story that the movie wants to tell. It is one of the driest and realest representation of how life works basically. I just cant comprehend how people missed this.\nI really dont wanna be \"that one guy\", but it pretty much seems like Im the only one with this opinion. \nThe reason why this movie is so important is because to my knowladge, this is one of the few films from recent times that deals with life in this aspect, the most important aspect. \nIts uncontrollability.\n\"You can give everything to a thing and you can give it everything you got, but its still gonna do what its gonna do\".\nThis is the key element of the movie and the key to life itself too.\n\nTho we see the sad story of a group of homies turned into a gang, this problem they face is real for anyone.\nWe see a lot of interesting and deep down good hearted and good natured human beings trying their best to find something real. To feel that they are wanted somewhere. They are all outcasts and that is what ties them together. There is an unspeakable tragedy in that when these \"friendly\" outcast people are forced to be in the same cathegory as the bad people who are forced to the edge of periphery for much more stronger reasons. The movie deals with the important question that why does someone doesnt deserve to be the part of the bigger picture and who decides it and on what terms exactly. The film shows that even though you can have good intentions your actions will be measured by your sorroundings and you cant do shit about it. Only the illusion of possibility stays. I think this is a very very very important lesson to life. \n\nTheres something beautiful in humans you know, and this films shows it. The beautiful fact that even after the world tells you, you are not someone who can be the part of 'the society', you still try to find connections and still be the part of something. As this gives you meaning. To deprive someone from the right to belong somewhere is the most hurtful and unhuman thing you can do, since all of us crave this feeling, even more so in a broken world. And this movies is all about this.\n\n As I said Ive seen no movies like this as much as I can recall.\nYeag sure, there is no traditional story telling as you would have in a Dune movie or in other so called \"absolute cinema\" movies. But there are evergreen lif lessons about loss and human connections. \nIm very sad that it flew over so many people heads.\nIts a gem a of a movie and I ask you to give it a chance wheter you have seen it or not.\nIm interested in your opinion,\nCheers",
        "upvotes": 9,
        "comments": 11,
        "media": null,
        "permalink": "/r/movies/comments/1n83272/the_bikeriders_2024_rewind/"
    }
]