[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 491,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1i5lfht",
        "author": "techfinpro",
        "title": "A24’s Psychological Horror \"Hereditary\", Becomes a Major Hit on Netflix’s Top 10",
        "content": "",
        "upvotes": 348,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1i5lfht/a24s_psychological_horror_hereditary_becomes_a/"
    },
    {
        "id": "1i5hpow",
        "author": "Cheekychic_89",
        "title": "Whoever decided to not renew The Brothers Sun needs to jailed..",
        "content": "OK Jailed might be a bit far but seriously atleast fire the shit outta that guy. They renew so many mind numbing shows yet, The Brothers Sun was actually pretty well done and an all around good show with potential. \n\nNow instead of waiting for season 2 for the next 3 years (because that's how long seasons take to shoot these days apparently) I'm sitting here having a winge on reddit.. Thanks guy....",
        "upvotes": 119,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1i5hpow/whoever_decided_to_not_renew_the_brothers_sun/"
    },
    {
        "id": "1i5kui4",
        "author": "Nuclear_Machine",
        "title": "Back In Action copied almost everything from The Family Plan",
        "content": "Yesterday I watched the new movie „Back in action“ with Cameron Diaz and Jamie Foxx on Netflix. For me, the movie was quite boring and nothing special. But many times the same thought came into my mind: this movie copied so much from „The Family Plan“ with Mark Wahlberg! First of all the plot itself is very similar. But also some scenes of the movie were almost identical. Like the scene, where they get filmed (in the club) or when they were singing classic songs in their cars.\n\nI wonder why Netflix is copying a one year old movie so obviously?",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1i5kui4/back_in_action_copied_almost_everything_from_the/"
    },
    {
        "id": "1i5j4u6",
        "author": "Sufficient-Bar-228",
        "title": "What’s this show? ",
        "content": "There is this one show I watched on Netflix a long time ago and I don’t remember much BUT I know it was in English. One of the first episode has this girl and this dude go into this underground room I think and they get freaky. I remember there was this cave thing and also they had something that allowed them to or somehow they could travel between different timelines. There was this one part of the series where they went back in time I think and landed at a high school. PLEASEEEE let me know if you know the name of this show!!! \n",
        "upvotes": 8,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1i5j4u6/whats_this_show/"
    },
    {
        "id": "1i5bn4u",
        "author": "ewazer",
        "title": "How many episodes do you prefer?",
        "content": "As the title says, what's your preference for how many episodes a season contains? I grew up in the era of 22(+) episode seasons of network tv, which was fine when there were only 3 or 4 networks to watch. Now though, there are so many shows to watch that I'm thrilled when a show is only 6 eps. 8 is fine, 10 is ok, but above that I start to get antsy. And I'm completely fine with \"Limited\" series. Tell a good story then get out of the way!",
        "upvotes": 20,
        "comments": 69,
        "media": null,
        "permalink": "/r/netflix/comments/1i5bn4u/how_many_episodes_do_you_prefer/"
    },
    {
        "id": "1i5rvy6",
        "author": "SpoonkillerCZ",
        "title": "I can no longer cast from mobile to TV?",
        "content": "Hello!\n\nI am owner of my Netflix account and also student living/studying in different city then my family.\n\nI set my family home as Netflix home. I pay for the plan that also let's me have one different device then home. But I hate that I need another own email to use it, I hate that its not my profile with my settings and such. That is why I always just used mobile for sign in and my TV in student home worked for like 14 days before needing to do it again.\n\nBut starting today I no longer can do this. I can't even just cast it from phone. Netflix really doesn't make much sense to me anymore, I feel like for increasing price I get still less and less in both content and user experience.\n\nDoes anybody see it the same? What are you experiencing?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i5rvy6/i_can_no_longer_cast_from_mobile_to_tv/"
    },
    {
        "id": "1i5gllx",
        "author": "SilyTheGoose",
        "title": "Does Netflix not have subtitles for films that have a different language in them?",
        "content": "Sometimes I try to watch English movies and every once in a while one of them will have a scene or two of the characters speaking a different language. I turn on subtitles hoping I’ll be able to understand what’s going on, but the subtitles just say “speaking in Japanese” or whatever foreign language they are speaking in. Is this a thing that Netflix does in general? Or is it location based or something? It’s pretty annoying not being able to understand what is going on because Netflix doesn’t feel the need to add subtitles.",
        "upvotes": 5,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1i5gllx/does_netflix_not_have_subtitles_for_films_that/"
    },
    {
        "id": "1i4djim",
        "author": "Zeroyhme",
        "title": "Squid Game: Season 1 vs Season 2 Comparisons",
        "content": "",
        "upvotes": 1383,
        "comments": 77,
        "media": null,
        "permalink": "/r/netflix/comments/1i4djim/squid_game_season_1_vs_season_2_comparisons/"
    },
    {
        "id": "1i5lc3x",
        "author": "Robemilak",
        "title": "Limited series vs. multiple seasons - pros/cons for each, which do you prefer?",
        "content": "Limited series are getting more and more popular recently, especially on Netflix. I guess people have less and less time, and finding a title they can finish during the weekend from start to end is a pretty good format. What do you think? Which do you like more? Why?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1i5lc3x/limited_series_vs_multiple_seasons_proscons_for/"
    },
    {
        "id": "1i5sfrf",
        "author": "nrhuds",
        "title": "Netflix Household, why are they deciding what my household looks like?",
        "content": "Since when does Netflix dictate what my household looks like and force me to pay for another Netflix account. Even though my situation has me outside of the household temporarily. \n\nI am taking care of my ill grandmother for the duration of her time on this earth. We also pay for 2 users. Having to confirm my household on every device I use, every time I turn around is absolutely ridiculous. Considering canceling netflix altogether.\n\nAnyone else having this issue? I can see families having kids in college Or for extensive business travel. This requirement is just ridiculous to me when  the service is being paid for.",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1i5sfrf/netflix_household_why_are_they_deciding_what_my/"
    },
    {
        "id": "1i5mtbe",
        "author": "Voliver6",
        "title": "low resolution on most shows",
        "content": "can't get past 720p on most shows on netflix, have already tried different browsers and netflix app... the same movie (the equalizer) I'm trying to watch on netflix is on amazon prime as well, I'm getting 1080p no problem there, as on any other content, so I can guarantee it's not my internet, but netflix bottlenecking me... I'm unsubbing from the service rn",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i5mtbe/low_resolution_on_most_shows/"
    },
    {
        "id": "1i4poc6",
        "author": "Wildflowers4me",
        "title": " So annoying ",
        "content": "Does anyone else think it’s annoying of Netflix that if you’re in the cheaper plan that watches comercials, they also block you from watching content like some of the newer movies? Isn’t it enough that we watch comercials? ",
        "upvotes": 46,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1i4poc6/so_annoying/"
    },
    {
        "id": "1i5icgi",
        "author": "HistorianPlus5025",
        "title": "Who better ",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i5icgi/who_better/"
    },
    {
        "id": "1i5l5po",
        "author": "Imaginary_Stomach139",
        "title": "What on earth are those Netflix noises?",
        "content": "https://reddit.com/link/1i5l5po/video/a73ue0o5s3ee1/player\n\nHi, my dad called me yesterday.. Something is wrong with his Netflix, the speakers make some weird noises. He has this TV and stereo system for a few years, but since yesterday it makes some werid noises. And it's only on Netflix. When he uses his DVD player, or normal TV, the sound works great. It's just the Netflix App.\n\nIf he turns the stereo system off and uses his TV speakers for Netflix, it works again and doesn't make this werid noises.\n\nI told him to check if there is a Netflix or TV update but both are on the latest versions. Then i told him to delete the app and then install it again, but he said, you can't deeinstall it... So I don't really know...\n\n  \nAnyone has a clue?\n\nThanks",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1i5l5po/what_on_earth_are_those_netflix_noises/"
    },
    {
        "id": "1i544x7",
        "author": "ThinkApplication4183",
        "title": "Personalised notifications despite being logged out",
        "content": "Hey, so I used to share a Netflix account with my sister some time ago and was logged in with that account on my phone. I have my own account now though, with only my profile, and I keep getting notifications from Netflix with recommendations using her name, even after reinstalling the app. I don't know if it's just the wrong name or if it's actually recommendations for her, but I suppose the first makes more sense. Does anyone know why this happens?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1i544x7/personalised_notifications_despite_being_logged/"
    },
    {
        "id": "1i5gwnf",
        "author": "belowthebottomline",
        "title": "Poor Video Quality of American Primeval",
        "content": "I feel like I’m taking crazy pills. Every other show I watch on Netflix is perfectly fine in the resolution department. I’ve tried to watch American Primeval twice now and have had to turn it off both times because the resolution is so poor, and no amount of waiting or buffering seems to fix it. Is anyone else experiencing this? Has anyone been able to find a solution? ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1i5gwnf/poor_video_quality_of_american_primeval/"
    },
    {
        "id": "1i59fga",
        "author": "Safe_Letterhead_7234",
        "title": "Account Sharing",
        "content": "Hi, I was just wondering if anyone knew about how Netflix’s password sharing currently works? I know that they’re meant to prevent it from outside of the primary internet address. However, I know a family that is able to use an individual’s account at very distant households. I was wondering how this was possible?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i59fga/account_sharing/"
    },
    {
        "id": "1i5jrg2",
        "author": "shesavestheday",
        "title": "Will The OA return?",
        "content": "That show was so unbelievably incredible and I need more. It’s been years since it last came out, but I still think about it often. \n\nQuit canceling awesome shows. ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1i5jrg2/will_the_oa_return/"
    },
    {
        "id": "1i55pik",
        "author": "FirmRelease6531",
        "title": "Opinions on Public Disorder?",
        "content": "This feeling of uneasiness and borderline depression is something no show could awake in me yet, even specifically dystopian ones. I don´t know how to feel about anything right now, it was very tense, yet quite boring and predictable at the same time. \n\nWhat do you guys think? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i55pik/opinions_on_public_disorder/"
    },
    {
        "id": "1i5eoim",
        "author": "DelayDifficult3376",
        "title": "Always update household",
        "content": "Hi. I bought standard account for Netflix good for two devices. I used 2 television. But why if I used two device at same time after logout the other one when log in again. It shows update household. It seems that the the standard plan can use two devices. I check who logged in my account. Only two device.\n\nAnyone knows how to fix this this issue?  It is annoying everytime I log in need to confirm in Gmail to update.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1i5eoim/always_update_household/"
    },
    {
        "id": "1i58ski",
        "author": "gamerbboy06",
        "title": "Netflix is not turning on and is stuck on a “exiting” screen ",
        "content": "I can’t turn Netflix on and it’s stuck on a “exiting” screen and nothing happens and it doesn’t even exit me and it’s like a froze screen but when I go on something else that works fine and it’s just Netflix which is froze on exiting even if I’m trying to go onto it",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i58ski/netflix_is_not_turning_on_and_is_stuck_on_a/"
    },
    {
        "id": "1i5brwd",
        "author": "UselessMianframe",
        "title": "Can’t logout of someone else’s account because profile lock is on",
        "content": "Exactly the title. I wanna logout of this guys account but I have to sign in using a PIN code. Problem is I don’t know the PIN code and I can’t find the guy who knows it",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1i5brwd/cant_logout_of_someone_elses_account_because/"
    },
    {
        "id": "1i40qdy",
        "author": "No_Order3035",
        "title": "Squid game in India! ",
        "content": "",
        "upvotes": 634,
        "comments": 26,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/cvmk5oarvode1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1i40qdy/squid_game_in_india/"
    },
    {
        "id": "1i57mog",
        "author": "Bad--_--Karma",
        "title": "\"Something went wrong\nWe are having technical difficulties and are actively working on a fix. Please try again in a few minutes\" Solution ON MAC",
        "content": "Had this problem everytime trying to login from my MacBook but it worked on phone.\n\nAnyway how u resolve it : \n\npress network on settings -&gt; click the three dots next to question mark -&gt; hover over locations and press edit location -&gt; click the \"+\" sign in the bottom right corner and call the new location \"test\" -&gt; click done -&gt; Again click on three dots and hover over locations -&gt; Click test (new one u just made) NOT AUTOMATIC -&gt; Make sure to refresh the netflix page before signing in\n\nThe steps are for new ios update if u have an old one the link is below\n\n[https://www.youtube.com/watch?v=tj5aLs1H-6g](https://www.youtube.com/watch?v=tj5aLs1H-6g)\n\nFrom what i know this just resets ur network setting :)\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i57mog/something_went_wrong_we_are_having_technical/"
    },
    {
        "id": "1i5ahrg",
        "author": "No_Put2906",
        "title": "Household policy ",
        "content": "So I got the dreaded household policy notification on my iPad. I do still live within the household but I’m away at school right now. Is there anyway for me to bypass this? I have temporary fixed it with a vacation code, but looking for a more permanent solution until I move back home this summer. Thanks :) ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i5ahrg/household_policy/"
    },
    {
        "id": "1i56t22",
        "author": "Snowpholofagous",
        "title": "Block scary images and automatic previews",
        "content": "Okay, call me old fashioned but I get completely overwhelmed by automatic previews on all streaming services. I also, do not want any scary images popping up and scaring our 2 year old. Any tips for Disney plus, prime video, Netflix and Gem. \n\nThank you in advanced. I am thinking I will have to make a kids profile for each but we still get the auto previews. I need quiet for searching. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1i56t22/block_scary_images_and_automatic_previews/"
    },
    {
        "id": "1i5iqf5",
        "author": "SoftwareLegitimate48",
        "title": "Why doesnt Alice In Borderland have any icons",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i5iqf5/why_doesnt_alice_in_borderland_have_any_icons/"
    },
    {
        "id": "1i55tq9",
        "author": "redempt61",
        "title": "Framedrop/slowdown in HDR/DoblyVision.",
        "content": "Greetings all, I just received my Philips 65OLED809 and I have a weird issues concerning a sort of framedrop/slowdown in some scene when using Netflix in HDR/Dolbyvision on the TV App.\n\nI'm very sensitive to motion and for me the issue is really apparent when using motion smoothing \"Standard\" or \"Smooth\". By exemple in \"Squid Game\" season 01 first episode between 19m18s and 19m28s there is a quick lag when we see the main character. This is subtle and not really easy to notice at first but once seen …\n\nI have not this issue on SDR, when I desactivate HDR on the Netflix app everything is smooth.\n\nI have not this issue either on my old 65OLED854 in the Netflix TV app or when using my Shield on this older TV model.\n\nI tried to plug my Shield (2017) on my new 809 (I tried the 4 HDMI) to see if the same issue occurs in Netflix and again I got the same lag/slowdown.\n\nI switched the Shield to 4k 23,97fps from 4k 59,94fps and no more issues !\n\nSo it seems to be an issue with the TV not able to keep the motion well if the refresh rate is not the same than the video played when HDR/DolbyVision is enabled. And since there is no way to change the refresh rate in GoogleTV, I can't see how to solve the issue.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i55tq9/framedropslowdown_in_hdrdoblyvision/"
    },
    {
        "id": "1i4sviy",
        "author": "Speckled_Bird2023",
        "title": "Suddenly, my netflix program on my tablet won't allow me to watch my shows...",
        "content": "Context: I have a tablet for both reading and watching Netflix. My son uses it also for his learning games. Now I do have the parental controls set on his side of netflix for nothing above a G rating. But my side is admin, and I went under the manage profiles tab and my side shows no viewing restrictions but anytime I go back and try to go into my continue watching, I keep getting the error message: this title cannot be played because it exceeds the max maturity rating...when it shouldn't. Now also I checked my mother's profile too, and hers is set like mine= no restrictions, and hers is working fine. I have cleared the cache and have even restarted the tablet and it still isn't clearing this issue. Has anyone else had this happen to them? Should I just uninstall the app &amp; reinstall it?",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1i4sviy/suddenly_my_netflix_program_on_my_tablet_wont/"
    },
    {
        "id": "1i4fypb",
        "author": "Celebril63",
        "title": "Younger has become our new \"guilty pleasure\"",
        "content": "My wife was intrigued by the preview clip, so i popped the episode on for her. She laughed so hard, she peed.  We're now halfway through season 5, so getting into the home stretch.\n\nIf i had to describe it, I'd say Schitz Creek meets Hart of Dixie with Emily In Paris style.  \n\nIf you liked any of those, it might be worth giving it a go.  \n\nOh... I was also told that the Kdrama Romance Is A Bonus Book is loosely based on Youmger. And yes... I can see the connection, but definitely, \"Loosely.\"",
        "upvotes": 28,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1i4fypb/younger_has_become_our_new_guilty_pleasure/"
    }
]