[
    {
        "id": "1ka3efl",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Scott Mann - Tuesday 4/29 at 4:00 PM ET - Director &amp; Writer of 2022's Survival-Thriller 'Fall' &amp; Co-Founder of Flawless",
        "content": "",
        "upvotes": 9,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4506pw66hmxe1.png?auto=webp&amp;s=8c0eeaa3d5f90cf4abc7e0b0a80d27979e3862ff"
        },
        "permalink": "/r/movies/comments/1ka3efl/amaqa_announcement_scott_mann_tuesday_429_at_400/"
    },
    {
        "id": "1ka8e41",
        "author": "SanderSo47",
        "title": "April 25-27 Box Office Recap: 'Sinners' stays on #1 with $45.7 million. That's a phenomenal 4.8% drop from last week, one of the greatest drops for a horror film. 'Revenge of the Sith' surprises with $25.4 million, finishing on second place. 'The Accountant 2' and 'Until Dawn' deliver mixed results.",
        "content": "https://preview.redd.it/pizakhm3inxe1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=eee07f629f1feffae153d32cdfc17527d5f4508b\n\nWell, well, well. Don't you love a busy weekend at the movies? \n\n***Sinners*** not only retained the top spot, but also had an incredible hold, signaling that this film is going to have some damn fantastic legs. The 20th anniversary reissue of ***Star Wars: Episode III – Revenge of the Sith*** also posted a fantastic result. The rest of the wide releases were a mixed bag; ***The Accountant 2*** opened almost on par with its predecessor but it's clear it might struggle to break even, ***Until Dawn*** opened below $10 million, while A24 dumped ***The Legend of Ochi*** in 1,153 theaters.\n\nThe top 10 earned a combined $139.9 million this weekend. That's up a massive 148% from last year, when ***Challengers*** debuted at #1.\n\nAs mentioned, ***Sinners*** stayed at #1, earning $45.7 million this weekend. This is an absolutely insane 4.8% drop from last weekend. This is completely bonkers in so many ways. For reference, ***Get Out*** dropped just 15.4% in its second weekend, and that was already considered a phenomenal hold for horror.\n\nGenerally, horror films drop at least 60%, which is reason why they are known for poor legs. In some uncommon cases, some tend to drop 50% or more. In even more uncommon cases, they can drop 49% or less, and that's often a case of good word of mouth. But for a film to drop just 4.8%? This is incredibly rare to happen, especially when the film didn't have a big expansion nor had a holiday to give it a leg. And for this to happen to a horror film? Almost unheard of.\n\n[If you check the smallest second weekend drops for any film playing at over 3,000 theaters](https://www.boxofficemojo.com/chart/smallest_second_weekend_gross_drop/?by_release_scale=super_saturated), you'll see that nearly all of them were boosted by holidays on their second weekend (like ***Heart Eyes*** recently). If we exclude them, *Sinners* had the second greatest second weekend drop, just behind 2011's ***Puss in Boots*** (3%). This is simply spectacular, and it's a sign that its \"A\" on CinemaScore has done an exceptional job.\n\nThrough 10 days, the film has earned a fantastic $123.2 million. Even with ***Thunderbolts*** coming up this weekend, ***Sinners*** is proving that it will have a long life in theaters. It should easily hit $250 million domestically, and it could get close to $300 million as well. Sky's the limit here, pals.\n\nIn second place, the 20th anniversary reissue of ***Star Wars: Episode III – Revenge of the Sith*** earned a fantastic $25.4 million in 2,800 theaters. That's one of the debuts for a re-release, it's notoriously higher than ***Titanic***'s 2012 re-release ($17 million), and it's also higher than the 1997 re-issues of ***The Empire Strikes Back*** ($21 million) and ***Return of the Jedi*** ($16 million), although these two sold more adjusted for inflation. With these numbers, the film hit a lifetime gross of $405 million.\n\nDespite the reviled status of the prequels, ***Revenge of the Sith*** sports the best reception (obviously not a high bar). A lot of fans who grew up with these films still have fond memories, and they want to relive that on the big screen. Another advantage is the fact that the film is very... memeable. So many quotes from the film (\"General Kenobi, you're a bold one\", \"I have the high ground\", \"I. AM. THE SENATE!\", etc.) have become popular, thanks to a lot of posts in the Internet (especially r/PrequelMemes). Nostalgia was strong with this one.\n\nIn third place, Amazon MGM's ***The Accountant 2*** debuted with $24.5 million in 3,610 theaters. That's slightly below the 2016 original, despite 9 years of inflation and a huge performance on streaming and home media.\n\nAmazon has made it clear that they don't view theatrical the same way as other studios; they said that as long as they can recoup their marketing investment, then they're fine with the film's performance. Which is why they're not bad headlines over the film's $80 million budget. But still, it feels like the film could've done better than this. After all, the original film sold incredibly well on home media (becoming the most rented title of 2017) and performed very well on streaming too. All that and the film debuted $200,000 less than the original? That grows even larger if we take inflation into account.\n\nPerhaps it's simply a case of waiting too long to release a sequel. Generally, it's in the best interest of a sequel to release as close as possible to the original, so that the public still has it fresh in their minds. 3 years is the usual, and 5 is pushing it a bit. But it took 9 years for ***The Accountant 2*** to happen, and perhaps some of its audience moved on. The trailers offered exactly what you came to expect from the film, but maybe some people preferred to wait for streaming or PVOD? It's possible.\n\nAccording to Amazon MGM, 58% of the audience was male, and 69% was 35 and over. Unsurprisingly, it's a very dad movie. They gave it a solid \"A–\" on CinemaScore, down from the original's \"A\". That film had some great legs, while ***The Accountant 2*** will face some competition. For now, a lifetime total close to $70 million is likely for the film. Maybe Amazon will be satisfied and greenlight a third film, but it's up in the air if it will get a theatrical release.\n\n***A Minecraft Movie*** dropped 44%, adding $22.7 million this weekend. The film's domestic total stands at $379.9 million, and it should finish with close to $450 million. [WB just announced rowdy screenings of the film with \"block party edition\" starting this Friday.](https://www.hollywoodreporter.com/movies/movie-news/minecraft-movie-block-party-edition-1236202463/) Pray for theater employees, this is gonna be wild.\n\nIn fifth place, Sony's ***Until Dawn*** earned just $8 million in 3,055 theaters. That's David F. Sandberg's worst debut as director, and barely above last year's ***Tarot***. But ***Tarot*** is an original film, while this has the benefit of a known IP.\n\nEven before we saw the first trailer, there was skepticism for an ***Until Dawn*** film. After all, the point of the game was to take the concept of watching a horror film and transform it into an interactive experience. By readapting it to film, it defeats its purpose and just feels redundant. To help differentiate itself, they decided to make the film a time loop horror, while also emphasizing that it takes place within the game's universe. But it was a concept that game fans didn't appreciate and non-fans didn't feel compelled to buy a ticket. \n\nAnd hindsight is 20/20, but maybe Sony wasn't expecting ***Sinners*** to truly break out like this. Even then, scheduling a horror film the week after another horror film is asking for trouble. Weak reviews (53% on RT) didn't help either. Basically, audiences have two options for horror, and ***Sinners*** was the priority for... pretty much everyone.\n\nAccording to Sony, 55% of the audience was male, and 73% of the audience was in the 18-34 demographic. They gave it a weak \"C+\" on CinemaScore; usually horror films get this grade, but that's why they often fall off quickly. With competition from ***Final Destination: Bloodlines*** coming up, ***Until Dawn*** will vanish quickly from theaters. Look for it to finish with around $20 million.\n\nWith Easter over, ***The King of Kings*** had a freefall. It collapsed 76%, earning $4.2 million this weekend. Yep, sounds about right. The film's domestic total stands at $54.7 million, and it's gonna finish with around $60 million, if it continues dropping like this.\n\n***The Amateur*** dropped 47%, adding $3.6 million this weekend. Yep, the film is really struggling to find legs here. The film has earned $33.7 million, and it's now gonna finish below $40 million domestically.\n\nIn eighth place, A24's ***Warfare*** dropped 45%, earning $2.6 million this weekend. The film has amassed $21.8 million so far, and it's gonna finish with a little over $25 million.\n\nIn ninth place, ***The Legend of Ochi*** flopped with just $1.4 million in 1,153 theaters. That's incredibly weak, but you can tell A24 didn't want to push it. Considering last week's numbers in limited release were very poor, it's unsurprising that the film failed to catch on wide release. With a sea of competition on its way, it will disappear quickly from theaters.\n\nRounding up the Top 10 was ***Pink Floyd: Live at Pompeii***. It played in just 654 theaters, but that was enough to hit $1.3 million and crack the Top 10. \n\nOutside the Top 10, we find Universal/Blumhouse's ***Drop***, which is living up to its title. It collapsed 71%, earning just $946,815 this weekend. The film has earned just $15.8 million, and it's set to finish with around $17 million.\n\nWe also had two films, ***Cheech and Chong’s Last Movie*** and ***On Swift Horses***, which barely cracked wide release. But both films faltered, earning just $560,420 and $485,000, respectively.\n\n#**OVERSEAS**\n\n***A Minecraft Movie*** added $37.8 million overseas, taking the worldwide total to $816.5 million. It debuted in Japan ($4M) and South Korea ($2.5M), which were fine. The best markets are the UK ($67.1M), Germany ($33.7M), Australia ($31.8M), Mexico ($28.4M) and China ($25.5M).\n\nThe Force was also strong outside America. The re-issue of ***Star Wars: Episode III – Revenge of the Sith*** made $17 million this weekend, taking the film's lifetime total to $891 million. That's impressive, considering it was playing in just 34 markets. The best debuts were in Germany ($4.6M), the UK ($2.3M), Mexico ($1.7M), Australia ($1.3M) and France ($900K). After 20 years, it should crack the $900 million milestone.\n\n***The Accountant 2*** debuted with $13.7 million in 71 markets, for a $37.7 million worldwide debut. It had modest starts in Mexico ($1.5M), the UK ($1.2M), Australia ($1.2M), Germany ($1M) and Taiwan ($667K). The original film made $155 million back in 2016, and there's no indication that the sequel will earn more than that.\n\n***Sinners*** added $13.5 million in 71 markets, taking the worldwide total to $163 million. That's a pretty great drop, although the fact that it started a little low contributed to that. The best markets are the UK ($9.5M), France ($4.9M), Australia ($2.8M), Mexico ($2.5M) and Germany ($2M). The film should hit $100 million overseas, but as we said last week, this will skew heavily on the domestic side.\n\n***Until Dawn*** had a middling debut in America, but it appears like overseas will save it from embarrassment. It earned $10.1 million in 60 markets, for a $18.1 million worldwide debut. It shouldn't have a problem in recouping its $15 million budget.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*A Complete Unknown* | Dec/25 | Searchlight | $11,655,553 | $75,001,720 | $139,446,191 | $70M\n*Mickey 17* | Mar/6 | Warner Bros. | $19,002,852 | $46,047,147 | $131,847,147 | $118M\n\n- The Times They Are A-Changin'. Well, Searchlight's ***A Complete Unknown*** has ended its run with almost $140 million worldwide. The budget was $70 million, making it Searchlight's most expensive film, and it's very likely the film lost money in the end. But Searchlight and Disney might not mind that, considering they got 8 Oscar noms for the film, including Best Picture. Now, we'll see how Timothée Chalamet does again this Christmas, on that new ***Marty Supreme*** film.\n\n- Well, I guess that's it, Mickey heads. ***Mickey 17*** has ended its run after just a few weeks with a poor $131 million worldwide, against a $118 million budget. It's a sadly unsurprising result; for many months, many questioned if the film could overcome its weird premise and tonal whiplash for audiences. Turns out that audiences just didn't care much for it. Fear not for Bong Joon-ho tho; he's already working on a few films, one of which will be animated.\n\n#**THIS WEEKEND**\n\nWell, it's that time again. The first weekend of May signals the beginning of the lucrative summer season. And for that, we have a new MCU film.\n\nAnd that film is ***Thunderbolts***, which marks the MCU's 36th film. It stars Florence Pugh, Sebastian Stan, Wyatt Russell, Olga Kurylenko, Lewis Pullman, Geraldine Viswanathan, David Harbour, Hannah John-Kamen, and Julia Louis-Dreyfus, and follows a group of misfits teaming up for... something? Hey, that sounds familiar. The MCU is coming off the disappointment of ***Captain America: Brave New World***, which earned very weak reviews and failed to break even. Will ***Thunderbolts*** be different?\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 364,
        "comments": 73,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/a7TVsLtKDDvV49NW4U2kfWJ2XPXBxlGIkCBaKQ-APAg.png?auto=webp&amp;s=3d2f1b744d0a28493ee4a84e7bc54b57bcdf12a4"
        },
        "permalink": "/r/movies/comments/1ka8e41/april_2527_box_office_recap_sinners_stays_on_1/"
    },
    {
        "id": "1ka4ra4",
        "author": "danielthetemp",
        "title": "New image of David Corenswet and Rachel Brosnahan in James Gunn's 'SUPERMAN'",
        "content": "",
        "upvotes": 6759,
        "comments": 742,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mqie1lg6rmxe1.jpeg?auto=webp&amp;s=d5d4de346a7b4b5c6f85ffd819fe9f75d5c6e8af"
        },
        "permalink": "/r/movies/comments/1ka4ra4/new_image_of_david_corenswet_and_rachel_brosnahan/"
    },
    {
        "id": "1ka7uii",
        "author": "Revolutionary-Ear870",
        "title": "Warner Bros releases 2 hours of promo footage for “Weapons” on a unlisted YouTube video",
        "content": "New line posted this on IG along with the official account for the movie. Haven’t gotten time to watch but seems very creepy based of what I seen from trimming through. Zach Cregger is a great director so I’m very excited for this movie \n\nThat mystery is going to propel you through at least half of the movie, but that is not the movie,\" the filmmaker divulges. \"The movie will fork and change and reinvent and go in new places. It doesn't abandon that question, believe me, but that's not the whole movie at all. By the midpoint, we've moved on to way crazier s--- than that.\"- actual quote from zach ",
        "upvotes": 1360,
        "comments": 221,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4hzPwjIoPYxF10TBwGsU37aQE5TFUkmp-waew9-f8y8.jpg?auto=webp&amp;s=ddada8924cf07c3f9fc00b380e2b1e583400445f"
        },
        "permalink": "/r/movies/comments/1ka7uii/warner_bros_releases_2_hours_of_promo_footage_for/"
    },
    {
        "id": "1k9v9ns",
        "author": "MarvelsGrantMan136",
        "title": "First Images of Julia Garner &amp; Josh Brolin in Zach Cregger’s ‘WEAPONS’ - The film revolves around multi-related plots marked by the disappearance of school kids at exactly 2:17 AM",
        "content": "",
        "upvotes": 5914,
        "comments": 376,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/pkcva0xtskxe1.jpeg?auto=webp&amp;s=25e363342f06f7a543b59b3da67e541608c81032"
        },
        "permalink": "/r/movies/comments/1k9v9ns/first_images_of_julia_garner_josh_brolin_in_zach/"
    },
    {
        "id": "1k9zvje",
        "author": "MarvelsGrantMan136",
        "title": "‘Shogun’ Star Anna Sawai Joins David Leitch Next Film ‘How To Rob A Bank’ At Amazon MGM Studios",
        "content": "",
        "upvotes": 1170,
        "comments": 72,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bL1KKR1DTIooUxATHDY6j5vbFkX1sCDH_8uVeZVE2GU.jpg?auto=webp&amp;s=2ea76791d3dc3fa491b750fefc2ce463ad4333de"
        },
        "permalink": "/r/movies/comments/1k9zvje/shogun_star_anna_sawai_joins_david_leitch_next/"
    },
    {
        "id": "1k9oiod",
        "author": "Prabu-Silitwangi",
        "title": "What's a trend in movies right now that you wish dies a horrible death?",
        "content": "For me it's the uninspiring use of popular songs from the 70s, 80s, 90s, but preferably nirvana. It has to be nirvana if possible. Take the hook, slow it down and drown it in a heavy reverb effects and you just created a masterpiece of cinematical background music because the young audience will think the song is cool and the older ones will like it because it's nostalgic.",
        "upvotes": 9810,
        "comments": 5084,
        "media": null,
        "permalink": "/r/movies/comments/1k9oiod/whats_a_trend_in_movies_right_now_that_you_wish/"
    },
    {
        "id": "1k9s983",
        "author": "MarvelsGrantMan136",
        "title": "‘Avengers: Doomsday’ Officially Begins Filming",
        "content": "",
        "upvotes": 3476,
        "comments": 671,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_wf2NObgpuZPdM9Drjndtyh_MJA9SjQ_z6S-cY7ECo0.jpg?auto=webp&amp;s=804b6cdbd303e0dfb3d966bee25ce3e85b2c91d9"
        },
        "permalink": "/r/movies/comments/1k9s983/avengers_doomsday_officially_begins_filming/"
    },
    {
        "id": "1ka2u3x",
        "author": "NoCulture3505",
        "title": "Dev Patel to Direct, Star in Period Revenge Action Thriller ‘The Peasant’ for Fifth Season",
        "content": "",
        "upvotes": 750,
        "comments": 64,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/oqP0cIXQMyiHfar89HCT3yo9TMTWkR3lUCgqXCYNlP0.jpg?auto=webp&amp;s=9aeb9e50b9e9bd7150459232a4af51258c37a08e"
        },
        "permalink": "/r/movies/comments/1ka2u3x/dev_patel_to_direct_star_in_period_revenge_action/"
    },
    {
        "id": "1ka9a0g",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Mamoru Hosoda’s New Movie ‘Scarlet’",
        "content": "",
        "upvotes": 287,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/fscpkx7vpnxe1.jpeg?auto=webp&amp;s=7d6890671a58de4c676f1c0b0cd1cf381c394983"
        },
        "permalink": "/r/movies/comments/1ka9a0g/official_poster_for_mamoru_hosodas_new_movie/"
    },
    {
        "id": "1ka2dmk",
        "author": "Planatus666",
        "title": "Ben Affleck visits the Criterion Closet",
        "content": "",
        "upvotes": 680,
        "comments": 134,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mo9sj1jCdUQbl10UGqcnfrYqzCO-c0RApdz0rxWSIDQ.jpg?auto=webp&amp;s=8dfcd0e677e20934e56831055e550cf62fdc311c"
        },
        "permalink": "/r/movies/comments/1ka2dmk/ben_affleck_visits_the_criterion_closet/"
    },
    {
        "id": "1k9uysn",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Benny Safdie's 'The Smashing Machine' Starring Dwayne Johnson",
        "content": "",
        "upvotes": 1728,
        "comments": 489,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ak57eio9qkxe1.jpeg?auto=webp&amp;s=440c46733452eedec27c570259d4c3c8f8ae568d"
        },
        "permalink": "/r/movies/comments/1k9uysn/official_poster_for_benny_safdies_the_smashing/"
    },
    {
        "id": "1ka4hm3",
        "author": "Professional_Rent261",
        "title": "What’s the best line from a character who only had one line in a movie?",
        "content": "Was thinking about this after rewatching *Air Force One* (1997). There’s this random military guy who gets his one moment and absolutely nails it:\n\n&gt;**“Liberty 2-4 is changing call signs! Liberty 2-4 is now Air Force One!”**\n\nGives me chills every time. Dude had one job and he crushed it.\n\n  \nWhat’s your favorite example of an actor or character getting just *one* line, but it being super memorable? Could be serious, funny, iconic, whatever.",
        "upvotes": 492,
        "comments": 448,
        "media": null,
        "permalink": "/r/movies/comments/1ka4hm3/whats_the_best_line_from_a_character_who_only_had/"
    },
    {
        "id": "1k9saly",
        "author": "CampMain",
        "title": "Monty Python and the Holy Grail at 50: a hilarious comic peak. The endlessly quoted 1975 comedy remains both a clear product of its era and a timelessly funny masterwork",
        "content": "",
        "upvotes": 2346,
        "comments": 218,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nGCRBQ1QB8yxryIRRrzFsG9T510aeINT3wpLAMkWA_4.jpg?auto=webp&amp;s=58d3851587c4cc424d505bb9f6dceae30e7aaa07"
        },
        "permalink": "/r/movies/comments/1k9saly/monty_python_and_the_holy_grail_at_50_a_hilarious/"
    },
    {
        "id": "1k9x39r",
        "author": "DeepThinkingReader",
        "title": "What's a critically panned movie that you just can't help loving?",
        "content": "For me, it's Roland Emmerich's 10,000 BC. It has 10% on Rotten Tomatoes, and it's based on a crackpot theory about the pyramids from the rear end of Graham Hancock. But somehow, no matter how many times I see this movie, I never get tired of it. The scene where Steven Strait javelins the Pharaoh and shouts \"He is not a god!\" is one of my favourite movie scenes ever. Also, the music is awesome, the filming locations are gorgeous, and the miniature pyramid models used in production are fantastic. So despite the story being illogical and stupid, and the historiography being absolutely batshit, 10,000 BC will always be one of my guilty pleasures.",
        "upvotes": 875,
        "comments": 1776,
        "media": null,
        "permalink": "/r/movies/comments/1k9x39r/whats_a_critically_panned_movie_that_you_just/"
    },
    {
        "id": "1ka4auz",
        "author": "ChiefLeef22",
        "title": "‘Miami Vice’ Movie in the Works with Joseph Kosinski Directing",
        "content": "",
        "upvotes": 276,
        "comments": 143,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ETjsTkrQocCdfxgi9d0yDCR5I5pHIA1FQOk6vZrCq3c.jpg?auto=webp&amp;s=b56edc1af96d1d7f2279761d0248dc397c424da7"
        },
        "permalink": "/r/movies/comments/1ka4auz/miami_vice_movie_in_the_works_with_joseph/"
    },
    {
        "id": "1k9zepd",
        "author": "KillerCroc1234567",
        "title": "New Poster for ‘Fear Street: Prom Queen’",
        "content": "",
        "upvotes": 502,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hlx41g49olxe1.jpeg?auto=webp&amp;s=fea430c1cd92bb037fb940c82286d50bb423813d"
        },
        "permalink": "/r/movies/comments/1k9zepd/new_poster_for_fear_street_prom_queen/"
    },
    {
        "id": "1kaevck",
        "author": "ITS_GOOD_FOR_YOU",
        "title": "Who is the coolest movie character of all-time?",
        "content": "Top 2 that come to mind are of course owned by the great Harrison Ford -- Han Solo and Indiana Jones. \n\nI'd throw Ian McKellan in the ring for Gandalf. \n\nTom Cruise as Ethan Hunt is extra awesome in a way where his awesomeness is bolstered by knowing the fact that Cruise does so many of the stunts; helps envelop you into the movie...\n\nWho is at the top of your list?",
        "upvotes": 47,
        "comments": 255,
        "media": null,
        "permalink": "/r/movies/comments/1kaevck/who_is_the_coolest_movie_character_of_alltime/"
    },
    {
        "id": "1ka868x",
        "author": "james2183",
        "title": "Worst body doubles you've spotted in film?",
        "content": "I'm currently going through a Nic Cage rewatch and this weekend saw me reach his action trifecta (Con Air/The Rock/Face Off). At the climax of Face/Off, when Castor and Archer are on the speedboats and Archer (played by Cage) is hanging off the side, I forgot just how bad the body double for him was. Not only is his body size different but his hair is a totally different style. It has to go down as one of the worst body doubles in cinema, in my opinion. \n\nWhich others do you think should be added to the list?",
        "upvotes": 136,
        "comments": 261,
        "media": null,
        "permalink": "/r/movies/comments/1ka868x/worst_body_doubles_youve_spotted_in_film/"
    },
    {
        "id": "1k9joa4",
        "author": "BunyipPouch",
        "title": "Adam Driver Praises Francis Ford Coppola For Not Letting The Money Dictate ‘Megalopolis’ At AFI Life Achievement Tribute - Filmmakers like Steven Spielberg, George Lucas, Spike Lee &amp; more were also on hand to celebrate Coppola, as well as collaborators like Al Pacino, Robert De Niro, Elle Fanning",
        "content": "",
        "upvotes": 2816,
        "comments": 293,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aDli0zqbS9vHKvTnDeh3MNFur30lDUuNGumH-2fqLic.jpg?auto=webp&amp;s=2d4a9c12b619fab3a39f57d2a0e51bb25633fefd"
        },
        "permalink": "/r/movies/comments/1k9joa4/adam_driver_praises_francis_ford_coppola_for_not/"
    },
    {
        "id": "1kabr87",
        "author": "NeonGhoulie",
        "title": "Can you recommend a certain type of comedy?",
        "content": "I’m don’t know the right word I’m looking for. A stupid, lighted hearted comedy movie just based on some of my favorites. Just wanting to watch something I’ve never seen and never knew I needed. Some of these are stupid, lighted hearted, or both:\n\n- Hot Fuzz\n- Kung Pow\n- Mrs Doubtfire \n- The Nutty Professor \n- Zoolander\n- George of the Jungle omfg \n- Any Leslie Neilson comedy \n- National Lampoons Christmas Vacation\n- TOMMY BOY OMFG (basically any Chris Farley comedy) \n- Ballad of Ricky Bobby (DONT YOU PUT THAT EVIL ON ME RICKY)/Step Brothers \n- Austin Powers\n- Rat Race\n- Hitchhiker’s Guide\n\n(I have lost my marbles and can’t think of more)\nBonus: funny noises like farts make me die of laughter\n\nOnes I don’t like:\n- Dumb &amp; Dumber\n- Napoleon Dynamite \n- Jim Carrey movies are great but I’ve seen all of them so you don’t have to recommend \n",
        "upvotes": 33,
        "comments": 292,
        "media": null,
        "permalink": "/r/movies/comments/1kabr87/can_you_recommend_a_certain_type_of_comedy/"
    },
    {
        "id": "1k9uerv",
        "author": "Faded_in_rain",
        "title": "What’s your favorite movie monologue?",
        "content": "One of my all-time favorites is from the end of Blade Runner — Roy Batty’s final speech: “All those moments will be lost in time, like tears in rain.” It’s such a inspirational moment, especially knowing that much of it was improvised by Rutger Hauer himself. It perfectly captures the fragility of life and memory.\n\nWhat‘s your take ?",
        "upvotes": 291,
        "comments": 568,
        "media": null,
        "permalink": "/r/movies/comments/1k9uerv/whats_your_favorite_movie_monologue/"
    },
    {
        "id": "1k9yl2m",
        "author": "ChiefLeef22",
        "title": "Brad Pitt to lead Edward Berger's next film titled ‘The Riders’ at A24 | Based on the novel of the same name, it follows Fred Scully (Pitt) whose life falls to pieces as he and his daughter Billie look for her missing mother throughout Europe.",
        "content": "",
        "upvotes": 164,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7ElVe1gpPmBlCP2iTqp0MIWlhUGezOBk3VZRYn-4MrE.jpg?auto=webp&amp;s=487c7770c5a78cd466e806dccaaa5c59891b02f8"
        },
        "permalink": "/r/movies/comments/1k9yl2m/brad_pitt_to_lead_edward_bergers_next_film_titled/"
    },
    {
        "id": "1kadpn2",
        "author": "Temporary-Steak-3636",
        "title": "Pseudo Western Movie Recommendations?",
        "content": "One of my favorite movies is No Country for Old Men and I love other movies like it with a similar vibe like Hell or High Water and sicario, and I was wondering if you lovely people know any other movies that match this vibe? I guess some attributes I like in these movies to be a little bit more specific would include but not limited to, the lonely western setting, slow burn and suspenseful, dark and gritty, and great action. \n\nAppreciate it",
        "upvotes": 19,
        "comments": 56,
        "media": null,
        "permalink": "/r/movies/comments/1kadpn2/pseudo_western_movie_recommendations/"
    },
    {
        "id": "1ka1w9r",
        "author": "Alternative-Cake-833",
        "title": "Mission: Impossible - The Final Reckoning: Exclusive IMAX Trailer",
        "content": "",
        "upvotes": 56,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/RusQvEnwQpE3twu9rJXUAektMkpQIzVbyKFP3YINNFI.jpg?auto=webp&amp;s=d4d9cd93eda71790c69ad630dab6abd6a691c658"
        },
        "permalink": "/r/movies/comments/1ka1w9r/mission_impossible_the_final_reckoning_exclusive/"
    },
    {
        "id": "1k9zs7m",
        "author": "cmaia1503",
        "title": "Dafne Keen, Sam McCarthy, Steve Buscemi, Johnny Knoxville, Josh Lucas &amp; Sarah Chalke Starring In “Raunchy” Comedy ‘The Marshmallow Experiment’",
        "content": "",
        "upvotes": 71,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VLx8KXCDhXYgZ7mKLT6R8GNpi3MwzkoBBojUTV4JOvE.jpg?auto=webp&amp;s=9edba5f5a823522ee1c805ebfdcea257246ac898"
        },
        "permalink": "/r/movies/comments/1k9zs7m/dafne_keen_sam_mccarthy_steve_buscemi_johnny/"
    },
    {
        "id": "1ka9f6l",
        "author": "cyPersimmon9",
        "title": "BARRON'S COVE Trailer (2025) Brittany Snow",
        "content": "",
        "upvotes": 16,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HNj01DRfpJ_958eIQGy0v5V8Zt53nlP3gjGTA0QbxYM.jpg?auto=webp&amp;s=702e2e2e9d432e684b5af5130f8a3f3463bc49aa"
        },
        "permalink": "/r/movies/comments/1ka9f6l/barrons_cove_trailer_2025_brittany_snow/"
    },
    {
        "id": "1ka3ne4",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Jenny Jue - Wednesday 4/30 at 8:00 PM ET - Casting Director ('Inglorious Basterds', 'Snowpiercer', 'Okja', 'The Wedding Banquet', 'No One Will Save You', 'The Legend of Aang: The Last Airbender')",
        "content": "",
        "upvotes": 39,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gbe4fvxwimxe1.png?auto=webp&amp;s=e9057e40f0f3b162b17f0ae0a115587ceb3b9e41"
        },
        "permalink": "/r/movies/comments/1ka3ne4/amaqa_announcement_jenny_jue_wednesday_430_at_800/"
    },
    {
        "id": "1kaa033",
        "author": "AbbreviationsAway500",
        "title": "Name Your Favorite Villains Who Were  Master Manipulators In Movies.",
        "content": "Sometimes they're called the puppet master, or spin doctor, string puller and so on.  The movies have given us some clever villains that were experts at manipulating the series of events to help advance their agenda.  Most failed in the end but there are a special few that succeeded in the end.\n\nMy opening offer is Hannibal Lecter.  I can't think of many better",
        "upvotes": 15,
        "comments": 70,
        "media": null,
        "permalink": "/r/movies/comments/1kaa033/name_your_favorite_villains_who_were_master/"
    },
    {
        "id": "1k9durl",
        "author": "BunyipPouch",
        "title": "Rosamund Pike Visits the Criterion Closet",
        "content": "",
        "upvotes": 1928,
        "comments": 308,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ZlOB43vCOn_hLS0SDOdlYtgc-j5M8OOcPvxe7H0ECv0.jpg?auto=webp&amp;s=10cf6a94e644bf597ebb2187e37d7b86c0091042"
        },
        "permalink": "/r/movies/comments/1k9durl/rosamund_pike_visits_the_criterion_closet/"
    },
    {
        "id": "1k9qsz3",
        "author": "BillyThe_Kid97",
        "title": "How many of you guys still make it a point to go to theaters vs watch at home?",
        "content": "Ted Sarandos (Netflix CEO) recently gave an interview where he re-iterated how the theatrical model was outdated. So I thought I'd ask a sub of movie lovers. How many of you still enjoy going to the movies? Personally I still go when there's something that really peaks my interest. But current ticket prices have made me a lot more selective and obviously I tend to favor the big movies where the theatrical set up really shines vs the samller films that you can enjoy at home without missing much in terms of bigger screen and super duper sound set up. But, I do agree with the aspect that streaming has \"democratized\" the movie viewing experience. Not everyone lives close to a movie theater and not everyone has the time to go to one. Being able to press play and just enjoy is a huge plus. Also, home set ups are becoming more advanced. Some OLED and Mini LED tvs are out of this world in terms of quality and you can get a great sound system too. So I guess I'm 50/50 on this. What do you guys think?",
        "upvotes": 191,
        "comments": 758,
        "media": null,
        "permalink": "/r/movies/comments/1k9qsz3/how_many_of_you_guys_still_make_it_a_point_to_go/"
    },
    {
        "id": "1k9kt2q",
        "author": "everynamecombined",
        "title": "Who is a beloved actor that you have basically, unintentionally avoided their entire acting career?",
        "content": "As I mentioned, I'm not talking about actors you just dislike and specifically won't watch a movie they're in.  I am talking about actors that you have somehow essentially avoided everything they've ever been in.  This happens quite often to me so I'd love to hear some other peoples experiences.  \n\nMy example would be, Daniel Day Lewis.  I hear he is amazing, but somehow none of his movies have found there way to me, nor have I cared to seek them out.  So I would have to watch one of his movies for the sole purpose to see Daniel Day Lewis.  Which I am open to but just haven't gotten around to it.  How bout you?",
        "upvotes": 567,
        "comments": 1015,
        "media": null,
        "permalink": "/r/movies/comments/1k9kt2q/who_is_a_beloved_actor_that_you_have_basically/"
    }
]