[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 493,
        "comments": 259,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1in3iqm",
        "author": "brownieekb",
        "title": "The perfect quick-watch crime thriller",
        "content": "",
        "upvotes": 105,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1in3iqm/the_perfect_quickwatch_crime_thriller/"
    },
    {
        "id": "1in0vfz",
        "author": "sweetpatata",
        "title": "Netflix's screensaver: \"Hey, I think you will love this show you've just finished yesterday.\"",
        "content": "Why the hell does Netflix recommend all the shows I'm either currently watching or have just recently finished watching?!\n\nLiterally happening currently. I've just finished watching Schitt's Creek and suddenly it appears on my Netflix's screensaver. I've just started watching Lost and suddenly it appears on the screensaver, too. It's so annoying!",
        "upvotes": 131,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1in0vfz/netflixs_screensaver_hey_i_think_you_will_love/"
    },
    {
        "id": "1inlf65",
        "author": "Robemilak",
        "title": "Glass Heart is coming to Netflix this July.",
        "content": "When a drummer is unexpectedly kicked out of her band, a brilliant musician stumbles upon her talent and invites her to join his new ensemble. Starring Takeru Satoh, Yu Miyazaki, Keita Machida, Jun Shison, and Masaki Suda.\n\nhttps://preview.redd.it/8uyy7id5snie1.jpg?width=1073&amp;format=pjpg&amp;auto=webp&amp;s=427729cb8fc119549ef15157a64ea3fa6d0f12c6\n\n",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1inlf65/glass_heart_is_coming_to_netflix_this_july/"
    },
    {
        "id": "1inive5",
        "author": "HehroMaraFara",
        "title": "The Witcher: Sirens of the Deep",
        "content": "Soooo, is it just me or was this basically R rated the Little Mermaid? Ursula, a mermaid in love with a Prince offered legs. Did they….did they think no one would notice?\n\nDon’t get me wrong, it’s really not that bad as far as original content and some anime light content. But it’s…it’s literally the Little Mermaid plot if it had been made by Uwe Bol instead of Disney back in the day. ",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1inive5/the_witcher_sirens_of_the_deep/"
    },
    {
        "id": "1inbnq0",
        "author": "kevinut27",
        "title": "I can't get rid of the underwater melon when I open netflix",
        "content": "Hello guys, \n\nFor a while already, everytime I go to netflix in my computer's browser it opens with the underwater melon game and song that got to a point where is irritating, before it used to show shows and movies suggestions, now only this kid's game.   \n  \nDoes anybody knows how to get rid of it? maybe in some settings I can't find or something.   \nOtherwise I will start having nightmares with this watermelon\n\nhttps://preview.redd.it/tuzvi8r97lie1.png?width=1910&amp;format=png&amp;auto=webp&amp;s=0a52c1d1b75bb32c6c9904f2954263a0f85fb6e3\n\n",
        "upvotes": 21,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1inbnq0/i_cant_get_rid_of_the_underwater_melon_when_i/"
    },
    {
        "id": "1inlrn3",
        "author": "No_Olive_3310",
        "title": "Just watched Mother of the Bride on Netflix, and damn, I feel old now",
        "content": "This movie was just ok, but dude, I didn’t realize how old I was until I saw Brooke Shields and Benjamin Bratt…and then I didn’t even recognize that it was Chad Michael Murray until the credits. Where did all the time go??!",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1inlrn3/just_watched_mother_of_the_bride_on_netflix_and/"
    },
    {
        "id": "1imvlhz",
        "author": "Victor_the_historian",
        "title": "Watching the last season long after the rest of a show is terrible.",
        "content": "Not a problem of Netflix, but certainly a pity for us tv shows watchers.\n\nI've found myself in the same situation with two different shows (The Crown and The Good Doctor, if anyone is interested). Basically, when I watched these shows the last season hadn't come out yet, so I had to wait for it to come out after I had watched all the other season. That means I watched it with a considerable distance from the rest of the episodes. I also didn't have time to do a rewatch.\n\nIt just sucks. You aren't as attached to the characters anymore, and you struggle to remember events that are important to the plot.",
        "upvotes": 68,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1imvlhz/watching_the_last_season_long_after_the_rest_of_a/"
    },
    {
        "id": "1inmpdo",
        "author": "S4v1r1enCh0r4k",
        "title": "Alice in Borderland released first art teasing season 3, coming in 2025",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1inmpdo/alice_in_borderland_released_first_art_teasing/"
    },
    {
        "id": "1in6xqx",
        "author": "asdfghanjkl",
        "title": "Cassandra: yay or nay?",
        "content": "Watched it in one sitting and I have to say it's pretty interesting. Not my favorite sci-fi/dystopian series but it could've been executed better, I think. It wasn't clear as to how the house was sold and why did the Prills' picked this house when they know it's an old smart home. Was it the cheaper option so they got it?\n\nI loved Cassandra's backstory, I think the flashback scenes were way better than the ongoing plot. The plot about her daughter Maggie is also interesting and I didn't see that coming. I don't see a lot of discussions about this and I'm not sure if there's a subreddit for this but I'd like to hear your thoughts on this!\n\nps. This was my first German series on Netflix and I'm interested in watching more lol.",
        "upvotes": 11,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1in6xqx/cassandra_yay_or_nay/"
    },
    {
        "id": "1imyoxa",
        "author": "LauraEats",
        "title": "Cameron Diaz Says She Was Shocked When She Learned That Netflix Has a Hotline to Report Misconduct on Set",
        "content": "",
        "upvotes": 28,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1imyoxa/cameron_diaz_says_she_was_shocked_when_she/"
    },
    {
        "id": "1imnk5k",
        "author": "Yuck_Few",
        "title": "Black hawk down documentary",
        "content": "After watching the documentary is pretty clear that the movie was basically propaganda. You get a whole new perspective when you hear the somalis side of the story",
        "upvotes": 144,
        "comments": 155,
        "media": null,
        "permalink": "/r/netflix/comments/1imnk5k/black_hawk_down_documentary/"
    },
    {
        "id": "1in1iik",
        "author": "Pogrebnik",
        "title": "New Netflix K-Drama ‘Show Business’ Will Dive Into the 1960s and 80s Korean Music Scene",
        "content": "",
        "upvotes": 11,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1in1iik/new_netflix_kdrama_show_business_will_dive_into/"
    },
    {
        "id": "1inb0uf",
        "author": "Ok_Soup6320",
        "title": "Two things",
        "content": "1) So i just accepted the price raise. I hope it'll be worth it. I do notice their originial seriries are improving so lets hope..\n\n2) any thoughts on the series 3%",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1inb0uf/two_things/"
    },
    {
        "id": "1ingpsa",
        "author": "Powerful-Awareness99",
        "title": "I miss those nice feel good Egyptian dramas",
        "content": "Netflix used to have good Egyptian dramas a couple of years back. They used to add such dramas more frequently not much these days. I enjoyed watching \n\nTayea\n\nGrand hotel aka Secret of Nile\n\nEugenie Nights\n\nParanormal\n\n\nWish they add more in the future. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ingpsa/i_miss_those_nice_feel_good_egyptian_dramas/"
    },
    {
        "id": "1infv6j",
        "author": "SouthernAd9",
        "title": "Downloaded episode/movie quality",
        "content": "Netflix app on my iPhone 15 is downloading low quality and pixelated movies/episodes even though I already set the video quality on settings to “Higher.” Is there a way to fix this?\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1infv6j/downloaded_episodemovie_quality/"
    },
    {
        "id": "1inidta",
        "author": "CawfeePig",
        "title": "Weird question: I know how to see viewing history, but...",
        "content": "It seems like it shows me the days I finished watching something. I'm curious about one particular movie, how many days it took me to watch it, and how much I watched each day (in mid December). \n\nIs there any way to find this information? I know it's a long shot. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1inidta/weird_question_i_know_how_to_see_viewing_history/"
    },
    {
        "id": "1indm4y",
        "author": "AvailableDocument515",
        "title": "SOS Netlfix gave me 2 weeks on my moms account and I need to watch only the best mini series/movies ONLY ON NETFLIX",
        "content": "Hello, I've somehow slid under the radar using my moms account at my location. Last week when I went to log in they let me know I had been figured out. I will watch romance, period pieces, comedy, anything with Emma stone, dark comedy, psychological thriller.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1indm4y/sos_netlfix_gave_me_2_weeks_on_my_moms_account/"
    },
    {
        "id": "1imjl2u",
        "author": "indiewire",
        "title": "‘Apple Cider Vinegar’: What Happened to Real-Life Scammer Belle Gibson? (Explained)",
        "content": "",
        "upvotes": 49,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1imjl2u/apple_cider_vinegar_what_happened_to_reallife/"
    },
    {
        "id": "1imuumj",
        "author": "Whobitmyname",
        "title": "One Piece Season 2 Antagonist Teased By Star Joe Manganiello: \"Not That Much Different From Luffy”",
        "content": "",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1imuumj/one_piece_season_2_antagonist_teased_by_star_joe/"
    },
    {
        "id": "1imt4dw",
        "author": "lovetoshop1x2x3",
        "title": "The Night Agent",
        "content": "I enjoyed season 1, and thought it was pretty enticing. \n\nHowever season 2 is a bit disappointing. I’m only on episode 4 and we all know everything that’s wrong with this season. I feel like Peter’s character is great, and the actor does a pretty good job - relatively. I think the writers need to kill Rose off, give Peter a new character arc, and explore different storylines for Peter. Also, I love the Noor storyline. She is a great actress and the storyline keeps me interested. \n\nIdk, excited to see where season 3 goes, if there is one. Really hope the writers read Reddit. ",
        "upvotes": 8,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1imt4dw/the_night_agent/"
    },
    {
        "id": "1ini885",
        "author": "Dale_Akinpelu",
        "title": "What if Netflix had a Broadcast schedule for shows? Just hear me out",
        "content": "So I had this idea come out as a solution to when people have lots of shows backlogged on Netflix (any other streaming app tbh) and shows they’ve been planning to watch becomes too overwhelming for the person. \n\nSo the solution is that Netflix would have like a broadcast schedule of all the shows they have on their catalog and treat it as a normal cable broadcast schedule, so if you feeling bored one day, or don’t know what you want to watch, then you put on the channel and a random episode of a random show in their catalog would be playing and it’d have a list of the other shows it plans to play next, if you find that episode really good, you’d either leave the channel and go binge the show or you watch it to the end and when the next show comes on,you watch smth new and refreshing. \n\nIt’ll basically take out the decision making process of what shows to watch but also makes it easy to find new shows to watch. It could also help you finish backlogged shows, as it would have a regular time slot on the schedule, so you don’t have to find time to watch a show yk. \n\nAnd here’s the bait for Netflix, they can promote shows they wanna promote and also show love to the shows they’ve tried to murder (indirectly), but still have a dedicated fanbase, easily without putting too much effort, so it’s a win-win for all parties. And the the best time for them is that they have more Ad slots to sell, for more money, I’m not a fan of that, but the worlds based on Give and Take (and money) unfortunately.\n\nThe ideas not fully fleshed out but I’d like to hear what people think about this and the pros, cons, the changes needed to make it feasible. Honestly, your thoughts on general, would be greatly appreciated.",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1ini885/what_if_netflix_had_a_broadcast_schedule_for/"
    },
    {
        "id": "1imqcb5",
        "author": "Same-Eggplant9942",
        "title": "Nearly the whole cast of Dance Academy is in new netflix series Apple Cider Vinegar",
        "content": "Exciting and hilarious to see. Only on episode 3 so far and Abigail, Kat, and Sammy have all been in it so far. Throwback for fans. Love to see them out here still working. Dance academy was one of my favorite shows growing up and Sammy’s death always had a huge impact on me. Love love love to see them ",
        "upvotes": 10,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1imqcb5/nearly_the_whole_cast_of_dance_academy_is_in_new/"
    },
    {
        "id": "1im280c",
        "author": "Sweaty-Toe-6211",
        "title": "Duffer Brothers Confirm No Spin-Offs: Stranger Things Characters Won’t Return After Season 5!",
        "content": "",
        "upvotes": 335,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1im280c/duffer_brothers_confirm_no_spinoffs_stranger/"
    },
    {
        "id": "1in348c",
        "author": "JCB220685",
        "title": "Just finished watching Departure and Capture. Any recommendations for similar series?",
        "content": "What I liked about both is that they both felt very current and dealing with very real possibilities/ideas. Departure season 1 had an MH370 based storyline and found that very interesting, Capture has that Black Mirror feeling to it, especially season 2. Any suggestions would be appreciated, TIA. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1in348c/just_finished_watching_departure_and_capture_any/"
    },
    {
        "id": "1in2bp0",
        "author": "Heartshapedbox77",
        "title": "Add to my Netflix Horror tv show list pls",
        "content": "The shows I’ve enjoyed:\n\nHaunting of Hill House\nHaunting of Bly Manor\nFall of the House of Usher\nMidnight Mass\nMidnight Club\nMarianne\n2 sentence horror stories\nRatchet\nFear street\n\n\nAny recommendations?? Preferably a series. ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1in2bp0/add_to_my_netflix_horror_tv_show_list_pls/"
    },
    {
        "id": "1infx5d",
        "author": "Educational_Poetry22",
        "title": "Aftermath",
        "content": "I was reluctantly ok with the price hike until I started watching this. If they're going to use AI for movies and mail it in then I may have to reconsider. ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1infx5d/aftermath/"
    },
    {
        "id": "1imseso",
        "author": "iloverealitytv2020",
        "title": "Netflix not working",
        "content": "Hi, I’ve updated my laptop software (Apple), rebooted the internet, restarted my laptop and cleared cookies/cache. But, my Netflix isn’t working still, could anyone help? \n\nEdit: Looks like Netflix itself might actually be down \n",
        "upvotes": 6,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1imseso/netflix_not_working/"
    },
    {
        "id": "1imapxt",
        "author": "Scout1228",
        "title": "Anyone else hate this?",
        "content": "I am seriously getting traumatized by the booming noise that assaults me even when I click for more info on a movie. Why is this necessary? Anyone else hate this on Netflix?\n",
        "upvotes": 58,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1imapxt/anyone_else_hate_this/"
    },
    {
        "id": "1imsri2",
        "author": "FitAd8822",
        "title": "Netflix app assistance",
        "content": "Hi so, I can’t get into Netflix app on my mobile, or the help centre. And the website isn’t working but it’s states there are not outages why won’t it work.\n\nWhen I try to log in it states \n\n“A server with the specified hostname could not be found”\n\nWebsite states the site can’t be reached \n\nCan someone help me",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1imsri2/netflix_app_assistance/"
    },
    {
        "id": "1in6qzg",
        "author": "Wrong-Knowledge-2002",
        "title": "now i can download 15 episodes MONTHLY",
        "content": "i was downloading some shows to watch in a long car trip and suddenly netflix told me that my subscription only allow me to download 15 episodes monthly in 2 cellphones. wtf? now i cant download more episodes. thats new? i never saw that before.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1in6qzg/now_i_can_download_15_episodes_monthly/"
    }
]