[
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 25,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1lzz8vz",
        "author": "Pinchus121",
        "title": "I’m Phil Rosenthal, host of Somebody Feed Phil on Netflix and host of the Naked Lunch podcast. I travel the world eating incredible food and talking to even more incredible people. Let’s dish! AMA.",
        "content": "Hi Reddit! I’m Phil Rosenthal, host of Somebody Feed Phil on Netflix, and host of the Naked Lunch podcast with my good friend David Wild. I’ve spent the last several years traveling the globe with a fork in hand, trying to prove that the best way to connect with people is through good food and a lot of laughs. Season 8 of Somebody Feed Phil is now streaming on Netflix and we’re serving up new episodes of Naked Lunch every week wherever you get your podcasts, including chats with legends like Jane Fonda, John Stamos, Allison Janney, and so many more!  \n  \nGot questions about the best food cities, behind-the-scenes stories from the road (or the sitcom world), or where I stand on pineapple on pizza? I’m all yours!  \n  \nLet’s eat and chat.  \n  \nPhil  \nu/Pinchus121\n\nhttps://preview.redd.it/4k4qn42nrwcf1.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=19b27cd4f54858b592249a41b78424ec7203a1e5\n\n",
        "upvotes": 70,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1lzz8vz/im_phil_rosenthal_host_of_somebody_feed_phil_on/"
    },
    {
        "id": "1m0dk04",
        "author": "Indoril-Nerevar337",
        "title": "Furiosa is leaving Netflix in 72 hours",
        "content": "",
        "upvotes": 58,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1m0dk04/furiosa_is_leaving_netflix_in_72_hours/"
    },
    {
        "id": "1m0eujo",
        "author": "cloudmountainio",
        "title": "Trainwreck: Balloon boy",
        "content": "What’s everyone thinking? Was it a hoax or did they truly think he was in the balloon? \n\nI can’t decide tbh. The dad was a bit of an oddball and the fact he called the news station himself made me think 🤔 \n\nInterested in other people’s thoughts. ",
        "upvotes": 32,
        "comments": 98,
        "media": null,
        "permalink": "/r/netflix/comments/1m0eujo/trainwreck_balloon_boy/"
    },
    {
        "id": "1m0ctw8",
        "author": "Indoril-Nerevar337",
        "title": "Netflix’s Cheaper Plan With Ads Is Winning Over Half of New Subscribers",
        "content": "",
        "upvotes": 15,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1m0ctw8/netflixs_cheaper_plan_with_ads_is_winning_over/"
    },
    {
        "id": "1m0cnxw",
        "author": "Ok_Nobody3894",
        "title": "Old Guard 2 - did you notice?",
        "content": "So here’s my Old Guard 2 questions: \n\n1- So Quynh is out, but she speaks modern language fluently after 500 years? Also she is completely sane and in control? Does this whole immortality and healing thing applies to mental health as well? \n\n2- did they use young face filters on Charlize ? She doesn’t look normal. Too smooth and toned face like instagram filters. Or is it just me? \n\n3- Discord - completely useless character?! She is the first immortal. Ok, but no background story at all? Tua’s speech implies - he said “she is the first immortal by design”. Meaning what?? She was designed? Or is it some English phrase I’m poorly understanding (English isn’t my 1st language).\n\n4- the whole immortality lore - Nile being the last one and she is the destroyer because she has the same mark with Discord. Ok but how and who or what decides it? Why now? And how exactly Book gave up his immortality to Andy? Just by thinking about it? I thought there may be some hug or physical touch, some glow or at least something that implies “hey it’s done”. But just thinking about it transfers immortality? \nEven let’s say Nile is the destroyer, then how the F the other immortals died before? How Discord is mortal? Is that because their mentality or body gives up? Discord doesn’t seem like she gave up on her immortality. I mean in that case Book would’ve died long ago. How those book lore’s created and by whom? There were times when immortals were known or designed ? I thought Andy was just worshipped as a Goddess. But that was it.\n\n5- storyline was WAAAY off - Andy’s mortality and second immortality wasn’t even revealed. That would be badass if Discord just thought Andy was mortal, may be she would even try to approach her and lie about working together for cure, and then betray her by taking all other immortals, and in the last fight she learns Andy is immortal again, which is what she wants the most, and it would anger her so much and that would’ve lead to more aggressive fight sequence? That would be cool. Now, Quynh herself is mortal too. And she is so cool with it? And nobody said to Quynh “yo, Discord actually let you get captured and thrown into the ocean.” I was like “SAY SOMETHING TO HER”.  Quynh would turn against Discord in the end. And this whole bomb sequence? That was just out of nowhere? “Oh hey come to me or I will blow up this country?” And then “I wanna end you because you help people”. Excuse me ?! 😂 did they really sat down and wrote this ? I mean,  these are incredibly strategic immortals fought thousands of wars over the millennias. And this is the sequence you write for these characters’ battle? Chatgpt could’ve written better scenario than this. Discord’s stabbing Tua in the beginning - for what exactly? “i need some books about myself so people don’t know who am I, so lemme stab your immortal ass real quick”. Yeah OK. They were literally pals for centuries, he can tell everyone. And Tua is doing what exactly? Immortal librarian? Sounds cool tho 😂 And what was the scene with Quynh and Andy in the past? No explanation? Am I missing something ? I hope I do, cause that was left out. \n\n6- Fight sequences - the 1st movie fight sequences were the highlight of the movie, they were delicious to watch, old combat styles mixed with modern styles? There was a whole video about choreographing Andy’s fight style. They actually spend time on it. Now in this one? It seemed robotic, weird. First fight scene in the mansion was ok, but other scenes later on? Downgrade from the 1st movie. I was expecting something epic in the last battle with Discord and Andy. And that scene was like someone sketched a good portrait and a toddler scribbled on it. There were good parts but execution and delivery was OFF. \n\n7- acting and directing - Quynh actress: yeah, she didn’t deliver the character. She was slow, kept zoning out of the character, she looked badass and fights scenes were ok, but when she spoke she was speaking like someone just learned how to act, the only time I felt power in her was when she spoke mandarin when she cursed Andy. I was like “damn girl where was that power in other scenes before?” Uma Thurman was just chilling in the movie. She was like - yeah lemme take a walk around the set and you capture me occasionally. She looked bored AF. I heard that she wasn’t interested in the project because the shooting schedule kept changing. Can’t really blame her if that’s the case. \n\nIt just doesn’t feel right to see a sequel to this movie to be done this way. Old Guard 1 was epic. I’m sad. \n",
        "upvotes": 11,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1m0cnxw/old_guard_2_did_you_notice/"
    },
    {
        "id": "1m0lx31",
        "author": "Ok_Emergency416",
        "title": "Netflix merch store? Is it official and the experience?",
        "content": "I saw there was a Netflix merch store? Is it official? And what's the general consensus? Has anyone actually received thier merch? Is the quality up to par? Most things i see on it are negative and that's like...1 videk review, 2 posts online here complaining they got nada.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m0lx31/netflix_merch_store_is_it_official_and_the/"
    },
    {
        "id": "1m0gir2",
        "author": "AvasAdventures_",
        "title": "Missing You – A Twisty and Emotional Ride with a Familiar Harlan Coben Hook",
        "content": "https://preview.redd.it/aoy00ops71df1.jpg?width=851&amp;format=pjpg&amp;auto=webp&amp;s=cdca36094e8987c69292c4612d63829871af8a51\n\nMissing You delivers exactly what fans of Harlan Coben have come to expect. It is a gripping mystery layered with secrets, emotional weight and a few unexpected turns along the way. While it may not be the most fast-paced series in the Coben collection, it builds slowly and deliberately, pulling viewers into a web of personal trauma, hidden motives and long-buried truths.\n\nThe story centres around the disappearance of a loved one and the unraveling of the past that follows. It strikes a strong emotional chord while still keeping the tension tight. There is a genuine sense of suspense, and as the puzzle pieces begin to fall into place, the emotional stakes rise alongside the intrigue. It is not just about solving the mystery, it is about how the mystery affects those involved.\n\nThe cast delivers strong performances, with a lead who carries the emotional weight of the story convincingly. The supporting characters are well-placed and relevant without taking the focus away from the central narrative. While some twists may feel familiar to those who know Coben’s formula, the payoff is satisfying and the story feels complete.\n\nWhat sets this apart from other adaptations is its emotional grounding. It focuses just as much on grief, trust and memory as it does on the thrill of uncovering the truth. That balance is what makes it work.\n\nMissing You is a solid entry in the growing library of Coben adaptations. It earns a confident 4 out of 5 for its storytelling, acting and emotional impact.\n\n**Release Date:** 2024\n\n**Genre:** Mystery, Drama, Thriller\n\n**Episodes:** 6 episodes (Season 1)\n\n**Rating:** 4 out of 5",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m0gir2/missing_you_a_twisty_and_emotional_ride_with_a/"
    },
    {
        "id": "1m0l5gi",
        "author": "danimicro13",
        "title": "Can I use teleparty / netflix party legally?",
        "content": "I just got Netflix and I wanted to watch a show with my long distance friends, and I found out about teleparty previously named Netflix Party, but I don't know if it's bannable or ilegal to use it, can I? should I?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m0l5gi/can_i_use_teleparty_netflix_party_legally/"
    },
    {
        "id": "1m0kvhq",
        "author": "Indoril-Nerevar337",
        "title": "Vecna is Back in New Poster for 'Stranger Things' Season 5",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m0kvhq/vecna_is_back_in_new_poster_for_stranger_things/"
    },
    {
        "id": "1m0hr1l",
        "author": "homemadecupcake",
        "title": "i’ve got an idea for a romcom — what steps should i take if i want to eventually pitch it to netflix?",
        "content": "i’ve been working on an idea for a romcom — it feels fresh, grounded, and something that could really connect with a wide audience. i’m interested in eventually pitching it to a platform like netflix. could you help me understand what the actual steps are to get it there? for example: do i need to write a full screenplay first, or is a pitch deck enough? how do i get it in front of the right people? and is it better to approach production houses first, or try to go directly to a platform?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1m0hr1l/ive_got_an_idea_for_a_romcom_what_steps_should_i/"
    },
    {
        "id": "1m0cy7z",
        "author": "Mission-Zucchini-966",
        "title": "Netflix displays higher episode count than what's actually available",
        "content": "I've noticed this with some of the new anime releases on Netflix that are streaming weekly, the episode count is wrong in the hovered preview. For example \"The Summer Hikaru Died,\" only 2 episodes are available but Netflix says there are 3 episodes , and \"Tougen Anki\" only 1 episode is available but it says there are 2. And it's not like these extra episodes even exist yet since they are released on all platforms weekly. It seems like a bug but if it's not I can only guess that it's Netflix's way of showing that another episode is coming?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m0cy7z/netflix_displays_higher_episode_count_than_whats/"
    },
    {
        "id": "1m0h11i",
        "author": "Nyx-i",
        "title": "What’s wrong?",
        "content": "Is it just me?\nIs it quantity over quality?\n\n\nWe get a new show of 1 maybe 2 seasons and it’s cancelled, left unfinished. Rushed half ending if you’re lucky.\n\n\nRubbish films (I understand this is subjective) that feel like they’ve had very little effort put in. Some feel like the scripts were free or generated.\n\n\nThey do some really good stuff but the focus is not on it. Is that a weird algorithm thing of the app pushing stuff they flag?\nI don’t think I see reminders a new season of something I’ve watched is released, it’s buried several rows down.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m0h11i/whats_wrong/"
    },
    {
        "id": "1lzy8y0",
        "author": "ukeireru",
        "title": "best foreign/ international film on netflix?",
        "content": "need your recommendation on the best subtitled movie currently on netflix. (us)\n\nlooking for a movie vs a tv series, dont care the language or country just truly looking for a good solid movie.",
        "upvotes": 14,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1lzy8y0/best_foreign_international_film_on_netflix/"
    },
    {
        "id": "1m0da7q",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix’s New Thriller Puts Suranne Jones in the Role of a PM Fighting for Her Family and Country",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m0da7q/netflixs_new_thriller_puts_suranne_jones_in_the/"
    },
    {
        "id": "1m0b715",
        "author": "nightesky",
        "title": "K-Pop Demon Hunters follow-up questions",
        "content": "Just finished watching kpop demon hunters!! Amazing soundtrack, but I have a LOT of questions. I know a lot of these aren’t completely answerable as of right now, but I tend to think in stupid hypotheticals lol so rather than answers, I'm more so looking for opinions, theories, observations, etc.!\n\n  \n\n\n**1. When do hunters retire from demon hunting?**\n\nHuntrix must have had to be kpop/hunter trainees first. So all that time before they debuted, did Celine have to keep fighting demons while her friend's daughter was trying to learn how to sing an E#? That lady is at least 50, I don’t believe she was packing heat and smoking demons through menopause.\n\n  \n\n\n2. **What is the structure and history behind the kpop demon hunter system?**\n\nIs it a company? An institute? A co-op?\n\n  \n\n\n**3. How are the kpop demon hunters chosen?**\n\nAKA were Mira, Rumi, and Zoey confirmed for Huntrix from the start, or were they selected from a larger group of hunter candidates because of their talent/skill?\n\n  \n\n\n**4. If it's the latter, are there trainees who were excellent singers but terrible hunters, or vice versa, who didn’t make the cut?**\n\nIf so, are they assigned elsewhere to still be useful, like becoming a normal kpop group that brings in income or full time hunters who help out with demons? \n\n\n\n\n\n**5. Do you think there were nepotism accusations when Rumi became a member?** \n\n  \n\n\n**6. What did hunters use as their secret identity before kpop existed/took off?** \n\n  \n\n\n**7. Are there other hunters around the world who use culturally adapted demon-killing practices?**\n\nBecause honmoon and kpop are very Korean-specific concepts, but I assume in this universe, demons exist globally?\n\n  \n\n\n**8. What did the other saja boys do to become demons?**\n\n  \n\n\n**9. How do you become a demon in the first place?**\n\nLike you’re either born a demon or ADBG (assigned demon by gwi ma)? Is being a demon contagious? Like a vampire?\n\n\n\n\n\n**10. ...How attractive must that demon have been for Rumi’s mom to risk her entire career for him?** ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m0b715/kpop_demon_hunters_followup_questions/"
    },
    {
        "id": "1m0edu3",
        "author": "Longjumping_Land_977",
        "title": "Selling Sunset and Selling The OC cast four new agents for the shows, and one is already famous",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m0edu3/selling_sunset_and_selling_the_oc_cast_four_new/"
    },
    {
        "id": "1m03jxe",
        "author": "Deep_Discount9754",
        "title": "Shows not appearing on one computer, one profile? Works fine everywhere else",
        "content": "Hey so I'm having a very strange issue I can't figure out at all. My family has Netflix with three different profiles set up. My sister was going to watch a new show and could not find it when searching or anything, apparently this has also happened with a few other shows as well. However they can see the shows just fine on one of the other profiles. I figured this had something to do with that one profile setting but that doesn't seem to be the case and all of the shows that are missing appeared on the other devices we have. So for some reason only on that one computer, some shows do not show up for that one profile. I am not even sure where to begin to troubleshoot this. Anyone have a solution or idea of what might've caused this??? The 3 specific shows we tried to look for were all anime (Sakamoto days, Violet Evergarden, and Delicious in Dungeon), not sure if this is relevant information at all. It seems like many other anime appear just fine",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m03jxe/shows_not_appearing_on_one_computer_one_profile/"
    },
    {
        "id": "1lz2vux",
        "author": "PulIthEld",
        "title": "Stop showing me games, I have never interacted with one.",
        "content": "Every time I open Netflix now its some stupid game.  Why?  That's not what I go to Netflix for.  I dont want their ads blaring every time I open Netflix.",
        "upvotes": 357,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1lz2vux/stop_showing_me_games_i_have_never_interacted/"
    },
    {
        "id": "1m0faxz",
        "author": "Plane-Professional46",
        "title": "selling netflix 7 $ one month warranty description in detail",
        "content": "\n\nthey buy from cheap countries like pakistan where premium plan(4k 4 profiles) cost 5 $ like i am from pakistan and resell them that how its that cheap btw i also sell netflix accounts too for 7$ your mail and pass and full aceesss with one month gurantee\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m0faxz/selling_netflix_7_one_month_warranty_description/"
    },
    {
        "id": "1m03efo",
        "author": "According-Agent-3003",
        "title": "Gi-huns Strategy: Bottom-Up vs. Top-Down",
        "content": "I just finished Season 3 of Squid Game, and while it was solid overall, Gi‑hun’s choices really bothered me on a 'meta level'. I understand that he wants justice and aims to stop the suffering caused by these games, which serve as cruel “entertainment” for the ultra‑rich. That motivation makes perfect sense. But his method (re‑entering the games to protect the players) feels poorly thought‑out, given the resources at his disposal.\n\nGi‑hun seems to opt for a bottom‑up strategy: he and the detective spend a fraction of his €33 million prize to locate the island and the organization. Initially, he even refuses to touch that 'blood money', but when he finally does, it’s squandered on one perilous mission. To me, that’s a huge strategic missed opportunity. The series seems to criticize neoliberal power structures (almost in a Foucauldian way) yet the creator still has Gi‑hun pursue a grassroots rescue operation. But look at the system: it thrives on exploiting the weak and rewarding the ruthless. Even if you spent six days preaching compassion, you’d only reach the bottom tiers, and odds are the VIPs at the top wouldn’t care. Real change, I think, would require top‑down disruption: using his €33 million to unmask, expose, or directly pressure the ultra‑rich who bankroll the slaughter. Hitting the system at its source seems far more effective than diving back into the deathtrap.\n\nWhat do you think? Did I overlook something and do you have a better suggestion?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m03efo/gihuns_strategy_bottomup_vs_topdown/"
    },
    {
        "id": "1m013sw",
        "author": "Similar_Diver9558",
        "title": "Ranked: The Most Streamed TV Shows and Movies in 2025",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m013sw/ranked_the_most_streamed_tv_shows_and_movies_in/"
    },
    {
        "id": "1lz3wrl",
        "author": "itsnobigthing",
        "title": "14 hour car journey; need a series that’s so addictive I’ll be glad I’m not there yet",
        "content": "Ideally seeking one of those shows where it would take a physical intervention to stop you watching the next episode. Like Severance, or early Lost, or similar.\n\nBut I’m down for pretty much anything except horror, or things about gangs of men doing crime). Just something compelling and bingeable that I haven’t seen! 🙏🏻\n\nNo subtitles pls as I get car sick if i read them\n\n\n\n",
        "upvotes": 67,
        "comments": 124,
        "media": null,
        "permalink": "/r/netflix/comments/1lz3wrl/14_hour_car_journey_need_a_series_thats_so/"
    },
    {
        "id": "1lzvq9z",
        "author": "EthanGamingYTR",
        "title": "Blindspot profile pictures?",
        "content": "I'm absolutely loving blindspot and I want to add a suggestion for profile pictures please 🙏\n\nI don't know if they take suggestions for profile pictures or not but I'd love to see them there",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lzvq9z/blindspot_profile_pictures/"
    },
    {
        "id": "1m018kq",
        "author": "Suitable-Pressure181",
        "title": "Where do I watch TUDUM 2021",
        "content": "Where can I watch TUDUM from 2021? It's not available on Netflix and I tried searching on Google too, nothing. I'm interested to watch the Sandman segment of the show",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m018kq/where_do_i_watch_tudum_2021/"
    },
    {
        "id": "1lzuyo2",
        "author": "theplasmasnake",
        "title": "A Netflix Pet Peeve",
        "content": "I've moved away from using Netflix nearly entirely. I only subscribe to the cheapest ad-supported tier to watch live wrestling. I also use it to do some light browsing on the web app for discovering new shows to 'watch elsewhere.'\n\nHere's something that annoys the hell out of me when using Netflix, and it has for years. Why, when you're browsing the 'More Like This' section underneath a selection, can you not click into that item's details? I want to see more about that show or movie, to find out if I'm interested. I want to read the description, check out the cast, maybe watch the trailer. What I DO NOT want to do, is to start auto playing the show or movie immediately! Who does this?? Who sees a poster and wants to automatically begin watching the thing? Who is this for Netflix?? Don't force me to back out and search for the item, just take me to the page for the series or movie!",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lzuyo2/a_netflix_pet_peeve/"
    },
    {
        "id": "1lzsyud",
        "author": "DyingLies",
        "title": "Is there a way to remove the trailers you've watched ?",
        "content": "I really want to remove the \"trailers you've watched\" section, however I can't seem to do it since they don't appear in my viewing history. I asked one of my friends and she told me she doesn't even have that section even if she watches trailers. Is there another way to remove or hide it ?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lzsyud/is_there_a_way_to_remove_the_trailers_youve/"
    },
    {
        "id": "1lzrcai",
        "author": "strawberries189",
        "title": "Girls Incarcerated",
        "content": "Hi! Question about \"Girls Incarcerated\". In the series, there was a scene where some of the girls were doing Bible study. One of the girls asked the teacher (an older woman) about same-sex marriage, and the teacher said that it wasn't ok. Does anyone know which season, episode, and time stamp this scene occurred? Thanks.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lzrcai/girls_incarcerated/"
    },
    {
        "id": "1lzodk3",
        "author": "MamaMia1325",
        "title": "Animal Kingdom-Smurf",
        "content": "Just finished season 1 and am having trouble continuing. None of the characters are really likable at all-MAYBE J-but that's it. Smurf is pure evil and I can only take so much of her \"baby\"..can anyone relate?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lzodk3/animal_kingdomsmurf/"
    },
    {
        "id": "1lzoanc",
        "author": "davidilanyann",
        "title": "Does Netflix use data if I watch downloaded content while my mobile data is on",
        "content": "I don’t want to use too much data on Netflix, and I usually download content to watch while outside. Sometimes I have to turn on my mobile data because I’m waiting for a message, and I want to know if Netflix uses data in that case if the content is downloaded. Thanks",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lzoanc/does_netflix_use_data_if_i_watch_downloaded/"
    },
    {
        "id": "1lzn8my",
        "author": "aim-mami",
        "title": "HELP",
        "content": "Netflix keeps asking me to add another member when I’m literally not even sharing it 😩 Why does Netflix always assume I want to add someone? I’m not even using extra devices 😭 It’s always asking me to add a member, like chill Netflix, it’s just me 😤",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lzn8my/help/"
    },
    {
        "id": "1lz6nrx",
        "author": "Timely-Hovercraft-76",
        "title": "I actually enjoyed the waterfront.",
        "content": "I actually enjoyed waterfront quite a bit. I made a post about a month ago or so asking how it is and I got some mixed inputs. It took like 2 episodes to get into it but after that, I quite enjoyed it. I liked the setting, the overhead shots of the area, the action was pretty good, son was a realistic character imo, I liked seeing Holt McCallany back in action and the plot was basic in ways but easy to follow and fun to watch. It’s not ozark but it’s only 1 season compared to like 5. I would give it a 7-8 out of 10. Topher grace’s character was pretty fun as well, he’s a good actor. All in all, a pretty fun watch. ",
        "upvotes": 12,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1lz6nrx/i_actually_enjoyed_the_waterfront/"
    }
]