[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 9,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 416,
        "comments": 2839,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1n9ft4n",
        "author": "im_a_reddituser",
        "title": "Love Revenge Con is badly scripted/edited reality investigation but I’m glad those women had support",
        "content": "I wanted this to be engaging but this was not up to the usual quality I expect from Netflix. It was clear that much of the material was scripted and planned before on camera which made it feel wooden from these real people doing a great thing for these women who were struggling to move on.  The spacing and editing made me wish the 2x speed play feature was available on the tv. \n\nI wished it was more buttoned up because the investigator shared some good info but it’s a slog to get through and it feels like not enough people will see it. \n\nWhat did you think? ",
        "upvotes": 20,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1n9ft4n/love_revenge_con_is_badly_scriptededited_reality/"
    },
    {
        "id": "1n91xk3",
        "author": "Sweaty-Toe-6211",
        "title": "‘Halo’ Season 1-2 Joining Netflix in the United States in October",
        "content": "",
        "upvotes": 68,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1n91xk3/halo_season_12_joining_netflix_in_the_united/"
    },
    {
        "id": "1n9lt6j",
        "author": "LengthinessNice6078",
        "title": "Why do they keep removing shows/movies people like?",
        "content": "Literal question. Why do they keep removing shows or movies people like? The second Netflix employees realize that people like a show or movie, nah. We gotta get rid of it for another reason of Big Mouth. Nah, we don’t care what the people paying for our subscriptions want. WHY!!! LET PEOPLE ENJOY STUFF!!! And yes, this is about Brooklyn 99 and The Good Place.",
        "upvotes": 6,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1n9lt6j/why_do_they_keep_removing_showsmovies_people_like/"
    },
    {
        "id": "1n95ehj",
        "author": "photoshop_2023",
        "title": "Have you watched Love Con Revenge?",
        "content": "What do you think of Love Con Revenge? I cant believe this happens to people! some of the stories are shocking and i feel so sorry for the victims. Its very well put together and worth a watch. ",
        "upvotes": 19,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1n95ehj/have_you_watched_love_con_revenge/"
    },
    {
        "id": "1n9lkcu",
        "author": "57829",
        "title": "Catherine Zeta-Jones Unpacks Wednesday and Morticia’s Strained Relationship as She Looks Ahead to Season 3",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n9lkcu/catherine_zetajones_unpacks_wednesday_and/"
    },
    {
        "id": "1n95gqg",
        "author": "LegitimateWeekend341",
        "title": "Love Con Revenge",
        "content": "Is anyone else watching this series and genuinely angry with the police’s inaction? Public safety costs millions of dollars in state taxes, yet these types of crimes are treated as civil matters instead of criminal offenses. ",
        "upvotes": 14,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1n95gqg/love_con_revenge/"
    },
    {
        "id": "1n8dqlm",
        "author": "BlackDoom_26",
        "title": "Shows that totally lost you halfway through",
        "content": "Have you ever started a Netflix show that was amazing at the start but then kind of fell apart later on? Curious which ones had you hooked and then left you feeling disappointed.",
        "upvotes": 719,
        "comments": 2350,
        "media": null,
        "permalink": "/r/netflix/comments/1n8dqlm/shows_that_totally_lost_you_halfway_through/"
    },
    {
        "id": "1n8ysba",
        "author": "unluckyducky0",
        "title": "Uplifting, Bingeworthy TV Shows for Sad Times?",
        "content": "Hi, I’ve been going through it a little lately and feeling sad like i’ve run out of my usual light, interesting and humorous binging tv series (reality), and need suggestions for other shows to put on that are interesting and make you feel good/comforting when you’re down?\n\nI usually turn on a show for background noise and only 1/2 pay attention to it but i do like it to be interesting and feel good when i am paying attention haha. Any recommendations for shows that are comforting and uplifting that can be binged?\n\nScripted shows I’ve watched in the past i liked enough to actually finish the whole series (this is a big deal for me if it’s not a reality show):\n\n- Schitt’s Creek** (Fav)\n- Dead to Me** (fav… until the sad end)\n- New Girl\n- The Office \n- Gilmore Girls \n- probably forgetting some but maybe these help give guidance? ",
        "upvotes": 28,
        "comments": 84,
        "media": null,
        "permalink": "/r/netflix/comments/1n8ysba/uplifting_bingeworthy_tv_shows_for_sad_times/"
    },
    {
        "id": "1n9mj2p",
        "author": "GamerGirlLondyn",
        "title": "I have an Error Code D7702-1290",
        "content": "I was playing a show on Netflix when the graphics suddenly froze. I paused it and reloaded, but in never stopped loading. I restarted my laptop and it worked for a time, but it eventually starts having the same problems. Twice while it was loading, I got an Error screen. I didn't get the code the first time, but the second time, I got Code D7702-1290.\n\nI tried looking it up, but I never found a solution. Does anyone know who I can fix this without be restarting by laptop every time I what to watch Netflix, and ever 30 mins after that?\n\nI have an Alienware laptops, if that matters at all.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n9mj2p/i_have_an_error_code_d77021290/"
    },
    {
        "id": "1n9l36s",
        "author": "Silly-Mountain-6702",
        "title": "Favorite grown up animation? So far, it's \"Carol and the End of the World\" for me. \"Twilight of the Gods\" is great. \"Archer\" I can only do one show at a time he's so off-putting.",
        "content": "Loved the raunch of \"Big Mouth\" and \"Human Resources\" - nice and absurd. \"Common Side Effects\" just didn't have a lot going for it. I've seen and loved \"Venture Brothers\", as well as it's weird cousin \"Captain Fall\". \n\nAnything up this alley I have missed, or that you'd recommend? ",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1n9l36s/favorite_grown_up_animation_so_far_its_carol_and/"
    },
    {
        "id": "1n8o5tu",
        "author": "Princessrage",
        "title": "\"Jinx\" from Arcane. Mixed media by my 13yo.",
        "content": "Hello, fellow Netflix fans! I'm a long time reddit lurker, and very rarely post, but my daughter requested that I share her creation with you fine folks. (She's the one who introduced me to Arcane.) Please be kind, I'm hoping to have some friendly feedback to show her tomorrow. TIA!❤️",
        "upvotes": 56,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1n8o5tu/jinx_from_arcane_mixed_media_by_my_13yo/"
    },
    {
        "id": "1n8lagq",
        "author": "huffpost",
        "title": "Best international or foreign-language shows on Netflix that deserve more attention?",
        "content": "What are some bingeworthy international or foreign-language shows you’ve found on Netflix that completely blow any American show out of the water? Are there any you love that are flying under? What do you love about the show?",
        "upvotes": 74,
        "comments": 179,
        "media": null,
        "permalink": "/r/netflix/comments/1n8lagq/best_international_or_foreignlanguage_shows_on/"
    },
    {
        "id": "1n94j5i",
        "author": "Prestigious_Tie_4451",
        "title": "First time watching K-pop Demon hunters",
        "content": "I was expecting this movie to be crap, but I surprisingly enjoyed it. The music and animation was emotional, and the ending left me surprised. I was afraid that the plot was going to be childish and predictable so that is why it took me so long to finally watch it.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n94j5i/first_time_watching_kpop_demon_hunters/"
    },
    {
        "id": "1n9gagd",
        "author": "Omega3isyucky",
        "title": "I hear conflicting information - can you share your Netflix account with anybody outside of your home?",
        "content": "There was an enforcement of this years ago - so I paid for 2 new members. Last week I saw that its possible to use it outside of your home, and others have been somehow doing this too. I want to know if I can cancel extra members as I've been paying for everyone. I am in Canada and paying $45 a month... Very expensive",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1n9gagd/i_hear_conflicting_information_can_you_share_your/"
    },
    {
        "id": "1n9eamu",
        "author": "Wyldstallyn80",
        "title": "Ad free",
        "content": "So I was under the impression the impression that the ad free version of Netflix was just that. People pay more cos they cba with adverts. Got told by someone today that he can’t watch the new season of “it’s always Sunny” because he doesn’t have the ad free subscription. Is that a common thing? ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1n9eamu/ad_free/"
    },
    {
        "id": "1n9kqof",
        "author": "NJ4L",
        "title": "Loving this Netflix Original, but I’ve got questions…",
        "content": "Is this Netflix show real or just a parody? I’m trying to figure it out while watching. Also, I keep noticing that when men get romance scammed by women it doesn’t get talked about much…why does it seem like the stories we see are always about men scamming women? Either way, I love Netflix Originals and this one has me thinking..the title is “Love Con Revenge”",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1n9kqof/loving_this_netflix_original_but_ive_got_questions/"
    },
    {
        "id": "1n975kw",
        "author": "Responsible-Sign3223",
        "title": "Seafood shacks to finding love: Where all the biggest Netflix reality TV villains are now",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n975kw/seafood_shacks_to_finding_love_where_all_the/"
    },
    {
        "id": "1n8y82s",
        "author": "namedmypupwarren2020",
        "title": "3Quency - Top Down (Official Video)",
        "content": "",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n8y82s/3quency_top_down_official_video/"
    },
    {
        "id": "1n8b43i",
        "author": "darth_vader39",
        "title": "MONSTER: The Ed Gein Story | Official Teaser | Netflix",
        "content": "",
        "upvotes": 76,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1n8b43i/monster_the_ed_gein_story_official_teaser_netflix/"
    },
    {
        "id": "1n93yy5",
        "author": "filou_TCGfan",
        "title": "Netflix geht nicht?",
        "content": "Why ist my Netflix Not working??? Prime Video, paramount and what ever is still working. So My Network is working. Anybody had The Same experience If Yes How can I fix it?????",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n93yy5/netflix_geht_nicht/"
    },
    {
        "id": "1n8mpx7",
        "author": "GuitarsAndBourbon26",
        "title": "Obsessed with these “American Manhunt” docs",
        "content": "Just finished the Osama bin Laden doc. Wow. And now almost done with the Boston Marathon Bombing doc. These film crews &amp; Netflix absolutely nailed these. Firsthand accounts and photos inside the White House war room, etc. The dramatizations and recreated aerial footage of events really add to the realism, and are so convincing I forgot at times they were recreated. I can’t wait to dive into the others they’ve made and hope they continue this series. Well done Netflix. Very well done. ",
        "upvotes": 14,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n8mpx7/obsessed_with_these_american_manhunt_docs/"
    },
    {
        "id": "1n929ju",
        "author": "Stupefaction_1922",
        "title": "Long Story Short is tiresome and lazy",
        "content": "I wouldn't say I never laughed once -- the first episode was very funny in parts. I wouldn't say it's *entirely* mawkish, although it *is* banging hard on certain dull keys like an adolescent poet trying to evoke the feels.\n\nBut it is a problem that by 5 episodes in all the main characters are hateful for their forced performative nebbishy argumentativeness, which has been done to death a million times by frankly more clever writers. I grew up in a 50% Jewish community and you get sick of this dishrag very quickly. It's even lower hanging fruit than Seinfeld.\n\nIt is very disappointing, given how original and nuanced BJH was. This show is just Raphael disappearing up his own \\*, losing all perspective, and working out his issues using a captive (but not for long) audience he earned through his real art.",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1n929ju/long_story_short_is_tiresome_and_lazy/"
    },
    {
        "id": "1n91w5u",
        "author": "Fast_Extension9901",
        "title": "PELICULAS QUE TE ENGANCHES COMO LA DE NUMERO DESCONOCIDO?",
        "content": "Alguien me recomienda alguna pelicula/documental/serie parecida o al menos que te mantenga enganchado de tal manera como la de numero desconocido? me gusta mucho tambien pequeñas mentirosas, you, etc..",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n91w5u/peliculas_que_te_enganches_como_la_de_numero/"
    },
    {
        "id": "1n8qsw8",
        "author": "BoringClassroom5811",
        "title": "Is \"my life with Walter Boys\" a remix of \"The Summer I Turned Pretty\"?",
        "content": "Wow, at this point, the new red flag in this series is Jackie? Like girl pick a side please T\\_T you remind me of Belly a lot - keep switching between brothers like it's nothing T\\_T. okay, sorry for the rant lol didn't know who else to say this to. ",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n8qsw8/is_my_life_with_walter_boys_a_remix_of_the_summer/"
    },
    {
        "id": "1n8tihd",
        "author": "cerealmilkanddarkrum",
        "title": "Anxious people",
        "content": "It’s not new at all it’s been out awhile but what did everyone think ? Especially backman fans that read the book. \n\nI thought it was good always neat to see how your imagination did with visioning scenes. I did not see jack the officer looking that way at all lol",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n8tihd/anxious_people/"
    },
    {
        "id": "1n80kh8",
        "author": "thehealer2",
        "title": "Stand by Me (1986) is such an underrated gem.",
        "content": "This film is truly an underrated gem, beautifully capturing the raw essence of childhood friendships and the bittersweet journey into adulthood.\n\nFor a few hours, I felt like I was right there alongside Gordie, Chris, Teddy, and Vern, wandering through the woods, chasing whispers of a dead body, and facing their fears and dreams. The film’s strength lies in its authenticity; every laugh, heartbreak, and quiet moment feels genuine, drawing you into their world. It serves as a poignant reminder of how fleeting and impactful those youthful adventures can be.\n\nI really miss road movies like this, where a group of friends embarks on a journey to discover something meaningful.\n\nWhat did you think about this movie? I’d love to hear your thoughts and feelings after watching it!\n\nAlso, if you have any recommendations for similar movies, please share them below!",
        "upvotes": 223,
        "comments": 84,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/qup1tmd8r2nf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1n80kh8/stand_by_me_1986_is_such_an_underrated_gem/"
    },
    {
        "id": "1n86r5g",
        "author": "Glum_Reputation_9845",
        "title": "Watching Dirty Money’s Wells Fargo episode",
        "content": "I’ve been watching Dirty Money on Netflix again, and the episode about the Wells Fargo account fraud scandal really stuck with me. The whole thing about millions of fake accounts being created under people’s names without their knowledge was wild enough, but what got me was how little control regular people had over their own personal information once it was in the system. It makes me think about it, are our systems really that vulnerable nowadays that something like this can just happen to anyone? We spend so much time being told to make stronger passwords and enable 2FA, but if a bank or data broker already has your personal info in their system, what stops it from being misused?",
        "upvotes": 60,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1n86r5g/watching_dirty_moneys_wells_fargo_episode/"
    },
    {
        "id": "1n8zouq",
        "author": "munichris",
        "title": "Not receiving verification email",
        "content": "In my account settings it says that my email address needs verification. (I've been a member for years.) When I click on \"Send Link\" to verify my email address, it says \"Check your inbox, We’ve sent a verification link to \\[...\\] Click the link in the email to verify this email address.\" But I never receive any verification email. I've tried it a dozen times already. There's nothing in the spam folder either and it's a major email provider that I'm sure doesn't block Netflix.\n\nDoes anybody have a similar problem?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n8zouq/not_receiving_verification_email/"
    },
    {
        "id": "1n8kjv3",
        "author": "theirishstew",
        "title": "Interface change… where are the categories?!",
        "content": "The Netflix interface has just changed for me on my TV and I’m having a hard time finding how to browse by category like you used to. Is it still something that’s available but I’m not seeing?",
        "upvotes": 7,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1n8kjv3/interface_change_where_are_the_categories/"
    },
    {
        "id": "1n8xtln",
        "author": "raydvshine",
        "title": "Netflix Household Rules",
        "content": "Hi all,\n\nI am currently mapping different home devices to different outbound IPs. What special SNAT rules should I add to my router specifically for Netflix to make sure that my devices are seen as being in the same Netflix household? Currently I have something like this:\n\n    INTERNAL_IP_1 -&gt; PUBLIC_IP_1\n    INTERNAL_IP_2 -&gt; PUBLIC_IP_2\n    INTERNAL_IP_3 -&gt; PUBLIC_IP_3\n    ...\n    \n\nShould I SNAT all packets destined for Netflix ASN IPs with the same outbound IP? Would that be enough?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n8xtln/netflix_household_rules/"
    }
]