[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 491,
        "comments": 262,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1iy5f5d",
        "author": "AwkwardUrkel",
        "title": "Disrupt The Market",
        "content": "I cancelled my Netflix today. \n\nI've been around since the DVD in the mail phase. I'm so tired of the incremental increase of subscriptions. At what point will enough of us hit cancel so they understand! ",
        "upvotes": 50,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1iy5f5d/disrupt_the_market/"
    },
    {
        "id": "1iy8ogp",
        "author": "MotherofBook",
        "title": "These Category titles are hilarious. Have y’all seen these?",
        "content": "Idk why this is so funny to me but ***‘Rich People Behaving Badly’*** As A category title, on Netflix, has taken me all the way out. \n\nThat’s very much how I name my categories. 🤣😂🤣🤣🤣",
        "upvotes": 25,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1iy8ogp/these_category_titles_are_hilarious_have_yall/"
    },
    {
        "id": "1ixzcpp",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix hit a record 8.6% of total TV screen time in January with Squid Game racking up an astonishing 9 billion minutes of viewing time",
        "content": "",
        "upvotes": 58,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1ixzcpp/netflix_hit_a_record_86_of_total_tv_screen_time/"
    },
    {
        "id": "1iyhzqa",
        "author": "Robemilak",
        "title": "‘FEAR STREET: PROM QUEEN’ premieres May 23 on Netflix.",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iyhzqa/fear_street_prom_queen_premieres_may_23_on_netflix/"
    },
    {
        "id": "1iyjjrn",
        "author": "RealityShrine",
        "title": "Too Hot To Handle star Holly Scarfone claims Scott Disick 'pressured' her to get surgery",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iyjjrn/too_hot_to_handle_star_holly_scarfone_claims/"
    },
    {
        "id": "1iyj9du",
        "author": "ellissabain",
        "title": "Gabby Petito's parents reveal alarming unseen texts to Brian in interview after Netflix doc",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iyj9du/gabby_petitos_parents_reveal_alarming_unseen/"
    },
    {
        "id": "1iygvmg",
        "author": "cartgirl69",
        "title": "Full Swing Season 3 Discussion",
        "content": "Not finished yet but I think this is infinitely better than the prior seasons. Personal favorites: Neal Shipley and Min Woo Lee. Thought first ep was great too. Looking forward to finishing last 2 eps tomorrow. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iygvmg/full_swing_season_3_discussion/"
    },
    {
        "id": "1ixykn6",
        "author": "CampMain",
        "title": "Fifth and final series of You coming to Netflix April 24th",
        "content": "",
        "upvotes": 27,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ixykn6/fifth_and_final_series_of_you_coming_to_netflix/"
    },
    {
        "id": "1iygsx0",
        "author": "debiEszter",
        "title": "I canceled my plan, but forgot to remove my payment info. Now my plan is indeed canceled, but there's no option for me to remove my payment method. Is it removed or is it just hidden for some reason?",
        "content": "what the title says, pretty much\n\nif i pressed the \"Restart Membership\" button, would it restart without asking for my card details because it already knows?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1iygsx0/i_canceled_my_plan_but_forgot_to_remove_my/"
    },
    {
        "id": "1iy86ou",
        "author": "RJMC5696",
        "title": "Kaos",
        "content": "Just finished rewatching it for the second time. I Think it was a brilliant show with great actors, and had so much potential. Sad that there’ll be no season two. Anybody else wish there would be a second season? ",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iy86ou/kaos/"
    },
    {
        "id": "1iyj5cl",
        "author": "Robemilak",
        "title": "Millie Bobby Brown Hasn't Seen Final Season of 'Stranger Things' Yet",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iyj5cl/millie_bobby_brown_hasnt_seen_final_season_of/"
    },
    {
        "id": "1iyaux4",
        "author": "br_web",
        "title": "Your device isn’t part of the Netflix Household for this account",
        "content": "I have been living in the same house for 6 years, I have had the same ISP for all the 6 years, I have 3x Apple TVs, 1x iPhone, 1x iPad and 1x MacBook Pro, all devices, but the MacBook Pro work fine with Netflix, only with the MacBook Pro I don't have access to Netflix and get the message below.\n\nWhy is this happening, none of the devices have been outside the house or connected to a different Wifi network or ISP, I would understand this could happen if the ISP changes the WAN IP, but in that case all devices in the house will be impacted (they all share the same WAN IP) not just one device, is there a reasonable explanation for this?\n\nNote: I already signed-out from all devices and rebooted them as requested by Netflix customer support (honestly it is a joke, zero power to do anything), then, the representative submitted a ticked with the \"offline team\", who is like a ghost team, they never called you back and send any communication with the status of the ticket, I had this exact same problem a year ago. \n\nThanks\n\n# Your device isn’t part of the Netflix Household for this account ",
        "upvotes": 4,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1iyaux4/your_device_isnt_part_of_the_netflix_household/"
    },
    {
        "id": "1ix6jar",
        "author": "ellissabain",
        "title": "Brian Laundrie’s sister speaks out after Gabby Petito doc and angrily defends her brother",
        "content": "",
        "upvotes": 1224,
        "comments": 468,
        "media": null,
        "permalink": "/r/netflix/comments/1ix6jar/brian_laundries_sister_speaks_out_after_gabby/"
    },
    {
        "id": "1iyfey4",
        "author": "Lil_Titty_Killa",
        "title": "What happened to movies?",
        "content": "I canceled my Netflix when they took off The Office years ago and just signed up again once the football season ended.\n\nIt seems like everything is now a series and movies are rare now. Is it just my algorithm or is this reality? I struggle to commit to 4+ episodes for everything I watch\n\nHoping its just my algorithm but I really seem to only see series on my home page and rarely any movies",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1iyfey4/what_happened_to_movies/"
    },
    {
        "id": "1iy6kr9",
        "author": "Potential-Custard209",
        "title": "Xo kitty train wreck",
        "content": "I’m sorry but this show is a train wreck that you can’t turn away from. It’s terrible, the acting is bad, and the storylines are just awful. Maybe it’s because I’m older and these actors are young but this show will never compare to the TATBILB movies. Am I the only one who thinks this show is overrated?? ",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1iy6kr9/xo_kitty_train_wreck/"
    },
    {
        "id": "1iydsro",
        "author": "genericboomer",
        "title": "Netflix logs you in when you click verification code in messages",
        "content": "My phone number has belonged to someone else in the past (presumably deactivated and given to me when I got it) and as such just got a Netflix verification code from the poor soul that this number used to belong to. Once I clicked on the link for the code, I was instantly logged in to his account - without password or any sort of verification. I'm assuming this is some sort of bug (pretty big security flaw if you ask me) and was wondering where I could report this sort of thing? Nothing on Netflix's website about reporting bugs.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iydsro/netflix_logs_you_in_when_you_click_verification/"
    },
    {
        "id": "1iy1guv",
        "author": "MysteriousDelay6266",
        "title": "Million Dollar Secret | Official Trailer | Netflix",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iy1guv/million_dollar_secret_official_trailer_netflix/"
    },
    {
        "id": "1iycg2x",
        "author": "Ok_Doctor_2057",
        "title": "How to fix the \"your device isn't part of this household\" issue?",
        "content": "My device is part of the household, I'm still living in that household, still connected to the same internet as that household, and yesterday this came up, my brother said it comes up sometimes and goes away again but it hasn't for at least 24 hours, how do I fix it?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1iycg2x/how_to_fix_the_your_device_isnt_part_of_this/"
    },
    {
        "id": "1iygxj6",
        "author": "MajorMorelock",
        "title": "Daughter away at college getting cut off from Netflix",
        "content": "My 19 year old daughter is our main Netflix watcher. She lives in our house but is staying in a college dorm for part of the year. Now we are getting her access cut because of your new anti password sharing policies. Or I can pay another $9/month to let her watch Netflix while she is at college. \nI pay for the Premium HD package with four instances of Netflix, I have four members of my family. \nI’m not going pay more and if my daughter can’t watch while at college I’m canceling the entire account. \n",
        "upvotes": 0,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1iygxj6/daughter_away_at_college_getting_cut_off_from/"
    },
    {
        "id": "1iy58nf",
        "author": "omertombul",
        "title": "Netflix hw overlay problem",
        "content": "Im using a Xiaomi 10S, and due to software issues, every video looks yellowish and bad. Because of this, I have to use HW overlay. However, when HW overlay is enabled, Netflix shows a black screen. There is audio and subtitles but screen is black. I tried watching through a browser, but browsers either redirect me to the Netflix app or give an error. How can I watch Netflix with HW overlay enabled? Or is there a way to run it through a browser? Please, Im about to lose my mind",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iy58nf/netflix_hw_overlay_problem/"
    },
    {
        "id": "1ix1eod",
        "author": "Somethingman_121224",
        "title": "Dave Bautista Is Pushing Netflix To Finally Make A 'Gears Of War' Movie",
        "content": "",
        "upvotes": 326,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1ix1eod/dave_bautista_is_pushing_netflix_to_finally_make/"
    },
    {
        "id": "1ixsz31",
        "author": "Evereign8",
        "title": "\"Device not part of my household\"... yet all devices are.",
        "content": "So I have two tv's, a PS5, and my phone with netflix. All on the same network. The tv's are on wifi and the PS5 is on ethernet. We normally have one or two going at the same time. I have three profiles but all on one account. Our problem is that occasionally one device will say it isn't a part of my household and then I'd be prompted to update my household list (again). So.. I'll check the network, still connected to the one and only router in the house, and do the update anyway. Then, a few days later, another device (on the household list) will pop the same issue. This has been going on for a while and I've been constantly having to update the list on each device when it happens. I'd really appreciate some help with this as it's getting to be such a hassle. Maybe I'm missing something about screens on netflix or something? I have no idea. But if anyone knows about or has gone through similar, any info on this would be awesome. Thanks!",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ixsz31/device_not_part_of_my_household_yet_all_devices/"
    },
    {
        "id": "1ixso69",
        "author": "Pep_Baldiola",
        "title": "Revelations | Official Teaser | Netflix (from the director of Train to Busan)",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ixso69/revelations_official_teaser_netflix_from_the/"
    },
    {
        "id": "1iyeta7",
        "author": "Zealousideal_Low_321",
        "title": "Suggest some Shows/Movies where the Wife/Girlfriend is cheating on their Partner",
        "content": "Recommend some Shows/Movies where the Wife/Girlfriend is cheating on their Partner with some other dude.\n\nIn modern times there are tons of movies/shows revolving around this plot which makes the plot insanely Dramatic &amp; I am sure Netflix has got many amazing shows/movies where The Wife/Girlfriend cheats on their Partner with some other man.. recommend some of these Shows/Movies guys 👍🏻",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1iyeta7/suggest_some_showsmovies_where_the_wifegirlfriend/"
    },
    {
        "id": "1iyeoll",
        "author": "AccomplishedHat9906",
        "title": "Does Belle Gibson (in her white suit on 60 Minutes) look like Isla Fisher?",
        "content": "just finished watching The Search for Instagram’s Worst Con Artist, and during Belle Gibson’s 60 Minutes interview—especially when she’s in that white suit—I couldn’t shake the feeling that she looks a lot like Isla Fisher. Anyone else see the resemblance, or is it just me?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iyeoll/does_belle_gibson_in_her_white_suit_on_60_minutes/"
    },
    {
        "id": "1iy2ciz",
        "author": "Yummy_Oishi",
        "title": "Linked lists?",
        "content": "I'm just a little confused.\nI resubscribe to Netflix again and I shared my account with my friend. We have our own profiles. When i got my account back I still had all of my shows on My List from before on my profile and she had none on her profile until she added 2 shows.\n\nAll of a sudden I go in today and all of my shows are gone apart from the two on my friend's profile. So I add it all back and all of a sudden she messages me like \"where'd all of these shows come from?\"\n\nAnd yes we were both on separate profiles. It's not a big deal I'm just wondering if that'd a thing? To have linked My Lists?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iy2ciz/linked_lists/"
    },
    {
        "id": "1iyityo",
        "author": "Stepin-Fetchit",
        "title": "Jeremy Alan White is a terrible actor",
        "content": "It really doesn’t help that he looks like a rat but he has zero range, literally the same stupid stunned facial expressions and robotic mannerisms in every episode. I would call him wooden but he’s not quite that lifeless, but he’s close. He just has the same handful of tricks he uses over and over - stare lifelessly, nervously look down, scratch the back of his head. I’m not sure why he keeps getting work. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1iyityo/jeremy_alan_white_is_a_terrible_actor/"
    },
    {
        "id": "1iy16gb",
        "author": "Bambusbjornen",
        "title": "Using my own account in another home",
        "content": "I am regularly at my mom's place and watch Netflix alone on her TV while she does chores and such. Can I log in to my own account to continue where I left? It would be very inconvenient to have to log in and out of accounts each time just to watch for an hour.\n\nI can't cast from my phone either. I live in Europe, if it makes a difference.",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1iy16gb/using_my_own_account_in_another_home/"
    },
    {
        "id": "1iy0ghn",
        "author": "kebabmc",
        "title": "Shows and continue watching bugged",
        "content": "When I opened my Netflix today on my iPad, nearly all of my continue watching was missing, and a bunch of shows just cannot be found. Example:  I had tried to start gurren Lagan, but when I searched on my iPad I couldn’t find it, but on my tv I could find it. Does anyone have an idea of what’s happening \n\nEdit: I’ve looked abit and I’m only getting Netflix originals, don’t know of this helps but any help on solving would be great. I’ve tried updating and uninstalling it ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iy0ghn/shows_and_continue_watching_bugged/"
    },
    {
        "id": "1ixzyeg",
        "author": "Ishaat-Ashfaq-Ayon",
        "title": "Netflix subtitles (CC) not in sync",
        "content": "I was watching House and noticed the English subtitle (CC) is not in sync in many episodes. My internet connection is fine. I've tried:\n- Turning the subtiles on and off\n- Restarting Netflix app\n- Restarting device (Phone)\n\nIs there any way to fix this? Is the problem with my device or with the show?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ixzyeg/netflix_subtitles_cc_not_in_sync/"
    }
]