[
    {
        "id": "1ni0kij",
        "author": "SanderSo47",
        "title": "September 12-14 Box Office Recap – 'Demon Slayer: Infinity Castle' opens with an incredible $70M domestically, the biggest debut for an anime. Worldwide, the film crosses $450M. 'Downton Abbey: The Grand Finale' and 'Long Walk' open solidly, while 'Spinal Tap II' flops in ninth place.",
        "content": "https://preview.redd.it/qz0rpc64pepf1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=c78a538f0dded5ea9be496979987b929230cc72c\n\nIt was another incredible week in September, as ***Demon Slayer: Kimetsu no Yaiba – The Movie: Infinity Castle*** destroyed so many records in its domestic debut, as well as new overseas territories. The rest of the newcomers had varying degrees of performance: ***Downton Abbey: The Grand Finale*** and ***The Long Walk*** had solid debuts, and ***Spinal Tap II: The End Continues*** unsurprisingly flopped in wide release.\n\nThe Top 10 earned a combined $139.3 million this weekend. That's up a massive 61.9% from last year, when ***Beetlejuice Beetlejuice*** repeated at #1.\n\nDebuting at #1, ***Demon Slayer: Kimetsu no Yaiba – The Movie: Infinity Castle*** earned an incredible $70.6 million in 3,315 theaters. That's not only the biggest in the franchise, but it's also the biggest debut for an anime film domestically, dethroning ***Pokémon: The First Movie - Mewtwo Strikes Back*** ($31 million) after 26 years. It's also the sixth biggest September debut in history, and the biggest animated debut of the year.\n\nHow could ***Demon Slayer*** open this high? It's one thing to break ***Pokémon***'s record, but to make twice as much is just nonsensical. Simply put, the popularity of the anime and manga have increased drastically over the past years (it's reported to have sold 220 million copies). But the main selling point was that this is the beginning of the end: it's the first part of a planned trilogy. So it's practically getting all possible fans for the final ride.\n\nSony didn't spend much on marketing: Deadline reported marketing was just $10-$12 million, and that didn't include linear or sports spend. Instead, Sony heavily targeted promo on Crunchyroll, which was a smart strategy. Some properties just prove to have a more loyal audience, who is ready to pay tickets for a film.\n\nAccording to Sony, 57% of the audience was male and 71% was in the 18-34 demographic. Its biggest demographic was Hispanics, which represented 37% of the audience. They gave it a strong \"A\" on CinemaScore, which fits well with its positive reviews. The film is just $15 million away from passing ***Pokémon*** to become the biggest anime title in North America. It also really makes you think how big the next two films will be, whenever they come out.\n\nAnd don't expect great legs for this. Anime titles have been notorious for their front-loaded nature, and with a huge debut, ***Demon Slayer*** is going to take a steep drop next week. It's also seen in its opening weekend, for walk-ups were very weak: walk-ups represented only 33% of the weekend's audience. For a comparison, the average walk-ups for an MCU title usually is 50% or 60%, and family titles are 75%. So clearly, the film won't have much appeal outside its fanbase. But when there's numbers like this, it's hard to be disappointed.\n\nIn second place, ***The Conjuring: Last Rites*** earned $25.6 million. That's a gigantic 69.5% drop from last week, which is the steepest in the franchise; it was worse than ***The Nun*** (66.1%). The drop isn't entirely surprising, given the film's \"finale factor\" led to a gigantic opening and the film's mediocre reception, but it still fell harder than expected. Nevertheless, with $130.5 million in the bank, it doesn't really matter as it's already a big hit. It's just $7 million away from passing the original ***Conjuring*** for the highest grossing film in the franchise, but it doesn't look like $200 million will be reachable.\n\nIn third place, Focus Features' ***Downton Abbey: The Grand Finale*** earned $18.1 million in 3,694 theaters. That's 13% above ***A New Era*** ($16 million), but it's still below the first film ($31.3 million). Not like there wasn't much to be expected here.\n\nBy this point, it's pretty much clear that this is for fans of the show only. It couldn't garner the big jump like other \"finale factor\" films, but it's probably unrealistic to expect it. At least the reviews (90% on RT) were strong enough to make sure that people knew this would be a satisfying closure to this franchise.\n\nAccording to Focus Features, 72% of the audience was female. As expected, it skewed old; 56% of the audience was 55 and over. They gave it a strong \"A\" on CinemaScore, suggesting very word of mouth on its favor. Usually, films targeting old audiences enjoy good legs. So at the very least, ***Downton Abbey*** should make something around $50 million at worst.\n\nIn fourth place, Lionsgate's ***The Long Walk*** debuted with $11.7 million in 2,845 theaters. Compared to other Stephen King adaptations, that's below this year's ***The Monkey*** ($14 million) and 2023's ***The Boogeyman*** ($12.3 million). But those were more supernatural horror, compared to the dystopian thriller horror in ***The Long Walk***.\n\nThe budget was kept low at $20 million, so this a well enough debut. And it's complicated to ask for much better numbers for a film like this. For decades, attempts to adapt the novel have fizzled out, with Frank Darabont attached at one point. Unlike other mainstream horror films, this was very bleak, given that this revolves around teenagers forced to participate in a march, where they'll be killed if they stop. Reviews were quite strong (90% on RT), but some audience members probably preferred to skip it based on its content. It doesn't help that it opened on the second weekend of ***The Conjuring: Last Rites***, which was the main horror attraction this month.\n\nAccording to Lionsgate, 61% of the audience was in the 18-34 demographic. They gave it a \"B\" on CinemaScore, which is fine for a horror, especially considering the film's brutal and bleak tone. Perhaps it could leg out, but ***The Conjuring*** is still the top horror title, and ***Him*** could surprise the following week. For now, ***The Long Walk*** should finish with around $30 million. Not bad for a film like this.\n\nDisney re-released ***Toy Story*** for its 30th anniversary, and the film earned $3.4 million in 2,375 theaters. That took its lifetime total to $195.9 million.\n\n***Weapons*** dropped 47.8% and added $2.7 million this weekend. The film has earned $147.4 million, and it should cross $150 million in the next few days.\n\nAfter its strong debut, ***Hamilton*** collapsed 78.1%, earning 2.2 million. Through 10 days, the film has made $14.9 million.\n\nIn eighth place, ***Freakier Friday*** dropped 45.2%, for a $2.1 million weekend. That took its domestic total to $91.1 million, and it looks like it will finish below the $100 million milestone.\n\nYou have to go to ninth place to find another wide newcomer. Did you know there was a ***Spinal Tap*** sequel this weekend? You can't be blamed for missing it, as Bleecker Street often misses the mark when it comes to distributing films. And such was the case of ***Spinal Tap II: The End Continues***, which flopped with just $1.6 million in 1,920 theaters. On a $22 million budget, that's absolutely poor.\n\nThis debut is no surprise. Despite its status as one of the greatest comedies ever, ***This Is Spinal Tap*** is still a niche property. After all, the original film tapped out with just $4.4 million domestically. Even if we adjusted for inflation, that's just $14 million, which is far below other popular comedies at the time. Usually, when you make a sequel, you strike while the iron is hot, not 41 years later. Even the reviews were far from the original (a middling 67% on RT and 59 on Metacritic), so there was no appeal outside of big fans.\n\nAccording to Bleecker Street, 74% of the audience was male. A huge problem for the sequel was the lack of interest from young audiences, and the stats reflect that: 60% of the audience was 45 and over. Basically, it's only aimed towards Gen X and older Millennials. In some good news, they gave it a good \"A–\" on CinemaScore, which is actually above the original's \"B\". Although the original was a brand new property that audiences weren't prepared for back in 1984. Nevertheless, with a very slow debut, it's gonna lose tons of screenings soon. It's very likely ***Spinal Tap II*** fails to outgross the original's unadjusted domestic gross.\n\nRounding out the Top 10 was another re-release: ***The Sound of Music***, which made $1.6 million in 1,219 theaters. That takes its lifetime gross to $164.8 million.\n\nJust outside the Top 10, ***The Fantastic Four: First Steps*** dropped 53% and added $1.5 million this weekend. The film's domestic total stands at $272.4 million.\n\nThe Indian title ***Mirai*** managed to earn $1.2 million in 400 theaters. That's $1.6 million if we add its Thursday numbers.\n\n***The Bad Guys 2*** dropped 52%, for a $1.1 million weekend. The film has earned $79.4 million, and it will close with around $83 million domestically.\n\n***Caught Stealing*** is also leaving theaters very quickly, as it fell from fifth place all the way to #14. After its steep second weekend drop, the third weekend was even worse: 65%, and just $1.1 million. The film has earned $17.6 million, and it's gonna struggle to get to $20 million.\n\nIn limited release, Mubi's ***The History of Sound*** debuted with $82,143 in 4 theaters. That translates to a so-so $20,536 per-theater average.\n\n#**OVERSEAS**\n\n***Demon Slayer: Kimetsu no Yaiba – The Movie: Infinity Castle*** also opened in a lot of key markets overseen by Sony, and that led to a pretty great weekend. The film earned $61 million overseas, taking its worldwide debut to $132 million. Adding in its Asian markets, the film has already grossed a gigantic $450 million (according to Deadline, there's some higher estimates but they're still unconfirmed). The film had strong debuts in Mexico ($9.8M), India ($5.2M), the UK ($4.6M), Brazil ($4.4M), Spain ($3.7M), Australia ($3.2M), Italy ($3M), Saudi Arabia ($2.8M), Peru ($2.8M), Central America ($2.4M), Argentina ($2.2M), and Chile ($2.2M). By next week, the film will pass ***Mugen Train*** ($506 million) to become the biggest Japanese film in history.\n\n***The Conjuring: Last Rites*** added $60.5 million overseas, which is quite solid considering the arrival of ***Demon Slayer***, allowing it to take its worldwide total to a fantastic $332 million. The best markets are Mexico ($21.2M), the UK ($16.6M), Brazil ($13.4M), India ($10.4M) and Germany ($10.3M). By next week, it'll become the first film in the franchise to cross $400 million worldwide.\n\n***Downton Abbey: The Grand Finale*** opened with $12.6 million overseas, for a $30.4 million worldwide start. Obviously, its biggest market was the UK with $6.3 million, preventing ***Demon Slayer*** from taking the top spot. Other markets include France ($1.4M), Australia ($1.2M), Netherlands ($900K) and Italy ($500K). This is solid, considering these were just 31 markets. It will keep adding more in the next few weeks.\n\nTwo films hit milestones this weekend. ***Materialists***, which is still going strong in its international run, has passed $100 million worldwide. It's A24's third biggest film worldwide, just behind ***Everything Everywhere All At Once*** ($142 million) and ***Civil War*** ($127 million). Also this weekend, Paramount's ***The Naked Gun*** has finally crossed $100 million worldwide.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Elio* | Jun/20 | Disney | $20,840,667 | $72,987,454 | $154,075,778 | $150M\n*Together* | Jul/30 | Neon | $6,763,357 | $21,273,159 | $32,273,159 | $17M\n*Honey Don't!* | Aug/22 | Focus Features | $3,025,525 | $5,810,510 | $6,736,510 | $20M\n\n- Very dark times for Pixar originals. ***Elio*** has ended its run with a very poor $72 million domestically and $154 million worldwide. In both fronts, it's an all-time low for Pixar. Factoring its $150 million budget, this is one of the year's biggest flops. Failing to attract families, this is some bad omen for the studio, at least on the original titles. You can see it in its future: 3 of the 5 scheduled titles are sequels. The big question now is what will be of ***Hoppers*** next year? Cause ***Elio*** showed there's no floor for a Pixar title.\n\n- Neon's ***Together*** has closed with $21 million domestically and $32 million worldwide. A solid take for a body horror, but its $17 million budget doesn't paint the film as a success. Clearly there's a market for the genre, but there's clearly a ceilling on its potential.\n\n- Turns out the title was a warning. Ethan Coen's ***Honey Don't!*** has closed with a terrible $5.8 million domestically and $6.7 million worldwide, against a $20 million budget. Somehow managed to make even less than ***Drive-Away Dolls***, but the film's very tepid response at Cannes killed all its prospects. Whatever the case, it's clear that Ethan's solo works aren't connecting with audiences.\n\n#**THIS WEEKEND**\n\nThere's two newcomers, and only one will fight for the top spot.\n\nUniversal is releasing something we rarely see on films: a sports horror film. That's ***Him***, which follows the trials of a young up-and-coming football player training at the isolated compound of an aging, nearly retired quarterback. Produced by Jordan Peele, it stars Marlon Wayans, playing against type as the antagonistic quarterback. The premise and trailers look very intriguing, and those horror fans uninterested in ***The Conjuring*** could get interested in this. But will it be strong enough to take the #1 spot?\n\nThe other release is Sony's ***A Big Bold Beautiful Journey***, directed by Kogonada. A romantic fantasy film starring Margot Robbie and Colin Farrell. There aren't many options for couples, so this is a film that could be a main attraction for women. But the film has skipped festivals, and awareness seems quite low on this one. Sony spent $50 million in buying the film, so there's some high expectations that might not pan out.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 34,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/RLIEuqqqFkIJ7EFmpzq-yD81ThWM9VnTRF0kXN8f5Yo.png?auto=webp&amp;s=b6debaac2651bb62150d477051f5ecfbf043fd2f"
        },
        "permalink": "/r/movies/comments/1ni0kij/september_1214_box_office_recap_demon_slayer/"
    },
    {
        "id": "1nhlqee",
        "author": "theatlantic",
        "title": "Hi! I’m David Sims, a staff writer at The Atlantic, covering movies and culture. I’m here to talk about the movies of the summer and movies to look forward to this fall. Ask me anything!",
        "content": "Hi Reddit! This summer, I wrote about many of the major film releases:\n\nI argued that James Gunn’s bright take on [*Superman*](https://www.theatlantic.com/culture/archive/2025/07/superman-movie-2025-review/683462/?gift=bFe8Cm5Ue-K-qmFIa1pU49Qb7FSZ3WLlBUzx9Yn2eqw&amp;utm_source=copy-link&amp;utm_medium=social&amp;utm_campaign=sharehttps%3A%2F%2Fwww.theatlantic.com%2Fideas%2Farchive%2F2025%2F09%2Ftrump-economic-pain-strategy%2F684166%2F%3Futm_source%3Dreddit&amp;utm_campaign=the-atlantic&amp;utm_medium=social&amp;utm_content=edit-promo) brilliantly embraced its corniness. In my [*Eddington*](https://www.theatlantic.com/culture/archive/2025/07/eddington-ending-explained-antihero/683632/?gift=bFe8Cm5Ue-K-qmFIa1pU40uE5ajeWrinoDGGM0_1AXY&amp;utm_source=copy-link&amp;utm_medium=social&amp;utm_campaign=sharehttps%3A%2F%2Fwww.theatlantic.com%2Fideas%2Farchive%2F2025%2F09%2Ftrump-economic-pain-strategy%2F684166%2F%3Futm_source%3Dreddit&amp;utm_campaign=the-atlantic&amp;utm_medium=social&amp;utm_content=edit-promo) review, I wrote about how the film aims to spark empathy toward its most twisted character, with uncomfortable results. And I wrote that Liam Neeson had made the perfect transition into comedy in [*The Naked Gun*](https://www.theatlantic.com/culture/archive/2025/08/the-naked-gun-2025-movie-review-liam-neeson/683734/?gift=bFe8Cm5Ue-K-qmFIa1pU4yconO7_WFPy8TLHD8QRRpk&amp;utm_source=copy-link&amp;utm_medium=social&amp;utm_campaign=sharehttps%3A%2F%2Fwww.theatlantic.com%2Fideas%2Farchive%2F2025%2F09%2Ftrump-economic-pain-strategy%2F684166%2F%3Futm_source%3Dreddit&amp;utm_campaign=the-atlantic&amp;utm_medium=social&amp;utm_content=edit-promo). \n\nIn this AMA, I’ll talk about which summer films were worth the hype, which flew under the radar, and which movies you should be looking forward to this fall. \n\nAsk me anything!",
        "upvotes": 1423,
        "comments": 694,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jn6e4hisvbpf1.jpeg?auto=webp&amp;s=acd1c66ea5703c3ba5865b3f3bd3add257afb66b"
        },
        "permalink": "/r/movies/comments/1nhlqee/hi_im_david_sims_a_staff_writer_at_the_atlantic/"
    },
    {
        "id": "1nhv7to",
        "author": "NoCulture3505",
        "title": "New Poster for \"Bone Lake\"",
        "content": "",
        "upvotes": 5529,
        "comments": 678,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/psn6gmlxodpf1.jpeg?auto=webp&amp;s=eed314e382cdfd85a2cc1e01961d6a81122ebebf"
        },
        "permalink": "/r/movies/comments/1nhv7to/new_poster_for_bone_lake/"
    },
    {
        "id": "1nhyq6n",
        "author": "Amaruq93",
        "title": "\"Hackers\" at 30 | A high tech time capsule that's still the perfect hit of '90s nostalgia",
        "content": "",
        "upvotes": 2534,
        "comments": 365,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/CjuIysKV6MxPnhURBZHpJ5uz3nRcw1FA3ToKvHk4duE.jpeg?auto=webp&amp;s=cd83f342bda8073bfce34af633481aa4d9ee01f0"
        },
        "permalink": "/r/movies/comments/1nhyq6n/hackers_at_30_a_high_tech_time_capsule_thats/"
    },
    {
        "id": "1ni6wue",
        "author": "G_Marius_the_jabroni",
        "title": "Ryan Gosling's character's personality flipping a switch in Drive was pretty eerie.",
        "content": "Nothing against Ryan Gosling, but before \"Drive\" I didnt think much of his acting abilities. But i'lll be damned if [if the dude straight up flipped a switch](https://youtu.be/u2YbMUcdElc) in his character's personality that is pretty rare in movies these days. He was just chilling by himself in a cafe, eating some pie, minding his own business, and all of a sudden that random dude cramps up in his space, pissing him off and causing a switch to flip, revealing his character's true, extremely dangerous  personality. Top-notch, in my opinion.",
        "upvotes": 634,
        "comments": 144,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KHl8-5t_fBG5YAv4O061rVKdlMOEu30n2pOLKjdWvjg.jpeg?auto=webp&amp;s=9861823b36a3e86dad4ac212e5e1beb161d56c40"
        },
        "permalink": "/r/movies/comments/1ni6wue/ryan_goslings_characters_personality_flipping_a/"
    },
    {
        "id": "1nhqppb",
        "author": "MoneyLibrarian9032",
        "title": "Official Imax poster for \"THE SMASHING MACHINE\"",
        "content": "",
        "upvotes": 4345,
        "comments": 526,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/p9y38yqkvcpf1.jpeg?auto=webp&amp;s=6ad13d1ef1c67ac7613f7be66603066a83bc63ea"
        },
        "permalink": "/r/movies/comments/1nhqppb/official_imax_poster_for_the_smashing_machine/"
    },
    {
        "id": "1nhusjw",
        "author": "MarvelsGrantMan136",
        "title": "‘Zootopia 2’ Adds Andy Samberg, Macaulay Culkin, Brenda Song and David Strathairn to Cast",
        "content": "",
        "upvotes": 1046,
        "comments": 66,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/14uOLQ9CLPmIEvJXgVEdvxRCj1vgKu8fBjfZb8WXwJM.jpeg?auto=webp&amp;s=22c79fc554aae80141ba3a9669c7a637305c2a19"
        },
        "permalink": "/r/movies/comments/1nhusjw/zootopia_2_adds_andy_samberg_macaulay_culkin/"
    },
    {
        "id": "1nhuqfj",
        "author": "habrasangre",
        "title": "Koyaanisqatsi - a 1982 American non-narrative documentary film.",
        "content": "",
        "upvotes": 904,
        "comments": 161,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kMfc2NaClCdHa3DM-_1kwk1PV7Q8PW_3GIuK6kG7Ijo.jpeg?auto=webp&amp;s=63f55e94ef6b15541695eb94a6045a10c1aadf95"
        },
        "permalink": "/r/movies/comments/1nhuqfj/koyaanisqatsi_a_1982_american_nonnarrative/"
    },
    {
        "id": "1niafcl",
        "author": "dorgoth12",
        "title": "Materialists effect: mentions of A24 film studio up 65% in dating app profiles",
        "content": "",
        "upvotes": 71,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Mdoseo_B9kw62rJtOSoD21WiDYC6ROl5HvtEDgPJoQw.jpeg?auto=webp&amp;s=bb62171e0792cde76911eff0f09629d02edd219f"
        },
        "permalink": "/r/movies/comments/1niafcl/materialists_effect_mentions_of_a24_film_studio/"
    },
    {
        "id": "1nhvdjo",
        "author": "graaahh",
        "title": "Who is the greatest scenery chewer in film history, in your opinion? And what is their best role?",
        "content": "Overacting gets a bad rap, but it can sometimes create characters who vastly improve their films. I think some of my favorite scenery chewing performances would include Al Pacino in Devil's Advocate, Robin Williams in Death to Smoochy, Tim Curry in Rocky Horror Picture Show, Richard Roxburgh in Van Helsing, or Christopher Lloyd in Back to the Future. What are your favorites? Which actors do you think are the greatest of all time in this category? ",
        "upvotes": 492,
        "comments": 857,
        "media": null,
        "permalink": "/r/movies/comments/1nhvdjo/who_is_the_greatest_scenery_chewer_in_film/"
    },
    {
        "id": "1ni3ziw",
        "author": "Raj_Valiant3011",
        "title": "Patricia Crowley, Star of TV’s ‘Please Don’t Eat the Daisies,’ Dies at 91",
        "content": "",
        "upvotes": 153,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cjinh9FtUPdvB4F-jaZtkDAHaExusgr8BAJIAw1-1SE.jpeg?auto=webp&amp;s=67539de383c24df1d78dd64d42e6ea7eaf3c98cc"
        },
        "permalink": "/r/movies/comments/1ni3ziw/patricia_crowley_star_of_tvs_please_dont_eat_the/"
    },
    {
        "id": "1ni2fky",
        "author": "WriterDave",
        "title": "This is where the famous silenced pistol \"pew pew\" sound in movies originally came from.",
        "content": "",
        "upvotes": 160,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lJZIi0wbhmeJKpyN_a9lobHsENSsAld0NIYzH8NKpA8.jpeg?auto=webp&amp;s=6ab2e77e75d0552b7cf3b116132774a6ab7bf6cf"
        },
        "permalink": "/r/movies/comments/1ni2fky/this_is_where_the_famous_silenced_pistol_pew_pew/"
    },
    {
        "id": "1nhvc0q",
        "author": "harmonica2",
        "title": "Are there any movies or shows that do not portray autistic characters as 'puritans'?",
        "content": "Me, my gf, and friend are autistic and we agree that it seems almost always in movies and TV, that autistic characters are portrayed as 'puritans' in the sense that they live very healthy and don't drink, get high, and only have sex if its the right person in dating, and never for casual, etc.\n\nBut are there any movies or shows that do not portray such characters this way perhaps?\n\n",
        "upvotes": 273,
        "comments": 216,
        "media": null,
        "permalink": "/r/movies/comments/1nhvc0q/are_there_any_movies_or_shows_that_do_not_portray/"
    },
    {
        "id": "1nhlaze",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'Chainsaw Man - The Movie: Reze Arc'",
        "content": "",
        "upvotes": 838,
        "comments": 78,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/m7k2npibubpf1.jpeg?auto=webp&amp;s=a539a22970fa20e0b9b7bcd6cc1de042a993c274"
        },
        "permalink": "/r/movies/comments/1nhlaze/new_poster_for_chainsaw_man_the_movie_reze_arc/"
    },
    {
        "id": "1ni82n9",
        "author": "tomservo88",
        "title": "'Insidious 6': Lin Shaye &amp; Amelia Eve To Star In Blumhouse &amp; Sony’s Next Installment From Jacob Chase",
        "content": "",
        "upvotes": 43,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9nZCkKpMtG85X24X9ugki_EV2p0oDzCqQ7QSL7z7ppI.jpeg?auto=webp&amp;s=75e24693af1494f439c7cfe81f384f86bf949cc0"
        },
        "permalink": "/r/movies/comments/1ni82n9/insidious_6_lin_shaye_amelia_eve_to_star_in/"
    },
    {
        "id": "1ni23vi",
        "author": "MarvelsGrantMan136",
        "title": "‘Trick ‘r Treat’ Returns to Theaters October 14 &amp; 16 With New 4K Restoration Along With Original Sam Short Film",
        "content": "",
        "upvotes": 90,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gzIqnzpApOHnvj9rDuOoScqlqeJop6OXsM924Eolwqs.jpeg?auto=webp&amp;s=2785d85469530194151efb17f90418f12cfefc13"
        },
        "permalink": "/r/movies/comments/1ni23vi/trick_r_treat_returns_to_theaters_october_14_16/"
    },
    {
        "id": "1ni39uf",
        "author": "kid_cataldo",
        "title": "Treasure Planet is good movie tbh",
        "content": "What I’ve always loved about Treasure Planet is that it feels like a time capsule from two different futures: one imagined in the 1700s, and one imagined in the early 2000s. On one hand, you’ve got the swashbuckling, hand-drawn grandeur of classic Disney adventure. On the other, you’ve got bold digital animation, sci-fi ships sailing solar winds, and that early-2000s punk rock spirit through Jim Hawkins. It’s like a movie that exists in two eras at once (past and future) and somehow it works beautifully.\n\nIt had such a unique aesthetic that I don’t think I’ve seen replicated. If anyone knows any similar media that is like it, please share. \n\nAlso, idk if this counts as self promotion (I hope not) but I noticed reddit didn’t have a subreddit for this movie and went ahead and made one over at r/treasureplanetmovie ",
        "upvotes": 66,
        "comments": 21,
        "media": null,
        "permalink": "/r/movies/comments/1ni39uf/treasure_planet_is_good_movie_tbh/"
    },
    {
        "id": "1nhzdlb",
        "author": "stuffsnout",
        "title": "Worlds Divide: A movie animated by a single person released today Sept 15.",
        "content": "I'm super excited to get to watch this tonight. I think as tools keep getting better  we'll get to see more and more of these passion projects produced by talented individuals like Denver Jackson.",
        "upvotes": 106,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lLZdoh2WEnc1tvp4inIbVBMfgwLhDwL8mEWaRNWL1d8.jpeg?auto=webp&amp;s=1ef3a1d743bbc95329e6d689583a296a2e95ec7d"
        },
        "permalink": "/r/movies/comments/1nhzdlb/worlds_divide_a_movie_animated_by_a_single_person/"
    },
    {
        "id": "1nhobzx",
        "author": "KillerCroc1234567",
        "title": "First Poster for Na Hong-Jin's \"HOPE\"",
        "content": "",
        "upvotes": 351,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/epvkz50lfcpf1.jpeg?auto=webp&amp;s=5da0cb1c0b3b26f8b951581e6208da9415cfa5bf"
        },
        "permalink": "/r/movies/comments/1nhobzx/first_poster_for_na_hongjins_hope/"
    },
    {
        "id": "1nhlgjx",
        "author": "Amaruq93",
        "title": "Bloopers from \"Abbott and Costello Meet Frankenstein\" (1948)",
        "content": "",
        "upvotes": 469,
        "comments": 14,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6res19xrvbpf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1nhlgjx/bloopers_from_abbott_and_costello_meet/"
    },
    {
        "id": "1nh0nq2",
        "author": "EuphoricButterflyy",
        "title": "‘The Shining’ (1980) named Stephen King’s best film adaptation ever by Time",
        "content": "",
        "upvotes": 6772,
        "comments": 1199,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rP56pq2cwSFh9tRM2b5Vk23l4YHYzY1n0i8M9WtWuMA.png?auto=webp&amp;s=2d83724b9e47458b2dfa82800625abd40153ac9c"
        },
        "permalink": "/r/movies/comments/1nh0nq2/the_shining_1980_named_stephen_kings_best_film/"
    },
    {
        "id": "1nh94sb",
        "author": "the_hudge",
        "title": "Best use of the “wait how did you know that?” reveal?",
        "content": "Many movies have done the trope where a character reveals information they technically shouldn’t have (“I never said how he died. I just said he died. How did you know he was stabbed?”) and the lead discovers they aren’t who they say they are. What do you think is the best use of this trope?\n\nMy example is pretty much ripped straight from Reindeer Games which maybe isn’t the best use of it, but I sure do love it. ",
        "upvotes": 1974,
        "comments": 672,
        "media": null,
        "permalink": "/r/movies/comments/1nh94sb/best_use_of_the_wait_how_did_you_know_that_reveal/"
    },
    {
        "id": "1ni50lj",
        "author": "tendervittles",
        "title": "Did anyone catch “Code 3” this past weekend?",
        "content": "It was so freakin’ GOOD. Didn’t know what to expect going in but was blown away by the end. Hopefully it reaches a larger audience soon. It’s a dark comedy for sure but it’s got a squishy middle that’s quite endearing. The characters and performances were great, with a few clinch moments of gratifying social commentary sprinkled in. I’m calling it the “Office Space” for paramedics. It’s just fun, intelligent humor that educates at the same time. Based on earlier threads, the film didn’t seem to generate much interest here but I say hit pause on your preconceptions and just go see it. Seriously. I guarantee you’ll be pleasantly surprised by how much you like this film. Despite the limited release, did anyone else see it by any chance?",
        "upvotes": 13,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1ni50lj/did_anyone_catch_code_3_this_past_weekend/"
    },
    {
        "id": "1nhsrgt",
        "author": "BunyipPouch",
        "title": "Official Trailer for 'The Luc Besson 9-Film Collection' 4K UHD Set - The Fifth Element, Leon: The Professional, La Femme Nikita, Le Dernier Combat, Subway, The Big Blue, Atlantis, The Messenger: The Story of Joan of Arc, and Angel-A.",
        "content": "",
        "upvotes": 64,
        "comments": 63,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ElvZ0aBSiMgeVjNPiiir6ChpzSw2-yoNYl30FSvbxng.jpeg?auto=webp&amp;s=07e057fdbdd5ff3db55b153a8a955f17fd9c38d8"
        },
        "permalink": "/r/movies/comments/1nhsrgt/official_trailer_for_the_luc_besson_9film/"
    },
    {
        "id": "1nh8nll",
        "author": "NoCulture3505",
        "title": "Springsteen: Deliver Me From Nowhere | Official Trailer",
        "content": "",
        "upvotes": 1080,
        "comments": 342,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TWeCCO7o7WqqjQhlbyf7RjKrwUcbkYXgBrIZJCvDwGU.jpeg?auto=webp&amp;s=61117cc04304c185e82fa5c0ad5efa3e7c01786d"
        },
        "permalink": "/r/movies/comments/1nh8nll/springsteen_deliver_me_from_nowhere_official/"
    },
    {
        "id": "1ni3xrt",
        "author": "Towel43",
        "title": "Halloween movies",
        "content": "Wanted to get my list started early, what is your favourite Halloween movies to watch?? Can be horror, classic, kid movies etc. just anything that sets the ambiance of halloween/fall. \n\nSome that I have already are:\n1) Halloween (all)\n2) Halloweentown \n3) nightmare before Christmas \n4) Trick r treat (my fav) \n\nJust so you have an idea of what I’m looking for ",
        "upvotes": 12,
        "comments": 32,
        "media": null,
        "permalink": "/r/movies/comments/1ni3xrt/halloween_movies/"
    },
    {
        "id": "1ni252t",
        "author": "YemethTheSorcerer",
        "title": "What are some movies about people who are pushed into action by the simplest causes or motivations?",
        "content": "Movies like John Wick, where the killing of his poor little dog is what set him off. Not only of course that he was an adorable good boy but he was basically also a lasting remnant of Wick’s dead wife. But that single action set him off. \n\nAnd also First Blood, the first Rambo movie, where the man just wanted to get a bath and a burger. He is basically just existing and nothing would have happened if he had just been left alone to just exist. ",
        "upvotes": 15,
        "comments": 39,
        "media": null,
        "permalink": "/r/movies/comments/1ni252t/what_are_some_movies_about_people_who_are_pushed/"
    },
    {
        "id": "1ni1j2g",
        "author": "Sisiwakanamaru",
        "title": "Mary McDonnell Thriller Film ‘One Second After’; The two-time Academy Award nominee is set to star opposite Josh Holloway and Hannah John-Kamen in the movie adapting the 2009 novel.",
        "content": "",
        "upvotes": 15,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/tybAwk35aOOQ3KvXoBmNSRV8B0_HXQPPwLJOJ_dpn-g.jpeg?auto=webp&amp;s=c6e51d302b21f5d1ce7ff4224a03d2e5c1ef274c"
        },
        "permalink": "/r/movies/comments/1ni1j2g/mary_mcdonnell_thriller_film_one_second_after_the/"
    },
    {
        "id": "1nhq1fp",
        "author": "UpperphonnyII",
        "title": "What films are oddly comforting or cozy to you?",
        "content": "As the title states. What film which really isn't meant to be cozy though it is one for you? For me it's Lindsay Anderson's 'If....' (1968). The themes and climatic ending is anything but comforting but the overall environment in the film really sets me in a mood. It takes place in an English public school, it is autumn, and there is a sense of order to it all. \n\nI'm an American and never went to such a school. Though I miss the environment of elementary school. There was still plenty of wood furnishings with little change over decades. The cool and foggy mornings. So the opening parts to this film gets me that feeling. The first two 'Harry Potters' gives me that vibe too. So what about you all?",
        "upvotes": 57,
        "comments": 152,
        "media": null,
        "permalink": "/r/movies/comments/1nhq1fp/what_films_are_oddly_comforting_or_cozy_to_you/"
    },
    {
        "id": "1nhzmoq",
        "author": "LaserDiscCurious",
        "title": "\"Breakfast at Tiffany's\" (1961) - As iconic as Audrey Hepburn was, Marilyn Monroe made more sense for Holly Golightly",
        "content": "Truman Capote wanted Marilyn Monroe to play Holly and he never accepted Audrey Hepburn as that character. \n\nHepburn is occasionally good in the movie, especially in the more dramatic swerve and she looks incredible in the fashions BUT you never really get the impression she's a hooker or a call girl. Hepburn just comes off as a society lady who entertains rich men in her apartment. \n\nMonroe oozes sex and also that awkwardness that would fit Holly and her attempt to blend in.",
        "upvotes": 18,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1nhzmoq/breakfast_at_tiffanys_1961_as_iconic_as_audrey/"
    },
    {
        "id": "1nib8ug",
        "author": "LaserDiscCurious",
        "title": "What is your opinion on Joan Crawford as an actress?",
        "content": "She's known for her melodramas and the persona Mommie Dearest. I've always found Crawford an underappreciated talent, though, because if you watch some of her pictures, what she does onscreen, especially in her best films, is incredible. The way she's able to tear up and express her face accordingly, every emotion coming through, either fear or tension. Even though Crawford made very few silent pictures, you can see the influence in how she expresses her face onscreen.  The closet sequence in Sudden Fear is an absolute masterpiece of acting. \n\nWhile I find Bette Davis more entertaining, I do find Joan Crawford to be the stronger actress of the two. Crawford's acting comes across as more natural, more organic, by comparison. She wasn't method-y yet I found her acting less theatric. \n\nSudden Fear, Mildred Pierce and Autumn Leaves are my top 3 Joan Crawford pictures. I want to see A Woman's Face. I haven't had the chance yet.",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1nib8ug/what_is_your_opinion_on_joan_crawford_as_an/"
    },
    {
        "id": "1ni9pev",
        "author": "oppaibesar",
        "title": "horror \"creatures\"",
        "content": "come here after watching The Ritual (2017) , Crawl (2019), Underwater (2020) and Nope (2022), and now maybe that kind of films are my favorite now.\n\ndo you guys have any recomendations horror films with some \"creatures\"?\n\ni really like how the story build up, and show the \"true form\" of the creatures at the end.\n\nIt is because The Ritual, that i now digging up this theme, that film was really really great for me. \n\n\\*sorry, english is not my main.",
        "upvotes": 5,
        "comments": 24,
        "media": null,
        "permalink": "/r/movies/comments/1ni9pev/horror_creatures/"
    }
]