[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 14,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1p9vc1e",
        "author": "Affectionate_Key7206",
        "title": "The stranger things aren't strange anymore",
        "content": "I know a lot of people are gonna come for me, but it's just my opinion. And don't get me wrong, this show will *always* have a special place in my heart, but it's clear that it's outgrown itself.\n\nThe 80s appeal no longer really has its charm, the kids are no longer kids, and most importantly, the stranger things aren't strange anymore. The unknown is what makes something unsettling. When you begin to spell out all the aspects, it doesn't have that eerie feeling anymore. This show has over-explained its lore to the point where it's very convoluted and no longer uncanny. The whole point of the Upside Down was the unknown, another world that's beyond human comprehension. All of that goes away when you reveal that it's just some guy who's been pulling the strings since the first season. Not only is it overly detailed, but it's also been the same thing for nearly a decade now. The monsters were creepy at first, but now we've seen it a hundred times, so it doesn't have that effect anymore.\n\nI rewatched seasons 1 and 2, and it's honestly crazy how much the show has detached from itself. If somebody watches season 1 and then watches the first episode of season 5 right after, they would be completely baffled. Remember when this show was just about a boy who went missing? And the characters have so much plot armor. I love how the demogorgon slaughters the background characters almost instantly, but when it comes to our protagonists, it stands and screams, so they always run away. Not to mention, the dialogue is also really bizarre, lots of exposition dumps, etc.\n\nThere's a lot more I could say, but I don't want this to be too long. I just needed to voice my thoughts somewhere cause anytime you complain on TikTok or the ST subreddit, you just get attacked lol. But I'm glad others are enjoying it. I wonder if it will be one of those shows with an ending that's divisive among fans.",
        "upvotes": 1021,
        "comments": 393,
        "media": null,
        "permalink": "/r/netflix/comments/1p9vc1e/the_stranger_things_arent_strange_anymore/"
    },
    {
        "id": "1pa32qj",
        "author": "Samurai_Geezer",
        "title": "Why is it so difficult to just watch the credits after the movie is done",
        "content": "I do not want a commercial right after an emotional ending of a movie, I want to think about it a bit more, pay respects to the people who made it, check out if that one actor I vaguely recognized was really the one I thought it was. Now I have to scroll through the entire movie just to get back to the credits that was automatically skipped. Goddamnit ",
        "upvotes": 153,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1pa32qj/why_is_it_so_difficult_to_just_watch_the_credits/"
    },
    {
        "id": "1palmyi",
        "author": "Texanlivinglife",
        "title": "Sweet Magnolia's",
        "content": "Perfect day for binge watching. I love Sweet Magnolia's but, I'm having a hard time finding anything like it. I'm really not watching Christmas movies. Recommendations please and thanks.",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1palmyi/sweet_magnolias/"
    },
    {
        "id": "1pan4i2",
        "author": "Remarkable-Slide-750",
        "title": "Stranger things season 5! What’s your thoughts?",
        "content": "I loved season 5! I had low expectations because it’s hard for a show to keep me engaged after season 3 and the fact so much time has passed between seasons but I think season 5 was carefully orchestrated! The characters weren’t overly exaggerated, the storyline had a lot of hooks so you’re not just waiting for that “one” thing to happen, and the relatable symbolizations of inner battles we all good through. I say bravo for keeping season 5 evolved while maintaining a steady baseline story! ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1pan4i2/stranger_things_season_5_whats_your_thoughts/"
    },
    {
        "id": "1palplt",
        "author": "ThomasThePizzaMan",
        "title": "Please help, Netflix Puzzle shows emojis when you win, what do they mean?",
        "content": "Stupid question… I’ve been playing Netflix Puzzle and every time I finish a level, the game shows a set of emojis at the end of the win screen. Some of them look random or out of order, and I can’t tell if they’re supposed to represent my performance, a mood, hints, difficulty, or just something decorative for fun. I’m wondering if anyone knows what these ending emojis actually mean. Is there a pattern or scoring system behind them? Or is it just visual flair? Bonza, Jigsaw, Crossover, Sudoku, Starstruck, Waywords, Shapes, and Keysmash. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1palplt/please_help_netflix_puzzle_shows_emojis_when_you/"
    },
    {
        "id": "1pac2fm",
        "author": "DataPollution",
        "title": "Stranger Thing - only in HDR instead of Dolby Vision (LG G1)",
        "content": "Hi. I just rejoined Netflix and signed up and tried to watch stranger thing. My question is why does it use HDR while in the description it does say Dolby Vision on my LG G1 tv. Other shows and movies does work with Dolby Vision. Am I missing something here. \n\n\nPS: I use the netflix app and yes it is latest version. ",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pac2fm/stranger_thing_only_in_hdr_instead_of_dolby/"
    },
    {
        "id": "1paixeq",
        "author": "Ttalgi-gongju",
        "title": "Triple Charged On My 1st Subscription",
        "content": "I got my new subscription to Netflix and upon checking my online bank account, I got triple charged. I immediately contacted chat support and mentioned that I should be getting the charged amount by 24-48 hours. I subscribed last November 28 at 10:20PM, I am just anxious since I’m still not getting the charged amount back and it has been 48 hours. \n\nDid anyone experienced this on their first time subscribing to Netflix? Can I have a little help here? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1paixeq/triple_charged_on_my_1st_subscription/"
    },
    {
        "id": "1paaxql",
        "author": "anonymouszod",
        "title": "Not connected to home internet",
        "content": "We’re in college and use my father in laws Netflix account, for the last few years we’ve just simply taken home our console whenever we go back and use it on the home wifi then when we come back to college it works great. We just did this same thing (same process and everything which included starting/watching a show on it) and it still blocks us (this goes for Disney+ too). Any idea on why or how to fix it??",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1paaxql/not_connected_to_home_internet/"
    },
    {
        "id": "1pac9n1",
        "author": "Ashamed-Fee905",
        "title": "Next Gen Chef is adorable",
        "content": "Just finished watching the finale and I can’t help but absolutely adore ilke 🙁 she’s such a sweet and kind soul and so wonderfully quiet yet also so passionate idk she’s just all around an amazing person. I especially loved literally everyone’s dynamic on the show with her, everyone treats her so gently it’s adorable 😭 she made the final, Olivia asked if she was okay. Joaquin was constantly asking her whether she was okay during the show and challenges, especially during the last episode. Everyone was so sweet and gentle to her and I truly think it’s just the most adorable thing ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pac9n1/next_gen_chef_is_adorable/"
    },
    {
        "id": "1pa4b2k",
        "author": "Virtual-Breadfruit96",
        "title": "help with freezing",
        "content": "my netflix freezes every 5 minutes or so. I am on a laptop (dell xps 16 9640) and cannot figure out why it keeps on freezing. When i watch movies or shows on other websites, it works fine. But when I am on either the netflix app or the website, my video freezes very often and the only way to fix it is to close the browser/app and then reopen. Can anyone help? ",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pa4b2k/help_with_freezing/"
    },
    {
        "id": "1pae0w3",
        "author": "Flako72",
        "title": "Image quality",
        "content": "Greetings, I would like to know if anyone else has the problem I am having with Netflix and it is that at times and very frequently the image quality drops so much that it seems that I have less than 1mgb of Internet, and it is not something general because it does not happen to me on my other platforms. All of this happens on the Apple TV 4K connection and Starlink residential plan which is pretty decent.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pae0w3/image_quality/"
    },
    {
        "id": "1p9a8zh",
        "author": "dehia_anne",
        "title": "Stranger Things Season 5: Is it just me or…",
        "content": "Is it just me or has it been hard to get into season 5? We all know there’s sooooo much time in between seasons. I didn’t have it in me to re-binge the first four seasons, so I read recaps then started season 5 earlier today. \n\nI’m just getting lost in all of the nitty gritty details. Maybe my attention span isn’t what it used to be, but I just am not getting into this last season like previous seasons (and I was once a diehard ST fan). Just me?",
        "upvotes": 393,
        "comments": 519,
        "media": null,
        "permalink": "/r/netflix/comments/1p9a8zh/stranger_things_season_5_is_it_just_me_or/"
    },
    {
        "id": "1p9zy48",
        "author": "Antique_Initiative66",
        "title": "Fun shows",
        "content": "I’m looking for something light that I can semi follow while doing other things…some shows I love but have watched multiple times are \n\nDead to Me \nCall the Midwife \nThe Good Place \nThe West Wing \nYoung Sheldon \nDesperate Housewives \n\nAnything similar to those that might make me laugh but that I don’t have to totally focus on would be awesome! ",
        "upvotes": 8,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1p9zy48/fun_shows/"
    },
    {
        "id": "1p9i4en",
        "author": "casualnihilist_112",
        "title": "(SPOILERS) The Complete Stranger Things Season 5 Theory",
        "content": "Hey everyone,\n\nSo here is my full theory on how I think Season 5 is building toward the final showdown. I am connecting everything from the show, the new season, The First Shadow play, and the patterns we have seen over the years. I will go from the beginning and build the whole picture step by step so it flows and makes sense.\n\n⸻\n\n1. Vecna and Henry’s Origin and Why He Was Not Born Evil\n\nTo me, one of the most important things is the idea that Henry was not born evil. There are two pieces of canon that support this.\n\nThe first is the stage play, The First Shadow. In the play, we see Henry as a strange kid, but he is not violent or murderous. He only changes after an incident in the cave. He interacts with experimental equipment from Brenner’s project, and that accident sends him into Dimension X for the first time. That is the first moment where he is exposed to pure Dimension X energy and Mind Flayer particles.\n\nThe second piece of evidence comes from the show itself. In Season 2, when Will is possessed by the Mind Flayer, his behavior changes instantly. He becomes cruel, manipulative and cold. The scene where he leads the soldiers into the Demodogs is a perfect example. Will would never do that under normal circumstances. That tells us the Mind Flayer particles do not just control you physically. They change the way you think and feel.\n\nSo when Henry gets exposed in the cave, the same thing happens to him. He comes back from Dimension X with a completely different worldview. He starts seeing humans as lesser beings. He starts having thoughts about domination and reshaping reality. All of this lines up with the Mind Flayer’s ideology, not with Henry’s original personality.\n\nThis tells me Henry was not inherently evil. He was corrupted by Dimension X.\n\n⸻\n\n2. The Cave and Why Vecna Is Afraid of It\n\nThis detail is one of the most important clues in Season 5. Vecna refusing to enter that cave is not random at all.\n\nHere is the corrected canon interpretation based on the play and the show.\n\nIn The First Shadow, the cave is the exact place where Henry gets exposed to Dimension X. That is where the equipment malfunction happens. That is where he gets pulled in. That is where the corruption begins.\n\nSo when Vecna avoids that cave many years later, that fear comes from Henry buried deep inside him. That moment was traumatic. It was the moment he lost control of his life and mind. The fact that he still hesitates shows that Henry is still inside Vecna. This supports the idea that he was not born evil. He still has human fear.\n\nThere is also a second meaning here. Vecna’s fear of the cave hints at something else being inside Dimension X that even he does not want to face. If he were the top villain, he would not fear walking into any place. The fact that he avoids the location that connects to Dimension X tells us that there is something older and more dangerous than him.\n\nThis ties into the Dungeons and Dragons idea of the Thessalhydra and the possibility that the true final villain is the ancient creature that corrupted Henry in the first place.\n\nSo the cave symbolizes both Henry’s corruption and the existence of a bigger threat.\n\n⸻\n\n3. Will’s Powers and Why Will Is More Important Than Anyone Realizes\n\nSeason 5 finally makes it obvious that Will is not just connected to the hive mind. He has actual psychic abilities. These abilities come from all of the exposure he had in Season 1 and Season 2. He breathed in particles. He lived in the Upside Down longer than anyone else. He hosted the shadow monster inside him.\n\nHis connection is permanent, and it is deeper than Eleven’s.\n\nWhen Will kills the Demogorgons using telekinesis, it is real telekinesis. His nose bleeds which is what happens when someone uses psychic force. That is something we only saw with Henry, Eleven and the other Hawkins Lab kids.\n\nThe difference is that Will’s power comes from the hive. He amplifies his own psychic output with the network of Dimension X. That is why he can do it from miles away. He is basically using the hive as a power source.\n\nThis is why Vecna has always sensed Will. Will has access to the same pathways that Vecna uses. Will is the internal counter to Vecna’s control. He is the one person who can fight Vecna from inside the hive while Eleven fights from the outside.\n\n⸻\n\n4. Kali and Why She Still Matters\n\nKali, or Eight, being present in Season 5 and in the Upside Down base is a huge sign. Kali was always the next strongest psychic after Eleven and Henry. Her illusion abilities might be the only thing that can shield the kids from Vecna or confuse whatever creature is coming from Dimension X.\n\nKali was also created through the same project as Henry and Eleven, which lines up with the idea that children are the best psychic conduits. If there is going to be a final psychic battle, Kali has a real role in it.\n\n⸻\n\n5. The Kidnapped Children and Vecna’s Lair\n\nSeason 5 shows us that Vecna has kidnapped twelve children. We see this through Will’s visions. Vecna even tells Will that he likes the idea of children being intermediates.\n\nThis lines up with everything we know about the Hawkins Lab experiments. Children have more psychic sensitivity. Their minds are easier to link to other dimensions. Vecna wants to use these twelve kids as psychic amplifiers to open something big. The number twelve matters because it fits a pattern of ritualistic or structural stability that we have seen in the Upside Down.\n\nThis connects directly to the wormhole idea.\n\n⸻\n\n6. Wormhole Theory and the Fleshy Wall Around the Upside Down\n\nOne of the best scenes in Season 5 is when Dustin, Nancy, Steve and Jonathan break into the UD and crash into the fleshy wall surrounding Hawkins.. Dustin realizes that the wall is perfectly circular around Hawkins and that the center of the circle is Hawkins Lab. This lines up with the original gate from 1979. The Upside Down formed as a snapshot frozen in time from that event.\n\nWe also have the science teacher giving a lesson on wormholes. This is the Duffers telling us that we are dealing with a tunnel between realities. Which confirms cannon from the First Shadow. The Upside Down is not a world by itself. It is a bridge. A halfway point. A buffer.\n\nThen Will makes that red swirling drawing of Vecna’s lair. It looks exactly like the wormhole diagram from the science class. All of this is pointing toward the same direction.\n\nThe fleshy wall is blocking the path. It is designed to contain Dimension X energy so it does not spill out completely.\n\n⸻\n\n7. The Full Wormhole Plan and Vecna’s Real Goal\n\nVecna does not want another small portal. That is not enough. Demogorgons are dangerous but too slow. Vecna wants a direct wormhole from Dimension X to the Rightside Up.\n\nTo do that he needs to break the wall around the Upside Down. He needs the psychic power of the twelve kids. He needs the full hive network. He needs to weaken the membrane so Dimension X can push through.\n\nThis wormhole would allow the ultimate evil to enter. It could be the Thessalhydra or another massive creature from Dimension X. Vecna is building the bridge to bring this thing here. He is not the final villain. He is the one preparing the way for the real one.\n\nEpisode by Episode Breakdown and the Full Final Showdown\n\n(Part 2 of 2)\n\nNow that all the background is clear, everything starts falling into place when you look at how each episode moves the story toward the final fight in the Rightside Up.\n\nLet me go episode by episode and connect the dots.\n\n⸻\n\nEpisode 5: Shock Jock\n\nBy the time we reach this episode, the group already knows that the Upside Down is surrounded by that fleshy circular wall. Dustin figured that out earlier when they crashed into it. He also figured out that the center of that wall is Hawkins Lab, and that the wall is acting like a barrier to keep Vecna’s lair hidden and stop El from reaching the kids. It is also stopping something from Dimension X from leaking fully into our world.\n\nIn Shock Jock, the gang is not randomly sending out a big radio wave. They are doing it because they need to weaken that fleshy wall. They know Vecna has twelve children held inside his lair. Will has seen this in his visions. These kids are being used as psychic amplifiers. The gang understands that unless they break through the wall, they cannot reach Vecna’s lair and rescue the children.\n\nThe red radio wave is the attempt to blast the membrane. (Maybe). It will weaken. It might open just enough for them to get partial access. This is not the full wormhole yet. This is just the gang trying to break the blockade around the Upside Down.\n\nInside Hawkins Lab, they start finding clues. They discover old files, old devices, and remnants of Brenner’s experiments that hint at Dimension X being the real origin point. This confirms Dustin’s wormhole theory. It also matches what we saw in The First Shadow. The lab was messing with dimensional energy long before anyone realized what it was capable of.\n\nShock Jock ends with the barrier weakened but not destroyed. The gang realizes that Vecna is building something on the other side that they cannot fully see yet. Will senses that something massive is coming. The tension is now building toward a direct dimensional breach.\n\n⸻\n\nEpisode 6: Escape from Camazotz\n\nThis episode focuses heavily on Max and Holly. Holly has been reading A Wrinkle in Time earlier in the season. She uses the name Camazotz to describe the place where Max is stuck. Camazotz in that book is a world of mind control and psychic domination, which is a perfect description of Vecna’s mental realm.\n\nMax is trapped inside Vecna’s mind. Holly can see this because she has been exposed to particles earlier in the season, which has made her sensitive. It is not that Holly suddenly has full powers like Eleven or Henry, but she has enough psychic awareness to see and understand the mental traps.\n\n Max has already helped Holly navigate Vecna’s illusions. This episode reveals how powerful Vecna’s mind really is. He has built entire environments inside Camazotz that reflect his trauma, his corruption and the influence of Dimension X.\n\nAs Max and Holly fight their way out, their escape weakens Vecna. When someone escapes his mental realm, it forces him to redirect energy. That energy has to come from somewhere. Since Vecna is trying to build the wormhole during this same time, their escape disrupts his momentum.\n\nThis episode is important because it shows that Vecna can be weakened psychologically, not just physically. It also shows how Holly is now part of the larger fight. She is sensitive to Dimension X energy, and she becomes one of the keys to breaking Vecna’s control over the kids he kidnapped.\n\n⸻\n\nEpisode 7: The Bridge\n\nThis is the turning point episode. The title says it all. The Bridge is the moment where Vecna’s plan starts to succeed.\n\nWith the children acting as psychic nodes, Vecna begins to open a direct connection between Dimension X and the Rightside Up. This is not a portal like the ones we saw before. This is the wormhole Dustin was talking about. This is the tunnel between realities.\n\nThe membrane around the Upside Down starts tearing. Hawkins Lab begins to crack open. The air distorts. The sky changes color. Will’s connection to the hive mind becomes overwhelming. He starts seeing shapes and creatures from Dimension X that are trying to push through.\n\nThis is the episode where Will fully taps into the hive. We saw earlier that Will can now use telekinesis through the network. In The Bridge, he tries to stop Vecna from inside the hive, but Vecna fights back. This is the first time we see the two of them clash directly on the psychic plane.\n\nEleven and the others are fighting on the outside while Will fights on the inside. Kali might help counter illusions that Vecna uses against them. The children in Vecna’s lair begin to glow with Dimension X energy as the wormhole starts forming. The ground in Hawkins shakes. The barrier becomes thin enough that shadows start rising behind it.\n\nAt the end of the episode, the wormhole finally breaks open. Something massive is on the other side. A silhouette that looks like the Thessalhydra appears in the sky. Hawkins begins to collapse. This is where all the tension explodes into the final episode.\n\n⸻\n\nEpisode 8: The Rightside Up\n\nThe final showdown does not happen in the Upside Down. It happens in our world. That is why the episode is called The Rightside Up. The wormhole is fully open now. Dimension X energy floods into Hawkins. Dark clouds, red lightning, and shadow forms start pouring into our world.\n\nVecna steps into the Rightside Up. The children he kidnapped are still amplifying his power. The Thessalhydra or whatever ancient creature from Dimension X begins to break through the wormhole. Hawkins is almost unrecognizable.\n\nThis is where everything comes together.\n\nEleven fights Vecna physically.\nWill fights Vecna through the hive.\nKali uses her illusions to protect the group and distract the monster.\nHolly helps Max stay mentally grounded so Vecna cannot pull her back.\nThe gang fights the creatures entering Hawkins.\n\nThere is also a real possibility that Vecna does not remain loyal to the greater evil. When he sees the creature coming through, the same fear from the cave returns. He realizes he was never in control. He was only the door opener. This could push him to turn against the bigger villain during the final moments.\n\nThe finale ends with the wormhole collapsing after the ultimate villain is defeated through a combination of Eleven’s power, Will’s hive control, and the others fighting on the ground. The Upside Down stops functioning as a separate dimension. The final battle ends in the Rightside Up, which ties back perfectly to the episode title.\n",
        "upvotes": 80,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1p9i4en/spoilers_the_complete_stranger_things_season_5/"
    },
    {
        "id": "1p9rkio",
        "author": "Temporary_Page_6476",
        "title": "How I get it to stop automatically playing?!?",
        "content": "I have no idea if this is because of an update, but Netflix used to have an option where you could see the info about a show or movie. You clicked on the show and it sent you to the info page and a preview would play. Now it automatically plays it and you have to go find the info button. This is making me upset because I have like 50 things in my recent watch with this setting. I turned off autoplay previews while browsing but that’s not what I wanted. Someone please help me.",
        "upvotes": 15,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1p9rkio/how_i_get_it_to_stop_automatically_playing/"
    },
    {
        "id": "1p9pxdi",
        "author": "QizaiBrown",
        "title": "Stranger Things Season 5 doesn't turn on Dolby Vision, all other seasons do",
        "content": "Don't know if this is happening only to me. \nApparently ALL stranger things seasons turn on dolby vision on my bravia 7 except for season 5.\nWhen playing season 5 dolby vision option is not showing. I tried to restart my television several times to no avail.\nDoes anyone have the same issue?\n\nThank you.\n\nEdit: apparently only episode 1 is stuck on hdr10. Episodes 2, 3, 4 play in dolby vision.",
        "upvotes": 13,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1p9pxdi/stranger_things_season_5_doesnt_turn_on_dolby/"
    },
    {
        "id": "1pa0sip",
        "author": "Rikklespickles96",
        "title": "Unable to watch any titles",
        "content": "Is anyone else having an issue watching any titles on Netflix? I am watching from my Apple TV and using the Netflix app. The day before Thanksgiving was fine, I watched episode one of stranger things. Last night, I was unable to watch any titles at all. “This title is unavailable for instant streaming” I thought, “oh great, now I have to pay for premium to watch stranger things” but then quickly realized every single title, popular or unpopular, had the same error message. Even those weird Netflix filler shows. So I googled, and it said to clear my cache. I did that. I reset my internet router. I updated my Apple TV, then restarted the Apple TV. Deleted the Netflix app and reinstalled it. Nothing worked, even today the same problem. So I’m back to my original thought, I must need to pay for premium then right? I’m just confused about nothing else being available either. Is there nothing available for the basic subscription anymore lol or is this a problem other people are experiencing? ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pa0sip/unable_to_watch_any_titles/"
    },
    {
        "id": "1pa3asu",
        "author": "commonlurker",
        "title": "Netflix Ads",
        "content": "Hey, just came back to Netflix after leaving for a while. Got the basic tier with ads.\n\nI was just watching No Country for Old Men and one of the few adverts they placed within the movie was in quite possibly the worst spot it could’ve been, a tense &gt;!shootout between the two of the main characters!&lt; I had been waiting for for over an hour.\n\nCan anyone on the ad tier let me know if this is the new normal, or whether this was just a one-off?  Honestly this is enough to make me want to unsubscribe again. I don’t mind ads between scenes, but in the middle is insane.",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1pa3asu/netflix_ads/"
    },
    {
        "id": "1p9q1ql",
        "author": "Certified_Hummus_Boy",
        "title": "Horror movie suggestions",
        "content": "Hey yall, I just got Netflix and am looking for horror movie suggestions.     Even if they arent good, I’d love to have your thoughts because bad horror movies are still good lol.  Thank you all",
        "upvotes": 4,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1p9q1ql/horror_movie_suggestions/"
    },
    {
        "id": "1pabhmt",
        "author": "ConsciouslyKind93",
        "title": "Ready Player One is the best movie I've watched in 2025! Thank you Netflix!",
        "content": "The movie literally has every possible cultural reference that would make a 90s nerd like me happy. Action, humor, emotions, fiction, and just the right amount of VFX for the plot without overdoing it. I laughed, I cried, and like any classic nerd, I imagined in my head what life could be if something like that happened in real life and how I would be.\n\n2025 has been an utterly disappointing year for movies in general, so I'm glad Netflix added this gem recently to it's collection and let me end the year on a high and positive note when it comes to content.  \nHappy Thanksgiving to anyone who's reading this. ",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1pabhmt/ready_player_one_is_the_best_movie_ive_watched_in/"
    },
    {
        "id": "1pa0c6z",
        "author": "Uliz_2010",
        "title": "My experience with the Big Mouth series, which made it the most memorable series I've ever watched",
        "content": "The series is very good in itself, but there was one detail that made this series one of the best I've ever watched. I started the series when I was 14 and ended it when I was 15. As the series takes place in the same period, which is when the main part of puberty happens. I ended up identifying with the characters and what they were going through. The icing on the cake was the ending, which I watched on the last day of the ninth year of elementary school, with all the fear I was about high school and with some of my friends changing groups and personalities, this episode was essential for me. The last episode portrays exactly this fear of the future that I was feeling and how much my friends and I grew this year as people and physical characteristics, and mainly, how normal this division of sides is after we start to establish our own ideas, each one meets new people and settles into new groups, or changes schools, but it's normal to be afraid or sad, it turns out that's life and we have to face it, but the memories of that good time will always be kept in our hearts forever. Very moving indeed, this series mirrored my life and helped me go through puberty. And it showed me how important ninth grade was for me, I will miss my old friends forever. And I never realized that when I was with them. Now I understand, thanks to this series.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pa0c6z/my_experience_with_the_big_mouth_series_which/"
    },
    {
        "id": "1p9zjsa",
        "author": "UnintentionalPoster",
        "title": "Help finding a theme song from the Animal series (Old dog new tricks)",
        "content": "In the Animal series (in Spanish or Old Dog New Tricks in English), the musical theme I am looking for appears at the end of chapter 7, The Visit. \n\nIt's an electronic song, psytrance if I'm not mistaken. At the beginning, sampled bagpipes are heard.\n\nI searched for it with Google, YouTube, Shazam and Chatgpt without success. I don't know if it's because they did it only for this chapter. \n\nIf you know the name of the song or who made it, I would appreciate it if you let me know.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p9zjsa/help_finding_a_theme_song_from_the_animal_series/"
    },
    {
        "id": "1p9tmjl",
        "author": "WorkingTemporary3505",
        "title": "Does anyone know how to get rid of this?",
        "content": "I was trying to watch Megamind and I haven’t used Netflix for awhile. Now there’s this white box on the left hand top corner that says the time, the audio and the video settings like 1080 and the mbps. can you get rid of it and if so, how?",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1p9tmjl/does_anyone_know_how_to_get_rid_of_this/"
    },
    {
        "id": "1p9z0up",
        "author": "Kurtz62",
        "title": "Netflix Limited Series’",
        "content": "Netflix Limited Series I’ve Watched:\n\n2018:\n\nSafe\n\n2021:\n\nTrue Story\n\n2022:\n\n\nThe Watcher\n\n2024:\n\nThe Madness\n\n2025:\n\nWayward\n\nThe Beast in Me\n\nMissing You\n\nThe Survivors\n\n\nHas anyone watched any of these? If you have, let me know which ones you liked and ones you didn’t. \n\nMe personally, I’ve genuinely liked all of them. ",
        "upvotes": 0,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1p9z0up/netflix_limited_series/"
    },
    {
        "id": "1p8vogh",
        "author": "Blue-Sea2255",
        "title": "Kevin hart special acting my age - it's worst than the war of the worlds ice cube movie.",
        "content": "\nIt’s terrible. I’m stuck eating the popcorn I made for this show while aimlessly watching random YouTube videos.\n\nHe's trying so hard, but those made up stories only make everything worse.",
        "upvotes": 265,
        "comments": 148,
        "media": null,
        "permalink": "/r/netflix/comments/1p8vogh/kevin_hart_special_acting_my_age_its_worst_than/"
    },
    {
        "id": "1p9y47k",
        "author": "miZuBlue",
        "title": "I haven't watched too many series in my life.",
        "content": "I'll be off work soon and I'd like to finally watch a series. What would be best to see first? I mainly mean the original series from N. \n\nI haven't watched too many series in my life.",
        "upvotes": 0,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1p9y47k/i_havent_watched_too_many_series_in_my_life/"
    },
    {
        "id": "1p8yhn5",
        "author": "MelloCello7",
        "title": "Genuine question: are you guys really okay with paying for a service and still getting ads?",
        "content": "Its been a looong time since I've used a Netflix account, (I've been been using better alternatives) but since the release of one of the goats Stranger Things, I was, like you know what, lets get an account for old times sake, only to find that the modest 7.99 had ballooned out to 17.99 a month, and the familiar payed basic tier had become riddled with Ads... Payed streaming service with ads was something I simply could not believe. \n\nThis was the most fundamental difference between Cable and Internet: you don't pay for ads. Needless to say I'm back to my usual options, but for those of you who do, are you guys really truly okay with paying for ads?",
        "upvotes": 163,
        "comments": 259,
        "media": null,
        "permalink": "/r/netflix/comments/1p8yhn5/genuine_question_are_you_guys_really_okay_with/"
    },
    {
        "id": "1p9gv1q",
        "author": "Sad_Masterpiece6137",
        "title": "Suggest me something",
        "content": "I’m honestly feeling really bored and a bit lonely after rewatching Stranger Things again. That Season 5 ending hit me all over again, and now I’m just stuck wondering what to watch next. I’m looking for something that actually feels like Stranger Things because nothing else really matches that mix of mystery, friendship, and weird supernatural stuff.\n\nAnd the wait for Stranger Things Vol 2 is still 26 days, which feels painfully long right now. I keep thinking about the characters, the whole vibe, the music, everything, and it’s making the wait even worse.\n\nIf anyone has a show that gives even a little bit of that same feeling, I’d really appreciate the suggestions. Otherwise I’ll probably end up rewatching it again out of desperation.\n",
        "upvotes": 10,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1p9gv1q/suggest_me_something/"
    }
]