[
    {
        "id": "1ntdz4q",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 18,
        "comments": 3454,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ntdz4q/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1nulopj",
        "author": "soccer-stats",
        "title": "Post Match Thread: Kairat vs Real Madrid",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1nulopj)",
        "upvotes": 131,
        "comments": 173,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nulopj/post_match_thread_kairat_vs_real_madrid/"
    },
    {
        "id": "1nx1f3p",
        "author": "CorruptedLife95",
        "title": "Vini and the squad gaming",
        "content": "",
        "upvotes": 422,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mf811e6zuwsf1.jpeg?auto=webp&amp;s=4e1142d9bec709c81cc16fa807faa96ccd079990"
        },
        "permalink": "/r/realmadrid/comments/1nx1f3p/vini_and_the_squad_gaming/"
    },
    {
        "id": "1nwxwb4",
        "author": "TheFeatherDiaries",
        "title": "Xabi Alonso : Getting to the number ten position, Jude’s position, is very important to me. Güler has played further back and can do it.",
        "content": "",
        "upvotes": 214,
        "comments": 117,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/UCQTrbT_bEJJ1xTkyRNHV9dhkpnJMTSh8c-fqkhM1QM.jpeg?auto=webp&amp;s=0443ab807f0da6ca947ae5889af0a4a28fd19af0"
        },
        "permalink": "/r/realmadrid/comments/1nwxwb4/xabi_alonso_getting_to_the_number_ten_position/"
    },
    {
        "id": "1nwr4k9",
        "author": "Omkarop_06",
        "title": "Take care of our little Maestro, AC Milan.",
        "content": "",
        "upvotes": 508,
        "comments": 14,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/06urv3xs6usf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nwr4k9/take_care_of_our_little_maestro_ac_milan/"
    },
    {
        "id": "1nx2lrt",
        "author": "julipacheco10",
        "title": "When he said calm down, we already knew what was going to happen.",
        "content": "",
        "upvotes": 69,
        "comments": 4,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/05ofilek2xsf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nx2lrt/when_he_said_calm_down_we_already_knew_what_was/"
    },
    {
        "id": "1nwuaxr",
        "author": "Optimal_Lie7824",
        "title": "Our schedule for October. 3 big home matches and 1 away.",
        "content": "Villarreal, Juve and Barca all at home and Getafe away for October.\n\nHow many points are we getting?\n\nVillarreal is tough and in a very good position in the league but we can definitely beat them at home tomorrow.\n\nGetafe after the break is a good match for our players to ease into it again. It's away so it's gonna be tough with their hostile fans for sure but we can beat them. I believe in our boys.\n\nJuve is not in a very good form at the moment with all those draws (just like last season). A good team for sure but very prone to conceding a lot of goals... if our defence is on point that night, we'll win by a good goal difference.\n\nBarcelona... not gonna talk about it, don't want to jinx anything with them. They're dangerous.\n\nWhat do YOU think though?",
        "upvotes": 200,
        "comments": 26,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/eavxzfh36vsf1.jpeg?auto=webp&amp;s=ebeb9462da3033c768bc42049e64a8ab53d26cac"
        },
        "permalink": "/r/realmadrid/comments/1nwuaxr/our_schedule_for_october_3_big_home_matches_and_1/"
    },
    {
        "id": "1nwyngx",
        "author": "NgulaMammt6969",
        "title": "Why did Madrid let Modric go?",
        "content": "I'm an Inter fan and I'm seeing Luka Modric playing 90 minutes against Napoli making his usual genial performance.  \nOfc I've always loved his play-style, his capacity to control the game just like a true Maestro, his long-rage passes (often with trivela) which sent the attackers to goal and many other things and when I saw Madrid was getting rid of him I was truly shocked: he still could have been a super-sub for Madrid, a Maestro who can break the game with a champion's play and the fact he went to AC Milan pissed me so much because I already knew he wasn't gonna play just 10 mins per match.\n\nAnd I was right, he plays all matches as a starter, he plays more than 70 minutes and in the big match, as I said, he played a full-match. He's shining like he's a 25 y/o player in his prime (obviously he's different because he's 40 and he can't really run as fast as before).  \nWith all this stuff said I'm asking you: why did Madrid let him go? Did they think he was washed? How has he really played last year? Thanks.",
        "upvotes": 68,
        "comments": 58,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nwyngx/why_did_madrid_let_modric_go/"
    },
    {
        "id": "1nwbydi",
        "author": "chunchunmaru1129",
        "title": "No way this is true 😭",
        "content": "",
        "upvotes": 1733,
        "comments": 74,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qouj5mpusqsf1.jpeg?auto=webp&amp;s=7a219a9aeeaa3ef5d92aca63605afe59a10d7361"
        },
        "permalink": "/r/realmadrid/comments/1nwbydi/no_way_this_is_true/"
    },
    {
        "id": "1nwi0j0",
        "author": "FrrancondonaEra",
        "title": "Arda isn't an ordinary player, this is football sorcery",
        "content": "",
        "upvotes": 775,
        "comments": 64,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/11jixgnqxrsf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nwi0j0/arda_isnt_an_ordinary_player_this_is_football/"
    },
    {
        "id": "1nwppkh",
        "author": "GoEzGetafix",
        "title": "Real Madrid x Taylor Swift",
        "content": "Taylor Swift casually name-dropping Real Madrid… I can’t decide if that’s iconic or just surprising. On one hand, it’s wild to hear a global pop superstar reference the most legendary football club ever. On the other, I’m honestly not sure what the real significance of this unexpected crossover even is. What do y’all think?",
        "upvotes": 217,
        "comments": 66,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/cwvze0qyrtsf1.jpeg?auto=webp&amp;s=1b07bd56e5b8b65bdebca41703d0bf1a950d8c98"
        },
        "permalink": "/r/realmadrid/comments/1nwppkh/real_madrid_x_taylor_swift/"
    },
    {
        "id": "1nx2raz",
        "author": "chunchunmaru1129",
        "title": "Carreras should defend against Yamal the same way that Nuno Mendes did",
        "content": "When I watching the reply of that PSG vs FCB match I saw mendes just absoulutly physically bullying Yamal.He was pushing shoving Yamal like a little child.\n\nI think our players when playing against Barcalona and Yamal should give them the Ramos and Pepe treatment that those two used to give to Messi during El clasico. \n\nI think Nuno Mendes has shown us the way to defend against Yamal and it's pretty simple while playing against him don't hold back physically thinking he is just 18 and just think he is a adult man and just physcially keep pushing and shoving him around.",
        "upvotes": 23,
        "comments": 10,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nx2raz/carreras_should_defend_against_yamal_the_same_way/"
    },
    {
        "id": "1nwr08t",
        "author": "pronick786",
        "title": "Elite ball knowledge required",
        "content": "",
        "upvotes": 51,
        "comments": 4,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ip8mevef5usf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nwr08t/elite_ball_knowledge_required/"
    },
    {
        "id": "1nwfvq1",
        "author": "Messmers",
        "title": "Arda Güler under Xabi Alonso so far (by @_Wangster)",
        "content": "",
        "upvotes": 245,
        "comments": 19,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/tk8r12ynirsf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nwfvq1/arda_güler_under_xabi_alonso_so_far_by_wangster/"
    },
    {
        "id": "1nwxbek",
        "author": "Peterpaul400",
        "title": "Did we really appreciate Higuaín enough at Madrid?",
        "content": "The more I look back, the more I think Gonzalo Higuaín was underrated during his time here. In 264 games for Madrid, he scored 121 goals and added 56 assists. That is a goal contribution every 1.5 games which is elite considering he was often rotating with Benzema and playing in the shadow of Ronaldo.\n\nHe had three 20 plus goal seasons in La Liga and hit double digits in six straight league campaigns, but somehow he is rarely mentioned when people talk about our best strikers of the 2000s.\n\nYes, he had some high profile misses in big games, but consistency over years in a squad full of superstars is not easy. Do you think he was genuinely underappreciated by fans and the club?",
        "upvotes": 13,
        "comments": 20,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nwxbek/did_we_really_appreciate_higuaín_enough_at_madrid/"
    },
    {
        "id": "1nwyorp",
        "author": "Independent_Trip_320",
        "title": "Our Squad List vs Villareal",
        "content": "",
        "upvotes": 10,
        "comments": 5,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nwyorp/our_squad_list_vs_villareal/"
    },
    {
        "id": "1nwaato",
        "author": "No-Independent2522",
        "title": "150 wins for Ceballos",
        "content": "",
        "upvotes": 367,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/90gfy1t1iqsf1.jpeg?auto=webp&amp;s=6a6b726f28ef04b6447765a25f184e820efc6842"
        },
        "permalink": "/r/realmadrid/comments/1nwaato/150_wins_for_ceballos/"
    },
    {
        "id": "1nx2p5v",
        "author": "Used-Memory-1125",
        "title": "AGAINST ALL ODDS: Miracle, Comeback, Destiny",
        "content": "They prayed for miracles and miracles arrived (btw not my edit) one of the greatest road to  ucl. Round of 16 vs. PSG: Down 1-0 from the first leg and 2-0 on aggregate early in the second, the tie seemed over. Then, Karim Benzema ignited the Bernabéu. He scored a stunning second-half hat-trick in 17 minutes to flip the script for a 3-2 aggregate win, eliminating Messi, Mbappé, and Neymar.  \n• Quarter-Finals vs. Chelsea: Following a Benzema hat-trick in a 3-1 first-leg win at Stamford Bridge, Chelsea fought back to lead 3-0 at the Bernabéu (4-3 aggregate). With time running out, Luka Modrić delivered an impossible, outside-of-the-boot assist for Rodrygo to make it 3-1, forcing extra time. Unsurprisingly, Benzema found the winner in extra time (5-4 agg.).  \n• Semi-Finals vs. Man City: A seven-goal thriller saw Real Madrid lose 4-3 in the first leg. In the Bernabéu return, Riyad Mahrez's 73rd-minute goal made it 5-3 on aggregate, leaving Madrid needing two goals in under 17 minutes. Enter Rodrygo again. He scored in the 90th minute, and then a sublime header in the 91st minute—two goals in 89 seconds—to force extra time. A calm Benzema penalty sealed the impossible 6-5 aggregate victory. [A photo or GIF of the Rodrygo 90th/91st minute goals is mandatory]\n",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/m527cnvu2xsf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nx2p5v/against_all_odds_miracle_comeback_destiny/"
    },
    {
        "id": "1nwydn5",
        "author": "kasam-se",
        "title": "Real Madrid prepare for Villarreal clash! | Real Madrid City",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/PtMjtUfnrRYJLfXhyYBXXcWX1yK92C1u6-g9ZBLw60Y.jpeg?auto=webp&amp;s=c2dca2ac08389797a33d4452634454fee2e4250c"
        },
        "permalink": "/r/realmadrid/comments/1nwydn5/real_madrid_prepare_for_villarreal_clash_real/"
    },
    {
        "id": "1nw8poo",
        "author": "ace-s",
        "title": "Similar to Mbappe, Jude is a generational player and alot of people have forgotten that",
        "content": "Right now Mbappe and Arda seem like the only 2 players who have been consistent enough to be undisputed starters. \n\nXabi needs to find his XI, I know he likes to rotate alot but we need an XI for big games. \n\nWe really need to integrate Jude into the system. I feel people forget how amazing he is. In his first season he was a top3 player in the world. In his second season, his form fell of for 2 reasons, he played the entire season injured and the season was a shitshow. \n\nI really feel that we should try him as a CF role. The Benz and dembele role. IMO, it was his best role in his first season here. \n\nWe should try putting Mbappe as a LW or along side Jude as a second forward, and Arda behind them. Jude will also allow us to score goals from headers.",
        "upvotes": 204,
        "comments": 72,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nw8poo/similar_to_mbappe_jude_is_a_generational_player/"
    },
    {
        "id": "1nwr7ow",
        "author": "kyleyle",
        "title": "Attending 1st game vs Villarreal",
        "content": "I’m visiting from Canada and want to take this great opportunity to see my first live match. I’ll likely be buying the cheap tickets in the 600s section, in the middle. \n\nI want to wear some gear. Scarfs and jersey. I’m assuming there are vendors outside selling these? Are they real? \n\nTips on staying safe getting back to my hostel after the match? I am near the Palacio. \n\nAnd chants and cheers! Where can I find a guide? Thanks!",
        "upvotes": 13,
        "comments": 1,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nwr7ow/attending_1st_game_vs_villarreal/"
    },
    {
        "id": "1nwcerw",
        "author": "EndouShuuya",
        "title": "🥶 Cool as you like.🧊",
        "content": "",
        "upvotes": 100,
        "comments": 8,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/051qw9nqvqsf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nwcerw/cool_as_you_like/"
    },
    {
        "id": "1nvyg3n",
        "author": "Kalpesh_K",
        "title": "Trent Alexander Arnold they can never replace you.",
        "content": "",
        "upvotes": 561,
        "comments": 78,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/jqr7v3dwvnsf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nvyg3n/trent_alexander_arnold_they_can_never_replace_you/"
    },
    {
        "id": "1nwfddz",
        "author": "ReplacementUnited740",
        "title": "I have a statistic: Since arriving at Real Madrid, vini has won twice as many trophies as Barça.",
        "content": "This was the stats to remind you of the good times, have a good day and hala Madrid \n\nIt also works with Courtois ,Rodrygo , lunin and Brahim \n\n(I have to completely edit the post to make it 300 words.)\nDo you also feel like it's been an eternity since we won a title? Not because it's been a year, but because we're not ready to become the best team in the world again.\nAnd I'm not saying this because I don't believe in Xabi, but what he imagines is so ambitious that it could take at least 2-3 years or at least until he has a real preparation during the offseason with his team",
        "upvotes": 41,
        "comments": 15,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nwfddz/i_have_a_statistic_since_arriving_at_real_madrid/"
    },
    {
        "id": "1nw0vo4",
        "author": "Nyghl",
        "title": "Bellingham and Camavinga isn't our creative outlet.",
        "content": "This doesn't make them bad. They are both GREAT in a lot of other aspects. They are really great players. But I always keep seeing comments like \"Cama should take Arda's place, him and Bellingham are creative players too! We don't need Arda for *just* creativity.\" but that's simply not true.\n\nIf you look at the key passes and chances created stats, it is not even close and I wanted to share that.  \nArda already has the same amount of key passes as Camavinga or Tchouameni last season or for big chances, he even matched Bellingham's last season LaLiga performance which is crazy to do this early.  \n  \nThis boy has been a fresh breath of air and made a big shift in our team. And thanks to Dean Huijsen's addition + Xabi's new system and coaching, we can better direct plays, create LOTS OF MORE chances and overall we just play better. Unless someone more creative comes, I don't see Arda being dropped for anyone in the current squad. He is the key glue of our team in terms of connecting the midfield to attack right now.\n\nI also feel like Bellingham and Arda will compliment each other really well and play together. Even though it wasn't good the last match we did that, I think that was just Bellingham coming out of injury a bit early and not being in form.",
        "upvotes": 225,
        "comments": 90,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nw0vo4/bellingham_and_camavinga_isnt_our_creative_outlet/"
    },
    {
        "id": "1nx3poq",
        "author": "Hikithe",
        "title": "Real Madrid featured as symbol of peak success in Taylor Swift's new song",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/od0EkXK1No-YlzQ42J3REFIvDKgcbj6efreDkAvkQ7U.jpeg?auto=webp&amp;s=b6295ad01c300ae84a8c64d5e8835f58308e33f4"
        },
        "permalink": "/r/realmadrid/comments/1nx3poq/real_madrid_featured_as_symbol_of_peak_success_in/"
    },
    {
        "id": "1nwdw7d",
        "author": "EndouShuuya",
        "title": "✨Brahim✨Beautiful Goal!",
        "content": "",
        "upvotes": 44,
        "comments": 3,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/c4g51n9s5rsf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nwdw7d/brahimbeautiful_goal/"
    },
    {
        "id": "1nx3jhq",
        "author": "RM-PostMatchSurveys",
        "title": "[Post-Match Survey Results] Real Madrid 5-0 Kairat",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ucc23ewt8xsf1.png?auto=webp&amp;s=c4171fa472ae333b69fb45d887fbb55748213992"
        },
        "permalink": "/r/realmadrid/comments/1nx3jhq/postmatch_survey_results_real_madrid_50_kairat/"
    },
    {
        "id": "1nx32zu",
        "author": "Downtown_Guidance_75",
        "title": "VAMOOOOOOOOOOOOS MADRID",
        "content": "Taylor Swift to Real Madrid, HERE WE GO! Every document has been signed, sealed and completed.\n\nReal Madrid, set to announce Taylor Swift as new signing next summer after going trophyless again\n\nTaylor Swift made his decision in September; he can now be considered new Real player.\n\nXabi Alonso wanted creative Midfielder and Florentino Perez likes him to much",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nx32zu/vamoooooooooooos_madrid/"
    },
    {
        "id": "1nw0inu",
        "author": "Ready_Ad_1353",
        "title": "Champions League table after Matchday 2",
        "content": "",
        "upvotes": 203,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9ahjqhrliosf1.png?auto=webp&amp;s=430ac567c561574e9271a731432de934ed7e5f56"
        },
        "permalink": "/r/realmadrid/comments/1nw0inu/champions_league_table_after_matchday_2/"
    }
]