[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 34,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 11,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1psve36",
        "author": "domrayn",
        "title": "Fargo (S1-S5) just dropped. OMG",
        "content": "Dunno if other countries already have this but this just dropped yesterday in mine (Philippines). I can't recommend this show enough guys. Every season is self contained so there are little to no pacing issues. The story is quirky, weird, violent but very engrossing. It's masterful storytelling at its finest. I used to religiously wait for a new episode every week but now everything is available. Lucky you. That's all. I'm gonna do a rewatch XD",
        "upvotes": 150,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1psve36/fargo_s1s5_just_dropped_omg/"
    },
    {
        "id": "1ptgzom",
        "author": "IceCat767",
        "title": "Ed Gein being a virgin was too boring for Ryan Murphy?",
        "content": "Had to sex him up I guess. Is sexing something or someone up really that interesting? Ed Gein being a life-long virgin is plenty interesting to me. What do you guys think?",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ptgzom/ed_gein_being_a_virgin_was_too_boring_for_ryan/"
    },
    {
        "id": "1psjdzz",
        "author": "Alldogsgotoheaven12",
        "title": "Dave Chapelle The Unstoppable Reaction",
        "content": "This didn’t feel like stand up as much as it felt like a victory lap. The vibe was basically I’m richer than all of you combined. I’m wiser. I’m philosophical. I’ve made it. And you can tell I’ve made it because I talk really slow now, pause a lot, smoke a cigarette on stage, and let the crowd applaud my existence. There were way more stories than jokes. Not sharp stories that build to something clever, just rambling anecdotes that relied on the audience already being on his side. It felt less like he was trying to make people laugh and more like he knew people would cheer no matter what he said. And they did. This felt safe, comfortable and almost lazy. Like he knows the brand is bulletproof, so why bother tightening the material? I get that he’s earned the right to do whatever he wants. He’s one of the greatest to ever do it. But greatness doesn’t mean every mic drop deserves a standing ovation. At some point, slowing your delivery and sounding profound isn’t the same thing as being funny.\n\nIt just feels like we’re watching a legend turn into a motivational speaker with better lighting, and the crowd keeps rewarding it.",
        "upvotes": 532,
        "comments": 298,
        "media": null,
        "permalink": "/r/netflix/comments/1psjdzz/dave_chapelle_the_unstoppable_reaction/"
    },
    {
        "id": "1ptfftm",
        "author": "Powerpoil",
        "title": "Has anyone else watched dogs in space?",
        "content": "I think it’s such a cute, charming show and was sad to see it’s been cancelled when I looked it up. Almost finished with it now and I think it’s really well written, although I’m a bit confused on the target audience. To me it seems like something a family would enjoy sitting down to watch, it’s light hearted enough for children, and has interesting themes/jokes that adults and teens would enjoy. At least I think so. I love the characters too, it’s actually hard for me to even pick a favorite lol. I’m wondering where this show stands with other people, I assume it never got popular if it got cancelled after two seasons",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ptfftm/has_anyone_else_watched_dogs_in_space/"
    },
    {
        "id": "1ptf8ty",
        "author": "Lucas-Peliplat",
        "title": "The Masculine Urge to Live Alone in the Woods (Train Dreams, 2025)",
        "content": "Somewhere along the line of progress, guys decided that enough is enough. In the past couple years, I can't count how many pictures of scenic landscapes I've seen online with the caption, \"this and forgetting that Teams exists,\" or \"someone saw this and really decided to invent Excel.\" Perhaps because of our inability to escape the capitalist-corporate world, men in the 21st century yearn for a simpler time. That's why a movie like Train Dreams makes perfect sense in this year's Oscar race.\n\n",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ptf8ty/the_masculine_urge_to_live_alone_in_the_woods/"
    },
    {
        "id": "1ptcwtv",
        "author": "Bozzaha",
        "title": "Ad-free alternatives with great foreign shows?",
        "content": "Any suggestions on alternative platforms without ads that have great foreign shows? I’ve enjoyed a number of the shows set in Spain, Mexico, Greece, Korea, Japan, Australia, etc.\n\nNetflix can’t tell my workout TV is in my household, two rooms away from the main TV.  My iPad and iPhone keep getting logged out and I’m sick of having to relogin over and over. \n\nI’m happy to pay for ad-free services, but they need to work if I pay for them. I won’t watch ads.\n\n\\-Premium subscriber since 2013.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ptcwtv/adfree_alternatives_with_great_foreign_shows/"
    },
    {
        "id": "1pthkog",
        "author": "PoolOk6674",
        "title": "Does anyone know why this victorinox carry-on has a Netflix logo?",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pthkog/does_anyone_know_why_this_victorinox_carryon_has/"
    },
    {
        "id": "1ptgybb",
        "author": "ethanw214",
        "title": "Recommendations for 70 year old mother",
        "content": "\nHi all! My 70 year old mother (US) joined Netflix recently. Currently I do not have a subscription. I am looking for recommendations for her. Some guides:\n\n-She hates cruising especially F-bombs. A high amount of cursing not bleeped she will turn it off. An occasional minor curse word could slide.\n\n-not a movie person. Doesn’t want to pay attention. Wake Up Deadman she checked out.\n\n-outside of Netflix, she watches mostly reality. She watches Naked and Afraid, Court TV, Survivor, some married at first site, and Alaska homestead rescue regularly.\n\n- so far she’s watched Simon Cowell boy band show and the latest Diddy doc (hated the cursing, but wanted to know court case stuff). \n\nThanks for your help!",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ptgybb/recommendations_for_70_year_old_mother/"
    },
    {
        "id": "1ptdsko",
        "author": "NoahxAnderson",
        "title": "Dolby Vision/Atmos not working with Stranger Things?",
        "content": "I’ve confirmed my setup is working properly Sonos Arc Ultra, 2 Era 300s, LG C3 — other Netflix shows and movies trigger the Dolby Vision and Dolby Atmos pop-ups without any issues. However, Stranger Things is not triggering either format for me, even though I’m on the Netflix Premium plan.\n\nI’m using an Apple TV 4K, and my audio system plays Atmos correctly with other content, so this doesn’t seem like a hardware or settings issue on my end.\n\nIs this a known issue with certain seasons or episodes of Stranger Things, or is Netflix currently limiting DV/Atmos for this show?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ptdsko/dolby_visionatmos_not_working_with_stranger_things/"
    },
    {
        "id": "1ptasg0",
        "author": "Granopoly",
        "title": "Anyone else get a sort of weird patina over the picture for certain shows when certain cameras are used?",
        "content": "This is on the stock app on my Bush smart TV. I've noticed it on Brooklyn 99 and house so far.\n\nA weird sort of geometric overlay, maybe a grid type. It doesn't obscure the picture, just a sort of filter.\n\nBy 'cameras' I mean when one scene is shown from different angles, it's just one of the angles that has this issue.\n\nWorks fine in my firestick 🤷‍♂️",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ptasg0/anyone_else_get_a_sort_of_weird_patina_over_the/"
    },
    {
        "id": "1ps65y7",
        "author": "Pope_Twitch",
        "title": "Netflix keeps cancelling shows",
        "content": "Hello everyone,\n\n  \nThis post is mostly a rant about Netflix and the way they handle stuff with many of their shows. I came to realize Netflix has an absurd strategy to keep customers locked in releasing new series/shows at a steady pace but for the majority, series are almost never finished unless they are really classics or series they have acquired. I am really annoyed but the number of times I locked into one of the series and then have to realize there will not be any ending of the show. It came to the point where I even start to lookup whether or not there is going to be a final season before investing the time to check it out. \n\n  \nSeries which have left a bitter taste to me personally since there is no \"what's next\":\n\n* Marco Polo\n* Away\n* 1899\n* Snowpiercer\n* Barbarians\n* Pulse\n* The recruit\n* Boots\n* Lost in space (it has an ending but there was more imo)\n* ..\n\nI know this post is not going to make any difference and I understand more than anybody else the business, it is money first, customers second but damn me, damn me for watching unfinished series. Especially the science fiction seems to be affected by this problem quite a lot. (or maybe that is because I watch too many of those)\n\nI just hope I am not the only one who has this feeling and who has been disappointed more than once in the past years?",
        "upvotes": 334,
        "comments": 441,
        "media": null,
        "permalink": "/r/netflix/comments/1ps65y7/netflix_keeps_cancelling_shows/"
    },
    {
        "id": "1pth36z",
        "author": "Fun_Smile3175",
        "title": "Why are so many Netflix titles NOT available for download?",
        "content": "Tried to save a few episodes of that new Chinese drama (Perfect Match) for offline watching, but no download button. Paid for a subscription, yet half the stuff I want is locked out of offline mode. So annoying—any workarounds?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pth36z/why_are_so_many_netflix_titles_not_available_for/"
    },
    {
        "id": "1pt89dq",
        "author": "skystarlune",
        "title": "Spanish language show recommendations?",
        "content": "Hey! I’m looking for TV/series recommendations that are in Spanish — Spain, Mexico, South America, anything works as long as it’s en español.\n\nI’m currently learning Spanish and want shows that are engaging enough to stick with. I’ve tried popular ones like La Casa de Papel (Money Heist), but it just wasn’t for me.\n\nI’m more into thought-provoking, darker shows like mystery, thriller, sci-fi or psychological stuff. For example, I love Severance, The Last of Us, and 3 Body Problem. I’m not really into romance or comedy heavy series.\n\nAny good Spanish-language shows that lean more mystery/thriller/intellectual?\n\nThanks",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1pt89dq/spanish_language_show_recommendations/"
    },
    {
        "id": "1ps9ss8",
        "author": "anonychef117",
        "title": "Why did Jake Paul fight AJ?",
        "content": "If he can't even defeat pro Cruiserweights (hes probably light heavyweight?) properly, why the hell did he move up to heavweight and choose one of the top heavyweights to fight? \n\nI just don't get why he actually fought AJ. I thought it was a joke because he only fights 70yo men. I thought it was a fake news on social media but he actually fought him (didn't know until i saw the recommended highlights pop up on youtube yesterday).\n\nSo why did he fight him? \n\n\nEdit: I know he fought him for money but he could've chosen another retired senior citizen with a cane to fight him again for $$$. He didn't have to choose one of the top heavyweight boxer to fight him, as Jake Paul is two weightclasses below heavyweight. (Light HW)\n",
        "upvotes": 137,
        "comments": 154,
        "media": null,
        "permalink": "/r/netflix/comments/1ps9ss8/why_did_jake_paul_fight_aj/"
    },
    {
        "id": "1pt4cca",
        "author": "Beneficial_Pickle288",
        "title": "The best fighters always call out their finishing moves.",
        "content": "The best fighters always call out their finishing moves.  What is your favorite quote from a Netflix original??  Post you favorite quote below and let everyone else try to figure out which show it's from! ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pt4cca/the_best_fighters_always_call_out_their_finishing/"
    },
    {
        "id": "1psf5io",
        "author": "AppropriateLadder497",
        "title": "Good end of the world movies?",
        "content": "I’m looking for a movie on Netflix that would be a good end-of-the-world movie. The type of movie that just leaves you anxious because you have no idea what’s going to happen next, and the characters are so confused because they have no idea what’s going on. I don’t know why, but I really enjoyed Leave the World Behind when it came out. Any recommendations? ",
        "upvotes": 25,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1psf5io/good_end_of_the_world_movies/"
    },
    {
        "id": "1psbcig",
        "author": "No-Goat5212",
        "title": "The Flash becomes the most watched superhero show (licensed) on Netflix",
        "content": "During its peak on Netflix U.S., The Flash clearly outperformed other DC television series in total watch time. Reports based on streaming analytics show The Flash accumulating over 300 million hours watched in measured periods, making it the most-watched Arrowverse series on Netflix by a wide margin. By comparison, Arrow generated roughly half that amount of viewing time, while Supergirl, Legends of Tomorrow, and Black Lightning trailed far behind. The gap was driven by The Flash’s long episode seasons, nine-season run, and strong rewatch behavior. Even compared to other licensed Netflix hits, few superhero shows matched its sustained minutes-watched performance. This dominance confirms that The Flash was not only the most popular DC series on Netflix U.S., but also the platform’s most-watched licensed superhero show overall.",
        "upvotes": 31,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1psbcig/the_flash_becomes_the_most_watched_superhero_show/"
    },
    {
        "id": "1pt8t1n",
        "author": "Zaypan",
        "title": "Profile deleted",
        "content": "1 of 5 account of mine is deleted by itself. No family members deleted it. No family members are watching netflix for 3 days but when aı log in one of the accounts are deleted. Customer services says they cant help or recover profile. What can I do ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pt8t1n/profile_deleted/"
    },
    {
        "id": "1pt0lhp",
        "author": "AR2302",
        "title": "4K on PC",
        "content": "Why is my netflix not playing 4k on my pc ? I have a 32inch 4k monitor and hevc video extension is installed and drivers are updated, i also tried using different browsers and downloading the app from microsoft store, but none of them works, it just stuck at 1080p, how do i fix this ?",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1pt0lhp/4k_on_pc/"
    },
    {
        "id": "1psciz3",
        "author": "xjsjxigskdnfn",
        "title": "Dash and Lilly should’ve got a second season!!!",
        "content": "Was such a great Christmas show and the actors were incredible. Really think it deserved a second season as there was so much further to go in the story. ",
        "upvotes": 17,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1psciz3/dash_and_lilly_shouldve_got_a_second_season/"
    },
    {
        "id": "1pt2aqk",
        "author": "nekochan731",
        "title": "The Great Flood 4K?",
        "content": "Is The Great Flood (2025 korean movie) available in HDR / 4K on Netflix? Need to know before upgrading to the higher tier. Would appreciate if anyone with 4K subscription can check and confirm. ",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1pt2aqk/the_great_flood_4k/"
    },
    {
        "id": "1psbo1r",
        "author": "ProjectMason",
        "title": "Recommended to watch this week: The Perfect Neighbor",
        "content": "My girlfriend and I are getting into Netflix, and for those of you that already seen this documentary, we asked for your suggestions on other true crime documentary you found enjoyable or even relevant to this one so we can consider watching. \n\nIn my opinion, I don’t know why they gave that old hag 25 years, just throw her away for life. ",
        "upvotes": 12,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1psbo1r/recommended_to_watch_this_week_the_perfect/"
    },
    {
        "id": "1pst3kf",
        "author": "NewProperty9247",
        "title": "Stranger Things- First Watch",
        "content": "In the Season 4 finale of Stranger Things, the Hawkins group deliberately lures Vecna into attacking Max so that his physical body can be attacked while he is in a trance.\n\nThe California group (with Eleven) clearly knew this plan in advance. Given that context, why didn’t the Hawkins group simply wait for Eleven to physically reach Hawkins? She was already en route and would have arrived by the next day at most.\n\nInstead, Eleven was forced to fight Vecna remotely, which visibly weakened her and limited her effectiveness. From a tactical standpoint, this seems like the worst possible option:\n\n\t•\tVecna was strongest inside the Mindscape.\n\n\t•\tEleven was weakest when fighting telepathically across distance.\n\n\t•\tThe group already knew Vecna could wait and choose his moment.\n\nWaiting for Eleven to arrive would have allowed:\n\n\t•\tA direct confrontation with Vecna at full strength.\n\n\t•\tNo need to risk Max as bait.\n\n\t•\tNo split attention or exhaustion for Eleven.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pst3kf/stranger_things_first_watch/"
    },
    {
        "id": "1psa2h4",
        "author": "SwimmingThrough_5059",
        "title": "Christmas originals 2025 vs 2024?",
        "content": "To anyone else, did it feel like Netflix' original holiday content in 2024 made a bigger impact?\n\n2024 had: Hot Frosty, The Merry Gentlemen, Our Little Secret (Lindsay Lohan), Meet Me Next Christmas (Christina Milian) and Sabrina Carpenter's special.\n\nThis year had: Champagne Problems, Jingle Bell Heist, A Merry Little Ex-Mas and My Secret Santa.\n\nNow, none of these movies are high-quality, obviously, but it felt like the 2024 movies made a bigger impact. What do others think? Are there are 2025 originals that I missed that are worth watching?",
        "upvotes": 13,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1psa2h4/christmas_originals_2025_vs_2024/"
    },
    {
        "id": "1psrnht",
        "author": "Ross_Heartfilia",
        "title": "Interneg vs search bar.",
        "content": "When I search for shows like nurse jackie or teen wolf in the search bar I get nothing but if I type it in on Google like (teen wolf Netflix) I get taken to the page but there's no play button is this because it's not there anymore or something else also I have the ad free subscription so all shows should come up and work. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1psrnht/interneg_vs_search_bar/"
    },
    {
        "id": "1psmulf",
        "author": "STUPIDNEWCOMMENTS",
        "title": "Not in household but I’m literally in my house?",
        "content": "I’m getting the not in household message on iPad. But I’m literally in my house. Trying to find the set household in settings but it doesn’t show up? I haven’t had a TV attached to Netflix in years. I watch either through my Apple TV or on iPad. Totally confused as to how to fix this. Also, this is so stupid and Netflix sucks",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1psmulf/not_in_household_but_im_literally_in_my_house/"
    },
    {
        "id": "1psbji6",
        "author": "stellacampus",
        "title": "Relay was really good",
        "content": "A complex, slow burn type suspense thriller with a somewhat novel concept. The acting was consistently good and I was captivated throughout. One of the better movies Netflix has put up in a while.",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1psbji6/relay_was_really_good/"
    },
    {
        "id": "1psmylb",
        "author": "dayton462016",
        "title": "Background binging",
        "content": "I'm looking for suggestions to binge in the background while I do other stuff. Looking for shows with lots of seasons and reality-ish. I enjoy crafty/competition shows- think Project Runway or Flea Market Flip. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1psmylb/background_binging/"
    }
]