[
    {
        "id": "1ph9lu7",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 10,
        "comments": 1421,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ph9lu7/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1pia1vr",
        "author": "scoreboard-app",
        "title": "Pre Match Thread: Real Madrid vs Manchester City, UEFA Champions League Match 6",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1pia1vr)",
        "upvotes": 44,
        "comments": 76,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pia1vr/pre_match_thread_real_madrid_vs_manchester_city/"
    },
    {
        "id": "1pi7j56",
        "author": "Ready_Ad_1353",
        "title": "[ABC.es] Xabi Alonso feels isolated, and his players are taking advantage of his vulnerability. He has recently become a political figure, attempting to win over the dressing room by offering concessions: shorter video sessions, untouchable stars, more days off, fewer tactical obligations",
        "content": "In these 6 months of the Alonso era, the Real Madrid dressing room has not meshed well with him. He arrived to raise the bar, both in training and matches; to impose discipline and order in a dressing room that was spoiled and toxic; and to modernize the team's style of play. As the weeks went by, the players grew increasingly frustrated with his tactical demands, high press, advanced defensive line, endless video sessions, and limited rest days. And Alonso, knowing he was losing the dressing room, gradually gave in, eventually offering them his full support, his arm, and whatever else they asked for.\n\nThe latest example is recent. The before and after the victory at San Mamés demonstrates the power of the dressing room. Traveling on Tuesday instead of Wednesday angered a good number of the players, and after the win against Athletic, Alonso granted them two days off, when only one had been planned. So the preparation for the match against Celta included only one training session, on Saturday. This is just one example of the many that have occurred since the Vinicius case erupted.\n\nUntil then, Alonso didn't really know what it meant to coach Real Madrid. And that's despite being a player for five years, and having witnessed how a coach like Mourinho lost the support of a large majority of his players when things started to go wrong. Now Alonso himself is experiencing firsthand the influence players have at Real Madrid, but he doesn't understand why he was brought in if, at the first sign of trouble, the club looked the other way, as happened with Vinicius. That's when Xabi understood that he had to manage 25 egos and put his coaching role aside. The beginning of the end.\n\nAlonso believed that coaching on his knees would boost the dressing room, but usually, it's quite the opposite. Everything that has happened in recent weeks has paved the way for what seems imminent: his dismissal.",
        "upvotes": 254,
        "comments": 125,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NGG1d91SGSNO_1MEIZpz5FybytyLdSBFw4BOg28N2jg.jpeg?auto=webp&amp;s=fff75be8dda7b029b065e62dbb4674d662a0c3d0"
        },
        "permalink": "/r/realmadrid/comments/1pi7j56/abces_xabi_alonso_feels_isolated_and_his_players/"
    },
    {
        "id": "1pi0ocp",
        "author": "Due_Requirement_1170",
        "title": "This summarizes it quite nicely.",
        "content": "",
        "upvotes": 649,
        "comments": 154,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/qc0wny10k46g1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pi0ocp/this_summarizes_it_quite_nicely/"
    },
    {
        "id": "1pi6wf3",
        "author": "National-Bus4521",
        "title": "bro wasnt joking after all",
        "content": "",
        "upvotes": 179,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0eoni6pzf66g1.png?auto=webp&amp;s=952f9b126941db3ad7f521cc82fbf35e1a8eb84e"
        },
        "permalink": "/r/realmadrid/comments/1pi6wf3/bro_wasnt_joking_after_all/"
    },
    {
        "id": "1pi487z",
        "author": "Hiroshima-6-1945",
        "title": "Tchouameni: \"If we lose 0-2 it's our problem, not the coach's\"",
        "content": "",
        "upvotes": 273,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ARVeIyhVBsthenVt_MEOtqrmkaBHAy4Bg1ryDwbQFu4.jpeg?auto=webp&amp;s=7b04f85a6835315f5f4e0c3cef58715ac1e7c7d7"
        },
        "permalink": "/r/realmadrid/comments/1pi487z/tchouameni_if_we_lose_02_its_our_problem_not_the/"
    },
    {
        "id": "1piadbi",
        "author": "SandwichSisters",
        "title": "All Xabi asked for was a bit of professionalism and effort",
        "content": "All of the stuff that gets leaked supposedly attacking Xabi to me is nothing but embarrassing for the players and the club. \n\nI am very curious who can come to the club and actually do something positive.\n\nHalf the team would be outside of the squad of Flick’s Barca.\n\nHopefully Papa Flo can do a solid cleanup and put the place in order",
        "upvotes": 63,
        "comments": 18,
        "media": null,
        "permalink": "/r/realmadrid/comments/1piadbi/all_xabi_asked_for_was_a_bit_of_professionalism/"
    },
    {
        "id": "1pi4cju",
        "author": "TheConnstant",
        "title": "Changing the manager will not change anything",
        "content": "No managerial change or signing/exit will help Real Madrid if the player whom the team is built around constantly clogs up places of other players and doesn't actually do what he is supposed to do( Make runs towards the box)",
        "upvotes": 152,
        "comments": 57,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/l6ifi9beq56g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pi4cju/changing_the_manager_will_not_change_anything/"
    },
    {
        "id": "1pi8foq",
        "author": "8Nakul",
        "title": "Kylian Mbappé didn’t train with Real Madrid squad and he’s a doubt to face Manchester City.",
        "content": "",
        "upvotes": 55,
        "comments": 54,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pi8foq/kylian_mbappé_didnt_train_with_real_madrid_squad/"
    },
    {
        "id": "1phsflr",
        "author": "NotRod96",
        "title": "This is what Mbappe lacks as a 9",
        "content": "Mbappe is not the problem and he’s having an amazing year. However, this is such a good example of what he lacks as a 9 and in hindsight, it cost us points. He was two steps late because he didn’t make this run and that cost us a goal. \n\nHow is he not attacking the space here? This is what Ronaldo has done his whole career that helped him score 50+ goals per season…",
        "upvotes": 571,
        "comments": 252,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ol1quwpki26g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1phsflr/this_is_what_mbappe_lacks_as_a_9/"
    },
    {
        "id": "1phspvk",
        "author": "DelusionBuster1225",
        "title": "Nico Paz vs Lautaro Martinez",
        "content": "",
        "upvotes": 495,
        "comments": 35,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zqprj7dok26g1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1phspvk/nico_paz_vs_lautaro_martinez/"
    },
    {
        "id": "1phpj1o",
        "author": "Top_Bread_4595",
        "title": "I think this is true",
        "content": "",
        "upvotes": 722,
        "comments": 48,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ha0orxqax16g1.jpeg?auto=webp&amp;s=df296799bc173a7d580dcfdfa1381b2ba8c4b839"
        },
        "permalink": "/r/realmadrid/comments/1phpj1o/i_think_this_is_true/"
    },
    {
        "id": "1pi67g1",
        "author": "ManuMora98",
        "title": "Our opponent in the Copa del Rey Round of 32 is Talavera de la Reina",
        "content": "",
        "upvotes": 28,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wyp8364z966g1.jpeg?auto=webp&amp;s=dbdf80cf6b1b5155eb7213456dfe82b1e2fe9182"
        },
        "permalink": "/r/realmadrid/comments/1pi67g1/our_opponent_in_the_copa_del_rey_round_of_32_is/"
    },
    {
        "id": "1pi9jw6",
        "author": "theeama",
        "title": "Blaming Mbappe, Vini, or Alonso Won't solve the problems. It's a collective issue.",
        "content": "For many years, I've tuned into Madrid games. For many years, you could tell that Madrid's young players weren't ready to take over. One of my mates used to say, \"Watch what will happen when the senior guys leave, can these Madrid youngsters do it when they don't have those players to hold their hands?\"\n\nAnd well, we're seeing that now, your players are just not mature enough because they were never asked to be mature.\n\nReal Madrid is an unbalanced squad. The profiles are correct, but the players need a reality check on where they need to be for the team to excel. They need to understand that the team is better than the individual. \n\nLet's break it down:\n\nVini and Mbappe CAN PLAY TOGETHER. The notion that two absolute world-class players best in their positions can't play together is just rubbish. The notion that Vini is selfish and Mbappe is selfish is again rubbish. These are Twitter takes and haters just spewing nonsense. \n\nThe problem that Vini and Mbappe have is that Madrid's Midfield and shape are counter-productive. \n\n Yes, both players like to occupy the left wing and left half space, but we also know that both players are intelligent enough and have good movement to know how to rotate and be in the best possible space, and they have shown multiple times this year that it can work. \n\n  \nMadrid's problem really lies in the fact that your midfield doesn't have a fucking clue. \n\nBellingham is not a 10. Let's just state this. He is not a 10. And the sooner Bellingham accepts this, Xabi accepts this, you won't see much improvement. Bellingham is a box-to-box midfielder and should be employed as such. \n\n  \nThe reason why you don't want Bellingham in the 10 position is because of the attackers that you have. What Madrid needs for 10 is a pure playmaker, your Ozil, Di Maria, Odegard, Guler, Nico Paz. \n\nYou need a pure playmaking 10 here because you have players that are very good off-ball and are very good with receiving the ball at their feet or into space. \n\nBellingham is great in a lot of areas, but his strengths would be best utilized deeper to help progress the ball forward, laying it off to the #10 or distributing it out wide for one of the wingers to drive it forward. \n\nHe can then crash the box to get on cutbacks or crosses, or be the man from deep to break the low block with a deeper unmark runs. \n\nA Bellingham, Tchouameni Pivot could work. \n\n  \nStop Icing Rodrygo. It's simple as that, in every attack especially Madrids, you need that selfless player that will run and run and keep on going. Rodrygo provided that in previous years and he is more than good enough todo so. Now the player might feel disrespected and might feel that the club doesn't care about him but i sincerely believe, that an attack of Vini Mbappe Rodrygo can work and should be working. \n\n  \nYes you do need fullbacks and defenders and maybe adding some more creative midfield players, but your squad has the right profiles and player types to be successful. \n\nVini's head is all about his contract at this point, Rodrygo has one and half foot out the door. \n\nBellingham is in no mans land at this point, even his england spot isn't secure. \n\nBut the noise, the internal distractions, the noise from the outside. Too much non-footballing nonsense is happening at Madrid. \n\n",
        "upvotes": 24,
        "comments": 18,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pi9jw6/blaming_mbappe_vini_or_alonso_wont_solve_the/"
    },
    {
        "id": "1piaapu",
        "author": "asensia-kopfschmerz",
        "title": "Xabi Alonso knows what’s wrong at Real Madrid. But he’s powerless to fix it",
        "content": "Reported by Dermot Corrigan, the Athletic.\n\n  \nAI generated summary (prompt: focus on facts not reported before and support the title): \n\nA chaotic 2-0 loss to Celta Vigo featuring 2 red cards exposes Xabi Alonso's inability to correct Madrid's culture. Despite a €120m defensive overhaul adding Trent Alexander-Arnold, discipline remains poor. With Vinicius Jr. refusing to renew his contract due to friction with Alonso, the coach appears powerless to command his stars.",
        "upvotes": 15,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FOz2tVWytMpXsj_XdACjb3lZ5xcFH4OanLzRk1qLW0Y.jpeg?auto=webp&amp;s=e09cdae61116f1d9ac31d5182e084a3c80381381"
        },
        "permalink": "/r/realmadrid/comments/1piaapu/xabi_alonso_knows_whats_wrong_at_real_madrid_but/"
    },
    {
        "id": "1phpfsn",
        "author": "FrrancondonaEra",
        "title": "is this look like a team everyone is just shooting without even trying to think that we might need to keep the ball",
        "content": "",
        "upvotes": 196,
        "comments": 49,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9w9uy70fw16g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1phpfsn/is_this_look_like_a_team_everyone_is_just/"
    },
    {
        "id": "1pi4f8r",
        "author": "Cultural_Big_510",
        "title": "Cr7 talking about the difference between spanish and English refs",
        "content": "\nHere’s a video of Cry explaining the difference between Spanish referees and English referees, and honestly it perfectly highlights something a lot of fans don’t really think about. In England, the culture around referees is completely different. Players can say things like “fuck off” in the heat of the moment, and most referees just let it slide because they understand it’s part of the intensity and emotion of the match. They don’t take it personally, and they don’t react harshly unless it crosses a very clear line. English refs tend to prioritize keeping the game flowing, so they usually avoid giving cards for simple verbal frustration.\n\nBut in Spain, referees take that kind of language and attitude much more seriously. They view insults or disrespect as a direct challenge to their authority on the pitch. The environment is stricter, the expectations for player behavior are higher, and referees are quicker to show cards if they feel they’ve been disrespected. So something that might be ignored in the Premier League can easily result in a yellow or even a red card in La Liga.\n\nThat’s why this video is so relevant, especially after everything that’s been happening recently  like Bellingham insulting the referee and the whole situation with Carreras’ red card. When you understand how different football cultures treat referees, it actually explains a lot. What players might see as normal reaction or heat-of-the-moment frustration, Spanish refs interpret as a serious offense.\n\nSo I just wanted to share this video because it gives really clear context for those moments. It helps people understand why certain players get punished more harshly in Spain for things they would probably get away with in England. It’s not necessarily about the referee being dramatic , it’s just a different culture and a different standard in how respect is enforced on the pitch.",
        "upvotes": 9,
        "comments": 5,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/b4u0g4epr56g1/CMAF_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pi4f8r/cr7_talking_about_the_difference_between_spanish/"
    },
    {
        "id": "1phbxbd",
        "author": "supplementarytables",
        "title": "BREAKING: Éder Militão suffers tear in the biceps femoris muscle of his left leg with involvement of the tendon.\n\nReal Madrid defender will be out for 3-4 months, reports @AranchaMobile.",
        "content": "",
        "upvotes": 479,
        "comments": 141,
        "media": null,
        "permalink": "/r/realmadrid/comments/1phbxbd/breaking_éder_militão_suffers_tear_in_the_biceps/"
    },
    {
        "id": "1phijj7",
        "author": "Snoo87224",
        "title": "Xabi Alonso And Madrid.",
        "content": "Real Madrid under Xabi Alonso so far:\n\n👕 21 games played\n\n✅ 15 wins\n\n❌ 3 defeats\n\n🟰 3 draws\n\n\n⚽️ 44 goals scored\n\n— Majority of these coming from Mbappé, who has been carrying the attack so far.\n\n🥅 20 goals conceded\n\n🔒 9 clean sheets\n\n🥈 2nd in La Liga, 4 points behind the leaders\n\n🌟 4/5 wins in the Champions League\n\n📉 Big-game struggles:\n\n— Lost the Madrid Derby\n\n— Lost to a terrible, out-of-form Liverpool side\n\n— Lost to 10th-place Celta Vigo",
        "upvotes": 211,
        "comments": 75,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/m3mczhlkm06g1.jpeg?auto=webp&amp;s=0eb5ba488d70001059c7129789a2d2f60e746786"
        },
        "permalink": "/r/realmadrid/comments/1phijj7/xabi_alonso_and_madrid/"
    },
    {
        "id": "1phlrhv",
        "author": "Ready_Ad_1353",
        "title": "[Marca]: Real Madrid is once again a team without a clear identity, and Xabi Alonso is trapped between his ideas and a reality he cannot control. The players undoubtedly won the battle. Today, Alonso's fate is more at the mercy of the dressing room than his own tactical approach.",
        "content": "",
        "upvotes": 129,
        "comments": 62,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hydt_0FVlvIWpB4s7oBdmmgxA58KfijPLQXiL71wKaM.jpeg?auto=webp&amp;s=221f7b45db7564767e360b477e8bf1b8e93a47c6"
        },
        "permalink": "/r/realmadrid/comments/1phlrhv/marca_real_madrid_is_once_again_a_team_without_a/"
    },
    {
        "id": "1ph6umu",
        "author": "Chance-Weather-8157",
        "title": "Same situation, different outcomes. The players have a point to be upset.",
        "content": "",
        "upvotes": 907,
        "comments": 112,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/gik9z2tysx5g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ph6umu/same_situation_different_outcomes_the_players/"
    },
    {
        "id": "1phclwc",
        "author": "o6ohunter",
        "title": "Antonio Rüdiger, Thibaut Courtois, and Vinicius Junior staying behind to apologize to the fans",
        "content": "",
        "upvotes": 291,
        "comments": 91,
        "media": null,
        "permalink": "/r/realmadrid/comments/1phclwc/antonio_rüdiger_thibaut_courtois_and_vinicius/"
    },
    {
        "id": "1phhee0",
        "author": "DamnThatsInsaneLol",
        "title": "COPE's Miguel Angel Diaz: Camavinga and Huijsen are ruled out for the match against Manchester City as they are still recovering from injury. Xabi Alonso could have 7 absentees against City and 10 against Alavés",
        "content": "",
        "upvotes": 162,
        "comments": 58,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Zjunp6J7wVhsczNZoRFnLnMMHrZdM-IF9AiwJGC421U.jpeg?auto=webp&amp;s=27e8b9f3c14b26b3a70c825de82738b2dbdf322f"
        },
        "permalink": "/r/realmadrid/comments/1phhee0/copes_miguel_angel_diaz_camavinga_and_huijsen_are/"
    },
    {
        "id": "1phgn99",
        "author": "Messmers",
        "title": "What happened to this intensively pressing team from the start of the season where we won 8 games in a row and only conceded 4 goals?",
        "content": "",
        "upvotes": 168,
        "comments": 66,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/lns9wowt906g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1phgn99/what_happened_to_this_intensively_pressing_team/"
    },
    {
        "id": "1phv02v",
        "author": "asensia-kopfschmerz",
        "title": "‘MOST PLAYERS ARE WITH XABI!’ What’s happening in Real Madrid’s locker room? &amp; more! | ESPN FC",
        "content": "Really don’t like the YouTube title but community rules require keeping it, so here we go.\n\nRodrigo Fáez: Xabi Alonso agreed to run players' ideas during their conversation before Olympiacos game. After that RM's tactics are in a large part players' ideas.\n\nMost players support Xabi, but the few that don't are key players. The latter is winning.\n\nThe board is confused why Xabi is becoming more \"Ancelotti\" after the Olympiacos chat.",
        "upvotes": 29,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kdGPaDK_2MO1PPYKTmg2_dDANDU6t0iqe75CSW2kmJ0.jpeg?auto=webp&amp;s=1277604a8ef873df74f86fd04cfe367a57ccf829"
        },
        "permalink": "/r/realmadrid/comments/1phv02v/most_players_are_with_xabi_whats_happening_in/"
    },
    {
        "id": "1phjm0g",
        "author": "TheFeatherDiaries",
        "title": "Jude BELLINGHAM, Rüdiger and Valverde all have discomforts, but they will still play against Manchester City. KYLIAN MBAPPE fractured his finger vs Celta Vigo [Alvaro Esteban]",
        "content": "",
        "upvotes": 111,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2I4ZON8pqWF0c4MA9HCGWITKoZdpfPyFMVmKXj8AODc.jpeg?auto=webp&amp;s=7b538fa9655d24fdf0f4968d72cd86e204581063"
        },
        "permalink": "/r/realmadrid/comments/1phjm0g/jude_bellingham_rüdiger_and_valverde_all_have/"
    },
    {
        "id": "1phdmfg",
        "author": "andy111999",
        "title": "Mario Cortegana : Board assessing team's state and Xabi Alonso's future, with no one confirming XA's continuity if a defeat vs City + Arbeloa well regarded on the shortlist + Zidane admired by Florentino, but a move for him still unclear",
        "content": "",
        "upvotes": 209,
        "comments": 193,
        "media": null,
        "permalink": "/r/realmadrid/comments/1phdmfg/mario_cortegana_board_assessing_teams_state_and/"
    },
    {
        "id": "1ph926a",
        "author": "Omkarop_06",
        "title": "I NEED THIS XI AGAINST MANCITY!",
        "content": "RW : BENCH VINI FOR MBAPPE\nST :  A PROPER STRIKER FOR GOD'S SAKE.\nLW : Endrick or Mastantuono are better options than anyone else atp. They will press too.\nMidfield Trio : Bellingham Tchoumeni and Cama, they are proven to work in el clasico.\nDefense : not much choice there.\nGoalkeeper : yes.\n\nHala Madrid!\n\n",
        "upvotes": 386,
        "comments": 155,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/v051sq92jy5g1.png?auto=webp&amp;s=8252087c735ecbc7fe8fd7a9a1efb33f513686b9"
        },
        "permalink": "/r/realmadrid/comments/1ph926a/i_need_this_xi_against_mancity/"
    },
    {
        "id": "1ph75ko",
        "author": "redsenjui",
        "title": "What does he means by this ?? The players are lazy ?",
        "content": "",
        "upvotes": 545,
        "comments": 90,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xaxs7dlhwx5g1.png?auto=webp&amp;s=c7ec7c36b80c09d0d33b188f8b7ffafe0e56c54e"
        },
        "permalink": "/r/realmadrid/comments/1ph75ko/what_does_he_means_by_this_the_players_are_lazy/"
    },
    {
        "id": "1phb2bp",
        "author": "o6ohunter",
        "title": "Various defensive efforts from the last Celta goal",
        "content": "",
        "upvotes": 183,
        "comments": 96,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/nut4abau3z5g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1phb2bp/various_defensive_efforts_from_the_last_celta_goal/"
    }
]