[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 12,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1oagjm6",
        "author": "Ok-Intention-4593",
        "title": "The Perfect Neighbor- where did Susan live before?",
        "content": "I just finished the perfect neighbor and it was horrifying. Susan was so consistently malignant and evil, it made me wonder where she lived before she moved to AJs neighborhood and if her prior neighbors have similar stories? Her next level insane behavior and repetitive but very similar lies (always fearing for her life, even as she is being placed under arrest) makes me think it’s not possible this HASN’T happened before? May she rot in prison, I’d bet my last dollar she’s terrorizing other inmates and guards daily. \nIf anyone knew her before I’d be curious to know your experience. I’m sad the law couldn’t have stopped this from happening but I don’t blame anyone but Susan. ",
        "upvotes": 299,
        "comments": 368,
        "media": null,
        "permalink": "/r/netflix/comments/1oagjm6/the_perfect_neighbor_where_did_susan_live_before/"
    },
    {
        "id": "1oar7ff",
        "author": "Mylo_Does",
        "title": "I don’t start Netflix shows unless they’ve already finished",
        "content": "The OA being cancelled changed the way I watch streaming content. I thought I was watching one of the greatest stories of all time, as did many others. Now I can’t even recommend it to others because of the heartbreak.\n\nUnfinished stories are a big pet peeve of mine.\n\nAnyone else the same?",
        "upvotes": 32,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1oar7ff/i_dont_start_netflix_shows_unless_theyve_already/"
    },
    {
        "id": "1oarvcp",
        "author": "689Dementia",
        "title": "The Perfect Neighbor, did everyone truly consent?",
        "content": "I’m feeling deeply uncomfortable about the fact that we have access to intimate footage from a tragic event involving dozens of children, parents, couples, and people who lost their mothers. For us, it’s \"entertainment\". For them, it’s their actual lives.\n\nThis documentary is currently trending on Netflix, but I can’t stop thinking: did everyone involved truly consent to having their trauma turned into a top-rated film?\n\nI’ve seen posts on Facebook from people close to the victims, and many of them are clearly upset. Some mention that one person may have agreed, and possibly received money for everyone(maybe just a rumors), but even if that’s true, does it justify broadcasting such personal pain?\n \n- What do we know about the consent process for this kind of media?  \n- Do you think it’s ethical to share such footage if only one person agreed?  \n- Where do we draw the line between public interest and exploitation?\n\nCurious to hear your thoughts.\n",
        "upvotes": 18,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1oarvcp/the_perfect_neighbor_did_everyone_truly_consent/"
    },
    {
        "id": "1oaget4",
        "author": "Funny-Cup-9416",
        "title": "Alright Reddit, please cure my boredom, what’s something absolutely worth watching right now?",
        "content": "I want to watch something really good doesn’t matter if it’s new or old, but please no fantasy or political stuff.\n\nI watch thrillers, drama, crime, emotional stories.\n\nWhat’s that one show or movie that you guys think i should be watching tonight. \n\nI’m doing a night shift, so even if it’s a Tv Show it’s okay to me.\n\nPs: Women in the Cabin 10 sucks one of the worst films i’ve ever seen on Netflix.\n\nEdit: I finally decided to watch, “The perfect Neighbor”.",
        "upvotes": 63,
        "comments": 165,
        "media": null,
        "permalink": "/r/netflix/comments/1oaget4/alright_reddit_please_cure_my_boredom_whats/"
    },
    {
        "id": "1oa17bq",
        "author": "chunkybonks",
        "title": "The Perfect Neighbor - Dr. Susan Lorincz",
        "content": "Umm excuse me. What exactly was this murderer a “doctor” of? She only referred to herself as a doctor once and nothing comes up when you search for it. Anyone know?",
        "upvotes": 454,
        "comments": 782,
        "media": null,
        "permalink": "/r/netflix/comments/1oa17bq/the_perfect_neighbor_dr_susan_lorincz/"
    },
    {
        "id": "1o9ypkn",
        "author": "jonnyson14",
        "title": "Boots is the best show on Netflix right now",
        "content": "If you haven't watched it you absolutely need to. I laughed, I cried, I got angry, it's absolutely brilliant. I stuck it on with no knowledge of what it was, I thought I was just in for a modern take on stripes. Instead I got treated to the most compelling show I've watched in years! I'm begging people to watch it so it gets a season 2! I need it in my veins.",
        "upvotes": 364,
        "comments": 231,
        "media": null,
        "permalink": "/r/netflix/comments/1o9ypkn/boots_is_the_best_show_on_netflix_right_now/"
    },
    {
        "id": "1oacifb",
        "author": "EitherSheepherder854",
        "title": "The Diplomat",
        "content": "I am so hooked on this show. I love the cast and I love the story.  Currently I am on season 3 and I do not want it to end . Has anyone watched this yet? \n",
        "upvotes": 51,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1oacifb/the_diplomat/"
    },
    {
        "id": "1oas9ko",
        "author": "ShadowPaws200",
        "title": "What should I watch after I finish Breaking Bad?",
        "content": "It's really good so far and I enioy it! I don't really like Walt but the acting is so good. I think most people will recommend to me Better Call Saul... but when I finish that one what else should I watch???",
        "upvotes": 3,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1oas9ko/what_should_i_watch_after_i_finish_breaking_bad/"
    },
    {
        "id": "1oaalgd",
        "author": "larrybirds",
        "title": "The Diplomat appreciation post",
        "content": "I’m on episode 4 of the new season, and I feel like this show is a level above many other Netflix originals — feels like could be Sunday night HBO. I know Netflix has had some (deserving) award show darlings recently (Baby Reindeer, Adolescence) but this show to me is like “The Crown” level of acting and quality. \n",
        "upvotes": 40,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1oaalgd/the_diplomat_appreciation_post/"
    },
    {
        "id": "1oa0bkf",
        "author": "schi__zoid",
        "title": "The Perfect Neighbor - it is really heartbreaking",
        "content": "What an ironic title. Losing someone close to you is one of the most difficult things, and it's even worse when the kids are still young. Luckily they seem to be well surrounded by their loved ones.\n\nChildren can be very noisy and annoying, THAT'S WHY THEY ARE CHILDREN. I felt sick when they showed Susan making a scene and refusing to just FKN stand up and go to jail. Very pathetic. ",
        "upvotes": 104,
        "comments": 118,
        "media": null,
        "permalink": "/r/netflix/comments/1oa0bkf/the_perfect_neighbor_it_is_really_heartbreaking/"
    },
    {
        "id": "1oa85w7",
        "author": "fayzee98_____",
        "title": "The woman in cabin 10 movie",
        "content": "I have half a mind to delete Netflix at this point.  If you’re going to do a movie based on a book, at least have the major plots of the book, in the bloody movie!! \nThey not only changed the main character’s personality, they missed the whole plot of the burglary - the PTSD coupled with the alcohol she drank the first night, made her less and less believable. \nThe whole thing with the cigarettes instead of the mascara scenario - was so so stupid.\nI just can’t fathom this.  If they wanted to cut the story line to fit into a movie, they could have done the following instead:\n1. Make it into a limited SERIES, to actually address all the major plots and story lines of the book. Or \n2. Make the movie bloody long?? What’s wrong with that - they did that for Gone Girl, and that movie was just as great as the book.\n\nI can’t get over how bad this movie was.  Maybe because I had read the book legit a couple hours before watching - but it had such great potential!!!\n\nWhat a shame.\n",
        "upvotes": 35,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1oa85w7/the_woman_in_cabin_10_movie/"
    },
    {
        "id": "1oau60w",
        "author": "lazonianArt",
        "title": "What language is KPOP Demon Hunters originally in?",
        "content": "I hate watching dubs, if I watch any foreign movie, anime, whatever I want to watch it in its original audio (with english subtitles). Maybe this is a stupid question given the title of the film, but is KPDH originally in Korean? Only asking cause every clip, rip, etc I see of it is in english :o",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1oau60w/what_language_is_kpop_demon_hunters_originally_in/"
    },
    {
        "id": "1oatpn7",
        "author": "PlayfulPanic4229",
        "title": "Do you guys get this \"skip intro\" bug??",
        "content": "I have \"Standard with ads\" plan, using Netflix app on android TV. After an episode, it plays an ad and after that it starts playing the intro title but it won't show the \"skip intro\" button. On the top right it will say \"resumes after ad\" and it won't let me forward/rewind the title either. \n\nWhen I back out and then play it again, it will play an ad again. And after the ad it will show up the \"skip intro\" button. \n\nIs this a bug in the app or is this a cheap tactic by Netflix to make us watch more ads or upgrade the plan?? This annoys the shut outta me. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oatpn7/do_you_guys_get_this_skip_intro_bug/"
    },
    {
        "id": "1oao54e",
        "author": "Real-Ad-5297",
        "title": "Dr Susan Lorincz - delusional",
        "content": "The most frustrating part is her sat in the interrogation room saying 'No. I can't do this. I'm not going.'\n\nWhat the actual fuck. Delusional. \n\nThe most frustrating part is her sat in the interrogation room saying 'No. I can't do this. I'm not going.'\n\nWhat the actual fuck. Delusional. ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1oao54e/dr_susan_lorincz_delusional/"
    },
    {
        "id": "1oaibur",
        "author": "Negative-Industry944",
        "title": "Subtitles dropped in quality?",
        "content": "Has anyone else noticed the subtitles on Netflix have become unbelievably bad in the past week or so?\n\nI've been watching a few different shows, and the subtitles aren't matching the actual dialogue. They're essentially summarising what's being said, not transcribing it.\n\nIt's completely missing the nuance and accuracy of the conversations, and it's really frustrating. It's happening across multiple shows, so it doesn't seem to be a one-off problem.\n\nIt's really frustrating for me (and I don't have any hearing impairment), but it must be infinitely worse for anyone who is D/deaf or hard of hearing. I really hope they fix it soon.\n\nJust wondering if anybody else had noticed this? ",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1oaibur/subtitles_dropped_in_quality/"
    },
    {
        "id": "1oa4usj",
        "author": "Suspicious_Repeat706",
        "title": "Question about The perfect neighbor",
        "content": "Just finished the documentary and was wondering if anyone knew if they found the tablet in Susan’s house? After all that is why AJ went over, but there was no confirmation of her taking the tablet was true or not.",
        "upvotes": 40,
        "comments": 90,
        "media": null,
        "permalink": "/r/netflix/comments/1oa4usj/question_about_the_perfect_neighbor/"
    },
    {
        "id": "1oal876",
        "author": "Ill_Distribution532",
        "title": "Sonic 3",
        "content": "I bet i saw like 20 mins of sonic the hedgehog 3 from netflix and then my app shut down . After that i couldn’t find the movie anywhere . Even i tried googling it said Its only exclusive to Paramount or Disney or something . ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oal876/sonic_3/"
    },
    {
        "id": "1oas49s",
        "author": "Interesting_Pen6578",
        "title": "The diplomat S3 is great",
        "content": "I wrote a post on how much I was dissapointed by season 2 after a good season 1. So it's obligatory for me to say season 3 is great! \n\nThe writing is sharp. Well there's only one particular part that made me cringe which is when Hal had to tell Kate who the governor of PA was, when there's no way as a political figure you dont know who the gorvenor of a swing state is. \n\nKate is such a brat this season but I'm glad other characters calls out on her behaviour and tantrums.\n\nKate and Hal's complex relationship is great and the time jump helps not to feel like the conflict is over done.\n\nAllison Janney is amazing and they dont make her as an evil meddling character like in season 2 but as an flawed conflicted individual trying to navigate difficult choices as a principle. Love Bradley Whitford too and the charm and comedy weaved into the story.\n\nThey are also make Kate's staying in the UK make sense and be able to retain the characters. They can weaved in the storylines from previous season into a bigger conflicts well as well - not simply throwing them away as unrealted past times.\n\n9/10 highly highly recommend. Oh well I have 1 episode to watch - hopefully it's not a wtf twist as per season 2 ending.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oas49s/the_diplomat_s3_is_great/"
    },
    {
        "id": "1oap515",
        "author": "possessed_watermelon",
        "title": "Where to watch shows after they're removed",
        "content": "Is there any way to watch shows and movies after Netflix removes them? Mainly the international ones. I thought some being Netflix Originals meant they would be on the service indefinitely but have since learned it's all up to contracts ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oap515/where_to_watch_shows_after_theyre_removed/"
    },
    {
        "id": "1oaokj6",
        "author": "stardolphin90",
        "title": "The Perfect Neighbor.",
        "content": "The end got me. “My mom appeared as an angel that night in a dream” 😢 the little boy at the end.\n\nAlso. I had a question. If AJ got shot outside the door of Susan, she must have walked back across to her house but passed out on the grass? So awful. That’s where the police found her. Across the street from Susan’s.\n\nRIP, AJ. 🕊️",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1oaokj6/the_perfect_neighbor/"
    },
    {
        "id": "1oak5gd",
        "author": "OkShine5874",
        "title": "“Your device isn’t part of the Netflix Household for this account”SMART TV Workaround?",
        "content": "Hello there fellow Redditors, As described in the title above, is there any possible way and or workaround to bypass this through a smart TV? I know of the airplane mode \"hack\" through a mobile phone, but I have yet to see on for smart TV. Any help or feedback would be greatly appreciated. Thank you! ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oak5gd/your_device_isnt_part_of_the_netflix_household/"
    },
    {
        "id": "1o9kmmk",
        "author": "Conscious-Can-5334",
        "title": "The Perfect Neighbor - thoughts?",
        "content": "This has me bawling. It’s so sad. Those poor children. That woman should have been arrested from the start. Why didn’t I hear about this in the news when it was happening? ",
        "upvotes": 417,
        "comments": 867,
        "media": null,
        "permalink": "/r/netflix/comments/1o9kmmk/the_perfect_neighbor_thoughts/"
    },
    {
        "id": "1oaeirf",
        "author": "EliMarketing",
        "title": "New Shows or Movies to watch?",
        "content": "Shows to watch on Netflix or HBO? I’m only interested in those 2 because I’m only paying for those two right now and they have no commercials. Normally I would ask CHAT GPT but my bestie has made it clear that’s bad for the environment so I cut myself off cold turkey. \n\nShows I liked:\nPeaky Blinders \nDerry Girls \nFranklin &amp; Bash \nHawaii 5-0\nGame of Thrones \nHouse of Dragon\nNCIS\nCriminal Minds \nCold Case \nThe Closer\nRizzoli &amp; Isles \nLaw &amp; Order \nBurn Notice \nCook of Castemar\nQueens Gambit \nNurse Jackie (I keep falling asleep) \nGreys Anatomy (Any season after Izzy just hasn’t kept my attention) \nOutlander (Season 1 shook me to my core, I’ve decided to never return) \nHalo (started it but kept falling asleep) \nThe Vampire Diaries and all its add ons (haven’t finished any of them. I’m entranced then I’m annoyed. I gave up) \nSuits (never finished, but I did google the ending) \n\nYeaaaaa…I’ve rewatched every single Quentin Tarantino film on Netflix 1,000+ times and I need some new material. There’s a lot more shows I did watch and love but I’m drawing blanks tbh. DC and Marvel shows don’t really keep me either. I just want to be excited about a show again 🥲. I can’t believe I’m saying this but…I’m tired of reading at the moment. And audio books count as reading. \n\n\n",
        "upvotes": 4,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1oaeirf/new_shows_or_movies_to_watch/"
    },
    {
        "id": "1oalruq",
        "author": "No_Chocolate_7442",
        "title": "accidentally entered wrong email when signing up for netflix account",
        "content": "accidentally put gmil.com instead of gmail.com so now the email registered in my account doesn’t exist but i can still use the account on my ipad. what do i do and will this influence anything when logging in or my account?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1oalruq/accidentally_entered_wrong_email_when_signing_up/"
    },
    {
        "id": "1o9mj78",
        "author": "sallymacsmack81",
        "title": "Victoria Beckham’s supposed ‘Victory’ - David Beckham has been subsidising my eyeliners.",
        "content": "The whole premise of the Victoria Beckham documentary was that she fought for 17 years to be taken seriously in fashion and build her brand, all for it to finally stabilise in 2023 after cumulative losses of -£69 million pounds, to post a triumphant profit. But the truth is she posted a EBITDA profit of around £2m pounds, but still an operating loss of -£2.9m. This year, she’s had to extend loans of £6.3m to keep it afloat. It’s not successful and hasn’t been, and if you can’t make a company generate a return in 17 years, after that much investment, it’s not going to magically start making a return. And for that £70 million investment to have meant anything, it needs to be able to generate more than that at some point, not just pay it back. Like who in god’s name pumps that much cash into something year after year, as an escalating commitment to failure, and then gets a documentary made about what a big success it is. I’m baffled! I own some of her eyeliners, and now I know David Beckham has partially subsidised them!",
        "upvotes": 225,
        "comments": 74,
        "media": null,
        "permalink": "/r/netflix/comments/1o9mj78/victoria_beckhams_supposed_victory_david_beckham/"
    },
    {
        "id": "1oai1ap",
        "author": "HecubaMay",
        "title": "Did Netflix remove their trivia game/ anyone have any alternative suggestions?",
        "content": "My partner and I loved playing the Netflix trivia game on our TV; we liked that it was easy to do multiplayer and had a good range of questions. Sadly, I can’t find it on there anymore and have tried downloading a couple other trivia ones like trivia crack and the like but none of them have an good format for multiplayer or a big range of good questions. Does anyone know why they got rid of it or any good alternatives to the Netflix one to play on either smart tv (firestick) or iPhone? Thanks!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oai1ap/did_netflix_remove_their_trivia_game_anyone_have/"
    },
    {
        "id": "1oabcz1",
        "author": "Shopgirl_Mirabelle",
        "title": "The Perfect Neighbor question",
        "content": "I’m asking honestly because I don’t know. How could the police have prevented this? They (the neighbors) said she should have been in jail, but what would she have been charged with? What other things could have been done to prevent it?",
        "upvotes": 3,
        "comments": 64,
        "media": null,
        "permalink": "/r/netflix/comments/1oabcz1/the_perfect_neighbor_question/"
    },
    {
        "id": "1o9zos5",
        "author": "Routine-Asparagus-16",
        "title": "The Diplomat season 3 - Right off the rip",
        "content": "\"A Real Bible. Adult size. Written by Jesus\"\n\n\"Jesus did not write the Bible\"\n\nThe Diplomat Season 3 hasn’t missed a beat. I’m only on the first episode and already hooked. Hal is such a headache, never listens... but I do think he means well. The dynamic between Grace (the President) and Kate (the Ambassador) is fantastic.\n\nThe pacing’s great too. It moves fast but knows when to slow down, like that scene where Kate helps Grace in the bathroom with her shirt. I also love how the show lets the audience in on what’s really happening, even when the truth isn’t said outright... like during the visit with Margaret Roylin.\n\nAnd it’s funny! A political thriller with perfectly timed humor is exactly the escape I needed today.\n",
        "upvotes": 17,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1o9zos5/the_diplomat_season_3_right_off_the_rip/"
    }
]