[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 10,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 33,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1kmfc6h",
        "author": "Then-Scholar1748",
        "title": "Netflix’s A Deadly American Marriage: Jack and Sarah Corbett’s full victim impact statements",
        "content": "",
        "upvotes": 47,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1kmfc6h/netflixs_a_deadly_american_marriage_jack_and/"
    },
    {
        "id": "1km7q0j",
        "author": "Mscharlita",
        "title": "Liver King- what did I just watch?",
        "content": "Within the first couple minutes his teenage son says “tooken days off” instead of “taken” and I knew it was bad news bears. \nI feel SO sorry for those boys. Truly. Did they even go to school? Or were they homeschooled by drug addled, morally bankrupt grifters spewing toxic masculinity? The mother seems to be from another country so maybe she’s not the best teacher of English but yikes, you know they had enough money to maybe hire a tutor.\nAnd I found it interesting that his dad was depicted as a sweet, veterinarian (which takes an amount of studiousness) and instead of maybe trying to be like that he makes up this extreme version of what a man is that seems polar opposite of his dad. Odd choice. (Just as odd as smoking cigars which seems completely counter to his “natural” lifestyle.)\nAnd the brother he says he looked up to is never mentioned as far as where he is now. Maybe they left that out bec he was involved in the criminal enterprises mentioned. I don’t care enough about the guy to look it up, I just think it would have been interesting in the doc. It also would have been interesting if they addressed the children’s allergies. Was that all made up too? If not, in what way were they resolved? As someone who has never heard of him but has a masters degree in food science and applied nutrition I was interested and it was so bad I had to increase the speed halfway through just to finish it quickly. It could have easily been nutshelled into a ten minute YouTube video.",
        "upvotes": 98,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1km7q0j/liver_king_what_did_i_just_watch/"
    },
    {
        "id": "1km4wc9",
        "author": "Majestic_Badger_3986",
        "title": "A deadly American family",
        "content": "Did anyone notice that the sister, Tracey, was wearing white in the wedding photo of Molly and Jason? She knew something was off before the ink dried in the marriage cert. \n\nAny other details you guys found interesting? ",
        "upvotes": 52,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1km4wc9/a_deadly_american_family/"
    },
    {
        "id": "1kmerw5",
        "author": "S4v1r1enCh0r4k",
        "title": "Sakamoto Days Part 2 Official Trailer",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kmerw5/sakamoto_days_part_2_official_trailer/"
    },
    {
        "id": "1kmhknl",
        "author": "Educational_Life_878",
        "title": "Netflix not accepting any payment method?",
        "content": "I stopped keeping money in one of my bank accounts which was the debit card I had used for Netflix so naturally the payment declined which was fine and to be expected.\n\nBut when I went to update the payment method both of my other cards keep getting rejected as well?  One is a credit card with a high limit that I am nowhere near reaching and the other is a debit card with plenty of money in the account.  Both work fine for other purchases and I use them daily.  I don’t have any other cards and I don’t want to lose my account…",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kmhknl/netflix_not_accepting_any_payment_method/"
    },
    {
        "id": "1kmegbd",
        "author": "rohit2906",
        "title": "What happened to American Vandal show ?",
        "content": "Hi all\nI watched the two seasons of American Vandal and I found it to be completely hooking. The hype that they create during the story and bringing students to interview in front of camera which looked like to be a real thing.\nAre we expecting any other seasons to come out ?\nAre there any series like this? Can anybody suggest?",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1kmegbd/what_happened_to_american_vandal_show/"
    },
    {
        "id": "1klmctd",
        "author": "Impossible_Monk1853",
        "title": "A deadly american mariage: could Molly and Tom Martens face justice again after the last trial?",
        "content": "I honestly found the trial so unfair. Can’t believe they’re still free with all the evidence against them. You don’t smash someone’s skull and leave brain pieces all over the room just to defend yourself. Is there any chance the case could be reopened so they actually get a life sentence for such a brutal murder?",
        "upvotes": 176,
        "comments": 155,
        "media": null,
        "permalink": "/r/netflix/comments/1klmctd/a_deadly_american_mariage_could_molly_and_tom/"
    },
    {
        "id": "1km95xi",
        "author": "astaroth360",
        "title": "Lucy is worthless in this form",
        "content": "Why bother licensing movies without making sure they have subtitles for foreign language parts that are supposed to have them? This is just a broken half movie and it is super annoying. Why don't they use their industry weight to fix this when it has been a problem with streamer content for years? Am I just being naieve? ",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1km95xi/lucy_is_worthless_in_this_form/"
    },
    {
        "id": "1kmgcj2",
        "author": "bigced328",
        "title": "Netflix Announces 'Power Moves With Shaquille O'Neal' Detailing Hall of Famer's Work With Reebok - The Industry Cosign",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kmgcj2/netflix_announces_power_moves_with_shaquille/"
    },
    {
        "id": "1km9go5",
        "author": "puccappucinno",
        "title": "I’ve recently started getting into Studio Ghibli films on Netflix. Do you have any recommendations for anime movies with a similar vibe?",
        "content": "Recently, I’ve watched the following films:\n\n* The Secret World of Arrietty\n* Ocean Waves\n* Whisper of the Heart\n* From Up on Poppy Hill\n\nI think you can probably tell what kind of films I enjoy — haha. Do you have any anime movie recommendations with a similar vibe, genre, or plot? Thanks!",
        "upvotes": 3,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1km9go5/ive_recently_started_getting_into_studio_ghibli/"
    },
    {
        "id": "1kmdv3d",
        "author": "grumpypantaloon",
        "title": "American Manhunt - Osama Bin Laden - horrible SFX",
        "content": "I was looking forward for these Osama episodes, but I can't do it. Whoever was responsible for the sound, both effects and music, should have their ears checked.   \nI had to stop after 10 minutes. Annoying drum beat, coarse, way too loud, same for music in the backg..well, fuck, foreground, because you can't bloody understand what the people are saying over the stupid music. It may not as bad if you are watching on TV/on speakers, but with headphones it is unwatachable. Been years since I saw such bad audio mix.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kmdv3d/american_manhunt_osama_bin_laden_horrible_sfx/"
    },
    {
        "id": "1kma4xz",
        "author": "Mobile_Impression682",
        "title": "Question about sharing Netflix Premium and profiles/recommendations",
        "content": "I'm thinking about getting a Netflix Premium subscription (€11.99) and splitting the cost with my friends. €11.99 is a bit expensive in my country, so sharing seems like a good option.\n\nMy main question is: if we share one Premium account but each use our own separate profile on different devices, will our recommendations stay separate? Or will our viewing habits get mixed up and mess with each other's suggestions?\n\nWe want to make sure everyone gets their own personalized experience.\n\nHas anyone here shared a Premium account like this before? How did it work out with profiles and recommendations?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kma4xz/question_about_sharing_netflix_premium_and/"
    },
    {
        "id": "1klzqmk",
        "author": "Holiday_Record2610",
        "title": "Continue Watching Gone @ Netflix’s Response",
        "content": "I called Netflix to get help with “continue watching” no longer existing (i know many have this issue) and was told to do the most elementary trouble shooting (log out then back in, unplug tv then plug back in) with them on the phone even though I’d already done those things multiple times. They tried to tell me I need to create a new profile and use it from now on, nope. Kept insisting that’s the only solution. So I created a new profile and guess what? No continue watching there either. They told me they don’t know how to fix it and exited conversation. I will not be renewing my membership next month.",
        "upvotes": 3,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1klzqmk/continue_watching_gone_netflixs_response/"
    },
    {
        "id": "1klvfk2",
        "author": "me91981",
        "title": "Something fun",
        "content": "I am in college and have just started working and it's draining. In my lunch break and after my workday, I just need something that's not very dull, psychological superficial shit but still engaging. Have you watched \"The Residence\"? Yes exactly like that. Mostly thrillers are preferred but I'll also take other suggestions. Please don't suggest a sitcom. I've watched all of them. Just need something that I can't stop before ending the episode but can wait for starting the next one. ",
        "upvotes": 7,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1klvfk2/something_fun/"
    },
    {
        "id": "1klzdz1",
        "author": "Gohomepatyouredrunk",
        "title": "Bad Thoughts Discussion - Who was this made for?",
        "content": "I am a fan of Tom Segura. Enjoy his stand up and listen to his podcasts on occasion. This show was something. It felt like they were just trying to see what they could get away with to get put on air. Very few of the jokes hit with me. I guess I was not the target audience for this show.\n\nWith that being said, who enjoyed this?",
        "upvotes": 4,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1klzdz1/bad_thoughts_discussion_who_was_this_made_for/"
    },
    {
        "id": "1kmfjvq",
        "author": "Internal-Bed-3150",
        "title": "Noah Schnapp: “People are going to be truly devastated” by Stranger Things 5",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kmfjvq/noah_schnapp_people_are_going_to_be_truly/"
    },
    {
        "id": "1kme1nv",
        "author": "Wooden-Relative-7245",
        "title": "What do you think about what is the South Korean government doing to Netflix?",
        "content": "I saw Thai subscriber saying she thinks about subscribing to HBO because K-dramas are flooding Netflix and I saw other subscribers saying they think about cancelling their Netflix subscription because of the South Korean government flooding netflix with Korean shows.\n\nSouth Korean President Yoon Suk Yeol visited the United States of America to commemorate the 70th anniversary of the U.S.-ROK Alliance, and after he  met the co-chief executive of Netflix, Ted Sarandos announced that Netflix would invest $2.5 billion in new South Korean films and TV series.\n\nMany of K-dramas in Netflix flopped in South Korea. yet they were added to Netflix despite their local failures\n\nFor many years, the South Korean government has invested billions into K-dramas and K-pop. the Ministry of Culture and its K-pop department were pivotal in making K-pop globally popular. They also launched TV channels worldwide to promote Korean TV shows, K-pop,. President Yoon also asked his ministers to watch Korean shows and also promoted K-pop and K-dramas in his political speeches. It felt strange to see a president discussing (K-pop) and Korean dramas — whose primary audience is young women — inside Congress, which is largely made up of men and women over 50.\n\nWhile many governments around the world support local film and music production to promote cultural development (like films about military or history) and, at times, to promote tourism (some films), South Korea’s government does this to a much greater extent. It focuses on improving the nation’s image, promoting tourism, marketing Korean products, and boosting the economy.\n\n",
        "upvotes": 0,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1kme1nv/what_do_you_think_about_what_is_the_south_korean/"
    },
    {
        "id": "1kldjbn",
        "author": "HERE-F0R-THE-TEA",
        "title": "The four seasons was okay??",
        "content": "I can definitely understand why a lot of people loved the show but it just didn’t fully do it for me.. yeah I was definitely laughing for many parts but my biggest issue was the pacing. Certain ends to episodes left me wanting to see how the chaos would play out but would just enter the next episode months into the future. \n\nI think the pacing wasn’t for me but entertaining cast. \n\nAnyone else ?!? ",
        "upvotes": 60,
        "comments": 62,
        "media": null,
        "permalink": "/r/netflix/comments/1kldjbn/the_four_seasons_was_okay/"
    },
    {
        "id": "1kltole",
        "author": "Mean-Flower823",
        "title": "What show is it?!",
        "content": "For the life of me I cannot figure out what show this is, I thought it was a black mirror episode but I think I’m wrong. It’s a zombie episode and it starts out in a neighborhood with a lot of military trucks driving by as people come out of the houses and start following along. ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kltole/what_show_is_it/"
    },
    {
        "id": "1klle60",
        "author": "Jjh09007",
        "title": "Four Seasons question *spoilers ahead*",
        "content": "Does anyone else think that Nick might have lived if that guy didn't cut him at the grocery store line? I feel like he might have been on the road a few minutes earlier, potentially saving him from the accident. Honestly hated the twist at first but ai feel like it perfectly depicts the randomness of life and how suddenly life can change\n\n",
        "upvotes": 12,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1klle60/four_seasons_question_spoilers_ahead/"
    },
    {
        "id": "1kmh19n",
        "author": "composedmason",
        "title": "My Octopus Teacher is the most beautiful and creepiest documentary I've ever seen (Ewwww.....double ewww - gross out alert)",
        "content": "The shots are glorious and capture the feeling like you're underwater under the sea. I cannot stress how beautifal this documentary is. But it's overshadowed by the fact that the guy totally has the hots for the octupus and I'm guessing had \"interspecial relations\" off camera.\n\nThere's even a scene where he stalks her, finds her, mentions how beautiful she is and there's an overly long shot of her standing on his bare chest, tentacles out on full display, with the subtext sub-texting to gross level I didn't expect from a nature documentary.\n\nAt first I thought, oh cool and octopus documentary. Now I'm scarred for life. Parental advice, don't let your children watch this unless they're already reading hentai.",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kmh19n/my_octopus_teacher_is_the_most_beautiful_and/"
    },
    {
        "id": "1kmhhvs",
        "author": "Glittering_Prompt_94",
        "title": "Would people prefer liver king tell kids to do steroids ?",
        "content": "I understand he lied but anyone can google and find out that size is unattainable without steroids. My question is should someone who kids are actively copying say he’s doing insanely high level of steroids so kids can then copy that ? I’d rather kids get in the gym and eat natural foods vs kids using steroids the moment they can get them. ",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1kmhhvs/would_people_prefer_liver_king_tell_kids_to_do/"
    },
    {
        "id": "1km28un",
        "author": "SeaCrafty3884",
        "title": "Help me Please with Warrior 2019",
        "content": "Hey i need to watch the show warrior with my brother but i need time stamps for the scenes involving nudity so we can skip them. PLEASE HELP ME. Due to religious reasons we dont wish to be bombard with nudity and the show is amazing and honestly the nudity doesn’t do anything for the plot. So help meee",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1km28un/help_me_please_with_warrior_2019/"
    },
    {
        "id": "1kmcctn",
        "author": "QueenofHearts018",
        "title": "How to get around the household rule?",
        "content": "My parents are divorced, I have always used my Dad’s Netflix. I tried to log in today and it said I couldn’t because I wasn’t in that household. Help, what do I do? Nobody is gonna want to pay extra or send me like a verification every time so I don’t know what I can do. ",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1kmcctn/how_to_get_around_the_household_rule/"
    },
    {
        "id": "1klyz48",
        "author": "derpymurpy",
        "title": "Full screen glitch - bobbing with subtitles",
        "content": "As the title says and in video, whenever I go into full screen and have subtitles enabled this happens. \nI could turn subtitles off but preferably would like them on. \nI tried the fix for Mac where changing cursor size fixes it but I’m using windows app on a hp so didn’t have any effect.\n",
        "upvotes": 0,
        "comments": 2,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/qp3xrwfvhm0f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1klyz48/full_screen_glitch_bobbing_with_subtitles/"
    },
    {
        "id": "1kkxwi5",
        "author": "EthanWilliams_TG",
        "title": "Netflix's Hit Series 'Lupin' Is Coming Back for a Fourth Part",
        "content": "",
        "upvotes": 78,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kkxwi5/netflixs_hit_series_lupin_is_coming_back_for_a/"
    },
    {
        "id": "1klnpx0",
        "author": "Outrageous_Buddy1938",
        "title": "I feel more and more famous Hollywood titles are being removed from the platform and only NF original getting loaded",
        "content": "How far is this true … I see Hollywood classics which were easily available on NFlix no longer exist any more. And the platform adds more and more their movies and series. \n\nIs this my observation true or others too feel the same. ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1klnpx0/i_feel_more_and_more_famous_hollywood_titles_are/"
    },
    {
        "id": "1klklgx",
        "author": "EthanWilliams_TG",
        "title": "Netflix Releases Trailer for 'K.O.' Starring UFC Legend Ciryl Gane, Premieres in June",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1klklgx/netflix_releases_trailer_for_ko_starring_ufc/"
    },
    {
        "id": "1klw3xg",
        "author": "TheWandererTomorrow",
        "title": "Netflix offline",
        "content": "Should I not be able to download content from Netflix to my iPad and watch it offline ? I succesfully did that on a flight but on my iPhone. Should be the same. ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1klw3xg/netflix_offline/"
    },
    {
        "id": "1kla37n",
        "author": "Chef__Goldblum",
        "title": "Million Dollar Secret",
        "content": "For the next season (if there is one) I’d love there to be an edit where we can play along. We don’t know who has it. We don’t see the confessionals of ‘I feel so guilty’ just a chance to be as shocked as the others when it is/isn’t who we all suspect! \n\nPlus not knowing the challenges would be so cool. \n\nWould be a hard edit, but I would watch twice. Once not knowing and once knowing with the commentary and agendas and things. ",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kla37n/million_dollar_secret/"
    }
]