[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 46,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 14,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1ql4deb",
        "author": "Large-Cardiologist54",
        "title": "Does anyone else spend more time choosing than actually watching?",
        "content": "I don’t know how many times I open up Netflix, sit down with snacks ready… and some how 20 minutes later I am still scrolling lol.. \n\nI mean it’s not that there’s “nothing” to watch. It’s that everything feeling like a commitment nowadays…\n\nIt’s either too long, too heavy, or not the right mood. \n\nHalf the time I just give up and rewatch something I’ve already seen. \n\nIs this just me, or does choosing feel harder than watching 😩?\n\nWhat do you usually end up doing when this happens? ",
        "upvotes": 401,
        "comments": 92,
        "media": null,
        "permalink": "/r/netflix/comments/1ql4deb/does_anyone_else_spend_more_time_choosing_than/"
    },
    {
        "id": "1ql7ttn",
        "author": "yuzusorbet",
        "title": "Is \"Skyscraper Live\" today (Friday) or tomorrow (Saturday)?",
        "content": "UPDATE: Netflix confirmed that it'll be postponed by a day due to the weather.  \n\"*Skyscraper Live was originally scheduled to air on January 23. Due to weather conditions, the live event is postponed, and will now stream on Saturday, January 24 at 8 PM ET / 5 PM PT.\"*\n\n\\--\n\nEDIT to add:\n\nThe weather forecast in Taipei for today is 15 - 20c, 80% chance of rain. Maybe this is why the date is shown as one day later. But I haven't seen any official announcements that they're postponing it.  \n\\---\n\nOriginal post:\n\nI'm in the West coast and it's 4:19pm PT, Jan 23 Friday.\n\nI thought it starts Friday 5pm PT, but why does my Netflix says Skyscraper Live is t**omorrow 5pm PT**?\n\nI can't paste a screenshot but wonder if others see the same?",
        "upvotes": 29,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1ql7ttn/is_skyscraper_live_today_friday_or_tomorrow/"
    },
    {
        "id": "1qkut4t",
        "author": "Fun_Molasses5215",
        "title": "Karamo Brown previously admitted he and Antoni had ‘extreme conflict’ during season one of Queer Eye and refused to talk to each other",
        "content": "",
        "upvotes": 84,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1qkut4t/karamo_brown_previously_admitted_he_and_antoni/"
    },
    {
        "id": "1ql4f9l",
        "author": "AggressiveChange420",
        "title": "Live Event.Skyscraper Live tonight...Is it really live?",
        "content": "Been following Alex Honnold since he free soloed ElCapitan. The guy is what a normal person considers crazy. He has no fear, literally none.\n\nIs the tonight show Live or has a delay ? Reason I'm asking climbing Taipai 101 without rope or safety is a new level of insanity. As someone that actually went to the top on the structure (took the elevator) , I can tell you the building has a a very distinctive sway because of the strong winds.\n\nIf it's live I'll cancel plans for tonight to watch him..if delay or recorded i'll go about my routine and watch it at a later date",
        "upvotes": 15,
        "comments": 77,
        "media": null,
        "permalink": "/r/netflix/comments/1ql4f9l/live_eventskyscraper_live_tonightis_it_really_live/"
    },
    {
        "id": "1ql9nus",
        "author": "Top-Three-USA",
        "title": "Netflix Hits Pause on Alex Honnold’s Daring Taipei 101 Climb as Rain Forces Live Event Delay",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ql9nus/netflix_hits_pause_on_alex_honnolds_daring_taipei/"
    },
    {
        "id": "1ql7pdv",
        "author": "Business-Employ-1599",
        "title": "Skyscraper Live",
        "content": "Is this delayed or being done on a different day? I have seen chatter but cannot find confirmed sources. Please post any information you have as well as any sources if possible, Thank you. \n\nEdit: Great comment came in with News story it's been delayed one day. \n\nhttps://www.hollywoodreporter.com/tv/tv-news/netflix-postpones-alex-honnold-skyscraper-live-climb-1236483352/",
        "upvotes": 4,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1ql7pdv/skyscraper_live/"
    },
    {
        "id": "1qkzddl",
        "author": "IntroductionOnly9820",
        "title": "Just finished adolescence",
        "content": "Loved this series, the acting, the camera work. I was convinced that jamie didnt kill katie for all 4 episodes until episode 4 when Eddie has a breakdown in jamies when he says \"im sorry son, i should've done better\" and the credits roll, i bursted into tears.",
        "upvotes": 13,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qkzddl/just_finished_adolescence/"
    },
    {
        "id": "1ql3e68",
        "author": "One_Hour_8078",
        "title": "His and hers",
        "content": "Show is ok if you don’t think abt it. But first off how tf did the mom know Lexi was Catherine. How’d the mom even know she’d be coming to dohlonega that same day she canceled the reservation? Why’d she think Lexi would attack Anna. Why did Anna say she didn’t know they were gonna do that to Lexi if it actually happened to Anna and Lexi saw it happen to Anna. What was the goal for Richard and Lexi to even do what they did in the first place. If the mom was the one to cancel the reservation hows Richard know the exact plan that exact night. How did jack not get in trouble for literally tampering with evidence while being on the job. Forget jail, how didn’t he lose his job? And towards the end. Does the mom actually have dementia or just faking? ",
        "upvotes": 8,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1ql3e68/his_and_hers/"
    },
    {
        "id": "1qk7097",
        "author": "cheno103",
        "title": "Netflix bosses feel 'blindsided and horrified' after Queer Eye Karamo Brown claims he was 'bullied' on set",
        "content": "",
        "upvotes": 474,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1qk7097/netflix_bosses_feel_blindsided_and_horrified/"
    },
    {
        "id": "1qkv165",
        "author": "plaatopuss",
        "title": "Something similar to never have i ever and sex ed.",
        "content": "I loved never have i ever so much, sex ed was also pretty decent. tried watching the summer i turned pretty but i didnt like it very much and dropped it after the second season i think? it was cute until the first season and after that it was just stupid ( OBJECTIVE OPINION PLS DONT SEND HATE ). but yes, idk what appealed to me in the two shows, yes i love romance shows and even movies work. i think the fact that they were my age also appealed to me but yeah idk. are there any series and/or movies like those? any recommendations are appreciated. thank you \n\n",
        "upvotes": 11,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1qkv165/something_similar_to_never_have_i_ever_and_sex_ed/"
    },
    {
        "id": "1qkgya1",
        "author": "Sudden_Pop_2279",
        "title": "Alice in Borderland was not \"cancelled\"",
        "content": "So recently, there's been a massive misconception being spread. Netflix released a post saying how season 3 was the \"final\" season of Alice in Borderland. Somehow, people saw this and immediately started spreading online \"the show's been cancelled\" or whatever.\n\nSeason 3 was ALWAYS marketed as the final season. Its not the show being cancelled, it reached its natural conclusion. Hell, season 2 alone was a perfect ending and even though season 3 was flawed and unecessary, I still thought the ending itself was good. This is one of the better places to \"cancel\" a show if anything.\n\n\"But there was the teaser at the end\" yeah, which at MOST was hinting towards a US spin-off or at the least, that the games were continuing across the world as the Watchman warned Arisu. Season 3 made MORE views than season 1, its foolish to assume the mixed reception got the series \"cancelled\".",
        "upvotes": 70,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1qkgya1/alice_in_borderland_was_not_cancelled/"
    },
    {
        "id": "1ql8r6y",
        "author": "SecretSharkboy",
        "title": "What does Netflix do right that other streaming services do wrong",
        "content": "I mean in terms of design. To put it simply, I'm working on a piece of coursework regarding website design and I thought \"hey, I spent most of my time on Netflix, I'll do it on that\" so I need a poorly designed alternative (generally ugly looking, slow, difficult to use or navigate) so I can get the work done.\n\nIt can be any streaming service website, as long as it isn't illegal, ive had a few websites suggested that I was told to look into as they could be what I'm looking for.\n\nI won't mind if this gets taken down, but if it does, I'd like to know where to post a question like this, thanks.\n\n(P.S. The OG post got taken down cus i named a certain platform that's very controversial atm in the title)",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1ql8r6y/what_does_netflix_do_right_that_other_streaming/"
    },
    {
        "id": "1ql7gf1",
        "author": "The-Desk-Of-Forty-7",
        "title": "Do any Netflix shows take place in the same universe.",
        "content": "I'm referring to some of the more outlandish ideas rather than something more obvious. \n\nPerhaps a Squid Game Is held in Aldovia.\n\nPerhaps one of the graduates from Hawkins ends up work in Hollywoo.\n\nI'm referring to the idea that Netflix has a shared Universe between all of its shows.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ql7gf1/do_any_netflix_shows_take_place_in_the_same/"
    },
    {
        "id": "1qkc5fd",
        "author": "Bobby_Brooklyn5",
        "title": "11.22.63",
        "content": "New to Netflix and surprisingly good.  Time-travel story with a pretty good James Franco and a terrific supporting cast.  Not usually in to this genre or Stephen King but this is a very trippy, engaging story.  Kind of like an episode of The Twilight Zone on steroids.",
        "upvotes": 69,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1qkc5fd/112263/"
    },
    {
        "id": "1qk0x2s",
        "author": "salutefanaccount",
        "title": "Harlan Coben",
        "content": "i can’t be the only one who can’t stand Harlan Coben series’. His stories are just written so bad and feel like a parody of well written shows. Idk why netflix continues to follow his ideas. Does anyone else feel this way?",
        "upvotes": 185,
        "comments": 138,
        "media": null,
        "permalink": "/r/netflix/comments/1qk0x2s/harlan_coben/"
    },
    {
        "id": "1ql0q96",
        "author": "pdxgod",
        "title": "Netflix",
        "content": "Is it me or does every Netflix movie feel the same? While every movie has a different plot, they always have the kind of the same elements. Couple different sets. Cameras seem the same… dialogue pace seems to be the same… plot points and speed… do they have some sort of Netflix formula now?",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1ql0q96/netflix/"
    },
    {
        "id": "1qkxkap",
        "author": "Beautiful_Battle6622",
        "title": "Top Issue For the New Hialeah Mayor? The Movie The Rip, Clearly",
        "content": "",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qkxkap/top_issue_for_the_new_hialeah_mayor_the_movie_the/"
    },
    {
        "id": "1qkuzw3",
        "author": "Kaskelontti",
        "title": "The original Good Doctor",
        "content": "I started watching Good Doctor, and after a couple of fairly standard and predictable American hospital soap opera episodes, I realized that it was based on a Korean series. And lo and behold! The original series is also available on Netflix! Yet another Korean series that I immediately got hooked on.  The American remake was typically bland and dull compared to the original. Why do Americans manage to ruin all good series by making them predictable and squeezing them into the same boring mold?",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1qkuzw3/the_original_good_doctor/"
    },
    {
        "id": "1qkb1ed",
        "author": "Used-Can-6979",
        "title": "Skyscraper Live.",
        "content": "Is there really a chance this guy can fall and die in front of everyone? I have a feeling this is gunna end up being kinda boring. It’s tomorrow. I’m just curious who’s gunna watch it.",
        "upvotes": 17,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1qkb1ed/skyscraper_live/"
    },
    {
        "id": "1qkfos1",
        "author": "joesen_one",
        "title": "Netflix Oscar Nominations 2026 - Frankenstein, Train Dreams, The Perfect Neighbor, All the Empty Rooms, The Singers",
        "content": "* Best Picture - Frankenstein, Train Dreams\n* Best Supporting Actor - Jacob Elordi for Frankenstein\n* Best Adapted Screenplay - Frankenstein, Train Dreams\n* Best Costume Design - Frankenstein\n* Best Production Design - Frankenstein\n* Best Makeup &amp; Hair - Frankenstein\n* Best Score - Alexandre Desplat for Frankenstein\n* Best Sound - Frankenstein\n* Best Original Song - \"Train Dreams\" by Nick Cave and Bryce Dessner for Train Dreams\n* Best Cinematography - Frankenstein, Train Dreams\n* Best Documentary Feature - The Perfect Neighbor\n* Best Documentary Short - All the Empty Rooms\n* Best Live Action Short - The Singers",
        "upvotes": 9,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qkfos1/netflix_oscar_nominations_2026_frankenstein_train/"
    },
    {
        "id": "1ql6l2p",
        "author": "RiskAndReason",
        "title": "Let’s be honest… what’s the most OVERRATED Netflix show?",
        "content": "What Netflix series do you think is way overrated compared to the hype it gets?\n\n\n\nNot saying it’s bad, just… didn’t live up to the noise for you.\n\nNo judgment, drop your pick 👀🍿",
        "upvotes": 0,
        "comments": 82,
        "media": null,
        "permalink": "/r/netflix/comments/1ql6l2p/lets_be_honest_whats_the_most_overrated_netflix/"
    },
    {
        "id": "1qkrezv",
        "author": "jsofredorl",
        "title": "Terrible bitrate (below 1 Mbps) on Netflix, what now?",
        "content": "For several days now, the bitrate on Netflix here has been terrible. Series like Stranger Things and One Piece have bitrates below 1 Mbps, as well as some movies. My internet speed test shows above 200 Mbps, but other streaming services are all in 4K. What should I do?",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1qkrezv/terrible_bitrate_below_1_mbps_on_netflix_what_now/"
    },
    {
        "id": "1qk7jfk",
        "author": "kimnabi7",
        "title": "The woman in cabin 10",
        "content": "Attention: spoilers ahead.\n\nAm I the only one who found this movie completely unrealistic? I honestly have no idea how they managed to convince keira knightley to sign on to this story.\n\nFrom the very moment the woman expressed her desire for giving away all her money for charity, it was obvious her husband was going to kill her. Beyond that predictability, the entire plot felt absurdly implausible.\n\nEven if we assume a billionaire could somehow use facial recognition to find a woman who looks exactly like his wife, the execution still makes no sense. Maybe he could have staged a distant public appearance to deceive people but having her pass as his wife up close, in broad daylight, on a boat, surrounded by her friends? Completely unbelievable. Let alone that she just shaved her hair and put on some make-up by herself instead of having a professional MUA do it. And how is a poor Polish woman suddenly able to speak flawless British English and perfectly imitate another person’s voice? That alone defies logic.\n\nThen there’s the ridiculous idea of having her impersonate the wife to sign a contract. A contract involving an inheritance of that magnitude would absolutely require handwriting verification something that’s standard practice. The whole plot feels like it was written by a teenager with no understanding of how the real world works.\n\nExtra minus points for the way women are portrayed as hysterical and foolish in situations like this. An award-winning journalist, in particular, would not react so irrationally upon realizing something deeply suspicious is happening, nor would she make herself such an obvious target.",
        "upvotes": 22,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1qk7jfk/the_woman_in_cabin_10/"
    },
    {
        "id": "1qk86rd",
        "author": "serv0_o",
        "title": "Is there a way to block a show from being advertised to me?",
        "content": "I can’t stand opening the app and seeing Bert Kreischer’s face and naked body. I don’t want to see this Free Bert show plastered on the main page. Is there a way to block it?",
        "upvotes": 11,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1qk86rd/is_there_a_way_to_block_a_show_from_being/"
    },
    {
        "id": "1qkkbu6",
        "author": "Emmiesship",
        "title": "Parental controls - Post for parents of young children.",
        "content": "I recently contacted Netflix to ask why there are quite a few titles I cannot block on parental controls. I spoke to a Netflix customer service person who asked me to do a lot of resets extra on all my devices.I kept explaining that many of the titles did in fact block without problem and the issue was not my end, but rather Netflix’s. Still, I spent almost an hour doing resets, etc. In the end, he told me to just tell my kid he couldn’t watch specific titles (clearly not a parent himself!) He said he’d referred the issue, so I asked for a reference to our call so I could check on the progress. He said that’s not something they do. He said to just keep checking if the title had been added to the remove list. I have done this - still nothing. I really don’t want to waste another hour of my life to a rude Netflix customer service dude, so do any of you have any idea how to chase this? There are many titles that can’t be blocked under parental controls - shows that are within the age limits. I’m an early years educator, so maybe I’m taking this issue more seriously than I need to, but some of the shows they’ve added on there for young children are absolute cesspools for developing brains. Not nearly as bad as Amazon kids, but still not great. So the powers to block these titles is pretty important I feel. I promise I’m not normally this neurotic, but I can’t face another fight with my six year old, after a long day of working with other people’s kids, over why he can’t watch Catch! Teenieping. Help a mother out! ",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1qkkbu6/parental_controls_post_for_parents_of_young/"
    },
    {
        "id": "1qkhimk",
        "author": "PhillyPhenom93",
        "title": "How do I remove this",
        "content": "Can someone with more than 2 brain cells tell me how I get this off my screen? This pops up every time I use Netflix on browser, this is from a live NFL game LAST YEAR &amp; it’s still “reminding” me about it. It’s not saved in my list nor do I have the reminder icon selected on it. How do I get rid of this shit???? Just realizes I can’t post a pic on this sub (why tho) so I’ll explain it in further detail. It’s a pop up of a live NFL game from last year, last year i did have Netflix “remind me” when this goes live, the event is over &amp; yet i still get the “reminder” pop up every time I use Netflix. HELP ME!!!! ",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1qkhimk/how_do_i_remove_this/"
    },
    {
        "id": "1qk7o86",
        "author": "Marceline1995",
        "title": "Any adult animation recommendations?",
        "content": "I have enjoyed watching Haunted Hotel, Chicago Party Aunt, F is for Family, Paradise PD, Carol &amp; the End of the World and Inside Job. I am looking for something in the likes of these shows. Open to any recommendations. Thank you!",
        "upvotes": 8,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1qk7o86/any_adult_animation_recommendations/"
    },
    {
        "id": "1qk9uop",
        "author": "ponyo_007",
        "title": "adolescence - jamie’s parents",
        "content": "i loved the moment where jamie’s parents are in the car with jamie’s sister explaining their love story.\n\nwhat really struck out was the fact that lisa looked as if she had never heard about the fact that her own dad looked ridiculous at a school dance, with bowling shoes and a crazy wig and then got made fun of during the rest of his school. yet, her mother still decided to date him and then get married. \n\ni believe that this scene is so important when\n\ncompared to episode 3 where jamie has this rather harsh image of his dad - a loving one, yes, but with a certain edge to him.\n\ntheir stories at school can be seen as similar, and yet jamie is convinced that women will never be interested because of certain things he has been told/seen on the internet. ",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qk9uop/adolescence_jamies_parents/"
    }
]