[
    {
        "id": "1q5rp31",
        "author": "SonyPictures",
        "title": "Hi /r/movies! I'm Nia DaCosta, director of 28 Years Later: The Bone Temple, the next installment of the franchise. It's in theatres January 16. Ask me Anything! (Back on Wednesday 1/7 at 8:15 AM PT / 11:15 AM ET to answer your burning questions!)",
        "content": "Director Nia DaCosta brings us into a new era of horror with the next installment, 28 Years Later: The Bone Temple, exclusively in movie theatres January 16. Get tickets now.\n\nWatch the trailer: [https://youtu.be/QlF68NIz8dg?si=9Q8r\\_\\_ltSnOSUsoA](https://youtu.be/QlF68NIz8dg?si=9Q8r__ltSnOSUsoA)\n\nGo behind the scenes with Nia DaCosta: [https://www.youtube.com/watch?v=dngea6T71EQ](https://www.youtube.com/watch?v=dngea6T71EQ)",
        "upvotes": 525,
        "comments": 309,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ypc1bp6l1sbg1.jpeg?auto=webp&amp;s=972103a1fb60295a33f0c7c269d9813e537fa000"
        },
        "permalink": "/r/movies/comments/1q5rp31/hi_rmovies_im_nia_dacosta_director_of_28_years/"
    },
    {
        "id": "1q6dj2y",
        "author": "MarvelsGrantMan136",
        "title": "Warner Bros. Discovery Rejects Paramount’s Latest Offer As Inferior To Netflix Deal",
        "content": "",
        "upvotes": 5904,
        "comments": 295,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/tEJ6WHM8a_O6cupupPDAN1PhdimCPk1yszemTee-6WE.jpeg?auto=webp&amp;s=1970b5f485c8cf88d34907bad61f7f8ba372f174"
        },
        "permalink": "/r/movies/comments/1q6dj2y/warner_bros_discovery_rejects_paramounts_latest/"
    },
    {
        "id": "1q6ge1p",
        "author": "MoneyLibrarian9032",
        "title": "First image from ‘ENOLA HOLMES 3’ starring Millie Bobby Brown and Louis Partridge.",
        "content": "",
        "upvotes": 792,
        "comments": 359,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ta8tmoikqxbg1.jpeg?auto=webp&amp;s=b96019a33459fde216a487b0746ec9e9d29ce414"
        },
        "permalink": "/r/movies/comments/1q6ge1p/first_image_from_enola_holmes_3_starring_millie/"
    },
    {
        "id": "1q6g80o",
        "author": "DifferentMaize9794",
        "title": "Lai Yuqing, ‘Whisperings of the Moon’ Director, Dies at 23",
        "content": "",
        "upvotes": 620,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/glyWjULm5LX_CgaZr09epPkvUVaFJ72Pi9dUPfXbtcQ.jpeg?auto=webp&amp;s=d5da64d0cc65ed0b333a65f075537a00ad4c2565"
        },
        "permalink": "/r/movies/comments/1q6g80o/lai_yuqing_whisperings_of_the_moon_director_dies/"
    },
    {
        "id": "1q6g6d0",
        "author": "MarvelsGrantMan136",
        "title": "First Image of John Cena and Eric Andre in ‘Little Brother’ - A famous real estate agent’s carefully curated world is upended when his eccentric “little brother” unexpectedly reappears.",
        "content": "",
        "upvotes": 506,
        "comments": 130,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/fau8mvoxoxbg1.jpeg?auto=webp&amp;s=1dd7c774182f0b1a07033b4cf17e86e4ab3de8d6"
        },
        "permalink": "/r/movies/comments/1q6g6d0/first_image_of_john_cena_and_eric_andre_in_little/"
    },
    {
        "id": "1q6dkuu",
        "author": "browniebiscuitchildr",
        "title": "What’s a movie that becomes almost heartbreaking to watch in hindsight once you learn about what happened behind the scenes?",
        "content": "\nOne of the most painful ones is *The Wizard of Oz.* \n\nJudy Garland (our beloved Dorothy) had a stage mom from hell and she was exploited by the studio as well in horrifying ways. She was called an ugly duckling of all things, smacked in the face when she couldn’t keep it together in a scene and kept laughing, put on pills that eventually led to her death from an overdose at age 40… and that’s not even mentioning the sexual assault while she was at MGM. \n\nJust horrible. But that’s Hollywood for you. ",
        "upvotes": 536,
        "comments": 304,
        "media": null,
        "permalink": "/r/movies/comments/1q6dkuu/whats_a_movie_that_becomes_almost_heartbreaking/"
    },
    {
        "id": "1q5r9e2",
        "author": "TheGhostofLizShue",
        "title": "Streaming services shrinking credits to throw ads at you is so wildly disrespectful to artists and throws cold water over any ending.",
        "content": "I honestly don’t know why more people don’t complain about this, so here’s me complaining about this.\n\nAgainst my better judgement I decided to watch The Gorge on Apple‘s streaming platform, and boy it turns out even an ending as trite as that can be [further undercut by Ted Lasso’s beaming face.](https://i.imgur.com/mB9Z1D6.jpeg)\n\nI remember the story about how George Lucas had to go non-union or pay fines to the director’s guild because he refused to open Star Wars with credits. They cared about them that much. Now, in space year 2026, apparently every professional association of filmmakers give not one solitary shit about credits, allowing as they do every single streaming platform to shrink them to Borrower size so they can Run Some Fucken Adverts. “Yes you just watched Schindler's List for three hours and change, but stop processing it there’s not a moment to lose, have you heard about *House MD*? We're gonna play it in 5 seconds unless you tell us not to.\" \n\nThis is Apple’s own movie, these are their people, and they couldn’t even wait for the animations to stop. Like the disrespect afforded to the standard white on black scroll is bad enough, but there are visual effects going on in that little box. You paid vfx artists real human money to make this look good, not enough, granted, but you paid them, and then you made it two inches tall. Morality obviously doesn’t sway these people but how are their shareholders not beating down the door at the sheer waste of it?\n\nNetflix is particularly bad now too, some people will say \"hey you can just make it bigger again\" (as if ruining the vibe alone were not sin enough) but on both Smart TVs and Xbox, the only two places I've bothered testing, going over the \"back\" arrow to get to the tiny credits crashes them all together, like they're punishing you for even questioning their wisdom. How *dare* you try to find out who the best boy is.\n\nAnd just so Disney+ doesn't escape here, when I was watching season 2 of Andor last year their title images for next episodes which pop up unprompted over the credits \\*included spoilers\\*. If anyone has the address for the person who did that, stick it in the comments, I just wanna talk.\n\nI am quite unreasonably mad about this and I don't expect them to change how they do it, but boy I’d sure take an option in the settings, off by default no doubt, that just says “respect the goddamn films you dorks” with a little checkbox.",
        "upvotes": 13606,
        "comments": 666,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1JYjU0En29bA4jR9H3v2pI29aSl_APaiJMwZe3-3Hao.jpeg?auto=webp&amp;s=75fade71db8b34b520843532e2a3b33f4b1df843"
        },
        "permalink": "/r/movies/comments/1q5r9e2/streaming_services_shrinking_credits_to_throw_ads/"
    },
    {
        "id": "1q659mw",
        "author": "cmaia1503",
        "title": "David Harbour Exits Tony Gilroy’s Searchlight Drama ‘Behemoth!’",
        "content": "",
        "upvotes": 1424,
        "comments": 277,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kSvxuDtQ5Y0BWCvgFO9kZiJo2fJgDt7fp8vhe1zDcPo.jpeg?auto=webp&amp;s=d630fe8263adf93018a6b4156a3f2b5a4661f53c"
        },
        "permalink": "/r/movies/comments/1q659mw/david_harbour_exits_tony_gilroys_searchlight/"
    },
    {
        "id": "1q69ztx",
        "author": "Wonder-Lad-2Mad",
        "title": "Movies that can be described as: \"watch this actor progresively lose their mind over the course of 2 houres\"",
        "content": "The type that relies on an actor/actress getting more and more paranoide, unhinged and stressed and is basically an excuse to watch them act more and more looney until they're completely nuts lmao.\n\n\nRecently I've watched an Scott Adkins movie that was recommended to me here, actually. And they were right cause it absolutely rules. It's called Avengement (2019) and it's bascially one hour and thirty minutes of watching Scott Adkins go to prison, lose his fucking mind and turn into fucking Bane from Batman lmao. \n\n\n\nFor a more recent example I'm also gonna shout out One Battle After Another (2025) both Leo and Sean Penn's character completely melt down over the course of the movie.",
        "upvotes": 492,
        "comments": 978,
        "media": null,
        "permalink": "/r/movies/comments/1q69ztx/movies_that_can_be_described_as_watch_this_actor/"
    },
    {
        "id": "1q6i2va",
        "author": "chespiotta",
        "title": "'War Machine' Starring Alan Ritchson is Coming to Netflix on March 6, 2026",
        "content": "",
        "upvotes": 139,
        "comments": 49,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Nlg-XVJEzQMD2vYT-SgWb0Q9EABCR5ust75E1fg6E7Y.jpeg?auto=webp&amp;s=8bd095169942e6a6b38b1bc198db9d3c3210b1b2"
        },
        "permalink": "/r/movies/comments/1q6i2va/war_machine_starring_alan_ritchson_is_coming_to/"
    },
    {
        "id": "1q63f92",
        "author": "phantom_avenger",
        "title": "The older I get, the more I relate to Paul Rudd’s character in “Knocked Up” (2007), when Leslie Mann’s character confronts him in the Fantasy Baseball League scene",
        "content": "As adults we sometimes just need to take time away from our loved ones, and would like that space through alone time in order to maintain some stability! It’s nothing personal, there are just some things that we like to do on our own, where we have this weird feeling where it doesn’t feel as enjoyable when someone else is involved!\n\nYeah, him lying about what he does was a problem. But as he stated in the scene, he knows her well enough to know (or just assumes the worst outcome from his own end) that she would get mad that he doesn’t want her to be apart of the things he does alone. Also she calls him wanting to hangout with his friends more than spending time with his family is worse than cheating, and that him not doing things with her like going to see a Spider-Man movie together is “mean”.\n\nWhen we have so much stuff going on in our lives that we need to tackle like with work, family along with other responsibilities on our plate. Alone time is just really helpful where we need a break from it all.\n\nEDIT: I just want to clarify that I don’t think that his character was 100% in the right in that scene. His desire for alone time is relatable, but the way he handled it was wrong, so no I’m not defending his lying! Communicating your values with your partner and making sure you’re on the same page is very important.\n\nIt’s wild to me how people on the internet seem to think that understanding where someone is coming from, is equivalent to thinking they’re also in the right.",
        "upvotes": 1168,
        "comments": 243,
        "media": null,
        "permalink": "/r/movies/comments/1q63f92/the_older_i_get_the_more_i_relate_to_paul_rudds/"
    },
    {
        "id": "1q64zor",
        "author": "mooffgideon",
        "title": "The People’s Joker is coming to Tubi on January 21",
        "content": "",
        "upvotes": 928,
        "comments": 81,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QDg6HQiz-eHVo8MpxTqWJndS0oTCGd0EAJwq4hZtCXA.jpeg?auto=webp&amp;s=974da59763ec42f445c3c3460869cdc9050fe4e9"
        },
        "permalink": "/r/movies/comments/1q64zor/the_peoples_joker_is_coming_to_tubi_on_january_21/"
    },
    {
        "id": "1q6afax",
        "author": "G_Marius_the_jabroni",
        "title": "Wesley Snipes (Simon Phoenix) played such an amazing bad-guy in \"Demolition Man\" (1993).",
        "content": "I absolutely love [his character](https://pbs.twimg.com/media/EpXtHvyW8AYYn--.jpg). I watched this movie more times than in care to admit when I was a youngster. It is without a doubt one of my favorite 90's action movies ever. Recently rewatched it, and I still think [Wesley Snipes played](https://youtu.be/rjau9YWiUnU) one of the most ruthless, and hard-core movie antagonists of all 90's action movies. Him and Sylvester Stallone were at the peak of their games in this movie, and I will always love throwing this movie on and being transported back to my childhood. Such a great flick.",
        "upvotes": 358,
        "comments": 67,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/o6Pi7jBAKUUELoRLwzeyJYcXoX7SL_7PEWwxZpPG6VI.jpeg?auto=webp&amp;s=c9a1f73f3e3ad86cbc82c3643a2f570efaa7efba"
        },
        "permalink": "/r/movies/comments/1q6afax/wesley_snipes_simon_phoenix_played_such_an/"
    },
    {
        "id": "1q6h902",
        "author": "BunyipPouch",
        "title": "IMAX Closes Out 2025 With $1.28 Billion At Global Box Office, Up 40% Over 2024 And Its Best Year Ever",
        "content": "",
        "upvotes": 103,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OswbdW9VlxgdBcw-FajSzJV_CRF0hsmNMfX5SBfsOec.jpeg?auto=webp&amp;s=d8860dab531389f02fdc2213442e3d8a9908c78f"
        },
        "permalink": "/r/movies/comments/1q6h902/imax_closes_out_2025_with_128_billion_at_global/"
    },
    {
        "id": "1q5oyk8",
        "author": "MarvelsGrantMan136",
        "title": "‘The Batman Part II’: Sebastian Stan In Talks For Role Opposite Robert Pattinson In Sequel",
        "content": "",
        "upvotes": 4737,
        "comments": 618,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/uxzJWO5ltzsHvbKPe0IXvL8aoLV6eehRzNFdHbk_1dY.jpeg?auto=webp&amp;s=9638534a817bcf799cf43ce69f4887f796f661f6"
        },
        "permalink": "/r/movies/comments/1q5oyk8/the_batman_part_ii_sebastian_stan_in_talks_for/"
    },
    {
        "id": "1q6a390",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for A24’s ‘Undertone’ - Follows a paranormal podcast host who returns home to care for her dying mother. Thereafter, she begins receiving recordings from a married couple plagued by strange noises in their house, pulling her into a spiral of fear and paranoia.",
        "content": "",
        "upvotes": 287,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5rhqdwc42wbg1.jpeg?auto=webp&amp;s=f216d247faded05622621201342b3632862ea1a9"
        },
        "permalink": "/r/movies/comments/1q6a390/official_poster_for_a24s_undertone_follows_a/"
    },
    {
        "id": "1q5jcpj",
        "author": "ICumCoffee",
        "title": "Avengers: Doomsday | X-Men Teaser",
        "content": "",
        "upvotes": 9551,
        "comments": 2354,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ndnd6nLJMWi4_Cnn604fUIrktr7I5KKNQS4dnHPVjGI.jpeg?auto=webp&amp;s=6dd8b16265cbc701096a112a5ab1c5461863018a"
        },
        "permalink": "/r/movies/comments/1q5jcpj/avengers_doomsday_xmen_teaser/"
    },
    {
        "id": "1q67hhn",
        "author": "thinkB4WeSpeak",
        "title": "Animation Guild Scores Triple Win as DreamWorks, Netflix and ‘Ted’ Workers Vote to Unionize",
        "content": "",
        "upvotes": 288,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mSUh-vxvBDv6grxRt0NdbhZ6cDzVwXac_7vb5shWxVU.jpeg?auto=webp&amp;s=71db4c498d3edb9dd98ed19fddcd4259e0b25540"
        },
        "permalink": "/r/movies/comments/1q67hhn/animation_guild_scores_triple_win_as_dreamworks/"
    },
    {
        "id": "1q5y8gm",
        "author": "IvyGold",
        "title": "The Surprisingly Profound History Lesson That Is 'Clue'",
        "content": "",
        "upvotes": 630,
        "comments": 114,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/eMSOaBzQYZoG4IFgCtGxxlGAsI4x3xnp-k99KTB18Kw.jpeg?auto=webp&amp;s=cac8e7062ef6d548282694c2cb175d6a586b5645"
        },
        "permalink": "/r/movies/comments/1q5y8gm/the_surprisingly_profound_history_lesson_that_is/"
    },
    {
        "id": "1q5rlmm",
        "author": "Task_Force-191",
        "title": "New Poster for 'Whistle' starring Dafne Keen, Nick Frost - A misfit group of unwitting high school students stumble upon a cursed object, an ancient Aztec Death Whistle. They discover that blowing the whistle and the terrifying sound it emits will summon their future deaths to hunt them down",
        "content": "",
        "upvotes": 1258,
        "comments": 186,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8dfoiqbi1sbg1.jpeg?auto=webp&amp;s=180680685656f0f8923e17e092983a0d245887c6"
        },
        "permalink": "/r/movies/comments/1q5rlmm/new_poster_for_whistle_starring_dafne_keen_nick/"
    },
    {
        "id": "1q6bg6q",
        "author": "StayQuick5128",
        "title": "Why Star Wars isn't \"The Legend\" in China: Perspectives from a fan who grew up with the Sequel Trilogy",
        "content": " just realized it’s been 10 years since The Force Awakens was released in China (Jan 2016). I remember watching it during my winter break when I was just a 7th grader in China. Now, I’m about to graduate from university.\n\nOver these ten years, I’ve managed to watch every single Star Wars movie, but I’ve always noticed a huge gap: While the world goes crazy for Star Wars, it remains a niche interest in China.\n\nAs a local fan, here are my thoughts on why:\n\n1.The \"Latecomer\" Disadvantage: This is the biggest factor. When A New Hope blew everyone's minds in 1977, China was in a completely different era. We missed the \"Big Bang\" of Star Wars. By the time it officially entered the Chinese market, we were already being flooded with CGI-heavy blockbusters like Transformers and the MCU. We don't have that \"childhood nostalgia\" or \"cultural DNA\" that Western fans have.\n\n2.Space Opera vs. Hard Sci-Fi: For many Chinese audiences, the \"knights, princesses, and feudal bloodlines\" trope feels more like a Western fantasy story set in space rather than \"futuristic sci-fi.\" Without the emotional bond to the Skywalker legacy, the \"I am your father\" moments don't hit as hard.\n\n3.High Barrier to Entry: To truly enjoy the sequels or the Disney+ shows, you basically need to have watched the previous six films. For a casual moviegoer in China, that feels like \"homework\" rather than entertainment.\n\nI’m curious to hear from you guys: Do you think Star Wars will ever have a \"second chance\" in markets like China? Or is the cultural gap and the lack of early exposure too wide to bridge?\n\nLooking forward to hearing your thoughts! ",
        "upvotes": 71,
        "comments": 77,
        "media": null,
        "permalink": "/r/movies/comments/1q6bg6q/why_star_wars_isnt_the_legend_in_china/"
    },
    {
        "id": "1q5jdyb",
        "author": "MarvelsGrantMan136",
        "title": "The Death of Robin Hood | Official Trailer | A24",
        "content": "",
        "upvotes": 3015,
        "comments": 748,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OlO8F8y9n3uJ_T8SnIBw0W_7Ot2_1Iz64_foeNGVb5E.jpeg?auto=webp&amp;s=8893c089f5a5de4c03484d746c92a4b0568f6798"
        },
        "permalink": "/r/movies/comments/1q5jdyb/the_death_of_robin_hood_official_trailer_a24/"
    },
    {
        "id": "1q66pg1",
        "author": "JoeZocktGames",
        "title": "The Raid 2 (2014) Warehouse scene | Dir. Gareth Evans",
        "content": "",
        "upvotes": 141,
        "comments": 41,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/l78gjryt2vbg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1q66pg1/the_raid_2_2014_warehouse_scene_dir_gareth_evans/"
    },
    {
        "id": "1q5j582",
        "author": "Sean-Perth",
        "title": "What is your all-time favourite burn from a movie review?",
        "content": "Obviously, we're all here because we love movies. However, I think a key part of that experience is the petty-yet-undeniably-righteous thrill of seeing a critic or fan tear into a truly terrible flick. Negative? Granted. Often a thing of beauty? Definitely.\n\nMy favourite, and a contender for greatest of all time, is this autopsy of Steven Seagal's *Contract to Kill:*\n\n&gt;Seagal...walks stiffly and very slowly. It is possible that he never once bends at the waist. Most of the movie, he spends sitting down or walking (again, slowly) up and down flights of stairs. There is a love scene - and, Jesus, what a love scene. His fully dressed body is lowered over a naked woman like a drawbridge.\n\nhttps://www.avclub.com/contract-to-kill-isn-t-just-bad-it-s-steven-seagal-bad-1798189772\n\nSo, movie fans...what reviews live in your head rent-free?\n\nEDIT: So the number one thing I'm taking from the replies is that Roger Ebert was the John Wick of film criticism; a man of focus, commitment and sheer will. \n\n*\"Baba Yaga...\"*\n",
        "upvotes": 2429,
        "comments": 681,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/r9AS2O67EbsupWoe7KbpC0IJsymYp3rbdsZ3rBbN7ns.jpeg?auto=webp&amp;s=4ee890ede00962c83194db424ac2dd7add9dd8a9"
        },
        "permalink": "/r/movies/comments/1q5j582/what_is_your_alltime_favourite_burn_from_a_movie/"
    },
    {
        "id": "1q5l21j",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for Sam Raimi's 'Send Help' Starring Rachel McAdams &amp; Dylan O'Brien - Two colleagues become stranded on a deserted island, the only survivors of a plane crash. On the island, they must overcome past grievances and work together to survive",
        "content": "",
        "upvotes": 1400,
        "comments": 134,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/bd8a7oh5vqbg1.jpeg?auto=webp&amp;s=748c2aed4b436c4fd1b8b6e51fa15746c49b0141"
        },
        "permalink": "/r/movies/comments/1q5l21j/new_poster_for_sam_raimis_send_help_starring/"
    },
    {
        "id": "1q68jda",
        "author": "OTribal_chief",
        "title": "Is there a most co-incidental movie to real life events than The China Syndrome?",
        "content": "The China Syndrome (1979) starring Jane Fonda &amp; Jack Lemmon was a movie about a nuclear power plant that suffers a turbine trip and radiation leaks out. \n\nUpon release it was met with backlash from the nuclear power industry as sheer fiction and character assasination of an entire industry \n\n12 days after the release The Three Mile nuclear accident happens. certain things in the movie and the real incident were similar. \n\nBoth incidents started off the same way, control staff misread instruments, there was a cover up that happens\n\nWhat other films released close to a real life event that was unplanned?",
        "upvotes": 76,
        "comments": 42,
        "media": null,
        "permalink": "/r/movies/comments/1q68jda/is_there_a_most_coincidental_movie_to_real_life/"
    },
    {
        "id": "1q5tyv8",
        "author": "JonasKahnwald11",
        "title": "Official Poster for 'Hamlet' - Starring Riz Ahmed, Morfydd Clark and Joe Alwyn",
        "content": "",
        "upvotes": 500,
        "comments": 143,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vselkgp6gsbg1.png?auto=webp&amp;s=346fdb1081b47d58c7ef4629c1478cb44a9b76d9"
        },
        "permalink": "/r/movies/comments/1q5tyv8/official_poster_for_hamlet_starring_riz_ahmed/"
    },
    {
        "id": "1q6ix56",
        "author": "BunyipPouch",
        "title": "A24's 'The Undertone' - Teaser Video",
        "content": "",
        "upvotes": 16,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ham-W7kn4Gh9YWzN2zJ7MYByvb3fO_0O5SI3gpwI8gE.jpeg?auto=webp&amp;s=fbd24f055c543f0e6b92adb2dac144ea219410be"
        },
        "permalink": "/r/movies/comments/1q6ix56/a24s_the_undertone_teaser_video/"
    },
    {
        "id": "1q5hfh2",
        "author": "JonasKahnwald11",
        "title": "Official Poster for Alice Winocour’s 'Coutures' - Starring Angelina Jolie.",
        "content": "Trailer: [https://youtu.be/lSw01dbUFXg](https://youtu.be/lSw01dbUFXg) ",
        "upvotes": 1921,
        "comments": 185,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jzxmqyui3qbg1.png?auto=webp&amp;s=6b541463ae5cf596be216544f60e530c19c97d06"
        },
        "permalink": "/r/movies/comments/1q5hfh2/official_poster_for_alice_winocours_coutures/"
    },
    {
        "id": "1q6g50t",
        "author": "darth_vader39",
        "title": "THE TESTAMENT OF ANN LEE | Official Trailer | Searchlight Pictures",
        "content": "",
        "upvotes": 16,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ikqE943wDcjpUYwRL3Tb7jO8HCixKmnC69yz0HFoszs.jpeg?auto=webp&amp;s=65f727c695eff8ca04896ca5cbf5b3c5e3044715"
        },
        "permalink": "/r/movies/comments/1q6g50t/the_testament_of_ann_lee_official_trailer/"
    }
]