[
    {
        "id": "1mzmca0",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 16,
        "comments": 903,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mzmca0/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1mz82uq",
        "author": "soccer-stats",
        "title": "Post Match Stats: Real Oviedo vs Real Madrid",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1mz82uq)",
        "upvotes": 182,
        "comments": 268,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mz82uq/post_match_stats_real_oviedo_vs_real_madrid/"
    },
    {
        "id": "1n184fy",
        "author": "NamanGeneral",
        "title": "Dean Huijsen Explains his eyes and confirms that he's not high",
        "content": "",
        "upvotes": 667,
        "comments": 31,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/whn71uwjuhlf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1n184fy/dean_huijsen_explains_his_eyes_and_confirms_that/"
    },
    {
        "id": "1n13f4t",
        "author": "Optimal_Lie7824",
        "title": "Vini was racially abused from the moment he stepped into a stadium he had never played in before and against a team he had never faced. His response? Smiles, goal and assist. He was born to play for Madrid!",
        "content": "Disgusting how even our fanbase here tried (and still does) to make Vini look like the bad guy.\n\nOviedo fans booed him even when he was on the bench and was shown on the big screen too... unbelievable, but hey, hate never comes from above and Vini now seems to understand that.",
        "upvotes": 1098,
        "comments": 70,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zlgwxzmsmglf1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1n13f4t/vini_was_racially_abused_from_the_moment_he/"
    },
    {
        "id": "1n1j5bv",
        "author": "123kallem",
        "title": "Fabrizio: The deal for Dani Ceballos to Olympique Marseille is OFF",
        "content": "",
        "upvotes": 84,
        "comments": 33,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n1j5bv/fabrizio_the_deal_for_dani_ceballos_to_olympique/"
    },
    {
        "id": "1n147ei",
        "author": "menu07",
        "title": "I love when viny makes these plays",
        "content": "",
        "upvotes": 611,
        "comments": 26,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/obbw1fzzuglf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1n147ei/i_love_when_viny_makes_these_plays/"
    },
    {
        "id": "1n18djo",
        "author": "Few_Analyst_8216",
        "title": "Most chances created in Europe’s top five leagues in 2025/26",
        "content": "",
        "upvotes": 255,
        "comments": 31,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5109kpa7xhlf1.jpeg?auto=webp&amp;s=50022be6a7c03fc2f5cca8957c30517939c1b5fd"
        },
        "permalink": "/r/realmadrid/comments/1n18djo/most_chances_created_in_europes_top_five_leagues/"
    },
    {
        "id": "1n0q53c",
        "author": "Bunchdawg",
        "title": "I'm not sure how to feel about this",
        "content": "I mean, we've always had superstars, but I just hope we can find the net when Kylian has to be out. It also reminds me of what Luis Enrique said recently about preferring 3 players with 15+ than 1 with 45. More like what we had the last time we won Champions. ",
        "upvotes": 1332,
        "comments": 171,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vf8kuyeq1elf1.png?auto=webp&amp;s=2cbca9d23a5459e3634044cc19f10c0fd1739246"
        },
        "permalink": "/r/realmadrid/comments/1n0q53c/im_not_sure_how_to_feel_about_this/"
    },
    {
        "id": "1n1coo0",
        "author": "ManuMora98",
        "title": "[Basket - Official] Izan Almansa signs with Real Madrid until 2029",
        "content": "Real Madrid CF has reached an agreement with Izan Almansa, a power forward who played last season for the Perth Wildcats (NBL, Australia), by which the player remains linked to the club until June 30, 2029.\n\nAlmansa, who has already debuted with the senior Spanish team, has a brilliant record in his youth categories, with three medals: gold in the 2022 U-18 European Championship in Turkey, gold in the 2023 U-19 World Cup in Hungary and silver at the 2022 U-17 World Cup in Spain, and was chosen MVP in each of these championships.\n\nReal Madrid youth player for two seasons, Izan Almansa returns at the age of 20 to our club, where he won the Spanish Cadet Championship in 2021.",
        "upvotes": 29,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TFcxTGJ-4nfEVc2nRbk9ES9WefEG2eE0pCcAz588Nao.png?auto=webp&amp;s=72a90616cda61c2524537adf0501d21be4b98aff"
        },
        "permalink": "/r/realmadrid/comments/1n1coo0/basket_official_izan_almansa_signs_with_real/"
    },
    {
        "id": "1n1keee",
        "author": "More-Judgment-9253",
        "title": "Joan Martinez pre season compilation",
        "content": "If he stays fit and starts playing with the first team towards the end of this season then we might  not need to sign any CB's next season if Jacobo returns because then we'll have both of them and then there's aguado as well. ",
        "upvotes": 10,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6mjzmsl00llf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1n1keee/joan_martinez_pre_season_compilation/"
    },
    {
        "id": "1n114wy",
        "author": "KjOnReddit1010",
        "title": "🚨🔵⚪️ The agreement between Real Madrid and Olympique Marseille for Dani Ceballos is very close now after new talks in last 5h.\n\nDetails to sort on loan with obligation to buy… and then OM hope to seal Ceballos deal very soon.",
        "content": "",
        "upvotes": 196,
        "comments": 81,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n114wy/the_agreement_between_real_madrid_and_olympique/"
    },
    {
        "id": "1n0y7w9",
        "author": "ManuMora98",
        "title": "[@RMadrid1902new on X] More tests of the new vídeo mapping system",
        "content": "",
        "upvotes": 216,
        "comments": 13,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n0y7w9/rmadrid1902new_on_x_more_tests_of_the_new_vídeo/"
    },
    {
        "id": "1n0mejs",
        "author": "AdVaanced77",
        "title": "The Vinicius jr cycle",
        "content": "",
        "upvotes": 730,
        "comments": 83,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/frvn9j0icdlf1.jpeg?auto=webp&amp;s=d80070e7b70384876be48f09fb4c9943456aae5c"
        },
        "permalink": "/r/realmadrid/comments/1n0mejs/the_vinicius_jr_cycle/"
    },
    {
        "id": "1n0zjgu",
        "author": "Midnight_Thoughts77",
        "title": "The Man, The Myth, The Legend- Ziou.. This picture is goated..",
        "content": "I can’t imagine a more perfect image of Real Madrid and Zidane than this one. This is perfection.\n\nFirst, let's start with the kit. Plain white, not stained by any sponsor (sorry I am a purist), retro look with collars for our centenary year, full sleeve- absolutely timeless. Love it. Then, the stage itself. it is the champions league final- the competition that best defines us as a club like no other. We'll never be satisfied even if we win 20 more than everyone else.\n\nNext, the man who scored this- Zizou. The marquee signing, the highest transfer in the world at this moment. The fact that he would later return as manager and lead us to glory makes it all the more poetic that he was the one to score this goal. The love and gratitude he has shown fopr the club over the years is immense.\n\nAnd finally, the goal itself. Roberto Carlos sends a hopeful cross at the edge of the box. The ball rises into the night so high up, hangs impossibly long, and begins to fall behind Zidane. Zizou waits- still, patient and calm just like the person he is. No defender rushes, no challenge comes. It is as though time itself has paused for him and he knows it. Then—one perfect swing of his weaker foot no less and the contact is so well timed. Bam. Golazooo.\n\nDimitar Berbatov later said he got the perfect view of the goal and he just wanted to clap even though he was playing for the opposition team. And really, can you blame him? Who wouldn't?\n\nThank you Zizou, you are a gem. So thankful that Florentino passed that napkin to Zizou in the UCL awards function with the message of Real Madrid interest and Zizou said yes without a second thought.",
        "upvotes": 130,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/dpryswattflf1.jpeg?auto=webp&amp;s=a5f0980d0f1094bec38a3941f0bdbeababdffd4b"
        },
        "permalink": "/r/realmadrid/comments/1n0zjgu/the_man_the_myth_the_legend_ziou_this_picture_is/"
    },
    {
        "id": "1n0qasj",
        "author": "FearlessWasFounded",
        "title": "Lucas Vasquez has been tagged in posts about him joining Bayer Leverkusen and even posted stories about it but still hasn't changed his bio🥹",
        "content": "",
        "upvotes": 357,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5tkb85b33elf1.png?auto=webp&amp;s=bc25cd4040399d9dce83aae4e9a2447978ce32f8"
        },
        "permalink": "/r/realmadrid/comments/1n0qasj/lucas_vasquez_has_been_tagged_in_posts_about_him/"
    },
    {
        "id": "1n1mc2p",
        "author": "KjOnReddit1010",
        "title": "🚨🇧🇷 Manchester City have informed Tottenham today that are not changing their position on Savinho.\n\n#MCFC have no intention to let him go, not even for fee over €70m — seen as key player for the season and for future.\n\nThis also blocks any chance of Rodrygo to Man City.",
        "content": "",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n1mc2p/manchester_city_have_informed_tottenham_today/"
    },
    {
        "id": "1n0sglv",
        "author": "IAM-THEONE13R",
        "title": "Jeremy De Leon 🇵🇷 (lucky charm) on loan to Hercules Fc",
        "content": "  Real Madrid Castilla (the reserve team) sent Jeremy de Leon (lucky charm guy) to Hercules de Alicante (a third division team) for the 2025-26 season (basically a year)\n\n\n  Hopefully he'll get better there I guess. He was probably sent there due to his injuries and his absence to football. This'll probably be good for him to get better after being out for so long. I also read he just wasn't in the teams plans for Real Madrid Castilla. I don't know, he kind of represents Puerto Rico in football so he better tighten tf up 😤\n\n\n  His first match for them will probably be around mid September when he's ready to play. He's already done some training for the team, so yeah hopefully he'll be good.\n ",
        "upvotes": 110,
        "comments": 7,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n0sglv/jeremy_de_leon_lucky_charm_on_loan_to_hercules_fc/"
    },
    {
        "id": "1n0sg6c",
        "author": "Shelly_Beats23",
        "title": "Xabi getting our forwards to press and tracking back isn't talked about enough",
        "content": "I know its only two games but it should be said how Xabi got our stars to press/track back, i know a lot of us were skeptical he couldnt convince them to do it especially mbappe, the past two he was pressing and tracking back and it wasnt just a one off thing, he did it multiple times these two games he even got a yellow card for challenge. If they can do it consistenly through the whole season especially in big games, the team will be a lot better for it.",
        "upvotes": 100,
        "comments": 20,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n0sg6c/xabi_getting_our_forwards_to_press_and_tracking/"
    },
    {
        "id": "1n0r176",
        "author": "rasenxv",
        "title": "Mbappe's positioning as number 9",
        "content": "I have seen a lot of people asking Mbappe to essentially stay as a box striker, staying central and upfront in between the two posts. He does this at times, but also drifts around to try and link play or connect with teammates, or take the ball and drive.\n\nIn my opinion, forcing Mbappe to play as a box striker negates the reason for getting a player like him, Mbappe is one of the most dynamic forwards not only in world football now but of the last 20-25 years. He is dangerous everywhere in the final third. His 3 goals so far this season show that, winning a penalty with a dribble from the right side, spinning a defender in the middle and scoring vs Oviedo, and finishing off a transition on the left. He literally scored over 7 goals from outside of the box last season, similar to Valverde, the highest number in Europe. Limiting him to a box striker negates a lot of that, and he isn't a hold up play striker who plays with his back to goal like Benzema or Morata, Mbappe is at his best in space, or with the ball at his feet. You have arguably the best player in the world, when has a team ever had the best player in the world and not play to his strengths.\n\nThe two main problems this gives Madrid is:\n\n1. Whos in the box if hes drifting around, against teams who just sit, a box presence or target in the box is needed to occupy defenders and give the wingers someone to aim crosses at\n2. Vinicius Jr and Mbappe both excel from the same positions on the pitch, the left half space. Also Vinicius impact decreases when he doesn't have someone to aim for and play off centrally. Both Vini and Mbappe play better with someone to play off of (Link player, e.g Jude 23/24, Benzema)\n\nOne solution to both of these problems that not a lot of people brings up is Jude Bellingham. When Mbappe drifts out, Jude Bellingham is a perfect box presence and can rotate with Mbappe to play inbetween the defenders. He is a brilliant link up player, physical, great in the air and in the box, and can hold the ball well. The main problem last year when Jude did this was there wasn't enough technical players in midfield in my opinion, so when he went up, sometimes Madrid struggled to create in midfield, but with the addition of Arda (and hopefully Alex Arnold gets back to his level), then that creation is there, so in the times where Jude goes in the box (with or without Kylian), there is still creativity in midfield.\n\nFor me, Jude Bellingham is the key to bring balance back into the side, creation from the left can come from Vini/Mbappe/Carreras, creation from middle from Arda/Jude and Dean, and from the right hopefully Trent/Arda/Fede. This is against the teams who defend deep, Madrid struggle against these teams. Rodrygo is fantastic at link up and is a different profile than Vini, he links well with Kylian and Jude. Question now is can Vini get back to his level, improve the link up play with Kylian, his cameo vs Oviedo hopefully is a step in the right direction.",
        "upvotes": 39,
        "comments": 44,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n0r176/mbappes_positioning_as_number_9/"
    },
    {
        "id": "1n0ynjr",
        "author": "Tat0Man",
        "title": "Madridista Premium tix",
        "content": "I'll be in Madrid in September and want to watch the Espaneyol game in Santiago Bernabeu.\nI got the Madridista Premium so that I can hopefully get the tickets earlier for myself and my partner. \nBut I can't seem to buy two seats side by side. It's more like 2 at two different sections.\nIs that how it's supposed to be or am I messing up somewhere?  \n\n\n*\nEDIT: I'll add one more question to this, what are our chances of scoring side by side tickets if both of us have Madridista Premium.\nI've been watching Madrid play since I was a kid and I'm not sure I'll ever have a chance like this again. And i think this would be the perfect time to get my partner on the Real Madrid train 😁",
        "upvotes": 12,
        "comments": 10,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n0ynjr/madridista_premium_tix/"
    },
    {
        "id": "1n0577u",
        "author": "KjOnReddit1010",
        "title": "🚨🔴⚫️ EXCLUSIVE: Bayer Leverkusen surprise signing at right back could be… Lucas Vázquez!\n\nTalks are taking place for former Real Madrid player who’s been approached in the recent hours.\n\nDecision up to Lucas Vázquez. If he accepts, the deal can be sealed soon 🇪🇸",
        "content": "",
        "upvotes": 372,
        "comments": 32,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n0577u/exclusive_bayer_leverkusen_surprise_signing_at/"
    },
    {
        "id": "1n05x0k",
        "author": "andrewthenikka1",
        "title": "🚨💣 EXCLUSIVE: Lucas Vázquez to Bayer Leverkusen, here we go! 🔴⚫️. Deal agreed with former Real Madrid right back who joins Bayer as free agent. Medical already done secretly and deal to be signed on Tuesday. Exclusive story from late night… and deal done. 🔐🇪🇸",
        "content": "",
        "upvotes": 282,
        "comments": 25,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n05x0k/exclusive_lucas_vázquez_to_bayer_leverkusen_here/"
    },
    {
        "id": "1mznwah",
        "author": "Accomplished_Mark572",
        "title": "Coldest photo ever taken!",
        "content": "",
        "upvotes": 2067,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/uifwlxd7i5lf1.jpeg?auto=webp&amp;s=90eb4f2352e2a3d844e6c24f527d6ad39a062d44"
        },
        "permalink": "/r/realmadrid/comments/1mznwah/coldest_photo_ever_taken/"
    },
    {
        "id": "1mzrymf",
        "author": "o6ohunter",
        "title": "Rodrygo’s reaction after being benched",
        "content": "",
        "upvotes": 1020,
        "comments": 155,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/80if21u4e6lf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1mzrymf/rodrygos_reaction_after_being_benched/"
    },
    {
        "id": "1mzsrbn",
        "author": "o6ohunter",
        "title": "Brahim having a little fun on Mbappé’s phone",
        "content": "",
        "upvotes": 613,
        "comments": 31,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1nr8sy1lj6lf1.jpeg?auto=webp&amp;s=dd38f34337d531f750dfd16d360a94cf2440e14e"
        },
        "permalink": "/r/realmadrid/comments/1mzsrbn/brahim_having_a_little_fun_on_mbappés_phone/"
    },
    {
        "id": "1mzztbs",
        "author": "statsgenius",
        "title": "Arda Güler is the first player to create 10 chances in Europe's top five leagues in 2025/26.",
        "content": "Since 2016/17, he's just one of three Real Madrid players to create 8+ chances in a LaLiga game after Toni Kroos and Luka Modric. Last season he was hitting 2.88 key passes per 90 in limited minutes (99th percentile stuff) and now he's tracking at 5.0 chances per 90 this season. When you consider only Kroos and Modrić have created more chances historically for us among midfielders, it feels like we might be watching something special develop right in front of us.\n\n\n\nCould this finally be his breakout year where he becomes undroppable? And how do you see him fitting into our long-term midfield plans alongside the other young talents?",
        "upvotes": 201,
        "comments": 39,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mzztbs/arda_güler_is_the_first_player_to_create_10/"
    },
    {
        "id": "1mzw1tf",
        "author": "xggq",
        "title": "Vinicius JR vs Real Oviedo",
        "content": "",
        "upvotes": 239,
        "comments": 20,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/n64ukjxt47lf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1mzw1tf/vinicius_jr_vs_real_oviedo/"
    },
    {
        "id": "1mztft1",
        "author": "DonuandDeca",
        "title": "\"A look into Vini's nightmares on the bench\"",
        "content": "Original video by Hamid Sahari on Youtube: [original video](https://youtube.com/shorts/POCV6u3zp84?si=4TSIPQTNXIF-foo9)\n\n  \nHopefully ALL of our players can have the ambition and determination Vini has.\n\n",
        "upvotes": 298,
        "comments": 19,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/iegnvklbn6lf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1mztft1/a_look_into_vinis_nightmares_on_the_bench/"
    },
    {
        "id": "1n0042q",
        "author": "MHBosteer12",
        "title": "Ancelotti snubs Vinicius, Rodrygo, Militao, and Endrick from Brazil squad",
        "content": "",
        "upvotes": 89,
        "comments": 51,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n0042q/ancelotti_snubs_vinicius_rodrygo_militao_and/"
    },
    {
        "id": "1mzi014",
        "author": "zains43",
        "title": "when you finally see vini passing the ball to mbappe instead of going for the screamer",
        "content": "",
        "upvotes": 961,
        "comments": 51,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9u66ozs2p3lf1.jpeg?auto=webp&amp;s=558488b248fd991b47afbec2ac51fe5a264bbe94"
        },
        "permalink": "/r/realmadrid/comments/1mzi014/when_you_finally_see_vini_passing_the_ball_to/"
    },
    {
        "id": "1mz8ke5",
        "author": "DonuandDeca",
        "title": "We might need to start talking about this...",
        "content": "Honestly he's so good bro like what 😭🙏",
        "upvotes": 2674,
        "comments": 77,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/yq462ueuf1lf1.png?auto=webp&amp;s=92056dd3ca5a58bacf529f2e5a3f1c61f9410224"
        },
        "permalink": "/r/realmadrid/comments/1mz8ke5/we_might_need_to_start_talking_about_this/"
    },
    {
        "id": "1mzml48",
        "author": "chunchunmaru1129",
        "title": "Our Player ratings against Real Oviedo by Fotmob",
        "content": "",
        "upvotes": 226,
        "comments": 70,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/nkorz6a855lf1.png?auto=webp&amp;s=0887894083b3b6da9927d0aa5bc863f67f2e95ca"
        },
        "permalink": "/r/realmadrid/comments/1mzml48/our_player_ratings_against_real_oviedo_by_fotmob/"
    }
]