[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 48,
        "comments": 148,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mfsbdo",
        "author": "leyy_pink1997",
        "title": "Just finished The Night Agent — surprisingly hooked until the end!",
        "content": "Wasn’t expecting much when I started The Night Agent, just wanted something to play in the background… but wow, I ended up binge-watching the whole season in two nights. Plot twists, action, and a main character that isn’t annoying for once 😂\n\nIt kinda gave me 24 vibes but with a more modern pacing. Some parts were predictable, but overall, it kept me engaged.\n\nAnyone know if Season 2 is confirmed? Or shows with a similar vibe?",
        "upvotes": 14,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mfsbdo/just_finished_the_night_agent_surprisingly_hooked/"
    },
    {
        "id": "1mfcfh4",
        "author": "SoftPois0n",
        "title": "‘Fubar’ Canceled By Netflix After 2 Seasons",
        "content": "",
        "upvotes": 184,
        "comments": 67,
        "media": null,
        "permalink": "/r/netflix/comments/1mfcfh4/fubar_canceled_by_netflix_after_2_seasons/"
    },
    {
        "id": "1mfapqn",
        "author": "cieje",
        "title": "the best phrase on Netflix? \"limit series\"",
        "content": "I'd much rather know beforehand that a show will intentionally have an actual ending, than hoping Netflix decides to renew something.\n\nI was really hoping the contract from the WGA strikes would've included a requirement that a certain % of contacts were multi-year or something. having the writers worried about getting renewed all the time leads to bad writing. and unfinished plots.\n\nedit well, \"limited series\" I'm sure you get it.",
        "upvotes": 45,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1mfapqn/the_best_phrase_on_netflix_limit_series/"
    },
    {
        "id": "1mffkvv",
        "author": "self-fix",
        "title": "KPop Demon Hunters 2 And 3 Are Heading To Netflix, Says Report",
        "content": "",
        "upvotes": 19,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mffkvv/kpop_demon_hunters_2_and_3_are_heading_to_netflix/"
    },
    {
        "id": "1mf3pz6",
        "author": "Careless_Leg_6513",
        "title": "My Oxford Year",
        "content": "Sooo. What is with the guy having a secret disease hiding in every gig he works at, first bridgerton, now this. Lol\nAnd Sofia needs to do some other roles. I feel like all of her movies are kind of the same. The damsel in distress and ends up saving the whole tribe. ",
        "upvotes": 62,
        "comments": 82,
        "media": null,
        "permalink": "/r/netflix/comments/1mf3pz6/my_oxford_year/"
    },
    {
        "id": "1mfuem9",
        "author": "punknatanke",
        "title": "Продолжить просмотр когда появляется?",
        "content": "Доброго вечера. Сколько минут или секунд необходимо просматривать видеоконтент на сервисе для того, чтобы он появился в строке продолжения просмотра? Заранее благодарю за ответ.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mfuem9/продолжить_просмотр_когда_появляется/"
    },
    {
        "id": "1mep55y",
        "author": "Cynthiaaxxxx",
        "title": "A show you stumbled upon with zero expectations but ended up loving",
        "content": "There are times you just press play on something random and then boom, you’re hooked. Wondering what Netflix series or movie took you by surprise in a good way.",
        "upvotes": 474,
        "comments": 1386,
        "media": null,
        "permalink": "/r/netflix/comments/1mep55y/a_show_you_stumbled_upon_with_zero_expectations/"
    },
    {
        "id": "1mffecm",
        "author": "StingVay",
        "title": "Can someone help me find my favorite childhood movie?",
        "content": "When i was a kid i watched an animated movie on netflix that ive tried to find everyhwere but no matter what i search i cant find it so i thought id ask here. From what i remember the premise was something like 3 kids were the \"chose ones\" and sent to go through time or soething like that, and accompanying each of them was a little mythical creature that helped them in their journey, and i remember that the evil person that was trying to stop them also had 3 kids that had little magical beasts, and near the end the plot twist was that the 3 \"evil\" kids were actually the chosen ones and they actually were the ones who had to save the day so they all teamed up and beat the villain. I know its not alot to go off of but thats pretty much all i can remember, if someone knows what im talking about please let me know ive been searching for years!",
        "upvotes": 9,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1mffecm/can_someone_help_me_find_my_favorite_childhood/"
    },
    {
        "id": "1mfquhm",
        "author": "Primary-Mousse-2611",
        "title": "Alone",
        "content": "I have started to live alone, all by my own. In this new place. And now i have some leave for few days, and i have like no idea what to do , i am supperr bored. For reall. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mfquhm/alone/"
    },
    {
        "id": "1mf3cl8",
        "author": "PTsarC",
        "title": "“Too much” was total shite",
        "content": "Here I was thinking it would be a funny “eat pray love” kinda show. With selflove and healing in the spotlight. The type of show you want to see when you’re just feeling down and you need some sort of boost of empowering. \n\nJessica is not too much, she is just childish. Plus, what’s up with the constant sexscene’s? Almost a porn for teens if you tell me. ",
        "upvotes": 29,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1mf3cl8/too_much_was_total_shite/"
    },
    {
        "id": "1mfo2k8",
        "author": "chopsueys",
        "title": "my pc is no longer part of my household",
        "content": "Their anti-multicount policy is becoming totally insane... I'm the only one using this account and I only watch netflix on my pc (not a laptop) or my smartphone. Is their goal to lose as many customers as possible?  \nI'm just going to unsubscribe, I don't know what else to do",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mfo2k8/my_pc_is_no_longer_part_of_my_household/"
    },
    {
        "id": "1mfnyxf",
        "author": "eichtwoouh",
        "title": "Online Watch Together",
        "content": "I was wondering if anyone knows any site or app(windows/android) that my girlfriend and I can use to watch kpop demon hunters together online? If it helps, I have a netflix account. Appreciate any help!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mfnyxf/online_watch_together/"
    },
    {
        "id": "1mfnfs0",
        "author": "Ok_Assistance_6767",
        "title": "Netflix stuck on 99%",
        "content": "When I try to watch movies or series on my lg smart tv every minute the screen freezes and shows 99%. It happens to me on prison break and „Us”. When I try to wait it shows some thing then that they fixed the problem and movie freezes a minute later. I tried deleting and installing Netflix. I tried restarting TV. Btw it works good on a MacBook. It might be something with TV or Netflix on TV. Thanks!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mfnfs0/netflix_stuck_on_99/"
    },
    {
        "id": "1mfjnd3",
        "author": "suru_24",
        "title": "My Oxford Years",
        "content": "Just finished my oxford year on Netflix.\n\nWell!!!! let me give some tea if you are yet to watch.\n\nCorey - omg treat to the eyes. \nSofia - still needs to work on her expressions.\n\nStoryline - who has read the book they know about the ending but, the movie makers made it worse.\nI love the chemistry but after the birthday party, it's like we all are waiting for James to just die.. \nI knew what was coming when started watching yet I ruined my Friday evening.\n 5/10 - for one time watch.\n1/10 - re-watch \n10/10 - Corey's face card!!!",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mfjnd3/my_oxford_years/"
    },
    {
        "id": "1mflypw",
        "author": "javster2",
        "title": "Is the quality better on a PS5 or PC?",
        "content": "I know that the best device for quality streaming is a tv with native app. But if my pc has similar performance to a ps5, which one would have better quality considering both are using the same 4k monitor? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mflypw/is_the_quality_better_on_a_ps5_or_pc/"
    },
    {
        "id": "1mfeap9",
        "author": "An_Obese_American",
        "title": "New update",
        "content": "Are there still categories I can find? I used to go to the categories, and then standup comedy. I feel like a boomer already, why do they update what’s not broken. I scrolled all the way down, and found things like “athletic teen shows”, why is that a category. ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mfeap9/new_update/"
    },
    {
        "id": "1mfiavl",
        "author": "Hizzle3003",
        "title": "Are you still watching??",
        "content": "Does anyone know how to turn this function on?? I somehow turned it off but I want it back!! When you google it all you get is how turn it off. I’ve tried to reverse it but that hasn’t worked.\nIt used to guide me when it was time for bed😂😂",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mfiavl/are_you_still_watching/"
    },
    {
        "id": "1mf41nk",
        "author": "Chinawhite777",
        "title": "Good recommendation if you are a geek like me and like swords and magic (Shadow and Bone)",
        "content": "In my opinion very well written. I don't know if it is underrated. But only found it after ChatGPT recommended series to me. It is luckily not one of those fake series which don't seem natural. This one seems pretty high quality to me.",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mf41nk/good_recommendation_if_you_are_a_geek_like_me_and/"
    },
    {
        "id": "1mfp294",
        "author": "TheMirrorUS",
        "title": "'Major factor' that could influence Amy Bradley case after Netflix docuseries",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mfp294/major_factor_that_could_influence_amy_bradley/"
    },
    {
        "id": "1mfd63x",
        "author": "Beatroot_lover",
        "title": "Netflix isn't loading",
        "content": "Okay so I was tryna watch mlp so ofc I open Netflix on my laptop. Problem is nothings loading. I only seeike the top bar with home, TV shows... Etc. Everything else like on the screen is blank. I go check it in my phone and Netflix works perfectly in there. So idk what's going on. I would try to log out but j can't press anything. I've also tried turning My laptop on and off again. And the problem isn't with wifi since everythjng else works. Perfectly. Also if it helps I'm using Opera gx",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mfd63x/netflix_isnt_loading/"
    },
    {
        "id": "1mfgyny",
        "author": "closetexistentialist",
        "title": "Former Netflix Executive Alleges Gender Bias and Sexual Harassment in Lawsuit",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mfgyny/former_netflix_executive_alleges_gender_bias_and/"
    },
    {
        "id": "1mfgeuu",
        "author": "MsLadybug_theTeacher",
        "title": "Netflix Household Rule Changes?",
        "content": "I know that back in 2023, Netflix was “cracking down on password sharing” by creating all the Household rules. \n\nHowever, I thought that laptops, tablets, and phones were exempt from the Household rules due to the traveling exemptions. (Meaning that since you take these devices traveling, they don’t necessarily fall under the Household rules.)\n\nI use a family member’s account, but I only use it on my laptop or phone. This has worked for me up until today (August 1, 2025). I was watching Netflix just last night on my laptop and last weekend on my phone and I had no issues.\n\nHas anyone else just today/this month started having problems like this? \n\nThe only theory my family has is that Netflix decided to put on further enforcements on their rules as of this month (August 2025), but I haven’t seen anything online to support this theory.",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1mfgeuu/netflix_household_rule_changes/"
    },
    {
        "id": "1mfmjsc",
        "author": "imakashpal",
        "title": "Just deleted Netflix. Mixed feelings but I know it’s the right choice.",
        "content": "Hey everyone,\nI’ve been watching The Walking Dead lately — really got hooked and would watch till 3 AM almost every night. It’s a great show, but somewhere deep down I knew I was losing precious time.\n\nI’m 25 now — this is a crucial time for my career. I work as an SEO and Google Ads expert, and I also have some clients I handle freelance work for. On top of that, I’m preparing for my CAT exams too. I felt guilty that I was spending hours binge-watching when I should be investing that time in building my future.\n\nSo, just now, I uninstalled Netflix. Feels strange because it was my escape at night. But I know I need to focus.\n\nDid anyone else here ever delete Netflix or take a break from binge-watching? How did you deal with the urge to come back? Any tips to stay away and use that time better?\n\nThanks for reading — just wanted to share.",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1mfmjsc/just_deleted_netflix_mixed_feelings_but_i_know/"
    },
    {
        "id": "1meq56g",
        "author": "rohanad1986",
        "title": "'Emily in Paris' actor says he was devastated after being 'fired' from show: 'A tragedy'",
        "content": "",
        "upvotes": 17,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1meq56g/emily_in_paris_actor_says_he_was_devastated_after/"
    },
    {
        "id": "1mfiv7h",
        "author": "catatron2005",
        "title": "Blindspot has to be the weirdest tv show",
        "content": "Like not objectively but it’s all steady cam footage, and it looks like it’s been written in ai. Is this what all of those Netflix shows that you skip past bc it’s the same ai generated slop are like",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mfiv7h/blindspot_has_to_be_the_weirdest_tv_show/"
    },
    {
        "id": "1mf0z97",
        "author": "Warm_Wear_1495",
        "title": "Ad glitches make watching certain scenes technically impossible",
        "content": "Once netflix started forcing ads ive had this issue anytime an ad comes up:\nThe video freezes, stutters, glitches then the ad plays. Once it ends, the video glitches and freezes and stutters then SKIPS FORWARD the video im watching by 15 seconds. If I try to rewind w the skip 10 second button it launches me before the ad, then glitches and brings me back to where it skips forward. I cant even drag the time to during the physical ad, it just glitches me forward. I have missed so many scenes because of this issue, anybody else have this?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mf0z97/ad_glitches_make_watching_certain_scenes/"
    },
    {
        "id": "1mfbbrk",
        "author": "Kevy-Em",
        "title": "Will there be a roast this year?",
        "content": "Last year the Tom Brady roast did so well, I'm hoping there will be another one this year, I'm really hoping Adam Sandler or Eminem will be the next celebrity",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mfbbrk/will_there_be_a_roast_this_year/"
    },
    {
        "id": "1mf5ulx",
        "author": "indiewire",
        "title": "Best New Movies on Netflix August 2025",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mf5ulx/best_new_movies_on_netflix_august_2025/"
    },
    {
        "id": "1mfa8v4",
        "author": "Dolly9019",
        "title": "Adolescence episode 1",
        "content": "I've avoided content about this show as much as possible, so please no spoilers.\n\nQ1. Is it realistic that there would be armed police at the arrest of a 13year old who was in bed at home?\n\nQ2. Why do they same his name so much? E.g. Jamie I'm just going to ask you some questions. Is that OK Jamie? Is it to kind of 'ground' him?\n\nDuring the arrest and when he is first being processed, they use a language and phrases that aren't part of everyday conversation. I was surprised Jamie said he understood. When the officer was telling him about his detention, I was lost 🙈",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1mfa8v4/adolescence_episode_1/"
    },
    {
        "id": "1mestl5",
        "author": "Entrepreneur-ecom",
        "title": "Help Test My Netflix Straw! [Survey]",
        "content": "Hi All, \n\nPlease help me make a decision.!\n\nI made a hands-free illuminated straw for binge-watching in bed. \n\nhttps://forms.gle/9MMSdVPDwWJfx53j7. \n\nFeedback on design and pricing welcome!\n\n\nThanks!",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mestl5/help_test_my_netflix_straw_survey/"
    }
]