[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 3,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1leajj0",
        "author": "HappyLuca",
        "title": "Mi hanno chiesto 10.000€ per aver partecipato ad un open house",
        "content": "In breve: mi hanno chiesto il 7,4% di commissioni per l’agenzia immobiliare (10.000€ +iva) per un immobile da 135.000€\n\nParte lunga per chi ha voglia:\nSto cercando casa da acquistare a Torino. \nNe individuo una, bilocale in zona non troppo centrale ma comoda. Con qualche lavoretto da fare internamente ma comunque abitabile. Prezzo 135.0000€. \n\nLa vado a vedere, scopro il giorno stesso che non sarei stato l’unico a vederla, ma mi avevano inserito in un open house. Mando giù l’amaro in bocca, mi sono fatto 1h di strada per vedere la casa. \n\nVedo la casa ed effettivamente mi interessa. \n\nEravamo in 40 persone e l’agenzia premeva per raccogliere tutte le proposte entro sera, in quanto il giorno dopo avrebbero inoltrato tutto al proprietario. Già la cosa non mi va giù ma la casa mi piace molto.\n\nPrendo coraggio, ipotizzo il costo di ristrutturazioni e ci sto dentro con il budget. \nVado nell’ufficio di un famoso franchising immobiliare per fare la mia proposta di acquisto e lì l’amara sorpresa.\n\n10.000€+iva solo per il loro servizio.\nIl 7,4% del valore della casa solo per avermi fatto partecipare ad un open house. \n\nOvviamente non trattabili in nessun modo, si coprono con “listino aziendale”, fino a 150.000€ sono 10.000€ fissi.\n\nCosti notarili e tasse escluse, ma quelle almeno non sono a discrezione dell’agenzia.\n\nA queste condizioni rinuncio, non regalo 10.000€ ad una agenzia che non ha saputo nemmeno darmi tutte le risposte esaustive che cercavo.\n\nMa veramente dobbiamo sottostare a questi prezzi folli per un servizio inesistente? \nCome è possibile che non ci sia nessuna soluzione alternativa? \n",
        "upvotes": 247,
        "comments": 123,
        "media": null,
        "permalink": "/r/torino/comments/1leajj0/mi_hanno_chiesto_10000_per_aver_partecipato_ad_un/"
    },
    {
        "id": "1leln02",
        "author": "No_news_till_now",
        "title": "Aule studio/smart",
        "content": "Ciao a tutti!\nDa un po' di tempo sto facendo smart, ma a casa non riesco a concentrarmi. Sapete qualche posto dove fare smart che non sia un bar in cui devo consumare per forza?\n\nGrazie in anticipo!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1leln02/aule_studiosmart/"
    },
    {
        "id": "1lelez7",
        "author": "Zestyclose-Tank9125",
        "title": "UniTo Global law",
        "content": "Hi guys! I’m an EU student and I applied for the UniTo Global Law program about a month and a half ago. I haven’t received any response yet, so I was wondering: how long did it take for you to hear back after submitting your application? Just trying to get an idea of the usual timeline. Thanks in advance!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lelez7/unito_global_law/"
    },
    {
        "id": "1lekpuo",
        "author": "PsychCatsOnAcid",
        "title": "Corsi di yoga per universitari?",
        "content": "Bonjour, ho 25 anni, non navigo nell'oro ma mi piacerebbe trovare un corso di yoga dinamico per tenermi in forma (fare jogging è sempre un'alternativa; noiosa, ma lo è shame on me). Avete consigli o conoscete colletivi (?) che organizzano corsi simili. Visto che questa estate rimarrò a Torino vorrei sfruttare al meglio la bella stagione\n\n  \nGrazie in anticipo",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lekpuo/corsi_di_yoga_per_universitari/"
    },
    {
        "id": "1leewvb",
        "author": "Newyork301",
        "title": "Best restaurant/bars for big groups?",
        "content": "Hey everyone,\n\nI will be visiting Torino early July with a large group of about 20 people. I’m looking for recommendations of restaurants/bars/spaces that would accommodate a large group. Most of the group are ages between late 20’s - late 30’s.\n\nThanks!",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1leewvb/best_restaurantbars_for_big_groups/"
    },
    {
        "id": "1le5ijs",
        "author": "Important_Swimming31",
        "title": "Erasmus Torino",
        "content": "Ciao, ho 20 anni e sono in Erasmus a Torino fino a fine luglio. Mi piacerebbe incontrare persone con cui socializzare, e se parlano spagnolo, ancora meglio!\n",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1le5ijs/erasmus_torino/"
    },
    {
        "id": "1ldteje",
        "author": "MonPorridge",
        "title": "Posti al mare più vicini a Torino?",
        "content": "Vorrei fare 4 giorni al mare, sapete qual è il posto piu vicino (immagino liguria) che ancora non è saturo di turisti/trappole di turisti?\n\nGrazie mille!\n",
        "upvotes": 5,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1ldteje/posti_al_mare_più_vicini_a_torino/"
    },
    {
        "id": "1ldq1sv",
        "author": "onePostAnd",
        "title": "English speaking doctor for transgender person?",
        "content": "Just what the title says, I haven't seen a doctor since I moved from my home country a few years ago. (have my residency permit here so that's not a factor) I'm biologically male but take female hormones and that would be impossible to conceal from a doctor, I would like to be able to see a doctor who is ok with this so I can get minor medical issues treated. \n\nAny suggestions for general practitioners? I want to be very clear, I don't want any transgender specific issue healthcare, I just want a regular doctor who won't treat me strangely or make every visit about this fact. I know this post may seem like a joke to many people but I'm being genuine and the account is new only because I'm embarrassed to ask elsewhere.",
        "upvotes": 6,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1ldq1sv/english_speaking_doctor_for_transgender_person/"
    },
    {
        "id": "1le1xfd",
        "author": "BucksGuy34",
        "title": "Juventus Game",
        "content": "Hello all. I will be visiting Turin for 2 days, tomorrow night and Thursday night for the first time. Coincidentally I will be in the city during Juventus's first fiba cup match. I wanted to ask for reccomendations of bars or just anywhere where the game will be streamed. I figured this could be almost anywhere, but being im only there for 2 days, id like to have a cool memorable experience somewhere where locals highly approve of! Thanks in advance for any reccomendations! ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1le1xfd/juventus_game/"
    },
    {
        "id": "1ldjc9i",
        "author": "ookeyboomer",
        "title": "gtt",
        "content": "raga vi é mai capitato che convalidate il biglietto sull'app, e non vi prende la convalida e salgono i controllori e prendete la multa? sto iniziando a odiarli",
        "upvotes": 10,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1ldjc9i/gtt/"
    },
    {
        "id": "1ldvc2a",
        "author": "Individual-Relief416",
        "title": "Torino is Fantastic Concerto",
        "content": "Vi e' arrivato il QR code? a me non ancora! \n\nhttps://preview.redd.it/k5y8eq2k9j7f1.png?width=2766&amp;format=png&amp;auto=webp&amp;s=480a9a89007ab09e85ba48123a5c11ad706d519e\n\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ldvc2a/torino_is_fantastic_concerto/"
    },
    {
        "id": "1ldgu5l",
        "author": "quarta_g",
        "title": "E a Torino le usano?",
        "content": "",
        "upvotes": 8,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1ldgu5l/e_a_torino_le_usano/"
    },
    {
        "id": "1ldeykv",
        "author": "Libertymobile",
        "title": "Se busso alle porte, posso ottenere un lavoro?",
        "content": "Sto imparando italiano, sono straniero con passaporto europeo. Se esco e chiedo un lavoro, riuscirò a trovarne uno? Sono figlio di italiani.",
        "upvotes": 10,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1ldeykv/se_busso_alle_porte_posso_ottenere_un_lavoro/"
    },
    {
        "id": "1ldumua",
        "author": "peter_plays",
        "title": "Sconto epico",
        "content": "Chi vince secondo voi in una battaglia tra 8gallery mondo Juve  e le gru?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ldumua/sconto_epico/"
    },
    {
        "id": "1ldctan",
        "author": "Important_Swimming31",
        "title": "incontrare persone",
        "content": "Ciao! Sono a Torino da un po' e vorrei incontrare gente per fare qualcosa: uscire a bere qualcosa, fare qualche giro turistico, andare ad una festa, chiacchierare o qualunque cosa mi succeda.\nSono una persona abbastanza calma ma desiderosa di creare nuove connessioni. Qualcuno qui vuole socializzare? 😄",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1ldctan/incontrare_persone/"
    },
    {
        "id": "1ldigb3",
        "author": "jojojackson98",
        "title": "Cerco persone per giocare a ping pong a Vanchiglia",
        "content": "Ciao a tutti!\n\nUltimamente sono dipendente dal ping pong e sto cercando persone con cui giocare in zona Vanchiglia/Campus Einaudi, visto che il mio compare abituale partirà presto. \nLivello intermedio (niente di troppo competitivo, ma nemmeno solo palleggio), l’idea è di divertirsi e fare un po’ di movimento.\n\nSe siete interessati, scrivetemi in privato e organizziamo una partita.\nMassimo rispetto e zero stress\n\n",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ldigb3/cerco_persone_per_giocare_a_ping_pong_a_vanchiglia/"
    },
    {
        "id": "1lcyec6",
        "author": "Unlucky_Winner_1187",
        "title": "How come the air conditioner is off in the subway?????",
        "content": "if i experience that heat and smell again i will crashout",
        "upvotes": 24,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1lcyec6/how_come_the_air_conditioner_is_off_in_the_subway/"
    },
    {
        "id": "1lcqjo6",
        "author": "blunathan",
        "title": "La situazione blackout a Torino sta rasentando l'illegalità?",
        "content": "Può una amministrazione permettere che una città così grande e importante abbia una rete elettrica così scadente? La responsabilità ricade sul comune o sul gestore della griglia? E' possibile essere così assuefatti da un disservizio degno del 1950, che non si faccia nulla per cambiarlo? I danni ai lavoratori, alle aziende e ai cittadini possono essere rimborsati in qualche modo?  \nNe parleremo oggi in studio con.... nessuno. Perché in Italia siamo tutti eccellenti fotografi delle situazioni ma figurarsi se si è in gradi di individuare un responsabile che doveva provvedere per tempo e non l'ha fatto. Sembra si sia tutti prestati ai nostri mestieri, è' tutto un fatalismo salvifico, un 'è così che ci vuoi fare?', un passarla liscia collettivo costante.   \nBuona giornata e, se anche oggi non potrete fare smart working, o tenere il negozio aperto o prendere l'ascensore senza rimanere bloccati, ricordatevi che colpa dei vostri condizionatori e ventilatori che osano chiedere di funzionare ad una griglia elettrica ereditata dal Burkinafaso  \n",
        "upvotes": 70,
        "comments": 94,
        "media": null,
        "permalink": "/r/torino/comments/1lcqjo6/la_situazione_blackout_a_torino_sta_rasentando/"
    },
    {
        "id": "1lcuj3i",
        "author": "gabryGone",
        "title": "ennesimo post per l'ennesimo blackout",
        "content": "Come molti in questi giorni, eccomi qui a scrivere dei blackout elettrici.\n\nMi sono appena trasferito a **Torino Sud** e nella prima settimana di soggiorno sto avendo davvero troppi problemi con l'elettricità. Nel quartiere salta di continuo: a volte 10 minuti, a volte ore intere. Sabato pomeriggio è saltata e poi di nuovo dalle 22 a mezzanotte (se ricordo bene). Ieri stranamente è stata stabile tutto il giorno, oggi invece due interruzioni nel giro di poco tempo.\n\nCapisco che con i condizionatori la rete sia sotto stress, ma fino a un certo punto. Siamo nel 2025 e presumo che una rete elettrica stabile dovrebbe almeno garantire il funzionamento di questi apparecchi (anche se a vedere in giro mi sa tanto che l'infrastruttura sia degli anni '60 e mai aggiornata).\n\n#  Il problema è che lavoro da casa e ho server domestici. Sì, ho degli UPS, ma sabato anche le batterie sono finite dopo così tanto tempo senza corrente. Questo mi crea diversi disagi lavorativi.\n\n# Le mie domande quindi...\n\n* Questa situazione è **normale** per Torino in estate o è qualcosa di nuovo?\n* Qualcuno di voi nella zona sud ha lo stesso problema?\n* Esistono soluzioni pratiche o è solo questione di aspettare?\n\nQualsiasi consiglio o esperienza è ben accetta!",
        "upvotes": 13,
        "comments": 22,
        "media": null,
        "permalink": "/r/torino/comments/1lcuj3i/ennesimo_post_per_lennesimo_blackout/"
    },
    {
        "id": "1lczr2x",
        "author": "sprxce",
        "title": "Dove smaltire legalmente le valigie rotte? L'host non aiuta",
        "content": "La nostra host non ci è stata d'aiuto, ma purtroppo le nostre valigie si sono rotte. Ne abbiamo comprate di nuove, ma ora dobbiamo buttare via quelle vecchie.\n\nLa signora che ci ha fatto il check-in ha detto che le valigie sono come mobili e che bisogna fissare un appuntamento per farle ritirare (gratuitamente?). L'altra opzione, ha suggerito scherzosamente, era lasciarle per strada di notte o lasciarle al servizio di pulizia. Ma noi non siamo fatti così.\n\nStava per contattarmi per fissare un appuntamento per il ritiro, ma quando ho contattato la loro chat sono stati un po' maleducati, dicendo che non offrono quel tipo di servizio, che non è gratuito e che può essere svolto solo dal proprietario registrato dell'immobile (il che mi confonde, visto che stiamo affittando da loro da un paio di giorni).\n\nCosa ci consigliate di fare? Al momento non abbiamo la macchina. Mi scuso anche per i possibili errori, ho usato Google Translate.\n\nGrazie mille!",
        "upvotes": 5,
        "comments": 26,
        "media": null,
        "permalink": "/r/torino/comments/1lczr2x/dove_smaltire_legalmente_le_valigie_rotte_lhost/"
    },
    {
        "id": "1lcxwy2",
        "author": "prutprit",
        "title": "Piemonte Casa",
        "content": "Qualcuno conosce Piemonte Casa? È una delle ennesime realtà che ti chiedono una quota per accedere ad un fantomatico \"database\" di appartamenti e di proprietari.\n\nQuello che mi fa strano è che nel loro caso hanno diversi annunci con foto sui vari siti di immobili.\n\nQualcuno ci ha già avuto a che fare?",
        "upvotes": 3,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1lcxwy2/piemonte_casa/"
    },
    {
        "id": "1ld5xy0",
        "author": "ChancePast5860",
        "title": "Noleggio furgoncino a torino",
        "content": "Come da titolo. Chi può consigliarmi un servizio affidabile? Sia una ditta per spostare pochi oggetti personali( qualche scatolone) o un posto dove noleggiare un furgoncino(fiat fiorino o cose cosi) che guiderei io? Avete esperienze personali a riguardo? \nGrazie mille per l'auto!",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1ld5xy0/noleggio_furgoncino_a_torino/"
    },
    {
        "id": "1lcczz2",
        "author": "mo_one",
        "title": "Il blackout in centro è finito proprio dopo la fine del concerto in piazza castello, ma che coincidenza",
        "content": "Allora, è ovvio che la rete elettrica è già debole per il caldo, quindi non è tutta colpa del concerto. Ma &gt;!porcoddio!&lt; la luce che torna subito dopo la fine del concerto in piazza castello non è una fottuta coincidenza. Ma il comune ha seriamente deciso ti prioritizzare un fottuto concerto, che le necessità fondamentali dei loro residenti??? Ma che cazzo di logica è &gt;!Madonna puttana!&lt;? Se si vede già che la rete elettrica cede, perché cazzo hanno deciso di fare il concerto comunque. Un intero quartiere (ed anche di più) non può sacrificare la corrente elettrica per un concerto, sarebbe dovuto essere l'opposto. Il concerto andava annullato se significava che metà città andava senza luce, è seriamente ridicolo. I semafori non funzionavano, i negozi e bar a via garibadi quasi tutti chiusi, ed i residenti al buio e caldo. Mentre sto cazzo di concerto succhia tutta l'energia per se. Ma le necessità fondamentali vanno prioritizzate al posto dello svago in situazioni del genere, ma che michia di genio ha permesso sta merda?? Manco fossimo in Corea del nord, o un villaggio africano, ceh, ma andare mezza giornata senza nessuna forma di elettricità vi pare normale?? La gente muore di caldo, non vede un cazzo in casa propria, mentre c'è la gente che va a cantare. O migliorate la rete elettrica, o non fate roba che la mette in difficoltà ancor di più!",
        "upvotes": 50,
        "comments": 36,
        "media": null,
        "permalink": "/r/torino/comments/1lcczz2/il_blackout_in_centro_è_finito_proprio_dopo_la/"
    },
    {
        "id": "1ld046d",
        "author": "juulu",
        "title": "Consigli campeggio Val Di Susa?",
        "content": "Sto cercando consigli sul campeggio a Val Susa. Preferibilmente per le tende, e non la classica Sosta Camper o parcheggio per le piccole case vacanze.\n\nQualcuno può consigliare qualche bel posti? Se esistono!\n\nGrazie.\n\n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ld046d/consigli_campeggio_val_di_susa/"
    },
    {
        "id": "1lcpqze",
        "author": "Careful_Molasses_496",
        "title": "Fake Agenzie, sono davvero fake?",
        "content": "Sto cercando casa da un po’ e mi trovo costantemente agenzie che non sono tali, ma che offrono servizi di consulenza e ti seguono dall’inizio (appuntamento con il proprietario dell’immobile) fino alla consegna delle chiavi, per 260€.\n\nSu Facebook e anche qui sembrano essere costantemente catalogate come truffa, ma è possibile che il loro lavoro consista nel farsi pagare la consulenza e poi non offrirti nessun tipo di aiuto. Da quello che leggo, si limitano a dire: “La casa che ti interessava non è più disponibile, ma ti terremo aggiornato appena escono altre soluzioni”.\n\nCioè, mi sembra assurdo. Hanno anche sedi legali (o uffici fuffa, perché la P.IVA non spunta da nessuna parte nei loro siti web). \n\nQualcuno sa di “consulenze” andate a buon fine?",
        "upvotes": 2,
        "comments": 22,
        "media": null,
        "permalink": "/r/torino/comments/1lcpqze/fake_agenzie_sono_davvero_fake/"
    },
    {
        "id": "1lcof05",
        "author": "gutofoletto",
        "title": "Corso breve di italiano?",
        "content": "Hello friends!\n\nI am from Brazil and I speak only basic Italian, so it's been a bit hard to find friends and talk to people at bars and caffès. I'll be staying in Torino until September. Do you recommend any Italian courses that accept students for only 2-3 months group classes and does not break the bank?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1lcof05/corso_breve_di_italiano/"
    },
    {
        "id": "1lbxqbt",
        "author": "Reasonable_Recipe631",
        "title": "Blackout",
        "content": "Lo so che questo è l'ennesimo post in questo sub dove ci si lamenta dei blackout e sarà lapalissiano, ma stanotte giuro che volevo morire. in zona Vanchiglietta ce n'è stato uno che mi sembra essere durato ore (probabilmente meno di una, ma ero in dormiveglia e tra caldo e pressione bassa mi sembrava di essere in un film di Nolan); cani che abbaiavano, antifurti, il ventilatore si è fermato e ho iniziato a soffocare, vi giuro che non ce la faccio più. Scusate per lo sfogo ma ho il sonno leggero. Sto considerando di comprare tappi per le orecchie. ",
        "upvotes": 47,
        "comments": 36,
        "media": null,
        "permalink": "/r/torino/comments/1lbxqbt/blackout/"
    },
    {
        "id": "1lc6zr9",
        "author": "Esp3t0",
        "title": "International student asking for advice",
        "content": "I am a Brazilian student and Im moving to Torino to study. I would like some advices.\n\nI would like to know about good neighborhood or which ones to avoid. I saw about avoid Barriera de Milano and places near Porta Palazzo and Porta Nuova. Is that correct any more places to avoid?\n\nAnd about local places to eat with good prices. Would love some tips.\n\nAnd places to buy food like a central market or popular fruit and vegetables fair.\n\nAbout security what would you recommend? I am originally from Rio de Janeiro and the criminality rates there are very high. Actually I live in an area with a criminality rate a little above Torino (according to Numbeo) and for me compared with Rio de Janeiro, here is almost the paradise. So I imagine that Torino is a very calm place.\n\nAny other tip will be very much appreciated. Thanks.",
        "upvotes": 5,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1lc6zr9/international_student_asking_for_advice/"
    },
    {
        "id": "1lc9faa",
        "author": "rafasofizadeh",
        "title": "Dove posso acquistare un anello di promessa in zirconio/moissanite + oro?",
        "content": "Conoscete una zona a Torino piena di gioiellerie, dove posso cercare un anello da promessa (zirconi o moissanite, non diamanti)? Vorrei evitar di girare mille negozi singoli.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1lc9faa/dove_posso_acquistare_un_anello_di_promessa_in/"
    },
    {
        "id": "1lbekvy",
        "author": "Proper-Prune-6806",
        "title": "CALDO TORRIDO a inizio giugno, ma vent'anni fa com'era? Qualche dato...",
        "content": "[temperatura \\(e non solo\\) registrata nel periodo 01 - 15 giugno del 2005 a Torino. ](https://preview.redd.it/1b53x00tfx6f1.jpg?width=823&amp;format=pjpg&amp;auto=webp&amp;s=60f0dc126549d036e489fd193d3cc73a740c8620)\n\nNumero complessivo di giorni in cui Torino ha registrato massimi \"molto caldi\" (&gt;30°C) nella prima metà del mese di giugno nel 2005: \n\n0. \n\ntemperatura media massima nel periodo 01 - 15 giugno a Torino nel 2005: \n\n25.8°.\n\n[temperatura \\(e non solo\\) registrata nel periodo 01 - 15 giugno del 2005 a Torino](https://preview.redd.it/u4fcnwv9hx6f1.jpg?width=823&amp;format=pjpg&amp;auto=webp&amp;s=928445abbc16d1e2a391b269455df535a7eb8150)\n\n\\- (il 14 e il 15 non sono ancora registrati ma non c'è dubbio che temperature massime di almeno 30 gradi verranno riportate; stima sui 32-34° ) -\n\nNumero complessivo di giorni in cui Torino ha registrato massimi \"molto caldi\" (&gt;30°C) nella prima metà del mese di giugno nel 2025: \n\n6. (40% dei giorni totali).\n\nTemperatura media massima nel periodo 01 - 15 giugno a Torino nel 2025: \n\n29.1°.\n\n\n\nRIASSUNTO:\n\n1- giorni con piu di 30 gradi nel 2005: 0 / 15\n\n1- giorni con piu di 30 gradi nel 2025: 6 / 15 (+6 giorni di \"caldo intenso\" rispetto 20 anni fa)\n\n\n\n2- temperatura media massima nel 2005: 25.8°\n\n2- temperatura media massima nel 2025: 29.1° (+3.3° rispetto 20 anni fa)\n\n\n\nFONTE: [Osservatorio Meteorologico dell'Università di Torino](https://www.meteo.dfg.unito.it/mese-6-2025)\n\n\n\n",
        "upvotes": 203,
        "comments": 45,
        "media": null,
        "permalink": "/r/torino/comments/1lbekvy/caldo_torrido_a_inizio_giugno_ma_ventanni_fa/"
    }
]