[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 13,
        "comments": 85,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 64,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1lgb1dl",
        "author": "ER-841",
        "title": "Mindhunter Star Reveals How the Netflix Series Might Finally Return 6 Years Later",
        "content": "Mindhunter was in my opinion one of the best series Netflix ever produced. So when I learned it was cancelled after the second season it was such a disappointment. In this article, they discuss how the series might return in the form of movies. I think this is really great. David Fincher would be returning with the same cast theoretically if he likes the scripts… Fingers crossed. 🤞",
        "upvotes": 175,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1lgb1dl/mindhunter_star_reveals_how_the_netflix_series/"
    },
    {
        "id": "1lg0bvl",
        "author": "MelodyHearts678",
        "title": "What do you guys think of K-Pop Demon Hunters?",
        "content": "Now that it’s out and I watched the movie.\n\nI must personally say that I love it so freaking much!\n\nAnd consider it as my all time favourite movie of 2025\n\nPlus just to make sure that you also watched it, what’s your favourite song from that movie.\n\nFor me I could only pick three because I love every single songs from it.\n\nAnd that would be: Golden, Takedown and Free.",
        "upvotes": 231,
        "comments": 175,
        "media": null,
        "permalink": "/r/netflix/comments/1lg0bvl/what_do_you_guys_think_of_kpop_demon_hunters/"
    },
    {
        "id": "1lghjht",
        "author": "suhpriseshawtyyy_",
        "title": "What did you think about the AstroWorld documentary?",
        "content": "Just watched the documentary yesterday and I’m honestly speechless. So many things throughout didn’t sit right with me. So much led up to the tragedy, things that could have been prevented from the very beginning. The complete lack of accountability was one of the most unsettling parts. And the lack of awareness or care for his fans, who he clearly saw struggling in the crowd…Just an insane documentary overall. No words.",
        "upvotes": 16,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1lghjht/what_did_you_think_about_the_astroworld/"
    },
    {
        "id": "1lfqj1f",
        "author": "Proof-Pollution454",
        "title": "I just finished watching Trainwreck : Astroworld Tragedy. I am beyond digsuted",
        "content": "I just finished watching this documentary and I beyond disgusted how to this day no one was held accountable , let alone Travis Scott being serious of the aftermath, the company not holding their responsbility of planning this even right. to then see footage of scott telling fans to engage in dangerous behavior is just awful. Like where is the common sense ? Where is the importance of safet when anything could go wrong . To then want fans to go crazy is wrong",
        "upvotes": 875,
        "comments": 152,
        "media": null,
        "permalink": "/r/netflix/comments/1lfqj1f/i_just_finished_watching_trainwreck_astroworld/"
    },
    {
        "id": "1lg43e5",
        "author": "TheMirrorUS",
        "title": "High-end real estate agent Netflix star found dead aged 40 after being struck in hit-and-run",
        "content": "",
        "upvotes": 67,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1lg43e5/highend_real_estate_agent_netflix_star_found_dead/"
    },
    {
        "id": "1lgjzhd",
        "author": "Silent_Piccolo_5670",
        "title": "Lost",
        "content": "I was listening to morning radio and the guy was talking about a documentary on Netflix about a man accused of murdering women. And the wife didn’t believe it. And there was a secret room in the house that no one was allowed to go into. And the murders always happened when the wife and kids were out of town. And he supposedly renovated the bathroom. I never heard the name of the documentary, can anyone help? I tried Google with keywords and nothing……  Thanks in advance for the help if you can ",
        "upvotes": 6,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1lgjzhd/lost/"
    },
    {
        "id": "1lgmop1",
        "author": "messengers1",
        "title": "AMA Reminder: Tomorrow's Livechat With Carlos Rafael Rivera at 3PM PST/11PM UTC on June 21 at R/DeptQ",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lgmop1/ama_reminder_tomorrows_livechat_with_carlos/"
    },
    {
        "id": "1lgr5wa",
        "author": "Educational-Table331",
        "title": "Video game adaptations on Netflix?",
        "content": "I’ve been watching Netflix’s game-based shows like Castlevania and Devil May Cry, and it got me thinking — why are they so consistently good compared to other video game adaptations?\n\nIt feels like Netflix cracked some kind of code. The animation is top-tier, the writing respects the original lore, and the pacing actually works. Even Arcane (though not technically a Netflix production) followed a similar winning formula.\n\nWhat do you think is the “secret sauce”? Is it the teams they hire? The animation style? The freedom they give the writers?\n\nCurious to hear your thoughts — especially if you’ve watched Cyberpunk: Edgerunners, Tomb Raider, or Captain Laserhawk too. Are we witnessing a new golden age of game adaptations?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lgr5wa/video_game_adaptations_on_netflix/"
    },
    {
        "id": "1lgkduv",
        "author": "No-Camp-3736",
        "title": "New Recommendations",
        "content": "I have all the free time in the world for the next couple weeks i’m so looking for something to binge.\n\nShows I love: Desperate housewives, friends, black mirror, the office, Schitts creek\n\nShows I like : The good place, bojack horseman, F is for family, You\n\nI feel like there’s nothing good in my recommendations so anything is appreciated :)",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lgkduv/new_recommendations/"
    },
    {
        "id": "1lgqgp3",
        "author": "Suuxxii",
        "title": "Why you should watch Six Feet Under",
        "content": "No spoilers are within the video, it is just my attempt to convince more to watch the show.  It’s shifted so much of my mentality on life and the characters were fantastically written.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lgqgp3/why_you_should_watch_six_feet_under/"
    },
    {
        "id": "1lgqfjh",
        "author": "spzdrhrsn",
        "title": "What often gets forgotten about the new UI",
        "content": "It's the fact that I can no longer swipe left to the menu to quickly navigate to My List when I couldn't find something interesting in the categories or vice versa. Now I have to scroll all the way up because some masterminds decided to put the menu at the top. \n\nI just can't understand how you can develop something new without considering how it's used. I mean, do the people in charge even use Netflix themselves? \n\nThe Netflix UI, like any other streaming service UI, was always bad and kept getting worse, but this is certainly a new low I never would have thought possible. \nIf I hadn't gotten a good deal last year for a combo subscription of Waipu+Netflix, I'd cancel Netflix for sure.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lgqfjh/what_often_gets_forgotten_about_the_new_ui/"
    },
    {
        "id": "1lgqdmg",
        "author": "MelodyHearts678",
        "title": "What do you guys think of Spellbound?",
        "content": "A original netflix movie made by Skydance Animation.\n\nAnd despite the controversy it gotten behind one of the directors.\n\nI absolutely love this movie!\n\nEspecially with how good the songs and the story are.\n\nPlus I wasn’t expecting for this movie to go into the divorce route but I still enjoy it.\n\nOne of my favourite songs from it is: The Way It Was Before. {And yes I’m talking about the end credits version of it.}",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lgqdmg/what_do_you_guys_think_of_spellbound/"
    },
    {
        "id": "1lg7drq",
        "author": "peoplemagazine",
        "title": "Million Dollar Beach House Realtor Sara Burack Dies After Hampton Bays Hit-and-Run",
        "content": "",
        "upvotes": 14,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lg7drq/million_dollar_beach_house_realtor_sara_burack/"
    },
    {
        "id": "1lgo29f",
        "author": "Historical_Log1275",
        "title": "Dallas cowboys cheerleaders?",
        "content": "I usually enjoy a good trash tv (e.g. selling sunset, LIB, etc.) but DCC has just given me ick vibes. I feel like it may be the coaches and weird power/control stuff. Thoughts? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lgo29f/dallas_cowboys_cheerleaders/"
    },
    {
        "id": "1lgnvtx",
        "author": "Freshxmangos",
        "title": "Why are the gaps between shows with under 15 episodes so lengthy?",
        "content": "I am not sure if this has been asked before but why is it that it takes so long for another season to come out? Two years is bizarre to me. So many times I've finished a season and then forget or lose interest in the show because it's taking so long. ",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1lgnvtx/why_are_the_gaps_between_shows_with_under_15/"
    },
    {
        "id": "1lglqj2",
        "author": "astnmartin23",
        "title": "Screen Going Black on Fire Stick",
        "content": "I’ll be watching a show on Netflix on a Fire Stick and after a few episodes the video will go black but the audio still plays. The Netflix interface is still visible though if I were to pause or ff or rwd. I can also back out into the Netflix menus and restart the show to get video back. \n\nI’ve cleared the cache and restarted the Fire Stick based on similar posts but none of the other posts mention still being able to see the interface. \n\nThis has only started in the last week or two. \n\nAnyone have any ideas or solutions? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lglqj2/screen_going_black_on_fire_stick/"
    },
    {
        "id": "1lfimke",
        "author": "sassyblondechik",
        "title": "Just finished Animal Kingdom - I can’t believe I slept on this masterpiece",
        "content": "I honestly can’t believe it took me this long to experience Animal Kingdom. Maybe the title threw me off—I always assumed it was some kind of nature documentary or something completely different. But wow… what a ride.\n\nI just finished binging the entire series on Netflix, and I’m genuinely having withdrawals. The storytelling, the intensity, the family dynamics—everything just pulls you in deeper and deeper. It was addictive from the first episode to the last.\n\nLet’s talk about Smurf. Hands down, she has to be one of the WORST mothers in TV history—manipulative, calculating, and chillingly cold. And then there’s Pope… what a complex, tragic character. I don’t think I’ve ever had such a mix of empathy and unease toward someone onscreen.\n\nI’ll definitely be watching it again, no question. Massive thanks to Netflix for having this gem available.\n\nIf anyone has recommendations for similar shows—crime, dysfunctional families, intense drama—please drop them below! I’m officially on the hunt.",
        "upvotes": 263,
        "comments": 85,
        "media": null,
        "permalink": "/r/netflix/comments/1lfimke/just_finished_animal_kingdom_i_cant_believe_i/"
    },
    {
        "id": "1lg9954",
        "author": "Disastrous-Note8898",
        "title": "The waterfront: the perfect example of how Netflix shows are too rushed these days",
        "content": "This is literally the best exmaple I’ve seen so far of a show that should’ve have been so much longer yet was obviously done in a way to make it short and full of action within just 8 episodes. This show should’ve been 20 episodes. Instead the creators decided to do what Netflix has now done multiple times and condense it into one of those shows where it’s just nonstop action and plot twist and turn with conflict and resolution happening way to fast. It’s a great show, but way too fast passed. Which is what ruins it. The characters don’t have enough time to develop and that makes the show feel shallow and not as intense or meaningful because u lack connection with the charictors. An example of this is how quickly cane’s character is brought in and how quickly it goes south with him, it’s supposed to be a sort of plot twist, but it doesn’t even feel like one becuase there’s not enough time to even developed a proper plot. Another exmaple is how quickly the early plot twist with sherif is done and how quickly the sherif goes from partner to being killed. It’s just all far too rushed and should’ve been carried out through multiple episodes. \n\nI’ve seen this exact issue of rushed shows so much recently on Netflix, they had great potential but just were executed in this poor fashion which ruins the whole thing. ",
        "upvotes": 2,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1lg9954/the_waterfront_the_perfect_example_of_how_netflix/"
    },
    {
        "id": "1lghzez",
        "author": "MarMatt10",
        "title": "Naked Gun (Netflix Canada)",
        "content": "Not sure if it was all 3, but Naked Gun was released about 2-3 weeks ago on Netflix Canada. I started watching and then a few days later, went back and it just disappeared. It had just been re-released on Netflix, it wasn't like I watched it at the end of the period. I've been waiting years to watch it and was surprised when it finally came back\n\nAny search in the Netflix search bar brings up nothing, however, Google searches bring links ... to my open Netflix app ... saying Coming June 21st, now ... June 20th, it just says \"Remind Me\" no set date\n\nNothing on the \"Coming to Netflix Canada\" websites, either",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lghzez/naked_gun_netflix_canada/"
    },
    {
        "id": "1lg807s",
        "author": "SuitableAddition4737",
        "title": "Waterfront…",
        "content": "I really like it. I won’t say it’s anything fresh but it’s fun to watch for sure. All amazing actors. A good plot. And who doesn’t love a badass fam drama. \nWhat are your thoughts? ",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1lg807s/waterfront/"
    },
    {
        "id": "1lgnohc",
        "author": "SnapSketchStudios",
        "title": "NETFLIX AGAIN",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lgnohc/netflix_again/"
    },
    {
        "id": "1lfb5mu",
        "author": "intelerks",
        "title": "Millie Bobby Brown’s Netflix film hit by food poisoning outbreak during overseas filming",
        "content": "",
        "upvotes": 266,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1lfb5mu/millie_bobby_browns_netflix_film_hit_by_food/"
    },
    {
        "id": "1lg2gjm",
        "author": "Legitimate_Ad3625",
        "title": "‘Fubar’ Season 2 Debut Barely Makes Netflix Weekly TV List Amid Steep Audience Decline As ‘Ginny &amp; Georgia’ Remains On Top",
        "content": "",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1lg2gjm/fubar_season_2_debut_barely_makes_netflix_weekly/"
    },
    {
        "id": "1lfpaf4",
        "author": "Sudden_Pop_2279",
        "title": "Squid game season 3 new poster",
        "content": "",
        "upvotes": 35,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lfpaf4/squid_game_season_3_new_poster/"
    },
    {
        "id": "1lg5g8r",
        "author": "Brief-Worker-5331",
        "title": "Servers are struggling or just the Ps5 App?",
        "content": "Network testing is okay but I keep getting different errors like ; “this title is not available to watch” “having trouble accessing these titles”\n“the titles are not loading” etc. It was fine moments ago.?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lg5g8r/servers_are_struggling_or_just_the_ps5_app/"
    },
    {
        "id": "1lg9qjf",
        "author": "GoldDerby",
        "title": "Kristen Bell, Tina Fey, Kate Hudson and the best of our Emmy Comedy Actress interviews:",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lg9qjf/kristen_bell_tina_fey_kate_hudson_and_the_best_of/"
    },
    {
        "id": "1lgi1vh",
        "author": "spycakes2",
        "title": "That’s my boy playing the interview preview",
        "content": "I was just looking for something to watch and I wanted to see that’s my boy but it started playing the interview but the thing is that the interview is not even on Netflix so how did this even happen?",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ny919lui068f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1lgi1vh/thats_my_boy_playing_the_interview_preview/"
    },
    {
        "id": "1lg8mfl",
        "author": "FlusteredCustard13",
        "title": "Anyone else having trouble with their Netflix household?",
        "content": "Half the time I try to use Netflix, I get a screen saying my device isn't part of my Netflix household. The problem is that it flip flops. I'd have lots of things in the background on my phone while I worked on housework, then it suddenly had that when I logged in one day. Then I try it about a week ago. No problem. App opens up, I watch some shows I want to catch up on, and download a few episodes for a work trip. I figure it's fine.\n\nCome back from the work trip, and lo and behold it says it's once again saying my device isn't part of the household. It seems like it'll go for a good amount of time, and then suddenly decide my phone is no longer part of my household. Is anyone else having this issue?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lg8mfl/anyone_else_having_trouble_with_their_netflix/"
    },
    {
        "id": "1lg7rmj",
        "author": "Degenerate_Game",
        "title": "A Cautionary Tale - Roku &amp; Netflix",
        "content": "Wife and I just wrapped up One Punch Man and were in the mood to start another anime.\n  \nHad heard Cyberpunk: Edgerunners was really good, but I didn't know which streaming service it was on.\n  \nSearch for it on my Roku and selected the result. Was taken directly from the Roku home page to an ad and then the show started playing.\n  \nIt was very confusing at first, but its not uncommon for animes to start in weird spots with a lot going on to drag you in and catch you up.\n  \nAbout 12 minutes in, it dawned on us. We were watching the last episode. Everything about the episode culminated in \"this is the closing of a story\".\n  \nI backed out to see that it had taken us DIRECTLY to the last episode and auto-played it. None of the previous episodes have any play time on them.\n  \nThe show was instantly spoiled for us.\n  \nThis $500 TV is less than 6 months old. The bug is reproducible and there are many forum posts on Netflix and Roku community forums from the last 2-3 weeks complaining about this. Where both Netflix and Roku are passing the blame to each other.\n  \nIt's our fault honestly for trusting technology to do something correctly, with how bloated and garbage smart TVs, streaming services, and technology in general, are these days.\n  \n**TL;DR:** Be aware that there is a reproducible bug when selecting a search result in Roku that is on Netflix where it will automatically play the LAST episode of a TV series. Whether this is a Roku bug or Netflix app on Roku bug is unclear, as they keep passing the blame.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lg7rmj/a_cautionary_tale_roku_netflix/"
    },
    {
        "id": "1lg08x9",
        "author": "Ajax5280",
        "title": "Using Netflix while traveling long term",
        "content": "I have been away from home for 6 weeks and won’t return for another 4 months. It’s not clear to me how to best manage Netflix access during this time. \n\nI just got an alert on my iPad that my device isn’t part of the Netflix account for my household, with the option to get a two-week travel/temporary code.  What other options do I have to access Netflix while traveling? Should I create a whole new account and cancel the existing one to initiate a new household? I also have a laptop that I’ll sometimes access Netflix from. I am also moving locations every 2-6 weeks. Does each new location require establishing a new Netflix account?\n\nFor context, I am the account holder. I have tenants at my home with access to my Netflix account, but if I have to boot them out that’s fine.",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lg08x9/using_netflix_while_traveling_long_term/"
    }
]