[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 484,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1haf6gm",
        "author": "netflix",
        "title": "Netflix received 36 Golden Globes nominations!\n\nCongratulations to Emilia Pérez, Nobody Wants This, Squid Game, Monsters: The Lyle and Erik Menendez Story, Maria, Ripley, Griselda, Black Doves, The Gentlemen, The Diplomat, A Man on the Inside, and Glen Powell who scored his first-ever nomination.",
        "content": "",
        "upvotes": 23,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1haf6gm/netflix_received_36_golden_globes_nominations/"
    },
    {
        "id": "1hatvm0",
        "author": "MrJeff18",
        "title": "Netflix charged me directly after canceling Verizon Play+",
        "content": "Just an FYI I had Netflix premium free for a year through Verizon Play+.  I cancelled my subscription though Verizon Play+ and Netflix started charging me directly through my Netflix account.  I never authorized them to start my subscription and when I try to contact support I'm greeted with \"Wait time for live help is longer than usual\nCheck back later\".  If you have Netflix through your phone company and planning on cancelling be aware.",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hatvm0/netflix_charged_me_directly_after_canceling/"
    },
    {
        "id": "1hau90t",
        "author": "AlexaDives",
        "title": "Help Identifying a Japanese Film from Netflix I saw in between (2010-2011) with Explicit Sex Scenes and Comedic Elements",
        "content": "Hi everyone, I’m trying to track down a Japanese film I watched on Netflix around 2010-2011. I’m sure it was a sex film. Not sexual scenes but scenes with full blast sex. The movie had explicit sex scenes, comedic elements, and was definitely in the adult or niche section of Netflix at the time.\n\nSome details I remember:\n\t•\tThe film featured actual sex scenes (not just sexual content, but actual explicit scenes) of a young woman and an old man where he feels her up on and begins to try and have sex with her, he tries to penetrate her but she keeps blowing him until he finishes to prevent him from wanting to feel like finishing in her or whatever. \n\t•\tIt had a comedic tone, not taking itself seriously.\n\t•\tThere were scenes involving bugs being used in fights or some bizarre concept along those lines.\n\t•\tAt one point, the suns face turned to the face of one Japanese dude in the film and started talking to him.\n\nI’m pretty sure the word “sex” was in the title, but it’s been so long I can’t recall the exact name. Has anyone seen a film with these themes from that era? Any suggestions would be greatly appreciated!",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hau90t/help_identifying_a_japanese_film_from_netflix_i/"
    },
    {
        "id": "1hau6jq",
        "author": "anayonkars",
        "title": "Questions about Kaleidoscope",
        "content": "Not sure if this is correct sub (found couple of subs but those are inactive since 6-8 months).\n\nI have couple of questions (spoilers ahead):\n\n1. &gt;!Why they went it all the way for the elaborate heist? I mean it's clear that Vernon is only interested in hurting Salas, and not in money. So why do all of this and endanger lives of other people? There got to be something easier than targeting most secure vault in US (e.g. targeting Salas' other weak points etc.)!&lt;\n2. &gt;!Did Vernon die in the end? There's a montage where a unknown person walks behind and pulls a gun. Does it mean that Judy &amp; Stan are only survivors?!&lt;\n\nThanks in advance!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hau6jq/questions_about_kaleidoscope/"
    },
    {
        "id": "1harkez",
        "author": "bigced",
        "title": "Big Sean Thanks Tyler Perry For Grandmother’s Story In Movie",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1harkez/big_sean_thanks_tyler_perry_for_grandmothers/"
    },
    {
        "id": "1havg7g",
        "author": "wellthatspeculiar",
        "title": "Windows app not streaming over 1080p on PC",
        "content": "Hi folks,\n\nHoping I can get some better advice here than I got from Netflix Support.\n\nI'm trying to stream Netflix above 1080p on my PC. I'm streaming through the Netflix Windows app on Windows 11. I'm running an MSI MAG 271QPX QD-OLED E2 through an HDMI 2.1 Certified cable into an RTX 3070. All three components support HDCP 2.2.\n\nI was happily streaming in 1440p throughout the day when all of a sudden my stream was interrupted by an error message and after reloading the stream was stuck at 1080p again. I've tried clearing the cache for Microsoft Edge and restarting my computer to no avail. Graphics card driver and Windows update are both fully up to date. I pay for Netflix Premium. I also have the HEVC extension installed and I've tried resetting it. \n\nI reached out to Netflix support with the same details and the best advice I got was to try streaming through Safari. Needless to say, I'm hoping I get better advice here.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1havg7g/windows_app_not_streaming_over_1080p_on_pc/"
    },
    {
        "id": "1h9yr0b",
        "author": "Backwoodz333",
        "title": "Why does this happen when i try to watch any show?",
        "content": "Everything looks fine in the main menu, preview of the show, and preview when I’m fast forwarding but when i play the show the contrast is way off\n\nWhat’s happening? It says Netflix is updated",
        "upvotes": 188,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1h9yr0b/why_does_this_happen_when_i_try_to_watch_any_show/"
    },
    {
        "id": "1har79b",
        "author": "ms_1102",
        "title": "Annoying sounds…",
        "content": "I’ve been watching the madness and now black doves, in both the background car engines and revving has definitely felt amplified and like there’s more of it. I am very sensitive to noises but I notice them so much more and it kind of doesn’t fit. The madness has this mostly, black doves is just music a lot of the time, but yeah. Is it just me? Please somebody tell me I’m not going crazy🤣",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1har79b/annoying_sounds/"
    },
    {
        "id": "1haqq7c",
        "author": "Effective_Machina",
        "title": "Trick to get Netflix to save progress?",
        "content": "I don't watch a ton of Netflix, I am primarily watching on a Roku but I think it does it elsewhere as well.\n\nif I have to walk away is there a trick to get it to actually save my progress? It's never where I leave it, it's always way back. \n\nIt seems like Netflix reports your position at very low interval and for some reason doesn't send it when you hit pause.\n\nEdit: For example I just took a pic turned tv off was at episode 9 - 24:36 minutes. \n\nTurned the tv back on it showed I was on episode 8 a quarter in but I clicked it and it started episode 8 from the very beginning\n\nDeleted and reinstalled the app Roku is updated, restarted Roku. Nothing changed.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1haqq7c/trick_to_get_netflix_to_save_progress/"
    },
    {
        "id": "1h9e4ln",
        "author": "IAmPookieHearMeRoar",
        "title": "Netflix Sued Over Jake Paul-Mike Tyson Boxing Match Glitches",
        "content": "",
        "upvotes": 1958,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1h9e4ln/netflix_sued_over_jake_paulmike_tyson_boxing/"
    },
    {
        "id": "1habw46",
        "author": "Sweaty_Recipe6199",
        "title": "Different audio between kids and 'normal' account?",
        "content": "I have an autistic child and some cartoons he will only watch on my netflix account and not on the kids account as he says the voices are different.\n\nAnyone else had or noticed this or know the reason for this if it is a thing?\n\nThe main two he won't watch on kids because of this are:\n\nNot quite narwhal \nWonderoos",
        "upvotes": 7,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1habw46/different_audio_between_kids_and_normal_account/"
    },
    {
        "id": "1haphkm",
        "author": "user809080",
        "title": "1080p or 4K",
        "content": "I have a Oled 16-inch computer with 2k resolution. I was considering a basic Netflix account since the one with 4k costs much more. Is the 4k one worth it? Is the difference that noticeable?",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1haphkm/1080p_or_4k/"
    },
    {
        "id": "1hat7tz",
        "author": "2short4thepit",
        "title": "Hot Frosty's surprising subtext",
        "content": "I watched Hot Frosty last night because my friend and I wanted to have a cozy night in with a silly movie, but holy shit, guys. Was not expecting an allegory for the drug epidemic — once you realize it, you can’t miss it. For example, his body’s reaction to being away from snow is textbook withdrawal. Would love to know if others noticed this!\n\nAnd here’s the kicker: The title “Hot Frosty” is obviously an oxymoron. And the movie is about… an \"oxy moron.\" Nuts.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hat7tz/hot_frostys_surprising_subtext/"
    },
    {
        "id": "1ha1ay6",
        "author": "Extreme_Homework7936",
        "title": "Tony Hale: “Woman of the Hour isn't an easy watch, but it’s an important one.”",
        "content": "",
        "upvotes": 19,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ha1ay6/tony_hale_woman_of_the_hour_isnt_an_easy_watch/"
    },
    {
        "id": "1hajade",
        "author": "minemeister",
        "title": "Audio issues on spatial audio",
        "content": "So I tried watching breaking bad on the Netflix app on windows. But the audio just did was just static thumping. I then went to watch it on my browser and it worked perfectly fine. \n\nThe issue only seemed to come up with programs with spatial audio. I am using a DAC with optical input and this issue has not come up before. My other ports seem to also just be working fine. So I'm not sure if the issue was just with the app itself or something else",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hajade/audio_issues_on_spatial_audio/"
    },
    {
        "id": "1h9mzr7",
        "author": "mrmrln42",
        "title": "Terrible bitrate on Netflix ",
        "content": "Netflix 4k, 3 body problem in 4k, dolby vision+atmos. 2Mbps. NOT MBps...\n\nNetflix 4k, kung fu panda in 4k, dolby vision+atmos, 5Mbps\n\nApple tv plus, for all mankind in 4k, dolby vision+atmos, 30mbps \n\nThere was nothing else going on on the network. I paused several times to confirm and the download speed went away (it's only my phone and pc on the network and neither was doing anything). It says outbound because of the interface I selected, but it's download. I started the show (burst of download for the buffer) and then let it stabilize for 2 minutes. \n\nHow can netflix get away with a 6-15 TIMES WORSE bitrate than apple tv? I knew their bitrate is shitty, but this is crazy bad. Apple tv shows look great, on Netflix I can see color banding and lack of detail from 3m away... Such a shitty service - and that's their highest tier too. It sucks so much that such cool looking content is completely destroyed by a shitty low bitrate streaming service. ",
        "upvotes": 109,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1h9mzr7/terrible_bitrate_on_netflix/"
    },
    {
        "id": "1ha9ps0",
        "author": "shanetsh",
        "title": "Ultimatum S3 = The Idol",
        "content": "Is it just me, or does Scotty and Zaina's trial marriage feel oddly like the whole Tedros and Jocelyn relationship in the Idol.\n\nThe lovebombing, the anger issues, the gaslighting. Scotty even looks and act oddly like the Weekend's character. XD",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ha9ps0/ultimatum_s3_the_idol/"
    },
    {
        "id": "1hahb1c",
        "author": "LegWoman",
        "title": "How do I pitch an input for a documentary?",
        "content": "I have a case that I want to bring to light that happened in march. There is so much to the story and I have a LOT of screenshots and videos of events that are connected to the case. \n\nI don't want to be very egotistical and say \"oh my case is like no other\" but it really is like no other. I really feel like my case is very interesting and a lot of people would be on the edge of their seats learning about it. ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hahb1c/how_do_i_pitch_an_input_for_a_documentary/"
    },
    {
        "id": "1h9vk8d",
        "author": "allyourtv",
        "title": "A pretty good rundown of the best global TV of the year",
        "content": "Not just Netflix shows, although they obviously are the majority of the releases\n\n[https://www.allyourscreens.com/latest-news/global/2900-the-1st-annual-ays-global-television-awards-the-nominees](https://www.allyourscreens.com/latest-news/global/2900-the-1st-annual-ays-global-television-awards-the-nominees)",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h9vk8d/a_pretty_good_rundown_of_the_best_global_tv_of/"
    },
    {
        "id": "1h9nu6v",
        "author": "Ok-Fee-5067",
        "title": "Love never lies South Africa (on Netflix) is sooo good ! ",
        "content": "Have you seen it ?! \nThe episodes, the couples, the reunion everything was  great, genuine but also crazy ! \nThe reunion OMG the Lacheys from LIB.. please take note ! The truth was told ! It was crazy ! \nNo spoiler here so go watch it and we can discuss after 🫣",
        "upvotes": 18,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h9nu6v/love_never_lies_south_africa_on_netflix_is_sooo/"
    },
    {
        "id": "1h9xjz5",
        "author": "Mundane-Midnight-672",
        "title": "Monsters- Menendez Bros cast question",
        "content": "The scene at the beginning where Leslie is talking to the adoption agent- who plays that guy? I could’ve sworn it was the guy who played Buzz on Home Alone. ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h9xjz5/monsters_menendez_bros_cast_question/"
    },
    {
        "id": "1h9py36",
        "author": "sorakawa_94",
        "title": "Recs for light-hearted, cheerful show that has nice, bright cinematics?",
        "content": "Looking for a show to put in the background that I don't have to pay much attention to. \n\nI like the classic sitcoms like The Office, HIMYM, etc but find that the look of a lot of these shows is muted and dreary. Just IRL visuals I guess, but I want something brighter and more saturated. \n\nI took a quick peek at Emily in Paris and it seems to have the look I'm going for, but haven't actually tried the show yet. \n\nAny recommendations would be greatly appreciated. Thank you!!",
        "upvotes": 7,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1h9py36/recs_for_lighthearted_cheerful_show_that_has_nice/"
    },
    {
        "id": "1ha1fyc",
        "author": "goexuma",
        "title": "Crazy surges in volume",
        "content": "We have had Netflix for at least 5 years and this. Is only happening in the last few months.\nIrregardless of the show we are watching, the volume goes up like crazy on each act that has drama.\nI keep the keyboard on my lap just to control the increase s quicker than the mouse \nIs there any option to keep this from happening.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ha1fyc/crazy_surges_in_volume/"
    },
    {
        "id": "1h9fol2",
        "author": "PixelVapor",
        "title": "EXCLUSIVE: Richard Gadd may be personally sued as Fiona Harvey Netflix libel case looms",
        "content": "",
        "upvotes": 27,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1h9fol2/exclusive_richard_gadd_may_be_personally_sued_as/"
    },
    {
        "id": "1ha53yx",
        "author": "Shhh_Boom",
        "title": "Single's Inferno Season 1 - 2 (Korean Dating Show)",
        "content": "There are some curious things I've observed watching this show. I am very intrigued by it and the intersex dynamics between the contestants. \n\nThe men seem to lack [Single's Inferno Season 1 &amp; 2]&gt;!the aggression to claim their woman and I find it a bit comical but also frustrating at times. The guys lack confidence! They're overly cautious when they approach the women treating them like they're fragile. It's so gentlemanly to a fault. It's just not how things are supposed to be done. Their approach simply gives power to the women. It's so unusual for men to put their fate in the hands of a woman. It's so clumsy and awkward seeing men waiting with bated breath for a woman to pick them.!&lt;\n\nWhen the women experience rejection, it's just excruciating. It's painful to watch because they wear their emotions on their faces and that's just awful. [Single's Inferno Season 2]&gt;!One of the girls was so unfavoured by the men, she broke down in tears because she wasn't being picked. That was painful. I feel like the producers of the show had to step in to intervene as she eventually gets picked by a guy that's a twist entrant in the middle of the show. It's so against the grain of events it's clearly manufactured as the girl may have been contemplating leaving the show.!&lt;\n\nAnother problem that seems to be a societal norm is the [Single's Inferno Season 1 &amp; 2]&gt;!inability to move on. This criticism is levied against both men and women. When they are clearly not their targets favourite, they engage in this self destructive \"I refuse to move on\" thing that's so problematic. It's so twisted! That means that it's an obsession rather than a love interest. This is a critical flaw.!&lt;\n\nOverall the show is great. The women are beautiful and the men are good looking. It's nice seeing how things are done in a conservative society albeit frustrating at times. I do think that the episodes are too long and [Single's Inferno Season 1 &amp; 2]&gt;!I'm not a fan of the physical challenges that earn people first choice rights. I think they made a mistake here and should've gone with a random system instead.!&lt;",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ha53yx/singles_inferno_season_1_2_korean_dating_show/"
    },
    {
        "id": "1ha14nc",
        "author": "NightHawk_787",
        "title": "Netflix Canada app Picture in Picture not working on mobile",
        "content": "I've seen all of the stuff about the ad-supported plan not allowing picture-in-picture on mobile, but my family is on the standard HD plan with no ads, and I'm unable to get picture-in-picture working on my phone even though I have all of the permissions granted and picture-in-picture allowed in the settings.\n\nIs there something I'm doing wrong? Or is it my phone itself. I'm on a Samsung Galaxy A15 running the latest available version of Android (Android 14).\n\nNetflix picture-in-picture is working perfectly fine on my account through the mobile app on my old phone, which is an A70 running Android 11.\n\nHow might I troubleshoot this if the problem is something related to my phone?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ha14nc/netflix_canada_app_picture_in_picture_not_working/"
    },
    {
        "id": "1h9uz7c",
        "author": "Mentally_Soup",
        "title": "Pink and Blue progress bars???",
        "content": "I didn’t know this existed ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h9uz7c/pink_and_blue_progress_bars/"
    },
    {
        "id": "1h9k8gu",
        "author": "sandynikola",
        "title": "stuck on net flix",
        "content": "Anyone else having this problem? I am scrolling on shows and go to coming soon. I added first show, No Good Deed, to add to my reminder. Netflix will not let me move around after that. Have to exit Netflix and go back in. Every time I hit No Good Deed, I get stuck again.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h9k8gu/stuck_on_net_flix/"
    },
    {
        "id": "1h9yhoq",
        "author": "arma__virumque",
        "title": "Ads for the show during the show",
        "content": "I am watching Black Doves (rave!) and have gotten ads for this show during each episode. Does this happen to you? Bother you? I assume it's mostly common with a new and popular Netflix ™️ show. Still annoying",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h9yhoq/ads_for_the_show_during_the_show/"
    },
    {
        "id": "1h8yb9l",
        "author": "yuppieByDay",
        "title": "The auto play after finishing a series is a disease ",
        "content": "So was just finishing The Playlist on Netflix there was a solid 4 minutes left and was setting up the final scene of the show. No credits and still much part of the show. \n\nSuddenly a take over title card for prison break came up while still playing the audio and shortly after went to a trailer for it. And then the first episode of the show \n\nWtf? I excited and picked up where it left off and then it did play til the actual end. But why would they do this? Just so you’re on Netflix more? Super annoying. ",
        "upvotes": 65,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1h8yb9l/the_auto_play_after_finishing_a_series_is_a/"
    },
    {
        "id": "1h98021",
        "author": "kschaffs",
        "title": "The Madness: it’s ridiculous and hard to quit ",
        "content": " I’ve only been through the first three episodes and nothing makes sense in reality about the what Muncie does but I gotta know what stupid shit he does next. MF just got backstage,unstopped, on some broadway play staging area in 2024. Straight Ninja. \n\n",
        "upvotes": 12,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1h98021/the_madness_its_ridiculous_and_hard_to_quit/"
    }
]