[
    {
        "id": "1joono2",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1joono2/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1joonon",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1joonon/la_piola_friends_meetup/"
    },
    {
        "id": "1jv19jg",
        "author": "throwawayinaprial",
        "title": "Free2Move Car Disappeared During Rental / Auto scomparsa durante il noleggio con Free2Move",
        "content": "English version below.\n\nVoglio condividere un'esperienza assurda con Free2Move, nel caso qualcuno abbia vissuto qualcosa di simile o possa offrire consigli.\n\nIl 6 aprile, intorno alle 14:00, è stata noleggiata un’auto tramite l’app Free2Move per 4 ore. Dopo aver guidato in giro per Torino, l’auto è stata parcheggiata e chiusa in Via ****** verso le 17:20. Circa 50 minuti dopo, tornando sul posto, l’auto era completamente sparita.\n\nControllando l'app, risultava che il motore fosse acceso e il noleggio ancora attivo. È stato subito contattato il supporto, ma senza alcun aiuto concreto. Un operatore ha confermato che l’auto era stata chiusa alle 17:20 e poi riaperta alle 17:46 – non da noi. Ha detto che avrebbe segnalato il problema al supporto tecnico e di non fare nulla nel frattempo.\n\nNel frattempo, il contatore a minuti è partito. Il giorno dopo (7 aprile), il noleggio risultava ancora in corso. È stato fatto un nuovo tentativo con il supporto, ma l’operatore ha semplicemente respirato nel telefono senza dire nulla fino a chiudere la chiamata. Richiamando, un altro operatore ha detto solo di andare dalla polizia e fare una denuncia.\n\nIl processo di assistenza è stato un incubo. Molti operatori continuavano a ripetere “contattate la polizia e fate la denuncia” senza dare alcuna informazione utile. Farlo in Italia senza parlare bene l’italiano è stato estremamente difficile. Anche la polizia ha avuto problemi a comunicare con Free2Move – un agente ha chiamato la linea italiana, e anche lui ha ricevuto solo silenzio in risposta. La linea inglese non è stata meglio: niente istruzioni scritte, nessuna verifica delle comunicazioni precedenti, nessun dettaglio sul tracciamento GPS e rifiuto di parlare con l’agente.\n\nDopo ore di stress, la polizia ha accettato di prendere la denuncia, ma con grande riluttanza. Sono state passate più di 8 ore in questura, senza contare le ore perse al telefono con l'assistenza. In più, ci sono stati costi per taxi e giornate lavorative perse, inclusa la necessità di fungere da interpreti.\n\nAd oggi, nessuna conferma che non siamo responsabili per la scomparsa dell’auto, né alcun tipo di compensazione per lo stress, i costi sostenuti o il tempo perso. Tutta la documentazione è stata inviata.\n\nQualcuno ha vissuto un’esperienza simile con Free2Move? Siete riusciti a risolvere o ad ottenere un rimborso? Questa situazione è stata assurda e ogni consiglio o testimonianza sarebbe molto utile.\n\n-----------------\n\nJust wanted to share an infuriating experience with Free2Move in case others have dealt with something similar or can offer advice.\n\nOn April 6th around 2 PM, a car was rented via the Free2Move app for 4 hours. After driving around Torino, it was parked and locked on Via ****** around 17:20. About 50 minutes later, when returning to the car, it was completely gone.\n\nUpon checking the app, it showed the engine was running and the rental was still active. Support was contacted immediately, but no help was provided. One rep admitted the car had been locked at 17:20 and mysteriously unlocked again around 17:46 – which was not done by us. They said they’d escalate the issue to technical support and told us to wait.\n\nMeanwhile, the rental timer kept running. The next day (April 7th), the rental was still active, and another call was made to support. This time, the representative just breathed into the phone and stayed silent until the call ended. When calling again, the new rep told us to file a police report.\n\nThe entire process with support was a nightmare. Multiple reps gave no concrete help, repeating the same phrase: “contact police and file a report.” Trying to do this in Italy without fluency in Italian was extremely difficult. Even the police struggled to communicate with Free2Move — one officer called the Italian support line, only for the rep to repeat the silent treatment. Calls to the English support line were just as useless: no written instructions, no checking chat/email history, no explanation of GPS tracking, and a complete refusal to speak with the officer directly.\n\nEventually, after hours of stress and persistence, the police agreed to take the report — but not without hesitation. We spent over 8 hours in the station alone, not to mention the wasted time and energy speaking with unhelpful support staff. On top of that, we had to pay for taxis and lost a day of work, including time needed to act as our own translator.\n\nTo date, there has been no confirmation that we’re not liable for the car’s disappearance, nor any compensation offered for the stress, financial cost, or wasted time. Documents and reports have been submitted.\n\nHas anyone else experienced something like this with Free2Move? Did you manage to resolve it or get compensated? This experience has been absolutely ridiculous, and any advice or shared stories would be appreciated.\n\n",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jv19jg/free2move_car_disappeared_during_rental_auto/"
    },
    {
        "id": "1jv0vay",
        "author": "deadboyy",
        "title": "Consigli su trasloco",
        "content": "Avete avuto esperienze positive con qualche servizio in particolare? Consigli?\n\nNon ho tantissima roba ma non posso farlo da solo.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1jv0vay/consigli_su_trasloco/"
    },
    {
        "id": "1juot3j",
        "author": "PinApprehensive1555",
        "title": "Che voto dai a Torino?",
        "content": "Sulla base della tua esperienza e confrontandola con altre città come Milano, Berlino, Madrid, Lisbona, ecc., che valutazione daresti a Torino?",
        "upvotes": 2,
        "comments": 25,
        "media": null,
        "permalink": "/r/torino/comments/1juot3j/che_voto_dai_a_torino/"
    },
    {
        "id": "1jum7x3",
        "author": "_lostinthisworld_",
        "title": "Dove donare o vendere vestiti a Torino?",
        "content": "Ciao a tutti :) \nA Torino c'è un posto dove posso lasciare i vestiti che non uso più? Mi piacerebbe poterli vendere, ma se c'è un posto dove donarli, sarebbe perfetto. Grazie\n",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1jum7x3/dove_donare_o_vendere_vestiti_a_torino/"
    },
    {
        "id": "1jujk9j",
        "author": "lukrevor",
        "title": "Lavoro: vorrei lavorare a contatto con la natura e non in mezzo al cemento. Conoscete qualche azienda agricola (o ambienti simili) in cerca di dipendenti (part-time o tempo pieno)?",
        "content": "Cerco a Torino e provincia",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1jujk9j/lavoro_vorrei_lavorare_a_contatto_con_la_natura_e/"
    },
    {
        "id": "1ju8tti",
        "author": "Clan57",
        "title": "[18/04/2025 - 19:00] - Beers @ Isle of Skye Pub",
        "content": "Hello,\n\nI'm from Canada. I just moved to Torino &amp; don't know anyone in the city. Please come join me &amp; whoever else shows up for some drinks &amp; a chat.\n\nOn Friday, April 18 @ 19:00, I'll be at the Isle of Skye Pub - Corso Inghilterra, 25bis, 10138 Torino TO\n\nThank you!\n\nEdit: I am 37M and moved here with my partner. I work remotely, in tech =).",
        "upvotes": 12,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ju8tti/18042025_1900_beers_isle_of_skye_pub/"
    },
    {
        "id": "1juj46p",
        "author": "mandrake_55",
        "title": "Corso di arrampicata a  TO",
        "content": "Vorrei provare ad iscrivermi ad un corso di arrampicata ma ne so poco.\nQuali posti a TO consigliate?\nQuali sono i costi, approssimativamente, del corso?\nCome funziona il corso, come è strutturato un allenamento solitamente?",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1juj46p/corso_di_arrampicata_a_to/"
    },
    {
        "id": "1jugn28",
        "author": "Rough_Shoddy",
        "title": "Pallavolo a Torino: consigli per un appassionato tardivo",
        "content": "Ciao a tutti!\n\nDue anni fa, a 28 anni, ho deciso di sfidare la mia totale inesperienza sportiva iscrivendomi a un corso di pallavolo per principianti presso il CUS della mia città. Quella che era nata come una semplice curiosità è diventato sempre di più un vero interesse e a volte mi rammarico di non aver iniziato da giovane.\n\nNei prossimi mesi (indicativamente dopo l'estate) mi trasferirò a **Torino** e vorrei assolutamente continuare a giocare. Ho già dato un'occhiata al CUS locale, ma offrono corsi solo una volta a settimana, e mi piacerebbe trovare qualcosa di più frequente.\n\nQualcuno di voi conosce:\n\n* Strutture/palestre che offrono corsi di pallavolo per livello intermedio?\n* Gruppi amatoriali aperti a nuovi membri?\n\nNon mi sento ancora pronto per unirmi a una squadra competitiva, ma vorrei continuare a crescere in questo sport che mi ha conquistato.\n\nGrazie in anticipo per qualsiasi consiglio!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jugn28/pallavolo_a_torino_consigli_per_un_appassionato/"
    },
    {
        "id": "1juhrwy",
        "author": "Fede_ilSiciliano",
        "title": "Domandona per torino comics",
        "content": "Mi è sorto sto dubbio: andare con il cartello “Free Hugs” attaccato al corpo viene contato come cosplay? ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1juhrwy/domandona_per_torino_comics/"
    },
    {
        "id": "1jtomnx",
        "author": "memerguru",
        "title": "How is the life in torino",
        "content": "I recently got acceptance from polito and I'm considering accepting the offer. Can someone tell how's the life in torino and how's the place to live in and how are the night life, people over there. Btw I'm non european and first time traveling to EU",
        "upvotes": 16,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1jtomnx/how_is_the_life_in_torino/"
    },
    {
        "id": "1jtrmpr",
        "author": "Platform_Crocs",
        "title": "Trovare un appartamento per settembre",
        "content": "Ciao Raga, Sono uno studente americano internazionale e inizierò un programma di laurea magistrale a settembre. Sto cercando una stanza.  So che a volte vengono pubblicati annunci su Facebook, ma può essere difficile capire se sono scams, soprattutto perché mi trovo a NYC e probabilmente non potrò visitare l'appartamento fino a dopo aver pagato l'affitto e il deposito. Conosco abbastanza la città, ci ho passato un mese. Inoltre, ho vissuto a Roma per quasi un anno. Alcuni amici mi hanno consigliato di usare un'agenzia per trovare casa, e mi hanno detto che le commissioni valgono la pena. Vorrei anche aggiungere che sono un tipo gay e preferirei trovare un alloggio in un ambiente aperto e accogliente. Qualcuno ha qualche consiglio.\n\nScusate se il mio italiano non è perfetto haha",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1jtrmpr/trovare_un_appartamento_per_settembre/"
    },
    {
        "id": "1jtvpml",
        "author": "eventi_del_tano",
        "title": "Nuovi amici ed un bicchiere di vino?",
        "content": "Ciao chi vuole fare nuove amicizie accompagnati da un bicchiere di vino?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jtvpml/nuovi_amici_ed_un_bicchiere_di_vino/"
    },
    {
        "id": "1jti65e",
        "author": "CryingAlwaysCrying",
        "title": "Bloccato da un parcheggio",
        "content": "Raga ma voi che fate quando una macchina vi parcheggia talmente vicino che non riuscite più a uscire? \n\nMi è successo oggi, ho aspettato mezz’ora buca senza riuscire a muovermi. Per fortuna niente urgenze, ma è davvero una maleducazione assurda. Ho pensato di chiamare i vigili ma mi sembrava troppo… e non volevo neanche suonare il clacson all’infinito finché qualcuno si degna.\n\nSuccede spesso a voi? Idee su come gestirla senza impazzire?",
        "upvotes": 7,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1jti65e/bloccato_da_un_parcheggio/"
    },
    {
        "id": "1jt9ubi",
        "author": "arminredditer",
        "title": "Vi è mai capitato che la metro annunciasse la fermata sbagliata?",
        "content": "Oggi pomeriggio la voce ha detto \"Prossima fermata: Spezia\" quando in realtà era Marconi, e si è scatenato il panico",
        "upvotes": 21,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1jt9ubi/vi_è_mai_capitato_che_la_metro_annunciasse_la/"
    },
    {
        "id": "1jtkv69",
        "author": "Dangerous_Willow7496",
        "title": "Agenzie Immobiliari che si fanno chiamare “Banca Dati”",
        "content": "Buongiorno,\nSto cercando un alloggio a Torino e mi sono imbattuto già in 2 di queste realtà, queste “agenzie” che non si definiscono Agenzia ma “Banca Dati”, richiedono un pagamento di 240€ per poter essere messi in contatto con dei privati che affittano, dicono di avere svariati immobili e che loro si occupano solo del servizio di seguire il cliente fino a che non ha trovato casa.\nUna si chiama “Casa in un click” e l’altra “Piemonte Casa”, ho cercato recensioni del servizio o persone che ne hanno usufruito, ma non ho trovato nulla, qualcuno ne sa un po’ di più di me e ha voglia di spiegarmi? ",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1jtkv69/agenzie_immobiliari_che_si_fanno_chiamare_banca/"
    },
    {
        "id": "1jtstt5",
        "author": "AbilityFormer4095",
        "title": "Is this area safe?",
        "content": "Hi,\n\nI will be coming to Turin to study and plan to stay in the via belfiore in the san salvario district. How is the surrounding area? Would you recommend any other area for a student?",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1jtstt5/is_this_area_safe/"
    },
    {
        "id": "1jtml53",
        "author": "Possible_Shine_170",
        "title": "Aperto Bando Ammissioni del Collegio Einaudi",
        "content": "Ciao a tutti! Se è spam, siate liberi di eliminare il post.\n\nSe qualcuno di voi (o qualche amico/parente/conoscente) sta cercando un posto dove stare a Torino per studiare all’Uni o al Poli, segnalo che è **uscito il bando del Collegio Einaudi** per l’anno accademico 2025/26!\n\nIl Collegio Einaudi è un collegio di merito per studenti universitari. Praticamente una residenza, con prezzi determinati in base al proprio ISEE e un programma di formazione personalizzato per ogni studente. Ci sono 5 sedi sparse per Torino e c'è tempo fino al 30 giugno per fare domanda!  \nQui trovate il bando: [https://www.collegioeinaudi.it/ammissioni-2025-26/](https://www.collegioeinaudi.it/ammissioni-2025-26/)\n\nMagari può tornare utile a qualcuno! Grazie mille!\n\nhttps://preview.redd.it/sx9t3ywebfte1.jpg?width=1379&amp;format=pjpg&amp;auto=webp&amp;s=7394af38ea193b4c38e6cd592b41722a64c2521f\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jtml53/aperto_bando_ammissioni_del_collegio_einaudi/"
    },
    {
        "id": "1jtfrmi",
        "author": "Trau_94",
        "title": "Consigli tatuatore",
        "content": "Sto impazzendo, vivo a Torino da circa 7 anni e sto faticando a trovare un tatuatore che sappia fare un determinato stile di tatuaggio. Attualmente ho 4 tatuaggi che come stile stanno sul trash polka, stile che amo e che a quanto pare qui non è molto utilizzato. Conoscete degli studi SERI di tatuatori che sanno farlo (a torino o comunque nei comuni limitrofi)",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1jtfrmi/consigli_tatuatore/"
    },
    {
        "id": "1jt791o",
        "author": "Rexus752",
        "title": "Zanzariere a Torino",
        "content": "Abito a Torino da un anno e mezzo e ho notato che, tra tutte le case in cui sono stato, non ne ho ancora vista una fornita di zanzariere.\nSono stato io sfigato o le zanzariere a Torino (o, più in generale, al nord) sono poco diffuse? E se sì, perché? C'è un motivo particolare?",
        "upvotes": 5,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1jt791o/zanzariere_a_torino/"
    },
    {
        "id": "1jt4nwn",
        "author": "PinApprehensive1555",
        "title": "Qualche festa di strada (street party)?",
        "content": "Ci sono feste di strada con musica elettronica a Torino? O un posto aperto per ascoltare musica, ballare e bere?",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1jt4nwn/qualche_festa_di_strada_street_party/"
    },
    {
        "id": "1jssqpr",
        "author": "Original_Draw_9492",
        "title": "Migliore pizzeria zona lingotto?",
        "content": "Forse avrei dovuto farlo prima questo post ma conto di ricevere delle buone risposte già entro stasera 😬\nComunque una buona pizzeria in zona lingotto o che consegna fino a lì senza perderci ore di tempo\nMa soprattutto pizzeria che faccia pizze non ipersottili😅\nVengo dal sud, la pizza non deve essere tanto spessa ma neanche troppo sottile come ho notato fare qui spesso 🙈, il fatto è che così poi tocca ovviamente mangiarla ripiegata su se stessa\nComunque mi fido del vostro giudizio \n\nEdit: non deve essere necessariamente pizza napoletana, piuttosto pizza più in stile siciliano, se esiste a Torino 😅",
        "upvotes": 7,
        "comments": 17,
        "media": null,
        "permalink": "/r/torino/comments/1jssqpr/migliore_pizzeria_zona_lingotto/"
    },
    {
        "id": "1jsvg72",
        "author": "Gullible_Drummer_246",
        "title": "Piloti di parapendio per condivisione macchina",
        "content": "Sono un pilota di parapendio appena brevettato che però ancora non ha la patente.\n\nMi chiedevo se ci fossero piloti che vanno a volare nei dintorni che sarebbero interessati a prendere un passeggero con attrezzatura che magari aiuta un po’ con la benzina.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jsvg72/piloti_di_parapendio_per_condivisione_macchina/"
    },
    {
        "id": "1jsf8h8",
        "author": "maschera84",
        "title": "Possibile che piova tutto Aprile?",
        "content": "Con la mia famiglia, passeremo 3 settimane nella bella Torino ad Aprile.\n\nSappiamo che Torino ha un clima ballerino, però un po' ci siamo sorpresi quando abbiamo visto che pioverà tutto il tempo che saremo lì.\n\nDomanda ai residenti: è possibile che piova ininterrottamente per così tanto tempo ad Aprile?",
        "upvotes": 39,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/b66yr9ltc3te1.jpeg?auto=webp&amp;s=5199bc1193b790d0a7222b241774b88988a5e961"
        },
        "permalink": "/r/torino/comments/1jsf8h8/possibile_che_piova_tutto_aprile/"
    },
    {
        "id": "1jsqhf5",
        "author": "wtfiswrongwpeopl3",
        "title": "Barber Recommendations for Mullet",
        "content": "Hello! I am thinking to get a mullet. Do you have any recommended barbershop in Torino? It would be better if they are able to speak english. \n\nThanks in advance!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jsqhf5/barber_recommendations_for_mullet/"
    },
    {
        "id": "1jswey7",
        "author": "mutantgenes",
        "title": "Vinted",
        "content": "Does the post office sell packages to pack clothes for shipping? And how much do they cost",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jswey7/vinted/"
    },
    {
        "id": "1jrzhb3",
        "author": "Old-Satisfaction-564",
        "title": "Metropolitana linea 2",
        "content": "Bene fino al 2032 meglio andare a piedi .........",
        "upvotes": 145,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8arnt23ygzse1.jpeg?auto=webp&amp;s=1a115d737dd6d6632f778a9915b278806148c45a"
        },
        "permalink": "/r/torino/comments/1jrzhb3/metropolitana_linea_2/"
    },
    {
        "id": "1jsnkei",
        "author": "mandrake_55",
        "title": "Locali con Vibes simili al Comala?",
        "content": "mi consogliate de",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jsnkei/locali_con_vibes_simili_al_comala/"
    },
    {
        "id": "1jspykz",
        "author": "Majestic_State5087",
        "title": "Rinofiller",
        "content": "Ciao a tutti, vorrei iniziare un trattamento di Rinofiller a Torino, qualcuno ha qualche consiglio ed esperienze da condividere?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jspykz/rinofiller/"
    },
    {
        "id": "1jsdtk7",
        "author": "cicintrip",
        "title": "Workshop Ultra Paesaggio Continuo",
        "content": "Ciao (:\n\nSto organizzando con 2 amici un workshop al Circolo del Design di Torino il 12 e 13 aprile, we prossimo. \n\nSi tratta principalmente di esplorazione urbana, manipolazione dell’immagine e creative coding. \n\nQui potete trovare le info —&gt; https://circolodeldesign.it/evento/ultra-paesaggio-continuo-photo-finish-e-osservatori-mobili/\n\nSpero interessi a qualcuno e di vedervi lì!",
        "upvotes": 4,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IufXSQ3hxaLN5P_7w11ypQV3SfVRzPqMdW4S-4x-zW4.jpg?auto=webp&amp;s=8e9afb31af797125850a8e3e6d7d35c7263316c0"
        },
        "permalink": "/r/torino/comments/1jsdtk7/workshop_ultra_paesaggio_continuo/"
    },
    {
        "id": "1js4jp8",
        "author": "[deleted]",
        "title": "Qual è il modo migliore per dimostrare che sono straniero ma non sono Maranza?",
        "content": "So che l'Italia è un posto difficile per gli stranieri, ma non così tanto. Qual è il modo migliore per dimostrare che non sono una maranza che vive in Italia?",
        "upvotes": 5,
        "comments": 36,
        "media": null,
        "permalink": "/r/torino/comments/1js4jp8/qual_è_il_modo_migliore_per_dimostrare_che_sono/"
    }
]