[
    {
        "id": "1h3xmgd",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://t.me/+K_tQ4Zzi0S80YjFk): Gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[LA TAVERNA DELLO STUDENTE](https://t.me/latavernadellostudente/5207): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g30QJSClHjRAUvFBqKJa-Re4duFBniS6HkLBoJRdgOQ.jpg?auto=webp&amp;s=2c44cf9a902b77de7dce3b5cad542f22791fb32e"
        },
        "permalink": "/r/torino/comments/1h3xmgd/la_piola_friends_meetup/"
    },
    {
        "id": "1h3xmg1",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram group for apartment hunting: https://t.me/CaseStudentiTorino\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 2,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1h3xmg1/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1h5ss1p",
        "author": "mo_one",
        "title": "Un'auto è andata a fuoco a corso regina margherita",
        "content": "",
        "upvotes": 54,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0dmbocgj4o4e1.jpeg?auto=webp&amp;s=e8f18e77f57a213785bcffab5a09c119a17654ac"
        },
        "permalink": "/r/torino/comments/1h5ss1p/unauto_e_andata_a_fuoco_a_corso_regina_margherita/"
    },
    {
        "id": "1h6d8cf",
        "author": "Distinct_Location910",
        "title": "Mancia ai tecnici: sì o no? Consigli per chi si è appena trasferito!\n\n\n\n\n\n\n\n\n\n\n",
        "content": "Ciao a tutti,\n\nMi sono appena trasferito a Torino con la mia famiglia dal Belgio e avrei una domanda: è normale lasciare la mancia ai tecnici? Parlo di persone che installano internet, consegnano elettrodomestici o fanno riparazioni in casa. Abbiamo già avuto qualche consegna e devo dire che tutti sono stati molto gentili e disponibili. Il nostro italiano è ancora molto basilare e finora non abbiamo mai lasciato mance, anche per non sembrare maleducati o dare l’impressione sbagliata, visto che non navighiamo certo nell’oro!\n\nVorrei capire se è una cosa che si usa fare qui, così da essere preparati per il futuro. Qualche consiglio?\n\nGrazie mille!",
        "upvotes": 2,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1h6d8cf/mancia_ai_tecnici_sì_o_no_consigli_per_chi_si_è/"
    },
    {
        "id": "1h6g94v",
        "author": "SeamsandDreams",
        "title": "Housing search in Torino (2000 euro per month)",
        "content": "Hello,\n\nI'm moving to Torino from France with my husband in a few months and would like help from a housing search company to do the search for us, negotiate the lease etc. Do you know of any companies (that aren't scams) that provide this service? We are looking to pay about 2000 euro per month for an apartment and have heard finding housing can be difficult. Any advice is appreciated.",
        "upvotes": 0,
        "comments": 24,
        "media": null,
        "permalink": "/r/torino/comments/1h6g94v/housing_search_in_torino_2000_euro_per_month/"
    },
    {
        "id": "1h6ew7u",
        "author": "gianlucadinat",
        "title": "Tecnico inutile",
        "content": "Prendo un giorno di ferie per aspettare il tecnico Fastweb per un trasloco di linea (dal terzo piano al quarto piano eh, non ho cambiato quartiere) si presenta puntualissimo e mi dice: “come immaginavo non si può far nulla, la ricontatteranno per fissare un nuovo appuntamento”\nSono incazzato come una bestia",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1h6ew7u/tecnico_inutile/"
    },
    {
        "id": "1h5nqbb",
        "author": "mo_one",
        "title": "Ma come cazzo si fa a convalidare il biglietto se tutte le macchinette sul tram sono fuori uso?",
        "content": "Oggi ero salito sul 3 per andare in uni, e quando vado a convalidare il biglietto, vedo sulla macchina \"fuori uso\" ci provo cmq, ma ovviamente non funziona, quindi seplicemente spero che il controllore non ci sia, perché tanto quando mai ci sono? Però ovviamente dopo due minuti mi ritrovo il &gt;!porco dio!&lt; di controllore accanto a me che controlla la persona che mi sta vicino, quindi corro verso l'altra macchinetta ed oviamente &gt;!porca madonna troia!&lt; anche essa è fuori uso (sorprendente). Quindi non mi tocca altro che scendere alla prossima prima che becchi me, e salire sul tram successivo. \n\nMa come &gt;!gesù porco!&lt; fanno ad esigere che tu paghi il biglietto se le loro fottutissime macchinette m'anco funzionano? Ma come cazzo fa ad essere mia responsabilità ad installare e capire come funziona una app di merda, così è più facile per loro a fottermi i soldi, anche se pagare pagare il tram con il biglietto aquistato in tabaccheria è un modo del tutto leggittimo? Ceh, secondo voi, se gli dicevo che non funzionavano le macchinette mi avrebbe cmq fatto la multa? Perché poi c'era una terza macchinetta in fondo — che non avevo controllato, perché il tram era stra fottutamente imbottito di gentaglia — e se essa funzionava allora di sicuro me lo metteva in culo, perché quando mai i controllori della GTT hanno qualità umane come l'empatia? Poi non gli volevo parlare perché non ho voluto beccarmi la multa. \n\nMa sto punto dev'essere intenzionale, loro mettono le macchinette fuori uso, così possono raccogliere il big cash da tutte le multe dai poveri sfigati che sono incapaci di usare le arti arcane magiche per far funzionare la macchinetta così posso pagare il biglietto alla nobile GTT che sacrifica tutto pur per provvedere un sevizio di qualità agli ingrati villani cittadini di Torino.\n\nMa sul serio, che avrei dovuto fare in una situazione del genere?",
        "upvotes": 46,
        "comments": 38,
        "media": null,
        "permalink": "/r/torino/comments/1h5nqbb/ma_come_cazzo_si_fa_a_convalidare_il_biglietto_se/"
    },
    {
        "id": "1h6c4r5",
        "author": "Lamassaia",
        "title": "Fan dello sci",
        "content": "Chi fan dello sci per questa stagione?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1h6c4r5/fan_dello_sci/"
    },
    {
        "id": "1h5swn6",
        "author": "NoPromotion1328",
        "title": "CAPODANNO TORINO",
        "content": "Io e la mia ragazza (24 e 20 anni) passeremo il capodanno a torino, ma è la prima volta per entrambi che vediamo la citta e di conseguenza non sappiamo minimante cosa fare. Siamo disperatamente in cerca di idee su cosa fare o inviti! ",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1h5swn6/capodanno_torino/"
    },
    {
        "id": "1h5wwbu",
        "author": "fabi-to",
        "title": "Corso per imparare a fare il pane ",
        "content": "Ciao bellezze. Qualcuno conosce un posto che faccia corsi per imparare a fare il pane a Torino? Mi sembra un regalo carino da fare ma non trovo molte opzioni. \n\nGrazie!!",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1h5wwbu/corso_per_imparare_a_fare_il_pane/"
    },
    {
        "id": "1h60sk4",
        "author": "PutGroundbreaking271",
        "title": "ISO volunteer work in torino",
        "content": "i have recently moved to Torino and i dont speak the italian language so well. I am currently taking lessons but i would like to do volunteer work where i can interact with people and get to practice my italian a bit too. any recommendations? i (30F) speak perfect english! ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1h60sk4/iso_volunteer_work_in_torino/"
    },
    {
        "id": "1h5r0fq",
        "author": "nanell0",
        "title": "Mappa luoghi di Torino",
        "content": "Ciao ragazzi, sarò a Torino per la prima volta - la seconda in realtà, la prima fu per il C2C qualche anno fa, purtroppo non ebbi tempo di visitare la città - per 3 giorni il prossimo weekend. Ho consultato la vostra, veramente ben fatta, wiki ma purtroppo il link alla mappa/guida è, leggendo quanto riportato più in basso, nuovamente morto. Per caso qualcuno ha la versione pdf salvata? Sarebbe comodo averne una copia!\n\nInoltre, cosa mi consigliate di fare/vedere/mangiare oltre ai classici must have/see di Torino? Il [video](https://youtu.be/mZQ9_wRkjQo?si=JM-vyTuWEusqTZaT) di Yotobi sulla Torino esoterica mi stuzzicò tantissimo anni fa, vorrei vivere delle belle esperienze che esulano dal solito turismo.\n\nInfine, sarò con la mia ragazza, sarebbe bello provare la cucina piemontese in un ristorante tipico che amate :) \n\nGrazie mille!",
        "upvotes": 0,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3gj6_dpkCqQgPgz79prl1-lKnCxFZAqw4kksGDKtYwI.jpg?auto=webp&amp;s=152965ef8b0dda30eb70167dabd8104639261ae0"
        },
        "permalink": "/r/torino/comments/1h5r0fq/mappa_luoghi_di_torino/"
    },
    {
        "id": "1h5oq1e",
        "author": "Radiant-Building-647",
        "title": "Questionario sulle zone a traffico limitato (ZTL) di Torino",
        "content": "https://preview.redd.it/okhdnlze9n4e1.png?width=650&amp;format=png&amp;auto=webp&amp;s=6099664dc60c0bb4d92ef38b64df08938c8ab541\n\nIT: Nell'ambito dei nostri studi M1 in Risorse, ambiente, società in transizione all'Università di Grenoble, stiamo lavorando a un progetto sulle zone a traffico limitato (ZTL) di Torino. Per farlo, abbiamo bisogno di raccogliere le vostre opinioni ed esperienze sulle ZTL attraverso un questionario.\n\nSe vivete a Torino o nei dintorni, saremmo interessati a conoscere le vostre opinioni, preoccupazioni ed esperienze sulle ZTL.\n\nQuesto ci aiuterà a completare il nostro progetto di ricerca. Il questionario contiene 20 domande e richiede circa 10 minuti. Il questionario rimane anonimo.\n\nEcco il link per il questionario: [Questionario ZTL](https://docs.google.com/forms/d/e/1FAIpQLSePbB_7NHgq1mY_S-MME9nf2PXlsbjq88se6rG1pL_uAQF2Mg/viewform)\n\nGrazie per il vostro aiuto e non esitate a condividere questo post!\n\n\n\nEN: As part of our M1 studies in Resources, environment, society in transition at the university of Grenoble, we are working on a project on low-emission zones in Turin. To do this, we need to collect your opinion and experience relating to the low-emission zones via a questionnaire.\n\nIf you live in or around Turin, we would be interested to hear your opinions, apprehensions and experiences on low-emission zones.\n\nThis will help us complete our research project. This questionnaire contains 20 questions and takes about 10 minutes. The questionnaire remains anonymous.\n\nHere is the link for the questionnaire: [Questionario ZTL](https://docs.google.com/forms/d/e/1FAIpQLSePbB_7NHgq1mY_S-MME9nf2PXlsbjq88se6rG1pL_uAQF2Mg/viewform)\n\nThanks for your help and please don't hesitate to share this post!\n\n",
        "upvotes": 0,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/PG4JNnsVl7OkUKNNem1uRjUBQ8swyu4YELK4dRqr_ls.jpg?auto=webp&amp;s=169a6954484f581788a514da962ff71526d3455c"
        },
        "permalink": "/r/torino/comments/1h5oq1e/questionario_sulle_zone_a_traffico_limitato_ztl/"
    },
    {
        "id": "1h5mqh5",
        "author": "Inevitable-You-98",
        "title": "Consiglio regalo di Natale ",
        "content": "",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1h5mqh5/consiglio_regalo_di_natale/"
    },
    {
        "id": "1h5m3qa",
        "author": "Different_Handle8411",
        "title": "Copisterie economiche a Torino (urgente!!!!!)",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1h5m3qa/copisterie_economiche_a_torino_urgente/"
    },
    {
        "id": "1h4wcos",
        "author": "Lauri8292",
        "title": "Torino, zona Aurora? (via Cuneo, via Bra, via Carmagnola, ecc...)",
        "content": "Ciao a tutti,  \nvorrei qualche opinione oggettiva sulla zona Aurora della città di Torino (magari di chi ci vive).  \nHo trovato un immobile molto carino, ma le vie citate nel titolo come sono?  \nSono una ragazza, vivo da sola e ogni sera dovrei uscire, perché ho un cane... E la stessa proprietaria ha ribadito più volte che la zona non è delle migliori (anzi, ci è andata giù piuttosto pesante: ha anche detto che aveva affittato la casa a due ragazze - non insieme - che sono rimaste solo un paio di mesi, perché non si sentivano sicure quando uscivano da sole di sera).  \nMi hanno parlato malissimo anche dei giardini Alimonda, che sono proprio lì dietro.  \nChe ne pensate? Può una ragazza andare a vivere lì da sola e fare due passi dopo cena, oppure la zona è così tremenda come dicono? Ero molto entusiasta della casa, però sto iniziando ad avere delle remore...\n\nGrazie in anticipo delle risposte",
        "upvotes": 1,
        "comments": 33,
        "media": null,
        "permalink": "/r/torino/comments/1h4wcos/torino_zona_aurora_via_cuneo_via_bra_via/"
    },
    {
        "id": "1h4x0nm",
        "author": "just_a_dude_______",
        "title": "Fare il modello ",
        "content": "Cerco un'opportunità part time/occasionale giusto per mettere due soldi da parte. Come funziona questo mondo? Si contattano le agenzie? Si fanno provini? È facile essere scammati? Conoscete agenzie affidabili? Qualsiasi info è ben accetta, grazie.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1h4x0nm/fare_il_modello/"
    },
    {
        "id": "1h4p7q9",
        "author": "-Spinal-",
        "title": "Dentista",
        "content": "Devo trovare un dentista, preferibilmente uno che sa anche lavorare con i bambini…\n\nQualcuno mi consiglia ?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1h4p7q9/dentista/"
    },
    {
        "id": "1h4rzv4",
        "author": "Aggravating_Line_623",
        "title": "Torrone Sebaste",
        "content": "Sapete indicarmi dove si trovano i furgoni del Torrone Sebaste? So di uno in via Garibaldi angolo corso Valdocco, ma per me è piuttosto scomodo. Ce n'era un altro in piazza Carducci angolo via Genova, ma non so se c'è ancora.\n\nAltri?",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1h4rzv4/torrone_sebaste/"
    },
    {
        "id": "1h4rhyg",
        "author": "allfearisgone",
        "title": "come posso pagare la tassa UniTo senza un codice fiscale?",
        "content": "come posso pagare la tassa UniTo senza un codice fiscale?\n\nSalve a tutti! Non sono cittadino dell'Unione europea, soprattutto non italiano, ma UniTo mi ha messaggiato chiedendomi di pagare la tassa di 60 euro per la domanda. Tecnicamente non aprono la registrazione fino a febbraio, ma stanno chiedendo la tassa di iscrizione ora, quindi voglio pagarla. online ho visto che posso pagare solo se ho un codice fiscale, ma visto che sono a Torino per due settimane, ho deciso di fissare un appuntamento per ottenere un codice fiscale, ma non sarà fino a pochi giorni dopo la data di scadenza del 6 dicembre. Devo andare di persona e pagare in contanti o con carta di credito? \n\nVoglio farla in fretta e sto facendo del mio meglio. Mi sono anche fidato di amici italiani a Torino. Potrei pagare 60 euro per pagarlo per me? O non funziona così? Mi dispiace di fare così tante domande, sono uno straniero che sta cercando di andare a scuola qui. Grazie mille \n\n\n\n\n*anche, scusa se ho sbagliato scrivere qualcosa. L'italiano non è la mia prima lingua",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1h4rhyg/come_posso_pagare_la_tassa_unito_senza_un_codice/"
    },
    {
        "id": "1h4qabw",
        "author": "No-More-Blue",
        "title": "Negozio a Torino che compra PC usati?",
        "content": "Buongiorno, vorrei vendere il mio vecchio portatile e smartphone (in buone condizioni, o per pezzi di ricambio) e vorrei sapere se c'è un negozio a Torino che potrebbe acquistarli.\nNon mi interessa farci grandissimi soldi, mi basta sapere che non vanno buttati in un campo di rifiuti.\nGrazie a chi risponderà ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1h4qabw/negozio_a_torino_che_compra_pc_usati/"
    },
    {
        "id": "1h4c9k5",
        "author": "Myboringaffairs",
        "title": "Compagnia concerti alternative",
        "content": "Ciao a tutti,sono un ragazzo di 28 anni e mi piacerebbe trovare qualcuno/a con cui andare a vedere concerti di musica alternative,posti come Spazio 211,Offtopic...\nPurtroppo non ho molte persone con cui condividere questa passione, scrivetemi se vi va,anche solo per fare due chiacchiere sulla scena musicale.\n",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1h4c9k5/compagnia_concerti_alternative/"
    },
    {
        "id": "1h4gm3n",
        "author": "mainapizza",
        "title": "Hiking raggiungibili con i mezzi? ",
        "content": "Ciao :)\nIl prossimo weekend non ho la macchina ma vorrei provare lo stesso ad organizzare un piccolo giro di uno o due giorni, voi conoscete posti, anche tranquilli, raggiungibili con i mezzi?\nGrazie ",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1h4gm3n/hiking_raggiungibili_con_i_mezzi/"
    },
    {
        "id": "1h4gdwu",
        "author": "paperellaghei",
        "title": "Amicizie Canavese",
        "content": "Ciao a tutti, siccome noto spesso che molti scrivono per organizzare/incontrare gente ci provo anche io:\n\nSono ormai M29, negli anni ho sempre frequentato istituti (università e no) a Torino ma dopo un periodo di lavoro a Milano e, nel contempo, di studi per la magistrale a Torino mi sono spostato a lavorare a Cirié. \n\nInutile dire che nel periodo di covid+università+lavoro mi sono mangiato il gap 24-28 anni e ormai tra vecchie amicizie che non trovo più perché o sono all'estero o già figliati o fidanzati e accasati, non ho molto da fare se non aiutare i miei nel weekend.\nNegli anni ho sempre \"corso\" per sistemarmi lavorativamente parlando ma a volte mi fermo e mi accorgo che o non c'è nessuno o quei 2-3 rimasti sono vecchi amici fuori sede che fanno fatica ad arrivare a fine mese e a cui a volte gli offro una birra/pizza pure di far qualcosa.\n\nNon ho molti hobby essendo che ho sempre cercato di tener impegnato il tempo libero, attualmente sto cercando di prendere l'abilitazione per diventare consulente finanziario autonomo ma in genere mi piacciono eventi techno, poker, politica, finanza, poker, il buon cibo e vino, escursionismo, pub e snowboard (anche se sono alle prime armi).\n\nSiccome non conosco praticamente nessuno della zona, se anche tu sei del canavese (Venaria, Caselle, Borgaro,  Cirié, Leinì, Rivarolo) scrivimi 😄.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1h4gdwu/amicizie_canavese/"
    },
    {
        "id": "1h4osdz",
        "author": "al_amhara1987",
        "title": "Solitudine &amp; Torino",
        "content": "Almeno due volte a settimana c'è qualcuno che posta un disperato \"sono solo, cercasi compagnia\". Ma è una mia impressione o succede solo su r/Torino? ",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1h4osdz/solitudine_torino/"
    },
    {
        "id": "1h48kvw",
        "author": "_gitza",
        "title": "Piste di pattinaggio su ghiaccio",
        "content": "Salve, come da titolo. Sapreste consigliarmi una pista di pattinaggio su ghiaccio a Torino per studenti fuorisede sprovvisti di auto? Non potrei spostarmi fuori città. Grazie mille!",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1h48kvw/piste_di_pattinaggio_su_ghiaccio/"
    },
    {
        "id": "1h4btso",
        "author": "parkerodinsons",
        "title": "Where do i recycle monster cans",
        "content": "i have a small collection of like 15 monster cans and i dont know what to do with them, they are not accepted by recopet",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1h4btso/where_do_i_recycle_monster_cans/"
    },
    {
        "id": "1h4bcy2",
        "author": "Top-Text-7727",
        "title": "Miglior azienda per internet",
        "content": "Salve amici. Riecco qui il terrone trasferito a Torino per lavoro.\nHo contattato già un mese fa Linkem per la connessione a casa, perché mi sembrava ideale mettere il device fuori al balcone, senza rompere il cazzo con fibra, cavi che non vanno et simili.\nTuttavia non sono stato piu contattato dai tecnici per l'installazione del device, quindi mi sono rotto il cazzo e ho rescisso il contratto.\nDetto ciò, quale è il vostro provider e secondo voi quale è il migliore in città?io sto in Aurora vicino il museo Lavazza. ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1h4bcy2/miglior_azienda_per_internet/"
    },
    {
        "id": "1h3y8tb",
        "author": "Hopeful_Crew_6787",
        "title": "Dove farsi fare un abito blu classico?",
        "content": "Buongiorno a tutti,\n\nSono interessato a farmi fare un abito blu classico e vorrei sapere qui in città che opzioni ci sono per il su misura. \nVoi che esperienze avete avuto e quanto avete speso? \nChe consigli e indicazioni dareste?",
        "upvotes": 6,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1h3y8tb/dove_farsi_fare_un_abito_blu_classico/"
    },
    {
        "id": "1h3zq9j",
        "author": "jenefaisquebadiner",
        "title": "Enoteche imperdibili",
        "content": "Ciao a tutti!   \nSono discretamente appassionata di vini, ma mi rendo conto di acquistarli sempre negli stessi posti.  \nAvete qualche suggerimento di belle enoteche in città, con una buona selezione (soprattutto di rossi piemontesi) e magari personale esperto con cui fare due chiacchiere?   \nBonus se specializzati in Barbaresco e in centro! ",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1h3zq9j/enoteche_imperdibili/"
    },
    {
        "id": "1h3yhqt",
        "author": "Professional-Fly2853",
        "title": "River Po Kayaking?",
        "content": "Ciao tutti,\n\nI wonder if anyone knows about the rules for the river Po specifically along Parco Valentino… if I have an inflatable kayak I travel with, can I kayak around the river Po in the Parco Valentino area?\n\nThank you in advance!",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1h3yhqt/river_po_kayaking/"
    },
    {
        "id": "1h42bre",
        "author": "ZayaBt-",
        "title": "Best christmas vibe town/city",
        "content": "Ciao a tutti!\n\nWhat are some towns in Piedmont with the best Christmas atmosphere that are reachable by public transportation? I don't care much about the Christmas markets etc, just some good decorations and things to see around will do. (just for a day trip)\n\nAny recommendations? Thanks in advance!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1h42bre/best_christmas_vibe_towncity/"
    }
]