[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 47,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 17,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qo513x",
        "author": "Illrollonshabbos",
        "title": "Watch Secret Mall Apartment …",
        "content": "I went by this several times before I finally had to stop and see what it was about. The trailer doesn’t do it justice. Just when I think I’ve seen everything a gem like this appears. ",
        "upvotes": 214,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1qo513x/watch_secret_mall_apartment/"
    },
    {
        "id": "1qoewi2",
        "author": "Deep20779",
        "title": "Which Netflix shows got cancelled way too early and were seriously underrated?",
        "content": "Netflix cancels a lot of stuff, but some shows really didn’t deserve it.\n\nFor me, it’s Locke &amp; Key — great concept, solid world-building, and it felt like it still had so much story left to tell.\n\nCurious what everyone else thinks — which cancelled Netflix show do you think was underrated and ended too soon?",
        "upvotes": 34,
        "comments": 230,
        "media": null,
        "permalink": "/r/netflix/comments/1qoewi2/which_netflix_shows_got_cancelled_way_too_early/"
    },
    {
        "id": "1qohkbx",
        "author": "IncompleteBM",
        "title": "Which Netflix shows should’ve been cancelled earlier?",
        "content": "In contrast to the “which shows were killed too soon?” discussion.  \n\nI’ll say that:\n\n“You” - I thought it peaked at season 2. Season 3, ok fine. After that? Ridiculous. \n\n“Stranger things” - yeah, lots of hype. It’s been on way too long and is a shell of itself. \n\n“Emily in Paris” - “fun” escapist show for a couple seasons. Not sure what the point of it is now. \n\n“In the dark” - I know it wasn’t a Netflix produced show but it’s obviously had more viewership on there. It should’ve ended at season 3. \n",
        "upvotes": 21,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1qohkbx/which_netflix_shows_shouldve_been_cancelled/"
    },
    {
        "id": "1qo6f7b",
        "author": "TriggeredEvil",
        "title": "How did you feel about His &amp; Hers?",
        "content": "Did anyone else feel kind of bored or confused at first watching His &amp; Hers?\nThe first couple episodes felt slow and a bit odd to me and I almost stopped watching, but I’m glad I didn’t because I actually really liked the ending. It was so unexpected.\nI just wish the earlier episodes had done more to keep my attention. Curious what everyone else thought about it.",
        "upvotes": 71,
        "comments": 75,
        "media": null,
        "permalink": "/r/netflix/comments/1qo6f7b/how_did_you_feel_about_his_hers/"
    },
    {
        "id": "1qo1zuo",
        "author": "Danaeger",
        "title": "Why are there never any subtitles when characters are speaking in foreign languages?",
        "content": "Watching Homeland right now and whenever anyone speaks Arabic zero subtitles.\n\nI suppose you’d expect this to be included in the original media, but still annoying as fuck.\n\nAlso for Homeland specifically, enabling subtitles changes the position depending on the scene.\n\nBottom left, bottom right, some text on the left and some text on the right? WTF?! Why not keep it centred?\n\nI would upload a photo but I can’t here.. check it out for yourselves.. strange as fuck.",
        "upvotes": 37,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1qo1zuo/why_are_there_never_any_subtitles_when_characters/"
    },
    {
        "id": "1qnvoz0",
        "author": "Klutzy_Hand_132",
        "title": "Harlan Coben",
        "content": "Is anyone else obsessed with Harlan Coben.\nI watched all his Netflix series ...read his books.. and now im watching his new true crime series.\nLike I just cant get enuff\nI cant be the only one right ? ",
        "upvotes": 71,
        "comments": 156,
        "media": null,
        "permalink": "/r/netflix/comments/1qnvoz0/harlan_coben/"
    },
    {
        "id": "1qohtuq",
        "author": "Silent_Wish7138",
        "title": "Coming Soon Missing",
        "content": "There used to be a “coming soon” section on the app to see what is going to be released soon. I feel like I’m going crazy and cannot find it on there now. Did they take it off the app? \n\nThat is how I selected what I was looking forward to watch that they were going to release. ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qohtuq/coming_soon_missing/"
    },
    {
        "id": "1qoay4g",
        "author": "RosieTheFoxUwU",
        "title": "Why can’t i listen to the english dub?",
        "content": "Can anyone help me with this? I am finnish and located in Finland. I used to have no issues with netflix letting me choose the language of the dub. For some reason the same series i literally watched with english dub and subtitles last saturday is now only giving me the option of the finnish dub (which is kinda atrocious). Is this some sort of liscencing issue? It worked just fine less than a week ago. I’ve tried changing my account language and updating the app but it didn’t work. Any advice appericiated!",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qoay4g/why_cant_i_listen_to_the_english_dub/"
    },
    {
        "id": "1qnx9gm",
        "author": "healthy-outdoors-",
        "title": "Anyone have any good thriller/ action/ crime / mystery movies out right now? Even shows honestly.",
        "content": "What the title says struggling to find something good to watch lol. Any recommendations would be appreciated thank you. Could be a show or movie either one. ",
        "upvotes": 20,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1qnx9gm/anyone_have_any_good_thriller_action_crime/"
    },
    {
        "id": "1qohgv4",
        "author": "Mcozy333",
        "title": "HOW TO WATCH END CREDITS AT THE END OF MOVIES ON NETFLIX APP WHILE WATCHING ON A TELEVISION ????",
        "content": "Hello All .  just wondering how we can watch the ending credits for movies now on Netflix  while watching on a large tv screen and Netflix TV app ...  \n\nthe credits go into a pop up box top left of TV screen and that pop up box is not accessible while clicking on the TV  remote control   \n\n\nHow can we watch movie Credits on Netflix  ... ??? \n\n\nThank You so much for any info on this ,  this is driving me crazy as the credits stopped being accessible and I'm watching movies all the time on netflix \n\n\nthis is not an issue with tv shows just movies \n\n\nThanks Again !!!!",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qohgv4/how_to_watch_end_credits_at_the_end_of_movies_on/"
    },
    {
        "id": "1qogwf6",
        "author": "666dollarfootlong",
        "title": "Stuck on 540p, with audio issues, on Firefox after  a change in my audio setup.",
        "content": "I used to be able to watch in 1080p with a browser extension. After I purchased an Apple USB-C/3.5mm dongle, and installing EqualizerAPO on my Windows 11 PC, the video is stuck at 960x540 resolution, and only 5.1 audio-option works. I did some research and I think its a DRM handshake issue with my audio setup, and the only fix seems to be to install Dolby Access, however I can't afford that. Does anyone know how to fix this, or if it's a problem with either of my new audio changes (Apple dongle OR equalizerAPO).  Thanks! ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qogwf6/stuck_on_540p_with_audio_issues_on_firefox_after/"
    },
    {
        "id": "1qocssv",
        "author": "Nocturnal_Babe",
        "title": "Bingeworthy engrossing",
        "content": "Ok so currently waiting for Bridgerton… until then what to watch this week which is nice and bingeworthy plz suggest genre romance, true crime/ thriller…",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1qocssv/bingeworthy_engrossing/"
    },
    {
        "id": "1qnd3j3",
        "author": "Global_Ninja_4485",
        "title": "Just watched a movie that actually hit me in the feels",
        "content": "I am not into anime but recently I watched \"Your Name\" on Netflix and ... wow. The story, the music, the way it captures connection- it stuck with me long after the credits. Rarely cry at movies, but this one got me.\n\nAny other Netflix gems that hit this hard emotionally?",
        "upvotes": 87,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1qnd3j3/just_watched_a_movie_that_actually_hit_me_in_the/"
    },
    {
        "id": "1qo8cxu",
        "author": "Ashtxns",
        "title": "What is this bro",
        "content": "For some reason my netflix now has random letters bigger than others on all the stuff on there, Is anyone else's netflix doing this? I'm in Australia if that's relevant",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qo8cxu/what_is_this_bro/"
    },
    {
        "id": "1qn3nd9",
        "author": "DemiFiendRSA",
        "title": "Alex Honnold Says Netflix Paid “Embarrassingly Small Amount” For Taipei 101 Climb: “I Would Do It For $0”",
        "content": "",
        "upvotes": 137,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1qn3nd9/alex_honnold_says_netflix_paid_embarrassingly/"
    },
    {
        "id": "1qo37w1",
        "author": "FriendlyWorldArt",
        "title": "Five Star Chef",
        "content": "I know these reality shows love a sob story, but how freaking weird that Jordan was talking about sleeping in the woods and being told he would never be anything in life, and Adria was saying how she has never been good enough for her parents and they never tell her they love her…and then they invite the parents to the finale! \n\nWtf ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qo37w1/five_star_chef/"
    },
    {
        "id": "1qn1uh2",
        "author": "WolfinBoy",
        "title": "Train Dreams was buried?",
        "content": "This movie just got nominated for Best Picture and yet I signed into my Netflix account thinking it would be right there blown up right there next to Frankenstein…but it wasn’t. In fact, I had to search for it. Multiple rows of other categories…I started to even doubt it was on the platform. \n\nWhat is Netflix even doing. They have two **beautiful** films that deserve more eyes and they are not prioritized at all. Instead I get The Circle and whatever other drivel is on there. \n\nMaybe my algorithm (from a sparsely used account) caused it to be buried. Is this the case for anyone else?",
        "upvotes": 137,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1qn1uh2/train_dreams_was_buried/"
    },
    {
        "id": "1qob5ew",
        "author": "FantasticAd9478",
        "title": "The Biggest Bombshells Revealed In Elizabeth Smart’s Netflix Documentary ‘Kidnapped’",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qob5ew/the_biggest_bombshells_revealed_in_elizabeth/"
    },
    {
        "id": "1qnvrwn",
        "author": "WoodenOperation5999",
        "title": "Run away",
        "content": "what happened deedee when ash was in the tent and he could hear her screaming? the old woman muttered something about getting his turn but subsequently she put a note in his shoe ",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1qnvrwn/run_away/"
    },
    {
        "id": "1qo0yyo",
        "author": "bahe2018",
        "title": "Does 3 Body Problem get better after the first episode?",
        "content": "I really wanted to like this one! But if the rest of it is as slowwwww moving as the first episode….idk if I’m going to make it!\nIt just dragged the whole time &amp; barely gave any insight into what the series will even be about?  What does everyone think?",
        "upvotes": 0,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1qo0yyo/does_3_body_problem_get_better_after_the_first/"
    },
    {
        "id": "1qo9wgf",
        "author": "Kshiti_salman",
        "title": "Am I the only one who prefers 30-40 minute , 10 episode , 4 Series over 50 Min-  1 hour long episodes with 8 Seasons  . It takes too long to finish the series",
        "content": "Is there anyone else too? Like Mandalorian's most of episodes are below 45 minutes. Like Sherlocks epidoes are more than hour sort of. Like these . It takes too much time to finish a particular series with many others waiting in line too ofcourse while understanding them and not hurriedly watching them",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1qo9wgf/am_i_the_only_one_who_prefers_3040_minute_10/"
    },
    {
        "id": "1qnhjs2",
        "author": "carboard_raccoon",
        "title": "Show recommendations?",
        "content": "Me and my mom have been watching shows together for a while now and really enjoy it, unfortunately we can't really find anything interesting atm :( So far we've watched Sweet Tooth, Young Royals, Beauty in Black, Shameless, Anne with an E and we're currently watching 13 Reasons Why but idk how I feel about it yet (so basically older teen and young adult stuff). We especially liked Sweet Tooth, Shameless and Anne with an E! Unfortunately I much prefer animated shows but my mom refuses to watch anything animated so anything animated probably won't go far 💔\n\nAny recommendations are much appreciated!! :D",
        "upvotes": 7,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1qnhjs2/show_recommendations/"
    },
    {
        "id": "1qnyw74",
        "author": "goatlax96",
        "title": "Shoes playing on different qualities.",
        "content": "So my shows are playing on different qualities. One show shows plays in perfect hd or whatever and the next show is like 480p or something. Does anyone know the reason for this and how to fix it. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qnyw74/shoes_playing_on_different_qualities/"
    },
    {
        "id": "1qo3rrf",
        "author": "FreshOffTheBed",
        "title": "Indian movies english dubbed",
        "content": "Im tryna get jnto the hindu movie genre bollywood and such and was wondering how come netfix doesnt have a lot of indian movies with english dubbed; im only really searching for english dubbed bollywood movies any suggestions preferably action comedy drama or thriller",
        "upvotes": 0,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1qo3rrf/indian_movies_english_dubbed/"
    },
    {
        "id": "1qnl23s",
        "author": "Superb_State8245",
        "title": "Is there a limit on how often I can change my Netflix primary household?",
        "content": "I live in one house for the majority of the year and another home over the colder months (usually November-March, staying with family). My primary location for Netflix is the main house and whilst I can watch Netflix on my phone here in the winter home, I'd like to watch it on the smart TV.\n\nIf I update my primary location on Netflix to the winter home now, will I still be able to change it back to my main house when I move back in the spring?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qnl23s/is_there_a_limit_on_how_often_i_can_change_my/"
    },
    {
        "id": "1qmvzkb",
        "author": "RiskAndReason",
        "title": "What’s at the top of your Netflix watchlist right now?",
        "content": "Just curious 👀\n\nBecause I’m stuck scrolling again 😅 What’s the one show or movie at the top of your Netflix list that you actually plan to watch next?\n\n\n\nLooking for ideas on what to start next.",
        "upvotes": 91,
        "comments": 219,
        "media": null,
        "permalink": "/r/netflix/comments/1qmvzkb/whats_at_the_top_of_your_netflix_watchlist_right/"
    },
    {
        "id": "1qm64ef",
        "author": "steal_your_thread",
        "title": "Skyscraper Live is all wrong",
        "content": "Netflix have gotten this wildly wrong, they don't seem to remotely understand what we wanted from this. I straight up couldnt care less about this random commentator having a crack at a part of the climb, or a prerecorded clip of Alex talking about not wanting to die. \n\nWE WANT TO WATCH THE CLIMB.\n\nShut up, keep the climb on the large screen and put all your stupid nonsense filler in that mini screen, if on at all, and STOP TALKING OVER ALEX. They are adding absolutely nothing to this, no commentary at all would be significantly better than these terrible commentators saying how 'scary and dangerous' for the 100th time.",
        "upvotes": 3034,
        "comments": 546,
        "media": null,
        "permalink": "/r/netflix/comments/1qm64ef/skyscraper_live_is_all_wrong/"
    },
    {
        "id": "1qmwpcq",
        "author": "Longjumping_Land_977",
        "title": "Why Elizabeth Smart’s mother Lois wasn’t in the Netflix documentary, and where she is now",
        "content": "",
        "upvotes": 73,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1qmwpcq/why_elizabeth_smarts_mother_lois_wasnt_in_the/"
    }
]