[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 14,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1oyfyts",
        "author": "cheeseymom",
        "title": "Is anyone else who really enjoyed stranger things just completely lose interest with how long they took?",
        "content": "I don't even know if I'll bother to watch the 5th season. I remember liking and enjoying all the others but it's been so long I forgot most of it and now I just don't even care. It's a shame they couldn't have just ended it in a timely manner.",
        "upvotes": 1790,
        "comments": 302,
        "media": null,
        "permalink": "/r/netflix/comments/1oyfyts/is_anyone_else_who_really_enjoyed_stranger_things/"
    },
    {
        "id": "1oz7xlo",
        "author": "Justanothermom6",
        "title": "Why is Australia part of Physical Asia?",
        "content": "They are not asian right? Their team members are also significantly taller, bigger in physique compared to asians which gives them upper-hand in most battles! Nothing against Aussies, I love them and I have worked with them (they’re amazing human beings!). Just really wondering?! ",
        "upvotes": 10,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1oz7xlo/why_is_australia_part_of_physical_asia/"
    },
    {
        "id": "1oz7258",
        "author": "Upbeat-Meringue-6401",
        "title": "Thoughts on The Beast in Me? (SPOILERS)",
        "content": "I just binged all the episodes of The Beast in Me and I loved it. Claire Danes did an amazing job and Matthew Rhys's faces scared the shit outta me. I love a show that has me yelling at my TV. I would like to take this opportunity to list a few of the people in this show who pissed me off.\n\n1. Abbott - Why would you approach someone who you know is a pysopath and serial killer pretty much, all alone, with one weapon? I knew as soon as he followed him he was gonna die, smh. It was so upsetting.\n\n2. Marvin - I completely understand him wanting to help his son and being in denial about how sick he really was, but he was constantly having to clean up Nile's messes. His legacy was also constantly at risk because of Nile's recklessness, but he just kept helping him over and over again. I know that's his son, but I would have called the police on him asap.\n\n3. Shelley - Was anyone else annoyed by Shelley? Why would you be mad at your ex wife for not being able to forgive the man who was driving drunk and caused a crash that killed your child?? And then to blame Aggie for his suicide to her face when she came to you telling you that she thinks Teddy was murdered. Obviously Aggie wasn't 100% in the right for doing things like throwing the brick through his window, but I can understand her anger. Also, having to see him constantly, knowing that he was never punished must have been hell. It's like they all made her out to be the crazy one for being angry.\n\nNile - Obviously he pissed me off cuz his impulse control was dog shit, and he was a terrible person all around, but he made a really good villain. I think a good villain makes the best stories.\n\nHow did ya'll feel?",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1oz7258/thoughts_on_the_beast_in_me_spoilers/"
    },
    {
        "id": "1oyy4st",
        "author": "Nastyday",
        "title": "How do you choose what to watch on Netflix when watching together?",
        "content": "Hi everyone!   \nI’m curious how you decide **what to watch on Netflix when you're watching with someone else**.\n\nI know it can really depend on the people and the situation, but I’d love to hear your preferences—  \n**Do you like watching “together-together” (same screen, same time) or watching “alongside” (same show, but separately)?**\n\nSome studies show that even with Netflix’s powerful recommendation system, people still spend **10–30 minutes just scrolling** because of *choice overload*.  \nCurious to hear your thoughts and experiences—how do *you* pick something?\n\n  \n",
        "upvotes": 11,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1oyy4st/how_do_you_choose_what_to_watch_on_netflix_when/"
    },
    {
        "id": "1oyuc11",
        "author": "Spicypanda78",
        "title": "Anybody else enjoy Minx as much as I did?",
        "content": "I really enjoyed this show and hope Netflix renews them. Ophelia Lovibond and the rest of the cast deserve a third shot. I cackled at some of the references and a lot of the jokes. Heartbroken when I found out that there is only 2 seasons with no renewal. Did anyone else just find out about this show, which was released in 2022 on HBO, Then Stars? ",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oyuc11/anybody_else_enjoy_minx_as_much_as_i_did/"
    },
    {
        "id": "1oz9rw8",
        "author": "not_at_ALT",
        "title": "Netflix's Delhi Crime can't get simple title credits correct.",
        "content": "Noticed while watching the incredible title sequence for Delhi Crime Season 3 that they listed Ceiri Torjussen as the \"Music Copmoser\". Insulting misspelling; especially considering that the title sequence is only good because of the music.\n\nScreengrab:\n\n[https://ibb.co/tMvPF1SM](https://ibb.co/tMvPF1SM)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oz9rw8/netflixs_delhi_crime_cant_get_simple_title/"
    },
    {
        "id": "1oz9rlv",
        "author": "LOACHES_ARE_METAL",
        "title": "I never had troubles connecting my monitor",
        "content": "Until one day I tried hdmi to a smart tv. As soon as I dragged the chrome browser containing netflix, it would disconnect. I fought it a few times, eventually it worked for a few hours, then cut out. Now, my main monitor connected directly through hdmi struggles to be recognized. It's glitchy just like how it was when I was trying to watch netflix except, I'm not trying to watch netflix. I'm just trying to use my monitor.\n\nA post I just posted was removed immediately and as I'm trying to post once more, my monitor is connecting and disconnecting making my screens act bananas, like they're trying to gaslight me into not posting. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oz9rlv/i_never_had_troubles_connecting_my_monitor/"
    },
    {
        "id": "1oz23uo",
        "author": "Demonicpineapplehat",
        "title": "The Witcher Season 4 - intermittent black screen",
        "content": "Has anyone experienced similar and found a solution:\nWe’ve just started watching the Witcher season 4 on our tv (LG OLED). During what feels like key action scenes, and as the camera changes angle, the screen will go black for a second or less.. but the subtitles and sound will continue. A second later and the picture will return. \n\nFor example: S4E1 at 50:17-50:18. \n\nWe’ve literally just finished rewatching season 3 and didn’t experience the issue. Nor on any other Netflix show. \n\nIt’s infuriating. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oz23uo/the_witcher_season_4_intermittent_black_screen/"
    },
    {
        "id": "1oy8xt1",
        "author": "nettspendfannn",
        "title": "This household update is terrible",
        "content": "I can't use Netflix anymore because my sister went to college and has Netflix set up there. So now its giving me this bs about not being part of the house hold. FIX THIS NETFLIX",
        "upvotes": 175,
        "comments": 96,
        "media": null,
        "permalink": "/r/netflix/comments/1oy8xt1/this_household_update_is_terrible/"
    },
    {
        "id": "1oyd7tp",
        "author": "Not_Serial_Murdering",
        "title": "What is a movie/show on Netflix that most people haven’t seen, but you’d insist they should watch?",
        "content": "Just like the title says, what movies and shows did you love that most people probably haven’t seen? Sometimes it feels like I’ve seen everything that’s worth watching on Netflix. So what would you guys recommend that most people probably haven’t watched? ",
        "upvotes": 74,
        "comments": 356,
        "media": null,
        "permalink": "/r/netflix/comments/1oyd7tp/what_is_a_movieshow_on_netflix_that_most_people/"
    },
    {
        "id": "1oybrum",
        "author": "Overall-Path-4686",
        "title": "Claire Danes’ Lip Quiver in The Beast In Me",
        "content": "Pretty good show, and Claire Danes is great in it but her lower lip quivers in every single emotionally intense scene and it’s so distracting. \n\nWould have loved if she picked a single other way to communicate emotion in her face besides a lip quiver.\n\nDid anyone else notice this?",
        "upvotes": 84,
        "comments": 107,
        "media": null,
        "permalink": "/r/netflix/comments/1oybrum/claire_danes_lip_quiver_in_the_beast_in_me/"
    },
    {
        "id": "1oz9rhw",
        "author": "Resident_Bar_1832",
        "title": "About How to Sell Drugs online fast",
        "content": "Hey everyone,\nI just finished Season 1 of How to Sell Drugs Online (Fast) and watched the first episode of Season 2. One thing confuses me:\nSeason 1 ends with Lisa walking into Moritz’s room and it really looks like she sees all the packages/drug setup. But in S2E1 this moment is never mentioned again.\n\nIs this explained later, or is it just a dropped plot point?\nDid I miss something?\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oz9rhw/about_how_to_sell_drugs_online_fast/"
    },
    {
        "id": "1oz2uy0",
        "author": "RioDeIdeas",
        "title": "En busca de una película o serie sin morir en el intento",
        "content": "Les pasa que dedican una cantidad de tiempo increíble buscando una película o serie? Me ha pasado que es tanto el tiempo que demoro que cuando logro encontrarla, no pasan ni 15 minutos y ya estoy durmiendo y lo se porque cuando abro los ojos la película ha terminado y no recuerdo nada o ya voy en el 5to capítulo de una serie sin haber visto ni el primero, jajaja \nLes pasa a ustedes? Es que ya parece una locura…. O no? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oz2uy0/en_busca_de_una_película_o_serie_sin_morir_en_el/"
    },
    {
        "id": "1oynoik",
        "author": "UnWishedJack",
        "title": "I'm having an issue where I cannot get up the list of episodes",
        "content": "I'm using Netflix on Fire TV stick, it says continue watching my show, I click on it and it plays my current episode fine. But there's no option to go back to a previous episode. Usually when I press the back button I see a list of all the seasons but now it just takes me back to the home screen. The episode selection screen is gone for me. I've tried reinstalling, same issue \n\n*Update* I found it, there a new button at bottom screen when episode is paused called episode and details have to go there now ",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1oynoik/im_having_an_issue_where_i_cannot_get_up_the_list/"
    },
    {
        "id": "1oyog59",
        "author": "creepy-bastard",
        "title": "I paid but I can’t watch",
        "content": "Hi everyone,\n\nI’m having a weird issue with my Netflix account. On the homepage, it says I can **reactivate my subscription**, but somewhere else it also says **“successfully cancelled.”** I didn’t cancel anything.\n\nWhen I check my account billing, the payment was deducted a few days ago for the next 4 weeks. So my subscription is clearly active, but I **cannot watch anything**.\n\nI contacted Netflix via email, and they replied telling me to use the **support chat or phone**. The problem is, **both chat and phone are broken** for me – I always get an error like “something went wrong, please try again later.” I also tried **different browsers**, but nothing worked.\n\nI live in **Germany**, if that matters.\n\nIf I reply to the email explaining that the chat and phone don’t work, they just send the **same answer again**, telling me to use chat or phone.\n\nSo I’m stuck in a loop: I **paid**, I **can’t watch**, and the **support channels are broken**. It seems like my account might actually be broken.\n\nHas anyone else experienced this? Any ideas on how to fix it when Netflix support is unreachable?",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1oyog59/i_paid_but_i_cant_watch/"
    },
    {
        "id": "1oyymje",
        "author": "Cliffoakley",
        "title": "Netflix Error code GPS-LEN",
        "content": "I am in the U K. I have \"GPS-LEN\" showing on screen with the comment \"we are having trouble Accessing these titles for you at the moment. Please try later\".\n\nWell, it is later, much later. \nI looked online to see if there is any hint that Netflix is offline, but no sign of that.\n\nI'm using a Roku stick and gave done a full restart.\n\nAll other streaming services are working fine.\n\nAny ideas?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1oyymje/netflix_error_code_gpslen/"
    },
    {
        "id": "1oy8ryq",
        "author": "baggagefree2day",
        "title": "Beast in Me",
        "content": "SPOILERS)What does everybody think about this? I’m on the second or third episode and seriously there are so many inconsistencies. Niles has the most top notch security system in the world on his mansion, but an FBI agent can sneak in through a window that doesn’t trigger any alarms?. He has no cameras in his office?. He’s not notified when somebody tries to access his files?\nAnd I didn’t even think it was possible for anybody to just knock out a Belgian malinois. And what makes them not even consider the fact that the bodyguard is tapping her phone.",
        "upvotes": 42,
        "comments": 74,
        "media": null,
        "permalink": "/r/netflix/comments/1oy8ryq/beast_in_me/"
    },
    {
        "id": "1oz3wcj",
        "author": "Bubbly-Pop650",
        "title": "How would Netflix work in different regions?",
        "content": "I have a Netflix account in my main home country but I travel a fair bit. When I'm away, it says it's not supported in that region I'm in. Is there a workaround or does it mean I need to subscribe to the new location each time? ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1oz3wcj/how_would_netflix_work_in_different_regions/"
    },
    {
        "id": "1oz2xuj",
        "author": "Strange_Artist_6563",
        "title": "Why Joyce Byers as a Character Works So Well and How Winona Ryder Makes It Happen",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oz2xuj/why_joyce_byers_as_a_character_works_so_well_and/"
    },
    {
        "id": "1oyo7ch",
        "author": "daboytommy420",
        "title": "Downloads not loading properly",
        "content": "When I download a movie or episode on my iPhone and go into airplane mode, the first few minutes play fine — but then it starts acting up. If I fast forward, it just loads forever. If I let it play naturally, it works for a bit, but as soon as I leave the app and come back, it gets stuck loading again.\n\nI’ve already tried reinstalling the app, redownloading the titles, and restarting my phone — no luck.\n\nHas anyone else experienced this or found a fix?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oyo7ch/downloads_not_loading_properly/"
    },
    {
        "id": "1oyswt0",
        "author": "Competitive_Yam_3689",
        "title": "POV: You’re Stuck in Hawkins. Which Season Do You Survive? (Take the Quiz &amp; Share Yours!)",
        "content": "I made a **“Which Stranger Things Season Would You Survive?”** quiz for a fun little experiment and thought this sub might have fun with it 👀\n\nEach result drops you into a different season with a short survival explanation.\n\n[https://www.buzzfeed.com/famousalligator567/which-stranger-things-season-would-you-survive?utm\\_source=dynamic&amp;utm\\_campaign=bfsharecopy](https://nam12.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.buzzfeed.com%2Ffamousalligator567%2Fwhich-stranger-things-season-would-you-survive%3Futm_source%3Ddynamic%26utm_campaign%3Dbfsharecopy&amp;data=05%7C02%7Cnmuthal%40iu.edu%7C1e77b2c3ea434e393d2b08de212efcac%7C1113be34aed14d00ab4bcdd02510be91%7C1%7C0%7C638984682840428849%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=4dFPk9Xa%2B76o%2FL4vt7NAhwMClyOVtXQkrrJ5W07zUQU%3D&amp;reserved=0)\n\n\n\n**Take the quiz and comment:**  \n• What season you got\n\nCurious to see if most of us are Season 1 survivors or if this sub is full of Season 4 warriors 😂 #StrangerThings #HawkinsSurvivor",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1oyswt0/pov_youre_stuck_in_hawkins_which_season_do_you/"
    },
    {
        "id": "1oykc6y",
        "author": "Skyropop",
        "title": "Netflix acts as if I cancelled my membership",
        "content": "So I’m a long time subscriber of Netflix. Few days ago all of a sudden Netflix is acting as if I cancelled my membership, gives me error E111 on mobile, asks me to send me a link to my phone via SMS when I try to watch on TV. There is a timer that shows for how long the link is valid, counting down 5 minutes, but always after 5 seconds the tv will just skip to the screen where I can select which plan I want to buy. When I try to select a plan I get an error. When I try signing in on web, I get an error telling me to try again later and that they are having tech issues. Support chat is not available for some reason, calling them doesn’t work as well. No VPNs, no multiple households. Just all of a sudden stopped working. I see that my last billing was a few days ago and actually left my banking acc. What can I do?",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1oykc6y/netflix_acts_as_if_i_cancelled_my_membership/"
    },
    {
        "id": "1oysjd5",
        "author": "ExcessiveOptimizer",
        "title": "Real clip examples of dumming down dialogue or \"second screen\" content?",
        "content": "I have read similar news and think-piece articles and watched a few vloggers talk about this problem, but I haven't seen any real world examples highlighted, or anyone dissecting Netflix (or other studios) movies or shows where this has actually happened already. Explainer: This outcome where writers are being highly encouraged to have their characters _speak_ what they are doing and feeling, for audiences that have the videos playing in the background and are primarily listening to the content than watching it.\n\nI would love to watch a compilation of these examples, if one exists, but I haven't been able to find any. While I don't doubt this is a real strategy that producers are paying attention to, I wonder if the concern is currently way over hyped at the moment and not happening out there in the wild. ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1oysjd5/real_clip_examples_of_dumming_down_dialogue_or/"
    },
    {
        "id": "1oyboo6",
        "author": "DavidinCincinnati",
        "title": "Netflix Removed the ability to cast",
        "content": "They have REMOVED the cast icon and feature, I did a chat with their help and they confirmed, now I can no longer cast to my Chromecast to watch on the TV, I threatened to cancel if they don't restore.",
        "upvotes": 13,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1oyboo6/netflix_removed_the_ability_to_cast/"
    },
    {
        "id": "1oyriik",
        "author": "Just_a_guy_94",
        "title": "Anyone had this happen before?",
        "content": "Almost a year ago now I noticed my \"recently watched\" froze halfway through an episode of a show. Nothing I've watched since has appeared in my watch history or continue watching tabs. \n\nRecently, I discovered that all my watch history is actually under a different profile within the account, being regularly updated from my profile. \n\nNothing I've tried (uninstalling and reinstalling, logging out of the account and logging back in, etc.) has worked to fix it. Any suggestions?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oyriik/anyone_had_this_happen_before/"
    },
    {
        "id": "1oyo2v8",
        "author": "scayrux",
        "title": "Descriptie audio automatically turns on, i cant turn it off",
        "content": "So like a couple of months ago every time we start netflix on our tv it has descriptive audio as default (as in reading everything that is on the tv out loud, profile names, series names, how much time is left in the episode, etc)\n\nI already tried to go in my tv accessibility settings and turn thay off but it shows that it is already off, this exclusively happens on netflix and i cant find any option to turn that off, the only way that seems to work for a couple days is pluging the tv off and on but as i said it just comes back after a while, how can i solve this problem permanently?\n\nSorry for my bad english",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oyo2v8/descriptie_audio_automatically_turns_on_i_cant/"
    },
    {
        "id": "1oyy7j4",
        "author": "Teb_Tengri",
        "title": "Any Way To Block Non-Native Dubs?",
        "content": "Mainly I want to block Spanish dubs but I also am a purist and won't watch English dubs either if the native language is something else. I'm curious if there is a method to force \"native audio only\" and only allow subtitles as the account holder/payer.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oyy7j4/any_way_to_block_nonnative_dubs/"
    },
    {
        "id": "1oymqeo",
        "author": "AmiMist90",
        "title": "Can I check if a gift card has been used without using it?",
        "content": "If I enter the code without creating an account, can i just see if it is valid witbout using it, and not proceed, or will the code be ruined? \n\nAll I want is to see if it is still valid. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oymqeo/can_i_check_if_a_gift_card_has_been_used_without/"
    }
]