[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 82,
        "comments": 241,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mgwlru",
        "author": "WrongdoerTurbulent85",
        "title": "Just watched Thirteen on Netflix and it’s one of the darkest movies I’ve ever seen, and it’s not even horror",
        "content": "So I watched Thirteen on Netflix recently and I haven’t stopped thinking about it. It might be the darkest movie I’ve ever watched and it’s not even classified as horror. That’s how heavy it is. It’s disturbing because it’s real. There’s no supernatural force, no jump scares or anything like that. Just raw, spiraling human behavior, especially from young girls trying to find their place.\n\nWatching Tracy’s downfall was infuriating. The way she gets pulled into Evie’s world. It’s such a gut-punch because deep down, you can see how much of it is her trying to find validation. It’s not just rebellion for rebellion’s sake. These are kids. They don’t know right from wrong, they don’t understand long-term consequences. They only know what’s cool, what gets them attention, and what numbs the pain they’re carrying.\n\nWhat made me the angriest was the parenting, or the lack of it. Tracy’s mom just stood there so often. Blank-faced. Passive. She’d watch her daughter scream at her, curse at her, break down in front of her and she’d just exist there, like she didn’t know how to act. She said at one point, “That’s not how I raised you,” which shows she had tried before, but once Tracy spiraled, it was like the mother was too scared or emotionally paralyzed to intervene. And the father? Barely even there. Useless.\n\nThere’s also this eerie transformation that happens with Tracy. At the beginning, she’s just this sweet, insecure girl. But by the end? Her face, her body language …. it’s like you’re looking at a completely different person. There’s a moment where she doesn’t even look human anymore. Her pain and trauma show up physically on her face. She looked evil. Terrifying, even.\n\nAnd Evie,  I have a lot of thoughts. She’s manipulative, yes, but also clearly broken herself. And somehow, she hides it behind that innocent, “cute” look. But she absolutely destroyed Tracy's life and enabled everything terrible that happened.\n\nThis isn’t an easy watch. In fact, it was painful to sit through. But it’s one of those movies that sticks with you. It’s a reminder that adolescence is fragile, and if adults around don’t step in, don’t really parent, then kids are going to fall into dangerous hands.",
        "upvotes": 315,
        "comments": 77,
        "media": null,
        "permalink": "/r/netflix/comments/1mgwlru/just_watched_thirteen_on_netflix_and_its_one_of/"
    },
    {
        "id": "1mhd6g7",
        "author": "AbsolutDrift",
        "title": "whats a show that has completely changed your mindset",
        "content": "for me its The Good Place, i mean this show has brightened my days in my worst moments and i even teared up a few times. I believe that the whole cast was incredible, and the show was overall so lighthearted and smart at the same time… To sum up, i think its the kind of show that makes you want to reconsider your behavior with both friends and family",
        "upvotes": 17,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1mhd6g7/whats_a_show_that_has_completely_changed_your/"
    },
    {
        "id": "1mhbf8d",
        "author": "still-on-my-path",
        "title": "Leanne",
        "content": "Leanne is the funniest show! It started with her stand up I’m Every Woman.  This is also on Netflix.  If you have seen her stand up first, it’s like a bonus because the show is full of references from that comedy tour.💗",
        "upvotes": 17,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1mhbf8d/leanne/"
    },
    {
        "id": "1mh0zlw",
        "author": "Admirable-Barnacle56",
        "title": "SO TIRED",
        "content": "I honestly blame TikTok's hype culture for how movies are turning out these days. One of my favorite genres has always been romcoms, but over the years, the quality has noticeably dropped. If you look back, there are so many classic romcoms that still hold up BECAUSE that was the standard for the genre back in the day. Nowadays, it feels like movies are being made with specific actors or tropes just so they can get the TikTok treatment. People know some influencer is going to make a reaction video with exaggerated expressions and fake gasps to hype it up. So they continue spitting out shitty films because this group is so easy to satiate. I see the same exact thing happening with books. Anyone can become a writer these days. All it takes is a few edits and slideshows. \n\nA perfect example of this is My Oxford Year that came out recently. Honestly, that movie was a mess. Sofia Carson's acting was so cringey that I had to pause the film. Yet, all over TikTok, I keep seeing posts about how “amazing” it was and how people “cried so much.” I couldn't even muster up any emotional response because the film felt rushed, and the acting was just... not it. I just miss the days when movies were good BECAUSE they were good, not because they were trending on a platform. Thankfully, I was never really one to watch movies or shows when I was younger so there’s tons of classics I haven’t watched. It’s just bothersome that I never see criticism for these terrible movies. ",
        "upvotes": 65,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1mh0zlw/so_tired/"
    },
    {
        "id": "1mhh8le",
        "author": "Longjumping_Land_977",
        "title": "Amy Bradley case has a number of ‘new tips’ following ‘incredible’ response to Netflix series",
        "content": "",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1mhh8le/amy_bradley_case_has_a_number_of_new_tips/"
    },
    {
        "id": "1mhhr2o",
        "author": "Z3M0G",
        "title": "Menu changed on my TV this week. Seems nobody likes it. Why change for the sake of change?",
        "content": "I hate it so much and I'm clearly not alone.  Seems it has been rolling out over the past month going by posts.  If everyone hates it why do they stick with it?  Why do companies insist on change for sake of change even if its bad?  We see this happening in almost every digital service product imaginable.\n\nSwallow your pride and change it back.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mhhr2o/menu_changed_on_my_tv_this_week_seems_nobody/"
    },
    {
        "id": "1mhbpbb",
        "author": "clueless_212",
        "title": "what do we think of the trainwreck series on netflix?",
        "content": "which is ur fave and what are we thinking of it ? i've watched all except pi moms, mayor of mayhem, the cult of american appeal and the astroworld one ",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mhbpbb/what_do_we_think_of_the_trainwreck_series_on/"
    },
    {
        "id": "1mhiago",
        "author": "SheAsks0",
        "title": "My Oxford Year",
        "content": "Is it just me or Sofia Carson’s acting comes off too icky? I cannot stop cringing with her flirting face 😖 I have watched Corey in Queen Charlotte series and I loved his chemistry with India there! They were a great pair. I am trying to figure out what’s wrong with MOY cause honestly I stopped watching after 15 mins. Lmao.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mhiago/my_oxford_year/"
    },
    {
        "id": "1mhhd98",
        "author": "peoplemagazine",
        "title": "Fred Armisen Reveals What He Learned from Jenna Ortega While Working on Wednesday",
        "content": "\"It's great watching Jenna, because she keeps track of the script in this way that she understands the logic of her character,” Armisen tells PEOPLE. \"It makes me want to be more like her.\"",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mhhd98/fred_armisen_reveals_what_he_learned_from_jenna/"
    },
    {
        "id": "1mhgild",
        "author": "graemeisverytired",
        "title": "How Sony and Netflix formed a strange partnership to bring KPop Demon Hunters to life",
        "content": "\"We pitched the movie to Sony,” Kang explained in a recent interview. “And they passed on it. It’s a big risk to do a movie with a full Asian cast on something that’s very culturally Korean, which hasn’t been done before. K-pop was at its peak, but it could have plateaued. There was a lot of uncertainty with that. So we pitched it to Netflix.\"\n\nMore: https://www.thepopverse.com/movies-kpop-demon-hunters-sony-pictures-animation-netflix-relationship",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mhgild/how_sony_and_netflix_formed_a_strange_partnership/"
    },
    {
        "id": "1mgd5i2",
        "author": "Leather_Dependent731",
        "title": "Sofia Carson ruined My Year at Oxford (free of spoilers)",
        "content": "Oh my gosh. Before we got to the big reveal (those who watched it know what I’m talking about), the movie was a hard watch. \n\nEvery single scene she had the same exact facial expression and you know when you’re watching a movie and you can clearly see that a person is acting? That’s exactly what she felt like. \n\nEvery single moment her facial expression was seductive and flirty, literally every second she talked. There’s a scene where she’s asking how someone died and her face looks exactly the same as when she was flirting with the love interest. Like what. It’s like she’s always trying to keep herself pretty, if that makes sense. But this is not an ad or a beauty campaign. A good movie doesn’t feel like you’re watching a movie, but this was the exact opposite whenever Sofia was on screen. \n\nAlso she made zero effort to have any sort of chemistry with Corey. You could see in his eyes, the passion and the longing, but nothing from her. \n\nThe movie is honestly pretty good but Sofia Carson’s acting really ruined it for me. ",
        "upvotes": 366,
        "comments": 104,
        "media": null,
        "permalink": "/r/netflix/comments/1mgd5i2/sofia_carson_ruined_my_year_at_oxford_free_of/"
    },
    {
        "id": "1mgr5qd",
        "author": "ulemseewa",
        "title": "REBEL RIDGE (2024)",
        "content": "I Fucking Love REBEL RIDGE\n\nThis is *Not* a guns blazing action movie, but a fully realized, deliberately paced Crime Thriller about our Fucked Up legal system. Don Johnson has villainy downs to a science. AnnaSophia Robb is on point.\n\nAaron Pierre is a SuperStar in the making.",
        "upvotes": 35,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1mgr5qd/rebel_ridge_2024/"
    },
    {
        "id": "1mhd8eu",
        "author": "gul_1505",
        "title": "Missing you",
        "content": "How's the series Missing you? Want to watch it but seeking reviews that how is it. Its by Harlan Cooben, i watched Fool me Once by her and loved it                               d.                                               M",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mhd8eu/missing_you/"
    },
    {
        "id": "1mhaha8",
        "author": "Pctcheerandtumble",
        "title": "Outlanders vs The Last Kingdom vs The Witcher",
        "content": "Narrowed my next show down to one of those two shows. \n\nBackground: Love fantasy and finished GoT recently and have been obsessing about it since. Want something like that again. I’m a guy btw\n\nWhich do you think would be best to fill the hole that is no more GoT?\n",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mhaha8/outlanders_vs_the_last_kingdom_vs_the_witcher/"
    },
    {
        "id": "1mhaehq",
        "author": "SingleandSober",
        "title": "Culture wars come to Netflix in sapphic drama 'The Hunting Wives'",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mhaehq/culture_wars_come_to_netflix_in_sapphic_drama_the/"
    },
    {
        "id": "1mh6g0g",
        "author": "NoTravel6872",
        "title": "I can't watch She-ra and the princesses of power",
        "content": "I recently got Netflix subscription and one of the shows I wanted to watch was She-ra, but for some reason it doesn't pop up when I search it. Why and how do I fix it?\nAlso I live in Ukraine if it has something to do with region.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mh6g0g/i_cant_watch_shera_and_the_princesses_of_power/"
    },
    {
        "id": "1mh9vd1",
        "author": "The-Big-Sadness",
        "title": "Netflix washed out on Tab S10+",
        "content": "Anyone else having issues like this? I'm on a tab S10+. The colour profile and contrast only lock in when I swipe up the reveal the nav bar. Otherwise it's washed out and ugly looking. I've cross referenced with other devices to make sure that the more contrasty saturated version is how it's actually supposed to look like",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/1p5fdjkhdzgf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1mh9vd1/netflix_washed_out_on_tab_s10/"
    },
    {
        "id": "1mhdytu",
        "author": "jerkoff1610",
        "title": "Real meaning behind that final montage in My Oxford Year: The emotional ending explained",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mhdytu/real_meaning_behind_that_final_montage_in_my/"
    },
    {
        "id": "1mh8c8b",
        "author": "itx_alpha",
        "title": "Recommend me some movies or series that released recently.",
        "content": "Recommend me some action adventure movies or series like money heist, old guard. Sandman is very much unique and interested series i watched. Suggest something like these kind of action, adventure, fantasy, crime type content.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mh8c8b/recommend_me_some_movies_or_series_that_released/"
    },
    {
        "id": "1mh7zwq",
        "author": "LogerGrunt",
        "title": "Prove me wrong",
        "content": "The Bloodhounds and My Name are from the same series, even though netflix doesn’t list them as being from the same series I don’t know why lmao.\n\n\nSeriously tho am I crazy for thinking this?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mh7zwq/prove_me_wrong/"
    },
    {
        "id": "1mhi577",
        "author": "prettyprettybookitty",
        "title": "What is with all the AA based shows?",
        "content": "Loudermilk. Flaked. Mom. Etc. Enough with the AA based shows. That community is nothing but losers and creeps trying to manipulate women and that's a fact. In what world are women crawling all over middle aged alcoholic morons. If I hear 'work the program' one more time I'm going to actually turn to drinking. Perhaps I'll skip the drinking part and go straight to vomiting. Please stop making shows that celebrate weak minded predators. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mhi577/what_is_with_all_the_aa_based_shows/"
    },
    {
        "id": "1mga1k7",
        "author": "soggyicecreamcones",
        "title": "\"my oxford year\" is so bad",
        "content": "not to mention the \"main character\"(in a bad way) girl energy, ana gave. like it was so corny😭🙏 it also had the cliche \"friend group\" which automatically formed, like we didn't really see their connection yk. jamie was alright, but still had the \"everything is deep\" energy sort of, but ig its fine cuz he was learning victorian poetry. all the other character's were okay. when i was watching it i COULD tell, it is one of those tiktok book adpated into a movie, even tho i had no clue and then searched it up. \n\nbut all the things aside, THE BIGGEST PROBLEM with this movie was the romanticization of student teacher relationship, which is so problematic. &gt;!the first time they kiss and jamie just walks away, i thought maybe yeah they would explore this problematic side of the power dynamic, but it was just cuz he had the cancer.!&lt;\n\nthere are several people in academia who face sexual harrasment from the profesors, yet media like \"my oxford year\" and \"the love hypothesis\" never fail to romanticize it. ",
        "upvotes": 130,
        "comments": 71,
        "media": null,
        "permalink": "/r/netflix/comments/1mga1k7/my_oxford_year_is_so_bad/"
    },
    {
        "id": "1mg5jbg",
        "author": "jubejubes96",
        "title": "Just watched TRAINWRECK: Storm Area 51",
        "content": "I came out hating almost everyone involved in the event, especially Matty.\n\nhe had so many chances to simmer things down and he just added more fuel to the fire with ‘shitposting’ while acting like it was completely out of his control. seemed like he was just playing out his faux victimhood as long as he could until he got a good offer to walk away with some profit.\n\nthey should not have plugged his garbage t-shirt merch near the end and give him the chance for any more cash.\n\nso many tax-dollars on area-51 and the town of rachel were wasted on preparing for a worst-case scenario, while this smelly dweeb is back at home living with his mom, laughing off the whole thing.",
        "upvotes": 210,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1mg5jbg/just_watched_trainwreck_storm_area_51/"
    },
    {
        "id": "1mgm3yo",
        "author": "leyy_pink1997",
        "title": "Just finished The Night Agent—worth the hype?",
        "content": "I kept seeing The Night Agent pop up on my recommendations and finally gave in. Finished the whole season in two days 😅 Honestly, it felt like a mix of Jack Ryan and Designated Survivor. Super fast-paced and surprisingly emotional in some parts.\n\nAnyone else watch it? Thoughts on a potential Season 2? I need more shows like this—any recommendations?",
        "upvotes": 12,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1mgm3yo/just_finished_the_night_agentworth_the_hype/"
    },
    {
        "id": "1mhbpoq",
        "author": "bluc74",
        "title": "Movies-Adult",
        "content": "Does Netflix have movies couples can watch with adult content? Not looking for porn just a nice hot steamy movie the wife and I can enjoy together; I searched for movies in the past but no matter what the movie describes is not an adult only movie, any suggestions?\n\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mhbpoq/moviesadult/"
    },
    {
        "id": "1mg6vt5",
        "author": "ParfaitAgreeable584",
        "title": "My Oxford Year",
        "content": "I blame tiktok for hyping up terrible acting and rushed plots like My Oxford Year. Whatever happened to enjoyable romcoms? Sofia Carson’s acting made me physically cringe. The part where she said she had a library fetish and the faces she was making when saying professor…..I paused the movie several times because of her. I also noticed she acts the same in every movie? I’m so upset because people made it seem like the book was actually good. The movie was just rushed honestly would’ve made more sense to put it in a show. Though im not sure I could sit through an entire series with Sofia…. ",
        "upvotes": 102,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1mg6vt5/my_oxford_year/"
    },
    {
        "id": "1mh1dz1",
        "author": "GenericFMWonderkid",
        "title": "Netflix causes my speakers to pop??",
        "content": "https://reddit.com/link/1mh1dz1/video/nkphvwfqvwgf1/player\n\nanybody know what might be the cause here? both on Opera GX and the Netflix app, when it hits the home screen I get a huge pop from my speakers and I'm worried about potential damage over time to rather expensive gear. I've had it closing Opera before and now realise it's because I had a Netflix tab at the top",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mh1dz1/netflix_causes_my_speakers_to_pop/"
    },
    {
        "id": "1mh5hzh",
        "author": "Readerofthethings",
        "title": "My favorite thing about watching Netflix originals is getting deeply invested in the show, then finding out it’s been cancelled after getting to the cliffhanger ending",
        "content": "I purposefully avoided looking it up (Kaos btw) so as to not spoil myself. Then, I get to the ending (which was rushed tbh, throwing money at Jeff Goldblum probably caused that), and I find out ITS CANCELLED. \n\nWhat the fuck Netflix.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mh5hzh/my_favorite_thing_about_watching_netflix/"
    },
    {
        "id": "1mhc877",
        "author": "themilkyone_24",
        "title": "I feel like Netflix is actively against their users",
        "content": "As the title suggests. \n\nI recently moved cities due to university, but I used to visit home almost every other week. However, a few months ago, I stopped doing that and switched to visiting home every month, primarily due to work. Unfortunately, this time around, I was away for so long that I was greeted with the dreaded „Your device isn’t part of the Netflix Household for this account“ screen.\n\nThis made me realize, that should I decide to keep up this habit of mine, I would have to pay for a new subscription because all extra members are already added and temporary access is limited to 14 consecutive days. If that wasn't enough, Netflix doesn’t offer any other options for people who live outside the household but still rely on the family household, like a student plan of some sorts.\n\nI couldn’t help but wonder then, how is this system supposed to make sense? Do they genuinely expect two extra members to be enough for larger families? Like seriously. Let’s ignore the cost of the premium plan plus two extra members for a moment and focus on the practical implications. What if three kids move out and go to different places? Which one will have to live without Netflix? Or what if you already added both grandparents (maternal and paternal sides) to the account and then got a kid or more moving out? There isn't an option for a plan for people with no consistent household. And these are not unrealistic scenarios either.\n\nDo they expect everyone who no longer lives in the household to pay for their excessively expensive and, let’s be honest, recently disappointing service all alone when the original plan is already full? Even if people are willing to pay, everyone ends up paying more than they should.\n\nWhere is the student plan you can find at almost every other service provider? Why are we limited to only two extra members? Why are we getting more and more limited on what we can and cannot do with our accounts, yet being charged more?\n\nI'm sick and tired of anti-consumer practices. Something needs to be done.",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1mhc877/i_feel_like_netflix_is_actively_against_their/"
    },
    {
        "id": "1mh8cuq",
        "author": "Wild-Mangoes",
        "title": "Cancelations",
        "content": "Honestly,\n\nThe shows Netflix has produced, as a gay man growing up, have made me feel seen and understood — in season one, then it gets cancelled. \n\nEvery single fucking time a show does something that excites me it gets cancelled. I am so fucking tired of this network, because that’s what it’s become. A money seeking vacuum of culture. \n\nIt’s embarrassing that at 15 I campaigned to my parents to start funding what I thought was a progressive company with an interest in changing the narrative. How pathetic.\n\nMy candid thoughts. Thanks for reading. \n\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mh8cuq/cancelations/"
    }
]