[
    {
        "id": "1kspfrg",
        "author": "AlanAndMattAMA",
        "title": "Hey /r/movies! We're Alan Tudyk &amp; Matt Winn, actor &amp; director of THE TROUBLE WITH JESSICA, a dark comedy also starring Rufus Sewell &amp; Shirley Henderson about a group of longtime friends at a dinner party that goes horribly wrong, recently in theaters and now available on digital. Ask us anything!",
        "content": "You might also know Alan for films and series such as Firefly, Tucker &amp; Dale vs Evil, Serenity, Andor, A Knight's Tale, Resident Alien, Rogue One: A Star Wars Story, Moana, Frozen II, I Robot, Maze Runner, Transformers, Deadpool 2, The Electric State, Harley Quinn, Dodgeball, Raya and the Last Dragon, Ice Age, Arrested Development, 3:10 To Yuma, and much more.\n\nABOUT THE FILM: Married couple Sarah (Shirley Henderson) and Tom (Alan Tudyk) are in terrible financial trouble. On the brink of losing everything, they’ve managed to find a buyer for their stylish London home. When their best friends Richard (Rufus Sewell) and Beth (Olivia Williams) come over for a final dinner, an uninvited old friend, Jessica (Indira Varma), tags along.\n\nAfter a seemingly trivial argument at dinner, Jessica disappears. She has the temerity to hang herself in the garden, totally oblivious to the adverse consequences for Sarah and Tom’s real estate sale. The only solution: Sarah and Tom must convince Richard and Beth to help take care of this little inconvenience. If they’re clever enough about it, what could possibly go wrong? Knives are out and best-kept secrets are revealed in this laugh-out-loud dark comedy featuring a starry ensemble cast of phenomenal UK talent.\n\nTRAILER: [https://www.youtube.com/watch?v=l\\_xhtk8Tj18](https://www.youtube.com/watch?v=l_xhtk8Tj18) \n\nLearn More and Rent/Buy THE TROUBLE WITH JESSICA: https://www.musicboxfilms.com/film/the-trouble-with-jessica.\n\nAsk us anything! Back at 3 PM ET today for answers.\n\n\n\n",
        "upvotes": 640,
        "comments": 415,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ohy0hof2tb2f1.png?auto=webp&amp;s=7039a148f333722fa2414b6009872629b373b2c9"
        },
        "permalink": "/r/movies/comments/1kspfrg/hey_rmovies_were_alan_tudyk_matt_winn_actor/"
    },
    {
        "id": "1kt8f5n",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Mission: Impossible - The Final Reckoning / Lilo &amp; Stitch / Friendship) plus Throwback Discussions!",
        "content": "# New Theatrical Releases\n\n[Mission: Impossible - The Final Reckoning](https://old.reddit.com/r/movies/comments/1kt8b6m/official_discussion_mission_impossible_the_final/?)\n\n[Lilo &amp; Stitch](https://old.reddit.com/r/movies/comments/1kt8b83/official_discussion_lilo_stitch_spoilers/?)\n\n[Friendship](https://old.reddit.com/r/movies/comments/1kt8b9q/official_discussion_friendship_spoilers/?)\n\n# 25th Anniversary Throwback Discussion Threads\n\n[Dinosaur](https://old.reddit.com/r/movies/comments/1kt8baq/official_throwback_discussion_dinosaur_spoilers/?)\n\n[Road Trip](https://old.reddit.com/r/movies/comments/1kt8bc6/official_throwback_discussion_road_trip_spoilers/?)\n\n\n# Still in Theaters\n\n[Final Destination: Bloodlines](https://old.reddit.com/r/movies/comments/1knpnb1/official_discussion_final_destination_bloodlines/?)\n\n[Hurry Up Tomorrow](https://old.reddit.com/r/movies/comments/1knpnfr/official_discussion_hurry_up_tomorrow_spoilers/?)\n\n[Thunderbolts*](https://old.reddit.com/r/movies/comments/1kcpug8/official_discussion_thunderbolts_spoilers/?)\n\n[Sinners](https://www.reddit.com/r/movies/comments/1k1tsoo/official_discussion_sinners_spoilers/?)\n\n\n\n# On Streaming\n\n[Fountain of Youth](https://old.reddit.com/r/movies/comments/1ku0tg1/official_discussion_fountain_of_youth_spoilers/?)\n\n[Fear Street: Prom Queen](https://old.reddit.com/r/movies/comments/1ku0thn/official_discussion_fear_street_prom_queen/?)\n\n[Another Simple Favor](https://old.reddit.com/r/movies/comments/1kdg7p5/official_discussion_another_simple_favor_spoilers/?)\n\n[Havoc](https://old.reddit.com/r/movies/comments/1k7zfyi/official_discussion_havoc_spoilers/?)",
        "upvotes": 67,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1kt8f5n/official_discussion_megathread_mission_impossible/"
    },
    {
        "id": "1kv1jou",
        "author": "Amaruq93",
        "title": "\"Braveheart\" at 30: Mel Gibson’s gory, hokey 1995 Oscar winner plays like a biblical epic",
        "content": "",
        "upvotes": 1805,
        "comments": 612,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/44nV70BuAJpxiEJHbSuNSBw5gLjWPG5MKNDBhvXBJSg.jpg?auto=webp&amp;s=77743073bedaaf1e1328ae7a3081f9e99ab16413"
        },
        "permalink": "/r/movies/comments/1kv1jou/braveheart_at_30_mel_gibsons_gory_hokey_1995/"
    },
    {
        "id": "1kul1g6",
        "author": "LookAtThatBacon",
        "title": "For the movie adaptation of The Martian, Ridley Scott changed the day the crew left Mars from sol six to sol 18 because he wanted to justify the higher amount of human waste used to make fertilizer. What are other instances of a movie adaptation making changes for interesting reasons?",
        "content": "Source for the fact about The Martian: https://www.thedailybeast.com/the-man-behind-the-martian/\n\n&gt; But the movie changed how long the crew spent on the planet for a funny reason. In the book they left after sol six, but in the movie they leave after sol 18. Ridley wanted Mark to stir a nice big bucket of shit when he was creating the fertilizer for the crops. Ridley said, after only six days of six people shitting that’s 36 packets. He wanted them to stay longer, so that the bucket of shit could be full.",
        "upvotes": 9585,
        "comments": 1442,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5BSO5UiPNnyQaThrBsXIGITSv-lq-stoG6S3M-z3qhs.jpg?auto=webp&amp;s=f9bedfeef1801f2abac4b8e982f04f37b475cd4e"
        },
        "permalink": "/r/movies/comments/1kul1g6/for_the_movie_adaptation_of_the_martian_ridley/"
    },
    {
        "id": "1kutr6k",
        "author": "blac_sheep90",
        "title": "Justin Long's physical performance in Dodgeball is fantastic.",
        "content": "Rewatched dodgeball for the millionth time this evening and every time Justin is on screen he's doing something with his body that makes me laugh. Be it getting tangled up in exercise equipment, crushed by a large woman, catching and dropping then exploding a beer all over himself, taking wrench to the face, or taking a hard hit from a dodgeball from the White Goodman. He's one of the best aspects of the movie.\n\nDodgeball remains an extremely funny movie.",
        "upvotes": 1637,
        "comments": 143,
        "media": null,
        "permalink": "/r/movies/comments/1kutr6k/justin_longs_physical_performance_in_dodgeball_is/"
    },
    {
        "id": "1kv4um1",
        "author": "Unused_Content19",
        "title": "What is the most disturbing movie ending you ever saw?",
        "content": "Smile. As much as I hate this movie, seeing that monster come out of the skin and enter Rose’s body, and Joel entering only for the curse to pass onto him as he watches Rose burn herself is quite disturbing for me.                                                                    \n                              \nAnd, I just wanna say, Rose’s burning body being seen in Joel’s eyes is something this movie actually does good.",
        "upvotes": 139,
        "comments": 303,
        "media": null,
        "permalink": "/r/movies/comments/1kv4um1/what_is_the_most_disturbing_movie_ending_you_ever/"
    },
    {
        "id": "1kuvdoh",
        "author": "JenL0159",
        "title": "Annihlation",
        "content": "Why aren’t more people obsessed with this movie?! All female cast. Sci-Fi/Horror/drama. Natalie Portman. Aliens. With a few twists. This movie has everything and it’s incredibly interesting and terrifying!!! And kinda deep haha! I’ve heard it’s starting to be considered a cult-classic, but I’m surprised it’s didn’t win some kind of award. It has a slightly independent-feel. They’re is a lot going on here and it’s well done. Great acting. Not cliche. Suspenseful. Creative. Scary. I am rarely impressed by anything Sci-fi ish but this movie is amazing. It’s one of very few that keep me from multi tasking or playing on my phone at the same time. Iykyk. And I will never recover from the bear…\n\nThis movie is not for kids imo. it’s a little intense.",
        "upvotes": 694,
        "comments": 275,
        "media": null,
        "permalink": "/r/movies/comments/1kuvdoh/annihlation/"
    },
    {
        "id": "1kuy64g",
        "author": "NotSoEnlightenedOne",
        "title": "Ocean’s 11 is closer to the MIssion Impossible TV show than the films ever were.",
        "content": "I remember watching the original mission impossible when it came out and thought it was good but it was missing the team element and more about Tom Cruise. 8 films on and that has never changed.\n\nThe team dynamic in Ocean’s 11 was fun and sparked the thought the spirit of the MI TV show is much better depicted in that than Tom Cruise’s output.\n\nAnyone else think they should emphasise the team dynamic and the long con/heist going forward once Cruise leaves the building?",
        "upvotes": 374,
        "comments": 78,
        "media": null,
        "permalink": "/r/movies/comments/1kuy64g/oceans_11_is_closer_to_the_mission_impossible_tv/"
    },
    {
        "id": "1kulg3h",
        "author": "MarvelsGrantMan136",
        "title": "Live-Action ‘Voltron’ Movie, Starring Henry Cavill, Wraps Filming",
        "content": "",
        "upvotes": 2184,
        "comments": 247,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vkZTue_9b9yz6ESFeRezXQkODiaHVXkIhPBihMO_J28.jpg?auto=webp&amp;s=f0811b648b7f7f4f4a4dbfdf52e8bd166db68b10"
        },
        "permalink": "/r/movies/comments/1kulg3h/liveaction_voltron_movie_starring_henry_cavill/"
    },
    {
        "id": "1kuptde",
        "author": "Coderkid01",
        "title": "One of the coolest shots in any animated movie ever, from The Thief and The Cobbler Recobbled Cut",
        "content": "",
        "upvotes": 1011,
        "comments": 60,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/0s9wx2gknt2f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1kuptde/one_of_the_coolest_shots_in_any_animated_movie/"
    },
    {
        "id": "1kv3blw",
        "author": "ubcstaffer123",
        "title": "Mara Corday Dies: ‘Tarantula’ Cult Film Star &amp;amp; ‘Playboy’ Playmate Was 95",
        "content": "",
        "upvotes": 84,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jiow24u_BtUt5cgWfLvjWZF8kNTAQHEJC9TXxmr-MAc.jpg?auto=webp&amp;s=ecde91f773ff03671c59e2a93ea5371a04432086"
        },
        "permalink": "/r/movies/comments/1kv3blw/mara_corday_dies_tarantula_cult_film_star_amp/"
    },
    {
        "id": "1kunzia",
        "author": "peachpitt",
        "title": "Break-up movies that DON'T end with a new partner?",
        "content": "Going through a difficult breakup and all the top recommended breakup movies I've seen so far (500 Days of Summer, Forgetting Sarah Marshall) end with what I feel to be a cheesy cop-out: oh here's a new partner to solve all the main character's problems. 500 Days of Summer was especially painful with the very last scene: \"Hi, I'm Autumn.\" What about being with yourself, exploring, and improving, not relying on a partner to make you whole? Doesn't even have to necessarily be a break-up movie as long as it covers these themes of self-exploration and improvement. Thanks.",
        "upvotes": 916,
        "comments": 590,
        "media": null,
        "permalink": "/r/movies/comments/1kunzia/breakup_movies_that_dont_end_with_a_new_partner/"
    },
    {
        "id": "1kv51j3",
        "author": "KnightofGarm",
        "title": "Movies you heard bad things about, but ended up liking after seeing it",
        "content": "I watched the first Kingsman movie a few years ago and thought it was a lot of fun. I didn't even know there was a second one until I read some people saying that it was bad, that it disrespected the characters from the first movie, and some going as far as to say that you should only watch the first movie and pretend the sequel doesn't exist.\n\nYesterday I finally got around to watching it, and... just like the first one it was a lot of fun... not as good, but I didn't even think it was mediocre let alone anywhere near as bad as people made it out to be.\n\nThere are a lot of other movies I can think of that fit this criteria (such as The Lost World: Jurassic Park), but most of them I already saw before hearing the bad word of mouth, so I was curious what your experiences are of hearing a movie is bad/mediocre only to end up enjoying it are.",
        "upvotes": 43,
        "comments": 89,
        "media": null,
        "permalink": "/r/movies/comments/1kv51j3/movies_you_heard_bad_things_about_but_ended_up/"
    },
    {
        "id": "1kuer6l",
        "author": "NoCulture3505",
        "title": "Les Dilley Dies: 'Star Wars' Art Director Was 84",
        "content": "",
        "upvotes": 2352,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/CQc-mk5k1on-Z_ZVy8apaIkGstd3v1tjoZPK0Gtw2tA.jpg?auto=webp&amp;s=aad5b081f5dbd18a5534663d7c4bdbc170bf12e0"
        },
        "permalink": "/r/movies/comments/1kuer6l/les_dilley_dies_star_wars_art_director_was_84/"
    },
    {
        "id": "1ku9wyu",
        "author": "Ashamed_Feedback3843",
        "title": "Sparrows 1926 Mary Pickford",
        "content": "",
        "upvotes": 3874,
        "comments": 263,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/xvpa04fnyp2f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1ku9wyu/sparrows_1926_mary_pickford/"
    },
    {
        "id": "1kur4tx",
        "author": "delimeat7325",
        "title": "What’s a movie you didn’t see in theatres but wish you had?",
        "content": "One of them for me is Hereditary. It’s one of my favorite films and I wish I could have saw it on the big screen. It was thrilling watching it in my own home, I can only imagine what it was like watching it on large screen with amplified surround sound. The wails of Toni Collette were agonizing and ear piercing, the music and sounds were unsettling and dissonant. Even in the moments of sudden, compete silence were weary for me. It’s just a perfect display of grief and madness if that makes any sense.",
        "upvotes": 221,
        "comments": 580,
        "media": null,
        "permalink": "/r/movies/comments/1kur4tx/whats_a_movie_you_didnt_see_in_theatres_but_wish/"
    },
    {
        "id": "1kumg9n",
        "author": "Amaruq93",
        "title": "Sabotage suspected as power cut hits Cannes Film Festival",
        "content": "",
        "upvotes": 331,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XvKg4LnSDyS9dFRx8znYzGrcykSgxFlHRkpXpa1EqPI.jpg?auto=webp&amp;s=9c635b53f309e3faf69fe4bdc0a47c3f36ed0d17"
        },
        "permalink": "/r/movies/comments/1kumg9n/sabotage_suspected_as_power_cut_hits_cannes_film/"
    },
    {
        "id": "1kuj168",
        "author": "mayukhdas1999",
        "title": "First Image of Gael García Bernal in Lav Diaz's 'MAGELLAN' - In the 16th century, young Portuguese navigator, Ferdinand Magellan defies the King of Portugal, who rejects his dreams, and convinces the Spanish monarchy to fund his daring expedition to discover the fabled lands of the East",
        "content": "",
        "upvotes": 419,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/cuscrk361s2f1.jpeg?auto=webp&amp;s=2830909e50f730690e9656252a3fd9a691147e51"
        },
        "permalink": "/r/movies/comments/1kuj168/first_image_of_gael_garcía_bernal_in_lav_diazs/"
    },
    {
        "id": "1ku9aq1",
        "author": "Grant692",
        "title": "I Watched All 63 Disney Animated Movies, And It Was Delightful",
        "content": "I was born in the early 90s, in the midst of the Disney Renaissance, and I grew up on Disney movies. My mom showed me a lot of the classics in addition to the new ones that came out during my life, but I hadn't seen the vast majority of these films since childhood. So, nearly two years ago, I set out to watch every movie from Walt Disney Animation Studios (so, no live-action remakes, no made-for-TV sequels, etc.), in chronological order, to refresh my memory and fill in my blind spots. Overall, it was a wonderful experience. I ranked all of the movies on Letterboxd, and included my favorite moment from each one (usually an animated flourish, but occasionally a quote or an extended sequence). And below, I listed some good and bad surprises, and I ranked villains, vocal performances, and songs, just for fun!\n\nhttps://letterboxd.com/grant692/list/disney-ranked/\n\nGood Surprises:\n\n1. Cinderella - I really, really did not expect to come away from this with Cinderella as my favorite Disney movie and one of my favorite animated movies of all time. But it is. In my memory, it was the classic \"helpless princess, handsome prince, happily ever after\" story. Imagine my surprise when I find that it's a movie about a woman overcoming the most dreadful circumstances with kindness and humility and persistence and self-confidence. She's not immune to the weight of her terrible life, but when life gets her down, she picks her head up and gets back to solving her problems. She is a role model not just for little girls, but for all of us. AND it's beautifully animated, well-paced, and has one absolutely remarkable sequence (the transformation of everyone/everything in preparation for the ball). It's just splendid.\n\n2. One Hundred and One Dalmatians - I expected One Hundred and One Dalmatians to be relatively minor Disney, but I was blown away. From the gorgeous, painterly animation style, to the thrilling plot, to the devious villain, to the delightful side characters (Horace and Jasper are all-time great laughable lackeys)...it all just works.\n\n3. The Emperor's New Groove - I knew I was going to love The Emperor's New Groove, but not this much. It's just one amazing sight gag after another, coming in at an efficient 72 minutes (not including credits), and its blistering pace never runs out of steam. Amazing.\n\n4. Robin Hood - Robin Hood was one of my favorite Disney movies as a kid, but as an adult, I realized it didn't have the best reputation, so I wasn't optimistic going in...but I still loved it. It's fun, it's got some great music (\"Phony King of England\", especially), and a ridiculous villain+sidekick combo (Prince John and Sir Hiss).\n\n5. Atlantis: The Lost Empire - The crew could not be any more trope-y if it tried. Milo, the out-of-his-depth, nerdy scholar who the group reluctantly depends on. Rourke, the gruff, grizzled captain who clearly has ulterior motives. Helga, a young German woman and Rourke's second-in-command, who thinks she has to act all tough to look like she belongs next to her superior. Vinny, the cavalier Italian demolitions expert who just wants to run the family flower shop. Dr. Sweet, the physically imposing African-American/Native American doctor with a heart of gold. Audrey, the plucky, teenage Puerto Rican mechanic trying to impress her dad (who really wanted a son). Wilhelmina, the chain-smoking communications officer who looks and acts like she should have retired years ago. Cookie, the elderly chef of the expedition, who seems to have come from the Confederate South. Geatan Moliere, a Frenchman who goes by Mole, and also acts like a mole, and also looks like a mole. But it leans into those tropes with such affection, that I couldn't help but love it. \n\nBad Surprises: \n\n1. The Sword in the Stone - Like Robin Hood, The Sword in the Stone was one of my favorites growing up. I don't know what childhood me was thinking. The wizard duel is entertaining, but the plot is just totally inert otherwise. \n\n2. Tarzan - I didn't find the story all that interesting, nor the characters compelling. Much to my surprise, I also didn't love the music - it all sounded the same and didn't hook me whatsoever. RIP to the Phil Collins burning piano meme :(. \n\n3. Fantasia - Hailed as one of the all-time greats of Disney, I was excited...but it was too inconsistent. The Sorcerer's Apprentice is among the best things Disney has ever done, and Night on Bald Mountain is a good time...but otherwise? Couldn't find much to latch on to.\n\n4. The Black Cauldron - Yet another of my childhood favorite that I ranked lower than I'd hoped. I still probably have it higher than most, maybe due to my affinity for all things spooky and the fact that this is certainly the darkest Disney has ever gotten...but still didn't live up to expectations.\n\n5. Wish - This movie is SO bad. I skipped it in theaters when it came out a couple years ago (shortly after I started this project, actually) because of the so-so reviews, but I still thought I'd at least give it a solid 3/5 stars. But it looks terrible (like something from Disney Channel 10 years ago), the songs aren't the least bit memorable, there are no interesting characters, and the plot doesn't carry half the weight that it feels like it should. I LOVE the idea of this movie, and it fits so well into the mythology of Disney...which I think made me all the more angry at how it turned out. \n\n\nTop 10 Villains:\n\n1. Cruella De Vil (One Hundred and One Dalmatians)\n\n2. Hades (Hercules)\n\n3. Ursula (The Little Mermaid)\n\n4. Maleficent (Sleeping Beauty)\n\n5. Mother Gothel (Tangled)\n\n6. Yzma (The Emperor's New Groove)\n\n7. Ratigan (The Great Mouse Detective)\n\n8. John Silver (Treasure Planet)\n\n9. Scar (The Lion King)\n\n10. Doctor Facilier (The Princess and the Frog)\n\n\nTop 10 Vocal Performances:\n\n1. Robin Williams (Genie, Aladdin)\n\n2. James Woods (Hades, Hercules)\n\n3. Jodi Benson (Ariel, The Little Mermaid)\n\n4. Susan Egan (Meg, Hercules)\n\n5. Pat Carroll (Ursula, The Little Mermaid)\n\n6. Eleanor Audley (Maleficent, Sleeping Beauty)\n\n7. Eartha Kitt (Yzma, The Emperor's New Groove)\n\n8. Peter Ustinov (Prince John, Robin Hood)\n\n9. Patrick Warburton (Kronk, The Emperor's New Groove)\n\n10. Ming Na Wen (Mulan, Mulan)\n\n\nTop 20 Disney Songs:\n\n1. Friend Like Me (Aladdin)\n\n2. Part Of Your World (The Little Mermaid)\n\n3. I'll Make a Man Out of You (Mulan)\n\n4. Lost in the Woods (Frozen II)\n\n5. I've Got a Dream (Tangled)\n\n6. The Phony King of England (Robin Hood)\n\n7. For the First Time in Forever (Frozen)\n\n8. Under the Sea (The Little Mermaid)\n\n9. Surface Pressure (Encanto)\n\n10. Belle (Beauty and the Beast)\n\n11. Poor Unfortunate Souls (The Little Mermaid)\n\n12. Hellfire (The Hunchback of Notre Dame)\n\n13. I Just Can't Wait to Be King (The Lion King)\n\n14. Zero to Hero (Hercules)\n\n15. Hakuna Matata (The Lion King)\n\n16. The Bear Necessities (The Jungle Book)\n\n17. The Family Madrigal (Encanto)\n\n18. How Far I'll Go (Moana)\n\n19. I Won't Say (I'm In Love) (Hercules)\n\n20. Cruella de Vil (One Hundred and One Dalmatians)\n\nThat's it! It was a great little journey through the history of animation, and I'd encourage anyone interested to take it!",
        "upvotes": 1692,
        "comments": 342,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gwSBG5Ox9DXp10DLwbOoZqn6TRWPDnV3Yva9hPAockc.jpg?auto=webp&amp;s=2b9006b5b6cb675497653a39139cc6545bf18311"
        },
        "permalink": "/r/movies/comments/1ku9aq1/i_watched_all_63_disney_animated_movies_and_it/"
    },
    {
        "id": "1kusmwv",
        "author": "LayeredOwlsNest",
        "title": "What are some movies with unexpected \"feel bad\" endings that aren't supernatural horror movies or generic slashers? (Spoilers for a few different movies)",
        "content": "I don't mean movies where the horror movie villain \"dies\" and then surprise it's alive and gets everyone before it cuts to credits\n\nAnd I don't mean movies like Don't Look Up or Melancholia where the threat is coming since the beginning\n\nI'm talking more about movies like Eden Lake or The Mist, where the characters do everything right, and suddenly, through no fault of their own, their fate or the movies outcome just leaves you just feeling depressed\n\nIt's hard to explain, I'm looking for conceptually \"good\" endings that are \"bad\" in the context of the story, but not if the ending is a potential outcome that was telegraphed during the movie, and not where the horror movie ghost or demon or slasher comes back after being defeated",
        "upvotes": 89,
        "comments": 175,
        "media": null,
        "permalink": "/r/movies/comments/1kusmwv/what_are_some_movies_with_unexpected_feel_bad/"
    },
    {
        "id": "1kuh4p7",
        "author": "ChiefLeef22",
        "title": "2025 Cannes Film Festival: Jafar Panahi's 'It Was Just An Accident' wins Palme d'Or; Joachim Trier's 'Sentimental Value' wins Grand Prix; Wagner Moura wins Best Actor, Kleber Mendonça Filho wins Best Director for 'The Secret Agent'; Nadia Melliti wins Best Actress",
        "content": "",
        "upvotes": 486,
        "comments": 42,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wd3HHnsxxEjlnlgdSsv1lCgocyzG0e0B9dpVlSbI3w8.jpg?auto=webp&amp;s=5216bdb385fc54a8272438c3c20239424fbbd842"
        },
        "permalink": "/r/movies/comments/1kuh4p7/2025_cannes_film_festival_jafar_panahis_it_was/"
    },
    {
        "id": "1kuz893",
        "author": "Butterbuddha",
        "title": "Caveman (1981)",
        "content": "So awhile back I purchased a mystery box of 50 DVDS/Blurays (well, all DVDs so far) and when the Mrs and I are stumped for what to watch, we blind pull from the box. Just recently, we pulled the Ringo Starr farce, Caveman. \n\n\nBelieve it or not, this movie also stars very young Dennis Quaid as our hero’s right hand man, and a lovely Shelley Long as the less buxom but got-it-where-it-counts ride or die. \n\n\nIn a nutshell, Ringo wants the tribe leader’s very shapely woman (Played by Barbara Bach). But this gets him kicked out of the group and he has to find a way to score his dream gal and win the hearts of the group. The entire movie is only grunts save few just a few spoken words of English by the the only Asian caveman, in a Monty Python comedic twist. Not sure you can sit through an hour and a half of ooga booga? Me neither, but it happened lol. Puppetry/stop motion dinosaurs add to the silliness. \n\n\nThe fact this fine film didn’t get Oscar nods well….is unsurprising. But it made for an amusing evening. And of the 30 or so mystery movie night selections so far, it’s the only one I’ve come to chat about. So there’s that!\n\n\nSo tell me I’m not the only one to have seen this movie???\n\n\n\nEDIT: Changed to Dennis Quaid, instead of my mistake writing Randy. Also, Richard Moll (Bull, of Night Court fame) was the frozen Yeti!",
        "upvotes": 21,
        "comments": 16,
        "media": null,
        "permalink": "/r/movies/comments/1kuz893/caveman_1981/"
    },
    {
        "id": "1kuc26w",
        "author": "Mst3Kgf",
        "title": "There's few characters in cinema who are a big and as entertaining a loser as Jerry Lundegaard in \"Fargo.\" Not only is William H. Macy one of the best casting choices ever, but a big part of the film's appeal is just watching him mess up EVERYTHING.",
        "content": "I fully understand why Macy was so determined to play this role that he jokingly threatened to shoot the Coens' dogs if he didn't get it. Not only is Macy one of the best actors ever at playing this kind of character (see \"The Cooler\" for another excellent example), but Jerry is just such a screw-up at everything he does. Right from the beginning, his whole \"kidnap my own wife\" plan is so half-baked and inane that the very crooks he hires to do it are dubious about it. Think of how many ways he screws up:\n\n1. He hired Carl and Gaer on reference from someone at work (who only knows the latter and won't vouch for the former), knowing nothing about them or how competent they may be.(Short answer; not very.)\n\n2. Because of that, he can't contact them to call off the kidnapping when it looks like he might not need it done.\n\n3. He's amazed when his father in law, who is established from the beginning to not care much for him, won't just give him $750,000 with no strings attached.\n\n4. His mumbled excuses to the GM lawyer about the serial numbers to the non-existent cars he scammed them with. (\"Those're in the mail!\")\n\n5. His plan revolving around being able to deliver the ransom himself and therefore cut out most of it to keep, never realizing that his stubborn and controlling father in law (who, again, DOES NOT LIKE YOU, JERRY) might demand on doing it himself. And sure enough...\n\nAnd so on. And watching Jerry constantly fail and lose it is one of the great pleasures of the film, like when he impotently attacks his ice-covered windshield in rage or how his office blinds look like prison bars. Frequently, a character like this might bring about sympathy for his misfortunes, but not Jerry. Not only is he a loser, but his troubles are all self-inflicted. And in the end, when it all comes down on him, it feels earned and very satisfying.\n\nEven though he did manage to knock off $100 on the truecoat. You did accomplish that, Jerry.\n\n",
        "upvotes": 825,
        "comments": 164,
        "media": null,
        "permalink": "/r/movies/comments/1kuc26w/theres_few_characters_in_cinema_who_are_a_big_and/"
    },
    {
        "id": "1kv0oes",
        "author": "asrieldreemurr2232",
        "title": "My take on The Good, The Bad, and The Ugly.",
        "content": "If ever there was a movie that redefined the Western genre, it's The Good, The Bad, and The Ugly. This movie is nothing short of a cinematic masterpiece! Starring Clint Eastwood and released in 1966 in Italy, and 1967 in the United States; The Good, The Bad, and The Ugly was Italy's answer to the aging, redundant, and overdone Hollywood Western of the time. The Good, The Bad, and The Ugly is the final chapter of the Fistful of Dollars trilogy (a fact of which I was unaware the first time I watched it), continuing the adventures of the Man with No Name (or Blondie, as he's sometimes called in this film).\n\nI'll be completely honest, the first time I tried to watch this movie, I was too immature to appreciate it's rather slow pacing and got bored before the end of the first scene, but a few years later, when I tried it again, I had grown up quite a bit as a movie watcher and was able to fully appreciate it for what it is. The film has a slow buildup, but it has several good action scenes, a good portion of them involving the American Civil War. Every scene of this film serves a purpose as it builds up to the climactic final fight.\n\nSpeaking of the final fight, that has to be my favorite scene in the entire movie. This scene is easily my most favorite movie scene of all time! It's also one of the most important movie scenes in cinema history. This scene is so masterfully done, in my opinion. So much is said in this scene without any words being spoken. It all comes down to the characters' facial expressions, the camera shots, and the music. The music in this scene builds the tension so well, it has you on the edge of your seat! The tension in this scene is so thick, you could cut through it with a knife. When the shooting does finally start, it's like the crescendo of a piece of music. \n\nAll In all, The Good, The Bad, and The Ugly is my all time favorite western movie. 10 out of 10.",
        "upvotes": 15,
        "comments": 20,
        "media": null,
        "permalink": "/r/movies/comments/1kv0oes/my_take_on_the_good_the_bad_and_the_ugly/"
    },
    {
        "id": "1kurdrz",
        "author": "gnome_ole",
        "title": "Altered States (1980) has held up well",
        "content": "I'm pretty sure I saw this in the theater when it came out, and don't think I'd repeated until last night.\n\nI do remember liking it, but I'm truly astounded by how well it has held up. Maybe it's just because it didn't try to do too much, or because the dialogue is so well written idk.\n\nGive it a rewatch if it's been anywhere near 45 years. \n",
        "upvotes": 73,
        "comments": 20,
        "media": null,
        "permalink": "/r/movies/comments/1kurdrz/altered_states_1980_has_held_up_well/"
    },
    {
        "id": "1kufamj",
        "author": "Good-Body8515",
        "title": "What’s a great movie you watched recently that nobody talks about—and you wish more people had seen?",
        "content": "I recently watched *Coherence* (2013), and I’m honestly shocked more people don’t talk about it. It’s a low-budget sci-fi film that relies entirely on tension, dialogue, and a mind-bending concept instead of special effects. I won’t spoil anything, but if you're into psychological thrillers or multiverse theories, this one's a hidden gem.\n\nIt made me wonder—what other underrated movies are out there that deserve way more attention? I’d love to build a list of lesser-known but incredible films. Drop your favorites below!",
        "upvotes": 426,
        "comments": 579,
        "media": null,
        "permalink": "/r/movies/comments/1kufamj/whats_a_great_movie_you_watched_recently_that/"
    },
    {
        "id": "1kuxm02",
        "author": "FilmWaffle-FilmForum",
        "title": "What movie has the best set design?",
        "content": "I don’t think I fully appreciated the art of set design until I watched ‘Once Upon a Time in Hollywood’. People can say what they want about the movie but the world they built is undoubtedly immersive. Easily some of the best set design I’ve seen in a movie. \n\nWhat other movies come to mind when you think “best set design”? ",
        "upvotes": 23,
        "comments": 79,
        "media": null,
        "permalink": "/r/movies/comments/1kuxm02/what_movie_has_the_best_set_design/"
    },
    {
        "id": "1kul4vi",
        "author": "count_olaf24",
        "title": "dead Poet's society is heartbreaking 💔",
        "content": "the only thing I could think of saying during that movie was- \"that's not fair.\"\n\nbecause what else is there to say? Neil didn't deserve that at all, neither did Todd, or Charlie, or the teacher, or any of the other boys.\n\nI really want to talk about this film with someone but for some reason the subreddit for dead poet's society is locked on here? the Pinterest community is pretty big but other than that I don't know where to go.\n\nso yea, dead poet's society fans, where y'all at?? let's yawp in the comments together :)))",
        "upvotes": 182,
        "comments": 89,
        "media": null,
        "permalink": "/r/movies/comments/1kul4vi/dead_poets_society_is_heartbreaking/"
    },
    {
        "id": "1kuwaff",
        "author": "Bomb_Wambsgans",
        "title": "I love Punch Drunk Love (2002)",
        "content": "I think this film is PTA’s best. Almost 25 years old and not sure there has been a film like it since. He is absolutely cooking when it comes to pacing and the cinematography (which he shot) is so unique to me it’s like nothing else I’ve ever seen. \n\nHe’s dropping all time sequence after all time sequence in this movie. From the opening segment with the crash and Sandler on the harmonium where the score breaks in so abruptly, framing Sandler in that incredible gradient, to the “he loves me” sequence that ends up with Sandler calling Emma on the payphone in Hawaii, maybe my favorite in the history of film, just amazing.\n\nAdding to the four or five other posts in the last few years posing the same question, what do yall think of the movie, both where it stands with PTA and where it stands in modern film canon",
        "upvotes": 24,
        "comments": 14,
        "media": null,
        "permalink": "/r/movies/comments/1kuwaff/i_love_punch_drunk_love_2002/"
    },
    {
        "id": "1kum750",
        "author": "BristledIdiot",
        "title": "What Movie did you love as a child/young person that you now like WAY less?",
        "content": "For me, I think it’s Robots (2005). I write sci-fi and the designs of that movie have clearly influenced my interests in more adult sci-fi, but on a rewatch it has very little to offer besides bright colors and nice animation/design. \nIt doesn’t just have to be a kids movie, if you had a movie you truly thought was your favorite as a teenager that you rewatched recently and don’t like, that works too.",
        "upvotes": 108,
        "comments": 591,
        "media": null,
        "permalink": "/r/movies/comments/1kum750/what_movie_did_you_love_as_a_childyoung_person/"
    },
    {
        "id": "1ku9erd",
        "author": "danielhutt",
        "title": "What’s the most unforgettable movie ending you’ve ever seen?",
        "content": "I recently rewatched The 40-Year-Old Virgin and was reminded of how the ending totally blindsided me the first time around. One minute, I’m watching a raunchy rom-com, and the next, I’m smack in the middle of a full-blown musical fever dream. I honestly thought I had dozed off and imagined it—it was so out of left field, it felt like the movie switched genres just to mess with me.\n\nWhat other movies have endings that unforgettable?",
        "upvotes": 648,
        "comments": 718,
        "media": null,
        "permalink": "/r/movies/comments/1ku9erd/whats_the_most_unforgettable_movie_ending_youve/"
    },
    {
        "id": "1kuq5fo",
        "author": "X01ENCLAVESTAN",
        "title": "What's your favorite detail from a movie?",
        "content": "Something small, very unnoticeable, but makes you all the much more giddy and satisfied with the movie. Me personally, my favorite is at the end of Ratatouille. As you get a look at the restaurant that Remy, Linguini, and Collette own you get to see Anton Ego one last time, and you can see that his face and body are overall more pudgy. It's small, but shows how Anton is finally more willing to eat all food, to give it a chance. It just makes me so giddy since he is also one of my favorite movie characters of all time. \n\nBut what about you guys?",
        "upvotes": 57,
        "comments": 74,
        "media": null,
        "permalink": "/r/movies/comments/1kuq5fo/whats_your_favorite_detail_from_a_movie/"
    }
]