[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 8,
        "comments": 66,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 56,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1l9wag6",
        "author": "ggroover97",
        "title": "Netflix Users Say They Dislike New Layout; Research Says Otherwise",
        "content": "",
        "upvotes": 376,
        "comments": 124,
        "media": null,
        "permalink": "/r/netflix/comments/1l9wag6/netflix_users_say_they_dislike_new_layout/"
    },
    {
        "id": "1lacr5p",
        "author": "Sweaty-Toe-6211",
        "title": "Ted Danson Reveals Wife Mary Steenburgen Is Playing His Love Interest in Man on the Inside Season 2: ‘We’re Nauseatingly in Love’",
        "content": "",
        "upvotes": 17,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lacr5p/ted_danson_reveals_wife_mary_steenburgen_is/"
    },
    {
        "id": "1lac44y",
        "author": "Atlast_2091",
        "title": "The Diplomat: Season 3 | Official Teaser | Netflix",
        "content": "",
        "upvotes": 10,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lac44y/the_diplomat_season_3_official_teaser_netflix/"
    },
    {
        "id": "1l9x7e2",
        "author": "Kindly_Dot_7006",
        "title": "Trainwreck Astroworld",
        "content": "I thought the doc was really well done. It’s crazy how much cell phone footage they have of how crazy the crowd became. It really is crazy that just a few years later it seems all is forgiven for Travis Scott and Live Nation just for settling law suits with the families of the deceased outside of court. Do you think this documentary will stir this up again especially for Travis?",
        "upvotes": 28,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1l9x7e2/trainwreck_astroworld/"
    },
    {
        "id": "1la9uux",
        "author": "Proof-Heron7",
        "title": "Ginny&amp;Georgia mental health problems discussion",
        "content": "It will be my thoughts about TRAITS not diagnosis!!!!\n\nI’ve got diagnosed with multiple mental health issues during my life, so I could relate with the carather’s problems (and maybe this is the reason why I am addicted with this show, it is so refreshing to see in an american show that they try to talk about mental health, even if it is just a series).\n\nGinny - early signs of BPD, panic disorder (fun fact: my symtomps also started when I was 12 w selfharm and panic attacks) the crashout to Marcus, when he tries to be caring, splitting to people, see everything black and white, and the abondentment issue, in some way Favourite person tendencies (Another fun fact at this age I had the same combo, my first love was also depressed, and it was the same dynamic). My fav part while rewatching (I try to be ironic a bit with the word of fav) when Ginny starts to feel owerhelmed by her emotions, instead of self harm, goes to Marcus and tries to have sex, she wants to distract, and in the third season with Wolfe also, I am very familiar with this feeling. And if we are at Wolfe careless sex, and Ginny also has tendencies to overuse anything is a big waving flag for BPD. Oh, and the realitionship with her mother is a big big trigger, Georgia always flips the narrative about herself, she flips the blame, she doesnt see Ginny’s feelings and also invalidates them, because he runaways from the feelings as from problems (Third fun fact, it was the same dynamic with my mom, still this day, but without murder and stuff, but I lived 6 places til I became 18, and she always lied to “save me and my little brother” this shit is traumatizing) And also, she likes to write - which means she feels a lot - most of the artistic persons dealing with mental health issues - it is just a note.\n\nMaxine - ADHD, quiet depression I was diagnosed with ADHD also, and in the third season they perfectly show how it feels like, with Maxine carachter, you want to be everywhere, you feel to much, you have so much thoughts, and in a sudden you you just get exhausted, and you freezed, get depressed, and you realize burnt every bridges around yourself - it can be some bipolar traits also, but that is not my first impression about Maxine. There’s the episode where she switch off and on the lights, lot of people said that it is OCD, yeah it can be, but I think ADHD sometimes includes OCD, and if you check the whole episode, it is def ADHD demonstraition.\n\nMarcus - depression Oh dear Marcus! I had two big love in my life, as I mentioned I had my “Marcus” when I was 17, and in that time honestly was so hard, because I didnt understood depression (discovered latley I had also that time, but not in that way in Marcus). It is hard to write about it because depression sometimes seems selfishness, but the other person is dying inside, I think the series tries to show this both side of this mental health problem. They say it out loud he has depression. Depression is something you see in the other eyes. You feel nothing but the darkness. You know you love someone, but sometimes you can’t feel it. Because you belive you are a bad person, you are acting like one, and push everyone away who loves you, because you are someone who unloveble. Til that they I couldn’t figured out how to handle it, the one who has it… It fckn sucks. And addicton I think it comes with it… or with any other mental health issue. You want to be normal. And you feel yourself normal with any addictive mind altering thing, until you not. When nothing is enough, and you find yourself in the rabbit hole - Marcus is great example for it.\n\nAbby - Eating disorder Abby is pro example of someone who deals with eating disorder, most likely bulimia, and in the world of social media it got so much worse in the last years, so much more teenager, starts to develope the traits, not because it became a fashion, as some stupid people says, it is because that looking good became more public than ever. But I also think, it is also about being traumatized in every age. Abby’s parents divorce can be a trigger, and also that she never feels to being fit anywhere.\n\nGeorgia - narcissistic traits, avoidant attachment style, cpstd, panic disorder The question is on every social media platform that Georgia is a good or bad mom. My opinion is def that she isn’t. I wouldn’t say that she has a narcissistic personality disorder, because she feels empathy, but she brings to the table lots of narcissistic traits. I mentioned at Ginny’s phrase. But you can relate with this character, because you know how much she got traumatized in the past, that’s why I think she have CPTSD, or actual PTSD, the memories are hunting her. But if we speak about her as a mom - she says that herself doing everything to their kids - which is true, but in one hand, she doesn’t do it that the way the kids needs, in the other hand she always wants to good in the others eyes. The list could goes on, I was crying in every Ginny&amp;Georgia fighting scene, because my relived my childhood traumas…\n\nAustin - Autism I don’t know much autism, but I saw some example in my life, and Austin shows traits. Even Paul mentions in season 2 that maybe Austin has the similar issues that his little brother, which Georgia instantly denies, but it can be. And Paul’s brother clearly has autism.\n\nI didn’t wrote about panic disorder at the mom and daughter phrases, but it is also a hell, I’ve been there also, and now I developed a generlized anxiety disorder, and I think it hard to point out on the screen, maybe that Georgia is always in a flight or fight, and drinking about every day can be a working sign of it, but it is not clear.\n\nI think the author seen a lot in her life, because it is a well fckn well written script about mental health issues.\n\nLet me know if you noticed something else, I am corious what’ve may seen based upon your experience.\n\n(English is not my first language so sorry if it is not correct somewhere 🫶🏻)",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1la9uux/ginnygeorgia_mental_health_problems_discussion/"
    },
    {
        "id": "1laf2vx",
        "author": "Livid_Pin6367",
        "title": "We are going to chill like kings, ladies and gentlemen!",
        "content": "I am so excited for these masterpieces to come to Netflix. Personally, I am most excited for Stranger Things 5. Wednesday Season 2 got me really excited as well, along with Squid Game Season 3. Alice in Borderland 3 is also something that seems promising and we should look forward to. 2025 is going to be the best year ever for a cinematic experience. Netflix and Chill!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1laf2vx/we_are_going_to_chill_like_kings_ladies_and/"
    },
    {
        "id": "1lak2sy",
        "author": "Ok-Adhesiveness-8235",
        "title": "200 FACTS ABOUT DEXTER YOU'VE NEVER HEARD",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lak2sy/200_facts_about_dexter_youve_never_heard/"
    },
    {
        "id": "1l9hv75",
        "author": "turnipsnbeets",
        "title": "Just got the new layout. It’s unusable. Thinking of switching services.",
        "content": "I just tried to browse for a movie to watch and turned off my tv after about 45 seconds. Had to look up what this layout shift was all about. What makes finding a title easy is to categorize and condense the list so you can see a lot of things at once; that's what makes for a good experience. I'm now literally browsing to find something 3 titles at a time I have no comprehension of what I looked at a few clicks back.. no ability to see a group of titles at once and make that nerve wracking decision of should I watch John Wick again or Interstellar? I fucking hate having to decide on a movie sometimes and always love when I find just what I'm looking for, and right now I'm not even going to attempt to find anything on this constricting layout that's just going to frustrate me and not provide literally the experience I'm paying for which is to REALX. Whoever thought this was a good idea..I hope you're reading the feedback. At least give me an option to switch back to the old layout. Shopping other streaming services immediately after I post this.",
        "upvotes": 99,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1l9hv75/just_got_the_new_layout_its_unusable_thinking_of/"
    },
    {
        "id": "1lafw8q",
        "author": "HipHop823",
        "title": "Households",
        "content": "Has anyone else cancelled their membership over households?  I just did.\n\nI worked late last night, so I turned on Netflix on my office TV and got a message about updating my primary household.  I followed the process, not really understanding it, and made my office my primary household.  So now this morning, at my actual household, I tried to watch Netflix and I had to jump through a bunch of hoops to get logged in.\n\nI do completely understand that account sharing is a problem they are trying to solve.  But I also have to believe there was a better way to do that than this.  I've had a membership since 2010.  I've never account shared once in 15 years.  Netflix just made it tougher for the honest customer to watch a web-based service from wherever they are.  I think that's crazy.\n\nSo I cancelled.\n\nAm I the only one?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lafw8q/households/"
    },
    {
        "id": "1la8701",
        "author": "BlackwerX",
        "title": "Superbro, Tires - similar shows?",
        "content": "Any similar TV shows/movies like this? Looking for fun, light-hearted recommendations to relax with—nothing too serious, just easygoing entertainment. Sillier the better, raunchy is ok too.... ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1la8701/superbro_tires_similar_shows/"
    },
    {
        "id": "1labcdm",
        "author": "secret_plotter13",
        "title": "Those anyone know more similar series/movies like enola holmes???",
        "content": "I would love to watch more things like enola holmes, about women getting more recognition mixed with the thrill of mysteries (I like them with comedies too!) I've watched apothecary diaries and Anne with an E",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1labcdm/those_anyone_know_more_similar_seriesmovies_like/"
    },
    {
        "id": "1la7a4y",
        "author": "LKS983",
        "title": "Netflix doc. Cocaine Air",
        "content": "I watched this documentary yesterday evening, and thoroughly enjoyed it - and even laughed out loud a few times at some of the 'porkies' being told!\n\nI probably enjoyed it even more (as light relief) - as I watched it immediately after the horrifying/depressing Oceangate/Titan documentary.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1la7a4y/netflix_doc_cocaine_air/"
    },
    {
        "id": "1laadcg",
        "author": "Indoril-Nerevar337",
        "title": "Netflix had 3 shows and a single movie in Top 10 for the week of May 12- May 18",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1laadcg/netflix_had_3_shows_and_a_single_movie_in_top_10/"
    },
    {
        "id": "1la6sul",
        "author": "LemonDropYum",
        "title": "Unlocked: A Jail Experiment S1E1 ending song?",
        "content": "What's that classical song called? I think it's in a different language. It's during the end credits. Right after the stab-hungry inmate says that he's going to need to make a shank. ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1la6sul/unlocked_a_jail_experiment_s1e1_ending_song/"
    },
    {
        "id": "1la34nu",
        "author": "WuzzWuzz",
        "title": "Arnold Schwarzenegger talks Season 2 of 'FUBAR', 'Twins' and his iconic catchphrases",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1la34nu/arnold_schwarzenegger_talks_season_2_of_fubar/"
    },
    {
        "id": "1la9aqt",
        "author": "Capable-Lemon-1268",
        "title": "whats that one discontinued film in like the early 2020s?",
        "content": "it was like teens in new york or dc idk, then there was like a school shooting drill and then like a asain teen girl thats a virgin n had sex w a boy, then they went to a party, then some girl climbed onto a train with a boy in the back of it, she was smiling and tearing up and shit.. anyone know the name?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1la9aqt/whats_that_one_discontinued_film_in_like_the/"
    },
    {
        "id": "1la8bj0",
        "author": "TinyMonsterBigGrowl",
        "title": "The Jeff guy on the new MH370 documentary drives me crazy.",
        "content": "I honestly may not be able to finish this. His crazy slanderous theories. One after another. It's like a big game where he does as much damage as possible and then moves on. Those poor families. ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1la8bj0/the_jeff_guy_on_the_new_mh370_documentary_drives/"
    },
    {
        "id": "1lai736",
        "author": "Internal-Bed-3150",
        "title": "Netflix just made David Letterman fans’ day with this big reveal",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lai736/netflix_just_made_david_letterman_fans_day_with/"
    },
    {
        "id": "1l8pzf4",
        "author": "S4v1r1enCh0r4k",
        "title": "David Harbour Says Goodbye to Stranger Things: \"After 10 Years, It’s Time to Move On\"",
        "content": "",
        "upvotes": 1200,
        "comments": 153,
        "media": null,
        "permalink": "/r/netflix/comments/1l8pzf4/david_harbour_says_goodbye_to_stranger_things/"
    },
    {
        "id": "1l9q2je",
        "author": "indiewire",
        "title": "The Best Indie Movies on Netflix: 36 Films Streaming",
        "content": "",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l9q2je/the_best_indie_movies_on_netflix_36_films/"
    },
    {
        "id": "1l9xmsd",
        "author": "NotNowCrazyBob",
        "title": "Mecha and card type anime I can’t find",
        "content": "I remember seeing these two anime on Netflix, one was this mecha anime were the main characters use these small robots that has like sentience and they use disk that insert into the robots to use like a power up or projectiles, there were toys for the anime as well; \n\nand there was a anime that I would best describe it like a mix between yugioh and pixelmon, we’re in the world they play a card game like yugioh and the MC had a this cat thing that’s also a card that can turn into this giant lion at the end of the series, and I really liked both of the shows when I was younger and I can’t find them ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l9xmsd/mecha_and_card_type_anime_i_cant_find/"
    },
    {
        "id": "1l9pxut",
        "author": "oceanicitl",
        "title": "Dept. Q is based on Jussi Adler-Olsen's books",
        "content": "He's written a series of 10 Department Q books based in Copenhagen. I highly recommend them. No the series isn't exactly like the book but it was a very good adaption. Edinburgh had a similar vibe to the Nordic city and the casting was excellent.\n\nIf you enjoyed the show please check out the books and read them in order. ",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1l9pxut/dept_q_is_based_on_jussi_adlerolsens_books/"
    },
    {
        "id": "1la2ccr",
        "author": "hulkbuster2511",
        "title": "Why is everyone depressed on Ginny&amp;Georgia season3?",
        "content": "I know the show is mainly about awareness and trauma but s3 is too much. They managed to decently balance the storyline in s1&amp;2 but feels like literally every single character is in depression in s3 and they made the entire season about a friggin lawsuit which also ended in a very anti-climactic way! What a bummer.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1la2ccr/why_is_everyone_depressed_on_ginnygeorgia_season3/"
    },
    {
        "id": "1l9m60o",
        "author": "Remarkable-Toe-4413",
        "title": "Ginny and Georgia",
        "content": "Season 3 really left me dissatisfied and disappointed. The same drama was dragged out for over 7 hours with only a few twists to keep it going. Georgia, as usual, was busy with her endless rants and chaotic sex life—constantly yapping without much depth.\n\nGinny looked sexy but stayed low-key throughout the season, which felt like a missed opportunity to develop her character. As for Paul, I couldn’t tolerate his forced masculinity and lack of real emotions. He seemed to be living in a bubble of idealism—felt bad for him at times, but not enough to care deeply.\n\nOn the brighter side, I loved Lynette’s character. She was a truly supportive mother and mother-in-law, probably one of the few genuine personalities this season. Meanwhile, Georgia’s so-called friends proved they’re not even loyal to each other, let alone to her. That dynamic felt hollow.\n\nOverall, compared to the previous seasons, this one gets a 6/10 from me. Wouldn’t recommend wasting time on it.\n",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1l9m60o/ginny_and_georgia/"
    },
    {
        "id": "1l9y4nl",
        "author": "elldivino69",
        "title": "Netflix Billing Issue - how do you get to talk to anyone? UK here",
        "content": "Hi all. \n\nI have a billing issue and on the Netflix contact us page is just sending me round in circles. Web chat never seems to be available…how can you contact anyone from there!?\n\nAny help would be awesome! \n\nThanks. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l9y4nl/netflix_billing_issue_how_do_you_get_to_talk_to/"
    },
    {
        "id": "1l9w9vb",
        "author": "Junior_Apartment6388",
        "title": "Ginny and Georgia creator reveals Austin won’t be recast even though he’s too old",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l9w9vb/ginny_and_georgia_creator_reveals_austin_wont_be/"
    },
    {
        "id": "1la949u",
        "author": "Toogeloo",
        "title": "I feel like I completely missed the point of Adolescence.",
        "content": "I thought it was going to be some kind of mystery thriller, but it feels like it just kind of went nowhere to me.  I got the impression they just wanted to show off the continuous shot format, which was cool, but the story just was kind of boring without any twists and turns. ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1la949u/i_feel_like_i_completely_missed_the_point_of/"
    },
    {
        "id": "1l9slw4",
        "author": "visionofscarlet",
        "title": "The House",
        "content": "I've just finished watching this stop motion adult animated TV special/movie. It's rather strange but rather interesting. I'm actually a little creeped out by it but I definitely recommend it to you. It also gives me a horror vibe, so if you're into that sort of thing you will definitely love it. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l9slw4/the_house/"
    },
    {
        "id": "1la8lbr",
        "author": "Better_Theory_7233",
        "title": "Cancel your subscription",
        "content": "This shit with the new layout is the last straw. The only way they will get the message is by unsubscribing. You can always subscribe back if they get their head out of their ass.",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1la8lbr/cancel_your_subscription/"
    },
    {
        "id": "1l9rumu",
        "author": "Painfully-Stupid",
        "title": "Suddenly can't watch Netflix on PC?",
        "content": "My Roku on my TV works just fine, both on the same network and both are hard lined. Now it's telling me my Netflix isn't a part of the household. I've tried incognito and a different browser with no luck. Anyone else have this issue?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l9rumu/suddenly_cant_watch_netflix_on_pc/"
    }
]