[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 45,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 13,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qemamp",
        "author": "Reddit_Sucks_1401",
        "title": "The Live-Action Zelda Movie Is Coming To Netflix Following Its Theatrical And Home Entertainment Release Periods",
        "content": "",
        "upvotes": 193,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1qemamp/the_liveaction_zelda_movie_is_coming_to_netflix/"
    },
    {
        "id": "1qez4kr",
        "author": "Texanlivinglife",
        "title": "The Rip",
        "content": "Oh my goodness. Damon and Affleck have done it again. Best movie!!! I mean full on suspense throughout. I hope they continue making great movies. The ending though wow!!! ",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qez4kr/the_rip/"
    },
    {
        "id": "1qekauv",
        "author": "Thissuxxors",
        "title": "What a beautiful show MO is...",
        "content": "As a Palestinian, I was upset with Netflix that MO was only 2 seasons. It seems to obviously be rushed, so I don't think it was the original idea to only have it as 2 seasons. Clearly there were some ugly people that didn't want the show to continue and put pressure on Netflix.\n\nNow I could say that Netflix are cowards if that is indeed the case as I assume, however, I don't think that. If anything, Thank you Netflix for having the guts to allow this show to exist. To produce it and to put it on your platform. It truly is a hilarious, wonderful, heartfelt show that shows the struggles of Palestinians. I would say it is a love letter to Palestinians and our beautiful culture.\n\nThe actors were absolutely wonderful, and while some of it was just hard to watch, particularly MOs struggles. The show left me feeling good and hopeful.\n\nParticularly I loved the Thanksgiving get together at the farm. It was just beautiful to see all these people who are different come together because it felt they were all family.\n\nSorry if my post sounds corny, but I really did love this show so much.\n\nAnyway, for those who haven't seen it, I highly recommend it. It's a brilliant, clever and outrageously funny show.\n\nThank you Netflix.",
        "upvotes": 25,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1qekauv/what_a_beautiful_show_mo_is/"
    },
    {
        "id": "1qenxr1",
        "author": "Left_Actuary_7890",
        "title": "His &amp; Hers (Netflix/Book) – Genuine questions about character choices",
        "content": "Spoilers for His &amp; Hers (Netflix) and the novel\n\nFirst, I want to be very clear up front: this post is NOT victim-blaming, minimizing assault, or being insensitive. The show covers extremely heavy subject matter, and I’m asking these questions in good faith to better understand the characters, their psychology, and the story’s themes.\n\nI just finished His &amp; Hers on Netflix and was genuinely caught off guard by several of the later revelations. I’m still processing some of the character choices and was hoping people who’ve watched the show and/or read the book could help expand on them.\n\nMy main questions:\n\n1. Why did Anna get involved with Jack at all, knowing he was Zoe’s brother?\n\nAnna’s trauma stems from what happened when she was 16; when her friends Zoe, Rachel, and Helen orchestrated the assault, sold photos, and then watched, laughed, and mocked her while it happened.\n\nKnowing this, Anna choosing to be with Jack (Zoe’s brother) was odd?\n\nWas this relationship meant to show:\n\n\t•\ttrauma bonding or unresolved attachment?\n\n\t•\ta way of reclaiming control over her past?\n\n\t•\tself-punishment or denial?\n\n\t•\tor is there more internal context in the book that the show didn’t fully explore?\n\n2. Why is Lexy (Catherine) so fixated on Anna years later?\n\nCatherine/Lexy was also a victim, but she ran away and left Anna behind in the woods. Yet as adults, Lexy seems to direct an intense amount of blame, resentment, and obsession toward Anna.\n\nIs this survivor’s guilt turning into projection? Or does the novel give more insight into her mindset and how she rationalizes this?\n\n3. Did anyone else expect the reveal to be “less extreme” at first?\n\nBefore the woods scene, I honestly assumed the trauma might be centered on bullying or humiliation..not the calculated setup, photos, and assault itself. That escalation completely blindsided me.\n\n4. And bluntly… how are we meant to interpret Lexy getting her own sister killed? 💀\n\nI understand trauma can seriously distort judgment, but this was downright psychotic. Is Lexy meant to be seen as someone spiraling, or as a cautionary example of unresolved trauma turning destructive?\n\n5. For book readers: what did the show change or leave out?\n\nWere there:\n\n\t•\tinternal monologues or motivations cut from the adaptation?\n\n\t•\tchanges to character dynamics (especially Anna, Jack, Alice or Lexy)?\n\n\t•\tplotlines or reveals that were simplified or altered?\n\nI’d really appreciate if novel readers could expand on whether the book gives clearer psychological grounding for these choices, or if the ambiguity is intentional.\n\nThanks in advance.\n\nI’m genuinely interested in thoughtful discussion from both show-only viewers and readers.",
        "upvotes": 14,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qenxr1/his_hers_netflixbook_genuine_questions_about/"
    },
    {
        "id": "1qdvcd0",
        "author": "Mucek121",
        "title": "What's the Best Documentary You've Ever Seen? Need Recommendations!",
        "content": "Looking for must-watch documentary recommendations! Whether it's mind-blowing, inspiring, or eye-opening—drop your favorites!\n\n  \nThank you for answer",
        "upvotes": 568,
        "comments": 1255,
        "media": null,
        "permalink": "/r/netflix/comments/1qdvcd0/whats_the_best_documentary_youve_ever_seen_need/"
    },
    {
        "id": "1qemp7p",
        "author": "nikhiljr12",
        "title": "Watched the movie THE RIP",
        "content": "Only got to know about this movie 2 days ago and was waiting to watch it. Atmosphere was nice, beginning u doubt all of them and the way they clear the air about the bad guys was also great.\nThoroughly enjoyed watching Ben Affleck again!",
        "upvotes": 12,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1qemp7p/watched_the_movie_the_rip/"
    },
    {
        "id": "1qen51s",
        "author": "insaneruffles",
        "title": "Netflix Error tvq-st-144",
        "content": "Was watching Netflix when this error popped up, and I cant seem to fix it.\n\nIm on an LG C4.\n\nAll of my other apps and streaming services work.\n\nI restarted the TV.\n\nThe Netflix network check shows all connections as green.\n\nIve tried closing and reopening the app several times.\n\nanyone have any other solutions? thanks!\n\nEDIT: Everyone who is having this issue, uninstalling and re installing the app worked for me.",
        "upvotes": 11,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1qen51s/netflix_error_tvqst144/"
    },
    {
        "id": "1qeset4",
        "author": "atomiccaffa",
        "title": "The psychology of \"Bundle\": Why Agatha Christie gave her smartest female lead such a silly nickname in Seven Dials",
        "content": "\"Bundle\" is not just 1920s slang given to Lady Eileen Brent for her chaotic character. Agatha Christie had a very specific psychological reason for giving her most competent women names like \"Bundle,\" \"Egg,\" or \"Bunch.\"\n\n  \nHere is an investigation about the \"Bright Young Things\" archetype, the historical context of the name, and why being called something \"infantile\" allowed these women to act as the perfect undercover investigators in a male-dominated aristocracy.",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qeset4/the_psychology_of_bundle_why_agatha_christie_gave/"
    },
    {
        "id": "1qeyt0z",
        "author": "StriderDB",
        "title": "Tires Season 3?? Will this be happening?",
        "content": "I just binge watched the first two seasons. I can’t really find any info if season 3 is happening or even a ETA?\n\nIt remind me a lot of the office and I love this show. \n\nDoes anyone have any insight. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qeyt0z/tires_season_3_will_this_be_happening/"
    },
    {
        "id": "1qeiru5",
        "author": "Flapalms239",
        "title": "The Rip",
        "content": "I have the cheapest ad plan. I watched this movie this morning and had zero ads!  I’m not complaining but did anyone else notice this as well? \n\nAs for the film itself I enjoyed it for the most part. I don’t see myself watching it a second time though. ",
        "upvotes": 11,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1qeiru5/the_rip/"
    },
    {
        "id": "1qeopwz",
        "author": "mrstevegibbs",
        "title": "Do I need to pay extra? We have a cabin in the woods. We log into our home Netflix account there.",
        "content": "Occasionally we get an inescapable popup message asking if we want to pay $6.99 for a second party. It requires us to click Learn More before letting us proceed. \n\nSometimes, though rarely, we let our grandson stay at the cabin and he likely watches Netflix while we are watching it at home. That happens very very seldom. \n\nWhen we login ourselves at our cabin we are occasionally asked if we are traveling and of course we are and say yes. \n\nMust I pay extra for this situation? ",
        "upvotes": 4,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1qeopwz/do_i_need_to_pay_extra_we_have_a_cabin_in_the/"
    },
    {
        "id": "1qe3wpp",
        "author": "Dramatic_Stretch2760",
        "title": "People We Meet On Vacation",
        "content": "Let me preface this by saying: I love rom-coms. Like, I will defend the genre every time. That said… this movie was not it.\n\nI haven’t read the book, so don’t come for me- I’m judging purely on the film. From the very beginning, both main characters were insufferable. Poppy leaned too hard into the chaotic, ultra–Type B personality, while Alex was painfully rigid and Type A. We’re told they’re best friends, but the movie never convincingly shows why. I genuinely couldn’t see how they’d tolerate each other for more than 20 minutes, let alone build a long-term friendship.\n\nThe chemistry was nonexistent. On top of that, the emotional cheating while they were both in relationships was uncomfortable - are we just supposed to normalize that now?\n\nThe pacing was off, and the story tried to cram in every rom-com trope imaginable, which made everything feel rushed and forced instead of charming or organic. I kept waiting for it to click… and it never did.\n\nDisappointing, especially for a genre I usually adore.",
        "upvotes": 77,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1qe3wpp/people_we_meet_on_vacation/"
    },
    {
        "id": "1qeaoxr",
        "author": "RiseoftheBandit",
        "title": "His &amp; Hers",
        "content": "I couldn’t come to Reddit fast enough . I legit just binged this show on Netflix because of the actors . I first played it for background noise because I needed a new show. But let me tell you I was hooked . All the plot twist was crazy. I’m glad it was short and straight to the point. If you need a show while you are cleaning or playing a game this is it !  ",
        "upvotes": 20,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1qeaoxr/his_hers/"
    },
    {
        "id": "1qeshfe",
        "author": "Nuo_Vibro",
        "title": "The Rip - Subtitles",
        "content": "All the subtitles are doubled, making some of them unreadable. \n\nBig movie of the weekend and they drop the ball like this. Shameful behaviour.\n\nOtherwise a solid wee thriller.",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qeshfe/the_rip_subtitles/"
    },
    {
        "id": "1qer9e2",
        "author": "Icy-Calligrapher1188",
        "title": "His&amp;Hers... a few things made no sense. Anyone care to explain?",
        "content": "The series was okay. Enough for me to binge it in a day and keep wanting to play the next episode. But dialogue and acting was... meh. \n\nOk, things that didn't make sense and I'm unsure if it was just a weird way to think one way and throw us off track? If so... kind of sloppily done. \n\n1) the whole intro. Anna hurrying to clean up her apartment and her tooth being infected or whatever? \n\n2) what was Lexy and Richard's end game?? Why did they have all of that stuff at the lake house? \n\n3) So did Lexy become a news anchor just to get back at Anna or to do what? (See 2) \n\n4) I don't even understand the whole Clyde and Helen side quest. \n\n5) Why did Zoe say to Jack that Anna isn't who he thinks she is. Guessing to side-blame because shit was about to go down?? \n\nI'm sure there's others I am unsure about but that's in my brain rn. ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qer9e2/hishers_a_few_things_made_no_sense_anyone_care_to/"
    },
    {
        "id": "1qen3hm",
        "author": "Galeprime",
        "title": "\"Netflix has encountered a network error\" codes",
        "content": "Attempting to login to Netflix on my Xbox Series X and I've had several error codes which point to network issues. Yet everything is connected fine (tested store, twitch, etc). \n\nEven my Netflix app logs in fine on my Pixel 8.\n\nAnyone else getting this? I'm in the UK. Error code 115 and 142 seems to keep coming up.\n\nConsole is wired connected to my network too. ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qen3hm/netflix_has_encountered_a_network_error_codes/"
    },
    {
        "id": "1qen0da",
        "author": "Mnemosense",
        "title": "Experiencing a subtitle bug during The Rip...",
        "content": "Just wanted to know if anyone has experienced this, but when someone speaks in a foreign language and there's forced English subs, they're in yellow embedded text, but the subtitle is duplicated and there's the same text underneath in white.  \n\nIs this a known bug or something I can investigate on my end? Though, not sure what else I can do, subs are not enabled in the Netflix app or in the TV's own settings...",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qen0da/experiencing_a_subtitle_bug_during_the_rip/"
    },
    {
        "id": "1qeyu69",
        "author": "MotiveGFX",
        "title": "Million Dollar Secret - Netflix Best Reality Show?",
        "content": "I really though this was the best reality show I've ever seen. However, just like most \"reality tv\", there were paid actors and predetermined outcome. \n\nI must say Corey played the worst game in the end-- pointing fingers always puts a target on your back what a doofus.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qeyu69/million_dollar_secret_netflix_best_reality_show/"
    },
    {
        "id": "1qesp3y",
        "author": "Ordinary-Wind9728",
        "title": "I'm 17 in Canada can I buy Netflix without an adult?",
        "content": "I've been wanting to buy Netflix for a while, just for a month, so I can watch some of my favorite childhood shows (mostly cartoons and animated shows ment for a younger audience) after talking with my parents they said it was fine but they weren't going to pay for it. when I went to sign up for a subscription it asks me to confirm I am over 18 but I'm still only 17. \n\nCan I get in trouble with Netflix for saying yes and possibly violating the terms of service? Should I wait till I'm 18 (4-5 months) or my parents are willing to buy it?\n\nEdit: thanks for the humor and answers! Helped me realize I'm being a bit silly with this and will probably just buy the subscription for a month. :)",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1qesp3y/im_17_in_canada_can_i_buy_netflix_without_an_adult/"
    },
    {
        "id": "1qe68tx",
        "author": "Dex_Stlap",
        "title": "The Rip review – Ben Affleck and Matt Damon tear through flashy Netflix bro thriller",
        "content": "The Rip review – Ben Affleck and Matt Damon tear through flashy Netflix bro thriller\n\nOne of much watch to see this weekend highly anticipated cast of Ben affleck &amp; Matt demon through the ups &amp; down of life.\n\nReally great direction &amp; visuals &amp; drama is quite impressive \n\nA must watch for movie lovers ",
        "upvotes": 21,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1qe68tx/the_rip_review_ben_affleck_and_matt_damon_tear/"
    },
    {
        "id": "1qdxfl7",
        "author": "Southern-Brother5693",
        "title": "Netflix &amp; Sony Pictures Strike Industry-First Exclusive Pay-1 Deal",
        "content": "",
        "upvotes": 57,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1qdxfl7/netflix_sony_pictures_strike_industryfirst/"
    },
    {
        "id": "1qer5w5",
        "author": "Acrobatic-Age4653",
        "title": "Members Only: Palm Beach Is Just A Housewives Knockoff!?",
        "content": "Saw this YouTube video. Do you think Members Only: Palm Beach is a housewives knockoff or its own thing? It feels refreshing actually to not have 30yo wannabe influencers on reality tv 😂",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qer5w5/members_only_palm_beach_is_just_a_housewives/"
    },
    {
        "id": "1qdv393",
        "author": "BazookoTheClown",
        "title": "Seven Dials is insufferable",
        "content": "Currently watching the new Agatha Christie mini series.\n\nMia McKenna Bruce is the worst actress I've ever seen. You can see her \"acting\" every second. It just seems so unnatural.\n\nAlso, the lens/filter choice makes every picture look like a drunk scene in another movie might look.\n\nLazy directing. The amount of good content that Netflix releases has really shrunk to a minimum. ",
        "upvotes": 70,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1qdv393/seven_dials_is_insufferable/"
    },
    {
        "id": "1qepyxy",
        "author": "Twan88mot",
        "title": "Nieuwe mediabox en Netflix is weer normaal?",
        "content": "Heel lang was het uiterlijk van Netflix vervelend. Je zag veel opties en categorieën niet. \n\nVandaag heb ik een nieuwe mediabox gekregen en het uiterlijk van Netflix is nu weer normaal zoals het ooit was. \n\nHebben meerderen dit? Is het toeval?\n\nOf heeft Netflix het teruggedraaid?\n\nMijn tv heeft geen update gehad. Echt alleen de mediabox van ziggo. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qepyxy/nieuwe_mediabox_en_netflix_is_weer_normaal/"
    },
    {
        "id": "1qejbwf",
        "author": "Illustrious_Iron_774",
        "title": "Bad performance",
        "content": "Hi, I’m having issues with Netflix in my tv, when I play any movie/serie, I can’t use subtitles bc they are with delay, ui slows downs a lot… This don’t happen with Amazon prime, yt or anything else. What can I do?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qejbwf/bad_performance/"
    },
    {
        "id": "1qdp9cu",
        "author": "Yungvalor20",
        "title": "Black Summer Cancelled",
        "content": "I just finished Black Summer and it was fantastic. I googled to see when season 3 was coming out and it said it was cancelled. What an absolute shame. Personally I believe this is the best zombie apocalypse series I have ever seen. It's realism and cinematography is top notch. The acting and performances are outstanding. I really do not understand how Netflix could just let this one go. I am really sad about this one!",
        "upvotes": 127,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1qdp9cu/black_summer_cancelled/"
    },
    {
        "id": "1qenq7r",
        "author": "Interesting_Serve406",
        "title": "Help on finding my Netflix profile.",
        "content": "Hi all, \n\nThis happened to me recently and i need help figuring out what happened. so I'm sharing a Netflix account with my friend and she's the account owner (2 separate profiles). Yesterday when i logged in to the app i saw that my profile has disappeared form the account and couldn't find it. Even my friend the account owner tried but she also couldn't come up with an answer on why it happened. Please help me figure out what happened and is there a way to recover my profile. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qenq7r/help_on_finding_my_netflix_profile/"
    },
    {
        "id": "1qend3j",
        "author": "lydocia",
        "title": "Which miniseries should I watch?",
        "content": "Just finished Run Away and I'm in the mood for some more short series of only a couple of really good episodes (instead of twelve seasons or only one season that doesn't have a good ending).\n\nI'm open to most things, just not horror, too nsfw/pornographic, or anything about war.\n\nWhat should I watch?",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1qend3j/which_miniseries_should_i_watch/"
    }
]