[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 5,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1nca7vm",
        "author": "Tullio_Ostello",
        "title": "Average Torinese riso enjoyer",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qh6uducqn2of1.jpeg?auto=webp&amp;s=5d38e3e605b5e4225073bd981dec6cf94846905d"
        },
        "permalink": "/r/torino/comments/1nca7vm/average_torinese_riso_enjoyer/"
    },
    {
        "id": "1ncct2d",
        "author": "vikktor123",
        "title": "Qualcuno che si è fatto sistemare i denti da impress?",
        "content": "Buongiorno a tutti, avete mai provato impress? Come  vi siete trovati?  Hanno dei prezzi molto bassi. Mi hanno fatto in preventivo di 2800 che in rispetto a Invisalign sono 2k di risparmio.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ncct2d/qualcuno_che_si_è_fatto_sistemare_i_denti_da/"
    },
    {
        "id": "1nccpdf",
        "author": "RoyalElderberry6695",
        "title": "Lezione gratuita tango argentino principianti assoluti (under 40)",
        "content": "Ciao a tutti,\n\nIn breve: questo giovedì 11 Settembre ore 20:00 in Via Giacinto Pacchiotti, 18 (quartiere Parella, zona tesoriera, fermata metro Monte Grappa), l'associazione Tangonauti terrà una lezione gratuita di tango argentino per under 40.\n\nSe siete interessati, vi prego di confermare la presenza al numero di telefono su Google Maps, via chiamata o WhatsApp e dire anche se si è da soli o in coppia.\n\nhttps://maps.app.goo.gl/z6MUd8AVJz7a9sv86\n\nÈ una scuola che frequento da Gennaio e li ho trovati davvero competenti. Ho saputo che potrebbero non esserci persone sufficienti per questo giovedì perché han difficoltà a trovare giovani che siano interessati e questo mi dispiace.\n\nCasomai vi piacesse, potrete continuare settimanalmente, stesso giorno della settimana, stessa ora a pagamento. Personalmente non ricevo nulla da questa promozione. Spero solo di riuscire ad avvicinare una comunità a questo ballo.\n\nSarò presente casomai servisse un ballerino in più.\n\nGrazie a tutti",
        "upvotes": 2,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/m3ehrw2sf3of1.jpeg?auto=webp&amp;s=a81273c8740677cb1fc4acecf24667dbdd378c94"
        },
        "permalink": "/r/torino/comments/1nccpdf/lezione_gratuita_tango_argentino_principianti/"
    },
    {
        "id": "1nbskw0",
        "author": "spacecraft628",
        "title": "Un tuffo negli anni ’80: arriva Bubble 80 a Grugliasco (TO)!",
        "content": "Dal **26 al 28 settembre 2025** al **Parco Le Serre di Grugliasco (TO)** prende vita un doppio evento imperdibile dedicato alla cultura pop anni ’80.\n\n🎮 **Bubble 80 – Game eXplosion**  \nUna maxi sala giochi di 1.000 m² con oltre **90 cabinati arcade**, **30 console storiche**, flipper, air hockey, calciobalilla e una mostra di giocattoli, Lego e giochi da tavolo. Tutto originale, grazie alle partnership con Arcade Story e Tutto questO, e gioco completamente libero. I biglietti sono limitati, acquistali il prima possibile!\n\n🛍️ **Bubble Market** (solo 27 e 28 settembre, ingresso gratuito)  \nUn mercatino con musica, animazione, cosplay, interviste su tanti temi interessati e un DJ set.\n\n👻 Special cosplayer: **Ghostbusters Italia**  \n🎶 DJ set con le canzoni più iconiche e le sigle (telefilm, cartoni animati, trasmissioni TV)  \n📺 Ospite speciale: **Carlotta Brambilla Pisoni** (storica conduttrice di *Bim Bum Bam*)\n\nUn weekend per rivivere la magia degli anni ’80 tra divertimento, musica e nostalgia.  \nInfo e biglietti: [www.bubble80.it](http://www.bubble80.it)",
        "upvotes": 8,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/eh00w47hxynf1.jpeg?auto=webp&amp;s=3e43fa24626a0549f84b99b30b7502a77323f3d9"
        },
        "permalink": "/r/torino/comments/1nbskw0/un_tuffo_negli_anni_80_arriva_bubble_80_a/"
    },
    {
        "id": "1nbfdkk",
        "author": "SteamPaz",
        "title": "Sept. 2025 Lunar Eclipse",
        "content": "EQUIPMENT\nCanon EOS 2000D\n\nACQUISITION\n500mm f/6.3, 180x1/2s (90s), ISO12800\n\nPOSTPROCESS\nRawTherapee, Siril, Gimp, Snapseed",
        "upvotes": 61,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/su25pnu2nvnf1.jpeg?auto=webp&amp;s=dc578d87302184cd02edaf136599679129e45b26"
        },
        "permalink": "/r/torino/comments/1nbfdkk/sept_2025_lunar_eclipse/"
    },
    {
        "id": "1nbort3",
        "author": "lilJet777",
        "title": "San Salvario Sicurezza",
        "content": "Ciao!\n\nSono una ragazza di 28 anni che si deve trasferire a Torino entro fine settembre.\n\nQuanto è sicura e tranquilla la zona di San Salvario est, vicino al parco del Valentino, sotto Corso Marconi, come da foto?",
        "upvotes": 11,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/g9yb05tp7ynf1.png?auto=webp&amp;s=a1f64e8108be61535827bd44b2c767392ab38af1"
        },
        "permalink": "/r/torino/comments/1nbort3/san_salvario_sicurezza/"
    },
    {
        "id": "1nbk8ih",
        "author": "Nearby-Mode-2659",
        "title": "Parto da zero a Torino",
        "content": "Salve, sono un ragazzo di 28 anni. Sto per trasferirmi a Torino e so già che mi sentirò molto solo (si spera almeno solo i primi tempi).. sapete indicarmi eventi, gruppi telegram e facebook o altro in cui fare amicizia? Vengo da un piccolo paese del sud e trasferirmi in una grande città probabilmente sarà un po' disorientante . Grazie a chi deciderà di aiutarmi &lt;3",
        "upvotes": 13,
        "comments": 17,
        "media": null,
        "permalink": "/r/torino/comments/1nbk8ih/parto_da_zero_a_torino/"
    },
    {
        "id": "1nc2mv6",
        "author": "Sad-Cod-5436",
        "title": "whitemoon 19 settembre",
        "content": "Ciao a tutti! Il 19 settembre c’è Lazza al Whitemoon e mi piacerebbe andarci, ma non ho ancora un gruppo.\nSe qualcuno ha già un tavolo VIP o vuole organizzarne uno, fatemi sapere che ci uniamo ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nc2mv6/whitemoon_19_settembre/"
    },
    {
        "id": "1nbruyh",
        "author": "Intelligent-Tart-287",
        "title": "Looking for help with apartment calls – English/Italian speaker in Torino &lt;&gt; Cerco aiuto per telefonate agli appartamenti – bilingue italiano/inglese?",
        "content": "[English Version]\nHi everyone,\n\nI’m currently looking for an apartment in Torino through apps like Immobiliare and Idealista, but I’ve run into a problem. Whenever I call from my non-Italian number (anything not starting with +39), the agencies or landlords often don’t answer, or they immediately say the apartment is not available, even when it actually is.\n\nI was wondering if anyone here speaks both Italian and English and might be able to help me by making some calls on my behalf. Of course, I’d be happy to compensate you for your time and help.\n\nIf you’re interested or know someone who could assist, please send me a message. Thank you so much in advance!\n\n⸻\n\n[Versione Italiana]\nCiao a tutti,\n\nSto cercando un appartamento a Torino tramite app come Immobiliare e Idealista, ma ho incontrato un problema. Ogni volta che chiamo con il mio numero non italiano (qualsiasi numero che non inizi con +39), le agenzie o i proprietari spesso non rispondono, oppure dicono subito che l’appartamento non è disponibile, anche se in realtà lo è.\n\nMi chiedevo se qualcuno qui parla sia italiano che inglese e potesse aiutarmi facendo alcune telefonate al posto mio. Naturalmente sarei felice di offrirvi un compenso per il vostro tempo e il vostro aiuto.\n\nSe siete interessati o conoscete qualcuno che potrebbe darmi una mano, scrivetemi in privato. Grazie mille in anticipo!",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nbruyh/looking_for_help_with_apartment_calls/"
    },
    {
        "id": "1nbkp1b",
        "author": "Optimal-Snow3953",
        "title": "Sarò a Torino per 4 giorni. Ho voglia di incontrare qualcuno.",
        "content": "Ciao, sto viaggando in bici per Italia e il mio ultimo posto è Torino dove sarò dal 9.9 al 13.9. Vorrei incontrare qualcuno, anche turista, non mi importa tanto, e bere qualcosa durante una serata tipo. \nMi piacono lingue, film, libri, musica (sopratutto electronica, che cè a Torino), storia, ciclismo. \n\nSono un ragazzo di 29 anni di Nova Gorica, però parlo abbastanza bene l'italiano.\n\nHo gia trovato un \"meetup\" evento, ma comunque preferisco incontrare 1 al 1, perché così avevo sempre incontri intersanti. \n\nVoglio anche aggiungere che non sto cercando nessun \"hookup\" or qualcose del genere (anche ragazze sono benvenute, però non per andare a letto insieme).",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nbkp1b/sarò_a_torino_per_4_giorni_ho_voglia_di/"
    },
    {
        "id": "1nbvcut",
        "author": "DanielFHD4K",
        "title": "Multa per SOSTA NON PARALLELAMENTE ALLA STRADA",
        "content": "Ciao a tutti, ho ricevuto una multa come da titolo, vorrei approfondire meglio le motivazioni per cui nel punto in cui ero parcheggiato non potessi mettermi in quel modo. Non c'è segnaletica orizzontale nè tantomeno verticale che indichi il contrario, come invece è presente nel segmento di strada prima dell'incrocio. Mi sapete indicare a chi posso chiedere? Grazie",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1nbvcut/multa_per_sosta_non_parallelamente_alla_strada/"
    },
    {
        "id": "1nbjlal",
        "author": "davivesp",
        "title": "Nuovi amic*",
        "content": "Ciao a tutt\\*, sono un ragazzo di 29 anni. Mi sono trasferito qualche anno fa a Torino e, causa la mia personalità un po’ introversa, ho sempre fatto difficoltà nelle nuove amicizie. Mi piacerebbe trovarmi con persone con la quale instaurare un bel rapporto di amicizia, uscire e fare cose insieme. \n\nSe anche tu sei in cerca di nuove conoscenze, commenta o scrivimi pure! :)",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nbjlal/nuovi_amic/"
    },
    {
        "id": "1nbt9ie",
        "author": "MauroIcardi_",
        "title": "Is Via Nizza 31 nice place?",
        "content": "",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nbt9ie/is_via_nizza_31_nice_place/"
    },
    {
        "id": "1nbh03e",
        "author": "Cptnerolol",
        "title": "Posti carini per caffè e studio?",
        "content": "Ciao ragazzi/e, conoscete qualche posto dove poter studiare e che allo stesso tempo faccia da bar nei pressi del centro di Torino? \nGrazie! :) ",
        "upvotes": 7,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1nbh03e/posti_carini_per_caffè_e_studio/"
    },
    {
        "id": "1nbn0ri",
        "author": "sonnypike",
        "title": "Allianz stadium to airport this Sunday, advice please!",
        "content": "Hello,\n\nI am visiting for the Juve vs Inter game on Saturday but have to get back to the airport (Turin) for a flight at 20.50. \n\nAm happy to leave the match a bit early to make sure I arrive on time, but can anyone please advise on the best way to get there?  \n  \nNot clear if the train service will be running. \n\nIf not, where would be best place to get a taxi? Hoping that leaving early will make it possible to find one.\n\nMany thanks.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1nbn0ri/allianz_stadium_to_airport_this_sunday_advice/"
    },
    {
        "id": "1nbhwo6",
        "author": "LCL0LCL",
        "title": "Concerto band Swans a Milano",
        "content": "Cerco qualcuno che vada al concerto degli Swans all'auditorium di Milano il 4 Novembre e che possa/voglia accompagnarmi dividendo la spesa del carburante, in particolare per il ritorno che non ci sono bus 😭",
        "upvotes": 2,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ivuir5ggfwnf1.png?auto=webp&amp;s=eaff866dd12423b764efcf5221a9bc15edc5c77f"
        },
        "permalink": "/r/torino/comments/1nbhwo6/concerto_band_swans_a_milano/"
    },
    {
        "id": "1nbjyln",
        "author": "Floofs-In-Space",
        "title": "sales points for www.mailticket.it and www.TicketOne.it ?",
        "content": "Hi, I just found out my favorite new artist, [Lamante, is playing on Wednesday](https://hhiroshimamonamour.org/eventi/lamante/).\n\nMy sim/phone number is from Portugal, so I can't buy the ticket online because I can't verify the number. I don't know why.\n\nThe website says \"For ticket sales we use two authorized sales networks [**www.mailticket.it**](https://www.mailticket.it/location/0052260213786/hiroshima-mon-amour-torino) and [**www.TicketOne.it**](https://www.ticketone.it/city/torino-217/venue/hiroshima-mon-amour-15237/) with its sales points throughout Italy.\"\n\nI'm new in town. Where can I find sales points?\n\nOr should I just go to the box office? If so, any idea if they're open during the day. I did some googling, but no dice.\n\nAlso, if the doors are 8pm, what time does the music typically start? Thanks a bunch!!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1nbjyln/sales_points_for_wwwmailticketit_and/"
    },
    {
        "id": "1nb12rd",
        "author": "Murky_Giraffe8700",
        "title": "L'inquinamento atmosferico è direttamente collegato all'aumento del rischio di demenza",
        "content": "",
        "upvotes": 15,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QdAUGe5hn2Ee2BAqaRT7nA7L1rL3Tk1_E4tnEmXAihg.jpeg?auto=webp&amp;s=c4d86c5cf91cf4c6d53841759c63641c3b0a69e4"
        },
        "permalink": "/r/torino/comments/1nb12rd/linquinamento_atmosferico_è_direttamente/"
    },
    {
        "id": "1nb3vdt",
        "author": "SpeechHaunting8877",
        "title": "Gtt incomprensibile",
        "content": "Allora   \nL'anno scorso faccio sto abbonamento annuale da 800 pecunie che copre quattro zone di linea extraurbana (bus) che fanno dal mio paesello a Torino.   \n(Avrei probabilmente potuto usufruire della formula studenti ma non lo sapevo)  \nHo scoperto poi che questo abbonamento mi dava accesso anche a qualunque autobus, mezzo, metro illimitatamente (la mia carta bip valeva come biglietto in tutti questi casi descritti).   \n\nMo' sto facendo ricerca perché vi giuro non capisco. Ho girato sul sito della gtt per mezz'ora e continuo a non trovare alcun piano di abbonamento che preveda sia una linea extraurbana che tutta la rete urbana.    \n\nLeggo che ci sono formule \"urbana +suburbana\", ma ribadisco, quanto è vero Iddio, che la mia linea non è suburbana ma proprio extraurbana (sebbene per un tratto diventi suburbana quando ci si avvicina a Torino).   \nMa quindi?   \nÈ una falla nel sistema?   \nNon dovrei avere accesso ai mezzi della città ma per qualche motivo il mio biglietto risulta valido?  \nQualcuno sa spiegarmi?   ",
        "upvotes": 10,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1nb3vdt/gtt_incomprensibile/"
    },
    {
        "id": "1nbhp0a",
        "author": "Floofs-In-Space",
        "title": "Best Emergency Rooms and Hospitals near San Salvario",
        "content": "Hi, I recently relocated to Torino. I always like to know about the best ERs and hospitals nearby.\n\nAny recommendations?\n\nI had a heart attack two years ago. I now have a clean bill of health, but just in case...",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1nbhp0a/best_emergency_rooms_and_hospitals_near_san/"
    },
    {
        "id": "1nba5is",
        "author": "littlemissnobody___",
        "title": "Concerto Canzoniere Grecanico Salentino 2/10 @alcatraz",
        "content": "Ciao ragazzi, il 2/10 a Milano ci sarà il concerto di Canzoniere Grecanico Salentino. Io vorrei andarci ma ci andrei totalmente sola e non ho il passaggio per il ritorno (il primo treno per tornare a Torino sarebbe tipo alle 6 am o giù di lì). \nQualcuno di voi ci va e ha posto in macchina? Oppure qualcuno di voi ci va in treno e gradirebbe compagnia durante l'attesa? Sono socievole e offro vino \"casaluru\" ✨✨✨",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1nba5is/concerto_canzoniere_grecanico_salentino_210/"
    },
    {
        "id": "1nbg8xs",
        "author": "Wonderful_Donkey8967",
        "title": "Che fare in centro per qualche ora?",
        "content": "Ciao amici torinesi, perdonatemi la domanda probabilmente idiota, so che sarete comprensivi! Oggi nel primo pomeriggio sarò di passaggio tornando verso casa dalla Francia, avrò qualche ora di tempo e mi chiedevo se qualcuno volesse essere così gentile da darmi qualche consiglio su cosa fare o dove mangiare. \n\nPurtroppo non penso avrò abbastanza tempo per andare per musei, ma insomma immagino ci siano cose da vedere anche senza un biglietto da pagare.\n\nSe qualcuno poi ha voglia di far compagnia ad un povero, solitario fiorentino, offro volentieri un caffè, e ai primi 3 che telefoneranno un set di pentole in acciaio inox più bici con cambio shimano",
        "upvotes": 1,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1nbg8xs/che_fare_in_centro_per_qualche_ora/"
    },
    {
        "id": "1nbik1n",
        "author": "rideontim3",
        "title": "domanda, questa volta sul serio",
        "content": "dove posso reperire lafufu di questo genere? ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1nbik1n/domanda_questa_volta_sul_serio/"
    },
    {
        "id": "1nb3dxj",
        "author": "Prior_Impact1613",
        "title": "Concerto Benji e fede",
        "content": "Ciao! Sto cercando qualcuno con cui andare al concerto di Benji e Fede ( 19/9 Sesto san Giovanni), visto che ai miei amici non interessa. Qualcuno di voi ci andrà?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nb3dxj/concerto_benji_e_fede/"
    },
    {
        "id": "1nb7s2g",
        "author": "OrdinaryPotential968",
        "title": "CIMEA for A-Levels",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nb7s2g/cimea_for_alevels/"
    },
    {
        "id": "1nau7ay",
        "author": "mugiwara_m",
        "title": "canzoni alle stazioni metro",
        "content": "in vita mia non ho mai riconosciuto una canzone messa alla radio alle stazioni metro. come mai vengono sempre messe canzoni sconosciute? è una radio gestita apposta per gtt o una playlist messa a random da qualcuno che si occupa apposta solo di questo?",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1nau7ay/canzoni_alle_stazioni_metro/"
    },
    {
        "id": "1naqev1",
        "author": "onofriol",
        "title": "Eclissi lunare",
        "content": "Ciao, consigli su dove andare a vedere l'eclissi lunare questa sera?",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1naqev1/eclissi_lunare/"
    },
    {
        "id": "1nawqfa",
        "author": "noahn03",
        "title": "Cerco amicizie queer a Torino",
        "content": "Ciaoo\nmi piacerebbe conoscere nuove persone queer a Torino. Mi piace la scena gotica/punk ma sono aperto a interessi di ogni tipo. Se vi va di uscire o fare due chiacchiere, scrivetemi🫶",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nawqfa/cerco_amicizie_queer_a_torino/"
    },
    {
        "id": "1naolex",
        "author": "Demiurgo_-_",
        "title": "Prezzo ristrutturazione a m2",
        "content": "Ciao a tutti, chiedo per avere delle informazioni da chi di voi ha fatto dei lavori di ristrutturazione totale una casa a Torino (inteso impianti elettrico e idraulico e massetto) \nSecondo la vostra esperienza qual’è più o meno il prezzo a metro quadro per una ristrutturazione totale? \nSo bene che non si può avere una cifra standard ma più o meno vorrei capire la cifra indicativa o per lo meno individuare un range. \nTenendo conto che non voglio né qualcosa di extra lusso né qualcosa di molto economico. ",
        "upvotes": 2,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1naolex/prezzo_ristrutturazione_a_m2/"
    },
    {
        "id": "1nap333",
        "author": "Hyzev_",
        "title": "Ricerca palestra pallavolo",
        "content": "Ciao, siamo un gruppo di amici che ogni settimana gioca a pallavolo, qualcuno conosce delle palestre dove ci sono almeno 2 campi? \nIl gruppo è abbastanza numeroso e ci piacerebbe organizzare dei minitornei con 4 squadre (2h di sera), qualcuno conosce delle strutture simili? \nAttualmente l'unica cosa che potrebbe fare al caso nostro è la Vigone ma non sempre è libera🤔",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1nap333/ricerca_palestra_pallavolo/"
    }
]