[
    {
        "id": "1kf7u97",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 28,
        "comments": 6245,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kf7u97/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1kj2isq",
        "author": "EffectiveTie3144",
        "title": "OTD, May 10-th 2017 Benzema destroyed that time's best defense in the world in 2 seconds.",
        "content": "",
        "upvotes": 307,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TJ0eXHwWxGx8lxeCASTiAqt8ujSgyZGyDWQqGK3kFcI.jpeg?auto=webp&amp;s=5760100aedf885d4d5cb12459f50fe207934a10b"
        },
        "permalink": "/r/realmadrid/comments/1kj2isq/otd_may_10th_2017_benzema_destroyed_that_times/"
    },
    {
        "id": "1kijsus",
        "author": "ArmageddonJundy",
        "title": "Valverde's voice the last time Barcelona won a UCL",
        "content": "",
        "upvotes": 990,
        "comments": 54,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/y3iu10j8nrze1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kijsus/valverdes_voice_the_last_time_barcelona_won_a_ucl/"
    },
    {
        "id": "1kiid3l",
        "author": "soulhunterrai",
        "title": "17 year old Madrid Luka Doncic 🥶",
        "content": "🥶🥶🥶",
        "upvotes": 969,
        "comments": 31,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/hrvqea2wbrze1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kiid3l/17_year_old_madrid_luka_doncic/"
    },
    {
        "id": "1kii9l2",
        "author": "WhySoWeirdUsername",
        "title": "Xabi Alonso as CDM, who says no?",
        "content": "He is now a free agent and we can use him in defense!!",
        "upvotes": 768,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qz2svrz9brze1.jpeg?auto=webp&amp;s=fe3294725ae0d0cbd4d70e4ac38b6712d0848730"
        },
        "permalink": "/r/realmadrid/comments/1kii9l2/xabi_alonso_as_cdm_who_says_no/"
    },
    {
        "id": "1kiwrxa",
        "author": "Mastermind_737",
        "title": "Xabi won't use a 3 back. It'll look like it tho.",
        "content": "He will just use Tchouameni in that CRUCIAL holding midfield position which gives the same support and structure as a 3 back. This is the key missing piece that has led to our horrendous season this year. It allows our fullbacks and midfielders to have less pressure defensively. There is a reason that we won 4 champions with Casemiro in that role and then 1 champions with Tchouameni there. Playing Tchouameni at center back was Carlo's mistake for he \"solved\" a problem which then opened up a bigger problem. Our attack became disconnected from our back line and we recovered less balls. Bellingham and Valverde were constantly scrambling to cover the fullbacks which left the middle of the field exposed forcing our centerbacks to press and get cooked. And when they cover the middle, our centerbacks are forced to support the fullbacks and they get cooked. \n\nWe win more duels up the field when Tchouaméni is there. Just throw any random center back there and let Tchouameni cook. ",
        "upvotes": 103,
        "comments": 28,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kiwrxa/xabi_wont_use_a_3_back_itll_look_like_it_tho/"
    },
    {
        "id": "1kigwjf",
        "author": "TimothyX7",
        "title": "Xabi Alonso leaves Bayer 04 at the end of the season",
        "content": "",
        "upvotes": 715,
        "comments": 62,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Iddwkx-NPz4M5ub_1xhJ9joqoXFGvSQa6vMTv_2dMOA.jpeg?auto=webp&amp;s=628d31bd0bd61880015bb32807d43222ee9edbca"
        },
        "permalink": "/r/realmadrid/comments/1kigwjf/xabi_alonso_leaves_bayer_04_at_the_end_of_the/"
    },
    {
        "id": "1kig677",
        "author": "Ready_Ad_1353",
        "title": "[Florian Pletternberg] Xabi Alonso has informed Bayer 04 Leverkusen that he will leave the club at the end of the season. He is set to join Real Madrid! Alonso may announce it himself at today’s press conference.",
        "content": "\n",
        "upvotes": 659,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qyowIe3btxUgA6CLmOBQh9SEeRGvv-rOSl8xdDHeKjI.jpg?auto=webp&amp;s=66c3accc34f79e84a1c1f7aea6242f3a76e7ec15"
        },
        "permalink": "/r/realmadrid/comments/1kig677/florian_pletternberg_xabi_alonso_has_informed/"
    },
    {
        "id": "1kiguj1",
        "author": "EffectiveTie3144",
        "title": "Happy birthday to former manager Jupp Heynckes 🇩🇪",
        "content": "",
        "upvotes": 510,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2TudoesdPIBqwqVi6CjVSBDskECbXd4tqe2yl6u25L4.jpeg?auto=webp&amp;s=7ad290904254ae8b2d7d29daa1cf0d0ed7434de7"
        },
        "permalink": "/r/realmadrid/comments/1kiguj1/happy_birthday_to_former_manager_jupp_heynckes/"
    },
    {
        "id": "1kimax9",
        "author": "Miserable-Subject-87",
        "title": "Carlo Ancelotti’s verbal agreement with Brazil for the World Cup 2026, still valid and available to be signed. After issues on timing between CBF and Real Madrid, Carlo will proceed with exit steps after El Clásico. The Federation, waiting for Ancelotti to sign.",
        "content": "",
        "upvotes": 202,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WqTp211j_9I1fvNACJfoP0nOSVFHD0j8ytxxGfZF42s.jpg?auto=webp&amp;s=8c480c48ba53d6ae73e23b594bd970141ae64edf"
        },
        "permalink": "/r/realmadrid/comments/1kimax9/carlo_ancelottis_verbal_agreement_with_brazil_for/"
    },
    {
        "id": "1kiins2",
        "author": "Ready_Ad_1353",
        "title": "Xabi Alonso on his coaching role model: in terms of man management Ancelotti is a master and a great personality to everyone. I had the privilege of working with him at Madrid and Bayern Munich",
        "content": "",
        "upvotes": 268,
        "comments": 23,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/cwf41hukerze1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kiins2/xabi_alonso_on_his_coaching_role_model_in_terms/"
    },
    {
        "id": "1kisv4f",
        "author": "Artistic_Two_6343",
        "title": "Still heartbroken we didn't win penalty shootout in 11/12",
        "content": "",
        "upvotes": 70,
        "comments": 29,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kisv4f/still_heartbroken_we_didnt_win_penalty_shootout/"
    },
    {
        "id": "1ki52pf",
        "author": "Charybd1ss",
        "title": "OTD 1 year ago this happened.  9 minutes. 2 shots. 2 goals.",
        "content": "",
        "upvotes": 2829,
        "comments": 91,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/0qzhaolwcnze1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ki52pf/otd_1_year_ago_this_happened_9_minutes_2_shots_2/"
    },
    {
        "id": "1kiotux",
        "author": "Mammoth-Ad4929",
        "title": "Can we win the el clasico?",
        "content": "I don't know man, the sunday match bring me immense anxiety that I haven't felt since a long (very long) time. I don't want us to get humiliated again in front of insufferable barking fans!\n\n  \nWhat do you all think about the game? I'm completely blank when I think about how easily celta scored 2 against us last week",
        "upvotes": 96,
        "comments": 146,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kiotux/can_we_win_the_el_clasico/"
    },
    {
        "id": "1kid0ag",
        "author": "Miserable-Subject-87",
        "title": "Xabi Alonso, prepared to say yes to Real Madrid and then complete his move as soon as the exit process with Ancelotti will be finalised. Bayer are accelerating the process to find a new head coach with talks to progress as they’re now expecting Xabi to leave.",
        "content": "",
        "upvotes": 562,
        "comments": 51,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wpIbgb3MAiV6ZUZsNbmwzZfXEipNQiKcsi_orzoqGls.jpg?auto=webp&amp;s=cbe3864e3270280b078cb0af4e8f353b6f973ff7"
        },
        "permalink": "/r/realmadrid/comments/1kid0ag/xabi_alonso_prepared_to_say_yes_to_real_madrid/"
    },
    {
        "id": "1kiiljx",
        "author": "Nyghl",
        "title": "XABI ALONSO - The Story of a Football MASTERMIND | By Bundesliga YT Channel",
        "content": "",
        "upvotes": 181,
        "comments": 8,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/p2lp3k7gdrze1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kiiljx/xabi_alonso_the_story_of_a_football_mastermind_by/"
    },
    {
        "id": "1kibsnw",
        "author": "Total_Escape_9778",
        "title": "Sergio Ramo's 92:48 equalizer is by far the most important in our club's history...",
        "content": "After watching Barcelona’s second leg against Inter Milan, I’ve started to think that even us Real Madrid fans, don’t fully grasp just how unbelievable it is to have won 15 Champions League titles. This Barcelona team looked capable of beating anyone in the world, pulling off comebacks after comebacks. Yet, they didn’t win it. Because in the end it all comes down to mentality- something they’ve lacked for most of the past decade.\n\nWe won the Champions League in 2002 with a superb team featuring Raul, Zidane, Makelele, Figo, Hierro, and Roberto Carlos. After that, we signed even more global superstars like Ronaldo Nazario, David Beckham etc, only to face repeated humiliation in the Champions League. Were we not good enough? No, we simply lacked that X-factor.\n\nBy 2012, we had a phenomenal team under Mourinho that managed to stop one of the best Barcelona sides in history from winning La Liga. But we still bottled the semifinals against Bayern Munich, a tie we absolutely should have won. Ig it was just destiny at the end.\n\nThen came 2014. We reached the final against Atlético Madrid. They took the lead around the 30th minute and defended with everything they had for the rest of the game. We created plenty of chances, many of which should have been finished, but we failed to convert them. By the 85th minute, I had given up hope. Most of us had. After a decade of coming up short in these kinds of moments, it felt all too familiar. But then came that iconic Ramos header in stoppage time, and everything changed. For the first time in what felt like forever, we came back from behind in a Champions League knockout game. From that point on, the victory felt inevitable. Atlético were drained, and we finished the job. But it had an ever-lasting impact on this club's legacy.\n\nSince then, we’ve gone on to win five more Champions League titles. Each run has been filled with close matches and incredible comebacks. Whether you call it luck or the X-factor, there’s something unique about this club. We simply don’t give up.\n\nAnother reason for our success is our adaptability. Against Manchester City in both 2022 and 2024, we defended with everything we had. A lot of big clubs wouldn’t do that, out of pride or because they’re married to a particular style. We aren’t tied down by ideology. Look at Barcelona. After taking the lead against Inter, they kept trying to score again instead of wasting time and locking the game down because they didn’t want to go against their principles. That stupid decision cost them a place in the Champions League final.\n\nMoreover, since 2014, nearly every major club has suffered heartbreak in the Champions League. Every single one—except Real Madrid. And in the end, it all comes down to that one Ramos header.",
        "upvotes": 417,
        "comments": 37,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kibsnw/sergio_ramos_9248_equalizer_is_by_far_the_most/"
    },
    {
        "id": "1kiujbn",
        "author": "m_redditUser",
        "title": "Xabi potential tactics at Real Madrid",
        "content": "A lot of YT videos going around about how Xabi could use his Leverkusen tactics at Real Madrid. 3 at the back, one offensive wingback, one defensive wingback, 2 pivots, 2 #10 and a #9:\n\n           ST\n        LAM   RAM\n    LWB           RWB\n         LCM  RCM\n       CB  CB  CB\n\nHow would you lineup our players into this formation?\n\nMy biggest concern regarding this setup is Vini. There are really 2 options:\n\na) LAM: everyone is putting him into this role. I think Vini performs exponentially worse the further he is from the touchline. In the center of the pitch, he has bad vision, bad first touch and makes a lot of wrong passes.\n\nb) LWB: no body mentioned this option because he would need to defend. But look at Frimpong's (RWB at Leverkusen) heatmap at one match:\n\nhttps://preview.redd.it/zp79yr3cutze1.png?width=637&amp;format=png&amp;auto=webp&amp;s=104371cbdee5ccc47b17bda388a036121cac038b\n\nThat's something where i can see Vini excel! Especially if left with a lot of 1v1 situations.\n\nI can imagine something like:\n\n         Mbappe\n       Jude   Arda\n    Vini           Trent\n         Cama  Fede\n     Rudi  ???  Asencio\n\noverloading the right side with Trent, Arda, Jude, Mbappe and even Fede/Cama/Tchou, then Trent sending a diagonal to the isolated Vini on the left.",
        "upvotes": 14,
        "comments": 57,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kiujbn/xabi_potential_tactics_at_real_madrid/"
    },
    {
        "id": "1kilddl",
        "author": "Veridicus333",
        "title": "Setting up with Xabi -- What do we look like, and what do we need?",
        "content": "Xabi is here, and I am very excited. However, we still have a lot of holes, and I think it is naive that our roster as is fine. We have massive holes in the defense, and the midfield. \n\n  \nThe first issue is 3ATB, or 4 back? With Trent now too, I am more convinced we will not be playing 3ATB with Xabi. Either way has issues however. Would Flo let us play 3ATB? \n\n  \nDefense \n\n* 3ATB -- Rudiger, Militao, Asencio + Alaba off the bench, this is a pretty decent back 3, but the injury concerns are very real, as well as depth. \n* 4Back - Rudiger + Militao, with Trent at RB. What happens to Carvajal, and LB will still likely be a disaster. Which I don't think they address this off-season\n* Especially if they get Huisen. Which I think we need, and would solve A LOT of issues defensively in regards to depth + quality. Could ease Militao/Rudi back (finally), Alaba would be an emergency defender at LB and CB, Asencio would be a fantastic bench option. \n* I do think 3ATB would help the LB issues as long as we sign Huisen however. \n* Then Joan Martinez -- coming off ACL. I saw him live, he was remarkable against Milan, and was way better than Asecnio in the academy. I think he can be a real player for us when Alaba or Rudiger inevitably leave in the next 2 years. \n\nMidfield \n\n* This is one of the issues I think Xabi helps solve off his tactics. We still ideally need a circulator, but I think even in a 4Back, he greatly fixes the build up issues. \n* I also think Guler will play a massive role next year, and he likely is the player they think will play that circulator roll. And I am not surprised if Xabi is very intrigued by him.\n\n  \nAttack \n\n* I not only think he should go for squad reasons, but Rodrygo should go to raise funds imo. Especially because Xabi has not played with 3 forwards much, the third attacker if he uses one is probably Jude. \n* Which would leave us with Mbappe + Vini + Endrick + Brahim + Guler (kinda) Which I think is fine. Maybe an academy player, which we might be more prone to use under Xabi than Carlo. \n\n  \nMacro Things\n\n* Is he going to get MBappe or Vini to press?\n* Is there any chance of a LB?\n* What happens to Carvajal when he comes back? \n* I actually do think if Huisen is signed we would be well to play 3ATB, but doubt it happens. I think this 3-4-1-2 would be pretty killer.  \n   * Asencio / Huisen / Rudiger (depth is a little bit of an issue, but Joan + Alaba + MIlitao playing more reserve roles is fine probably?)\n   * Guler / Tchouameni / Fede / Trent \n   * Jude \n   * Vini/Mbappe\n\n",
        "upvotes": 34,
        "comments": 48,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kilddl/setting_up_with_xabi_what_do_we_look_like_and/"
    },
    {
        "id": "1kicd4l",
        "author": "15th_anynomous",
        "title": "You are giving the best attacking fullback to a to a coach who loves to use his fullbacks. What do we expect?",
        "content": "We know that Xabi Alonso likes to make use of his fullbacks. He has like 70 or something g/a between his fullbacks. Now he will get to manage the best attacking fullback. So what can we expect see? How will Xabi use Trent in relation to the other player? Also we know that Trent cant defend against an autistic toddler. How will he solve that?",
        "upvotes": 118,
        "comments": 63,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kicd4l/you_are_giving_the_best_attacking_fullback_to_a/"
    },
    {
        "id": "1khw5z4",
        "author": "Miserable-Subject-87",
        "title": "Huijsen, ready to pull a Bellingham. The Englishman turned down better offers to play for Real Madrid. The center-back is following in his footsteps.",
        "content": "",
        "upvotes": 613,
        "comments": 79,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ABEnGAdUNfrtmsVj5F8EZWHM0rSnGEiQVNs9D5FpG4U.jpeg?auto=webp&amp;s=f3fba4122d2a7470115d081fe32b2a2a9a8bb22c"
        },
        "permalink": "/r/realmadrid/comments/1khw5z4/huijsen_ready_to_pull_a_bellingham_the_englishman/"
    },
    {
        "id": "1khstb9",
        "author": "Bompton-G-Uno",
        "title": "Look what came in the mail today!",
        "content": "It’s such a thing of beauty 🔥🔥🔥",
        "upvotes": 383,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/uiuvzyesskze1.jpeg?auto=webp&amp;s=ff7d6e1f1e86532b9aeb4679b669b08524dd0cfa"
        },
        "permalink": "/r/realmadrid/comments/1khstb9/look_what_came_in_the_mail_today/"
    },
    {
        "id": "1khrcqo",
        "author": "123kallem",
        "title": "A Letter to the Kids of My Country | By Arda Guler",
        "content": "",
        "upvotes": 458,
        "comments": 66,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1GFh0_r8aDsRRFLQ_oVBEfgNUtzWD60tqCA8JhzKl7c.jpeg?auto=webp&amp;s=056de4413a15d07226160ed80279e178c9c22b15"
        },
        "permalink": "/r/realmadrid/comments/1khrcqo/a_letter_to_the_kids_of_my_country_by_arda_guler/"
    },
    {
        "id": "1khlhwp",
        "author": "EffectiveTie3144",
        "title": "OTD may 8-th 2024 Real Madrid beat Bayern Munich 2-1 home after the Joselu' s brace remontada and qualified in the UCL final.",
        "content": "",
        "upvotes": 753,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/e5vthwAZk_pch6jh5p-F-74X98KPh-wVEXOAwFGnFP4.jpeg?auto=webp&amp;s=8007100f2b6cb147ffe3883e519162d9cbd65e0e"
        },
        "permalink": "/r/realmadrid/comments/1khlhwp/otd_may_8th_2024_real_madrid_beat_bayern_munich/"
    },
    {
        "id": "1khqov5",
        "author": "laurifroggy",
        "title": "Camiseta rosa claro de mujer de la tienda oficial 👑 🤍",
        "content": "",
        "upvotes": 290,
        "comments": 26,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1YzAsdPCWweaYl7n9NeN6FzLwN1Uty7x0eIoxZUUuV0.jpeg?auto=webp&amp;s=d30f779cda23045c83ab32dccd5031fb6b650d9d"
        },
        "permalink": "/r/realmadrid/comments/1khqov5/camiseta_rosa_claro_de_mujer_de_la_tienda_oficial/"
    },
    {
        "id": "1khvupg",
        "author": "takeiteasymyfriend",
        "title": "RMTV strategy against Referee Organisation is damaging reputation",
        "content": "I understand Real want changes in the Referee Organisation after Negreira payments but their current strategy seems stupid and damages our reputation.\n\nWhy Real do not ask RMTV to do some real investigation journalism in order to educate fans? Why do they not prepare some serious documentaries about this case?\n\nI would love to know the actual responsibilities of Negreira and if it is true his reports were the basis for promoting and demoting referees.\n\nIf this is true, I would like to know if there are statistical correlations between referees demoted and promoted by Negreira and average points won/ lost by Barça with those referees vs averages.\n\nI would like to know if it is true that Negreira son was acting as referees personal driver in home games in Barcelona and was warning referees about avoiding mistakes that could damage Barça.\n\nWhy Referee organisation has not condenmened those payments?\n\nWhat are the appoinents by Negreira still in management positions or in active Referee?\n\nAre there any retired referees willing to talk about this? Can RMTV find any?\n\nAre two consecutive years without a penalty against Barça in La liga an statistical anomaly? What was the actual chance for that to happen? Has it ever happened before to any club in the world?",
        "upvotes": 89,
        "comments": 50,
        "media": null,
        "permalink": "/r/realmadrid/comments/1khvupg/rmtv_strategy_against_referee_organisation_is/"
    },
    {
        "id": "1khjll2",
        "author": "Miserable-Subject-87",
        "title": "Rodrygo is facing an uncertain future. Güler completes the “overtaking” over the Brazilian, taking advantage of his poor form. With Vini, Mbappé, and Bellingham, his future as a starter is in jeopardy. For the club, a sale is a realistic option.",
        "content": "",
        "upvotes": 579,
        "comments": 184,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/G67Q5Lftep8LLToe73UMNJbyd2Goio_DhdHlKAeV7f8.jpeg?auto=webp&amp;s=e2a2d9de3b723c9462ffb742305709a7f82288a2"
        },
        "permalink": "/r/realmadrid/comments/1khjll2/rodrygo_is_facing_an_uncertain_future_güler/"
    },
    {
        "id": "1kh8fe8",
        "author": "o6ohunter",
        "title": "An Inter fan showing a Vini shirt to Barcelona fans at the San Siro",
        "content": "",
        "upvotes": 3001,
        "comments": 86,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/matij5cqbfze1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kh8fe8/an_inter_fan_showing_a_vini_shirt_to_barcelona/"
    },
    {
        "id": "1khm6ph",
        "author": "dakdakdakp",
        "title": "Real Madrid to treat Militao's recovery as a new signing",
        "content": "Source: Jorge C Picon\n\nMadrid continues to fully trust a defender to reach his best form despite suffering two back to back ACLs in two years. Madrid believes it's a huge boost to the team and will not rule out the CWC for Militao.",
        "upvotes": 251,
        "comments": 116,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EvTzsadd91KvSy96OCDnqE4BS1bFf8DO_yF-QMJ9B88.jpeg?auto=webp&amp;s=ad8564e1bcdc3ac71df15cc4ca7604142a74b39a"
        },
        "permalink": "/r/realmadrid/comments/1khm6ph/real_madrid_to_treat_militaos_recovery_as_a_new/"
    },
    {
        "id": "1khkjk9",
        "author": "Ready_Ad_1353",
        "title": "Trent Alexander-Arnold rejected the offer of a significant pay rise from Liverpool that would have made him one of the best-paid fullbacks in world football.",
        "content": "",
        "upvotes": 230,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EH9wzMD-jHtwWePU7y6vqf5tgsO__R0IZMsoq_o68As.jpeg?auto=webp&amp;s=8ca466188480a970697ea0332e9dd19ef0c1a087"
        },
        "permalink": "/r/realmadrid/comments/1khkjk9/trent_alexanderarnold_rejected_the_offer_of_a/"
    },
    {
        "id": "1khhrdr",
        "author": "Medium_Breadfruit_22",
        "title": "Not signing Dani Huijsen does not make any sense..",
        "content": "He fits the club’s policy to sign young and up and coming players. He’s already a big big player in the premier league which is one of the most difficult/physical in the world, especially as a CB. As expected a host of big clubs have already courted him. Also, dont get why people say “hes unproven”. When you play week in week out for such a good side and get called up for spain and is the starting cb, idk how much more proven you can find at his age. Secondly, the boy is a Madrid fan. He seemingly loves madrid and his fav is our very own Ramos. Finally, his price. I know his release clause of 50m is a bit steep and madrid has refrained for going for high cost players lately but the fact that they dont have to outbid any clubs and the player himself is willing to join makes everything so much more straightforward. I say get the guy in",
        "upvotes": 288,
        "comments": 98,
        "media": null,
        "permalink": "/r/realmadrid/comments/1khhrdr/not_signing_dani_huijsen_does_not_make_any_sense/"
    }
]