[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1m9a67t",
        "author": "IntelligentYinzer",
        "title": "Sex Trafficking Warrant Served at House Connected to Alleged 'TikTok Dance Cult'",
        "content": "",
        "upvotes": 216,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m9a67t/sex_trafficking_warrant_served_at_house_connected/"
    },
    {
        "id": "1m9kfgo",
        "author": "S-T-R-I-D-E-R",
        "title": "\"Sandman\" was beautiful",
        "content": "Sandman series was really very appealing  and what a wonderful world building it had... So great use of vfx and amazing acting by the actors... Morpheus was goated and so was Death and all of the siblings and the lore was damn fascinating... I really don't know what went wrong with the series cause it's been cancelled by the Netflix but I really loved the series a lot and it's intricate world building and i really believe it should have gotten more seasons out of it.\nEdit: *appealing ",
        "upvotes": 25,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1m9kfgo/sandman_was_beautiful/"
    },
    {
        "id": "1m9ra5j",
        "author": "LastOnesLeft92",
        "title": "Remove already seen things from your page?",
        "content": "Anyone else that things its crazy Netflix keeps showing already seen things on your page. It feels impossible to find new shows, when it is constantly suggesting things you already saw.",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m9ra5j/remove_already_seen_things_from_your_page/"
    },
    {
        "id": "1m99sv5",
        "author": "cerealmilkanddarkrum",
        "title": "Happy Gilmore 2",
        "content": "What was everyone’s thoughts ? I was actually really pleasantly surprised. Lots of good surprises in it. I think it’s the best thing Adam\nSandar has done in awhile. ",
        "upvotes": 78,
        "comments": 97,
        "media": null,
        "permalink": "/r/netflix/comments/1m99sv5/happy_gilmore_2/"
    },
    {
        "id": "1m9f2j3",
        "author": "Burgundy-Bag",
        "title": "I just watched One Day...",
        "content": "... and fuck me. I was not ready for it. I thought I was treating myself to a cosy Friday night in with a romcom. They should have put trigger warning for emotional devastation. \n\nIt was so beautiful. These two actors had  mad chemistry. I feel devastated both by the story, and by the fact that I won't have more episodes to watch. It's among the top TV shows I've ever watched.",
        "upvotes": 31,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1m9f2j3/i_just_watched_one_day/"
    },
    {
        "id": "1m9ilcv",
        "author": "VanillaBoth5026",
        "title": "Give me some shows to watch!",
        "content": "Give me some good shows to watch on Netflix I’m down for any genre it doesn’t matter just give me some of your favorites bc I’m bored af rn. It can also be a movie but I wanna find a show that I can binge watch on Netflix to start off my weekend. So what should I watch that is good??",
        "upvotes": 18,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1m9ilcv/give_me_some_shows_to_watch/"
    },
    {
        "id": "1m91odt",
        "author": "IceMustFlow",
        "title": "Sneaky Resubscribe",
        "content": "We cancelled Netflix, as we tend to rotate streaming services every few months. This morning, when we were supposed to be finished, my young daughter tried bringing it up and was prompted if she wanted to re-subscribe. She clicked yes, not even understanding what that meant and boom, resubscribed and charged for an extra month, no sign-in required. WHAT? Absolutely not OK that this is even possible. She was signed into the Kids profile only, we just checked. Has this happened to anyone else?\n\nEdit: confirmed with Netflix support. TBF, they were helpful and have refunded the month and signed us out of all devices. However, they confirmed that the resubscription came from the TV and admitted that it is possible to do this without a password or PIN if the device is still signed in after you unsubscribe. Hmmm...",
        "upvotes": 142,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1m91odt/sneaky_resubscribe/"
    },
    {
        "id": "1m9p8ph",
        "author": "notafanofdcs",
        "title": "K-pop Demon Hunters - a breakdown of cultural bit from Korean teacher",
        "content": "If you do enjoy the show, you might want to check out this video clip from one of the most prominent Korean teachers out there who explains the Korean cultural bits from the movie. Since his Youtube channels is primarily for Korean learners and as he also breaks down the meaning of Korean's words and lyric meaning, but if you don't study Korean then you can skip those parts. ",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m9p8ph/kpop_demon_hunters_a_breakdown_of_cultural_bit/"
    },
    {
        "id": "1m9nshd",
        "author": "Historical-Bee710",
        "title": "Train Dreams | Official Teaser | Netflix",
        "content": "From the creators of Sing Sing, starring Joel Edgerton and Felicity Jones, written and directed by Clint Bentley. \n\nOfficial synopsis:\n\nBased on Denis Johnson's beloved novella, Train Dreams is the moving portrait of Robert Grainier, a logger and railroad worker who leads a life of unexpected depth and beauty in the rapidly-changing America of the early 20th Century.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m9nshd/train_dreams_official_teaser_netflix/"
    },
    {
        "id": "1m9ntz6",
        "author": "Glittering-Bison-547",
        "title": "the flash left Netflix without a warning?(Netherlands)",
        "content": "i don't see it on the official page for what leaves Netflix every month so i am curious. will it come back? i was just in the process of rewatching the show and i paused for like an hour to game with friends and when i came back it was just gone. i can find the page by googling 'the flash Netflix' but then it just says 'remind me' and i cant watch it. do we know if its coming back? pretty sure i haven't seen the latest episodes and i really would like to continue watching. ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m9ntz6/the_flash_left_netflix_without_a/"
    },
    {
        "id": "1m9olff",
        "author": "FoodNapTV",
        "title": "Hit Play on Hightown !!!",
        "content": "Hightown is finally on Netflix!!!! \n\nThis show is criminally underrated. \n\nI’m begging you, try it. You won’t be disappointed. \n\nMaybeeeee Netflix will pick it up for a 4th season ??? 😍",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m9olff/hit_play_on_hightown/"
    },
    {
        "id": "1m9jkmg",
        "author": "refdeser",
        "title": "Angi : Fake life, True crime",
        "content": "Just finished watching the series, but I’m left with so many unanswered questions.\nAt the end of the second episode, one of Juan’s friends (the woman in the pink vest) asked the interviewer if they could share their theories on why the police closed Juan’s case so quickly, even though so many things didn’t add up during the investigation.\nThat scene was just left hanging, and it really made me wonder, was there more to the story that couldn’t be revealed because it involved higher authorities?\nDefinitely something that leaves you pondering.",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m9jkmg/angi_fake_life_true_crime/"
    },
    {
        "id": "1m8wbo6",
        "author": "PiscesInChaos",
        "title": "I hate the new redesigned layout",
        "content": "The recent redesign of the app/interface is a major step backwards in usability, clarity, and overall user experience.\n\nThe layout is now cluttered and confusing, with good features buried under unnecessary animations and tabs. The new “My Netflix” section feels like an unhelpful dumping ground with zero intuitive structure. Browsing has become frustrating—everything is larger, slower, and less responsive. It now takes twice as many clicks to get to the content I actually want to watch.\n\nWorse, the previews autoplay more aggressively, recommendations feel even more random, and the horizontal scrolling is exhausting and inconsistent across devices. The redesign feels like it was built to impress a demo room, not serve actual users who just want quick, functional access to their content.\n\nNetflix used to be seamless. Now it feels bloated, distracting, and deeply out of touch with what made the platform great in the first place. At least should have give users an option to revert to the classic layout.",
        "upvotes": 95,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1m8wbo6/i_hate_the_new_redesigned_layout/"
    },
    {
        "id": "1m9p1t0",
        "author": "wtfimbird",
        "title": "Service that turns streaming into a \"tv experience\"",
        "content": "I don't know how to put it. But do you remember the good old days when you didn't need to overthink about what you watch. You open your tv and watch an episode of \\*insert a sitcom here\\*. No binging, no decision fatigue.\n\nIs there anything where I can use my streaming services, maybe choose the shows that I like and it will show me an episode randomly? After said episode it can go to the next show, just like with prime time TV.   \nImagine this but with nostalgic kids shows. Saturday morning you open Netflix and it will show a mix of everything. I know I can do it manually, but I want the decision out of my hand and just relax like in the golden days of morning cartoons. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m9p1t0/service_that_turns_streaming_into_a_tv_experience/"
    },
    {
        "id": "1m9hcxn",
        "author": "Fragrant_Peanut_9661",
        "title": "Until Dawn",
        "content": "Ok now this was a good one. What a refreshing new twist! Hooked me right in from the start. Pretty gory, but a seriously good storyline. I really really enjoyed it. ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m9hcxn/until_dawn/"
    },
    {
        "id": "1m9no5k",
        "author": "Historical-Bee710",
        "title": "Jun-hee Appreciation Rant Once And For All (because r/squidgame won't let me post)",
        "content": "You guys keep saying she should've hopped across the bridge or hung into the sides or something, but fr SHE JUST GAVE BIRTH YESTERDAY! You do not wanna imagine -the fact she was able to walk at all in the last minutes of the maze game was amazing, and it took a huge toll on her strength even without her fractured ankle. She was already fading fast by the time Jump Rope began, and if she could've done it, don't you think she'd have started trying to join the others on the bridge instead of dropping herself off? She knew her limits -she already tried practicing tiny hops on the starting platform before Myung-gi approached her, and her ankle gave out on the second shuffle. (Also, if you think it's that easy, y'all try holding onto the side of that bridge when you're already weak as hell from labour just twenty-four hours ago and a drop over 300 feet below you. Trust me: it isn't. Duh.)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m9no5k/junhee_appreciation_rant_once_and_for_all_because/"
    },
    {
        "id": "1m9nmnf",
        "author": "Historical-Bee710",
        "title": "Hey guys",
        "content": "Any other dystopian survival shows like Squid Game on Netflix? I've heard people talk about how AIB characterisation isn't quite up to SG's level, and Mom tells me stuff like Money Heist is too complicated. Help! ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m9nmnf/hey_guys/"
    },
    {
        "id": "1m9ni0f",
        "author": "Lordburke81",
        "title": "Happy Gilmore 2 - are the cuts/transitions supposed to be this jarring?",
        "content": "",
        "upvotes": 0,
        "comments": 20,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/qgbzxvmfa6ff1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1m9ni0f/happy_gilmore_2_are_the_cutstransitions_supposed/"
    },
    {
        "id": "1m9jkdn",
        "author": "swimmyman19",
        "title": "Issues with netflix household",
        "content": "recently i've ran into the issue yesterday where my device is \"not included as part of the Netflix household\" even though we're on the premium plan and i'm on the home wifi network. Have tried signing out on all devices, setting the network on the TV we use and nothing seems to work. I have opened netflix and signed in on a private tab and did not get the issue. have they changed something recently? was working fine for me just a few days ago and now doesn't let me watch on my laptop. any suggestions on a fix/what I can do to solve this? thanks",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m9jkdn/issues_with_netflix_household/"
    },
    {
        "id": "1m9imf4",
        "author": "ThickAdeptness5923",
        "title": "How do we share screenshot from moments feature",
        "content": "I'm using android and I wanna share some screenshots from House. However, in moments feature, there is only an option to share link to social media, which in turn lead to clips playable in Netflix app instead of screenshot. My question, is there any possible way to make it into screenshot? Since I read the news when moments feature first came out, they said we can share screenshot. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m9imf4/how_do_we_share_screenshot_from_moments_feature/"
    },
    {
        "id": "1m9ik80",
        "author": "SwitchKind4371",
        "title": "Location problems",
        "content": "I was watching mr robot and midway through I get sent to a different screen saying that this is not available in your region, but I am in the us. Can anyone help as this happened with hulu also and its really annoying. Thanks",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m9ik80/location_problems/"
    },
    {
        "id": "1m9hm1f",
        "author": "DookapotamusRex",
        "title": "Bad fact checking in Untamed",
        "content": "Just starting the second episode and already they have used “gauge” instead of caliber for a bullet and the fishing store just told a customer what he was holding was a 9ft 5weight (fly fishing rod terms) while he was holding a massive spinning reel rod. It seems like it would be so easy for someone to catch this at some point in the process from writing room to readings to performing on set. Just sloppy.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m9hm1f/bad_fact_checking_in_untamed/"
    },
    {
        "id": "1m9fix9",
        "author": "Big-Television5585",
        "title": "Profile problem",
        "content": "Is anyone else having the problem where you watch something on your profile but the show you are watching ends up on another profile?\n\nI had started watching several shows and movies and could never find where I left off. I would scan my \"recent\" but it wouldn't show up. Recently I decided to check the other profile and all my recent shows and movies are on theirs!!!! What the heck?\n\nAnd if anyone has... how can I fix it? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m9fix9/profile_problem/"
    },
    {
        "id": "1m7yfl2",
        "author": "manzworld",
        "title": "Netflix urged to prepare for 'long and messy' Baby Reindeer legal battle\nThe woman who claims to be the real life Martha from the hit Netflix show Baby Reindeer is suing the streaming giant for $170 million, with a pretrial conference taking place",
        "content": "Article - A woman claiming to be the real life Martha from Baby Reindeer [is suing Netflix for $170 million](https://www.themirror.com/entertainment/celebrity-news/baby-reindeers-real-life-martha-524997) and one legal advisor has warned [the streaming giant](https://www.themirror.com/all-about/netflix) to expect a \"long\" court battle.\n\nFiona Harvey [filed a lawsuit against Netflix last year for defamation](https://www.themirror.com/entertainment/golden-globes-netflix-baby-reindeer-882144), intentional infliction of emotional distress, negligence and violation of her right of publicity, according to court documents obtained by The Mirror US. She alleged Netflix \"created an easily accessible road map to allow viewers to track her down in real life and connect the dots to her identity.\" In the show, the character Martha is played by Jessica Gunning.\n\nHarvey claimed she was \"tormented\" after [the show, in which she isn't named](https://www.themirror.com/entertainment/celebrity-news/baby-reindeers-richard-gadd-issues-462748), was released. She said she suffers from \"anxiety, nightmares, panic attacks, shame, depression, nervousness, stomach pains, loss of appetite and fear, extreme stress and sickness,\" according to the court documents. She's seeking $170 million in damages.\n\nA pretrial conference will be taking place in regards to the case today. Legal advisor James Pipe has spoken to The Mirror US and shared what he thinks Netflix could expect as the case begins.\n\nPipe told us, \"This lawsuit between Fiona Harvey and Netflix is already making headlines, and honestly, it's got all the ingredients of a long, messy legal battle. Harvey is suing for $170 million, claiming Baby Reindeer is basically a version of her life, and that Netflix defamed her, violated her privacy, and acted negligently by letting it air. But is she likely to win? That's not so easy to say.\"\n\nHe continued, \"First, she’ll need to prove that viewers could clearly tell she was the inspiration behind the character, and that what was shown was both false and harmful to her reputation. That's a tall order.\"\n\nThe expert explained, \"Netflix hasn't named her, and the show is billed as a dramatized 'true story', meaning some parts are based on real life, but others are fictionalized.\" When suggesting how Netflix will respond, Pipe said they will \"likely lean hard on freedom of speech.\"\n\nHe added, \"They'll argue that the show is protected artistic expression, that names and details were changed, and that no reasonable viewer would assume the character was a 100% accurate portrayal of a real person, especially someone never named.\"\n\nPipe also suggested Harvey might find it difficult to win the negligence parts of her case. \"They'll argue they didn’t act recklessly and took steps to fictionalize the story,\" he said.\n\nThe trial could be a long one, according to Pipe. \"With a claim this size and the level of media attention, we're probably looking at least a year or two before there's any final decision, unless they settle early, which can happen if both sides want to avoid a drawn-out court fight,\" he suggested.\n\nThe expert concluded, \"Bottom line: Harvey has a shot, but Netflix has deep pockets and strong legal arguments. It’s going to come down to whether the court sees this show as storytelling, or something more damaging.\"\n\nBaby Reindeer tells the dramatized story of comedian Richard Gadd's experience of being stalked, with the character Martha ending up with a nine-month jail sentence for her harassment against him. In a statement shared with The Mirror US, Harvey previously said, \"Earlier in 2024, Netflix released a program called 'Baby Reindeer', which they billed and marketed as a 'true story'. One of the two main characters, 'Martha', was clearly intended to be based on me.\"\n\nJames Pipe is a legal advisor who spoke with The Mirror US on behalf of [Free Grants For Felons](https://www.freegrantsforfelons.org).",
        "upvotes": 1579,
        "comments": 205,
        "media": null,
        "permalink": "/r/netflix/comments/1m7yfl2/netflix_urged_to_prepare_for_long_and_messy_baby/"
    },
    {
        "id": "1m97p46",
        "author": "basil_1234",
        "title": "Jumbotron",
        "content": "Did anyone else catch the category “might not show on the Jumbotron” \nReferring to the viral CEO meme\nOr was it just me ???\nI’m trying to show my husband and it’s gone and now he thinks I was dreaming 🤣",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m97p46/jumbotron/"
    },
    {
        "id": "1m8kgjz",
        "author": "Arr0zBlanco",
        "title": "SANDMAN and DEPT Q are must watch shows",
        "content": "Pretty much what the headline reads. Sandman is truly a marvelous production. Tom Sturridge IS Morpheus. Voice, demeanor, everything. The cinematography is gorgeous. \n\nAnd Dept Q—my gosh, I could watch it for just Karl and Akram’s bickering alone🤣🤣 ",
        "upvotes": 65,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1m8kgjz/sandman_and_dept_q_are_must_watch_shows/"
    },
    {
        "id": "1m8qnrt",
        "author": "WPJHtx",
        "title": "Help me find a new show to watch",
        "content": "Hey I’m looking for a new show to watch. I really like all American, one tree hill, on my block, never have I ever So teen dramas are kinda what I’m into. Any recommendations will be appreciated \n\nEdit: I really want something with that summer vibe ",
        "upvotes": 24,
        "comments": 57,
        "media": null,
        "permalink": "/r/netflix/comments/1m8qnrt/help_me_find_a_new_show_to_watch/"
    },
    {
        "id": "1m966a7",
        "author": "JeRicHoOL",
        "title": "List of 4K Movie/Series?",
        "content": "1. Is there an official list by Netflix of the current 4K/UHD content on it?\n\n2. I‘ve read that if something is available in 4K, it will have a logo next to its title. Is that logo only displayed for premium users?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m966a7/list_of_4k_movieseries/"
    },
    {
        "id": "1m9bazy",
        "author": "la_mano_poderosa",
        "title": "Movies for oremium plan only???",
        "content": "Just saw Until Dawn is on Netflix, but not for ad-supported poors like me.\nI guess my monthly fee just isn't enough for them to show me new movies.\nI used to think cutting the cord and streaming would be a good workaround to the outlandish fees of cable.  Meet the new boss, same as the old boss.\nWell, I know one way I can fix that, greedy muthas...",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1m9bazy/movies_for_oremium_plan_only/"
    },
    {
        "id": "1m8oj38",
        "author": "Fatalisticfortuneguy",
        "title": "New Netflix Home Screen",
        "content": "Ewwww wtf did they do to the Home Screen setup. It was just fine as it was why’d they have to go and change it. Hate when companies to changes to layouts like we asked for it. ",
        "upvotes": 16,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1m8oj38/new_netflix_home_screen/"
    }
]