[
    {
        "id": "1m5mz0x",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Ari Aster - Tuesday 7/22 at 8:00 PM ET - Director of 'Midsommar', 'Hereditary', 'Beau Is Afraid', and 'Eddington'",
        "content": "",
        "upvotes": 49,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/72x90p1t39ef1.png?auto=webp&amp;s=8c888d22734879ddd10b555282ed3da68da67b78"
        },
        "permalink": "/r/movies/comments/1m5mz0x/amaqa_announcement_ari_aster_tuesday_722_at_800/"
    },
    {
        "id": "1m2q9jw",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Eddington / I Know What You Did Last Sumer (2025)) Plus a very special throwback discussion!",
        "content": "**New In Theaters**:\n\n* [Eddington](https://old.reddit.com/r/movies/comments/1m2q3dy/official_discussion_eddington_spoilers/?)\n* [I Know What You Did Last Summer (2025)](https://old.reddit.com/r/movies/comments/1m2q3hj/official_discussion_i_know_what_you_did_last/?)\n* [Smurfs](https://old.reddit.com/r/movies/comments/1m459z3/official_discussion_smurfs_spoilers/?)\n\n**25th Anniversary Throwback Discussion Threads**:\n\n* [X-Men](https://old.reddit.com/r/movies/comments/1m2q3kr/official_throwback_discussion_xmen_spoilers/)\n\n**Still In Theaters**:\n\n* [Superman (2025)](https://old.reddit.com/r/movies/comments/1lwutny/official_discussion_superman_2025_spoilers/?)\n* [Jurassic World Rebirth](https://old.reddit.com/r/movies/comments/1lqdtaw/official_discussion_jurassic_world_rebirth/)\n* [F1: The Movie](https://old.reddit.com/r/movies/comments/1lli8lz/official_discussion_f1_the_movie_spoilers/?)\n* [M3GAN 2.0](https://old.reddit.com/r/movies/comments/1lli8nm/official_discussion_m3gan_20_spoilers/?)\n* [28 Years Later](https://www.reddit.com/r/movies/comments/1lfsc91/official_discussion_28_years_later_spoilers/)\n* [Elio](https://www.reddit.com/r/movies/comments/1lfscb2/official_discussion_elio_spoilers/)\n* [How to Train Your Dragon](https://www.reddit.com/r/movies/comments/1la4c8v/official_discussion_how_to_train_your_dragon/)\n\n\n**New On Streaming:**\n\n* [Heads of State](https://old.reddit.com/r/movies/comments/1lr5yb4/official_discussion_heads_of_state_spoilers/?)\n* [The Old Guard 2](https://old.reddit.com/r/movies/comments/1lr5ycn/official_discussion_the_old_guard_2_spoilers/?)\n* [Ice Road: Vengeance](https://old.reddit.com/r/movies/comments/1lr5ye1/official_discussion_ice_road_vengeance_spoilers/?)\n* [KPop Demon Hunters](https://www.reddit.com/r/movies/comments/1lghony/official_discussion_kpop_demon_hunters_spoilers/)\n* [Echo Valley](https://www.reddit.com/r/movies/comments/1lar0eb/official_discussion_echo_valley/) \n* [Deep Cover](https://www.reddit.com/r/movies/comments/1lar0ej/official_discussion_deep_cover/)",
        "upvotes": 34,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1m2q9jw/official_discussion_megathread_eddington_i_know/"
    },
    {
        "id": "1m6dyzx",
        "author": "AriAsterAMA",
        "title": "Hi, I'm Ari Aster. Writer/director of Hereditary, Midsommar, Beau Is Afraid, and Eddington. AMA!",
        "content": "Hi reddit, I'm Ari Aster. Back for another AMA. I've written/directed Eddington, Hereditary, Midsommar, and Beau Is Afraid.\n\nEddington stars Joaquin Phoenix, Pedro Pascal, Emma Stone, Micheal Ward, Luke Grimes, Deirdre O'Connell, Austin Butler and is out in theaters nationwide now via A24.\n\n**Trailer:**\n\n[https://www.youtube.com/watch?v=oL6jZqExlIk](https://www.youtube.com/watch?v=oL6jZqExlIk)\n\n**Synopsis:**\n\nDuring the COVID-19 pandemic, a standoff between a small-town sheriff and mayor sparks a powder keg as neighbor is pitted against neighbor in Eddington, N.M.\n\nAMA! Back at 8 PM ET to answer your questions.\n\n",
        "upvotes": 2739,
        "comments": 1451,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/nolqu3mjffef1.jpeg?auto=webp&amp;s=78c859d2453f2b356d2444b4e49045c9d6b0416f"
        },
        "permalink": "/r/movies/comments/1m6dyzx/hi_im_ari_aster_writerdirector_of_hereditary/"
    },
    {
        "id": "1m6akss",
        "author": "mayukhdas1999",
        "title": "First Image of Oscar Issac in Julian Schnabel's 'IN THE HAND OF DANTE'",
        "content": "",
        "upvotes": 2199,
        "comments": 128,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1cdwahjjleef1.png?auto=webp&amp;s=d80a356fb457386319aad462a30cddec6e0ed431"
        },
        "permalink": "/r/movies/comments/1m6akss/first_image_of_oscar_issac_in_julian_schnabels_in/"
    },
    {
        "id": "1m6af96",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Paul Dano in ‘The Wizard of the Kremlin’ - A young Russian filmmaker (Dano) becomes an unlikely advisor to Vladimir Putin (Jude Law) as he rises to power in post-Soviet Russia, navigating the new era's complexities and chaos.",
        "content": "",
        "upvotes": 1322,
        "comments": 116,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zvzf3nvwjeef1.jpeg?auto=webp&amp;s=374817824dab6443304527326eafddd7b7adafa8"
        },
        "permalink": "/r/movies/comments/1m6af96/first_image_of_paul_dano_in_the_wizard_of_the/"
    },
    {
        "id": "1m6gd97",
        "author": "MoneyLibrarian9032",
        "title": "New Image at Benny Safdie’s ‘The Smashing Machine’ starring Dwayne Johnson and Emily Blunt. It will have its world premiere at the 82nd Venice International Film Festival this Fall.",
        "content": "",
        "upvotes": 385,
        "comments": 216,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/uul1anexwfef1.jpeg?auto=webp&amp;s=93945be2aec366be173a931dbfc139de90872155"
        },
        "permalink": "/r/movies/comments/1m6gd97/new_image_at_benny_safdies_the_smashing_machine/"
    },
    {
        "id": "1m6898i",
        "author": "jaystats2",
        "title": "\"Have you ever been shocked to find out that an actor you thought was American is actually British because they nailed the accent?\"",
        "content": "I’ve rarely seen an accomplished British actor muck up an American accent. My standout favorite is Jude Law in ‘The Talented Mr. Ripley’. That guy walked, talked, and breathed a Yank as Dickie Greenleaf.\n\nFrom what I’ve observed over the years, British actors who do really successful American accents tend to come to Hollywood well-prepared and aiming at success.\n\nOne reason UK actors have a leg up on American actors is because they often have formal dialect training, which is why many outperform\ntheir American counterparts attempting British accents. I’d go out on a limb to say American actors rarely match that level of authenticity.\n\nThe one exception is Forest Whitaker in ‘The Crying Game’. His British accent was so good, I thought the guy was born in the UK( He’s actually from Longview, Texas)  Go figure.  Any other examples of uncanny dialect delivery in a role?\n\n.",
        "upvotes": 1247,
        "comments": 1374,
        "media": null,
        "permalink": "/r/movies/comments/1m6898i/have_you_ever_been_shocked_to_find_out_that_an/"
    },
    {
        "id": "1m5v438",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'Avatar: Fire and Ash'",
        "content": "",
        "upvotes": 13213,
        "comments": 1620,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mh6p8uizlaef1.jpeg?auto=webp&amp;s=40ed5b3d184efe38400613341979a62bd7d5a44c"
        },
        "permalink": "/r/movies/comments/1m5v438/official_poster_for_avatar_fire_and_ash/"
    },
    {
        "id": "1m6cwix",
        "author": "MarvelsGrantMan136",
        "title": "First Images from Rob Reiner’s ‘Spinal Tap II: The End Continues’",
        "content": "",
        "upvotes": 427,
        "comments": 66,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/y5j950j77fef1.jpeg?auto=webp&amp;s=a0ad740711b9357efdd98d82724d72a19a126103"
        },
        "permalink": "/r/movies/comments/1m6cwix/first_images_from_rob_reiners_spinal_tap_ii_the/"
    },
    {
        "id": "1m69xli",
        "author": "TruffsStuffYT",
        "title": "Despite the topic being as relevant as ever, Bowling for Columbine (2002) has aged very poorly as a Documentary",
        "content": "I remember watching this in school when it was relatively new and being blown away by it. Really shook at how it presents the state of the world. \n\nI decided to go back and watch it and.... hoo boy. It has not aged well.\n\nI guess as an aughts piece of subversive media it has entertainment value - I certainly see a lot of his techniques still used today, especially in Youtube Video Essays. But as a documentary its hard to get past how shoddily it's put together.\n\nTo start with, BfC is extremely anecdotal at points when it wants to be. For example, to disprove that violent films cause violence, he asks the same 3 Canadian teens he's been talking to the whole film if they like violent films and they say yes. When one street interviewee says they think America has higher gun crime because it has a higher Black population, Moore seriously retorts \"That's weird, cause I saw Black people when I was in Canada!\" To be clear, what's particularly annoying is that I agree with the core message, but he \"answers\" these questions is the poorest way imaginable. For horror movies, logic would say just show that they perform as well in the Canadian Box Office as America. The Black population one is trickier, as (especially at the time) they did have a significantly lower Black population per captia. But that makes it more important to disprove the link between race and violence - would even make a good segway into the real issue of poverty and violence. Ah, but he \"solves\" that issue by going to one nice looking \"\"slum\"\" and saying \"Wow, Canada's slums are super nice, no poverty in Canada!\" I don't know what's more insulting, that he thinks we're that easily tricked, or that people seemingly were by this at the time.\n\nIt is aggravating the number of times Moore makes an argument, and then gives evidence in the form of asking some stranger on the street a question. \"Are there violent crimes in Canada? Let's ask this random halfcut woman I found at a bar.\" In 2025, voxpops have largely gone out of style. Rightfully criticised for being low quality, cherrypicked and anecdotal. They were more popular back when BfC was thrown together, but that doesn't make their heavy use any more forgivable.  \n\nSpeaking of segways, that brings me to the next, bigger problem. For as bad as it is when Moore phones in his evidence, it's a whole lot worse when he is straight up disingenuous. There's a famous scene where Moore gets a gun from a bank to show how easy it is to attain one. The fact that he's getting a gun from a bank is such a wild thing, you'd think it stands up as it's own piece of ludicrousness. Instead, Moore chooses to really keep harping on the \"free\" part. \"I want an account with the free gun!\", \"When do I get my free gun?\", \"Well there you go, I got a free gun!\". He walks out triumphant, a testament to how easy it is to get a gun from a bank. Only, he never mentions that you only get the gun when you deposit $2000. To be clear, I agree with the core point. Guns are/were too easy to get in America, but I wouldn't say dumping 2 grand for a shitty single action hunting rifle is good evidence of this. \n\nBut given the choice between hard hitting facts and dressed up sensationalism, Moore always seems to choose the latter. The thesis of BfC is that there is no one single cause for America's gun violence (though it heavily, heavily suggests the News is the biggest culprit) - and part of that core argument is an odd section where Moore seemingly argues that ease of access ISN'T a problem. He goes to Canada and purchases a comically large number of shells from Wallmart. Wow! You can get armed so easily here, but where are the mass shootings? Well it's probably because Canada's news media is just so darn nice and polite! Everyone leaves their door unlocked here (in the middle of the day in nice neighbourhoods while their inside)! Even the Politicians are polite and calm!\n\nExcept that's obviously complete BS. He's able to buy a lot of bullets because bullets are not the issue. I'm  in the UK, where guns are largely completely banned - but I can get bullets just as easily. He very blatantly and clumsily skirts the elephant in the room - is it easy to get a GUN in Canada? I have no idea if it was at the time, because he completely neglects that pretty important question. And much has been said for him cherrypicking news segments to make the Canadian media seem \"nice\" when it could/can be just as sensationalist as it's American counterpart. This is so much worse than his \"Ummm ackstually, I saw a Black guy in Toronto\" because he's being deliberately duplicative. And AGAIN, it's frustrating because the News Cycle does have a LOT to answer for, but this is so not the way to highlight that.\n\nSpeaking of disingenuous, and honestly flat out cringe. I'd be remiss not to mention the infamous Diet South Park segment where he presents a bizarro, citationless version of history to explain why Americans have a gun culture. Wherein he states the NRA was founded by the KKK, that the colt pistol was made to stop Slaves rebelling, that slaves didn't want revenge or compensation for being slaves (complete with a drawing black man sniffing a posey, awhh), and that most gun crimes are committed by white suburbanites in gated communities. In other words, Moore tries to pin the entire gun culture on white people hating black people. I'm not one to say racism isn't an issue in America (or indeed, the world) but this is a bold ass claim to make - and not one sold in a convincing manner. I also find it bizarre that this little cartoon, and indeed the whole documentary, ignores the constitution - a pretty big elephant in the room in regards to why a gun culture exists. I have to imagine Moore either felt tackling that issue was either too complicated or controversial - either way, a poor job done exploring the topic. This segment in particular got Moore in hot water with Matt Stone, whom he interviewed. By putting it right after the interview, the implication is the South Park guys made it. Not only do you not want work you didn't make attributed to yourself, but one so strawman-y and full of errors. \n\nBut even his interview has issues, where Stone ponders that \"If only the Columbine kids realised that high school is over soon! They wouldn't be bullied anymore! Don't they know the weedy victims end up millionaires and the bullies end up working in MacDonalds!\" On its own a pretty trite concept that's only really true on TV, but whatever. The real issue is the idea that the Columbine kids were bullied into it. For all the documentaries efforts to disprove this and that as the cause, it seems happy enough to perpetuate the lie that school bullying was a major factor. It's well known now that, while people didn't like Eric and Dylan nor treat them nice, it was because they chose to be outcasts and mean to their peers. A bullied pair standing up to the jocks? Give me a break, THEY were the bullies. \n\nSpeaking of, Moore himself has also gotten criticism since the movie came out as being a bit of a distasteful figure, and there are definitely elements of that here. At times BfC seems less like a documentary and more like a diet version of Borat. There's an infuriating scene where Moore approaches an officer on duty monitoring a scene after a suspicious person with a gun was spotted. \"I want to report a crime! Look at all this pollution!\" Moore says to him, \"I can't see the Hollywood sign, who should you arrest for this?\" Obviously annoyed, the officer brushes him off and walks away. \"Wow, he's doesn't care about the real issues, what a dick right?\" BfC suggests. No, I just see Moore being a complete asshat to someone trying to do their job. \n\nEDIT: Oh, and yeah, this is part of a bizarre section where he and a lawyer argue that gun crime isn't even as big a deal as the news makes it out to be. What about pollution? What about welfare programs? They walk down an LA street to prove that things aren't as bad as its been made to seem. Of course, this is when the police turn up due to a gun report - and no, the irony of this happening on the street they were using to highlight how not-dangerous LA is is not addressed. While I think we can all agree that those are real issues too, looking back in 2025 and seeing him trying to claim \"Well shootings aren't really that bad an issue, not compared to pollution. Why isn't COPS about catching polluters or white collar criminals?\" is actually insane. \n\nIt's hard to make the Borat shtick work because you're always at danger of the audience flipping on you, of siding with the \"pranked\" civvy. Part of a way around this is comedians will either make themselves the butt of the joke and the civilians simply reacting to them (like Eric Andre), or to just let them talk and put their own foot in their mouth. Moore does neither. He is always the aggressor, and he always carefully edits to make himself seem like the epic troll who won that interaction. You can play a drinking game for whenever Moore does a little one liner to his interviewee and then hard cuts. Got em! Dunked on em! No need to see their reaction or rebuttal! I won, let's move on!\n\n And that's it in a nutshell really. **I agree with large parts of this documentary**, but that makes it all the more annoying with HOW it presents and tackles these issues. From poorly citated arguments, to misdirection, to straight up lying, to bad comedy - it's a mess. I wouldn't blame anyone for arguing that BfC hurts it's own stance from just how shoddily duct taped together it is. I'm sure a lot of people will argue or say \"Well for the time it was very impactful. For the time, it brought attention to this issue and got people talking about it. Things are worse now, if only people listened to him!\" My retort would probably be that Columbine itself was the impact. The tragedy itself got people talking about it. BfC rode that sensationalism in much the same way the News cycle it criticised did. It brings shockingly little to the table. If, like me, you remembered BfC this way, I would recommend rewatching it, I think, like me, you'll be shocked at how poorly its aged. ",
        "upvotes": 668,
        "comments": 307,
        "media": null,
        "permalink": "/r/movies/comments/1m69xli/despite_the_topic_being_as_relevant_as_ever/"
    },
    {
        "id": "1m6i5oq",
        "author": "MarvelsGrantMan136",
        "title": "The Fantastic Four: First Steps - Review Thread",
        "content": "**The Fantastic Four: First Steps - Review Thread**\n\n* [Rotten Tomatoes](https://www.rottentomatoes.com/m/the_fantastic_four_first_steps): 88 (67 Reviews)\n* [Metacritic](https://www.metacritic.com/movie/the-fantastic-four-first-steps/) \\- 66 (32 Reviews)\n\nReviews:\n\n[Hollywood Reporter](https://www.hollywoodreporter.com/movies/movie-reviews/the-fantastic-four-first-steps-review-marvel-pedro-pascal-1236325361/) (80):\n\n&gt;Despite its vivid and electric space sequences, the visually striking movie often feels like a throwback analog good time, which certainly worked for me.\n\n[Deadline](https://deadline.com/2025/07/the-fantastic-four-first-steps-review-pedro-pascal-marvel-1236464831/):\n\n&gt;Superheroes are a thing of the past in the latest iteration of Marvel’s *Fantastic Four*, the best by far of the company’s attempts to translate the long-running comic book’s appeal to the big screen. This it does not by trying to reinvent the wheel but, rather smartly, by addressing the elephant in the room, locating the action in a kitsch yet somehow timeless retro-future more befitting *The Jetsons* than *The Avengers*. It also benefits from a smart script and — I can’t believe I’m writing this — really quite moving performances from its four charismatic leads, being arguably the best of Pedro Pascal’s releases this year.\n\n[Variety](https://variety.com/2025/film/reviews/the-fantastic-four-first-steps-review-1236466922/) (80):\n\n&gt;True to its subtitle, the film feels like a fresh start. And like this summer’s blockbuster “Superman” reboot over at DC, that could be just what it takes to win back audiences suffering from superhero exhaustion.\n\n[Empire](https://www.empireonline.com/movies/reviews/the-fantastic-four-first-steps/) (80):\n\n&gt;With an exemplary cast and shiny new alt-universe to enjoy, this is the best Fantastic Four yet. And if that bar’s too low for you, then it’s also the best Marvel movie in years.\n\n[Slashfilm](https://www.slashfilm.com/1918790/the-fantastic-four-first-steps-review/) (90):\n\n&gt;The Fantastic Four: First Steps is set in a world that I wouldn't mind living in. Even if there are occasional, ineffable cosmic deities plotting to devour me, and terrifying silver aliens ripping my soul apart with their eyes. \"First Steps\" is a superhero movie where we're already better. And I love that.\n\n[USA Today](https://www.usatoday.com/story/entertainment/movies/2025/07/22/fantastic-four-first-steps-marvel-movie-review/85302239007/) (75):\n\n&gt;After two mediocre 2000s film featuring Marvel’s legendary superhero family, and an atrocious third outing in 2015, the foursome makes its Marvel Cinematic Universe debut in a combo sci-fi/disaster flick full of retrofuturistic 1960s flavor.\n\n[Entertainment Weekly](https://ew.com/the-fantastic-four-first-steps-review-pedro-pascal-leads-team-back-retro-future-11776476) (75):\n\n&gt;From its Saul Bass-inspired opening credits to its callbacks to Saturday morning superhero cartoons, it practically vibrates with its sense of time and place.\n\n[IGN](https://www.ign.com/articles/the-fantastic-four-first-steps-review-pedro-pascal-vanessa-kirby-ebon-moss-bachrach-joseph-quinn) (70):\n\n&gt;These First Steps might not be the great strides I was hoping for, but they are sure footing for the Fantastic Four to officially leap into the MCU.\n\n[The Independent](https://www.the-independent.com/arts-entertainment/films/reviews/fantastic-four-first-steps-review-b2793808.html) (60):\n\n&gt;In fact, all the ingredients are perfectly lined up here, and, in the right combinations, and with the pure wonderment of Michael Giacchino’s score, The Fantastic Four: First Steps does shimmer with a kind of wide-eyed idealism. And that’s lovely.\n\nDirected by Matt Shakman:\n\n&gt;On the 1960s-inspired retro-futuristic alternate universe known as Earth-828. the Fantastic Four must protect their world from the planet-devouring cosmic being Galactus and his herald, the Silver Surfer.\n\nCast:\n\nCast:\n\n* Pedro Pascal as Reed Richards / Mister Fantastic\n\n* Vanessa Kirby as Sue Storm / Invisible Woman\n\n* Ebon Moss-Bachrach as Ben Grimm / The Thing\n\n* Joseph Quinn as Johnny Storm / Human Torch\n\n* Julia Garner as Shalla-Bal / Silver Surfer\n\n* Paul Walter Hauser as Harvey Elder / Mole Man\n\n* Ralph Ineson as Galactus",
        "upvotes": 135,
        "comments": 108,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TFqk3-5aMuIhZBO00UD18eE5zFq4060Qs78R9Srfqvo.jpeg?auto=webp&amp;s=1abc2c13a15ed1f6f82b68ed3ee29b88e76f74f3"
        },
        "permalink": "/r/movies/comments/1m6i5oq/the_fantastic_four_first_steps_review_thread/"
    },
    {
        "id": "1m6cf0w",
        "author": "MarvelsGrantMan136",
        "title": "'Evil Dead Burn' Officially Begins Filming (Releases July 24, 2026)",
        "content": "",
        "upvotes": 266,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/AuHsP9B8uldCGu0v34ysX84NmwsfxAYXM_-6i-hoHNE.jpeg?auto=webp&amp;s=33efcd5efe5730f1fec390ec2668f777ef3ff989"
        },
        "permalink": "/r/movies/comments/1m6cf0w/evil_dead_burn_officially_begins_filming_releases/"
    },
    {
        "id": "1m6dhop",
        "author": "MarvelsGrantMan136",
        "title": "New Character Posters for Darren Aronofsky's 'Caught Stealing'",
        "content": "",
        "upvotes": 203,
        "comments": 50,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/p0n9b7cwbfef1.jpeg?auto=webp&amp;s=0fddd85a8ef86cd72d1ed699a736ff667f149f89"
        },
        "permalink": "/r/movies/comments/1m6dhop/new_character_posters_for_darren_aronofskys/"
    },
    {
        "id": "1m5mt8n",
        "author": "MarvelsGrantMan136",
        "title": "Predator: Badlands | Official Trailer",
        "content": "",
        "upvotes": 9161,
        "comments": 1561,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Z-NOuu6_UITXqfhEJMyDJBQXL3OHkHHvqPNeg3o5kus.jpeg?auto=webp&amp;s=a4d1206ac5662c038cca6f18f00f61235cec5dc6"
        },
        "permalink": "/r/movies/comments/1m5mt8n/predator_badlands_official_trailer/"
    },
    {
        "id": "1m6amd4",
        "author": "NoCulture3505",
        "title": "First Image from Jim Jarmusch’s ‘FATHER MOTHER SISTER BROTHER’",
        "content": "",
        "upvotes": 229,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1cmk9xrzleef1.jpeg?auto=webp&amp;s=9e91b4d4866864ab7b7c83f77d2d89151ead81e7"
        },
        "permalink": "/r/movies/comments/1m6amd4/first_image_from_jim_jarmuschs_father_mother/"
    },
    {
        "id": "1m6gh18",
        "author": "MoneyLibrarian9032",
        "title": "Official posters for ‘GOOD FORTUNE’, starring starring Seth Rogen, Aziz Ansari, Keke Palmer, Sandra Oh and Keanu Reeves The film follows an inept angel who meddles in the lives of a gig worker and a wealthy man. In theaters on October 17.",
        "content": "",
        "upvotes": 75,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/nuxpuhqkxfef1.jpeg?auto=webp&amp;s=d3307f89717cb7c51c88d063b0e8408a9648c97c"
        },
        "permalink": "/r/movies/comments/1m6gh18/official_posters_for_good_fortune_starring/"
    },
    {
        "id": "1m6atxc",
        "author": "MoneyLibrarian9032",
        "title": "First Image of Kathryn Bigelow’s ‘A HOUSE OF DYNAMITE’ • Starring Idris Elba, Greta Lee, Gabriel Basso, Moses Ingram, Anthony Ramos &amp; Rebecca Ferguson • Follows how the White House reacts in real time to missiles headed for America • Releasing October 24 on Netflix",
        "content": "",
        "upvotes": 201,
        "comments": 92,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5vy7nyv5oeef1.jpeg?auto=webp&amp;s=a53e408df38648f723d77a2e8de3b186b5a8d295"
        },
        "permalink": "/r/movies/comments/1m6atxc/first_image_of_kathryn_bigelows_a_house_of/"
    },
    {
        "id": "1m5k1ad",
        "author": "ungaayya",
        "title": "First image of Anna Hathaway as Andy Sachs in 'The Devil Wears Prada 2'",
        "content": "",
        "upvotes": 8268,
        "comments": 554,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xoh2bpgyj8ef1.jpeg?auto=webp&amp;s=8b4fdb35fe581c4272ed09b26e2784cb09c5f1f8"
        },
        "permalink": "/r/movies/comments/1m5k1ad/first_image_of_anna_hathaway_as_andy_sachs_in_the/"
    },
    {
        "id": "1m6cbip",
        "author": "Task_Force-191",
        "title": "Official Poster for Hayao Miyazaki's \"Sherlock Hound: The Movie\" Re-Release",
        "content": "",
        "upvotes": 116,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/72bncju82fef1.jpeg?auto=webp&amp;s=8dc70c697adbe3ad25361c79b9c22d74ba55570a"
        },
        "permalink": "/r/movies/comments/1m6cbip/official_poster_for_hayao_miyazakis_sherlock/"
    },
    {
        "id": "1m5pe1h",
        "author": "MarvelsGrantMan136",
        "title": "Malcolm-Jamal Warner, ‘Cosby Show’ Star, Dies at 54",
        "content": "",
        "upvotes": 3122,
        "comments": 173,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kirFy4D0L1q3WVPg6-U3q-gznz_KfQK-Ts2UtIx1qrI.png?auto=webp&amp;s=037e40c462d75ea94d9a558e25947f2fd4c6c5b7"
        },
        "permalink": "/r/movies/comments/1m5pe1h/malcolmjamal_warner_cosby_show_star_dies_at_54/"
    },
    {
        "id": "1m5x5mu",
        "author": "AngryGardenGnomes",
        "title": "Friendship is simply Tim Robinson being dropped into a tense A24 family drama movie and reacting to it",
        "content": "It was dark and impactful, while remaining ridiculously funny throughout. Tim Robinson's casting was inspired. \n\nIt was not the type of movie I was expecting, to say the least. So surreal and unpredictable. A really cool modern fresh tone, as well. It didn't feel like some Apatow rip off, for example. I mean, I was expecting it to be flipping weird, because it's Robinson, but boy did he still surprise me. \n\nAndrew DeYoung, genius! A writer director we should all be keeping an eye on. I'm thinking the next James Gunn. I'm unfamiliar with his prior work - but this looks like his first high profile feature, at least. I see he worked on Lil Dicky TV show Dave - which was also dope.\n\nThis movie Friendship was so freakin good and felt so much like a feature length sketch in I Think You Should Leave, I was under the impression the whole time that it was written by Robinson. There were frequent moments that felt like a series of mini sketches interlaced into the plot, like the part with the toad and the subway. Just genius.\n\nIt was all so wildly unpredictable, at any given moment. Like when Robinson's character Craig is getting berated by some random stranger who then goes on some mad Afghanistan rant, absolutely loved it. DeYoung, if you ever read this, you are a legend. Hats off too, ya! Keep'em coming. \n\nAnd what a performance! Good grief, it was like the ultimate Tim Robinson role. I honestly hope we see more movies where he's just playing this weird angry version of himself, that we all know and love from his show, sort of like what Chaplin did with the Tramp.\n\nThere were quite a few moments that felt Chaplin-esqe. Especially the moment where he &gt;!flopped through the glass door!&lt;. That was so perfectly executed, sort of like a Checkhov's gun pay off moment. As soon as he enters the room, that &gt;!sliding glass door is in the back of your mind!&lt;. Plus, it's so perfectly set up right at the beginning of the movie.\n\nThen, there were the final close up shots that kind of reminded of the ending of Chaplin's City Lights (1931). Where Craig and Austin (Rudd) &gt;!are just staring at each other. Austin gives him a wink and the mad Craig gleefully leers back at him from the back of the police car. He's in pure bliss. The friendship in some weird form is intact again. Craig got what he wanted.!&lt; Credits roll. Glorious.\n\nAnd the soundtrack, I have to mentiom the soundtrack before even the cast. Wow. Such amazing music and really enhanced the mood. It was such a bizarre psychedelic experience, and dark, just so dark to see this relatable dude completely unravel and become more and more insane as the movie progressed to that explosive conclusion. \n\nThe cinematography was great too. It didn't 'look like a comedy' movie, it seemed like it was almost shot like a thriller. It looked fantastic. Dark and bleak, sort of like a British movie. Reminded me of Black Bag (2025), same sort of colour palette and cold desensitised corporate look in places. \n\nKate Mara put in a wonderful subtle performance as the wife. You could see the exact moment she realised she was done with this guy, before she slips away from him in the sewer. \n\nPaul Rudd was just marvellous, like Robinson, perfectly cast. It was cool to see he was one of the producers. (Hah, love this detail I just saw on Wiki: 'Rudd's character was originally named Brian in the script. When Rudd was cast, he requested that this be changed to avoid confusion with his Anchorman character and personally suggested the name Austin.'\n\n(I wish they had stuck with the Anchorman name. I think would have added to the surrealism.)\n\nAnother great cast member was the young Billy Bryk as' T-Dog'. I can see him going places.",
        "upvotes": 1225,
        "comments": 189,
        "media": null,
        "permalink": "/r/movies/comments/1m5x5mu/friendship_is_simply_tim_robinson_being_dropped/"
    },
    {
        "id": "1m5x72o",
        "author": "KillerCroc1234567",
        "title": "'Avatar: Fire and Ash' Trailer to Play in Theaters Before 'The Fantastic Four: First Steps'",
        "content": "",
        "upvotes": 1173,
        "comments": 210,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FlmOjqrmMSpB0NTnYnI2bfpTT4N2v-M040U6oAEpuMk.jpeg?auto=webp&amp;s=7f17e973894a559fd1fe7f7b43af19c2c6a804da"
        },
        "permalink": "/r/movies/comments/1m5x72o/avatar_fire_and_ash_trailer_to_play_in_theaters/"
    },
    {
        "id": "1m5js8o",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Sydney Sweeney as Christy Martin in 'Christy'",
        "content": "",
        "upvotes": 4554,
        "comments": 619,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1vyr8ka5i8ef1.jpeg?auto=webp&amp;s=7c3256ba9d9905c6ab0677d62cd9863a26f5f12b"
        },
        "permalink": "/r/movies/comments/1m5js8o/first_image_of_sydney_sweeney_as_christy_martin/"
    },
    {
        "id": "1m5l74e",
        "author": "ChiefLeef22",
        "title": "Guillermo Del Toro's 'Frankenstein' has a runtime of 2 hours and 29 minutes.",
        "content": "",
        "upvotes": 3562,
        "comments": 181,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Lgk1AE15QljUelhhrWwkRgWe7jUwbAD_YvB6U7C6254.jpeg?auto=webp&amp;s=0c5ebe1122defe6e54f94eb2a02ec29dd83e6983"
        },
        "permalink": "/r/movies/comments/1m5l74e/guillermo_del_toros_frankenstein_has_a_runtime_of/"
    },
    {
        "id": "1m5y6gx",
        "author": "Task_Force-191",
        "title": "Official Poster for 'No Other Choice' - Directed by Park Chan-wook ('Oldboy', 'The Handmaiden', 'Decision to Leave') starring Lee Byung-Hun, Son Ye-jin - After being unemployed for several years, a man devises a unique plan to secure a new job: eliminate his competition.",
        "content": "",
        "upvotes": 605,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/dngey9z88bef1.jpeg?auto=webp&amp;s=6a695a20bf2941b63d374ee4926510ff4e16133b"
        },
        "permalink": "/r/movies/comments/1m5y6gx/official_poster_for_no_other_choice_directed_by/"
    },
    {
        "id": "1m614r3",
        "author": "Dragava",
        "title": "Teaser trailer for Park Chan-wook’s “No Other Choice”",
        "content": "",
        "upvotes": 378,
        "comments": 31,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qM-G8_OdaxHXi3_s22z5WbXGeEwyVFrpmvuvYc9qp6M.jpeg?auto=webp&amp;s=66f3d0300e77e2db333eecf6d29fd317fbcc2168"
        },
        "permalink": "/r/movies/comments/1m614r3/teaser_trailer_for_park_chanwooks_no_other_choice/"
    },
    {
        "id": "1m5oz8y",
        "author": "MarvelsGrantMan136",
        "title": "'Wonder Woman' Taps 'Supergirl' Writer Ana Nogueira for DC Studios Film",
        "content": "",
        "upvotes": 1468,
        "comments": 301,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/DCyP2ih-gcv3N1exolxIZz7cbIL4XrDBEJGlEsGttfU.jpeg?auto=webp&amp;s=7ccb714a00a2b33d8e18c19ffbed77ecd934bf09"
        },
        "permalink": "/r/movies/comments/1m5oz8y/wonder_woman_taps_supergirl_writer_ana_nogueira/"
    },
    {
        "id": "1m6bo8q",
        "author": "Task_Force-191",
        "title": "First Image from Ildikó Enyedi's 'Silent Friend' starring Tony Leung and Léa Seydoux - The Film follows three outsiders across 1908, 1972 and 2020 all drawn to a rare tree in a Marburg botanical garden. When a Hong Kong neuroscientist (Tony Leung) arrives, quiet truths about identity and time unfold",
        "content": "",
        "upvotes": 45,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/l97jcrvaweef1.jpeg?auto=webp&amp;s=d827a7763fde73aee85086f679a41c6fcc192884"
        },
        "permalink": "/r/movies/comments/1m6bo8q/first_image_from_ildikó_enyedis_silent_friend/"
    },
    {
        "id": "1m5lzkb",
        "author": "Task_Force-191",
        "title": "First Image of Alan Cumming and Brian Cox in 'Glenrothan' - After 35 years apart, Donal returns from Chicago to help his estranged brother Sandy save their crumbling Highland whisky distillery as old wounds resurface and they confront the past and each other in a story of regret and reconciliation",
        "content": "",
        "upvotes": 1600,
        "comments": 90,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ckx26ybdx8ef1.jpeg?auto=webp&amp;s=49d79687465f4122ead5b914b6c1167f6b32b992"
        },
        "permalink": "/r/movies/comments/1m5lzkb/first_image_of_alan_cumming_and_brian_cox_in/"
    },
    {
        "id": "1m5vn9o",
        "author": "SanderSo47",
        "title": "July 18-20 Box Office Recap – 'Superman' stays #1 on its second weekend, and crosses $400M worldwide. 'I Know What You Did Last Summer' opens with just $12.7M, below the first two films. 'Smurfs' and 'Eddington' flop with $11M and $4.2M, respectively.",
        "content": "https://preview.redd.it/lh89pmj5paef1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=c864d1cb488d08750cb8bdd885c4286a2bbe2524\n\nWith three newcomers failing to make a good impression, ***Superman*** easily kept the top spot for a second weekend with a very solid second weekend drop. ***I Know What You Did Last Summer*** was the top newcomer, but it still wound up below expectations. ***Smurfs*** and ***Eddington*** also flopped, although that's hardly a surprise.\n\nThe Top 10 earned a combined $128.7 million this weekend. That's down 11.5% from last year, when ***Twisters*** led with a pretty great $80 million.\n\n***Superman*** was still #1 with $58.4 million this weekend. That represents a 53% drop, which is solid for a comic book film. It's a bit steeper than ***The Batman*** (50.4%), but better than this year's ***Thunderbolts*** (56.4%). And much better than ***Man of Steel*** (64.6%).\n\nThrough 10 days, the film has earned $236.2 million. Its opening weekend was $3 million behind ***Man of Steel***, but it's now $26 million ahead of it. It's set to finish with over $350 million domestically, although it will still depend on how much it drops when ***The Fantastic Four: First Steps*** debuts next week.\n\n***Jurassic World Rebirth*** dropped 41%, adding $23 million this weekend. The film has amassed $276.4 million, and it's now $27 million behind ***Dominion*** through the same point. And it's gonna get larger now with ***The Fantastic Four*** opening.\n\nDebuting in third place, Sony's ***I Know What You Did Last Summer*** earned a disappointing $12.7 million in 3,206 theaters. That's below the original film ($15.8 million) and the sequel ($16.5 million), and that's despite 27 years of inflation on its side.\n\nSony kept the budget low at $18 million, so it's not really a flop. But it's still a very disappointing debut: Sony resurrected this franchise after 27 years just to have a lower debut than the 90s films? That's gotta sting, at least. After all, ***Scream*** has had a successful relaunch this decade after impressing back in the 90s. How could the same not happen for ***I Know What You Did Last Summer***?\n\nA lot of people are aware of the title, it's very iconic. But knowing something and being interested in it are two different things. Unlike ***Scream***, ***Last Summer*** was never a critical darling, as both films have negative reviews. Sure, it helped launch the careers of many actors, including Jennifer Love Hewitt and Freddie Prinze Jr., which is why they were brought back here. But the 2025 version just didn't really offer anything new or interesting for old fans, and young audiences probably don't care for this franchise even with the young cast attached. The bad reviews (38% on RT) further confirmed that this film was not gonna win over any new fans.\n\nAccording to Sony, the film was 50/50 between men and women. As mentioned, the film didn't really connect with young audiences, which is a big demo for horror: only 34% was 25 and under. They gave it a poor \"C+\" on CinemaScore, which is the worst in the franchise. Given some controversial decisions in the film, it's very likely the film will fall off quickly. The only advantage is that there's no horror competition till ***Weapons*** on August 8. But despite that, ***Last Summer*** won't earn much higher than $30 million domestically, pretty much guaranteed to be the lowest grossing in the franchise.\n\nIn fourth place, Paramount's ***Smurfs*** debuted with a poor $11 million in 3,504 theaters. That's far below any of the ***Smurfs*** films, including ***The Lost Village*** ($13.2 million).\n\nThis is a failure that will surprise absolutely no one. While ***The Smurfs*** was one of the biggest hits in 2011, the popularity quickly dwindled. The sequel opened with just $17 million and capped out at $71 million, while ***The Lost Village*** continued the decline with a $45 million domestic total. The ***Smurfs*** franchise is simply something that just lost whatever popularity it had left.\n\nThe marketing was everywhere, but it just wasn't good in the slightest. The plot is pretty much the same from any of the prior films, failing to overcome the \"been there, done that\" feeling. And yes, every single piece of marketing highlighted the whole \"Rihanna is Smurfette\" tagline, which quickly became tiring and uninteresting. The only advantage it had was that ***Elio*** was already winding down after its poor box office numbers, but the real nail in the coffin for ***Smurfs*** was the reviews: an absolutely dismal 21% on RT. Some animated films are critic-proof, but ***Smurfs*** is not one of those.\n\nAccording to Paramount, 61% of the audience was female, and 59% were parents with a child. They gave it a very lukewarm \"B+\" on CinemaScore, which is poor for an animated film. With ***The Bad Guys 2*** coming up in 2 weeks, ***Smurfs*** is destined to fall off. Right now, it should finish with just $30 million domestically. Is this gonna be the final theatrical release for these little blue demons? \n\n***F1*** rounded up the Top 5 with $9.8 million, which was a light 24% off from last week. The film has earned $153.9 million, and its way to $180 million depends on how much it can hold against ***Fantastic Four***.\n\nUniversal/DreamWorks' ***How to Train Your Dragon*** dipped 32%, earning $5.4 million this weekend. The film has crossed $250 million domestically, and it should finish with around $270 million.\n\nOpening in seventh place, A24 and Ari Aster's ***Eddington*** flopped with just $4.2 million in 2,111 theaters. That's above ***Beau Is Afraid***'s wide debut ($2.6 million), but that's not really saying much, especially because that film was playing in 965 theaters. This debut is also below Aster's ***Hereditary*** ($13.5 million) and ***Midsommar*** ($6.5 million, but it actually debuted on Wednesday).\n\nThe debut is particularly disappointing given that it has the most big names attached to an Aster film (Joaquin Phoenix, Pedro Pascal, Austin Butler and Emma Stone). But the biggest setback was always gonna be its premise: a dark comedy set during the COVID-19 pandemic. It's been 5 years since this happened and audiences are still not looking to revive that period, at least not now.\n\nBut if this and ***Beau*** proved something, is that Aster has still remained a niche director. A24 lost around $35 million on ***Beau*** and they still gave him $25 million to make ***Eddington***, which also flopped. ***Hereditary*** and ***Midsommar*** were successful, but Aster went very experimental and ambitious on ***Beau*** and ***Eddington***. That's bold, but can also alienate audiences and at the end of the day, he's a polarizing filmmaker. The Cannes reviews pretty much confirmed it; it's sitting at a 67% on RT, with reviews divided over \"loving it\" or \"hating it\". The audience just didn't care to find out.\n\nAccording to A24, 61% of the audience was male and 73% was 25 and over. They gave it a weak \"C+\" on CinemaScore, the same grade as ***Midsommar***. With more competition on its way, it's very likely the film will miss $10 million domestically. ***Hereditary*** and ***Midsommar*** were successful, but between this and ***Beau*** flopping, how many blank checks does Aster have left?\n\n***Elio*** dropped 47%, adding $2.1 million. The film has earned a meager $69 million so far.\n\n***Lilo &amp; Stitch*** dropped 41%, for a $1.5 million weekend. The film's domestic total stands at $418.2 million for now.\n\nRounding out the Top 10 is ***28 Years Later***, which dropped 52% and added $1.3 million this weekend. The film has earned $69 million, and it's set to close with around $73 million domestically.\n\n#**OVERSEAS**\n\nThe big story is ***Lilo &amp; Stitch***, which became the first Hollywood title of the year to hit the $1 billion milestone. Earning $4.7 million overseas, the film has made $1.008 billion so far, making it the second biggest film of the year behind ***Ne Zha 2***. The best markets are Mexico ($67M), UK ($48.9M), France ($42.4M), Brazil ($37.4M), Germany ($32.4M), Spain ($27.4M), China ($25.2M), Italy ($25.1M), Australia ($21.1M) and Argentina ($20.1M).\n\n***Superman*** added $45.2 million this weekend, taking its worldwide total to $408 million. It had pretty good holds across the board, which is very encouraging after its disappointing start last week. The one place where it fell the most was China, where it collapsed by an insane 94% to just $410K this weekend.\n\nThe best markets for the film are the UK ($22.2M), Mexico ($16.6M), Brazil ($11.2M), Australia ($11M) and China ($8.5M). Should definitely hit $550 million, but the path to $600 million depends on how much it can hold against ***Fantastic Four*** this weekend.\n\n***Jurassic World Rebirth*** added $40.3 million overseas, for a $649 million worldwide total. Its best markets are China ($71.8M), the UK ($33.7M), Mexico ($28.7M), Germany ($20.3M) and France ($17.4M). Should hit $700 million by next week.\n\nIn Japan, history was made. ***Demon Slayer: Kimetsu No Yaiba Infinity Castle*** debuted with a colossal 5.9 billion yen, which is around $36.5 million (some estimates have it at $39.7 million). This is the biggest debut in the country's history, and Hollywood chose to avoid releasing anything in close proximity. This is set for one of the best runs in the history of the country.\n\n***F1*** continues impressing despite the heavy competition. It added $29.5 million, allowing it to cross $300 million overseas, for a $461 million worldwide run. The film is enjoying fantastic holds in markets like China (–37%) and South Korea (+28%). Its best markets are China ($45.5M), the UK ($24.6M), France ($20.8M), Mexico ($17.4M) and Australia ($15.2M). Even with ***Fantastic Four*** coming up, it should definitely cross the $500 million milestone next week, which means it officially recoups its $200 million production investment.\n\n***Smurfs*** saved some face overseas, but its $25 million overseas debut got to a very weak $36 million worldwide debut. France was its best market with $3.7 million, followed by a solid $1.7 million in the UK. The rest was not as great: Brazil at $1.6M, Mexico with $1.5M and Germany at $1.5M. It's clearly a film that will skew heavily overseas, but it's still unlikely it will avoid the flop status.\n\n***I Know What You Did Last Summer*** debuted with $11.6 million overseas, for a $24.3 million worldwide debut. Almost on par with the domestic market, but it's clear the nostalgia wasn't very strong outside America either. Should definitely recoup its $18 million budget, but just like the domestic market, it will be the lowest grossing in the franchise worldwide.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Sinners* | Apr/18 | Warner Bros. | $48,007,468 | $278,578,513 | $365,878,513 | $90M\n\n- Once in a while, in a sea of IPs dominating the film market, there's an original film that manages to break out. And this year, that was ***Sinners***, which closed with a fantastic $278 million domestically and $365 million worldwide. Sold entirely on the names of Ryan Coogler and Michael B. Jordan, the film had one of the greatest runs of the decade: opened with $48 million and then dropped just 4.8% on its second weekend. Aided with an \"A\" on CinemaScore (a feat no horror film achieved since 1982), the film had insane legs, closing with an incredible 5.80x multiplier domestically. Obviously, the domestic market represented 76.1% of its worldwide gross, but that's not really surprising. This film pretty much cements Coogler as a filmmaker whose name is the selling point for audiences and can guarantee success, which is extremely rare to happen. Whatever he does next, the world is ready.\n\n#**THIS WEEKEND**\n\nAnd so another MCU film has arrived. And it's Marvel's First Family.\n\nAfter years of teasing, ***The Fantastic Four: First Steps*** is finally here, the long-awaited arrival of these characters in the MCU. Starring Pedro Pascal, Vanessa Kirby, Ebon Moss-Bachrach, and Joseph Quinn as the titular team, alongside Julia Garner, Natasha Lyonne, Paul Walter Hauser, and Ralph Ineson, it follows the Fantastic Four as they must protect their 1960s-inspired retro-futuristic world from the planet-devouring cosmic being Galactus. The film has achieved high level of interest, as fans are anticipating what the characters will finally get to do in the grand scheme of the MCU. These characters are already confirmed for the next ***Avengers*** films, which helped raise awareness even further. Now is the big question: will the MCU finally deliver the first good ***Fantastic Four*** film?\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 479,
        "comments": 137,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MOTLUSMP5CczPqOfKaXSxxtFRF2AmINbIK07jl4RCMY.png?auto=webp&amp;s=fd74f4d79483f4a666dca1005777c3fb7d3e4b0b"
        },
        "permalink": "/r/movies/comments/1m5vn9o/july_1820_box_office_recap_superman_stays_1_on/"
    },
    {
        "id": "1m5ucui",
        "author": "DemiFiendRSA",
        "title": "Matthew Broderick’s Closet Picks",
        "content": "",
        "upvotes": 552,
        "comments": 469,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-Evrtfb_kcoes4a9MNlc9pZxX6z4--2eWEV2wbuKLys.jpeg?auto=webp&amp;s=7817a51d6f0e6be7e6a72390abe1382962f91555"
        },
        "permalink": "/r/movies/comments/1m5ucui/matthew_brodericks_closet_picks/"
    },
    {
        "id": "1m5mumf",
        "author": "LunchyPete",
        "title": "Adria Arjona Joins Michael B. Jordan's 'The Thomas Crown Affair'",
        "content": "",
        "upvotes": 985,
        "comments": 125,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wyyDyQEl5wlNYOFUhSVLJDnB0Fr5R2Q73sKk39MjfGw.jpeg?auto=webp&amp;s=f582e2f83b824d80c1ed79ddac1d0da466c27499"
        },
        "permalink": "/r/movies/comments/1m5mumf/adria_arjona_joins_michael_b_jordans_the_thomas/"
    }
]