[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1lujfgd",
        "author": "Not-a-cyclist",
        "title": "Cosa fare con vestiti usati?",
        "content": "Scusatemi se faccio errori, sono Canadese e mi sono appena trasferita qui.\nLa storia è che purtroppo il papà del mio compagno è mancato poco tempo fa.\n\nDobbiamo svuotare la sua casa per poi venderla, ma non abbiamo nessun idea di cosa fare con i sui verstiti usati, o altri oggetti che aveva a casa.\nQuelli rovinati possono essere usati come stracci. Quelli ancora validi ma di qualità normale (magliette e jeans) possono essere messi nei bidoni per vestiti usati.\nMa quelli belli, sartoriali? Che sono ancora in condizioni perfette, che di sicuro hanno un costo altissimo? Tipo dei giubbotti di lana vergine, pantaloni e giacche sartoriali, ecc.\n\nHo provato di venderli su Vinted, ma il costo è troppo alto. La gente che va su Vinted cerca di comprare roba a 5 euro massimo.\n\nCi sono posti che comprano cose belle? ",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1lujfgd/cosa_fare_con_vestiti_usati/"
    },
    {
        "id": "1lu0x62",
        "author": "ArtistaFortunato",
        "title": "Quanti anni prima di una Torino 100% ciclabile e senza o poche auto?",
        "content": "Ciao a tutti, io sono a Padova, la città con più auto per persone del veneto, ma le strade sono tutte con poche auto, parcheggi pochissimi e prettamente ciclabile. Non parlo di strade che ci siamo trovati, ad esempio il comune ancora prima di mettere una fermata di un tram fa una pista ciclabile e ne fa un sacco di nuove e per ogni pista ciclabile nuova c'è una campagna stampa, oltremodo le piste vengono mantenute e spesso riasfaltate o divise con nuovi divisori dalla strada o con nuove luminarie o si ridipingono le strisce sopra le pedonali (molte piste ciclabili sono sopra dossi con accanto strisce pedonali), la chiamano ciclopolitana, si tende anche ad unire le piste ciclabili con delle zone naturali, quindi alcuni parchi hanno le zone per le bici, due corsie, con vigilanza che ferma le bici e scendere, le fa andare nelle corsie e nel centro sono la norma, ci sono parcheggi per le bici e cestini ovunque\n\nQuesto preambolo perché sono stato da poco a Torino e cazzo le vostre strade sembrano perfette per queste cose, invece sembrano degli showroom per le auto, giravo e pensavo \"Ok a Padova pochi parcheggi , ma qui si supera il limite, perché le auto sono davanti agli esercenti? Cazzo, ci sono più auto che esercenti!\" Ci sono vie che hanno una corsia ma due parcheggi, corsi con 8, mi sembra esagerato. Io leverei parcheggi, multerei l'impossibile e con quei soldi farei politiche green. Facendo anche scrivere sul giornale dei milioni presi dalla cosa e delle politiche che verranno fatte grazie a quei soldi.\n\nVisto il problema dell'inquinamento non penso sarà lontano un futuro tutto ciclabile, secondo voi quanto tempo manca? 10, 20? 30 anni?",
        "upvotes": 22,
        "comments": 77,
        "media": null,
        "permalink": "/r/torino/comments/1lu0x62/quanti_anni_prima_di_una_torino_100_ciclabile_e/"
    },
    {
        "id": "1ltr1k2",
        "author": "Coccorocco1",
        "title": "Trovato gatto Via Brindisi",
        "content": "Salve a tutti, ieri sera abbiamo trovato questo gatto in Via Brindisi. Stiamo cercando i padroni, per favore aiutatemi 🙏. Grazie a tutti ",
        "upvotes": 32,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5eao223umfbf1.jpeg?auto=webp&amp;s=d8d0679c10b08472bd5797f080a4ad57066dd3f9"
        },
        "permalink": "/r/torino/comments/1ltr1k2/trovato_gatto_via_brindisi/"
    },
    {
        "id": "1lu7d5c",
        "author": "allexj",
        "title": "Come si dice bambino in piemontese? Per caso si dice \"boca\"?",
        "content": "",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1lu7d5c/come_si_dice_bambino_in_piemontese_per_caso_si/"
    },
    {
        "id": "1lu4xpg",
        "author": "LucaWalker92",
        "title": "Consigli su biliardo",
        "content": "Ciao a tutti, faccio una premessa, una dozzina di anni fa esisteva un locale che si chiamava Hustler, vicino a via Catania. \nEra un bar con una discreta selezione e aveva tre bellissimi tavoli da biliardo!\nPurtroppo non è sopravvissuto alla prova del tempo, ma era il mio piccolo angolo di paradiso... da allora ripiego sul Planet, ma sto cercando un posto più simile a quello.\n\nPotete consigliarmi dei locali o circoli in cui andare a giocare a biliardo Palla8, senza trovarmi in mezzo a cento persone, ma allo stesso tempo in cui si possa parlare e giocare senza temere di essere di disturbo?\n\nEdit per specificare Palla8 e non Goriziana ",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1lu4xpg/consigli_su_biliardo/"
    },
    {
        "id": "1lt8ckw",
        "author": "AcousticBassGuitar",
        "title": "Sopprimetela",
        "content": "Una sedia del McDonalds di via Monginevro, fossi in loro porrei fine alle sue sofferenze (è chiaramente in astinenza da crack) ",
        "upvotes": 33,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gqze1bgzrabf1.jpeg?auto=webp&amp;s=191fd4da7d59d5abbdea9b8c53e53fa02922cd95"
        },
        "permalink": "/r/torino/comments/1lt8ckw/sopprimetela/"
    },
    {
        "id": "1lszagc",
        "author": "Apoworld",
        "title": "Ho deciso di trasferirmi fuori città",
        "content": "Voi avete mai considerato di uscire dalla città? \n\nUn po’ di contesto, M32 con famiglia (moglie e due bambini molto piccoli).\n\nNato e cresciuto in città: mi sono trasferito in diversi quartieri (Centro da bambino, poi San Salvario da Adolescente, poi Crocetta e ora da diversi anni risiedo in zona Parco Dora (quartiere che adoro).\n\nAbitando al 13esimo piano, ho la fortuna di vedere tutta Torino dall’alto, e, per la sfortuna invece, di poter scorgere ogni mattina la kappa (non festival purtroppo) di smog che ingloba la città.\n\nHo deciso dunque, un po’ per l’inquinamento (fattore che personalmente mi influenza tantissimo), un po’ per la calura insopportabile d’estate ed un po’ per poter dare uno spazio che non sia il solito appartamento ai bimbi, di trasferirmi.\n\nPer lavoro devo rimanere nelle vicinanze della città: ho dunque preso in considerazione le zone che vedete sulla mappa (le più vicine sopra ai 400m o comunque in rilievo con una buona esposizione). \n\nDopo tantissime perlustrazioni, l’indecisione era forte tra Almese (inizio Val di Susa), Villarbasse (collina Morenica) e Front (inizio Canavese). \n\nAll’ultimo poi è spuntata una casa tra Sciolze e Marentino (collina Torinese, lato alto) e mi sono perdutamente innamorato del contesto, del collegamento con Torino (bretella di Gassino sull’A4 + tangenziale) e della natura che la fa da padrona.\n\nQuindi dopo 32 anni dico addio alla città, aprendo così una nuova fase, tutta nuova della mia (nostra) vita.\n",
        "upvotes": 103,
        "comments": 59,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/13hvsr0zr8bf1.jpeg?auto=webp&amp;s=3e38d926cbac76c9b16689f6e42694b863602fb5"
        },
        "permalink": "/r/torino/comments/1lszagc/ho_deciso_di_trasferirmi_fuori_città/"
    },
    {
        "id": "1lth3hg",
        "author": "Diucristini",
        "title": "Ho perso la scadenza Apply@UniTo, posso ancora iscrivermi nel 2025/26?",
        "content": "Ciao a tutti,\nsono una studentessa brasiliana, residente fuori dall’UE, e mi sto preparando da tempo per studiare all’Università di Torino nell’anno accademico 2025/26. Ho superato il TOLC-SU e possiedo il certificato CILS B2.\n\nPurtroppo ho perso la scadenza per la candidatura Apply@UniTo (30 aprile), ma ho creato un account MyUniTo e ho provato a fare la pre-iscrizione per un corso ad accesso libero. Tuttavia, il sistema mi dà questo errore: “Errore durante l’accesso ai servizi”.\n\nHo contattato l’università, ma la risposta che ho ricevuto è stata molto generica e non ha chiarito la mia situazione.\n\nVorrei sapere se posso fare la pre-iscrizione direttamente tramite Universitaly o se è obbligatorio inviare la pre-iscrizione tramite Apply@UniTo per essere ammessa.\n\nQualcuno sa se esiste una possibilità, anche minima, per essere considerata in questa situazione?\n\nGrazie mille in anticipo a chi potrà aiutarmi 🙏\n",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1lth3hg/ho_perso_la_scadenza_applyunito_posso_ancora/"
    },
    {
        "id": "1lt9841",
        "author": "heromatte",
        "title": "Perchè è così difficile trovare una stanza da studente?",
        "content": "A settembre farò la magistrale al polito, ed è da settimane che sto cercando una stanza per abitare ma non riesco a trovare nulla. Qualcuno riesce ad aiutarmi?",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1lt9841/perchè_è_così_difficile_trovare_una_stanza_da/"
    },
    {
        "id": "1lsmtaf",
        "author": "AcousticBassGuitar",
        "title": "Una bella giornata, una cima e una paperella molto piccola che vuole mangiarsela",
        "content": "il Paperoide ",
        "upvotes": 89,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/dfuukpng15bf1.jpeg?auto=webp&amp;s=4cd7513948496f362abd25dd10a66135c11ddca4"
        },
        "permalink": "/r/torino/comments/1lsmtaf/una_bella_giornata_una_cima_e_una_paperella_molto/"
    },
    {
        "id": "1lsympr",
        "author": "BobbyBubble777",
        "title": "Mercati",
        "content": "Salve, quali mercati alimentari sono aperti dal lunedì al venerdì nel centro di Torino ? Passiamo la settimana a Torino e vorremmo pranzare con prodotti freschi e locali. Grazie.",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1lsympr/mercati/"
    },
    {
        "id": "1lszqiy",
        "author": "DependentPost9445",
        "title": "Zaino per viaggio in Norvegia",
        "content": "Ciao, dovrò fare un viaggio in Norvegia questa estate, spostandomi con i treni. Devo comprare uno zaino da Backpacking sui 60 L. Conoscete qualche negozio che offre un buon assortimento per questa tipologia di zaini (al netto dei vari decathlon/cisalfa).\nGracias\n",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1lszqiy/zaino_per_viaggio_in_norvegia/"
    },
    {
        "id": "1lsxn0e",
        "author": "Confident-Art-8800",
        "title": "Bei posti dove festeggiare una laurea",
        "content": "Ciao ragazzi,\nSono il tizio del posto in cui portare la propria ragazza a ristorante. Visto il successo del ristorante  e della serata, ora vuole chiedere a Reddit posti molto bellini dove festeggiare una laurea.\n\nL’unico criterio è che siano zona Valentino \n\nGrazi a tutti ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lsxn0e/bei_posti_dove_festeggiare_una_laurea/"
    },
    {
        "id": "1lsj9su",
        "author": "AcousticBassGuitar",
        "title": "Amo i miei ricircoli d’aria minimi orari",
        "content": "",
        "upvotes": 21,
        "comments": 3,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/te8zpxx184bf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/torino/comments/1lsj9su/amo_i_miei_ricircoli_daria_minimi_orari/"
    },
    {
        "id": "1lsjx53",
        "author": "allexj",
        "title": "Torinesi, si pronuncia \"toret\" o \"turet\"",
        "content": "",
        "upvotes": 13,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1lsjx53/torinesi_si_pronuncia_toret_o_turet/"
    },
    {
        "id": "1lswbzf",
        "author": "Cira94",
        "title": "Palestre poco affollate",
        "content": "Buongiorno vorrei consigli per palestre poco affollate in orario di punta avete consigli? \nAnni fa frequentavo Anytime Fitness in via Bogino ed era perfetta, so che ha aperto anche in zona Lancia avete info? L'unica cosa che ho sentito è che costa 75 euro al mese e per quel prezzo di va alla Virgin no?\n\nZona preferibilmente non troppo lontana dal centro ma mi posso spostare",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1lswbzf/palestre_poco_affollate/"
    },
    {
        "id": "1ltdje4",
        "author": "niki-docet",
        "title": "IL KAPPA È FINITO, GRAZIE AL CIELO",
        "content": "Vivo nei dintorni del Parco Dora ormai da due anni e ogni anno attendo come un incubo il ritorno del Kappa Future Festival. Chi come me abita nei dintorni, sa della tortura uditiva obbligata fino all'1 del mattino e dei fiumi di disagio che si riversano nei quartieri. Perché organizzare una cosa del genere in un parco circondato da zone abitate? Non solo la musica che arriva a fare vibrare la casa, ma anche la fiumana di gente che si riversa in una zona già di per sé molto affollata. È pieno di locali e zone simili poco fuori dalla città, lontane da centri abitati, perché si ostinano a distruggere il nostro parco Dora?",
        "upvotes": 0,
        "comments": 39,
        "media": null,
        "permalink": "/r/torino/comments/1ltdje4/il_kappa_è_finito_grazie_al_cielo/"
    },
    {
        "id": "1lsjx5v",
        "author": "allexj",
        "title": "Torinesi, si pronuncia \"toret\" o \"turet\"",
        "content": "",
        "upvotes": 4,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1lsjx5v/torinesi_si_pronuncia_toret_o_turet/"
    },
    {
        "id": "1ls87tk",
        "author": "DirectInteraction825",
        "title": "Luoghi dove poter fare smart working",
        "content": "Tra poco inizierò a fare smart working e vorrei trovare un posto comodo dove poter parlare (a volte mi chiamano o devo fare meeting, quindi no biblioteche o posti silenziosi), siccome a casa d’estate non ci voglio stare. Suggerimenti? ",
        "upvotes": 13,
        "comments": 29,
        "media": null,
        "permalink": "/r/torino/comments/1ls87tk/luoghi_dove_poter_fare_smart_working/"
    },
    {
        "id": "1lslq0r",
        "author": "emiliooow",
        "title": "Kappa futur festival",
        "content": "Vorrei prendere i biglietti in rivendita per la domenica da gente su instagram/telefram, ecc..sapete se esiste un modo per confermare che i biglietti siano veri?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1lslq0r/kappa_futur_festival/"
    },
    {
        "id": "1lsnjlk",
        "author": "Vandumurugan007",
        "title": "Festa del laurea",
        "content": "Ciao tutti. Mi laureo tra poco e vorrei festeggiare con i miei amici. Quindi cerco un posto dove ci possiamo festeggiare tranquilamente, mangiando, bevendo, tipo un aperitivo. Ma non posso spendere tanto, cioè, forse 10€ una testa, e siamo in 20. Conoscete i posti vicino Poli così? Grazie✨\nP.S - Non sono Italiano, sono un studente internazionale, quindi vi chiedo scusa se sbaglio con la lingua, sto ancora imparando l'italiano.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1lsnjlk/festa_del_laurea/"
    },
    {
        "id": "1ls6iho",
        "author": "Murky_Giraffe8700",
        "title": "Vivere in Campidoglio, Torino",
        "content": "Sto cercando casa in affitto e mi interessa Campidoglio e dintorni. Ho visto che è una zona popolare abbastanza tranquilla ma colegata\n\nProprio questa zona\n\nhttps://preview.redd.it/4xh5arpf51bf1.png?width=1093&amp;format=png&amp;auto=webp&amp;s=83d508a3d4114672f58ea9dab36c53e4d822299d\n\nCom’è davvero viverci? È sicura? Rumorosa? Vale la pena rispetto ad altre zone tipo Cit Turin o San Donato?",
        "upvotes": 6,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1ls6iho/vivere_in_campidoglio_torino/"
    },
    {
        "id": "1lsc4ot",
        "author": "Bulky-Sink8917",
        "title": "Alloggio a Torino per laurea magistrale",
        "content": "Salve a tutti, ho intenzione di iniziare a settembre una laurea magistrale a Torino come fuori sede ed ho quindi in programma di trasferirmi. Forse potrei risultare assegnatario di un alloggio universitario, avete consigli al riguardo? Com’è alleggiare in una residenza universitaria? Ci sono regole stringenti? Quali dormitori consigliate (considerando che la magistrale che vorrei fare è ingegneristica e non so dove si svolgano le lezioni)? È forse meglio cercare un alloggio in maniera autonoma evitando quelli universitari? Qualsiasi consiglio, anche relativo alla città/università è ben accetto!",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1lsc4ot/alloggio_a_torino_per_laurea_magistrale/"
    },
    {
        "id": "1ls5qco",
        "author": "Interesting_Cry1672",
        "title": "Corsi motocross",
        "content": "Ciao, qualcuno di voi ha esperienza con corsi di motocross in zona da raccomandare, anche per gente più anziana? Mi piacerebbe provare, ho 32 anni.",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1ls5qco/corsi_motocross/"
    },
    {
        "id": "1lrr75i",
        "author": "Fancy_Explorer_43",
        "title": "amici in fitactive corso svizzera",
        "content": "mi sono appena trasferito e son sempre da solo ad allenarmi :(\nqualche bro per farmi compagnia? offro sorsi di monster e magari una j ",
        "upvotes": 10,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1lrr75i/amici_in_fitactive_corso_svizzera/"
    },
    {
        "id": "1ls3jbt",
        "author": "borisbanana77",
        "title": "Cerco Cafè Locale",
        "content": "\nCiao tutti!\nCerco una torrefazione locale da cui acquistare il caffè.\n\nConosco Orso (a San Salvation) e San Domenico (la Bottega è  Palazzo Carignano, da Susa).\n\nSe non si tratta di un caffè prodotto localmente, un negozio con un buon caffè a prezzi ragionevoli potrebbe essere una buona idea.\n\n\nHo diversi tipi di macchine da caffè, ma uso principalmente una macchina per espresso manuale a livello.",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1ls3jbt/cerco_cafè_locale/"
    },
    {
        "id": "1lrxwe8",
        "author": "Usual_Ad8650",
        "title": "Torino.",
        "content": "",
        "upvotes": 2,
        "comments": 20,
        "media": null,
        "permalink": "/r/torino/comments/1lrxwe8/torino/"
    },
    {
        "id": "1lre9hq",
        "author": "ArtistaFortunato",
        "title": "Torino nuova Milano, sento dire un po' ovunque",
        "content": "Ciao a tutti, io non sono torinese ma ho zii a Torino e sono andato lì col mio ragazzo, innamoratissimo (soprattutto perché mi ricorda la mia infanzia in Sicilia) da qualche anno a questa parte pensavo di comprare casa lì più avanti, ma da circa due anni vedo le case salire come folli, fino a due anni fa potevo permettermi quartieri come crocetta, ho visto ora e me lo sogno, ora non più e vedo online video che parlano di come \"Torino è la nuova Milano\" e quando parlo di Torino qui in veneto (dove sono adesso) mi dicono tutti che diventerà la nuova milano",
        "upvotes": 13,
        "comments": 108,
        "media": null,
        "permalink": "/r/torino/comments/1lre9hq/torino_nuova_milano_sento_dire_un_po_ovunque/"
    },
    {
        "id": "1lricn5",
        "author": "Impossible_Big3207",
        "title": "suggerimento per le giornate calde",
        "content": "Ciao a tutti, cosa fate in queste giornate calde? Sono uno straniero che ha sempre avuto l'aria condizionata per tutta l'estate e non sopporto più questo caldo. Avete qualche consiglio? C'è un posto con l'aria condizionata dove posso andare a stare per studiare e lavorare?",
        "upvotes": 5,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1lricn5/suggerimento_per_le_giornate_calde/"
    },
    {
        "id": "1lrgyrm",
        "author": "syosetsu02",
        "title": "IELTS",
        "content": "Qualcuno sa dove si possono fare mock exam IELTS per avere una valutazione oggettiva prima di fare il test definitivo?\n(se possibile non un corso, ma solo un test con valutazione)",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lrgyrm/ielts/"
    }
]