[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 477,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1h2nmem",
        "author": "bunaventure",
        "title": "Does everyone mute their TV when navigating Netflix?",
        "content": "Surely everyone dislikes the auto-preview feature as much as me? Either I have to flip back and forth, not staying on any one item too long, or I simply mute my TV. I feel like both spoil the experience a bit and I'm shocked Netflix hasn't done anything to tone it down. I get that they have their reasons, but it's awful.\n\nIs everyone else less bothered or what? I figure it would have changed by now if everyone dislikes the auto-preview as much as me. Google TV version btw - but I'm pretty sure it's implemented on most Netflix apps..",
        "upvotes": 193,
        "comments": 80,
        "media": null,
        "permalink": "/r/netflix/comments/1h2nmem/does_everyone_mute_their_tv_when_navigating/"
    },
    {
        "id": "1h2q8ge",
        "author": "life_lagom",
        "title": "Anyone else re watch this more than once ? [Highly recommended]",
        "content": "Its Been a minute but God damn I'm rewatching and on season 2 and I forgot how good Marco Polo was. \n\nhttps://en.m.wikipedia.org/wiki/Marco_Polo_(2014_TV_series)\n\nIf you're Into historical fiction or action. This shit is fantastic. Can't belive this came out a decade ago I don't think I've fully rewatched it since it came out.",
        "upvotes": 92,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1h2q8ge/anyone_else_re_watch_this_more_than_once_highly/"
    },
    {
        "id": "1h2mc49",
        "author": "Dependent-Internal37",
        "title": "Anyone else watched or watching The Later Daters?",
        "content": "Would love to get the community’s thoughts on The Later Daters show which just dropped on Netflix. Understand it’s a reality show, but would appreciate to hear people’s thoughts - good or bad! I’m personally smitten by their candour and as a single person in my 30s they’ve motivated me not to give up.",
        "upvotes": 25,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1h2mc49/anyone_else_watched_or_watching_the_later_daters/"
    },
    {
        "id": "1h2m4ta",
        "author": "Automatic-Attorney96",
        "title": "My fav relationships",
        "content": "",
        "upvotes": 25,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1h2m4ta/my_fav_relationships/"
    },
    {
        "id": "1h2idcy",
        "author": "LetterheadFun3697",
        "title": "Three Years After Cancellation, 'A.P. Bio' Continues To Dominate Netflix Charts",
        "content": "",
        "upvotes": 47,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1h2idcy/three_years_after_cancellation_ap_bio_continues/"
    },
    {
        "id": "1h24oeh",
        "author": "techfinpro",
        "title": "Netflix Issues New Adults-Only Warning for ‘Stranger Things’ Ahead of Season 5",
        "content": "",
        "upvotes": 368,
        "comments": 127,
        "media": null,
        "permalink": "/r/netflix/comments/1h24oeh/netflix_issues_new_adultsonly_warning_for/"
    },
    {
        "id": "1h318pw",
        "author": "Guacamole_is_Life",
        "title": "Hot Frosty",
        "content": "I absolutely loved this movie. It was so much fun and nice eye candy! Anyone else love this movie? I have explained it as Netflix’s answer to a Hallmark movie. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h318pw/hot_frosty/"
    },
    {
        "id": "1h2yrjx",
        "author": "sinemahanedani",
        "title": "Greta Gerwig Kimdir? | Oyunculuktan Yönetmenliğe Yolculuk - Sinema Hanedanı",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h2yrjx/greta_gerwig_kimdir_oyunculuktan_yönetmenliğe/"
    },
    {
        "id": "1h2rm00",
        "author": "Stephanus_magnus",
        "title": "One of us is lying ",
        "content": "For the people who watched this series, what’s your favourite character?\n\nFor me it’s Fiona. Seriously. Fiona was brilliant, a perfect nerd-criminal. I think she is a misunderstood person, she really loved Jake, but she was also betrayed by him. She thought she was the only one who saw him as he really was, but she was corrupted by feelings. Unfortunately Jake was incapable of feeling empathy for anyone. I'm sorry she died, didn’t deserve.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h2rm00/one_of_us_is_lying/"
    },
    {
        "id": "1h1x1rm",
        "author": "S4v1r1enCh0r4k",
        "title": " China censored LGBT Scenes in Arcane Season 2, the scenes west saw were starkly different ",
        "content": "",
        "upvotes": 224,
        "comments": 67,
        "media": null,
        "permalink": "/r/netflix/comments/1h1x1rm/china_censored_lgbt_scenes_in_arcane_season_2_the/"
    },
    {
        "id": "1h2tv7g",
        "author": "bbgarnett",
        "title": "Widvine Level on Tablet",
        "content": "Hello, so if I have a tablet that has Widvine L1 but it might not have the Netflix certification can you still download Netflix for offline viewing? If so will you be allowed to download in FHD or will they be in 480P like it would be if you were to stream it.\n\n  \nThanks,",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h2tv7g/widvine_level_on_tablet/"
    },
    {
        "id": "1h2tayz",
        "author": "Individual-Barber903",
        "title": "Need help selecting Netflix plan",
        "content": "Hey guys! I’m thinking of getting a Netflix subscription but I can’t decide on which one. I think the premium plan is overkill for me as I don’t have anyone to share my plan with but the 4K resolution and Spatial Audio sounds like bait (that I’m trying not to fall for). The standard plan sounds the best but it’s still quite expensive and Netflix is extremely ambiguous about the quantity of ads in the ads plan and the quality in the standard plans. Does anyone habe suggestions on which plan to pick? Thank you!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h2tayz/need_help_selecting_netflix_plan/"
    },
    {
        "id": "1h2nfjh",
        "author": "Mental-Summer-9831",
        "title": "Can't find the same shows as my kid?",
        "content": "My household has a family account with a profile for each family member.\nMy oldest kid is really into anime and I want to watch a few of her favorite shows.\n\nHowever - when I search for the shows from my profile, they don't show up. \nShe has a 16 yo age restriction, I have none.\n\nI know we will get different recommandations based on our watch history, but not being able to find the show? Is that a thing? \nShouldn't I be able to access the same shows as her?\n\nI have reached out to the support chat, but their suggestion was to restart my phone, which didn't work.\n\nAny tips or even explanations?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h2nfjh/cant_find_the_same_shows_as_my_kid/"
    },
    {
        "id": "1h2v1pm",
        "author": "Sardonyx-LaClay",
        "title": "Can’t take a screenshot?",
        "content": "I’m watching Arcane on my iPad and I’ve been taking screenshots of scenes I want to draw. \n\nA few hours in I check my photos and all of my screenshots turned up black. Is there anything I can do to fix this? Is there another way I can take screenshots?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1h2v1pm/cant_take_a_screenshot/"
    },
    {
        "id": "1h2ga9g",
        "author": "shakha",
        "title": "Have there been any updates on Mo season 2?",
        "content": "This show is difficult to look up info on. I googled it and accidentally spent quite a bit of time reading about The Mole! So, where is season 2? When is it coming?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h2ga9g/have_there_been_any_updates_on_mo_season_2/"
    },
    {
        "id": "1h2sdz4",
        "author": "TheGuyWithG",
        "title": "Arcane season 2",
        "content": "Arcane Season 2 was a significant departure from its groundbreaking predecessor. As with the later seasons of Game of Thrones, True Detective, Westworld (well done HBO), Arcane Season 2 seemed to lose its unique identity, taking heavy inspiration from Marvel's Age of Ultron. The once-captivating soundtrack felt generic and unmemorable, a far cry from the enchanting melodies that defined Season 1. Additionally, the plot felt rushed and convoluted, failing to build upon the strong foundation established in the first season. It's as if Netflix tried to replicate the success of Season 1 without understanding the core elements that made it special.\nWhat have you done Netflix? ",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1h2sdz4/arcane_season_2/"
    },
    {
        "id": "1h27ixu",
        "author": "443610",
        "title": "How “Senna” meticulously recreated every detail of F1 legend's life - from cars to racing suits",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h27ixu/how_senna_meticulously_recreated_every_detail_of/"
    },
    {
        "id": "1h2h42x",
        "author": "biggs1199",
        "title": "Rhythm and flow ",
        "content": "If this season was going to be this terrible they should have just canceled the series. That’s the thing that pisses me off about Netflix, when a series deserves to be cancelled they don’t and when a series doesn’t deserve to be cancelled it is. Im still trying to figure out why KAOS was cancelled…",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h2h42x/rhythm_and_flow/"
    },
    {
        "id": "1h2cuuf",
        "author": "spookysteely",
        "title": "Ads don't play unless Netflix tab selected?",
        "content": "I just noticed something weird today on my laptop. When an ad is playing and I click off the tab, netflix auto pauses the content, and doesn't begin playing it again until I manually press play in the tab again. \n\n  \nIt doesn't auto-pause actual content when I click off the tab, just the advertisement. Has anyone else noticed this? Was this a new change just added?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h2cuuf/ads_dont_play_unless_netflix_tab_selected/"
    },
    {
        "id": "1h2dibq",
        "author": "A-Dog22",
        "title": "The 30 best movies on Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h2dibq/the_30_best_movies_on_netflix/"
    },
    {
        "id": "1h2deqa",
        "author": "Fluffy-Isopod7469",
        "title": "How do I  get Netflix to work at a second home? Need help ",
        "content": "So I read that you had to go to the primary home, sign into Netflix at that home from the Wi-Fi with your phone, stream something, then go back to the second home, stream something on that homes Wi-Fi, then it should work on the TV.\n\nWell I did that and it’s still showing “This TV isn’t apart of your Netflix household” on my TV.\n\nHow the hell do I fix this?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1h2deqa/how_do_i_get_netflix_to_work_at_a_second_home/"
    },
    {
        "id": "1h2iuea",
        "author": "ChestIcy9105",
        "title": "Did they downgrade vid quality?",
        "content": "I am using ad sub and it is unwatchable. What is going on with Netflix? I feel like they are intentionally downgraded vid quality for some reason. This is 720p at best.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h2iuea/did_they_downgrade_vid_quality/"
    },
    {
        "id": "1h19gp5",
        "author": "TheLaraSuChronicles",
        "title": "Netflix kids' movie, Spellbound slammed by parents for 'normalizing' divorce and 'pushing for family separation'",
        "content": "",
        "upvotes": 319,
        "comments": 129,
        "media": null,
        "permalink": "/r/netflix/comments/1h19gp5/netflix_kids_movie_spellbound_slammed_by_parents/"
    },
    {
        "id": "1h1zk63",
        "author": "ontario-guy",
        "title": "Kids missing almost all shows?",
        "content": "I’m not sure if it’s an issue with my Firestick or Netflix…when I loaded it up this morning there was the 5 featured shows, one row of shows, and then just a row of kids characters. I think there were only like 10 different shows and the search wouldn’t bug up the shows that were there yesterday. It’s the same in iOS.\n\nAnyone else seeing issues like this? I can’t imagine Netflix is intentionally removing 90%+ of their kids shows. (I’m in Canada FWIW)",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h1zk63/kids_missing_almost_all_shows/"
    },
    {
        "id": "1h1p1d2",
        "author": "JinJaDubstep",
        "title": "Best ACTUALLY SCARY movies on Netflix currently?",
        "content": "What are some of the best actually scary movies on Netflix currently? Not a fan of slow burn movies or creepy movies. looking for movies with a lot of \"scary\" parts (ie - conjuring 2, smile 2, evil dead rise)",
        "upvotes": 26,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1h1p1d2/best_actually_scary_movies_on_netflix_currently/"
    },
    {
        "id": "1h235la",
        "author": "ok_raspberry_jam",
        "title": "Funny spelling mistake on \"Ransom\" description",
        "content": "\"A skilled crisis and hostage negotiator uses his knowledge of human behavior to **DIFFUSE** dangerous situations all over the world.\"  \n  \nAll over the whole world! Like a fine mist. Someone stop this man.",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1h235la/funny_spelling_mistake_on_ransom_description/"
    },
    {
        "id": "1h26ddn",
        "author": "Romulo_und_Remo",
        "title": "Can I change my icon to one from the Profile Icon history?",
        "content": "I want to change mine to one from Arcane but I'm currently using the Dedenne icon and I don't want to lose it since the Pokemon Concierge icons are not available anymore. Would I be able to pick it from my history?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h26ddn/can_i_change_my_icon_to_one_from_the_profile_icon/"
    },
    {
        "id": "1h2gb2w",
        "author": "fufa_badmash",
        "title": "Comment Section on Netflix?",
        "content": "What if Netflix added comment section like YouTube where viewers could leave comments on individual episodes, movies, or entire series, similar to YouTube?\n\nImagine the possibilities:\n\n* Fans could discuss their favourite scenes, share theories, and point out Easter eggs.\n* Mini-reviews and recommendations would help you decide what to watch next.\n* Community-driven conversations could make Netflix feel more interactive and social.\n\nBut... there’s also the downside:\n\n* Spoilers everywhere!\n* Would it distract from the “lean-back” streaming experience Netflix is known for?\n\nWould this be a game-changing feature or just unnecessary noise?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1h2gb2w/comment_section_on_netflix/"
    },
    {
        "id": "1h1m7ro",
        "author": "beeemmvee",
        "title": "Buy Now!",
        "content": "Wow.\n\nI knew some of this but had no idea how far it actually went. The slime of humanity is truly revealed. \n\nThis is a must see for every human consumer on the planet. \n\n  \n",
        "upvotes": 30,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1h1m7ro/buy_now/"
    },
    {
        "id": "1h2h0r6",
        "author": "billiondollartrade",
        "title": "Why tf does Netflix keep making good as shows just to cancel the dam show 2 seasons later ! ! And then allow the trash shows to go for seasons on seasons! ",
        "content": "For the Love of God, so many shows that are actually good and they just be dropping those but “ oh no let’s keep the trash show about some stupid comedy or sx “ anything damn sex related is all they give a fck about. ",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1h2h0r6/why_tf_does_netflix_keep_making_good_as_shows/"
    }
]