[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 13,
        "comments": 104,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 71,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1ln8s7l",
        "author": "Jumpy-Purple7593",
        "title": "What’s a hidden gem on Netflix that you always recommend but no one ever seems to watch?",
        "content": "We all have that one show or movie we loved on Netflix, the one you tell people about constantly, but for some reason, nobody ever seems to give it a shot. Mine is “The OA” ,weird, emotional, and absolutely brilliant. Every time I recommend it, people nod politely and go right back to rewatching The Office for the 6th time. So let’s hear it: what’s your underrated favorite? Could be a foreign film, a forgotten limited series, or a random docuseries that blew your mind. ",
        "upvotes": 505,
        "comments": 668,
        "media": null,
        "permalink": "/r/netflix/comments/1ln8s7l/whats_a_hidden_gem_on_netflix_that_you_always/"
    },
    {
        "id": "1ln7niq",
        "author": "zentyme_",
        "title": "Squid Game: Season 1 vs Seasons 2-3",
        "content": "",
        "upvotes": 54,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1ln7niq/squid_game_season_1_vs_seasons_23/"
    },
    {
        "id": "1lmzrmi",
        "author": "chrisarrant",
        "title": "[News] Netflix's The Sandman was hoped to run for four seasons... but then they re-read the comic, and decided to end it at two",
        "content": "",
        "upvotes": 114,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1lmzrmi/news_netflixs_the_sandman_was_hoped_to_run_for/"
    },
    {
        "id": "1lmswi4",
        "author": "pnut88",
        "title": "Has anyone else watched and fell in love with Dept. Q? Man i thought this show was great!",
        "content": "The build up, the mystery, the acting. All if it. I thought it was superb. Highly recommend if you haven't seen it yet! Any news on if it has a season 2 in the works? Would love to watch another crime!",
        "upvotes": 233,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1lmswi4/has_anyone_else_watched_and_fell_in_love_with/"
    },
    {
        "id": "1ln8xoj",
        "author": "randomuser_q12",
        "title": "What is a Netflix show you wish had another season?",
        "content": "Ugh I miss the show Ju-on origins. It only had 1 season but the show was sooo intense and disturbing. I wish so much this show would come back to Netflix but I’m sure it won’t it’s been like 5 years 😭",
        "upvotes": 12,
        "comments": 64,
        "media": null,
        "permalink": "/r/netflix/comments/1ln8xoj/what_is_a_netflix_show_you_wish_had_another_season/"
    },
    {
        "id": "1lmulp4",
        "author": "Shoddy_Mission6702",
        "title": "Is it just me, or is Netflix's release strategy kind of ruining the hype?",
        "content": "Hey everyone,  \nI just wanted to get your take on this. Do you actually enjoy how Netflix handles its series these days?\n\nThey drop a handful of episodes—fewer and fewer —and then split the season in half, making us wait *years* to get the rest. It’s honestly driving me crazy.\n\nPersonally, I much prefer Disney+'s strategy of releasing one episode a week. It builds hype, whereas Netflix's approach kills it.\n\nLike... do they really think people still care about a show after all that time? I can barely remember what I had for lunch, let alone a series I watched ages ago.\n\nCurious to hear what you all think. Am I alone in this?",
        "upvotes": 107,
        "comments": 80,
        "media": null,
        "permalink": "/r/netflix/comments/1lmulp4/is_it_just_me_or_is_netflixs_release_strategy/"
    },
    {
        "id": "1ln03uj",
        "author": "Upstairs_Demand_6018",
        "title": "Lack Of Content?",
        "content": "I don't mean to be negative here, but does it seem that Netflix is releasing less and less shows? Like it's been pretty dry within the last couple months. Not too many quality shows tbh but maybe it's just me.\n\nAny thoughts or insight on this?",
        "upvotes": 24,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1ln03uj/lack_of_content/"
    },
    {
        "id": "1lni56l",
        "author": "Intelligent_Duck1844",
        "title": "My plan just updated out of nowhere",
        "content": "So i bought the basic plan and was watching all fine i had about 5 to 6 profiles or so and i dont think anyone has messed with anything but suddenly i got a email that my plan has been updated to standard now i dont know if this means i have to pay 7.99 or my regualr 4.99 for basic i changed it to basic but it says the change will happen at the end of the month. This is really confusing i know i started on a basic plan yet it changed mid month how is that possible. I need help",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lni56l/my_plan_just_updated_out_of_nowhere/"
    },
    {
        "id": "1lni401",
        "author": "reapercrewsamcro",
        "title": "Netflix Airplay is apparently discontinued on Samsung TV’s?",
        "content": "What sense does it make to discontinue airplay ?So I’m trying to airplay a show on Netflix to my smart tv and it keeps giving me an error, but other apps like hbo seem to have no problem, Netflix gives me an error every time. So I googled the problem and it tells me Netflix doesn’t support airplay anymore. Why is this even a thing, smart tv apps are junk and thanks to Netflix no longer updating their app on my tv it causes it to freeze and skip. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lni401/netflix_airplay_is_apparently_discontinued_on/"
    },
    {
        "id": "1ln78k8",
        "author": "Comprehensive-Way482",
        "title": "'Squid Game' Creator Reveals Why Original Ending Was Scrapped",
        "content": "",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ln78k8/squid_game_creator_reveals_why_original_ending/"
    },
    {
        "id": "1lngbcq",
        "author": "rockcity1019",
        "title": "Netflix previous live playing from start mid replay (android)",
        "content": "I have been having issues for some time now watching WWE, where I end up having each show restart mid replay, it could be 30, 44, 120min in, but at some point the broadcast will start from the beginning again and it's only been happening for about a month now, even though the remaining time is showing as not being at the start of the timeline. Reinstalling the app doesn't seem to work and clearing all data doesn't do anything either.\n\nIt's stopping me from watching multiple segments, as it just replays the opening segment again. This is on android. Has anyone else encountered this?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lngbcq/netflix_previous_live_playing_from_start_mid/"
    },
    {
        "id": "1lmozcm",
        "author": "Batrah",
        "title": "Are the english people in season 3 of squid game dubbed?",
        "content": "\n\nIt's really hard to listen to the vip people speaking. It's sounds so.. forced, dubbed or whatever and bad acting\n\nThe asian woman speaking english sounds the worst. Like the way she speaks doesn't fit her\n\nAm i the only one?",
        "upvotes": 74,
        "comments": 67,
        "media": null,
        "permalink": "/r/netflix/comments/1lmozcm/are_the_english_people_in_season_3_of_squid_game/"
    },
    {
        "id": "1lne67u",
        "author": "GalaxyOpal56",
        "title": "Why does the official scene for Your Idol from Kpop Demon Hunters on Youtube sound different from the movie?",
        "content": "Title. I noticed after seeing a few clips and thought itd be better after the official ones were released, but no. The biggest parts where I see it is the background 'rely on' when Jinu is singing \"i can be the star you rely on\" being much louder on youtube, and the other saja boys sound different during the bridge with the \"living in your mind now\" part. It also feels oddly like for youtube they made the instrumental a bit more quiet. Has anyone else noticed this? If not please compare it to when you actually see the scene in the movie or to the sountrack version!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lne67u/why_does_the_official_scene_for_your_idol_from/"
    },
    {
        "id": "1lncfeb",
        "author": "Pure-Hat1807",
        "title": "Gi hun's tragic life.( SQUID GAME)",
        "content": "He grew up poor, grew up to be a failure. His father left. His wife left him because he was poor. His daughter was separated from him. He did everything to stop it but failed. His mother di*d because he had no money to pay for her treatment. He saw his friends di*d one by one. His bsf sangwoo di*d in his arms. He had to lie to his mother and saw that she still hoped for him to show up. He was going to see his daughter but stopped. He wanted to stop these sick games. He gave up his only chance to see his daughter for the lives of other innocent people. He spent years looking for the salesman, depressed with no hope. He only used the money to find him because he considered the money filthy money. Later when the salesman died he joined the games once again. But to stop it. There he saw other hopeless souls having no idea what to happen again. He tried to warn everyone buy they made fun of him. Still he didn't give up..he saved many ppl I'm the first game. Later he tried to raise up a rebellion but it failed and because of him many innocent ppl di*d including his bsf jung bae. He was de*d from within with little hope to live. However he pushed thru. He saw player 222 die despite the fact the he tried to save her. The only thing left wad her baby and the promise that gi hun made to protect her. Later he found out the front man's true identity but still didn't ki*l him and he was given a chance to kill all other players with unfair means but he hesitated because he still chose humanity. He had every right to be villian but chose humanity. He was like the front man. They both lost everything but one toom revenge from the world and the other stopped other players from experiencing it. He bravely fought of 3 players in the last game and fought player 333( the baby's father) and ki**ed him. In the end, he sacrificed himself for the baby, keeping his promise. \"We are not horses. We are humans. And humans are.......\". He came as a failure and di*d",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lncfeb/gi_huns_tragic_life_squid_game/"
    },
    {
        "id": "1ln6alr",
        "author": "SheCravesAldo",
        "title": "Nothing compares to Culinary Class Wars",
        "content": "I love cooking shows, as well as anything competitive wise, but I have yet to find any cooking competition show that comes even CLOSE to the greatness of Culinary Class Wars. It’s strictly cooking unlike something like Hells Kitchen where they have IRL B-list segments, however, everyone is so unique that it doesn’t need something like that to diversify characters. Judges are so insightful too and give great criticism and it helps me feel more connected to them. I wish there was a second season but I also would like recommendations for anything like it. It’s left a void that can’t be filled 🙏🙏",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ln6alr/nothing_compares_to_culinary_class_wars/"
    },
    {
        "id": "1lmll04",
        "author": "adobongmelk",
        "title": "What did you think about Squid Game Season 3?",
        "content": "I think it was a little bit rushed. I hated it when they killed off my favorite character, lol.  (It was expected anyway but still) The new games were awesomeee. I also hated the VIP's acting, they sound AI.",
        "upvotes": 34,
        "comments": 87,
        "media": null,
        "permalink": "/r/netflix/comments/1lmll04/what_did_you_think_about_squid_game_season_3/"
    },
    {
        "id": "1lmzu3y",
        "author": "Saltysuzy21",
        "title": "The Kraven movie was such a let down",
        "content": "I’m a marvel movie fan at heart- watched almost every movie and even red some of the comics so whenever marvel decides to release a new movie I have expectations- not to say every movie is gonna be a hit but fairly decent. This however was just not it. The acting was off. Why would you have American people with heavy American accents act as Russian boys? What is the deal with the female side character? Her acting was so rigid I cringed whenever she was on screen. The LINES good lord who wrote the script? There were so many unnecessary scenes- the flash back wasn’t even a proper flashback. Like why did they tell us SO MANY times that the brother was the child of a mistress as if we couldn’t grasp it the first time??? Like the male lead- I can tell he’s a decent actor but his cringy lines make his acting seem lacklustre. Everything was predictable. This felt like a waste of time, money and effort (that is if we can find the effort in question) so nope I did not like this one marvel. -1/10",
        "upvotes": 3,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1lmzu3y/the_kraven_movie_was_such_a_let_down/"
    },
    {
        "id": "1ln619w",
        "author": "ImnotAyu",
        "title": "Changing email",
        "content": "I’m trying to change my email on my Netflix account (my current one is super embarrassing) and it’s not allowing me. I used the email I want to change it to, to make an account but never paid for a plan. I’m trying to delete the account with the email I want to use but since I haven’t finished signing up aka bought a plan it won’t let me delete it.. help😭",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ln619w/changing_email/"
    },
    {
        "id": "1ln1kky",
        "author": "Peahaterlol",
        "title": "Sound mixing in k-pop demon hunters was a bit off",
        "content": "Im no expert but when i was watching the new kpop demon hunters movie on Netflix i found myself thinking the sound was very imbalanced, especially with Zoey at many points in the movie. Im not sure if i was delusional but i thought at many parts she sounded much louder than the other girls and often during their normal dialogue some characters would sound a lot louder than others. \n\nI remember it being really obvious to me rewatching the how its done video on YouTube but now it seems like its been fixed on that video. \n\nIm just wondering if anyone else noticed it, i still absolutely loved the movie and a little sound mishap of course wouldn’t make me get all dramatic. I’m just wondering if it was even a thing to begin with or if i was just looking too deep into it?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ln1kky/sound_mixing_in_kpop_demon_hunters_was_a_bit_off/"
    },
    {
        "id": "1lmv2ic",
        "author": "bookgirl2000",
        "title": "wth is going on in Olympo??",
        "content": "I am watching the new show Olympo right now but I am so confused about what is going on? Like, with Nuriá, how is she being kept at the Olympo facility and also sneaking back into the HPC to train? How did Roqué's hand grow from months of recovery to being fine? I am also confused about what Olympo is doing (isn't it just a clothing brand?) and it has been...interesting...to watch Amaia fall off the deep end. I could probably watch the rest and figure it out, but I can't follow the storyline at all and so I don't think that's the course of action for me. If someone has finished the show already, can you spoil it for me so I can actually understand? Thanks! :)",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lmv2ic/wth_is_going_on_in_olympo/"
    },
    {
        "id": "1lnejf3",
        "author": "IrishStarUS",
        "title": "Netflix viewers say 'excellent' thriller is 'an absolute must watch'",
        "content": "",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lnejf3/netflix_viewers_say_excellent_thriller_is_an/"
    },
    {
        "id": "1lnb9m8",
        "author": "Apprehensive-Bank636",
        "title": "Did Netflix ruin the momentum of David Fincher?",
        "content": "\nPost ‘The Social Network’ he should have been the top director in Hollywood, even better than Nolan.\n\nHe did Gone Girl which was great.\n\nBut he really lost the grip in last decade.\n\nHis projects have been Mindhunter, Mank, The Killer, upcoming Squid Game Series, that Brat Pitt Clint Sequel.\n\nThough they are not bad projects, it’s not at the scale of Dune or Odyssey.\n\nFincher belongs at the same level as Nolan and Denis, and he should be the one directing the social network sequel or the fight club sequel(based on its comics).\n\nI really feel Netflix ruined what that guy could have been. And even his next 5 years is dedicated to Netflix Projects.",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1lnb9m8/did_netflix_ruin_the_momentum_of_david_fincher/"
    },
    {
        "id": "1lm5vqj",
        "author": "Sudden_Pop_2279",
        "title": "Squid Game season 3 made me feel like I wasted so much of my life",
        "content": "Where... do we even begin. At this rate, I would've preferred if Gi-hun just got on that plane in season 1's ending. I find it insane the cast all agreed this was the best possible ending.\n\nSo many characters wasted and built-up for nothing.\n\nJun-ho? He's a terrible Dora the Explorer. All this searching for the island across 2 seasons, WASTED. He doesn't even TALK to his brother. How in the hell is him just being sent the baby and money a satisfying conclusion for his character?\n\nDae-ho is another example. All this mystery of whether he's a fake marine or lying. It seems like he has an abusive dad, always changing the subject whenever he's brought up. You think we're going to get some story of him being traumatized right? NOPE! He's literally just a fake marine, he goes crazy and then he dies, murdered by Gi-hun.\n\nThe mother and son were an exact copy of the wife and husband. Grandma gives the inspiring speech... and then just kills herself.\n\nThe season is described as \"forgiveness\" by Lee Jung-jae. What forgiveness? I didn't see ANY of that.\n\nAnd MG Coin? This season basically just proved Thanos was right. Throughout the first 5 episodes, he's a genuinely well-written morally gray character... and then the finale throws it ALL out the window in lightning speed. He goes from protecting Gi-hun and the baby to suddenly trying to murder both. Right after asking if the baby is okay.\n\nThe writer/director claims he wasn't supposed to be a one dimensional villain but rather make \"human/realistic decisions\" but NONE of that was it. He just turned cartoonishly evil in the blink of an eye. A worse Sang-woo, at least his turn was gradual.\n\nAnd the ending doesn't even feel like a proper conclusion, just a set-up for the sequel's. I don't even need to get into the VIP's.",
        "upvotes": 137,
        "comments": 134,
        "media": null,
        "permalink": "/r/netflix/comments/1lm5vqj/squid_game_season_3_made_me_feel_like_i_wasted_so/"
    },
    {
        "id": "1ln0doc",
        "author": "Aryy2211",
        "title": "Rumi from K-pop Demon Hunters as a Villain",
        "content": "Am I the only one that thought Rumi had the potential to become a villain? \n\nWhen she goes to where Celine is, after her friends saw the patterns, she says something kinda like this “If this is the Honmoon I have to protect, I would gladly see it destroyed” (paraphrasing) and when she said that, I immediately thought that she was going to somehow work with Gwi-ma 😭\n\nOr not work with him, but more likely do something against all the ideals she had as a demon hunter. Something not precisely correct according to Mira, Zoey and Celine.\n\nI don’t know what it could be, or how, I’m terrible at making theories and all that stuff, but yknow what I mean.\n\nI just think that if they had made her a villain, the story would’ve been SO interesting, and something completely different from all the other animated PG movies. We could easily see that in adults movies/shows, but I don’t recall ever seeing the main character become a villain in a kids movie, correct me if I’m wrong.\n\nAnd it wouldn’t be out of nowhere, she had all the reasons to be one.\n\n- Rumi feeling like no one would accept her and truly love her because of her patterns, since that’s what Celine made her believe her whole life, just in a more roundabout way.\n\n- Her feeling like she could never be a worthy demon hunter until her patterns were gone\n\n- The fact that she worked so hard to get rid of all demons, and her own patterns, but her friends still raised their weapons against her\n\nIt’s like even with all her efforts, nothing she ever did was enough for the people that surrounded her, and even for herself.\n\nIf you have something more deep to add that I probably didn’t have in mind, I would love to read it, and please tell me I’m not the only one! ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ln0doc/rumi_from_kpop_demon_hunters_as_a_villain/"
    },
    {
        "id": "1ln0a15",
        "author": "lil4cwine",
        "title": "Issue with logging in",
        "content": "Hello everybody! I am having this issue for months where netflix doesnt let me log in from my laptop even tho i am logged in on my phone and TV! I have tried clearing cookies and data,updating chrome. I also cant log in through a code or email because it says ‘it doesnt exist’ even tho it exists and works on my devices. If anyone can help please let me know! 🥲",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ln0a15/issue_with_logging_in/"
    },
    {
        "id": "1ln9b6d",
        "author": "Either-Medicine9217",
        "title": "Kpop Demon Hunters love interest ain't crap",
        "content": "I stand by that statement. What he did to his &gt;!Mom and sister!&lt; is sorry as all get out,and you can take that redemption arc and shove it so far up your pretty boy rear it comes out your nose! Then his whole goal is selfish and pathetic. I mean &gt;!he wants to make the voices stop!&lt;? Nah. He deserves to feel the consequences of his actions. His &gt;!family was relying on him, and not only did he abandon them, but he ain't even got the stones to accept his guilt and bear it like he should!&lt;",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ln9b6d/kpop_demon_hunters_love_interest_aint_crap/"
    },
    {
        "id": "1ln6q3b",
        "author": "That-Plane3629",
        "title": "My opinion S3 of Squid Game",
        "content": "The season seemed boring to me from the first minute, I don't know why, I made it so excited and expectant and just when I put it on it bored me, that's how the whole series continued\nThe only positive thing for me were the games, which I found entertaining, or at least, they kept you constantly tense.\nThe end of Gi-hun left me with a huge void and a great depression, I didn't like it, but what I liked least was the end of the series from when they found the island to the cameo with that famous actress whose name I don't remember (with all due respect) \nI felt that it had nothing to do with the essence of the series how they approached the ending, it could have been approached in a thousand other ways, it is as if they had taken me out of the climate I was in to put me in another series\nWhat do you think about all this?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ln6q3b/my_opinion_s3_of_squid_game/"
    },
    {
        "id": "1lmu4fi",
        "author": "These_Landscape4073",
        "title": "Does Netflix wipe your saved payment methods if your account was stolen?",
        "content": "So for context on this question: My account was stolen, email and password was changed, so when I tried to sign in like normal my account was basically nonexistent. When I called Netflix's support line they told me my PayPal (that I had used to pay for a subscription) was associated to a different account, and they were quick to cancel the subscription as well as refund a charge that was made to it (the person who stole my account had upgraded the plan when I had it to the basic plan).\n\nSo, the question is: When Netflix cancels a subscription off a stolen account, is that payment option the person used completely wiped from their account too? I ask cuz I took the security measures needed so that no unwanted future payments go through (changing my PayPal password, adding 2FA, unlinking Netflix from my subscriptions/automatic payment page).",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lmu4fi/does_netflix_wipe_your_saved_payment_methods_if/"
    },
    {
        "id": "1lmd42f",
        "author": "pxydustdreamz",
        "title": "What happened?!",
        "content": "This update is absolutely atrocious. Not user friendly, and there’s only ONE show in “continuing watching”???? And where the hell is The Office?!!! I didn’t see any warnings about shows being removed. Did I miss something?",
        "upvotes": 13,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lmd42f/what_happened/"
    },
    {
        "id": "1lmj77b",
        "author": "UncloudedLensPH",
        "title": "Squid Game's Ending was Bleak—and Brilliant",
        "content": "I understand why people did not like the final season. It was anti-climactic, the characterizations felt off, and there was no *big* showdown. Ironically, I think these are exactly what made the ending exceptional. It didn't appeal to hopes or expectations, and instead, we were given a bleak conclusion, which aligns with the main theme of the show—oppression. No matter how righteous your intentions are, like Gi-hun, you cannot defeat a powerful entity with bare fists. He was *extremely* lucky, but he had no chance of defeating The Frontman. In the end, the powerful entity wins.\n\nMost did not like how certain characters were killed off early and the shifts in their behavior. But that's the point. The entire game was a matter of life or death, and it shouldn't be any wonder why people change from it. Hyun-ju and Jun-jee were likeable characters—we rooted for them. But oppression makes no exceptions.\n\nGeum-ja's suicide was no doubt a shock—many criticized it for being an act she would never do. But is that really the case? We witnessed her kill her own son. In season 2, she once said that if her son died, she would lose any reason for living. Sure, she had Jun-hee and her baby to care for, but try to think of her headspace. Her son was a loser. She witnessed him grow up wallowing in self-hatred after continuously being trampled on by everyone in his vicinity, to the point that he nearly killed himself. Now, how could a mother continue living after bearing that kind of burden? It's through oppression and self-preservation that her son was forced into trying to kill Jun-hee, and it was also its influence that made Geum-ja kill her son. Once again, oppression took victory.\n\nAnother thing that fans criticized was Dae-ho's transformation into an antagonist—many said that it did not fit his character. However, it makes sense. Dae-ho may have appeared enthusiastic, prideful, or \"tough,\" but in reality he was a coward, and oppression only worsened his state. An oppressive entity destroys a person's determination. Resilience is something you cannot easily obtain—this is especially true in the case of Dae-ho. Witnessing hundreds of people die and knowing that you *may* be next won't always be enough to make you stand up courageously. A coward like Dae-ho had no heart to be a hero, so in the end, he failed to assist them in their revolt and dropped all the blame on Gi-hun.\n\nSomething I found jarring this season is the lack of dialogue, especially on Gi-hun's part, but I think that's intentional. Last season, we anticipated him to be the hero to save the day. When his plans failed, that's when everything sunk in. Oppression to such a large degree as this fails to empower. Not only does it make a person physically unable to stand up and fight but also fail to speak up. His silence was a sign of defeat.\n\n*\"We are not horses. We are humans. And humans are...\"*\n\nHe did not get to finish his sentence. Most of us might have expected a powerful speech filled with emotion. But even before he jumped off to meet his demise, his feelings were already killed. There was nothing else to say. It was pointless.\n\nThe players saw the cruel aspects of humanity. No-eul, a soldier, saw its compassionate side. She was a North Korean refugee—she had lived through cruelty, and being a soldier in these games, she witnessed humanity at its worst. However, a part of her still had an inch of mercy and made the effort to save Gyeong-seok, the father of Na-yeon, a young cancer patient. After successfully fulfilling her plans and discovering that her daughter had \"died,\" she was about to shoot herself. But seeing Gi-hun sacrifice his life to save the baby changed her decision. When she met the father months later, she discovered that people donated for his daughter's treatment, showing humanity's empathetic side. Later on, the broker she spoke to last season eventually helped her track down her daughter. As grim as the themes are about society, you can't disregard its strengths, and the series showed that side in these instances—ironically from the perspective of one of the guards.\n\nFinally, everyone expected one big fight between Jun-ho and his brother. But that never came, and when he did meet his brother, he barely did anything. His lack of action is due to the fact that he was an outsider. Gi-hun returned because he experienced the oppression, and it inspired in him a sense of justice—that's why he planned the revolt. Jun-ho never knew its entirety. The main motive why he put so much effort into finding the island in the first place was to see his brother and know why he joined. When he finally got the chance to see him, he begged desperately. I think at this point he realized the futility in what he was doing—his brother was in too deep. There was also no use fighting him—that's not what he was there for.\n\nThis final season had its flaws, but it tied everything together surprisingly well—in a way that didn't give in to clichés. It was unpredictable and painfully bleak, which complemented the message. Most of us might have the optimistic notion of oppression as a requisite to justice—too often, media portrays oppression as a force that can be toppled through righteousness. But in reality, there will be instances when it's the complete opposite.",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1lmj77b/squid_games_ending_was_bleakand_brilliant/"
    }
]