[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 500,
        "comments": 273,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 19,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jl584x",
        "author": "Halloween_Nyx",
        "title": "Adolescence, a quote from the show I haven’t seen discussed yet really hit me",
        "content": "When the father is discussing with his wife how he saw some awful manosphere videos online because he was just trying to look up a workout video. \n\nThis was such a hard hitting line for me that could go by unnoticed. It is so easy to fall into that pipeline without any intentions of actually looking up people like Andrew Tate. As someone is constantly in the gym and looking up workout and diet recommendations on YouTube, I will almost always run into those kinds of videos and I just ignore them. \n\nSo many friends or fellow gym bros have shifted their attitude into this alpha male, high quality man, Andrew Tate style aggressiveness from YouTube and social media feeding them these influencers when originally all they were doing was looking up workout videos. \n\nIt’s incredibly concerning how easy it is and I feel for anyone trying to get into fitness and having to deal with this. Just understand there are normal fitness influencers out there that are not this way. ",
        "upvotes": 38,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1jl584x/adolescence_a_quote_from_the_show_i_havent_seen/"
    },
    {
        "id": "1jl25mi",
        "author": "RevolutionaryRip2504",
        "title": "the show adolescence isn't saying men=bad",
        "content": "I've seen a lot of men on different subs arguing about how the new show Adolescence with Owen Cooper is anti-male. However, I think this is very false. \n\nJamie (played by Owen Cooper) does not become evil overnight; he became this way due to loneliness, suppressing emotions, and exposure to harmful online communities. There are many times in the show where I sympathized with Jamie, given that he is just a 13-year-old boy. I think that societal expectations regarding men showing their emotions led Jamie to struggle with emotional repression, which caused him to lash out when he was rejected. And before you say \"he was bullied\", I don't think he was. Jamie asked Katie out when he knew she would be vulnerable, and then she just called him out on it. As someone who was bullied as a kid, bullying is more repetitive. from the show, It just seemed like she had \"bullied\" him this one time. The show more urges people to create better support systems for young men so they learn how to manage their emotions rather than just saying men are bad. \n\nBasically, the moral of the story is to make sure that you are teaching your boys how to show their emotions in a healthy way, ask for help, and learn how to handle rejection. I think this show did an excellent job examining how online spaces can radicalize young boys and how its important to understand the challenges they face like internalizing emotions.",
        "upvotes": 49,
        "comments": 77,
        "media": null,
        "permalink": "/r/netflix/comments/1jl25mi/the_show_adolescence_isnt_saying_menbad/"
    },
    {
        "id": "1jkwa8x",
        "author": "OccasionAmbitious449",
        "title": "Adolescence: It's OK to not like something",
        "content": "I feel like I've had to make this post because even though I thought Adolescence was OK, I didn't think it was great. The supporters of this show have become SO hateful online it's ridiculous!\n\nPeople are saying \"It's a masterpiece\", \"This will be studied in Media classes\", \"This show was eye-opening and life-changing\" and that's FINE! You know why? Because everybody is entitled to an opinion!\n\nTikTok, X, Facebook, Reddit, everywhere I leave my opinion saying \"I thought it was alright, pretty good, I probably wouldn't watch again though\" I get people saying...\n\n\"You obviously didn't get it 🙄 \"\n\"You must have a low IQ, this is only for deep thinkers to watch\"\n\"Sorry that TikTok has rotted you're brain and you can't go more than 5 mins without getting bored\"\n\"You're part of the problem with society\"\n\"We found the Andrew Tate supporter who hates women!!!\" (I'm gay lol)\n\nMy point is that it's OK to not be a big fan of a fictional TV show lol Everybody has an opinion. But it just seems like fans of this show are actively going out of their way to be rude and aggressive towards those who weren't big fans of the show.\n\nI can understand the obvious hate towards those who are wearing tin foil hats or who are actual Andrew Tate supporters, but what is the deal with getting angry with a random person who just didn't like it? Lol\n\nI know it explores sensitive topics but people really need to chill out over this show. One of the key messages was how we behave online and some of the fans are completely contradicting that message imho. They're being SO hateful towards people who have a different opinion. \n\nRant over, thank you for coming to my Ted Talk. ",
        "upvotes": 93,
        "comments": 199,
        "media": null,
        "permalink": "/r/netflix/comments/1jkwa8x/adolescence_its_ok_to_not_like_something/"
    },
    {
        "id": "1jl1t7x",
        "author": "Blue-Sea2255",
        "title": "Con Mum (2025)",
        "content": "This documentary feels like an email I’d normally find in my spam folder, but squared twenty times. Yet, someone clicked on it knowingly because they were at the weakest point in their life.\n\nWhat’s truly disturbing is that there are no criminal charges. Why is this being silently allowed?\n\nI hope those who went into debt because of this scam receive some compensation from this documentary.\n\nA few lessons:\n\n1. Don’t share everything about yourself online.\n2. Trust, but always verify.\n3. Avoid checking your spam folder or messages from unknown people when you're emotionally vulnerable, drunk, or seeking connection.\n4. Never accept free money or free gift from anyone (nothing comes free).",
        "upvotes": 10,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jl1t7x/con_mum_2025/"
    },
    {
        "id": "1jl5lav",
        "author": "Tamasi18",
        "title": "Adolescence",
        "content": "Watching #Adolescence is an emotional wrecking ball. It will break you—as a parent, as a human—leaving you raw, vulnerable, and questioning everything. But some stories are worth breaking for.",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jl5lav/adolescence/"
    },
    {
        "id": "1jkwlm4",
        "author": "DorothyMortimer",
        "title": "I love The Residence!",
        "content": "Don’t worry, no spoilers! I just want to shout from the rooftops about how much I love Uzo Aduba and The Residence. I knew it was a Shonda show going in, so was expecting excellence, and guess what? I was not disappointed ❤️ I love it, binged it all, and highly recommend it. Done!",
        "upvotes": 32,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1jkwlm4/i_love_the_residence/"
    },
    {
        "id": "1jl359j",
        "author": "Junior_Apartment6388",
        "title": "They put up pictures of Stephen Graham’s real family to make the final Adolescence scene even more emotional 😢",
        "content": "",
        "upvotes": 7,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jl359j/they_put_up_pictures_of_stephen_grahams_real/"
    },
    {
        "id": "1jl7o5n",
        "author": "pokerfacefan",
        "title": "Is it possible for an extra member to be in another country?",
        "content": "Just a quick question. I’m in Canada and my girlfriend is in the Philippines. And I really wanna watch this show with her, but she doesn’t have Netflix herself. Is it possible for me to make her an extra non-household member of my account? Or are extra members restricted to only being from the same country as me? ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jl7o5n/is_it_possible_for_an_extra_member_to_be_in/"
    },
    {
        "id": "1jkiost",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix Orders Live-Action Scooby-Doo Origin Series",
        "content": "",
        "upvotes": 60,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1jkiost/netflix_orders_liveaction_scoobydoo_origin_series/"
    },
    {
        "id": "1jl7tfc",
        "author": "MysteriousDelay6266",
        "title": "Ransom Canyon | Official Trailer | Netflix | APRIL 17",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jl7tfc/ransom_canyon_official_trailer_netflix_april_17/"
    },
    {
        "id": "1jkydfb",
        "author": "Robemilak",
        "title": "Netflix Sets Korean Series ‘Scandals’ Starring Son Ye-jin, Ji Chang-wook &amp; Nana",
        "content": "",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jkydfb/netflix_sets_korean_series_scandals_starring_son/"
    },
    {
        "id": "1jkglwg",
        "author": "asurangonne",
        "title": "What would happen after the ending of Adolescence according to UK laws?",
        "content": "After bawling at the ending. (the aurora song was unfair too seriously)  \nI got curious to know what would happen to J after he pleads guilty?\n\nI googled and it seems for first degree murder, its life in prison for 15 and up, but J should be 13 when he committed the crime.\n\nIs he as good as dead to the millers? Because the ending really felt that way too in some sense.",
        "upvotes": 66,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1jkglwg/what_would_happen_after_the_ending_of_adolescence/"
    },
    {
        "id": "1jl6ib4",
        "author": "johnwatchingnetflix",
        "title": "My Top 3 Shows (2024)",
        "content": "These were my top 3 shows of 2024 (they weren’t released in 2024, it’s just the year I watched them)\n1) Atypical Family\n2) 7 Lives of Lea \n3) Welcome to the Family (Catalan version)\n\nNone of these shows are in English but they’re genuinely so good, PLEASE give them a chance!!! I especially recommend #2, I really need more people to watch that show.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jl6ib4/my_top_3_shows_2024/"
    },
    {
        "id": "1jl5brt",
        "author": "Gamesnic",
        "title": "Why is HDR content darker than SDR?",
        "content": "So I have an HDR 1440p monitor since a few months, and on Youtube it looks absolutely stunning when reaching those 1200 nits. It's just gorgeous.\n\nI just put my Netflix subscription to Premium to test out HDR, and when playing back an HDR show (it shows the HDR logo) then I can see it stream 1080p HDR content when looking at the CTRL Alt Shift D stats. However, as example Love, Death and Robots is literally darker with HDR than with SDR, and the highlights clip wayyy to early, like maybe at 150 nits. Why, what is Netflix doing to their HDR stuff?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jl5brt/why_is_hdr_content_darker_than_sdr/"
    },
    {
        "id": "1jl4j5i",
        "author": "Otherwise-Setting852",
        "title": "Adolescence is a must watch for anyone who can handle a slow burn",
        "content": "I’ve never been so captivated by a show as I have with Adolescence and this definitely has to do with how smooth it was shot in one take. Constantly keeping your attention.\n\nThis show really hit home because I grew up with a lot of terrible influences, bullies and also seeked validation from others or idolized someone. \n\nNot wanting to disappoint. The conditions of my life led me to believe I had to prove myself and be liked by others.\n\nI definitely cried on episode 4 because this finale really put everything in a neat bow tie. Everything was leading up to a breaking point and then it broke, but not into a disaster. Something more surreal and heartbreaking. This show is very very real. Amazing acting from everyone. And it portrayed the world we live in today perfectly. \n\nWe all try to hold our pain inside and a lot of us deal with the aftermath of others mistakes. People judge and mistreat you without knowing everything. But we will survive it!\n\nI hope it wins some awards. And the people who committed their time towards it understand that they did create a masterpiece.",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1jl4j5i/adolescence_is_a_must_watch_for_anyone_who_can/"
    },
    {
        "id": "1jl0il5",
        "author": "AstralKatOfficial",
        "title": "Error 5.8 constantly on mobile",
        "content": "Why does netflix constantly give me error 5.8 on mobile recently? This has never happened until around last week and now every time I open the app I get the 5.8 error until I restart my phone. The app is up to date. My phone is too. I have full bars and am perfectly connected to the wifi, everything else works. I should not have to restart my damn phone every time I want to watch a show late at night ot early morning. How do I get this error message to go away permenently?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jl0il5/error_58_constantly_on_mobile/"
    },
    {
        "id": "1jl2u4u",
        "author": "No-Job-7815",
        "title": "Terrible quality in certain scenes?",
        "content": "Hey, I'm currently watching The Walking Dead on Netflix and at times experience incredibly bad quality (like it goes from 4k to 480p or something). It just happens for a scene or two and goes back to normal. I have the highest 4k tier and my internet connection is 1Gb/s down.\n\nIs anybody else experiencing this? I wonder if the show is encoded that way on Netflix or what, but never had had on other shows (or at least didn't notice) and it's been happening the last few days that I watch the show both on an iPad and on my iMac.\n\nI just had that happen a moment ago and refreshed the page and still see it in that scene. Here's a still for reference:\n\nhttps://preview.redd.it/s16olt5v78re1.png?width=1771&amp;format=png&amp;auto=webp&amp;s=a73716cd5f9e63bac3b23f7282f5fb9eac837f36\n\nIs Netflix doing some shady stuff to save costs? This scene was quite dynamic with lots of moving content, but I mean we pay a lot of money for that shit.  \n\n\n  \n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jl2u4u/terrible_quality_in_certain_scenes/"
    },
    {
        "id": "1jl29az",
        "author": "Minute-Edge-5909",
        "title": "Legit DVDs?",
        "content": "I don't know if this is the right place to ask but this was the best place I could think of to ask something like this, so apologies in advance if not. For background info, I loved 'It's What's Inside' from last year (it was actually probably my favourite movie from 2024 tbh) and I knew it was most likely not gonna be on DVD but I wanted to do a quick search just in case and I found a bunch on eBay from different sellers, most of which are from China. I also know the movie was at Sundance before being acquired by Netflix so I was just wondering if it was at all possible that these were legit or if they are most likely bootlegs. Sorry if this is a dumb question, I don't have a lot of experience when it comes to these sorts of things so any expertise will help.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jl29az/legit_dvds/"
    },
    {
        "id": "1jktb8q",
        "author": "Wuellig",
        "title": "The Hot Spot",
        "content": "It seems like the whole rest of this season so far set up this latest episode to be hilarious from beginning to end. \n\n\nWe've been introduced to the characters one or two at a time, so by the time there's this ensemble on screen, the interpersonal dynamics just keep firing, not only with the dialogue, but the looks. \n\n\nI enjoy the contrast of the extraordinary circumstances with the relatively mundane but caring friendship.The way this whole episode played out was a lot of fun, and I'm really looking forward to seeing what happens next.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jktb8q/the_hot_spot/"
    },
    {
        "id": "1jkvacv",
        "author": "hogswristwatch",
        "title": "Adolescence no surround in original english: just me?",
        "content": "Italian etc work fine, home theater shows 5.1 audio. The options also lists 5.1 for the descriptive English and it works fine. Why doesn't the orig8nal English have 5.1?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jkvacv/adolescence_no_surround_in_original_english_just/"
    },
    {
        "id": "1jkv95i",
        "author": "Severe_Pie_517",
        "title": "I’m looking for some recommendations.",
        "content": "I’m looking for a tv show that has sad depressing moments but like a rom-com also doesn’t have to be strictly Netflix but examples like Gilmore girls, “how I met your mother”, parenthood, “love”, “chuck”, Derek, after life is a good example also like I said chuck is a good example",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jkv95i/im_looking_for_some_recommendations/"
    },
    {
        "id": "1jkz5jq",
        "author": "Plane-Cloud-5837",
        "title": "Why Jamie wasn't in the last episode of Adolescence",
        "content": "",
        "upvotes": 0,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1jkz5jq/why_jamie_wasnt_in_the_last_episode_of_adolescence/"
    },
    {
        "id": "1jko9a6",
        "author": "Extrivio24",
        "title": "Shows appearing in different regions?",
        "content": "In my binge watching phase of Prison Break however I’ve noticed that I can watch Prison Break at work in Central London, but when I’m at home (outside of London) Prison Break gives me an error that’s it’s outside of my region? Is that really a thing where I can’t watch a show when I’m not in London?\n\nNot just Prison Break either - happens for a few shows and movies.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jko9a6/shows_appearing_in_different_regions/"
    },
    {
        "id": "1jkn81b",
        "author": "tinuz84",
        "title": "Move extra member profile back to main account?",
        "content": "So I recently added the “extra member” option to my account, and moved my friends profile to that extra member seat. We quickly found out that with a “extra member” account you can’t add a Kids profile to it, which my friend needs for her family. \n\nI want to move her profile to my main account, so I can later move that profile to my friends full account which she is going to make in nearby future. In the account settings I have the option to remove the “extra member” with my friends profile attached to it, but I don’t see how I can move the profile back to my main account. Does anyone know if that is even possible? Or is this profile forever locked a “extra member” seat in my account?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jkn81b/move_extra_member_profile_back_to_main_account/"
    },
    {
        "id": "1jjjsmn",
        "author": "Somethingman_121224",
        "title": "'Adolescence' Becomes First-Ever Streaming Show to Top British T.V. Ratings",
        "content": "",
        "upvotes": 431,
        "comments": 104,
        "media": null,
        "permalink": "/r/netflix/comments/1jjjsmn/adolescence_becomes_firstever_streaming_show_to/"
    },
    {
        "id": "1jk3yr3",
        "author": "greasypancakes69",
        "title": "Adolescence - How was Jamie created?",
        "content": "I’ve been going through the subreddit and I’m seeing a lot of comments about how the problem isn’t psychological but rather sociological, whereas my take is that it’s an intersection between the two…\n\nKindly share your thoughts and opinions, but to me it seems obvious that this kid has traits/behaviours that line up so well with Antisocial Personality Disorder, and I say this as someone who has both extensively studied and had very close people to me with this disorder. If anything I tried to find signs that contradicted my original analysis and I really couldn’t find many.\n\nThe entire third episode characterised it so well, down to the body language of the psychologist as she was trying to make her assessment of him. Then the fourth episode gave a lot of context as to how he was raised – negligent parents, *possibly* a narcissistic father – on top of the bullying and rampant insecurities, I could go on…\n\nFor those who work in mental health and related fields, themselves have ASPD or have experiences with people who do… Like am I off base here?",
        "upvotes": 23,
        "comments": 91,
        "media": null,
        "permalink": "/r/netflix/comments/1jk3yr3/adolescence_how_was_jamie_created/"
    },
    {
        "id": "1jkut5f",
        "author": "Internal-Bed-3150",
        "title": "The Witcher finishes filming (the first leg of) its final season",
        "content": "",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jkut5f/the_witcher_finishes_filming_the_first_leg_of_its/"
    },
    {
        "id": "1jkx6da",
        "author": "lyfe_Wast3d",
        "title": "Dear Netflix thank you for daredevil",
        "content": "I've seen all the episodes and loved it from the start. My girlfriend however hasn't we recently started watching the new daredevil on Disney and I wasn't feeling it and I didn't know why. Then we started to watch the first season. Let's just say gf understands why daredevil is actually cool now. ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1jkx6da/dear_netflix_thank_you_for_daredevil/"
    },
    {
        "id": "1jk3ahd",
        "author": "__SummerSky",
        "title": "Has anyone watched Con Mum?",
        "content": "I thought it was a pretty interesting documentary! I feel so sorry for Graham and how he found out who his mom really was and how it destroyed all aspects of his life.\n\nWhat are your thoughts?",
        "upvotes": 25,
        "comments": 58,
        "media": null,
        "permalink": "/r/netflix/comments/1jk3ahd/has_anyone_watched_con_mum/"
    },
    {
        "id": "1jk7jg7",
        "author": "DCorvid_Art",
        "title": "Is Wolf King any good?",
        "content": "So I remember a fair bit of hype when it was first announced then nothing for years. It's been out for like 5 days now and I haven't seen a single person talk about it and my twitter is 99.5% animation stuff.\nSome 19 year old swede made a 13 second animatic and I heard about it the next day, Wolf King came out and literally nobody is talking about it. Is it bad? Is it good?",
        "upvotes": 10,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1jk7jg7/is_wolf_king_any_good/"
    }
]