[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 14,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 52,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1l1kjs3",
        "author": "Top-Ring9619",
        "title": "Is it just me or….?",
        "content": "",
        "upvotes": 181,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1l1kjs3/is_it_just_me_or/"
    },
    {
        "id": "1l1fz1e",
        "author": "Wyldstallyn80",
        "title": "Dept Q",
        "content": "Watched this over the weekend, really enjoyed it. Thought the relationships between all the main characters were very well written and acted. Now I’m just looking forward to the 3 year wait for the next season. ",
        "upvotes": 153,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1l1fz1e/dept_q/"
    },
    {
        "id": "1l1wxot",
        "author": "WindowsXP-Jackson",
        "title": "So many ads",
        "content": "Why am I getting so many ads, I think I’m getting more than YouTube atp, I have had to watch a minute of ads before, halfway through, and at the end of a 20 minute episode, i understand they where going to give us a *couple* ads but atp you might as well watch normal tv 😭",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l1wxot/so_many_ads/"
    },
    {
        "id": "1l1w14d",
        "author": "sbingle73",
        "title": "The OA",
        "content": "Is it worth watching? I started watching the first season because I’ve heard it’s good but also that it got cancelled. Not sure I want to invest my time. Does it at least end in a place where some of the plot lines are resolved?\n",
        "upvotes": 2,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1l1w14d/the_oa/"
    },
    {
        "id": "1l18gq3",
        "author": "Top-Three-USA",
        "title": "Kristen Bell and Adam Brody return in Nobody Wants This Season 2, premiering October 23, 2025, on Netflix with new guest stars and fresh storylines",
        "content": "",
        "upvotes": 24,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l18gq3/kristen_bell_and_adam_brody_return_in_nobody/"
    },
    {
        "id": "1l0umzr",
        "author": "geniebythesea",
        "title": "Looking for a “Limited Series” show to watch. What’s your favourite?",
        "content": "As the title suggests, I’m looking to make a list of limited series shows to watch. Generally I like most genres, but specifically enjoy British crime shows/mystery, true story events, a little bit of sci fi (Severance and The OA are as far into that genre I go). A list of the shows I’ve seen and I’m looking more of is below - some of these might not be Netflix I’m not sure. \n\nEdit edit: I started watching Dept Q last night. So far it’s exactly what I was looking for. I’ve made a list of other shows to watch as well. Thank you all for your suggestions. \n\n- Broadchurch\n- Unbelievable \n- Unorthodox \n- Queens Gambit\n- Maid\n- Bodyguard\n- Baby Reindeer\n- The Fall\n- Gracepoint \n- Toxic Town\n- Mare of Eastown\n- The Missing \n- Adolescence \n\nEdit to add a show:\n- Bad Sisters (not Netflix show - but I highly recommend)\n- Sirens\n- Residence ",
        "upvotes": 144,
        "comments": 356,
        "media": null,
        "permalink": "/r/netflix/comments/1l0umzr/looking_for_a_limited_series_show_to_watch_whats/"
    },
    {
        "id": "1l0t23z",
        "author": "Longjumping-Elk-7840",
        "title": "Is Dept Q worth watching ?",
        "content": "It's new and the review articals are giving mostly positive reviews, so is it really worth checking or not ? I love Mystery shows but recently I don't trust Netflix in this genre tbh. \n\n\n\n\n",
        "upvotes": 161,
        "comments": 258,
        "media": null,
        "permalink": "/r/netflix/comments/1l0t23z/is_dept_q_worth_watching/"
    },
    {
        "id": "1l159xn",
        "author": "NegativeParticular78",
        "title": "Sirens - S1Ep1",
        "content": "Glenn Howerton (Ethan) is 49 IRL, and Milly Alcock (Simone) is 25 IRL. Is this supposed to give me this much ick? I’m only a couple minutes in but I think he’s supposed to be a decade younger in the show? Still, gross. ",
        "upvotes": 31,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1l159xn/sirens_s1ep1/"
    },
    {
        "id": "1l1q5p3",
        "author": "indiewire",
        "title": "At Netflix, Documentaries Still Have a Home as Streamer Picks Up Six Features",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l1q5p3/at_netflix_documentaries_still_have_a_home_as/"
    },
    {
        "id": "1l1o1of",
        "author": "The_ZX",
        "title": "Sanctuary (sumo, 2023) updates?",
        "content": "So have we had any news at all about a new season of this amazing sumo show? I saw someone online say that some of the actors confirmed it but could not found anything about that anywhere. Only people speculating it might be in the works because the main actor kept his hair long...\n\nGuessing we are save to assume that netflix made another gem which they decided to throw away as quickly as possible?\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l1o1of/sanctuary_sumo_2023_updates/"
    },
    {
        "id": "1l1nuaq",
        "author": "cassendraa",
        "title": "Please help me",
        "content": "My Netflix account is not working video keeps loading I even tried downloading it but the video still not playing and then I login with my sister's acount and from her account everything is fine but when I login from my account the same problem is happening . Anyone knows what's going on?? [",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1l1nuaq/please_help_me/"
    },
    {
        "id": "1l1kzhc",
        "author": "SB_5259",
        "title": "Is there a way to get a netflix app on a macbook?",
        "content": "Its so frustrating that every apple device has a netflix app, but Macs do not. Before people scream \"just use the internet,\" I fly a lot for work, and you cannot use the internet in airplane mode. My iPhone, as well as my windows PC, has the app, where you can download a movie/show to watch while offline.\n\nI don't like watching media on my IPhone during flights, because the battery drains too quick, which means I have to take my large and heavy laptop with me on flights. Its annoying, and seems unnecessary.",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1l1kzhc/is_there_a_way_to_get_a_netflix_app_on_a_macbook/"
    },
    {
        "id": "1l1kgk9",
        "author": "Comprehensive-Way482",
        "title": "The 25 Best Shows on Netflix to Watch in June",
        "content": "We’ve all been overwhelmed by streaming TV choices, only to give up and watch something we’ve already seen. But this curated list of the best shows on Netflix is here to narrow down your decision-making and help you figure out exactly which titles you want to sample next.\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l1kgk9/the_25_best_shows_on_netflix_to_watch_in_june/"
    },
    {
        "id": "1l0z2jh",
        "author": "627UK",
        "title": "Dept Q - Martin",
        "content": "I think I've missed something in the 1st episode(s) &amp; it's driving me mad. \n\nWho's Martin? \n\nHe appears to live with Carl &amp; Jasper. He's not listed on IMDB or Google searches as a cast member - despite having a speaking role. ",
        "upvotes": 24,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1l0z2jh/dept_q_martin/"
    },
    {
        "id": "1l1iar7",
        "author": "shyman18",
        "title": "Full screen “flickering”",
        "content": "My screen has been flickering like this for the past few weeks. It only happens in full screen and only in netflix, not in other applications. I’ve already tried deleting and reinstalling but it  didn’t improve. Has anyone encountered this and knows how to fix it?",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6p1w27dvoi4f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1l1iar7/full_screen_flickering/"
    },
    {
        "id": "1l17apr",
        "author": "PositiveZucchini4",
        "title": "Animal Kingdom TV Show",
        "content": "They just put Animal Kingdom on Netflix in the US and I've never hit \"play episode\" SO fast 😂 a kid loses his mom to addiction, ends up living with the family the mom had kept him from for 11 yrs. For good reason, the matriarch is amazingly toxic and her 3 adult sons follow her lead.. if you like gritty family crime dramas, WATCH THIS SHOW. ",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1l17apr/animal_kingdom_tv_show/"
    },
    {
        "id": "1l1icfk",
        "author": "Adept-Court-4267",
        "title": "Junji Ito Maniac isn’t scary",
        "content": "Am I the only one who find this serie not scary at all, every “scary scene” like the one of the ice crème are always funny and absolutely crazy, does somebody agree?\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l1icfk/junji_ito_maniac_isnt_scary/"
    },
    {
        "id": "1l1aie8",
        "author": "MrCheeseyFries",
        "title": "Forced UI change on TV app?",
        "content": "Anyone else experience this? Yesterday it was the same experience I’ve been having. Today it’s some new UI that is very terrible that I can’t seem to undo. Customer service offered a bunch of BS solutions that make no sense for solving a UI change they pushed and there seems to be no setting to switch to classic. I’ve dealt with the constant price increases but this was the last straw and I cancelled my subscription. I’m not paying all this money for a shit experience that clearly had no user testing. ",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1l1aie8/forced_ui_change_on_tv_app/"
    },
    {
        "id": "1l17spd",
        "author": "Silent_Victory6730",
        "title": "Video quality issue",
        "content": "I watch Netflix on chrome and the quality is okay most of the time, never had any noticeable issues but i've been watching a new show and i guess its meant for 4K streaming but the quality from chrome is soo bad and very grainy, i can literally see the pixels on the screen. I feel like i'm watching on 480p. \n\nI tried using Edge and while the quality was so much better the website was really slow and the subtitles were delayed by at least a second and it made it frustrating to watch since it's also a non-english show.\n\nHow do you make netflix to stream on the highest quality if my settings are already set on the highest setting",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l17spd/video_quality_issue/"
    },
    {
        "id": "1l1d9dv",
        "author": "Responsible-Pen-3410",
        "title": "Need help",
        "content": "Can someone please suggest a good crime series to watch where crimes are solved in an episode or two. It can be of a single detective or a whole team and i have already watched the more popular ones like Elementary, Sherlock , Mentalist, Monk and many others. Any suggestions for the hidden gems are welcome. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l1d9dv/need_help/"
    },
    {
        "id": "1l0ssno",
        "author": "Mountain-Purple2907",
        "title": "Sirens: Devon the Narc/Free Simone",
        "content": "I don’t know who needs to hear this, but Devon was exhausting. Like truly insufferable. Every scene felt like a TED Talk no one asked for — dripping with self-righteousness, emotional manipulation, and smug therapist energy.\n\nShe didn’t help Simone out of love. She helped so she could own it. So she could parade around as the long-suffering savior. That wasn’t compassion. That was martyrdom weaponized.\n\nThe way she guilt-tripped, overstepped, and then had the audacity to call Simone “toxic”? Nah. She was the emotional vampire of the show — draining everyone with her need to be seen as “the good one.” And when Simone stopped giving her the validation she fed on, she suddenly flip-flopped from hating Michaela to loving her? Girl. That was jealousy, not healing.\n\nShe couldn’t handle not being the center of Simone’s emotional world. So she punished her. Classic narcissist behavior in a wellness cape.\n\nEven when she had a point, she was so smug about it that I found myself rooting against her just on principle. And that cruise? Please. She stayed behind with their dad just so she could get gold stars for suffering. It wasn’t selfless — it was performative.\n\nJustice for Simone. And prayers up for anyone who’s had to survive a Devon in real life.",
        "upvotes": 18,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1l0ssno/sirens_devon_the_narcfree_simone/"
    },
    {
        "id": "1l0buum",
        "author": "MovieFan0512",
        "title": "The 2025 'Tudum' Event is Horrifically Bad",
        "content": "I tuned in to watch the event and it looks like the teen choice awards but for Netflix. It would have been better and more to the point by just releasing trailers and previews of upcoming shows on social media and YouTube. Not a teenybopper concert and nonsense.",
        "upvotes": 298,
        "comments": 147,
        "media": null,
        "permalink": "/r/netflix/comments/1l0buum/the_2025_tudum_event_is_horrifically_bad/"
    },
    {
        "id": "1l0czo5",
        "author": "CosmosisJones42",
        "title": "TUDUM is the cringiest thing I have ever seen.",
        "content": "I decided to check it out to see some cool trailers. I've been watching for 10 minutes, and I am cringing at everything. The host, the writing, I get that award show jokes are usually lame, but my god, I am literally shocked about how bad this is. Who approved this?",
        "upvotes": 217,
        "comments": 71,
        "media": null,
        "permalink": "/r/netflix/comments/1l0czo5/tudum_is_the_cringiest_thing_i_have_ever_seen/"
    },
    {
        "id": "1l0wblx",
        "author": "Neo2199",
        "title": "'Stranger Things' Season 5 - Official Teaser - Volume 1: November 26 , Volume 2: December 25, Finale: December 31",
        "content": "",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l0wblx/stranger_things_season_5_official_teaser_volume_1/"
    },
    {
        "id": "1l0kn9h",
        "author": "DrMonocular",
        "title": "Kaos (CANCELLED?)",
        "content": "Netflix pumps out a lot garbage for many seasons, which would be fine if they didn't  also cancel the most interesting and well made shows. It is a dam travesty that they canceled Kaos. It is one of the best shows they have made. They need to sell it to HBO or something at least. I'm very disappointed. It is rare that I stop endlessly trying to find something good and binge a show like I did here. 2 days, binged Kaos. I was so damn invested. Canceled. Guess I will go back to watching 20 minutes and clicking off of all the garbage they seem to love spending money on. They fumbled the Witcher real hard as well. I hope to hell they don't snatch defeat from the jaws of victory with One Piece too. I do not have high hopes for netflix in the long term with such blind idiots pulling the strings. We need a petition to renew KAOS. Who is with me?",
        "upvotes": 36,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1l0kn9h/kaos_cancelled/"
    },
    {
        "id": "1l17t41",
        "author": "Fondant_Perfect",
        "title": "Any app providing Netflix India 4K OTT plans inclusive of other apps",
        "content": "Me and my friend are looking to buy a Netflix Plan 4K for INR 650 however we are skeptical if the plan will work in both devices, my friend lives 30 kms away from my house. I was also looking for any app like TATA Binge which can provide clubbed OTT apps.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l17t41/any_app_providing_netflix_india_4k_ott_plans/"
    },
    {
        "id": "1l1c4zy",
        "author": "killwish_",
        "title": "The Old Guard 2: Ready for More Immortal Action on Netflix?",
        "content": "\nHello fellow Netflix fanatics!\nJust saw the new promo for The Old Guard 2 dropping on July 2nd, and I'm absolutely hyped! The first movie was such a unique blend of action, sci-fi, and emotional depth, and I've been waiting for a sequel. The idea of immortal warriors navigating the modern world with such a compelling backstory really hooked me.\nFor those who loved the original, what are your thoughts on the sequel coming so soon? What are you most excited to see? New powers? Deeper dives into their pasts? More epic fight sequences?\nIf you haven't seen the first one, seriously, give it a watch! It's fantastic.\nCan't wait to hear your takes!\n\nu/killwish_\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l1c4zy/the_old_guard_2_ready_for_more_immortal_action_on/"
    },
    {
        "id": "1l0i61j",
        "author": "killwish_",
        "title": "Glitch: A Hidden Gem Worth Watching on Netflix?",
        "content": "\nHey r/Netflix,\nI just stumbled upon \"Glitch\" on Netflix and it looks pretty intriguing! It's a series about a police officer and a doctor who face an emotionally charged mystery when seven local residents inexplicably return from the dead in peak physical form.\nBefore I dive in, I wanted to get the community's thoughts. Has anyone watched this show? If so, what did you think? Is it worth the watch? No spoilers please!\nLooking forward to hearing your recommendations!\n\n–u/killwish_\n",
        "upvotes": 34,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1l0i61j/glitch_a_hidden_gem_worth_watching_on_netflix/"
    },
    {
        "id": "1l14zdh",
        "author": "Ares-Astle",
        "title": "Demon Slayer glitch?",
        "content": "Im having a weird issue, hopefully you all here can help me. I was watching Demon Slayer yesterday on my phone, on my profile. Today it won't show up, I have no viewing restrictions on my profile. I swapped to my wife's profile, on my account, on my phone and it pops right up. Any thoughts on why this is?\n\nThanks in advance",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l14zdh/demon_slayer_glitch/"
    },
    {
        "id": "1l1o4eo",
        "author": "Abdullahysc",
        "title": "من بعد إغلاق موقع سوب سين اضطريت اشترك في نتفلكس لمدة شهرين لكن وقفت بسبب المشاهد",
        "content": "كثرة المشاهد الإباحية مقزز والشذوذ يحشر حشر  مستحيل تكمل حلقة بدون تجل** \nلو في شركة تسوي اتفاقية مع نتفلكس ودزني وتختار المسلسلات المحترمة وتقصقص المشاهد الإباحية يوجد مسلسلات كثيرة ما فيها مشاهد أو فيها مشاهد قليلة يمكن قصقصتها دون التأثير على الحبكة الدرامية\nوتقدم كبديل محترم لنتفلكس ومكان تضيع فيه الوقت بدون ما تضر نفسك ب الإباحية ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l1o4eo/من_بعد_إغلاق_موقع_سوب_سين_اضطريت_اشترك_في_نتفلكس/"
    }
]