[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 494,
        "comments": 272,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 16,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jdh87u",
        "author": "yahooentertainment",
        "title": "The Terrifying Truth Behind Netflix’s ‘Adolescence’",
        "content": "**From The Wrap:**\n\nThe four-part Netflix series [“Adolescence”](https://thewrap.com/tag/adolescence/) is already making waves after its debut on Friday, with many wondering if the tale of a teen who has been accused of killing a female classmate is based on a true story.\n\nThe young boy, played by Owen Cooper, is quickly revealed to be guilty of the crime in the first episode, and the series begins a larger, steeper dive into incel culture and gender violence that has been promoted by influencers such as Andrew and Tristan Tate.\n\n“In the U.K., there’s a real problem with knife crime, certainly in the younger generation. There have been a series of of young boys who were killing young girls with knives, and it was really upsetting,” director Philip Barantini [told TheWrap](https://www.thewrap.com/adolescence-netflix-cast-creators-behind-the-scenes/) this month. “That was the seed that we wanted to explore, and send a bit of a message and maybe spark a bit of a conversation.”",
        "upvotes": 395,
        "comments": 86,
        "media": null,
        "permalink": "/r/netflix/comments/1jdh87u/the_terrifying_truth_behind_netflixs_adolescence/"
    },
    {
        "id": "1jdv0b6",
        "author": "gobsmacked247",
        "title": "I am only 20 minutes into Adolescence, episode one, and I already can’t breathe!!!!",
        "content": "This series is already breaking all the rules.  The acting and camera work is insane.  The story is making me want to scream.  I’m on the edge of my seat and I don’t even know why!!!",
        "upvotes": 42,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1jdv0b6/i_am_only_20_minutes_into_adolescence_episode_one/"
    },
    {
        "id": "1je3tto",
        "author": "Robemilak",
        "title": "Happy Gilmore 2 | Official Teaser Trailer | Netflix",
        "content": "",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1je3tto/happy_gilmore_2_official_teaser_trailer_netflix/"
    },
    {
        "id": "1jdaoaw",
        "author": "Afraid_Shape_1924",
        "title": "With Love, Meghan proves that no matter what you do people will find reasons to hate.",
        "content": "I would like to preface this by saying I’m no fan of Meghan (Sussex is it?). I did find her escapades during her stint with the royal family and after trying. \nBut the vitriol directed towards her in this show is excessive, inaccurate and unfair. \nThe show itself is charming. For those who say it’s “un-relatable” she never claimed to try to be. She’s doing her, and surprise, surprise she’s rich. Shocker. I don’t know how people are so offended by her choice of cookware, the fact that she has a large garden, time on her hands to harvest berries, and elaborate utensils when that’s literally her life. If you can’t relate have you considered that you’re not the target audience? I think it would be worlds more offensive if she tried showing people how to bargain hunt or use coupons to seem relatable when clearly that’s not her life. \n\nMeghan comes off as warm and genuine and you can tell the people in her life who she invites on genuinely care about her. The show is used to discuss their friendships and their lives and I don’t think it’s scripted to hype her up. The conversation goes both ways and it’s a show about connecting with people. \n\nShe clearly knows her food. It might not be to everyone’s taste but you can tell she derives genuine enjoyment out of food and preparing it. \nFolks mad that her recipes are not groundbreaking, guess what? None are. Even Pinterest regurgitates recipes that have been around for eons. She is just sharing what she likes. \n\nI think in the first episode she mentions that the kitchen she’s in is not hers, but there’s another main kitchen she cooks from for the majority of the show and that’s in her house, no? \n\nAnyway as much as I’ve never really liked the lady, the amount of vitriol she’s receiving for this show is unwarranted and unnecessary. ",
        "upvotes": 464,
        "comments": 505,
        "media": null,
        "permalink": "/r/netflix/comments/1jdaoaw/with_love_meghan_proves_that_no_matter_what_you/"
    },
    {
        "id": "1je98fh",
        "author": "Big-Acanthisitta8797",
        "title": "The Recruit",
        "content": "Who else is feeling bummed that there won’t be a Season 3? It’s disappointing when a great show ends too soon, leaving us wanting the next part of the story and characters!",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1je98fh/the_recruit/"
    },
    {
        "id": "1je5un4",
        "author": "neodiodorus",
        "title": "How 'Adolescence' Filmed Those One Take Episodes",
        "content": "Very good analysis of the technical solutions and directing that made the realism of the show so hard-hitting. It is a rare case where technology is put entirely in the service of the story IMHO, without them losing themselves in gimmicky showing off.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1je5un4/how_adolescence_filmed_those_one_take_episodes/"
    },
    {
        "id": "1je8eqf",
        "author": "MysteriousDelay6266",
        "title": "The Glass Dome | Official Trailer | Netflix | April 15",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1je8eqf/the_glass_dome_official_trailer_netflix_april_15/"
    },
    {
        "id": "1jdllt3",
        "author": "blameitonbegoniaz",
        "title": "Adolescence",
        "content": "Owen Cooper might be the best actor I’ve ever seen. As a parent, this show has me completely and utterly fucked up. What a wild ride. I am blown away by the acting and can’t believe this is Owen’s first role. ",
        "upvotes": 42,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1jdllt3/adolescence/"
    },
    {
        "id": "1jdy1cl",
        "author": "Netflixers",
        "title": "Do Netflix films disappear deep into the catalog a week after their release, never to be watched again?",
        "content": "Hi guys, I took a look at 2 years of Netflix data to see how much \"old\" Netflix Original films are still watched years after their release. Hope you find it interesting!",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jdy1cl/do_netflix_films_disappear_deep_into_the_catalog/"
    },
    {
        "id": "1jdxwqt",
        "author": "pielcomolamiel",
        "title": "Adolescence",
        "content": "Steven Graham, Ashley Walters, Erin Doherty omg and the greatest performance I have seen from a child in a VERY LONG TIME, Owen Cooper.GIVE THEM THE OSCAR NOW. GIVE THEM THE FUCKING ACADEMY AWARD OMFG\n\nEACH EPISODE WAS RECORDED IN ONE SINGLE TAKE. And it is magical like, I am in awe.\n\nIf you like dramas, crime TV shows, and are into Psychology, This is an ABSOLUTE MUST WATCH. It's amazing especially considering how impressionable adolescents truly are, and how the influence of the internet and toxic masculinity continues to do so much damage to our kids, even when we try our best.\n\nIf you have watched already, what did you think? I want to discuss!",
        "upvotes": 6,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1jdxwqt/adolescence/"
    },
    {
        "id": "1jdhfz5",
        "author": "Plane-Cloud-5837",
        "title": "Owen Cooper reveals which Adolescence moment was improvised",
        "content": "",
        "upvotes": 63,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jdhfz5/owen_cooper_reveals_which_adolescence_moment_was/"
    },
    {
        "id": "1jdca5v",
        "author": "Robemilak",
        "title": "Joe Russo Says They Used AI for Voice Modulation in ‘The Electric State’: “[It’s] something any 10-year-old could do after watching a TikTok video.\" Thoughts?",
        "content": "",
        "upvotes": 115,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1jdca5v/joe_russo_says_they_used_ai_for_voice_modulation/"
    },
    {
        "id": "1jdcsgr",
        "author": "KnowNow101",
        "title": "Adolescence",
        "content": "I am completely blown away by the new addition to Netflix, Adolescence, the acting, the camera work, directing, the writing, everything was 10/10.  Its not very often i get emotional over a TV show but this is one of the best series I've seen. Now if only Netflix would fix their new horrible interface then i'd be happy.\n\n# ",
        "upvotes": 108,
        "comments": 60,
        "media": null,
        "permalink": "/r/netflix/comments/1jdcsgr/adolescence/"
    },
    {
        "id": "1je5n7j",
        "author": "mattkramer05",
        "title": "New Feature",
        "content": "I would love to see a feature where you could do randomly selected episodes of shows, like how music services have shuffle for albums. You could play random episodes of shows with many seasons. It’s fun to watch shows in order, but sometimes you just wanna watch some random episodes of series you’ve already seen.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1je5n7j/new_feature/"
    },
    {
        "id": "1je3auu",
        "author": "Grimmer6",
        "title": "Happiness &amp; All Of Us Are Dead",
        "content": "\nTwo days ago I’d watched All Of Us Are Dead and it was an epic. The zombie centred plot is top notch in it. The characters played their roles perfectly. Even the insufferable characters had got served by karma at their right time. The characters acted realistically as anyone would do in zombie apocalypse. It wasn’t boring a bit. I binged the whole show in day. I’m currently waiting for season 2. \n\nLast night I started watching Happiness. The first 4-5 episodes were good, not as good as AOUAD but still better than the latter episodes. There are few jumpscare moments. The concept of zombie in quarantined apartment is good and interesting at first. But the pace after episode 5 is so slow that it doesn’t feel like a zombie series. Most characters including ML &amp; FL are insufferable. They act like they’re playing in the park. They don’t have any seriousness about their situations. They are all adults unlike teenagers in AOUAD but act like kids. In this situation someone wants to be residential representative, someone promotes his lawyerings, someone is busy streaming, someone’s busy taking money from his sister. Among them the old couple and their son are the most insufferable. Even FL always goes near the infected like they are normal people. And the chemistry between ML &amp; FL is like they are in any romcom. Even AOUAD has romance which was as it should be in zombie apocalypse but was far better than the romance in Happiness. And ML always poses like he’s in some kind of romcom. I can’t continue this so dropped this after episode 7. Now I regret wasting my time.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1je3auu/happiness_all_of_us_are_dead/"
    },
    {
        "id": "1je2vcf",
        "author": "rainj97",
        "title": "Adolescence ending explained after Netflix viewers 'miss the point' of 'disturbing' series",
        "content": "",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1je2vcf/adolescence_ending_explained_after_netflix/"
    },
    {
        "id": "1jdkqwc",
        "author": "cruser555",
        "title": "Zero Day",
        "content": "I just finished this series and I loved it! I don’t understand why it got some really bad reviews. It has everything you want in a political thriller - a storyline that keeps you guessing, a fast pace, and very good acting by some big stars ",
        "upvotes": 16,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1jdkqwc/zero_day/"
    },
    {
        "id": "1jda2cd",
        "author": "Sweaty-Toe-6211",
        "title": "Jenna Ortega says ‘WEDNESDAY’ Season 2 is filled with more horror references &amp; unique visuals: “There's a whole episode based off of slashers, and we make a lot of horror references”",
        "content": "",
        "upvotes": 71,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1jda2cd/jenna_ortega_says_wednesday_season_2_is_filled/"
    },
    {
        "id": "1je1e1o",
        "author": "AvocadoLonely9273",
        "title": "Series recomandation",
        "content": "Hello guys ,i wanna start a new series and i dont know witch . I dont like mainstream series (peaky blinders etc )\n\nI love sf series,zombies etc .\n\nWatched: Black summer,all of us are dead ,sweet home,hellraiser,z day ,the 100 ,3 % ,altered carbon etc .\n\nCan yall recomend me something like that ?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1je1e1o/series_recomandation/"
    },
    {
        "id": "1jdx7so",
        "author": "TheGame81677",
        "title": "I keep getting error code tvq-pb-101 when trying to watch Monday Night Raw",
        "content": "I was watching John Cena on Monday night raw, then I started getting this error code. First it was cutting in and out, now it will not even play for more than two seconds. What is this code and how do you fix it? I am watching on a Samsung TV if that makes any difference. Anyone else deal with this? It’s wanting me to unplug my tv, but I don’t want to do that.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jdx7so/i_keep_getting_error_code_tvqpb101_when_trying_to/"
    },
    {
        "id": "1je07ux",
        "author": "rajdeepguha0937",
        "title": "Streaming quality on Android.",
        "content": "I cannot find a single way to increase the streaming quality of videos on Netflix when I am on my android. The only thing i can change is the download quality which I may add doesn't seem to work, as I've already set it to high and the downloaded vids are still in sh#t quality. I've tried setting the data usage to both wifi only and maximum data. Nothing seems to work. \n\nHelp me out pls? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1je07ux/streaming_quality_on_android/"
    },
    {
        "id": "1jdfaq6",
        "author": "OverSyncopatedBeats",
        "title": "For Owen Cooper’s second ever role after he smashed it in Adolescence, he’s going to be in Emerald Fennell’s Wuthering Heights!",
        "content": "Playing a young Jacob Elordi. Big things coming for him and he really deserves it ",
        "upvotes": 24,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jdfaq6/for_owen_coopers_second_ever_role_after_he/"
    },
    {
        "id": "1jdmv2d",
        "author": "BopDoBop",
        "title": "Netflix household watchdog is too eager on pestering users",
        "content": "I was subscriber to highest tier during last 7 years.\n\nWe are family of four and only four of us are using it within limits of our home, or occasionally on our mobile devices when we are away during vacation.\n\nYes, we use many devices: 4 phones, three tablets, three tvs, on computers, or on laptops, or in Quest VR. Its not our fault that we have many devices\n\nToday I cancelled my subscription for good because they keep pestering us to update our household devices non stop.\n\nDuring last three months they keep removing our devices and constantly nagging about update our household. I also removed all devices for more than three times in order to reset their \"watchdog\"\n\nDespite the facts that they are not offering full library in our country since start, that they recently upped the price a lot, they lowered the amount of quality content, I kept my subscription.\n\n**But I will not tolerate treating me like this and constantly interrupting enjoying the service. This weekend they logged out all of our devices and that was the last straw.**\n\n**Farewell Netflix!**\n\nPS: Sorry for venting. I wrote this in frustration and hope that maybe someone from Netflix will see this and ease on their watchdog policy for sake of others.",
        "upvotes": 8,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1jdmv2d/netflix_household_watchdog_is_too_eager_on/"
    },
    {
        "id": "1jdspo3",
        "author": "Standard_Tea_2516",
        "title": "How to enable games section on Samsung Frame TV 2020",
        "content": "We have a Samsung Frame TV 43” 2020 model and aren’t able to get the games section to work. I’ve tried uninstalling the Netflix app on the device and installing it again, rebooting the TV, and checking for updates on the TV. We have the highest tier Netflix membership as well. Netflix chat said to contact Samsung about this issue. Netflix website also says that games are compatible with Samsung Smart TV’s. Had anyone had this issue or have any insight on how to get this to work. I was just going to get an Amazon Fire stick so my son can play the Netflix games, but thought I’d check here for help first. ",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jdspo3/how_to_enable_games_section_on_samsung_frame_tv/"
    },
    {
        "id": "1jdlv2r",
        "author": "angiesblog",
        "title": "tv series recommendation",
        "content": "hey there! I need a good show to watch ASAP. I'll give you some indications:\n- I would prefer if it's a bit family friendly (doesn't have to be too much but not sex education level)\n- not too tragic and not a medical show (mom doesn't like them)\n- no animes\n- available on netflix ofc!!\n- entrataining!!\n- some shows I really loved are suits, the rookie and detective monk (looking for something similar)\n- I also like the good place, superstore, the big bang theorand anne with an e (i just now started it) but I'm looking for something more engaging \n\ncan someone help me?? \nTHANK YOU!!",
        "upvotes": 9,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1jdlv2r/tv_series_recommendation/"
    },
    {
        "id": "1je3kwd",
        "author": "dailystar_news",
        "title": "Hollywood star's role in Netflix drama Adolescence leaves viewers floored",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1je3kwd/hollywood_stars_role_in_netflix_drama_adolescence/"
    },
    {
        "id": "1jdplzw",
        "author": "Comfortable-Cash-262",
        "title": "\"Asura\". This Japanese drama is just impressive. Unlike many fast-paced shows, it unfolds with a slow yet deliberate rhythm. The acting is great, the cinematography breathtaking, pure quality in every detail. I came across it thanks to this article in The Guardian.",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jdplzw/asura_this_japanese_drama_is_just_impressive/"
    },
    {
        "id": "1jdxiu3",
        "author": "RZNNNN",
        "title": "Netflix drastically reduces quality between episodes from 1:00 to 4:00 AM",
        "content": "I’m convinced that the engineers at Netflix are trying to be clever by automatically reducing quality when they think that I’m sleeping.  If I exit playback and resume the quality returns to normal.  Has anyone else experienced this?  It’s a nightly occurrence for me.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jdxiu3/netflix_drastically_reduces_quality_between/"
    },
    {
        "id": "1jdx8qo",
        "author": "xSparza",
        "title": "Naruto language",
        "content": "ok so can someone plz help me, I was watching Naruto with my girl in Spanish, but for some reason now it’s in English and doesn’t give me an option for Spanish, when before I didn’t even have the option for English, can someone help plz 🥺",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jdx8qo/naruto_language/"
    },
    {
        "id": "1jd4edy",
        "author": "Few_Position7650",
        "title": "Adolescence",
        "content": "I can understand why people might feel the way they feel about the ending of the show buttttt episode three might be the best hour of television I have ever in my 38 years of watching tv seen. The tension and the acting and camera work were top tier tv. The little boy is definitely going to be on all of our screens for years to come. ",
        "upvotes": 51,
        "comments": 56,
        "media": null,
        "permalink": "/r/netflix/comments/1jd4edy/adolescence/"
    }
]