[
    {
        "id": "1lzz8vz",
        "author": "Pinchus121",
        "title": "I’m Phil Rosenthal, host of Somebody Feed Phil on Netflix and host of the Naked Lunch podcast. I travel the world eating incredible food and talking to even more incredible people. Let’s dish! AMA.",
        "content": "Hi Reddit! I’m Phil Rosenthal, host of Somebody Feed Phil on Netflix, and host of the Naked Lunch podcast with my good friend David Wild. I’ve spent the last several years traveling the globe with a fork in hand, trying to prove that the best way to connect with people is through good food and a lot of laughs. Season 8 of Somebody Feed Phil is now streaming on Netflix and we’re serving up new episodes of Naked Lunch every week wherever you get your podcasts, including chats with legends like Jane Fonda, John Stamos, Allison Janney, and so many more!  \n  \nGot questions about the best food cities, behind-the-scenes stories from the road (or the sitcom world), or where I stand on pineapple on pizza? I’m all yours!  \n  \nLet’s eat and chat.  \n  \nPhil  \nu/Pinchus121\n\nhttps://preview.redd.it/4k4qn42nrwcf1.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=19b27cd4f54858b592249a41b78424ec7203a1e5\n\n\n\n&gt;Thanks everyone for joining in! Be sure to check out Season 8 of Somebody Feed Phil now on Netflix and listen to new episodes of my podcast \"Naked Lunch\" every week!",
        "upvotes": 82,
        "comments": 118,
        "media": null,
        "permalink": "/r/netflix/comments/1lzz8vz/im_phil_rosenthal_host_of_somebody_feed_phil_on/"
    },
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1m3mlsm",
        "author": "Realistic_Library309",
        "title": "Am i the only one who is happy with the squid game ending ?",
        "content": "Or its just a culture to say bad about final episodes of any series . I mean not everything have happy endings let's just admit that . And the detective part it's okay some scenes are boring so just skip that . That's all I want to say . I love the ending I love everything in that series except that detective part. ",
        "upvotes": 25,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1m3mlsm/am_i_the_only_one_who_is_happy_with_the_squid/"
    },
    {
        "id": "1m3b6qu",
        "author": "ell_enne",
        "title": "Here's what's wrong with The Residence...",
        "content": "Don't get me wrong... I really liked the show; the potential it promised kept me hooked ...\nBut eventually with the last scene of the closing episode I can no longer deny it that l'd have loved it had it been two episodes shorter.\n\nThere are infinite twists and turns with too many (and many a times unnecessary) story arcs leading to a crescendo that feels lackluster when you look at the time spent building it all up.\n\nPhenomenal acting, sloppy writing, and lazy editing is how I'll remember this show. Will never be returning for a rewatch though.\n\nA tighter plot, sharper editing and a little Hugh Jackman in the end scene could've done magic ✨\n\n \nPs: what even was the end scene anyway?🙄",
        "upvotes": 55,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1m3b6qu/heres_whats_wrong_with_the_residence/"
    },
    {
        "id": "1m2xbpq",
        "author": "Flowerofthesouth88",
        "title": "Are there any Netflix Trainwreck documentary episodes that you hope they will make in The future?",
        "content": "I would like to see them making The infamous Glasgow Willy Wonka chocolate factory scam, where they Interview The three actors who play Willy Wonka, The depressing Oompa Loompas, and The unknown, As well as The public who went to The event, and  The police got calls from The public and get them interviewed too as they reaction on The calls? 😂",
        "upvotes": 143,
        "comments": 69,
        "media": null,
        "permalink": "/r/netflix/comments/1m2xbpq/are_there_any_netflix_trainwreck_documentary/"
    },
    {
        "id": "1m2rxhc",
        "author": "Ok_Cobbler4575",
        "title": "Trainwreck Balloon Boy “Hoax”",
        "content": "The minute they said they were on Wife Swipe, their whole performance made sense. It's wild what people will do for attention. Guess it's working, they're getting even more of it now. 🤷🏻‍♀️",
        "upvotes": 220,
        "comments": 94,
        "media": null,
        "permalink": "/r/netflix/comments/1m2rxhc/trainwreck_balloon_boy_hoax/"
    },
    {
        "id": "1m3l6m5",
        "author": "Lexi_Adriaanse",
        "title": "Building the Band: opinions on ep 1-6",
        "content": "hey hey, just wanted to drop some opinions because i'm bursting to talk about this show and barely anyone i know has seen it yet\n\n1. omggg, from the time we got to hear the first round of singers, i was rooting for aaliyah, denzel, cameron, and katie to join together because their voices are all so rich and evocative. so when they eventually teamed up, i was SCREAMING !!\n\n2. the work ethic and unity of all the groups has been a major influence in how i view them. szn4 are my faves just because of how much time and effort they've put in, not just as a band, but as a group. i really wanted to love m2m because they're the most alternative of the bunch, but right off the bat they were all flakey – the other three just seem a lot more hard-working because conor is there to juxtapose was **bad** workmanship is. this is also the reason i'm obsessed with soulidified and why siren society are my current underdogs. both of these bands just feel like long-time friends starting a project together for the sheer enjoyment.\n\n3. the group names are KILLING me. the only one i sort of like is midnight 'til morning, but even that is lacklustre. 3quency, siren society, and soulidified are taking me out tho haha.\n\n4. not gonna get into it because the discourse around these two is already super negative. but obviously conor and alison have soured the show for me. i get showbiz and drama but the show works perfectly for all the other bands without them needing constant negativity surrounding them.\n\n5. conor's \"punk\" look had me rooting for him in the beginning, but now it kinda feels forced and performative. the \"punk\" aesthetic has no politics or morals behind it, it feels fake in a lil huddy, mgk, landon barker kinda way. and alison is really giving tess tyler from camp rock. i love a mean girl archetype but it just feels cruel, especially the digs at haley during practices, and the confrontation with erica in the booth.\n\n6. while i really felt horrible during the alison-erica confrontation, the editors really did not paint erica in a great light. the amount of scenes of this girl crying is over the top, which sucks because she has so many strong, leadership moments that get overshadowed by this framing.\n\n7. i absolutely fell in love with soulidifed. they feel so light and airy and fun. you can tell there is not toxic masculinity that side and it's so refreshing. they FEEL like how a boyband should feel, just in a modernised fashion. i'm so hopeful to see what happens with them once the show has aired and they come out with what they're doing with the band.\n\n8. what is up with the judge's commentary? for the most part, i agreed. but the criticism for siren society way outweight the compliments (def feel like that's foreshadowing their demise on the show), when i felt like their performance was the ideal girlgroup. i know nicole was probably harsher because it was her song, and i did see ehat she was saying about the sexiness feeling outdated, but what they did felt authentic and real to what i envision as a girlgroup. i've been using katseye as a litmus test during the performance episodes, and i genuinely see siren society as being the most alike to what the world wants to see.\n\n9. i can't with 3quency. i tried to like them, especially since they each had such strong solos in the booth scenes. but nori really sticks out since her voice is very youthful and unique. nori definitely has the least amount of skill and it shows. brianna sings beautifully, but the rich soulful tone feels like it would be better fitted in szn4 honestly. omg but wennely? she is just amazing. her voice blends well for a group, i just wish she was in a group that didn't feel so fragmented.\n\n10. why was the show so religious in the booth episodes lol? i feel like every second word in the booth chats was about growing up in the church, learning to sing in church choirs, pre-performance prayers, etc. it just felt so out of place for a singing reality tv show. \n\n11. the band forming mechanics were sloppy. by having the bands be allowed to be formed before all the contestants had the opportunity to perform didn't sit right. and having only 6 bands be the outcome made it feel like a race to who can slap together a band the fasted, which kinda took away from the organic ethos (which was super evident in the forming of band 6). i'm hoping it was just an editing thing, but if it wasn't, it's definitely an aspect that needs to be worked on.\n\n12. idk if there was a cap on how many members a band could have, but i don't get why alison couldn't have formed a group with elise, haley, cece, and mandy? that's 5 members which we've seen in so many bands. ig it may have been the same reasoning as 3quency where they wanted bigger roles/parts in the songs and felt their voices were strong enough to carry and full out a song? still sucks that the show seemed to put drama ahead of talent and skill.\n\n13. i love how the editors made sure to constantly remind us of people's names and what songs were being sung. if not, i would have totally forgot/glossed over major players in the show.\n\n14. not everyone who has watched this has seen popstar/dream academy. but my queen karlee was an absolutely legend in that show/project. she was in this show super briefly, and i'm so mad i didn't get to see anything of her, not a performance and no booth chats. it was nice seeing the little clips of her. anyway, she makes solo music now which is amazing (go stream), but it would've loved to see what she looked like in this setting, and hearing her compare it to dream academy.\n\nall-in-all, this show has a lot of kinks to work out. but i am rooting for this to take off because, with a little work, this show could easily be a great contender for modern day reality tv. the experiment played out exactly as it was intended, unlike other netflix reality shows, so i was super happy about that. the idea of a group of unlikely candidates coming together to make magic was brilliant, and is working well for me. what are your thoughts about the show thus far?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m3l6m5/building_the_band_opinions_on_ep_16/"
    },
    {
        "id": "1m3o0cn",
        "author": "Gh0ul10",
        "title": "Not able to use my mom’s Netflix?",
        "content": "Netflix says I’m not allowed to use her account because I’m not the owner when I watch on my phone but i’m 15 and obviously still live with her so what the hell am I supposed to do when it says I just can’t watch Netflix on my phone anymore? It’s normally not that big of a deal, but my family goes on a lot of trips and I love downloading movies off Netflix.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m3o0cn/not_able_to_use_my_moms_netflix/"
    },
    {
        "id": "1m3n8hr",
        "author": "Seltzer-Slut",
        "title": "I just binged Building The Band 1-7… and then rewatched it!",
        "content": "This show is a real hit - there are so many contestants I’m enthusiastically rooting for. There are still 4 episodes to go, which will be released next week. The format of this reality show, which allows contestants to form their own band based on blind auditions, is a refreshing spin on this genre. It produced some truly one of a kind groups with authentic chemistry.\n\n\nI’m rooting for the bands: \n\n1. Soulidified\n\n2. SZN4\n\n3. Siren Society / 3quency (tied)\n\nMy top contestants: \n\n1. Elise \n\n2. Aaliyah \n\n3. Donzell \n\n4. Wennely \n\n5. Noriella \n\n6. Autumn \n\n_____\n\nIf you’ve seen it and liked it as much as I did, please join us in the fan subreddit, which is quite lonely with only 2k members. \n\n\n\n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m3n8hr/i_just_binged_building_the_band_17_and_then/"
    },
    {
        "id": "1m307d6",
        "author": "ZLeiae",
        "title": "Scariest horror movie on Netflix?",
        "content": "I'm in the mood for a horror movie that will *actually* terrify me, like builds dread, makes my heart pound or messes with my head. Ideally supernatural (ghosts, demons, witches, gore, monsters, curses, that kind of vibe), and I’m totally down for non-English films too (plus jump scares!).\n\nLmk what truly got under your skin or made you sleep with the lights on?\n\nLooking to be deeply unsettled tonight :D",
        "upvotes": 21,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1m307d6/scariest_horror_movie_on_netflix/"
    },
    {
        "id": "1m3706x",
        "author": "ferreirro",
        "title": "Thoughts on \"Frida\" and movie suggestions based on it.",
        "content": "Personally, I really liked it. It’s definitely an art film and did an amazing job showcasing Frida’s complex, passionate life. The use of color and the cinematography were absolutely stunning—truly a visual treat.\n\nI especially loved seeing old Mexico brought to life so beautifully, and Salma Hayek’s performance was top-notch. She became Frida in every sense.\n\nAre there any other biopics like this—visually rich, emotionally deep, and artistically bold.",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m3706x/thoughts_on_frida_and_movie_suggestions_based_on/"
    },
    {
        "id": "1m3fyte",
        "author": "Domlerchess",
        "title": "I always get a \"this code ist No longer valid\" error.",
        "content": "I travel regularly and bring a fireTV stick with me that I watch Netflix on. Everytime I log in it recognizes that I'm not in my household so I choose to have a validation code sent to my email. But if I click the link sent I get a \"this code is no longer valid\" error. It doesn't matter if I click the links after minutes or seconds. This has happened multiple times over many months. Both the household and the travel destinations are in Germany.\nWhat do I do in that situation? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m3fyte/i_always_get_a_this_code_ist_no_longer_valid_error/"
    },
    {
        "id": "1m39g78",
        "author": "Metagross2713",
        "title": "Is there a way to check for new shows coming to Netflix?",
        "content": "I am new to netflix, newphew wanted it. Is there a way to check when if show is going on to netflix? Been waiting to see if Dragon ball Daima get English dub and if my hero academia vigilantes/ fairy tail 100 year quest will be available on netflix,  just don't want to spend more money to get a different subscription. ",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1m39g78/is_there_a_way_to_check_for_new_shows_coming_to/"
    },
    {
        "id": "1m3nz0t",
        "author": "Stock-Quail1378",
        "title": "did i netflix kick me off so somebody else could watch?",
        "content": "i got logged out of netflix out of nowhere while watching my show?? i logged back in immediately after and tried to watch my show again it said there were too many people watching right now.. um hello? i was JUST watching my show?? literally 2 minutes ago!!! did netflix really kick me out just so somebody else could watch??? if so, that's super annoying and i had no idea they could do that!😒",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m3nz0t/did_i_netflix_kick_me_off_so_somebody_else_could/"
    },
    {
        "id": "1m3m5nh",
        "author": "Open-Win-8967",
        "title": "Squid Game Season 3",
        "content": "They absolutely butchered the series with this final season, it's just horrible.\nI've never seen such a bad continuation of a series, the first and second season were as peak as they could be. The third season had no f-ing point, the entire subplot with the detective had no point and the ending is so rushed and frankly the last game ended like absolute dog water. Just erase it from history and do it again, the right way.\nAm I the only one thinking it was absolute trash?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m3m5nh/squid_game_season_3/"
    },
    {
        "id": "1m2k0j6",
        "author": "hdsd_",
        "title": "Thoughts on the new Netflix layout? I think it sucks.",
        "content": "Now I can only see like 1-3 titles at a time. The best part is when you're scrolling with friends to pick a movie in the old layout, someone will something in the corner of the screen and they go pick that one! Now, we literally have to look at one movie at a time, takes MUCH longer to find something. Not a fan, at all.",
        "upvotes": 80,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1m2k0j6/thoughts_on_the_new_netflix_layout_i_think_it/"
    },
    {
        "id": "1m2t049",
        "author": "tinylittlepixel334",
        "title": "Generative AI makes its debut on Netflix with Argentine TV series The Eternaut",
        "content": "\"The specific sequence, confirmed by Netflix co-CEO Ted Sarandos, features a dramatic building collapse in Buenos Aires. Sarandos explained that generative AI allowed the show’s production team to complete this complex visual effect ten times faster than traditional methods, making it financially feasible for the project’s budget.\"\n\nVia: [https://techissuestoday.com/generative-ai-makes-its-debut-on-netflix-with-argentine-tv-series-the-eternaut/](https://techissuestoday.com/generative-ai-makes-its-debut-on-netflix-with-argentine-tv-series-the-eternaut/)",
        "upvotes": 19,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1m2t049/generative_ai_makes_its_debut_on_netflix_with/"
    },
    {
        "id": "1m2oaix",
        "author": "ToonAdventure",
        "title": "‘Captain Planet’ Live-Action Series In Works At Netflix From Berlanti Productions &amp; Appian Way",
        "content": "",
        "upvotes": 46,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1m2oaix/captain_planet_liveaction_series_in_works_at/"
    },
    {
        "id": "1m39hm1",
        "author": "vesuuwastaken",
        "title": "stuck at 6.87 mbps",
        "content": "hi so like for starters i already got a 4k plan and my tv is 4k but for some reason when i watch my show (breaking bad) since yesterday it has been showing that its 6.87 mbps only and its been playing at 1080p ive already put my playback on high quality and my connection is more than fine (300 mbps) ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m39hm1/stuck_at_687_mbps/"
    },
    {
        "id": "1m2tvlh",
        "author": "deneester",
        "title": "Building the Band!!! Ep: 1-7",
        "content": "Surprisingly, I'm actually really liking Building the Band because it's a little more authentic than I expected, with the ability for the kids to pick their own groups (minus the fact that they only have 6 groups so timing matters....hope they change that in the future and then cut off how ever many that they need to with the first round of group performances. )\n\nIf 3Quency does not stay together, I'll be ticked because their voices blend so well in harmony. Their only other job is to get along, which they appear to be doing so far.\n\nWhatever group Alison is in, I think we all feel like the other two girls joined because it was Band #6 and there weren't other choices. She can sing but she's pretty much insufferable. \n\nSZN4 - not a huge fan of the band name but they are my faves for sure! That unique mixture of people....the beatiful strong voices of all of them (especially Cam but they all sound great,) Donzel's positive energy...so many more things that I can say about these kids but I love it.\n\nThe only other band that I really like (after SZN4 and 3Quency) is Soulidified. They have more work to do but all of them are so precious and so far have won my heart. 🤎\n\nIn the chaotic boy band (Million Miles to Wherever the Heck They are Going) I really like the mop haired Aussie. His personality is so cool and they can all sing. I do agree with people who have said that the tatted guy and his narcissistic Alison mean girl fling might be actors. Hope not but they are capturing some horrific moments so maybe it's for film.\n\nLastly, now I realize why Nicole left The Masked Singer. Smart move, girl. I've heard Netflix pays well and if this turns out to be a hit, you will be the superstar of the show and the money will keep on multiplying. Same with Queen Kelly leaving The Voice AUS. Wish I had their managers lol",
        "upvotes": 11,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1m2tvlh/building_the_band_ep_17/"
    },
    {
        "id": "1m2vil8",
        "author": "Atlast_2091",
        "title": "Wall to Wall | Now Playing | Netflix [ENG SUB]",
        "content": "",
        "upvotes": 7,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m2vil8/wall_to_wall_now_playing_netflix_eng_sub/"
    },
    {
        "id": "1m2a2tc",
        "author": "shmu_",
        "title": "Assassin's Creed confirmed for live-action Netflix adaptation",
        "content": "",
        "upvotes": 65,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1m2a2tc/assassins_creed_confirmed_for_liveaction_netflix/"
    },
    {
        "id": "1m32nj9",
        "author": "BlueDandellion",
        "title": "How did Mira and Zoey join Huntrix?",
        "content": "So, I watched the movie Kpop Demon Hunters on Netflix. Absolutely loved it. However, there are so many things we don’t know about, I just had to spit them out here. For example, how did Mira and Zoey join Huntrix? It’s said at the start of the movie that Celine took Rumi in under her wing (well… tried to. Not the best mentor). But what about the other two? We can guess Mira doesn’t have a good relationship with her parents because she was a wild child, but what about Zoey’s family? We just know she used to live in America before, that’s it. Nothing else about her family.\n\nWas Celine the only one who trained them? Or were they trained by some kind of institution? Does the whole “demon stealing human’s souls” thing only happen there, or in other parts of the world? Are there other demons hunters like them from other countries? Are there any interviews in which the creators of the movie answer some of these questions?\n\nI need freaking answers, Sony!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m32nj9/how_did_mira_and_zoey_join_huntrix/"
    },
    {
        "id": "1m3g7jj",
        "author": "DankestDungeoneer",
        "title": "Department Q",
        "content": "The day netflix cancels this, is the day I cancel my subscription.\n\nI was absolutely hooked from start to finish. Excellent cast, excelent writing. Contrary to classic Netflix there is no forced diversity shoved down our throats just for the sake of it. Every character makes complete sense for the story and the locations. Akram is extraordinarily likeable, his story makes sense, his character should be the golden standard for what inclusivity done right should look like.\n\nAlso, the story is not obvious at all, you don't know the answers and are waiting for the characters to figure it out aswell, which is a breath of fresh air when compared with other recent shows which seem written for people who think that being in the 90th percentile on online iQ tests from buzzfeed is a good thing.\nI feel like my life is better after this show. Season two can't come soon enough. Netflix, you cancel this, I'm canceling the plan for my whole family.",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1m3g7jj/department_q/"
    },
    {
        "id": "1m2p6xp",
        "author": "Stabbyunicorny42",
        "title": "Trainwreck: Balloon Boy",
        "content": "This is way out of left field buuuut…\n\nDoes anyone by chance know the type of chess board the Heene’s lawyer David Lane is playing with about halfway through?  TIA Reddit warriors ",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m2p6xp/trainwreck_balloon_boy/"
    },
    {
        "id": "1m35jmo",
        "author": "Intrepid_Permit5815",
        "title": "How did detective Cupp know where to cut?",
        "content": "I just rewatched the last episode of The Residence and its been on my mind. When Cupp uses the knife to cut the opening of the door in the yellow oval room, how does she know the exact dimensions if it was fully sealed? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m35jmo/how_did_detective_cupp_know_where_to_cut/"
    },
    {
        "id": "1m3a4de",
        "author": "Purple-Impress8033",
        "title": "Netflix the best ?",
        "content": "What makes Netflix stand out compared to other streaming platforms like Hulu, Disney+, or Prime Video? \n\nWhat do you usually watch the most ? I can’t seem to decide which one between Netflix and Hulu is better. ",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1m3a4de/netflix_the_best/"
    },
    {
        "id": "1m2ksk6",
        "author": "Maximum-Wear4068",
        "title": "This needs to be release in theatres K-POP DEMON HUNTERS",
        "content": "Guys we should literally file a petition to release this movie in world wide theatres!!! Netflix I really love this movie and I am able to get over all song and I know u too Soo plsss release this in theatres!!!",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ksk6/this_needs_to_be_release_in_theatres_kpop_demon/"
    },
    {
        "id": "1m2w5vt",
        "author": "_GrumpySam",
        "title": "Standard with Ads with extra member?",
        "content": "Im looking to decrease my monthly subscription. \n\nI want to go down to standard with ads. \n\nI have an extra member on my account. \n\nIs this going to affect that?\n\nThanks",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m2w5vt/standard_with_ads_with_extra_member/"
    },
    {
        "id": "1m2ddql",
        "author": "PM_0891",
        "title": "'Owning Manhattan' Season 2 drops Dec. 5!",
        "content": "Ryan Serhant just announced that Season 2 of 'Owning Manhattan' is coming Dec. 5!  \n  \nHere's an incredible profile I read about him that talks about his rise from broke actor to real estate mogul, how he built his media machine, and the psychology that drives him. It might give you a whole new perspective on who he really is.\n\n[https://www.readtheprofile.com/p/ryan-serhant-owning-manhattan-profile](https://www.readtheprofile.com/p/ryan-serhant-owning-manhattan-profile)",
        "upvotes": 14,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ddql/owning_manhattan_season_2_drops_dec_5/"
    },
    {
        "id": "1m38su1",
        "author": "TreyBTW",
        "title": "How is netflix any different from cable when you can only watch on certain devices in a single household?",
        "content": "Traveling and netflix absolutely refuses to work on any wifi that isnt my home or the first hotel we visited. I dont have unlimited data. What exactly am I paying for if I can't stream on the go? ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1m38su1/how_is_netflix_any_different_from_cable_when_you/"
    },
    {
        "id": "1m2me98",
        "author": "Historical-Echo316",
        "title": "Best new crime docs ?",
        "content": "So having watched ...\n\n•Trainwreck : balloonboy \n•Amy Bradley is missing \n•A Deadly American marriage \n\nIt got me thinking what are some other new releases similar to these ? \n",
        "upvotes": 4,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1m2me98/best_new_crime_docs/"
    }
]