[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 493,
        "comments": 273,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 19,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1joz0iv",
        "author": "-Xoz-",
        "title": "Adolescence to be shown in UK schools for free as British PM Keir Starmer meets creators",
        "content": "",
        "upvotes": 126,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1joz0iv/adolescence_to_be_shown_in_uk_schools_for_free_as/"
    },
    {
        "id": "1jpfm2h",
        "author": "anymoose",
        "title": "Did they change the algorithm?",
        "content": "I swear 50% of my \"recommendations\" lately are for things I've already watched and rated. Any way to stop that?\n\nI don't mind seeing the occasional \"watch it again\" feed but things I've already rated should not be in \"we think you'll love this!\" or in any category with the word \"new\" in the title....",
        "upvotes": 12,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1jpfm2h/did_they_change_the_algorithm/"
    },
    {
        "id": "1joqfkr",
        "author": "Salt-Lake5807",
        "title": "I just finished the Adolescence",
        "content": "As a father of a boy and a daughter (both under 12yr) this serie really hit me hard. Especially third third and the fourth episode. Jamie being interviewed by the therapist was something I've never seen before. You can feel the rage and anger the boy is holding inside of himself. The acting was just perfect.\n\nThe final episode blew me away. When Jamie called and said that he's gonna plea guilty I just stopped breathing. The reactions of the parents and the sister were so real and heartfelt. \n\nI started to cry at the end of the final episode when Lisa (sister) came and said \"Jamie is ours\".  As the dad went to Jamie's room I was blubbering. I'm still weeping as I'm writing this.\n\nNever ever has a movie or a serie made me feel so much. Made me think about my own kids and the world they're living. ",
        "upvotes": 390,
        "comments": 233,
        "media": null,
        "permalink": "/r/netflix/comments/1joqfkr/i_just_finished_the_adolescence/"
    },
    {
        "id": "1jp921p",
        "author": "Dommichu",
        "title": "'Adolescence' co-creator says 'maybe we're all accountable' for youth violence",
        "content": "Fabulous interview with Stephen Graham on the development and filming of Adolescence!  Like… I was in complete awe in the scene shot at the school!  Post Covid, to see so many extras in a scene and how natural and flowing it all went with so much going on!  Turns out a lot of the extras went to that school!  What pros!  \n\nWorth a listen to learn about the show and Stephen himself.  ",
        "upvotes": 23,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1jp921p/adolescence_cocreator_says_maybe_were_all/"
    },
    {
        "id": "1jpgz02",
        "author": "V01D3Y3",
        "title": "Netflix on Xbox not working (description)",
        "content": "90% of the time when I try and click resume on any show it will take at least a minute to load, and when it does load it's extremely bad quality. When it doesn't take long to load it usually isn't bad quality but now it seems unavoidable and it's making the show I'm watching just unwatchable. Does anyone know any solutions",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jpgz02/netflix_on_xbox_not_working_description/"
    },
    {
        "id": "1jpfw8x",
        "author": "Due_Doughnut7352",
        "title": "Downloads almost always tell me that “this is the end of the download” despite being 100% downloaded.",
        "content": "Can’t find anyone that asked about this so i’m asking here. I’m on IOS (Iphone 14) and am trying to watch the Good Place. Now I downloaded all of season one but every time I would go to watch it, despite telling and showing the episode as fully downloaded, usually 5-10 minutes into the episode an error message would show up indicating that I only downloaded up to that point. Please help, it’s so gd annoying 😭 thanks in advance ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jpfw8x/downloads_almost_always_tell_me_that_this_is_the/"
    },
    {
        "id": "1joqis7",
        "author": "Loose_Clock609",
        "title": "Gone Girls: The Long Island Serial Killer' - Are the cops morons or just in on it?",
        "content": "Why was the docuseries made? We literally learned nothing new about the case or the victims. \n\nI don't believe the cops are this incompetent. It's impossible for any police department this large to be so stupid. With all the technology we have available, how are these cases still so unsolved or at least identify the victims. Either a cop did it or some rich guys with kinks pay them to look the other way\n \nIt's definitely more than one killer in the area. I wouldn't go from burlap sacks to dismemberment to just random dumpings... Rex isn't the only killer. \n\nI thought the documentary would answer big questions like, who are the other victims? Who is the baby? Who was the male? Nope...\n\nAnd if I hear the journalist says she's shocked again... \n\n ",
        "upvotes": 37,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1joqis7/gone_girls_the_long_island_serial_killer_are_the/"
    },
    {
        "id": "1jpdev8",
        "author": "AIONisMINE",
        "title": "stupid question.... but just want to make sure. Cancelling netflix while having a giftcard balance",
        "content": "i have a significant netflix credit balance due to giftcard.\n\ni dont have any other payment method attached to my netflix account.\n\nwill there be any issues if i were to cancel my netflix subscription?\n\nmy netflix credit will still be there untouched until i decided to subscribe again, correct?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jpdev8/stupid_question_but_just_want_to_make_sure/"
    },
    {
        "id": "1jozl4t",
        "author": "McNasty420",
        "title": "This day in history- Will Arnett narrates Netflix Live",
        "content": "This was from April Fools many years ago, I can't remember when exactly.  It is Will Arnett narrating video of an office.  The funniest thing ever. \n\n[https://www.youtube.com/watch?v=ZbsRwH2jbac](https://www.youtube.com/watch?v=ZbsRwH2jbac)",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jozl4t/this_day_in_history_will_arnett_narrates_netflix/"
    },
    {
        "id": "1jpb0ae",
        "author": "CrimsonRaven7",
        "title": "Show disapearing on home wifi but reapearing on data and on other wifi networks",
        "content": "My sisters netflix (doesnt have reddit) suddenly stopped allowing her to watch Grays anatomy on nextflix while connected to our home wifi (spectrum). Turning off Wi-Fi on her phone makes it show back up. It shows  on wifi other than our own and on data. Anyone know why?\n\nEdit:. My mothers works fine and shows Grays. My sisters phone and laptop do not show Grays. If she connects to any other wifi Grays comes back.  Seems like something is causing her account on this specific wifi to not show Grays. No other shows disapear that she can tell. Its really weird",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jpb0ae/show_disapearing_on_home_wifi_but_reapearing_on/"
    },
    {
        "id": "1jpaal5",
        "author": "DaBoiYeet",
        "title": "How can I get more audio language options?",
        "content": "I have been using the app to watch animes, and frankly I prefer watching it dubbed in english. \n\nI moved to Netflix recently to watch them and something I've been kinda peaved at is the fact that most of them only have the original Japanese dub (Fair enough, makes sense), and then some other miscelaneous language that isn't english. One Piece, for example, only shows me the options for Japanese and Portuguese (My region, sure), but Oshi no Ko only has Japanese and German.\n\nIs there any way I can add the english dubs to shows? I tried changing my app's language to english, but even still the options haven't changed.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jpaal5/how_can_i_get_more_audio_language_options/"
    },
    {
        "id": "1jp96py",
        "author": "Roxith",
        "title": "Netflix Removed Qin Empire Alliance Season 1?",
        "content": "I watched Qin Empire season 1 on Netflix and it was so good. I wanted to go back to it but now see that only season 2 is there. What happened? How can I get back to it? Or is it gone forever?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jp96py/netflix_removed_qin_empire_alliance_season_1/"
    },
    {
        "id": "1jp925g",
        "author": "No_Quantity_7225",
        "title": "Unlocked: Jail experiment  - Is experiment valid?",
        "content": "Currently only on the start of first episode. But I am already questioning the premise of the whole show. They run an \"experiment\" but I dont believe you can film a high quality show without prisoners knowing that they are being filmed and that they are gonna be on TV show. So they are bound to be more nice because all actions are recorded on cameras for Netflix itself. Doesnt it make data collected from experiment invalid? I really want to watch it to the end but I have mixed feelings knowing that these results do differ from those if experiment was ran without Netflix presence.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jp925g/unlocked_jail_experiment_is_experiment_valid/"
    },
    {
        "id": "1jp8mil",
        "author": "Express-Resident-191",
        "title": "Younger",
        "content": "I recently started to watch Younger and I love this show. I just got to season 4 and I feel fired up about Kelsey moving in with Josh. How could she?! Ugh!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jp8mil/younger/"
    },
    {
        "id": "1joq985",
        "author": "fuckbeck",
        "title": "Cancelled shows",
        "content": "I’m finally making the move and decided to cancel my Netflix membership. \nWhy keep giving them time when they waste our own time on bs like giving us a season or two then canceling them on cliffhangers.\nI understand this isn’t new to the industry but well reviewed shows did not get cancelled in the past television era in media.\nThe two big straws that broke me were my time commitments to Archive 81 and the more recent Kaos.\nLet me know your thoughts or similar sentiments on any other shows you’re angry and felt time was wasted by them ",
        "upvotes": 12,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1joq985/cancelled_shows/"
    },
    {
        "id": "1jonklp",
        "author": "Cena_Beana",
        "title": "can someone recommend me a show that hasn’t been canceled/is finished",
        "content": "I just finished Good Girls to find out that it left on a really interesting cliffhanger and it was canceled 💔\nI am so disappointed every time I watch a show and I look up if there’s gonna be a next season and news flash ITS ALWAYS CANCELLED, im open to any recommendations please helpppp ",
        "upvotes": 18,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1jonklp/can_someone_recommend_me_a_show_that_hasnt_been/"
    },
    {
        "id": "1jp7rsb",
        "author": "bludhavengabagool",
        "title": "Jack Schumacher from the upcoming show Ransom Canyon had to learn how to ride a horse for the show",
        "content": "It turns out that one of the actors from Ransom Canyon, Jack Schumacher, didn't know how to ride a horse when he was cast in the show. So he spoke about the training process which is pretty interesting ([full article here](https://www.thepopverse.com/tv-ransom-canyon-netflix-horse-training-jack-schumacher)) ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jp7rsb/jack_schumacher_from_the_upcoming_show_ransom/"
    },
    {
        "id": "1jpf59j",
        "author": "universalbacon1",
        "title": "Big bang theory removed",
        "content": "So i sit down to watch the big bang theory and it's just gone with no warning usually it says \"leaving soon\" under it but no it just vanished same thing happend with vampire diaries.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jpf59j/big_bang_theory_removed/"
    },
    {
        "id": "1jpcrbb",
        "author": "Inevitable-Student24",
        "title": "Adolescence. Episode 4 question (SPOILERS)",
        "content": "Did anyone get a bit misled thinking that the Dad was somehow tied up in the murder when the kids painted “nonse” on his car. \nLike the main meaning of nonce is a paedophile. \n\nFirstly, it seems weirdly/unrealistically uncalled for to go after the innocent Dad 13 months after the kid was jailed. \nThen the Dad was super suss about it. Wanting to go to the shops to get rid of it straight away, like couldn’t wait until after his birthday breakfast.\nWhen he arrived at the hardware store, I swear the first shop assistant recognised him and called upon his “colleague for assistance” to show him who just came into the store. This colleague then proceeded to seem to take the piss out of him (like you would to a suspected nonce) saying weirdly sexual things like “Wash in a circular motion” and he was laughing as he said this. \nHe also gave incorrect advice about needing to use a hose and that he wouldn’t be able to get the paint off which seems like he wanted him to not be able to get it off?? Like some isopropyl alcohol would probably have been able to get that off. \n\nDon’t get me wrong. I love the fact that this series wasn’t a “who dunnit”? But was a “why did he do it” which was because of toxic masculinity which was brilliantly done. \nBut I wonder whether this “nonce” thing was deliberately done to make people think the Dad had something to do with it for half an episode only to be pulled away. \nMaybe I got mislead. Wonder what other people think. \n",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1jpcrbb/adolescence_episode_4_question_spoilers/"
    },
    {
        "id": "1jp4guf",
        "author": "magical_muderfucker",
        "title": "Netflix won't work with my data",
        "content": "Hi there\nSo, my living condition makes it so that I'm forced to use a phone as am internet source, via hotspot, to my house, including my tv\nAnd everything was fine untill a few weeks ago, when I tries to watch Netflix, and it doesn't work\nIt works untill I click on a show to watch, and then it gets stuck on a 0% loading wheel for a while untill it opens the Netflix troubleshooting page, where it check my internet, confirms everything is working great and tells me it's good to watch\nAnd then the cycle repeats \nI've changed phones and nothing, but every other streaming service works, and if I connect my tv to my GFs phone, Netflix works like a charm\nThe card provider wasn't any help, and I'm paying for this shit so I'd like It to work\nIs there anything I can do?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jp4guf/netflix_wont_work_with_my_data/"
    },
    {
        "id": "1jo7gh8",
        "author": "Pogrebnik",
        "title": "Meryl Streep Is in Talks to Join Greta Gerwig's 'Narnia' Series in Central Role",
        "content": "",
        "upvotes": 55,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1jo7gh8/meryl_streep_is_in_talks_to_join_greta_gerwigs/"
    },
    {
        "id": "1jp8buv",
        "author": "Sacks_on_Deck",
        "title": "How long is Netflix going to keep pushing 'Cozy Grove' on me?",
        "content": "This has been at the top of my Netflix homepage seemingly every time I log in on the website for weeks now. I've given it a thumbs down, I've never downloaded a game from them. I wish it would go back to showing me new series and movies or other video content suggestions. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jp8buv/how_long_is_netflix_going_to_keep_pushing_cozy/"
    },
    {
        "id": "1jo5pen",
        "author": "womanmuchmissed",
        "title": "Survival of the thickest",
        "content": "Older millennial stylist trying to live her fashion dreams in New York. She and her two best friends are in periods of growth in their personal and professional lives. This is a coming of age story but for seasoned adults. The characters are in their 30s, mature and talented but still trying to find their footing. \n\nIf you liked Sex in the City, Girlfriends, Gossip Girl, Entourage, The Game, RHONY, RHOBH, Friends, How I Met Your Mother or any other show about adult friends in the big city, then this show is for you!!!",
        "upvotes": 54,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1jo5pen/survival_of_the_thickest/"
    },
    {
        "id": "1jp0gcg",
        "author": "Available_Can7525",
        "title": "Just six weeks before their split, Love Is Blind's Mark wrote this sweet message to his wife Aubrey",
        "content": "[https://realitytvshrine.com/2025/04/01/just-six-weeks-before-their-split-love-is-blinds-mark-wrote-this-sweet-message-to-aubrey/](https://realitytvshrine.com/2025/04/01/just-six-weeks-before-their-split-love-is-blinds-mark-wrote-this-sweet-message-to-aubrey/)\n\nI don't get how he went from praising her to then them revealing they've split weeks later! Social media really isn't everything guys...\n\nDo you guys remember Mark when Jessica said no to him at the altar??\n\n[Credit: Netflix](https://preview.redd.it/0ixsnl3l69se1.png?width=1200&amp;format=png&amp;auto=webp&amp;s=3f21e725d2ee1fd9d68ba7618aaf9db21f86a7e9)\n\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jp0gcg/just_six_weeks_before_their_split_love_is_blinds/"
    },
    {
        "id": "1jot91k",
        "author": "Unlikely_Fan65",
        "title": "Whitney Houston - I wanna Dance with Somebody",
        "content": "I LOOOVE WHITNEY. Were my expectations too high? Am I way off the mark...or was this absolutely shit house!?!?!  I don't want to blame the actress - no one else can be Whitney. It was just lacking though. Severely ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jot91k/whitney_houston_i_wanna_dance_with_somebody/"
    },
    {
        "id": "1jonn0x",
        "author": "Certain_Passion1630",
        "title": "Just finished White Collar and I highly recommend",
        "content": "One of the best shows I’ve seen in a while. If you didn’t see my other post, it is very similar to Suits…but better (imo). The closest thing I can think of to compare them is Law and Order vs SVU. \n\n",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jonn0x/just_finished_white_collar_and_i_highly_recommend/"
    },
    {
        "id": "1jo5dnk",
        "author": "LushCharm91",
        "title": "'Black Mirror' Season 7 Trailer: Six New Episode Titles Revealed",
        "content": "",
        "upvotes": 39,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jo5dnk/black_mirror_season_7_trailer_six_new_episode/"
    },
    {
        "id": "1jpbjx5",
        "author": "Lanternaio",
        "title": "I think Adolescence is pretty vapid actually",
        "content": "I understand why people praise it so much. The sheer artistry of it is amazing, the performances are mesmerizing, and every aspect of its production (from cinematography to direction) is amazing.\n\nStill, I watched it all in one go and found it wholly unsatisfactory. The \"incel\" theme is used in a very superficial way, ironically much in the same way it is barely understood by the cop father who has to have it explained by his son. It felt to me that it was thrown around just because its hot and actual, fashionable, and they knew it would garner attention. But it wasn't really explored.\n\nEven the attempt at nuance they tried is kind of skin deep: they seem not to want to condemn the boy too blankly but they painted him with brushstrokes so wide and blurry they ended up with an indistinct stain.\n\nThe things that motivate him are really flimsy, especially seen how young he is. It just feels like they wanted to get across how the manosphere is dangerous and how it corrupts the already troubled youth but they didn't craft a believable relation between this statement and the character that represents it.\n\nHis confused yet searing resentment towards women would have been more understandable in a 16 years old boy, who might actually experience some more substantial sexual frustration, and even more so in a 20 years old, or a 30 years old (20-30 being the bracket in which incels are made irl as far as I know).\n\nMy point is that the boy is not depicted as a proper sociopath, not exactly. He comes from a blue-collar family, nice dad nice mom nice sister, his father seems to be quite the positive character and the relationship between his parents is really good. He's not shown as having had worrying episode of violence or sadism as a child, often signs of a budding psychopathy, nor he seems particularly challenged in his discernment. Quite the contrary: he's a good looking, smart, quippy kid that replies with snappy come-backs to a trained psychologist. He's a bit frail if anything, not unlike so many his age. He's been bullied, sure, but that's not the cause of his behavior. It's the fact that he's got into incel culture, into the manosphere - the bullying is just the spark that sets the oil aflame.\n\nThe way his arch is depicted it's too didascalic for my taste, too unreal. A normal kid, with normal kid's insecurities and a nice family to back him up whose mind is warped by an internet subculture with basically no other concurring factor.\n\nDid class play a role in it? Did the atomization of human interactions in the era of social media have anything to do with it? If so how? Did he have any sort of trauma to prime him to commit such a horrible act of violence? Did religion have anything at all to do with it?\n\nWho cares. Good boy does bad thing because toxic masculinity. A very, very superficial point wrapped into a magnificent package.\n\n(EDIT: corrected typos)",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1jpbjx5/i_think_adolescence_is_pretty_vapid_actually/"
    },
    {
        "id": "1jp830b",
        "author": "GagiHuncho1",
        "title": "Did anyone found some moments in Adolescence to be sarcastic?",
        "content": "Was this show a critique to police officers and people in public sector being shallow? Most of the time i thought they ask most stupid questions ever missing the point, which annoyed shit out of me, that was more distracting than the actual point of a show. Take for example episode one where Bascome said we will process Jamie to a police station (insert name) and to which Mr Miller pointed the obvious \"Of course I know, its right around corner\".",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1jp830b/did_anyone_found_some_moments_in_adolescence_to/"
    },
    {
        "id": "1joe47u",
        "author": "MythicMythness",
        "title": "Million Dollar Secret: hot takes only",
        "content": "Is it the casting? The editing? Or is it just the nature of the game itself? Not sure, but these folks just don’t come across as very likable. \n\nAnyone else have any hot takes on this newest Netflix game show? \n\n**I’m not trying to soapbox here. I’m not saying they are or aren’t actually likable — they just don’t come across as likable. They’d probably be lovely to stand next to in a line and gab about whatever with. Lol",
        "upvotes": 8,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1joe47u/million_dollar_secret_hot_takes_only/"
    }
]