[
    {
        "id": "1o5fl5p",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 29,
        "comments": 1254,
        "media": null,
        "permalink": "/r/realmadrid/comments/1o5fl5p/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1o8qyag",
        "author": "Ready_Ad_1353",
        "title": "[Index] Luka Modric accepted Florentino Perez's offer and will return to Real Madrid either as club ambassador or as a coach in youth academies, after ending his career at AC Milan.",
        "content": "",
        "upvotes": 1047,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3L0UAgxGW3LOGkUyZufcpc6VM11rfBYcUTXeqiatFF0.png?auto=webp&amp;s=59854f55fe7a0e4946963b88e4ba89075146bc2f"
        },
        "permalink": "/r/realmadrid/comments/1o8qyag/index_luka_modric_accepted_florentino_perezs/"
    },
    {
        "id": "1o8q91v",
        "author": "chunchunmaru1129",
        "title": "Jose Mourinho's Real Madrid the greatest team to never win the champions league",
        "content": "The best counter attacking team I have ever seen.Ronaldo was on beast mode.Özil the magician was feeding assists like crazy.Di maria the road runner was on full fuel.\n\nI can't believe such a entertaining team to watch never won the champions league even once.\n\nThat Bayern Munich penalty shootout still hurts to this day.",
        "upvotes": 893,
        "comments": 50,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/rtwj5x3i8lvf1.jpeg?auto=webp&amp;s=1cff60f998425042a5a7a482675886beebf995a3"
        },
        "permalink": "/r/realmadrid/comments/1o8q91v/jose_mourinhos_real_madrid_the_greatest_team_to/"
    },
    {
        "id": "1o939rw",
        "author": "Bald-Eagle619",
        "title": "[Forbes] Mbappe, Vini &amp; Bellingham among top 10 highest paid footballers in 2025",
        "content": "The full list\n\n1. Cristiano Ronaldo: $280 million (€239 million)\n\n2. Lionel Messi: $130 million (€111 million)\n\n3. Karim Benzema: $104 million (€89 million)\n\n4. Kylian Mbappé: $95 million (€81 million)\n\n5. Erling Haaland: $80 million (€68 million)\n\n6. Vinicius Jr: $60 million (€51 million)\n\n7. Mohamed Salah: $55 million (€47 million)\n\n8. Sadio Mané: $54 Million (€46 million)\n\n9. Jude Bellingham: $44 million (€38 million)\n\n10. Lamine Yamal: $43 million (€37 million)",
        "upvotes": 102,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kesqsQ4yWUeUO44L1i-LX8eTz-rPoDRe8VPFuTWz0ok.jpeg?auto=webp&amp;s=18cde465876c4e3cc63a124e5085415a579329f4"
        },
        "permalink": "/r/realmadrid/comments/1o939rw/forbes_mbappe_vini_bellingham_among_top_10/"
    },
    {
        "id": "1o916em",
        "author": "No-Independent2522",
        "title": "Why Real Madrid take so long to announce contract renewals – if they do it at all. This past summer, Madrid sealed three more renewals: those of Courtois (until 2027), Brahim (date unknown) and Asencio (2031). Mendy's renewal agreed in 2024, his contract expired last summer. None has been announced.",
        "content": "",
        "upvotes": 75,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1sADJG8lSKWWQh6qwPduF4QPjFVWw3uqNeYRd7NPcyM.jpeg?auto=webp&amp;s=a63354b640644d3c00204a5bcabbe3df92488057"
        },
        "permalink": "/r/realmadrid/comments/1o916em/why_real_madrid_take_so_long_to_announce_contract/"
    },
    {
        "id": "1o8zdew",
        "author": "cyrusmancub",
        "title": "Dani Ceballos will miss the match against Getafe because of a muscle overload",
        "content": "",
        "upvotes": 60,
        "comments": 14,
        "media": null,
        "permalink": "/r/realmadrid/comments/1o8zdew/dani_ceballos_will_miss_the_match_against_getafe/"
    },
    {
        "id": "1o8wh5s",
        "author": "Critical-Remove-1878",
        "title": "Who do you think that has the higher ceiling between Arda Guler, Mastantuono and Nico Paz?",
        "content": "Obviously it's still to early to tell and the circumstances are completely different. Arda Guler is the best player right now, although he's at this 3rd season in Madrid, while Mastantuono has only played a few games in Europe. Nico Paz is the absolute star on a midtable team.\n\nAll three are young, very promising, left-footed offensive midfielders, although we're already seeing Arda becoming more of an \"8/10\" player, while Mastantuono occupies wider areas.\n\nThere's a big question on whether all 3 can co-exist in a Real Madrid team, assuming we bought Nico back at the end of the season. What do you think? Who has the highest potential and who is more likely to end up playing elsewhere?",
        "upvotes": 67,
        "comments": 88,
        "media": null,
        "permalink": "/r/realmadrid/comments/1o8wh5s/who_do_you_think_that_has_the_higher_ceiling/"
    },
    {
        "id": "1o8guyx",
        "author": "FrrancondonaEra",
        "title": "César Palacios Pérez age 20, position he can play offensive midfield or a false 9",
        "content": "",
        "upvotes": 222,
        "comments": 14,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/tn6brrvg6jvf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1o8guyx/césar_palacios_pérez_age_20_position_he_can_play/"
    },
    {
        "id": "1o89xeu",
        "author": "No-Independent2522",
        "title": "Real Madrid, like their Clasico rivals Barcelona, have always been owned by their members, since their foundation in 1902.  Now, alternatives to this model are being explored by president Florentino Perez and his advisors. Outside investment could come in. Fans would no longer be the sole owners.",
        "content": "Real Madrid are stepping up plans towards a radical change in their ownership structure — one that would allow external investors to purchase stakes in the club for the very first time.\n\nMadrid have been owned by their socios (club members) since being founded in 1902 and any adjustments to that model would require them to approve it in a vote. Only three other clubs have the same structure in Spanish football — Athletic Club, Osasuna and Barcelona.\n\nMadrid are the only club in world football to have recorded revenues over €1billion (£870million; $1.2bn), a total reached over the 2023-24 season according to a Deloitte report (€1.045.5bn was the exact figure).\n\nDespite this, Madrid’s president, Florentino Perez, has spoken about how being owned by members holds them back in certain ways, especially when competing in the transfer market with rival clubs backed by billionaires or sovereign wealth funds.\n\nPerez, 78, first mentioned the possibility of holding a “referendum” about changes to Madrid’s ownership structure at the club’s annual general assembly last year — changes that would allow investment from outside partners while still retaining control for the members, although no concrete proposals were shared.\n\nAccording to sources familiar with the situation — who, like all cited here, asked to speak anonymously as they did not have permission to comment — Madrid’s president is now set to present new details and further plans to move towards these changes at the upcoming general assembly for 2025. No date has been set for the event, but it is expected to be held before the end of November.\n\nOne idea that has already been discussed internally would see Real Madrid being effectively split into two different entities — separating the football side from the business side. In this way, socios would still technically retain ownership, while investors would be invited to purchase shares in the club’s business operations.\n\nThe so-called 50+1 model, the Bundesliga ownership rule designed to ensure members retain a majority stake in clubs, has also been discussed both inside and outside the Bernabeu.\n\nThe full and final details of what would be a very complex operation for tax and legal reasons are still being worked out, sources said. But there is growing anticipation inside and outside the club that the coming weeks could mark the onset of historic change at the Santiago Bernabeu.\n\nWhat is Madrid’s ownership model?\n\nAll Spanish sports clubs were member-owned until the early 1990s, when the national government mandated that professional teams be converted into a special type of private company called sociedades anonimas deportivas (sporting limited companies).\n\nMadrid were among four clubs given special dispensation to remain as they were — along with Barcelona, Athletic and Osasuna.\n\nThese four are all very proud of their special status, which involves democratic processes, including members electing the club’s president, approving (or not) annual accounts, and voting on changes to club statutes at assemblies that must be held once a year.\n\nHow does it work? \n\nUnder the current rules, only the children or grandchildren of Madrid socios can apply to become Madrid socios. And just a select number of the club’s 100,000 or so members are allowed to vote at the annual assembly. These are called socios compromisarios (delegate members). They number around 2,000 and are chosen in a vote in which all members can participate.\n\nStill, Madrid’s governance model is integral to the club’s self-image, although few doubt that Perez has been the most influential in setting policy during his two spells as president (2000-2006 and since 2009). Compared to the three other socio-owned clubs in La Liga, Madrid’s assemblies feature very little public dissent. The board’s plans are almost always voted through by a large majority of delegates.\n\nIn 2012, changes to the club’s statutes mandating that any presidential candidate must have been a socio for at least 20 years, and must provide a guarantee of 15 per cent of the club’s annual budget (this was €1.1bn for 2024-25), were voted through with 997 votes in favour, 100 against, and 15 abstentions.\n\nMore recently, proposals that allowed the club to partner with U.S. investment companies to finance the expensive Bernabeu rebuild were also voted through by compromisarios with similarly large majorities.\n\nWhat external partners do Madrid already have?\n\nThe approximate €1.8billion cost of the refurbished Bernabeu — along with the impact of the Covid-19 pandemic — led Madrid to look for outside financial support in recent years.\n\nIn 2017, they agreed a deal with the U.S. private equity group Providence, receiving €200m in exchange for a share of future sponsorship revenues. In 2021, that deal was renegotiated, with another €50m provided.\n\nIn May 2022, U.S. investor Sixth Street provided €360m in funding for the Bernabeu rebuild. That deal saw a 20-year partnership run through a joint venture containing all of Madrid’s in-stadium income, with the exception of season-ticket sales.\n\nStadium management specialist Legends — in which Sixth Street are majority shareholders — also partnered with Madrid to run the club’s retail operations and all the Bernabeu’s restaurants and bars. A separate ‘Bernabeu’ company and brand has also been established to manage all the club’s ‘non-football’ activities, from Taylor Swift concerts to an NFL game and corporate events.\n\nHow has Perez been preparing the ground for change?\n\nPerez has often argued that his first priority is to protect Madrid’s socio-owned model, and that this motivates his regular battles with La Liga and UEFA, as well as his continued promotion of a European Super League.\n\nBut he has also spoken about how the socio model makes it more difficult to compete with other top European clubs whose owners can more easily inject money directly into their teams.\n\nHe mentioned all the above again at Madrid’s November 2024 assembly, while making what was a surprise announcement of a potential future vote on changes to how the club was governed and owned.\n\n“I confirm to you that we will bring to this assembly a proposal for the club’s corporate reorganisation that clearly secures our future, protects us from the threats we face, and, above all, guarantees that we, the members, are true owners of our club, real and full owners of our economic assets,” Perez said.\n\n“And, of course, introducing the necessary elements so that effective control of the club always remains in the hands of its members. It will be all of us members who, in a referendum, will decide our destiny together.”\n\nNot much has been said in public since then by Perez about this referendum, or what the question might be. But the Bernabeu hierarchy are well aware of the value of their club. One source suggested Madrid could be worth as much as €10billion — the same as the Dallas Cowboys, the NFL’s most valuable franchise.\n\nWhat might happen now?\n\nMultiple sources have told The Athletic that the Madrid hierarchy, along with close advisors at Key Capital Partners and the law firm Clifford Chance (both of whom played key roles in the failed European Super League), have been discussing possible new ownership models that would allow for external investment while also keeping as much control as possible with the club’s socios.\n\nHowever, it still remains unclear exactly what direction the club will now take.\n\nOne idea is to split Madrid into two entities — one covering football and the other the club’s business. In this scenario, Madrid would be able to invite investors to buy stakes in their business side (such as TV rights or stadium revenues), while ownership of the club would legally remain in the hands of the socios through its charitable foundation.\n\nBut how this would work in practice, and how it would match up to Spanish corporate and tax law, has proved difficult to finalise. It is also a very sensitive topic and would be controversial among at least some Madrid supporters.\n\nThe option of allowing members to sell their share, perhaps yielding windfalls of somewhere between €50,000- €100,000, was discussed internally but has now been taken off the table, sources say.\n\nAnother challenge, this time from a potential investor’s perspective, is that many Bernabeu season tickets currently cost less than the price of most VIP packages for just one game. For an external investor, fewer local socios, and more one-off visitors to the stadium, would be preferable. But those local socios are Perez’s power base, and keeping them happy is a big priority for him.\n\nAlso, sources familiar with Madrid’s internal discussions say that the current hierarchy wants to ensure that decisions such as hiring or firing the coach and player transfers would always be made by the board, which is ultimately answerable to the socios.\n\nA potentially more palatable option for Madrid’s board and socios is something closer to the Bundesliga’s 50+1 rule, in which club members always retain a majority (50 per cent plus one vote) of decision-making power.\n\nBut again, it is not clear how the club’s ownership structure could move towards this without encountering significant complications; for the current leadership, the socios and potential investors. One industry source also suggested that the 49 per cent on offer to external investors in this scenario would be made less appealing by the lack of control it would bring — meaning it would therefore be badly monetised.\n\nPerez has always been very clear that he does not want a situation where any outsiders could take control of Real Madrid. “Nobody should be able to sweet-talk their way into control,” he told socios back in 2012. “And I don’t want to think bad of anyone, not of Arab sheikhs or Russians, but this is our own thing.”\n\nNo matter what new model is chosen, any money raised from investors would go into the club: to strengthen the team, or go towards paying the Bernabeu redevelopment costs.\n\nNobody is going to ‘cash out’, and Perez himself does not stand to benefit financially. The 78-year-old, who has been attending games at the Bernabeu since the 1950s, is looking for a way to retain control in the short term, while safeguarding the club’s competitiveness at the top level far into the future.\n\nWhatever is decided, some kind of change in Madrid’s club model is coming, and has been in preparation for some time.\n\nHow exactly to find the right balance between different interests involved — lifelong fans, current directors, future investors — remains to be seen. The devil could be in the details of whatever final plan is eventually put to socios to vote on.",
        "upvotes": 296,
        "comments": 94,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vXtNIU1OzJhJJZ33Fkkmx7xwAUESzs-eahymJlydR04.jpeg?auto=webp&amp;s=947ff76ddc9a47f5f975a4fcb41125c2060f28c5"
        },
        "permalink": "/r/realmadrid/comments/1o89xeu/real_madrid_like_their_clasico_rivals_barcelona/"
    },
    {
        "id": "1o867dp",
        "author": "No-Independent2522",
        "title": "All I pray for is our main starting XI to be available for big matches",
        "content": "",
        "upvotes": 278,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/nunfrydf7hvf1.jpeg?auto=webp&amp;s=ad36b2e61fce90b7bfa433f58e256f19d922f8de"
        },
        "permalink": "/r/realmadrid/comments/1o867dp/all_i_pray_for_is_our_main_starting_xi_to_be/"
    },
    {
        "id": "1o8i6c2",
        "author": "ManuMora98",
        "title": "[Fem] PSG W 1 - 2 Real Madrid W | Ajibade 58'; Feller 29', Alba 45'+2 | We get our 2nd win in the CL and our first win ever against PSG, 6 points out of 6 | Women's CL Match Day 2",
        "content": "",
        "upvotes": 68,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/e30x0ynyfjvf1.jpeg?auto=webp&amp;s=4c15bbf396655b1156f7978e772456c7ec0a877d"
        },
        "permalink": "/r/realmadrid/comments/1o8i6c2/fem_psg_w_1_2_real_madrid_w_ajibade_58_feller_29/"
    },
    {
        "id": "1o82oxy",
        "author": "landofphi",
        "title": "Gareth Bale: \"Going bankrupt always scared me. You read about athletes who end their careers &amp; end up bankrupt. They don’t know how to manage their money, they don’t know what to do with all that stuff. Many athletes live a life of luxury, something I tried not to do\"",
        "content": "The full quote\nThere was one thing that always scared me inside. You read articles about when people finish professional sports, they go bankrupt. They don’t know how to manage their money, they don’t know how to do all these things.\n\"A lot of, I imagine, athletes live a big lavish lifestyle. I try not to do that. I always had one eye on what life would be like after football. When I finish, I stop getting the pay cheque. How do people then restructure their lives?\n\"So I was always trying to diversify from quite early on. I always had this pillar idea where I would try and invest my money in different things. If one pillar got chopped down and didn’t work, the whole building is not going to fall down.\"",
        "upvotes": 436,
        "comments": 24,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/e5xss9vecgvf1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1o82oxy/gareth_bale_going_bankrupt_always_scared_me_you/"
    },
    {
        "id": "1o81czo",
        "author": "ezgimantocu",
        "title": "Arda Güler Opens Up About His Bond With Kylian Mbappé: “Sometimes, One Look Is Enough”",
        "content": "In an exclusive and heartfelt interview with **L’Equipe Magazine**, Turkish prodigy **Arda Güler** has given fans a rare glimpse into his life at **Real Madrid**, his evolving friendship with **Kylian Mbappé**, and the lessons he’s learned since joining one of football’s greatest clubs.",
        "upvotes": 352,
        "comments": 30,
        "media": null,
        "permalink": "/r/realmadrid/comments/1o81czo/arda_güler_opens_up_about_his_bond_with_kylian/"
    },
    {
        "id": "1o81xij",
        "author": "No-Independent2522",
        "title": "Real Madrid face Dean Huijsen injury concern amid fears Spain defender will miss Clasico clash against Barcelona",
        "content": "",
        "upvotes": 255,
        "comments": 42,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-C-QJlYqkL1NffrZpezZMfKdIY4Ye3e7yRbYGSxoI94.jpeg?auto=webp&amp;s=1041b7caa571f3acc9592fe8b6e8630c1968a22e"
        },
        "permalink": "/r/realmadrid/comments/1o81xij/real_madrid_face_dean_huijsen_injury_concern_amid/"
    },
    {
        "id": "1o8df3q",
        "author": "Outrageous-Brain-395",
        "title": "What’s the most memorable moment you have of this club that has largely been forgotten?",
        "content": "I know that Ramos’ goal vs Atlético is a memorable goal, so was Cristiano’s bicycle kick vs Juventus, but both of these are iconic and most, if not all, Real Madrid fans remember them. But I’m looking for goals that were memorable and have somehow become forgotten throughout our immense history. For me it was Higuain’s goal vs Osasuna in 2008 that resulted in us winning LaLiga AND making Barca give us a guard of honor in the Clásico.",
        "upvotes": 51,
        "comments": 62,
        "media": null,
        "permalink": "/r/realmadrid/comments/1o8df3q/whats_the_most_memorable_moment_you_have_of_this/"
    },
    {
        "id": "1o7skvx",
        "author": "rcfith",
        "title": "Miss him so much. He was an absolute gem of a footballer.. The German sniper",
        "content": "",
        "upvotes": 924,
        "comments": 24,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/begua2fegdvf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1o7skvx/miss_him_so_much_he_was_an_absolute_gem_of_a/"
    },
    {
        "id": "1o8gfh8",
        "author": "ManuMora98",
        "title": "PSG W 0 - [2] Real Madrid W | Alba Redondo 45'+2",
        "content": "",
        "upvotes": 10,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KGrq6KXXEOFMk450z9vW3REadUdAkcGb5OVqJarfdXI.jpeg?auto=webp&amp;s=2b34484ca38e64e8e621885ed5666bf9b682336c"
        },
        "permalink": "/r/realmadrid/comments/1o8gfh8/psg_w_0_2_real_madrid_w_alba_redondo_452/"
    },
    {
        "id": "1o7he6h",
        "author": "Nyghl",
        "title": "\"I have full confidence in Xabi Alonso. If one day he tells me to play goalkeeper, I’LL BUY GLOVES!\" - Arda Güler to L'Equipe in a recent interview.",
        "content": "(Put Meme flair due to the image edit I've done :D)",
        "upvotes": 1359,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/337rb8vz7bvf1.png?auto=webp&amp;s=a08de6329a8a58a84517b874da99dad41fea41b5"
        },
        "permalink": "/r/realmadrid/comments/1o7he6h/i_have_full_confidence_in_xabi_alonso_if_one_day/"
    },
    {
        "id": "1o8dbli",
        "author": "ManuMora98",
        "title": "[Fem] Our Starting XI against PSG (away) | Women's CL Match Day 2",
        "content": "",
        "upvotes": 12,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/pjxv51ybjivf1.jpeg?auto=webp&amp;s=e88a62f776218d7544ea8215b88f68161c57bbe4"
        },
        "permalink": "/r/realmadrid/comments/1o8dbli/fem_our_starting_xi_against_psg_away_womens_cl/"
    },
    {
        "id": "1o8fxly",
        "author": "ManuMora98",
        "title": "PSG W 0 - [1] Real Madrid W | Naomie Feller 28' (Yasmin assist)",
        "content": "",
        "upvotes": 6,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/O5nIUJz4hnmoTLVJ_o5sb2B4Fvf8-8NSYEEKWYKwnhA.jpeg?auto=webp&amp;s=3da9783e660abbb85b856d9c8552ffaece3cfbe0"
        },
        "permalink": "/r/realmadrid/comments/1o8fxly/psg_w_0_1_real_madrid_w_naomie_feller_28_yasmin/"
    },
    {
        "id": "1o7q4gf",
        "author": "FrrancondonaEra",
        "title": "cant wait for trent to come back and piss the scouser even more.",
        "content": "",
        "upvotes": 339,
        "comments": 19,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/em5u0dlewcvf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1o7q4gf/cant_wait_for_trent_to_come_back_and_piss_the/"
    },
    {
        "id": "1o94yfx",
        "author": "FlyingWaterMen",
        "title": "Ask Me Anything: Demystifying - Florentino Perez is rumored to propose a new ownership structure in the next general assembly of Real Madrid. I have been studying the financial reports of Real Madrid for half a decade, and read every article about this rumor. Ask me any question about it.",
        "content": "Some of my previous work here on the subreddit: https://old.reddit.com/r/realmadrid/comments/1eb16sw/oc_in_depth_overview_and_consequences_of_real/\n\nI have keen interest in financial systems, and have researched extensively on the subject of the new ownership change at Real Madrid.\n\nIt has its pros as well as its cons. Lets start with what is current ownership structure of Real Madrid:\n\n1. Real Madrid is fully owned by its members (socios) - 100% ownership where they pay an annual fee of membership upto a certain age after which it becomes free.\n\n2. Its nearly impossible for anyone to become socio unless they get the membership transferred from their family member (parents, grandparents) to them.\n\n3. Socios vote on the assembly for various resolutions just like it happens in any shareholder meeting of a public listed company.\n\n4. Socios vote every term for a president who takes control of the club and manages its operations.\n\n5. President does not make a single penny for his job and runs the board only for the welfare of the club. They do not own the club. \n\n6. Real Madrid needs to run self sustainably manner because there is nobody to inject capital or do a fund raise if a crisis or catastrophe hits the club (example COVID, when Madrid had to sell players without buying anyone for years)\n\n7. Barcelona have the same exact structure, and runs on the same principles. The only difference is that they have a limit on president running for consecutive terms, as well as the minimum budget that needs to be put as collateral can be shared by all board members.\n\nNew ownership structure proposed:\n\n1. Real Madrid will issue shares and convert the club from 100% ownership to a hypothetical 50+1 structure akin to Bayern Munich.\n\n2. Let this be clear: Real Madrid will still be majority controlled by the socios, there is not a shadow of doubt about it. Everything remains as same as above, only the new difference is the ability to raise capital.\n\n3. Now the club has the option to raise capital by offering upto 49% equity of the company that will be established. \n\n4. Club doesn't needs to offer 49% in one-go, they can opt for something as low as 5% for 500M euros at 10B valuation or simply do not raise any capital at all.\n\n5. In all possibility, this will be the case. Real Madrid will not offer any shares at all. Its just a backup insurance in case a crisis hits the club.\n\n6. If for some reason club does offer shares, all of the proceeds will go directly to the club. No - Perez, JAS, Saudi, Socios, no-one can use the proceeds, only the club can use it for its own needs.\n\n7. If the club comes up with a expansion plan that needs heavy capital with associated risk - only then would Madrid offer its equity and even still at very low amounts.\n\n---\n\nSo in essence,\n\nFlorentino Perez wants to safeguard Real Madrid's financial health for the future. Club has near 0 net debt (most of the 1.1B debt is tied with Bernabeu renovations which is already generating 350M of income and average interest rates are as low as 3% which is less than the inflation rate itself!)\n\nClub has rebuilt a sensational young team and still generates healthy 250M EBITDA each year that can be used for buying new players. There's 0 need of any fresh capital unless club comes up with a huge expansion plan.\n\n---\n\nPros:\n\n1. Real Madrid gains an enormous financial leverage as the club can raise upto 49% of equity which at 10B valuation is close to 4.9B euros if any need arrives in the future.\n\n2. Real Madrid gain huge financial transparency for the future that will stop from a Bartomeu situation to ever occur since the club will have to adhere with stricter financial rules and have to answer to the minority investors if any fresh capital is raised in the future.\n\n3. Each socio gains an actual share to cement their legitimacy and can ask for more transparent financial disclosures again improving the corporate governance of the club.\n\nCons:\n\n1. Real Madrid ceases to be non-profit organisation on the day it raises capital because minority investors will want a financial incentive at the end of the day. If the synergies are well matched that it can overturned practically by leveraging the club's brand for the minority investor's gain. Bayern does this with Adidas, Allianz, Audi partnership.\n\n2. Socios's shares will get diluted everytime there's a fresh capital raise however - Club cannot raise capital without socios's approval and if they do, it will definitely be either to overcome a crisis or a huge expansion plan and in both cases - the shareholder value of socios will rise.\n\n3. There can be a divergence from sporting goals to financial goals if the structure is not setup well and any minority investor of the future is allowed in without proper due diligence.\n\n---\n\nTLDR: Real Madrid will be employing a high risk - high reward planning with this new structure. On hand they gain an enormous financial security and leverage for the future but with great power comes great responsibility.\n\nI welcome the idea but have some cynicism on how the fund raise will happen if ever - My ideal world would be to convert to 50+1 but do not raise any fresh capital and continue running the club as it is with multi-folds higher level of corporate governance and financial transparency in post-Perez world to ensure our next president is as pure to the cause and not there just for corruption or financial rewards.\n\nThe 49% backup equity shall only be touched in a case of extreme crisis to give the club a new chance and even still no more than 5% equity shall ever be diluted in a single round at any point of time.\n\nEverything else runs as it has always been running.\n\n\nNow any questions? Feel free to drop them below and I will try my best to answer it to best of my abilities!",
        "upvotes": 0,
        "comments": 19,
        "media": null,
        "permalink": "/r/realmadrid/comments/1o94yfx/ask_me_anything_demystifying_florentino_perez_is/"
    },
    {
        "id": "1o79utx",
        "author": "ViniciusFastAF",
        "title": "If both Kaká and Özil were at the absolute peak of their powers and completely free of injuries, who would you start in your Real Madrid midfield ?",
        "content": "",
        "upvotes": 1357,
        "comments": 248,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/13njxzwct9vf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1o79utx/if_both_kaká_and_özil_were_at_the_absolute_peak/"
    },
    {
        "id": "1o7gs2y",
        "author": "TheFeatherDiaries",
        "title": "Arda Guler : ''When I wasn't playing, it was difficult, but it fueled my ambition. I was biding my time.''",
        "content": "Arda Güler on joining Real Madrid from Fenerbahçe  : I knew I was joining the biggest club in the world. But from my very first training session, I realized I had the quality to play here. I never doubted that I would eventually succeed  \n  \nArda Güler on lack of playing time in the last two seasons : Juni Calafat had explained the plan to me. He told me the first season would be difficult, and that it was logical for a player who had only experienced football in Turkey. He also told me that I was coming in for the post-Modrić and Kroos era. Everything was clear and honest  and that’s how it should be.  \n  \nArda Güler on Carlo Ancelotti: “Carlo Ancelotti is one of the greatest coaches in history. We mustn’t forget that he told the press that I would become one of the best midfielders in the world one day. Davide Ancelotti also always tried to help me. I’m grateful. When I wasn't playing, it was difficult, but it fueled my ambition: I was biding my time.''\n\nArda Güler on winning UCL 2023/24 : “UCL 2023/24? I never won it. It wasn’t mine. We have to go and win a new one.\"\n\nArda Güler on his chemistry with Mbappe:  “Mbappé’s qualities and mine are made for each other. We understand each other really well, it’s fluid. Sometimes, we talk a little before matches - *''Today, we should do this, that.* \" There are also nights when a glance is enough.”\n\nArda Güler on Mbappe leaving his CF spot : “Mbappé criticized for dropping too deep sometimes? I think we have to let him play where he wants. He must benefit from the freedom his talent gives him the right for. If he drops into the middle, if he drops back a little, it’s not for nothing. He has the knowledge to do it, he understands what the game demands. When he does that, it’s up to me to go and occupy his place.”\n\n Arda Güler on comparison with Özil : “Me &amp; Mbappé compared with Özil &amp; Cristiano? It’s cool, it’s nice. They’ve done great things. But it’s always the team that goes after the big achievements, never two players.”\n\nArda Güler on Juni Calafat : “Juni Calafat helped me a lot last year, he explained to me that I need to have patience because of the legends at the club, I understood that, I was a kid coming from Turkey.”\n\nArda Güler on his relationship with Xabi : “I have full confidence in Xabi Alonso’s plans. If one day he tells me to play goalkeeper, I’ll buy gloves!”\n\nArda Güler on expectations from him: ''The noise around me — I’ve never seen it as pressure. It’s something that actually helps me push further. It’s like I need that.''\n\nArda Güler on the Xabi Alonso era : I’m convinced we’re moving in the right direction. I don’t know exactly how long it will take, but we’ll be ready when the time really comes.",
        "upvotes": 347,
        "comments": 26,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/reG0lu5WLSaMyqObwWpwVMMPNbnvEoV9ds7Q8L-sO0k.jpeg?auto=webp&amp;s=f610b3f6e0384c0e68ad2f32b85bc1395e0e4cc9"
        },
        "permalink": "/r/realmadrid/comments/1o7gs2y/arda_guler_when_i_wasnt_playing_it_was_difficult/"
    },
    {
        "id": "1o802zv",
        "author": "IAmAllergicToHumans",
        "title": "The Essential Madrid Knowledge",
        "content": "Heya I'm new to the football/soccer field and I'd like to be able to support and defend my favorite club (esp with the large amount of barca fans in my area) so could you give me essential ball knowledge for Real Madrid? Stuff like great players, matches, rivalries, nicknames, and the like from any time period.",
        "upvotes": 16,
        "comments": 40,
        "media": null,
        "permalink": "/r/realmadrid/comments/1o802zv/the_essential_madrid_knowledge/"
    },
    {
        "id": "1o77o50",
        "author": "Bosphore9",
        "title": "Today is Mesut Özil’s birthday, here’s his last match for Real Madrid",
        "content": "Joined in 2010 and left in late 2013. The former and retired Real Madrid player is now 37 years old. Here’s his last match of one of the best playmakers that ever existed for the club. The match took place on 26 August 2013, the second journey of LaLiga BBVA in which he was substituted after an hour. Benched in the next game he left the club the day after.",
        "upvotes": 628,
        "comments": 19,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zwml0ahn99vf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1o77o50/today_is_mesut_özils_birthday_heres_his_last/"
    },
    {
        "id": "1o8x0ib",
        "author": "ezgimantocu",
        "title": "Xabi Alonso Pushing Real Madrid to Sign Chelsea Star Enzo Fernández - NSF Daily News",
        "content": "According to reports from *Fichajes,* **Xabi Alonso** has identified **Chelsea’s Argentine midfielder Enzo Fernández** as the ideal successor to club legends **Luka Modrić** and **Toni Kroos**.",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/realmadrid/comments/1o8x0ib/xabi_alonso_pushing_real_madrid_to_sign_chelsea/"
    },
    {
        "id": "1o7hxoy",
        "author": "911Maestro",
        "title": "Which player you adored from a different club and wanted in?",
        "content": "For me it was a dream to see Kevin De Bruyne alongside Cristiano and then link up with Benz-Vini.\nI believe he would donned it and would have even surpassed the legacy of Ozil at Real. \nEspecially after Kroos, he would have been there to thread the passes to Kylian and Vini.\nWhat Bellingham does in attach + What Kroos did for assists + What Ozil did , it would have all been in 1 person in that 17 number Real jersey.",
        "upvotes": 77,
        "comments": 154,
        "media": null,
        "permalink": "/r/realmadrid/comments/1o7hxoy/which_player_you_adored_from_a_different_club_and/"
    },
    {
        "id": "1o7ju2i",
        "author": "Humble-Ad3419",
        "title": "DECLARACIONES SOBRE CORRUPCIÓN EN EL FC BARCELONA",
        "content": "LLUIS CANUT (PERIODISTA TV3):\n\n\n\n\"A mí me contó una persona vinculada con el estamento arbitral que la primera vez que conoció a Núñez como presidente del Barça, Núñez le expresó su deseo oculto de querer comprar algún día a un árbitro. Hasta que se encontraron con un árbitro con problemas económicos para pagar las letras de su piso\", \"El Barça, a través de la empresa de Núñez y Navarro, negoció con el banco del árbitro las letras que se tenían que descontar del piso y se las iba pagando poco a poco en función de los partidos que dirigía al FC Barcelona\". \n\n\\-------------------------------------------------------------------------\n\nPACO ROIG (EX PRESIDENTE DEL VALENCIA):\n\n\n\nUn exárbitro me conto que un representante del Barça le dijo en un Barcelona-Elche, 'oye me puedes hacer un favor, yo quiero entrar a conocer al colegiado del partido'. Decía que llevaba un millón de pesetas. Y decía: si gana el Barcelona, el millón de pelotas se lo daba al árbitro. Si pierde el Barcelona, lo devuelvo. Y si empata, me quedo la mitad. Esas cosas pasaban a lo largo de muchos años\".\n\n\\---------------------------------------------------------------------\n\nLLUIS BASAT (EX CANDIDATO A LA PRESIDENCIA DEL BARÇA):\n\n\n\n“En 2003 una persona muy importante del club me dijo que que no podría ser presidente porque \"no sabía cómo comprar un árbitro\".\n\n\\---------------------------------------------------------------------------\n\nSIQUE RODRÍGUEZ (PERIODISTA CULE DE SER CATALUÑA QUE DESTAPO EL CASO NEGREIRA): \n\n\n\n\"A principios de febrero, ya lo tenemos para sacarlo. Ahí, hablamos con la gente del Barça y le decimos qué es lo que tenemos, con el club como principal implicado, para que respondan en el programa o preparen una respuesta, porque es un tema muy grave\".\n\n\"Ahí es cuando en el Barça nos piden si podemos aguantar el tema un par de semanas para preparar la respuesta a nivel interno, público... De hecho, la frase textual es: 'Somos un condenado a muerte que os pide el último deseo'\".\n\n“Tuve una reunión con 2 personas, nos dijeron dónde estuvo Negreira años atrás jugando al póker… sí, quedaba en bares con los árbitros… y que había maletines… pero quienes lo decían no querían aparecer públicamente“.\n\n\\-------------------------------------------------------------------\n\nMILLA (EX JUGADOR DEL BARCELONA Y REAL MADRID):\n\n\n\nEl jugador del Real Madrid Luis Milla aseguró ayer en el programa El Largero, de la cadena Ser, que en las vísperas del último partido de Liga de la temporada pasada, que su equipo disputó contra el Tenerife, recibió una llamada de un compañero de profesión, quien le ofreció dinero por dejarse ganar. En aquel partido el Madrid, al ser derrotado por 3-2, perdió la Liga...\n\n\\-------------------------------------------------------------------\n\n GODALL (VICEPRESIDENTE DEL BARÇA):\n\n\n\n (2012) \"Tenemos que estar al lado de las entidades en las que se ejerce el poder y no darles la espalda. Recuerdo que en su día Laporta lo tuvo clarísimo. ¿A qué presidente apoya Florentino? A Gerardo González. Entonces al Barça le conviene apoyar a Villar y tener una buena relación con la federación, donde se cuecen los comités de árbitros, la competición y la Liga\"... \n\nY luego conectó su buena relación con la federación con lo que él denominó un \"saldo arbitral favorable\".\n\n\\----------------------------------------------------------------------\n\nJOSE MARIA ENRIQUEZ NEGREIRA (HIJO DE NEGREIRA):\n\n\n\n\"El Barça mintió en Hacienda para desligarse de mi padre y me usó como pretexto\", \"Los 7,5 millones no fueron por los informes, yo cobré 60.000 €\".\n\n\\---------------------------------------------------------------------\n\nANASTASIO MAYORAL CEDENILLA (ÁRBITRO):\n\n\n\nEn 1985, el árbitro de Primera División Anastasio Mayoral Cedenilla denunció que le ofrecieron 1,5 millones de pesetas para favorecer al Barça ante el Lleida en Copa del Rey.\n\n\\--------------------------------------------------------------------\n\nJOSE VICENTE HERNAEZ (PERIODISTA): \n\n\n\n(1994) Año siguiente de entrar Enríquez Negreira en el CTA.\n\nArtículos de Joe Vicente Hernáez después de un partido Barcelona - Osasuna y Barcelona - Atlético:\n\n\"Al Barça naturalmente, no le hace falta recusar a un arbitro. Basta con que un día cualquiera de partido se le insinúe algo a Enríquez Negreira (miembro del Comité de Designación) en el palco presidencial del Camp Nou, al que suele ir con relativa frecuencia. O en cualquier partido de su hijo con uno de los equipos inferiores del Barça. En esta Loto futbolística le vuelve a tocar el primer premio al mismo. Que casualidad. Al equipo  azul-grana le han regalado ya varios puntos en esta Liga. Curiosamente, desde que el ex colegiado catalán Enríquez Negreira esta en el Comité, el Barcelona es el único club para el que no existe el problema arbitral\".\n\nJosé Vicente Hernáez ya lo denunciaba ya en sus artículos. Al igual que también lo hicieron, los presidentes Mendoza y Jesús Gil.\n\n\n\n\n\n\n\n\n\n",
        "upvotes": 57,
        "comments": 32,
        "media": null,
        "permalink": "/r/realmadrid/comments/1o7ju2i/declaraciones_sobre_corrupción_en_el_fc_barcelona/"
    },
    {
        "id": "1o7ml5x",
        "author": "ManuMora98",
        "title": "[Basket] First win of the week as we defeat Partizan Belgrade 93-86. This Friday, we visit Belgrade to face Red Star",
        "content": "",
        "upvotes": 40,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0sgzh2kj7cvf1.jpeg?auto=webp&amp;s=5a5a3c2f7caa561eaebb9b88c06806f097ab4adf"
        },
        "permalink": "/r/realmadrid/comments/1o7ml5x/basket_first_win_of_the_week_as_we_defeat/"
    }
]