[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 14,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1of2s3h",
        "author": "Longjumping_Land_977",
        "title": "Ajike Owens’ mother shares brutal response to so-called ‘apology’ Susan Lorincz gave her",
        "content": "",
        "upvotes": 472,
        "comments": 78,
        "media": null,
        "permalink": "/r/netflix/comments/1of2s3h/ajike_owens_mother_shares_brutal_response_to/"
    },
    {
        "id": "1ofsij2",
        "author": "wilhelmstarscream",
        "title": "Netflix changed country of my account to get me to end grandfathered lower rate",
        "content": "Netflix changed my account from U.S. to Venezuela to try to get me to close my grandfathered $5.99 account. I don’t know where that rate came from, Netflix had it as an option. \n\nSuddenly my billing said it was paused and I had to update payment,  but Netflix blocked every option I had to update the payment method. I opened the account in the U.S. in 2010 and they changed my billing and phone number to Venezuela and said the account was opened in Venezuela a year ago. Their customer service just keeps pushing for me to close the account and open a new one under the new rates. When I try to update the billing, they changed my U.S. phone number to a Venezuela phone area code and it doesn’t let me change it or verify the new billing method.\n\nI have email proof that the account was opened in the U.S. in 2010. Netflix claims they only keep billing records for a year so they have no record of it. At first I thought I might have been hacked but their customer service is so intent on me ending the account. \n\nTheir customer service actually said,” and just to let you know if your account was created in United States you should be paying us $17.99 not $5.99.”\n\nSeems like I have no recourse and it’s a dirty way they’re getting longtime customers to end their grandfathered rate accounts.",
        "upvotes": 8,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1ofsij2/netflix_changed_country_of_my_account_to_get_me/"
    },
    {
        "id": "1offdqx",
        "author": "TurbulentFlame",
        "title": "A House of Dynamite felt more like a fizzle than a bang.",
        "content": "I don't want to say too much about it, because I know it just came out for streaming and people are going to be watching it. But I just watched *A House of Dynamite* and I'm both so frustrated and beyond disappointed, at the same time.\n\nThe trailer for this movie had me super hyped. I've been looking forward to watching this movie all week. While the movie underperformed, in my opinion, it wasn't actually terrible; just kind of a let down from what I expected out of the trailer. But still not awful...at least not until that \"ending\". That was just so anticlimactic and bad. I don't know for sure what I was expecting instead, but that wasn't it.\n\nWhat is it with Netflix and these cliffhangers? So many quality films have felt ruined by poor endings: *How It Ends*, *Fractured*, *Leave the World Behind* and now *A House of Dynamite*, just to name a few.\n\nWhy does Netflix keep doing this?",
        "upvotes": 52,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1offdqx/a_house_of_dynamite_felt_more_like_a_fizzle_than/"
    },
    {
        "id": "1ofm2aq",
        "author": "Dragonbite2020",
        "title": "Netflix Monster Series Has Competition: Gacy’s Devil in Disguise Is as Good as Dahmer S1",
        "content": "Just started watching *Devil in Disguise: John Wayne Gacy* by accident. I was watching *The Gacy Tapes* on Netflix, then googled it and found out Peacock made a whole series. I was curious if Monster would ever do Gacy, but another platform just created it. It is a good watch if you like Monster series and have seen the Gacy tapes as well. \n\nWow — Netflix really has to step up its game now.\n\nI’d say *Devil in Disguise: John Wayne Gacy* is just as good as *Dahmer: Monster* Season 1. Seasons 2 and 3 of *Monster* are okay, but now Netflix has real competition — everyone’s jumping into the true crime series game.",
        "upvotes": 11,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ofm2aq/netflix_monster_series_has_competition_gacys/"
    },
    {
        "id": "1ofgi68",
        "author": "sa1218329",
        "title": "Layout change",
        "content": "I know this sounds petty, but the new menu layout is awful. Why bury “continue watching” and my list. And why default ti the generic “home” instead of “my Netflix”? The thumbnail carousel shows less movies at one time causing more scrolling. I wish there was a setting to retain classic layout ",
        "upvotes": 14,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ofgi68/layout_change/"
    },
    {
        "id": "1ofcsi5",
        "author": "Logical_Order",
        "title": "We didn’t get any fun Halloween movies this year",
        "content": "Or did I miss it?\n\nWas just thinking Netflix usually releases some cheesy Halloween stuff. We have not had anything like that this year which is a bummer. Anyway, any recommendations on a cozy watch but not horror? ",
        "upvotes": 23,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1ofcsi5/we_didnt_get_any_fun_halloween_movies_this_year/"
    },
    {
        "id": "1ofvchr",
        "author": "ShirtyManhole",
        "title": "Why do they shoot these shows in literal darkness?",
        "content": "Just finished The Black Rabbit. Really enjoyed it. Slow burn… two kids forged by a rough upbringing, bound together by brotherly love in a highly toxic way.\n\nBut why do they shoot half of these shows in literal darkness? I spent more time squinting at shadows than actually watching. At some points, it was more similar to listening to an audiobook than watching a show. I get that it’s moody, atmospheric, and dark for effect. However I feel I need military-grade night-vision goggles to follow the plot.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ofvchr/why_do_they_shoot_these_shows_in_literal_darkness/"
    },
    {
        "id": "1ofreen",
        "author": "peoplemagazine",
        "title": "Seth Rogen Went 'Way Off Script' in Nobody Wants This Season 2, Adam Brody Reveals: 'He Just Let It Rip'",
        "content": "",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ofreen/seth_rogen_went_way_off_script_in_nobody_wants/"
    },
    {
        "id": "1ofeeph",
        "author": "Original2021",
        "title": "Bravo to the writers of the diplomat!",
        "content": "I just started watching the series. The season two ending is one of the best finales I’ve ever seen. Bravo to the cast and writers. Give Allison Janey the Emmy already! Well done! ",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ofeeph/bravo_to_the_writers_of_the_diplomat/"
    },
    {
        "id": "1ofi58n",
        "author": "Mix_Loves_Typhlosion",
        "title": "Children's television show that was available on Netflix sometime from 2015-2017. Anyone else remember it?",
        "content": "I'm gonna separate the definitive details from the possibly false details, because I was pretty young at the time.\n\nHere are the definitive details:\n\n1. Very few episodes, less than five.\n2. Was a collection of videos with costumed animal characters and kids singing well known nursery rhymes.\n3. Was probably filmed sometime in the 90s, but no earlier.\n4. There was no plot, simply a compilation of short songs.\n5. One of the episodes had a Yankee Doodle song filmed in the forest.\n6. (This one is really important) One of the characters was a green bipedal reptile in a purple wizard outfit with a cap and robes. He may have had yellow stars on his hat and robes as well but not definitive.\n7. The intro to each episode was a very short looping animation of the animal characters dancing in a 2D hand-drawn style over some type of patterned background.\n\nThere is only one possibly false detail, one of the characters may have been a bipedal bear with a top hat (lol now that I think about it it kinda reminds me of freddy fazbear)",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ofi58n/childrens_television_show_that_was_available_on/"
    },
    {
        "id": "1oen44j",
        "author": "gailthesnail2",
        "title": "The Perfect Neighbor - Lorincz’s lone supporter in court, her sister, charged with felony child neglect",
        "content": "I’m assuming this was the boy seen in the documentary. I was wondering how anyone could show up after the shooting to help this woman. They’re both narcissistic and antisocial with no regard for others, particularly children. ",
        "upvotes": 190,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1oen44j/the_perfect_neighbor_lorinczs_lone_supporter_in/"
    },
    {
        "id": "1ofkww1",
        "author": "chikkennougat",
        "title": "Ads during shows?",
        "content": "Hey everyone! I’ve been using Netflix with ads for the past year and I am in the middle of season three of Ozark and this whole time during the show I did not have ads and now all of a sudden there’s about 3 ad breaks per episode. does anyone know why this is happening? ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ofkww1/ads_during_shows/"
    },
    {
        "id": "1ofi08s",
        "author": "One_Spaceman",
        "title": "MONSTER Season 5?",
        "content": "After 4 \"Lizzie Borden\" if you google \"Monster season 5\" it seems to come up with \"Ted Bundy\" but I thought the show runners said no to Bundy? where is this information being \"Reportedly\" found?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ofi08s/monster_season_5/"
    },
    {
        "id": "1oeueiw",
        "author": "Last-Maize7926",
        "title": "Anyone started watching A HOUSE OF DYNAMITE ?",
        "content": "Hi all, just wanted to know if anyone watching this movie and whats your thought so far about it. Do u really like it specially the characters and story. ",
        "upvotes": 26,
        "comments": 240,
        "media": null,
        "permalink": "/r/netflix/comments/1oeueiw/anyone_started_watching_a_house_of_dynamite/"
    },
    {
        "id": "1oflitv",
        "author": "Sea-Survey-1298",
        "title": "House Of Anubis Petition",
        "content": "[https://share.google/rP6oVnlRwKUJNw8cM](https://share.google/rP6oVnlRwKUJNw8cM)\n\nPlease help Sibuna get up to 5,000 signatures for it to come back to Paramount we need all the help we can to get this show back on the air for Reboot show and Halloween Movie",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oflitv/house_of_anubis_petition/"
    },
    {
        "id": "1oelz5y",
        "author": "honeywormss",
        "title": "The Perfect Neighbor what happened with the tow truck?",
        "content": "Was she trying to break her car out of the impound lot? I didn't quite catch what was going on. Did she sneak into the lot and was trying to break down the gate to get out? ",
        "upvotes": 102,
        "comments": 73,
        "media": null,
        "permalink": "/r/netflix/comments/1oelz5y/the_perfect_neighbor_what_happened_with_the_tow/"
    },
    {
        "id": "1ofh66j",
        "author": "towntfx",
        "title": "Netflix Closes Boss Fight Studio Despite ‘Squid Game’ Game Success",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ofh66j/netflix_closes_boss_fight_studio_despite_squid/"
    },
    {
        "id": "1ofguyq",
        "author": "Ricka77_New",
        "title": "Dropping Xfinity package, but keeping Netflix...same account/profiles?",
        "content": "I currently have an Xfinity package with Netflix, Apple, and Peacock...but I don't need or watch Apple and Peacock anymore.  If I cut that package, which uses my Xfinity email login..but start an independent plan with Netflix directly using same email, will what I have setup now copy over?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ofguyq/dropping_xfinity_package_but_keeping_netflixsame/"
    },
    {
        "id": "1ofgszu",
        "author": "Spellcasters_r_op",
        "title": "Any hope for a season 2 of half bad?",
        "content": "I can’t tell you how much I love this series, it feels so magical. To be honest it’s one of my favorite shows that I will probably continue to rewatch. Please, even if it’s a lie, tell me there’s hope for an un-cancellation. Can’t tell you how much I love this show. I need more!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ofgszu/any_hope_for_a_season_2_of_half_bad/"
    },
    {
        "id": "1of92ql",
        "author": "THE_Rose-Valentine",
        "title": "Why is no one talking about the film Leap! (Ballerina)?",
        "content": "I know it’s fairly old, but as I’m rewatching, I notice that Camille’s mother was psychotic and no one did anything about that?? Did the kids feel too scared to say anything about her ruthless acts towards the children or are laws in the city different? I know we can just throw around the obvious fact that, “it’s a kids film.” But come on— it’s not like there’s fantasy aspects or anything, it’s almost real life.\n\nThe fact that Camille’s mother smacked a child in the head with a wrench, tried to beat Felicie with it, and then chased her with a sledgehammer before chasing her to high ground and threatening her heath and/or life is MENTAL!!! ",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1of92ql/why_is_no_one_talking_about_the_film_leap/"
    },
    {
        "id": "1ofdisy",
        "author": "jonpeeji",
        "title": "Anyone else enjoying Nero the Assassin",
        "content": "Very well made production.  I like the direction; the background characters extras are all doing interesting things.  Reminds me a bit of Tarantino.  Anyone else enjoying this?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ofdisy/anyone_else_enjoying_nero_the_assassin/"
    },
    {
        "id": "1ofcfym",
        "author": "theroyalstorm",
        "title": "Similar suggestions to Alice in Borderland?",
        "content": "I just finished Alice in Borderland and looking for something similar on Netflix or maybe with action/thriller concept like Vagabond (kdrama). Any recommendations are welcome. Thank you!!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ofcfym/similar_suggestions_to_alice_in_borderland/"
    },
    {
        "id": "1oflus7",
        "author": "yobboman",
        "title": "Tubi is beffer",
        "content": "Hi, I subscribed again after a year away... and it's as though nothing of interest has been added.\n\nIt seems everything I attempt to watch is full, boring, stupid or contrived... \n\nand honestly a lot of the non english speaking material produced... Just rarely lands .. how can Netflix have flubbed so bad ..\n\nI get just as much pleasure watching tubi and that doesn't cost anything ..\n\nIf I look at Netflix as a strategic quandary it seems that they have flubbed it in multiple metrics simultaneously for an ext nded period of time ..",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1oflus7/tubi_is_beffer/"
    },
    {
        "id": "1oergog",
        "author": "livingamoment",
        "title": "What Queen Charlotte Taught Me About Happiness",
        "content": "The other night, I started watching Queen Charlotte: A Bridgerton Story on Netflix.\n\nI wasn’t expecting much-- just another royal drama filled with silks, chandeliers, and scandal.\n\nBut one scene caught me off guard.\n\nLady Danbury sends out an invitation for the first ball of the season. Another Lady-- I forget her name -- becomes visibly agitated that the honour had been “snatched” from her.\n\nIt was such a simple moment, yet it reminded me something.\n\nHere were people surrounded by unimaginable wealth and luxury -- yet burning with the same insecurities and jealousies that haunt us all.\n\nThe King and Queen, for all their power, suffer in their own ways.\n\nThe Lords and Ladies suffer for attention, for prestige, for a sense of being seen.\n\nAnd suddenly, it reminded me-- this isn’t just their story. It’s ours.\n\nWe chase new jobs, new relationships, new milestones, believing each next thing will finally make us happy. But it never really does. It’s the same script, just in modern clothes.\n\nThat night, I remembered something Sadhguru once said: If you have tried every possible way to fulfill yourself, and you have realized that nothing really works, it means you have come to the point: ‘And now, Yoga.’\n\nIt took me years to understand this. Growing up, I was brainwashed to be in constant pursuit of happiness. But Yoga showed me something different. It turned my gaze inward and revealed that what I was chasing was never missing-- it was just within.\n\n\n\n",
        "upvotes": 14,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oergog/what_queen_charlotte_taught_me_about_happiness/"
    },
    {
        "id": "1oe1sq9",
        "author": "dommimommyy",
        "title": "The Perfect Neighbor",
        "content": "After a quick search I see this documentary has been talked about quite a bit here, but the one thing I haven’t seen mentioned is the fact the documentary is almost entirely filmed on police body cam.\n\nI personally found this fascinating as someone who enjoys seeing live clips, police interviews, especially when tied into a documentary.  (For me it adds an extra layer of “realness” to the documentary.)\n\nI wonder if we will see more true crime documentaries filmed this way with the advancements of technology and body cam footage etc. I think the documentary was beautiful put together and even with majority of the documentary being on body cam footage, it still told a very clear story.\n\nCurious to know anyone’s thoughts on this? Did you think the body cam footage made things “too real”? Invasion of privacy? Would you like to see more true crime documentaries that include police body cam footage etc?\n\nTIA! 💋",
        "upvotes": 482,
        "comments": 392,
        "media": null,
        "permalink": "/r/netflix/comments/1oe1sq9/the_perfect_neighbor/"
    },
    {
        "id": "1oej3br",
        "author": "Soft_Significance718",
        "title": "Nobody [EVERYBODY] Wants This",
        "content": "How did I not know that it was coming back today?! I had no warning! No time to prepare myself and clear my schedule for an evening to watch it in one night!\n\nI really love this show. Unfortunately, I watched the first season with my best friend of 20 years, who passed away unexpectedly last December at 35 years old, so this season is going to hurt. But it will also make me happy to remember our time watching it together and laughing together.\n\nAnyways, welcome back, Joanne and Noah!",
        "upvotes": 52,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1oej3br/nobody_everybody_wants_this/"
    },
    {
        "id": "1of32bp",
        "author": "Minute_Practice_8462",
        "title": "Security procedures in The Diplomat",
        "content": "In The Diplomat on Netflix, the security team always opens car doors for officials the same way — one hand on the handle, the other gripping the top of the door frame — before letting them out. It’s done so deliberately and consistently that it looks like a real-world protocol.\n\nIs that actually a standard close-protection or diplomatic-security procedure, or just something stylized for TV?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1of32bp/security_procedures_in_the_diplomat/"
    },
    {
        "id": "1oej5kn",
        "author": "Ember_Grove20",
        "title": "Which Netflix series or movie do you think deserves a sequel?",
        "content": "Ever finish something on Netflix and feel like it ended too soon? Some stories just have so much more to give. Which series or movie do you think deserves a proper sequel?",
        "upvotes": 42,
        "comments": 221,
        "media": null,
        "permalink": "/r/netflix/comments/1oej5kn/which_netflix_series_or_movie_do_you_think/"
    }
]