[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 479,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1haf6gm",
        "author": "netflix",
        "title": "Netflix received 36 Golden Globes nominations!\n\nCongratulations to Emilia Pérez, Nobody Wants This, Squid Game, Monsters: The Lyle and Erik Menendez Story, Maria, Ripley, Griselda, Black Doves, The Gentlemen, The Diplomat, A Man on the Inside, and Glen Powell who scored his first-ever nomination.",
        "content": "",
        "upvotes": 28,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1haf6gm/netflix_received_36_golden_globes_nominations/"
    },
    {
        "id": "1hkc7gm",
        "author": "Lovepeacepositive",
        "title": "Ronny Chieng special so phenomenal!! ",
        "content": "This guy f-ing killed it.  His audience couldn’t even keep up with his one liner references that were so clever.  After I watched it, I had watched his special from 2022 and you can tell he did not hold back this time around.  I mean he was honest about how he was there to take the audiences money.  He was honest about how American culture is so twisted with money when it comes to their own parents and America.  He made so many important points that people in general should really reflect on.  I love this guy - reminds me so much of George Carlin.  I had no idea who he was but I tend to watch what’s in the top 10 and this is.  Not as heart felt as Jamie Foxx’s special but clearly a different story there.  Ronny paid tribute to his dad at the end and I had some tears but I hadn’t laughed that hard in so long.  I hope he does more specials/ tours - before he decides to peace out. I’d pay to see him to make me laugh.    I wanted to see who else watched and everyone’s thoughts were.  Did you love it as much as me or were you insulted like some people are by comedians these days? ",
        "upvotes": 7,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hkc7gm/ronny_chieng_special_so_phenomenal/"
    },
    {
        "id": "1hk0rq5",
        "author": "sukh345",
        "title": "Netflix not working in browsers ",
        "content": "I recently bought Netflix basic plan that is 1 screen with laptop, tv and mobile option to play.\n\nHowever, when i login Netflix on my laptop it doesn't play even if it plays after clearing cookies it doesn't play all shows just throws some random error everytime.\n\nIt works properly on my android ✅.\n\nDoesn't work in android browser &amp; iphone browser in desktop mode too.\n\nI know it's single screen , i only try to watch on 1 device at a time not on multiple.",
        "upvotes": 10,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1hk0rq5/netflix_not_working_in_browsers/"
    },
    {
        "id": "1hkd0j5",
        "author": "indiewire",
        "title": "'Hot Frosty' Is Best Netflix Holiday Movie: It's Worth Your Time",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hkd0j5/hot_frosty_is_best_netflix_holiday_movie_its/"
    },
    {
        "id": "1hkcum9",
        "author": "Acrobatic-Painting22",
        "title": "Netflix not working on Chrome",
        "content": "https://preview.redd.it/ktsrqa7s2i8e1.png?width=1902&amp;format=png&amp;auto=webp&amp;s=8645a6030cfab3e60f411df0d3ab6fd7a066d2bb\n\nSo I have been getting this error since 3 days and I can't watch Netflix on chrome, when I asked the technical support person, they just told me to switch to another browser for the time being since its an issue from chrome's side.\n\nI think there should be a better solution than just switching.\n\nPlease do help",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hkcum9/netflix_not_working_on_chrome/"
    },
    {
        "id": "1hkayqy",
        "author": "CherryFlavouredWine",
        "title": "Confused? ",
        "content": "I think I’m being simple here but, which Netflix plan allows more than 15 downloads per month? \nI just don’t want to upgrade and then still not be able to download more as that’s all I want. I’m guessing it’s the options without ads but, yeah. \nI can’t seem to find a straight answer on their website. \nI’m uk for reference by the way. \n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hkayqy/confused/"
    },
    {
        "id": "1hjz8c7",
        "author": "Kesonac",
        "title": "Suggestions for my picky parents",
        "content": "I need series my parents can watch/ I can watch with them. The only series that absolutely loved were prison break, they almost watched it twice. Any other serie they just bash. They want a series that is finished, so no more waiting for new seasons. I just tried so many series and they never like it like they did with prison break lol. Anyone that loves prison break here got the same feeling or vibe with other series? They love sci Fi movies as well.",
        "upvotes": 3,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1hjz8c7/suggestions_for_my_picky_parents/"
    },
    {
        "id": "1hjabpq",
        "author": "No-Mongoose5650",
        "title": "Is it just me but do so many Netflix shows/movies feel soulless? Like they were made by AI or something ",
        "content": "So something I've noticed about Netflix over the last few years is so many of their movies and shows just feel, soul less, like they were made in the same \"factory\" or by AI. \n\nIt's hard to explain but they all just feel too cookie cutter, to polished and structured, stiff.. safe, there isn't any depth or rawness to them, they are predictable and you can tell there just isn't any human touch or passion behind them at all.",
        "upvotes": 263,
        "comments": 96,
        "media": null,
        "permalink": "/r/netflix/comments/1hjabpq/is_it_just_me_but_do_so_many_netflix_showsmovies/"
    },
    {
        "id": "1hk5zy6",
        "author": "Wide_Sympathy_1064",
        "title": "Squid games unleashed",
        "content": "I am a fan of Squid game unleashed but I first started on a guest account, can I transfer to my main one when it is no longer available for non subscribers",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hk5zy6/squid_games_unleashed/"
    },
    {
        "id": "1hk2hml",
        "author": "Psycotstic",
        "title": "Shows won't show up",
        "content": "My account it set up to be allowed to watch Rated R flims, so no, it's not that.\n\n  \nI'm trying to watch Dan Da Dan on netflix, but nothing shows up when I search for it. This has happened to me before with another show I can't recall the name of. I'm in the US, so it should be available to me, and it shows up in the website, but not my Fire TV, which is where I prefer to watch.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hk2hml/shows_wont_show_up/"
    },
    {
        "id": "1hk773x",
        "author": "brc55",
        "title": "Aaron Rodgers documentary-what’s in his coffee/protein shake?",
        "content": "Anyone know what the ingredients are in Aaron Rodgers coffee/protein shake? His chef in the third episode makes it for him and he adds some kind of black tar to it, collagen, and a few other things. ",
        "upvotes": 0,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1hk773x/aaron_rodgers_documentarywhats_in_his/"
    },
    {
        "id": "1hk1p8e",
        "author": "Socko82",
        "title": "Upcoming movie \"Hurt People\" (potential spoilers).",
        "content": "Netflix purchased Melissa London Hilfers' spec script a few months back.\n\nI read a review for it on scriptshadow.net. It's a legal drama with some interesting wrinkles. The main protagonist is a 40-year-old lawyer having an affair with a co-worker. She then gets to bond with her estranged father while defending him in a trial of which he is accused of murdering his wife.\n\nThere's a twist at the end that is totally unpredictable if you're not expecting a twist. There's just no hint whatsoever. I'm not the biggest fan of shocking last minute twists, but here it works, because it makes that character even more intriguing.\n\nI'm fascinated by characters who do bad and even evil things, but still feel like real people. What they call \"morally grey.\" This script has a few of them.\n\nThe reviewer made a casting suggestion for the main lead: Natalie Portman. I agree with him. She's never played a character like this, but she would be really interesting and probably nail it.\n\nThoughts?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hk1p8e/upcoming_movie_hurt_people_potential_spoilers/"
    },
    {
        "id": "1hjyg4k",
        "author": "Objective-Upstairs36",
        "title": "Is Netflix going to have the NFL games in HDR like how prime does? ",
        "content": "The video quality for prime during the NFL broadcast is so high-quality is Netflix planning to do that? \n\nAlso, are they planning HDR broadcast for WWE as well?",
        "upvotes": 1,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1hjyg4k/is_netflix_going_to_have_the_nfl_games_in_hdr/"
    },
    {
        "id": "1hjy9uy",
        "author": "projectdivebomb",
        "title": "What did you all make of Netflix's Senna series?",
        "content": "As a huge Formula One fan, I recently finished the new Senna series on Netflix, and I won't lie to you - was a little bit disappointed. A lot of the characters feel quite hollow, which is big mistake when creating a show, but also because these are real people and they're drivers who were on camera a lot, so it feels strange that they essentially become cartoonish rather than authentic and what the person was like in real life, a bit disappointing.\n\nThey also didn't really touch on Senna's faith and religion like, at all. Which is again, a baffling decision considering Senna at one point literally said: \"I saw God visually\"\n\nI think maybe for F1 fans this is going to be quite a frustrating watch, and the question must be raised at this point - should Netflix really be producing F1 content? They've received criticism for their \"Drive to Survive\" series, and now this series as well...\n\nAnyway enough of my rambling, what did you all make of the Senna series?\n\n[Netflix's Senna Critique and Analysis](https://www.dive-bomb.com/article/netflix-s-senna-a-must-watch-for-racing-fans)",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hjy9uy/what_did_you_all_make_of_netflixs_senna_series/"
    },
    {
        "id": "1hjy2ao",
        "author": "AndrewRyan2343",
        "title": "was Trimagasi Role in El Hoyo (The Platform) meant to be like Virgil in Dante's Inferno\n",
        "content": "so in El Hoyo (The Platform), Trimagasi was Goreng's first cellmate who was armed with a knife. when they get on a bad level he decides to wade it out for a week before eating from Gorang. as he's about to slice the lady who rides down once a month comes behind him and releases Gorang. Gorang takes the knife and brutally stabs Trimagasi. That is not the last time we see him as we see him throughout the film as a hallucination when Gorange is given the gas. This makes me think of Vergil from The Devine Comedy or Dante's Inferno because in that book Vergil is sorta a guide for Dante Guiding him throughout the levels of hell. much like how trimagasi guides gorang though the levels of The Pit\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hjy2ao/was_trimagasi_role_in_el_hoyo_the_platform_meant/"
    },
    {
        "id": "1hka95r",
        "author": "r0n1n2021",
        "title": "Cancel after one day - right?",
        "content": "So since the nfl has made a horrible decision I have to sign up for a single day of Netflix.  They still allow you to cancel after one day - right?\n\nIs the cost prorated or are they just stealing the rest of the month from me?\n\nHow about when the streaming fails like it did with the Tyson debacle?  Anyone get money back for that disaster?\n",
        "upvotes": 0,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1hka95r/cancel_after_one_day_right/"
    },
    {
        "id": "1hjoqtx",
        "author": "ihaveaheadache27",
        "title": "Shows like Queen's Gambit",
        "content": "I absolutely love the Queens Gambit and have watched it 4+ times through. What shows have the same feeling? Have its creators made any other shows, mini-series, or movies like it?\n\nFor reference I love Mike Flanagan's work (Haunting of Hill House, Bly Manor, Fall of the House of Usher, which I all recommend) so that is my sort of vibe I like. Any suggestions are welcome!",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hjoqtx/shows_like_queens_gambit/"
    },
    {
        "id": "1hjty5h",
        "author": "Germankidoncrack",
        "title": "Old show?",
        "content": "There was this Netflix show And it was about an Outbreak or an apocalypse I think there was this team and this guy had orange hair and his name was Jake or something, it was a kids show can you try To find the name of it? Btw it had like ps3 graphics and it was like 3dish though, I watched it in like 2019 or 2018 maybe in 2020-2022 not sure. and the main character got infected I believe, so can someone try to Find it? I think it got removed off of Netflix though. So I’m not sure, if anyone will find it.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hjty5h/old_show/"
    },
    {
        "id": "1hj6uau",
        "author": "Robemilak",
        "title": "‘Stranger Things 5’ Wraps Filming with a Bunch of New Behind-the-Scenes Photos",
        "content": "",
        "upvotes": 87,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1hj6uau/stranger_things_5_wraps_filming_with_a_bunch_of/"
    },
    {
        "id": "1hji1wz",
        "author": "Sensitive_Rock6788",
        "title": "No Good Deed ",
        "content": "Ummm. I hope everyone is watching this absolutely fucking amazing show!!!!!!! Omg. I don’t even want to say too much because there’s so much to discuss but- I didn’t expect the daughter- let alone LuAnne! Pissed that the husband kept that check. Funny enough- I really thought the attorney and her wife were gonna be my least favorite characters in the beginning. Fantastic series. Highly recommend. ",
        "upvotes": 14,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1hji1wz/no_good_deed/"
    },
    {
        "id": "1hjjwph",
        "author": "HehroMaraFara",
        "title": "Polo (Series)",
        "content": "This was a crap attempt at capitalizing on the success of Drive to Survive, Receiver, etc. This was BY FAR the worst of that type of show. Snooze fest to the max. \n\nThe only good thing about this show full of entitled and boring snobs, was the wife in episode one. Total smoke-show. She was also an attorney and athlete. \n\nThe rest of the people, oh my god, who gives a shit. When you’re playing a game where you can accidentally almost be late because you are farting around a barn, it’s not worth a documentary. \n\nPlease dear God do not waste time or money on a season 2 of this garbage. ",
        "upvotes": 9,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hjjwph/polo_series/"
    },
    {
        "id": "1hk5phb",
        "author": "casecaxas",
        "title": "Fuck captionMax",
        "content": "That's all I have to say, the stupid \"captioning by captionMax\" at rhe end of every episode kills the mood for me.\nWhy the fuck would Netflix allow this??? Feels like I'm in a fucking torrenr site ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hk5phb/fuck_captionmax/"
    },
    {
        "id": "1hjrld9",
        "author": "GustavoAlex7789",
        "title": "Suddenly got my catalog limited",
        "content": "I have a Netlfix account I pay for my parents, recently I bought a new TV for my appt and decided to add an extra member for myself. Everything was good until yesterday when on my PC I could not watch some series like Chaos Theory. I can watch them on the TV so theres that but if I want to search for them on the PC they dont appear and if I try to google the direct link the only option I get is Remind Me.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hjrld9/suddenly_got_my_catalog_limited/"
    },
    {
        "id": "1hj8bm7",
        "author": "techfinpro",
        "title": "Parasite Star Song Kang-Ho Joins Beef Season 2 Cast Opposite Carey Mulligan, Oscar Isaac And More",
        "content": "",
        "upvotes": 24,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hj8bm7/parasite_star_song_kangho_joins_beef_season_2/"
    },
    {
        "id": "1hjr65z",
        "author": "abhilash512",
        "title": "WWE Raw Netflix Match Card &amp; All We Know About Debut Episode",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hjr65z/wwe_raw_netflix_match_card_all_we_know_about/"
    },
    {
        "id": "1hjfy8i",
        "author": "Mybfannoysme",
        "title": "The Ultimatum (Scotty) ",
        "content": "As a survivor of #narcissistic abuse, watching Scotty on the Ultimatum new season was really triggering. I feel sorry for who ever ends up his next victim. What are your thoughts about this? Has anyone noticed and called him out publicly yet for his abusive behavior? ",
        "upvotes": 5,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hjfy8i/the_ultimatum_scotty/"
    },
    {
        "id": "1hjxlqp",
        "author": "le-kuz",
        "title": "Is this a scam or legit?",
        "content": "After a longer time (since October 23) I wanted to reactivate my Netflix subscription but I login to my Netflix account anymore (it’s says it can’t find an account with my email).\n\nI contacted this Customer Hotline from my emails: \n0800 110 334\n\nThe woman on the phone tried to find my account by email and by PayPal (the payment option I always used) but couldn’t find anything.\nThen she started this “Session” on the phone where a robot voice told me to enter my credit card number (not the CVC) but that felt a bit odd so I hung up.\n\nNow I want to verify if this is actually Netflix or a scam. The email where I got the hotline number from is this: info@account.netflix.com\n\nAny help is appreciated ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hjxlqp/is_this_a_scam_or_legit/"
    },
    {
        "id": "1hjlvq9",
        "author": "theSeiyaKuji",
        "title": "Is there a way to reset my watched progress on something?",
        "content": "I have watched a lot of stuff of Netflix but sometimes, i want to go back to my old, beloved, comfort series and watch them through again. When i do so tho, i'd like to be able to reset the progress bars on the episodes, so that it doesn't show that i have already watched them. Is there any way to do that and if yes, how?",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hjlvq9/is_there_a_way_to_reset_my_watched_progress_on/"
    },
    {
        "id": "1hjx8fp",
        "author": "forthaloveoff",
        "title": "Why did Voltron get taken off?",
        "content": "I was in a nostalgia mood and wanted to rewatch Voltron: Legendary Defender and it’s gone. You can basically only purchase the seasons. I thought it was a Netflix Original, why would they take it off?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hjx8fp/why_did_voltron_get_taken_off/"
    },
    {
        "id": "1hj184y",
        "author": "Sensitive_Rock6788",
        "title": "Anyone watching La Palma? ",
        "content": "Just started this series on Netflix; so far, so very good. An emotionally charged series, which I normally avoid , but the pace is so steady I can’t turn it off. On episode 4 and I’ve lost my patience with the daughter. Frederick really stepped up! Amazing what a crisis will prompt you to do. You can tell he loves his family regardless of their difficulties. \n\nEdit: Alright alright. They got me. Hahahahaaaaaaaa",
        "upvotes": 53,
        "comments": 116,
        "media": null,
        "permalink": "/r/netflix/comments/1hj184y/anyone_watching_la_palma/"
    },
    {
        "id": "1hjnm6r",
        "author": "Name_Un_Available",
        "title": "Golf Clubs Scene from The Madness ",
        "content": "The scene where he’s in the trunk and they stop at a checkpoint and say something along with not touching someone’s golf clubs. \n\nWas that a reference to something? Not really clear to me.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hjnm6r/golf_clubs_scene_from_the_madness/"
    }
]