[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 495,
        "comments": 262,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1iwhx3j",
        "author": "katiereadalot",
        "title": "What cancelled Netflix show would you bring back if you could only pick 1?",
        "content": "If I can only pick one I’m torn between Julie &amp; the Phantoms and The Society but I think more people want JATP. Plus I could use more JATP songs, that album gets so much play on my Spotify for an adult…",
        "upvotes": 98,
        "comments": 677,
        "media": null,
        "permalink": "/r/netflix/comments/1iwhx3j/what_cancelled_netflix_show_would_you_bring_back/"
    },
    {
        "id": "1iwikkm",
        "author": "PhantasiaFan23",
        "title": "I found the filming location for the house from the series “Cassandra”",
        "content": "",
        "upvotes": 66,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iwikkm/i_found_the_filming_location_for_the_house_from/"
    },
    {
        "id": "1iwazcd",
        "author": "feudingfandancers",
        "title": "Price rise is ridiculous (UK)",
        "content": "I’m guessing they just think people will roll over and take it but I’m cancelling my subscription that I’ve had continuously for many years. \n\nNetflix is the one streaming service I’ve kept each month because I felt it was worth it, but a £2 rise is ridiculous. So instead of my £11 (already most expensive sub) each month, I’ll probably use it a few times a year now. ITV now has loads of comedies (which is what I use Netflix for the most) and is much cheaper. \n\n\nI hope others will also cancel and it will affect their profits. \n",
        "upvotes": 70,
        "comments": 60,
        "media": null,
        "permalink": "/r/netflix/comments/1iwazcd/price_rise_is_ridiculous_uk/"
    },
    {
        "id": "1iwob95",
        "author": "Alan_Stamm",
        "title": "'Offline Love' ditches digital dating and puts old-school romance to the test",
        "content": "",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iwob95/offline_love_ditches_digital_dating_and_puts/"
    },
    {
        "id": "1iwpdjk",
        "author": "WillieWangWang1",
        "title": "SAG Awards on Netflix - No pause or rewind functions?",
        "content": "Watching (in USA) the SAG Awards live on Netflix now and it doesn’t appear to have any pause or rewind function.  Is this the case with *all* live programming on Netflix? Because if so, it feels like such a step backward in user experience. I mean, I genuinely can’t recall the last time I watched something on my television that couldn’t be paused or rewound - maybe Newhart lol?\n\nIt feels really off brand for Netflix to offer such a diminished user experience.  Seriously, if this is the way Netflix offers live programming, this will be the first and last live show I watch on Netflix.",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1iwpdjk/sag_awards_on_netflix_no_pause_or_rewind_functions/"
    },
    {
        "id": "1iwot5b",
        "author": "bpboop",
        "title": "Second Home Method issues",
        "content": "Hello Netflixers - as a Canadian, we've had the \"household\" setup for quite a while. I, admittedly, use my mom's netflix account. For a while it was actually set up with my household as primary (I use it more than she does) but then she swapped it over to her house. Over Christmas when I was at her house, I used the method where I watch a show on my phone on her wifi and netflix account and then watch a show on the same account from my house on the same device. It worked and re-enabled netflix on my TV at my place.\n\nShe came to visit me for my birthday earlier this month and I had her use the same method (watch on her phone at her house, then connect to my wifi and watch on her phone at my house) to keep it working. However as of midnight today I am once again unable to access it on my wifi.\n\nDoes anyone know why this might be? She followed the same steps as me but it doesn't seem to have worked? This is already super annoying :(",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iwot5b/second_home_method_issues/"
    },
    {
        "id": "1iwd6fy",
        "author": "stuwozere1",
        "title": "Totally unusable!!!",
        "content": "I have been a Netflix customer for the last 14 years and up until the last year I've been happy (although getting slightly annoyed at price). However, as a truck driver in the UK the app has increasingly become unusable with Netflix constantly locking me out. I use the temporary logins when I'm away from home but now Netflix say I'm in breach of T&amp;C's and have locked my account. I've tried to contact them and they just keep apologising but offering no solution but cancel my membership. \nEven if I try to set up again with a new email address, my IP address has been logged so will not allow sign in, again, all they can do is apologise. ",
        "upvotes": 10,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1iwd6fy/totally_unusable/"
    },
    {
        "id": "1iwnnlb",
        "author": "somosextremos82",
        "title": "Volume variation",
        "content": "I watched Interstellar last night and was getting very frustrated with the variation in the volume. During dramatic scenes the music volume would skyrocket and then during the dialogue scenes the volume would plummet. I was constantly on the volume button adjusting for ever scene. This seems to be more frequent. I thought we had fixed this decades ago. Anyone else notice this?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iwnnlb/volume_variation/"
    },
    {
        "id": "1iwnexg",
        "author": "quantum-quirk1012",
        "title": "Netflix removing downloaded titles?",
        "content": "I’m on the plan with ads and I had downloaded the maximum number of episodes (15 on my device) to watch on a plane. I downloaded them before the trip and watched about 5 episodes. \n\nToday marks 3 full days after watching the first downloaded episode. I just checked my downloads and noticed the other 10 episodes I hadn’t watched yet were gone and it’s not letting me download anything else. I also checked in the app settings and it says that I have no downloads taking up storage on my device. I pressed the delete all downloads button in settings just in case and I still can’t download anything. Any ideas as to what might be going on here?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1iwnexg/netflix_removing_downloaded_titles/"
    },
    {
        "id": "1ivwhz3",
        "author": "NostalgicRetro73",
        "title": "There’s something in Worst Roommate Ever that I already knew but people still do…",
        "content": "That is find roommates on Craigslist. Are you out of your damn minds?  That place is a big ol nest of evil people.  So much so, Netflix should do a show just on the cases about everything evil on Craigslist. ",
        "upvotes": 63,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1ivwhz3/theres_something_in_worst_roommate_ever_that_i/"
    },
    {
        "id": "1iwlgkr",
        "author": "blizeH",
        "title": "Regular black screen in Chrome since trying to use a brightness console command",
        "content": "Hi, I have my VLC player set to be slightly brighter than my desktop, so when I watch something in Netflix it looks noticeably dingy. I tried using the console command [as recommended in this post](https://www.reddit.com/r/netflix/comments/4c890o/comment/leq1jcf/), and instantly I got a black screen in my browser and had to close down Netflix entirely to get it working again (refreshing, or going back didn't help)\n\nSince doing this, I regularly get a black screen when trying to resume a video within Netflix, or on first loading Netflix, and it can take a minute or two of fiddling with different things, refreshing, closing down and re-opening the tab etc. I've tried running the same console command and setting the brightness to 100% but it hasn't helped.\n\nIs there anyway I can fix this please? Maybe by removing that command somehow? I'd rather not have to reset all of my browser settings if I can avoid it. Thank you :)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iwlgkr/regular_black_screen_in_chrome_since_trying_to/"
    },
    {
        "id": "1iwjysf",
        "author": "TaloTeasdale",
        "title": "TV show available on my profile but not my partner's.",
        "content": "My partner and I have been watching Snowpiercer on our own profiles. However, when she tried to watch it today, it had disappeared from her watch list and no longer appears in search results. Meanwhile, it still works fine on my profile—I can search for it, and it remains in my watch list. Her profile has no restrictions, and we also live in the same house, this also happens across all devices, so I'm just wondering what might have caused this as I've never encountered it before. \n\n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iwjysf/tv_show_available_on_my_profile_but_not_my/"
    },
    {
        "id": "1iwjg5q",
        "author": "MrBruceCharlie",
        "title": "Is there a way of equalising the volume",
        "content": "Does anybody else find the sound on films, and now it seems TV shows aswell goes up and down like a yo yo. \n\nOne minute people talk really quite, the next the sound effects are blowing your ears off... I actually have the bass turned off on my TV now lol.\n\nIs there a way of Equalising the volume? Like a setting I've missed? \n\nI think Netflix [ and every other streaming company to be fair]  needs to realise most people don't want to wake their neighbours up at 11pm at night and so keep having to turn down the volume every time there is an action sequence is a real pain in the bum.\n\nAnyways that's my rant. Do people agree. Is there a way to turn the theatrical sound off.\n\n[ You know back in the block buster days there was the home version, or the theatrical version. Not a suggestion just an observation]",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iwjg5q/is_there_a_way_of_equalising_the_volume/"
    },
    {
        "id": "1iwhdzf",
        "author": "Flaky-Tadpole8062",
        "title": "I wish I could watch The 100 for the first time again... (The entire series)",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iwhdzf/i_wish_i_could_watch_the_100_for_the_first_time/"
    },
    {
        "id": "1iw645g",
        "author": "Scared_Cow9483",
        "title": "Chanelle McAuliffe - something’s not right ….",
        "content": "So I’ve watched a few interviews involving her, and I don’t believe her reasons for revealing/outing Belle are at all altruistic. \n\nI could be wrong but there is something about Chanelle that has always felt off, in every interview her body language just seems to …. It’s just, I don’t know - I think there is more there, I feel like something else or some other events happened that ended with her revealing Belle. \n\nI dunno, could be completely wrong, but my behavioural background is shooting up flags and I can’t put my finger on it…. But she certainly comes across completely insincere. ",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1iw645g/chanelle_mcauliffe_somethings_not_right/"
    },
    {
        "id": "1ivxs8m",
        "author": "Greenfrog2023",
        "title": "Sweet Magnolias",
        "content": "I find the characters in this show insufferable now (especially Dana Sue) and its becoming harder to get through each new season... Is it just me or is this show boring? I just needed to get this off my chest.... 🤣",
        "upvotes": 24,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1ivxs8m/sweet_magnolias/"
    },
    {
        "id": "1iw7uxb",
        "author": "Agreeable_Iron4560",
        "title": "Where is the Home from Cassandra?",
        "content": "I’m trying to find the location of the home featured in the Netflix series Cassandra. Based on what I’ve seen, it looks like a modern 1970s home, with a style that reminds me of American architecture from that era. I’ve come across some information suggesting that this house could be located in the Cologne area in Germany, but I’m not sure if that’s accurate. The design of the house, with its clean lines and spacious feel, is definitely very reminiscent of mid-century modern homes found in the United States. I’m really curious if anyone knows the exact location of this home or has more details on where it was filmed. Is it a real house or just a set built for the show? If anyone has any insights or further information about the home, I’d love to hear from you. Thanks in advance for your help!",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1iw7uxb/where_is_the_home_from_cassandra/"
    },
    {
        "id": "1iw74n9",
        "author": "AstralKatOfficial",
        "title": "PIP not working despite it being enabled in my phone settings?",
        "content": "Im not on an ad supported plan so that isnt the issue. I have PIP enabled in the settings of my phone but no matter what I do netflix will not go to PIP mode. It works perfectly fine with other streaming services but specificaply Netflix refuses to work and I have no idea why?",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1iw74n9/pip_not_working_despite_it_being_enabled_in_my/"
    },
    {
        "id": "1ivzfrf",
        "author": "Formfeeder",
        "title": "Aftermath 2024",
        "content": "This has to be one of the worst movies out on the platform.  The storyline is unbelievable, the acting is as ridiculous as the premise.  Blowing up the main supports on a bridge would put it in the water.  135 minutes I’ll never get back.  ",
        "upvotes": 12,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1ivzfrf/aftermath_2024/"
    },
    {
        "id": "1iwb32g",
        "author": "IntrepidPotential661",
        "title": "Sharing netflix premium",
        "content": "Hello,\n\nI haven’t used Netflix before, but I’m now planning to subscribe to Netflix Premium. However, my decision depends on the answer to the following question.\n\nThree of us would be using the same account on our laptops/phones, but since we are students, we are rarely at home on the same Wi-Fi, we live on different campuses. \n\nMy question is: in this case, can we share the profile without issues, or is this against Netflix’s rules, meaning we wouldn’t be able to use it together?\n\nNote: We wouldn’t be using it on a TV at home, only on our laptops.\n\nI looked for answer at help center, but no help. \n",
        "upvotes": 1,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1iwb32g/sharing_netflix_premium/"
    },
    {
        "id": "1iwaxwh",
        "author": "soy1usuri0",
        "title": "¿Opiniones de esta serie?",
        "content": "¿La han visto?",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/44o6smk5cwke1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1iwaxwh/opiniones_de_esta_serie/"
    },
    {
        "id": "1ivko3t",
        "author": "S4v1r1enCh0r4k",
        "title": "Ben Affleck Reportedly ‘Thrilled’ to Star with Longtime Crush Gillian Anderson in New Netflix Thriller!",
        "content": "",
        "upvotes": 71,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1ivko3t/ben_affleck_reportedly_thrilled_to_star_with/"
    },
    {
        "id": "1iwaq9l",
        "author": "JbreezyReviews",
        "title": "Greatest Netflix Original Series?",
        "content": "Netflix got a crazy line up but what are yall favourite Netflix original series? Here’s my video on my top 5 ( I forgot You , I know my bad ) . But yeah what are yall top 5 series? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iwaq9l/greatest_netflix_original_series/"
    },
    {
        "id": "1iwhxjp",
        "author": "localkat",
        "title": "American Murder: Gabby Petito voices being cut off",
        "content": "does anyone else hear how bad the snipping and editing of the voices in familys/friends/polices interviews are? they're cutting them off every time they take a pause and it's so obvious and irking.. like a youtube vlog or something. it sounds so robotic",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iwhxjp/american_murder_gabby_petito_voices_being_cut_off/"
    },
    {
        "id": "1ivz4tn",
        "author": "sohaniadi",
        "title": "Zero Day - Sketch Poster &amp; Base Drawing",
        "content": "",
        "upvotes": 9,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ivz4tn/zero_day_sketch_poster_base_drawing/"
    },
    {
        "id": "1iv2f9k",
        "author": "ellissabain",
        "title": "This is what the police officer who stopped Gabby Petito said after she was murdered",
        "content": "",
        "upvotes": 1405,
        "comments": 619,
        "media": null,
        "permalink": "/r/netflix/comments/1iv2f9k/this_is_what_the_police_officer_who_stopped_gabby/"
    },
    {
        "id": "1iw9htl",
        "author": "Inside-Afternoon4343",
        "title": "Valeria - anyone else find every single character insufferable?",
        "content": "I watched the first three seasons to freshen up my Spanish and actually liked them well enough, but the more the show progresses the more I‘m starting to dislike literally everyone. They can‘t communicate, they‘re very often bad friends, selfish, self-centred, making stupid mistakes that could‘ve been avoided if they‘d used their brains for just one second, they don‘t really grow at all, and they‘re just plain annoying and cringe. I know the „humor“ of the show is built entirely on this and the exaggeration of the character‘s flaws is used for comedic effect, but I feel like this show could‘ve been funny without this, too. I started watching the new season and not even half an episode in I was like, ok, I can‘t do this lmao. Valeria trying to seduce Bruno at the café and not letting him have his coffee? Cringe. Also the writer’s block trope is getting so old, I DONT CARE THAT SHE KEEPS HAVING WRITER’S BLOCK. ITS SO BORING. \n\nThen, Nerea being unnecessarily rude to that person at the apartment viewing. THAT WOMAN LIVES THERE AND CAN HEAR YOU. Not to mention that a lot of people couldn’t even afford to live there, and you’re walking around crinkling your nose bc it’s „dirty“. And then, being unable to communicate that she doesn‘t want to live alone but with her gf? Girl, you‘re a grown ass woman. Also her gf not picking up on the facial acrobatics during that scene?? Aren‘t you supposed to be a couple??? \n\nThen, Lola forgetting her (considerably younger) bf needed the flat for his work when he had told her about it, and then having the nerve to be annoyed. DUMP HER. \nAnd Carmen… oh, Carmen. Control freak of the century. \n\nIdk if this show is popular or not but am I alone in feeling like this???? They‘re the same annoying people they were at the beginning of the show and there‘s been zero character growth. Idk, I‘m sure there are other ways to build tension bc this is just not it for me",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1iw9htl/valeria_anyone_else_find_every_single_character/"
    },
    {
        "id": "1iwhs2t",
        "author": "Cailly_Brard7",
        "title": "Let's be honest, which teen shows/movies diffused in this era will achieve the iconic status of shows like Friends, Buffy The Vampire Slayer, The O.C., Gossip Girl,Clueless, The Breakfest Club, Mean Girls etc... ?",
        "content": "",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1iwhs2t/lets_be_honest_which_teen_showsmovies_diffused_in/"
    },
    {
        "id": "1iwg581",
        "author": "RightEconomist5754",
        "title": "netflix documentarys true crime who",
        "content": "ok who is making these true crime documentarys for netflix and how do i get in touch with them because all these cases are great but some cases that never get coverage need coverage like missy bevers should get a netflix documentary because she needs justice and so does liz barazza if anyone knows who makes these id love to talk with them",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iwg581/netflix_documentarys_true_crime_who/"
    },
    {
        "id": "1iw1fs0",
        "author": "Prestigious-Neat-625",
        "title": "'Zero Day' intro meaning?",
        "content": "This might mean literally nothing, but I noticed in zero day the intro goes from the text in black, then to white, however the \"Os\"/Holes in the text doesn't appear in Black ( the O, D, and A, in zero day had the the hole filled in black)\n\nIdk maybe it's nothing, but I have a feeling it means something I don't understand haha ",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1iw1fs0/zero_day_intro_meaning/"
    }
]