[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 7,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 54,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1l73gxd",
        "author": "DotOne4395",
        "title": "35 Best Shows on Netflix Right Now",
        "content": "* Dept. Q\n* Tires\n* Blood of Zeus\n* Sirens\n* The Sandman\n* The Residence\n* Adolescence\n* Russian Doll\n* Love, Death &amp; Robots\n* You\n* Cobra Kai\n* A Man on the Inside\n* Black Doves\n* Black Mirror\n* Seinfeld\n* Baby Reindeer\n* Ripley\n* The Diplomat\n* Nobody Wants This\n* Arcane: League of Legends\n* Squid Game\n* Dark\n* Ozark\n* The Night Agent\n* The Gentlemen\n* Wednesday\n* One Piece\n* Bodkin\n* Suits\n* Derry Girls\n* Band of Brothers\n* Beef\n* Stranger Things\n* One Day\n* Warrior\n\n[**Visit Website**](https://www.cinemablind.com/best-shows-on-netflix/) **|** [**9 Best Erotic Thriller Movies**](https://www.cinemablind.com/best-erotic-thriller-movies-on-netflix/) **|** [**7 Best Slasher Flicks**](https://www.cinemablind.com/best-slasher-movies-on-netflix/)",
        "upvotes": 23,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1l73gxd/35_best_shows_on_netflix_right_now/"
    },
    {
        "id": "1l6nyt5",
        "author": "Apprehensive_Ask1279",
        "title": "The Four Seasons",
        "content": "Is there really any point of a season 2???!!!\n\nI thought this series was ok &amp; an easy enough watch but I didn’t really think there was enough substance in it to do another series on it &amp; no characters I was remotely invested enough in to want to follow up on. Am I in the minority here?! ",
        "upvotes": 59,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1l6nyt5/the_four_seasons/"
    },
    {
        "id": "1l795gv",
        "author": "niktrop0000",
        "title": "Department Q is great",
        "content": "\n\nThis show was great. Great cast and production. In the end the hint clearly at season 2. Being it on Netflix I can’t wait to have it cancelled or to watch season 2 in about 4 years time. ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l795gv/department_q_is_great/"
    },
    {
        "id": "1l6pe3s",
        "author": "CatSheeran16",
        "title": "Sirens",
        "content": "So I just finished the series, and at first I thought: what the hell did I just watch? At first I was kinda disappointed that it didn’t turn into a cult revelation thing. But then I thought about it, and it has a lot of depth. Maybe I‘m overthinking this, but this series shows us how easy it is to make the women the villain, how to frame them and how we do so easily believe it. Looking back, I just ignored the signs of Kiki being just nice without any agenda. The whole time I expected her behaviour to be calculating and cunning. I  jumped to the conclusion that she must be the bad guy as the show wanted us to believe at first. Even her behaviour contradicting this assumption didn’t sway me at first. But now I see the man who manipulates the viewers perspective. I so easily believed Peter when he talked about his alienation from his kids and it being kikis fault. But when she talked about how small the marriage made her and how horrible the kids were to her, it didn’t quite resonate as much. Frightening tbh, particularly because I would go as far as saying I have definitely and massively educated myself about the patriarchy and intersectional feminism. Maybe I’m interpreting too much, but if you look at it from a feminist perspective then it - amongst other things - shows us the sway of men’s opinion’s still and the smear campaign that always hits the women ten times harder. It shows us the dangers of dependency, especially as a woman. So, I kind of liked the show. I liked how it was over the top mostly and also sometimes even a bit satirical while dealing with heavier topics.  Let me know what you think and what your interpretation is",
        "upvotes": 48,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1l6pe3s/sirens/"
    },
    {
        "id": "1l77sx4",
        "author": "Optimal-Mycologist90",
        "title": "Dracula TV Show - 2000",
        "content": "There are three episodes that are about an hour and a half long. I read the book in college and I have seen this series twice. I remember my first time watching it, the actor who played Dracula seemed so familiar! I had never seen him in anything else. \n\nHas anyone else seen this? I absolutely loved it, though I'm still on the fence with the ending. \n\n10/10 would watch again.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l77sx4/dracula_tv_show_2000/"
    },
    {
        "id": "1l6zs35",
        "author": "Pure_Smoke833",
        "title": "I watched the series The Survivors and really liked it, but I didn’t quite understand one thing",
        "content": "There was a character — a writer — who seemed like a maniac. Was he added as a red herring so that viewers wouldn’t figure out who the real killer was? Or did I miss some moment where he was actually involved?",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l6zs35/i_watched_the_series_the_survivors_and_really/"
    },
    {
        "id": "1l6t07x",
        "author": "Dad4897623",
        "title": "Shows for when my daughter is in the room",
        "content": "I want to find more shows/movies on Netflix to watch that have PG ratings. I’m an adult and I enjoy watching all kinds of shows, but on the weekends I want to watch Netflix while I’m working out and my 4yo daughter is in the room playing, so I can’t have any bad dialogue or mature subject matter coming up.\n\n In the past I’ve really enjoyed watching a lot of ESPN 30 for 30 documentaries, but I’ve pretty much exhausted all the PG rated ones in that series. I’ve also watched movies like My All American, Home Team, and The Long Game, which have a sports theme but are family friendly. It doesn’t *need* to be a sports show though. Any suggestions?",
        "upvotes": 19,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1l6t07x/shows_for_when_my_daughter_is_in_the_room/"
    },
    {
        "id": "1l6tqmm",
        "author": "wndoshoppa",
        "title": "So I can't watch Becoming Led Zeppelin unless I pay an additional $10/month?",
        "content": "I was all ready to watch it tonight, but Netflix is telling me that i have to change to an ad-free plan. If that's the case, why wouldn't I just rent it on Amazon prime for $5.99? Make it make sense!",
        "upvotes": 15,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1l6tqmm/so_i_cant_watch_becoming_led_zeppelin_unless_i/"
    },
    {
        "id": "1l78vzh",
        "author": "DarthVada83",
        "title": "Recommend a series or movie that will make me a better/smarter person because I watched it.",
        "content": "Better/smarter person meaning I can get a new understanding and perspective of the human condition.  I tend to get anxious from some of the things I've watched in the past so I like to only go for inspirational/motivational content with positive messaging. Peaceful Warrior (not on Netflix) and Queen's Gambit are examples of what I love. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l78vzh/recommend_a_series_or_movie_that_will_make_me_a/"
    },
    {
        "id": "1l6zly9",
        "author": "akagiaa",
        "title": "DARK",
        "content": "Do you guys have anyth about the series Dark? Like bro its the most awesome series I have ever watched. But idk i didn't like  Hannah i mean she wanted Ulrich and why didn't she save him from that 1953 scene😭? I felt so bad for him. But salute  to those writers who came with this series concept 🫡",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l6zly9/dark/"
    },
    {
        "id": "1l74f6f",
        "author": "Dontevenwannacomment",
        "title": "Can someone explain the ending of The Residence to me?",
        "content": "Spoilers. \n\nSo at one point, the two detectives say they saw \"the blink\". They explain that the killer mentioned the suicide letter came from the victim's jacket pocket, yet that at no point they saw the letter be taken out of the jacket, so how would they know? \n\nBut earlier in the scene, the killer says that they saw the plumber put the suicide note in the jacket. So the cover story.... still works, doesn't it? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l74f6f/can_someone_explain_the_ending_of_the_residence/"
    },
    {
        "id": "1l6kbo8",
        "author": "Longjumping_Bowl_403",
        "title": "Archive 81: 8️⃣/1️⃣0️⃣",
        "content": "If you have even the slightest interest in horror, storytelling, or mystery, this show is for you. Strong narrative, engaging from start to finish, and enough depth to keep you hooked.\n\nThe reason it's an 8/10 is because:\n\n1. It is a bit drawn out, some dialogue and scenes feel unnecessary and 'unreal'- acting didn't make it feel 'real'.\n2. It lacked a sense of urgency, a fear factor. The kind of feeling you get when you’re caught between wanting to witness horror and wanting to escape from it.\n\nIf you haven't watched it, give it a shot. You likely won't be disappointed unless you have Fast &amp; Furious posters in your room.",
        "upvotes": 20,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1l6kbo8/archive_81_810/"
    },
    {
        "id": "1l71qwe",
        "author": "alphabae10",
        "title": "MARCUS",
        "content": "Who has already watched the final episode (S3E10) of the new Season of ***Ginny &amp; Georgia***?  \nDamn, that part where Max brought a drunk Marcus home from the party at Brodie's basement, and their parents caught them. I got teary-eyed as it was a very emotional moment where Marcus kept saying, *\"I hate me!\"* \n\n\n\nI felt that.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l71qwe/marcus/"
    },
    {
        "id": "1l6gs94",
        "author": "Champloo-",
        "title": "New ui on tv",
        "content": "Is there any way to see more than 3-4 items on my huge ass tv screen? Who thought that was a good idea?\n\nAlso, is there any way to quicky access the \"new/soon on netflix\" tabs? Do they not want people to notice their new releases anymore?\n\nI normally don't really care about app uis being updated, but the new netflix ui makes browsing the app just so much worse.",
        "upvotes": 24,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1l6gs94/new_ui_on_tv/"
    },
    {
        "id": "1l6wenq",
        "author": "hxneygirly",
        "title": "outer banks",
        "content": "is outer banks really that good? i tried watching it before, but it just never seemed entertaining to me. to be fair i only watched like half of season 1 but idk. should i give it another chance? ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l6wenq/outer_banks/"
    },
    {
        "id": "1l7690e",
        "author": "jerkoff1610",
        "title": "Right, who plays Wolfe in Ginny and Georgia season three and where have we seen him before?",
        "content": "Someone said he looks like Timothée Chalamet and Sinjin from Victorious had a baby. lol ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l7690e/right_who_plays_wolfe_in_ginny_and_georgia_season/"
    },
    {
        "id": "1l6zalm",
        "author": "Fine_Mammoth8468",
        "title": "Netflix Bounty Program",
        "content": "Is Netflix Bounty Program is still up and running? I found a flaw that can bypass the “your device isn’t part of the Netflix household for this account”. It works through the Netflix app itself using any type of device (phone, tablet/iPad, tv, Netflix’s website in seconds. I’m assuming there’s a monetary incentive associated with the program.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l6zalm/netflix_bounty_program/"
    },
    {
        "id": "1l6vt80",
        "author": "Jamminatrix",
        "title": "Caption size option disappeared from app...",
        "content": "Trying to watch I'm Still Here on my Roku TV and the captions are the literal equivalent to a size 8 or 9 point font from my viewing distance.  There no longer is an option for caption sizes that I can see. \n\nI've tried changing captions under Roku's system settings but that doesn't effect the app.  \n\n\n\nhttps://preview.redd.it/78qxgkn3wt5f1.jpg?width=3677&amp;format=pjpg&amp;auto=webp&amp;s=a908aabaf1bd4f3dfd38936efe9c979c38e496ca",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l6vt80/caption_size_option_disappeared_from_app/"
    },
    {
        "id": "1l6uqxn",
        "author": "jusdandyy",
        "title": "Physical: 100 - Looking for song",
        "content": "In season 2 episode 5 around 44 minutes into the episode there’s a song that plays and I’m trying to find it. No other song they’ve played has made me physically stop, shazam (and fail,) listen to the whole playlist on spotify, be sad I didn’t find it, then make a post on reddit about it lol. Please help!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l6uqxn/physical_100_looking_for_song/"
    },
    {
        "id": "1l6wfzc",
        "author": "TheRealEdroopetz",
        "title": "What movie is this called?",
        "content": "It was like a post apocalyptic movie with sea creatures like an octopus underwater mind you it was like animated and they gotta find like a spaceship or something and humans aren't on earth and this movie was around like 3 years ago can anyone tell me?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1l6wfzc/what_movie_is_this_called/"
    },
    {
        "id": "1l65loo",
        "author": "phaffgiraffe",
        "title": "Dept Q - Season 2?",
        "content": "When does Netflix typically announce they’re renewing a series for season 2? I NEED a second dept q series - and fear I won’t sleep until it’s announced. Netflix put me out of my misery please, or help me manage my expectations. 😅 \n\nDoes anyone have any example timelines from other similar shows? \n\n",
        "upvotes": 62,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1l65loo/dept_q_season_2/"
    },
    {
        "id": "1l6kx8f",
        "author": "Tagglit2022",
        "title": "Looking for light shows",
        "content": "**I've had a rough  couple of monts when my mother passed  away .. I'm looking for light  series that I can watch after a loong day to decompress .**\n\nI've watched Ginny and Gerogia , Firefly lane, Virgin river and sweet Magnolias\n\nI did like sweet magnolias  most and the rest were'nt bad\n\nI read that Sirens is kinda ok to decompress with?\n\nAny other recommendations?\n\nTIA",
        "upvotes": 3,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1l6kx8f/looking_for_light_shows/"
    },
    {
        "id": "1l6etap",
        "author": "Level_Most_2903",
        "title": "Recommendations",
        "content": "Just bought Netflix and was wondering if there is anything decent to watch on Netflix at the moment? I have just Started watching adolescence. Give me recommendations peeps ",
        "upvotes": 10,
        "comments": 61,
        "media": null,
        "permalink": "/r/netflix/comments/1l6etap/recommendations/"
    },
    {
        "id": "1l6sf59",
        "author": "stravocadomf",
        "title": "“Mercy for None” is a really good show if you want a recommendation!!",
        "content": "It’s a show about a brother who goes on a rampage to kill his brothers murderer. \n\nSuper bloody, lots of deaths, broken bones, etc. it’s genuinely so good. \n\nThe plot isn’t just some bs either. Twists and turns in this Mf. it’s super good. Idk how many times I can say it ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l6sf59/mercy_for_none_is_a_really_good_show_if_you_want/"
    },
    {
        "id": "1l72uju",
        "author": "Longjumping_Land_977",
        "title": "Real life Martha from Baby Reindeer says she’s ‘going blind’ due to Netflix lawsuit",
        "content": "",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l72uju/real_life_martha_from_baby_reindeer_says_shes/"
    },
    {
        "id": "1l5yp3d",
        "author": "Inevitable-Scar-2982",
        "title": "Please give me some good mind bending shows!",
        "content": "I love shows that make you think and leave you stunned. I wanted to be genuinely shocked!\nLike I’ve seen Dark and it was the best shows I’ve EVER EVER SEEN! I need shows like Dark, The OA, Umbrella Academy, Love, death and robots, Black Mirror and Years and Years. I can’t explain what you’d call these but just ones with twists and that aren’t predictable. \nPlease give me some actual good shows along these lines, I tried ‘From’ and I just found it too boring and couldn’t get into it. Please no detective dramas! I lot of these shows are going in an AI direction which is really cool. \n\nI just need something gripping from start to finish, no predictability. \n\nEDIT: I’ll write the current ones I’m watching and what I thought once I’ve finished:\nThe Devil’s hour ",
        "upvotes": 102,
        "comments": 144,
        "media": null,
        "permalink": "/r/netflix/comments/1l5yp3d/please_give_me_some_good_mind_bending_shows/"
    },
    {
        "id": "1l5zkqa",
        "author": "Movingskyclub",
        "title": "Parents stayed over for a week watching Korean dramas. How do I delete that history so I stop getting recommended shows similar to those?",
        "content": "I have no taste for Korean dramas, sadly, and now I’m getting lots of recommendations for “internationally acclaimed romantic dramas”. How do I stop this, short of resetting my watch history?",
        "upvotes": 76,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1l5zkqa/parents_stayed_over_for_a_week_watching_korean/"
    },
    {
        "id": "1l6qvvh",
        "author": "InSoupWeTrusted",
        "title": "Adolescence",
        "content": "Can someone help me settle an argument with my wife on this series. \n\nWe both agree that the show is highlighting the effects of online bullying, toxic masculinity such as Tate etc has on young boys, but what we don't agree on is whether the show was trying to portray Jamie's father's treatment of his wife as a potential factor in how Jamie turned out. \n\nI believe the scenes showing interactions between Jamies parents in the last episode are that of only grief - not grief and highlighting a power dynamic between Jamie's father and mother.\n\nMy wife believes how Jamie's dad spoke to his mother when he's trying to clean the van was alluding to how this display of masculinity overpowering femininity in the house had contributed to Jamie's actions.\n\nI believe it was a pure display of grief, anger and confusion being displayed via agression - at the bucket, the cleaning of the van etc. The show was not trying to portray this being directed at his wife, but the situation they are facing.\n\nWhat are your thoughts? ",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1l6qvvh/adolescence/"
    },
    {
        "id": "1l6qivy",
        "author": "United_Credit_6264",
        "title": "ginny and Georgia Season 3 discussion",
        "content": "From the title, you should already know that there will be spoilers at least somewhat. So please be prepared.\n\nFor the people that have watched the whole new season, can we please talk about how we feel about this season? And how we feel about the characters in this season?\n\nGet ready for spoilers \n\n1\n💥\n💥 \n💥 \n💥 \n💥 \n💥 \n💥 \n💥 \n2\n💥 \n💥 \n💥 \n💥 \n💥 \n💥 \n💥 \n💥 \n3\n💥 💥 💥 💥 \n\nTo start off nicely, I want to say I really liked Hunters character in this season and I also liked him with Padma. That’s really all I can say that’s nice because everyone else’s character was pretty much the exact same or got worse.\n\nPaul: I lost all respect in him. I lost it as soon as he walked up angrily to Georgia and slammed his hand on the wall right next to her head. Before then, I could understand where he was coming from. But to act like that is unacceptable. And he didn’t apologize.\n\nGeorgia: I have so many mixed feelings and thoughts on her. Like she’s selfish but yet she isn’t because she cares deeply for people. She definitely thinks she’s all that. Not like she has money, but like you can’t touch her. Like she could do anything and get away with that. Which is what happened. I couldn’t decide if I thought she deserved to go to prison or not. And not even for the last murder because that one I can actually understand and I wouldn’t have blamed her honestly. But for the other two murders. Like three murders in total is a lot to get away with for a person. \n\nGinny: I really grew to not like her. I didn’t like how judgmental she was on her mom. Like yes, I understood where she was coming from for the most part… but she didn’t have to be so judgmental. Like let’s understand that your mom had a terrible life and this is all she knew how to survive. And she did everything she thought she could to keep her kids safe and with her. And the way Ginny turned Austin against his dad. Like I know her thought process with everything but still she should have thought about how it would affect her little brother. What she had him do is going to stay with him for the rest of his life. And then obviously the way she treated Maxine. The scene between her and Maxine talking at the party in the last episode. I was not OK with how she was looking at Maxine or the way she talked to her. I lost a lot of respect in ginny because of that. I understand in the show Maxine‘s attitude is overwhelming, but the way Ginny acted towards her just wasn’t it for me. I also couldn’t stand how rude Abby was to Maxine either. But that was more predictable and not surprising from Abby. I felt really bad for Maxine and all the stuff she was going through and didn’t have her friends to talk to. I know how that is and it sucks.  So yeah boo Ginny and Abby.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l6qivy/ginny_and_georgia_season_3_discussion/"
    },
    {
        "id": "1l6qar8",
        "author": "hashtagdumplings",
        "title": "The Replacement…um?",
        "content": "Just watched the mini series The Replacement which I believe originally came out in 2017. Set in Scotland, good cast - good first episode. Then what the hoot happened! \n\nThat was the most scrambled, messy holey plot of nonsense I think I’ve ever watched? \n\nCan someone please explain at the very least the following? Or explain what the writer might have been thinking??\n\n- Georgia. Why is she helping Paula if the police already know what happened? Why did Kay contact her in the first place? \n\n- So Paula killed Kay just because she wouldn’t stop talking about her daughter? That’s that thread wrapped up? Really?\n\n- The amount of unsafe baby things happening in the show that go completely unmentioned and normalised - infant sleeping in a crib with blankets, mum driving with baby in the front seat (!!!), placing basket bassinet on a ledge and walking away…! What is going on here.\n\n- Did the niece just play along? \n\n- How did Ellen overcome taking all those pills? At this point I was ready for the episode to end o admittedly I was fast forwarding - maybe this is explained and I missed it. \n\n- We’re supposed to believe Ellen just all of a sudden learned/ figured out how to hot wire a car? \n\n- How did the police end up in the library? They didn’t believe Ellen before so why would they now believe it was Paula who took the baby and not Ellen? \n\nI was so excited about this after the first episode so am a bit flabbergasted at how off the rails it got. Would love to hear what everyone else thought \n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l6qar8/the_replacementum/"
    }
]