[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 485,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1i088vi",
        "author": "Robemilak",
        "title": "‘Squid Game’ creator explains why the new character is called Rapper Thanos: \"It doesn’t really suit a rapper as a name, it was to design him to be a character fans worldwide could love.\"",
        "content": "",
        "upvotes": 156,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1i088vi/squid_game_creator_explains_why_the_new_character/"
    },
    {
        "id": "1i04q8i",
        "author": "Substantial-Class945",
        "title": "Top 5 Netflix limited series! In my opinion 😆 ",
        "content": "Please recommend yours!",
        "upvotes": 177,
        "comments": 100,
        "media": null,
        "permalink": "/r/netflix/comments/1i04q8i/top_5_netflix_limited_series_in_my_opinion/"
    },
    {
        "id": "1hzzkv6",
        "author": "Mysterious_Ad_6190",
        "title": "Jerry Springer Documentary ",
        "content": "Okay, I keep seeing comments about what a terrible documentary it was. Could it have touched on more? Of course. But I don’t think that was the point.\n\nI think the point of the film was to get at the heart of how this show, that loved the numbers it drew from shocking the public - because they literally wanted people to stop flipping the channel when they passed by and it worked - and how the impact of seeing people violent and pitted against each other had a horrible influence on all of us.\n\nWe see reality TV shows still push the boundaries in different ways, but they feed off of making us disconnect from our own lives and play comparison - at least my life isn’t that bad!\n\nBut we are further seeing the psychological impacts on our everyday lives in the political world. We are losing our empathy for each other when we are all each deeply shaped by our life experiences. I get that everyone is different, but we’ve become so divided and I have no doubt that Jerry Springer among other reality shows, among other factors in the media are doing an excellent job at feeding our apathy. We aren’t each other’s enemies. It’s the people at the top who are playing mind games. We aren’t going to see the change we long for until we stop turning on each other.\n\nThis is what I got out of the film at least. Anyone else?",
        "upvotes": 93,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1hzzkv6/jerry_springer_documentary/"
    },
    {
        "id": "1hzjlvc",
        "author": "S4v1r1enCh0r4k",
        "title": "'Squid Game's' Park Sung-hoon Drops Out of K-Drama, 'The Tyrant’s Chef,' After NSFW Social Media Controversy",
        "content": "",
        "upvotes": 947,
        "comments": 210,
        "media": null,
        "permalink": "/r/netflix/comments/1hzjlvc/squid_games_park_sunghoon_drops_out_of_kdrama_the/"
    },
    {
        "id": "1i00f1r",
        "author": "MrJellyfish16",
        "title": "Fun shows to watch after terrible breakup?",
        "content": "Just went through the worst breakup of my life. legitimately thought I was gonna spend my life with this girl. I'm amazingly bored and need an upbeat show to watch. Maybe something that doesn't focus on people with perfect relationships. What are your go-to shows for tough times?",
        "upvotes": 27,
        "comments": 66,
        "media": null,
        "permalink": "/r/netflix/comments/1i00f1r/fun_shows_to_watch_after_terrible_breakup/"
    },
    {
        "id": "1i04oon",
        "author": "flying-ravens",
        "title": "Movies or shows to watch while I'm feeling bored and blue? ",
        "content": "Shows I liked:\nThe crown,\nAnne with an e,\nCommunity (first 2 seasons),\nI liked the first season of superstore,\nSquid game,\nShameless (first 9 seasons) ,\nOrange is the new black,\n\nThe movies I recently liked:\nMy girl,\nMahalia,\nThe six triple eight,\nGifted ,\nTitanic, \nAnd I do like watching biopics just out of curiosity (knowing they are inaccurate most of the time)",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1i04oon/movies_or_shows_to_watch_while_im_feeling_bored/"
    },
    {
        "id": "1hzxrfz",
        "author": "beardhoven",
        "title": "Do you prefer watching documentaries which are solved or unsolved?",
        "content": "For me, I always prefer the unsolved cases which are often shrouded in mystery. My wife seems to prefer documentaries which are often solved, particularly when there has been a crime committed.",
        "upvotes": 14,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1hzxrfz/do_you_prefer_watching_documentaries_which_are/"
    },
    {
        "id": "1i07djp",
        "author": "Icy-Fondant9449",
        "title": "Not able to watch stuff on netflix???",
        "content": "Half of the stuff on netflix all of a sudden wont let me watch it. It only says remind me later and some of the covers for movies and shows are like blank if that makes sense.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1i07djp/not_able_to_watch_stuff_on_netflix/"
    },
    {
        "id": "1hzsaym",
        "author": "Tacos_and_Tulips",
        "title": "Do you remember the name of this series?",
        "content": "SOLVED!!\n\nI need your help in finding an older medieval tv series. I can't remember the name of it and all my searches have come up short.  It was on Netflix for awhile, still could be.  It had a number/year for the name. It was a medieval/kings/magic type show. \n\nHere come some spoilers, so if you have watched it then you know - \n\nIt is a story about 3 friends. 2 are dating, and the other was adopted by a king. Long story short - as I remember the three of the them come up with a plan. The female in the couple agree to \"fake\" marry the friend to save the kingdom or something... there is a battle - she thinks her boyfriend is dead, so she and new hubby really start looking at each other as husband and wife - then find out bro isn't dead... there is a big battle at the end of the series - chick finds out she is preggers with bro's baby....\n\nWhat was that series called?\n\nThank you!! \n\nEdit: Much thanks to everyone who took time out of your days to help me find this! The show is called Barbarians! Thanks @ExitStageRight99",
        "upvotes": 16,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1hzsaym/do_you_remember_the_name_of_this_series/"
    },
    {
        "id": "1i09l6x",
        "author": "Khelge",
        "title": "How to get support from Netflix?",
        "content": "Hey, how do I get support from Netflix? Their chat says it's outside their operating hours even tho it says on their support page that support is open 8am to 8am and their call option in the app just gives me a weird voice saying \"test msg when the call fails\" then hangs up. Are there any alternatives apart from chat/call in the app? ",
        "upvotes": 2,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/d3vbd0fp2qce1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1i09l6x/how_to_get_support_from_netflix/"
    },
    {
        "id": "1i08u36",
        "author": "Ok_Department_867",
        "title": "Younger series",
        "content": "Younger series recently came out, and I’m on the episode where she tells her bf her age so I was just curious, how would you guys react if you started dating a person who lied about their age and was actually 15 yrs older ? \n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i08u36/younger_series/"
    },
    {
        "id": "1i03w63",
        "author": "Substantial-Class945",
        "title": "Murder mindfully",
        "content": "I love this show! Absolutely everything about it is perfect 👌 any recommendations? Preferably on Netflix! Or tubi or Roku 😂 the free stuff 😆 but yeah thanks! 🙏 ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i03w63/murder_mindfully/"
    },
    {
        "id": "1i048s1",
        "author": "DaikonSpecial9689",
        "title": "Profile recovery?",
        "content": "My kid accidentally deleted my profile when trying to log out of a device.  Mine is the main profile on the account that I've had since 2007.  Is there any way to recover it?  Or is all of my stuff lost forever?  ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i048s1/profile_recovery/"
    },
    {
        "id": "1hz3l5s",
        "author": "AgreeableOnion1453",
        "title": "KAOS was one the best, most creative shows of the decade",
        "content": "Just finished a second watch. It’s absolutely unbelievable that Netflix canceled it, and a testament to how empty and soulless their programming has become. It was funny, smart, visually beautiful, genuinely unique, and the next season would have been incredible! Huge thumbs down to Netflix. Enough empty reality shows and cheap crap. ",
        "upvotes": 322,
        "comments": 87,
        "media": null,
        "permalink": "/r/netflix/comments/1hz3l5s/kaos_was_one_the_best_most_creative_shows_of_the/"
    },
    {
        "id": "1hztdhp",
        "author": "Eltrew2000",
        "title": "Are you not supposed to even see an account in a different region?",
        "content": "When my partner in canada tried to log into my account (EU) it netflix acts like the account doesnt even exist not just inaccessible from the region but non existent. ",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hztdhp/are_you_not_supposed_to_even_see_an_account_in_a/"
    },
    {
        "id": "1i03a0t",
        "author": "SugarRai_",
        "title": "Netflix doesn't display subs or subs in my language",
        "content": "Hi! So I have a question about Netflix.\n\nI have recently started (binge) watching Spy x Family on Netflix and just finished the first season. When I went on to watch the second season, which only recently came out on Netflix, there were no dubs or subs available in a language I can understand. \n\nI live in Belgium, which has 3 national languages but I only have subtitles in French or German, two languages that I barely speak. I am however bilingual in Dutch and English and neither of those languages have a dub or sub which makes it impossible for me to understand the show.\n\nI know I could watch it on crunchyroll but I do not want to spend money on another subscription as I do not watch anime very often. I also have had these problems before with other shows which led me to stop watching them.\n\nWill the sub or dub ever come out or is this just an issue Netflix will have forever?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i03a0t/netflix_doesnt_display_subs_or_subs_in_my_language/"
    },
    {
        "id": "1i028sh",
        "author": "Few-Plate-1926",
        "title": "The Perfect Couple",
        "content": "Only 30 minutes into the first episode and this already feel like a direct copy of The White Lotus and Big Little Lies, especially with Fahy and Kidman being in the cast. Thoroughly enjoyed both of those shows so it seems like this would be right up my alley, is it worth the watch?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1i028sh/the_perfect_couple/"
    },
    {
        "id": "1i00ums",
        "author": "Pugalshish",
        "title": "More Cells at Work",
        "content": "I just looked at Netflix in this year of 2025 on American Netflix and saw Cells at Work. More importantly, it said, \"New Season Coming Soon\". Unfortunately, when I clicked on the show, it didn't give me a date of timeframe to expect the new season. So, I was wondering if anyone might know.\n\n[What I saw](https://preview.redd.it/opye2q7zince1.png?width=1919&amp;format=png&amp;auto=webp&amp;s=3d2f23752ac28953940c335e4998e8852f4d9eeb)\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i00ums/more_cells_at_work/"
    },
    {
        "id": "1i00tbh",
        "author": "blush0_0",
        "title": "Is there a way to reset my Netflix episodes?",
        "content": "I am currently watching a show but there are multiple accounts on it and when I try to remove it from the website of recently watched it only gives me one account option and I can't change the rest.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i00tbh/is_there_a_way_to_reset_my_netflix_episodes/"
    },
    {
        "id": "1hzq00h",
        "author": "givemeacow",
        "title": "Looking for an ufo documentary",
        "content": "Does anyone know what documentary (or episode in documentary series) includes a man, who believed he was an alien and drawed pictures of his \"real family\", including his alien mom and alien girlfriend? I want to show it to my friend but can't find it when I tried to search it! Thank you!",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hzq00h/looking_for_an_ufo_documentary/"
    },
    {
        "id": "1hzva7q",
        "author": "pseudonymnkim",
        "title": "Netflix downloads, screencasting, smart TV, 2 accounts ",
        "content": "Hi, \n\nTried to see if this question was answered elsewhere but no luck. \n\nI am logged in to Netflix account A on my phone. My Smart TV is logged into Netflix Account B. \n\nI'm already aware I can't screencast from my phone to the TV unless I am logged in to the same account on both devices (so dumb), but can I get around this if I were to download content from Netflix? ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hzva7q/netflix_downloads_screencasting_smart_tv_2/"
    },
    {
        "id": "1hzgm64",
        "author": "Heywood_Jablowme__",
        "title": "What show is this?",
        "content": "My dad is here for the night and i desperately want him to watch an episode of this show I can’t remember the name of! It was a series and each episode is a totally different story. The episode I’m referring too is about a rice farmer turned monster during the Vietnam war. He gets so mad that he starts levitating things and ends up turning into this wicked monster! Please help, I know you won’t let me down 🙏 ",
        "upvotes": 19,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1hzgm64/what_show_is_this/"
    },
    {
        "id": "1hzy4ge",
        "author": "Controverseopinion",
        "title": "Streaming services not working ",
        "content": "All of my streaming services(Crunchyroll, Netflix, and Disney plus) aren't working, the screen goes black and I just get audio. I've tried all the basic stuff, clearing cache, checking wifi, restarting phone, uninstalling and reinstalling, ect. The services work on my computer so idk what's going on. And of course google is being useless. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hzy4ge/streaming_services_not_working/"
    },
    {
        "id": "1hz77fh",
        "author": "Tomilesean",
        "title": "Why is to skip intro so high up?",
        "content": "",
        "upvotes": 71,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hz77fh/why_is_to_skip_intro_so_high_up/"
    },
    {
        "id": "1hzs1sz",
        "author": "lamperougehive",
        "title": "History of bug report's",
        "content": "I'm sure that before, about 3 or 4 years ago, there was a way to see the bug reports we sent to netflix about bad subtitling or something. it was a kind of history of our reports but I can't find it anymore. Am I crazy or has it been removed? Thanks",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hzs1sz/history_of_bug_reports/"
    },
    {
        "id": "1hzvwh9",
        "author": "whoShotMyCow",
        "title": "Audio bug in mission impossible dead reckoning ",
        "content": "Movie went up on Netflix on 10th Jan and while watching it today, around the 1:12:00 mark there's a horrible audio correction attempt. Anyone else witnessed this or am I hallucinating",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hzvwh9/audio_bug_in_mission_impossible_dead_reckoning/"
    },
    {
        "id": "1i02z5r",
        "author": "StarKCaitlin",
        "title": "Duchess of Sussex's Netflix show With Love, Meghan delayed over LA fires",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i02z5r/duchess_of_sussexs_netflix_show_with_love_meghan/"
    },
    {
        "id": "1hzexrd",
        "author": "LiamJMT",
        "title": "What to watch for a 15 year old with strict parents?",
        "content": "I like Sci-fi, horror, Korean, and Intense Action shows\n\nBut my parents limit me to these rules\n\nAbsolutely NO sex or nudity\n\nBlood and gore should be minimal (but who cares for me it’s moderate to severe)\n\nThe plot has to be good (obviously)\n\nAnd It’s gotta be (at least what you think) 15-18 year old’s age appropriate stuff",
        "upvotes": 14,
        "comments": 61,
        "media": null,
        "permalink": "/r/netflix/comments/1hzexrd/what_to_watch_for_a_15_year_old_with_strict/"
    },
    {
        "id": "1i04v75",
        "author": "thisfilmkid",
        "title": "American Preimeval",
        "content": "Honestly, what are people’s thoughts on the first few episodes?\n\nFor some reason, there are parts of this series that bore me. The action wakes me up. Today, I finished episode 3, and I found myself detached from watching the full episode. I was more focused on scrolling through my phone midway through the film because of boredum. \n\nI’m getting ready to rewatch from episode 1 because I want to give this film a chance. It’s way too early for me to dismiss it already. \n\nIs it worth watching for others?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1i04v75/american_preimeval/"
    },
    {
        "id": "1hzsv87",
        "author": "Thin-Life-4375",
        "title": "Sakamoto days ",
        "content": "Hey with netflix subscription you can watch a single episode of Sakamoto days but with some random website they are offering me 2 episodes which suppose to arrive on next Saturday was it worth the subscription?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hzsv87/sakamoto_days/"
    }
]