[
    {
        "id": "1hqxs0r",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://t.me/+K_tQ4Zzi0S80YjFk): Gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[LA TAVERNA DELLO STUDENTE](https://t.me/latavernadellostudente/5207): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g30QJSClHjRAUvFBqKJa-Re4duFBniS6HkLBoJRdgOQ.jpg?auto=webp&amp;s=2c44cf9a902b77de7dce3b5cad542f22791fb32e"
        },
        "permalink": "/r/torino/comments/1hqxs0r/la_piola_friends_meetup/"
    },
    {
        "id": "1hqxs0j",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram group for apartment hunting: https://t.me/CaseStudentiTorino\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 2,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1hqxs0j/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1i3ui2d",
        "author": "Alarmed_Lawyer400",
        "title": "C'è qualche ritrovo/ qualcuno che mette gentilmente a disposizione un telescopio per l'allineamento planetario del 21?",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1i3ui2d/cè_qualche_ritrovo_qualcuno_che_mette_gentilmente/"
    },
    {
        "id": "1i3gbhg",
        "author": "Prestigious_Use9038",
        "title": "Band emergenti punkrock/metal?",
        "content": "Ciao ragazzi, sono diversi mesi che sto scoprendo nuove band punk/poppunk/punkrock/metalcore di Torino, avete qualche nome da farmi? Questo sottobosco musicale che sto scoprendo mi piace sempre di più :D",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1i3gbhg/band_emergenti_punkrockmetal/"
    },
    {
        "id": "1i31ej4",
        "author": "BrutalSock",
        "title": "Questo è “Io sono leggenda”",
        "content": "9:47, il protagonista sta guardando il telegiornale e per qualche motivo i giornalisti, sullo sfondo, hanno Piazza San Carlo. ",
        "upvotes": 56,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3rwz07oxnfde1.jpeg?auto=webp&amp;s=238dd7283009f47bbac23dd3d093fd2351ee4fe9"
        },
        "permalink": "/r/torino/comments/1i31ej4/questo_è_io_sono_leggenda/"
    },
    {
        "id": "1i3mowd",
        "author": "ApprehensiveStar2568",
        "title": "Acqua dentro a ciabatta ",
        "content": "Buonasera, prima di uscire di casa ho inavvertitamente fatto cadere dell'acqua dentro a una ciabatta e ho proprio visto l'acqua entrare all'interno delle spine di questa ciabatta. La quantità caduta non è tantissima ma nemmeno definibile come \"schizzi\", all'incirca un fondo di bicchiere per intenderci. A questa ciabatta (che per di più è molto vecchia quindi non so quanto sia affidabile come sistemi di sicurezza) è collegato un caricatore di un telefono. Purtroppo ero molto di fretta e l'unica cosa che ho fatto è spostare la ciabatta dal comodino, dove era appoggiata, al pavimento. Dall'altra parte del letto ho un'altra ciabatta collegata a una presa a parete che però, ahimè, prende l'elettricità dalla presa a cui è attaccata l'altra ciabatta (con delle canaline da cui passano i cavi). Purtroppo io sarò assente da casa mia per due notti e ho spiegato tutto l'accaduto alla mia ragazza. Volevo sapere se per voi fosse comunque sicuro utilizzare un caricatore che è già attaccato alla seconda ciabatta (dunque non a quella incriminata) per caricare il telefono. Quando è successo il fatto non è saltata la corrente e specifico inoltre che hanno cambiato il contatore giusto un paio di giorni fa. Grazie a tutti in anticipo per la disponibilità.",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1i3mowd/acqua_dentro_a_ciabatta/"
    },
    {
        "id": "1i3c7fl",
        "author": "selalleroo",
        "title": "Partitelle di pallavolo ",
        "content": "A breve conto di trasferirmi a Torino , e mi farebbe piacere ricominciare a fare qualche partita di pallavolo. Al momento sono troppo arrugginita per pensare di entrare in una vera squadra in campionato. L'idea sarebbe quella di trovare una squadretta in amicizia per fare qualche partita con l'obiettivo di divertirsi (tipo \"il calcetto della domenica\"). F27, ho un livello da terza divisione ormai. Esiste già qualche bella compagnia (anche mista eh, non per forza solo al femminile) che fa questa cosa? Grazie ciaooooo ",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1i3c7fl/partitelle_di_pallavolo/"
    },
    {
        "id": "1i3lfzc",
        "author": "Advanced_Air9286",
        "title": "Consiglio locale zona santa Rita, stadio olipico",
        "content": "Ciao ragazzi, qualcuno conosce un bel locale per bere zona santa Rita stadio olimpico? La di corso agnelli. Per serata con 6 persone di target 30 anni",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1i3lfzc/consiglio_locale_zona_santa_rita_stadio_olipico/"
    },
    {
        "id": "1i3kx3a",
        "author": "idontknowausernamer",
        "title": "Ricostruzione unghie a Torino",
        "content": "Ciao a tutti, vorrei iniziare a fare la ricostruzione alle unghie, anche da privati, l'importante è che non costino un rene. Consigli?\n\nvanno bene anche posti nei dintorni di Torino. Grazie a chiunque risponderà.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1i3kx3a/ricostruzione_unghie_a_torino/"
    },
    {
        "id": "1i3iogv",
        "author": "AfroJn",
        "title": "Domanda per i locali",
        "content": "Ciao gente di Torino! Presto mi trasferirò a Torino e ho trovato un bel appartamento al confine tra Lingotto e Mirafiori Nord. Ho letto alcune opinioni negative su queste zone su internet e mi chiedevo cosa ne pensano i locali. Sarebbe sicuro per una donna, sia di giorno che di notte?",
        "upvotes": 1,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1i3iogv/domanda_per_i_locali/"
    },
    {
        "id": "1i398ec",
        "author": "_Luigino",
        "title": "L'Italia in cartolina – Torino",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HX4PpolbWaNqAjGbBBXRlUuEnPE_rI1q3k-pOwVyJfU.jpg?auto=webp&amp;s=25de4b15bf3c91a4c471c3795f921097ce9fb4f5"
        },
        "permalink": "/r/torino/comments/1i398ec/litalia_in_cartolina_torino/"
    },
    {
        "id": "1i31sb8",
        "author": "BlueLights420",
        "title": "Parrucchiere per colorare i capelli",
        "content": "Salve gente, conoscete per caso un buon parrucchiere qui a Torino che se la cavi bene nel fare i capelli colorati e che offra possibilmente un prezzo non altissimo?\nGrazie a tutti 😉",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1i31sb8/parrucchiere_per_colorare_i_capelli/"
    },
    {
        "id": "1i39nv7",
        "author": "Jhon_Titorto",
        "title": "Soddisfazione reciproche",
        "content": "PARCHEGGIO TORINO (M35 Bisex) : paecheggi, abbassi il sedile mettendoti comodo e ti... ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1i39nv7/soddisfazione_reciproche/"
    },
    {
        "id": "1i2xq6q",
        "author": "barbax-7",
        "title": "Qual è il food delivery più usato?",
        "content": "Mi metto sempre a confrontare i vari servizi di food delivery perché mi è capitato in passato di trovare prezzi più alti in uno, ma andando a risparmiare alla fine poiché commissioni più basse.\n\nPerò ho come la sensazione che, per esempio, Just Eat sia il meno usato perché ha un sacco di posti che non ho mai sentito, e in generale hanno veramente poche recensioni.\n\nQual è invece l'opinione di voi altri che vivete Torino? Qual è il food delivery più usato dai locali, e quale preferite usare voi e perché?\n\n[View Poll](https://www.reddit.com/poll/1i2xq6q)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1i2xq6q/qual_è_il_food_delivery_più_usato/"
    },
    {
        "id": "1i2uuxk",
        "author": "WestSuspicious115",
        "title": "Torinese",
        "content": "Ciao,\n\nI'd like to know if there are any other forums that people residing in turin talk, have Q/As like this sub reddit.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1i2uuxk/torinese/"
    },
    {
        "id": "1i2m3y5",
        "author": "_lostinthisworld_",
        "title": "La bolletta della luce ",
        "content": "Ciao a tutti, ho una domanda riguardo la bolletta della luce Simecom. Ho pagato la bolletta in posta 3 giorni fa, tuttavia nell'app ancora non risulta come pagata e domani scade il termine per il pagamento. Questo mi creerà dei problemi? Grazie per l'aiuto \n\n\n\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1i2m3y5/la_bolletta_della_luce/"
    },
    {
        "id": "1i2l9aq",
        "author": "WestSuspicious115",
        "title": "Parco Dora",
        "content": "Hello!\n\nI'm new in Torino, and I got a good deal for an apartment near Parco Dora, to be exact, in Via Orvieto ~ Via Tesso.\n\nI'll be living alone and don't know the owner very well.\nBut it's an offer of 480€ for a room.\n\nI have 2 questions:\n\n1. How much is the price for electricity approximately, for a person who doesn't consume too much. (the heater works with electricity)\n\n2. Is this neighbourhood safe?\nI have heard bad news about Milan Barriera and Parco Dora. And I don't know if it's a good offer for me or not.\n\nI'm a naive and timid person, I want to know if I'll be safe living here.\n\nIs there a chance of someone breaking inside \nhomes or pick pocketing, or worse, in this area? (I know these things can happen anywhere, I just want to know if it's more probable here or not)\n\n\nEdit :\n\nI also have another option in Lingotto, near Palazza Carlo Giacomini.\nThe room is not something I like very much, since it's not as bright, but I get to have housemates of my own ethnicity.\nAlso, there's a cleaning lady every month.\n\nI like the Parco Dora apartment better, but I don't know if it's the better choice. Parco Dora seems very far away from everything because of the lack of Metro.",
        "upvotes": 1,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1i2l9aq/parco_dora/"
    },
    {
        "id": "1i21i9r",
        "author": "xclajre",
        "title": "dogsitter",
        "content": "ciao! vorrei provare a fare da dogsitter per avere una piccola entrata, avete esperienza/consigli in merito?\n\nTempo fa mi ero iscritta all'app Rover ma non avevo trovato nessuno padrone interessato, forse la mia zona non è tra le più richieste (San Donato), conoscete altre app o servizi che possano mettermi in contatto diretto con i padroni? Grazie!",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1i21i9r/dogsitter/"
    },
    {
        "id": "1i1udoo",
        "author": "giokim77",
        "title": "Serata stand up stasera, vuoi venire?",
        "content": "Ciao,\nVado al camala (o comala) per una serata stand up ad offerta libera. Forse vado anche all aperitivo prima (31M). \n\nSe vuoi unirti, donna uomo o marsupiale, scrivimi :)",
        "upvotes": 8,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1i1udoo/serata_stand_up_stasera_vuoi_venire/"
    },
    {
        "id": "1i1vdns",
        "author": "doc_santini",
        "title": "looking for a real estate agent ",
        "content": "I just moved to Torino in June. Looking for someone to show me some places to rent or buy. If you are an agent or have had a good experience with a agency send me a dm!\n\nTIA",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1i1vdns/looking_for_a_real_estate_agent/"
    },
    {
        "id": "1i1cci1",
        "author": "DueToRetire",
        "title": "Esistono delle città ben collegate a Torino, con una buona qualità dell’aria/poco inquinamento?",
        "content": "",
        "upvotes": 13,
        "comments": 52,
        "media": null,
        "permalink": "/r/torino/comments/1i1cci1/esistono_delle_città_ben_collegate_a_torino_con/"
    },
    {
        "id": "1i193vk",
        "author": "A-non-776",
        "title": "ADHD a Torino",
        "content": "Salve a tutti, so che è una richiesta un po' bizzarra e difficile da formulare, ma ci provo: qualcuno ha esperienza con o è a conoscenza di posti a Torino in cui recarsi per consulti psicologici in merito a possibilità di ADHD o autismo? Se uno cercasse una possibile diagnosi, in età adulta, per disturbi di questo tipo, dove potrebbe andare?\n\nCapisco che tendenzialmente serva un più o meno lungo percorso con psicologo, di vari mesi e varie sedute magari, e non si possa risolvere con un test a crocette, ma non ho questa possibilità, e per quanto difficile cercherei un posto molto più \"diretto\"\nNon ho un lavoro con cui pagare una possibile terapia, ma sento di aver difficoltà nel trovare un lavoro anche proprio per questi motivi, quindi cerco la \"strada più breve e diretta\" anche per questo motivo; se avessi poi verificato questo mio dubbio, magari allora potrei cominciare un percorso, ma mi serve sapere prima che non sto perdendo tempo, ecco\n\nPer questo mi rivolgo a chi magari ha una sua esperienza diretta in merito e può darmi indicazioni che altrimenti non avrei mai saputo, spero che tutto sia abbastanza chiaro e ringrazio già chi mi darà attenzione, saluti ~",
        "upvotes": 16,
        "comments": 30,
        "media": null,
        "permalink": "/r/torino/comments/1i193vk/adhd_a_torino/"
    },
    {
        "id": "1i1abjr",
        "author": "Babele_20",
        "title": "Medico per fuori sede",
        "content": "Ciao a tutti, ho bisogno di una mano in quanto non riesco a capirci nulla…\nIo sono una fuori sede qua a Torino, vengo da Milano e avrei bisogno di aver un medico qua. Non ho residenza a Torino ma sono comunque domiciliata qua. Qualcuno che ha fatto richiesta di un medico di base sa cosa bisogna fare con precisione? Sul sito ci sono delle indicazioni ma sono un po’ confuse.\n\nGrazie per le risposte",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1i1abjr/medico_per_fuori_sede/"
    },
    {
        "id": "1i1bxeu",
        "author": "SkeletonWink",
        "title": "Consiglio su bici da prendere a Torino",
        "content": "Buonasera,\n\nSono un ragazzo M26 di Torino, e sono stufo di utilizzare i mezzi per andare a lavoro.  \nNon so se aiuta, ma corporatura media e alto 1.78.\n\nHo una tratta giornaliera di circa 3.5km, di solito porto con me zaino con all'interno pc del lavoro e una schiscetta a parte.  \nLa tratta è molto tranquilla e piana, esclusivamente in città.\n\nVorrei prendere una bici usata, budget sui 100 euro massimi, anche se trovarle a meno mi farebbe piacere.  \nNon saprei effettivamente cosa cercare oltre alla dicitura \"city bike\", e dove.\n\nGrazie in anticipo :)",
        "upvotes": 3,
        "comments": 28,
        "media": null,
        "permalink": "/r/torino/comments/1i1bxeu/consiglio_su_bici_da_prendere_a_torino/"
    },
    {
        "id": "1i1c5a2",
        "author": "Informal-Flower-527",
        "title": "Cena di compleanno/altro?",
        "content": "Ciao a tutti! Tra poco farò 25 anni e vorrei festeggiare con i miei amici facendo una cena da qualche parte! Qualcuno ha qualche consiglio su un ristorante che non sia la solita pizzeria in cui c’è un bel ambiente e si mangia bene? Mi andrebbe bene una cucina di qualsiasi tipo dalla asiatica alla messicana! O magari un posto in cui mettono musica? \nEventualmente che si potrebbe fare se non una cena? Attività? Escludiamo andare a ballare perché secondo me è troppo dispersivo \nGrazie 😊 \n\n",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1i1c5a2/cena_di_compleannoaltro/"
    },
    {
        "id": "1i1aj2g",
        "author": "Top-Text-7727",
        "title": "Videogiochi usati a Torino ",
        "content": "Salve. Dove abitavo prima c'erano un po' di negozi non brandizzati tipo Gamestop che vendevano videogiochi sia nuovi che usati a buon mercato. Potevi trovare giochi di recente uscita anche a 10 euro di meno al prezzo che trovavi nei negozi delle catene. A Torino ce ne sono? Io abito in Aurora.",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1i1aj2g/videogiochi_usati_a_torino/"
    },
    {
        "id": "1i1827e",
        "author": "Thecrazypacifist",
        "title": "Quale partita di Juventus dovrei vedere? ",
        "content": "Ho sempre sognato di vedere una partita di calcio allo stadio, ma non essendo un grande fan della Serie A, non so bene quale scegliere. Quale partita ha l’atmosfera più bella secondo te? Per fare un paragone NBA, direi una Lakers contro Celtics. Meglio una partita di Serie A o una di Champions League? Qual è il tuo match preferito?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1i1827e/quale_partita_di_juventus_dovrei_vedere/"
    },
    {
        "id": "1i0ltl9",
        "author": "MonPorridge",
        "title": "Orti cittadini/ posti dove fare giardinaggio insieme da principianti?",
        "content": "Come da titolo. Mi piacerebbe mettermi a fare giardinaggio in un orto cittadino/giardino insieme ad altre persone, non solo per fare amicizia ma anche per fare un'attività del genere all'aria aperta. Non sono capace, ma mi piacerebbe provare. Conoscete realtà del genere in città a Torino? O sono tutte cose che si trovano fuori?",
        "upvotes": 8,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1i0ltl9/orti_cittadini_posti_dove_fare_giardinaggio/"
    },
    {
        "id": "1i0hu9z",
        "author": "Impressive_Lynx_7938",
        "title": "Analisi I",
        "content": "Ciao, sono una studentessa del politecnico di Torino e a breve avrò l’esame di analisi I, cercavo qualcuno che sia messo come me (bene ma non benissimo :’)), che abbia voglia di studiare assieme e fare esercizi, va bene anche online tipo discord. ",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1i0hu9z/analisi_i/"
    },
    {
        "id": "1i0lpkg",
        "author": "blackv0idd",
        "title": "Gruppo whatsapp per incontri/conoscenze",
        "content": "Abbiamo creato un gruppo whatsapp per fare conoscenza su torino,organizzare uscite,e condividere magari il tempo libero e hobby,siete tutti i benvenuti/e ❤️\n\nhttps://chat.whatsapp.com/DNRmGvSTQBT1VX1CAKNIW3",
        "upvotes": 4,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nnN4Hv3dSxm3VRLg7zyjoEJqK-icjI2aHeQKrMCfegc.jpg?auto=webp&amp;s=97bbfac0cd5d5ad8e7303223d73b6ea6503b607a"
        },
        "permalink": "/r/torino/comments/1i0lpkg/gruppo_whatsapp_per_incontriconoscenze/"
    },
    {
        "id": "1i0o69x",
        "author": "nickname1917",
        "title": "Nuove amicizie",
        "content": "Ci sono tonnellate di richieste di gente che vuole fare amicizie, uscire, conoscere... ma poi vi conoscete? Un po' come la trasmissione \"appuntamento al buio\" sarebbe bello sapere come va dopo, funziona reddit?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1i0o69x/nuove_amicizie/"
    },
    {
        "id": "1i0b3q7",
        "author": "d3dgot",
        "title": "How to Spend a Day in Bardonecchia?",
        "content": "Hi everyone!\n\nMy friends and I (all in our mid-20s) will be visiting Bardonecchia for a day on a Saturday, either this January or early February. We’re looking for suggestions on how to make the most of our time there!\n\nWe’re fairly active and open to trying new experiences. Some of us are interested in skiing or snowboarding, but we’d also love to hear about:\n\t•\tFun activities beyond skiing (snowshoeing, sledding, or something unique?).\n\t•\tGreat places for lunch or après-ski with a lively atmosphere.\n\t•\tAny scenic spots or hidden gems to check out.\n\nWe’re hoping for a mix of adventure and relaxation, so any advice from locals or those who’ve been there would be greatly appreciated. Thanks in advance",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1i0b3q7/how_to_spend_a_day_in_bardonecchia/"
    }
]