[
    {
        "id": "1gvrzbi",
        "author": "Bucky_Le_Boeuf",
        "title": "Howdy r/movies! I’m Bucky Le Boeuf, writer/director of a zombie film that’s not really a zombie film: All You Need Is Blood. It stars Mena Suvari, Eddie Griffin, Logan Riley Bruner and a slew of other amazing actors. Ask me anything! Or nothing. Or everything. The choice is yours alone.",
        "content": "",
        "upvotes": 7,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vs2hrii2r22e1.png?auto=webp&amp;s=9e184c1709c88da29867cb9d390a35463c065958"
        },
        "permalink": "/r/movies/comments/1gvrzbi/howdy_rmovies_im_bucky_le_boeuf_writerdirector_of/"
    },
    {
        "id": "1gtk95y",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Red One / A Real Pain / Emilia Perez)",
        "content": "[Red One](https://old.reddit.com/r/movies/comments/1grn0ii/official_discussion_red_one_spoilers/)\n\n[A Real Pain](https://old.reddit.com/r/movies/comments/1grn0jw/official_discussion_a_real_pain_spoilers/)\n\n[Emilia Perez](https://old.reddit.com/r/movies/comments/1grn0lz/official_discussion_emilia_p%C3%A9rez_spoilers/)",
        "upvotes": 25,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1gtk95y/official_discussion_megathread_red_one_a_real/"
    },
    {
        "id": "1gvrno4",
        "author": "indiewire",
        "title": "Why Does Hollywood Hate Marketing Musicals as Musicals?",
        "content": "",
        "upvotes": 407,
        "comments": 334,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Dk7z4Je0barYFN-cstLXiyLKu4CbeGbemFN-KPBihfU.jpg?auto=webp&amp;s=f3fcdc71e9ea161bf5e8ef167c9a3c466ca28e02"
        },
        "permalink": "/r/movies/comments/1gvrno4/why_does_hollywood_hate_marketing_musicals_as/"
    },
    {
        "id": "1gvqi1f",
        "author": "johntentaquake",
        "title": "15 Years of Fantastic Mr. Fox and the Quest for Affirmation",
        "content": "",
        "upvotes": 248,
        "comments": 42,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Jm_M1EkFh9JHDITgi85SH0Lr9LYHecW0mVj-r9Ztg10.jpg?auto=webp&amp;s=3c043c083a8e79d000fba4ec771d3a12bf736255"
        },
        "permalink": "/r/movies/comments/1gvqi1f/15_years_of_fantastic_mr_fox_and_the_quest_for/"
    },
    {
        "id": "1gv48o7",
        "author": "MarvelsGrantMan136",
        "title": "How to Train Your Dragon | Official Teaser",
        "content": "",
        "upvotes": 6534,
        "comments": 2946,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/F9eTnGaZcEGicpaV8p9TYRgJTMQo7KQQ4v5nywiB9Ig.jpg?auto=webp&amp;s=daa2e4ed3eb7dfcaf6be8701e165c8e394f4119b"
        },
        "permalink": "/r/movies/comments/1gv48o7/how_to_train_your_dragon_official_teaser/"
    },
    {
        "id": "1gvnik6",
        "author": "KillerCroc1234567",
        "title": "Bring Them Down | Official Teaser Trailer",
        "content": "",
        "upvotes": 214,
        "comments": 59,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/eIrx93bp7d4dKMtrEUCM4bMDGyLKn4RhHYSz43vl4Vc.jpg?auto=webp&amp;s=c8c6d7cf9027643d350bd9b32dc52cebd37d1b44"
        },
        "permalink": "/r/movies/comments/1gvnik6/bring_them_down_official_teaser_trailer/"
    },
    {
        "id": "1gvbyan",
        "author": "BunyipPouch",
        "title": "Bryan Cranston &amp; Lily Gladstone to Star in Conspiracy-Thriller 'Lone Wolf' - Follows a troubled vet (Gladstone) struggling with addiction who is recruited by a contractor (Cranston) for a covert government plot to assassinate a high-level politician.",
        "content": "",
        "upvotes": 1139,
        "comments": 63,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7hNWwv_-FaBeU8HGw3qX_hAKrWj3zUqZoXWOpiEcm38.jpg?auto=webp&amp;s=12dc0172bb895a11c70b4b7461576d9111f8bc94"
        },
        "permalink": "/r/movies/comments/1gvbyan/bryan_cranston_lily_gladstone_to_star_in/"
    },
    {
        "id": "1gv066f",
        "author": "BunyipPouch",
        "title": "AMC Entertainment Plans To “Go On Offense” With Major Upgrades To Movie Theaters Amid Box Office Recovery - This includes a new auditorium format called AMC XL will feature expanded screen sizes, aiming to capture recent moviegoer enthusiasm for IMAX and other ultrabig-screen experiences.",
        "content": "",
        "upvotes": 3904,
        "comments": 993,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mGJUgNumXccRaCRNdhHkdfdfEbfB5kjC77PsP9LkawY.jpg?auto=webp&amp;s=c41935ee54202fb67eda92acaf6e12d8d8ee6010"
        },
        "permalink": "/r/movies/comments/1gv066f/amc_entertainment_plans_to_go_on_offense_with/"
    },
    {
        "id": "1gv7gar",
        "author": "Level-Studio7843",
        "title": "Whats the most stressful movie you've ever seen?",
        "content": "There are certain movies that either indices stress, anxiety or discomfort all the way through. This can either be due to tension, dramatic irony or a whole host of other techniques that filmmakers might use to keep you on edge.\n\nFor me the first would be Whiplash. That movie was so stressful and panicky from start to finish. Another good example would be Uncut Gems which similarly is jam-packed with stressful conflicts fromt the very start.\n\nWhat examples would you give?",
        "upvotes": 1443,
        "comments": 2407,
        "media": null,
        "permalink": "/r/movies/comments/1gv7gar/whats_the_most_stressful_movie_youve_ever_seen/"
    },
    {
        "id": "1gvj4y1",
        "author": "Sorry_Sorry_Im_Sorry",
        "title": " How to Train Your Dragon Teaser Trailer: Live Action vs Animated Comparison ",
        "content": "",
        "upvotes": 236,
        "comments": 303,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/T3uueWQCeiB09gWVhDN9CloX9W7w7zmZxLHf6KRkuFM.jpg?auto=webp&amp;s=2dd4608a7e7bd4d8d1b0b2ef1db08b9cdc707604"
        },
        "permalink": "/r/movies/comments/1gvj4y1/how_to_train_your_dragon_teaser_trailer_live/"
    },
    {
        "id": "1gv6e9j",
        "author": "ICumCoffee",
        "title": "'Wicked' - Review Thread",
        "content": "**'Wicked' - Review Thread**\n\n[**Rotten Tomatoes**](https://www.rottentomatoes.com/m/wicked_2024)**: 91% (117 Reviews) - 8.1/10 Average Rating -** ***Certified Fresh***\n\n* **Critics Consensus**:  *Defying gravity with its magical pairing of Cynthia Erivo and Ariana Grande, Wicked's sheer bravura and charm make for an irresistible invitation to Oz.*\n* **PopcornMeter**: 99% (2500+ Verified Rating)\n\n[**Metacritic**](https://www.metacritic.com/movie/wicked/)**: 73 (44 Reviews)**\n\nReviews:\n\n[Variety (90)](https://variety.com/2024/film/reviews/wicked-review-cynthia-erivo-ariana-grande-1236214272/)\n\n&gt;Chu clearly designed “Wicked” to be experienced the old-fashioned way: on the biggest screen you can find, among a crowd of giddy theatergoers (inevitably singing along in some screenings). Unlike several recent tuners, which tried to hide their musical dimension from audiences, “Wicked” embraces its identity the way Elphaba does her emerald skin. Turns out such confidence makes all the difference in how they’re perceived.\n\n[The Hollywood Reporter (90)](https://www.hollywoodreporter.com/movies/movie-reviews/wicked-review-cynthia-erivo-ariana-grande-1236062372/)\n\n&gt;Grande and Erivo give Stephen Schwartz’s songs — comedy numbers, introspective ballads, power anthems — effortless spontaneity. They help us buy into the intrinsic musical conceit that these characters are bursting into song to express feelings too large for spoken words, not just mouthing lyrics and trilling melodies that someone spent weeks cleaning up in a studio.\n\n[Deadline:](https://deadline.com/2024/11/wicked-review-cynthia-erivo-ariana-grande-movie-musical-adaptation-1236181476/)\n\n&gt;Chu has made a movie musical (the best since *Chicago)*, even if it ends with its own “intermission” , that manages to stand on its own as a fully satisfying screen entertainment, and also serves as a delicious invitation to an upcoming second half I quite frankly can’t wait to see.\n\n[IndieWire (67)](https://www.indiewire.com/criticism/movies/wicked-review-jon-m-chu-adaptation-ariana-grande-cynthia-erivo-1235065351/)\n\n&gt;Jon M. Chu’s Massive Musical Adaptation Defies Gravity (and Logic) to Spin a Tale Mostly for Established Fans. Ariana Grande is an absolute scream and Cynthia Erivo's voice is unparalleled, but expanding out the Broadway musical into two (very long) parts doesn't offer the opportunity for depth we were promised.\n\n[TheWrap (80)](https://www.thewrap.com/wicked-review-ariana-grande-cynthia-erivo-universal/)\n\n&gt;The story’s playful, subversive reinterpretation of 'The Wizard of Oz' as a work of propaganda, designed to obfuscate the true story of how political dissidents and minority groups are demonized by fascist con artists who trade in theatricality instead of competence, is fully developed and still (to our collective dismay) incredibly salient.\n\n[IGN (90)](https://www.ign.com/articles/wicked-review-ariana-grande-cynthia-erivo-jon-m-chu)\n\n&gt;Wicked is a well-oiled machine in the hands of Jon M. Chu. This film adaptation epitomizes what modern movie musicals can and should be, embracing its source material while cleverly translating it to screen. Tear-jerking performances by Ariana Grande and Cynthia Erivo make the movie, playing to their individual strengths to bring to life the rapport between Glinda and Elphaba, who’ll go on to become the good and wicked witches of Wizard of Oz fame. If as many people love this film as much as I did, Wicked will undoubtedly immortalize the Grande and Erivo in movie musical history.\n\n[The Guardian (80)](https://www.theguardian.com/film/2024/nov/19/wicked-review-cynthia-erivo-ariana-grande-wizard-of-oz-stephen-schwartz)\n\n&gt;It’s arguable if Wicked could ever be a meaningfully persuasive prequel for the characters in The Wizard of Oz as we actually see them in the 1939 film, as this would involve cancelling their powerfully timeless, mythological aura, and instead substituting the more banal idea of human development. But this is the joke, and this is the story, and what an enjoyable spectacle it is.\n\n[BBC (3/5)](https://www.bbc.com/culture/article/20241119-wicked-review)\n\n&gt;It might have been lighter on its feet if the editors had cut a subplot about magical talking animals, which doesn't add anything except several minutes of running time. And they could have cut Elphaba's sister, who is given perplexingly little to do. That way, the film could have been packed the whole musical into one fast-moving, satisfying entertainment. As it is, I have a strong suspicion that Wicked will work much better as the first part of a double bill, with Wicked Part 2 being shown after an interval. But we'll have to wait another year to know for sure.\n\n[Independent - UK (3/5)](https://www.independent.co.uk/arts-entertainment/films/reviews/wicked-movie-review-ariana-grande-b2649890.html)\n\n&gt;Cynthia Erivo and Ariana Grande showcase phenomenal vocal ability in this adaptation of the blockbuster musical, but they’re let down by a film that is aggressively overlit and shot like a TV advert.\n\n[Telegraph - UK (2/5)](https://www.telegraph.co.uk/films/0/wicked-review-ariana-grande-cynthia-erivo/)\n\n&gt;Utterly exhausting and hopelessly miscast. Ariana Grande and Cynthia Erivo don’t come close to defying gravity in this bloated, beige screen adaptation of the Wizard of Oz prequel.\n\n[Total Film (100)](https://www.gamesradar.com/entertainment/musicals/wicked-part-one-review/)\n\n&gt;A great deal of expectation and pressure had been placed on Wicked, with fans waiting decades for it to reach the screen. This makes what Chu has achieved an even greater feat, turning one of the world's most popular musicals into a cinematic phenomenon. And while Wicked is only one half of this story, it never feels incomplete. As part two will take this story to some weird, wonderful, and heartbreaking places, I cannot wait to see what he and his team accomplish. But at this rate? I don't think anything can bring them down.\n\n[Empire Magazine (80):](https://www.empireonline.com/movies/reviews/wicked/)\n\n&gt;Chu amps up the colour and spectacle to extraordinary, almost overwhelming heights, but the real magic comes from Erivo and Grande as the frenemies at the story’s heart. \n\n[Consequence (83)](https://consequence.net/2024/11/wicked-part-1-review-cynthia-erivo/)\n\n&gt;The film is effective at capturing what made the original musical so beloved, and in turn, will belong to a new generation of kids — those kids who might then envision themselves cathartically singing “Popular” or “Defying Gravity” on stage, just as Ariana Grande had as a child.\n\n[Collider (90)](https://collider.com/wicked-movie-review/)\n\n&gt;The film works on an emotional level, and yet there are also well-delivered lessons about growing fascism that are tragically poignant in our American era. The set pieces are big and bold, and the dance numbers are creative and colorful. Grande is continually hilarious as the charmingly vapid Galinda, while Erivo is breathtakingly powerful as the so-called Wicked Witch. **Both Grande and Erivo sound glorious** through beautiful interpretations of modern musical classics like \"Defying Gravity.\" It all coheres into **one of the best silver screen adaptations of a musical in ages**, and easily one of the year's best pictures.\n\n[Entertainment Weekly (75)](https://ew.com/wicked-review-musical-adaptation-hits-right-notes-lacks-visual-variety-8747457)\n\n&gt;For now, like Denis Villeneuve’s first Dune, this Wicked manages to end on a note of “to be continued” while still feeling like a complete story. If only its imagery had a little more magic!\n\n[Screenrant (90)](https://screenrant.com/wicked-movie-review/)\n\n&gt;Save for the tiniest of things, Wicked is a worthy screen adaptation of the musical, guaranteed to make viewers feel like they could defy gravity too.\n\n[The Times - UK (80)](https://www.thetimes.com/article/d6c0c3b5-efcc-4d7e-bca6-6c98ec4e997b)\n\n&gt;Hollywood finally delivers a worthy successor to The Wizard of Oz with this musical adaptation, starring the superb Erivo as Elphaba and a startlingly good Ariana Grande as Glinda.\n\n[Vanity Fair (80)](https://www.vanityfair.com/hollywood/story/wicked-movie-review)\n\n&gt;Wicked succeeds because of some unreproducible, lightning in a bottle convergences—of director, stars, craftspeople, and high-status material. But Wicked also makes a broader case for patience and careful thought, for grand ambition honed over the course of many years. In order to defy gravity, gravity must first be understood.\n\n[iNews - UK (100)](https://inews.co.uk/culture/film/ariana-grande-wicked-review-3388833)\n\n&gt;It joyfully expands on the source material with extended musical numbers and astute childhood flashbacks in a combination that will delight committed Ozians and newcomers alike.\n\n[San Francisco Chronicle (100)](https://datebook.sfchronicle.com/movies-tv/wicked-cynthia-erivo-ariana-grande-19901874)\n\n&gt;Fueled by exquisite performances from Tony winner Erivo (“The Color Purple”), as Elphaba, or the Wicked Witch of the West, and Grammy winner Grande as Glinda the Good Witch, “Wicked” is the best movie musical in years, representing a rare instance when performances, visuals and songs are of equally high quality.\n\n&amp;#x200B;\n\n**SYNOPSIS:**\n\n&gt;Elphaba, a misunderstood young woman because of her green skin, and Glinda, a popular girl, become friends at Shiz University in the Land of Oz. After an encounter with the Wonderful Wizard of Oz, their friendship reaches a crossroads.\n\n**CAST:**\n\n* Cynthia Erivo as Elphaba Thropp\n* Ariana Grande as Galinda Upland\n* Michelle Yeoh as Madame Morrible\n* Jeff Goldblum as the Wonderful Wizard of Oz\n* Jonathan Bailey as Fiyero Tigelaar\n* Ethan Slater as Boq Woodsman\n* Marissa Bode as Nessarose Thropp\n* Peter Dinklage as the voice of Doctor Dillamond\n\n**DIRECTOR:** Jon M. Chu\n\n**WRITTEN BY:** Winnie Holzman, Dana Fox\n\n**RUNTIME**: 2h40m",
        "upvotes": 1472,
        "comments": 1080,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/N8izbQtZ67Spw16_2iEpVnfGf3n67n0OVCIl6OAfgc0.jpg?auto=webp&amp;s=e6a9645f142221de0d218f265d82fa83dd7844a5"
        },
        "permalink": "/r/movies/comments/1gv6e9j/wicked_review_thread/"
    },
    {
        "id": "1gvn54v",
        "author": "writer808",
        "title": "'I was wrong about Drag Me To Hell'",
        "content": "[https://metro.co.uk/2024/11/19/wrong-this-iconic-horror-92-rotten-tomatoes-22024047/](https://metro.co.uk/2024/11/19/wrong-this-iconic-horror-92-rotten-tomatoes-22024047/)\n\nFound this article that has a pretty interesting take on Drag Me To Hell - I always thought it was universally loved so didn’t really take into account some people didn’t actually get it. Did any of you feel the same about it when you first watched? \n\nI personally saw the humour in it pretty early on but I know others found it more scary. \n\nDo you feel differently about it now that years have passed? \n\n",
        "upvotes": 88,
        "comments": 76,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cIzUQ1pRTo12hsvBoTWl9TggowtrFsTmVME7GOWtd9g.jpg?auto=webp&amp;s=9121501ebc126638e87d34d25e5168196bd2732c"
        },
        "permalink": "/r/movies/comments/1gvn54v/i_was_wrong_about_drag_me_to_hell/"
    },
    {
        "id": "1gvg31d",
        "author": "simonthecat33",
        "title": "Did you ever go see the Rocky Horror Picture Show ",
        "content": "My son was looking at a photo album \n and found a picture of his mom dressed up for the Rocky Horror Picture Show. She told him about how people dressed up and actually danced in the aisles and talked back to the screen. Apparently they showed the movie every Friday night at midnight. The whole idea just blew his mind. Did any of you ever go see the movie?  Did you participate in any way? I remember going a few times because my friends did but I can’t remember much of anything about the movie itself.",
        "upvotes": 342,
        "comments": 355,
        "media": null,
        "permalink": "/r/movies/comments/1gvg31d/did_you_ever_go_see_the_rocky_horror_picture_show/"
    },
    {
        "id": "1gvqik6",
        "author": "NoCulture3505",
        "title": "Viola Davis Named Golden Globes’ 2025 Cecil B. DeMille Award Honoree",
        "content": "",
        "upvotes": 43,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SjZqSX1SvX-pTCF9tK6GSndE8LM7IHFaYNOuSLuVNpg.jpg?auto=webp&amp;s=08799c77d74dd59d461239a0a4a1c1e5b2a08d7d"
        },
        "permalink": "/r/movies/comments/1gvqik6/viola_davis_named_golden_globes_2025_cecil_b/"
    },
    {
        "id": "1gv2d8f",
        "author": "cmaia1503",
        "title": "Denzel Washington Reveals Two More Equalizer Films Are on the Way",
        "content": "",
        "upvotes": 2113,
        "comments": 442,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4-BXFAtjoBQ8y9BNNE0N_Ea5AuwSI5wxsEIUaGTAli8.jpg?auto=webp&amp;s=694ed105517f467cc165dc155b7429cd64157166"
        },
        "permalink": "/r/movies/comments/1gv2d8f/denzel_washington_reveals_two_more_equalizer/"
    },
    {
        "id": "1gv33x7",
        "author": "KillerCroc1234567",
        "title": "Emma Mackey to Star Opposite Glen Powell in J.J. Abrams' Mystery Movie",
        "content": "",
        "upvotes": 1205,
        "comments": 130,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TIvwa09jVFLVr--zwEhutjkVENmP3BdA8kWMMWsZpPc.jpg?auto=webp&amp;s=3016423ac85e5c78f6777a971060aef5ca8e79e0"
        },
        "permalink": "/r/movies/comments/1gv33x7/emma_mackey_to_star_opposite_glen_powell_in_jj/"
    },
    {
        "id": "1gv28e6",
        "author": "ICumCoffee",
        "title": "Vic Flick, Guitarist on the James Bond Theme Song, Dies at 87",
        "content": "",
        "upvotes": 1304,
        "comments": 50,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mF-MQT7LrBS-VUa1d0K4dBVqadeCmxzxsfYZi-ZWRvA.jpg?auto=webp&amp;s=92cb94e85a6300852e6e73c91c3e788596709cec"
        },
        "permalink": "/r/movies/comments/1gv28e6/vic_flick_guitarist_on_the_james_bond_theme_song/"
    },
    {
        "id": "1gvs4hg",
        "author": "Bitter_Owl1947",
        "title": "Is Whiplash musically accurate?",
        "content": "Deeply enjoy this movie but I am not as musically inclined as the characters in this movie, so I was wondering -- Is JK Simmon's character right when he goes on his rants? Is Miles Teller off tempo? Is that trombone guy out of tune in the beginning? Or am I as the average viewer with no musical background, just fooled into believing I'm not capable of hearing the subtle mistakes and thereby tricked into believing JK is correct when he actually isn't? Because that changes his character. Is he just yelling and intimidating because he thinks it'll make them better even though they're already flawless? Or does he hear imperfections?",
        "upvotes": 18,
        "comments": 34,
        "media": null,
        "permalink": "/r/movies/comments/1gvs4hg/is_whiplash_musically_accurate/"
    },
    {
        "id": "1gvngsq",
        "author": "JonasKahnwald11",
        "title": "New images from 'BRING THEM DOWN' - Starring Barry Keoghan and Christopher Abbott - Michael, the last son of a shepherding family, lives with his ailing father. When a conflict with rival farmer and his son Jack escalates, a devastating chain of events leaves both families permanently altered.",
        "content": "",
        "upvotes": 31,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/h3ga3yhnl12e1.jpeg?auto=webp&amp;s=e967a114d442824be6c7e3ef9264d4bd3724d4c5"
        },
        "permalink": "/r/movies/comments/1gvngsq/new_images_from_bring_them_down_starring_barry/"
    },
    {
        "id": "1gv0r4s",
        "author": "MarvelsGrantMan136",
        "title": "David Fincher’s ‘Se7en’ Gets Digital and Physical 4K Release (January 7)",
        "content": "",
        "upvotes": 1127,
        "comments": 84,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nQiRGvBeciTZpUAMakye_VaQvEk5Ma2RvR4Dp7QZfBg.jpg?auto=webp&amp;s=a608f2431e2e9c248313db244d5d3a60439fb9aa"
        },
        "permalink": "/r/movies/comments/1gv0r4s/david_finchers_se7en_gets_digital_and_physical_4k/"
    },
    {
        "id": "1gvrbl8",
        "author": "632nofuture",
        "title": "What ruins an otherwise good movie for you?",
        "content": "For me the disappointment is big when it's e.g. an otherwise nice good thriller/horror/.. movie but then there's monsters, zombies,.. As soon as some \"too unrealistic\"/tacky creature or element shows up my brain kinda tunes out completely.\n\nI like when things stay within the 'could be' realism, are implicit &amp; not too obvious.\n\nFor example (some Spoilers ahead!), I've just been watching&gt;! 'Barbarian' not knowing what it's about and I liked it a lot! Until, bam.. it's a silly monster creature!&lt; , of all the fucked-up realistic scenarios that I was anticipating given the context lol.\n\nOr with topics like aliens, I liked 'The Invasion' or 'The Astronauts Wife' &gt;!prolly cause you don't see them in their alien form!&lt;and even ghost/haunted/occult stuff can be well done too!\n\n'Smile' was one horror-exception I liked a lot surprisingly. &gt;!Maybe cause it all seemed more like it's just her hallucinating/not being well mentally (until the finale fight with monster-mum).!&lt;",
        "upvotes": 17,
        "comments": 120,
        "media": null,
        "permalink": "/r/movies/comments/1gvrbl8/what_ruins_an_otherwise_good_movie_for_you/"
    },
    {
        "id": "1gv6841",
        "author": "fudgems222",
        "title": "Speeches Where Character TURNS Evil",
        "content": "Hey everyone, random question but can y'all think of a speech/monologue from a Movie (or TV Show) where the character starts off nice/sweet/friendly, but then by the end turns evil and reveals their true, villainous intentions?\n\nThere are plenty of great villain speeches, and a few that sorta border on this idea, but wondering if y'all can think of any where they more deliberately start good, then through and by the end of the speech TURN evil",
        "upvotes": 431,
        "comments": 427,
        "media": null,
        "permalink": "/r/movies/comments/1gv6841/speeches_where_character_turns_evil/"
    },
    {
        "id": "1gv4z78",
        "author": "NoCulture3505",
        "title": "Max Extends Criterion Collection Deal, Adds Three ‘Godzilla’ Films and Other Titles",
        "content": "",
        "upvotes": 494,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EzUt29O5tqsujpicsKelKeVRudPe6PfMUwsFmNBCAIs.jpg?auto=webp&amp;s=2a80fcd16495ad39012405cf50133f81493e2cfd"
        },
        "permalink": "/r/movies/comments/1gv4z78/max_extends_criterion_collection_deal_adds_three/"
    },
    {
        "id": "1gvcgwu",
        "author": "Amaruq93",
        "title": "Footage from behind the scenes of filming for \"Sleepy Hollow\" (1999)",
        "content": "",
        "upvotes": 140,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/u56iCVSpPkXMdypQByapJIZ2G6IlcOCYk5OMf_ukfXw.jpg?auto=webp&amp;s=18ff3af0b122150c71835f5209f4e4cb83b28f47"
        },
        "permalink": "/r/movies/comments/1gvcgwu/footage_from_behind_the_scenes_of_filming_for/"
    },
    {
        "id": "1gv6uqr",
        "author": "Ok-Speed-8182",
        "title": "Is there any love here for 90s Broken Arrow?",
        "content": "So, I just rewatched Broken Arrow for the first time in probably 20 years or so and I realized I never see this one mentioned or talked about anywhere. I remember really enjoying it around the time it came out, and while it isn't perfect/the best action movie from the 90's I think there's plenty to enjoy here.\n\nTravolta is chewing the scenery as the villain and doing a great job in my opinion. Lots of quotables and just a good screen presence. The plot is interesting with some memorable action scenes and deaths and upon rewatching I was pleasantly surprised by the lead actress role. She isn't a damsel in distress but heroic and capable from the start and throughout the movie. She is on par with the protagonist almost which is a nice deviation from the norm at the time.\n\nAll in all for the type of movie that it is I'd give it a 8-.\n\nSo, is there any love for this movie here or am I alone in this one?\n\nedit: For people unfamiliar with the movie, I'd compare it to something like Under Siege. That category.\n\nedit 2: I'm glad to see there is love for this movie :) If you haven't seen it and enjoy 90s action. Go watch it.",
        "upvotes": 283,
        "comments": 207,
        "media": null,
        "permalink": "/r/movies/comments/1gv6uqr/is_there_any_love_here_for_90s_broken_arrow/"
    },
    {
        "id": "1gvgyr1",
        "author": "Odd_Advance_6438",
        "title": "Furiosa had my favorite supporting cast of characters of the year, both important and minor",
        "content": "Anya and Hemsworth were fantastic. Great performances to anchor this movie with. However, one of my favorite parts of all the Mad Max movies is the crazy supporting characters, and Furiosa might have the best cast of weirdos.\n\nEach actor in Dementus’s gang would come up with an elaborate backstory to help stand out, even if it’s not shown in the movie. There’s the Octoboss, a great Boba Fett type right hand man, Rizzdale Pell, a creepy one eyed bastard, Smeg (who I’m not even sure how to describe, he’s just fantastically weird), then Mr Norton, Fang, Big Jilly, Mr Harley (the one compassionate guy if you look closely), Mr Davidson, and others, all who have very little screentime but give unique performances. Also the History Man with his narration\n\nBack in the Citadel, we get Scrotus, one of the most entertaining additions (played by the guy who played Slit in Fury Road), along with getting to see Immortan Joe, the Organic Mechanic, Rictus, and the People Eater again",
        "upvotes": 45,
        "comments": 24,
        "media": null,
        "permalink": "/r/movies/comments/1gvgyr1/furiosa_had_my_favorite_supporting_cast_of/"
    },
    {
        "id": "1gvqqjs",
        "author": "blindedbysparkles",
        "title": "Looking for sad sad and happy sad films ",
        "content": "Hi everyone! I really need to have a good cry, so I'm looking for films that are heartbreakingly sad and also films that are feelgood sad\n\nI don't like cheesy romance stuff, and I have a very dark sense of humour. Mainly looking for films in english, swedish, norwegian, danish, dutch and french, but am open to all languages. TIA!",
        "upvotes": 6,
        "comments": 28,
        "media": null,
        "permalink": "/r/movies/comments/1gvqqjs/looking_for_sad_sad_and_happy_sad_films/"
    },
    {
        "id": "1gvd10j",
        "author": "Bennett1984",
        "title": "The Prosecutor - Donnie Yen - Official Trailer",
        "content": "",
        "upvotes": 61,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OCsBBghDmNGr5Dnv1f1Q7Lx8LjJRU2pW_EuO0WeiopY.jpg?auto=webp&amp;s=c52985acaf8ec677c0989056c84b5e3159599ad2"
        },
        "permalink": "/r/movies/comments/1gvd10j/the_prosecutor_donnie_yen_official_trailer/"
    },
    {
        "id": "1gv6p2u",
        "author": "WorldsBestWrestling",
        "title": "I rewatched Dark City and now I miss the old Alex Proyas",
        "content": "I rewatched Dark City and almost forgot how amazing it is. I don't know what happened to the '90s version of Alex Proyas, but he was great for a while back then. How did he go from making movies like this and The Crow to CGI-laden nonsense like Gods of Egypt? No offense if you like that movie, but it doesn't feel like the same filmmaker. He was a master of gothic-influenced genre movies for a while.\n\nThe visual effects and production design are really impressionistic and awesome. You really get the impression that every piece of architecture in this world is steeped in history, even though it's all just an illusion at the end of the day. Speaking of illusions, I also love the idea of aliens that can alter reality. The Strangers are great villains - terrifying, actually. The kid is especially eerie.\n\nI also love the film's nods to Last Thursdayism, a theory that the universe might have been created very recently (last Thursday, for instance), but with the appearance of being much older. I think that's quite a cool idea, and the movie incorporates it into the narrative in a very interesting way. I've also read that it's supposed to represent Plato's \"Allegory of the Cave\" idea, which is also fascinating. The philosophical elements don't come across as pretentious, though - it's very accessible.\n\nThis is as good as cinema gets for me. How do you guys feel about it?",
        "upvotes": 123,
        "comments": 34,
        "media": null,
        "permalink": "/r/movies/comments/1gv6p2u/i_rewatched_dark_city_and_now_i_miss_the_old_alex/"
    },
    {
        "id": "1guxrcc",
        "author": "KillerCroc1234567",
        "title": "Babygirl | Official Trailer 2 ",
        "content": "",
        "upvotes": 353,
        "comments": 235,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/f6D7nK88XpDOl39KkjjCQok23k309jBX4fIenbXEmLU.jpg?auto=webp&amp;s=a77eb513107de1d8a0b7805e1026a42bb8a4015d"
        },
        "permalink": "/r/movies/comments/1guxrcc/babygirl_official_trailer_2/"
    },
    {
        "id": "1gv0scb",
        "author": "KillerCroc1234567",
        "title": "Jason Segel, Samara Weaving, Timothy Olyphant &amp; Juliette Lewis Leading Jorma Taccone's 'The Trip' For 87North &amp; XYZ",
        "content": "",
        "upvotes": 232,
        "comments": 44,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Pt3diBGUcdBE8dDMYXjmaTVkyiicvrCCrncRHTsOM0s.jpg?auto=webp&amp;s=2df2e559f9419f4d0c7c34f680da60e57db56ee2"
        },
        "permalink": "/r/movies/comments/1gv0scb/jason_segel_samara_weaving_timothy_olyphant/"
    },
    {
        "id": "1gv1oh1",
        "author": "DemiFiendRSA",
        "title": "Clint Eastwood’s ‘Juror #2’ Sets December 20 Streaming Release Date on Max",
        "content": "",
        "upvotes": 203,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2joGFQJF5HSwhdzwzhCsW6gMmzmy2uYkyVIzfyjfHp0.jpg?auto=webp&amp;s=011f23c983fc1a8dc3a5c12473498ee07a9213bc"
        },
        "permalink": "/r/movies/comments/1gv1oh1/clint_eastwoods_juror_2_sets_december_20/"
    }
]