[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 63,
        "comments": 201,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mgd5i2",
        "author": "Leather_Dependent731",
        "title": "Sofia Carson ruined My Year at Oxford (free of spoilers)",
        "content": "Oh my gosh. Before we got to the big reveal (those who watched it know what I’m talking about), the movie was a hard watch. \n\nEvery single scene she had the same exact facial expression and you know when you’re watching a movie and you can clearly see that a person is acting? That’s exactly what she felt like. \n\nEvery single moment her facial expression was seductive and flirty, literally every second she talked. There’s a scene where she’s asking how someone died and her face looks exactly the same as when she was flirting with the love interest. Like what. It’s like she’s always trying to keep herself pretty, if that makes sense. But this is not an ad or a beauty campaign. A good movie doesn’t feel like you’re watching a movie, but this was the exact opposite whenever Sofia was on screen. \n\nAlso she made zero effort to have any sort of chemistry with Corey. You could see in his eyes, the passion and the longing, but nothing from her. \n\nThe movie is honestly pretty good but Sofia Carson’s acting really ruined it for me. ",
        "upvotes": 162,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1mgd5i2/sofia_carson_ruined_my_year_at_oxford_free_of/"
    },
    {
        "id": "1mg5jbg",
        "author": "jubejubes96",
        "title": "Just watched TRAINWRECK: Storm Area 51",
        "content": "I came out hating almost everyone involved in the event, especially Matty.\n\nhe had so many chances to simmer things down and he just added more fuel to the fire with ‘shitposting’ while acting like it was completely out of his control. seemed like he was just playing out his faux victimhood as long as he could until he got a good offer to walk away with some profit.\n\nthey should not have plugged his garbage t-shirt merch near the end and give him the chance for any more cash.\n\nso many tax-dollars on area-51 and the town of rachel were wasted on preparing for a worst-case scenario, while this smelly dweeb is back at home living with his mom, laughing off the whole thing.",
        "upvotes": 153,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1mg5jbg/just_watched_trainwreck_storm_area_51/"
    },
    {
        "id": "1mga1k7",
        "author": "soggyicecreamcones",
        "title": "\"my oxford year\" is so bad",
        "content": "not to mention the \"main character\"(in a bad way) girl energy, ana gave. like it was so corny😭🙏 it also had the cliche \"friend group\" which automatically formed, like we didn't really see their connection yk. jamie was alright, but still had the \"everything is deep\" energy sort of, but ig its fine cuz he was learning victorian poetry. all the other character's were okay. when i was watching it i COULD tell, it is one of those tiktok book adpated into a movie, even tho i had no clue and then searched it up. \n\nbut all the things aside, THE BIGGEST PROBLEM with this movie was the romanticization of student teacher relationship, which is so problematic. &gt;!the first time they kiss and jamie just walks away, i thought maybe yeah they would explore this problematic side of the power dynamic, but it was just cuz he had the cancer.!&lt;\n\nthere are several people in academia who face sexual harrasment from the profesors, yet media like \"my oxford year\" and \"the love hypothesis\" never fail to romanticize it. ",
        "upvotes": 47,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1mga1k7/my_oxford_year_is_so_bad/"
    },
    {
        "id": "1mgm3yo",
        "author": "leyy_pink1997",
        "title": "Just finished The Night Agent—worth the hype?",
        "content": "I kept seeing The Night Agent pop up on my recommendations and finally gave in. Finished the whole season in two days 😅 Honestly, it felt like a mix of Jack Ryan and Designated Survivor. Super fast-paced and surprisingly emotional in some parts.\n\nAnyone else watch it? Thoughts on a potential Season 2? I need more shows like this—any recommendations?",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mgm3yo/just_finished_the_night_agentworth_the_hype/"
    },
    {
        "id": "1mg6vt5",
        "author": "ParfaitAgreeable584",
        "title": "My Oxford Year",
        "content": "I blame tiktok for hyping up terrible acting and rushed plots like My Oxford Year. Whatever happened to enjoyable romcoms? Sofia Carson’s acting made me physically cringe. The part where she said she had a library fetish and the faces she was making when saying professor…..I paused the movie several times because of her. I also noticed she acts the same in every movie? I’m so upset because the book was actually good. The movie was just rushed honestly would’ve made more sense to put it in a show. Though im not sure I could sit through an entire series with Sofia…. ",
        "upvotes": 58,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1mg6vt5/my_oxford_year/"
    },
    {
        "id": "1mgl3lv",
        "author": "Mega-Persimmon-136",
        "title": "\"Tu dispositivo no forma parte del hogar de Netflix de esta cuenta\"",
        "content": "Necesito ayuda. Normalmente utilizo Netflix a través de las televisiones de mi casa, pero puntualmente puedo utilizarlo en mi portátil. Hoy, cuando he entrado, me he encontrado la sesión cerrada. Al iniciar sesión me ha salido este mensaje y no hay forma de que detecte correctamente la IP de mi Wi-Fi. He probado en gestionar de nuevo el \"hogar de Netflix\", según las indicaciones de la propia web. Ya no sé si es algún problema con Safari, pues últimamente también me encuentro YouTube con la sesión cerrada. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mgl3lv/tu_dispositivo_no_forma_parte_del_hogar_de/"
    },
    {
        "id": "1mgnpyp",
        "author": "indiewire",
        "title": "Best New Netflix Shows in August 2025",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mgnpyp/best_new_netflix_shows_in_august_2025/"
    },
    {
        "id": "1mgn37f",
        "author": "bombtrombb",
        "title": "Account changes without consent?",
        "content": "I had the $5.99/month with ads subscription. I just reviewed my account and saw that Netflix changed my account type in November of last year back to premium ($27.99/month) for a difference of ~$220. \n\nI spoke with “an agent” and was told refunds are only valid for 7 days. I mentioned that this must happen all the time as they weren’t even surprised. I also mentioned “class action lawsuit territory” and the agent quickly ended the chat. \n\nIs this non consensual account change happening to anyone else? Has anyone reviews the fine print, am I missing some detail? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mgn37f/account_changes_without_consent/"
    },
    {
        "id": "1mgfy3s",
        "author": "Reico88",
        "title": "How do you feel about FUBAR’s cancellation??",
        "content": "Honestly, the second season wasn’t very nowhere near as fun as its predecessor. It was too slow and the annoying comic reliefs added NOTHING to the plot. So it wasn’t a huge loss imo. ",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1mgfy3s/how_do_you_feel_about_fubars_cancellation/"
    },
    {
        "id": "1mggef5",
        "author": "LennyR12",
        "title": "Movie name please??",
        "content": "There is a movie where a woman with kids rents out a guest room or something to 4 guys who are book editors /film making I don’t know and one of them falls in love with her . They start bonding with her kids and going to one of the kids ‘ play .  The actress is a redhead I love her I know but forgot her name . Then her ex husband gets jealous but at the end she gets the guy .  Please help . It’s a fun comedy romantic movie ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mggef5/movie_name_please/"
    },
    {
        "id": "1mfsbdo",
        "author": "leyy_pink1997",
        "title": "Just finished The Night Agent — surprisingly hooked until the end!",
        "content": "Wasn’t expecting much when I started The Night Agent, just wanted something to play in the background… but wow, I ended up binge-watching the whole season in two nights. Plot twists, action, and a main character that isn’t annoying for once 😂\n\nIt kinda gave me 24 vibes but with a more modern pacing. Some parts were predictable, but overall, it kept me engaged.\n\nAnyone know if Season 2 is confirmed? Or shows with a similar vibe?",
        "upvotes": 34,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1mfsbdo/just_finished_the_night_agent_surprisingly_hooked/"
    },
    {
        "id": "1mgjbql",
        "author": "Delicious-Lecture708",
        "title": "I hope Netflix accepts Robyn Byrd's Nickelodeon original animated movie Mariala",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mgjbql/i_hope_netflix_accepts_robyn_byrds_nickelodeon/"
    },
    {
        "id": "1mgcwbr",
        "author": "TheBigBad888",
        "title": "Profile Transfer",
        "content": "My GF and I don’t live together and both have our own Netflix accounts. I’ve just noticed that there’s an option to transfer profiles to other accounts. If I transfer my profile can I still use it on my account and will my watch lists and recently watched update over both accounts?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mgcwbr/profile_transfer/"
    },
    {
        "id": "1mg8go0",
        "author": "Successful-Coyote99",
        "title": "Streaming Netflix on a Desktop/Laptop",
        "content": "On three different machines, I have tried to stream Netflix using Chrome, and it just spins and spins when I choose a title.  Works in every other browser, EVEN EDGE, which is Chromium based.   Chrome is default settings and I have also tried in a incognito browser.  Still no change.  \n\nAnyone else having this issue?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mg8go0/streaming_netflix_on_a_desktoplaptop/"
    },
    {
        "id": "1mgbj2v",
        "author": "WannabeNihonjin",
        "title": "Netflix keeps stuttering and audio goes out of sync.",
        "content": "This past week I have been having a problem where for half a second netflix stutters and the progress bar pops up, and the audio goes out of sync. All of this happens every couple minutes.\n\nThings ive tried to fix:\n\n* Restart chrome/computer\n* Tried multiple netflix shows/movies. All with the same problem\n* Disable all extensions\n* Update chrome\n* Try safari (works fine) seems like it might be a chrome problem\n\nAny and all help would be very much appreciated.\n\nEDIT: It almost feels like netflix is constantly trying to resync itself. Ive gone 15 mins without an incident now.\nEDIT2: Problem still occuring.\nThanks",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mgbj2v/netflix_keeps_stuttering_and_audio_goes_out_of/"
    },
    {
        "id": "1mfcfh4",
        "author": "SoftPois0n",
        "title": "‘Fubar’ Canceled By Netflix After 2 Seasons",
        "content": "",
        "upvotes": 229,
        "comments": 77,
        "media": null,
        "permalink": "/r/netflix/comments/1mfcfh4/fubar_canceled_by_netflix_after_2_seasons/"
    },
    {
        "id": "1mga7nf",
        "author": "KXE4_Francois",
        "title": "Thoughts of until dawn?",
        "content": "Please no spoilers for those that haven’t seen it. I will say that I was a bit disappointed. The movie had a bit of everything tbh which was good. I think they could of really killed it (figuratively speaking), but damn I hated the fact it did such a good job in the intro and the first 20mins then everything got stale tbh it felt rushed towards the end. No I haven’t played the game but I’ve heard only positive things about it. Just curious about ppls opinions. I’d give it a 5/10 tbh if the whole movie started and ended with that level of performance and storytelling easily 9/10 for me. Completely random but evil dead by far 10/10 scariest movie made(the newest one)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mga7nf/thoughts_of_until_dawn/"
    },
    {
        "id": "1mg3eba",
        "author": "WichEngeneeringV2",
        "title": "What is the most terrifying and horror movie on Netflix to watch?",
        "content": "Drop your requests down below \nI am searching for a terrifying movie to scare me and make me feel like a little kid who is scared for his life again.\nI ve been searching and watching lots of horror movies lately and I just can’t find the right one.",
        "upvotes": 3,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1mg3eba/what_is_the_most_terrifying_and_horror_movie_on/"
    },
    {
        "id": "1mfyz4a",
        "author": "MATTMURDOCKPUPPY69",
        "title": "Does someone knows a fix for subtitles shifting like this? It’s annoying",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ba7h3q68qngf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1mfyz4a/does_someone_knows_a_fix_for_subtitles_shifting/"
    },
    {
        "id": "1mgd267",
        "author": "GmrJasz",
        "title": "After The Sunset (2004)",
        "content": "As an elder millennial, I grew up with Woody Harrelson and Pierce Brosnon. Always loving the James Bond aspect of Brosnon. I watched and have watched everything he does. Thomas Crown Afair standing out. So I loved this and even the Out Laws. \n\nThis dropped and I figured I would watch it for nostalgia sake. \nCool casual watching until this scene. \n\nI grew up wanting to be Brosnon. \nI'm watching the movie now as an older adult and I want to be Harrelson. Problem is, I actually grew up to be Brosnon in this scene.\nThe personality, the lack of just being happy in the moment.\n\nTLDR: This scene didn't register for me as a teen. Now I can't get passed it. IATAH",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/rreopqoh9rgf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1mgd267/after_the_sunset_2004/"
    },
    {
        "id": "1mg5719",
        "author": "Kylyn84",
        "title": "Help to watch while travelling",
        "content": "Hi! I work away from home and stay in an oilfield camp while I'm away (at work 3 weeks at a time). I have a Roku stick I plug in to the tv to access Netflix I stay in the same camp (so same ip address) but I don't get the same room every time I check in. My problem is that Netflix appears to base where i am off of which tv I sign into, which is causing me problems. I get a week or so where everything is fine, then it starts telling me the tv isn't part of my home account. Is there any way I can possibly watch Netflix on a multitude of different tv's without adding every single one of them to my \"home account\"?! ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mg5719/help_to_watch_while_travelling/"
    },
    {
        "id": "1mfztf8",
        "author": "Positive_Sale1860",
        "title": "My Oxford Year",
        "content": "It really frustrated me how they used eating habits to show the main charters were “different” and that the others were “annoying” or “full of themselves.” It’s great that the two main people can eat all that high-calorie food and stay thin but many can't! Many people have to say no to sandwiches and cake or they gain weight very easily. If they gain weight and are fat do you think the two main characters would date them? Hell no! They wouldn't be attracted to them. Many people would have to starve all day to get to eat 1/4 of that sandwich or cake and not gain weight, especially doing it often. It is not worth it to be miserable all day hungry just to eat a sandwich because a hot guy wants you to. I'm not saying don't treat yourself, but the way they portrayed people making healthier choices to stay thin compared to thin people getting to eat what they want were kinda disgusting!\n\nAlso, how are you going to just let yourself into someone's house because you know the code? The audacity! ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mfztf8/my_oxford_year/"
    },
    {
        "id": "1mffkvv",
        "author": "self-fix",
        "title": "KPop Demon Hunters 2 And 3 Are Heading To Netflix, Says Report",
        "content": "",
        "upvotes": 28,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mffkvv/kpop_demon_hunters_2_and_3_are_heading_to_netflix/"
    },
    {
        "id": "1mf3pz6",
        "author": "Careless_Leg_6513",
        "title": "My Oxford Year",
        "content": "Sooo. What is with the guy having a secret disease hiding in every gig he works at, first bridgerton, now this. Lol\nAnd Sofia needs to do some other roles. I feel like all of her movies are kind of the same. The damsel in distress and ends up saving the whole tribe. ",
        "upvotes": 123,
        "comments": 183,
        "media": null,
        "permalink": "/r/netflix/comments/1mf3pz6/my_oxford_year/"
    },
    {
        "id": "1mfapqn",
        "author": "cieje",
        "title": "the best phrase on Netflix? \"limit series\"",
        "content": "I'd much rather know beforehand that a show will intentionally have an actual ending, than hoping Netflix decides to renew something.\n\nI was really hoping the contract from the WGA strikes would've included a requirement that a certain % of contacts were multi-year or something. having the writers worried about getting renewed all the time leads to bad writing. and unfinished plots.\n\nedit well, \"limited series\" I'm sure you get it.",
        "upvotes": 49,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1mfapqn/the_best_phrase_on_netflix_limit_series/"
    },
    {
        "id": "1mg690c",
        "author": "DifferentMaize9794",
        "title": "Should Caliphate makers filed lawsuit agansit Bollywood producer for rip off?",
        "content": "Some people come forward that the kerala story may plagiarism of Netflix series Capahtile for scenes, this Bollywood progepdnda film starting Adah Sharma produced by her married lover. Check Kerala story and Capahtile scene comprsion ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mg690c/should_caliphate_makers_filed_lawsuit_agansit/"
    },
    {
        "id": "1mffecm",
        "author": "StingVay",
        "title": "Can someone help me find my favorite childhood movie?",
        "content": "When i was a kid i watched an animated movie on netflix that ive tried to find everyhwere but no matter what i search i cant find it so i thought id ask here. From what i remember the premise was something like 3 kids were the \"chose ones\" and sent to go through time or soething like that, and accompanying each of them was a little mythical creature that helped them in their journey, and i remember that the evil person that was trying to stop them also had 3 kids that had little magical beasts, and near the end the plot twist was that the 3 \"evil\" kids were actually the chosen ones and they actually were the ones who had to save the day so they all teamed up and beat the villain. I know its not alot to go off of but thats pretty much all i can remember, if someone knows what im talking about please let me know ive been searching for years!",
        "upvotes": 18,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1mffecm/can_someone_help_me_find_my_favorite_childhood/"
    },
    {
        "id": "1mg48av",
        "author": "KASABIAN2004",
        "title": "They really should keep profile pictures",
        "content": "I'm VERY late to Squid Game, only just finished season 1 about 15 minutes ago. And went to change my profile picture to the Ali Abdul one, just to remember we're now in season 3, meaning I can only get the season 3 profile pictures. It's so annoying that they do this ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mg48av/they_really_should_keep_profile_pictures/"
    },
    {
        "id": "1mep55y",
        "author": "Cynthiaaxxxx",
        "title": "A show you stumbled upon with zero expectations but ended up loving",
        "content": "There are times you just press play on something random and then boom, you’re hooked. Wondering what Netflix series or movie took you by surprise in a good way.",
        "upvotes": 601,
        "comments": 1865,
        "media": null,
        "permalink": "/r/netflix/comments/1mep55y/a_show_you_stumbled_upon_with_zero_expectations/"
    },
    {
        "id": "1mfo2k8",
        "author": "chopsueys",
        "title": "my pc is no longer part of my household",
        "content": "Their anti-multicount policy is becoming totally insane... I'm the only one using this account and I only watch netflix on my pc (not a laptop) or my smartphone. Is their goal to lose as many customers as possible?  \nI'm just going to unsubscribe, I don't know what else to do",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mfo2k8/my_pc_is_no_longer_part_of_my_household/"
    }
]