[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 50,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 17,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1rbq6wm",
        "author": "DeputyDawe",
        "title": "Stranger Things",
        "content": "Just started watching Stranger Things on Netflix and I’m really enjoying it. I love anything set in the nineteen eighties because that was when I just came into my teenage years so the music, the fashions, even the rotary phone on the wall brings back some wonderful memories of a bygone time. The kids are really likeable and goofy much like the kids I grew up with. Would definitely recommend it to anyone who hasn’t already stumbled upon it ",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1rbq6wm/stranger_things/"
    },
    {
        "id": "1rbb27k",
        "author": "Honest1824",
        "title": "Next Top Model - those poor girls",
        "content": "Watching Netflix's doc on America's Next Top Model is so depressing. Those poor girls did not feel like they could say \"no\" to the abuse, even with all those people and cameras around. \n\nIt really makes me feel even worse for the poor girls that Epstein and his friends abused. Imagine how powerless they must have felt alone with those rich, entitled old men? ",
        "upvotes": 67,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1rbb27k/next_top_model_those_poor_girls/"
    },
    {
        "id": "1razodx",
        "author": "TinyResponsibility11",
        "title": "Stargate SG-1 on Netflix is unwatchable due to very bad image quality",
        "content": "This week Netflix added all seasons of Stargate SG-1 in Europe. I was really looking forward to watching it. Unfortunately the video quality is very poor and often time blurry and pixelated. I understand that it is an older tv show, but still the video quality shouldn't be this low.The resolution is 432p and the video has 0.20 Mbps ! bandwidth, that is an extremely low bandwidth for even SD tv shows, it’s usually between 2.5 to 3.0 Mbps. \n\nWith the current picture quality the show is basically unwatchable on Netflix and I advise people who want to watch it to look for the DVD or blu ray release. Those versions are of much higher quality.",
        "upvotes": 163,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1razodx/stargate_sg1_on_netflix_is_unwatchable_due_to/"
    },
    {
        "id": "1rbee4z",
        "author": "kattt1109",
        "title": "Watching the ANTM Documentary",
        "content": "I was probably about 8 or 9 when I started watching America’s Next Top Model, honestly, loved it, that time the drama was really everything!\n\nWatching this documentary however at the age of 28, I’m like dammmmn some of this stuff was rough. I kind of switch it off sometimes because my eyes cannot believe what I’m seeing. And yes it was a different time, and the fashion industry was very different, but some of the things are just crazy, especially personal experiences the girls had where there was not really much help provided for them",
        "upvotes": 12,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1rbee4z/watching_the_antm_documentary/"
    },
    {
        "id": "1ranxe7",
        "author": "CHEZ0673",
        "title": "ANTM",
        "content": "Shandi was date raped and they made her look like a cheater instead of giving her the support she needed or even stopping it before it  happened. Tyra saying she isn't part of production but then playing along and bringing up cheating is appalling. \nShandi was raped and then made to look like the one at fault, fucking disgusting 🫣 ",
        "upvotes": 333,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1ranxe7/antm/"
    },
    {
        "id": "1rb5hre",
        "author": "Orangeandjasmine777",
        "title": "The Middle on netflix",
        "content": "There is an American sitcom about a working class family with funny exaggerated everyday family calamities. It's new to Netflix UK. \nIf you've seen it. What are your thoughts? ",
        "upvotes": 25,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1rb5hre/the_middle_on_netflix/"
    },
    {
        "id": "1rbpedp",
        "author": "joeblob5150",
        "title": "Am I insane?",
        "content": "A preview for a movie popped up in my feed Friday. the synopsis said it was about a group of friends that are trying to hide a body. the clip showed a group of 4 guys in an apartment chatting. The main character had long brown hair and a goatee, then an old Chinese lady comes in for a visit. she is the main character's neighbor. It is a comedy and appeared to be a new release. We went to watch it. but we can't find it anywhere. it's like it never existed.\n\nany help would be appreciated.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1rbpedp/am_i_insane/"
    },
    {
        "id": "1rb8n0c",
        "author": "Middle-Abalone-3142",
        "title": "Most Impactful Movie on Netflix",
        "content": "Which movie on Netflix made you feel the most emotions. Whether it was a sad death, a crazy storyline, intense scenes or something else which movie on Netflix had your emotions spiking? Please comment the craziest movie on Netflix that is filled with emotions and stressful intense scenes!",
        "upvotes": 13,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1rb8n0c/most_impactful_movie_on_netflix/"
    },
    {
        "id": "1rbjtss",
        "author": "Left_Actuary_7890",
        "title": "Mainly looking for limited tv series and shorter tv series",
        "content": "So my goal is mainly to get over the shorter more binge-able tv shows first then move onto the bigger shows. I’m open to anything whether it’s a movie or tv show, whether it’s animated or live action. My latest watches include:\n\nThe Night agent\n\nThe art of Sarah\n\nArcane\n\nWayward\n\nAvatar the last airbender\n\nLost in starlight \n\nTwilight of the gods\n\nA knight of the seven kingdoms \n\nHis and hers\n\nPluribus\n\nThe beast in me\n\n ",
        "upvotes": 1,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1rbjtss/mainly_looking_for_limited_tv_series_and_shorter/"
    },
    {
        "id": "1rbjil0",
        "author": "seedramidoriya",
        "title": "Netflix wont play shameless",
        "content": "im trying to watch my show shameless but netflix keeps telling me \"error cannot play title\" anyone know why? i live in uae if that plays a role, i cant really find a fix anywhere, i watch on mobile",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1rbjil0/netflix_wont_play_shameless/"
    },
    {
        "id": "1rbirsv",
        "author": "Supernova0405",
        "title": "I don’t receive new shows",
        "content": "Everybody I know here in Sweden can watch newly added shows like one piece (the anime), hxh and jujutsu kaisen, but I can’t. Is there something I can do to fix this issue? I have tried login in and out and clearing cache.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rbirsv/i_dont_receive_new_shows/"
    },
    {
        "id": "1rbphhm",
        "author": "Bright-Pangolin7261",
        "title": "Perfect neighbor production",
        "content": "Does anyone know how the body cam footage was obtained, was it through subpoenas or FOIA what?\n\nI’m wondering how footage like this is obtained by documentary producers.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1rbphhm/perfect_neighbor_production/"
    },
    {
        "id": "1raxs77",
        "author": "BootyRangler",
        "title": "Anyone watch The Decameron?",
        "content": "I have a question and I can't seem to find the answer to. Neifile was in the dining room taking food and she picks up the pig and runs off with it and it ends in her demise presumably. My question is why. Why did she run off with the pig like that?\n\nSpoiler tag for anyone that may not have seen it yet.",
        "upvotes": 14,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1raxs77/anyone_watch_the_decameron/"
    },
    {
        "id": "1ra6jev",
        "author": "theindependentonline",
        "title": "We were all rooting for Tyra Banks to give us some answers – but this America’s Next Top Model documentary gaslights its audience",
        "content": "",
        "upvotes": 764,
        "comments": 97,
        "media": null,
        "permalink": "/r/netflix/comments/1ra6jev/we_were_all_rooting_for_tyra_banks_to_give_us/"
    },
    {
        "id": "1rbdhpl",
        "author": "Mr_Perfectly_UnFine",
        "title": "Pavane",
        "content": "Anyone seen Pavane? I have seen the poster on Netflix. It stars Ko A-sung, Byun Yo-han and Mong Sang-min directed by Lee Jong-pil. The trailer looks good. Is it worth the watch? ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1rbdhpl/pavane/"
    },
    {
        "id": "1rbnqyu",
        "author": "TheShyBuck",
        "title": "Yoon Suk Yeol the former president of Korea days ago was jailed for life, what is going to happen to the deal that he made with Netflix to invest 2.5 billions in Korean shows and films?",
        "content": "\n\n[](https://www.reddit.com/r/korea/?f=flair_name%3A%22%EB%AC%B8%ED%99%94%20%7C%20Culture%22)\n\n3 years ago Yoon Suk Yeol asked the CEO of Netflix to increase investment in Korean shows and films (2.5 billions), and they made the deal, however Yoon Suk Yeol the former president of Korea days ago was jailed for life for leading insurrection after attempt to declare martial law.\n\ncompanies sometimes reverse deals and fire producers and actors if they do something that is illegal.\n\nIs Netflix going to think about reversing the deal it made with Yook Suk-yeol? because Yook Suk-yeol did a crime in the Korean law?\n\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1rbnqyu/yoon_suk_yeol_the_former_president_of_korea_days/"
    },
    {
        "id": "1rbbotg",
        "author": "Frequent-Layer27",
        "title": "Help? Suddenly censoring swear words despite no restrictions on account.",
        "content": "Sorry if this is the wrong place, but I'm really at a lose and cannot find any information anywhere to fix this.\n\nWe started to watch The Night Agent today, and noticed that the swear words were muted. The audio cuts off when they swear. We have no restrictions on our account and watch through our TV app. We checked online too and there are no restrictions on our account.\n\nDoes anyone have any ideas of how to fix this? It's extremely annoying.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1rbbotg/help_suddenly_censoring_swear_words_despite_no/"
    },
    {
        "id": "1rbbo5l",
        "author": "Hot-Pop-3250",
        "title": "Why do I keep getting logged out on the website?",
        "content": "I've never had this problem but I have to log in every day now. Anyone else experiencing the same thing on the website through chrome?\n\nI haven't done any troubleshooting :)",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1rbbo5l/why_do_i_keep_getting_logged_out_on_the_website/"
    },
    {
        "id": "1rb2fyb",
        "author": "FarJuice6487",
        "title": "Asian Action/Drama Series Recommendations",
        "content": "I'm into Asian action/drama movies and series lately. I recently watched Last Samurai Standing, House of Ninjas, and Weak Hero and enjoyed them all. Looking for something to watch next along those lines. ",
        "upvotes": 3,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1rb2fyb/asian_actiondrama_series_recommendations/"
    },
    {
        "id": "1ra1uv4",
        "author": "According-Volume9315",
        "title": "Reality Check: America’s Next Top Model",
        "content": "i am just heartbroken and livid for Shandi. each of these stories is sickening, and as a little girl watching and idolizing the girls on this show, so much of it just went right over my head (except how mean they all were- the cruelty made me upset, even as a kid).\n\nbut SHANDI!?????? this girl was basically R\\*\\*\\*D ON TELEVISION. she was blackout dr\\*\\*k. she could not consent. she was barely old enough to drink, she was impressionable, and she was innocent… they filmed her being taken advantage of in the very most disgusting way.\n\nTHEN, they filmed Tyra and the girls shaming her and talking smack about her… then filming her in fetal position on the floor, sobbing to her boyfriend on the phone while she “fesses up to cheating on him”… and him degrading her… all on Global TV.\n\ni just feel like this was the sickest story of all and it was barely glossed over. Tyra barely acknowledged it. just sick. Justice for Shandi.",
        "upvotes": 450,
        "comments": 69,
        "media": null,
        "permalink": "/r/netflix/comments/1ra1uv4/reality_check_americas_next_top_model/"
    },
    {
        "id": "1r9zqoc",
        "author": "King-Baratheon",
        "title": "My wife and I were browsing Netflix when she recommended \"Adolescence\".",
        "content": "Not going to try and mangle my words; this was one of the best mini series I've ever watch. The way it's filmed with the one shots for each episode, the acting, all of it.\n\nThe last episode completely wrecked me. I have two sons that are 12, and placing myself in that situation in my head had me literally bawling my eyes out for close to 20 minutes. NEVER had a movie or show break me like this.\n\nIt also makes me realize how I can become a better father for my kids. Now, I'm going to check out other Stephen Graham stuff.\n\n10/10 show IMO.",
        "upvotes": 412,
        "comments": 93,
        "media": null,
        "permalink": "/r/netflix/comments/1r9zqoc/my_wife_and_i_were_browsing_netflix_when_she/"
    },
    {
        "id": "1ra7evr",
        "author": "lyn73",
        "title": "Famous Last Words:Eric Dane",
        "content": "This is the documentary everyone needs to see and should be talking about...not the ANTM. You will come away feeling like you've learned something &amp; appreciative for having spent the time watching it as opposed to being annoyed by highlighting abusive culture that has permeated our society.  ",
        "upvotes": 120,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1ra7evr/famous_last_wordseric_dane/"
    },
    {
        "id": "1rbcin6",
        "author": "ComprehensiveDeer56",
        "title": "What's a Netflix-only that you like?",
        "content": "for me, i have two:  \n\\-A.I.C.O. Incarnation  \n\\-(controversy time)Devil May Cry\n\ni really liked them both(absolute peak)  \nbut what are YOUR favorite Netflix-only shows? tell me in the comments!  \n(i am fully prepared for the hate and de@th threats i'll get from mentioning Devil May Cry)",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1rbcin6/whats_a_netflixonly_that_you_like/"
    },
    {
        "id": "1rav341",
        "author": "LilNello1",
        "title": "New AMA with Colby Day",
        "content": "Thought it might be of some interest to some folks in this subreddit to check it out.  Since he did the Netflix movie, Spaceman, starring Adam Sandler.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1rav341/new_ama_with_colby_day/"
    },
    {
        "id": "1rb0t2m",
        "author": "Formal-Ad-2636",
        "title": "Next serial killer documentary?",
        "content": "I'd love to see one on Harold Shipman, I don't think there has been any decent ones made, and he is very prolific. Also doesn't seem to be a sexual motive (to my knowledge) which makes it unique. People would be interested after Lucy Letby one I reckon.\n\n  \nI feel like many others have been done, and far better than Netflix could (Aileen Wuornos for example).",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1rb0t2m/next_serial_killer_documentary/"
    },
    {
        "id": "1raqhfl",
        "author": "Fluffy_Tie5709",
        "title": "El Jardinero(the gardeners)",
        "content": "I'm watching this on Netflix right now and it's worth watching.\n\nespecially Violeta... she's really beautiful🖤\n\nActually, it's my first time seeing her in this series, and she's really fascinating, even though I don't know what u think✌️",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1raqhfl/el_jardinerothe_gardeners/"
    },
    {
        "id": "1ra358f",
        "author": "Orion-Parallax",
        "title": "Do you ever…",
        "content": "Do you ever start a show or movie but lose interest in it and continue to watch it to the end just so it doesn’t stay on your ‘Continue Watching’ list for months before you eventually remove it. ",
        "upvotes": 48,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1ra358f/do_you_ever/"
    },
    {
        "id": "1racihd",
        "author": "Nadidi88",
        "title": "Any suggestions?",
        "content": "Looking for something exciting to watch, a drama with an amazing plot twist or a fun &amp; exciting thriller. I also really love horror movies that aren't slashers. \nOr anything else that you've seen recently and by the end you went \"WOW\"! \nThanks in advance! :)",
        "upvotes": 7,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1racihd/any_suggestions/"
    }
]