[
    {
        "id": "1kebneh",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Duncan Skiles - Monday 5/5 at 7:00 PM ET - Director of 'The Clovehitch Killer' (Starring Dylan McDermott and Charlie Plummer) and 'Neighborhood Watch' (Starring Jack Quaid and Jeffrey Dean Morgan)",
        "content": "",
        "upvotes": 1,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/c3pae1at1pye1.png?auto=webp&amp;s=1a37a17984fb915d19764b754dfded8a9637337b"
        },
        "permalink": "/r/movies/comments/1kebneh/amaqa_announcement_duncan_skiles_monday_55_at_700/"
    },
    {
        "id": "1kcpxna",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Thunderbolts* / The Surfer) Plus Throwback Discussions",
        "content": "# New Theatrical Releases\n\n[Thunderbolts*](https://old.reddit.com/r/movies/comments/1kcpug8/official_discussion_thunderbolts_spoilers/?)\n\n[The Surfer](https://old.reddit.com/r/movies/comments/1kcpuhw/official_discussion_the_surfer_spoilers/?)\n\n# 25th Anniversary Throwback Discussion Threads\n\n[The Flintstones in Viva Rock Vegas](https://old.reddit.com/r/movies/comments/1kcpumj/official_throwback_discussion_the_flintstones_in/?)\n\n[Frequency](https://old.reddit.com/r/movies/comments/1kcpunu/official_throwback_discussion_frequency_spoilers/?)\n\n[Where the Heart Is](https://old.reddit.com/r/movies/comments/1kcpupt/official_throwback_discussion_where_the_heart_is/?)\n\n\n\n\n# Still in Theaters\n\n[The Accountant 2](https://old.reddit.com/r/movies/comments/1k79o5r/official_discussion_the_accountant_2_spoilers/?)\n\n[The Legend of Ochi](https://old.reddit.com/r/movies/comments/1k79o78/official_discussion_the_legend_of_ochi_spoilers/?)\n\n[Until Dawn](https://old.reddit.com/r/movies/comments/1k79o90/official_discussion_until_dawn_spoilers/?)\n\n[Sinners](https://www.reddit.com/r/movies/comments/1k1tsoo/official_discussion_sinners_spoilers/?)\n\n[The Wedding Banquet](https://www.reddit.com/r/movies/comments/1k1tsqm/official_discussion_the_wedding_banquet_spoilers/?)\n\n[Warfare](https://www.reddit.com/r/movies/comments/1jwev1e/official_discussion_warfare_spoilers/)\n\n[The Amateur](https://www.reddit.com/r/movies/comments/1jwev63/official_discussion_the_amateur_spoilers/)\n\n[Drop](https://www.reddit.com/r/movies/comments/1jwevax/official_discussion_drop_spoilers/)\n\n[Freaky Tales](https://www.reddit.com/r/movies/comments/1jwevev/official_discussion_freaky_tales_spoilers/)\n\n[A Minecraft Movie](https://www.reddit.com/r/movies/comments/1jr0qff/official_discussion_a_minecraft_movie_spoilers/?)\n\n\n\n\n# On Streaming\n\n[Another Simple Favor](https://old.reddit.com/r/movies/comments/1kdg7p5/official_discussion_another_simple_favor_spoilers/?)\n\n[Havoc](https://old.reddit.com/r/movies/comments/1k7zfyi/official_discussion_havoc_spoilers/?)\n\n[G20](https://old.reddit.com/r/movies/comments/1k7zfzp/official_discussion_g20_spoilers/?)\n\n[2073](https://old.reddit.com/r/movies/comments/1k7zg0y/official_discussion_2073_spoilers/?)\n\n[Holland](https://old.reddit.com/r/movies/comments/1k7zg30/official_discussion_holland_spoilers/?)",
        "upvotes": 47,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1kcpxna/official_discussion_megathread_thunderbolts_the/"
    },
    {
        "id": "1kes7p8",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Tim Heidecker in 'Fior Di Latte' - A playwright, hooked on sniffing perfume to relive memories from an Italian vacation, spirals into obsession as his life falls apart.",
        "content": "",
        "upvotes": 3583,
        "comments": 177,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hlkq1hw1htye1.png?auto=webp&amp;s=ef9272576e1b0e3103f2a096c8960be4e34393a2"
        },
        "permalink": "/r/movies/comments/1kes7p8/first_image_of_tim_heidecker_in_fior_di_latte_a/"
    },
    {
        "id": "1kep590",
        "author": "ForeverBlue101_303",
        "title": "California, Once a Mecca for Animation Work, Is Rapidly Losing Ground, Report Claims",
        "content": "",
        "upvotes": 1924,
        "comments": 107,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-bCJr2z4oJZUxKnlIF0fN-sEAhvoLhtaWCpaWcAHLjg.jpg?auto=webp&amp;s=8a672f6ccb6737bdf0805ccf4a329b2c429a43e4"
        },
        "permalink": "/r/movies/comments/1kep590/california_once_a_mecca_for_animation_work_is/"
    },
    {
        "id": "1kelwmu",
        "author": "BunyipPouch",
        "title": "First Image of Maika Monroe ('It Follows') in Crime-Thriller 'In Cold Light' - Ava attempts to go straight after prison, but after witnessing her twin brother's murder, she is forced to run for her life. - Also Starring Troy Kotsur &amp; Helen Hunt",
        "content": "",
        "upvotes": 1754,
        "comments": 91,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/y8syj6q65sye1.png?auto=webp&amp;s=c6b658543c736c897b32d198a06f80eb7f1f2143"
        },
        "permalink": "/r/movies/comments/1kelwmu/first_image_of_maika_monroe_it_follows_in/"
    },
    {
        "id": "1kezfs7",
        "author": "AaronRodgersVaxCard",
        "title": "What’s a movie you want a sequel to but know you’ll never get?",
        "content": "Mine is and always will be BASEKETBALL. Even with Zucker not producing and directing anymore, Matt and Trey have proved to be smart enough to take on satire of anything and make it worthwhile. Plus they’re actually sports fans so you know they know about all the scandals that have been happening across all sports that are ripe for parodying.",
        "upvotes": 133,
        "comments": 324,
        "media": null,
        "permalink": "/r/movies/comments/1kezfs7/whats_a_movie_you_want_a_sequel_to_but_know_youll/"
    },
    {
        "id": "1kewtab",
        "author": "BunyipPouch",
        "title": "Chloë Sevigny Pitched Herself to Luca Guadagnino to Play Jean (Patrick Bateman’s Secretary) Again in New ‘American Psycho’ Film",
        "content": "",
        "upvotes": 167,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kc9gusKjU34ghTDefjPcB1za1e7F0_aVdlW2eTfnBaI.jpg?auto=webp&amp;s=3bc818dd139c2e6fec692b7bbbd0f2d97578d417"
        },
        "permalink": "/r/movies/comments/1kewtab/chloë_sevigny_pitched_herself_to_luca_guadagnino/"
    },
    {
        "id": "1kebyi8",
        "author": "BunyipPouch",
        "title": "Employees at Austin Alamo Drafthouse Location Vote to Unionize - The group went public with its unionization efforts in March after company-wide layoffs impacted the Austin location. Unionization efforts have quickly spread within the theater chain in recent months.",
        "content": "",
        "upvotes": 4084,
        "comments": 178,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fY3PxsGQQJ7KZRxxLEjdAx8c8JoFlxqN-xwaZCDr7QI.jpg?auto=webp&amp;s=2b7345bd79d43a12b52c5a88fd174329c720ccf8"
        },
        "permalink": "/r/movies/comments/1kebyi8/employees_at_austin_alamo_drafthouse_location/"
    },
    {
        "id": "1ketrs3",
        "author": "LukeGuyFrotter",
        "title": "What are the new movies cliche one-liners?",
        "content": "We all know the ones from movies that came out from like, the 80s-2000s, ones like \"He's right behind me, isn't he?\", \"Are you thinking what I'm thinking?\", \"Nobody gets to bully [BLANK] but me!\", \"I can explain!\", etc etc. you know the list goes on.\nBut what are some newer cliches that are popping up in more recent movies? \n\nMy submission: when someone goes \"We only have *one* chance to do this.\" ",
        "upvotes": 185,
        "comments": 228,
        "media": null,
        "permalink": "/r/movies/comments/1ketrs3/what_are_the_new_movies_cliche_oneliners/"
    },
    {
        "id": "1keprc0",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Kevin Bacon &amp; Kyra Sedgwick in 'The Best You Can' - Two halves of an unlikely friendship between a security guard and a urologist whose chance encounter blooms into something deeper.",
        "content": "",
        "upvotes": 258,
        "comments": 42,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3mu6hyfuysye1.png?auto=webp&amp;s=a8bcbb9e4a1f751fe1dab84ae3c60749fdea3102"
        },
        "permalink": "/r/movies/comments/1keprc0/first_image_of_kevin_bacon_kyra_sedgwick_in_the/"
    },
    {
        "id": "1kefv07",
        "author": "AvailableReality557",
        "title": "Which actor shocked you with an unexpectedly great performance?",
        "content": "I have seen actors performance performances that completely changed how I saw them in ways I didnt expect. Maybe it was a comedic actor suddenly showing the dramatic talent, or a side character stealing the spotlight. Im always fascinated by those moments when an actor breaks free of what we expect and delivers something raw, powerful, and unforgettable. Which performance truly shocked you and why ? I would love to hear examples that made you rethink everything you thought you knew about that actor.",
        "upvotes": 792,
        "comments": 1645,
        "media": null,
        "permalink": "/r/movies/comments/1kefv07/which_actor_shocked_you_with_an_unexpectedly/"
    },
    {
        "id": "1keq5em",
        "author": "alienleader57",
        "title": "I rewatched live free or die hard",
        "content": "This is my third time watching this film and i have to say. Whoever says the PG-13 rating ruined this movie is absolutely wrong. \n\nJohn McClanes character was not lost in this film as at this point in time Bruce Willis still cared about his job. John McClane feels like John McClane.\n\nThis film always feels to me like it is pushing John from 80s-90s style action to a more modern style action, while maintaining the franchises roots. \n\nThe main villain is very good in this movie. Definitely the best villain whose surname isn't Gruber in this franchise. \n\nSo over all this movie is like a 7/10. ",
        "upvotes": 156,
        "comments": 112,
        "media": null,
        "permalink": "/r/movies/comments/1keq5em/i_rewatched_live_free_or_die_hard/"
    },
    {
        "id": "1kel088",
        "author": "JohnHamFisted",
        "title": "What are examples of movie franchises where the sequels were already written as separate films but had to be linked retroactively?",
        "content": "I'm thinking of cases like the Cloverfield trilogy, where Cloverfield Lane and Cloverfield Paradox are clearly just separate horrorfilms with the tiniest connection added (usually in the final shot) to create the illusion of connective tissue.\n\nI also remember learning that The Raid 2 was a film that was already written as a standalone but couldn't find the money to produce it, so they decided to re-frame it as the new case for the main character of The Raid.\n\nWould love to learn about more examples like that.",
        "upvotes": 236,
        "comments": 127,
        "media": null,
        "permalink": "/r/movies/comments/1kel088/what_are_examples_of_movie_franchises_where_the/"
    },
    {
        "id": "1keo3pd",
        "author": "Davis_Crawfish",
        "title": "Scarface (1983): Was Elvira genuinely in love with Tony or was she just using him?",
        "content": "I think Elvira didn't know what love was, even if she tried to. Let's be honest, she left Tony because she could see the writing on the wall, he was headed to a tragic end and she wasn't going to stay and end up made into swiss cheese alongside the self destructive Tony.\n\nEvery relationship she had was a business exchange with the purpose of leaving her protected and safe. That was her arrangement with Frank and it was now Tony and Tony knew that and that's why he treated her like crap because he wanted her to be like Gina but she was just a tramp looking to be a kept woman. \n\nThe sad thing is that Tony ended up losing the two people who loved him for who he was: Manny, his best friend, whom he killed out of a sense of betrayal, and Gina, who hated his guts before dying. \n\nElvira was the smart one because she got off the bus before the crash but not before telling Tony off for how he treated her.",
        "upvotes": 108,
        "comments": 44,
        "media": null,
        "permalink": "/r/movies/comments/1keo3pd/scarface_1983_was_elvira_genuinely_in_love_with/"
    },
    {
        "id": "1kej05j",
        "author": "GrandManSam",
        "title": "If you were to retroactively award Oscars for best stunts, what movie should be awarded?",
        "content": "Exactly as the title says. They're apparently giving out Oscars for best stunt performance, a hard and critically thankless job. If this category were to have existed prior to its implementation now, what would previous year's Oscars best stunt winners? Are there any individual stunt performers that should be recognized, such as Buster Keaton?",
        "upvotes": 209,
        "comments": 334,
        "media": null,
        "permalink": "/r/movies/comments/1kej05j/if_you_were_to_retroactively_award_oscars_for/"
    },
    {
        "id": "1kecxi6",
        "author": "the_Celestial_Sphinx",
        "title": "The Conclave is a quiet and powerful movie",
        "content": "I just watched The Conclave and I really liked it. It is not a fast or loud film, but it slowly pulls you in with its story and mood. It shows the pressure, secrets, and power struggles that happen behind closed doors during an important religious event.\n\nSome people might say the ending is easy to guess, but that did not bother me. The journey is more important than the surprise. The movie does a good job showing the weight of each choice the characters make.\n\nRalph Fiennes was amazing in this movie. He did not need big speeches or action scenes. His face, his voice, and his small movements said a lot. He made his character feel real and thoughtful.\n\nThis film may not be for everyone, but if you enjoy serious stories and good acting, I think you will enjoy The Conclave.\n\nCan anyone recommend some similar movies ?",
        "upvotes": 523,
        "comments": 195,
        "media": null,
        "permalink": "/r/movies/comments/1kecxi6/the_conclave_is_a_quiet_and_powerful_movie/"
    },
    {
        "id": "1kepijt",
        "author": "FreshmenMan",
        "title": "Do you wish Peter Jackson's Halo got made?",
        "content": "Question, Do you wish Peter Jackson's Halo got made?\n\nIn the 2000s, Peter Jackson attempted to make a Halo film with him as Producer and Neil Blomkamp was going to direct it &amp; Alex Garland was going to write the script. However, the film wasn't made due to several reasons. 1 was that Microsoft had very strict terms, demanding $10 million against 15 percent of gross. 20th Century Fox &amp; Universal both decided to partner on the film. However after awhile, 20th Century Fox threaten to pull, &amp; Universal demanded Jackson to reduced his first dollar revenue deal, which he refused, thus, Halo was cancelled. Another was that the production was plagued with problems with pre-production being re-started multiple times.\n\nI kinda wish the film got made, but one thing that came out of this was that Peter Jackson decided to help Blomkamp make District 9, which I enjoyed. However, I do think if the film did get made, if probably would of been a disaster given that Microsoft was micro-managing the hell out of the project and that fact the production was really on shaky ground with the multiple studios teaming up.\n\nOverall, Do you wish Peter Jackson's Halo got made?",
        "upvotes": 57,
        "comments": 56,
        "media": null,
        "permalink": "/r/movies/comments/1kepijt/do_you_wish_peter_jacksons_halo_got_made/"
    },
    {
        "id": "1kesmej",
        "author": "Htanbed",
        "title": "Apu trilogy by Satyajit Ray",
        "content": "",
        "upvotes": 37,
        "comments": 5,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6c2tiokhktye1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1kesmej/apu_trilogy_by_satyajit_ray/"
    },
    {
        "id": "1ketpkd",
        "author": "Brilliant_Part5434",
        "title": "The best movie villains are the ones who believe they are the hero of their own story.",
        "content": "I think the best movie villans are those that think they are justified in their actions. Whether it is Anton Chigurh in No Country for Old Men, or even Walter White(at least initially) in Breaking Bad, the most compelling antagonists are the ones who view themselves as the protagonists of their narrative. It makes them more complex and, in some cases, more relatable.\n\nWhat is your favorite villain who truly believes they’re in the right? Do you think this makes them more dangerous or appealing perhaps?",
        "upvotes": 30,
        "comments": 63,
        "media": null,
        "permalink": "/r/movies/comments/1ketpkd/the_best_movie_villains_are_the_ones_who_believe/"
    },
    {
        "id": "1keyhsy",
        "author": "leftnotracks",
        "title": "Movies that were juuuust a bit too long.",
        "content": "I love movies with ambiguous endings. Roger Dodger and 25th Hour spring to mind. If you like you can include Thelma and Louise or Butch Cassidy and the Sundance Kid, although I doubt thre’s much debate about the fate of those characters.\n\nWhat movies do you think should have ended just before they did, making for an improved and ambiguous ending? I’ll nominate Shawshank Redemption, by about 40 seconds.",
        "upvotes": 12,
        "comments": 85,
        "media": null,
        "permalink": "/r/movies/comments/1keyhsy/movies_that_were_juuuust_a_bit_too_long/"
    },
    {
        "id": "1kepss7",
        "author": "LagarretsBlount",
        "title": "Bone tomahawk?",
        "content": "I rewatched bone tomahawk. I think the move was brilliantly made. The movie was not very long but still had great character development. \n\nIt kept you intrigued and made you need to see the ending. The sheriff was a great leader and selfless man. The way he treated the old man with respect and trusted his experience and skills even though he had clear deficiencies was amazing. \n\nThe way he said goodbye to the old man in the end was emotional for a horror movie as well. \n\nI think overall this movie was better than its reviews. \n\nWhat is everyone's opinion about it? \n\nAlso, I like how it gives some insight to the old man's past, leaving it ambiguous to the viewer to make up in their minds what the old\nMan has seen. \nIt also doesn't give much back story about Bright Hope or the people who live there or how it was established. \n\nAlso, what do you guys think about the ending when the old\nMan throws the rock? Does the sheriff survive? All good things to think about. ",
        "upvotes": 32,
        "comments": 19,
        "media": null,
        "permalink": "/r/movies/comments/1kepss7/bone_tomahawk/"
    },
    {
        "id": "1kf0a6f",
        "author": "_kevx_91",
        "title": "Two years late but finally got around watching They Cloned Tyrone and to me, it's the best racial satire to come out since Get Out.",
        "content": "\n\nThe whole premise is bonkers but so clever it how it serves as a metaphor for how ethnic minorities, black people in this case, are utilized as drones of consumption and how this perpetuates negative stereotypes (e.g. Fried chicken, obsession with hair products, selling drugs, etc.). It shows how to be critical of those consumer goods we're obsessed with. What makes us feel good or \"look cool\" to others isn't necessarily good for us. \n\nI also love the point it made when Fontaine almost gave up and accepted his fate as a mere clone living in a vicious cycle. Even after people figure out the trap, that knowledge alone won't keep you from falling into it again and again. We might be products of our environment and even our genetics, but at the end of the day, we have free will, and it's up to us to break free from the cycle we are stuck in.\n\n\nI myself am Latino (Puerto Rican to be exact) and I feel like many points made in the film apply to my culture as well. In recent years, Puerto Rican culture has become a bit more known internationally, thanks to things like Bad Bunny and the Despacito song. While there is nothing wrong with people being curious of and being entertained by the culture, there is also a concerted effort to perpetuate pretty offensive and harmful stereotypes about my people: From sexual promiscuity thanks to reggaeton music to the idea that we all live in slums next to the beach. And many fellow Puerto Ricans end up internalizing these stereotypes and thinking it makes us \"cool\". \n\nThe film just really spoke to me this way, and feel it even applies to other ethnicities or minority groups. Great film. It was like Us, but actually good. Also had no idea Boyega had such range in acting. He was phenomenal.",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1kf0a6f/two_years_late_but_finally_got_around_watching/"
    },
    {
        "id": "1ke23ja",
        "author": "mayukhdas1999",
        "title": "New Poster for neonoir 'A DESERT' - A once-successful photographer, now past his prime, embarks on a road trip across the American Southwest to rekindle his career. Instead, he stumbles into a dark and chaotic underworld, dragging his wife and a dubious private detective into a nightmarish situation",
        "content": "",
        "upvotes": 1410,
        "comments": 54,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zo1cmlojkmye1.jpeg?auto=webp&amp;s=c1e75f49a2028e56a51c1e6f7f6a853fde25ccd8"
        },
        "permalink": "/r/movies/comments/1ke23ja/new_poster_for_neonoir_a_desert_a_oncesuccessful/"
    },
    {
        "id": "1kezauy",
        "author": "Playful_Fly_6542",
        "title": "Did You See Don Bluth’s animated Classics “The Secret of Nimh”, “An American Tail” and “The Land Before Time” in Theaters? Share Your Memories!",
        "content": "Has anyone seen Don Bluth’s animated films—like The Secret of NIMH, An American Tail, or The Land Before Time in theaters when they first came out?\nIf so, what was the experience like? I’d love to hear how it felt watching those movies on the big screen. What were movie theaters like back then compared to now? And if you remember, which theater did you see them at?",
        "upvotes": 8,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1kezauy/did_you_see_don_bluths_animated_classics_the/"
    },
    {
        "id": "1keyhay",
        "author": "Frem0015",
        "title": "“The Matrix” question",
        "content": "Rewatched movie this weekend, will always love it.  That being said here’s my question;\n\nDid the oracle know he was going to break the vase because it has happened in every single past version of her the “the ones” meeting?  Or did she know it because she just had a general premonition?\n \nNo wrong answers yo this question, thanks in advance for answers/theories.  \n ",
        "upvotes": 8,
        "comments": 23,
        "media": null,
        "permalink": "/r/movies/comments/1keyhay/the_matrix_question/"
    },
    {
        "id": "1keb6in",
        "author": "onorsworthy",
        "title": "Warfare.",
        "content": "I just saw warfare, I’m gonna try and be as spoiler light as I can.. where do I start. Warfare is not a movie, it’s an experience. I have never in my life felt that overwhelmed and stressed by a movie. The sound design is unforgiving and overwhelming and loud. The movie barely has a story (compared to something like saving private Ryan or lone survivor), but it doesn’t need one. The point of the movie is not to tell you a riveting story about a squad that gets pinned down and makes a miraculous effort to escape. The point of this movie is to drag you to the deep end and try and drown you. With a run time of 1hr 35 minutes, it feels like it’s about 40 minutes long. You get so sucked in and feel like you are there. The movie is insanely fast paced. I love war movies, and this one might take the cake for the most intense and overwhelming war movie I’ve seen. \n\n\nI can see and appreciate where people come from if they say they don’t like it. There really isn’t a story, there’s not really a beginning, middle, or end to what you are watching. It just kind of starts. To me, this is why it’s called warfare.. that’s what you’ll witness watching it. That’s what it’s about. I think out of the entire cast my brain remembered two character names. \n\nSorry for the long rant. Just finished watching it and just kinda trying to put together words for what I just experienced, if you enjoy the war movie genre, go see it. It’s worth it. I’m curious to hear opinions from people who have seen it as well. ",
        "upvotes": 134,
        "comments": 153,
        "media": null,
        "permalink": "/r/movies/comments/1keb6in/warfare/"
    },
    {
        "id": "1kdzoml",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Joel McHale - Wednesday 5/21 at 3:00 PM ET - Actor and comedian from 'Community', 'The Soup', 'Animal Control', 'Becky', 'California King', 'Ted', 'The Bear', 'A Futile and Stupid Gesture', and much more.",
        "content": "",
        "upvotes": 738,
        "comments": 80,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4ikuo5fw0mye1.png?auto=webp&amp;s=0b135ef733ea80fb21c23db36d8fec988a2f180a"
        },
        "permalink": "/r/movies/comments/1kdzoml/amaqa_announcement_joel_mchale_wednesday_521_at/"
    },
    {
        "id": "1kdr8rj",
        "author": "BeginningLychee6490",
        "title": "Watched a movie called The Man From Earth, now I want to find similar movies to binge",
        "content": "The Man From Earth is a thriller about a college professor who suddenly decides to move and several of his colleagues come to his house to say goodbye and after a couple drinks and a lot of pestering he decides to tell them that he’s from the Paleolithic era, of course they don’t believe him but decide to humor him and listen to his story, asking questions and trying to debunk him. The entire movie looks like they rented a cabin at a national park and filmed there. It was a very good movie and I would love to find more hidden gems like it",
        "upvotes": 2269,
        "comments": 557,
        "media": null,
        "permalink": "/r/movies/comments/1kdr8rj/watched_a_movie_called_the_man_from_earth_now_i/"
    },
    {
        "id": "1kf0bad",
        "author": "linkenski",
        "title": "I love Cold Creek Manor.",
        "content": "It's the most refreshing movie I've seen in a while.\n\nIt has competent filmmaking unlike a lot of actual modern films do with their bland drone shots and lethargic pacing, and the way the movie is a thriller that flubs its own suspense by making it too character driven is kind of charming. The scene when he punches his wife in the face made my burst out laughing. I also started chuckling at the Snakes scene when the hyperactive piano music plays and the whole direction is just telling the cast to run around the house screaming in a failed attempt to make the audience feel panicked.\n\nBut what I actually love about it is how nice the characterization is. The characters do feel kind of relatable. The plot plays on the dad sounding like he's becoming obsessed with the crook, while the wife is too trusting in other people to rule him out yet. But just as you think the movie is going with that lame \"Now she's gonna lose trust her husband and get tricked by the bad guy\" the movie does give her agency as she hears her husband ranting about it, and she knows him well enough to know he wouldn't say all that without knowing what he's doing.\n\nI also like the kids in the movie, how the boy is a real boy, who runs his mouth at people saying \"My dad will beat you!\" And he has premature empathy trying to comfort the sister when their horse is found dead, by saying \"don't worry, dad will find out who did it and kill them!\"\n\nI can't see this as a failure. This is an enjoyable movie with real characters, and I have become so tired of all movies needing \"subtext\" as their primary merit to the point where I found it genuinely nice to just have a pedestrian narrative that makes me think \"what's gonna happen now?\"",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1kf0bad/i_love_cold_creek_manor/"
    },
    {
        "id": "1kem1wp",
        "author": "Conscious_Charge_793",
        "title": "Movie recommendations? 2000's era....",
        "content": " I am in this phase where 2000's rom-coms and drama movies r my go-to. I watched Devil wears Prada, Gladiator, Blood Diamond, She's the Man, Legally Blonde, Notebook, The Proposal, The Holiday, First daughter, Transformers.......... and many more.\n\n I also watched David Fincher movies (Fight Club, Shutter Island, Zodiac). But I wasn't that much into them. Don't hate me for that. \n\n Please suggest me something in these genres. AND NO HORROR...... Thank u!\n\nThank u for everyone for recommending. I will check out ur recs for sure. ",
        "upvotes": 13,
        "comments": 59,
        "media": null,
        "permalink": "/r/movies/comments/1kem1wp/movie_recommendations_2000s_era/"
    },
    {
        "id": "1ke0sa7",
        "author": "Empty-Instruction282",
        "title": "Asterix &amp; Obelix: Smashing the Empire on Netflix!",
        "content": "Asterix is a beloved French comic book series created by writer René Goscinny and illustrator Albert Uderzo, first published in 1959. Set in 50 BC, it follows the adventures of a small village of indomitable Gauls as they resist Roman occupation. The titular hero, Asterix, is a diminutive but cunning warrior who, alongside his loyal, super-strong friend Obelix, defends their village with wit, bravery, and a magic potion brewed by the druid Getafix, granting temporary superhuman strength. Obelix, perpetually strong due to falling into the potion as a child, carries a menhir and loves wild boar and brawls.The series blends slapstick humor, clever wordplay, and historical satire, poking fun at Roman bureaucracy and cultural stereotypes while celebrating Gaulish camaraderie. Each album sees Asterix and Obelix embark on quests—whether thwarting Caesar’s schemes, exploring foreign lands like Britain or Egypt, or protecting their village from internal strife. The comics are renowned for their vibrant art, memorable characters like the tone-deaf bard Cacofonix, and timeless appeal across generations. Translated into over 100 languages, Asterix remains a cultural icon with comic books fans around the world!",
        "upvotes": 526,
        "comments": 71,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cPTXFKQ-9vwiqFTEOlJMd1ap5G2LCNo-FZckR3K6_Mw.jpg?auto=webp&amp;s=a549329993729d7a28e5c858bebcc7dcee9758c9"
        },
        "permalink": "/r/movies/comments/1ke0sa7/asterix_obelix_smashing_the_empire_on_netflix/"
    },
    {
        "id": "1kepf7o",
        "author": "leftoverBits",
        "title": "I double featured The Lighthouse and Eraserhead",
        "content": "Highly recommend, especially if you haven’t seen either before. Start them after dark. They will put you in a trance, and you’ll spend the rest of the night with your mind totally blank.\n\nStart with The Lighthouse first for the interpersonal drama because it’s a great warmup for the more surreal character drama of Eraserhead.\n",
        "upvotes": 7,
        "comments": 9,
        "media": null,
        "permalink": "/r/movies/comments/1kepf7o/i_double_featured_the_lighthouse_and_eraserhead/"
    }
]