[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 485,
        "comments": 258,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1ii1bwp",
        "author": "AccurateInflation167",
        "title": "Netflix drops Emilia Pérez star from Oscars campaign over tweets",
        "content": "",
        "upvotes": 659,
        "comments": 111,
        "media": null,
        "permalink": "/r/netflix/comments/1ii1bwp/netflix_drops_emilia_pérez_star_from_oscars/"
    },
    {
        "id": "1ii549c",
        "author": "gomi-panda",
        "title": "Anyone know what show this comedy came from? It looks hilarious",
        "content": "",
        "upvotes": 65,
        "comments": 4,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/o10p0nk31ahe1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1ii549c/anyone_know_what_show_this_comedy_came_from_it/"
    },
    {
        "id": "1ii0clu",
        "author": "Somethingman_121224",
        "title": "Insider Claims Netflix's 'Assassin's Creed' Series Is On Hold, But A New Live-Action Movie Is In The Works",
        "content": "",
        "upvotes": 32,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ii0clu/insider_claims_netflixs_assassins_creed_series_is/"
    },
    {
        "id": "1ii5y54",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix Reveals New Indonesian Originals: 'The Actor' and Zombie Thriller 'The Elixir'",
        "content": "",
        "upvotes": 9,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ii5y54/netflix_reveals_new_indonesian_originals_the/"
    },
    {
        "id": "1ihevjl",
        "author": "Whobitmyname",
        "title": "‘PARASITE’ is now streaming on Netflix, ahead of the 5th anniversary of the film winning Best Picture at the Oscars.",
        "content": "",
        "upvotes": 502,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1ihevjl/parasite_is_now_streaming_on_netflix_ahead_of_the/"
    },
    {
        "id": "1ii7078",
        "author": "Moh-2-Da-Game",
        "title": "shows and movies dissapears from my profile but present on others.",
        "content": "like I said, and yes on the same device even. why's this happening? last year someone made the exact same post and netflix still hasn't addressed this. Like half my list is gone.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ii7078/shows_and_movies_dissapears_from_my_profile_but/"
    },
    {
        "id": "1iidzwh",
        "author": "previouslyontheflash",
        "title": "If 'YOU' was a Rom-Com",
        "content": "With the Final season of YOU releasing soon I thought why not an edit 😄😂! Love the show and making edits so here we are.",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/sley53rljche1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1iidzwh/if_you_was_a_romcom/"
    },
    {
        "id": "1ii9cjy",
        "author": "Complex_Common2808",
        "title": "Old show name????",
        "content": "When I was about 7 I remember watching this show on Netflix and all I remember is it had something to do with some sort of mutant creature that this kid created in a out house in his backyard and he would become friends with it and they would do just random things together.  the show would’ve been aired around 2011-2015. I vividly remember it only being 2 seasons as-well. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ii9cjy/old_show_name/"
    },
    {
        "id": "1ii2dro",
        "author": "masterluke19",
        "title": "You are what you eat: A twin experiment",
        "content": "I just watched this 4 episode series. I understand the benefits of vegan food. But I couldn’t stop thinking about - Why do I feel like this is a big commercial for vegan foods. I see lot of founders and their brands getting advertised in the show. In the end they lost all the vegan food brands. \nIs this a vegan brand collab? \nAnyone else felt like this?",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ii2dro/you_are_what_you_eat_a_twin_experiment/"
    },
    {
        "id": "1ii6f0h",
        "author": "doshas_crafts",
        "title": "AUD12.99 plan resolution",
        "content": "is anyone on the AUD$12.99 plan ? I can't find the resolution streamed for this plan anywhere. suspect its only a SD and only realised recently how bad it looks on my 4k TV.  But am also concerned about the NBN tier I need if I were to upgrade Netflix plan. I'm only on 25mbps plan. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ii6f0h/aud1299_plan_resolution/"
    },
    {
        "id": "1ii2icb",
        "author": "random1211312",
        "title": "Squid game (S1 E8 dub) only playing audio in my left ear.",
        "content": "Watching Squid Game S1 E8 in dub, and for some weird reason it's only playing audio in my left ear, music excluded. Is there any way I could possibly fix this? Idk what's going on",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ii2icb/squid_game_s1_e8_dub_only_playing_audio_in_my/"
    },
    {
        "id": "1ii8701",
        "author": "StockholmSyndromePet",
        "title": "Why Oh Why?",
        "content": "Why does netflix australia show me the same content repeatedly as suggested viewing over and over.\n\nIf I'mn scrolling past your content it means i'm not interested.\n\nStop trying to bully people into watching what you ant us to watch.\n\nIf we keep scrolling show us literally anything else.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ii8701/why_oh_why/"
    },
    {
        "id": "1ii1dml",
        "author": "supercarrier78",
        "title": "Preview in fast forward not working",
        "content": "Trying to watch RAW from earlier this week and cannot get it to preview while fast forwarding (iPad and FireTV). For a show without ad breaks or pre-announced schedules in broadcast the ability to see where you are is essential. Is anyone else experiencing this problem? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ii1dml/preview_in_fast_forward_not_working/"
    },
    {
        "id": "1ih14np",
        "author": "HarperLovey",
        "title": "Any one else canceling due to price increases?",
        "content": "Had to cancel this month as rate went up to just shy of $30/mo (with taxes added in)!  I remember paying something like $12.99/mo.  Even that was a stretch back then. I've always enjoyed Netflix programming, but just can't justify the price anymore. $300/year is just not realistic. ",
        "upvotes": 245,
        "comments": 184,
        "media": null,
        "permalink": "/r/netflix/comments/1ih14np/any_one_else_canceling_due_to_price_increases/"
    },
    {
        "id": "1ii5ms4",
        "author": "cuppachuppa",
        "title": "It seems inevitable that Netflix's next step will be annual subscriptions rather than monthly. Will you sign-up for 12 months at a time?  Or will that be your cue to cancel?",
        "content": "Same as Apple TV, Disney Plus etc., we sign up to Netflix for a few months, watch what we want and then cancel.\n\nI don't think it'll be long until streamers stop this by having 12 month subscriptions.  I think that would be the final straw for me and I'd just cancel them all.",
        "upvotes": 0,
        "comments": 66,
        "media": null,
        "permalink": "/r/netflix/comments/1ii5ms4/it_seems_inevitable_that_netflixs_next_step_will/"
    },
    {
        "id": "1ihvojk",
        "author": "VesnaKostic",
        "title": "I need a recommendation for a series like Holy Family",
        "content": "I want to watch a series like Holy Family where I watched 16 episodes in 2 days. A family on the run, they stole a child, they change identities and kill, lots of mystery and intrigue 😂😂😂 Please helppp ❤️",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ihvojk/i_need_a_recommendation_for_a_series_like_holy/"
    },
    {
        "id": "1ihzo4g",
        "author": "forevony_0904",
        "title": "Helpppp",
        "content": "Guys recommend me good teen dramas like:\n\n#ginnyandgeorgia \n#neverhaveiever\n#atypical\n#heartbreakhigh\n#everythingsucks\n\nTell me what other shows like these y'all like",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ihzo4g/helpppp/"
    },
    {
        "id": "1ihl6uu",
        "author": "_mooi",
        "title": "Subtitle customisation on tv",
        "content": "I'm using Netflix on my Samsung TV \nIm trying to make the window behind subtitles be more transparent / make the subtitle border more visible but the video player only allows 4 preset window options for subtitles background \n\n \nIs there any hidden menu where I can customise it more than the video player allows me to ? ",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ihl6uu/subtitle_customisation_on_tv/"
    },
    {
        "id": "1ihtgnj",
        "author": "Mean_Ferret677",
        "title": "Grey’s anatomy removed from Canadian site?",
        "content": "Update: creating a new profile solved the problem but this show is gone from my own profile for some reason. A bug I guess. \n\nAnyone living in Canada is able to access this show through Netflix? I didn’t see any announcements of it moving to a different streaming platform and it just disappeared halfway through an episode today. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ihtgnj/greys_anatomy_removed_from_canadian_site/"
    },
    {
        "id": "1ihrovd",
        "author": "Crayola-eatin",
        "title": "Netflix/Roku question",
        "content": "I read there's a Chrome add-on that helps you search codes on Flix and supposedly gives you more options. I'm curious if there is a way to use this on the Roku that's hooked into your TV?\n\nTIA.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ihrovd/netflixroku_question/"
    },
    {
        "id": "1ihgxjm",
        "author": "Sad-Year-4815",
        "title": "Is anyone facing the same problem?",
        "content": "I’m trying to watch shows but after a few minutes it just gets stuck and only the voice comes thru. I’ve tried deleting and redownloading - nothing. I’ve tried a different show - nothing. I was watching suits.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ihgxjm/is_anyone_facing_the_same_problem/"
    },
    {
        "id": "1ihp4nm",
        "author": "Ordinary_survival",
        "title": "What is the worsf netflix series you have watched or watching (spoiler alert)",
        "content": "I am a binge watcher, I watch a lot of things while I am doing chores or knitting. I am watching a tv series right now called breathless( original title is respira) and while knitting and giggling I feel like my grandma who watches all the soap operas. \nI mean in this one the doctor gave a false report to a girl whom she felt bad and who is the alleged rapist, his son 🤣while of course his ex husband is one of the top surgeant and also the top oncologist in the hospital. \nThe other doctor humped from the hospital building of how many floors I don’t even know ( but pretty high) still lives and in critical condition. \n\nSo what is your worst netflix series you have watched or whatching and why?\n\nPs: can’t change the title lol sorry for the typo, please share your worsf instead of worst 🤣\nAdditional note: the comments here does not mean your fav show is thrash, this is only comments of people who saw this thread and commented so feel free to what you like to watch to 🙌\n\n\nAnd the best part folks: I am knitting whT I am n\nKnitting mic drop",
        "upvotes": 0,
        "comments": 125,
        "media": null,
        "permalink": "/r/netflix/comments/1ihp4nm/what_is_the_worsf_netflix_series_you_have_watched/"
    },
    {
        "id": "1ihwtp4",
        "author": "weareallpatriots",
        "title": "Karla Sofía Gascón: Netflix Silent On 'Emilia Pérez' Star",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ihwtp4/karla_sofía_gascón_netflix_silent_on_emilia_pérez/"
    },
    {
        "id": "1ihloax",
        "author": "fleshymemes",
        "title": "Blackscreen and autoplay?",
        "content": "I've got a problem with netflix on google chrome. Every time a new episode starts with autoplay, I got a black screen with normal sound. The video only turns on, when i pause the video or when I click with my mouse. I already tried restarting, deleting browser data and reloading. Does anyone else have this problem or is it just me? Has anyone an idea how to get rid of this? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ihloax/blackscreen_and_autoplay/"
    },
    {
        "id": "1ihtmy7",
        "author": "TheAmazingAmpharos",
        "title": "Unable to log in.",
        "content": "I'm unable to log into my Netflix account. I do not know the password, and cannot reset it because I don't know the password to the email I used to create the account. I also cannot reset the password of the email account, because BT just doesn't let you log in after you reset your password. (Please don't judge me, it was created a long time ago.) I do have the billing info for the account.\nIs there any way to recover the account, or if worse comes to worst, just delete it entirely? Thanks.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ihtmy7/unable_to_log_in/"
    },
    {
        "id": "1ih4yl9",
        "author": "Wonderful_Act3430",
        "title": "This is ridiculous",
        "content": "Me and my mom are away from home. She’s at a work thing and I’m watching Netflix out of nowhere in the middle of my show. It tells me that the TV is a part of the Netflix household is now telling me to pay more or make a new account and pay. What is this bull ",
        "upvotes": 15,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1ih4yl9/this_is_ridiculous/"
    },
    {
        "id": "1igr62h",
        "author": "DemiFiendRSA",
        "title": "Cobra Kai: Season 6 Part 3 | Final Trailer | Netflix",
        "content": "",
        "upvotes": 82,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1igr62h/cobra_kai_season_6_part_3_final_trailer_netflix/"
    },
    {
        "id": "1ih07ip",
        "author": "lazybearcreations",
        "title": "Anyone else feeling that the new UI is terrible?",
        "content": "I was using Netflix on the TV with the options positioned on the left side of the screen, showing categories and everything I needed to find what I want to watch.\nNow I open the app in the last few days and the options have moved to the top of the screen and the categories are gone.\nSearch is there but just not really that helpful if you want to discover new things.\nScrolling endlessly through nearly full screen sections is quite frustrating when none of them are really what I am looking for.\nI am feeling like it is a mis-step but I am open to hear if I am just not seeing the benefits here…",
        "upvotes": 20,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ih07ip/anyone_else_feeling_that_the_new_ui_is_terrible/"
    },
    {
        "id": "1ihsbsj",
        "author": "indiewire",
        "title": "What ‘Emilia Pérez’ Can Win at the Oscars",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ihsbsj/what_emilia_pérez_can_win_at_the_oscars/"
    },
    {
        "id": "1ihc1gf",
        "author": "psuitable_pseudonym",
        "title": "New category \"Swipe Left\"",
        "content": "On my Netflix there's a new category \"Swipe Left\" just above \"New on Netflix\" and after \"Casual Viewing\"\nWhy would they...  what were they thinking?\n\nSwiping left on dating apps means not interested and funny enough all the recommendations in that category\nare shit I had/have zero interest in watching or things I watched but didn't thumbs up or double thumb.\n\n\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ihc1gf/new_category_swipe_left/"
    }
]