[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 491,
        "comments": 271,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 10,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1j8z6lh",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix to Adapt Stephen King's \"Cujo\" into a New Film",
        "content": "",
        "upvotes": 80,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1j8z6lh/netflix_to_adapt_stephen_kings_cujo_into_a_new/"
    },
    {
        "id": "1j95ubi",
        "author": "NMokay",
        "title": "Just rewatched Purple Hearts. missing part? Did I make this up?",
        "content": "Am I making this up or was there a part where Cassie and Luke get interviewed by authorities or someone and are asked questions about each other to find out if the marriage is legit. I think immigration is brought up when talking to Cassie and Luke tells them about Cassie’s tattoo and the meaning. I think it happened before the court hearing or before they confessed there love for each other. Maybe I’m thinking of a different movie. ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j95ubi/just_rewatched_purple_hearts_missing_part_did_i/"
    },
    {
        "id": "1j97h0a",
        "author": "yeswab",
        "title": "I actually want to see the closing credits of Zero Day, episode 6",
        "content": "Does anybody know how to turn off the automatic jump to previews of other programs? For what it’s worth, I was trying to finish Zero Day on a Samsung Android tablet, and we usually watch on a Google Chromecast. I couldn’t readily find any settings. THANK YOU!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j97h0a/i_actually_want_to_see_the_closing_credits_of/"
    },
    {
        "id": "1j96a7y",
        "author": "Pitiful_Mechanic9837",
        "title": "Account on hold after cancellation",
        "content": "Hello, everybody.\n\nI've had Netflix for about 6 years, and have cancelled a few times but have never had this issue before.\n\nBasically, i automatically paid for a subscription on March 7th, on March 8 decided to cancel.\nIt said that i was able to watch until April 6th, however, today, March 12 (first time since cancelling), i logged into my Netflix account and it says that it's on hold, until I update my payment info, I'm guessing because i don't have enough money to pay, and now I'm worried if they will double charge me when i receive my salary tomorrow.\n\nHas anyone else had this problem? Do i just hope for the best, or try to contact Netflix support, which is also a problem, since I haven't been able to contact them about previous issues.\n\nAny help would be kindly appreciated, thank you.\n",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j96a7y/account_on_hold_after_cancellation/"
    },
    {
        "id": "1j9560b",
        "author": "VaniZaviBoBani",
        "title": "What is the name of this show?",
        "content": "I saw a show a while ago on Netflix,  it was a competition game show where strangers were fighting for money, but there was a saboteur amongst them. At the end of the challenges they took a quiz and answered questions about the saboteur. The player with the least correct answers got a red light via text. ",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1j9560b/what_is_the_name_of_this_show/"
    },
    {
        "id": "1j87k40",
        "author": "Internal-Bed-3150",
        "title": "Greta Gerwig wants Charli XCX in her Narnia movies",
        "content": "",
        "upvotes": 328,
        "comments": 56,
        "media": null,
        "permalink": "/r/netflix/comments/1j87k40/greta_gerwig_wants_charli_xcx_in_her_narnia_movies/"
    },
    {
        "id": "1j8tx2g",
        "author": "theTexans",
        "title": "Any documentaries or shows that focus on the Ukraine war?",
        "content": "Is there any content on Netflix or outside that focuses on the current ongoing war in Ukraine? Trying to get a better understanding of what is going on, the history behind it, and really, how did Russia turn out to be such a paper tiger after decades of fear mongering being the big bad wolf and their spectacular failure in Ukraine. ",
        "upvotes": 6,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1j8tx2g/any_documentaries_or_shows_that_focus_on_the/"
    },
    {
        "id": "1j8ulk5",
        "author": "S4v1r1enCh0r4k",
        "title": "Cristin Milioti has joined the cast of Netflix’s ‘In Your Dreams’ alongside Simu Liu and Craig Robinson.",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j8ulk5/cristin_milioti_has_joined_the_cast_of_netflixs/"
    },
    {
        "id": "1j8ttyt",
        "author": "Gabe_H_Cuod24",
        "title": "Manhunt: Osama Bin Laden still not available?",
        "content": "So I’ve been waiting for the new Manhunt documentary to drop. Said it was coming March 10. So yesterday morning I went to watch and it wasn’t popping up in my watch list. I searched and it came up as coming soon. So I waited and today is same thing. Does anyone know why it hasn’t dropped yet? Or have they had this experience with any other show? I never have… usually by midnight on date they say the show always drops.",
        "upvotes": 6,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1j8ttyt/manhunt_osama_bin_laden_still_not_available/"
    },
    {
        "id": "1j95ez8",
        "author": "Admirable_Hat_4344",
        "title": "Is there anyway to turn off the slideshow that starts up when a show is paused for a while?",
        "content": "I’m using the app on a Sony smart tv. \n\nWhenever it’s paused it goes into a slideshow with cards displaying shows Netflix is trying to promote. I get that it’s a screensaver, but it does this really fast and if I’m trying to concentrate on other things the changing image and light in the room gives me a headache for some reason. I feel like it’s timed to be as distracting as possible. I just want to write an email without having to exit the show or app every time. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j95ez8/is_there_anyway_to_turn_off_the_slideshow_that/"
    },
    {
        "id": "1j8ivi0",
        "author": "Way-of-Kai",
        "title": "How do we feel about 3-4 years for subsequent seasons",
        "content": "On one hand I understand the time required to deliver quality work, but a decade to conclude a story is really exhausting. Like people just move-on in life and even stop caring about something they watched 5 years ago. \n\nOnce concluded it will obviously be looked back as a peak animation that redefined its genre. But it’s frustrating for us bunch waiting for it to come out.\n\nIt’s similar case as spiderverse films, just notice how much your life has changed between each film.",
        "upvotes": 33,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1j8ivi0/how_do_we_feel_about_34_years_for_subsequent/"
    },
    {
        "id": "1j85l1m",
        "author": "Last_Weird0717",
        "title": "American Manhunt Osama bin Laden: Not coming up on my Netflix??",
        "content": "I'm in the US and had this on my list to watch for today. Now it's suddenly not showing up at all. Anyone else having this issue? I know the release date was today, March 10th. \n\n",
        "upvotes": 185,
        "comments": 336,
        "media": null,
        "permalink": "/r/netflix/comments/1j85l1m/american_manhunt_osama_bin_laden_not_coming_up_on/"
    },
    {
        "id": "1j8y7uv",
        "author": "ditzy-feet_o",
        "title": "Appreciation post",
        "content": "I really love netflix. I have been a customer since forever. Over the years I have really found some shows and movies that have stuck with me, that  I continue to watch today. Some I've even bought the DVD! (Just in case) When I turn on netflix,  I feel like I am turning on excitement, happiness and comfort. I appreciate it, and I just want to say thank you for existing! And also thank you to the creators of all the wonderful shows and movies! ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1j8y7uv/appreciation_post/"
    },
    {
        "id": "1j8owc5",
        "author": "Spider-ManWasTaken",
        "title": "What show am I thinking about?!",
        "content": "I remember I watched it 2023 and it was about two girl best friends, one of them dies, only the best friend can see the dead one and they have to figure out a bunch of stuff and there’s drama etc, I think it was one blonde and one brunette. It had a plot twist at the end as well.\n\nEdit: it was a limited series!",
        "upvotes": 8,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1j8owc5/what_show_am_i_thinking_about/"
    },
    {
        "id": "1j93hqj",
        "author": "KhajiitHasWares2077",
        "title": "Standard With Ads Locked Content Eventually Unlock?",
        "content": "Pretty straightforward but I got the standard with ads tier so my wife and I can watch the new John Mulaney Everybody is Live Show. I was told certain content like The Walking Dead, The Good Place and Peaky Blinders were locked but I currently have full access to these shows. On the other hand some things like The Hateful Eight Extended and Baby Driver are locked which is a bummer but since the previously locked content I mentioned before are now available, does that mean Netflix is able to roll out unlocks to specific content eventually? And if so is there a certain pattern to when a new wave of unlocks occur?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j93hqj/standard_with_ads_locked_content_eventually_unlock/"
    },
    {
        "id": "1j925gp",
        "author": "cniniq",
        "title": "error while trying to watch downloaded episodes",
        "content": "okay so my internet has been trash lately and i downloaded a episode of oshi no ko a while back and earlier i started watching the first episode and all was fine but then i clicked off it to go shower and when i came back and tried to put it back on the error in the screenshot showed up what should i do? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j925gp/error_while_trying_to_watch_downloaded_episodes/"
    },
    {
        "id": "1j8ebhl",
        "author": "cuzforwhy",
        "title": "Recommend Netflix shows or movies for a dental office",
        "content": "I work in a dentist office and I like to keep the tv in my operatory on, most of my patients are older folks and I need some Netflix shows or movies to play throughout the day that are appropriate and don’t have any awkward sex scenes or something, thank you.😂",
        "upvotes": 45,
        "comments": 89,
        "media": null,
        "permalink": "/r/netflix/comments/1j8ebhl/recommend_netflix_shows_or_movies_for_a_dental/"
    },
    {
        "id": "1j91ang",
        "author": "tiemeupinribbons",
        "title": "Issue with WWE RAW playback - UK Netflix",
        "content": "I’m watching March 10’s event, but the playback starts midway through, right at The Judgement Day’s skit (for lack of a better word), skipping some early matches. The show still has the “previously streamed live” tag instead of the “edited” tag.\n\nIs this an editing error, or is anyone else seeing the same issue?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j91ang/issue_with_wwe_raw_playback_uk_netflix/"
    },
    {
        "id": "1j89yi7",
        "author": "Josh1923",
        "title": "American Manhunt: Osama bin Laden",
        "content": "Just spoke with support and they’re saying there’s no official release date. This is annoying ",
        "upvotes": 71,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1j89yi7/american_manhunt_osama_bin_laden/"
    },
    {
        "id": "1j8rogr",
        "author": "United-Break-5156",
        "title": "Shows like With Love, Meghan?",
        "content": "If you didn't like the show, just keep scrolling. But it made me really happy and was just a sweet calming joyful show to watch, but I ran out of episodes! Can anyone recommend similar shows to try?\n\nTIA!",
        "upvotes": 2,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1j8rogr/shows_like_with_love_meghan/"
    },
    {
        "id": "1j951j5",
        "author": "Alan_Stamm",
        "title": "'Let us rejoice:' Everybody's Live with John Mulaney Again [12-week series starts March 12]",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j951j5/let_us_rejoice_everybodys_live_with_john_mulaney/"
    },
    {
        "id": "1j8n21s",
        "author": "brownniteowl_31",
        "title": "Funny shows on Netflix",
        "content": "Need recommendations for the days I’m too tired to socialize or come to the phone \nNothing overly vulgar please \nLove anything that’s animated but not picky ",
        "upvotes": 6,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1j8n21s/funny_shows_on_netflix/"
    },
    {
        "id": "1j8qawp",
        "author": "MysteriousDelay6266",
        "title": "The Lady's Companion | Official Trailer | Netflix",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j8qawp/the_ladys_companion_official_trailer_netflix/"
    },
    {
        "id": "1j8x0l6",
        "author": "bilbodraggins22",
        "title": "Deleting profiles",
        "content": "This might be common sense  but just installed netflix on a tablet if I delete the other profiles and leave just the kids profile will it affect other devices? ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j8x0l6/deleting_profiles/"
    },
    {
        "id": "1j8ly56",
        "author": "SquareDrive45",
        "title": "What is this DV5 Codec on some Netflix 4k SDR movies?",
        "content": "These are the \"information\" pages while streaming those movies on Netflix app on LG OLED TV. These are 4k SDR movies (i repeat NOT DV). Pulled up the info page for some other 4K movies as well and they say codec AV1 or HEVC, which are well known.\n\nBut what is this DV5 codec that netflix is using? Its own? A modified version of any other codec? Couldn't find any info on internet.",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1j8ly56/what_is_this_dv5_codec_on_some_netflix_4k_sdr/"
    },
    {
        "id": "1j90v1s",
        "author": "jackanory2021",
        "title": "why do videos speeding up before scene change/ads?",
        "content": "The frame rate seems to speed up/skip when scenes change in TV shows, or just before adverts. This happens consistently with the last second or 2 before the cut. Why is this? Can it be fixed? Happens on other streaming services too.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j90v1s/why_do_videos_speeding_up_before_scene_changeads/"
    },
    {
        "id": "1j8v4x6",
        "author": "MysteriousDelay6266",
        "title": "The Dad Quest | Official Trailer | Netflix",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j8v4x6/the_dad_quest_official_trailer_netflix/"
    },
    {
        "id": "1j8v43j",
        "author": "YuGiOh1991",
        "title": "How Riot and Fortiche made  Making of Arcane",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j8v43j/how_riot_and_fortiche_made_making_of_arcane/"
    },
    {
        "id": "1j8nr9o",
        "author": "lucivero",
        "title": "Netflix keeps lowering quality in Brave browser, refuses to work at all in another browser or the app",
        "content": "Heya,\n\n  \nBeen having these issues for a while now, and can't seem to find a permanent fix for them:  \nWhenever I play Netflix in Brave (Chromium based browser) the quality lowers repeatedly once every \\~10 seconds, the quality gets lowered every \\~10 seconds in this order:  \n1080 -&gt; 720 -&gt; 540 -&gt; 432 -&gt; 342\n\nThis is exclusively with Hardware acceleration disabled (which I have to have off more often than not as it causes other issues at times), and if there's a solution for the above where I can leave it off that'd be grand. I could live with having to relaunch the browser for this (probably) but would prefer a permanent fix that doesn't require this as it can be a bit of a pain and feels unnecessary.\n\n  \nAs for the other issue: \n\nI am completely unable to use Netflix in any other browsers or in the app:  \nThey will forcibly log me out upon starting a video, it doesn't even get to play a single frame, usually accompanied with an UI3012 error code, or it just hangs on the loading symbol and a black screen forever. I'm always logged out of the app/browser (Edge) no matter if I signed in 5 seconds before upon restarting it or even hitting the home button.\n\n  \nThe only thing I can come up with is that it's somehow related to being Windows 11 Pro N, but I couldn't find anything regarding that and Netflix having issues when I googled just now (googling for Windows 11 Pro N seems to basically ignore the N part). \n\nHardware acceleration enabled and disabled makes no difference for this issue.\n\n  \nHoping someone knows a fix for either or both of these issues!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j8nr9o/netflix_keeps_lowering_quality_in_brave_browser/"
    },
    {
        "id": "1j8iati",
        "author": "AggravatingShow2028",
        "title": "Beauty in Black—what!!!",
        "content": "So I’m late to the game but I just binged both parts of Beauty in Black and WHAT!! I need season 2 now! Idk what I was expecting but it had me up all night trying to finish. I love Charles btw.",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1j8iati/beauty_in_blackwhat/"
    }
]