[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 2,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 13,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1r3plwr",
        "author": "Accurate-Ad-5223",
        "title": "La cazzo di GTT",
        "content": "Ragazzi: ma è possibile che la GTT mi chieda il biglietto quando sono già scesa dal bus? So che è parte del loro regolamento, ma il fatto che una cosa sia \"codificata\" non la rende più legittima, al massimo ne fa un abuso di potere istituzionalizzato. Cioè ma cazzo, un ragazzo stava correndo verso la stazione perché evidentemente gli partiva il treno, e sto pirla del controllore gtt gli si parava davanti e non lo lasciava andare, gli ha pure schiacciato in faccia il suo cazzo di distintivo. NON FUNZIONA COSI'. Se di pomeriggio un carabiniere mi chiede se di mattina indossavo la cintura in macchina, io posso dirgli di no e lui non può farmi la multa. Devi cogliermi sul fatto! E se io avessi già buttato il biglietto gtt? Avete dei servizi di merda, sempre in ritardo, macchinette rotte, pochi mezzi e bus impallati di gente. Vaffanculo se non pago il biglietto per non fare due cazzo di fermate. Salvini merda",
        "upvotes": 20,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1r3plwr/la_cazzo_di_gtt/"
    },
    {
        "id": "1r3lc6f",
        "author": "Naso_Coraggioso",
        "title": "Anche a Torino nelle Olimpiadi del 2006 c'era la stessa euforia che c'è per Milano-Cortina 2026 ?",
        "content": "",
        "upvotes": 17,
        "comments": 34,
        "media": null,
        "permalink": "/r/torino/comments/1r3lc6f/anche_a_torino_nelle_olimpiadi_del_2006_cera_la/"
    },
    {
        "id": "1r3u3q1",
        "author": "_Kacchan__",
        "title": "Corso Pizzaiolo",
        "content": "Ciao ragazzi,  \ncome da titolo, qualcuno ha fatto un corso che consiglia a Torino?  \nE' da un po' che ho il pallino, e adesso che ho un po' di tempo libero vorrei farlo.  \nGrazie!",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1r3u3q1/corso_pizzaiolo/"
    },
    {
        "id": "1r3qrdh",
        "author": "Project-PhoenX",
        "title": "Quanto tempo spendiamo a trovare un parcheggio?",
        "content": "Ciao a tutti,  \nho creato un questionario anonimo sul tema parcheggio/tempo perso.  \nSe vi va di partecipare:  \n[https://survey.cloud-ixio.net/index.php/716789?lang=it](https://survey.cloud-ixio.net/index.php/716789?lang=it)",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1r3qrdh/quanto_tempo_spendiamo_a_trovare_un_parcheggio/"
    },
    {
        "id": "1r3tqxr",
        "author": "SpeakerEven6320",
        "title": "Nasty Club domani 14/02",
        "content": "Ciao, sono un ragazzo di 25 anni, qualcuno vorrebbe venire domani sera al Nasty Club?\n\nPreferibilmente ragazzi (maschi) dai 20 ai 27/28 anni, però dipende se si fa gruppo va bene chiunque.\n\nChi interessato può scrivermi in privato, grazie. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1r3tqxr/nasty_club_domani_1402/"
    },
    {
        "id": "1r2wte6",
        "author": "sbrodolino_21",
        "title": "Senso del biglietto GTT da 7,80€",
        "content": "Un biglietto giornaliero costa 3,70€. 3,70 x 2 = 7,40€.\nQual è dunque l'utilità del biglietto da 48h a 7,80€? Sfugge qualcosa a me?",
        "upvotes": 69,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1r2wte6/senso_del_biglietto_gtt_da_780/"
    },
    {
        "id": "1r3ll1c",
        "author": "yashonredit",
        "title": "Mask for masquerade ball",
        "content": "Where can I find cheap masks for masquerade ball?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1r3ll1c/mask_for_masquerade_ball/"
    },
    {
        "id": "1r3lrww",
        "author": "No_Dark7733",
        "title": "Giro carino per San Valentino a Torino",
        "content": "Ciao a tutti,  \ncome scrivo da titolo \"sto inguaiato\". Come ogni anno mi trovo ad organizzare San Valentino l'ultima settimana, ovviamente è tutto stra pieno: facciamo i fighi che San Valentino non ci interessa, ma memore di tutti quelli passati in solitaria quando si era single, mi si tocca una debolezza a cui fatico tenere a bada. QUALCOSA DEVO ORGANIZZARE. Lo so è egositico, non giudicatemi troppo. Prima o poi mi passerà.  \nChiedo dunque parere per questo programma:  \nsiamo di Varese ed in meno di 2h saremmo  a Torino per le 20.30 circa, stavo pensando a questo giro sperando di salvarmi anche quest'anno:\n\nArriviamo a Torino e andiamo diretti al **Monte dei Cappuccini** per goderci 20–30 minuti di panorama e tranquillità insieme (magari mi porto una bottiglia di prosecco).  \nA piedi scendiamo poi verso **San Salvario** dove possiamo, spero, trovare facilmente un posto senza prenotazione per cenare o bere qualcosa.  \nDopo facciamo una passeggiata serale in **Piazza Vittorio Veneto** e lungo il Po, che di notte è molto suggestivo.  \nChiudiamo la serata con un cocktail o un dolce caldo in un locale intimo del centro, senza fretta.  \nÈ una roba un po' misera? Di base spendere non sarebbe un problema  (nel limite di un accordo già preso con la mia dolcissima metà di tenerci i soldi per le vacanze e non per sta festa), ma cazzarola è tutto stramaledettamente occupato! Inoltre volevo evitare il casino di Milano che nè io nè lei non sopportiamo più.  \nAvete qualche consiglio?  \nGrazie in anticipo.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1r3lrww/giro_carino_per_san_valentino_a_torino/"
    },
    {
        "id": "1r2nxrb",
        "author": "nazarthinks",
        "title": "Totally useless English interface in this GTT terminal",
        "content": "",
        "upvotes": 81,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MnlmazluZGt2MGpnMbEmHAdUL-FYl291wGWXNugHxZPr_wO623gq9VzLGEMH.png?auto=webp&amp;s=b42b0d1104a0efc87bba50eec37d4e86c68677c6"
        },
        "permalink": "/r/torino/comments/1r2nxrb/totally_useless_english_interface_in_this_gtt/"
    },
    {
        "id": "1r3i02u",
        "author": "jhndoe__",
        "title": "La Morra info",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1r3i02u/la_morra_info/"
    },
    {
        "id": "1r3rswm",
        "author": "Putrid-Physics-7285",
        "title": "Petizione Kid Yugi",
        "content": "Upvotare se si è rimasti delusi dal fatto che Kid Yugi ha escluso Torino dal suo tour nei palazzetti.\nFacciamo più upvote possibili in modo che gli arrivi e che cambi idea.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1r3rswm/petizione_kid_yugi/"
    },
    {
        "id": "1r2zmsb",
        "author": "garypaytontheglove20",
        "title": "Consigli su dove comprare casa in provincia di Torino con budget max 70k?",
        "content": "Ciao a tutti,  \nscrivo perché sto cercando di fare un po’ di ordine mentale e magari qualcuno qui può darmi uno spunto interessante. \n\nHo 44 anni, lavoro a Grugliasco, mia moglie lavora in zona Rivoli. Abbiamo un figlio piccolo. Attualmente siamo in affitto e tra affitto, spese condominiali e varie arriviamo tranquillamente intorno ai 900–1000 € al mese. La situazione affitti è diventata piuttosto pesante, quindi sto iniziando a valutare seriamente l’acquisto.\n\n   \nNon credo di potermi spingere oltre i 70.000 € di prezzo d’acquisto. Forse 75k tirando tanto la corda, ma vorrei restare prudente. Abbiamo un po’ di liquidità per anticipo e spese, ma non parliamo di cifre enormi. L’idea è fare un mutuo sostenibile senza impiccarmi per 30 anni con l’ansia.\n\nAltri dettagli importanti:\n\n* Lavoro a Grugliasco, quindi idealmente zona ovest/sud-ovest sarebbe più comoda.\n* Mia moglie al momento non ha la patente (la sta prendendo), quindi per ora dipendiamo molto dalla logistica.\n* Non siamo legati per forza alla cintura stretta tipo Rivoli/Collegno, anzi, se trovassi una casa bella e grande potrei anche accettare 35–40 minuti di macchina.\n* Non mi interessa Torino città, onestamente non mi fa impazzire e i prezzi nelle zone “decenti” sono comunque alti.\n\nMi sto guardando intorno un po’ ovunque:  \nVal di Susa, Valli di Lanzo, zona Pinerolo, direzione Carmagnola, verso Asti… ma faccio fatica a capire quali posti siano un buon compromesso tra:\n\n* prezzo case\n* qualità della vita\n* servizi minimi (scuole, supermercato, farmacia)\n* tempi reali di percorrenza verso Grugliasco/Rivoli\n\nNon cerco il paese perfetto, ma nemmeno un posto totalmente isolato dove ogni cosa è a 20 minuti.\n\nDomande per voi:\n\n1. Se aveste un budget massimo di 70k e lavoraste in zona Grugliasco, dove guardereste?\n2. Ci sono paesi che hanno ancora prezzi umani ma che non siano completamente “morti”?\n3. Qualcuno vive in posti tipo Lanzo, Villafranca d’Asti, zona Pinerolo, ecc.? Come vi trovate davvero nella vita quotidiana?\n4. C’è qualche zona che secondo voi è sottovalutata ma interessante?\n\nAccetto consigli, anche controintuitivi    \nSe devo fare il sacrificio dei 40 minuti, vorrei farlo per una casa che mi piace davvero, non per una mansarda che già so che non è casa mia.\n\nGrazie a chi avrà voglia di rispondere  ",
        "upvotes": 10,
        "comments": 25,
        "media": null,
        "permalink": "/r/torino/comments/1r2zmsb/consigli_su_dove_comprare_casa_in_provincia_di/"
    },
    {
        "id": "1r29uzr",
        "author": "KillerBossOriginal",
        "title": "Superga il 03/02/2026",
        "content": "",
        "upvotes": 188,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1r29uzr/superga_il_03022026/"
    },
    {
        "id": "1r3b1xt",
        "author": "ryu468",
        "title": "any local clothing stores with decent quality?",
        "content": "Hi all! I'm an exchange student and just arrived in Turin. It's my first time here and in Europe. I've been trying to find some nice clothing stores that are local and not a chain (like Zara), but lots of recommendations I've seen on Reddit are either for men or from many years ago. \n\nDoes anyone have any suggestions? Would you suggest the Balon market or Mercato di Piazza Benefica is also good for finding decent quality but affordable clothes? I also can not speak Italian (am trying to learn!!) so if you think online shopping is better, let me know any websites!\n\nGrazie mille!",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1r3b1xt/any_local_clothing_stores_with_decent_quality/"
    },
    {
        "id": "1r33ff5",
        "author": "iruoo",
        "title": "Orange cigna, è sicura ?",
        "content": "Ciao ragazzi vorrei andare in questa palestra ma ho paura per la zona, essendo vicina a barriera\n\nLa considerate sicura ? Secondo voi avrei problemi ad andare in palestre 3 volte a settimana in bici più o meno la mattina ? Ho paura mi rubino la bici in 2 secondi, e penso non ci sia un parcheggio della palestra purtroppo... Se mi dite che le rubano facilmente penso che dovrò andare in bus o a piedi, ma in bici sarebbe stato molto comodo\n\nPoi chiedo in generale anche per la sicurezza, ma presumo chendi mattina non sia pericoloso o sbaglio ?",
        "upvotes": 0,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1r33ff5/orange_cigna_è_sicura/"
    },
    {
        "id": "1r31vdx",
        "author": "TroubleDesigner5441",
        "title": "Aiutatemi a trovare un portafoglio per la mia mamma",
        "content": "Ciao a tutti, sapete dove posso trovare dei bei portafogli (magari in pelle, ma non necessariamente) a Torino centro? Mi piacerebbe ricevere consigli per negozietti, ma anche catene di negozi che vendono bei portafogli, con un budget di 50 euro. La mia mamma ha il portafoglio tutto rovinato e ne vorrebbe uno per il compleanno! \n\nGrazie a chi risponderà 🥰",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1r31vdx/aiutatemi_a_trovare_un_portafoglio_per_la_mia/"
    },
    {
        "id": "1r2udec",
        "author": "FrequentSet1969",
        "title": "Where to find Rock/Metal Cds",
        "content": "I am going to torino next week for a couple of days and i am looking for a place to buy music cds specially rock/metal where can i find these is there any shop that i can find lots of cds?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1r2udec/where_to_find_rockmetal_cds/"
    },
    {
        "id": "1r2smlg",
        "author": "lospavaldo",
        "title": "cerco amicizie",
        "content": "io ho 18 anni e mi piacerebbe conoscere nuove persone di torino o ditorni.\n\nmi piace quasi tutti i generi di musica,l arte e leggere e sopratutto la montagna\n\ncome dal titolo cerco amici con cui fare progetti futuri tipo organizzare trekking,viaggi in bici o altre attività ma anche uscire in citta ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1r2smlg/cerco_amicizie/"
    },
    {
        "id": "1r25ugv",
        "author": "McNukestm1337",
        "title": "Foto scattate senza consenso",
        "content": "Salve redditors torinesi\nOggi mentre mangiavo tranquillamente in via Garibaldi un tipo mi ha fatto delle foto senza il mio consenso e ovviamente gli ho detto di cancellare. Ora non so se le ha eliminate tutte, ma in ogni caso voglio fare questo post per dire in generale di fare attenzione se vedete un signore di mezza età, pelato, occhi chiari e denti leggermente separati tra loro farvi delle foto perché onestamente a me ha decisamente infastidito questa mancanza di rispetto della mia immagine, soprattutto considerando che erano solo primi piani della mia faccia, e non, ad esempio degli shot in cui ero di sfondo.\nSe avete anche dei consigli legali su come muovermi sono ben accetti ✌️stay safe✌️\n\nEdit: grazie mille dei consigli raga &lt;3 ",
        "upvotes": 41,
        "comments": 64,
        "media": null,
        "permalink": "/r/torino/comments/1r25ugv/foto_scattate_senza_consenso/"
    },
    {
        "id": "1r2oufu",
        "author": "Specialist-Cold-1459",
        "title": "Scuole elementari valide in zona Precollina, Cavoretto, Ponte Isabella, Corso Sicilia",
        "content": "Ciao a tutti,\n\nvorrei sapere la vostra opinione e consigli sulle scuole elementari (private e non) delle zone sopra citate. \n\n  \nConsigliereste qualche scuola in particolare? Se sì, perché?\n\n  \ngrazie!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1r2oufu/scuole_elementari_valide_in_zona_precollina/"
    },
    {
        "id": "1r2jh5e",
        "author": "PatternLegitimate169",
        "title": "Does poliTo result come out earlier than march? Had question regarding MOI",
        "content": "Hi everyone,\n\nI applied for a Master’s program at PoliTO and saw that the official results date is March 31. I was wondering if anyone has ever received their evaluation result earlier than the announced date.\n\nAlso, I realized after submitting my application that I forgot to upload my Medium of Instruction (MOI) certificate. However, my undergraduate degree is from a university in the United States, and I did upload my transcript and completed the application submission.\n\nDoes PoliTO usually request the MOI later if needed, or could this delay my evaluation?",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1r2jh5e/does_polito_result_come_out_earlier_than_march/"
    },
    {
        "id": "1r2fjrw",
        "author": "CieloeMare",
        "title": "Real Estate Fees",
        "content": "Hi,\nWhy are agency fees in Turin so insanely high? Two months’ rent as a minimum? For example, for a two-room apartment you’re expected to pay €2,000 just to the agency. For what exactly?\n\nThere’s already huge demand and rents are high due to demand. Apartments get rented immediately. People are literally lining up. It’s not like agencies have to struggle to find tenants. Also they work for the owner but tenant pays them.\n\nSo why are tenants paying the equivalent of two months of living just for someone to open a door and send a contract?\n\nThey make no contribution to the society or the country, no expenses, little offices, egoist and rude attitude, make tons of money for nothing... \n\nIt honestly feels like a real estate agency kingdom here.\n\n",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1r2fjrw/real_estate_fees/"
    },
    {
        "id": "1r22phn",
        "author": "walk_onthewild_side",
        "title": "Posti Viet dove mangiare la Pho soup o il Banh mi?",
        "content": "Ciao! 👋 Qualcuno mi sa consigliare un posto buono dove mangiare cucina vietnamita a Torino? Non so se sia l’inverno ma muoio dalla voglia di zuppe. 🌧️\n\nVa bene anche se non è vietnamita, cerco zuppa con brodo veramente ottimo, che sia:\n\n✔ Vietnamita (tipo pho)\n\n✔ Cinese con lamian tirati a mano o noodles di patate dolci in brodo\n\n✔ Giapponese (ramen)\n\n✔ Coreana (tipo ramyeon)\n\n✔ Thailandese o anche italiana/slava, purché la zuppa sia top 🍲\n\nGRAZIEEEE",
        "upvotes": 2,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1r22phn/posti_viet_dove_mangiare_la_pho_soup_o_il_banh_mi/"
    },
    {
        "id": "1r1ubbu",
        "author": "General-Builder-2322",
        "title": "Affitti Torino",
        "content": "Ciao a tutti, stavo pensando di trasferirmi a Torino. Volevo sapere com’è la situazione degli affitti.\n\nSono M33 con partita IVA, lavoro da remoto. Fatturo poco purtroppo, ma ho molti soldi da parte.\n\nHo vissuto a Bologna e lì la gestione è disastrosa: non riuscirei a trovare casa facilmente. Attualmente sono al sud.\n\nCerco singola/monolocale/bilocale max 700-800€ tutto incluso, ideale sui 600€.\n\nIl mio problema è la partita IVA: so che è mal vista, ma i soldi li ho. Sono disposto a pagare 5-6 mesi di anticipo.\n\nConsigli ?",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1r1ubbu/affitti_torino/"
    },
    {
        "id": "1r1u5vv",
        "author": "Cassidy_Tyler",
        "title": "Cercasi Chitarrista",
        "content": "Ciao a tutt\\*!  \nLa mia rock band BlackRail (già abbastanza avviata al momento con uscita del primo EP a Marzo) sta cercando un secondo chitarrista da aggiungere alle nostre fila!   \nSe sapete suonare e se vi piace il genere heavy/classic rock e se avete più di 18 anni, palesatevi! ",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1r1u5vv/cercasi_chitarrista/"
    },
    {
        "id": "1r1vdbn",
        "author": "New-Trifle-7544",
        "title": "Compagni di studio",
        "content": "Ciao! Sono una fuorisede a Torino al primo anno di Magistrale!\n\nGli esami si avvicinano e mi chiedevo se in questa fredda città ci fosse qualcunə interessato a studiare insieme!",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1r1vdbn/compagni_di_studio/"
    },
    {
        "id": "1r1rzsy",
        "author": "AnalysisOk7862",
        "title": "Rave",
        "content": "Cosa ne pensate dell’audiodrome? Organizza belle serate?",
        "upvotes": 1,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1r1rzsy/rave/"
    },
    {
        "id": "1r1v727",
        "author": "kacokaj_kejdis",
        "title": "Qualcuno sa dirmi qualcosa di questo signore?",
        "content": "L'ho incontrato in zona porta palazzo e dice un giorno migliore e chiede soldi e infastidisce ,nel giusto a livello legale secondo me, le ragazze e dice di chiamarsi Ignazio",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1r1v727/qualcuno_sa_dirmi_qualcosa_di_questo_signore/"
    }
]