[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 8,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 123,
        "comments": 381,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mtlxtl",
        "author": "SplitNational2929",
        "title": "KPop Demon Hunters Is About to Become Netflix’s Biggest Movie of All Time",
        "content": "",
        "upvotes": 1130,
        "comments": 115,
        "media": null,
        "permalink": "/r/netflix/comments/1mtlxtl/kpop_demon_hunters_is_about_to_become_netflixs/"
    },
    {
        "id": "1mtpdb6",
        "author": "Inevitable_Map4791",
        "title": "Just rewatched Enemy of the State last night,  scary how much of that feels possible now",
        "content": "Back when I first saw Enemy of the State , it felt like over-the-top Hollywood paranoia, all satellites following you in real time, phone taps in seconds, every move tracked which is very typical of the entertainment industry. Watching it again last night it feels way less like science fiction and way more like a Tuesday.  \n  \nThe wild part is we don’t even need spy satellites anymore. We hand over our locations to apps 24/7, leave microphones in our homes, and carry around devices that log everywhere we’ve been. Add in data brokers, security cameras on every corner, and facial recognition in half the apps we use, and you’ve basically got the same surveillance net the movie warned about. Made me super anxious last night about my own data, I don't get spam calls much but I get lots of promotional offers in my mail from places I haven't even heard of. Data gets sold online all the time and it's probably in the subscription agreement if anyone ever read it but is there a way to take these off for sure? It's the internet and nothing truly gets deleted but at least make it less visible. Would appreciate anyone knowing more than I do to tell me how I could try and track and maybe delete my data online.",
        "upvotes": 51,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mtpdb6/just_rewatched_enemy_of_the_state_last_night/"
    },
    {
        "id": "1mtzjia",
        "author": "Intro-Nimbus",
        "title": "What happened to Wednesday?",
        "content": "It's so.. off.  \nIt's completely lost the vibe of the old series and the movie. Gomez is the worst cast I've seen in a long time, Morticia is completely at odds with her mother and daughter.  \nThey're a school of misfits, yet everyone seem to react just like normies to things like eyeballs and murder - Fester thankfully being his old self is the exception.  \nWe have completely ridiculous subplots with competitions vs scouts acting like a parody of marines, that seem to be written for an audience of 4-year olds. There are numerous silly subplots that go literally nowhere.\n\nI fell like I'm watching random scenes from kids movies about summer camp and school, except the dialogue was better in the shows that focused on 7-year olds.\n\nThe dialogue is terrible, it's convoluted and everyone talks like a try-hard emo.\n\nNot to mention the constant exposition, is the target audience persons suffering from loss of short-term memory?\n\nIt is atrocious, I want to like it but it is a burning file of poo.",
        "upvotes": 14,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1mtzjia/what_happened_to_wednesday/"
    },
    {
        "id": "1mtkdcg",
        "author": "BoredPandaOfficial",
        "title": "New Netflix doc claims \"The Biggest Loser\" did more harm than good as former contestants reveal PTSD",
        "content": "",
        "upvotes": 66,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1mtkdcg/new_netflix_doc_claims_the_biggest_loser_did_more/"
    },
    {
        "id": "1mte0jn",
        "author": "cute_pum",
        "title": "‘Winning Grammy will be a message to every Asian American girl who’s ever felt impostor syndrome,’ says ‘Golden’ songwriter Ejae",
        "content": "Review from a non-kpop fan:\n\nHeard about Kpop demon hunters from a friend. Neither of us watched it and we're not really into Kpop. But we're both from Toronto and thought it was cool the director was from there. I myself like art as well.\n\nAfter watching film, it was easy to follow, fun movie. Not heavy on plotline but animations, colours, music was pretty awesome.\n\nLooking into the history and BTS of the film was what really caught me (hence sharing article). So much respect for the teamwork, thought and intention.\n\nFelt like it's a milestone for many of us who didn't make it in something but the alternative path brought us towards something we'd never imagined. Overcoming our battles and demons and bringing in a new version of ourselves.\n\nSo glad for this film's success and everyone involved 💯🙏👏\n\nP.s. yes you should watch this masterpiece 👌",
        "upvotes": 152,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1mte0jn/winning_grammy_will_be_a_message_to_every_asian/"
    },
    {
        "id": "1mu4eu1",
        "author": "m3n00bz",
        "title": "Netflix letting kids upgrade plans.",
        "content": "I kept getting upgraded from free ad supported from my T-Mobile plan to the $25 4k premium and couldn't figure out how this was happening. Well, my young child showed me that it allows him to do this when he tries to watch certain movies on his roku tv under his kid restricted account. \n\n\n It's insane that they don't require a password to upgrade the plan.  I guess I can see why this is good for Netflix but they shouldn't be allowing this without a password.  \n\nI've had a talk with my son but I'm sure he won't think twice to upgrade us again.",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1mu4eu1/netflix_letting_kids_upgrade_plans/"
    },
    {
        "id": "1mu3oqe",
        "author": "Single_Pressure9715",
        "title": "Not one lie was told here:",
        "content": "[Not really a review]\n\nThis scene literally summed up everything I had been thinking about the Byrd’s since season 2. \n\n\nEspecially Wendy. She was something else. I wish the ending had left her with another loss. I fear her brother wasn’t enough. She was too cut throat and conniving. \n\nFinally finished the series last week, still in disbelief. ",
        "upvotes": 2,
        "comments": 4,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/bz6k5dkyfvjf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1mu3oqe/not_one_lie_was_told_here/"
    },
    {
        "id": "1mtzzpp",
        "author": "tahami_allthemeals",
        "title": "Netflix thinks I’m in a different country",
        "content": "All of a sudden it thinks I’m in Czechia? (I’m not).  I followed all the help center guidelines but no luck, and their support has nooo idea and just keeps sending me support articles in email. Has anyone had this happen? ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mtzzpp/netflix_thinks_im_in_a_different_country/"
    },
    {
        "id": "1mu4mp4",
        "author": "Cyno237",
        "title": "I can't get Netflix to high quality",
        "content": "I just bought a premium plan on Netflix,but I can't get higher resolution  than 1080p on my 4k monitor I tried to use the windows app ,nothing tried to change the playback settings nothing again.Does anybody know what the problem is and how I can fix it?\n                 \n                                                                                    \n                                       ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mu4mp4/i_cant_get_netflix_to_high_quality/"
    },
    {
        "id": "1mtun5m",
        "author": "Virtual-Cheesecake71",
        "title": "The echos of survivors: inside Korea's tragedies",
        "content": "20 mins in and I stopped watching. \n\nI want to know more about what happened but I don't think I can't handle it. I feel that since becoming a parent, watching or even reading about any form of child abuse is extra triggering.\n\nThis might be one of the toughest to watch documentaries for me to date. \n\nAny documentary that had this effect on you where you just couldn't finish due to the subject being so traumatizing?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mtun5m/the_echos_of_survivors_inside_koreas_tragedies/"
    },
    {
        "id": "1mu23b3",
        "author": "KookieMoonster16",
        "title": "Dubbed shows with original songs?",
        "content": "So as most people these days, my little sister is obsessed with Kpop Demon Hunters and keeps watching it again and again.\n\nProblem is, she doesn't know how to read yet and we don't like the other versions of the songs, so I keep having to switch back and forth from English to our language. Is there any way to watch it where the talking is dubbed but the original songs still play?\n\nI don't really get why they made translated songs for the dubs, we've watched plenty of other movies where they keep the original songs and they fit the show way better anyway.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mu23b3/dubbed_shows_with_original_songs/"
    },
    {
        "id": "1mu1wih",
        "author": "Particular-Count3003",
        "title": "Four Seasons negativity towards women Spoilers",
        "content": "I found Four Seasons entertaining and liked all of the characters but it left me very depressed on how older women were portrayed. Is this how life after fifty goes? \nFirst,  we have Nick leave his very sweet, pretty wife so he can relive his youth. I wasn’t  hoping for a Betty Broderick type reaction from Ann but the whole situation seemed very unrealistic. That divorce would drag on and on and she wouldn’t have carte blanch to his credit cards. So Nick, who doesn’t seem that rich, attracts the young girl and what does he do? He gets her pregnant. Is midnight feedings more fun than Ann’s midnight video games?\nMaybe I just liked Ann too much because here is Nick with this attractive young blond and who does Ann attract? Not the hot surf instructor but instead a bald, wrinkled up weirdo. This is when I said you know I don’t think I really like where this show is headed. \nNow Nick dies, the show is finally picking up in the karma department and surprise, surprise, poor Ann is saddled with planning his funeral. Why doesn’t his adult daughter, who is falling all over new girl friend within six hours of knowing her, plan the funeral. \nEvery time young girlfriend Ginny fiddled with her necklace I was furious. It’s not like it was an engagement ring. I really disliked how easy breezy these May December romances can be. \nI guess Liz Lemon’s character was the most realistic but the frumpy bathing suit was annoying. Come on Liz, we know there’s a great body under there and you don’t need to wear long sleeve suits. Fine you don’t want sun burn but juxtaposed next to Ginny’s matching bikini, the message seemed to be, over fifty women need to cover up their bodies. More evidence of this was poor Ann’s beach outfit choices and she looked pretty hot in that wedding dress so what gives with the caftan? \nSo I don’t think I will be watching season two, especially if it includes poor Ann babysitting Nicks love child. 🤮\n",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mu1wih/four_seasons_negativity_towards_women_spoilers/"
    },
    {
        "id": "1mtukvj",
        "author": "ThomasOGC",
        "title": "House of Guinness: Netflix’s New Historical Drama | CGO",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mtukvj/house_of_guinness_netflixs_new_historical_drama/"
    },
    {
        "id": "1mtsf3u",
        "author": "tanned_saphire",
        "title": "Can I get Recommendation for series like YOU with the main lead having dark thoughts and depth in character?",
        "content": "I finished watching YOU. Can I get recs for some other similar shows on Netflix with male lead having dark character and depth ? I was thinking of Dexter but other recs are welcome too. ",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1mtsf3u/can_i_get_recommendation_for_series_like_you_with/"
    },
    {
        "id": "1mtxql2",
        "author": "Other_Selection8858",
        "title": "What do you guys think or feel about the “specialty” Netflix rows/carousel",
        "content": "Do we think they are relevant? Sometimes I see some rows that are geared towards specific topics on other people’s account and not mine. Is there a way to “unlock” them, I was just curious.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mtxql2/what_do_you_guys_think_or_feel_about_the/"
    },
    {
        "id": "1mtao2c",
        "author": "cubiclecx",
        "title": "Netflix crack down on account sharing",
        "content": "I’m so sick of corporations making the experience more annoying/difficult just so they can gouge money from people. \n\nI live with my mom and use her netflix, I pay for some services and she pays for some and we share at our house. I recently went on a little vacation for and tried using netflix on my phone but it was saying I wasn’t “part of the household account” the thing is I don’t have her email and can’t ask her to look and send me the code in the middle of the night for her. \n\nThat’s not even the most annoying part, I get home and again while she’s sleeping I want to watch netflix on my phone but I’m still “not part of the household account” even when I’m connected to the wifi and again i’m not gonna wake her up for this so now I can’t use netflix? \n\nI get it’s a small issue but cmon I used to use netflix at ease and now I’m constantly battling how many screens are watching when I try switching from the TV to my phone and not even having access because I left for two days… streaming services are getting out of hand and we’ve been thinking of cancelling since my sister who left for college across the state cant use netflix anymore without them asking for more money. god forbid poor people enjoy things. ",
        "upvotes": 14,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1mtao2c/netflix_crack_down_on_account_sharing/"
    },
    {
        "id": "1ms9tim",
        "author": "Upset-Flower-148",
        "title": "The stupid household thing should be illegal and it is infuriating",
        "content": "Netflix uses your wifi to know if you are home. What if I have a kid in college across the country? What if my parents want to use my account and live across town? \nWhy the heck should I not be able to share MY account which I PAID for with anyone I want?\nA limit on the number of accounts makes sense but who cares on the location!?\n\nIt’s an obvious money grab and they have literally said in the past “true love is sharing your Netflix password” \n\nTalk about a 180. \n\nIt is infuriating. \n\nThis is just one of the things I added to my consumer protection law draft I am sending to my congressman. \n\nThen they “let you” add a person like they are benevolent and we should be thankful to spent $8 EXTRA!? Maybe if it was $1 I would understand but the entire software industry is infuriating on how much of a cash grab it is. ",
        "upvotes": 2060,
        "comments": 325,
        "media": null,
        "permalink": "/r/netflix/comments/1ms9tim/the_stupid_household_thing_should_be_illegal_and/"
    },
    {
        "id": "1msz9t7",
        "author": "huds0",
        "title": "Dept Q - Why was Merritt so dirty??",
        "content": "I enjoyed the show, despite all the plot holes and confusing timelines. But the one thing that drove me nuts is: \n\nWhy the heck was Merritt always filthy? They showed her showering multiple times, but her face always looked like she just finished a shift as a chimney sweep. \n\n🤷‍♀️",
        "upvotes": 30,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1msz9t7/dept_q_why_was_merritt_so_dirty/"
    },
    {
        "id": "1mt9ow2",
        "author": "Thetrucker5",
        "title": "Screen mirroring",
        "content": "Why would Netflix stop allowing screen mirroring, all I’m trying to do as a truck driver is mirror my phone to the tv in my truck so I can have a larger screen, I have unlimited data but not unlimited hot spot, are they trying to loose even more customers ",
        "upvotes": 7,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1mt9ow2/screen_mirroring/"
    },
    {
        "id": "1mt97dc",
        "author": "mallardducky",
        "title": "Took a bad AppleTV app and made it worse…",
        "content": "How on earth could they have taken a bad app and made it this much worse?  Top menu (and no easy way to get to it instantly), tiles that change side, and previews that \\*still\\* freakin’ autoplay with no way to disable it.\n\nAdd in that it continues to show the same limited number of shows/movies in all the various categories, created new ‘categories’ that are just full of garbage, and have abandoned the built-in video player for their own code, and it’s clear that they view the AppleTV as a necessary evil.\n\nI won’t even get into their refusal to play well with the overall ecosystem (that one I could deal with, if the app itself was usable, but it’s not).",
        "upvotes": 8,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1mt97dc/took_a_bad_appletv_app_and_made_it_worse/"
    },
    {
        "id": "1mtlgpi",
        "author": "ThePotatoOfTime",
        "title": "Shows from my watch list suddenly disappeared",
        "content": "I was watching the last episode of North Shore today and exited it half way through for a bit to do something else. Went back in and it just vanished before my eyes from my watch list and can't be found at all in search. Another show on my list, Inspector George Gently, has also mysteriously vanished and isn't in search. Can anyone shed any light on this? It was so sudden - one second they were both on my watch list as usual, the next they'd vanished.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mtlgpi/shows_from_my_watch_list_suddenly_disappeared/"
    },
    {
        "id": "1mtxg1j",
        "author": "FewNefariousness9381",
        "title": "TV shows with a ginger character?",
        "content": "Very odd request. I like ginger characters a lot and recently I just finished Wednesday and I LOVED Agnes. Anime is also cool with me. I really enjoyed classroom of the elite and I liked characters like Tanazaki from BSD as well so I'm pretty much just looking for more ginger characters I could obsess over. They don't have to be the MC, just someone I can get a few scenes of every now and then🙏🏼",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1mtxg1j/tv_shows_with_a_ginger_character/"
    },
    {
        "id": "1mt2lh5",
        "author": "Dotsq",
        "title": "Dark comedy is lowkey therapy",
        "content": "People think dark comedy is just “edgy jokes,” but honestly it’s way more than that.\n\nNormal comedy = you laugh at something dumb.\nDark comedy = you laugh at something painful.\n\nThat’s the magic. The moment you can laugh at shame or taboo stuff, it doesn’t crush you the same way anymore.\n\nShows like BoJack Horseman, Big Mouth, After Life (Ricky Gervais), Sex Education, Dead to Me, or The End of the F*ing World — they don’t just make you laugh, they sneak in permission to breathe. Like, “hey, the world isn’t gonna end if this embarrassing thing exists.”\n\nAnd Netflix has nailed this: some of their best comedies are hilarious and heartbreaking at the same time, showing how humor can live right next to grief, awkwardness, or chaos.\n\nSo yeah, call it what you want, but for some of us, dark comedy is therapy in disguise.\n\n⸻\n\nTL;DR: Laughing at pain makes it lighter. Dark comedy = free antidepressants.",
        "upvotes": 10,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1mt2lh5/dark_comedy_is_lowkey_therapy/"
    },
    {
        "id": "1mtsrje",
        "author": "JunkyYT",
        "title": "Should I watch you?",
        "content": "I’m thinking of watching YOU because of Elizabeth lail… but like I find the concept of stalking fun and all, what do yall think? And why is it good? I have a low attention span but I do like binging if it turns out to be good, I want your opinions on you but no spoilers please",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1mtsrje/should_i_watch_you/"
    },
    {
        "id": "1mt7yzx",
        "author": "No_Sound674",
        "title": "Is BoJack’s “The View from Halfway Down” one of the best individual Netflix episodes of all time?",
        "content": "As it’s definitely up there as one of my favorite cartoon episodes with it being how truthful and realistic it is, but also having it be BoJack’s DYING dream, I want to argue that it’s one of the best individual Netflix episodes out of any series on the platform. ",
        "upvotes": 6,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1mt7yzx/is_bojacks_the_view_from_halfway_down_one_of_the/"
    },
    {
        "id": "1mtwjy2",
        "author": "arealraccoon",
        "title": "Why is nextlix overly smoothing skin?",
        "content": "I'm trying to watch the old guard 2 and all I can focus on is the skin smoothing filter they have around Charlize Theron's cheek and smile line area in every scene, its so distracting and I've seen posts complaining about it on the new Wednesday as well. I know this is a horrible example picture but its the best I could capture compared her to usual (lovely) face. Has anyone else noticed this?",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1mtwjy2/why_is_nextlix_overly_smoothing_skin/"
    },
    {
        "id": "1mt3dgo",
        "author": "neidbrbduror",
        "title": "Guys I need some recommendations",
        "content": "I need a series or a movie about war romance kr something like the man fights and the girl keeps worrying about him and crying and when she sees him she hugs him and shut and he rescues her you know what I mean give me hundreds of recommendations deadass give me hundreds ",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1mt3dgo/guys_i_need_some_recommendations/"
    },
    {
        "id": "1mt7v8o",
        "author": "James_15625_",
        "title": "Tried Watching Saare Jahan Se Accha, ended up binging half a season of House MD",
        "content": "So I saw good reviews of this show even before it released. Thought it will have that thriller or whodonit energy and that I’ll enjoy Saare Jahan se accha. No spoilers but half into the 2nd episode I’m bored. \n\nHouse MD on the other hand - some interesting characters introduced every episode and houses resident doctors make up for the show. Not sure why Netflix is unable to make the good content again. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mt7v8o/tried_watching_saare_jahan_se_accha_ended_up/"
    },
    {
        "id": "1msc1rn",
        "author": "Low-Squirrel-4868",
        "title": "Just rewatched Catch me if you can and it got me thinking",
        "content": "I know the movie is set decades ago but watching someone pull off that level of identity theft with nothing but charm and some paperwork is wild. It made me wonder how much easier it would be today with everything being online.\n\nBack then you had to forge documents and physically be somewhere to make the scam work. Now with social media, data leaks and people oversharing, you could probably impersonate someone you have never met just by piecing together public information. Name, address, phone number, old photos, even their signature if they have posted it somewhere (I myself have never changed my phone number or email, I imagine I'm in every database online). The scary part is how official everything can look. A scammer could set up fake accounts, fake email domains, fake phone numbers, and most people would not even think twice if the message looked professional. If someone had enough of your personal data they could probably pass as you with your bank, insurance, or even your employer. That's why I'm using Cloaked just to stay safe because I'm spiraling into all of this modern day privacy stuff and it's scaryyy. \n\nI know there is places you can buy data but is there any software or method to help with this stuff? I'd like to know your opinions or advice.",
        "upvotes": 80,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1msc1rn/just_rewatched_catch_me_if_you_can_and_it_got_me/"
    },
    {
        "id": "1mt9lo1",
        "author": "AngryPig154",
        "title": "I need help finding this",
        "content": "Idk the name but I remember its part this dude he finds a ring in a house and whenever he puts it on a ghost girl appears and then they like fall in love or sum ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mt9lo1/i_need_help_finding_this/"
    }
]