[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 11,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 693,
        "comments": 5144,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1nvnqx2",
        "author": "lil_sass-a-frass",
        "title": "Unpopular opinion: House of Guinness was shite.",
        "content": "Script, screenplay and directing all seemed really lacklustre . Almost like a Bridgerton version of peaky blinders. Everything about the lady from cloonboo, the fenians, raffertys fake accent, even the affair with him and Anne (the cat thing was just cringe) and Arthur’s secret.  It all just felt so fake, put on and farcical to be believed.  Like the titanic love story or something. They could have done it so much better but it just fell so flat to me. ",
        "upvotes": 27,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1nvnqx2/unpopular_opinion_house_of_guinness_was_shite/"
    },
    {
        "id": "1nvncdg",
        "author": "lil_sass-a-frass",
        "title": "Wayward was addictive. Kept me hooked throughout.",
        "content": "Admit I thought it was gonna be boring during the first episode but really had me guessing and almost watched the whole series in one sitting just to see what was next. Sometimes Netflix hits good with with a show like that. Was a bit disappointed that the ending did not turn out how I expected! Definitely made it even more thought provoking though.. ",
        "upvotes": 17,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1nvncdg/wayward_was_addictive_kept_me_hooked_throughout/"
    },
    {
        "id": "1nvd7wl",
        "author": "Quick_Dot_9660",
        "title": "How did Haunting of Hill House not get nominated for an Emmy?",
        "content": "I'm rewatching (halloween season) and this is one of the most awe inspiring TV shows I've ever come across and according to IMDB it picked up some Saturn awards and  MTV awards is there a reason it would not have been nominated for anything more? ",
        "upvotes": 46,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1nvd7wl/how_did_haunting_of_hill_house_not_get_nominated/"
    },
    {
        "id": "1nvd1j7",
        "author": "Individual-Flatworm7",
        "title": "What on earth is happening to Netflix UK??!",
        "content": "Honestly I’m so mad I won’t lie. For the last like 30 mins I’ve been looking for something worth watching because EVERYTHING has been removed. For example, I was halfway through the vampire diaries and was watching it last night, today it’s gone. I wanted to watch a studio ghibli film, they’re all gone. What is going on and why is everything good being taken off? ",
        "upvotes": 24,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1nvd1j7/what_on_earth_is_happening_to_netflix_uk/"
    },
    {
        "id": "1nv1czx",
        "author": "EclipseTheStars",
        "title": "If Netflix *ISNT* Releasing Seasons All-At-Once, Why Not Do Weekly Episodes Instead??",
        "content": "EDIT : I think posters are vastly missing the point that weekly episodic lasts JUST AS LONG as bi-monthly \"chunking\". The argument that \"chunking\" keeps more viewers couldn't be farther from the truth because 8 weeks is 8 weeks no matter what way you slice it up. Also, I do not advocate for weekly episodic. I am, however, stating the lesser of 2 evils. As you were ...\n\n\n\nJust found out that Stranger Things 5 will be airing 4 episodes in November, 3 in December, and 1 in January for \"viewer retention.\"\n\nWhy don't they just start on Thanksgiving with weekly episodes that go throw 3 core holidays? Thanksgiving, Christmas, and New Years?\n\nPeople talk about it on social media, share their opinions, sometimes it's on talk shows, Game Of Thrones did this best, I don't know why Netflix doesn't do this. WEDNESDAY was the same.\n\n\\---------------------------------------------\n\nTL;DR\n\nObviously, just give me the entire season all at once. The premise is that they \\*DONT\\* do that anymore. And honestly, splitting up the seasons of these shows a few episodes MONTHS apart is so much worse than week-by-week episodes for a few months sraight.\n\nAlso, people tend not to give a @#$% anymore after binge watching half the season and then having to wait another month for the rest. Am I only in this way of thinking?",
        "upvotes": 90,
        "comments": 75,
        "media": null,
        "permalink": "/r/netflix/comments/1nv1czx/if_netflix_isnt_releasing_seasons_allatonce_why/"
    },
    {
        "id": "1nv6kgg",
        "author": "SomeoneNicer",
        "title": "We really need a Death to 2025",
        "content": "Current events this year have hit an all-time high where parody and satire can't keep up with reality fast enough. It's due time to return the series that gave us the evergreen gem of Death to 2020.",
        "upvotes": 27,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1nv6kgg/we_really_need_a_death_to_2025/"
    },
    {
        "id": "1nvacy2",
        "author": "Luv2006",
        "title": "Anyone else miss the Netflix roulette feature?",
        "content": "I completely forgot this existed until I read about it online the other day but it made me realise how much I actually miss it! Please tell me you guys also remember the very brief time when Netflix had a roulette option on the app to choose what to watch for you?! \n\nI can’t understand why they decided to get rid of it. It would save me a lot of time. I’m fed up with spending at least half an hour scrolling through different movies tryna figure out what to watch, just to end up going on my phone or to bed instead in the end. Anyone else miss this option? ",
        "upvotes": 8,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1nvacy2/anyone_else_miss_the_netflix_roulette_feature/"
    },
    {
        "id": "1nvqgmu",
        "author": "kamasushi",
        "title": "The Vampire Lestat - Subtitles So Often Misspelled and Error Filled",
        "content": "I saw it a few times in season one - and mainly \"here\" instead of \"hear\", but season two is riddled with errors, especially during the scenes where French is being spoken. \n\nHow has no one caught this? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nvqgmu/the_vampire_lestat_subtitles_so_often_misspelled/"
    },
    {
        "id": "1nv8czt",
        "author": "Atlast_89P13",
        "title": "Frankenstein (2025) | Guillermo del Toro | Official Trailer | Netflix",
        "content": "",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nv8czt/frankenstein_2025_guillermo_del_toro_official/"
    },
    {
        "id": "1nvoapx",
        "author": "OptimalPain0697",
        "title": "Splinter Cell animation....",
        "content": "Okay.....what the hell is this animation for Splinter Cell that Netflix has coming out this month....? And this is coming from a hardcore fan of the game franchise. To my knowledge, the major fans of the games wants a NEW GAME......and Ubisoft is giving everything but a new Splinter Cell game.....\n\nThey put Sam in Ghost Recon and this and that, but not giving him a new entry in his own game series. \n\nI'm not trying to rant too hard, I just think it's super annoying that us Splinter Cell fans are giving us everything except for what we've been asking for since 2013-2014",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nvoapx/splinter_cell_animation/"
    },
    {
        "id": "1nvc5jz",
        "author": "Thin-Presence-154",
        "title": "Good Girls- I hate the husbands",
        "content": "I just started watching Good Girls.  I've enjoyed the show. I'm not done with it yet. I'm on season 4 episode 13. Dean is an awful husband and has the nerve to be mad about how Beth makes money despite her saving their home and keeping them above water. He has so much audacity considering he cheated multiple times, lost their funds multiple times, and lied about having cancer to manipulate her. Stan has the nerve to be mad a Ruby and try to take down Beth when Ruby and Beth are the reason their daughter got an organ.  ",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nvc5jz/good_girls_i_hate_the_husbands/"
    },
    {
        "id": "1nvnvuf",
        "author": "Unfair_Ad_598",
        "title": "Help finding a show please.",
        "content": "I was home sick one day and I remember I just looked through the netflix catalogue, and I came across this show I never got to finish and now I can't remember what its called. I believe it's a 3d anime style similar to the dragon prince. It's about this girl who's like the last human or one of, and she has a robot companion. And there's these massive cubes that were like factories for the robots or something or maybe they were habitats for the humans before they all died I think,  Sorry I can't give more information I watched it like a year or two ago maybe? 😭 If anyone knows what the heck I'm talking about please share.\n\nEdit: I found it. The show is Eden\n\nhttps://preview.redd.it/tpzc0fx77lsf1.png?width=608&amp;format=png&amp;auto=webp&amp;s=82e18040849e9c360f6470030009e6f1fc646fe2\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nvnvuf/help_finding_a_show_please/"
    },
    {
        "id": "1nvdz1r",
        "author": "Top-Three-USA",
        "title": "Lena Headey and Gillian Anderson Lead Fierce Frontier Feud in ‘The Abandons’",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nvdz1r/lena_headey_and_gillian_anderson_lead_fierce/"
    },
    {
        "id": "1nvn233",
        "author": "Evadenly",
        "title": "The Wrong Paris",
        "content": "I was looking forward to watching it; it seemed a somewhat decent romcom for today's standards.\n\nTen minutes in to the film, and I've got a migraine from the background blur/effects. Am I the only one? \nWhen the camera pans with it, I genuinely feel like I'm in the backseat of a speeding tesla ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nvn233/the_wrong_paris/"
    },
    {
        "id": "1nvqhsj",
        "author": "trappedinchina",
        "title": "Netflix Shop is Scamming Buyers",
        "content": "I recently made two purchases from Netflix Shop: the first larger order was made using expedited shipping and the second order was made using standard shipping. Netflix shipped both using the same shipping service. \n\nYou can find screenshots here: https://imgur.com/a/Sdgq4Uo\n\n\nNetflix is clearly taking people's money for expedited shipping and then shipping it the same method as standard shipping. I'm not sure how many orders Netflix is getting daily but I assume it's easily thousands if not tens of thousands. This is clear and blatant stealing.\n\nEdit: Forgot to comment that the screenshots show one package shipped using DHL SM Parcel Plus Expedited and one shipped using DHL SM Parcel Expedited. There is no difference between these services with regard to delivery times. Parcel Plus is for packages greater than one pound and Parcel is for packages lighter than one pound.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nvqhsj/netflix_shop_is_scamming_buyers/"
    },
    {
        "id": "1nvjx0x",
        "author": "Lesbian_lemur72",
        "title": "Keeps freezing but subtitles working",
        "content": "I'm trying to make netflix work but it keeps freezing on a certain part yet the subtitles and sound are still working?? It's doing the exact same on Disney+ even after force stopping both devices, restarting the TV and completing turning the TV off",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nvjx0x/keeps_freezing_but_subtitles_working/"
    },
    {
        "id": "1nvd82q",
        "author": "ToonAdventure",
        "title": "KPop Demon Hunters Takes Over Fortnite",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nvd82q/kpop_demon_hunters_takes_over_fortnite/"
    },
    {
        "id": "1nv96uu",
        "author": "jesuslovesdank646260",
        "title": "My biggest Wayward questions",
        "content": "Finished the series last night, &amp; these are the things I’m still wondering this morning:\n\nWhy did Rabbit want to “adopt” Stacey? Does Rabbit know that Stacey admires her? (At least that’s how I saw it, if anyone thinks differently let me know!) The hug after Stacey k*lls Daniel had me speechless. Does Rabbit think Stacey will protect her? From what?\n\nDoes Ello or Evelyn survive? \n\nAlex left Toast with the car for Abby, presumably so she wouldn’t be all alone, have some sort of company, but I mean after that Laura never wonders where Toast went? Did I miss something?\n\nI was so upset the daydream before the end was just that, a daydream. WHY would Alex stay? What the heck does he want with the craziness? Will Laura take Evelyn’s place? If so please tell me your theories!",
        "upvotes": 3,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1nv96uu/my_biggest_wayward_questions/"
    },
    {
        "id": "1nvhhqo",
        "author": "FeelingAnything9821",
        "title": "The hell is billionaire's bunker",
        "content": "The story had so much potential but it's all so fucked up why is everyone just fucking literally whole series is just people fudging eachother ...the only almost sane person was the protagonist..i dont know wht i just watched...personally money heist &gt;&gt;&gt;&gt;&gt;&gt;&gt; this series ... And the ending very much did disappointed..",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1nvhhqo/the_hell_is_billionaires_bunker/"
    },
    {
        "id": "1nvb3yr",
        "author": "Complex-Specialist26",
        "title": "Wayward is brilliant(spoilers)",
        "content": "I was holding on to every episode! Usually I pull out my phone while watching but this series had me glued to the screen. There are parts I don’t really understand, like the door and the “leap” part of the program. What does it do to you? I’m going to rewatch but was hoping for some insight! \n\nI didn’t understand Laura, was she bad or was it trauma? Why did she kill that frog?! \n\nReally hoping for a season 2! ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nvb3yr/wayward_is_brilliantspoilers/"
    },
    {
        "id": "1nuztc3",
        "author": "Anteater_Able",
        "title": "Charlie Hunnam on Becoming Ed Gein for Netflix's 'Monster'",
        "content": "",
        "upvotes": 10,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1nuztc3/charlie_hunnam_on_becoming_ed_gein_for_netflixs/"
    },
    {
        "id": "1nvgkn7",
        "author": "Zealousideal-Soil-41",
        "title": "New series Madam : soundtrack help! (Clip NSFW)",
        "content": "New series Madam on Netflix - episode 3, has a rad version of cotton eye joe, I can’t find it anywhere online, have Shazammed to no avail, please help me find it !\n\nAll I can find is this Episode 3 Songs – S01E03\n\nScore Composer: Nick Buckton\nMusic Supervisor: Jenna Ackerman",
        "upvotes": 0,
        "comments": 2,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/gkidnx0lojsf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1nvgkn7/new_series_madam_soundtrack_help_clip_nsfw/"
    },
    {
        "id": "1nv28cl",
        "author": "Enzian_Blue",
        "title": "European shows",
        "content": "Hi there. We loved shows like Dark, der Pass (Pagan Peak), das Boot.. the atmosphere is special, the actors are more ‘real’. Any recommendations that we might enjoy? \n\nThank you :)",
        "upvotes": 4,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1nv28cl/european_shows/"
    },
    {
        "id": "1nu9kbz",
        "author": "Tr0jan___",
        "title": "Ms. Rachel announced as the new global ambassador for PCRF (Palestine Children's Relief Fund)",
        "content": "",
        "upvotes": 203,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nu9kbz/ms_rachel_announced_as_the_new_global_ambassador/"
    },
    {
        "id": "1nulvlm",
        "author": "FNAFLV22",
        "title": "Just heard of “Maniac” and saw the IMDb rating. To those who have seen both shows, which show did you like more?",
        "content": "",
        "upvotes": 37,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1nulvlm/just_heard_of_maniac_and_saw_the_imdb_rating_to/"
    },
    {
        "id": "1nv94ma",
        "author": "bball4224",
        "title": "11 Rebels",
        "content": "I'm in Japan, so idk if any of you will even have this movie as an option, but there is some crazy audio mixing with this movie this is nearly unbearable. I've had issues with things where audio is a little too quiet, or music is too loud, etc. But this movie is the worst example of it I've had so far. All of the dialogue scenes I'm turning up 5 volume levels more than I normally do, and even then it's still quiet. But the moment any sound effects happen, they're insanely loud.\n\nJust curious if there's an issue with the netflix version of this movie, because I'm not having this level of issues with anything else. I would say maybe it's the movie, but I would think netflix probably works on audio regulating and optimizing themselves as well. 🤔",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nv94ma/11_rebels/"
    },
    {
        "id": "1nuabrk",
        "author": "Sweaty-Toe-6211",
        "title": "'THE WITCHER' Season 4 reportedly cost over $25M per episode, making it $221M overall - The total budget for ‘THE WITCHER’ series has now reached an estimated $720M",
        "content": "",
        "upvotes": 137,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1nuabrk/the_witcher_season_4_reportedly_cost_over_25m_per/"
    },
    {
        "id": "1nvkcv4",
        "author": "moon-1992",
        "title": "Can you recommend the tv show ‘glitch’?",
        "content": "Please don’t spoiler. Never heard of the show before but i just watched the trailer which seems to be interesting but I’m not sure. What are your opinions? Is it worth a watch? ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1nvkcv4/can_you_recommend_the_tv_show_glitch/"
    }
]