[
    {
        "id": "1hmfpsf",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Nosferatu / a Complete Unknown / Babygirl / The Fire Inside / The Order)",
        "content": "# New Theatrical Releases\n\n[A Complete Unknown](https://old.reddit.com/r/movies/comments/1hlsi27/official_discussion_a_complete_unknown_spoilers/?)\n\n[The Fire Inside](https://old.reddit.com/r/movies/comments/1hlsi3n/official_discussion_the_fire_inside_spoilers/?)\n\n[Nosferatu](https://old.reddit.com/r/movies/comments/1hmffh4/official_discussion_nosferatu_2024_spoilers/?)\n\n[Babygirl](https://old.reddit.com/r/movies/comments/1hmffj8/official_discussion_babygirl_spoilers/?)\n\n# Streaming Releases\n\n[Nightbitch](https://old.reddit.com/r/movies/comments/1homiqy/official_discussion_nightbitch_spoilers/)\n\n[The Order](https://old.reddit.com/r/movies/comments/1hlsi4b/official_discussion_the_order_spoilers/?) on VOD\n\n[Juror #2](https://old.reddit.com/r/movies/comments/1hjiwvb/official_discussion_juror_2_spoilers/?) on MAX\n\n# Still in Theaters\n\n[Sonic the Hedgehog 3](https://old.reddit.com/r/movies/comments/1hiae45/official_discussion_sonic_the_hedgehog_3_spoilers/?)\n\n[Mufasa: The Lion King](https://old.reddit.com/r/movies/comments/1hiae58/official_discussion_mufasa_the_lion_king_spoilers/?)\n\n[Wicked: Part 1](https://old.reddit.com/r/movies/comments/1gwxxy1/official_discussion_wicked_part_i_spoilers/)\n\n[Moana 2](https://old.reddit.com/r/movies/comments/1h0uevk/official_discussion_moana_2_spoilers/)\n\n[Gladiator II](https://old.reddit.com/r/movies/comments/1gwxxwd/official_discussion_gladiator_ii_spoilers/)\n\n[Kraven the Hunter](https://old.reddit.com/r/movies/comments/1hd2v8v/official_discussion_kraven_the_hunter_spoilers/?)\n\n[The Lord of the Rings: The War of Rohirrim](https://old.reddit.com/r/movies/comments/1hd2vab/official_discussion_the_lord_of_the_rings_the_war/?)",
        "upvotes": 76,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1hmfpsf/official_discussion_megathread_nosferatu_a/"
    },
    {
        "id": "1hpp7yt",
        "author": "SanderSo47",
        "title": "December 27-29 Box Office Recap: 'Sonic 3' and 'Mufasa' fight for the top spot at the box office. 'Nosferatu' opens with a fantastic $40.3 million in its first five days, already becoming Robert Eggers' highest grossing film. 'A Complete Unknown' settles for sixth place with $23.1 million.",
        "content": "https://preview.redd.it/k21dn07d40ae1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=5b2edf912cefe80f8f6936c9ec0814e5006ae794\n\n#**Normally you'd wait till the Weekend Actuals are out. But the numbers are delayed due to the holidays, so you'll only have estimates for now. The same could happen next week.**\n\nIt was a fierce battle at the box office.\n\n***Sonic 3*** and ***Mufasa: The Lion King*** fought for the top spot, with the hedgehog currently leaning on the top spot for now. On Christmas, we got 4 newcomers, with mixed results. ***Nosferatu*** delivered a fantastic debut and became Robert Eggers' highest grossing film in just 5 days, while ***A Complete Unknown*** had a very solid start. On the other hand, ***Babygirl*** had a soft start, while ***The Fire Inside*** failed to attract interest.\n\nThe Top 10 earned a combined $159.2 million this weekend. That's up a huge 58% from last year, when ***Wonka*** returned to the top spot.\n\nStaying on top, ***Sonic 3*** earned $38 million this weekend ($59.9 million five-day). That represents a 37% drop, which is better than the previous films. There were concerns over the weekdays, as it appeared that it was front-loaded and would show weak legs, but it looks like it recovered for now.\n\nThrough ten days, the film has amassed $136.8 million. It should have another great hold this weekend, which will allow it to hit $200 million very soon. It can go as high as $250 million at this pace.\n\nSettling for second place, ***Mufasa*** made $37.1 million this weekend ($63.7 million five-day). That's a very nice 5% increase from last weekend. It had a soft debut but it's showing some strength. Through 10 days, it has made $113.4 million. Despite this increase, the film is still off a massive 68% from the 2019 film through the same point. We'll see how much it can earn through the holidays.\n\nExceeding expectations, Robert Eggers' ***Nosferatu*** debuted with a fantastic $21.1 million this weekend ($40.3 million five-day). This is not just Eggers' biggest debut by a wide margin, but it's already his highest grossing film domestically, passing ***The Northman*** ($34.2 million). It's also the fourth biggest debut for Focus Features.\n\nThis is an amazing result in any sense of the word, and showed that Eggers could finally hit the mainstream audience (***The Northman*** was supposed to be that film, but it didn't quite land at the box office). But that still raises the question: how was this film able to debut this high and far above Eggers' films? Credit must go to a fantastic marketing campaign, which offered enough intrigue and darkness to attract audiences. The decision to hide Bill Skarsgård's appearance as the iconic Count Orlok from the trailers panned out very well; if you want to watch him, you have to pay a ticket.\n\nIt can be said that Eggers' brand has also increased in past years. While ***The Northman*** wasn't a box office hit, Focus Features confirmed that the film eventually became profitable after a few months thanks to strong VOD numbers and other post-theatrical markets, and this was a big reason why they were confident in greenlighting ***Nosferatu***. Also, while remaking a 1922 silent German Expressionist film feels like it would struggle to get recognition, ***Nosferatu*** actually had some exposure to the audience. A lot of kids were introduced to this character in that iconic ***SpongeBob SquarePants*** episode. That helped the film build awareness. \n\nAccording to Focus Features, 55% of the audience was male and 56% of the audience was in the 18-34 demographic. While critics raved about the film, audiences wasn't as much; they gave it a weak \"B–\" on CinemaScore. That's not actually a bad score for a horror film, given they often fall in the C range. Nevertheless, without horror competition till ***Wolf Man*** in mid January, ***Nosferatu*** should hold well through the holidays. While it's unclear how much it can earn, one thing is clear: this is hitting $100 million domestically, which is an amazing result.\n\n***Wicked*** rose 37%, adding $19.4 million this weekend ($31.7 million five-day). On Christmas day, it added a sing-along version, which boosted the numbers. The film has earned a fantastic $424 million so far.\n\nAfter its weak legs, ***Moana 2*** had its best drop so far. It jumped 38%, adding $18.2 million this weekend. A much needed recovery, given it wasn't holding well after its gigantic opening. The film has earned $394.6 million so far, and will hit the $400 million milestone in a few days.\n\nDebuting in sixth place, Searchlight's ***A Complete Unknown*** earned $11.6 million ($23.1 million five-day). This is one of the best debuts for Searchlight, and its opening day ($7.2 million) was a record for the studio. If we want to compare it to James Mangold's films, the five-day debut is slightly above of what ***Walk the Line*** made in 3 days ($22.3 million). \n\nThis is a solid start, and the only reason why it's not fantastic is that it's carrying an extensive $60-$70 million budget, putting a lot of pressure in the film. Bob Dylan is one of the most iconic singers and songwriters of the past century, although he is still not as popular as other musicians in other biopics. For example, Queen, Elton John and Bob Marley are more popular with current audiences than Dylan. So the film had only one selling point: its star Timothée Chalamet.\n\nLike him or not, Chalamet is one of the most popular young stars of our times. He already had huge hits in the past year with ***Wonka*** and ***Dune: Part Two***, and he's already set for another film, ***Marty Supreme***, which also opens on Christmas Day next year. Deadline reported that 36% of the audience watched the film for Chalamet, cementing a status as a box office draw. Reviews were also solid enough to win over audiences, and some Oscar buzz is on the horizon.\n\nAccording to Searchlight, the audience was equally split between men and women. Unsurprisingly, the big demo was adults; 62% of the audience was 35 and over. They gave it a strong \"A\" on CinemaScore, which bodes very well for its legs. And you have to remember that this is targeting an old audience, which doesn't rush out to watch a film as soon as possible. We'll keep an eye on this one, but the incoming Oscar buzz should help it stay in theaters for quite  a long time.\n\nIn a distant seventh place, A24's ***Babygirl*** earned $4.3 million ($7.2 million five-day). That's quite a soft start, especially considering that the film was playing in 2,115 theaters, and the fact that A24 pushed it as its main attraction for the holidays.\n\nThe film is sold as an erotic thriller, but that can be a mixed bag at the box office. Outside the ***Fifty Shades of Grey***, erotic thrillers haven't performed very well at the box office. And despite having a big name in Nicole Kidman, she hasn't had a good run as of late; she hasn't had a single box office hit since ***The Upside*** back in 2019. Her recent success has been on streaming and on TV, leaving questions over her star power at the box office (even though she's the face of AMC).\n\nAccording to A24, 53% of the audience was female and 44% of the audience was 35 and over. While critics were positive of the film, the audience wasn't forgiving; they gave it a very weak \"B–\" on CinemaScore, which might be due to the nature of the film itself. While Kidman has some Oscar buzz, it would be a surprise if the film made anything above $20 million domestically.\n\n***Gladiator II*** continues showing some great late legs. The film eased just 9% and earned $4.1 million this weekend. That takes its domestic total to $163 million. It's gonna head to around $175 million.\n\nAngel Studios' ***Homestead*** had the worst drop in the Top 10. It dropped 47%, adding $3.1 million this weekend. That takes its domestic total to $12.8 million, and it suggests that it will fall off when the holidays are over.\n\nRounding up the Top 10 was the last newcomer of the week, Amazon MGM's ***The Fire Inside***. Despite setting it at 2,006 theaters, the film bombed with just $2 million ($4.3 million five-day). That's the 28th worst debut for any film playing at 2,000+ theaters.\n\nThis isn't a surprising result. Amazon didn't appear to focus on properly marketing the film, choosing to simply dump it on Christmas and hoping that it would find an audience. After all, ***The Boys in the Boat*** over-performed last year, showing there was a market for sports dramas. But the film simply lacked a hook; people simply weren't interested in Claressa Shields' story. Even with the talent involved, it simply wasn't enough.\n\nAccording to MGM, 51% of the audience was female and 51% was 35 and over. On the bright side, the audience gave it a strong \"A\" on CinemaScore, which fits nicely with its great reviews. But even with that, it's unlikely it can turn things around.\n\n***Kraven the Hunter*** slightly recovered after its awful second weekend drop, even if it fell on the bad side of the drops. It dropped 44%, adding $1.7 million this weekend. Sadly, with an anemic $21.3 million domestic total so far, there's nothing to celebrate here. It might hit $25 million, but it won't get much higher than that.\n\nBut while ***Kraven*** kept showing weak legs, ***The Lord of the Rings: The War of the Rohirrim*** does not appear to have any legs. The film collapsed 63%, earning just $455,000 this weekend. Absolutely horrible considering the rest of the films had fantastic holds. The film has made just $8.5 million domestically, and it's now guaranteed to finish below $10 million.\n\nParamount chose to open the Robbie Williams biopic ***Better Man*** in 6 theaters, ahead of its wide release on January 10. But the film flopped with just $18,000 ($35,000 five-day), which translates to a very poor $3,000 per-theater average. Not a surprise, considering Williams failed to find an audience in America. This is a bad sign for its wide release.\n\n#**OVERSEAS**\n\n***Mufasa*** was still on top in the rest of the world, albeit only slightly. It added $77 million this weekend, taking its worldwide total to $327 million. The best markets currently are France ($20.9M), UK ($15.8M), Mexico ($15.5M), Italy ($14.4M) and Germany ($13.6M).\n\n***Sonic 3*** made its debut in the rest of the world, debuting with a dazzling $74 million in 52 markets, taking its worldwide total to $210 million. That's a huge 83% of the second film's debut. The best debuts were the UK ($15.1M), Mexico ($10.3M), France ($7.3M), Australia ($5.5M), Germany ($5.5M), Spain ($3.3M), Panama ($2.3M); Peru ($1.6M), Colombia ($1.3M) and Malaysia ($1.3M), all of which were records for the franchise. It should have no problem hitting $500 million, and it still has some markets left.\n\n***Moana 2*** added $36 million this weekend, and its worldwide total is now $882 million. The best markets are France ($53.9M), UK ($42.6M), Germany ($34.8M), Mexico ($28.2M) and Brazil ($25.7M).\n\nIn a major milestone, ***Wicked*** has now passed ***Mamma Mia!*** to become the highest grossing Broadway adaptation, with a current worldwide total of $634 million. The best markets are the UK ($67M), Australia ($24.8M), Korea ($14.2M), Germany ($11.8M) and Mexico ($9.9M).\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Heretic* | Nov/8 | A24 | $10,829,810 | $27,716,205 | $42,703,807 | $10M\n\n- A24's ***Heretic*** has closed with $42 million worldwide. That's a very solid start, even if the film didn't have a lot of staying power after its good debut. If Hugh Grant making a Jar-Jar impression is not enough to get you to buy a ticket, nothing will.",
        "upvotes": 152,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/UsfdGAkh1IxdywQuaZAtKyPHE84GbGZoPXH8oqdNDxc.png?auto=webp&amp;s=e0931a977d1cac08b034c4a0a03fb55a018ab231"
        },
        "permalink": "/r/movies/comments/1hpp7yt/december_2729_box_office_recap_sonic_3_and_mufasa/"
    },
    {
        "id": "1hpsddf",
        "author": "MarvelsGrantMan136",
        "title": "Jason Momoa To Play Lobo In ‘Supergirl: Woman Of Tomorrow’",
        "content": "",
        "upvotes": 8753,
        "comments": 948,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OAb9kVxJt-rwl774VRvElaGO_bjGjT_HVXM8yrTFE54.jpg?auto=webp&amp;s=10a7b0cfcd59c9ec1519397df99367ab43d9b6f9"
        },
        "permalink": "/r/movies/comments/1hpsddf/jason_momoa_to_play_lobo_in_supergirl_woman_of/"
    },
    {
        "id": "1hpxh09",
        "author": "MarvelsGrantMan136",
        "title": "‘Star Wars’ Actor Angus MacInnes (Gold Leader Jon \"Dutch\" Vander) Dies at 77",
        "content": "",
        "upvotes": 1570,
        "comments": 65,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QzKvUP0uynjcTdHNjw4C4q5upk690Ph3GbXu6I06QKA.jpg?auto=webp&amp;s=b2c3c8547ef8901e5618a20f8dc783f76e79786a"
        },
        "permalink": "/r/movies/comments/1hpxh09/star_wars_actor_angus_macinnes_gold_leader_jon/"
    },
    {
        "id": "1hpu0qn",
        "author": "indiewire",
        "title": "The 30 Best Nude Scenes in Film, from ‘Shortbus’ to ‘Blue Velvet’ to ‘No Hard Feelings’",
        "content": "",
        "upvotes": 1980,
        "comments": 574,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BY3G6rWx_JbiquYffzQcS3_KcdI2mTJHCKoaK3BmzTw.jpg?auto=webp&amp;s=fc1b27e1cc33b2de319b0977974051f9071e3481"
        },
        "permalink": "/r/movies/comments/1hpu0qn/the_30_best_nude_scenes_in_film_from_shortbus_to/"
    },
    {
        "id": "1hq5wyz",
        "author": "Hookton",
        "title": "Who do you think are the most noticeable age miscasts?",
        "content": "I've just been rewatching The History Boys and one particular actor stuck out to me. The main group are all Hollywood teenagers (aka babyfaced late-20s in a school uniform) and they're pretty convincing as teenagers.\n\nBut one of them... I looked him up and he's around the same age as his cast classmates but I swear to god he looks easily 40+. Least believable teenager I've ever seen on screen.",
        "upvotes": 281,
        "comments": 430,
        "media": null,
        "permalink": "/r/movies/comments/1hq5wyz/who_do_you_think_are_the_most_noticeable_age/"
    },
    {
        "id": "1hpoeci",
        "author": "dragondiaper",
        "title": "PSA: Hundreds of Beavers is free on YouTube",
        "content": "",
        "upvotes": 2378,
        "comments": 422,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/76ZReWomzFEI3mpen9c1ztPqZ4wAUAgDkBrEDerXs3Y.jpg?auto=webp&amp;s=08246297a9423eac8d8c3f75e632c26ed24cdeb3"
        },
        "permalink": "/r/movies/comments/1hpoeci/psa_hundreds_of_beavers_is_free_on_youtube/"
    },
    {
        "id": "1hq2cx1",
        "author": "Effective-Celery8053",
        "title": "Don't get scammed into seeing homestead",
        "content": "It was so awful. Basically a 2 hour trailer to set up the TV show. I bought tickets mainly because I was interested in the sweepstakes, and the trailer looked like something right up my alley (I love anything post apocalypse) but what a waste of 2 hours. \n\nThe setup didn't make any sense (two random dudes in a fishing boat can set off a nuke inside of random barrels? Then Russia takes out our entire electric grid?)\n\nThe only conflict was: oh our food *might* run out in months, what will we ever do? And a swat team that randomly showed up because of a corrupt government official that needs his taxes! (Who, after all brief shootout, decides to just leave?)\n\nI actually do like the message that them letting in the \"\"\"refugees\"\"\" in (basically just their neighbors outside their gate) was ultimately beneficial to them, but that's going to piss their target off so much that actually might be kinda funny. \n\nThen it wraps up with basically a trailer for a show that is streaming now and a QR code to \"pay it forward\" (buy more tickets for other people) ",
        "upvotes": 268,
        "comments": 35,
        "media": null,
        "permalink": "/r/movies/comments/1hq2cx1/dont_get_scammed_into_seeing_homestead/"
    },
    {
        "id": "1hq3ofi",
        "author": "simondufresne",
        "title": "Another Reason To Not Abandon Physical Media",
        "content": "So I love and collect movies, we've got well over 1500 individual movies in our library and I know we've all gotten used to hearing the arguments that you never really \"own\" anything with digital purchases, and companies can take these movies offline at any time etc etc. and that's all true! \n\nBut another massive point i want to give physical media is also all the extras that come along with the discs. \n\nThese interactive DVD menus, the GAMES they would sometimes shove into the discs, the commentaries, making ofs, interviews, special features. If someone doesn't upload them to youtube and save them they're just gone. \n\nI'm going through Disney plus right now because there are TWO disney movies I don't own on disc and after watching the movie I went to their extras and it's just the original trailer to the movie. I'm looking online at the list of features on the DVD and I've got:\n\n* Deleted Scenes\n* behind the scenes footage\n* outtakes\n* art galleries and storyboards\n* audio and visual commentaries\n* fact or fiction deep dive into the history of the movie's lore\n* how the language of the movie was created\n* character design breakdowns\n* interviews with the cast and creatives\n\noh yeah and FOUR of the movie's trailers along with images of the print campaigns.\n\n  \nbut thanks for that ONE trailer as an Extra DisneyPlus, yeah - I love that.\n\n  \nok rant over - don't throw away your discs y'all.",
        "upvotes": 211,
        "comments": 73,
        "media": null,
        "permalink": "/r/movies/comments/1hq3ofi/another_reason_to_not_abandon_physical_media/"
    },
    {
        "id": "1hptut5",
        "author": "indiewire",
        "title": "'Nosferatu' Robert Eggers Interview: Learning His Craft on ‘Northman’",
        "content": "",
        "upvotes": 769,
        "comments": 134,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LEnjYdHjAsZi7kBLaT7n_1u6YaleA22aR-3IMncqUgA.jpg?auto=webp&amp;s=95f868321f7d819fa373090dce95a8c4e6989bd6"
        },
        "permalink": "/r/movies/comments/1hptut5/nosferatu_robert_eggers_interview_learning_his/"
    },
    {
        "id": "1hprdj0",
        "author": "Task_Force-191",
        "title": "The Wild Robot Returns To Theaters On January 17th",
        "content": "",
        "upvotes": 871,
        "comments": 98,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6xjsCy0XCpiwkODnYPJa68Gm4lGESJC--ZSydrrabAs.jpg?auto=webp&amp;s=7c01c588ec3e9f79bf13c23dc0754b7efe768a73"
        },
        "permalink": "/r/movies/comments/1hprdj0/the_wild_robot_returns_to_theaters_on_january_17th/"
    },
    {
        "id": "1hpuyna",
        "author": "sketchesbyboze",
        "title": "Realized I Hallucinated an Entire Scene in Die Hard",
        "content": "I watched Die Hard with my family the other night. It's been ten years since I last saw it. Of course there's a famous scene early in the film where McClane kills one of Gruber's goons, then writes on his shirt, \"Now I have a machine gun. Ho, ho, ho!\" I could have SWORN there was an iconic callback to this scene later in the movie, when Gruber steals McClane's gun and disappears into a nearby elevator. Just as the doors close, Gruber says, \"Now \\*I\\* have a machine gun! Ho, ho, ho!\" with a delivery that brought down the house at my last theatrical screening in 2014.   \n  \nI spent the whole film waiting for this moment, my favorite moment in the film. And it never happened. Thinking maybe I had somehow zoned out and missed it, I googled the scene after the movie and ... I seem to have made it up? Imagined the entire sequence? It's a very surreal feeling, like learning that Robert Mitchum never sings \"Leaning on the Everlasting Arms\" in The Night of the Hunter. Thinking back on it, I suppose if Gruber had stolen a machine gun, he would have simply shot McClane and the film would've been over. ",
        "upvotes": 383,
        "comments": 107,
        "media": null,
        "permalink": "/r/movies/comments/1hpuyna/realized_i_hallucinated_an_entire_scene_in_die/"
    },
    {
        "id": "1hpaj6c",
        "author": "Gato1980",
        "title": "Robert De Niro’s $1 billion Wildflower Studios, the world’s first vertical film studio and production soundstage in Queens, NY, is complete and already operational",
        "content": "",
        "upvotes": 17025,
        "comments": 904,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/j9xB8Zx68285-ZMPznMHYZaZMmeUm1Rx4nktVVzT4yk.jpg?auto=webp&amp;s=6223e2d00b85c9034c9075530826596f17a2aed4"
        },
        "permalink": "/r/movies/comments/1hpaj6c/robert_de_niros_1_billion_wildflower_studios_the/"
    },
    {
        "id": "1hpzti5",
        "author": "Longjumping_Thing723",
        "title": "Why is movie dialogue vs SFX so quiet?",
        "content": "Trying to watch the latest aliens movie and I have to have subtitles because the dialogue is so quiet! But whenever there is an inch of action it’s like someone’s put the volume up to 200%\n\nI get that movies are made for cinema first but I wish there could be a middle ground. Considering streaming/home watching absolutely dominates numbers vs going out to the cinema nowadays.",
        "upvotes": 137,
        "comments": 147,
        "media": null,
        "permalink": "/r/movies/comments/1hpzti5/why_is_movie_dialogue_vs_sfx_so_quiet/"
    },
    {
        "id": "1hphh03",
        "author": "Front_Sugar4784",
        "title": "The (Good Will Hunting) “will leaving Skylar scene” is so devastating to me",
        "content": "I watched the movie for the first time today, decided to give it a shot. Great movie. The part in the scene that truly got to me is where Skylar starts crying after will reveals his dad put cigarettes out on him when he was younger. It all goes down hill from there as will says he doesn’t love her and she breaks down. Something about the scene makes it stick out like a sore thumb. It’s incredible, acting is crazy good. \n\n\nhttps://youtu.be/e4hXrrc8fA8?si=WqNx3YCfEwLuNiJH\n",
        "upvotes": 1777,
        "comments": 171,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bOyxqI1KEzyX6QdtKbT9VrMM9EPBBfgwdXvldcsCmKA.jpg?auto=webp&amp;s=80d729440a237d92873090b6ac6ad56e4b89bf0d"
        },
        "permalink": "/r/movies/comments/1hphh03/the_good_will_hunting_will_leaving_skylar_scene/"
    },
    {
        "id": "1hpogfs",
        "author": "SuplexCity-Mayor",
        "title": "Se7en 30th Anniversary | Experience It In IMAX | Official Trailer",
        "content": "",
        "upvotes": 409,
        "comments": 97,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Yo9rsYx4GSdlUJnzOd9GIXCyLWNkuLgUyaS7le4QVcs.jpg?auto=webp&amp;s=37cdeac2299f522987969e6d54f57e2e2d62f078"
        },
        "permalink": "/r/movies/comments/1hpogfs/se7en_30th_anniversary_experience_it_in_imax/"
    },
    {
        "id": "1hpxyrm",
        "author": "canada11235813",
        "title": "Movies where the Director's Cut is notably \"worse\" than the original?",
        "content": "I've seen Amadeus more than 20x over the years, but recently had the opportunity to see the Director's Cut for the first time... and was somewhat disappointed with it.\n\nThe Amadeus I've seen many times comes from the original DVD of the original theatrical release. When over at some friend's house recently, I suggested this movie, and the only version available for streaming was the DC.\n\nThe DC adds 20 minutes and a few sub-plots, and some gratuitous and unnecessary nudity. The sub-plots don't add much to the story, but do interrupt the flow of the original, which, in hindsight, was a masterfully edited in the way it flawlessly unrolled the story at a perfect pace.\n\nThe DC does add more music as well, which is great... except it also interrupts the aforementioned flow.\n\nWhile it was really cool to see these characters I've seen so many times in \"new\" situations, I feel the DC in this case was a step backwards from the original. Of course, having seen the original so many times and loved it, any changes made to this movie will be met with some serious scrutiny from me. And, of course, who am I to question Milos Forman -- it's his vision after all.\n\nAll that being said, I'd be interested to hear from those of you who've seen both versions of this movie, and which do you prefer?\n\nAnd, as per the title, are there other movies that come to mind that shouldn't have been meddled with? I know there are many Star Wars purists who have a lot to say. Any others?\n\n",
        "upvotes": 62,
        "comments": 229,
        "media": null,
        "permalink": "/r/movies/comments/1hpxyrm/movies_where_the_directors_cut_is_notably_worse/"
    },
    {
        "id": "1hpdh9u",
        "author": "gearwest11",
        "title": "I never realize how many serious blows the major movie industry dealt with in the 2010’s ",
        "content": "From the death of the video rental stores (especially with Blockbuster), to the Sony Pictures hack, to the rise of streaming and the misguided push from the major  studios by creating their own or rebranding one, to the Harvey Weinstein scandal which leads to the #Metoo movement, and the big blow of it all was the Disney/Fox merger resulting one less major studio to make movies and less variety now.\n\nAnd honestly those factors feel like the reasons why this decade so far as far as mainstream movies goes has been less than stellar. \n\nIt's sad too because there was a time a studio would greenlight a quirky comedy like Zombieland or Hot Tub Time Machine or the Oscar bait but crowd pleasing drama like Argo or The Martian. Now those kinds of movies are so far in between and mostly become Netflix filler even if the film is good it's buried by a cluttered algorithm. \n\n\n\n",
        "upvotes": 1696,
        "comments": 205,
        "media": null,
        "permalink": "/r/movies/comments/1hpdh9u/i_never_realize_how_many_serious_blows_the_major/"
    },
    {
        "id": "1hqaoki",
        "author": "ubcstaffer123",
        "title": "Nosferatu is the stuff of exquisitely erotic nightmares",
        "content": "",
        "upvotes": 8,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/DDGMrU8QLWk1YClzYX7Fke6FbWmUJG8gJY7O2J5HTh0.jpg?auto=webp&amp;s=d7f4697f104e2002d1ccbfe6a70fa8700db1f056"
        },
        "permalink": "/r/movies/comments/1hqaoki/nosferatu_is_the_stuff_of_exquisitely_erotic/"
    },
    {
        "id": "1hq5vcm",
        "author": "GTAwheelman",
        "title": "Best places to watch classic movies? (pre 1960's)",
        "content": "Max is good as it has TCM. I've also found Tubi to have some good classics as well.\n\nMy mother(75) and I (36) enjoy watching the old classics.  Staring actors like  Humphrey Bogart , William Powell, James Stewart and such. \n\nBogart movies are easy to come by on most streaming sites. However William Powell movies like The Thin Man and Jewel Robbery are not. Lots of places have them for rent or buy digital but no streaming. Which if I have to purchase I would rather have a DVD or BluRay. \n\nAccording to google the last time this was asked here was 4yrs ago. Most suggestions were TCM, Max, Prime, or Criterion. Prime no longer has good selection IMO. Criterion seems ok but I haven't spent much time with it.  \n\n",
        "upvotes": 16,
        "comments": 20,
        "media": null,
        "permalink": "/r/movies/comments/1hq5vcm/best_places_to_watch_classic_movies_pre_1960s/"
    },
    {
        "id": "1hpvl3h",
        "author": "JayDunzo",
        "title": "Ghost Ship is a chef’s kiss so-bad-it’s-good movie",
        "content": "It's an amazing, accidental work of art. A mindblowingly stupid, entertaining total blunder of a movie. The choices in the dialogue and plot are epically dumb in the best possible way, and it's all dead serious. There's not a single attempt at comedy or comic relief. All purely unintentional. It's up there with stuff like Anaconda or Ewe Boll\nmovies, but somehow even better. The whole movie, you're just like: Wait.. noooo, they're not seriously. Yep! Wow. How could they have decided to go with that line?! We were blown away with entertainment from start to finish, but it IS a bad movie at the end of the day. The only downside is it leaves you wishing you could watch it for the first time again. Not much re-watching value. \n\nIt made us think a lot about what constitutes a so-bad-it's-good movie. I think the only rule is: You can't try to make one on purpose, like these corporate, faux-meta wink-wink, fake it's-so-bad-it's-good movies of today. The 80's and 90's are peppered with great ones, but I think the early 2000's were the apex. It's so embarrassing and hilarious what audiences thought was cool back then ",
        "upvotes": 63,
        "comments": 88,
        "media": null,
        "permalink": "/r/movies/comments/1hpvl3h/ghost_ship_is_a_chefs_kiss_sobaditsgood_movie/"
    },
    {
        "id": "1hpkfwj",
        "author": "Blindfolded66",
        "title": "Top 10, but excluding IMDB top 250",
        "content": " What is your Top 10 list that doesn't include your typical Shawshanks, Terminator2s, Godfathers, etc?  The bottom of the Top 250 is 8.0, so for simplicity I made my list of 7.9 or lower.  But anything 8.0 but not currently on Top250 is fair game.  \n\nMine, in no particular order:\nGattaca\nOceans 11\nHigh fidelity \nBack to the Future 2\nEdge of tomorrow \nArrival\nRounders\nPrimer\nBig Short\nMoneyball",
        "upvotes": 284,
        "comments": 209,
        "media": null,
        "permalink": "/r/movies/comments/1hpkfwj/top_10_but_excluding_imdb_top_250/"
    },
    {
        "id": "1hpqs6p",
        "author": "everonwardwealthier",
        "title": "What's a good movie to watch on New Year's Eve?",
        "content": "I'm not getting any good ideas and want the movie to be holiday appropriate for once since I don't usually. Maybe a movie that takes place on new years and has new years as a theme. Got some ideas about this?\n\nThis post needs to contain 300 words but there really isn't anything to say except what I wrote in paragraph one so I am going to add this second paragraph amd let the thread slide past the Reddit censor bots but I tell you what they should let you re-edit a rejected post instead of making you create a new one that would make things somewhat easier without the redundancy so there it is if that ain't enough then I am not going to write a third one.",
        "upvotes": 97,
        "comments": 265,
        "media": null,
        "permalink": "/r/movies/comments/1hpqs6p/whats_a_good_movie_to_watch_on_new_years_eve/"
    },
    {
        "id": "1hpvzf8",
        "author": "indiewire",
        "title": "65 Directors Pick Their Favorite Films of 2024",
        "content": "",
        "upvotes": 40,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/tZ28ksiRG7aFjVV7oONlzQaWn4zlRywaHKHV5HoDwIg.jpg?auto=webp&amp;s=5d2aa99bc3e4d0fdc7798e2085631e5bdf9f6314"
        },
        "permalink": "/r/movies/comments/1hpvzf8/65_directors_pick_their_favorite_films_of_2024/"
    },
    {
        "id": "1hp017o",
        "author": "MarvelsGrantMan136",
        "title": "‘Wicked’ Overtakes ‘Mamma Mia!’ To Become No. 1 Stage Musical Adaptation Ever Worldwide",
        "content": "",
        "upvotes": 5488,
        "comments": 414,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xTyd-JjP9SqSPbqD35DgO-zB6ZE3k4cTOy0muCs7_7E.jpg?auto=webp&amp;s=2b34f87749fcf44781623ae25cef3078090eb366"
        },
        "permalink": "/r/movies/comments/1hp017o/wicked_overtakes_mamma_mia_to_become_no_1_stage/"
    },
    {
        "id": "1hq9bef",
        "author": "erzastrawberry101",
        "title": "Lust, Caution (2007) and father complex ",
        "content": "I just finished watching Lust, Caution by Ang Lee and HOLY SHIT this is my favourite Ang Lee I've seen so far. I have almost nothing but praise to offer... but I understand the critique of the romanticization of rape in this film. I think that it is totally reasonable for a person to avoid and express distaste towards media with rape and violence in it (regardless of whether or not that film is condemning or supporting rape). I also agree that male filmmakers in general always seem to be a bit *too* interested in exploring the impact of rape on women, and are interested in articulating that with long rape scenes.\n\nThat being said, I think that Yee's sexual aggression in this film is crucial to a major part of Wong's character: her daddy issues. I'm actually surprised by how almost no one is talking about this, as I think her relationship with her father actually impacts a lot of her decisions.\n\n**Her relationships outside of Yee**\n\nDuring her escape to Hong Kong from the Japanese, she tells her friend that her dad originally took her younger brother with him to Britain to escape from the Japanese. When asked why he didn't take Wong with him, her father cites financial and political issues as excuses.\n\nThe first news that made her cry in the movie was her father remarrying in England. She first hides her despair in front of her roommate and promptly writes a congratulatory letter. However, she secretly cries her heart out in the darkness of a movie theatre. This is paralleled by the content of the movie she's watching, where the American actress says \"There are some things I can't bring myself to say...\" .\n\nAdditionally, the American man (in the movie Wong was watching) appears to be confessing his love for her despite the fact that her has a family, which resembles what Wong's father did by marrying the Englishwoman. Overall she seems quite heartbroken that her dad just forgot about her and started a new family far away.\n\nThe tears she shed during the nationalist play is channeled from her love and resentment towards her father, as he might as well be dead to her at that point.\n\n* Wong waiting for her father to send for her is paralleled by the play's character waiting for her brother to come back home from the war.\n* The play's character clearly sees her brother as a father figure, because he \"carried the whole family on his shoulders\" after the father died.\n* The brother, like Wong's dad, never comes home.\n* Because the brother died fighting for China, the play character starts making a speech about Chinese national pride. This is contrasted by her father abandoning her AND China itself.\n\nThe play can be seen as a microcosm of the whole movie: Her father left her, so she puts her energy towards the independence movement. Additionally, the play's character points out that Kuang's character resembles her brother- which is what I think Wong feels about Yee (I will get to that part later).\n\nOf course, I also acknowledge that she may have joined the movement because: (1) she intellectually agrees with it, (2) slight peer pressure, as the only people she is close with are her KMT friends, and (3) Kuang.\n\nKuang simultaneously represents everything her father is and is not. Kuang, unlike her father, is *passionate* about something and actually takes initiative to achieve it as soon as he gets the chance. While I don't think Wong's father is indifferent to her, it is clear that he lacks the initiative to get her home.\n\nHowever, by crushing on a guy who is already married to the independence movement, he clearly does not have space in his heart to be equally devoted to her as he is to the KMT. This is revealed to Wong through how he just let her and their friend have sex because both Kuang and Wong are virgins. If Kuang cared about Wong as much as he cared about the movement, he would've 'stepped up' and volunteered to lose their virginities together. In terms of how much they are *willing* to do for Wong, Kuang and Wong's dad are the same.\n\nSo basically, every man in Wong's life cared about her; but in a lukewarm, rational way: \"I can't bring you to England because I'm short on money\" and \"I can't take your virginity because I'm a virgin myself\". If her father or Kuang were even slightly obstructed from seeing her, they would most likely shrug it off and not 'take initiative' to be with her.\n\n**Wong's relationship with Yee**  \nAlthough I don't think Wong believes that Yee loves her unconditionally, Yee is the only man who shows 'initiative' and assertiveness beyond all reason. This is articulated in the rape scenes.\n\nIf you look at Yee's behaviour on paper, he just treats Mak (Wong's pseudonym) like a typical mistress. The bedroom is the only time where he expresses behaviour that is so aggressively passionate, that the level of violence feels like he's gonna kill her in any second.\n\nThese sex scenes are literally the only time when someone in Wong's life expressed passion to her- which is why I think she spared him at the end of the movie.\n\nI'm not a huge fan of the trope that all of women's bad decisions and toxic taste in men stem from a weak father figure, I do think this film expresses articulates idea in an interesting manner.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1hq9bef/lust_caution_2007_and_father_complex/"
    },
    {
        "id": "1hp805m",
        "author": "DonkeyOT65",
        "title": "The best \" Brit playing an American \" accent or vice versa? ",
        "content": "Was watching Bullet Train tonight, not the first time I've seen it, but Brian Tyree Henry was the most convincing American actor portrayal of an English accent I've ever encountered. \n\nI was convinced he was British, only to Google him and find he is American. Brilliant accent and portrayal. \n\nWho else has done such a convincing Anglo/American or American/Anglo mastery of the respective accents? ",
        "upvotes": 1467,
        "comments": 2200,
        "media": null,
        "permalink": "/r/movies/comments/1hp805m/the_best_brit_playing_an_american_accent_or_vice/"
    },
    {
        "id": "1hpskum",
        "author": "indiewire",
        "title": "Adria Arjona Interview: Actress Talks 'Los Frikis,' 'Hit Man,' More",
        "content": "",
        "upvotes": 37,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QI5lf-GrC5QYxe6MlwRKrwUVfU7oNHKxkDLEBDIFe3c.jpg?auto=webp&amp;s=b1af58baaf70b40e4f52521f6cb21a36c151e407"
        },
        "permalink": "/r/movies/comments/1hpskum/adria_arjona_interview_actress_talks_los_frikis/"
    },
    {
        "id": "1hq6e2v",
        "author": "Pumice1",
        "title": "The Shining (1980) - Hallorann’s bedroom decor",
        "content": "This might be the most discussed film in history, but I don’t think I’ve come across any debate around Hallorann’s bedroom decor.\n\nWhat do you think of Hallorann’s choice of pictures?\n\nIf you were his guest and you happened upon them, what would you do?\n\nIf things had turned out differently and Hallorann and Danny became friends after the events of the film, how would Danny have reacted upon seeing them?",
        "upvotes": 4,
        "comments": 11,
        "media": null,
        "permalink": "/r/movies/comments/1hq6e2v/the_shining_1980_halloranns_bedroom_decor/"
    },
    {
        "id": "1hq8pq5",
        "author": "EsquireHare",
        "title": "Phantasmagoria: My Favorite Films From 1999",
        "content": "",
        "upvotes": 2,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g0pH_Bqb2Xcm3r2LCOnJ6Giq1FsdgoZ55SO7-Cgn3eY.jpg?auto=webp&amp;s=b16b488f938eb6694c8a6ae516fafbfb8f0ea086"
        },
        "permalink": "/r/movies/comments/1hq8pq5/phantasmagoria_my_favorite_films_from_1999/"
    },
    {
        "id": "1hqaf9x",
        "author": "dremolus",
        "title": "Top 25 Favorite Films of 2023",
        "content": "https://preview.redd.it/nninfjqc95ae1.png?width=1680&amp;format=png&amp;auto=webp&amp;s=41559b3106b5d99cc7363039882fb3eada7024b1\n\n**#25. El Conde** \\- I'm actually quite surprised how many people found this film dull or boring because I was frequently laughing throughout and at times harder than I have for some comedies. The gothic premise of a notorious dictator who in actuality is a greedy, immortal bloodsucking monster might be on the nose but it’s balanced by the movie’s genuinely smart wit, brought to life by a talented cast. From the follies of his idiot children simply wishing to usurp their father and gain their inheritance, to Jaime Vadell playing Augusto Pinochet as both an empty shell of a man and still a ruthless manipulator still one step ahead of everyone when it comes to tactics, to Paula Luchsinger stealing the show as a nun sent to assassinate Pinochet. Her wide-eyed innocence, deadpan comedic timing, and horror at the reality actually makes for some of the funniest but also most beautiful scenes in the film. And for as on the head as the film is, it doesn’t shy away from how truly evil Pinochet and his neoliberal politics still are in modern times. And with the gorgeous cinematography from Edward Lachman who deserves his Oscar nomination, it’s a dark comedy that I hope finds more appreciation over time.\n\n**#24. Close Your Eyes** \\- I don’t even want to give too many details as to what to expect because describing in detail would blunt some of this film's impact in my opinion. Victor Erice’s first non-documentary film in 40 years, following a filmmaker finding an actor and friend who’d disappeared long ago by retracing his steps through his work, is a film that skews traditional description. Not so much with experimental film techniques but more in terms of providing an experience. Like with Trenque Lauquen, it’s less about what you’ll find and more about the journey of discovery, or in this case re-discovery. Through the films we make, the picture we print out, the memories we've held on to and the ones we've tried to forget, all of it forming images of the people we though we knew against actual reality. At times it can be hard to separate our dreams and subsconcious experience and what we rationalize. Even by the end which I won't spoil too much, there doesn't seem no clear answer given. At the same time you’re hard pressed to say it wasn’t worth it or that some of the reflections you've had aren't valid even if you can't create a full picture. Out of any film on this list, this is one where what you take and how you react from it in the end isn't one I want to lean on to hard. It simply has to be one you have to see with your eyes wide open, one ready for an open experience.\n\n**#23. About Dry Grasses** \\- A 3 hour and 17 minute film about a grump of a teacher stuck in the frigid environment, constantly having disagreements with his young students and some of his colleagues, and wanting to escape the remote cold of Eastern Anatolia may sound like a boring and overall dreadful experience. At times it is and this is a film that demands patience with its deliberately slow pace and closed filmmaking; there are a lot of tracking shots of still conversations. But give it time and the film’s writing and journey will make for a rewarding character journey. It’s a movie that puts you not only in the shoes of the teacher but also his partner, friends, and students - those who counter his disdain for life and others not just through the philosophical disagreements but also in living life that runs against his demeanor. And it's brought to life by Deniz Celiloğlu. The cynicism and self hate he brings is sharp but as is his self-awareness and eventual regret of how his attitude has made him even more resentful than he should. How much of the anger he undeservedly thrust on his partner and some of the kids he taught, and how much humility he ought to have had. The runtime will test the patience of a lot of people and I don’t begrudge anyone who feels drained. But if you’re willing to walk through the grasses, you’ll find profound beauty and life once the cold goes away.\n\n**#22. Robot Dreams** \\- A dialogue free film about the friendship and hijinks of a dog and a robot is typically the type of normal, cute but inert animation used to distract kids for a half hour. And while it is charming and cute - and the slapstick and humor does have a nice Saturday morning cartoon vibe in the best way possible - there's so much more beyond. The way they managed to create a touching and emotional story about their friendships through basic facial expressions and interactions. They capture so much about loneliness, the struggle to find connection to make mundane life meaningful, and the depression when that friend or partner leaves your life either by happenstance and through no (intentional) fault of your own. And yet, there is still so much joy in celebrating the experiences and memories with those we have in the moment and that we will find connections even when people leave us. The use of Earth, Wind, &amp; Fire’s ‘September’ which is used constantly could’ve so easily come across as repetitive and desperate and yet here it’s a sign of how the simplest things connect us to others, strengthen the bonds we do have, and make us reflect on the good even when we’re not there. It's a sneaky little film that didn't get enough love outside of a well deserved Oscar nomination but it's the type of family film more people need to discover.\n\n**#21. Priscilla** \\- Sofia Coppola is a woman fully aware of her privileges, tropes and skillset. It can make her films predictable at times and I have seen criticisms even from her fans that this plays in a familiar wheelhouse for her. Yet I've feel she's still able to make this familiar themes and explorations of femininity within gilded cages feel engaging, captivating and unique. The transformation of Priscilla Ann Wagner into Priscilla Presley is not just with dialogue and Cailee Spaeny's great performance. The use of make-up, the use of other 60s and 70s music not by Elvis himself, the paradoxically claustrophobic mansion she lives in, it all creates the image of a woman slowly being lured into being someone's doll wife. And while everyone’s already praised Cailee Spaeny in the title role, I also wanna give credit to Jacob Elordi as Elvis. Not just because it’s a stark, 180-difference from how he was portrayed and acted in Baz Luhrman’s Elvis, but also because it adds to the deconstruction of the Elvis Mythos. Rather than this larger-than-life icon and American legend, he is but a man with a charm and charisma that would make a vulnerable, shy, and impressionable girl want to be around. Even if this is not Sofia Coppola's best work, it still shows a filmmaker who's still got it.\n\n**#20. Nimona** \\- The Swan song of Blue Sky \\[or at least it was before Disney abruptly cancelled it before it was finished\\] is perhaps the most punk animated movie for kids since maybe A Bug’s Life? I mean what other kids' film has an unabashedly queer narrative about an ambiguously gendered protagonist taking down a historically homophobic system and challenging their history and propaganda that ignores the discriminator system its created. And while the message and themes are one thing, what I absolutely love is the animation in this. It’s not just for having a distinct style and looking pretty, but just the movements of the characters. It’s almost as if they’re moving just as the animators have barely finished mapping out the movements and that the frames have to catch-up with the characters. Yet it doesn’t feel messy; there’s something so fluid and electric on how they glide around yet still have these big expressive faces and reactions. It makes for not just chaotic action scenes but also a good sense of humor as well. And while the voice cast is solid, Chloe Grace Moretz grabs this movie by the shoulders and she gives probably the best voice performance in 2023. I’m so glad Annapurna Animation managed to revive the project and deliver not just a touching movie, but a creative and inclusive animated film that can be enjoyed by young and old, queer and straight.\n\n**#19. riceboy sleeps** \\- The Asian immigrant story from the perspective of children has been popping up more and more in recent years with shows like Kim’s Convenience, and Fresh Off the Boat, to movies like Minari and Dìdi. But out of all of them, I don’t think any affected me quite as much as Anthony Shim's semi autobiographical film. And what’s funny is that on the surface, it isn't all that different from the examples I mentioned. There still is the conflict of choosing which cultures to adopt more in life as well as disagreements with parents. But the direction is one so gentle, patient, and understanding that it doesn't feel like going off of a checklist and playing up to caricatures of Asian immigrant families. It feels real not just because it's drawing from real life but because we're drawn in not by big events but the small ones between a mother and a son. The reading of a children's book, the disinterested meals at home, the desire to keep that patent bond still strong even as the children become curious and confused. These are general universalities made exclusive and impactful with this one family and makes it feel unique. Add on an exceptional performance from Choi Seung-yoon and you have a coming of age story that'll resonate even if you don't have immigrant parents.\n\n**#18. Rotting in the Sun** \\- It's one thing for a comedy to be meta and self-aware of its own absurdities and self-deprecation, it's another to elevate a story to such extremes for entertainment and compelling melodrama. Without a doubt one of the funniest comedies of 2023, it's a movie that plays against all expectations as you come in. From the characters to the story to the queerness of it all to what appears to be the central themes and messages, all of it is laid still before being yanked from under your feet, some of what happens legit made my jaw drop before howling with laughter. And yet despite what could be overcomplicating a film, there's such a sense of control throughout and a patience the audience will be on board for what director-writer-star Sebastián Silva throws at you. It's not simple quirkiness for the sake of random gags, and both the humor and the drama hit harder because of that. With great lead performances, particularly Catalina Saavedra during towards the latter half, I highly suggest you seek this out before I ruin some of the fun.\n\n**#17. When Evil Lurks** \\- For as bleak as films can get, in and out of horror, there’s at least some safe zones, some pockets where you can hide and take time to breathe. Well you can forget feeling any form of comfort while watching this movie as this is a film that shows you just how ruthless and unforgiving pure evil is. Those that would be immune from the harm in most movies - the most vulnerable such as pregnant women, the sick and dying, and various innocent children - aren’t spared. Some might see this as being exploitative, even needlessly cruel, and perhaps it is. In lesser hands, this might be gratuitous misery to the point of being over-the-top. But with Demián Rugna’s guided direction, it makes the characters trying to survive feel more real, the atmosphere feel thick and inescapable, and makes the kills and deaths even more scarring. It's a film that's hard to recommend for how unforgiving it can be but pulling any punches would've neutered any impact it had. If you have the stomach and bravery for it, highly recommend.\n\n**#16. Poor Things** \\- It's hard to know what to even add and while I don't think this is the best Yorgos Lanthimls movie ever - I wouldn't call this his magnum Opus - it's perhaps his most creative and wildly imaginative movie to date. It's just a joy seeing as how he adapts a unique steampunk world from Alasdair Gray novel, it's not just the redux version of Frankenstein's monster but also the production design, the cinematography, the color coding, the costumes, it's like a tribute to Terry Gilliam or Tim Burton while still feeling Lanthimos. And while a lot of awards have been given to Emma Stone and her daring performance. She perfectly brings to life the characters' wonder, curiosity, amusement, sadness, and eventual integrity and intelligence - There's a reason she won her second Oscar for this movie. But I hope most don't discount it’s not a one-woman show because the other cast members are equally able to balance the humor of the situation. Willem Dafoe, Ramy Youssef, an hilarious Mark Ruffalo, Christopher Abott who's so entertaining at the end, even Margaret Qualley is great in her few minutes of screen time (and a precursor to some of her wilder moments on film in 2024). Like I said, it's hard to even know what to add beyond yet another great film from Lanthimos.\n\n**#15. All of Us Strangers** \\- The ghosts of our past are the ones that'll haunt and taunt us the most. What I could've said, what I could've done, and what I could've been are some of the most painful thoughts to think about. These aren’t any new observations but it doesn’t make it any less painful to treat wounds. To move on but accept tragedy and embody it to be a stronger man, to make people proud by living life -  it is a hard task, easier said than done because no one wants to experience pain, particularly not trauma that may take us back to our lowest points. And yet providing closure to any can be some of the most important things done. And at the center are a Quartet of devastating performances guiding us through grief, not just Andrew Scott who should've gotten more attention, but Paul Mescal, Jamie Bell, and Claire Foy also capture so much acceptance and forgiveness jn their scenes with just a few phrases. I also wanna praise the cinematography and editing as it adds to the wistful nature of the film, everything is detached from reality and the only thing anchoring us and our memories are the emotions felt. It's a devastating film, my favorite by gar from director, heartbreaking yet affirming of love. \n\n**#14. Barbie** \\- It was the highest grossing film of last year and a theatrical event for a reason. Despite no big action setpieces anchoring the film, Greta Gerwig delivered one of the wittiest blockbusters in a while while still being thoroughly entertaining as a crowd pleaser. People may roll their eyes at the admittedly basic positions on feminism and gender solidarity of the film, and how blunt it can be. But I think that does a disservice to not only the creative and imagination of the production and the worldbuilding, but also to this film as a comedy. There are some fantastic jokes and slapstick that holds up, and the chemistry from the cast - not just the two leads - with the Kens, Barbies, Mattel executives, and Alan all being wonderful and charming characters in their own right. And of course, Margot Robbie and Ryan Gosling embody Barbie and Ken in some of the picture perfect casting to a major IP since Guardians of the Galaxy. Add on to that a soundtrack that was sung ironically one of my favorite albums to listen to last year, and you have a film that unlike so many blockbusters actually deserved to be one of the highest grossing films of all time and made for one of my favorite theatre experiences ever.\n\n**#13. The Boy and the Heron** \\- I could write a 7 page analysis of Hayao Miyazaki's final film taking apart every symbol and dissecting the themes. I will admit it can feel overwhelming taking in the abstract ruminations on post-war grief and trauma, the impermanence of legacy, the ability to find magic and joy in a world where even nature can be cruel, and the fact some birds are scary. And yet for dense as the film is, it also still works as every other Miyazaki film does with a great sense of wonder and awe at the world. It still is wonderfully imaginative with its fantasy world, it still is animated as gorgeous as ever. It still is full of charming characters who anchor the weighty themes jb an engrossing adventure. It still has that dreamlike atmosphere very few even in anime can manifest. Everything dies, nothing last forever - even the magic of cinema may fade. But this film isn't about the grief of the end, but about the gracious beauty of being able to grow up and experience life while its there. About the celebration of having been able fly and touch the sky. And as for Miyazaki's Swan song, I can't think of anything more poignant.\n\n**#12. Perfect Days** \\- There are a lot of quiet, understated films each year but I don’t know how many of them really grapple with the quiet as poignant as this film. It’s a movie about being content with a mundane experience, not so much being resigned to it and quietly giving up, but not fighting back against reality. Rather instead, trying to gain wisdom, joy, and even see the beauty through the routines we craft for ourselves. Being a simple janitor and smiling as you help people, listening to classic rock on cassette tapes, reading literature to fall asleep, even sitting at a bar not to talk but just have company, all of these feel too ordinary to properly appreciate. But taking things for granted would limit some of the joy we’d feel in the world and no one would ever choose to feel more miserable than they already are. And the power of this film couldn't have worked without Koji Yakusho's brilliant performance. Through just his simple smiles, hand gestures, and nods, he shows off a man who's reflected a lot on his life. It’s not a blind optimism, he’s not simply distracting himself from the problems in his world and with the world as a whole. There is still conflict you can't control and tragedy and trauma still can happen. But angst and sadness don't need to dictate his life or yours. He’s chosen happiness and pride for what he has and what he’s accomplished because at the end of the day, life is taking what you’ve been dealt and making the most out of it. Each time I think and reflect on this film, it gets better and better and I hope it can be the beacon of light it is for others as it has been for me.\n\n**#11. The Zone of Interest** \\- For evil to thrive and prosper it needs to be normalized and domesticated, seen as something so ordinary one can pass by and not give a second thought about the suffering very loudly around them. And much like passive evil, this is a film that sneaks up on you and seems unassuming. It'd be easy to boil the film to just the everyday life of an Auschwitz officer with nothing much going on, the themes aren't particularly subtle and if you don't get much emotional, I understand. But like with his last film Under the Skin, Jonathan Glazer is smart enough not to lecture you and instead allows you the space to really grasp the reality of the situation. While much of the praise has gone in the sound design, showing how horror can't ever be properly silenced no matter how much one tries to ignore, there are also so many shots they've stayed with me and convey just as much fear. The one that kept coming back to my mind girl in blackened thermal vision, shining amidst a dark landscape - one of the few traces of humanity that has been able to cling to itself in spite of everything around jt. And it all finished with an ending that is one of the most daring and ambitious of 2023, and one I'm still dissecting. It's It's film that's gotten better and better the more I say with it, and with the evils of the world being the clearest they've ever been but also some of it being so normalized, it makes the power of this film even more haunting…and worrying. \n\n**#10. The Teachers’ Lounge** \\- A film I feel despite the acclaimed reviews, I still feel is underappreciated. Perhaps its because yet another European film about doubt, professionalism, and the effects on those caught in the middle- particularly children - also came out and perhaps took most of the air of the room but I think it does a disservice to this film which I feel comes close to matching the power and is just a tightly written as a thriller. Leonie Benesch is incredible as the teacher having to take all the hits and keep any anger and frustration to herself. Not just for the sake of professionalism, but also from any innocent children who are already at risk of being collateral damage from the side and who don't deserve. It also doesn't devolve too much into contrived drama for the sake of having tension. And it could've been too given the small setting and relatively low stake. And yet Everyone is understandable in the doubt and distrust with people or systems they have but never to the point of unlikability. You see and understand the paranoia they have but there's also the lingering sense that they're not that far from compassion and coming to an understanding. Which makes it all the more heartbreaking when they stop just before they can go further, typically from a rolling effect of their actions pushing pushover forward before their ready. Even the ending which has been divisive with some, I think perfectly suits the uncertain path the characters have crafted for themselves. Maybe they won't see a long lasting compromise in the end and one will be burned more than the other. But for a moment a bridge was crossed and they met in the middle. It's smart and intelligent in crafting tension and engaging drama and I do hope more can appreciate this film down the line. \n\n**#9. Oppenheimer** \\- It's hard to say anything new about Oppenheimer over a year after it's been released and especially after sweeping seemingly every major award show. Every aspect of this film has been practically acclaimed and awarded. The cast is the best assembled for any Nolan film: not just from Cillian Murphy and Robert Downey Jr. 's award winning performance but also supporting roles that make these historical scientists less figures caricatures to real people. Josh Hartnett, Benny Safdie, Matt Damon, Tom Conti, Jason Clarke, Alden Ehrenreich, even Gary Oldman’s one scene is one of the best in the film. The still incredible cinematography from Hoyte van Hoytema and score by Ludwig Gorranson are just as impressive to sit and listen to outside of a big IMAX theater. The editing and story pace that’s perhaps Nolan's best use of out of sequence storytelling maybe ever, managing to still be engaging even when the Trinity test isn't the big climax as most would expect. And it's his most mature story ever: not just in the big topic and scope but thematically. The ideas of ambition and discovery being corrupted for destruction and ego (both of the self and by the system around you) and the devastating and catastrophic consequences that could occur as a result of your hubris is terrifying. For as much as Nolan's expository dialogue has been mocked, it's the shots of Oppenheimer's reactions - to Truman's decision, to realizing the destruction caused in Japan, to the guilt of what humanity could do - that resonates more than any line here. What more can I say? Everyone's already praised it and no doubt more will down the line. \n\n**#8. Godzilla Minus One** \\- And yet Oppenheimer won't be my favorite film about a nuclear attack firing World War 2. I come at this not knowing a lot of Godzilla media so I don't claim to say this is the best film in the franchise. What I can say is that this is by far one of the best blockbusters of the 2020s so far, big not just in spectacle but in emotion and melodrama without devolving too much in tearjerky sappiness. The special effects won an Oscar for a reason, even if they don't look the most expensive there's a weight and impact to them that makes them so much more engrossing than films with hundreds of millions of dollars. The attack on Ginza is still one of the best action set piece as you feel the weight of Godzilla with good framing and sound effects. And yet like everyone says, it's the scenes without Godzilla that are just as interesting. The characters are painted in broad but colorful strokes that j love seeing their interactions with one another. The teamwork during the Boat, the discussions on what to do following Ginza, the fight for what honor means in the gave of destruction, if you had replaced Godzilla with any attack on Japan, these scenes would still be so powerful. The themes of what use is national pride for those most vulnerable, government inaction, and the unity of those left behind who realize that fighting for each other is for more noble and important that fighting for simple identity. It's a blockbuster that equal parts emotional and entertaining and had Toho actually put this in more theaters outside of Japan, this maybe would've even higher because I envy those who witnessed this in a theater.\n\n**#7. Red Rooms** \\- One of the good things about delaying my list has been the fact so many films that went under the radar or undistributed or with little fanfare when they came out in 2023, are now getting the attention and acclaim they deserve. And out of all the films last year that this has happened to, by far the most exciting thing I’ve seen has been the discovery of many Red Rooms. A thriller that not only looks at a perverse obsession on true crime and the self centered nobility to “find truth” but also examines the outside reactions to these emotions, it’s a must see for even those who aren’t normally fans of psychological dramas. Because while he does treat the situation with respect and seriousness, what director Pascal Plante does that's so ingenious if it's not simply an exploration of character behaviors and motivations. He allows the audience to reflect how uncomfortable they get and what that means. How much would you tolerate someone who defiantly believes the innocence of a convicted child killer? How much should they be dismissed and laughed at, and how much of that mockery helps them? How much do we think is general curiosity for those obsessed with finding answers? Rather than give his answer and position, The incredible performances from Juliette Gariépy and especially Laurie Babin only add to this open-ended discussion: they are not out to make their characters relatable or sympathetic and for some they may indeed be too unlikable to be invested in. But they’re taboo in the best way: pushing you towards the limits of how much ‘humanity’ they can have while still being intact, even as they potentially alienate everyone else around them. And I can’t go without mentioning the sound and editing of this film; very similar to a Jonathan Glazer film in terms of creating a cold, clinical space as you’re left to analyze what’s in front of you, lulling you into a sense of serenity and puts you on a near level as the two leads. Not so much in the sense of feeling trapped but your own perverse obsession keeps you seated. That video scene is one of the most haunting scenes in any movie of 2023 - horror or not. As I said, I love how many people have been finding out about this film in 2024 and I do hope more people can  praise this film. I’m looking forward to what Plante does next in the future and if he can make something as close to greatness as this.\n\n**#6. May December** \\- Somehow out of all the films that came out last year, the scariest film and most unsettling for me revolved around the fictional retelling of a student-teacher affair for a trashy drama biopic. On a certain level, it is funny for me to place this right after Red Rooms as they're quite similar. Both films feature two great performances from actresses in the lead, both look at our fascination with crime, and both ask you to step into the shoes of a seemingly unassuming woman that by the end will leave you questioning their morality when it comes to seeking “the truth”. But whereas that film took a direct look at horror, this one lures you into a false sense of security. The campy piano score, the coldly lit domestic sets, the dark humor at the start, all of it sets you to feel at ease. It's a film that ensnared you with the premise and tone of being a trashy, melodramatic retelling of real events before slowly unraveling and peeling any artifice of the situation and reminding you of the dark reality at the center. And in that center are a The Trio of performances from Julianne Moore delivering a late career defining performance to Natalie Portman in one of her darkest and challenging roles in a few years, especially towards the second half of the film, and Charles Melton who gives a breakout role as a man who's nor fully processed the trauma, abuse, and emotional manipulation he's still trapped in as a young teen forced to be an adult for several decades now. It'll no doubt be a hard to stomach film and too controversial for some, I could easily see a misinterpretation of this glamorizing a toxic situation. But those who take a step toward the uncomfortable will find something unforgettable. \n\n**#5. Spider-Man: Across the Spider-Verse** \\- I mean, what can I even SAY? I loved Into the Spider-Verse when it came out at the tail end of 2018 and yet even with high expectations coming into this film, I didn't expect the sequel could improve on what was already high quality. Of course the animation is good and despite the conditions of the animators involved, they managed to create one of the most beautiful films of the year. I love not only the traditional art style of these films but their boldness to mix in other art styles, coloring and shading techniques, character movements, all without making it feel distracting or ruining the flow of the film. I do hope they are compensated in the future for when Beyond the Spider-Verse comes out. The score is also so exhilarating; Daniel Pemberton easily created one of my favorite scores of last year and like with the animation, it’s not just pleasing to listen to. I like the little sound motifs for various characters, and the mix of EDM, orchestral music, hip-hop, and even punk to create a score I don't think I've ever heard outside of maybe Arcane. I And of course the story is so adventurous. After both Disney and Warner Bros. have failed to take advantage of the creative possibilities of a multiverse within a superhero setting, Sony has not only taken full advantage of a multiverse but also created a unique world different from any of the three live-action Spider-Man films. And what's great is it's not just silly references and jokes that they're for - although the humor in this is also so fast and tight. It's the themes of destiny and fate, how much are we in control and how much can we change, that makes for great blockbuster storytelling. Sony hasn't done many things right when it comes to Spider-Man but they've nailed it with these two films and although it seems daunting perhaps they can top themselves yet again with the third film and create a new modern classic trilogy.\n\n**#4. 20 Days in Mariupol** \\- There are some films that you feel wrong about grading high. Not because of lack of quality filmmaking or disagreement with the talent involved but more because what about the subject matter could be considered good or entertaining. No matter what you think about the war, and the geopolitical background behind it, there’s no humane rationale for acts of mass violence. Mstyslav Chernov said that he would’ve taken his film never being made for Russia had he not invaded and it’s hard to argue against it. There’s no words that could downplay or exaggerate the gut wrenching footage of children playing football to suddenly be attacked by bombings or injured pregnant women dying due to a lack of electricity in hospitals. It's less of a film and more a historical document of what’s happened, even without the knowledge that many of what Chernov had shot actually being broadcasted by other news organizations, including daily coverage. It's a film who's importance and urgency can't be overstated and when we look back on this dark period of European history, documentaries like these will be important artifacts to remind people what was ultimately lost and no matter what the outcome of war is, none of it is ever worth the price.\n\n**#3. Anatomy of a Fall** \\- I'll admit I'm not typically the biggest fan of courtroom dramas, not really my favorite type of thriller,  but even I can't deny the greatness of this film. It's won Best Screenplay at Cannes, Golden Globes, and The Oscars for a reason. Like The Teachers’ Lounge for such a simple premise, it manages to find a way not only to wring some of engaging tension, but emotional storytelling without resorting to over the top dramatics, cliches, and conveniences. It's not a film concerned with finding innocence amidst doubt but more what suspicions do. Whether or not you believe Sandra was actually the killer of the film or even that she has plausible reason to do it is irrelevant to the film as a whole. Because the doubt and the mystery is the point. The fall isn’t just oh Samuel but of Sandra; as a writer with authenticity, as a caring wife and mother, as someone to trust. It’s this balance that whether you think she did it or not, made for some of the most engaging arguments put to film. It’s this reason, Sandra Hüller gave my favorite performances by an actress in 2023 and I would not have minded if she'd won more major awards. I hope with this and Zone of Interest, she does get more roles in big films. But truth be told, everyone gives a standout performance. Swann Arlaud, Milo Machado-Graner, Samuel Thesis, Antoine Reinartz, and of course the star of the film: Messi. When a French Border Collie can give one of the best performances of the year and be pivotal in one of the most dramatic scenes, you know you’ve crafted a great thriller. It’s deserving of all the acclaim it’s gotten and I’m eagerly anticipating where Justine Triet goes from here.\n\n**#2. Past Lives** \\- There’s so much I want to say about this film and that has already been said. Rhr gorgeous score by panda Bear, the cinematography, the insightful and poignant dialogue, The trio of performances are all great - with the standout for me actually being Teo Yoo’s reserved and restrained performance as a man coming to grasp the life he could've had and reflecting on what to do afterwards.\n\nAnd yet what's stuck with me the most is the silence of the film. You think of all you want to say and in the end, it's less about the words said that it is just being there. For all of this films beautiful script,It's the embraces, the reactions, the awkward space between the two of you that leave the biggest impact. People have called this a romance Triangle film and I suppose it is. John Magaro's character even points out how he would be the man getting in the way of their supposed true love and how he'd be left behind by the end of the story if this was a traditional film.  And yet what Celine Song does that is so smart is that she doesn't overplay the romance aspect of her characters lives. Because it is more than just the romance that's left in the past and the what ifs. It's who they are vs what they were. When Hae Sung says she isn't the same Nora, it's not simply because he wasn't there anymore. Both of their lives took place in the background that it's hard to comprehend someone more difficult. And yet even with all that's happened to the two of them, there's still that cosmic connection that connects them throughout their lifetime. I could go on and on what a beautiful debut this is. For the longest time this was my favorite film of 2023 and I thought nothing could beat it. And yet a year as amazing as 2023 had to sneak in one more film to hit me. \n\n**#1. Monster** \\- *\"If only some people can have it, that's not happiness. That's just nonsense. Happiness is something anyone can have.\"* \n\nWhat does it mean to understand someone? Is it simply listening to them? Is learning more about them enough? How do we know we've done enough? We often ask people to try and understand people but understanding one another is easier said than done. Hirokazu Kore-eda's Monster is a film that not only gets that understanding others is difficult and challenging but underscores just why it's even more vital to be in the effort to extend empathy. Every misunderstanding and miscommunication in this film could have easily been seen as contrived and forced for drama but as the film unfolds you see why this happened and how things could be misinterpreted. Human blindsides are shown and critiqued but never to chastise the characters. The children need guidance but adults are also still in need of help. \n\nIt's not a film that browbeats you on being nice to everyone. Koreeda knows better than to simply make a story of how “we all just need to get along.” It's a film that shows kindness, hospitality, defending others from harm aren't always rewarded back and the difficulty of knowing what to do when the universe feels cold and uncaring even when we are “good people” yet come off as monsters to some. And yet despite the lack of clear answers, we still try to understand one another, to reach out. Because when those connections are not only made but properly validated, they can feel life-giving, that a whole new world of joy has been created in these small moments. \n\nI've been thinking about this a lot since I watched it. I could have even talked more about the acting, the pacing and editing, the beautiful score from the late Ryuichi Sakamoto who passed before this film won Best Screenplay at Cannes, and yet all of the technical Pale Pale comparison to the humanist power of this movie. Films this humanist and close to perfect as this tend to have that effect on me.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1hqaf9x/top_25_favorite_films_of_2023/"
    },
    {
        "id": "1hpccgk",
        "author": "Bubbsindistress",
        "title": "I’ve been looking for anybody who has seen Russian vampire movie “Night Watch” for years. Has anybody seen it here so i can finally yap about it? ",
        "content": "It is such a niche movie for me. None of my friends have seen it since its a Russian movie and none of them speak the language except me and I dont think its dubbed anywhere.\nI’d love to watch it again and discus it with whoever has seen it here😁",
        "upvotes": 525,
        "comments": 305,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lC07aRIuQrYY5nBPyx_Sa50zjf9XbD3j9xKXrotnAEw.jpg?auto=webp&amp;s=d380ab15d3182de7ef021c60e8e48a98c7e5a3f0"
        },
        "permalink": "/r/movies/comments/1hpccgk/ive_been_looking_for_anybody_who_has_seen_russian/"
    }
]