[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1p3vavp",
        "author": "Icy_Object430",
        "title": "Just watched VANILLA SKY and I’m shook 😭💔",
        "content": "I know I’m late. But… This movie is top tier heartbreak, romance and sci-fi. Way ahead of its time! Can’t get over it. \nAm I over hyping it or you guys love it too?",
        "upvotes": 19,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1p3vavp/just_watched_vanilla_sky_and_im_shook/"
    },
    {
        "id": "1p3uqkt",
        "author": "fbutterfield96",
        "title": "Warner Bros. Discovery Sale: Company Set to Review First-Round Acquisition Bids From Paramount, Comcast, Netflix",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p3uqkt/warner_bros_discovery_sale_company_set_to_review/"
    },
    {
        "id": "1p34ays",
        "author": "lockmasterg",
        "title": "Something new on main page",
        "content": "I cant be the only one. There's literally 1000s of movies and shows on Netflix. Why does my main page only show me the same 50-100 titles over and over. Most of what's there I've already seen and rated. There needs to be a refresh screen button or something.",
        "upvotes": 153,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1p34ays/something_new_on_main_page/"
    },
    {
        "id": "1p3xkqk",
        "author": "doobied-2000",
        "title": "A question for anyone who has seen the new Frankenstein movie.",
        "content": "I just saw the new Frankenstein movie and I thought it was absolutely amazing! However I'm a little confused about the ending of it. It seems that the monster wants to find Victor but let Victor hunt him all the way to the North Pole? Why did the monster run from Victor just to want to find Victor on the ship? If the monster wants to die and Victor wants to kill the monster why didn't the monster let Victor try to kill him? (Through surgery or any other means).",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1p3xkqk/a_question_for_anyone_who_has_seen_the_new/"
    },
    {
        "id": "1p3udgq",
        "author": "Big-Swing3912",
        "title": "horror films for a date night?",
        "content": "i'm going to this guys house and we wanna watch a horror film. i don't wanna accidentally pick something that's too gross or unsettling, any good picks? i'd like the date to end on a good note. i like paranormal films but prefer slasher/killers. not really a fan of psychological horror. thankyou !",
        "upvotes": 3,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1p3udgq/horror_films_for_a_date_night/"
    },
    {
        "id": "1p3kre8",
        "author": "xTHUGGY_YETIx",
        "title": "Thanks netflix very much",
        "content": "Was halfway binge  watching star trek deep space nine and they had updated the app and now it's gone erase faced from the earth fml 😭 even star trek the next generation is gone my god whyyy ",
        "upvotes": 11,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1p3kre8/thanks_netflix_very_much/"
    },
    {
        "id": "1p3fej2",
        "author": "THEMADLAD_2009",
        "title": "Should I watch boots?",
        "content": "I have seen a bit of it on tiktok and it looks like a pretty decent show.\nI don’t care about all the “pink marine” stuff\nI just want to know if it’s worth the watch.",
        "upvotes": 25,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1p3fej2/should_i_watch_boots/"
    },
    {
        "id": "1p3izoz",
        "author": "Natali-Gessoli",
        "title": "Is it worth getting the no-ads version of Netflix?",
        "content": "Since the new Stranger Things season will be coming out soon, I was debating on whether I should get a Netflix account.\nI’m a college student so I am on a tight budget, and the idea of a $7.99 subscription caught my eye.\nHowever, idk how many ads there are and I am worried they are going to be a lot. I have also heard that not all shows and movies are available, but I’m not fully sure how much is available (like is it a 50/50 available ratio??)\nDoes anyone have this plan, and if so, do you think it’s worth it or should I spend the extra $10 a month for the full experience?",
        "upvotes": 16,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1p3izoz/is_it_worth_getting_the_noads_version_of_netflix/"
    },
    {
        "id": "1p3n305",
        "author": "No-Ability-2272",
        "title": "any shows/movies like last samurai standing?",
        "content": "im really into the whole samurai stuff and whatnot. Im kinda pissed off at the cliffhanger in last samurai standing lol.\n ive also watched rurouni kenshin and golden kamuy, i really like these types of movies and shows so if you guys have suggestions i would be extremely grateful! \nthank you!!",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1p3n305/any_showsmovies_like_last_samurai_standing/"
    },
    {
        "id": "1p3xlzf",
        "author": "jonnywhatshisface",
        "title": "Outage in Greece?",
        "content": "Suddenly in the middle of watching, Netflix started buffering and hung. Unable to watch anything. I’m in Athens, GR. \n\nAnyone else seeing issues in Greece with the service?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p3xlzf/outage_in_greece/"
    },
    {
        "id": "1p3xk70",
        "author": "General-Mention-2897",
        "title": "Red lights flashing in Zero Days Headquarters",
        "content": "Hello everyone,\n\nI'm currently watching Zero Day and I'm at episode 3, timestamp 32:00.\n\nWhen the congresswoman comes into the office, some red lights start to flash. \n\nWhat does that mean?\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p3xk70/red_lights_flashing_in_zero_days_headquarters/"
    },
    {
        "id": "1p3xdtn",
        "author": "Zappingsbrew",
        "title": "Netflix shop DHL order delivery to Philippines got cancelled and returned to sender",
        "content": "Very infuriating. I ordered last month and wonder where it went. Three hours ago, it got changed to cancelled. Filed a ticket to the support team, will wait for a response. I hope it can actually push through, I really want my hoodie. Also any other advice? Thank you",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p3xdtn/netflix_shop_dhl_order_delivery_to_philippines/"
    },
    {
        "id": "1p3rv7l",
        "author": "bidet_enthusiast",
        "title": "Netflix app disabled, disapeared from app store- AppleTV-4k-A2169",
        "content": "My Netflix app was disabled, then I tried to reinstall from the App Store, and it is no longer in the App Store for my AppleTV. I have an A2169 Apple Tv 4K. Account works fine on other devices. Any ideas?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p3rv7l/netflix_app_disabled_disapeared_from_app_store/"
    },
    {
        "id": "1p35lrw",
        "author": "Front_Wade1725",
        "title": "Rewatching stranger things with my kids who have never seen it! So excited for the new season!",
        "content": "Anyone else rewatching and discovering anything new? We just finished season 3, my kids were so sad …. left. Who else is ready for season 5? Also thinking about doing a stranger things feast for them to watch the new episodes!",
        "upvotes": 34,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1p35lrw/rewatching_stranger_things_with_my_kids_who_have/"
    },
    {
        "id": "1p3dkgd",
        "author": "ShinyBuizel22",
        "title": "What's a good K-Drama to recommend for a first timer?",
        "content": "So I hear Netflix is the place for K-Dramas (I mean, for an American audience, idk if other services have a similar library), but I also hear the genre pretty popular so I do want to see for myself. But yes I'm basically a newcomer, so I'm just curious what you'd recommend for a newcomer?",
        "upvotes": 12,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1p3dkgd/whats_a_good_kdrama_to_recommend_for_a_first_timer/"
    },
    {
        "id": "1p3qnux",
        "author": "Animaltamer7",
        "title": "Shows not appearing in one account but do in another",
        "content": "Currently having a problem where the shows on my \"Continue Watching\" list does not appear, even when searching for them, on one account. They definitely weren't marked for leaving since they appear when I search with the other accounts. How to fix this? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p3qnux/shows_not_appearing_in_one_account_but_do_in/"
    },
    {
        "id": "1p3hvan",
        "author": "guncotton",
        "title": "Info screen gone on Smart TV app?",
        "content": "Anyone else? There is no info screen anymore where you can read about a movie/watch a trailer.\n\nI click on a thumbnail and it just starts playing.\n\nJust noticed last night when searching for movies about alpinism. I got my list of search results, but it was all just thumbnails of the movies. I click one, it starts playing. There was no way to get to the info page, where I could read what the heck the movie was about. What kind of search results UX is this? I want to be able to read about the movie I just searched, not just start playing it from the cover photo alone.\n\nThen i noticed this was the case anywhere in the app, you click, it starts playing. In some areas there is a mini description under the thumbnail but not all.\n\nIs the info screen gone now?\n\nI'm on a Samsung 55\" smart tv.",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p3hvan/info_screen_gone_on_smart_tv_app/"
    },
    {
        "id": "1p38nmp",
        "author": "Both-Patient-6193",
        "title": "Please suggest “Rewatch” worthy episodes of Black Mirror",
        "content": "I just feeling like rewatching few episodes of Black Mirror but can’t decide. Please suggest the best episodes you like which are worthy of rewatching.",
        "upvotes": 13,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1p38nmp/please_suggest_rewatch_worthy_episodes_of_black/"
    },
    {
        "id": "1p3bnfy",
        "author": "EffectNumerous",
        "title": "i watched the black rabbit a couple of days ago",
        "content": "Yeah! this show is amazing! I was created with lots of imagination and creativity! I think there are 8 or 9 episodes and just finished episode 6 last night. i find myself bitting my nails from the suspense. i highly recommend it! great actors! ",
        "upvotes": 9,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p3bnfy/i_watched_the_black_rabbit_a_couple_of_days_ago/"
    },
    {
        "id": "1p3vbkl",
        "author": "Only_Highlight2647",
        "title": "Can I remove someone from using my Netflix?",
        "content": "My ex has the password and email 🤦🏻‍♀️ I have no idea where I could log him out from his phone or if it’s possible. Even if I change the password, he’d still be logged into the app.",
        "upvotes": 0,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1p3vbkl/can_i_remove_someone_from_using_my_netflix/"
    },
    {
        "id": "1p3ommv",
        "author": "KremKaramela",
        "title": "Hear me out: “The Beast in Me” could end at the end of Episode 6!",
        "content": "I think it would’ve been an awesome ending like “Inception”. It would leave it all open and terrifying to the viewers. Did he get away with another murder? What will she do? So cringe and uneasy. I know, I know, American viewers want happy ending but I think it would have been so much more interesting. Amazing show, Matthew was brilliant anyway.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p3ommv/hear_me_out_the_beast_in_me_could_end_at_the_end/"
    },
    {
        "id": "1p3rbsu",
        "author": "passmemyvape",
        "title": "is 3.99 not an option?",
        "content": "I'm new to netflix, pls someone kindly help me. I purchased the 3.99/month option on oct 31, but it says the service period is oct.31-nov.16??? Why is it half a month? and it says the next billing date is on dec.17 and will charge 7.99. ",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1p3rbsu/is_399_not_an_option/"
    },
    {
        "id": "1p3gt3c",
        "author": "feministacareers",
        "title": "The Tourist - vanished?",
        "content": "I was in the middle of Season 2, and it just disappeared. Usually shows that are leaving have a flag “leaving soon.” Does anyone have any idea what happened? ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p3gt3c/the_tourist_vanished/"
    },
    {
        "id": "1p3k3t1",
        "author": "harpreetthind",
        "title": "Question",
        "content": "What scary movies or horror movies does everybody recommend watching on Netflix already watched Brooklyn Nine-Nine good girls, which probably won’t have a new season which sucks what does everyone recommend watching? Taking suggestions? Greatly appreciated. Thanks.",
        "upvotes": 2,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1p3k3t1/question/"
    },
    {
        "id": "1p3dk7l",
        "author": "RedditCitizenScore",
        "title": "Apple TV app logs out",
        "content": "I have to log in every single time I open the app.\n\nNo shared password\n\nI travel for work I used it on my Android TV stick when at hotels.\n\nHow does one fix this, it is just cancelling the only option\n\n\nEdit \n\nCanceled ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p3dk7l/apple_tv_app_logs_out/"
    },
    {
        "id": "1p3qrxz",
        "author": "Dark-Knight-Anto",
        "title": "Censor/Advisory Banners in Netflix India",
        "content": "As an adult, I’m fully aware that smoking is dangerous, yet Netflix India keeps slapping massive “smoking kills” banners across the screen and even cutting out tobacco scenes as if viewers can’t think for themselves. While I was watching Once Upon a Time in Hollywood, these intrusive warnings kept tearing the soul out of the film and ruining the entire vibe. It’s exhausting, frustrating, and honestly unbearable. Enough is enough — bye bye, Netflix.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p3qrxz/censoradvisory_banners_in_netflix_india/"
    },
    {
        "id": "1p2nbaj",
        "author": "RiseDelicious3556",
        "title": "This Is Going To Hurt",
        "content": "Ben Wishaw is excellent in this series. I hope it gets renewed by Netflix. This is the first medical  series that is somewhat realistic while also portraying good drama/comedy.   It's British, so it involves an NHS hospital setting background, but nonetheless realistic from my perspective as a former healthcare provider. Excellent acting, good story line. Bravo, netflix. \n\nNow if I could just find a good thriller series that doesn't jump the shark ",
        "upvotes": 38,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1p2nbaj/this_is_going_to_hurt/"
    },
    {
        "id": "1p3c274",
        "author": "nicojpeg",
        "title": "netflix won’t play on TV. please help!!",
        "content": "hi! so i’m trying to airplay to my tv after 3 years of not turning it on. it gets stuck on this eternal searching loop on every app. i tried going straight to the netflix app but it won’t load either. it’s fully updated, has a good internet connection (literally next to the router). it’s a vizio smartcast, i can’t find the model but it was purchased 2018-2019 and its model name is D32-F1. it won’t load anything :(",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p3c274/netflix_wont_play_on_tv_please_help/"
    }
]