[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 14,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1p6tnrd",
        "author": "Far_Pen3186",
        "title": "Matthew Macfadyen Gives An Incredible Performance As James Garfield’s Assassin in ‘Death By Lightning’",
        "content": "This character is infuriating, a pest, delusional, annoying as FK, pathetic, a loser, etc. The actor did a great job in making the viewer disgusted with this character! Even his voice is grating.",
        "upvotes": 59,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1p6tnrd/matthew_macfadyen_gives_an_incredible_performance/"
    },
    {
        "id": "1p6rstq",
        "author": "57829",
        "title": "Eva Green Joining ‘Wednesday’ Season 3 As Aunt Ophelia",
        "content": "",
        "upvotes": 13,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p6rstq/eva_green_joining_wednesday_season_3_as_aunt/"
    },
    {
        "id": "1p63sl8",
        "author": "AstralKatOfficial",
        "title": "How do I get netflix to realize I dont give two shits about wrestling?",
        "content": "So for some stupid reason, Netflix has been pushing wrestling HARD on my account for the past few months, not only have I never engaged with anything that'd suggest I want to watch wrestling content, but I've even gone into the info tabs and put \"Not for me\" on all the available ones and *still* whenever some new wrestling thing comes out, it shoves the ENTIRE CATEGORY right back onto my home page... I literally only use Netflix for its originals or shows like The Good Place, please tell me how to get this shit off my home screen for good",
        "upvotes": 272,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1p63sl8/how_do_i_get_netflix_to_realize_i_dont_give_two/"
    },
    {
        "id": "1p6bph0",
        "author": "Curious-Monitor497",
        "title": "The beast in me - why Aggie why???",
        "content": "Why was Aggie Wiggs texting and sending a voice mail everytime she had an important information? I feel like the entire last episode could have been avoided if she just waited for a reply from Brian Abbott. Only thing that make sense is that she probably was terrified of the whole situation and acted irrationally. Also, Brian Abott had no phone lock in his burner phone. Come on, an FBI agent being that careless.",
        "upvotes": 27,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1p6bph0/the_beast_in_me_why_aggie_why/"
    },
    {
        "id": "1p6tcgv",
        "author": "shaselai",
        "title": "Netflix subtitle keep changing to one language when I set it back many times.",
        "content": "So one time we had subtitle changed to Chinese on one of the shows for someone and now it is always Chinese whenever it loads.\n\nI tried:\n\n1. Setting language and subtitle to english...as a matter of fact, my profile setting has always been English- i had to change subtitles back from Chinese to english.\n\n2. Reload or refresh or quit netflix after setting english...still the same.\n\n3. My netflix app does the same thing.\n\n4. It naturally defaults to english subtitles when there isn't a Chinese subtitle option... \n\n  \nI dont know what else to do ... any suggestions?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p6tcgv/netflix_subtitle_keep_changing_to_one_language/"
    },
    {
        "id": "1p6ci4g",
        "author": "tipputappi",
        "title": "Just watched Death by lightning and man I feel so sorry for Charles' sister.",
        "content": "Poor woman tried so hard to bring her brother on the right track but he kept breaking her heart again and again. Allowed him to stay rent free,  turned a blind eye to his crackpot ideas, tried to get him a real job but he kept scaming her.  Love truly does Blind you.",
        "upvotes": 12,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1p6ci4g/just_watched_death_by_lightning_and_man_i_feel_so/"
    },
    {
        "id": "1p6gqj3",
        "author": "Majestic-Day-5024",
        "title": "Vanilla Sky Ending (M34)",
        "content": "i've seen lots of sad movie scenes/endings, titanic, gladiator, saving private ryan - but this film just hits me different, I can't quite put my finger on it but I cry my eyes out as soon as \"sigur ros\" starts playing\n\nI think it's the fact all of us always have that thought; \"what if\" what if my life tired out differently &amp; we found total happiness &amp; falling in love with someone \n\nplus maybe the look penelope cruz gives tom as he's just about to jump, when she kind of smiles at him with her eyes &amp; gives him a wave but looks a bit defeated herself \n\n\"i'll find you again... when we are both cats\" \n\nmovie magic \n\n\n",
        "upvotes": 6,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1p6gqj3/vanilla_sky_ending_m34/"
    },
    {
        "id": "1p6qmay",
        "author": "Typical_Effort_5283",
        "title": "What Piper Rockelle’s Netflix doc missed and this ytber exposed",
        "content": "\n\nMscaseclosed on YouTube again and breaks down the shocking allegations against Tiffany Rockelle, from allowing a convicted sex offender around Piper (he was her bf). She dated a convicted sex offender knowing he was one.. Mscaseclosed managed to track and gaslight the sugar daddy tiffany had for the family using piper’s existence to make him a pay pig for an interview. She had a sugar daddy for her daughter when she wasn’t even double digits yet.The video also reviews accusations about other questionable people she’s been linked to. mscaseclosed is a hardworking creator and the dedicated owner of the server, and she hasn’t given up on Piper’s case for a moment. She edits every video completely on her own and continues to push forward even now, working solo as everyone knows else is busy with their own lives.\n",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p6qmay/what_piper_rockelles_netflix_doc_missed_and_this/"
    },
    {
        "id": "1p6sbmr",
        "author": "mmmadness",
        "title": "'Left-Handed Girl' Review: Shih-Ching Tsou's Kaleidoscopic Solo Debut Sharply Satirizes Taipei's Cross-Generational Family Structures",
        "content": "",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1p6sbmr/lefthanded_girl_review_shihching_tsous/"
    },
    {
        "id": "1p6gstx",
        "author": "agile-coder",
        "title": "Rewind once the credits roll?",
        "content": "Anyone else got the issue where you can’t rewind during the credits?\n\nWatching using LG TV App\n\nMaybe i miss the end of a show and get the watch credits or play next episode message. \n\nI hit watch credits and then hit rewind. \n\nBut instead of rewinding it just crashes and takes me back to the start of the episode and even more annoyingly marks the episode as not watched so it gets confusing as to which one i was watching and now need to forward all the way through to watch the last couple of minutes again!",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p6gstx/rewind_once_the_credits_roll/"
    },
    {
        "id": "1p6novv",
        "author": "InnerAssociation7893",
        "title": "Movies and TV shows and their seasons are always very late in Croatia",
        "content": "Can anybody tell me why is that? I mean for example Rookie, here we are about 2 seasons behind (I lost count) and US and most parts of Europe I have friends in all have the entire show. 2nd example would be Snowpiercer to which I'm hooked btw but while the rest of the world has we don't have the entire show. That was just Netlix but there are countless more examples on HBO and Prime\n\nI tried p!rate sites but I can't watch a movie with corn poppping up every 5 minutes mid screen. So can anybody tell me why this is? Why can't Netflix/HBO/Prime Video just give us the full shows? \nPlease be understanding, I don't have much knowledge about this",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1p6novv/movies_and_tv_shows_and_their_seasons_are_always/"
    },
    {
        "id": "1p6ctft",
        "author": "Luciif3R_2O",
        "title": "Help needed",
        "content": "I’ve tried everything I can. Why is Netflix still not streaming in **HD** (1080p/2K) on my phone? Even when I download content, it only saves in around 480p. I’m on a **4K Plan **so this makes absolutely no sense. It’s been over a month now, and this is getting ridiculous. I prefer watching my content in HD.",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1p6ctft/help_needed/"
    },
    {
        "id": "1p6ltly",
        "author": "Reasonable-Cook-4728",
        "title": "WWE Raw",
        "content": "I've been a pro wrestling fan for many years. Wasn't home last night to watch WWE Raw live, so I decided to watch the replay this morning. There were 25 3-minute Ad breaks during a 2 hour replay. You used to be able to fast forward through the ads on a replay, but that no longer works. 3 hours and 15 minutes to watch the show. WTF Netflix?",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1p6ltly/wwe_raw/"
    },
    {
        "id": "1p6kn9m",
        "author": "Apprehensive_Cup3942",
        "title": "Suggest a life changing series",
        "content": "I’m looking for life-changing shows like, the kind that just blow your mind every episode and leave you shook. I’m super into teen romance and basically all the American drama vibes, the kind that just *amazes me*.\n\nHere’s what I’ve loved so far:\n\n* 13 Reasons Why\n* The End of the F\\*\\*\\*ing World\n* To All the Boys I’ve Loved Before\n\nBUT I need something with spice, like 13 Reasons, with maybe mystery, drama, or plot twists. Something that leaves me thinking about it for days, you know? Like, literally every moment has to hit \n\n",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1p6kn9m/suggest_a_life_changing_series/"
    },
    {
        "id": "1p5zgpf",
        "author": "Jazzlike_Ad_8236",
        "title": "Black Rabbit “One Month Earlier”",
        "content": "So I just watched the first scene of Black Rabbit then turned it off. Idk if I’m alone in this, but i absolutely cannot stand when a show opens with the climax, then cuts halfway thru to a previous point in time. To me it feels like such a cheap and lazy way to create intrigue. I cannot think of a single instance where there’s a narrative purpose for it. Anyone else feel that way?\n\n(Sidenote: ik I can’t judge the show, but the dialogue in that one scene was so bad I was worried I wouldn’t like the show. Legit the first line is “well that is definitely the most amount of money I’ve ever had in this safe” that is the most expository line I’ve ever heard)",
        "upvotes": 19,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1p5zgpf/black_rabbit_one_month_earlier/"
    },
    {
        "id": "1p634my",
        "author": "Jason2648",
        "title": "need some good gory horror movies",
        "content": "stuff like hostel,saw,terrifier,etc\n\nim rebuilding my list on netflix and need some good horror movies and i like really gory and disturbing ones, i watched that frankenstein movie but i honestly like slasher type horror movies more",
        "upvotes": 12,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1p634my/need_some_good_gory_horror_movies/"
    },
    {
        "id": "1p6s8xy",
        "author": "RussellAlden",
        "title": "So I watched AKA Charlie Sheen",
        "content": "I feel like an opportunity was missed in that he could have talked about his recovery. Like what was driving him to do this? Was it seeing dad almost die on the set of Apocalypse Now? How he really stop aside from watered down crack?\n\nIt wasn’t a cautionary tale because he still alive and on the screen making money. He basically got away with it.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1p6s8xy/so_i_watched_aka_charlie_sheen/"
    },
    {
        "id": "1p6hghi",
        "author": "Adventurous-Wasabi98",
        "title": "why is my screen going black while watching netflix?",
        "content": "i’m trying to watch stranger things season 4 on netflix since season 5 comes out tomorrow and I got through almost the entirety of the first episode (about an hour) and my screen keeps going black but the audio still plays and this happened a little while ago when I was trying to finish the new Frankenstein movie. When I looked it up the netflix website said to restart your phone blah blah blah I did all of that PLUS deleted the app and redownloaded it and it’s STILL doing it and i’m getting so frustrated!! does anyone have a solution to this or even knows what i’m talking about?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1p6hghi/why_is_my_screen_going_black_while_watching/"
    },
    {
        "id": "1p6h9mf",
        "author": "hannibalism_",
        "title": "chances of olympo renewal?",
        "content": "im so stressed guys. it came out in june and there’s been zero news. no marketing. nothing. i really like the show and its characters, but i am losing hope. it was rlly popular on tiktok and tweets abt it sometimes get over 10k on twt but alas. anyone been a fan of a series that got renewed after 6 months? 😭 is there any hope left for a renewal?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p6h9mf/chances_of_olympo_renewal/"
    },
    {
        "id": "1p6h76b",
        "author": "wonderingdreamer00",
        "title": "LF Recommendations (specifics in the comments)",
        "content": "Hello, I am looking for movie/series recommendations. Specifically, non-english ones. I've also watched a lot of kdramas so maybe less on that too. I wanted to explore more filmography from different countries and cultures, I'm hoping to learn a bit of various language by hopefully picking up a few words here and there (but mainly I just really wanted to watch something out of my usual hehe)\n\nHere are some of my recent watches that I enjoyed, and a few of those I can remember from way before. I like thrillers, post-apocalyptic, heartwarming drama, rom-coms,  etc so I'm really open to any genres:\n\nThe Greatest Teacher (JDrama)\n\nGirl From Nowhere (Thai)\n\nBillionaire's Bunker (Spanish)\n\nMoney Heist (Spanish)\n\nInto the Night (Belgian)\n\nThe Rain (Danish)\n\nCurrently watching: Friendzone (French movie)\n\nThank youu!\n\n  \nEDIT: I meant \\*specifics in the post body",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1p6h76b/lf_recommendations_specifics_in_the_comments/"
    },
    {
        "id": "1p5y3fm",
        "author": "KnopeLeslieKnope",
        "title": "Shows Recommendation",
        "content": "Hey guys! So my Netflix subscription renews March 2026 and that's when I'll be canceling. Are there any shows you would recommend me to watch? It's my least streamed service lately and I wanna get the last bang for my buck! I prefer shows that have all of their seasons completed. I also don't mind if a show has been canceled. Give me your recs, please!",
        "upvotes": 16,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1p5y3fm/shows_recommendation/"
    },
    {
        "id": "1p6e99r",
        "author": "jintinlin",
        "title": "A chrome extension to show/hide your movie on netflix",
        "content": "Not sure if it's the correct type to select, but this tool can help you show/hide your movie list on netflix base on your preference. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p6e99r/a_chrome_extension_to_showhide_your_movie_on/"
    },
    {
        "id": "1p6dqmo",
        "author": "littleMissTired123",
        "title": "Will my netflix work in a different continent?",
        "content": "I recently got netflix zo i dont know much abt it and sorry if this is a stupid question.\n\nIm in the US, abd i have netflix on my iPad, if I go to a different continent and use the wifi there will that affect anything?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1p6dqmo/will_my_netflix_work_in_a_different_continent/"
    },
    {
        "id": "1p6dpix",
        "author": "dereverse",
        "title": "Subtitle position in Korean Variety Shows",
        "content": "Why the heck Netflix changing every subtitle on korean varieties show to the top of the screen. I checked all them, including the one I already watched and all of them changed.\n\nUntil yesterday the subtitles still at the bottom of the screen. Now the subtitles covers the cast's faces. What kind of stupid change is this. \n\nIs there anyway to change subtitle position back to the bottom ?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p6dpix/subtitle_position_in_korean_variety_shows/"
    },
    {
        "id": "1p6tg94",
        "author": "Lisaa__with",
        "title": "Stranger Things",
        "content": "kingina sana pwede manood ng stranger things pag cinut ka ng kaibigan mo sa netflix account niya kasi nag away kayo at siya naman nag babayad. Salamat",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1p6tg94/stranger_things/"
    },
    {
        "id": "1p6864p",
        "author": "lvlynelen",
        "title": "Never have I ever - looking for a scene for my presentation",
        "content": "Hi everyone!\n\nI’m doing a presentation on a principle of influence called “Liking”. Basically, the idea is that the more you like someone, the more easily they can persuade you. My theme for the presentation is Netflix, so I’m using scenes from different shows/movies to show the factors that contribute to liking.\n\nOne of those factors is physical attractiveness and I was thinking of using Never Have I Ever as an example, specifically Devi and Paxton. I haven’t watched the show, but my friends say Devi usually does things for Paxton because she finds him attractive.\n\nCould anyone recommend specific scenes or moments where Devi agrees with or does something for Paxton because he’s good-looking?\n\nAny episode/clip suggestions would really help. Thank you!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p6864p/never_have_i_ever_looking_for_a_scene_for_my/"
    },
    {
        "id": "1p6c29u",
        "author": "Unabominable_",
        "title": "Hotel Sakura 2025",
        "content": "Can anyone explain the ending? Did Nid really kill Sarah? Who is telling the truth? The movie is a huge mess to me. I can’t find any explanation on Google and Reddit. Thanks in advance!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p6c29u/hotel_sakura_2025/"
    },
    {
        "id": "1p61ayb",
        "author": "ZoopZap",
        "title": "What is the most absurd/weird anime I can watch on netflix rn?",
        "content": "Title pretty much sums it up. I want to find an anime with the most layers of batshit insanity, simply because I like shows like that. A lot of my friends are into anime as well, so I want something I can bond with them with while also enjoying my type of shows",
        "upvotes": 6,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1p61ayb/what_is_the_most_absurdweird_anime_i_can_watch_on/"
    }
]