[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 11,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 686,
        "comments": 5070,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1ns5sby",
        "author": "No_Holiday5742",
        "title": "Black Rabbit is a masterpiece",
        "content": "I just finished Black Rabbit and honestly, I think it’s one of the best shows I’ve seen in a long while.\n\nExciting and unpredictable – Every episode had me hooked. There’s this constant tension and unease that made me lean in, waiting to see what would happen next.\n\nEmotionally provoking – It’s rare for a show to hit so many emotional notes; anger, sadness, empathy, anxiety and dread. All in the same arc. I found myself genuinely caring about what happened to the characters.\n\nCharacters you invest in – Even when they’re flawed or making questionable choices, I couldn’t help but root for them or at least understand them. That level of writing and acting is what kept me so engaged.\n\nActing – Top-tier. The performances felt layered, raw, and real, like you’re watching people rather than actors.\n\nCinematography – The dark, grey tones of NYC were such a perfect backdrop. It wasn’t just filmed in New York; the city itself felt like a character. That moody aesthetic pulled me in even deeper.\n\n\nWhat I don’t understand at all is why The Guardian gave it a negative review. Honestly, did we even watch the same show? For me, it delivered on every front; storytelling, visuals, acting, and atmosphere.\nEdited to add the music matched the dark and gritty theme so well also!\n\nOverall, Black Rabbit just worked. It’s one of those rare shows that stays with you long after the credits roll.\n\n\nAnyone else feel the same way, or equally baffled by the negative takes?\n\n",
        "upvotes": 76,
        "comments": 122,
        "media": null,
        "permalink": "/r/netflix/comments/1ns5sby/black_rabbit_is_a_masterpiece/"
    },
    {
        "id": "1ns3tc5",
        "author": "Bunny2804",
        "title": "Alice in Borderland is better than Squid Games",
        "content": "I swear people are sleeping on Alice in Borderland.\n\nThe mindgames, the thrill and the overall tone, in my humble opinion is much better than Squid Games and it should have had the hype and success similar, if not greater than SG.\n\nI don't know if season 3 is the final one or not but man I really hope they can continue if there are more stories to tell. \n\nThis and One Piece are two of the best live action manga adaptations we have imo.",
        "upvotes": 69,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1ns3tc5/alice_in_borderland_is_better_than_squid_games/"
    },
    {
        "id": "1nrzl61",
        "author": "Beneficial_Pickle288",
        "title": "Altered Carbon",
        "content": "I never see anyone talk about this show or even recommend it when people ask for recommendations, which leads me to believe a lot of you have not seen it!  Definitely worth a watch, sci-fi action thriller with great characters, and a compelling story line.  I think they also have an animated series, which I have not seen yet, but definitely highly recommend the live action show!  Here is the trailer for your viewing pleasure.\n\nhttps://youtu.be/-Yt89b5AcwY?si=HVAoOhI4BiOW_p9P\n\n",
        "upvotes": 39,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1nrzl61/altered_carbon/"
    },
    {
        "id": "1ns8eth",
        "author": "grayblesbeing",
        "title": "If you enjoyed The Sinner, may I recommend…",
        "content": "…the delightful Detective Frost? Grizzled fella, solves cases by his own non-traditional methodologies, endearingly neglects his personal life, and the subjects of his cases represent little ecosystems in the human community. And British flavored!\n\nI somehow watched season 4, then 1-3 of The Sinner and the thing that irked me most about the show is that Ambrose is hardly impacted by the administrative expectations of his actual job. I mean, in season 2 he spent the whole time basically volunteering his services for another PD lol. Meanwhile, Detective Frost is more realistically part of a department and has an amusing relationship with a boss who actually makes professional demands of him. There’s pretty good running jokes about the growing piles of unfinished paperwork associated with cases backing up. Lastly, he takes mentoring younger members of the department seriously and that’s pretty sweet to see. \n\n",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ns8eth/if_you_enjoyed_the_sinner_may_i_recommend/"
    },
    {
        "id": "1ns4ve7",
        "author": "Gloomy_Barnacle777",
        "title": "‘Monopoly’: Trio Of Producers Pass Go In Contest To Make Netflix Game Show Based On Board Game",
        "content": "",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ns4ve7/monopoly_trio_of_producers_pass_go_in_contest_to/"
    },
    {
        "id": "1nsabf3",
        "author": "Which_Mammoth9402",
        "title": "What other shows are similar to “You” or “Shameless”",
        "content": "I’m not too big on netflix shows or movies but I did really enjoy You and Shameless. I also LOVED ozark, money heist, orange is the new black and baby \n\nIm looking for shows that are interesting and good right off the bat- not those shows where you have to watch at least 5 episodes before it gets good\n\nAny suggestions? 🫶🏻",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nsabf3/what_other_shows_are_similar_to_you_or_shameless/"
    },
    {
        "id": "1nsa2ik",
        "author": "luci-fan-since07",
        "title": "I’m on episode four of building the band and Allison…",
        "content": "Okay, I can’t be the only one who’s watching this and feeling like Allison can’t be serious. It feels like satire. She is such a horrible person! So cocky, so shallow, so vein and honestly, borderline *CRUEL*. I was so p!ssed off when &gt;!she through to be a band!&lt;. This girl is the reason I’m so nervous and self conscious around girls my age (I’m 18 and I feel like this is too much of a common theme with girls 10/11 - early 20s). Anyways, I just wanted to put this out there and get others opinions. ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nsa2ik/im_on_episode_four_of_building_the_band_and/"
    },
    {
        "id": "1nrdav5",
        "author": "JollyToe440",
        "title": "Tired of seeing cheating in relationships in Netflix Shows",
        "content": "This ain’t no spoiler. I just began The Waterfront Episode 1. Before half of the episode was done, it seems like one of the main guys runs into his high school sweetheart. It is then made clear that they are both partnered up already. The next day, he goes to her shop where she works and they strike a convo. It feels like there will be cheating already, and i’m just fed up with that storyline. I won’t continue watching this show if the characters are just typical netflix tropes; unrelatable yet oh-so cheesy. Also, it just feels unnecessary to start this cheater narrative when the guy could’ve just been single. So cliché. \n\nReally wondering why this show is at the top searches. \n\nAnyone can let me know if there will be actual cheating or will they be normal people for once? ",
        "upvotes": 385,
        "comments": 91,
        "media": null,
        "permalink": "/r/netflix/comments/1nrdav5/tired_of_seeing_cheating_in_relationships_in/"
    },
    {
        "id": "1ns22z9",
        "author": "Brakonah",
        "title": "El Chapo or Narcos ?",
        "content": "What is Your choice and what? \nI’m fascinated with El Chapo history but seems like opinions about Narcos are better. \nWhat’s differences and history worth to watch? \n\nI just listened few histories on yt and just wanna know what do You think or maybe u know some facts from your life ? \n",
        "upvotes": 9,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1ns22z9/el_chapo_or_narcos/"
    },
    {
        "id": "1nryevi",
        "author": "BrainImpressive9529",
        "title": "Need new recommendations 😭",
        "content": "So, I want some new series recommendations.. it feels like I have watched everything on netflix and can’t find any good series now.. please recommend me some good series..\n\nI have watched wednesday, alice in borderland, squid game, my life with walter boys, stranger things etc, and kdramas..\n\nI need something fun, mystery, feel good, could be anything but worth watching.. ",
        "upvotes": 9,
        "comments": 61,
        "media": null,
        "permalink": "/r/netflix/comments/1nryevi/need_new_recommendations/"
    },
    {
        "id": "1ns9sdx",
        "author": "savingrace0262",
        "title": "What I should I watch? Black Rabbit or Wayward?",
        "content": "I’ve got some free time and want to start a new show, but I’m stuck between Black Rabbit and Wayward. Both look interesting, but I don’t want to commit to one and regret it halfway through. Any recs?",
        "upvotes": 3,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1ns9sdx/what_i_should_i_watch_black_rabbit_or_wayward/"
    },
    {
        "id": "1ns50ja",
        "author": "Gloomy_Barnacle777",
        "title": "Luke Wilson To Re-Team With Will Ferrell In Netflix Golf Comedy Series",
        "content": "",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ns50ja/luke_wilson_to_reteam_with_will_ferrell_in/"
    },
    {
        "id": "1nsc8uw",
        "author": "ADDRAY-240",
        "title": "El refugio atomico really disappointed me",
        "content": "The first two episodes were nice and all, but the rest devolved into yet another spanish drama (albeit in fallout-pilled suits).\nI wanted to know way more about the details of the plan, especially after Casa de papel.\nThe two families were too weird for me to feel empathy for them (I swear, the dad who's desperate for love and friendship is the most sane of the bunch), the two 'kids' felt so dumb (WHO expects to find a usable blood-purifier after a nuclear carpet bombing?) and it felt extremely anticlimatic for the whole compound to shut down because of a shortcut. Designed by a top-tier architect and her genius engineer of a brother, but beaten by a blockhead with a prison formation to be electrician. And for their super AI (that is CRUCIAL to the plan) not to have a back-up source of power was a bit too much for me.\n\nAaaaand, the CEO's associate's whole arc was basically useless. The dude had a perfect love story (orchestrated by the gang to serve the plan) but got a random info that made him doubt everything. And when we thought he was about to make the whole thing fail..... the gang just offs him. One pushed him into the other's arms, the latter breaking his neck just likmke that, on the street. Unless this death plays an important part in a potential second season, this arc was pointlessly focused upon.\n\n\nAnd tge final problem I have with how mister blockhead \"Muh, my dad's pathetic and my mom's a psycho that regrets I was born\" managed to get out. The command center just needed to cut the power to stop the final elevator. This would have given their staff ten times the time to, idk, release the elevator and off the guy. But no, they all watch him reach the exit (I know he had a tablet, but that wasn't gonna do jack if  the power was cut)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nsc8uw/el_refugio_atomico_really_disappointed_me/"
    },
    {
        "id": "1nsc3po",
        "author": "Gabienchoi",
        "title": "Black Rabbit",
        "content": "I recently watched Netflix’s Black Rabbit, and I’m not sure how to classify its genre. On the surface it feels like a thriller or mystery, but the way it dives into relationships and psychology gives it more of a drama vibe. At times it even carries a noir-like atmosphere with crime elements mixed in. I’m curious—how do you all see it? Do you think it fits better as a thriller, a drama, or a crime series?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nsc3po/black_rabbit/"
    },
    {
        "id": "1ns5enw",
        "author": "Cold_Link_1057",
        "title": "help me find this series",
        "content": "There was a series in with 4-5 people got lost in jungle ,and there were also girl name called amber. she had short hair ,and there was also a doctor who did experiment with one girl. and this series name probably starts with A.\ncan you guys please help me find this series.i think it's available on Netflix ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ns5enw/help_me_find_this_series/"
    },
    {
        "id": "1nran0i",
        "author": "ToonAdventure",
        "title": "'Haunted Hotel' Renewed for Season 2 at Netflix",
        "content": "",
        "upvotes": 192,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1nran0i/haunted_hotel_renewed_for_season_2_at_netflix/"
    },
    {
        "id": "1ns9yky",
        "author": "Doogie102",
        "title": "Canadian Netflix while parents at vacation home in the states.",
        "content": "Hey so my family and I live in Canada. We have a family cabin in the states. What happens as I will stay at home and they stay at the cabin for prolonged times (retired life). The thing is when they go to the cabin I loose my access to netflix. \n\nIs there any way to set a primary residents and a vacation address. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ns9yky/canadian_netflix_while_parents_at_vacation_home/"
    },
    {
        "id": "1ns7a3g",
        "author": "yushdecides",
        "title": "Finished Alice in borderland s03",
        "content": "Just finished season 3 of Alice in borderland and this was also an amazing season just like the previous 2.\nThey end it at a cliffhanger, hinting towards a new upcoming and even more exciting season. I think this part was inspired from squid game?\nBut the overall storyline and game concept is 10x better then squid game anyday for me\nCan't wait for season 4 already.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ns7a3g/finished_alice_in_borderland_s03/"
    },
    {
        "id": "1ns2f5j",
        "author": "Cold_Link_1057",
        "title": "Can anyone suggest me thriller movies/series",
        "content": "I recently watched the girlfriend and i like it  please suggest some good thriller and fun series'/movie\nMy favs\nwhy women kill\nbased on true story\nalice in Borderland \nyou\nthe menu\n",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ns2f5j/can_anyone_suggest_me_thriller_moviesseries/"
    },
    {
        "id": "1ns2duy",
        "author": "Correct_Musician_825",
        "title": "Downloads error",
        "content": "I have Netflix premium that allows downloads on two devices.\n\nHowever, upon clicking on downloading movies, it doesn’t download the movie in entirety rather downloads 100 mb or less and thus I can’t watch it till end when offline.\n\nAny idea what is happening?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ns2duy/downloads_error/"
    },
    {
        "id": "1ns1yzo",
        "author": "Sweaty-Toe-6211",
        "title": "Netflix Secured A Long Extension For Heartland Meaning Seasons 18 And 19 Are Coming!",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ns1yzo/netflix_secured_a_long_extension_for_heartland/"
    },
    {
        "id": "1ns6110",
        "author": "Calm-Preparation2641",
        "title": "If I switch my Netflix household this evening, can I switch back to my old one tomorrow without any delay ?",
        "content": "I don't understand anything about this \"new\" account share policy.\n\nPlease, explain it to me.\n\n  \n\"If I switch my Netflix household this evening, can I switch back to my old one tomorrow without any delay ?\"",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ns6110/if_i_switch_my_netflix_household_this_evening_can/"
    },
    {
        "id": "1ns0418",
        "author": "Rodrigweez",
        "title": "Netflix Episode Info/Progress Bar keeps popping up while watching",
        "content": "We watch Netflix through a BenQ projector. If we watch Netflix through our AppleTV or Sony DVD player, every 5-15 minutes, the episode info box pops up from the bottom of the screen. When you click \"back\" on the remote, it goes away but then the progress bar remains. If we watch Netflix through the Android TV that came with the projector, we don't have this problem but the AndroidTV often doesn't boot up or has some other problem so we prefer not to use it.\n\nI've done factory resets on the AppleTV, the DVD player and the AndroidTV and downloaded all the updates for the projector. We've tested disabling remotes in case one of them is faulty. None of these things work.\n\nHas anyone else had this problem? And if so, how did you solve it?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ns0418/netflix_episode_infoprogress_bar_keeps_popping_up/"
    },
    {
        "id": "1nruq8l",
        "author": "Anna_crazy_banana",
        "title": "Shahmaran",
        "content": "I like to really explore Netflix and find any kind of show that’s fantasy, mythological-romance, with a hint of morale thinking of humanities nature. The shahmaran is that show and it’s sooooooo good! Like so good I need to come on here and tell more people about it so a 3rd season can be made!!. It’s in Turkish and I think watching it in its original language but with subtitles is the best way to go. I don’t understand Turkish but having the English voice overs just doesn’t feel like I’m watching the same show. And sheesh, the chemistry of the main characters 🥰🥰🥰 anyways, can I spread this love to my American peeps and any other country that doesn’t know about the show shahmaran??Please please watch it, get the views up, so I can get more seasons haha 🤣 ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nruq8l/shahmaran/"
    },
    {
        "id": "1nr3m7y",
        "author": "graemeisverytired",
        "title": "Squid Game success means that Famke Janssen is now acting for the first time in her native language in Netflix’s Amsterdam Empire",
        "content": "This new status quo is one that Dutch actress and X-Men icon, Famke Janssen, feels grateful for. Janssen stars in an upcoming Netflix show called Amsterdam Empire, and it's the first time that she has ever acted in her native language. Speaking with our video producer, Ashley Victoria Robinson, Janssen noted that Amsterdam Empire was part of this post-Squid Games world of international streaming. “Us now being in a time where Squid Game, everyone is watching anything in any language, and it doesn’t matter anymore. That has really changed the landscape for all of us, so that’s wonderful,\" Janssen said. \n\nMore: [https://www.thepopverse.com/tv-netflix-squid-game-international-shows-famke-janssen-amsterdam-empire-dutch/](https://www.thepopverse.com/tv-netflix-squid-game-international-shows-famke-janssen-amsterdam-empire-dutch/)",
        "upvotes": 112,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1nr3m7y/squid_game_success_means_that_famke_janssen_is/"
    },
    {
        "id": "1nrz3wu",
        "author": "Wild_Information_520",
        "title": "Strange audio edit on a movie (Hotel transylvania 2)",
        "content": "I was watching the movie \"Hotel Transylvania 2\" on Netflix. Since I hadn't seen it in a while, I wanted to rewatch it (obviously also watching the first one). Nothing strange, until we get to the scene where Dennis shows Torty's video to Grandpa Dracula. I'm Italian, and I was watching the video in Italian, so I thought it was a mistake due to the Italian audio, but it wasn't. Torty, after Dennis is put to bed, (from what I remembered) said \"Slow down, Buzzle Lump. The scariest monster of all is diabetes.\" Now, however, he just laughs. I was wondering if it was a mistake or not.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nrz3wu/strange_audio_edit_on_a_movie_hotel_transylvania_2/"
    },
    {
        "id": "1nrs8j0",
        "author": "New-Attitude4610",
        "title": "Best Netflix game",
        "content": "Hey everyone, I love horror + crime games. I’m curious: what do you think is the best Netflix game in that genre? Prefer games with strong mystery, atmosphere, maybe supernatural elements. Suggestions?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nrs8j0/best_netflix_game/"
    },
    {
        "id": "1ns94ol",
        "author": "Ok-Performer-376",
        "title": "Suits not on Netflix anymore for me (in USA)",
        "content": "Suits not on Netflix anymore for me (in USA). Suits not on Netflix anymore for me (in USA) \nSuits not on Netflix anymore for me (in USA) \nSuits not on Netflix anymore for me (in USA) ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ns94ol/suits_not_on_netflix_anymore_for_me_in_usa/"
    }
]