[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1l7tn63",
        "author": "SafeZookeepergame573",
        "title": "Piscine aperte a Torino e dintorni?",
        "content": "Conoscete qualche piscina all'aperto a Torino o dintorni? Com'è in quanto affollamento e prezzi? \nOvviamente mi riferisco a piscine con lettini ecc, piscine per il chill insomma.\n\nO comunaue in alternativa un posto dove andare  a chillare con possibilità di farsi anche un bagno (fiumi ecc) Grazie milleee",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1l7tn63/piscine_aperte_a_torino_e_dintorni/"
    },
    {
        "id": "1l7sw1h",
        "author": "NerdyGeek1601",
        "title": "Best platform when looking for housing",
        "content": "Hi! I’m going to be studying at UniTo next academic year and I need to find accommodation. However, I tried the uni-recommended platforms, CercoAlloggio and Housing Anywhere, and they don’t have a lot of variety. Do you have any recommendations, especially ones relating to where I should look? Also, what’s the best way to minimise the chance of getting scammed?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1l7sw1h/best_platform_when_looking_for_housing/"
    },
    {
        "id": "1l7s6k1",
        "author": "davivesp",
        "title": "Nuove amicizie",
        "content": "Ciao a tutti, sono un ragazzo di 29 anni. Mi sono trasferito qualche anno fa a Torino e ho sempre fatto difficoltà nelle nuove amicizie.\n\nSono una persona un pò introversa, solare e con qualche passione che mi piacerebbe condividere.\n\nCerco persone con la quale scambiare due parole, uscire e magari instaurare un bel rapporto di amicizia. Se anche tu sei in cerca di nuove conoscenze, scrivimi pure! :)",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1l7s6k1/nuove_amicizie/"
    },
    {
        "id": "1l7ryet",
        "author": "Careless_Way_3818",
        "title": "Funko pop personalizzati",
        "content": "Buongiorno vorrei sapere se ci fosse a Torino un negozio dove posso acquistare Funko pop personalizzati, oppure un sito online dove posso acquistarli personalizzati, sul sito originale Funko.com mi dice che è possibile spedirli solo in america..",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1l7ryet/funko_pop_personalizzati/"
    },
    {
        "id": "1l7cm2b",
        "author": "glorious-ahole",
        "title": "Ci sono gruppi di ciclisti?",
        "content": "Ciao a tutti, sono nuovo in città e adoro andare in bicicletta. Quindi mi chiedevo se ci sono gruppi di ciclisti a Torino.",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1l7cm2b/ci_sono_gruppi_di_ciclisti/"
    },
    {
        "id": "1l7evoc",
        "author": "AssumptionCautious84",
        "title": "Cercasi madrelingua francese o spagnolo per fare pratica insieme",
        "content": "Ciao! Sono un'italiana rientrata dall'estero, parlo bene inglese e in modo molto basico il francese e lo spagnolo. Vorrei avere modo di praticare con un\\* madrelingua idealmente dal vivo (ma va bene anche online), a cui in cambio io insegnerei l'italiano. Ho 27 anni e molti interessi (sport outdoors, lettura, tecnologia, ...), sono sicura che troveremmo qualcosa di cui parlare :) ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1l7evoc/cercasi_madrelingua_francese_o_spagnolo_per_fare/"
    },
    {
        "id": "1l6w9ne",
        "author": "ztegb",
        "title": "Italy and France Are Digging a 57.5km Tunnel. Is It Justified?",
        "content": "",
        "upvotes": 31,
        "comments": 55,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4SEWhOKrsaQR9xQly97fbHPoqkP53EOJ0lNQ0fV3Yyo.jpg?auto=webp&amp;s=56405aea2e9a467520ad5ca539f2f4d28b789c07"
        },
        "permalink": "/r/torino/comments/1l6w9ne/italy_and_france_are_digging_a_575km_tunnel_is_it/"
    },
    {
        "id": "1l7gihg",
        "author": "ilbura_",
        "title": "Primo post per me! Karaoke a Torino?",
        "content": "Ciao a tutti, ho visto che c’è qualche post in merito ma sono un po’ datati.\n\nKaraoke a Torino? Non locali che fanno serate karaoke ma veri e propri locali che , se avessi voglia di cantare, sai dove andare. Grazie mille!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1l7gihg/primo_post_per_me_karaoke_a_torino/"
    },
    {
        "id": "1l7ejy3",
        "author": "No-More-Blue",
        "title": "CERCO PASSAGGIO AUTO - PAGO",
        "content": "C'è qualcuno che come me andrà il 15 giugno al concerto di The Living Tombstone ai magazzini Generali di Milano e che, dopo il concerto, tornerà a Torino in auto? Sto cercando un passaggio e ovviamente pagherei il disturbo, grazie 💕",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1l7ejy3/cerco_passaggio_auto_pago/"
    },
    {
        "id": "1l71wqt",
        "author": "General-Soil6723",
        "title": "Trovare lavoro a Torino",
        "content": "Ciao a tutti, vorrei chiedervi dei consigli su come trovare lavoro a Torino.\nSono una ragazza 22enne di Genova e a Settembre mi trasferirò nella Vostra bellissima città. Sono studentessa universitaria iscritta all’università di Genova in Economia Aziendale. Ho già svolto e svolgo tuttora attività lavorativa come assistente di produzione, barista, babysitter, dog sitter e ripetizioni.\n\nSono alla ricerca di un lavoro (preferibilmente part time) nel mio settore di studi, quindi magari per qualche azienda che cerchi contabili o segreteria anche. Avete consigli su come farmi strada?\n\nHo visto che molte offerte sono rivolte a studenti già laureati o con ragioneria alle spalle (io ho frequentato il Liceo Scientifico).\nGrazie a tutti!!!",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1l71wqt/trovare_lavoro_a_torino/"
    },
    {
        "id": "1l79t8q",
        "author": "itsperfectlysplendid",
        "title": "Dovrei comprare una casa a San Benigno Canavese?",
        "content": "Ciao tutti, io e la mia ragazza pensiamo comprare una casa in San Benigno Canavese. Questo principalmente perché paghiamo circa 1300 euro di affitto al mese nel centro di Torino. Abbiamo trovato una casa davvero bella che potrebbe aver bisogno di qualche lavoro di ristrutturazione, ma nel complesso accettabile, per circa 60.000 euro a San Benigno Canavese. In treno ci vogliono circa 29 minuti per raggiungere Porta Susa, ma considerate che studiamo al Politecnico di Torino, nei campus del Valentino e del Lingotto. Dovremmo farlo? Non riesco a decidermi. Qualsiasi idea o aiuto è ben accetto, grazie!",
        "upvotes": 0,
        "comments": 27,
        "media": null,
        "permalink": "/r/torino/comments/1l79t8q/dovrei_comprare_una_casa_a_san_benigno_canavese/"
    },
    {
        "id": "1l788rr",
        "author": "polar8",
        "title": "Where to get car air-conditioning recharge?",
        "content": "Hi everyone, I am driving through Turin tomorrow and I need to get the air conditioning recharged on my car (2012 Renault scenic). What type of garage should I go to for this? I don't want to wait around very long. Is it possible to buy the refrigerant and do it yourself?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1l788rr/where_to_get_car_airconditioning_recharge/"
    },
    {
        "id": "1l6g55n",
        "author": "ConsiderationOne920",
        "title": "Sono solo a Torino",
        "content": "Ciao a tutti, mi spiego meglio.\nSono un uomo di 34 anni nato e cresciuto a Torino. Quando avevo vent’anni mi sono sposato e trasferito.  Ora da circa un anno mi sono separato e sono  tornato a Torino, ho provato a ricontattare qualche vecchia conoscenza ma con pochi risultati. Molti dei miei amici si sono trasferiti anche loro ed altri è stato impossibile ritrovarli. Mi chiedo cosa bisogna fare nel 2025 per conoscere persone nuove ?\nA volte vado a fare un aperitivo da solo, o addirittura a cena… ma oltre a qualche conoscenza superficiale non sono riuscito a legare con nessuno. Non sono depresso o cose del genere, faccio molte cose da solo però a volte sarebbe bello condividerle con qualcuno. Quindi ripeto la domanda, cosa bisogna fare nel 2025 per conoscere persone nuove ? \n\n",
        "upvotes": 40,
        "comments": 27,
        "media": null,
        "permalink": "/r/torino/comments/1l6g55n/sono_solo_a_torino/"
    },
    {
        "id": "1l70ynh",
        "author": "andrequegira",
        "title": "Calcetto giovedì 12/06 a rivoli",
        "content": "Cerchiamo 5/6 persone serie e forti per un calcetto (5vs5) al centro polisportivo di rivoli.\n\nUna squadra è già stata composta ma c’è un giocatore in dubbio.\n\nIl costo sarebbe 5€ a persona, se interessati contattatemi pure in dm. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1l70ynh/calcetto_giovedì_1206_a_rivoli/"
    },
    {
        "id": "1l6lrmd",
        "author": "Python-SS",
        "title": "Laboratori teatrali",
        "content": "Ciao, conoscete laboratori teatrali non professionali dove poter iscriversi? Mi piacerebbe frequentare qualche laboratorio di questo tipo, senza limiti di età (ho 31 anni) dove conoscere gente nuova e imparare qualche skill in più attraverso la recitazione.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1l6lrmd/laboratori_teatrali/"
    },
    {
        "id": "1l6p96d",
        "author": "Sockchef",
        "title": "housing in polito",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1l6p96d/housing_in_polito/"
    },
    {
        "id": "1l6lkzn",
        "author": "Individual-Relief416",
        "title": "In che giorno si può ritirare la patente alla motorizzazione?",
        "content": "Devo ritirare la patente, ma non mi ricordo qual è il giorno dedicato mi pare sia il mercoledì. Qualcuno può confermare giorno e orari per caso, grazie? Parlo della motorizzazione a Torino sud. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1l6lkzn/in_che_giorno_si_può_ritirare_la_patente_alla/"
    },
    {
        "id": "1l6aon1",
        "author": "cheerees",
        "title": "Consigli",
        "content": "Ciao a tutti/e, prossimamente sarò a Torino per lavoro e vorrei qualche consiglio da chi conosce abbastanza bene la città.\n\nInnanzitutto mi chiedo se abbiate consigli di alcune zone da evitare mentre si viaggia a piedi o con i mezzi (non per vivere, s'intende).\nInoltre sto cercando un negozio in cui comprare merch dei Metallica perché sono interessata a fare un regalo, ma il sito ufficiale ha tempi di spedizione impossibili. Visitando una città così grande magari ho qualche speranza di trovare dei negozi fisici che vendano questi articoli, ma con semplici ricerche su google non ho trovato nulla. Forse i locals mi consigliano qualche posto poco conosciuto che comunque faccia al caso mio. \n\nIn ogni caso grazie a chi mi darà dei suggerimenti e buona domenica a tutti/e.",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1l6aon1/consigli/"
    },
    {
        "id": "1l6i7yx",
        "author": "Erleyx",
        "title": "Monopattino elettrico sull’autobus",
        "content": "Ciao ragazzi, voglio chiedere se è possibile portare il mio scooter elettrico con me sull’autobus, perché ho trovato questo lavoro, ma la stazione degli autobus è un po’ lontana da esso, quindi mi chiedevo di prendere lo scooter sull’autobus con me e poi continuare a lavorarci",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1l6i7yx/monopattino_elettrico_sullautobus/"
    },
    {
        "id": "1l68bdj",
        "author": "gatorgotyourgranny",
        "title": "SOS - Servizi tuttofare?",
        "content": "Ciao a tutti. Sto cercando un tuttofare a Torino (centro) per appendere delle mensole e dei bastoni per le tende. Avrei anche bisogno di montare una pergola dall’Ikea.\n\nHo contattato questi tre e niente risposta: \n\nhttps://www.riparazionicasatorino.it (lui ha fatto l’appuntamento per il sopralluogo ma non si è presentato)\n\nhttps://www.tuttofaretorino.it\n\nhttps://www.lavorituttofare.com\n\nGrazie mille! ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1l68bdj/sos_servizi_tuttofare/"
    },
    {
        "id": "1l6bmvc",
        "author": "Fresh-Bluebird-4721",
        "title": "Parrucchiere alternativo torinese",
        "content": "Ehi, sto cercando un parrucchiere a Torino, che possa tagliare un buon Wolfcut per capelli mossi. Qualcuno conosce un buon parrucchiere alternativo come questo? 🙏🙏\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1l6bmvc/parrucchiere_alternativo_torinese/"
    },
    {
        "id": "1l6a92s",
        "author": "Muted-Cap-5463",
        "title": "Quanto è pericolosa la zona compresa tra Corso Peschiera, Corso Racconigi, via Frassinetto e via Capriolo, e anche su Corso Racconigi 25",
        "content": "Ciao a tutti!\n\nSto cercando informazioni sull’area compresa tra Corso Peschiera, Corso Racconigi, via Frassinetto e via Capriolo, e anche su Corso Racconigi 25. Ho notato che ci sono dei palazzi pubblici e mi chiedevo:\n1) È considerata una zona pericolosa, soprattutto di sera?\n2) Le case costano meno lì proprio per questo motivo?\n3) È una zona vista male dai torinesi?\nQualsiasi consiglio o esperienza personale è benvenuto.\n\nEdit: sto chiedendo perché ho letto questo e non so se è un'eccezione https://torinocronaca.it/news/cronaca/300420/il-fortino-dello-spaccio-dentro-le-case-popolari-manette-per-9-pusher.html",
        "upvotes": 1,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SZulzac7CW0IoZuevXQyr2q8j2VFTyeWa9vUlW7Tcy8.jpg?auto=webp&amp;s=96cd291f4d4a6973d52498cbb90a7aac848603f0"
        },
        "permalink": "/r/torino/comments/1l6a92s/quanto_è_pericolosa_la_zona_compresa_tra_corso/"
    },
    {
        "id": "1l6a2nx",
        "author": "Street-Ad-1504",
        "title": "Consiglio zona Torino",
        "content": "Ciao a tutti, vi scrivo per chiedere pareri su zone come San Mauro Torinese, Settimo Torinese e Bertolla. Sono buone zone dove comprare casa? In termini di rivendibilità futura o investimento per b&amp;b? Bertolla anche se vicina a barriera di Milano è una zona vivibile o ci possono essere problemi/degrado anche lì?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1l6a2nx/consiglio_zona_torino/"
    },
    {
        "id": "1l668kv",
        "author": "MosFret24",
        "title": "Magistrale Elettronica Polito",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1l668kv/magistrale_elettronica_polito/"
    },
    {
        "id": "1l55wqf",
        "author": "suvmpylobbling",
        "title": "TORINO - most interesting fact",
        "content": "",
        "upvotes": 246,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WIElw8Pb034ocV3OlhJJmPkUT_PHpVUBCDKOcpYbtrc.png?auto=webp&amp;s=4ab0394fe29c85af20a0ddacad2cb325884a1398"
        },
        "permalink": "/r/torino/comments/1l55wqf/torino_most_interesting_fact/"
    },
    {
        "id": "1l5ri04",
        "author": "Bagnacaoda",
        "title": "Alla ricerca di nuove amicizie!",
        "content": "Ciao sono tornato a Torino da qualche anno ormai (nato e cresciuto qua ma mi sono trasferito a Milano per l'accademia di Brera) causa fine degli studi e covid. Ormai non ho più tanti amici/conoscenti qui e in questi anni, causa lavoro, non sono riuscito a farmene di nuovi. Quindi ho pensato di scrivere l'ennesimo post alla ricerca di nuove conoscenze. Sono un ragazzo trans di 27 anni, faccio l'artigiano. Sono una persona creativa in generale, ho sempre disegnato e sono molto appassionato di fotografia. Mi piace leggere e fino a qualche anno fa sono stato un grande appassionato di anime e manga (adesso sto cercando di recuperare qualcosina, ma non riesco a dedicarci tanto tempo). Mi piacerebbe trovare gente con più o meno gli stessi interessi che abbia voglia di fare amicizia :) una cosa \"richiesta\" è essere lgbtqia+/ friendly. \n\np.s. non so se esiste magari già qualche gruppo telegram o altrove, nel caso fatemelo sapere o possiamo crearlo :).",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1l5ri04/alla_ricerca_di_nuove_amicizie/"
    },
    {
        "id": "1l5uxb0",
        "author": "Platform_Crocs",
        "title": "Struggling to find accommodation",
        "content": "Ciao raga, da circa due mesi che cerco una stanza, ma finora non ho avuto molta fortuna. A settembre mi trasferisco a Torino per iniziare la magistrale, e realisticamente mi restano solo sei settimane per firmare un contratto d’affitto, che mi serve per l’appuntamento con il consolato per il visto. Sto guardando su Facebook, Idealista, Immobiliare e altri siti, ma sto facendo davvero fatica a ricevere risposte, anche se scrivo sempre in italiano. Una volta ero quasi riuscito a trovare una stanza, ho fatto una videochiamata con i coinquilini (molto gentili), ma poi il proprietario ha detto che non voleva affittare a uno straniero perché non era sicuro che potessi permettermelo. È stato frustrante, anche perché solo le bollette del telefono e della luce qui a New York City costano quanto l’affitto e le spese di quell’appartamento. Avevo anche offerto di mostrare il mio estratto conto, il mio reddito attuale, tutto quello che poteva servire, ma mi ha risposto solo con un “forse”. A questo punto, sinceramente, non so più cosa fare ¯\\\\\\_(ツ)\\_/¯ ",
        "upvotes": 3,
        "comments": 25,
        "media": null,
        "permalink": "/r/torino/comments/1l5uxb0/struggling_to_find_accommodation/"
    },
    {
        "id": "1l67ej7",
        "author": "ImpactFlat1514",
        "title": "Amicizie al femminile",
        "content": "Ciao! 😊 sono una ragazza e sono alla ricerca di nuove amicizie al femminile a Torino, preferibilmente tra i 20 e i 27 anni. Mi piacerebbe conoscere ragazze con cui uscire, fare due chiacchiere, condividere interessi, andare a eventi o semplicemente passare del tempo in compagnia. Magari potremmo creare un bel gruppo, così da organizzare uscite, aperitivi, serate tranquille o anche dei viaggi 🌸. Se vi va l’idea, scrivetemi pure 😊",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1l67ej7/amicizie_al_femminile/"
    },
    {
        "id": "1l5fc0s",
        "author": "glorious-ahole",
        "title": "Cerco amici",
        "content": "Mi sono trasferito di recente a Torino e vorrei fare amicizia qui(uomo e donna). Sono un ragazzo indiano di 24 anni. Sono uno studente di dottorato in fisica al Politecnico. Cerco di uscire, andare al bar, ma anche di fare conversazioni piacevoli e tranquille. Fatemi sapere se siete interessati.",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1l5fc0s/cerco_amici/"
    },
    {
        "id": "1l5963x",
        "author": "Mosquuito98",
        "title": "Cerco compagnia",
        "content": "Ciao sono M26, il 24 giugno a Milano ci sarà il concerto dei Linkin Park. I miei amici non vogliono venire perché non vanno pazzo per la band quanto me.\nIo partirò con o senza di loro ma volevo fare una tentazione qui e chiedervi se andate anche voi e se possiamo farci compagnia.\nIo andrò con la macchina e ho 4 posti liberi 🆓 ",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1l5963x/cerco_compagnia/"
    }
]