[
    {
        "id": "1pswukd",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 17,
        "comments": 2066,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pswukd/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1pxlnly",
        "author": "8Nakul",
        "title": "Kylian Mbappé became just the 𝐟𝐨𝐮𝐫𝐭𝐡 player this century to score 60+ goals in a calendar year for club and country",
        "content": "",
        "upvotes": 904,
        "comments": 89,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8pq7oe52gw9g1.jpeg?auto=webp&amp;s=99805c87923ffbd65d4d1b00a8d944c38523180b"
        },
        "permalink": "/r/realmadrid/comments/1pxlnly/kylian_mbappé_became_just_the_𝐟𝐨𝐮𝐫𝐭𝐡_player_this/"
    },
    {
        "id": "1pxly0s",
        "author": "Kick1O1",
        "title": "The Spanish Technical Committee of Referees have admitted 10 VAR errors across the 51 reviewed La Liga matches. Atlético Madrid and Barcelona were among the most favored clubs by those VAR decisions. Real Madrid were the most affected negatively.",
        "content": "",
        "upvotes": 351,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/igxJtMMoAwj20NradtXXblcHAsrx6k0eC73JaUs3dXw.jpeg?auto=webp&amp;s=e81769e760b4e468e6aaadf4a29dbd9316573b38"
        },
        "permalink": "/r/realmadrid/comments/1pxly0s/the_spanish_technical_committee_of_referees_have/"
    },
    {
        "id": "1pxru2n",
        "author": "Alarmed_Text_3953",
        "title": "Hey guys, look at this beautiful shirt I got for Christmas, what do you think?",
        "content": "",
        "upvotes": 84,
        "comments": 2,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pxru2n/hey_guys_look_at_this_beautiful_shirt_i_got_for/"
    },
    {
        "id": "1px6u1z",
        "author": "One-Category5507",
        "title": "23/24 Goals/Assists From Key Players.",
        "content": "",
        "upvotes": 361,
        "comments": 44,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/z6tdbtvsws9g1.png?auto=webp&amp;s=8190e42eb49ebf709087b742b15c8c7fb4941f4f"
        },
        "permalink": "/r/realmadrid/comments/1px6u1z/2324_goalsassists_from_key_players/"
    },
    {
        "id": "1px5xpi",
        "author": "Lemonisto",
        "title": "My updated Real Madrid Kit Collection!",
        "content": "60+ Jerseys, almost all of them authentic. The newest ones (since '22) are bought at the Bernabeu Store! The only white kits that im missing from this century are 08, 19 and 25 😅 my Secret Santa just gifted me the Teka era Guti jersey which inspired me to lay out the whole collection like this once again (been years since ive done it, was a lot of effort). Hope you guys like it!",
        "upvotes": 265,
        "comments": 25,
        "media": null,
        "permalink": "/r/realmadrid/comments/1px5xpi/my_updated_real_madrid_kit_collection/"
    },
    {
        "id": "1pxk2mt",
        "author": "SuchWillingness3800",
        "title": "What's your most controversial/unpopular opinion about Real Madrid??",
        "content": "Like not only current issues we are having but all time what's that one thing the opinion you have about Real Madrid. What is that one opinion you have about Real Madrid — past or present — that you know is unpopular, controversial, or would get you argued against by other Madridistas, but you still believe it’s true?",
        "upvotes": 27,
        "comments": 198,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pxk2mt/whats_your_most_controversialunpopular_opinion/"
    },
    {
        "id": "1pwzf0y",
        "author": "One-Category5507",
        "title": "Vinicius Jr Stats In Semi Finals/Finals. Big Game Player.",
        "content": "",
        "upvotes": 234,
        "comments": 109,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/6o2e7wswdr9g1.png?auto=webp&amp;s=d4797bcb7c16a9bf792da375013dcb306493a15d"
        },
        "permalink": "/r/realmadrid/comments/1pwzf0y/vinicius_jr_stats_in_semi_finalsfinals_big_game/"
    },
    {
        "id": "1px23n5",
        "author": "RoundSize3818",
        "title": "I've seen our boys scoring",
        "content": "",
        "upvotes": 118,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xkglihpiyr9g1.jpeg?auto=webp&amp;s=658e1a528ea38fc86c75c20fae4657aea02fedc1"
        },
        "permalink": "/r/realmadrid/comments/1px23n5/ive_seen_our_boys_scoring/"
    },
    {
        "id": "1pwfhzx",
        "author": "Ready_Ad_1353",
        "title": "Kylian Mbappe at the Morocco vs Mali game at Afcon 2025",
        "content": "",
        "upvotes": 1115,
        "comments": 43,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/oopkskz19m9g1.jpeg?auto=webp&amp;s=42a0a8b1aa774ee29a0c6d9d36cc8a53a20dcf28"
        },
        "permalink": "/r/realmadrid/comments/1pwfhzx/kylian_mbappe_at_the_morocco_vs_mali_game_at/"
    },
    {
        "id": "1pwgti3",
        "author": "Ready_Ad_1353",
        "title": "Brahim Diaz opens the scoring for Morocco against Mali at Afcon 2025",
        "content": "",
        "upvotes": 512,
        "comments": 23,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ttbgigz3jm9g1/CMAF_270.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pwgti3/brahim_diaz_opens_the_scoring_for_morocco_against/"
    },
    {
        "id": "1pwa7ol",
        "author": "o6ohunter",
        "title": "This angle of Vini’s trivela assist to Mbappé",
        "content": "",
        "upvotes": 1014,
        "comments": 67,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/trgka2lt5l9g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pwa7ol/this_angle_of_vinis_trivela_assist_to_mbappé/"
    },
    {
        "id": "1pw9bmt",
        "author": "purewater15",
        "title": "What i got from Christmas",
        "content": "",
        "upvotes": 697,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1xx4be3czk9g1.jpeg?auto=webp&amp;s=55b105d329b019ccd2bb54e8c3c156a1127243ab"
        },
        "permalink": "/r/realmadrid/comments/1pw9bmt/what_i_got_from_christmas/"
    },
    {
        "id": "1pw90xk",
        "author": "Necessary_Muffin8821",
        "title": "Christmas gift from my wife. We’re expecting in May and she got our son his first kit. 🥹",
        "content": "🚨 HERE WE GO! Project Mbappé is complete 🤍\n\nAfter hearing me scream his name all season, the 🐢 signing was inevitable. Deal agreed, contract signed on a long-term commitment, personal terms fully settled. Medical pending. Expected arrival: May. No release clause, academy enrollment already planned. #HalaMadrid",
        "upvotes": 521,
        "comments": 28,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pw90xk/christmas_gift_from_my_wife_were_expecting_in_may/"
    },
    {
        "id": "1pw6xsd",
        "author": "Scary-Procedure-6018",
        "title": "Is this supposed to be some type of new years joke?",
        "content": "What exactly am i seeing here? \n\nAre you telling me ts is gonna cost around 200 dollars in the adidas/madrid store? \n\nGame's gone.",
        "upvotes": 473,
        "comments": 89,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3lg4wv72hk9g1.jpeg?auto=webp&amp;s=263001eded4145c2464eceba1240b00837aa4b77"
        },
        "permalink": "/r/realmadrid/comments/1pw6xsd/is_this_supposed_to_be_some_type_of_new_years_joke/"
    },
    {
        "id": "1pwbk4w",
        "author": "o6ohunter",
        "title": "Anyone else just straight up not enjoy watching this team as of late?",
        "content": "I’ll always tune in, but it just feels like something I do out of habit. It’s the same cycle every week. I tune into Real Madrid, hold hopes for a good or even decent game, and boom. 1-3 opponent chances along with a Courtois save within the first 5 minutes. It’s not even a meme anymore it’s literally almost a given at this point. This is then followed by a series of passes that do next to nothing, a hopeless cross, and a shot from outside the box. This continues on for about 60 minutes until our opponent finally capitalizes on their chances and score. The score is now 1-0. The Madrid players realize they’re down a goal and seem to remember they have a game to win. They’ll turn up the intensity and eventually get away with a scrappy, but well earned goal. Both sides will stalemate until the 80th minute, with the opponent winning the pressure match, but Madrid somehow coming away victorious with a goal that came out of nowhere. \n\nMedia will save their Vini contract talk tweets for another day, something about the dressing room having more confidence in Xabi, and some record Mbappe broke or is about to break. Rinse repeat until we’re knocked out the UCL and come 2nd in LaLiga.",
        "upvotes": 236,
        "comments": 80,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pwbk4w/anyone_else_just_straight_up_not_enjoy_watching/"
    },
    {
        "id": "1pw6gqo",
        "author": "The_M1racul0us_dr3am",
        "title": "At least the away kit looks good😭",
        "content": "",
        "upvotes": 362,
        "comments": 52,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/o9ttq6wxdk9g1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pw6gqo/at_least_the_away_kit_looks_good/"
    },
    {
        "id": "1pwmjd6",
        "author": "Spiritual-Fly5890",
        "title": "30 minutos con LO MEJOR del REAL MADRID de ZIDANE 🧠⚽️",
        "content": "Look where we were … that was an incredible time. All players knew who how to play, defend, shoot. How do we get back to a time like this? It seems like our current players are very one dimensional compared to that time period. Isco, Bale, Benzema, Ronaldo, Kroos, Modric, Pepe, Ramos, Marcelo, etc. Wow these guys were such ballers man. ",
        "upvotes": 33,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Nyg1tVkTTXdli8AZqqsF4c1PuC92Rk7nD551JFBNpLM.jpeg?auto=webp&amp;s=4266f7e4a4dcb6e9870c4e6730f2d49f6041a5b4"
        },
        "permalink": "/r/realmadrid/comments/1pwmjd6/30_minutos_con_lo_mejor_del_real_madrid_de_zidane/"
    },
    {
        "id": "1pw0pbi",
        "author": "divyanshu_01",
        "title": "Nico Paz is joining Real Madrid in June 2026. It's a done deal, the final decision has been made. He will return for €9 million.",
        "content": "",
        "upvotes": 651,
        "comments": 151,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JEoehxLi2SDkRAtbW-a8qlBe-y009VqBeCS7tn4W9AE.jpeg?auto=webp&amp;s=4c3cd5a3d2f4a59876ae1c1a2de39f03ef9b78c9"
        },
        "permalink": "/r/realmadrid/comments/1pw0pbi/nico_paz_is_joining_real_madrid_in_june_2026_its/"
    },
    {
        "id": "1pw6ttq",
        "author": "o6ohunter",
        "title": "The Off-Ball Productivity of Mbappé and Vini",
        "content": "",
        "upvotes": 99,
        "comments": 148,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/rxc0sldtgk9g1.jpeg?auto=webp&amp;s=f355ccfc9e68ae00d8eaa3837e2b3e7ce44ef03f"
        },
        "permalink": "/r/realmadrid/comments/1pw6ttq/the_offball_productivity_of_mbappé_and_vini/"
    },
    {
        "id": "1px5tkv",
        "author": "AlekhineAl",
        "title": "2026/2027 Squad Building Part 1 - PLAYERS OUT!",
        "content": "In order to have our first proper season in three years, we need a major overhaul in the summer of 2026. This requires some sales as well solid scouting and established additions.\n\nDavid Alaba\n\nAlaba should be sold because he cannot be relied upon anymore. He’s injured too often and costs too much to justify being a rotation centre-back. Real Madrid cannot afford to carry a senior defender who misses long stretches every season and still occupies a massive wage slot.\n\nAntonio Rudiger\n\nRudiger’s  injury issues are worrisome and his game is too chaotic to age well. He relies heavily on physicality and intensity, and once that drops even slightly, the mistakes become obvious. We see his reckless challenges, positional lapses, and unnecessary drama and know it will get worse with time.\n\nArda Guler\n\nWe will never play him as a Number 10 here or give him the rope to make enough mistakes until his fearlessness comes back. In any other position, Guler looks good in clips, not in matches that require intensity. He struggles in transition to defence, contributes little defensively and disappears when games turn aggressive. Real Madrid is not a place where players are protected until they mature. If he’s not trusted to start big games by the end of 2025–26, keeping him makes no sense.\n\nFran Garcia \n\nFran G simply isn’t good enough defensively or offensively for a club that wants to win Champions Leagues. He gets targeted by opponents, loses duels, and doesn’t offer any attacking output to compensate. Effort isn’t the issue, quality is. Opponents see him as a weak link, and weak links don’t survive long at this club.\n\nRodrygo\n\nRodrygo has been living off moments for too long. For the majority of the season, he doesn’t dominate games, doesn’t consistently beat his man as a winger and doesn’t provide good enough numbers to justify him as a starter.\n\nWhen things go south, his G/A contribution keeps shrinking. Selling him while his reputation is still high is better than waiting until he becomes just another rotation liability.\n\nFranco Mastantuono\n\nKeeping Mastantuono without regular minutes would stall his career. We know how many young players have died on the bench at these elite clubs. If he’s not going to play meaningful football, he needs to be loaned or sold with control clauses. Sitting around waiting for chances that won’t come helps no one.\n\nVinicius Junior\n\nThe argument for selling Vinicius is not entirely about ability but his toxic nature. He can win matches on his own, but he also brings unnecessary drama, emotional instability, tactical liability and sheer inconsistency. If a massive offer arrives, Madrid should seriously consider cashing in rather than building everything around a player who isn’t manageable most of the time.",
        "upvotes": 0,
        "comments": 37,
        "media": null,
        "permalink": "/r/realmadrid/comments/1px5tkv/20262027_squad_building_part_1_players_out/"
    },
    {
        "id": "1pvn2d5",
        "author": "Forsaken_Currency277",
        "title": "The Negreira Case is just the tip of the iceberg. It’s time to talk about the \"Villar-Platini\" era and the hijacking of the Champions League.",
        "content": "**As of now,** the Negreira trial is exposing the \"financial engine\" behind the club's success. Even though the current trial is about Spanish referees, it makes the \"Platini-Villar Era\" suspicions look much more like a logical extension of a corrupt culture rather than just a \"conspiracy theory.\" The circumstantial evidence creates a picture that many fans find impossible to ignore.\n\n* **The \"Anti-Premier League\" Narrative**\n\nDuring that era, English teams were incredibly dominant (in 2008, 2009, and 2011, three of the four semi-finalists were often English). Platini was vocal about wanting to break the \"Premier League monopoly.\" He famously spoke about the \"universality\" of football and criticized the massive debts of English clubs.\n\nThe Chelsea vs. Barcelona semi-final remains the \"ground zero\" for these theories.Referee Tom Henning Øvrebø turned down at least four clear penalty appeals for Chelsea. In recent years (2018 and 2022), Øvrebø has admitted: *\"I am not proud of that performance\" and \"It was not my best day.\"*\n\n**The Victim:** Didier Drogba was banned for six matches and José Bosingwa for four.\n\nThe Connection: The fact that such a catastrophic performance happened right when UEFA \"needed\" to prevent another all-English final (Man Utd vs. Chelsea) fueled the theory that the referee was, at the very least, \"influenced\" by the atmosphere Platini had created.\n\n* **The Massimo Busacca Incident (Arsenal vs. Barça, 2011)**\n\nThis is widely considered one of the most \"absurd\" red cards in history. Robin van Persie was sent off for a second yellow because he shot the ball **one second** after the whistle was blown for offside. He argued he couldn't hear the whistle over the 95,000 people in the stadium. Not only was Busacca not punished, but he was also hired by FIFA just a few months later. On July 14, 2011, he was named Head of Refereeing Development at FIFA.\n\n**The Victim:** Arsène Wenger and Samir Nasri were the ones charged and banned by UEFA for \"improper conduct\" for complaining about the decision.\n\n* **The Wolfgang Stark Incident (Real Madrid vs. Barça, 2011)**\n\nThe red card given to Pepe for a challenge on Dani Alves changed the entire semi-final. Replays showed that Pepe might not have even touched Alves, but the Barça player went down as if his leg was broken. UEFA didn't punish the referee, Wolfgang Stark. Instead, they rejected Real Madrid’s appeal and upheld Pepe’s suspension.\n\nMourinho gave his most famous press conference. He listed the referees: *\"Why? Why Ovrebo? Why Stark? Why? Every semi-final the same thing happens... I don’t know if it is the Unicef sponsorship or if it is because they are nice guys. I don't understand.\"* Mourinho was pointing to a pattern: in almost every high-stakes Champions League game Barcelona played, their opponent ended up with a red card.\n\n**The Victim:** They focused all their disciplinary power on José Mourinho, banning him for five matches for his \"Por Qué?\" speech. Stark continued to be a top-tier UEFA referee and was even selected for Euro 2012.\n\nThe \"Promotion\" of the Incompetent refrees is obvious.\n\nIn any other industry, if you fail catastrophically at your job, you get fired. In the Villar/Platini era, if you failed in favor of Barcelona, you got promoted.\n\n**The Institutional Link?**\n\nIt’s important to remember who was in power at the time.\n\nVillar and Platini: Ángel María Villar (then President of the Spanish FA) was a very close ally of Platini and a powerful figure in UEFA’s Refereeing Committee.\n\nVillar was a close ally of Joan Laporta (he even helped Laporta get elected in 2003). In 2012, former Barça VP Alfons Godall famously admitted: \"Laporta was very good at cultivating relations with these institutions (RFEF/UEFA), and that helped us. You have to be on the side of the power.\"\n\n* July 2017: Villar is arrested in Operation Soule for corruption, embezzlement, and fraud.\n* May 2018: The Negreira steps down and payments from Barcelona suddenly STOP.\n\nThe moment the \"Godfather\" of the referees was taken down by the police, the money flow ended. This isn't a coincidence; it's a pattern of a system that was dismantled.\n\n**Is this the biggest fraud in sports history? Or are we still supposed to believe it was all \"neutral\"?**",
        "upvotes": 349,
        "comments": 63,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3ecfq8082f9g1.png?auto=webp&amp;s=7c55819e2d25c7e88932ad65ea5a25846a07b738"
        },
        "permalink": "/r/realmadrid/comments/1pvn2d5/the_negreira_case_is_just_the_tip_of_the_iceberg/"
    },
    {
        "id": "1pvmx4z",
        "author": "Luka_Meraki",
        "title": "My mother gave me a Topps lo Real Madrid Team Set for Christmas. Can't believe my luck!",
        "content": "Was hoping for a cool auto but not this!!! I usually open Pokemon packs for fun, this was my first “major” box. Got some great cards for my collection but this was out of this world. 1/5 too!\nI am tempt to put it up on eBay and buy everything I can get on more boxes haha\nGot a 35/199 Rodrygo aswell!",
        "upvotes": 292,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/dyozw2a21f9g1.jpeg?auto=webp&amp;s=5c25e175c2ebfab91cb7870ced9718a8626e7c12"
        },
        "permalink": "/r/realmadrid/comments/1pvmx4z/my_mother_gave_me_a_topps_lo_real_madrid_team_set/"
    },
    {
        "id": "1pvg1gk",
        "author": "Material_Title_3337",
        "title": "My Mom got me this for Christmas. HALA MADRID AND NOTHING ELSE🥶🥶",
        "content": "",
        "upvotes": 588,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vmo5qm4sfd9g1.png?auto=webp&amp;s=83aad15b6c8f1dc0f108ece1c8c74b3ada81b6a4"
        },
        "permalink": "/r/realmadrid/comments/1pvg1gk/my_mom_got_me_this_for_christmas_hala_madrid_and/"
    },
    {
        "id": "1pwvx10",
        "author": "ContextDry9672",
        "title": "The only way to convince Vini to return from his vacation.",
        "content": "",
        "upvotes": 0,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/01blduwBncSuOiKoRlVI9rZDyW8dANfXEKfZLKIj-mY.jpeg?auto=webp&amp;s=c6ab0eb63524a7c5407d9c6963995c3a9ba6bf32"
        },
        "permalink": "/r/realmadrid/comments/1pwvx10/the_only_way_to_convince_vini_to_return_from_his/"
    },
    {
        "id": "1pvgu9d",
        "author": "pablo-gt",
        "title": "no snow, but still a white christmas!",
        "content": "",
        "upvotes": 197,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1pvoah7jmd9g1.jpeg?auto=webp&amp;s=4176c330202709a294ab284f608e95eb0121931f"
        },
        "permalink": "/r/realmadrid/comments/1pvgu9d/no_snow_but_still_a_white_christmas/"
    },
    {
        "id": "1pv6htq",
        "author": "OGjacks",
        "title": "Perfect time for this video 😅",
        "content": "",
        "upvotes": 1266,
        "comments": 33,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/b6owttvqga9g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pv6htq/perfect_time_for_this_video/"
    },
    {
        "id": "1pv4wmz",
        "author": "Ready_Ad_1353",
        "title": "Zinedine Zidane at AFCON watching his son Luca Zidane play for Algeria",
        "content": "",
        "upvotes": 1002,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/me7v8bt2z99g1.jpeg?auto=webp&amp;s=a27865d81443f729485fa16a09a05a751bc9de47"
        },
        "permalink": "/r/realmadrid/comments/1pv4wmz/zinedine_zidane_at_afcon_watching_his_son_luca/"
    },
    {
        "id": "1pvdak3",
        "author": "vil727",
        "title": "Goals and Touches in the box, 25/26",
        "content": "",
        "upvotes": 175,
        "comments": 57,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/x5zh8prspc9g1.jpeg?auto=webp&amp;s=53cd46e4c37d5a4c28cbbc00b2f4a1acf00636ca"
        },
        "permalink": "/r/realmadrid/comments/1pvdak3/goals_and_touches_in_the_box_2526/"
    },
    {
        "id": "1pv1oxo",
        "author": "Affectionate-Sir-425",
        "title": "I have the best girlfriend. HALA MADRID Y NADA MÁS",
        "content": "",
        "upvotes": 945,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9gi3ko5j099g1.jpeg?auto=webp&amp;s=cb2855f51cfd0b6575a2b58fed16826c07744fa4"
        },
        "permalink": "/r/realmadrid/comments/1pv1oxo/i_have_the_best_girlfriend_hala_madrid_y_nada_más/"
    }
]