[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1n6cn5z",
        "author": "BerrisFurller",
        "title": "DOVETE FERMARVI SULLE CAZZO DI STRISCE PEDONALI.",
        "content": "",
        "upvotes": 62,
        "comments": 44,
        "media": null,
        "permalink": "/r/torino/comments/1n6cn5z/dovete_fermarvi_sulle_cazzo_di_strisce_pedonali/"
    },
    {
        "id": "1n6d9vk",
        "author": "m4db0b",
        "title": "Linux Day Torino 2025",
        "content": "Sabato 25 ottobre 2025 si svolge la prossima edizione del [Linux Day](https://www.linuxday.it/) \\- la maggiore manifestazione italiana di promozione e divulgazione del software libero e open source - e, come sempre, anche a Torino ci sarà un evento, quest'anno presso l'Arsenale della Pace in piazza Borgo Dora.\n\n[https://linuxdaytorino.org/2025/](https://linuxdaytorino.org/2025/)\n\nStiamo attualmente raccogliendo proposte per i talk. Abbiamo quattro aule tematiche, e sono benvenuti interventi su\n\n* programmazione con strumenti open\n* networking, cloud, storage e architetture dati\n* dati liberi (open data, OpenStreetMap, Wikidata...)\n* progetti open source\n* qualsiasi cosa riguardi Linux, il software libero e le libertà digitali :-)\n\n[Qui ulteriori dettagli](https://linuxdaytorino.org/2025/#schedule) per inviare la propria proposta.",
        "upvotes": 11,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gFgHv-XYn2_XVM9mLdPX0kXt3PMR69MrbRIOcOCjXs8.png?auto=webp&amp;s=4f700a00986b82569407120df0fcc851e75ae93e"
        },
        "permalink": "/r/torino/comments/1n6d9vk/linux_day_torino_2025/"
    },
    {
        "id": "1n6ljk8",
        "author": "vanillasky6",
        "title": "Veterinario aviario Torino",
        "content": "Buongiorno a tutti.\nVolevo chiedere se ci fosse qualcuno che conosce un bravo veterinario aviario, in particolare per due cocorite, a Torino. Preferirei fosse un veterinario e non una clinica vista la mia situazione di studente fuori sede, ma se così non fosse non sarebbe un problema.\nGrazie mille in anticipo",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1n6ljk8/veterinario_aviario_torino/"
    },
    {
        "id": "1n6jxr4",
        "author": "Holiday_Song4022",
        "title": "Palestra non affollata (Cit Turin)",
        "content": "Ciao a tutti,\nSarei alla ricerca (mi sembra ormai disperata) di una palestra non troppo affollata in zona Cit Turin/San Donato. Sono disposta pagare anche un po’ più della media e più di quelle commerciali visto che al solito orario 18/19 sono fin troppo (ma veramente troppo) piene e non ci si riesce ad allenare bene.\nSpero di non chiedere l’impossibile anche se ormai sto mollando\n\nQualcuno sa consigliarmi gentilmente qualcosa? Grazie mille",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1n6jxr4/palestra_non_affollata_cit_turin/"
    },
    {
        "id": "1n6eood",
        "author": "dart_vandelay",
        "title": "Pinacoteca Agnelli",
        "content": "Buongiorno Torinese, I will be visiting Turin in Oct/Nov and would like to go to the Pinacoteca Agnelli while I'm there.\n\nDoes anybody know why tickets aren't available to buy online after September? Does the gallery shut down at the end of Summer or while exhibitions are being installed?\n\nI would also like to visit a couple of buildings while there; The Palazzo del Lavoro, and the Torino Esposizioni. Are these buildings possible to visit/open to the public?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n6eood/pinacoteca_agnelli/"
    },
    {
        "id": "1n6fhf4",
        "author": "BiteGrand1645",
        "title": "Turin Museums",
        "content": "Hi everyone,\n\nI’m helping my son plan some museum visits in Turin, and I want to make sure both he and an accompanying person can enjoy them easily. I’m looking for museums that are:\n\n* Wheelchair accessible\n* Have free or discounted entry for disabled visitors + companion\n* Open during typical hours (not closed on Mondays, if possible)\n\nSome museums I’m already considering: Palazzo Madama, Royal Palace, Egyptian Museum.\n\nDoes anyone have recommendations for other museums in the city centre or nearby that meet these criteria. Thank you!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1n6fhf4/turin_museums/"
    },
    {
        "id": "1n6gm9e",
        "author": "Effective_Excuse_667",
        "title": "Corso regina margherita: mi sto facendo paranoie?",
        "content": "Ciao,\n\nho trovato una casa in questa zona qui, non avevo pensato al problema sicurezza perchè passando (poco in realtà) non ho notato niente.\nSecondo voi è sicura per una giovane coppia?\nGrazie in anticipo",
        "upvotes": 1,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/afq1rbkiiqmf1.jpeg?auto=webp&amp;s=8b86c929b2015c4ee0737ecf76ee64aa94e97659"
        },
        "permalink": "/r/torino/comments/1n6gm9e/corso_regina_margherita_mi_sto_facendo_paranoie/"
    },
    {
        "id": "1n5y3lc",
        "author": "PresentationLess6537",
        "title": "A Torino cosa c’è da fare la sera?",
        "content": "Ciao a tutt*\n\nUltimamente noto che a Torino non ci sia nulla da fare! Non riesco a trovare stimoli, serate o locali carini dove passare la serata magari che fanno musica fino a tardi ma senza dover per forza andare a ballare. Mi consigliate dei posti dove andare? Pensavo che la zona più famosa fosse san salvario ma l’ultima volta che sono uscita lì non c’era nessuno e la zona era pure bruttina. \n\nMi consigliate locali o attività?\n\ngrazie ",
        "upvotes": 14,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1n5y3lc/a_torino_cosa_cè_da_fare_la_sera/"
    },
    {
        "id": "1n6engl",
        "author": "Jangalit",
        "title": "Messa in centro a Torino il 7 settembre",
        "content": "Ciao a tutti!\n\nDue miei amici americani molto credenti vorrebbero partecipare a una messa durante la loro permanenza qui a Torino, io non essendo credente, non so minimamente che indicazioni dargli, qualcuno sa se domenica 7 settembre in centro a Torino (vicino a loro albergo) ci possa essere qualche messa da parte particolarmente significativa o comunque in qualche luogo particolarmente bello?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1n6engl/messa_in_centro_a_torino_il_7_settembre/"
    },
    {
        "id": "1n6bzur",
        "author": "carmelolg",
        "title": "Dove trovare autentiche Baguette Tradition a Torino?",
        "content": "Ciao a tutti!  \n  \nScrivo perché sono da tempo alla ricerca, a Torino, di una panetteria o un negozio dove poter acquistare **baguette tradition** francesi autentiche, o comunque baguette che si avvicinino davvero a quelle originali di Francia (anche altri tipi di baguette francesi come *campagne* etc.).\n\nPurtroppo, le baguette che si trovano nei supermercati italiani sono spesso molto lontane, per bontà, qualità e anche forma, da quelle che si possono gustare oltralpe.\n\nQualcuno conosce **panetterie o forni artigianali** a Torino che producano baguette di questo tipo, magari anche con farine e tecniche francesi? Accetto volentieri anche consigli su negozi specializzati o forni gestiti da panettieri francesi!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1n6bzur/dove_trovare_autentiche_baguette_tradition_a/"
    },
    {
        "id": "1n5hs8a",
        "author": "drgigabit",
        "title": "Why's there so much dog 💩?",
        "content": "Just the title. Don't want to be rude (there's thousands of things I love about this city), but it seems like I have to keep my head down when I walk anywhere to not step in poop. Is there no law banning not cleaning up after your pet?\n\nIt seems like everywhere except some parts of central. I've seen this many dogs in other cities but not as much poop. Actually, most of them even look like humans.",
        "upvotes": 67,
        "comments": 61,
        "media": null,
        "permalink": "/r/torino/comments/1n5hs8a/whys_there_so_much_dog/"
    },
    {
        "id": "1n661yy",
        "author": "RainDesigner",
        "title": "Any places where people train calisthenics?",
        "content": "Hi all, gonna be moving to Torino this month and was curious if there's any places where people train outdoors or you know, any discipline focused on movement + some strength training. I guess I'll have access to some gym through university but honestly I enjoy much more training handstand, streetlifting or bodyweight exercises so I was wondering if there's any places where people gather to do such activities or anything of the sort. I understand winters can be rather cold so maybe there's sheltered places focused on this kind of activities?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1n661yy/any_places_where_people_train_calisthenics/"
    },
    {
        "id": "1n5wrzl",
        "author": "prutprit",
        "title": "Confronto supermercati locali",
        "content": "Mi sono appena trasferito a Torino.\nOltre ai soliti supermercati e discount, ho visto che vicino a me ci sono:\n- CRAI\n- Metà Supermercati\n- Borello Supermercati\n\nNon avendoli mai visti e/o sentiti prima, come li comparereste a livello di prezzo e qualità? In particolar modo vicino a casa ho anche Pam, Ins e Carrefour, ma quelli li conosco già.",
        "upvotes": 5,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1n5wrzl/confronto_supermercati_locali/"
    },
    {
        "id": "1n5y6d5",
        "author": "PresentationLess6537",
        "title": "Software Dev a Torino",
        "content": "ciaoooo in quanti siamo?\n\nio ho 30 anni e faccio questo lavoro dal 2018. Mi piacerebbe creare una community ",
        "upvotes": 4,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1n5y6d5/software_dev_a_torino/"
    },
    {
        "id": "1n5urkn",
        "author": "ZealousidealPea1397",
        "title": "Appassionati di STORIA?",
        "content": "Ciao, sono un ragazzo di 24 anni che sta per concludere la triennale. Purtroppo, a causa della mia fortissima timidezza, non sono mai riuscito ad intessere delle amicizie con i miei compagni di corso basate sulla comune passione per la Storia. Mi sono dovuto accontentare di un forum internazionale di nome Historum che é decisamente bello e pieno di gente interessante  tutto il mondo, ma io vorrei instaurare delle amicizie più vicine (un mio compare lì è del Pakistan, ma non posso certo frequentarlo spesso dal vivo 😂).\n\nI miei interessi sono abbastanza vari. Devo dire che leggo un po' di tutto, anche se forse non mi interesso troppo della storia del XX secolo. Questi sono i miei argomenti preferiti. \n\nStoria Greca Antica (IV: periodo delle egemonie effimere, quella Spartana subito dopo la guerra del Peloponneso e poi quella più breve Tebana; poi adoro anche il periodo dei Diadochi successivo alla morte di Alessandro Magno). \n\nStoria dell'Islam: soprattutto la parte iniziale riguardante Muḥammad e ʿAlī ibn Abī Ṭālib personaggio sul quale sto svolgendo la tesi triennale). \n\nGuerra Civile Americana: ho anche idea di farmi un giretto a Gettysburg non appena avrò abbastanza soldi. Per ora mi devo \"accontentare\" di Luraghi e di Gallagher. \n\nStoria Moderna: tutto quello che riguarda la Spagna (Filippo II, Invincibile Armada). Se devo essere sincero però mi fermo al 1500-1600; non ho letto molto del 1700 e neanche delle Guerre Napoleoniche. \n\nQuando riesco provo (ma faccio un' immensa fatica) a leggere un po' di Storia del Giappone (Sengoku Jidai), dell'India (Sher Sha  Suri, Hemu, Shivaji, soprattutto quella \"moderna insomma) e anche della Cina (il periodo dei Tre Regni). \n\nSe ci siete fate un fischio. Avere qualcuno con cui discutere e confrontarsi di Storia (anche dal vivo) sarebbe assai bello! \n\nGrazie per la vostra cortese attenzione :)",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1n5urkn/appassionati_di_storia/"
    },
    {
        "id": "1n5xltl",
        "author": "computer_AM",
        "title": "Via della basilica",
        "content": "Ciao! Sono uno studente fuori sede (Polito) e ho trovato casa in Via della Basilica. Qualcuno di Torino mi saprebbe dire come è la zona? Soprattutto per quanto riguarda la criminalità... grazie!!",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1n5xltl/via_della_basilica/"
    },
    {
        "id": "1n5yj0u",
        "author": "PresentationLess6537",
        "title": "Borgo San Paolo / Bennet",
        "content": "Ciao 👋 come vi sembra la zona Borgo San Paolo praticamente dove c’è il bennet? pareri? grazie ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1n5yj0u/borgo_san_paolo_bennet/"
    },
    {
        "id": "1n5wyi9",
        "author": "Weird-Dragonfly-1938",
        "title": "Passaggi Amazon Brandizzo",
        "content": "Ciao a tutti! Inizierò a lavorare su Amazon DPI2 di Brandizzo, turno notturno. Vorrei sapere se c’è qualche gruppo di passaggi. Grazie. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n5wyi9/passaggi_amazon_brandizzo/"
    },
    {
        "id": "1n5t314",
        "author": "mainapizza",
        "title": "Hiking a Noasca e Ca bianca con Wemeet",
        "content": "Ciao, spero sia permesso ma,\n\nSto organizzando un'attività con wemeet, l'idea è di andare a Noasca dietro la cascata e poi da Ceresole alla Ca Bianca, sono un paio di escursioni facili facili e l'occasione per incontrare un po' di persone, tutte nella stessa giornata (sabato 13 settembre) con ritrovo alle 9 e 30 a Noasca, pranzo al sacco da mangiare su alla Ca Bianca. \n\nAvrò una bella sony con me quindi se volete qualche nuova foto profilo approfittate 😁\n\nL'evento si chiama \"Hiking alla cascata di Noasca e Ca Bianca\", limitato a 10 persone! Per iscriversi serve scaricare l'app, è tutto completamente gratuito",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n5t314/hiking_a_noasca_e_ca_bianca_con_wemeet/"
    },
    {
        "id": "1n5wjjt",
        "author": "TryDue4483",
        "title": "Rimozione tatuaggi Torino",
        "content": "Ciao a tutti, sapete consigliarmi dei centri a Torino che effettuano rimozione di tatuaggi?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n5wjjt/rimozione_tatuaggi_torino/"
    },
    {
        "id": "1n604sz",
        "author": "Dizzy_Acadia9437",
        "title": "unito: consulenza del lavoro e gestione delle risorse umane",
        "content": "buonasera a tutti!\nsto cercando di capire quale facoltà scegliere all’unito. non sono assolutamente portata per le STEM, perciò le ho del tutto scartate, anche se so che sono quelle che offrono le migliori prospettive lavorative future.\nora mi ritrovo a cercare altre facoltà, non STEM, che possano comunque offrirmi buone possibilità di guadagno. il corso in “consulenza del lavoro e gestione delle risorse umane” mi sembra interessante, ma non ne ho mai sentito parlare e ho paura che in realtà sia un po’ una cagata. qualcuno ha esperienza o informazioni su questo corso?\n\nin generale, qualcuno può consigliarmi cosa conviene studiare all’unito, fuori dall’ambito STEM, per avere uno stipendio futuro decente?\n\nmi sento persa e una fallita, quindi qualsiasi consiglio o esperienza personale possiate condividere mi farebbe molto piacere leggerla!\n\nun abbraccio.\n",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1n604sz/unito_consulenza_del_lavoro_e_gestione_delle/"
    },
    {
        "id": "1n5zd6y",
        "author": "PresentationLess6537",
        "title": "QBO crossfit?",
        "content": "Pareri sulla palestra qbo crossfit in via renier a Torino?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n5zd6y/qbo_crossfit/"
    },
    {
        "id": "1n5z5k6",
        "author": "PresentationLess6537",
        "title": "Aziende informatica Torino",
        "content": "Quali sono le peggiori aziende di informatica a Torino? ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1n5z5k6/aziende_informatica_torino/"
    },
    {
        "id": "1n5n3sv",
        "author": "Substantial_Gap_6051",
        "title": "Toyota yaris, molti furti?",
        "content": "Devo contemporaneamente trasferirmi a torino a breve sia cambiare auto, sto contrattando per una yaris di 4 anni fa. Molto comoda ma ho ansia perché è come nuova da fuori, somo auto che aprono e che rubano spesso? (Considerando che la parcheggerei in strada)\n(Nom so ancora in quale zona di torino andrei a vivere ma sicuramente eviterò barriera di milano e zone simili perché non voglio maranza tra le palle che li butto sotto)",
        "upvotes": 4,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1n5n3sv/toyota_yaris_molti_furti/"
    },
    {
        "id": "1n5p4r4",
        "author": "Tom_Kazinsky",
        "title": "Baseball/softball amatoriale",
        "content": "Tempo fa esisteva la Turin Softball League, una lega amatoriale di softball aperta a tutti che includeva 6/7 squadre, da quello che sono riuscito a capire\n\nPerò questa lega sembra sparita nel nulla\n\nC’è qualcuno di voi che pratica/conosce realtà del genere? Insomma un modo per praticare a livello amatoriale baseball o softball a Torino?\n\nOvviamente parlo per adulti",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1n5p4r4/baseballsoftball_amatoriale/"
    },
    {
        "id": "1n5eblj",
        "author": "MurkySignificance588",
        "title": "Anime fans in Torino: Demon Slayer movie &amp; cosplay?",
        "content": "Hey! I’m 20M and planning to watch the upcoming Demon Slayer movie in September here in Torino. Looking for people to join, and maybe even cosplay some characters together. If you’re interested, feel free to DM me!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n5eblj/anime_fans_in_torino_demon_slayer_movie_cosplay/"
    },
    {
        "id": "1n51azh",
        "author": "pistacchiocornetto",
        "title": "Job Market Question - Foreigner",
        "content": "I am an American living in Turin with my dear Italian wife. I have a residence permit which I acquired at the start of this year. Finding a job was expectedly hell especially considering a lack of prior Italian-work experience and a not-great level of Italian. \n\nRecently was very fortunate to be hired through my wife’s referral to the restaurant franchise she works for with a tirocinio contract. My Italian is conversational now and continues to improve, but I can’t help but wonder if I can actually expect to get a better job than this? I simply never wanted to work in the food business again after leaving the states and I have experience in security and warehouses. Am I going to struggle to jump jobs and find something better even as I gained this Italian work experience and fluency? If I study for a career in any field or perhaps something related to economics can I hope to find it here in this city? What is your experience?\n\nI ask only because I hear nothing but endless nihilism from literal Italians who have every advantage over me in this regard and it makes me wonder what I am doing here. Is there any hope for me? Thanks in advance, sorry if I seem arrogant I am only stressed. ",
        "upvotes": 7,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1n51azh/job_market_question_foreigner/"
    },
    {
        "id": "1n54zjo",
        "author": "fluoressential",
        "title": "Attività sociali",
        "content": "Ciao, mi sono trasferito da poco a Torino e vorrei provare a conoscere un po' di persone e associazioni della zona con cui iniziare attività sociali (doposcuola, corsi di matematica/fisica/informatica, mense popolari, altro non specificato ma che possa essere utile). Sono in zona San Salvario, ma posso spostarmi. Avete consigli/conoscete associazioni in cerca di volontari? Graziee",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1n54zjo/attività_sociali/"
    },
    {
        "id": "1n4y55m",
        "author": "Nervous_Ad_4895",
        "title": "Trattoria/piola",
        "content": "Ciao, 🙂sapreste consigliare qualche ottima trattoria o piola in cui mangiare tipico?\nGrazie a tutti!",
        "upvotes": 5,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1n4y55m/trattoriapiola/"
    },
    {
        "id": "1n4rp4b",
        "author": "IcyLetterhead6750",
        "title": "Trasferito a Torino da poco, a qualcuno va di fare amicizia?",
        "content": "Ciao a tutti!\nM26, proveniente da un piccolo paesino che si è ritrovato in questa enorme città per questioni lavorative, devo ancora abituarmi\nHo molti interessi tra cui l’informatica, l’arte, il cinema, la lettura e gli sport da combattimento che pratico da tempo, quindi penso di poter trovare spesso argomenti in comune con le persone\nA qualcuno andrebbe di fare amicizia e magari mostrarmi un po’ la città?\nÈ un nuovo inizio e mi piacerebbe avere a che fare con nuove persone con cui condividerlo",
        "upvotes": 11,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1n4rp4b/trasferito_a_torino_da_poco_a_qualcuno_va_di_fare/"
    }
]