[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 490,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1i6dmlf",
        "author": "LauraEats",
        "title": "Netflix is expected to add 8.2 million subscribers in the quarter, reaching 290.9 million",
        "content": "",
        "upvotes": 72,
        "comments": 56,
        "media": null,
        "permalink": "/r/netflix/comments/1i6dmlf/netflix_is_expected_to_add_82_million_subscribers/"
    },
    {
        "id": "1i65s3b",
        "author": "Nejiflower",
        "title": "XO kitty acting is garbage, everything about that show is garbage",
        "content": "Okay, XO, Kitty is proof that not everyone needs to be on TV. I mean, was there even an audition process? Or did Netflix just scroll through creators on insta and say, “You look okay, congrats, you’re now an actor”? The acting felt like a bunch of people who’d never been in front of a camera before\n\nAnd don’t even get me started on the dialogue. It’s like the script was written in TikTok comment sections. Nobody actually talks like that in real life  Hearing those lines come out of their mouths was physically painful, like they were trying to make TikTok slang happen, but no just stop this aint it.\n\njust cast actual actors next time. And get a script that sounds like it was written by humans and not an algorithm trying to go viral. And everyone is suddenly gay and bisexual on a korean school? How unrealistic😹😹 is netflix just trying to check the lgbt boxes or something???",
        "upvotes": 179,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1i65s3b/xo_kitty_acting_is_garbage_everything_about_that/"
    },
    {
        "id": "1i6auay",
        "author": "VanQuackers",
        "title": "What everyone missed about La Palma (SPOILERS)",
        "content": "So I just finished re-watching La Palma for the sixth time and I hopped on reddit to see what people were saying about my new favorite cinematic masterpiece, and I'm absolutely amazed at how wrong everyone seems to be about Erik's \"death\".  Just thought I'd clear up any confusion on the matter.\n\nErik never died.  In the final scene Erik was revealed to actually have been a sea turtle the entire time, who ended up surviving the gunshot due to his hard shell blocking the bullet.  In the last scene of the final episode it literally shows him reuniting with his sea turtle family and slowly fading away as he swam off into the distance 🙄\n\nThere were actually several signs throughout the show to hint at this being the case:\n\n* Erik's obsession with sea turtles and the many boat trips he took to visit them.  \nHe even divulges that he was in debt to the boat guy because of this.\n\n* Erik's need for his sister to take care of him.  \nTowards the beginning of the story he asks his sister for $100 to buy vegetables (sea turtle diet)\n\n* Halfway through the series the police start to arrest Erik but eventually realize he is a sea turtle (you can't arrest sea turtles) and then switch to arresting Marie when she gets involved, which gave away that she was his owner and therefore responsible for him.  \n\n* In the jail when he finally gets ahold of the keys, he struggles to unlock Marie's cell due to his  lack of opposable thumbs.  She even has to steady his flippers to help him out.\n(I honestly debated whether or not to even include this one it was so obvious, I seriously hope no one missed this)\n\nI could go on but I really feel like those are the main points and if you still can't see it then I don't know what to tell you.\n\nAll in all I really loved this series and thought it had a really heartwarming ending and message about how Sara should've died when the tsunami absolutely turbo-fucked the shit out of the airplane like seriously what the fuck was that",
        "upvotes": 22,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1i6auay/what_everyone_missed_about_la_palma_spoilers/"
    },
    {
        "id": "1i6lq0o",
        "author": "S4v1r1enCh0r4k",
        "title": " ‘Bridgerton’ Celebrates Valentine’s Day with Exclusive Fan Event Featuring Season 4 Leads Luke Thompson and Yerin Ha, RSVPs open at 7:30 a.m. PT / 10:30 a.m. ET on January 21 ",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i6lq0o/bridgerton_celebrates_valentines_day_with/"
    },
    {
        "id": "1i6mnj0",
        "author": "Plane-Arugula-9117",
        "title": "I wish netflix could hurry with Ginny and Georgia season 3 release and other shows? does anyone feel like they're trying to space some of the shows out? when do you we get new information? I thought it was this month of January.",
        "content": "what the deal with netflix taking their time release our favorite shows we likes. anyone else feel that way?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i6mnj0/i_wish_netflix_could_hurry_with_ginny_and_georgia/"
    },
    {
        "id": "1i67se7",
        "author": "Cat_of_Xaos",
        "title": "What's going on?",
        "content": "Was just watching a show on my phone. Exited the app for like a minute and when I came back, I am now getting this message when starting the app\n\n\"Sorry, we could not reach the Netflix service. Please try again later. (-16)\"\n\nCleared cache and restarted phone. Didn't help. Never seen this before. Anyone else having an issue rn, or had this happen? Not sure what to do \n\n\nEta: I swear this has something to do with them adding WWE Live to the platform. Have had more issues since they did that, than the last 2 years total. If not longer ",
        "upvotes": 9,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1i67se7/whats_going_on/"
    },
    {
        "id": "1i5xf7z",
        "author": "dreamingofinnisfree",
        "title": "Sorry not sorry Jim ",
        "content": "Our Netflix was recently compromised. We got two notifications of unfamiliar logins from devices we definitely do not own from locations we definitely do not live. We changed the password and should be good now but we did notice a new user profile for “Jim”.  Had we not checked our email, we would have never seen the alerts. Jim could have gotten away with it if he hadn’t been so damn obvious. No question….it just amused me. Better luck next time Jim. ",
        "upvotes": 28,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1i5xf7z/sorry_not_sorry_jim/"
    },
    {
        "id": "1i6gabl",
        "author": "lenny_ma_boaaaaaaaah",
        "title": "Anyone got Netflix reccomendations working on google tv?",
        "content": "It's annoying to have to get on the Netflix all everytime I want to put something on that's not in my continue watching list\n\nWhat's even more annoying is that my android tv in the other room has Netflix reccomendations",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i6gabl/anyone_got_netflix_reccomendations_working_on/"
    },
    {
        "id": "1i6ct3r",
        "author": "crashb996",
        "title": "Why does 720p looks sharper and brighter on my 4k tv than 4k Hdr?",
        "content": "I ve been watching 4k content on netflix ever since I upgraded my TV. I ve a sony X 90k . For some reason the picture quality on netflix in 4k hdr looks so dull and washed out when compared to apple tv , Disney and prime so I tried the 720p plan and it is much brighter and sharper. Is there a setting for 4k that I missed.  .When I go to picture quality it says calibrated. Is there a way to improve the experience? Please help a brother out. ",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1i6ct3r/why_does_720p_looks_sharper_and_brighter_on_my_4k/"
    },
    {
        "id": "1i6fq5w",
        "author": "UpliftHarbor",
        "title": "Looking for show",
        "content": "Its an old show im assuming its probably not on netflix anymore but it was about a school for musically gifted students and all i remember is a character named leah who was kinda bratty and i think a girl bamed maggie and a boy named theo",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i6fq5w/looking_for_show/"
    },
    {
        "id": "1i60fre",
        "author": "DismalLeg7977",
        "title": "Any good dinosaur shows that's not a cartoon or documentary?",
        "content": "So I showed my dad Netflix for the first time and he said wanted to watch \"dinosaur\" we watched all the Jurassic movies and he really enjoyed them. Today he said \"hey put on dinosaur\" so I looked for other dinosaur shows but all I could find was cartoons and documentaries and we watch a little bit but he doesn't like them. I asked him if he wanted to watch anything else and he said \"no I want dinosaur\". Thanks",
        "upvotes": 9,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1i60fre/any_good_dinosaur_shows_thats_not_a_cartoon_or/"
    },
    {
        "id": "1i6dt79",
        "author": "IntrepidHawk7396",
        "title": "Fast forward thumbnail not showing.",
        "content": "Hi. Recently I've noticed when forwarding (on TV) that the thumbnail preview is missing when skipping ahead. \n\nWhen I do forward I have to guess when to stop and start playing again and can't see it what I am skipping past. \n\nI remember having this enabled before but don't see any setting that changes this. Any ideas on how to get this to work again? Is it dependant on the show you are watching? Any help is appreciated. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i6dt79/fast_forward_thumbnail_not_showing/"
    },
    {
        "id": "1i5hpow",
        "author": "Cheekychic_89",
        "title": "Whoever decided to not renew The Brothers Sun needs to jailed..",
        "content": "OK Jailed might be a bit far but seriously atleast fire the shit outta that guy. They renew so many mind numbing shows yet, The Brothers Sun was actually pretty well done and an all around good show with potential. \n\nNow instead of waiting for season 2 for the next 3 years (because that's how long seasons take to shoot these days apparently) I'm sitting here having a winge on reddit.. Thanks guy....",
        "upvotes": 161,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1i5hpow/whoever_decided_to_not_renew_the_brothers_sun/"
    },
    {
        "id": "1i6cbw1",
        "author": "Far-Transition3110",
        "title": "Account sign out w/o my permission",
        "content": "Is this normal? Opened the app on my phone and it is signed out, tried logging in using pw it says wrong pw so i tried sign in code and said no account in this email. But when I opened netflix on my browser to check my account profile it uses my first email. Also verified it. I was scared and changed my email and pw. Now it is ok. I just want to know if it happened to you guys. My guess is hackers or those sell netflix accounts. \n\nAlso 3 months ago, someone's device was added on my account. I really think I was compromised",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1i6cbw1/account_sign_out_wo_my_permission/"
    },
    {
        "id": "1i6jt2w",
        "author": "Careless_Owl_8877",
        "title": "XO Kitty is good, actually",
        "content": "I’ve seen a few posts bashing the show but I’ve honestly been loving it! Here’s 5 things I like about it:\n\n1) Pacing. With each episode being only 30 minutes long, the show wastes little to no time in each episode. This is in stark contrast to some romcoms which can have pacing problems, with filler suddenly grinding the show to a halt. The show is constantly throwing twists and turns, and just when you think you know what’ll happen next it surprises you, without being overly subversive just for the sake of it. I never really felt bored watching this show.\n\n2) Characters. Every speaking character feels like they have a place in the web of relationships that unfolds, as well as having their own motivations. There’s no love interests that exist just to be love interests, each character clearly has their own backstory and personality. I’m glad the show doesn’t waste precious screen time with inconsequential characters, and it felt like as soon as character became irrelevant to the plot, they were able to gracefully fade to the background.\n\n3) Relationships. Some people were bashing on the queer aspects of the show (without considering that that’s the reason some people are watching the show in the first place). I get that it can seem like queer people are overrepresented in this show, but don’t forget that in real life lgbt people tend to stick together, so it’s realistic that a single friend group would have a disproportionate amount of queer people compared to the general population. As for if it’s realistic to be openly queer in South Korea, my interpretation is that it’s a wealthy international school with more liberal values. In terms of how quickly romantic feelings can shift in the show, I think it can be easy to forget that these characters are supposed to be in high school, which is a time of discovery and new experiences for many. It’s common for relationships as a teenager to be somewhat short lived and spontaneous. I think the way the relationships play out is realistic for high school, and it’s also compelling as a coming of age story for Kitty.\n\n4) Dialogue. I know that some will have gripes over the use of “tiktok slang,” but I think it’s faithful to how teenagers talk. While I will admit there are times the acting feels a bit unconvincing/disney-esque, I also found myself laughing out loud at just how natural some of the characters’ reactions to situations were. \n\n5) Setting/Theme. One of my favorite parts of the show is how it basically feels like a marriage of those old CW shows like Gossip Girl and 90210 with modern K drama elements. As someone who went on foreign exchange in Asia, I think the setting of an international school in Seoul is believable and works well to complement the tone and the fact that this is essentially an American show inspired by Korean culture. It also complements the original “To All the Boys I’ve Loved Before” adaptation well.\n\nSo yeah just wanted to post this to counteract some of the negativity around this show in the sub. I think season 2 was phenomenal and I really hope it gets renewed for a third!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i6jt2w/xo_kitty_is_good_actually/"
    },
    {
        "id": "1i5wkgw",
        "author": "Anxious_Purpose_2022",
        "title": "Good thriller suspense series? ",
        "content": "Can anybody suggest me a good thriller/suspense series to watch for tonight. I’m craving for one from a very long time and haven’t had the time to watch. So suggest me some. \n\nThank you. ",
        "upvotes": 4,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1i5wkgw/good_thriller_suspense_series/"
    },
    {
        "id": "1i684z3",
        "author": "Late-Yak-7703",
        "title": "ughhh",
        "content": "i'm in such a show rut right now - nothing has kept me interested lately. I did just watch the dirty john series and thought it was pretty good! Anything similar like that? Doesn't have to be just on Netflix - any streaming service works. thanks friends",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i684z3/ughhh/"
    },
    {
        "id": "1i6hvso",
        "author": "sukh345",
        "title": "Hindi dubbing is not accurate on Netflix ",
        "content": "Today I watched \"The Brothers Sun\" Series And I always keep subtitles On to get accurate dialogues.\n\nI like to watch in hindi because it makes thing enjoyable because of familiarity with language.\n\nSo, today in Opening scene of the series there was important dialogue about the name of the mother of protagonist but in Hindi dubbing he said something else instead of mother's name.\n\nFurther in the same episode, a few more dialogues were changed which were not important but still accuracy should be maintained.\n\nWhy is this happening ?? ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i6hvso/hindi_dubbing_is_not_accurate_on_netflix/"
    },
    {
        "id": "1i62ugz",
        "author": "Cat_2025",
        "title": "Autoplay issue ",
        "content": "For the past like four days Netflix hasn’t been auto playing episodes. It’ll play an episode, play the next, and then autoplay stops and gives me the screen options like it’s the last episode of a series (instead of **moments/speed/episodes/audio and subtitles/next ep/full screen** it’s just **moments/speed/audio and subtitles**) I’ve tried deleting my profile and making a new one, shutting down my iPad, deleting and redownloading the app, and nothing is working. Plz help lol",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1i62ugz/autoplay_issue/"
    },
    {
        "id": "1i6lml1",
        "author": "Lost_Paramedic_3066",
        "title": "Someone left their Netflix Account open at an airbnb I am staying in. What should I do?",
        "content": "As the title says, Im staying at an airbnb and someone who was here previously left their account on. Should I play werid movies and ruin their recommendations? Or be an honorable person and exit out of their account?\n\nThoughts?\n\nMore info: It is not the owners.\nAnd yes, I have my own account.\n\nI'd like to hear more from the people who have been on the raw end of this. \n",
        "upvotes": 0,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1i6lml1/someone_left_their_netflix_account_open_at_an/"
    },
    {
        "id": "1i6a8dz",
        "author": "forevony_0904",
        "title": "What should I watch next ",
        "content": "So now I'm nearly done Never Have I Ever and idk what to watch next. I have 2 new shows in mind. Should I watch Atypical or Sex Lives of College Girls \n\n\nAlso are both of those series now complete\n\n\nAhhh idk what to watch next. Someone tell me which one I should start. Helppppo",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1i6a8dz/what_should_i_watch_next/"
    },
    {
        "id": "1i61shm",
        "author": "Infinite_Cricket_633",
        "title": "Series or movies similar to shogun/Vikings",
        "content": "Hi all, I really love immersive movies and series that play in times long ago like medieval times or similar to shogun or even ancient rome/greece, whatever - you get the idea.. So I'd really appreciate any recommendations on shows or movies that might fit these requirements.\n\nVikings is another show that I really like, just so you guys get an idea,\nSo really any show/movie that plays many years ago and is fairly immersive and cool",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1i61shm/series_or_movies_similar_to_shogunvikings/"
    },
    {
        "id": "1i5kui4",
        "author": "Nuclear_Machine",
        "title": "Back In Action copied almost everything from The Family Plan",
        "content": "Yesterday I watched the new movie „Back in action“ with Cameron Diaz and Jamie Foxx on Netflix. For me, the movie was quite boring and nothing special. But many times the same thought came into my mind: this movie copied so much from „The Family Plan“ with Mark Wahlberg! First of all the plot itself is very similar. But also some scenes of the movie were almost identical. Like the scene, where they get filmed (in the club) or when they were singing classic songs in their cars.\n\nI wonder why Netflix is copying a one year old movie so obviously?",
        "upvotes": 11,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1i5kui4/back_in_action_copied_almost_everything_from_the/"
    },
    {
        "id": "1i6ccw4",
        "author": "Ybcause",
        "title": "AITAH? ",
        "content": "so, i’ve been a netflix member since 2011.  I recently switched to FIOS and recevied the offer for netflix. Lo and behold, somehow I had to use my wife’s email account and I did not realize that my other account was active also.  I contacted netflix after noticing that i had been billed for last month and this month.  I asked them to apply a credit to my account for the 2 months.  They refused and told me to take it up with my bank.  According to them, one of my tvs was still using the old account.  Now, I could be mad at myself, or my wife, for failing to catch it myself, and I own that.  But seriously, they can see that we are paying on two accounts with the same freaking profiles.  14 years and this is how they treat their customers?  I used to be too lazy to cancel my subscription, from now on, but now, they may get me to pay a month or two out of a year, assuming I dont just find a different service.  Well at least Im throwing less money away. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i6ccw4/aitah/"
    },
    {
        "id": "1i5w47t",
        "author": "unknownr2197",
        "title": "If I am shown spatial audio on my netflix account when I am watching videos, which plan do I have?",
        "content": "I have a netfilx account which is billed through sky tv and I do not know which subscription I have. I only have netfilx on 2 tvs. Can someone please help?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1i5w47t/if_i_am_shown_spatial_audio_on_my_netflix_account/"
    },
    {
        "id": "1i5bn4u",
        "author": "ewazer",
        "title": "How many episodes do you prefer?",
        "content": "As the title says, what's your preference for how many episodes a season contains? I grew up in the era of 22(+) episode seasons of network tv, which was fine when there were only 3 or 4 networks to watch. Now though, there are so many shows to watch that I'm thrilled when a show is only 6 eps. 8 is fine, 10 is ok, but above that I start to get antsy. And I'm completely fine with \"Limited\" series. Tell a good story then get out of the way!",
        "upvotes": 26,
        "comments": 78,
        "media": null,
        "permalink": "/r/netflix/comments/1i5bn4u/how_many_episodes_do_you_prefer/"
    },
    {
        "id": "1i66elq",
        "author": "sPdMoNkEy",
        "title": "Bandidos",
        "content": "They kill off my favorite character of all time in Bandidos I don't think I'll be watching another season if they come out with it.  I won't even be watching the last episode of season 2 🫤",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i66elq/bandidos/"
    },
    {
        "id": "1i665ey",
        "author": "wastingparty",
        "title": "When the phone rings/ Rant",
        "content": "Im so disappointed!!! The show was alright. It kept me on edge, very entertaining BUT what was that last episode?!!! This man went to a war zone because his father was responsible for the accident? So he leaves his “love of his life” to go to war …. are you freaking kidding me? I was so freaking irritated that I didn’t even bother finishing that episode. I turned it off. That was Ridonculous.\n\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i665ey/when_the_phone_rings_rant/"
    },
    {
        "id": "1i6calb",
        "author": "halp_mi_understand",
        "title": "Canceled my subscription ",
        "content": "Musk asked the crowd to agree with his disgusting sickness and they all clapped.",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1i6calb/canceled_my_subscription/"
    },
    {
        "id": "1i5gllx",
        "author": "SilyTheGoose",
        "title": "Does Netflix not have subtitles for films that have a different language in them?",
        "content": "Sometimes I try to watch English movies and every once in a while one of them will have a scene or two of the characters speaking a different language. I turn on subtitles hoping I’ll be able to understand what’s going on, but the subtitles just say “speaking in Japanese” or whatever foreign language they are speaking in. Is this a thing that Netflix does in general? Or is it location based or something? It’s pretty annoying not being able to understand what is going on because Netflix doesn’t feel the need to add subtitles.",
        "upvotes": 8,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1i5gllx/does_netflix_not_have_subtitles_for_films_that/"
    }
]