[
    {
        "id": "1mbc4du",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 19,
        "comments": 263,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mbc4du/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1mccpsh",
        "author": "kurt_0806",
        "title": "Xabi Alonso delighted with Arda Guler [MARCA]",
        "content": "According to MARCA, Xabi Alonso was delighted with Güler's performance and attitude . What surprised him most was not only his already well-known quality on the ball, but also his willingness to learn automatic movements, occupy new spaces, and acquire defensive concepts that had never been part of his game. The manager was impressed by the maturity with which Güler assumed this new role and the plan is to continue developing him as a key player in creating play from midfield.\n\nFor his part, Güler also emerged from the tournament much strengthened. After months of demanding more playing time and continuity, the Turk found in Xabi Alonso a coach who believes in his talent and gives him the space he so craved. At 20 years old, Arda Güler  is preparing for a crucial season. Real Madrid is entering a new era with Xabi Alonso at the helm, and the young Turk is poised to be one of the key players. His new role as a creative midfielder not only opens a door for him in the starting lineup, but also places him at the heart of the football project of a coach who relies on talent, associative play, and tactical play.\n\nIf the sensations from the Club World Cup are confirmed, this could be Arda Güler's breakthrough season. \n\n\n",
        "upvotes": 216,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HYuUgrrUyB0GQEc_mJBjON1QOdriBFrE0HJKtcjefKY.jpeg?auto=webp&amp;s=c830c73344e9fe707c927153d605b71753b26c6b"
        },
        "permalink": "/r/realmadrid/comments/1mccpsh/xabi_alonso_delighted_with_arda_guler_marca/"
    },
    {
        "id": "1mc3cnm",
        "author": "menu07",
        "title": "What a good side Marcelo was",
        "content": "",
        "upvotes": 932,
        "comments": 41,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/x28xj5943rff1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1mc3cnm/what_a_good_side_marcelo_was/"
    },
    {
        "id": "1mc4d3j",
        "author": "Onegoofylad",
        "title": "Chema at Stuttgart training",
        "content": "Would be nice to have an “inside agent” to make an attempt to sign Stuttgart’s midfielder Angelo Stiller (person on the right). \n\nI believe he’d make an excellent addition to the midfield and given that anyone could be sold this summer, it’s not that far of a stretch to think and wish about. \n\nOnly hope the board would be on the same page. ",
        "upvotes": 196,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wpr0m8fverff1.jpeg?auto=webp&amp;s=a091eaa4c910b2447b9ea652d0d5cc810276fc36"
        },
        "permalink": "/r/realmadrid/comments/1mc4d3j/chema_at_stuttgart_training/"
    },
    {
        "id": "1mc9rho",
        "author": "auctus10",
        "title": "Comunicado Oficial: Mario Martín.",
        "content": "",
        "upvotes": 47,
        "comments": 9,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mc9rho/comunicado_oficial_mario_martín/"
    },
    {
        "id": "1mc6fr1",
        "author": "Emmanuel_I",
        "title": "El primer entrenador profesional del Real Madrid recibe la modesta limpieza de su tumba por parte de un aficionado del Liverpool",
        "content": "",
        "upvotes": 20,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_x9hds-svq_UgKFyoz2u87EKKWGKTACOtGjV-fTxPsQ.jpeg?auto=webp&amp;s=554916d24bb56826b88fc52b2e8e24e91b9e8068"
        },
        "permalink": "/r/realmadrid/comments/1mc6fr1/el_primer_entrenador_profesional_del_real_madrid/"
    },
    {
        "id": "1mbefmr",
        "author": "Any_Paint_5822",
        "title": "Thibaut Courtois hanging out in Tomorrowland",
        "content": "As almost every year, Courtois was spotted at Tomorrowland in Belgium, enjoying the festival with his wife. I also saw him in the 2022 edition, he is clearly a big fan.\nTried to get a picture but he had a bodyguard not allowing any contact from the crowd.\nPS: If I remember correctly, he even had Martin Garrix perform at his wedding. \n",
        "upvotes": 567,
        "comments": 42,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/je046jkzvlff1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1mbefmr/thibaut_courtois_hanging_out_in_tomorrowland/"
    },
    {
        "id": "1mbn4cr",
        "author": "Individual-Insect927",
        "title": "Mom bought me a Chelsea sportswear",
        "content": "I really dont know what to do.  So i wanted to buy a new sportswear for the gym . And my mom decided to buy one for me to make me happy. It looks good ngl . But There is a problem here . It has Chelsea logo on it.  And now idk what to do cuz i doubt the store will take it back . I hate myself rn cuz if i tell her the truth she will be sad and also i hate to wear another team .i was a madridista since childhood but my mom was never into sports so she doesnt know what even club logo means.\nWhat would you do if you were in my shoes?\n\n\n\nEdit: thank you all for the replies.  I will use it then , hopefully my Barca friends will never see me with these xD",
        "upvotes": 114,
        "comments": 113,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mbn4cr/mom_bought_me_a_chelsea_sportswear/"
    },
    {
        "id": "1mbahjz",
        "author": "EffectiveTie3144",
        "title": "OTD july 28 2006 Van Nistelrooy was presented on the Bernabeu stadium, as a Real Madrid's player. He won the Pichichi Trophy in his first season.",
        "content": "",
        "upvotes": 656,
        "comments": 26,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mbahjz/otd_july_28_2006_van_nistelrooy_was_presented_on/"
    },
    {
        "id": "1mbe2cb",
        "author": "Ghost-Ripper",
        "title": "WHO are the missing players?👀",
        "content": "",
        "upvotes": 154,
        "comments": 28,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mbe2cb/who_are_the_missing_players/"
    },
    {
        "id": "1mbfplz",
        "author": "EdwinTorres09",
        "title": "La vida me sigue dando señales 😫🤧😍",
        "content": "",
        "upvotes": 121,
        "comments": 5,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/hm0oighl6mff1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1mbfplz/la_vida_me_sigue_dando_señales/"
    },
    {
        "id": "1mbba4u",
        "author": "Galactic_Ryder",
        "title": "Throwback to pre-season 94/95: new signings unveiled at the Santiago Bernabéu",
        "content": "From left to right, we see the Real Madrid squad. Standing in the back are Fernando Redondo, Santiago Cañizares, Michael Laudrup, and Pedro \"Koke\" Contreras. Crouching in the front are Quique Sánchez Flores, José Amavisca, and Ismael Urzaiz.\n\nPedro \"Koke\" Contreras and Ismael Urzaiz were academy players who were promoted to the first team that season. Santiago Cañizares also came through Real Madrid's academy but had been loaned out to Elche and Mérida, then sold to Celta, before making his return to the club that year.\n\nRegarding the other players shown: Fernando Redondo was purchased from CD Tenerife, Michael Laudrup joined as a free agent from FC Barcelona, Quique Sánchez Flores was bought from Valencia CF, and José Amavisca was acquired from Real Valladolid.\n\nNot visible in this picture is Raúl González, who began the season with the C team. He would be promoted later in the 1994-95 season, making his highly anticipated first-team debut on Matchday 9 against Real Zaragoza.",
        "upvotes": 151,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/cvzbamaqzkff1.jpeg?auto=webp&amp;s=1264da45bdeca156a9adcfbe0906006e26b2805a"
        },
        "permalink": "/r/realmadrid/comments/1mbba4u/throwback_to_preseason_9495_new_signings_unveiled/"
    },
    {
        "id": "1mbb171",
        "author": "Zeepat963",
        "title": "The last match played los blancos played without a balon d’or winner in the squad was 19th of May 2000",
        "content": "As said in the title, I begin to understand more why Perez is gunning for Rodri. It so much. He is also the only active balon d’or player within Europe that isn’t Lukita. \n\nThe match was against Real Valladolid and we lost 0-1. \n\nLine-up:\nGK: Casillas\nLB: Roberto Carlos\nLCB: Helguera\nRCB: Karanka\nRB: Salgado\nLDM: Campo\nRDM: Redondo (Captain)\nCAM: Raúl\nLM: Sávio\nRM: McManaman\nST: Anelka\n\nSubs:\nBodo Illgner\nFernando Hierro\nManolo Sanchís\nChristian Karembeu\nNjitap Geremi\nElvir Baljic \nFernando Morientes \n\nManager:\nVicente del Bosque\t \n\nWhat are your thought about this? Worth it to pay the extra for Rodri?\n\nEdit: remove the first ”played” in the title. My bad:/\n\nEdit: never mind as someone commented, the months between CR7s departure and Modric winning it, we played without a balon d’or winner",
        "upvotes": 134,
        "comments": 55,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mbb171/the_last_match_played_los_blancos_played_without/"
    },
    {
        "id": "1mcfwkz",
        "author": "Embarrassed_Sport266",
        "title": "At This Rate Rodrygo Is Going to Leave on Deadline Day",
        "content": "At This Rate Rodrygo Is Going to Leave on Deadline Day. The way this transfer saga has unfolded it has indicated a few things. For one that Rodrygo is going to leave the club the signs were there as early \"Don't Forget the R\" propaganda last summer/early fall. As soon as I saw Rodrygo getting benched in the CWC I knew it was over. Xabi was sending a message and it breaks my heart. \n\nThe other fact is that Rodrygo is nowhere near a move right now depsite rumors being hot all summer. Imo the best fit for him was Bayern and they overpaid for Diaz instead. Liverpool has already spent a lot and currently going for Isak. Then you got Arsenal who seems to have opted for a RW backup and other bench pieces instead of a bona fide starter at LW instead. \n\nHonestly idk how Al Hilal hasn't swooped in and even offered half or 75% of what they were offering to Real Madrid and Vini. I think the club would accept that in a heartbeat and it might turn Rodrygo's head. I mean its turning Vini's. ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mcfwkz/at_this_rate_rodrygo_is_going_to_leave_on/"
    },
    {
        "id": "1mbaa3l",
        "author": "RamsesII89",
        "title": "How Real Madrid’s Stadium Became a Cash-Printing Machine - The Joe Pomp Show (podcast)",
        "content": "Interesting episode from The Joe Pomp Show going over the transformation of the Santiago Bernabéu’s recent project.\n\nThe new Bernabéu is not just a football ground — it’s a hybrid commercial hub engineered for sustainable, diversified revenue. It’s one of Perez’s first major steps to effectively future-proofed the club’s financial engine, ensuring its place at the pinnacle of global sport and entertainment.\n\n",
        "upvotes": 14,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Lztu0Uq2SFloEV33Cy5JR-Gm6FxiuE0CyO1tdfu7LqQ.jpeg?auto=webp&amp;s=a6141761e0c9a4f0a782cf092ad0b829240a24a6"
        },
        "permalink": "/r/realmadrid/comments/1mbaa3l/how_real_madrids_stadium_became_a_cashprinting/"
    },
    {
        "id": "1mbaffh",
        "author": "choker_18",
        "title": "what do you guys think ?",
        "content": "after this season we all are worried about our defense and somehow disappointed as madrid managment is not working (buying defenders).\n\n  \ni dont know if i make sense but we are not as bad as many are assuming,for example we have joan martinez (la fabrica product).he is just phenomenal.\n\n  \nAlvaro-joan-dean-militao or rudi..... i know 3 of them are very young and dont have \"experience\" but they will improve themselves.\n\n  \nwe all know how much xabi trusts academy players and the way gonzalo garcia proved him right and somehow boosted his confidence in academy players.... i am  personally sure that xabi will keep bringing academy players.",
        "upvotes": 13,
        "comments": 9,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mbaffh/what_do_you_guys_think/"
    },
    {
        "id": "1madx8c",
        "author": "menu07",
        "title": "How many of us remember this day",
        "content": "",
        "upvotes": 1526,
        "comments": 31,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/hjpksfbymcff1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1madx8c/how_many_of_us_remember_this_day/"
    },
    {
        "id": "1mai2dr",
        "author": "ersansefa",
        "title": "Rodrygo Has Run Out of Options",
        "content": "Rodrygo Goes, the Brazilian winger at Real Madrid, finds himself in a complex situation regarding his professional future. Despite being highly regarded in Europe, his role at the club has been drastically reduced, with very limited participation in key matches like the Copa del Rey final and the Club World Cup final. Real Madrid is considering selling him to complete two crucial transactions in the transfer window, though no formal offers have yet been received.\n\nClubs such as Bayern Munich and Liverpool have opted for other targets, while Arsenal has not advanced beyond preliminary interest. Only Tottenham remains as a potential suitor, albeit a less prominent one. This leaves Rodrygo with few alternatives amid declining physical and emotional condition, having lost weight and confidence. The club would only entertain offers of around €100 million, which presents a significant hurdle in today’s competitive market.\n\nA Market in Flux\n\nAs the global market heads toward a high-stakes finish in spending, there are still players looking for a new space to shine. Rodrygo, born in 2001 in Osasco, São Paulo, Brazil, is among them  ￼.\n\nWhile he’s on many clubs’ radar, and Real Madrid hasn’t yet received an official offer, the club’s planning includes his departure to fund the final moves needed to complete their dream squad  ￼. Rodrygo played only 45 minutes in the Copa del Rey final against Barcelona in April and 92 minutes in the Club World Cup—indicating how limited his game time has become  ￼.\n\nAlthough Rodrygo and his representatives have publicly expressed his desire to remain at Madrid, reports suggest the club views him as a transfer candidate following his substitution in the Copa del Rey final  ￼.\n\nPhysical and Mental Decline\n\nSince then, Rodrygo has struggled with a physical imbalance that caused him to lose nearly five kilos, as well as an emotional downturn due to his lack of effectiveness in front of goal. Even a stay in Brazil with his two children did not fully help him clear his mind  ￼.\n\nInterest Fading from Big Clubs\n\nDespite maintaining a strong reputation across Europe, major clubs are looking elsewhere. Bayern has decided to sign Luis Díaz (for around €80 million) and Liverpool has not progressed its interest in Rodrygo. Real Madrid insists on offers close to €100 million if a sale is to happen  ￼.\n\nLiverpool’s considerable winter spending—such as Wirtz (€125M) and Ekitike (€95M)—may also explain the lack of movement regarding Rodrygo  ￼. Meanwhile, Arsenal has already invested roughly €200 million in Zubimendi (€70M), Madueke (€56M), and Gyökeres (€75M), reducing appetite for another major forward signing  ￼.\n\nOnly Tottenham remains an option—but it’s seen as a step down compared to the other clubs. Gradually, Rodrygo is running out of viable alternatives to leave Real Madrid this summer  ",
        "upvotes": 368,
        "comments": 163,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vmXjv9K9qea4EAoJ6vI0ZLTVVAxpcn32v7FoLnBRoY8.jpeg?auto=webp&amp;s=a6b6c77a9cf064df6ee50fb33a1e0b04d308c831"
        },
        "permalink": "/r/realmadrid/comments/1mai2dr/rodrygo_has_run_out_of_options/"
    },
    {
        "id": "1ma4d2b",
        "author": "Opening_Landscape951",
        "title": "They had no idea that together they'd rule over Europe a few years later",
        "content": "",
        "upvotes": 1714,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jqr4txv8aaff1.jpeg?auto=webp&amp;s=bbdfb5b33467912d82222cd92d04aa5cdd473c7d"
        },
        "permalink": "/r/realmadrid/comments/1ma4d2b/they_had_no_idea_that_together_theyd_rule_over/"
    },
    {
        "id": "1mak0dw",
        "author": "auctus10",
        "title": "Comunicado Oficial: Chema Andrés.",
        "content": "",
        "upvotes": 97,
        "comments": 23,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mak0dw/comunicado_oficial_chema_andrés/"
    },
    {
        "id": "1m9y80p",
        "author": "brainybrit",
        "title": "Is Keylor Navas the most underrated GK in recent decades?",
        "content": "",
        "upvotes": 2642,
        "comments": 152,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/nsojl9jm09ff1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1m9y80p/is_keylor_navas_the_most_underrated_gk_in_recent/"
    },
    {
        "id": "1mbprt9",
        "author": "Peterpaul400",
        "title": "Is it time for Alaba to move on, or should he stay another season?",
        "content": "David Alaba has been a key figure in the squad, offering leadership, experience, and versatility at the back. But with injuries affecting his consistency and younger players stepping up, it’s fair to ask whether keeping him for another season is the right move. Does he still bring enough to the pitch to justify his place? Or is it time for the club to look ahead and refresh the backline?",
        "upvotes": 0,
        "comments": 44,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mbprt9/is_it_time_for_alaba_to_move_on_or_should_he_stay/"
    },
    {
        "id": "1m9qiua",
        "author": "NarcissisticHydra",
        "title": "Courtois was at the belgian grand prix (sprint race) today!",
        "content": "",
        "upvotes": 420,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/y29634cx97ff1.jpeg?auto=webp&amp;s=5b0931af5ab0eab2143e02fd7e1aba3fee901c10"
        },
        "permalink": "/r/realmadrid/comments/1m9qiua/courtois_was_at_the_belgian_grand_prix_sprint/"
    },
    {
        "id": "1m9tyrx",
        "author": "More-Judgment-9253",
        "title": "Joan Martinez vs Marbella",
        "content": "I know it's just pre season but it's nice to finally see him back",
        "upvotes": 244,
        "comments": 21,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/i2p1r98758ff1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1m9tyrx/joan_martinez_vs_marbella/"
    },
    {
        "id": "1m9phej",
        "author": "ManuMora98",
        "title": "Marbella 0 - [3] Castilla | Rachad Fettal 57' | Friendly",
        "content": "",
        "upvotes": 54,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cutTAfwfD9kkO9SIqGE-PxwfbAKuCKtZM9DkSMYQe4E.jpeg?auto=webp&amp;s=d19e9b62b9c37c7e5283486b4bd1dc4888e022df"
        },
        "permalink": "/r/realmadrid/comments/1m9phej/marbella_0_3_castilla_rachad_fettal_57_friendly/"
    },
    {
        "id": "1m9668y",
        "author": "AestheticEvan23",
        "title": "Kylian Mbappé has the most g/a in the last 5 seasons in Europe top 5 leagues",
        "content": "",
        "upvotes": 834,
        "comments": 103,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/s22rnydk72ff1.jpeg?auto=webp&amp;s=90ba310980357301e2a7f11d3debc20b6696a6fc"
        },
        "permalink": "/r/realmadrid/comments/1m9668y/kylian_mbappé_has_the_most_ga_in_the_last_5/"
    },
    {
        "id": "1m900ij",
        "author": "AestheticEvan23",
        "title": "Throwback to that Luka Modriç goal vs man united",
        "content": "",
        "upvotes": 1592,
        "comments": 42,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/jqouwxhj11ff1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1m900ij/throwback_to_that_luka_modriç_goal_vs_man_united/"
    },
    {
        "id": "1m9pjty",
        "author": "ManuMora98",
        "title": "Marbella 0 - [4] Castilla | Rachad Fettal 60' (Brace on his debut) | Friendly",
        "content": "",
        "upvotes": 38,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kwDoQY13jIcJoglsMOlOiCbl1C_2LO5Iss1WARUhxK8.jpeg?auto=webp&amp;s=4772bcf78587f559682e00bc73cbc3ac95497ee3"
        },
        "permalink": "/r/realmadrid/comments/1m9pjty/marbella_0_4_castilla_rachad_fettal_60_brace_on/"
    },
    {
        "id": "1m9035z",
        "author": "AestheticEvan23",
        "title": "Throwback to that Luka Modriç performance vs united",
        "content": "",
        "upvotes": 816,
        "comments": 16,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/f4q4tm0s11ff1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1m9035z/throwback_to_that_luka_modriç_performance_vs/"
    },
    {
        "id": "1maoz2w",
        "author": "TheFeatherDiaries",
        "title": "I am speechless by no bids for Rodrygo",
        "content": "I am really speechless that not even one club has made a bid for Rodrygo. He is such a fine and proven LW, full of skills, and technical play. Normally, teams run behind this kind of player.\n\nLiverpool was in the news, they maybe want him, but they say they need to sell Luis Diaz first. Arsenal also talk so much, they say they will pay big money, but still no real bid. PSG even, but Real Madrid says no offer came yet. Tottenham, Manchester clubs only news, no action.\n\nMaybe they all are playing waiting game until the last minute.\n\n",
        "upvotes": 0,
        "comments": 65,
        "media": null,
        "permalink": "/r/realmadrid/comments/1maoz2w/i_am_speechless_by_no_bids_for_rodrygo/"
    },
    {
        "id": "1m9pgpt",
        "author": "ManuMora98",
        "title": "Marbella 0 - [2] Castilla | Loren Zúñiga 44' | Friendly",
        "content": "",
        "upvotes": 13,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/DM2sW_vvpSjcFhllgchuXPg4M0GKrx0wQJkCPknaW68.jpeg?auto=webp&amp;s=c4b7cad8073ccd02adbb960c3f38a195c6994511"
        },
        "permalink": "/r/realmadrid/comments/1m9pgpt/marbella_0_2_castilla_loren_zúñiga_44_friendly/"
    }
]