[
    {
        "id": "1kqp8wa",
        "author": "missionfilms",
        "title": "I’m Simon Pegg and my film, Mission: Impossible – The Final Reckoning hits theatres on Friday, May 23. AMA.",
        "content": "**I’m Simon Pegg and I play Benji Dunn in the Mission: Impossible films. Some of my previous films have included Shaun of the Dead, Hot Fuzz, The Worlds End, and Star Trek. I’ll be back on Wednesday, May 21 at 10:45am ET to answer your questions.**                                                      \n\nhttps://preview.redd.it/ljtavvpect1f1.jpg?width=1600&amp;format=pjpg&amp;auto=webp&amp;s=c05a101270fbbf447ba53047aa0fbf4f8c35977e\n\n",
        "upvotes": 333,
        "comments": 264,
        "media": null,
        "permalink": "/r/movies/comments/1kqp8wa/im_simon_pegg_and_my_film_mission_impossible_the/"
    },
    {
        "id": "1kqoab8",
        "author": "SanderSo47",
        "title": "May 16-18 Box Office Recap – 'Final Destination: Bloodlines' debuts with a colossal $51M domestically and $105M worldwide, the best in the franchise. 'Hurry Up Tomorrow' flops with just $3.3M. 'Thunderbolts*' crosses $300M worldwide, but it's dropping faster than anticipated.",
        "content": "https://preview.redd.it/z1hsynpn7t1f1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=79ad3fdce57bfee2ec5ba408ed8fea55e0bf0778\n\nThis weekend, WB successfully resurrected another iconic horror franchise.\n\n***Final Destination: Bloodlines*** easily topped the box office, achieving the best debut in the franchise by a wide margin. Meanwhile, the other wide release, ***Hurry Up Tomorrow***, flopped with one of the most front-loaded debuts in history.\n\nThe Top 10 earned a combined $101.3 million this weekend. That's up 11% from last year, when ***IF*** topped the box office.\n\nDebuting on first place, WB/New Line's ***Final Destination: Bloodlines*** debuted with a fantastic $51.6 million this weekend. That's easily the franchise's biggest debut, passing ***The Final Destination*** ($27.4 million). In fact, within just 3 days, it's already the fourth biggest film in the franchise. By tomorrow, it will move to second place. And in a few days, it will pass the fourth film to become the biggest film in the franchise.\n\nNot only that, but this was also higher than any of the ***Scream*** and ***Alien*** films. It's the 11th biggest debut for a horror film. Absolute craziness. That raises the question: how did the franchise jump from $27 million to $51 million? \n\nSimply put, ***Final Destination*** is one of the most iconic horror franchises of the century. How many people refused to board planes or drive behind log trucks because of these films? Quite a lot. The franchise allowed itself to find new audiences by releasing films with a good frequency: 2000, 2003, 2006, 2009, and 2011. And as each film is pretty much standalone (except maybe the second), everyone can jump into any point to watch these films.\n\nNeedless to say, the 14-year gap helped the film build anticipation and intrigue. The franchise has become very popular among Millennials and Gen Z, which are key demos for a horror film. The trailers did a fantastic job in showcasing everything everyone loves about these films: brutal and insane Rube Goldberg-style deaths. The franchise may have not been popular with critics, but they were won over with this one. It's sitting at a fantastic 93% on RT, suggesting that people should give this one a chance. And finally there might have been interest in seeing the late Tony Todd one last time in his role, no matter if it was a big or small role.\n\nAccording to Warner Bros., 52% of the audience was male. We mentioned Millennials and Gen Z loved the franchise and the demos corroborate that; a massive 73% was 34 or under. They gave it a \"B+\" on CinemaScore, which is pretty good for a horror film, tying for the best in the franchise. There's some rough competition in the coming weeks, so it's unlikely it will hold incredibly well. Nevertheless, the film is already a hit. For now, we're projecting a $130 million domestic total for ***Final Destination: Bloodlines***. Expect WB to greenlight a sequel any minute now.\n\nIn second place, ***Thunderbolts*** dipped 49%, earning $16.6 million this weekend. That's not as bad as last week's drop, but it indicates ***Final Destination*** was bigger than expected competition. The film has amassed $155.5 million so far. The film is currently beating ***Captain America: Brave New World*** in daillies, although it remains $8 million behind. Depending on how much it drops against ***Lilo &amp; Stitch*** and ***Mission: Impossible – The Final Reckoning***, there's a strong chance it could miss $200 million domestically. That'd be very disappointing.\n\nIn third place, ***Sinners*** was barely affected by the arrival of ***Final Destination***. It eased a light 31%, earning $15.2 million this weekend. One thing on its favor was that it regained some IMAX 70mm screens this weekend. It's slightly behind ***Thunderbolts***, but it looks like it will start gaining a lead; [on Thursday, it beat ***Thunderbolts*** by almost $200K.](https://www.the-numbers.com/box-office-chart/daily/2025/05/15) By next week, it could go ahead of it. The film has earned $240 million, and it's heading towards around $280 million lifetime.\n\n***A Minecraft Movie*** dipped 22%, adding $5.9 million this weekend. The film has earned $416.7 million, and it should finish with around $430 million domestically.\n\nIn fifth place, ***The Accountant 2*** had another great hold. It eased just 29%, earning $4.7 million this weekend. The film has earned $58.8 million, and it should finish with over $65 million domestically.\n\nDebuting in sixth place, Lionsgate's ***Hurry Up Tomorrow*** flopped with an awful $3.3 million in 2,020 theaters.  That's one of the weakest debuts for any film playing at over 2,000 theaters. That's even worse than Jenna Ortega's ***Death of a Unicorn*** ($5.7 million), which was another failure a few months ago. It's not even Trey Edward Shults' best debut as director, as it's barely half of what ***It Comes at Night*** ($5.9 million) made back in 2017.\n\nThe one question everyone should be asking right now: is anyone remotely surprised by this? OP here certainly doesn't. The Weeknd may be popular (he's the third most popular singer on Spotify with 116 million monthly listeners), but he's no stranger to flops. Back in 2023, he released the critically panned HBO series ***The Idol***, which was cancelled after ending its 5-episode run. There's been reports that he changed the series' original premise, mainly because it was \"heading too much into a female perspective.\"\n\nSo what was his next move? A companion film piece to the album of the same name. But that set a challenge: it meant that the film would appeal to no one outside The Weeknd's fanbase. Jenna Ortega and Barry Keoghan are well respected actors, but they're not immune to failure either. And while the presence of an acclaimed filmmaker like Trey Edward Shults aliviated some concerns regarding the quality, it turns out it was all for nothing; the film is currently sitting at a horrible 16% on RT. Turns out we were witnessing ***The Idol 2.0***, except this time it was in theaters.\n\nFinally, the one thing that makes this debut worse than it already is: how front-loaded it was. The film earned $1.65 million in Wednesday and Thursday previews. It made just $684,959 on Friday, followed by steep drops on Saturday and Sunday. Basically, its Friday ($2.3 million) represented a colossal 70% of its weekend gross. This NEVER happens, pals. NEVER. [The makes it the second most front-loaded film in history](https://www.the-numbers.com/box-office-records/domestic/all-movies/legs/front-loaded-opening-weekend), where most of the top spots belong to Indian films. What does this mean? What was previously said: it was for Weeknd fans, and Weeknd fans only. Zero appeal beyond that. Ouch.\n\nAccording to Lionsgate, 55% of the audience was female, and 44% of the audience was in the 18-24 demographic. Critics annihilated the film, and the audience agreed. They gave it a horrible \"C–\" on CinemaScore, incredibly poor word of mouth. And that's when The Weeknd's fanbase is already boosting the grade. Seeing how front-loaded it was, the film will finish with just $5 million domestically. That's 0/2 for The Weeknd's career as leading actor. Save your tears for another day.\n\nAfter its incredible start in 6 theaters last week, A24 expanded ***Friendship*** to 60 theaters. The result? It managed to crack the seventh spot, with a pretty great $1.4 million this weekend. That's a strong $23,338 per-theater average, which is the best of the weekend. Through 10 days in limited release, the film has already earned $2 million. Now its true test begins this week, when A24 expands it into wide release.\n\n***Clown in a Cornfield*** was deeply affected by ***Final Destination***. It collapsed 63%, earning $1.3 million this weekend. Through 10 days, the film has made $6.3 million so far.\n\nFacing the wrath of ***Final Destination***, Sony's ***Until Dawn*** collapsed 58%, adding $811,159. The film's domestic total stands at $19.6 million, and it only has $2 million left in the gas (at most).\n\nRounding up the Top 10 was 20th Century Studios' ***The Amateur***. It dipped 38%, adding $724,688. The film has made $40.1 million so far.\n\n#**OVERSEAS**\n\nDeath was also welcome in the rest of the world.\n\n***Final Destination: Bloodlines*** outperformed projections, debuting with a fantastic $54 million overseas, for a $105 million worldwide debut. It's already the highest grossing film in the franchise in so many countries after just one weekend. The best debuts were in Mexico ($5.5M), the UK ($5.3M), Philippines ($3.4M), India ($3M) and France ($3M). This is an easy profit here, ladies and gentlemen. Look for the film to finish with over $250 million worldwide, and it could get close to $300 million assuming it holds well against the incoming competition.\n\n***Thunderbolts*** took another rough drop this week. It dropped 54% and added $15.7 million overseas, taking its worldwide total to $325 million. The best markets are the UK ($18.4M), China ($15.2M), Mexico ($13.7M), France ($8.6M) and Australia ($7.8M). We have to face reality: this is not good at all. It's not holding very well, and competition is incoming. Right now, the film will probably finish below $400 million. This is flop territory. \n\n***A Minecraft Movie*** added $8.3 million this weekend, taking its worldwide total to $929 million. The best markets are the UK ($72.1M), Germany ($37.6M), Australia ($34.6M), Mexico ($32.5M) and China ($28.7M). Right now, it looks like the billion milestone is unlikely.\n\n***Sinners*** added $3.8 million this weekend, allowing the film to cross $300 million worldwide, three times its budget. The domestic market is doing all heavy lifting (75.9%), but at the end of the day, it's a hit. \n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Drop* | Apr/11 | Universal | $7,397,015 | $16,600,805 | $28,355,317 | $11M\n\n- Can anyone check for signs of life on Blumhouse? Cause ***Drop*** closed with an underwhelming $28 million worldwide. That's incredibly weak, and it's one of their worst performers ever. The budget may have been $11 million, but it still had an extensive marketing campaign. For the film to not hit $30 million is simply terrible. Considering this, ***The Woman in the Yard*** and ***Wolf Man*** all underwhelmed, Blumhouse really needs to reconsider whatever the hell it's doing. \n\n#**THIS WEEKEND**\n\nBrace yourselves, for we're heading for perhaps the best Memorial Day weekend in history, thanks to two films.\n\nThe first is Disney's ***Lilo &amp; Stitch***, their latest live-action remake. The original earned $273 million worldwide back in 2002, and its popularity has grown in the past years. Thanks to an incredible marketing campaign, high interest (it's Disney's second-most viewed live-action film trailer) and incredibly strong pre-sales, ***Lilo &amp; Stitch*** will easily break some records this weekend.\n\nThe other release is Paramount's ***Mission: Impossible – The Final Reckoning***. It's the eighth film in the franchise, although both Tom Cruise and Christopher McQuarrie claim it won't necessarily end the franchise. Still, Paramount has built a big marketing campaign, selling the film with the \"one last time\" angle. They're not scared of going against ***Lilo &amp; Stitch***, as ***The Final Reckoning*** has an exclusive 3-week IMAX run. It has already premiered in Cannes, where reviews are positive but not as strong as prior installments (81% on RT, 69 on Metacritic). Due to an insane amount of delays (due to the strikes and COVID), the budget has ballooned all the way to $400 million. Paramount may have to accept the film won't recoup all that investment in theaters. Nevertheless, considering they're selling the film as the final one, the very least it should do is be the highest grossing film in the franchise (***Fallout*** is top with $791 million). But will it?\n\n#**ANNOUNCEMENT**\n\nAs Memorial Day delays actuals by a day, the post will go up on Tuesday.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 56,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sbv-8Oyc_WI8OwT0P2iS7TOtXrGl_t42uZlrIdvEGqk.png?auto=webp&amp;s=3260c99cb0e1fe3dade813b8f68087e48a24e5d8"
        },
        "permalink": "/r/movies/comments/1kqoab8/may_1618_box_office_recap_final_destination/"
    },
    {
        "id": "1kqk09d",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'Zootopia 2'",
        "content": "",
        "upvotes": 3994,
        "comments": 514,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qzjyegejds1f1.jpeg?auto=webp&amp;s=867e6a641422e834ae43587eb2362b754fd5881f"
        },
        "permalink": "/r/movies/comments/1kqk09d/official_poster_for_zootopia_2/"
    },
    {
        "id": "1kqr52q",
        "author": "MarvelsGrantMan136",
        "title": "'Toy Story 5' Casts Conan O'Brien",
        "content": "",
        "upvotes": 1159,
        "comments": 134,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6UaA1FqY74xYfuL-gEw8sp_yw6eH0zUxyKso58Jcs8Y.jpg?auto=webp&amp;s=3d33d0af8828787013d9e7e446e275d39bc7030b"
        },
        "permalink": "/r/movies/comments/1kqr52q/toy_story_5_casts_conan_obrien/"
    },
    {
        "id": "1kqf45e",
        "author": "JonasKahnwald11",
        "title": "First image of Dafne Keen from 'Whistle' - A misfit group of unwitting high school students stumble upon a cursed object, an ancient Aztec Death Whistle. They discover that blowing the whistle and the terrifying sound it emits will summon their future deaths to hunt them down.",
        "content": "",
        "upvotes": 4733,
        "comments": 486,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jda1lfyqer1f1.jpeg?auto=webp&amp;s=debd9ab650c327713728082070d01b06e412ac69"
        },
        "permalink": "/r/movies/comments/1kqf45e/first_image_of_dafne_keen_from_whistle_a_misfit/"
    },
    {
        "id": "1kqm1t6",
        "author": "BunyipPouch",
        "title": "Natasha Lyonne Visits the Criterion Closet",
        "content": "",
        "upvotes": 1426,
        "comments": 207,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_7KUjOAjKCLlW44FHlIynxC4TFCUJQ_phDzNcXxN7XY.jpg?auto=webp&amp;s=05f7a1e719f86f39836f1636086f05234f8a1fd7"
        },
        "permalink": "/r/movies/comments/1kqm1t6/natasha_lyonne_visits_the_criterion_closet/"
    },
    {
        "id": "1kqfedb",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for Dan Trachtenberg's 'Predator: Killer of Killers'",
        "content": "",
        "upvotes": 2477,
        "comments": 246,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0p9fdofnhr1f1.jpeg?auto=webp&amp;s=9b5c6e5c565e3ce71b59c7b9fb48f53039b2639a"
        },
        "permalink": "/r/movies/comments/1kqfedb/new_poster_for_dan_trachtenbergs_predator_killer/"
    },
    {
        "id": "1kqb903",
        "author": "BunyipPouch",
        "title": "First Image of Willem Dafoe in Dark-Comedy 'The Souffleur' - A longtime hotel manager (Dafoe) learns that the property has been sold and will be demolished. He slowly spirals into absurd paranoia and wages a personal war against the new owners.",
        "content": "",
        "upvotes": 3264,
        "comments": 125,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4olcnfo3mq1f1.jpeg?auto=webp&amp;s=56ddd5da24f1a69e1bdfdd851497ebbe94fc899b"
        },
        "permalink": "/r/movies/comments/1kqb903/first_image_of_willem_dafoe_in_darkcomedy_the/"
    },
    {
        "id": "1kqinfa",
        "author": "MarvelsGrantMan136",
        "title": "‘The Day The Earth Blew Up: A Looney Tunes Movie’ Sets Max Premiere Date - June 27",
        "content": "",
        "upvotes": 573,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/j7N6bvuTcNPpcFiloGfAN0pdp3ZUPlnZnCoEViOrSRg.jpg?auto=webp&amp;s=e77c1ab840475c8f72390c86a54edc8a8e2f10e8"
        },
        "permalink": "/r/movies/comments/1kqinfa/the_day_the_earth_blew_up_a_looney_tunes_movie/"
    },
    {
        "id": "1kqnxaz",
        "author": "Jakeysuave",
        "title": "Linklater’s NOUVELLE VAGUE receives massive standing ovation at Cannes- Tarantino sees the movie twice in one day",
        "content": "",
        "upvotes": 297,
        "comments": 51,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0dvV3jk5iXWwxYb8vP3WhBp1AOEa8Q_dW8zqPFfxUWw.jpg?auto=webp&amp;s=f8f8e29e57336a5aa412bfb6bc4735e28b563b94"
        },
        "permalink": "/r/movies/comments/1kqnxaz/linklaters_nouvelle_vague_receives_massive/"
    },
    {
        "id": "1kqq1rj",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for the 4K Restoration of 'Hearts of Darkness: A Filmmaker's Apocalypse'",
        "content": "",
        "upvotes": 161,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9fu7jep7lt1f1.jpeg?auto=webp&amp;s=19395555db8e0faa3ef4be7b01ae6319b60139e9"
        },
        "permalink": "/r/movies/comments/1kqq1rj/official_poster_for_the_4k_restoration_of_hearts/"
    },
    {
        "id": "1kqkcd4",
        "author": "ChiefLeef22",
        "title": "Spike Lee's 'Highest 2 Lowest' - Review Thread",
        "content": "*A music mogul faces a life-and-death moral dilemma when he gets caught up in a ransom plot.*\n\nCast: Denzel Washington, A$AP Rocky, Jeffrey Wright\n\n**Rotten Tomatoes:** [90%](https://www.rottentomatoes.com/m/highest_2_lowest)\n\n**Metacritic:** [75/100](https://www.metacritic.com/movie/highest-2-lowest/)\n\nSome Reviews:\n\n[DEADLINE - Pete Hammond](https://deadline.com/2025/05/highest-2-lowest-review-denzel-washington-aap-rocky-spike-lees-music-industry-crime-drama-cannes-film-festival-1236403669/)\n\n&gt;The first film shot in Lee’s native NYC in more than a decade is one of his best. It has been in various forms of development over 30 years for the likes of David Mamet, Chris Rock and others, and now Washington helped get Lee on board with it for a new take from screenwriter Alan Fox, who adapts material from Ed McBain’s book *King’s Ransom* and the original Kurosawa movie. The premise fits like a glove with the music industry, and Washington is smooth as silk, delivering one of his best recent performances as a man caught in an impossible moral quandary. With his fifth collaboration with Lee (*Malcolm X, He Got Game, Inside Man, Mo Better Blues*), he really finds his groove on this one to be sure.\n\n[Variety - Peter Debruge](https://variety.com/2025/film/reviews/highest-2-lowest-review-spike-lee-1236402884/)\n\n&gt;In the end, Lee has taken “High and Low” to new highs, delivering a soul-searching genre movie that entertains while also sounding the alarm about where the culture could be headed.\n\n[The Hollywood Reporter - David Rooney](https://www.hollywoodreporter.com/movies/movie-reviews/highest-2-lowest-review-denzel-washington-spike-lee-1236221654/)\n\n&gt;Lee’s adaptation doesn’t match the complexities of class and hierarchy and even dynamics in a marriage that are such a fascinating part of the Kurosawa. Then again, he’s not trying to, and this is a universe away from the disappointment of *Oldboy*, his 2013 remake of the Park Chan-wook thriller. The director is in the role of the flashy, panache-y showman here, and he plays it to perfection, delivering a big, highly polished chunk of movie that’s pure enjoyment.\n\n[IndieWire - David Ehrlich - 'B'](https://www.indiewire.com/criticism/movies/highest-2-lowest-review-spike-lee-denzel-washington-1235124498/)\n\n&gt;“Highest 2 Lowest” is naturally at its best when it deviates from its source material. The film’s wholehearted embrace of Black culture is baked into David’s desire to protect Stackin’ Hits from buyers who might dilute the brand of its history, but it’s also suffused into the various changes that Lee’s version makes to the story’s third act, which pivots away from the darkness of Japan’s post-war heroin epidemic and towards the aspirational aspects of hip-hop. The tension between David and Paul keeps “Highest 2 Lowest” upright even when the movie around it threatens to go slack. Lee doesn’t share Kurosawa’s patience for long, talky, single-location sequences, and his attempts at Ice Spicing up this relatively low-event movie can be more trouble than they’re worth, even if Ice Spice herself is acquitted on all charges for her two seconds of screen time. \n\n[The Playlist - Gregory Ellwood](https://theplaylist.net/highest-2-lowest-review-spike-lee-once-again-brings-out-the-best-in-denzel-washington-cannes-20250519/) \\- B+\n\n&gt;Now, not to backtrack from what might seem like a rave review, we’ll remind you that “Highest 2 Lowest” has quite a rough start, and Lee’s excesses are not for everyone. It’s no shame that this thriller isn’t even in the top pantheon of Lee joints, as he refers to them. The man has some masterpieces on his resume. It might be in Washington’s, however. He’s so viscerally engaging that you want to see the movie again just to enjoy his performance. Is that a result of the collective experience of having the gang back together again? Or is Washington just on a roll? Either way, let’s just hope we don’t have to wait another 20 years to find out.\n\n[The Guardian - Peter Bradshaw](https://www.theguardian.com/film/2025/may/19/highest-2-lowest-review-spike-lee-and-denzel-washington-remake-kurosawa-in-fine-style) \\- 4/5\n\n&gt;This is a big, muscular picture which aspires to the crowd-pleasing athleticism of Spike Lee’s sports icons; it’s very enjoyable and there’s a great turn from Washington.\n\n[The Wrap - Steve Pond](https://www.thewrap.com/highest-2-lowest-review-spike-lee-denzel-washington-asap-rocky/)\n\n&gt;“Highest 2 Lowest” is a mixture of gleaming, professional filmmaking and curious choices. It’s a showcase for a classic powerhouse, Washington, and an upstart one, ASAP Rocky. Overhauling and updating Kurosawa’s film by turning the lead character from a shoe executive to a music mogul, it simultaneously drags the story into the social-media age and uses it to pay tribute to older urban dramas.\n\n[The Independent - Geofrrey Macnab](https://www.independent.co.uk/arts-entertainment/films/reviews/highest-2-lowest-cannes-review-denzel-washington-b2753613.html) \\- 3/5\n\n&gt;Lee is working with a top cast, but actors such as Wright and Wendell Pierce (playing one of King’s music company managers) have sketchy roles. This is ultimately Washington’s show. He remains as magnetic as ever, switching in a second from affability to menace, demanding respect from his sons and colleagues alike, and trying to keep multiple plates spinning at once as both his business and private lives go off the rails. It’s another of his virtuoso star turns, but it’s ultimately weakened by his refusal to show any emotional vulnerability whatsoever.\n\n[Screen Daily - Tim Grierson](https://www.screendaily.com/reviews/highest-2-lowest-review-spike-lee-reteams-with-denzel-washington-for-ambitious-crime-thriller/5205115.article)\n\n&gt;Beyond the shaky character dynamics, the plotting often feels disjointed, despite a terrific action sequence that pays homage to a similarly riveting set piece in Kurosawa’s film. But such moments are squandered in an overstuffed story that unconvincingly also wants to tackle the materialism in the hip-hop world and the scourge of social media. Ultimately, the picture’s energetic swirl comes across as slightly hollow, its barrage of themes and impulses never finding harmony.",
        "upvotes": 272,
        "comments": 59,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dIaUwdgpLLI4AGc93pNgUzU921DlaTrYFG_7jzTK8nk.jpg?auto=webp&amp;s=daf8bb9ccc6815affe7e1efbd4223dbd36300f5b"
        },
        "permalink": "/r/movies/comments/1kqkcd4/spike_lees_highest_2_lowest_review_thread/"
    },
    {
        "id": "1kqfehw",
        "author": "MarvelsGrantMan136",
        "title": "Predator: Killer of Killers | Official Trailer | Hulu",
        "content": "",
        "upvotes": 446,
        "comments": 82,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KQCEAvr953BhfF-tHBUEbrhNJMiYX3GBKDqbFVeqaJM.jpg?auto=webp&amp;s=b37155af489cce9abfd6d0a8bdc7781f2a2d76e4"
        },
        "permalink": "/r/movies/comments/1kqfehw/predator_killer_of_killers_official_trailer_hulu/"
    },
    {
        "id": "1kqcax6",
        "author": "FilmWaffle-FilmForum",
        "title": "What movie made you think “what on earth did I just watch?”",
        "content": "I don’t necessarily mean in a good or bad way either. Just something that left you so gobsmacked you weren’t sure whether you loved it or hated it. \n\nSorry to Bother You is a good example. I watched it recently after seeing a lot of people saying how crazy it was. It’s safe to say, I was not disappointed. Over the past week or two I’ve grown to appreciate it but after my first watch, I wasn’t entirely sure what to think. ",
        "upvotes": 570,
        "comments": 1447,
        "media": null,
        "permalink": "/r/movies/comments/1kqcax6/what_movie_made_you_think_what_on_earth_did_i/"
    },
    {
        "id": "1kqsu6k",
        "author": "BDWG4EVA",
        "title": "Gary Sinise Speaks Out About His Son's Death &amp; Why He Left Hollywood",
        "content": "",
        "upvotes": 64,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JZQLr1ZW9GA1tYABaX3_AV4tnN4yHl1ciQ1dtSfAZS8.jpg?auto=webp&amp;s=9f6e772d4308c6ff327a3040c972078ef19d1ef3"
        },
        "permalink": "/r/movies/comments/1kqsu6k/gary_sinise_speaks_out_about_his_sons_death_why/"
    },
    {
        "id": "1kqe3n3",
        "author": "banginbowties",
        "title": "What are some movies that are a love letter to a city that is not NYC?",
        "content": "There are so many movies that are considered a love letter to New York City (Big, Manhattan, Enchanted, etc). But I'm looking for your recommendations for movies that are love letters to uncommon or overlooked cities. \n\nBig cities like Paris, London, or Los Angeles I think fall under the same \"often spotlighted\" cities in movies. But if you know any for cities that are rarely brought up in the film industry. \n\nEdit: I think I should maybe add a bit of context to my question, could the movie be set anywhere else and still work? Or is the city integral to the story/characters? ",
        "upvotes": 394,
        "comments": 612,
        "media": null,
        "permalink": "/r/movies/comments/1kqe3n3/what_are_some_movies_that_are_a_love_letter_to_a/"
    },
    {
        "id": "1kqp5dh",
        "author": "Loud_Share_260",
        "title": "What's the biggest flaw of your favorite movie?",
        "content": "No movie's perfect, so what's the biggest flaw of your favorite movie? \n\nFor me, it's in Eternal Sunshine of the Spotless Mind, when Kirsten Dunst is on the phone and says something along the lines of \"you can't get the procedure three times in a month.\" This is played off as a joke, however a significant part of the film is that people that get the procedure aren't allowed to be told they ever received it, creating a plot inconsistency. ",
        "upvotes": 79,
        "comments": 210,
        "media": null,
        "permalink": "/r/movies/comments/1kqp5dh/whats_the_biggest_flaw_of_your_favorite_movie/"
    },
    {
        "id": "1kq979r",
        "author": "JonasKahnwald11",
        "title": "First images of Stellan Skarsgård, Elle Fanning and Renate Reinsve from Joachim Trier's 'Sentimental Value' - Follows a family in Oslo, the house they’ve lived in for generations, and of how the past has a way of resurfacing in unexpected ways.",
        "content": "",
        "upvotes": 553,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vwt705hp3q1f1.jpeg?auto=webp&amp;s=b88a9a32e852bc690668a15717fd3e1c75a4460d"
        },
        "permalink": "/r/movies/comments/1kq979r/first_images_of_stellan_skarsgård_elle_fanning/"
    },
    {
        "id": "1kqncu5",
        "author": "BunyipPouch",
        "title": "New Poster for Horror-Thriller 'Dangerous Animals' - A surfer is abducted by a shark-obsessed serial killer and held captive on his boat, she must figure out how to escape before he carries out a ritualistic feeding to the sharks below.",
        "content": "",
        "upvotes": 87,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/896lfqky0t1f1.jpeg?auto=webp&amp;s=f9922ff9ef6763ef4528c2646ae520e044525757"
        },
        "permalink": "/r/movies/comments/1kqncu5/new_poster_for_horrorthriller_dangerous_animals_a/"
    },
    {
        "id": "1kqc5fj",
        "author": "KillerCroc1234567",
        "title": "Regal Adds Four Imax Theaters in U.S.",
        "content": "",
        "upvotes": 275,
        "comments": 55,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_IiPjUzFeoH8cbB8JTnZXwpZRUGV2P4a8uXaYBLs3a8.jpg?auto=webp&amp;s=2c7a3015f79846136ae5139604d9252312f11a7b"
        },
        "permalink": "/r/movies/comments/1kqc5fj/regal_adds_four_imax_theaters_in_us/"
    },
    {
        "id": "1kqb297",
        "author": "NoCulture3505",
        "title": "ALPHA - Official Teaser Trailer - In Theaters October",
        "content": "",
        "upvotes": 290,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/84VOFFjq6hVC9_iPk7NJib4Xb79AT3NjUD7VhRcBNdo.jpg?auto=webp&amp;s=6b928add6e58021fd6da930e418fdcbbfe1ef0cf"
        },
        "permalink": "/r/movies/comments/1kqb297/alpha_official_teaser_trailer_in_theaters_october/"
    },
    {
        "id": "1kplder",
        "author": "MarvelsGrantMan136",
        "title": "Nicole Kidman Has Now Worked With 27 Women Directors in 8 Years; She Urges Financial Mentors to Invest in Unknown Female Filmmakers and Take a Risk",
        "content": "",
        "upvotes": 31317,
        "comments": 992,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IDb5HbKGV10sNrB0_Am5cwjqsV9opYZtYjxSgv0UVDg.jpg?auto=webp&amp;s=1a71f8190a19cb3db3b177346d16c80252604f65"
        },
        "permalink": "/r/movies/comments/1kplder/nicole_kidman_has_now_worked_with_27_women/"
    },
    {
        "id": "1kqcm5z",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Simon Pegg - Wednesday 5/21 at 10:45 AM ET - Actor in 'Shaun of the Dead', 'Mission Impossible', 'Hot Fuzz', 'Star Trek, 'The World's End', 'Ice Age', 'Star Wars', and lots more.",
        "content": "",
        "upvotes": 147,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1ptttgvgxq1f1.png?auto=webp&amp;s=148998619cc225c536bcdaef8273d25fe25070e8"
        },
        "permalink": "/r/movies/comments/1kqcm5z/amaqa_announcement_simon_pegg_wednesday_521_at/"
    },
    {
        "id": "1kpu6ze",
        "author": "MarvelsGrantMan136",
        "title": "Guillermo del Toro Teases Incredibly Emotional ‘Frankenstein’ at Cannes, Says It’s Not a Horror Movie",
        "content": "",
        "upvotes": 3610,
        "comments": 210,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6rrc6GP4ao7rYsX9NTqxLErYMTdrDH4oHHe-I_CFP_I.jpg?auto=webp&amp;s=0301f7603d8898a2d209bf5b61943e5b993eba87"
        },
        "permalink": "/r/movies/comments/1kpu6ze/guillermo_del_toro_teases_incredibly_emotional/"
    },
    {
        "id": "1kqo6p4",
        "author": "bowieapple",
        "title": "question about \"poor things\" (2023)",
        "content": "so after bella leaves and godwin begins to miss her, &gt;!he creates a new girl felicity (margaret qualley), i'm wondering how exactly she was made? of course bella was created from the corpse of a pregnant woman and the brain of her baby, so was felicity made the same way? did he happen to get lucky and stumble across another recently dead pregnant woman?!&lt;\n\nthey don't explain it in the film and afaik felicity isn't in the original book so i don't expect anyone to know the exact answer but i'm curious as to what you think",
        "upvotes": 24,
        "comments": 12,
        "media": null,
        "permalink": "/r/movies/comments/1kqo6p4/question_about_poor_things_2023/"
    },
    {
        "id": "1kq9ne6",
        "author": "NoCulture3505",
        "title": "Wes Anderson Teases Next Project With Richard Ayoade &amp; Roman Coppola – Cannes",
        "content": "",
        "upvotes": 120,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bvnMwLCTugZeE-ZqmwKQMMGjIkpGihIoszjxi_WtEhA.jpg?auto=webp&amp;s=79b4ab9f2dc9b3870a0080fcc6e8ef3e033e6451"
        },
        "permalink": "/r/movies/comments/1kq9ne6/wes_anderson_teases_next_project_with_richard/"
    },
    {
        "id": "1kpy0lc",
        "author": "M_the_Phoenix",
        "title": "Which movie pissed off a preexisting fan base the most?",
        "content": "In your opinion which movie comitted the worst offense of insulting a preexisting fan base?\n\nYou know, by completely disrespecting the source material or trashing major character arca from previous installments?\n\nin my mind, there is no worse offense than the dumpster fire of an Artemis Fowl adaptation.\n\nI was so excited when I heard that movie planned.\n\nBut I was horrified by what they put out there. Completely erasing Artemis's entire character, and replacing him with an empty, shallow, wannabe kid hero.\n\nWhat a wasted opportunity that we'll probably never get back.",
        "upvotes": 1081,
        "comments": 1642,
        "media": null,
        "permalink": "/r/movies/comments/1kpy0lc/which_movie_pissed_off_a_preexisting_fan_base_the/"
    },
    {
        "id": "1kqi6l9",
        "author": "vilbo",
        "title": "Vulture ranked every time Joey Pants has died onscreen",
        "content": "this writer crunched the numbers, and listed all his deaths:\n\n&gt;**How often does Joe Pantoliano die?** There are 160 credits in Pantoliano’s filmography, and 25 on this list, which excludes animation and video-game roles (+4 *Galex, Godzilla: The Series, The Simpsons*, and *Mob of the Dead*, which makes the total 28), meaning Pantoliano dies in 17.5 percent of his roles, which sounds low, but he works a lot.\n\nSpoilers for everything in there of course, be warned. TV roles included too (including one that *just* aired, so be extra careful)",
        "upvotes": 39,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/tI_X-TpX-V9Tr1f2Ek82LGajKigoalaiS4_kDxofP1g.jpg?auto=webp&amp;s=01796749f28b9550ab3257f5273528e4e60267e0"
        },
        "permalink": "/r/movies/comments/1kqi6l9/vulture_ranked_every_time_joey_pants_has_died/"
    },
    {
        "id": "1kq7ajk",
        "author": "Randomaf899",
        "title": "What is one of the most boring movies you've stuck out &amp; regretted it?",
        "content": "I've done it with so many but the one that took the biscuit for me was 'Survival Box' - there was so many ways they could have made that at least minimally interesting. I will admit I hit the +10 seconds button on various parts throughout the movie because I was THAT bored, just hoping something would happen. It was like The Walking Dead with no Zombies, no back stories &amp; no personalities 🙈 ",
        "upvotes": 179,
        "comments": 806,
        "media": null,
        "permalink": "/r/movies/comments/1kq7ajk/what_is_one_of_the_most_boring_movies_youve_stuck/"
    },
    {
        "id": "1kqgyh8",
        "author": "Wonder-Lad-2Mad",
        "title": "Just finished Six String Samurai (1998). Wow. What a fun movie. Incredible amounts of style and attitude. Western, samurai and Rockabilly is a genius combination.",
        "content": "I would definitely call this movie a hidden gem. I was expecting something a bit more campy considering the premise of this movie, but I was pleasantly surprised. It's more experimental and expressionistic. Definitely more reliant on vibes and style over substance, cause the story is more of a framing device to show you some dope shit.\n\n\nThis felt like a Tarantino movie, maybe that's just me who assosciates rock and roll and samurai shit with him.\n\n\nI also felt some El Topo influence in some places.\n\n\n\nThat's a big running theme of watching this, I felt a lot of homages to different media throughout the whole things.\n\n\nDefinitely some Lone Wolf &amp; Cub in there too. A whole lotta nudges to asian cinema and martial art movies and Buddy's doing his best Clint Eastwood impression.",
        "upvotes": 40,
        "comments": 15,
        "media": null,
        "permalink": "/r/movies/comments/1kqgyh8/just_finished_six_string_samurai_1998_wow_what_a/"
    },
    {
        "id": "1kqo7tq",
        "author": "mrinternetman24",
        "title": "Georgia Maintains Status as Top Production Hub in the Face of Industry Slowdowns",
        "content": "",
        "upvotes": 18,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3fjhwK1FkUMig_rv6KfYyLMrkZNxhqRoStKsUm3KSY8.jpg?auto=webp&amp;s=e4dff02f7825922494de390ecfc9fca442a51ad2"
        },
        "permalink": "/r/movies/comments/1kqo7tq/georgia_maintains_status_as_top_production_hub_in/"
    },
    {
        "id": "1kql7wn",
        "author": "Redruby88",
        "title": "What Film Has a Director's Cut Not Many People Know About?",
        "content": "I remember when I found out there was a Watchmen Director's Cut I was very surprised I'd never heard about it when I'd seen the film so many times. It added some fun bits as well and some animated segments for the Black Freighter comic too!\n\nWhat other films have a little-known Director's Cut that you would recommend (or maybe not recommend!)",
        "upvotes": 21,
        "comments": 94,
        "media": null,
        "permalink": "/r/movies/comments/1kql7wn/what_film_has_a_directors_cut_not_many_people/"
    }
]