[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 12,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 196,
        "comments": 717,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1o3hmv9",
        "author": "camwtss",
        "title": "im only half-way through Ed Gein, and although im enjoying it, i struggle to understand how some people are empathizing with him?",
        "content": "like hello? he murdered the babysitter for \"taking his job\", a job that he utterly failed at. how's it in any way her fault? \n\nhe murdered the bartender for no reason at all\n\nhe murdered that poor blonde woman. so what if she was the \"town pump\"? he could've rejected her advances. idk if she had an STD or not, but i'd much rather take her word for it versus the dead mothers. or better yet, just get tested before resorting to homicide?? she was open-minded with him cross dressing, gifted him lingerie, even invited him to move in, and thats how he repays her?\n\noh, and the chainsaw scene. cringe. like seriously how are people feeling bad for him? he found great pleasure in inflicting harm/discomfort onto others. mental illness or not, he still knew right from wrong. there wasn't a single instance where he was even remotely justified in his actions.\n\n(and yes, im aware that much of the show is fictitious. im mainly referring to the character, not the real-life Ed Gein)",
        "upvotes": 8,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1o3hmv9/im_only_halfway_through_ed_gein_and_although_im/"
    },
    {
        "id": "1o3iw2x",
        "author": "i_am_weesel",
        "title": "Disappointed in Netflix",
        "content": "Firstly, I’ve been a customer since the beginning and I have tremendous brand loyalty to Netflix, which will be a topic here.\n\nFor the last two-three years everyone I open the Netflix app on my TV all i feel is disappointment. I can never seem to find anything I want to watch or am interested in. Idk when it started but there was a time when basically every Netflix original I don’t dare to watch because I already know it’s going to let me down (except the Monster series like it ok.)\n\nI got a pretzel in my head due to simultaneously knowing that i should cancel and that i do have an attachment to the brand. Getting all the newest movies in the mail for me and the gang to watch was epic and being able to stream on my Xbox was epic in its own right. Does anybody feel similar?",
        "upvotes": 6,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1o3iw2x/disappointed_in_netflix/"
    },
    {
        "id": "1o3bum8",
        "author": "GoldDerby",
        "title": "‘Thank god she gets those routine checkups’: How ‘KPop Demon Hunters’ and Huntr/x owe everything to dental hygiene, plus talk the Oscars",
        "content": "",
        "upvotes": 15,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o3bum8/thank_god_she_gets_those_routine_checkups_how/"
    },
    {
        "id": "1o3heyb",
        "author": "FG_Hydro",
        "title": "My Father the BTK Killer",
        "content": "Does anyone else strongly dislike Kerri Rawson? People are saying about how brave she is, the trauma, and the PTSD. The whole show just showed me how self centered and how everything is about her. She’s capitalizing off her dad. She brags about writing a bestseller, then posts a gofundme for herself, then does a Netflix special, also she gets paid for all her interviews. If she cared for anyone else portions would’ve gone to the actual victims of her father. The truth of the matter is her dad was actually a pretty good dad to her to the point nobody believed he was a killer.  He was a horrible person, I’m not downplaying that it had to be traumatic in some way. But the entitlement and woe is me is just so irritating every single scene was all herself. The victims barely got any attention. ",
        "upvotes": 3,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1o3heyb/my_father_the_btk_killer/"
    },
    {
        "id": "1o3gun4",
        "author": "RoxieMatthews",
        "title": "Boots - SUCH a good show I want more!!",
        "content": "Okay this was one of the best shows I’ve watched on nextflix recently!! Each and every character just touched my heart. I was not expecting the depth of emotion. \n\nWhat I love most is how it beautifully portrays how masculinity can still have softness. \n\nI love how beneath the tough exteriors and anger, all the characters have a kindness, depth and realness. You see that we’re all human - we feel, grieve, and love in our own ways. Our backstories, traumas, and insecurities may differ, but kindness exists in all of us. \n\nI just loved it so much!! I want more ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o3gun4/boots_such_a_good_show_i_want_more/"
    },
    {
        "id": "1o3fjvl",
        "author": "Ok-Store4021",
        "title": "Monster: The Ed Gein Story",
        "content": "How much of this show was BS? I’ve read online and from what I’ve gathered the vast majority of things in this series were fictional. What were your thoughts on the series. No evidence of him being inspired by the nazi woman.\n",
        "upvotes": 4,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1o3fjvl/monster_the_ed_gein_story/"
    },
    {
        "id": "1o2zhgo",
        "author": "Round-Refrigerator99",
        "title": "Is \"Nailed It!\" canceled?",
        "content": "I really loved watching Nailed it when I was younger but it's been so long since a new season came out. I don't keep up with any of the host's social media so I don't know if they announced it being canceled or not",
        "upvotes": 15,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1o2zhgo/is_nailed_it_canceled/"
    },
    {
        "id": "1o3ewtp",
        "author": "GooeyBones",
        "title": "Movies being edited/censored?",
        "content": "Watched an old favorite last night, Dodgeball, and found that a line was cut out about 35 minutes in, when a character says “I love the smell of queef in the morning”. Sure enough I looked it up and that whole bit was just cut from the Netflix version. It’s weird considering the vulgarity of the whole movie, which also has a line that includes the R slur, that they cut the line about queefs?  It’s weird and a little alarming that they’re just cutting movies up. What else are they removing? ",
        "upvotes": 3,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1o3ewtp/movies_being_editedcensored/"
    },
    {
        "id": "1o3au5h",
        "author": "AssumptionFull531",
        "title": "Criminal UK: Similar show recommendations",
        "content": "Came across this underrated gem on Netflix. I loved the format, the twists and acting in these episodes gave me chills. Please recommend shows that are similar to this.\n\nAlso, should i watch the other country versions? I've heard they aren't as good. ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o3au5h/criminal_uk_similar_show_recommendations/"
    },
    {
        "id": "1o3ig7k",
        "author": "JBFRESHSKILLS",
        "title": "Ed Gein episode 8…",
        "content": "Anyone else find it odd that he’s basically recreating Mindhunter in the first part of the show, going so far as to have the same actor that played Jerry Brudos in Mindhunter play him here? \n\nI know that John Douglas was a real detective (I’ve read many of his books,) but that was a straight up rip off of Mindhunter.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o3ig7k/ed_gein_episode_8/"
    },
    {
        "id": "1o3bexs",
        "author": "JollyToe440",
        "title": "Wayward and static noise",
        "content": "What is this? Wayward is actually a good show, i’m at episode 6 and all i can complain about - and oh my, am I about to complain - is that god forsaken static noise they edit into it sometimes! Like if the person is watching tv in the back, or just on the computer, they put the most ear-piercing static noise on. As if 2003 was seventy thousand years ago. As I write this, the noise still echoes in my ears like I got tinnitus. It’s corny at this point. Just typical netflix corniness. Anyone else hates the overdone static aggression? ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o3bexs/wayward_and_static_noise/"
    },
    {
        "id": "1o3gkal",
        "author": "Snoo_84123",
        "title": "Do monster have real footage ed gein",
        "content": "I started watching the new season of monster as I’m a big fan of Addison but I’m watching and was wondering if the pictures it’s showing of world war 2 etc are real photos or if they are fake footage and pictures of dead bodies fake\nIf someone can confirm weather it’s acting and not real photos much appreciated \nAs I will probably stop watching if it has real photos ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o3gkal/do_monster_have_real_footage_ed_gein/"
    },
    {
        "id": "1o3gdjs",
        "author": "Upper_Image3019",
        "title": "Black Rabbit storyline confusion (spoilers)",
        "content": "Hey everyone. Spoilers ahead. Why did Vince climb on Jake and demand the watch? This action just delayed the robbery, got Wes and Tony and Junior shot and simply made a simple con go wrong. Why was Jake not mad at Vince for doing this and doesnt even bring it up later? When Vince says Why did Wes step in to protect Jake doesnt ask him why he climbed on him and demanded the watch when they had the jewellery.\n\nMy partner said it was to make the robbery look realistic, but I dont think this is what they would have planned. Can someone share insights in to why they think this happened? Also how dysfunctional was their brotherly bond.....like why were they okay with each other despite bringing doom to each other over and over again.\n\nI think Junior and Vince were Mancuso's sons....",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o3gdjs/black_rabbit_storyline_confusion_spoilers/"
    },
    {
        "id": "1o309wz",
        "author": "Icy_Ad8228",
        "title": "There’s a Reason Billionaire Bunker Feels So Familiar, And It’s Not Just the Storyline.",
        "content": "I was watching it on Netflix and something about the vibe felt familiar: same tension, same obsession with power and control.\n\nThen I found out it’s by the Money Heist team. Makes total sense now. The whole “billionaires hiding underground while the system crumbles” angle suddenly feels like a continuation of the same story.\n\nWild connection, anyone else notice?\n",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1o309wz/theres_a_reason_billionaire_bunker_feels_so/"
    },
    {
        "id": "1o3d1qw",
        "author": "Pattyfface",
        "title": "Different wifi-network, same account. Help?",
        "content": "I live with my folks, a recent move-in where I brought my wifi network with me. I pay for it, and it's higher quality then my folks need. They have their own Netflix account, I shut my own down and signed into theirs to safe on funds which are all too short right now.\n\nI got the dreaded thing, demanding I bug them for a code for a 14 day pass. Solutions?\n\nEdit: Forgot to include crucial detail. The device I want to watch on is a PC, without Wifi capabilities. It's **wired** Only. And wiring into the network that my folks use isin't an option.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o3d1qw/different_wifinetwork_same_account_help/"
    },
    {
        "id": "1o36ug6",
        "author": "Cute_Note_3624",
        "title": "The woman in cabin 10 reviews",
        "content": "Is the movie watchable despite the many bad reviews?? I have nothing to watch this weekend and I'm extremely bored. Should I really watch it or no pls be honest ",
        "upvotes": 2,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1o36ug6/the_woman_in_cabin_10_reviews/"
    },
    {
        "id": "1o2sp97",
        "author": "Ok_fineidrcare",
        "title": "Just finished watching Boots!",
        "content": "It’s so refreshing to see a gay show about brotherhood and not much else! Thank god it didn’t turn tyler perry inside that bootcamp, I was afraid it’d be so soap opera-ish full of abuse and shits and was ready to skip the series but yeah💀 the tone and cinematography is so unserious too they made that whole 13 weeks less exhausting even as a viewer, that camp was intense asf. Hope we get another season!",
        "upvotes": 16,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o2sp97/just_finished_watching_boots/"
    },
    {
        "id": "1o3bbhv",
        "author": "Spare_Fill6900",
        "title": "Samsung QLED Q80B TV and Q990F soundbar, Netflix won’t play Dolby Atmos",
        "content": "Guys I have the above setup for a while now, the soundbar is connected to HDMI eARC from Q990F to TV’s eARC original cable is used . The audio mode is “Auto” and not PCM, the pass through is grayed out as I have no external HDMI streamers.  I just usually play TV’s native Netflix app and the problem I see, even movies with Dolby Atmos available on it shows up as 5.1 or sometimes spatial audio ( I don’t have any apple device plugged in), and on the Soundbar’s ! Sign it shows “ Dolby Multichannel PCM” not Dolby Atmos.  What’s causing this?? If I change the audio source on TV to TV speaker instead of Q990F eARC the same movie immediately shows Dolby Atmos on Netflix!! My friends have TCL and LG TVs where they don’t have this issue, Dolby Atmos playing and visible in the ! LED screen Samsung to Samsung, what’s going wrong with my setup?? Is it the Native Netflix app not able to identify Q990F as a an Atmos supported hardware? I tried a 100 tweaks from wild surfing to no avail:(\n\nHope someone sheds a light!",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o3bbhv/samsung_qled_q80b_tv_and_q990f_soundbar_netflix/"
    },
    {
        "id": "1o2itvh",
        "author": "Ksecs83",
        "title": "Ed gein Monster bernice holden",
        "content": "EDIT: Her name was Worden.\n\nIf I were Bernice Wordens family,  I would be pretty upset by the way Ryan Murphy wrote her character in as she had a sexual relationship with Ed. He was a customer of her store. That's it. I get that it's Hollywood. They have to make shit up to make it interesting.  But it just rubbed me the wrong way. Also I think the storyline with adeline was bs too. ",
        "upvotes": 61,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1o2itvh/ed_gein_monster_bernice_holden/"
    },
    {
        "id": "1o39o33",
        "author": "SoberShiv",
        "title": "Get rid of Mbps etc display top LH corner of screen",
        "content": "I’ve pressed something on my remote and ever since there has been a display on the top left (of Netflix only). I have tried pressing every button on the remote. I’ve tried switching it off switching on again &amp; The bloody display is still there. when I hit the button to the right of the 0 (as advised on another thread) I get a new window on screen and I’ve tried everything on there, but nothing gets rid of the display on Netflix. My remote is a virgin TiVo remote. Thanks in advance! ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o39o33/get_rid_of_mbps_etc_display_top_lh_corner_of/"
    },
    {
        "id": "1o3f7zq",
        "author": "MissKLO",
        "title": "Victoria Beckham….",
        "content": "Im not even far into this… but she hasn’t eaten chocolate since the 90’s and she wants wine on an intravenous drip…. Yaaaaaas queen.. She’s patsy from abfab in real life ❤️",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o3f7zq/victoria_beckham/"
    },
    {
        "id": "1o38lie",
        "author": "Atlabatsig",
        "title": "subscribing w/ gift card",
        "content": "I'm totally new to Netflix, but am trying to subscribe using a VISA gift card.  From what I read, this is supposed to be possible.  But after seven attempts in two days (different browsers, cleared cache, etc) I consistently get \"sorry we're unable to complete that transaction now, please try again later.\"   Is there some trick to this, or do they just not accept visa gift cards?   thnx",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o38lie/subscribing_w_gift_card/"
    },
    {
        "id": "1o3efm8",
        "author": "ForFucksSake022",
        "title": "What’s wrong ?!",
        "content": "Today all of my profile pics were different, many shows were kissing from my watch now, and when I searched for them by name, they no longer can be found.  I logged into a desktop and it was fine but no the app on my phone or tv are working right.  What’s going on?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o3efm8/whats_wrong/"
    },
    {
        "id": "1o3750u",
        "author": "HieronymusP",
        "title": "Does netflix not support watching through web browsers any more?",
        "content": "I've been struggling with an error on most (not all) titles on Netflix lately, It's the \"This title is not available to watch instantly\" error, with error code E100.\n\nAfter fruitlessly looking for an answer and trying several suggestions, such as logging off an on again and clearing the browser cache, I decided to hit up customer support and was put in contact with a rep. After describing the issue, he told me I was watching through an unsupported device.\n\nThe problem with that is that I'm watching Netflix through firefox, which I assumed is completely supported, but according to the rep, I need to watch using the app.\n\nThe only issue I can think of is that I'm using Linux Mint as my OS, but I want to believe that the OS shouldn't matter so long as the browser is supported.\n\n\\--EDIT--\n\nSolved it. See reply below.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1o3750u/does_netflix_not_support_watching_through_web/"
    },
    {
        "id": "1o2lu13",
        "author": "gg2351",
        "title": "My cousins dining room was filmed for the Ed Gein monster series",
        "content": "",
        "upvotes": 24,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o2lu13/my_cousins_dining_room_was_filmed_for_the_ed_gein/"
    },
    {
        "id": "1o26p1p",
        "author": "No-Relative4683",
        "title": "Victoria Beckham",
        "content": "Well, this was absolute garbage!\n\nNothing on her music career, no interviews with the Spice Girls, no dirt or backstage gossip - just a vehicle to promote her flailing fashion line. \n\nAnybody else extremely disappointed in this 3 hour advertisement?",
        "upvotes": 89,
        "comments": 132,
        "media": null,
        "permalink": "/r/netflix/comments/1o26p1p/victoria_beckham/"
    },
    {
        "id": "1o3247r",
        "author": "VILTO_13",
        "title": "Trouble with screen mirroring",
        "content": "So I just got Netflix and I want to screen mirror it to my tv but it's not working. It connects but the TV says that I need to sign in, but when my sister tried it, it worked just fine without signing in with the TV. I know that Netflix requires you to sign in with both devices, but I'm mostly confused by why does it work without needing to sign in when my sister does it. With me Netflix doesn't even always show the screen cast icon. If you know why this is please let me know.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o3247r/trouble_with_screen_mirroring/"
    },
    {
        "id": "1o3fifa",
        "author": "nbljdnf4",
        "title": "I have noticed something about the \"monsters\" series",
        "content": "Having seen the 1st 2 series and currently watching the 3rd one, I have noticed that the main characters are gay or have queer coding. Dahmer of course, the Menendez brothers who are very stange towards each other and I seem to remember one of them being gay? And then Ed Gein, who enjoys dressing up in women's underwear to masturbate. \n\nI genuinely think that this is an underlying systematic assumption we have/make about bad people; that they are sexual deviants and queer. There are plenty of stories I'm sure, about a serial killer who was fully straight and straight coded? Right? I feel weird about it and wanted to share. ",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1o3fifa/i_have_noticed_something_about_the_monsters_series/"
    }
]