[
    {
        "id": "1k9rtun",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 22,
        "comments": 6032,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k9rtun/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1kemywn",
        "author": "IcefoxX5",
        "title": "[Match Thread] Real Madrid Castilla - Marbella FC | Primera Federación, Matchday 35",
        "content": "#FT: CASTILLA 3:2 MARBELLA\n\n&amp;#x200B;\n\n#1ª FEDERACIÓN\n\n&amp;#x200B;\n\n**Scorers/replays:** \n\n1:0 David Jiménez 2'\n\n2:0 Gonzalo García 56'\n\n2:1 José Callejón 58'\n\n3:1 Loren Zúñiga 65'\n\n3:2 Alberto Soto 90'+2 \n\n&amp;#x200B;\n\n**match updates:** \n\n1' - kickoff, vamos! \n\n⚽ 2' - GOLLLLLL DEL CASTILLA - first attack of the match, Pol Fortuny attempts a through ball through the middle, but it gets deflected out wide to Yusi - Yusi puts in the cross to Loren, but it gets cleared to the edge of the box - David Jiménez picks the ball up and curls it into the top right corner with his weak foot! \n\n12' - almost the 2-0, amazing through pass on the turn by Pol Fortuny, but the goalkeeper reaches it in the last second before Yusi can finish \n\n27' - misunderstanding by Yusi and Edgar that leaves Marbellas winger open in the box, but Yusi with a great recovery to force the corner \n\n32' - Chema pulls down his opponent with excessive force, then falls on top of his leg on the way down - yellow card for Chema and it looks like a very bad injury for Marbella's Awudu\n\n39' - promising counter attack that kind of fizzles out, until Yusi makes a great cross onto the head of David Jiménez, but his header is right at the keeper \n\nHT - eventful first half in which both teams played high paced football, skipping the midfield mostly - while this style of match suits Castilla, Marbella were also pretty dangerous throughout with some great, quick plays. Overall, the lead is deserved however \n\n46' - 2nd half underway \n\n⚽ 56' - GOLLLL DEL CASTILLA - fast attack with lots of space for Pol Fortuny - Gonzalo makes the run into the box and Pol puts an easy pass into his run, Gonzalo's first touch is perfect, and he finishes softly with the inside of his boot against the far post and into the net! \n\n⚽ 58' - goal for Marbella right after the kick off - and it's our former player José Callejón who scores, just like in the first match. He initiates the attack himself, dribbling past our midfield and playing it out wide - his teammate lays it off to him in the box with the back of his heel, and he comes running at the ball full speed to finish it past Fran \n\n60' - massive chance to immediately restore the 2-goal lead, another top cross from Yusi from the left to the far post, where Pol Fortuny broke free of his marker but sadly has to finish on the volley with this weak foot, and he puts it just wide of the far post \n\n⚽ 65' - GOLLLLLL DEL CASTILLA - Marbella take risks and leave lots of space for us to counter - Ribes recovers the ball at the edge of our box, plays it to Chema, who launches a perfect long ball to Victor Muñoz - who once again escapes his opponents, and squares it perfecrly to Loren Zúñiga, he pokes it past the keeper with the tip of his boot for the 3-1! \n\n70' - Gonzalo hits the post, what a play by him! - he is through on the left side in a 2v3 counter, he takes on the fullback and turns past him with a quick change of direction, then he leaves another opponent behind in the same manner, his finish is almost perfect, but it hits the post, runs across the goal line and goes out for a goal kick on the other side \n\n🔄 74' - triple sub, Yusi, Chema and Zúñiga off for Valde, Antonio David and Campos\n\n80' - big chance for Víctor to seal the match, Pol Fortuny releases a through ball for him to chase, and once again he launches like a rocket and outruns the defender by a bit margin, but he fails to put his finish on target with only the keeper to bear\n\n🔄 81' - César Palacios is back from his ACL tear after 9 months! He comes on for Pol Fortuny. \n\n🔄 90' - last sub, Borja for Víctor \n\n⚽ 90'+2 - goal for Marbella, golazo by Soto - a bit out of nowhere, he cuts inside from the right wing and blasts an absolute missile out with his left foot, it hits the net in the top left corner \n\n90'+4 - good chance for Marbella for the late equaliser, Ribes fails to clear a ball in our box and the Marbella player fires the rebound over the bar \n\nFT - victory that became unnecessarily tight in the end, with Castilla wasting chances on the counter and Marbella getting a lifeline in added time with a great goal. The team keeps the possibilities of reaching the playoffs alive with this win, but it will still be very difficult, 4 points behind the last playoff spots with only 3 matches to go \n\n&amp;#x200B;\n\n**Kickoff:** 18:00 CET\n\n**Venue:** Estadio Alfredo di Stéfano, Madrid\n\n**Referee**: Álvaro Cánovas García-Villarrubia\n\n**Competition:** Primera Federación, Grupo 2, Matchday 35\n\n**Viewing options:** \n[FEF TV](https://feftv.com) (subscription - 12.99€/month)\n\n&amp;#x200B;\n\n**Castilla XI** (5-2-3): Fran González - Youssef Enríquez ‘Yusi’ (74' Víctor Valdepeñas 'Valde'), Edgar Pujol, Mario Rivas, Quique Ribes, David Jiménez - José Maria Andrés ‘Chema’ (74' Antonio David), Pol Fortuny (81' César Palacios) - Gonzalo García, Loren Zúñiga (74' Andrés Campos), Víctor Muñoz (90' Borja Alonso) \n\nBench: Mario de Luis (GK), Diego Piñeiro (GK), Lorenzo Aguado, David Ruiz, Babacar Diocou. \n\nUnavailable: Raúl Asencio (first team call-up), Jacobo Ramón (first team call-up), David Cuenca (pubalgia), Manuel Ángel (?), Jeremy de León (shoulder injury). \n\nCoach: Raúl\n\n&amp;#x200B;\n\n**Castilla last five matches:** DDDWL\n\n**1ª RFEF stats:** 10th | 46pt | 10-16-8 | 51:34\n",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kemywn/match_thread_real_madrid_castilla_marbella_fc/"
    },
    {
        "id": "1kelxr2",
        "author": "Pebbledthoughts",
        "title": "UNBELIEVABLE!!!!!! Speechless Performance",
        "content": "",
        "upvotes": 2466,
        "comments": 121,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2b72398u5sye1.jpeg?auto=webp&amp;s=207495de47de8e28a0dc881b21afb30fbd79938c"
        },
        "permalink": "/r/realmadrid/comments/1kelxr2/unbelievable_speechless_performance/"
    },
    {
        "id": "1kf3cfx",
        "author": "Total_Escape_9778",
        "title": "Kylian Mbappe just needs 9 goals to overtake Rodrygo's Total La Liga Talley",
        "content": "**Rodrygo's La Liga Stats:** 32 Goals in 172 Games\n\n2019-20 =&gt; 2 Goals in 19 Games\n\n2020-21 =&gt; 1 Goal in 22 Games\n\n2021-22 =&gt; 4 Goals in 33 Games\n\n2022-23 =&gt; 9 Goals in 34 Games\n\n2023-24 =&gt; 10 Goals in 34 Games\n\n2024-25 =&gt; 6 Goals in 30 Games\n\n**Mbappe's La Liga Stats:** 24 Goals in 30 Games\n\n2024-25 =&gt; 24 Goals in 30 Games\n\n  \nI want to hear your opinion on this... I know they both play in different positions and mbappe also takes penalties but its still a shocking stats because rodrygo has played 5 more seasons than mbappe.\n\nPlus there are no excuses for the last season because rodrygo was freely allowed to play forward without much defensive duties yet he was not able to cross sergio ramos's highest goal talley in a la liga season of 11 goals. It's just very shocking to me\n\n",
        "upvotes": 174,
        "comments": 27,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kf3cfx/kylian_mbappe_just_needs_9_goals_to_overtake/"
    },
    {
        "id": "1keit1h",
        "author": "Ready_Ad_1353",
        "title": "Arda Guler scores 1-0",
        "content": "",
        "upvotes": 3028,
        "comments": 125,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/csvqdppdfrye1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1keit1h/arda_guler_scores_10/"
    },
    {
        "id": "1kelq0i",
        "author": "TheLastR0N1N",
        "title": "Mbappe and Güler against Celta Vigo",
        "content": "",
        "upvotes": 1531,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ttbg94x64sye1.jpeg?auto=webp&amp;s=520265e842a78193df12a406c5e8e3abe389647b"
        },
        "permalink": "/r/realmadrid/comments/1kelq0i/mbappe_and_güler_against_celta_vigo/"
    },
    {
        "id": "1keouo0",
        "author": "Ready_Ad_1353",
        "title": "Alternate angle of Arda Guler's banger",
        "content": "",
        "upvotes": 867,
        "comments": 21,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/wt3opgn1ssye1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1keouo0/alternate_angle_of_arda_gulers_banger/"
    },
    {
        "id": "1kejf1o",
        "author": "TheGhost5322",
        "title": "Mbappe makes it 3-0!",
        "content": "",
        "upvotes": 1569,
        "comments": 73,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/8pwv6t17lrye1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kejf1o/mbappe_makes_it_30/"
    },
    {
        "id": "1kequ2q",
        "author": "Pebbledthoughts",
        "title": "Arda Guler vs Celta De Vigo",
        "content": "",
        "upvotes": 505,
        "comments": 32,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/oufa3bws6tye1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kequ2q/arda_guler_vs_celta_de_vigo/"
    },
    {
        "id": "1keixgz",
        "author": "Ready_Ad_1353",
        "title": "Julian Mbappe makes it 2-0",
        "content": "",
        "upvotes": 1256,
        "comments": 83,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/m5fvktpkgrye1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1keixgz/julian_mbappe_makes_it_20/"
    },
    {
        "id": "1kekqkm",
        "author": "Ready_Ad_1353",
        "title": "[FootballonTNT] This is the fifth season in a row for Kylian Mbappe who managed 35+ goals in a campaign. He is now on 40 G/A in his debut campaign for Real Madrid.",
        "content": "",
        "upvotes": 705,
        "comments": 76,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/j5ukqgUnRk7_UcUa1kgsT9oRApasQ7q345ZJUyeyX44.jpg?auto=webp&amp;s=9e1811579167c0efc71030c4714e58ba8b9e65ca"
        },
        "permalink": "/r/realmadrid/comments/1kekqkm/footballontnt_this_is_the_fifth_season_in_a_row/"
    },
    {
        "id": "1kev39d",
        "author": "Emintro7",
        "title": "Arda Güler all touches vs Celta Vigo",
        "content": "",
        "upvotes": 165,
        "comments": 18,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/3jv2e2o72uye1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kev39d/arda_güler_all_touches_vs_celta_vigo/"
    },
    {
        "id": "1keixpr",
        "author": "Damned_chicken",
        "title": "they said he was the worst signing in 2012",
        "content": "",
        "upvotes": 733,
        "comments": 33,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/llj2alefgrye1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1keixpr/they_said_he_was_the_worst_signing_in_2012/"
    },
    {
        "id": "1keugtp",
        "author": "Emergency-Hornet-594",
        "title": "Defence is great but forwards play contribution is not that good.",
        "content": "Sell him or let him have 1 more season? ",
        "upvotes": 155,
        "comments": 21,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/bc95jaikytye1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1keugtp/defence_is_great_but_forwards_play_contribution/"
    },
    {
        "id": "1kewl0n",
        "author": "dakaiiser11",
        "title": "It’s been over 2 months since Madrid have been able to win a game by more than 1 goal.",
        "content": "Madrid’s having a very hard time creating/converting chances and relying on moments of brilliance from players.",
        "upvotes": 112,
        "comments": 18,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kewl0n/its_been_over_2_months_since_madrid_have_been/"
    },
    {
        "id": "1keoqns",
        "author": "Mackie26",
        "title": "Matches like today's just show that it's a good idea for Carlo to leave at the end of the season",
        "content": "I love Carlo. he's 100% the best manager we've ever had and he's at worst top 3 best managers ever, for me he is, but I could see the argument for Ferguson or Guardiola being top 1-3 as well.\n\nHaving said that, he's just too stubborn when things clearly are not going well. My man played Arda like 1 La liga match, then threw him to the sharks against Liverpool, one of the thoughest matches on the season and then vanished him to the shadow realm. \n\nThen today, he takes him out when Vini was having a horrible match, yet Arda was subbed...ok. He also subbed Raúl when Tchouameni is one yellow card away from not being able to play the next match... ok. \n\nI've seen so much hate towards Tcho and Lucas, but how can a player perform when they are played out of their position so much? Tchou shows his worth when he's played at the midfield and to me, not renewing Lucas is a mistake. He's huge on the locker room, he's cold af on penalties, which is very relevant. But sure, we'll crucify him cause he's a right winger being played as an RB pretty much the whole season.\n\nSure Florentino is at fault the most here, the team has been poorly planned and we're lucky that Carvajal didn't get another serious injury in the last 3-4 years, that we had Nacho, who could have been a starter for 99% of teams in Europe.\n\nYet, with all this, Carlo is definitely not making the best choices with the players he had. Why play Tchou as a CB for like half of the season when Raúl was there? Why insist on Lucas at RB, when Fede is clearly better and he had some kids he could have at least tried? It sucks to lose Fede at the midfield, but I'm sure it sucks more to keep getting scorched on Lucas' side every match.\n\nWhy banish Arda to the shadow realm after the Euros he had, just cause of 2 bad matches? Why is Endrick still playing basically no minutes? If you don't plan to really use them anyways, why not loan them so they can get minutes develop and come back next season as better players? I love Carlo, but he's too set on his old ways and yes, that has worked for us before, but it clearly doesn't anymore.",
        "upvotes": 246,
        "comments": 46,
        "media": null,
        "permalink": "/r/realmadrid/comments/1keoqns/matches_like_todays_just_show_that_its_a_good/"
    },
    {
        "id": "1keiyg8",
        "author": "Brave-Ear-7559",
        "title": "The complete counter and MBappe scores 2nd of the game",
        "content": "",
        "upvotes": 482,
        "comments": 15,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2hmam9mrgrye1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1keiyg8/the_complete_counter_and_mbappe_scores_2nd_of_the/"
    },
    {
        "id": "1kenf5f",
        "author": "Emintro7",
        "title": "Vinicius Junior nutmeg vs Celta Vigo",
        "content": "",
        "upvotes": 235,
        "comments": 23,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/otf0yok0hsye1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kenf5f/vinicius_junior_nutmeg_vs_celta_vigo/"
    },
    {
        "id": "1kejk1z",
        "author": "Most-Attitude2430",
        "title": "Is Arda pushing Rodrygo out of Madrid right now???",
        "content": "This is definitely a knee jerk reaction to the past few games of Arda, but with him being more of a creative midfield type of RW, is he a better fit with Mbappe and Vini? And naturally, with all the frustration around us having too many similar profile forwards on at the same time in Vini, Mbappe, Rodrygo, does this spell the end for Rodrygo?? I love Rodrygo to bits. This season from him makes me sad and I want see him thrive at Madrid but...can a more tactical coach figure this out??",
        "upvotes": 353,
        "comments": 97,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kejk1z/is_arda_pushing_rodrygo_out_of_madrid_right_now/"
    },
    {
        "id": "1keoetb",
        "author": "muaazmuaaz123",
        "title": "The final real Madrid xi, voted by u guys, thanks for joining in",
        "content": "",
        "upvotes": 178,
        "comments": 59,
        "media": null,
        "permalink": "/r/realmadrid/comments/1keoetb/the_final_real_madrid_xi_voted_by_u_guys_thanks/"
    },
    {
        "id": "1kepnhw",
        "author": "IcefoxX5",
        "title": "César Palacios steps on the pitch for the first time since his ACL tear against Milan in pre-season",
        "content": "",
        "upvotes": 114,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/et2wfj9nxsye1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kepnhw/césar_palacios_steps_on_the_pitch_for_the_first/"
    },
    {
        "id": "1kelkne",
        "author": "ItsKBS",
        "title": "Arda should not be compared to Kroos, his qualities in the final third are too good to play as a deep playmaker. His ideal position is a KDB type of role in which he gets the freedom to help the build-up but also join the final third.",
        "content": "I am seeing a lot of people that compare Arda to Kroos here due to his playmaking abilities, and even though I think that Arda could do well in that role, I think that it'd would be a waste of his abilities in the final third. \n\nHe has crazy good shooting and crossing, and has the potential to hit crazy amounts of G/A when he develops into a starter(which could be sooner than expected). His ideal role is probably the play as a #8 and #10 hybrid like KDB, he can still help the build-up with his playmaking but his best quality is his goalscoring and chance creation ability as shown today. Also have to mention that Arda is #4 among most big chances created in LaLiga this season in this team with 9 big chances created, while Vini has 10 and Bellingham has only 4 despite playing a lot more.\n\nThe only problem is that Bellingham has been playing this role already, I wonder how a midfield would work if Bellingham played as a box-to-box with Arda getting more freedom in offense as a midfielder. Curious to see what Xabi is gonna do next season.",
        "upvotes": 189,
        "comments": 44,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kelkne/arda_should_not_be_compared_to_kroos_his/"
    },
    {
        "id": "1kee19i",
        "author": "WhySoWeirdUsername",
        "title": "OTD 3 years ago : The night of Real Resurrection",
        "content": "",
        "upvotes": 676,
        "comments": 13,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kee19i/otd_3_years_ago_the_night_of_real_resurrection/"
    },
    {
        "id": "1kedw0b",
        "author": "amungus45",
        "title": "Toni Kroos: “What separates Arda Güler from other young players is that he always wants to learn. He looks what we do, also before and after training. You don’t see this often in todays football. I noticed that he wants to improve and of course he has an INSANE left foot.(Continuation in comment)",
        "content": "",
        "upvotes": 673,
        "comments": 48,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ft5q236zspye1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kedw0b/toni_kroos_what_separates_arda_güler_from_other/"
    },
    {
        "id": "1kebhan",
        "author": "Modo97",
        "title": "I will leave this one here.",
        "content": "Real Madrid this season in one picture.",
        "upvotes": 933,
        "comments": 179,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ofizhyr70pye1.jpeg?auto=webp&amp;s=4dbcaad083bee0f2c9f224fd2f580eb2eb81b5fe"
        },
        "permalink": "/r/realmadrid/comments/1kebhan/i_will_leave_this_one_here/"
    },
    {
        "id": "1kej326",
        "author": "Indominuss__",
        "title": "Don't understand the Fran Garcia hate.",
        "content": "I've supported him since he rejoined and honestly he mightve been shakey in the beginning, since then I've only since him getting better and better, whether it's attacking or defensively, can't blame him for attack because for some reason vini doesn't play with him much as much as you're supposed to with your LB. \nRead somewhere madrid is considering letting him go, just don't understand it when you can literally compare him with mendy who's basically been stagnant with his skills since he joined. \n\nopinions? ",
        "upvotes": 146,
        "comments": 53,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kej326/dont_understand_the_fran_garcia_hate/"
    },
    {
        "id": "1keqfz6",
        "author": "ManuMora98",
        "title": "[Basket] We get our 18th consecutive (!!) win on league after beating 3rd qualified Valencia Basket 96-89, with 20 points from Andrés Feliz",
        "content": "",
        "upvotes": 48,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8hdgd9ww3tye1.jpeg?auto=webp&amp;s=e6314a6237e5ea57c4378a8785b7e939cfa06e31"
        },
        "permalink": "/r/realmadrid/comments/1keqfz6/basket_we_get_our_18th_consecutive_win_on_league/"
    },
    {
        "id": "1kep1kq",
        "author": "IcefoxX5",
        "title": "Real Madrid Castilla [2]-0 Marbella FC - Gonzalo García 56'",
        "content": "",
        "upvotes": 47,
        "comments": 4,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/w7g83b4dtsye1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kep1kq/real_madrid_castilla_20_marbella_fc_gonzalo/"
    },
    {
        "id": "1kekisa",
        "author": "soccer-stats",
        "title": "Post Match Stats: Real Madrid vs Celta de Vigo",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1kekisa)",
        "upvotes": 66,
        "comments": 203,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kekisa/post_match_stats_real_madrid_vs_celta_de_vigo/"
    },
    {
        "id": "1kf4h5q",
        "author": "SupermarketAntique32",
        "title": "Will this formation work?",
        "content": "https://preview.redd.it/5bzhj5kykwye1.png?width=997&amp;format=png&amp;auto=webp&amp;s=e8bb2b29e95672cde71441b12cabee751fac89aa\n\nI think this formation could really work. Arda’s is in very good form, as seen in yesterday Celta Vigo match. Bellingham is extremely versatile and should adapt well in midfield. Rodrygo’s dribbling and agility make him a deadly threat in the attacking midfield (AMF) position. \n\nBellingham and Valverde will provide strong coverage in midfield, while the front four (Arda, Rodrygo, Vini, and Mbappé) will have plenty of options.",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kf4h5q/will_this_formation_work/"
    },
    {
        "id": "1kepb5y",
        "author": "IcefoxX5",
        "title": "Real Madrid Castilla [3]-1 Marbella FC - Loren Zúñiga 65'",
        "content": "",
        "upvotes": 26,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/qak6k3hdvsye1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kepb5y/real_madrid_castilla_31_marbella_fc_loren_zúñiga/"
    },
    {
        "id": "1keh71y",
        "author": "scoreboard-app",
        "title": "Match Thread: Real Madrid vs RC Celta de Vigo Live Score | La Liga (Spain) | May 4, 2025",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1keh71y)",
        "upvotes": 78,
        "comments": 2585,
        "media": null,
        "permalink": "/r/realmadrid/comments/1keh71y/match_thread_real_madrid_vs_rc_celta_de_vigo_live/"
    }
]