[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 496,
        "comments": 275,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 19,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jtzxga",
        "author": "MaybeEddy23",
        "title": "What were your thoughts on Netflix's whodunnit series \"The Residence\" set in The White House?",
        "content": "",
        "upvotes": 121,
        "comments": 84,
        "media": null,
        "permalink": "/r/netflix/comments/1jtzxga/what_were_your_thoughts_on_netflixs_whodunnit/"
    },
    {
        "id": "1jtjt44",
        "author": "TheMirrorUS",
        "title": "Florida boy's 'violent murder' of teen girl sparks 'real life' comparisons to Netflix's Adolescence",
        "content": "",
        "upvotes": 370,
        "comments": 151,
        "media": null,
        "permalink": "/r/netflix/comments/1jtjt44/florida_boys_violent_murder_of_teen_girl_sparks/"
    },
    {
        "id": "1ju252b",
        "author": "Sad-Computer9869",
        "title": "Unpopular Opinion (maybe idk): people getting mad on game shows over people literally playing the game the way it’s meant to be played is infuriating",
        "content": "I’ve been watching “Million Dollar Secret” on Netflix and I’ve been enjoying it, but there’s a trend I notice with all of these types of game shows that’s honestly infuriating to me… why do people get so mad about people playing the game the way it’s meant to be played? \n\nLike for example: when people get so up in arms about a player “lying” when the whole premise of the game is to lie… it makes no sense. Like if you don’t want people to lie to you don’t sign up for a game that is predicated around it. \n\nIdk maybe this is not an unpopular opinion at all, I just needed to vent about it ",
        "upvotes": 13,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1ju252b/unpopular_opinion_maybe_idk_people_getting_mad_on/"
    },
    {
        "id": "1jtwdee",
        "author": "PickTheNick1",
        "title": "I just discovered Million Dollar Secret",
        "content": "I just discovered Million Dollar Secret show, didn't even knew it's a brand new show and was pretty shocked to find out that it's not yet fully out so I need to wait for another 2 days for the next episode to come out.\n\nDid you try it out? How do you like it so far? Any favorites from the people left? :)",
        "upvotes": 22,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1jtwdee/i_just_discovered_million_dollar_secret/"
    },
    {
        "id": "1ju94ok",
        "author": "huffpostuk",
        "title": "'It's Triggering': UK teachers weigh in on Adolescence’s school episode",
        "content": "Thanks to everyone who contributed in this thread - your comments were incredibly helpful for our piece. [https://www.reddit.com/r/netflix/comments/1jgc5mm/uk\\_teachers\\_how\\_real\\_are\\_the\\_school\\_scenes\\_in/](https://www.reddit.com/r/netflix/comments/1jgc5mm/uk_teachers_how_real_are_the_school_scenes_in/)",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ju94ok/its_triggering_uk_teachers_weigh_in_on/"
    },
    {
        "id": "1jtovdt",
        "author": "Longjumping_Land_977",
        "title": "Gone Girls: The dark story of where Shannan Gilbert’s three sisters are now",
        "content": "",
        "upvotes": 27,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jtovdt/gone_girls_the_dark_story_of_where_shannan/"
    },
    {
        "id": "1ju4k0j",
        "author": "Consistent_Wing_6113",
        "title": "Secret Millionaire Show FLAW",
        "content": "I feel like the millionaire agenda is immediately superseded by the Trophy room hint.\n\nSo as a millionaire - you're best not to accept risky agendas.\n\nThe hints are nearly so obvious that it extinguishes any fun.\n\nEither that or the millionaire agendas are silly. Better to place something somewhere instead of engaging people.\n\nShow could have been better thought out.\n\n",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ju4k0j/secret_millionaire_show_flaw/"
    },
    {
        "id": "1ju7qsf",
        "author": "raulz0r",
        "title": "Netflix app skips previously live streamed events",
        "content": "I watch WWE on Netflix, and the episodes(shows) are live streamed, I don't watch them live, but later on. My problem is that every time that I want to watch one of the shows, Netflix assumes I watched it already and skips to the end. Is there any way to stop this?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ju7qsf/netflix_app_skips_previously_live_streamed_events/"
    },
    {
        "id": "1ju3p43",
        "author": "treeofcodes",
        "title": "Shows with no Ads or just one Ad. Is this normal?",
        "content": "My partner and I have the Standard with Ads plan in the US.\n\nWhy do some shows have no ads at all? I binged Sonic Boom, many many episodes, each one about 12 minutes long, and received zero ads total.\n\nThen I binged Gilmore Girls, and only got one ad at the beginning of each episode, even when there were more “yellow marks” showing when an ad should happen during the show.\n\nThen I binged Supernatural, back to zero ads…\n\nIs there a reason why this might be?\n\nI’ve heard people mention an insane amount of ads for some shows and movies, could you share the names of those so I can check them? I’m just curious to see to try to understand how the whole thing is decided. \n\nWhat gets more ads or fewer ads? \n\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ju3p43/shows_with_no_ads_or_just_one_ad_is_this_normal/"
    },
    {
        "id": "1ju8jhl",
        "author": "Salty-Snow-8334",
        "title": "Adolescence Is Unrealistic",
        "content": "",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ju8jhl/adolescence_is_unrealistic/"
    },
    {
        "id": "1jtgd1g",
        "author": "dailystar_news",
        "title": "Narcos star in coma fighting for his life after contracting deadly infection",
        "content": "",
        "upvotes": 27,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jtgd1g/narcos_star_in_coma_fighting_for_his_life_after/"
    },
    {
        "id": "1ju2rym",
        "author": "MamaMia1325",
        "title": "Million Dollar Secret podcast with Peter (the host)",
        "content": "I just came across this podcast. It’s a recap of each episode with Peter and they play parts from the show to ask him what he thought of the things people did. It’s hysterical listening to his reactions to the things the people did.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ju2rym/million_dollar_secret_podcast_with_peter_the_host/"
    },
    {
        "id": "1ju2gsb",
        "author": "FinalLightNL",
        "title": "Does anyone know from which episode \"Blacklist\" starts to get 4K or HDR?",
        "content": "I've recently purchased a PG32UCDM OLED monitor and watching HDR and 4K Movies/Series has been an absolute blast on it.\n\nI thought i read somewhere that Blacklist was 4K but i started the first two episodes and it just says HD.  \nAnyone here might know more, thanks in advance!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ju2gsb/does_anyone_know_from_which_episode_blacklist/"
    },
    {
        "id": "1jtnjk5",
        "author": "iPhone13pm",
        "title": "HAVOC | Official Trailer | Netflix",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jtnjk5/havoc_official_trailer_netflix/"
    },
    {
        "id": "1jsxsf7",
        "author": "Wild_Shallot_3618",
        "title": "Con Mum Arrested!",
        "content": "Courtesy of @mothershipsg IG",
        "upvotes": 334,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1jsxsf7/con_mum_arrested/"
    },
    {
        "id": "1jte514",
        "author": "sshollay",
        "title": "What are your go to mystery or thriller movies or series in Netflix.",
        "content": "I am new to netflix and I like to watch any kind of mystery or thriller movies other than in Hindi language. I hope you could suggest me a few. I don't mind if they are new or old.\n\nI just finished watching \" The Residence\" and I loved it.\nWaiting to watch more.\n\n",
        "upvotes": 27,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1jte514/what_are_your_go_to_mystery_or_thriller_movies_or/"
    },
    {
        "id": "1ju0wti",
        "author": "indiewire",
        "title": "The 26 Scariest Movies on Netflix: Pearl, Fear Street, Scream &amp; More",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ju0wti/the_26_scariest_movies_on_netflix_pearl_fear/"
    },
    {
        "id": "1ju0wob",
        "author": "indiewire",
        "title": "The Best Indie Movies on Netflix: 33 Films Streaming",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ju0wob/the_best_indie_movies_on_netflix_33_films/"
    },
    {
        "id": "1jtvt6i",
        "author": "DismalLeg7977",
        "title": "Give me all the dinosaur(or monsters if you have nothing)shows you can think of that's not a cartoon",
        "content": "I posted before asking for dinosaur shows because my dad like them and we've seen most of the ones recommended in that post but we've almost seen them all and he only likes dinosaurs. Everyday he comes downstairs and says \"hey watch more dinosaur\" and I always tell him it's gonna be hard to find a new one but all he says is \"yeah new dinosaur\" I sometimes put on something else that he chooses that's not dinosaur I make sure to tell him that and he says ok then we watch it for like 5 min and he goes upstairs saying \"this isn't dinosaur\". Today he said he would try watching what I like so I put on daredevil and he didn't like it at all. we've also seen love and monster and 1 ep of the witcher which he liked but for some reason doesn't want to finish anything that's more then 2 hours long. Thanks ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jtvt6i/give_me_all_the_dinosauror_monsters_if_you_have/"
    },
    {
        "id": "1ju4y1n",
        "author": "HighLumberJack",
        "title": "Household punished for non-traditional living arrangements?",
        "content": "I'm so confused. I own a house in state A, and another house in state B. I also travel for work 4x days a week on average, either to my house in state B or other states. But my primary residence is in state A. But sometimes I'm not home for 3 weeks at a time.\n\nMy wife and I have a premium account for 4 device access. We also have 2 kids, who live 60% with me and my wife in state A, 40% with my ex. When I travel, I bring a roku stick to watch on hotel TVs.\n\nI'm not trying to share netflix with anyone outside of my household, I want it just for me and my dependents. I also cannot have to constantly call my wife to verify the account since we are multiple timezones apart frequently, and I want it linked to her phone and email address so when my kids need to re-sign in on their tablets she can help me. \n\nBut I cannot add my TV at my second house without being asked to update my household location, and my Roku stick constantly wants me to update my household location when I am traveling, since Netflix trests it like a full TV sign in instead of a mobile device sign in. I guess I run out of \"I'm traveling\" sign ins between my kids when they go to my ex's and me traveling.\n\nAnd netflix support is completely unhelpful. They advised me to drop my subscription level to 2 devices and add another member. Which would cost an additional $1 but would drop my total simultaneous devices to 3x instead of 4x. Other than that they said it is designed to be shared with 1 house.\n\nIs there any way that anyone has figured out to have 2 physical houses and constantly traveling people without getting punished by netflix and having to purchase multiple accounts?\n\nThis is massively frustrating, I spent over an hour on the phone with support and got NOWHERE with their circular logic. Any tips?",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1ju4y1n/household_punished_for_nontraditional_living/"
    },
    {
        "id": "1jtvdq8",
        "author": "Elegant_Berry1989",
        "title": "is there any way to get old icons back?",
        "content": "i recently had to make a new netflix account and i’m mourning my ariana grande icon, i saw a tutorial but sadly that method doesn’t work anymore 🥲 has anyone found an updated way to get old icons?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jtvdq8/is_there_any_way_to_get_old_icons_back/"
    },
    {
        "id": "1jte3r4",
        "author": "mk0aurelius",
        "title": "Cannonballed the 2 seasons of Black Summer in one day, it is incredible. The rawest horror I’ve seen in years. htf did this get cancelled? Who else wants it back?",
        "content": "My unholy gods. That descended into the grittiest anarchy possible so quickly, raw and horrifically realistic throughout - I couldn’t stop watching one very hungover Saturday. The multiperspectives and especially the diner scenes early on were so so good. Crushed to know there’s no rumours of a return and the creators looks pretty occupied this year and next. Who else would love to see it come back? (If it is just that and that’s it forever, kind of nice to leave it open ended)",
        "upvotes": 14,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jte3r4/cannonballed_the_2_seasons_of_black_summer_in_one/"
    },
    {
        "id": "1jto39x",
        "author": "Somethingman_121224",
        "title": "'Peppa Pig' Is Returning to Netflix with New Episodes and a Video Game",
        "content": "",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jto39x/peppa_pig_is_returning_to_netflix_with_new/"
    },
    {
        "id": "1jtsx7h",
        "author": "protean_threat",
        "title": "Upcoming",
        "content": "Anything coming soon?  I feel like all the new cool coming soon stuff is elsewhere.   \n\nAnything you’re looking forward to ?\n\nHavoc w Tom Hardy on 4-25\n\nStranger Things rumored for October/November \n\n\n",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jtsx7h/upcoming/"
    },
    {
        "id": "1jtqf71",
        "author": "Winter_Specialist_99",
        "title": "The video keeps freezing every few seconds on derry girls",
        "content": "I'm watching on an android mobile and all of my other shows work fine on my phone. Derry girls keeps freezing up every few seconds with the audio continuing in the background. I've downloaded the episode, switched from data to WiFi, restarted my phone and then deleted the episode to try to stream again. I'm out of ideas and I don't know what to do. Any advice would be useful. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jtqf71/the_video_keeps_freezing_every_few_seconds_on/"
    },
    {
        "id": "1jt4wcv",
        "author": "LightOver4599",
        "title": "CON MUM IRONY",
        "content": "does anyone else note the irony of Graham being abandoned as a child but also abandoning his own child- he grew up without parental love. This potentially led to his gullibility. He probably didn’t even try everything in his power make sure his kid grows up with a dad around. ",
        "upvotes": 35,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1jt4wcv/con_mum_irony/"
    },
    {
        "id": "1jtog63",
        "author": "Icy-Fig1168",
        "title": "Subtitels Foreign Language not working",
        "content": "Hey so im watching a Show on Netflix but every time they speak a foreign language like french there are no subtitels even tho it is an important dialouge. How can i turn this on again? Not in the subtitels menu because wehen i turn on subtitels there everything has subtitels whichh i dont want.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jtog63/subtitels_foreign_language_not_working/"
    },
    {
        "id": "1jth96p",
        "author": "alphabae10",
        "title": "PULSE ♥",
        "content": "Has anyone here watched *Pulse* yet? I've had a huge crush on Colin Woodell ever since his appearance on *The Originals*, so I was *so* excited to see he has a new show on Netflix. I've a thing for medical drama TV series too, since Grey's Anatomy. So I was so happy when I saw he's on Pulse which is, obvs, a medical drama series. I binged the whole thing today, and honestly, it got me through a pretty rough chapter in my life—not even exaggerating.\n\nBut now that it’s over… I’m back to my regularly scheduled programming: depressed, alone, and unemployed. 🙃",
        "upvotes": 3,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1jth96p/pulse/"
    },
    {
        "id": "1jtcqxw",
        "author": "WeezTheJeice",
        "title": "One of Them Days",
        "content": "\nIMO this film fits right in as another west coast comedy classic. Definitely getting some Friday plot similarities, but from a female’s perspective. Tell me what you guys think of it.",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jtcqxw/one_of_them_days/"
    },
    {
        "id": "1jtt45y",
        "author": "Clean_Confidence_473",
        "title": "Dexter's Novels Vs. TV Show",
        "content": "Darkly Dreaming Dexter\n\n* There's no silly Deb relationship.\n* I felt that Deb &amp; Dexter are much closer, like real brothers.\n* Laguerta almost caught Dexter — almost. She dies at the end of this novel.\n* Dexter saves Deb and lets Brian kill Laguerta because Brian is his brother and the only one who truly understands him.\n* Doakes isn’t as intense in this first arc.\n\nDearly Devoted Dexter\n\n* Until the author emphasizes how inhuman Dexter is — he just fakes emotions and imitates human behavior.\n* The Danco storyline was interesting and creative.\n* Doakes' past reveals his dark side from his time in special forces.\n* Doakes investigates Dexter, while Dexter investigates Doakes' dark past.\n* Astor and Cody are a bit cold because of all the sh\\*t that’s happened to their family over the years.\n* Deb's boyfriend, named Kyle, is kidnapped.\n* Dexter accidentally gets married to Rita (lol).\n* Dexter isn’t a constant liar this time. He cooperates with Miami PD and works alongside Deb. :3\n* During a fishing trip, Cody kills a fish... very strange moment, darkness rising? Before that, the neighborhood dog disappeared... Cody and Astor start acting a little strange.\n\nDexter in the Dark\n\n* The Dark Passenger is a demon.\n* Vince Masuoka is Dexter's best man at his wedding. :3\n* Cody &amp; Astor keep pushing Dexter to teach them Harry's Code. Dexter is a little worried because they’re too young. Cody and Astor get frustrated because of Dexter’s decision.\n\nDexter by Design\n\n* Now married to Rita, Dexter goes on a honeymoon in Paris.\n* Deb, now a sergeant in Miami PD, is working with Dexter on an investigation.\n* Meanwhile, Deb faces a big dilemma: she wants to deliver justice, but her own brother is a killer.\n* Deb gets stabbed and falls into a coma.\n* Dexter feels a sense of justice because Deb always supported him no matter what. Now, he wants to make justice for her.\n* However, he kills the wrong guy... and the real killer sends Dexter a videotape of his twisted \"hobby.\" 😬\n\nRelease post: 27/3/2025  \nLast update: Thu, Mar 27, 2025",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jtt45y/dexters_novels_vs_tv_show/"
    }
]