[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 14,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mdimu9",
        "author": "Nebberlantis",
        "title": "What should they make the next Trainwreck about?",
        "content": "I recently watched the new one based off Storm Area 51, and I’ve been loving these past documentaries on the Poop Cruise, Project X, Astroworld and especially Woodstock ‘99.\n\nSo here’s my question: If you could suggest a topic for Trainwreck to cover in their next documentary, what would it be?",
        "upvotes": 43,
        "comments": 89,
        "media": null,
        "permalink": "/r/netflix/comments/1mdimu9/what_should_they_make_the_next_trainwreck_about/"
    },
    {
        "id": "1md80h5",
        "author": "leyy_pink1997",
        "title": "Just finished The Fall of the House of Usher — WHY did no one warn me it was this good?! 😱🔥",
        "content": "I went in thinking it would be another slow gothic horror, but damn—Mike Flanagan really cooked with this one. The visuals, the pacing, the way each episode was named after a Poe story… genius.\n\nAnd can we talk about Carla Gugino? She was terrifying and mesmerizing all at once. I haven’t binged something this fast in a while.\n\nAnyone else get Haunting of Hill House vibes but darker and more vicious? Curious if I should go for Midnight Mass next.\n\nWould love to hear your Flanagan rankings or any hidden gems on Netflix that are equally mind-blowing.\n",
        "upvotes": 102,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1md80h5/just_finished_the_fall_of_the_house_of_usher_why/"
    },
    {
        "id": "1md2mol",
        "author": "Sweaty-Toe-6211",
        "title": "Adam Sandler’s ‘Happy Gilmore 2’ Debuts to 46.7 Million Views, Biggest Netflix U.S. Film Opening Ever",
        "content": "",
        "upvotes": 125,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1md2mol/adam_sandlers_happy_gilmore_2_debuts_to_467/"
    },
    {
        "id": "1md2rio",
        "author": "dailystar_news",
        "title": "Netflix have confirmed full cast for Pride and Prejudice TV series - what do you think?",
        "content": "",
        "upvotes": 89,
        "comments": 50,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/dbcx9j3blzff1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1md2rio/netflix_have_confirmed_full_cast_for_pride_and/"
    },
    {
        "id": "1mdohrx",
        "author": "rm3g",
        "title": "New Userface",
        "content": "Just logged into Netflix and the new userface is terrible! Netflix was always the best one, the easiest one to navigate. The list was so nice to see it all and now it is just one long line. I don't know who approved this and why anyone thinks it is better. I would always say that I wish the other sites were easy like Netflix and then Netflix just went and copied their terrible designs! Has anyone figured out a why to view your whole list at once?",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1mdohrx/new_userface/"
    },
    {
        "id": "1md9nhk",
        "author": "Sudden_Pop_2279",
        "title": "'KPop Demon Hunters' becomes Netflix's most-watched original animated film",
        "content": "",
        "upvotes": 22,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1md9nhk/kpop_demon_hunters_becomes_netflixs_mostwatched/"
    },
    {
        "id": "1mdnuen",
        "author": "Strange-Original-201",
        "title": "So DONE with out of sync captions and being forced to watch more ads 90% of the time when I refresh",
        "content": "Seriously. I watch a lot of foreign language content. So I'll be watching something Korean, say... and there's a commercial. After the ad, the caption is completely out of sync and I have to refresh the page. That alone is super-freaking annoying - but THEN: it boots me back to ANOTHER bunch of freaking ads and will STILL be off with its timing afterwards. I have to time it JUST right for it to work. This is too annoying to be sustainable for me. It's been going on for months at this point. If Netflix can't get its act together, it doesn't deserve my money. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mdnuen/so_done_with_out_of_sync_captions_and_being/"
    },
    {
        "id": "1mcqsfu",
        "author": "GingerVix666",
        "title": "If there’s one show on Netflix you could recommend…",
        "content": "…to someone who just joined the platform, what would it be? And why? Please don’t say Riverdale 😂😭 I’m just rejoining after a bit and want to know what’s worth watching ",
        "upvotes": 157,
        "comments": 713,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqsfu/if_theres_one_show_on_netflix_you_could_recommend/"
    },
    {
        "id": "1mce7ep",
        "author": "Whobitmyname",
        "title": "‘Untamed’ Renewed for Season 2 at Netflix",
        "content": "",
        "upvotes": 496,
        "comments": 150,
        "media": null,
        "permalink": "/r/netflix/comments/1mce7ep/untamed_renewed_for_season_2_at_netflix/"
    },
    {
        "id": "1mdni2d",
        "author": "No_Situation_7748",
        "title": "Household with Second Address",
        "content": "So, my family has two addresses. We spend half our time at one address and the other half at another. Now we’ve never had a problem watching our Netflix account at both addresses but now we do.  At one of the addresses I’m told via my TV that I’m not part of my “household”.  After some research I’ve learned that this is Netflix’s way to prevent account sharing.  But I’m not account sharing. I’m using my account at my homes. Is this an oversight or is this a legit money grab to make me pay for two accounts?   ",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1mdni2d/household_with_second_address/"
    },
    {
        "id": "1mdnhud",
        "author": "EmployLegal7589",
        "title": "Derpy and Sussie from KPDH",
        "content": "So I have become obsessed with Kpop Demon Hunters. What do you think about my Derpy and Sussie tattoo? Do you think this is just a fad or do you think K pop Demon Hunters is here to stay? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mdnhud/derpy_and_sussie_from_kpdh/"
    },
    {
        "id": "1md0vy2",
        "author": "Hey-yo-iz-me",
        "title": "Squid game 3 - is it just me or do you also feel it is slow and boring?",
        "content": "It feels really slow paced. And story seems boring now. And the old aunty who killed her own son to save a stranger and her baby , my two brain cells cant comprehend that kind of kindness/empathy/stupidity. \n\nWhat are your views? ",
        "upvotes": 18,
        "comments": 58,
        "media": null,
        "permalink": "/r/netflix/comments/1md0vy2/squid_game_3_is_it_just_me_or_do_you_also_feel_it/"
    },
    {
        "id": "1mdn060",
        "author": "I_am_Eden",
        "title": "Netflix defaults to widevine, cannot watch 2k or 4k content on my PC",
        "content": "Hey there everyone,\n\nfor the last couple of days I have been trying to figure out the issue with my netflix app not being able to play content above 1080p.\n\nI have selected the \"high\" playback option in the netflix account settings.\n\nW11, up to date\n\nGPU: 4070ti supports HDCP 2.3\n\nDisplay: Odyssey neo g9 supports HDCP 2.3\n\nCable: DisplayPort 1.4\n\nnvidia drivers up to date\n\nresolution: 5120x1440 but even when I set it to 2560x1440 it changes nothing\n\nRefresh rate: 240hz but even limiting to 60hz against changes nothing.\n\nGigabit connection\n\nUsing the netflix app, updated\n\nTried Edge updated same issue\n\nChrome same issue  \nBrave same issue\n\nI am lost, any help is welcome. Using Ctrl+Shift+Alt+D to check the drm it always shows Widevine, no matter if I'm watching a show like stranger things or a movie like oppenheimer. For oppenheimer specifically the resolution is 960x540, even worse than what I get usually",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mdn060/netflix_defaults_to_widevine_cannot_watch_2k_or/"
    },
    {
        "id": "1mdfa1f",
        "author": "Proud_Letterhead_438",
        "title": "Recommend",
        "content": "More creepy shows like the make Flanagan shows and such. Also love AHS. We were liars .  I even like documentaries if they are very interesting and come with twist .Things similar.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mdfa1f/recommend/"
    },
    {
        "id": "1md5are",
        "author": "Maxgay4u",
        "title": "Saja boys (They were not human.)",
        "content": "Jinu is the only former human one out of them all. “Oh then what about the photos on the doctors wall?” That could literally be any other group in that universe, and they show us later in that doctor scene that he fakes his photos most of the time. (plus they look nothing like the saja boys if thats what they did look like bc they would look the same still, kinda like how jinu still has the same face and body as before and same hair!!) Abby, Romance, Mystery and Baby are all demons who Jinu turned into hot guys, they literally show us that. So idk whyyyy people are speculating that they are humans when they literally show them being turned into hot guys bc they were Ugly demons before. I just wanna say that bc i keep hearing ppl speculate they were human like no they show us they werent.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1md5are/saja_boys_they_were_not_human/"
    },
    {
        "id": "1mdo8sb",
        "author": "Ticats905",
        "title": "Why is Netflix so bad at not having foreign language subtitles?",
        "content": "I feel like Netflix several years ago never had this problem and it has only gotten bad in the last few years.\n\nJust started watching \"Flight Plan\" in English and in the first 3 minutes there's a conversation being had in German with no English subtitles as to what's being said. No options seem to fix this and it's as if they just port these movies over without giving a fuck if there are things that need to be translated. God forbid we know what's going on. \n\nIt seems to be happening more and more and it's infuriating considering we pay for this. ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1mdo8sb/why_is_netflix_so_bad_at_not_having_foreign/"
    },
    {
        "id": "1mcxy7c",
        "author": "coolgamer8473",
        "title": "I need Netflix recommendations",
        "content": "I need Netflix recommendations I've seen squid game, Wednesday, stranger things, ECT I need new shows to watch so can y'all please give me some recommendations to watch",
        "upvotes": 10,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1mcxy7c/i_need_netflix_recommendations/"
    },
    {
        "id": "1mdcymd",
        "author": "haruuto31",
        "title": "Nori and Allison’s friendship ?Building the band",
        "content": "I heard Nori from 3quency and Alison are friends, I checked and they did some TikToks together. What do you guys think ? I had no problem with Nori before but now I’m kind of asking myself questions on Nori’s.\n\nWhy would you be friend with the one that bullied her teammates who even spoke about what happened and how it was hard to see their biggest dream of pursuing a career in the music industry getting crushed because of that narcissist mean girl. Even other bands (Siren Society and Soulidified) showed that they don’t like Allison. A member or Siren Society even blurred her face in a group photo lol (deserved). \n\nAlso keep in mind Alison talked about it and never apologized. She said it was evil editing which is proven not to be since her groups members talked about it after the show. So she is also a liar lol.\n\nSo maybe even tho they may not be best friends, I just think this is very weird from Nori to make tiktoks with Alison. \n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mdcymd/nori_and_allisons_friendship_building_the_band/"
    },
    {
        "id": "1mdh8t3",
        "author": "PandaTickler69",
        "title": "Ads",
        "content": "Hey Netflix, I understand having ads. \nCould you at least sync them up with the intended commercial breaks for the Network television shows you're hosting? That would be great, and logical.... ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mdh8t3/ads/"
    },
    {
        "id": "1mdfm0u",
        "author": "highonjuice",
        "title": "Some fanart of mine, HUNTRIX photocards! [OC]",
        "content": "Been a fan of Kpop Demon Hunters since it came out, and I’ve been slowly making photo cards for Huntrix!!\n\nHuntrix animal heads are inspired by Stray Kids’ SKZOO, using animals I feel fit their vibes 🐢🦢🐶",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mdfm0u/some_fanart_of_mine_huntrix_photocards_oc/"
    },
    {
        "id": "1mcmqiv",
        "author": "kay-pii",
        "title": "Help. I need a show to binge or movie.",
        "content": "I can't find anything new to grasp my attention. I finished untamed in two days. Finished Brick. I've tried Dept Q but I just don't know wtf is going on and it seems so slow to get to the plot. I just rewatched Queens Gambit because I couldn't find anything else. I like thrillers, sci-fi. Seen ST. Not sure if I should start Mindhunters because of how heartbroken you guys are it was cancelled. Tried Dark but it's a bit confusing. Suggestions for shows or movies would be great. ",
        "upvotes": 33,
        "comments": 109,
        "media": null,
        "permalink": "/r/netflix/comments/1mcmqiv/help_i_need_a_show_to_binge_or_movie/"
    },
    {
        "id": "1md69v5",
        "author": "Glittering_Mind6771",
        "title": "Recommended me",
        "content": "I loved watching all four of seasons Stranger things and looking some more tv shows or movies having a similar type of plot or world. You can recommend me from Netflix or from any other too.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1md69v5/recommended_me/"
    },
    {
        "id": "1mddovs",
        "author": "restrictednumber1996",
        "title": "Any Netflix Original Movie Recs?",
        "content": "I’ve been trying to scroll through Netflix and even searched YT for trailers, but there are so SO SOOO many but…I also feel I only see the same maybe 20 films being recommended to me on the actual app. It’s just all overwhelming so here I am! \n\nSo does anybody have any Netflix Original Movie recs? They don’t have to be perfect, just enjoyable! I enjoy MYSTERY, THRILLER, HORROR, COMEDY. Do not enjoy ROMANCE, WAR FILMS. \n\nThank you in advance! \n\n",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mddovs/any_netflix_original_movie_recs/"
    },
    {
        "id": "1mdhrud",
        "author": "LeoMartn_",
        "title": "Ugly Betty Leaving whyyyyyy? I love this show ITS SO GOOD!",
        "content": "Ugly Betty Leaving whyyyyyy? I love this show ITS SO GOOD ugly Betty is leaving the streaming service soon?? Why is that? Why do shows come to Netflix, then leave after a certain amount of time? ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mdhrud/ugly_betty_leaving_whyyyyyy_i_love_this_show_its/"
    },
    {
        "id": "1mdigtf",
        "author": "No_Schedule3553",
        "title": "Enough’s enough",
        "content": "If Falcon was actually in the “flying saucer”, how would there be any possibility that the balloon would fly away? I might be missing something but doesn’t gravity explain how that couldn’t happen? Also, if he was flying in that thing, wouldn’t there have been outlines of his body or face on the balloon? The structure of the thing wasn’t titanium or anything. \nHow could any functioning human being be convinced, even for a moment, that a child was floating away in a diy flying saucer. Especially, law enforcement!!! \n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mdigtf/enoughs_enough/"
    },
    {
        "id": "1mdh51t",
        "author": "FarEfficiency4397",
        "title": "Your device is not part of the Netflix Household for this account",
        "content": "Ok guys so I have been using my brother's account who lives abroad. Everything was working fine until today where I got the error that device is not part of the Netflix Household for this account. Is this a new update for Netflix or something else ??",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1mdh51t/your_device_is_not_part_of_the_netflix_household/"
    },
    {
        "id": "1md7m51",
        "author": "bkat004",
        "title": "Would you watch a Biopic of the founding of Netflix ?",
        "content": "It could come off as grossly narcissistic.  (Did you see that FIFA Biopic ? - Disgusting !)\n\nHowever, I find the founding of this network ridiculously interesting.  From the rejection of Blockbuster to the advent of DVDs to the failure of RedBox to the raid on Kim Dotcom's house to the creation of original content to the purchasing of many studio's libraries.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1md7m51/would_you_watch_a_biopic_of_the_founding_of/"
    },
    {
        "id": "1mclemt",
        "author": "ToonAdventure",
        "title": "‘Untamed’ Leads Netflix English TV List Again As ‘The Hunting Wives’ Puts Up Impressive Debut; ‘Happy Gilmore 2’ &amp; ‘KPop Demon Hunters’ Dominate Film",
        "content": "",
        "upvotes": 13,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mclemt/untamed_leads_netflix_english_tv_list_again_as/"
    },
    {
        "id": "1md1jei",
        "author": "Moist_Pepper8124",
        "title": "A Netflix Nevermore Videogame Idea",
        "content": "Think about a game that's like Hogwarts Legacy but it takes place at Nevermore Academy in the Wednesday universe. You could pick the power, gender and appearance of your character where the things you could do would be decided by your power.\n\nYou could have friendships and romantic relationships, you could date the other students/outcasts at Nevermore according to your gender preference.\n\nYou would be assigned your dorm hall, dorm and roommate which would be part of the games story. Your roommate would be the same as the gender yours so if you picked to be a guy your roommate would be a guy and it would be the same if you picked to be a girl, your roommate would be a girl. Your roommate would always be the same in the story every time you play the story so they could actually be part of the story.\n\nThe story would make sense with what happens in the show and would contain things from the show like the Poe Cup and The Nightshades.\n\nThe game would contain side quests where some of them would correlate to the power you chose.\n\nAfter the story is done you could walk around the campus and still do classes like learning about carnivorous plants and fencing. There would be extracurricular activities like choir or archery. You could still talk to NPC's after the story is over and make relationships with them.\n\nThe game would have other locations outside Nevermore like Jericho, The Weathervane, Crackstones Crypt or even the Gates family mansion.\n\nAfter The Wednesday Series ends I think this game could work, the only problems would be the amount of powers in Wednesday, the useless powers in Wednesday, the useful ones that become useless after the story ends like the visions or if the game would be possible after the Wednesday Series ends because we don't even know what will happen in the show but yet again the game could take place before the show takes place.\n\nSo yeah that was my game idea if Netflix would make a Nevermore game, I wanna hear your thoughts on it so feel free to comment anything or ask anything.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1md1jei/a_netflix_nevermore_videogame_idea/"
    },
    {
        "id": "1md1env",
        "author": "Technical_Two_733",
        "title": "Lost Ending August 14?",
        "content": "So I've been watching the best show on the planet - Lost through Netflix, but lately I keep getting this popup at the beginning of an episode saying that I only have until August 14 to finish watching it. Does that mean it will only stop showing in my region or all together?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1md1env/lost_ending_august_14/"
    }
]