[
    {
        "id": "1qrcqeg",
        "author": "IcefoxX5",
        "title": "[Match Thread] Real Madrid Castilla - CA Osasuna Promesas | Primera Federación, Matchday 22",
        "content": "#FT: CASTILLA 1:1 OSASUNA B\n\n&amp;#x200B;\n\n#1ª FEDERACIÓN\n\n&amp;#x200B;\n\n**Scorers/replays:** \n\nRed card: Mikel Serrano (Osasuna) 41'\n\n1:0 César Palacios 45'+3 \n\n1:1 Roberto Arroyo 51' \n\n&amp;#x200B;\n\n**match updates:** \n\n1' - kickoff, vamos! \n\n🟥 41' - red card for Osasuna - Mikel Serrano leaps at knee height into Dani Yáñez - he doesn't connect fully, but the height of the challenge alone leads the referee to give a red card. After a challenge, she lets the card stand \n\n⚽ 45'+3 - GOLLLLL DEL CASTILLA, golazo de Palacios! - the ball is played out to the left wing, then back inside - Cestero lays it off to Palacios with a single touch, and he shoots first time and curls it perfectly into the top right corner from just inside the box \n\nHT - a very uneventful first half with both teams struggling to create danger, Osasuna struggling with terrible form and Castilla still insecure with their new coach ends with two bangs, as Osasuna needlessly get a player sent off and Castilla score a great goal to get themselves perfectly on track for the second half \n\n46' - second half underway\n\n⚽ 51' - Goal for Osasuna - unbelievable mistake by Valde, who doesn't get the pass off in time and gets the ball stolen in our half - Arroyo takes it and converts the 1v1 with Fran\n\n65' - incredible miss again by Manuel Ángel, whose shooting has been absolutely awful today - he's completely open after a great play by the team at the left side of the box, but he puts it wide from a good position with the outside of his boot \n\n🔄 68' - Arnu, on loan from Valladolid, makes his Castilla debut, coming on for Loren\n\n🔄 74' - Mesonero and Leiva on for Manuel Ángel and Thiago Pitarch \n\n🔄 89' - Yáñez and Palacios off for Pol Fortuny and Bruno Iglesias \n\nFT - an absolute embarrassment of a performance, letting the win slip away against 19th placed Osasuna who haven't won a match in months, playing against 10 men for more than an entire half. Bad start into Julian López' era with 2 points out of a possible 9 and the team portraying a very bad image  today - the team can drop to as low as 9th place this matchday \n\n&amp;#x200B;\n\n**Kickoff:** 19:00 CET\n\n**Venue:** Estadio Alfredo di Stéfano, Madrid\n\n**Referee**: Eugenia Gil Soriano \n\n**Competition:** Primera Federación, Grupo 1, Matchday 22\n\n**Viewing options:** \n[LaLiga+](https://www.laligaplus.laliga.com/) (subscription - 14.99€/month) (only available in Spain)\n\n&amp;#x200B;\n\n**Castilla XI** (4-3-3): Fran González - Diego Aguado, Víctor Valdepeñas ‘Valde’, Mario Rivas, David Jiménez - Jorge Cestero, Manuel Ángel (74' Dani Mesonero), Thiago Pitarch (74' Álvaro Leiva) - César Palacios (89' Bruno Iglesias), Loren Zúñiga (68' Adrián Arnuncio 'Arnu'), Dani Yáñez (89' Pol Fortuny) \n\nBench: Sergio Mestre (GK), Guille Súnico (GK), Jesús Fortea, Lamini Fati, Cristian David. \n\nUnavailable: Joan Martínez (first team call-up), Manu Serrano (injury), Roberto Martín (injury), Hugo de Llanos (injury), Rachad Fettal (injury). \n\nCoach: Julián López de Lerma\n\n&amp;#x200B;\n\n**Castilla last five matches:** LWLDL\n\n**1ª RFEF stats:** 7th | 32pt | 10-2-9 | 28:30\n",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qrcqeg/match_thread_real_madrid_castilla_ca_osasuna/"
    },
    {
        "id": "1qnd1ex",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 18,
        "comments": 3233,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qnd1ex/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1qrwqsj",
        "author": "tfisthh",
        "title": "Right now the media is trying to make Mbappe’s goals at Real Madrid look bad. What do you think is he the problem or not?",
        "content": "",
        "upvotes": 55,
        "comments": 77,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1jxysovz8ngg1.jpeg?auto=webp&amp;s=67470081274d4489b17917154b44fabe95cdd50e"
        },
        "permalink": "/r/realmadrid/comments/1qrwqsj/right_now_the_media_is_trying_to_make_mbappes/"
    },
    {
        "id": "1qrj5gl",
        "author": "Hot-Cantaloupe-6217",
        "title": "Crazy stats! I hope Mbappe keeps this momentum until we get the 9 reinforcement players we need to recover",
        "content": "",
        "upvotes": 310,
        "comments": 82,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/o9i88i7o4kgg1.png?auto=webp&amp;s=4de7bc36c0e0449afb922161f40d67321617f06f"
        },
        "permalink": "/r/realmadrid/comments/1qrj5gl/crazy_stats_i_hope_mbappe_keeps_this_momentum/"
    },
    {
        "id": "1qrbv9v",
        "author": "Far_Awareness4497",
        "title": "The lack of urgency from our players is disgusting",
        "content": "Most of players are not in form but that's not what infuriates me, it's the lack of effort that kills me. You can criticise Bellingham and valverde current form but These guys put in the effort. Unlike so many of our players. Look at tchouameni jogging to the post, he could have prevented the goal if he ran like valverde. Tchouameni is out of his depths, it's time the board sells him and make some profit now that he's still young and not completely finished.",
        "upvotes": 634,
        "comments": 129,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/rq5owev6uigg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qrbv9v/the_lack_of_urgency_from_our_players_is_disgusting/"
    },
    {
        "id": "1qr2vn0",
        "author": "Ready_Ad_1353",
        "title": "Real Madrid to face Benfica in the UCL Knockout Playoffs",
        "content": "",
        "upvotes": 1442,
        "comments": 297,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/i0c7j4rw1hgg1.jpeg?auto=webp&amp;s=1a7d1a4aaf04e1d8bb3640def10846328d616112"
        },
        "permalink": "/r/realmadrid/comments/1qr2vn0/real_madrid_to_face_benfica_in_the_ucl_knockout/"
    },
    {
        "id": "1qr73so",
        "author": "Dangerous_Tip_4985",
        "title": "I prefer not to speak. If I speak, I am in big trouble.",
        "content": "",
        "upvotes": 535,
        "comments": 39,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/oqnkhejkzhgg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qr73so/i_prefer_not_to_speak_if_i_speak_i_am_in_big/"
    },
    {
        "id": "1qr6mpf",
        "author": "Bijay12356",
        "title": "When we used to fight until the final whistle, when we didn’t know the meaning of surrender 🥲",
        "content": "",
        "upvotes": 419,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/orbp1x29whgg1.jpeg?auto=webp&amp;s=e5b1c12cb2fe2172f0f5bc085a36c6e4e85437da"
        },
        "permalink": "/r/realmadrid/comments/1qr6mpf/when_we_used_to_fight_until_the_final_whistle/"
    },
    {
        "id": "1qrau7e",
        "author": "TheFeatherDiaries",
        "title": "The only player in the last 15+ seasons to create more chances than Arda Guler per 90 mins in La Liga is 2010/11 Mesut Ozil who played the whole season as a pure Number 10. Moreover Arda ranks third in chances creation percentage through long balls over the same time period.",
        "content": "",
        "upvotes": 170,
        "comments": 60,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/izu3nm6fmigg1.png?auto=webp&amp;s=0cc7ea7b5e1cf13213b7f5d750244db49b799860"
        },
        "permalink": "/r/realmadrid/comments/1qrau7e/the_only_player_in_the_last_15_seasons_to_create/"
    },
    {
        "id": "1qred9w",
        "author": "IcefoxX5",
        "title": "Real Madrid Castilla [1]-0 CA Osasuna Promesas - César Palacios golazo 45'+3",
        "content": "",
        "upvotes": 82,
        "comments": 9,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9e7mpkkd9jgg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qred9w/real_madrid_castilla_10_ca_osasuna_promesas_césar/"
    },
    {
        "id": "1qr4g43",
        "author": "ch1nkkyy",
        "title": "🚨 JUST IN: Real Madrid are currently focused on CB's and midfielders. The club is currently conducting analysis, and decisions will be made on TARGETS starting from MARCH.",
        "content": "",
        "upvotes": 254,
        "comments": 120,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qr4g43/just_in_real_madrid_are_currently_focused_on_cbs/"
    },
    {
        "id": "1qr718q",
        "author": "InspectorExact3836",
        "title": "[UEFA] Courtois has made second most saves(41) in CL this season",
        "content": "",
        "upvotes": 160,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/556os8c3zhgg1.jpeg?auto=webp&amp;s=cc5bf74a96e60e1640a71f1b790b7433749e914a"
        },
        "permalink": "/r/realmadrid/comments/1qr718q/uefa_courtois_has_made_second_most_saves41_in_cl/"
    },
    {
        "id": "1qrni1m",
        "author": "Mastermind_737",
        "title": "What's Valverde doing so high up when we need to defend a lead. And then our 3rd goal",
        "content": "",
        "upvotes": 23,
        "comments": 35,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qrni1m/whats_valverde_doing_so_high_up_when_we_need_to/"
    },
    {
        "id": "1qqynyy",
        "author": "oiomelanda",
        "title": "😂😂😂😂😂😂😂😂😂 sums up our current state",
        "content": "",
        "upvotes": 480,
        "comments": 25,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/18terrm3tfgg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qqynyy/sums_up_our_current_state/"
    },
    {
        "id": "1qrvqtw",
        "author": "HumanSuspect7865",
        "title": "Our biggest problem...",
        "content": "Analyzing our UCL winning campaigns (post 2009)\n\n\\- **In the La Decima campaign**, our players were all arguably at their peak versions. Cristiano, Di Maria, Bale, Ramos, Pepe all played at their statistical best and were crucially important in the KOs stages.\n\n&gt;2014 (4) - UCL, CDR, Super Cup and CWC.\n\n\\- **In the 3-Peat campaigns**, the team while not as energetic as the 11/12 squad or as statistically strong as 13/14 squad, relied on the midfield balance and structure provided by Modric-Kroos-Casemiro. Isco was also preferred over Bale and the team's defensive work-rate remained unaffected, as opposed to using James. CR7 and Marcelo were KO monsters. But the most underrated aspect people don't realize was that our non-egotistic bench of Lucas Vasquez, Morata, Nacho, Kovacic and Asensio provided great stats and knew their roles well.\n\nTrophies won\n\n&gt;2016 (3) - UCL, UEFA Super Cup, CWC (Lost La Liga by 1 point)\n\n&gt;2017 (5) - UCL, La Liga, Spanish Super Cup, UEFA Super Cup, CWC\n\n&gt;2018 (2) - UCL, CWC\n\n\\- In the 21/22 &amp; 23/24 campaign\n\n&gt;2022 (5) - UCL, La Liga, Spanish Super Cup, UEFA Super Cup, CWC\n\n&gt;2024 (5) - UCL, La Liga, Spanish Super Cup, UEFA Super Cup, CWC\n\nIn the 21/22 squad, the mix between veterans (Benz, Case, Modric, Carvajal, Kroos, Lucas, Marcelo, Alaba and Courtois) and youngsters (Vini, Fede, Cama, Rodrygo) was perfect. While the games were more miraculous than dominant, hopes of winning always existed.\n\nIn the 23/24 squad, the team benefited from Jude's spectacular debut season, Carvajal's peak, Kroos swansong and Vini's UCL run. Inspite of Benz, Marcelo &amp; Case departures, as well as injuries, the team had a strong bench with Joselu, Nacho, Modric, Lucas and Brahim performing their roles well. Rudiger played the role of the veteran very well.\n\nFast forward to 24/25 and 25/26 seasons. There's no visible leader apart from Courtois. Carvajal, Rudiger and Alaba are almost always unavailable, as is Militao, Mendy &amp; Trent. The team is filled with youngsters who don't know their roles at all. While Carreras is a good signing, and Mbappe, Tibo &amp; Arda have done their duties well, the rest of the team looks extremely scattered. Vini seems to be a shadow of himself and Jude &amp; Fede are wasted on their roles. There are no starting veterans in the squad (or even the bench) apart from Courtois, and the only player in his prime is Mbappe and Trent (if he's available).\n\nThe reason the Galacticos 2.0 worked was because we bought players who were in their prime (CR7, Kroos, Xabi) or those who were approaching it (Bale, Modric). They had a perfect blend of veteran-prime-youngster in the squads, which we sorely lack now. Also, replacing all-timers is very difficult considering we had so many until recently which haven't been replaced (CR7, Modric, Kroos, Ramos, Marcelo, Casemiro, Benz).\n\nObviously, our injury issues haven't helped at all since perhaps 2020. Not to mention, our crosses are limited because of a lack of aerial threat compared to when we had CR7, Bale, Ramos and Benz in the same team. Right now, the only aerial threat is arguably Jude and he's hardly close to the previous 4, although his playstyle is very complete.",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qrvqtw/our_biggest_problem/"
    },
    {
        "id": "1qqfzbd",
        "author": "AbuElKess",
        "title": "Reminder: up until that day we were top of the league, 7 points ahead of Barcelona, and second in the Champions League.",
        "content": "",
        "upvotes": 3570,
        "comments": 311,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/abalq3yqvbgg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qqfzbd/reminder_up_until_that_day_we_were_top_of_the/"
    },
    {
        "id": "1qrhdsk",
        "author": "Short_Mousse_6812",
        "title": "I don’t understand why we play 433",
        "content": "  I quite honestly don’t understand why we keep focusing so much on 433. A formation that is heavily reliant on width and the wings. The whole point of the formation is for the winger to create chances by either beating the defenders or crossing the ball. Guess what? Our wingers are not exceptionally good at that. We do not have a tall striker who gets in the box to receive crosses, and our wingers have been underperforming. Our right flank is basically nonexistent except for when Rodrygo decides to play good. If our wings are so weak, why not drop the same formation that has not led us anywhere. I am not claiming it is the solution, but playing the diamond again would be great. You put Bellingham behind the strikers so he can thrive again. We would also have more control in midfield and fullbacks could go higher up the pitch. Maybe this is not the best, but 433 is definitely not the way. ",
        "upvotes": 23,
        "comments": 38,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qrhdsk/i_dont_understand_why_we_play_433/"
    },
    {
        "id": "1qrqm0q",
        "author": "Fit_Wrap_9580",
        "title": "Even Hoffenheim is trolling Brahim lol",
        "content": "",
        "upvotes": 8,
        "comments": 7,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qrqm0q/even_hoffenheim_is_trolling_brahim_lol/"
    },
    {
        "id": "1qrjp2h",
        "author": "Educational_Rub8733",
        "title": "“We can’t always be winning”, but where are the changes to show that Madrid management cares?",
        "content": "No matter how the fans justify the current condition of Madrid, especially with the thesis that “we can’t always win” or “everyone goes through crisis”, this is such an understatement and distortion of what’s happening at the club. Yeah, we can’t always win, but where are the changes to improve or to consider something a change???? Do you not understand that the president spent more than a hundred mil for players whom we consider a “future perspective”, but not for players who could bring changes now? Like someone who is a lot more experienced, so we could close the midfield and the players who play 70 matches a season and then get injured for the upcoming future. \n\nAgain, this isn’t about bitching Perez or always complaining. It’s about the club. The emblem. Y’all understand that we are considered to be a historic team and the best team worldwide (according to the trophies and the whole “3ucls in a row” narrative). It’s unacceptable for the fans of the club to constantly bring down the status of Madrid to a state, where we would be bragging about 6:1 against Monaco. We are bigger than that.\n\nGoing to back to the first paragraph, there were rumours (rather news from certain article) that Madrid is in a brink of bankruptcy, but why is Perez making such “big purchases” for the so called “future talents”? Again, I don’t believe on these news, but makes me think. Perez has a network of propaganda (el chiringuito, RMTV,etc) who deliver what the Madrid bureaucracy thinks in a moment. If you notice, no pressure on Alaba, Rudiger, and others, who are keen to be injured, but earn almost 20 mil a year. Why aren’t there news about Perez pushing those players out by mutual contract termination?\n\nThe logic of this might just lie on Perez being a corporate leader while players are the product. We can’t accept this kind of shift from a sport team, to a corporate clergy",
        "upvotes": 17,
        "comments": 5,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qrjp2h/we_cant_always_be_winning_but_where_are_the/"
    },
    {
        "id": "1qqyw1i",
        "author": "Texas_Shepard",
        "title": "Something poêple forget about vini's renewal",
        "content": "Look im not going to talk about his bad form rn, obviously he can and will play better in the future.\n\nBut let me remind you of few names, alaba, Bale, hazard, kaka, james. You know what they have in common? \nWe signed them for a long ass time, for a huge salary and for years they fell off the power curve and we had to pay their wages instead of improving the team. \n\nIm scared we will do the same with vini. We renew him for 5/6 years. He'll play 2 more good seasons and then when he's past that 27 y/o his burst speed is gone and he'lls Slowly get worse. Now we stuck with him and huge salary instead of refreshing the squad. \n\nThis is why vini leaving is better, despite me thinking he'll overcome his bad form. ",
        "upvotes": 133,
        "comments": 66,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qqyw1i/something_poêple_forget_about_vinis_renewal/"
    },
    {
        "id": "1qrdb8w",
        "author": "Diggambaran",
        "title": "Turn Up the Isco-Disco: Underrated Genius of His Prime",
        "content": "As someone who followed most of Real Madrid’s 2016-17 UCL seasons, Isco was key to those triumphs. Time blurs memories, and people act like he was just flair. No.\n\nFirst: pure eye candy. His dribbling had hips like a salsa dancer, touches softer than silk, control that made defenders look silly. Creating chances, passing, everything was elegant. Joy to watch. Peak artistry.\n\nRemember peak Ronaldo-Messi debate era? We huddled in hostel rooms for UCL nights Messi fans versus Ronaldo fans yelling. One mate was Isco fan. That is how magnetic he was.\n\nSecond: big games. He owned them. Giorgio Chiellini said Isco wrecked Juventus’ UCL plans: all their tactics destroyed. Verratti called him one of the best opponents ever even Messi could not do what Isco did to him. The 2016-17 UCL run? Isco was the creative spark.\n\nEven at 2018 World Cup for Spain (Iniesta and Silva’s last dance), Isco was the guy. Attacks flowed through him, central hub despite the veterans. Spain went out to Russia on penalties, but he bossed it.\n\nSad decline after prime, but still class at Betis.",
        "upvotes": 17,
        "comments": 19,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qrdb8w/turn_up_the_iscodisco_underrated_genius_of_his/"
    },
    {
        "id": "1qr043a",
        "author": "Substantial_Dot_8714",
        "title": "Vinícius Júnior is currently the top assister in the champions league. He's on course to finish as the club’s top assister for a fourth consecutive season in the competition.",
        "content": "",
        "upvotes": 99,
        "comments": 76,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9ljuh69t8ggg1.jpeg?auto=webp&amp;s=c5b65eba3ddcb5571abaa88fa24a0f466702843b"
        },
        "permalink": "/r/realmadrid/comments/1qr043a/vinícius_júnior_is_currently_the_top_assister_in/"
    },
    {
        "id": "1qqze73",
        "author": "ace-s",
        "title": "The right choice would have been to sub out Vini(or even Jude) instead of Guler",
        "content": "I'm really speechless. We have a team that has 3 players that are completely untouchable and will throw a tantrum if they are subbed out. Atleast Mbappe actually performs consistently(for now). \n\nHow any manager is supposed to make changes when they can realistically rotate 6 players. \n\nHow Guler reacted was wrong but he is a kid and when one of the captains does this, he would learn too. \n\nHonestly,   \nWouldnt it have been better to bring in Gonzalo Garcia for Vini, put Mbappe on the wings?\n\nThe moment Xabi's time ended was when Vini threw his tantrum and the board supported it, but I bet Vini and his friends hated Xabi from the beggining for being to strict, for wanting to rotate more, for demanding more from the players. \n\nWhat makes me sad is that, we were 7 points ahead of Barca while having a team that did not back the manager. Imagine if they truly backed him!!!!!!",
        "upvotes": 97,
        "comments": 21,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qqze73/the_right_choice_would_have_been_to_sub_out/"
    },
    {
        "id": "1qr1cej",
        "author": "AbouMba",
        "title": "The best players this season are players who never won a UCL with Madrid",
        "content": "Just a reflexion I had. With the exception of Courtois, the players that give the most in the field are the players that have never won a big trophy with Real Madrid: Mbappe, Arda Guler, Carreras, Huijsen, Gonzalo, Ascencio. Whereas the players who have won multiple trophies already don't have that hunger anymore.",
        "upvotes": 64,
        "comments": 49,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qr1cej/the_best_players_this_season_are_players_who/"
    },
    {
        "id": "1qqfsfk",
        "author": "brownberriess1",
        "title": "People often say he's our best player aside from courtois. I say he's our best alongside him",
        "content": "",
        "upvotes": 732,
        "comments": 88,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/g3qp04blubgg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qqfsfk/people_often_say_hes_our_best_player_aside_from/"
    },
    {
        "id": "1qq6fkn",
        "author": "Ready_Ad_1353",
        "title": "Courtois congratulates Trubin after the match: True sportsmanship!!!",
        "content": "",
        "upvotes": 1638,
        "comments": 35,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/hg5t4qgp0agg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qq6fkn/courtois_congratulates_trubin_after_the_match/"
    },
    {
        "id": "1qqyraz",
        "author": "Texas_Shepard",
        "title": "Regarding arbeloa's press conferences",
        "content": "Arbeloa keeps saying it's his fault for the losses and it's not the players. And it's clear he's gonna say that for all future disappointment. \nBut respectfully, if it's your fault, then why are you on the job? If you're admitting that you are the reason we're out of copa and out of top 8 after being 3rd.Then leave and let soemone better. \n\nTldr: if it's your fault then gtfo",
        "upvotes": 39,
        "comments": 35,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qqyraz/regarding_arbeloas_press_conferences/"
    },
    {
        "id": "1qqnip5",
        "author": "Old-Discussion-3776",
        "title": "We Lost, But It’s Part of Football",
        "content": "We lost with a horrible performance yesterday, and it hurts a lot, especially when it’s against a team that is fighting relegation. But football is unpredictable. Even big clubs like PSG, who once won the sextuple and were considered unstoppable, are now struggling and sitting around 11th place. This shows that no team stays at its peak forever and that some matches are simply tough — not just physically, but mentally as well. Players are human. They feel pressure, fatigue, criticism, and expectations. They don’t step onto the pitch wanting to lose. They want to win because victories bring pride, recognition, and satisfaction, not just money. When things go wrong, it’s often more about confidence and mentality than a lack of effort.\n\nIt’s easy for fans to say that players are only here for money, but the reality is more complex. Many of these players receive massive offers from Saudi clubs and elsewhere, yet they still choose to play for Real Madrid because of what this club represents. Yes, the loss hurts deeply — I couldn’t sleep properly either — but we have to remember that they lost too, and it hurts them as well. Booing our own players only makes things worse. Just like we expect support from friends and family when we are at our lowest, our team also deserves backing during difficult times. This is their club as much as it is ours, and standing by them now is what true support really means.",
        "upvotes": 183,
        "comments": 34,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7qonauu39dgg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qqnip5/we_lost_but_its_part_of_football/"
    },
    {
        "id": "1qq984j",
        "author": "dark4403",
        "title": "Arda Güler cheering on the team after the second goal, he gave absolutely everything and as a reward he went to the bench...",
        "content": "",
        "upvotes": 821,
        "comments": 82,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/eibz62zsnagg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qq984j/arda_güler_cheering_on_the_team_after_the_second/"
    },
    {
        "id": "1qqga33",
        "author": "Messmers",
        "title": "Anyone else ended up laughing at this final play from us?",
        "content": "",
        "upvotes": 266,
        "comments": 60,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/gdj18nekxbgg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qqga33/anyone_else_ended_up_laughing_at_this_final_play/"
    }
]