[
    {
        "id": "1pswukd",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 15,
        "comments": 1281,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pswukd/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1prqmrr",
        "author": "scoreboard-app",
        "title": "Post Match Thread: Real Madrid vs Sevilla FC",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1prqmrr)",
        "upvotes": 68,
        "comments": 178,
        "media": null,
        "permalink": "/r/realmadrid/comments/1prqmrr/post_match_thread_real_madrid_vs_sevilla_fc/"
    },
    {
        "id": "1pvn2d5",
        "author": "Forsaken_Currency277",
        "title": "The Negreira Case is just the tip of the iceberg. It’s time to talk about the \"Villar-Platini\" era and the hijacking of the Champions League.",
        "content": "**As of now,** the Negreira trial is exposing the \"financial engine\" behind the club's success. Even though the current trial is about Spanish referees, it makes the \"Platini-Villar Era\" suspicions look much more like a logical extension of a corrupt culture rather than just a \"conspiracy theory.\" The circumstantial evidence creates a picture that many fans find impossible to ignore.\n\n* **The \"Anti-Premier League\" Narrative**\n\nDuring that era, English teams were incredibly dominant (in 2008, 2009, and 2011, three of the four semi-finalists were often English). Platini was vocal about wanting to break the \"Premier League monopoly.\" He famously spoke about the \"universality\" of football and criticized the massive debts of English clubs.\n\nThe Chelsea vs. Barcelona semi-final remains the \"ground zero\" for these theories.Referee Tom Henning Øvrebø turned down at least four clear penalty appeals for Chelsea. In recent years (2018 and 2022), Øvrebø has admitted: *\"I am not proud of that performance\" and \"It was not my best day.\"*\n\n**The Victim:** Didier Drogba was banned for six matches and José Bosingwa for four.\n\nThe Connection: The fact that such a catastrophic performance happened right when UEFA \"needed\" to prevent another all-English final (Man Utd vs. Chelsea) fueled the theory that the referee was, at the very least, \"influenced\" by the atmosphere Platini had created.\n\n* **The Massimo Busacca Incident (Arsenal vs. Barça, 2011)**\n\nThis is widely considered one of the most \"absurd\" red cards in history. Robin van Persie was sent off for a second yellow because he shot the ball **one second** after the whistle was blown for offside. He argued he couldn't hear the whistle over the 95,000 people in the stadium. Not only was Busacca not punished, but he was also hired by FIFA just a few months later. On July 14, 2011, he was named Head of Refereeing Development at FIFA.\n\n**The Victim:** Arsène Wenger and Samir Nasri were the ones charged and banned by UEFA for \"improper conduct\" for complaining about the decision.\n\n* **The Wolfgang Stark Incident (Real Madrid vs. Barça, 2011)**\n\nThe red card given to Pepe for a challenge on Dani Alves changed the entire semi-final. Replays showed that Pepe might not have even touched Alves, but the Barça player went down as if his leg was broken. UEFA didn't punish the referee, Wolfgang Stark. Instead, they rejected Real Madrid’s appeal and upheld Pepe’s suspension.\n\nMourinho gave his most famous press conference. He listed the referees: *\"Why? Why Ovrebo? Why Stark? Why? Every semi-final the same thing happens... I don’t know if it is the Unicef sponsorship or if it is because they are nice guys. I don't understand.\"* Mourinho was pointing to a pattern: in almost every high-stakes Champions League game Barcelona played, their opponent ended up with a red card.\n\n**The Victim:** They focused all their disciplinary power on José Mourinho, banning him for five matches for his \"Por Qué?\" speech. Stark continued to be a top-tier UEFA referee and was even selected for Euro 2012.\n\nThe \"Promotion\" of the Incompetent refrees is obvious.\n\nIn any other industry, if you fail catastrophically at your job, you get fired. In the Villar/Platini era, if you failed in favor of Barcelona, you got promoted.\n\n**The Institutional Link?**\n\nIt’s important to remember who was in power at the time.\n\nVillar and Platini: Ángel María Villar (then President of the Spanish FA) was a very close ally of Platini and a powerful figure in UEFA’s Refereeing Committee.\n\nVillar was a close ally of Joan Laporta (he even helped Laporta get elected in 2003). In 2012, former Barça VP Alfons Godall famously admitted: \"Laporta was very good at cultivating relations with these institutions (RFEF/UEFA), and that helped us. You have to be on the side of the power.\"\n\n* July 2017: Villar is arrested in Operation Soule for corruption, embezzlement, and fraud.\n* May 2018: The Negreira steps down and payments from Barcelona suddenly STOP.\n\nThe moment the \"Godfather\" of the referees was taken down by the police, the money flow ended. This isn't a coincidence; it's a pattern of a system that was dismantled.\n\n**Is this the biggest fraud in sports history? Or are we still supposed to believe it was all \"neutral\"?**",
        "upvotes": 159,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3ecfq8082f9g1.png?auto=webp&amp;s=7c55819e2d25c7e88932ad65ea5a25846a07b738"
        },
        "permalink": "/r/realmadrid/comments/1pvn2d5/the_negreira_case_is_just_the_tip_of_the_iceberg/"
    },
    {
        "id": "1pvg1gk",
        "author": "Material_Title_3337",
        "title": "My Mom got me this for Christmas. HALA MADRID AND NOTHING ELSE🥶🥶",
        "content": "",
        "upvotes": 360,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vmo5qm4sfd9g1.png?auto=webp&amp;s=83aad15b6c8f1dc0f108ece1c8c74b3ada81b6a4"
        },
        "permalink": "/r/realmadrid/comments/1pvg1gk/my_mom_got_me_this_for_christmas_hala_madrid_and/"
    },
    {
        "id": "1pvmx4z",
        "author": "Luka_Meraki",
        "title": "My mother gave me a Topps lo Real Madrid Team Set for Christmas. Can't believe my luck!",
        "content": "Was hoping for a cool auto but not this!!! I usually open Pokemon packs for fun, this was my first “major” box. Got some great cards for my collection but this was out of this world. 1/5 too!\nI am tempt to put it up on eBay and buy everything I can get on more boxes haha\nGot a 35/199 Rodrygo aswell!",
        "upvotes": 122,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/dyozw2a21f9g1.jpeg?auto=webp&amp;s=5c25e175c2ebfab91cb7870ced9718a8626e7c12"
        },
        "permalink": "/r/realmadrid/comments/1pvmx4z/my_mother_gave_me_a_topps_lo_real_madrid_team_set/"
    },
    {
        "id": "1pv6htq",
        "author": "OGjacks",
        "title": "Perfect time for this video 😅",
        "content": "",
        "upvotes": 952,
        "comments": 29,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/b6owttvqga9g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pv6htq/perfect_time_for_this_video/"
    },
    {
        "id": "1pvgu9d",
        "author": "pablo-gt",
        "title": "no snow, but still a white christmas!",
        "content": "",
        "upvotes": 119,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1pvoah7jmd9g1.jpeg?auto=webp&amp;s=4176c330202709a294ab284f608e95eb0121931f"
        },
        "permalink": "/r/realmadrid/comments/1pvgu9d/no_snow_but_still_a_white_christmas/"
    },
    {
        "id": "1pv4wmz",
        "author": "Ready_Ad_1353",
        "title": "Zinedine Zidane at AFCON watching his son Luca Zidane play for Algeria",
        "content": "",
        "upvotes": 773,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/me7v8bt2z99g1.jpeg?auto=webp&amp;s=a27865d81443f729485fa16a09a05a751bc9de47"
        },
        "permalink": "/r/realmadrid/comments/1pv4wmz/zinedine_zidane_at_afcon_watching_his_son_luca/"
    },
    {
        "id": "1pvdak3",
        "author": "vil727",
        "title": "Goals and Touches in the box, 25/26",
        "content": "",
        "upvotes": 141,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/x5zh8prspc9g1.jpeg?auto=webp&amp;s=53cd46e4c37d5a4c28cbbc00b2f4a1acf00636ca"
        },
        "permalink": "/r/realmadrid/comments/1pvdak3/goals_and_touches_in_the_box_2526/"
    },
    {
        "id": "1pv1oxo",
        "author": "Affectionate-Sir-425",
        "title": "I have the best girlfriend. HALA MADRID Y NADA MÁS",
        "content": "",
        "upvotes": 788,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9gi3ko5j099g1.jpeg?auto=webp&amp;s=cb2855f51cfd0b6575a2b58fed16826c07744fa4"
        },
        "permalink": "/r/realmadrid/comments/1pv1oxo/i_have_the_best_girlfriend_hala_madrid_y_nada_más/"
    },
    {
        "id": "1puigxl",
        "author": "landofphi",
        "title": "Harry Kane, Kylian Mbappé &amp; Erling Haaland — season stats so far (club + international)",
        "content": "",
        "upvotes": 317,
        "comments": 105,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ejjqyqy3449g1.png?auto=webp&amp;s=220b7e12006f3f87852a2a098a3567ec35df954b"
        },
        "permalink": "/r/realmadrid/comments/1puigxl/harry_kane_kylian_mbappé_erling_haaland_season/"
    },
    {
        "id": "1pusqw7",
        "author": "Short_Mousse_6812",
        "title": "My only problem with Xabi/the board",
        "content": "Xabi is a great manager with great ideas, so I attribute this more to him having no control over what he can do. Something I dislike about Xabi is how reluctant he is to play academy players or young prospects. Unless he is in a deep crisis with no players available, he will not give them a chance. Seeing Mastantuono and Guler play so much at the start of the season, makes me believe that it is not his decision, but rather the board’s.\n\nAncelotti was also amazing, but one of the complaints many had (including myself) was that he refused to play talents. This is something that seemed was going to change with Xabi, but we are back to square one. I think playing young players who many times have better performances and more passion may be better. We may find a gem capable of getting into the first team like what happened with Asencio. I think the most important factor is the passion and willingness to prove themselves that prospects usually have. Hopefully we can change this mentality. \n\n",
        "upvotes": 32,
        "comments": 44,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pusqw7/my_only_problem_with_xabithe_board/"
    },
    {
        "id": "1pufm0r",
        "author": "The_M1racul0us_dr3am",
        "title": "I made the 26/27 kits based on leaks by FootyHeadlines. Hope you guys like it!!!",
        "content": "",
        "upvotes": 128,
        "comments": 60,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pufm0r/i_made_the_2627_kits_based_on_leaks_by/"
    },
    {
        "id": "1ptywyp",
        "author": "Res3925",
        "title": "Comunicado Oficial: Endrick",
        "content": "",
        "upvotes": 257,
        "comments": 79,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ptywyp/comunicado_oficial_endrick/"
    },
    {
        "id": "1ptwbs9",
        "author": "No-Independent2522",
        "title": "[StatsMuse] Madrid have missed the most big chances by a club in Europe's top five leagues this season, with 42 big chances missed in LaLiga, Mbappe -14, Vini -8",
        "content": "Source StatsMuse : \n\nBy team: https://www.statmuse.com/fc/ask/most-big-chances-missed-in-la-liga\n\nBy player in laliga: https://www.statmuse.com/fc/ask/most-big-chances-missed-by-a-team-in-europe\n\nBarcelona missed 35, but they have scored 51 goals in Laliga comapred to Real Madrids 36 goals this season",
        "upvotes": 218,
        "comments": 115,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ptwbs9/statsmuse_madrid_have_missed_the_most_big_chances/"
    },
    {
        "id": "1ptss1r",
        "author": "Prestigious_Tax2069",
        "title": "Vinícius Jr. and the Whistles: When Frustration Turns Into a Bigger Problem",
        "content": "Vinicius has every right to be upset with Real Madrid fans if they boo him or any other player. However, Vinicius himself must not forget that those whistles did not come because of a single moment or an one mistake, but rather due to a long and repeated period of underperformance.\n\nLast season (2024–2025), Real Madrid were leading La Liga by a seven-point margin, only to throw it away. This season, they were once again on top with a five-point lead, which they lost in a short period of time, allowing Barcelona to move ahead by four points. These are things we don't  forget.\n\nVinicius numbers this season also cannot be ignored. He has scored only five goals in 24 matches statistics that are not even acceptable for a mid-table team. In his last 14 matches, he has not scored a single goal and has provided only three assists. In 12 matches, he did not contribute either a goal or an assist. If mid-level teams would not accept such numbers, how can a club that aims to win major titles like La Liga and the UEFA Champions League accept them?\n\nVinicius reaction was not limited to showing frustration or expressing discomfort. He went further by changing his profile picture and replacing his Real Madrid image with one of himself representing Brazil. At that point, the issue shifted from a conflict with the fans to a problem with the club’s management.\n\nNow the Real Madrid board must ask itself: what exactly should Vinicius be forgiven for?\n\nFor his recurring issues with the coach?\n\nFor embarrassing the club on the biggest moment during El Clásico, portraying Real Madrid as a team lacking discipline and an administration unable to control its players?\n\nFor demanding the highest contract in the club’s history?\nOr for his unconvincing performances on the pitch?\n\nVinicius has exhausted his credit with everyone. If he does not take responsibility, reassess himself, and significantly improve his performances at the beginning of next year, the situation may go beyond the end of his career at Real Madrid. He could find himself unwanted even by Europe’s biggest clubs.",
        "upvotes": 94,
        "comments": 131,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ptss1r/vinícius_jr_and_the_whistles_when_frustration/"
    },
    {
        "id": "1ptfaxf",
        "author": "imwhoyouare",
        "title": "Hi Madrid fans! I made free 3d printable Real Madrid emblem for the wall!",
        "content": "Free link to print for yourself: \n\n[https://makerworld.com/en/@crankyp/upload](https://makerworld.com/en/@crankyp/upload)\n\nHala Madrid!",
        "upvotes": 700,
        "comments": 59,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zzat3vygiu8g1.jpeg?auto=webp&amp;s=ff6c6395d3ee1127daab03713d5a862a4d227031"
        },
        "permalink": "/r/realmadrid/comments/1ptfaxf/hi_madrid_fans_i_made_free_3d_printable_real/"
    },
    {
        "id": "1ptquem",
        "author": "Ineedhelpistaken",
        "title": "Is Rúben Neves a good signing for Real Madrid?",
        "content": "With Rúben Neves’ contract expiring and reports saying he could be available very cheaply, do you think he makes sense for Madrid?\n\nI know Real Madrid aren’t known for doing winter signings, but there are still January rumours floating around. Neves brings experience, leadership, long-shot ability, and tactical discipline, but he’s not exactly the typical “young Galáctico” profile Madrid usually targets.\n\nDo you think Madrid would actually move for him in January, or wait until summer?  \nAnd more importantly: would he improve the squad right now, or would he just be a short-term fix?\n\nCurious to hear your thoughts",
        "upvotes": 76,
        "comments": 104,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ptquem/is_rúben_neves_a_good_signing_for_real_madrid/"
    },
    {
        "id": "1pt0135",
        "author": "Scary-Procedure-6018",
        "title": "If it isn't for Mbappe's form this season, this man would've already won 25+ Motm awards.",
        "content": "Courtois has been in my top 5 of all time since that 18/19 - 21/22 period. Now he's just nowhere under top 1.\n\nFrom the golden glove at the 2018 wc, to the ucl final motm in 2022, to today. Undoubtedly the greatest of all time in my eyes. \nI've watched the likes of casillas, neuer, big boy timmy, buffon, peter cech, navas, de gea and many more.In my eyes, non of them top this man, and its pretty obvious atp. Consistently being the best gk itw for more than 6 years straight is NOT normal.\n\nAn absolute glitch in the system. If he retires and a statue of him isn't built infront of the bernabeu, this sh*t isn't right.",
        "upvotes": 2294,
        "comments": 113,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/f42iyyh0gr8g1.jpeg?auto=webp&amp;s=78b65ed8fc06695d44d5c2f8b1b4b3c5a9e2e117"
        },
        "permalink": "/r/realmadrid/comments/1pt0135/if_it_isnt_for_mbappes_form_this_season_this_man/"
    },
    {
        "id": "1pt7dap",
        "author": "albkiing",
        "title": "🚨 BREAKING: Endrick to Olympique Lyon, here we go!",
        "content": "Joins OL on loan, no buy option and 50% of salary covered. \nThe Brazilian will be back to Real in June.\n\nHonestly so happy for the kid. Going somewhere where he can show the world what he’s capable of.\nI think this is the correct decision to make after all, very little game-time under Xabi and this loan will definitely help him to come back stronger and prove his worth.",
        "upvotes": 884,
        "comments": 124,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pt7dap/breaking_endrick_to_olympique_lyon_here_we_go/"
    },
    {
        "id": "1ptfj2y",
        "author": "KjOnReddit1010",
        "title": "Real Madrid's $1 Billion Super Stadium Upgrade (Full Episode) | Megastructures | National Geographic",
        "content": "",
        "upvotes": 64,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6RGTCEwrLsUbvptIsWFgv94gCdEp1ZuNSK2v9XnFCuM.jpeg?auto=webp&amp;s=c69f26fc020237adb5e5a728b6a70158cb0d1e09"
        },
        "permalink": "/r/realmadrid/comments/1ptfj2y/real_madrids_1_billion_super_stadium_upgrade_full/"
    },
    {
        "id": "1ptmnok",
        "author": "Hisense_Sports1",
        "title": "Another record, Mbappé equals Henry with his 411th career goal.",
        "content": "Kylian Mbappé has scored the 411th goal of his career, equaling Thierry Henry and becoming the joint second-highest goalscorer in French football history.\n\nFrench all-time top scorers:  \nBenzema — 509  \nHenry — 411  \nMbappé — 411 (and still counting)\n\nAt this rate, it feels like it’s only a matter of time. Will he become the greatest player in France?",
        "upvotes": 18,
        "comments": 9,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ptmnok/another_record_mbappé_equals_henry_with_his_411th/"
    },
    {
        "id": "1psza9x",
        "author": "More-Judgment-9253",
        "title": "Jacobo Ramon vs Roma",
        "content": "Hopefully he returns at some point in the future, maybe not next season though because he should probably stay at como for 2 seasons.",
        "upvotes": 208,
        "comments": 22,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ady500zq8r8g1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1psza9x/jacobo_ramon_vs_roma/"
    },
    {
        "id": "1pswpr5",
        "author": "SaFari833",
        "title": "The memorabilia wall has grown since last time",
        "content": "I know some players are missing \n- ozil \n- Zidane \n- Roberto Carlos \n- Asensio \n- Carreras \n- robben \n- higuain \n\nDebating of adding \n- Mata \n- morata \n- hazard \n- sahin \n- chicharito \n- \n\nWe’re gonna add those as well just debating of if we move these up and add another row or add another row underneath the current ones ",
        "upvotes": 185,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/q4lrp8pakq8g1.jpeg?auto=webp&amp;s=38f0b7305968176b6ef245d9e527fa8015a32d14"
        },
        "permalink": "/r/realmadrid/comments/1pswpr5/the_memorabilia_wall_has_grown_since_last_time/"
    },
    {
        "id": "1psy4qj",
        "author": "muaazmuaaz123",
        "title": "A Question to real Madrid fans...",
        "content": "Hello madridstas, I wanted to ask the loyal fans that when did U guys experience a downfall last time? I support Chelsea and I have seen downfall many times in my lifetime as a Chelsea fan, the biggest one came in 2022/23 season where we finished Below 10th. That was pretty embarssing\n\nMan Utd is a perfect example of a top club facing downfall, they dominated in 90s, 20s and even early 2010s, but since fergie their downfall started and it's not stopping anytime soon\n\nReal Madrid are a top club and always have stayed there, I just wanted to know that when did real Madrid faced their worst downfall? And what are the reasons that real Madrid never face downfall and consistently have competed with top clubs?",
        "upvotes": 82,
        "comments": 112,
        "media": null,
        "permalink": "/r/realmadrid/comments/1psy4qj/a_question_to_real_madrid_fans/"
    },
    {
        "id": "1pska4x",
        "author": "asensia-kopfschmerz",
        "title": "MARCA reader votes: 61% blame the players, 76% back Xabi Alonso, 86% would sell Vinicius",
        "content": "X post by Sergio Valentin (Tier 2).\n\n[Original vote link](https://www.marca.com/futbol/real-madrid/2025/12/21/debate-sobre-real-madrid-culpables-futuro-xabi-alonso-vinicius-titulos.html).",
        "upvotes": 646,
        "comments": 194,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pska4x/marca_reader_votes_61_blame_the_players_76_back/"
    },
    {
        "id": "1psoz1z",
        "author": "Charybd1ss",
        "title": "Some people still do not realize how important and one of a kind Karim Benzema was",
        "content": "",
        "upvotes": 244,
        "comments": 103,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/htovk2l8ao8g1/CMAF_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1psoz1z/some_people_still_do_not_realize_how_important/"
    },
    {
        "id": "1psgmu9",
        "author": "Ready_Ad_1353",
        "title": "Brahmin Diaz opens the Score for Morocco at the African cup of Nations 2025",
        "content": "",
        "upvotes": 765,
        "comments": 23,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/kxnnxb1ddm8g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1psgmu9/brahmin_diaz_opens_the_score_for_morocco_at_the/"
    },
    {
        "id": "1ps1f9v",
        "author": "No-Independent2522",
        "title": "Cristiano Ronaldo responds to Mbappé's post via Instagram. ❤️",
        "content": "",
        "upvotes": 4881,
        "comments": 66,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/6by4yy5hmi8g1.jpeg?auto=webp&amp;s=ee41b13ce11219c2475bdb88864a1326e68cd177"
        },
        "permalink": "/r/realmadrid/comments/1ps1f9v/cristiano_ronaldo_responds_to_mbappés_post_via/"
    },
    {
        "id": "1psa2pc",
        "author": "TheConnstant",
        "title": "This is very weird &amp; has cost us matches Multiple times",
        "content": "",
        "upvotes": 657,
        "comments": 142,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/udusgpo80l8g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1psa2pc/this_is_very_weird_has_cost_us_matches_multiple/"
    }
]