[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1k71md4",
        "author": "nickbruckman",
        "title": "I’m Nicholas Bruckman — director of the new documentary on Netflix, MINTED: The Rise (and Fall?) of the NFT  — AMA on 4/28 @ 4pm ET!",
        "content": "What’s up r/netflix! I’m Nick, director of *MINTED*, now streaming on Netflix worldwide (well, North America, the UK, Australia/New Zealand, and Africa!)\n\nThe film is a front-row seat to the explosive rise of NFTs becoming a $40 billion digital gold rush, all the way through the market's dramatic crash. We spent years embedded in the digital art and crypto worlds, from NFT multimillionaires flipping JPEGs to the pioneering artists flipping the script on the traditional art market, plus the critics and journalists digging into the good, the bad, and bizarre of this new frontier.\n\nWhether you love or hate NFTs, I hope the film sparks some big questions about how art, tech, and finance are colliding. Beyond NFTs, it’s about pioneering artists trying to not just survive, but lead the way forward in how we use new technology as a society.\n\nWe premiered *Minted* at the Tribeca Film Festival, and its been a wild ride since. So whether you’re a collector, a skeptic, or just a fellow documentary nerd — AMA!\n\nproof: [https://www.instagram.com/p/DI12rZQz1BX](https://www.instagram.com/p/DI12rZQz1BX)\n\nnetflix: [https://www.netflix.com/title/81993558](https://www.netflix.com/title/81993558)",
        "upvotes": 17,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1k71md4/im_nicholas_bruckman_director_of_the_new/"
    },
    {
        "id": "1kevzk3",
        "author": "Purple-Suspect6214",
        "title": "YOU: i actually liked bronte",
        "content": "Honestly, I liked Bronte. I know that might be an unpopular opinion, but I really thought she was messy, in a way that felt real, you know? She wasn’t trying to be perfect, and I didn’t find her annoying like a lot of people did. I honestly don’t get why they felt that way. I always thought she was pretty smart, especially since she was a writer and all.\n\nWhen we found out she was catfishing Joe, I won’t lie, I thought that was a little out of place at first. But once it became clear that she actually cared about him, I started liking her again. What bothered me though was how she seemed to lose herself along the way. She started off strong but kind of got lost in the middle, which was a little disappointing.\n\nThat said, I still thought she was the kind of character who kept you curious, like you wanted to know more about her. She knew how to flirt, knew what to say in the right moments. Her dynamic with Joe, especially in the beginning when they first started getting closer, was really intriguing to me. I just wanted to see more of them together. Maybe that’s just me, though.",
        "upvotes": 30,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1kevzk3/you_i_actually_liked_bronte/"
    },
    {
        "id": "1kequkq",
        "author": "SeaChickenNugget",
        "title": "The Four Seasons observations",
        "content": "I found it a really easy, light hearted, comedy show about a group of friends. It's not my usual style but I thought it was refreshing and nice to see lots of cool actors in one show.\n\nIt all got a bit dark when Nick died, OMG? I wondered if Steve Carrell already said he wouldn't film any more seasons so they killed him off. What a turn! But I guess his character was a bit messy, an older man leaving his wife for a younger model, and Anne also confirmed in the show that he cheated on her. I didn't feel as though the cheating confirmation was taken seriously enough, and was swept under the rug by the group and not really acknowledged. Just me? \n\nIt was nice to see Steve brought some Michael Scott humour vibes to Nick, if you know you know!\n\nFinally, my favourite was Domingo Coleman, I thought he was so sassy and funny, my favourite little scene was when they were all taking a photo with Ginny, and the photos would sync to Anne's iPad so he told everyone to pose like they aren't having a good time. And he's the only one doing it! \n\nFinally, a shout out to Anne for dealing with so much and trying to not let her hurt feelings turn to hatred towards Ginny and also reminding her and Nicks daughter that Ginny was a person.\n\nSo will they make a new season?\n\n ",
        "upvotes": 46,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1kequkq/the_four_seasons_observations/"
    },
    {
        "id": "1kexqcw",
        "author": "Purple-Suspect6214",
        "title": "i’m about to start watching baby reindeer",
        "content": "i’ve heard much about it, would like to know you guys’ thoughts. \nis it TOO dark? is it worth it? i fear ill be too in my head after if its “too heavy”. \n",
        "upvotes": 15,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1kexqcw/im_about_to_start_watching_baby_reindeer/"
    },
    {
        "id": "1kezwfc",
        "author": "daveomen9217247",
        "title": "I have this weird situation, with Netflix, and not sure what to do about it.",
        "content": "I don't live with my ex-wife anymore. She has our son. I pay for the Netflix. I offered, and I am ok with it. So...it works just fine at their location. And mine, too. Without the extra home fee. Why? No idea. Yes, I visit   \nall the time, but I don't sign into Netflix on my phone. So who knows how.\n\nHere's the thing. \n\nI can watch it on my laptop.  But, no thanks. I DO have a smart TV. Ok, cool. No problem. I sign into netflix on the TV and.....it works for a little then tells me I am not the main home. Ok. fine. I guess. But then how can I watch it on my laptop. \n\nI have a better idea, Netflix. If youre letting me watch at my location, ditch the damn laptop and let me watch on the TV. \n\nHas ANYONE run into this? Or am I just lucky and unlucky at the same time? I COULD pay for an extra \"home\", just so I can watch it on my tv 10 feet in the other room, I guess haha ",
        "upvotes": 10,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1kezwfc/i_have_this_weird_situation_with_netflix_and_not/"
    },
    {
        "id": "1kez239",
        "author": "Purple-Suspect6214",
        "title": "i love when everyone is watching a show",
        "content": "i love when everyone’s watching the same show at the same time. like it happened with the queen’s gambit, and now it’s happening with season five of you. but like, i especially love it when everyone’s just talking about it nonstop, it’s my favorite thing. \nand before, i didn’t use to watch stuff when it came out, i’d be like “oh i’ll watch it later.” but now i’m realizing that watching things at the same time as everyone else is actually so fun.\n\nit’s really cool how netflix does that thing where they recommend shows to everyone, like the whole “top 10 in the world” ranking thing. it’s fun seeing what everyone’s watching and kinda feeling like you’re part of something.",
        "upvotes": 11,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kez239/i_love_when_everyone_is_watching_a_show/"
    },
    {
        "id": "1kevz19",
        "author": "Purple-Suspect6214",
        "title": "YOU: the ending + kate and brontë",
        "content": "I get that they made the ending like that to make it seem morally right, you know? To keep people happy, the ones who care about this whole thing of it being the “right” ending. But honestly, I think it should’ve ended with him either getting away and going somewhere else, kinda like an open ending, or just dying. Him going to prison didn’t really make sense to me. But whatever, I can let that go.\n\nWhat I can’t ignore though is how Kate and Bronte survived so unrealistically. There was just no way Kate could’ve made it. She was shot, hit in the head with a hammer, and left in a fire. And we never saw anyone getting out of the fire while Joe was proposing to Bronte. So how would she have survived all the smoke, all that damage? It just doesn’t add up.\n\nAnd Bronte too. Like yeah, Joe was probably panicking and all, but he’s not stupid. He’s killed plenty of people. He knows what dead looks like. There’s no way he saw her there, shot in the stomach, underwater for that long, and thought she was dead when she actually wasn’t. That just didn’t make any sense. It kinda ruined the ending for me, to be honest.",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kevz19/you_the_ending_kate_and_brontë/"
    },
    {
        "id": "1kf31jr",
        "author": "Scout1228",
        "title": "Dark. Should I continue?",
        "content": "I just started Season 2 and I have loved it so far! Loved it. Now though they’re in this post-apocalyptic stuff and I can’t stand it. I find it so monotonous and miserable. Should I continue?\nI don’t want to look ahead. \n",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1kf31jr/dark_should_i_continue/"
    },
    {
        "id": "1kezqm5",
        "author": "Purple-Suspect6214",
        "title": "YOU: i hated nadia",
        "content": "i don’t know why i have such a strong dislike for nadia. like, i should feel for her, considering everything she went through because of joe and kate. i should be rooting for her. but… she just irks me. she’s so unlikeable, i couldn’t really find many qualities that made her feel likable or relatable. i was glad she wasn’t the one to take joe down",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1kezqm5/you_i_hated_nadia/"
    },
    {
        "id": "1kew2ls",
        "author": "Purple-Suspect6214",
        "title": "YOU: i think the show did good with incorporating the new era into it",
        "content": "i think the show did a great job incorporating the new era we’re living in. it’s really hard to pull that off in a way that feels authentic, but this show did it really well. i’ve seen a lot of movies and shows come out in the last five years, and it’s like they don’t know when to stop with the slang and the over-the-top plots. when you watch an older show or movie, where there’s less focus on phones and slang, it just feels so good. and i was honestly feeling like something modern was missing, you know? something that would integrate technology in a way that makes it feel real for today’s world. but usually when they try to do that, they go overboard with the slangs, trying way too hard.\n\ni did see some people complaining about him mentioning “delulu” and a few other things like that, but it didn’t bother me. i thought it was totally fine. the jokes were well-placed, and i felt like they hit at the right moments. that’s one of the things i really liked about this season. it had been a while since i saw something done so well in that department. by the way, if you have any recommendations for shows that have a good plot and use slangs in the right way, especially newer ones, please let me know!",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kew2ls/you_i_think_the_show_did_good_with_incorporating/"
    },
    {
        "id": "1kf5a8u",
        "author": "JoshusTheGreat",
        "title": "Is this Kevin Heffernan from Super Troopers/Broken Lizard?",
        "content": "I was watching Oklahoma City Bombing: American Terror on Netflix. At roughly 0:21.20 mark a man is giving a speech about gun rights at a protest at the Lincoln Memorial after the Waco Siege ended. Does anybody know if this man is Kevin Heffernan of Super Troopers/Broken Lizard? He looks and sounds a lot like a younger version of him. I'm struggling to find much information about who gave speeches , but I know Kevin Heffernan was a lawyer, so it would make sense. Any help figuring this out would be appreciated!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kf5a8u/is_this_kevin_heffernan_from_super_troopersbroken/"
    },
    {
        "id": "1kevma3",
        "author": "Purple-Suspect6214",
        "title": "the residence: im on ep 4 and its boring me",
        "content": "is it just me or is this tv show really boring? \ni don’t find the jokes that funny, the show is silly, as if it were for kids. and its kinda repetitive…\nidk, maybe ill change my mind with time and more episodes.\ni really love other works from shonda but it seems i cant get past this one.\n what’s you guys’ opinion?",
        "upvotes": 2,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1kevma3/the_residence_im_on_ep_4_and_its_boring_me/"
    },
    {
        "id": "1keghs6",
        "author": "LawInside0",
        "title": "what should i watch on netflix?",
        "content": "i usually tend to just watch shows that are popular.\nshows i like are: orange is the new black, sex education, money heist, stranger things, anne with an e, you, the end of the fucking world, etc.\n\nand reality  tv shows like too hot to handle, love is blind, etc.",
        "upvotes": 17,
        "comments": 115,
        "media": null,
        "permalink": "/r/netflix/comments/1keghs6/what_should_i_watch_on_netflix/"
    },
    {
        "id": "1kezu7s",
        "author": "Dapper-Ebb-7370",
        "title": "I can't remember the name of a show.",
        "content": "It was an animated adult series about a guy imprisoned in a talking spaceship with a green blob and like the earth is destroyed and this guy meets an anthropomorphic cat that dies at the end of the first season but gets revived in the third, the cat also had a kid and there were a lot of characters",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kezu7s/i_cant_remember_the_name_of_a_show/"
    },
    {
        "id": "1keymvk",
        "author": "Pure-Candle-9543",
        "title": "Unknown Amazon Fire Stick  logged in",
        "content": "I just checked what devices are signed into my profile because I got a notice that I'm not the primary household member. I saw a device labeled as \"Amazon Fire Stick\" that signed in a month ago and hasn't been used since. But I do not have an Amazon Fire Stick and I have never shared my account with anyone. Just use it on laptop and phone. Why would someone log into my account and then not use it for a month?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1keymvk/unknown_amazon_fire_stick_logged_in/"
    },
    {
        "id": "1kexbdl",
        "author": "Either_Bag1820",
        "title": "They added The Rookie on Netflix!",
        "content": "I've been wanting to watch this for a while, but I recently ended my Disney subscription. Very excited to see what my friends have been talking about for the past few months!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kexbdl/they_added_the_rookie_on_netflix/"
    },
    {
        "id": "1kejp46",
        "author": "cloecherise",
        "title": "Trying to recall a series/movie",
        "content": "I’m trying to remember the title of a series or movie I watched. I remember that it starts with a young woman walking past a park at night and hearing someone scream — possibly a murder. She goes to check it out. Later, she becomes a suspect herself (i guess?). She had some kind of sexual relationship with a man who lives nearby, and he might be the killer. I remember that at some point she breaks into his apartment to investigate, but he comes home and she has to hide/escape. He lived in an attic apartment.\n\nMaybe someone knows it – thanks in advance!",
        "upvotes": 6,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1kejp46/trying_to_recall_a_seriesmovie/"
    },
    {
        "id": "1kex01n",
        "author": "TheRealTheSpinZone",
        "title": "Angi: Fake Life, True Crime",
        "content": "This documentary is supposedly on Netflix, there are reviews etc. I'm in the states fwiw and don't think it's blocked here since most of the reviews I've seen are from the US... But I can't find it??? Anyone else able to?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kex01n/angi_fake_life_true_crime/"
    },
    {
        "id": "1kf2pnd",
        "author": "EmptyPocketsXotics",
        "title": "Brooklyn 99: Rosa's motorcycle faux pas...",
        "content": "I'm sure this of no one's interest, but during most of the show, anytime they show Rosa Diaz on her motorcycle, it's a Yamaha R1. In S5E17, she is being setup on a blind date by Gina, and one of Rosa's refusals as to why it should happen is that the last time Gina tried to set her up with a date, the person \"showed up on a Yamaha, it may as well have been a van.\" Whoops. Guessing no one was consulted on anything regarding motorcycles in the show. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kf2pnd/brooklyn_99_rosas_motorcycle_faux_pas/"
    },
    {
        "id": "1keygqa",
        "author": "Purple-Suspect6214",
        "title": "YOU: season 5 sexual scenes",
        "content": "\nThis season, I feel like the whole love and sex dynamic was actually really well done. Like, seriously. Since we didn’t know everything that was going on with Bronte, those first scenes between her and Joe were super hot and really well done. I think they brought a lot of depth to their relationship. It was written in a way that made you really care about them and stay invested the whole time.\n\nI didn’t love the couple of course but the chemistry was really there. \n\nAnd honestly, I think the way they explored that side of the story was way better than in the other seasons. Like, in the first one, the sex scenes were so explicit that they were almost uncomfortable to watch, almost off-putting. But this season got it just right. It was intense and intimate without being over the top.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1keygqa/you_season_5_sexual_scenes/"
    },
    {
        "id": "1kex5ul",
        "author": "Creepy_Budget_9074",
        "title": "asked to update my household every few weeks even though i already have",
        "content": "we've had this netflix subscription for many years now, back when it wasn't limited to one household. since they've changed it, the household has been updated to my address (it was my grandmothers before) and i am the only person that uses it. this has happened multiple times but i'll be in the middle of watching something, get through a few episodes, and then get kicked out because \"your tv isn't part of the netflix household for this account.\" this happened just now and i'm beyond frustrated because i was on the last episode of a limited netflix series. since my grandma created this account years ago, it's still under her email. unfortunately, my grandma is traveling in another country right now so she's unable to fix it at the moment. is there something we can do to prevent this from happening again, and does anyone know why this is happening? the account is tied to my address so i don't understand why this is happening.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kex5ul/asked_to_update_my_household_every_few_weeks_even/"
    },
    {
        "id": "1kdrq65",
        "author": "TheExpressUS",
        "title": "Netflix's 3 most disturbing documentaries based on real-life tragedies",
        "content": "",
        "upvotes": 276,
        "comments": 68,
        "media": null,
        "permalink": "/r/netflix/comments/1kdrq65/netflixs_3_most_disturbing_documentaries_based_on/"
    },
    {
        "id": "1keqrj8",
        "author": "Voci_in_Voga",
        "title": "Lady Oscar su netflix, cosa ne pensate?io l'ho visto e sono rimasta così così...",
        "content": "[informazioni e recensione](https://vociinvoga.it/lady-oscar-su-netflix-un-flop-realizzato-magistralmente/)[Leggi differenza con manga e anime e mia recensione](https://vociinvoga.it/lady-oscar-su-netflix-un-flop-realizzato-magistralmente/)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1keqrj8/lady_oscar_su_netflix_cosa_ne_pensateio_lho_visto/"
    },
    {
        "id": "1keprru",
        "author": "indiewire",
        "title": "Best New Netflix Shows in May 2025",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1keprru/best_new_netflix_shows_in_may_2025/"
    },
    {
        "id": "1ke6wte",
        "author": "ConflictFluid5438",
        "title": "Bad influence - disposition",
        "content": "Edit: The title should have been “disappointed” \n\nJust finished watching the documentary and honestly, I’m really disappointed by how surface-level it was on some major issues. They say they’re sharing their story “so no other kids go through this,” but the whole thing was settled out of court for $1.8M and never really held anyone accountable. And even now, they still have their kids all over social media—then wonder how to protect them from “all those hate comments”\n\nWhat really got me was when they left the Squad and were mostly worried that their views were tanking. Like... that’s the concern? Not what the kids went through? And those scenes where the kids are sending messages to Pipper? “If she ever watch this” they looked super uncomfortable. You can totally tell it was staged. \n\nIt’s just upsetting how lightly the documentary touches on the real impact of putting kids in the spotlight like that and building a whole image around them. It’s honestly disturbing.\n\n",
        "upvotes": 15,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ke6wte/bad_influence_disposition/"
    },
    {
        "id": "1ke8zed",
        "author": "Senior_Molasses_3136",
        "title": "Who do you never want to see again in the reality programming.",
        "content": "Since Netflix insists on continually casting the same people (primarily influencers) over &amp; over again from one show to another. For example, Battle Camp and Perfect Match are comprised of individuals who have already been on at least one other Netflix show. So I am wondering who do you never want to see again &amp; why?",
        "upvotes": 7,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ke8zed/who_do_you_never_want_to_see_again_in_the_reality/"
    },
    {
        "id": "1kdts6b",
        "author": "newlife07_",
        "title": "Looking to be obsessed with a show again lol",
        "content": "Last show that got me obsessed was outlander. I was completely sucked into the universe when i discovered the show last year and rewatched it like 2 months after with a family member. I bought the books. I’m currently reading book one. I still watch part of the episodes often on netflix or listen to the show’s themes songs.\n\nI want to find another show that will leave me feeling as passionate and obsessed with it. I’m big on love stories but it’s okay if there isn’t one. Can someone recommend me a show?",
        "upvotes": 57,
        "comments": 78,
        "media": null,
        "permalink": "/r/netflix/comments/1kdts6b/looking_to_be_obsessed_with_a_show_again_lol/"
    },
    {
        "id": "1keps1s",
        "author": "BadKarma6996",
        "title": "Reinstalled Netflix on iOS and it automatically logged me back in! Is this normal?",
        "content": "Hey everyone,\n\nI had the Netflix app on my iPhone and uninstalled it about two days ago. Today, I decided to reinstall it, and to my surprise, it automatically logged me back into my account! I didn't have to enter my email or password at all.\n\nThis was unexpected because I *don't* use iCloud Keychain or any kind of password backup feature on my iPhone. I always manually enter my passwords for apps.\n\nSo, I'm really curious if this is a normal thing, especially since I'm not using the usual iOS password management tools. I figured uninstalling the app would completely remove all my login information from the device.\n\nHas anyone else experienced this, especially if you don't use iCloud Keychain? What could be causing this automatic login? Is it some other form of caching or device-level storage that persists even after an uninstall?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1keps1s/reinstalled_netflix_on_ios_and_it_automatically/"
    },
    {
        "id": "1ke81ro",
        "author": "Hom3dog117",
        "title": "Suitcase from Carry On?",
        "content": "My little brother loves the movie Carry On, and I tend to get props from movies/shows he's into for his birthday. \n\nDoes anyone know the suitcase they used in the movie? The ones I see on Amazon are close, but not the exact one.\n\nThank you!",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ke81ro/suitcase_from_carry_on/"
    },
    {
        "id": "1kewmia",
        "author": "Easy_Plant8013",
        "title": "Bad boy - islamophobia",
        "content": "recently watched the new Netflix series Bad Boy, and I was deeply disturbed by a scene in the first few minutes where a hijabi woman is immediately shown as a terrorist. This portrayal plays into harmful stereotypes and Islamophobic narratives, especially given how Muslim women are often unfairly depicted in the media.\n\nAs someone who cares about representation and the impact media can have on perceptions of minority groups, I wanted to bring attention to this issue. While the show may not intend to harm, this kind of content reinforces a dangerous narrative and can negatively affect how viewers perceive Muslim communities, particularly hijabi women.",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1kewmia/bad_boy_islamophobia/"
    },
    {
        "id": "1kdesan",
        "author": "haugs91",
        "title": "Santa Clarita Diet - Please",
        "content": "Next to Mindhunter, this has gotta be the biggest tragedy of a canceled series that should’ve continued. \n\nEverything about this show is comedically amazing and I wish it would get rebooted haha. Thoughts?! ",
        "upvotes": 188,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1kdesan/santa_clarita_diet_please/"
    }
]