[
    {
        "id": "1k1ccsy",
        "author": "WeddingBanquetAMA",
        "title": "Hey /r/movies! We're Andrew Ahn, co-writer/director of THE WEDDING BANQUET &amp; co-writer/producer James Schamus. Andrew also directed FIRE ISLAND and James co-wrote the original with Ang Lee. THE WEDDING BANQUET stars Bowen Yang, Lily Gladstone, Kelly Marie Tran, and Han Gi-chan. Ask us anything!",
        "content": "We will be back today Wednesday 4/17 at 3:00 PM ET to answer your questions.\n\nWe are Andrew Ahn (co-writer/director) and James Schamus (co-writer/producer) of THE WEDDING BANQUET— a deeply personal, sharply funny, and emotionally rich reimagining of Ang Lee’s beloved 1993 classic.\n\nHere is the trailer:\n\n[https://www.youtube.com/watch?v=kWy\\_IzW04YM](https://www.youtube.com/watch?v=kWy_IzW04YM)\n\nTogether, we bring decades of filmmaking experience to the table! James is an Oscar-nominated screenwriter and producer behind films like Crouching Tiger, Hidden Dragon, Brokeback Mountain, The Ice Storm, and the original version of The Wedding Banquet. Andrew is a Sundance-winning director whose work like Spa Night, Driveways, and Fire Island explores identity, intimacy, and family, both those we’re born with and those we choose for ourselves, with heart and nuance.\n\nThis new version of The Wedding Banquet reflects the world we live in now — from universal, evolving ideas of family and tradition, to the complexities of queer Asian American identity. We’ve poured our hearts into this project, and we’re thrilled to share it with you!\n\nWant to know about the making of this film, what it means to update a classic, or how two storytellers came together to collaborate? Ask us anything.\n\nOur credits:\n\nAndrew Ahn – Director/Co-Writer - [https://www.imdb.com/name/nm3821224/](https://www.imdb.com/name/nm3821224/)\n\nJames Schamus – Producer/Co-Writer - [https://www.imdb.com/name/nm0770005/](https://www.imdb.com/name/nm0770005/)",
        "upvotes": 80,
        "comments": 71,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/iu0rumhe9eve1.png?auto=webp&amp;s=0073f7e0539647124563d070849eae85069f6caf"
        },
        "permalink": "/r/movies/comments/1k1ccsy/hey_rmovies_were_andrew_ahn_cowriterdirector_of/"
    },
    {
        "id": "1jxy5se",
        "author": "BunyipPouch",
        "title": "Official Discussion Megathread (Warfare, Drop, The Amateur, Freaky Tales) + 25th Anniversary Discussions (Ready to Rumble, Return To Me, Rules of Engagement)",
        "content": "**New Theatrical Releases**\n\n[Warfare ](https://www.reddit.com/r/movies/comments/1jwev1e/official_discussion_warfare_spoilers/)\n\n[Drop](https://www.reddit.com/r/movies/comments/1jwevax/official_discussion_drop_spoilers/)\n\n[The Amateur](https://www.reddit.com/r/movies/comments/1jwev63/official_discussion_the_amateur_spoilers/)\n\n[Freaky Tales](https://www.reddit.com/r/movies/comments/1jwevev/official_discussion_freaky_tales_spoilers/)\n\n**25th Anniversary Throwback Discussion Threads**\n\n[Ready to Rumble](https://www.reddit.com/r/movies/comments/1jwewks/official_throwback_discussion_ready_to_rumble/)\n\n[Return to Me](https://www.reddit.com/r/movies/comments/1jwewhk/official_throwback_discussion_return_to_me/)\n\n[Rules of Engagement](https://www.reddit.com/r/movies/comments/1jwewf2/official_throwback_discussion_rules_of_engagement/)",
        "upvotes": 29,
        "comments": 11,
        "media": null,
        "permalink": "/r/movies/comments/1jxy5se/official_discussion_megathread_warfare_drop_the/"
    },
    {
        "id": "1k1lqnf",
        "author": "okdov",
        "title": "Fatima Hassouna and 9 of her family members murdered 24 hours after film accepted in Cannes Festival",
        "content": "",
        "upvotes": 35289,
        "comments": 364,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zvyHQbdguBTp7Jd5yuvsNiXN5stacaWraQG6Wr3GGJY.jpg?auto=webp&amp;s=3497d8ee1e1eacc77d8b4e689e80f55624f9c06d"
        },
        "permalink": "/r/movies/comments/1k1lqnf/fatima_hassouna_and_9_of_her_family_members/"
    },
    {
        "id": "1k1ding",
        "author": "MarvelsGrantMan136",
        "title": "The Fantastic Four: First Steps | Official Trailer | Only in Theaters July 25",
        "content": "",
        "upvotes": 8029,
        "comments": 2346,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QrAcZAVcWQfputGzaHHIk4lP7sELI9iIeQCGYP1Sr9s.jpg?auto=webp&amp;s=a44c1e99bc3f135c78ae55a68f305860cb830f1d"
        },
        "permalink": "/r/movies/comments/1k1ding/the_fantastic_four_first_steps_official_trailer/"
    },
    {
        "id": "1k1dmzk",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'The Fantastic Four: First Steps'",
        "content": "",
        "upvotes": 3652,
        "comments": 575,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zwknf60rjeve1.jpeg?auto=webp&amp;s=d94d6559326d42b920c7ca8765d6bce75481039a"
        },
        "permalink": "/r/movies/comments/1k1dmzk/new_poster_for_the_fantastic_four_first_steps/"
    },
    {
        "id": "1k1gdf2",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'Ballerina' Starring Ana de Armas",
        "content": "",
        "upvotes": 1676,
        "comments": 253,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ps7z0mva4fve1.jpeg?auto=webp&amp;s=04f4cfe7c6db7cb30cbe0f27e4e7223b5715010d"
        },
        "permalink": "/r/movies/comments/1k1gdf2/new_poster_for_ballerina_starring_ana_de_armas/"
    },
    {
        "id": "1k1nlkv",
        "author": "MarvelsGrantMan136",
        "title": "Amazon, UA, Scott Stuber In Final Negotiations To Land ‘Highlander’ Rights; Henry Cavill To Star With Chad Stahelski Directing",
        "content": "",
        "upvotes": 364,
        "comments": 88,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/70lBIuOmlEU6UlpWsGxiSAlisOBrSqMUxnXCGdkefhI.jpg?auto=webp&amp;s=2bced18f49f0119c3a6f8a074c5d616511811350"
        },
        "permalink": "/r/movies/comments/1k1nlkv/amazon_ua_scott_stuber_in_final_negotiations_to/"
    },
    {
        "id": "1k1mx6u",
        "author": "CinephileCrystal",
        "title": "Hayao Miyazaki's \"Porco Rosso\" (1992) comes off as the silliest of Miyazaki's films, a flying pig, yet it ended up being among his saddest, thought-provoking movies",
        "content": "Especially when the film explains to us why Rosso is a Pig, it adds a layer of emotional pathos to the movie that I wasn't expecting. \n\nI would most definitely put Porco Rosso among Miyazaki's more dramatic, serious films, even though it starts out on a lighter, adventurous note with a pilot pig but with a dark past. \n\nI also liked Rosso's relationship with his female sidekick, Fio. A spunky, young girl whom Rosso takes under his wing and she tries to understand who he is. Miyazaki always had a great knack for female protagonists.\n\nAnd this movie has my favorite Joe Hisaishi original score for a Miyazaki movie. For years, I've been trying to find the piece which scores the flashback scene of young Rosso flying with young Gina. I've never found it. If you know the title, please tell me. I'd be grateful.",
        "upvotes": 382,
        "comments": 34,
        "media": null,
        "permalink": "/r/movies/comments/1k1mx6u/hayao_miyazakis_porco_rosso_1992_comes_off_as_the/"
    },
    {
        "id": "1k16luz",
        "author": "RobotiSC",
        "title": "28 YEARS LATER - New Trailer",
        "content": "",
        "upvotes": 4244,
        "comments": 802,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HCzZUWz48wMJZW_NxAkY7TyPe9Cz--BiwMQmay-yKg0.jpg?auto=webp&amp;s=42387ab54a63e021334aae7a213b32c4a13d0cc7"
        },
        "permalink": "/r/movies/comments/1k16luz/28_years_later_new_trailer/"
    },
    {
        "id": "1k1kr8g",
        "author": "NoCulture3505",
        "title": "Glen Powell &amp; Judd Apatow Teaming On Comedy Movie At Universal",
        "content": "",
        "upvotes": 231,
        "comments": 72,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_NE_cSmqz_mOfj-F_tI5CwG3rBDo5GMBX2pP95aOH_Y.jpg?auto=webp&amp;s=04c9430d5bdf91a757668eeb40c42921b7a64fed"
        },
        "permalink": "/r/movies/comments/1k1kr8g/glen_powell_judd_apatow_teaming_on_comedy_movie/"
    },
    {
        "id": "1k1rohc",
        "author": "ninman5",
        "title": "What's the most historically accurate film ever made ?",
        "content": "My pick is Apollo 13.  It gets most of the major details correct, including Jim Lovell's wife dropping her wedding ring down the shower drain.  There's only a few areas where it's not totally accurate, like the level of panic in the space craft, the argument where Fred Haise appears to blame Swaigert for the accident (somethingthat never happened) and how they solved a lot of the problems.   In general though, it's pretty close to the real events.",
        "upvotes": 81,
        "comments": 187,
        "media": null,
        "permalink": "/r/movies/comments/1k1rohc/whats_the_most_historically_accurate_film_ever/"
    },
    {
        "id": "1k0vek0",
        "author": "MarvelsGrantMan136",
        "title": "Michelle Trachtenberg Cause Of Death Revealed - Died naturally as a result of complications from diabetes mellitus",
        "content": "",
        "upvotes": 18317,
        "comments": 886,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mFyqj6kDpecDmsSfLH9UgadPm9qhE7wFH_LetvyERXs.jpg?auto=webp&amp;s=31f53fcc0b18e4813df6f6fbf57adda0085255a6"
        },
        "permalink": "/r/movies/comments/1k0vek0/michelle_trachtenberg_cause_of_death_revealed/"
    },
    {
        "id": "1k1t6bh",
        "author": "MarvelsGrantMan136",
        "title": "Shawn Levy's 'Star Wars' Movie, Starring Ryan Gosling, is Titled 'Star Wars: Starfighter' (Releases May 28, 2027)",
        "content": "",
        "upvotes": 60,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qvXL7rhcfC65p9Pwx--X0VvarP6Hxp4qBM4m7mpqfJ0.jpg?auto=webp&amp;s=d59d3e0b097de9e118a137bb325b3a4fef4b7b0c"
        },
        "permalink": "/r/movies/comments/1k1t6bh/shawn_levys_star_wars_movie_starring_ryan_gosling/"
    },
    {
        "id": "1k0w795",
        "author": "MarvelsGrantMan136",
        "title": "Mikey Madison Turns Down Offer to Star in Shawn Levy’s ‘Star Wars’ Movie With Ryan Gosling",
        "content": "",
        "upvotes": 8655,
        "comments": 1508,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IMffIoPSOYVr-nrFYnIw2z-EIV2jHs-5ESHl7wiZAhk.jpg?auto=webp&amp;s=080eebec0eaf18c9e63e4171e186340f98487996"
        },
        "permalink": "/r/movies/comments/1k0w795/mikey_madison_turns_down_offer_to_star_in_shawn/"
    },
    {
        "id": "1k1ms6h",
        "author": "indiewire",
        "title": "Willem Dafoe Had to Ignore Gene Hackman’s Advice About First-Time Directors to Make ‘The Legend of Ochi’ (Interview)",
        "content": "",
        "upvotes": 102,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_LdN25--J1Q6BJCQogvDHirTSy0Y18nDNSiVmdyLH24.jpg?auto=webp&amp;s=1978431342046ad0f955ecf49d2a4d7d761498e0"
        },
        "permalink": "/r/movies/comments/1k1ms6h/willem_dafoe_had_to_ignore_gene_hackmans_advice/"
    },
    {
        "id": "1k1l6n3",
        "author": "AmigoDelDiabla",
        "title": "What's your favorite genuine scream of terror in a movie?",
        "content": "Discussion on another thread resulted in me clicking through clips of T2: Judgement Day.  I've always thought Sarah Connor's scream when she saw the T800 coming out of the elevator at the mental hospital was so well done.  This thing has consumed her for years, resulting in her involuntary confinement.  It represents not only a singular threat to her, but an existential threat to humanity, and she sees it face to face.  Linda Hamilton did it perfectly.\n\nWhat's yours?",
        "upvotes": 119,
        "comments": 109,
        "media": null,
        "permalink": "/r/movies/comments/1k1l6n3/whats_your_favorite_genuine_scream_of_terror_in_a/"
    },
    {
        "id": "1k19giz",
        "author": "moal09",
        "title": "Wasn't the biggest fan of The Whale, but I'm shocked at the number of people who don't seem to understand Charlie's character at all",
        "content": "So many people hate him because they say it was selfish for him to eat himself to death with his daughter back in his life, and if he really loved her, he would try to get better.\n\nBut the point of the movie isn't to be some big redemption story for Charlie.  He binge eats because he's essentially given up on himself due to a combination of guilt and self loathing.  He abandoned his family and failed his lover.  Every day he's alive reminds him of what a piece of shit he feels he is.  When you're that deep in the hole, it's not so easy to just pick yourself up and try to get better.  You don't feel like you deserve it.  In his mind, he deserves to die, and the only thing about him that's worth giving to his daughter is his money.\n\nSo he saves money for his daughter as a way for him to justify his continued existence, and he doesn't really believe he deserves to be part of her life, so he keeps his distance.\n\nWhen he finally does contact her, I don't think it's really a rational decision.  He still feels like he doesn't deserve to be in her life, but he knows he's dying, and he can't stomach the idea of leaving the world without having some kind of relationship with her, so he ends up kind of sheepishly trying to re-insert himself into her life to some degree.  I don't think he ever tries to squeeze forgiveness out of her.  He just doesn't want to go to his grave knowing she hates him and that he didn't try to do something right for her before the end.\n\nIt's a lot of conflicting emotions and decision-making from a highly flawed human being who doesn't really want to live anymore, but is still trying to \"something\" right with the time he's got left.  Him giving his daughter the money doesn't make up for what he took from her, and that's not really what he's trying to do anyway.  It's all he's really capable of giving her at this point, and he doesn't want to die knowing he did nothing for her at all.\n\nPeople saying that he should've just stopped eating clearly don't understand why he's eating.  It's not because he loves food.  It's because he hates himself.  He doesn't feel like he deserves to live, but he's also still afraid of death.  The base human instinct to continue living is extremely strong.  Anyone who's been severely depressed and suicidal but still can't stop themselves for going about their daily routine can tell you that.  So he eats to numb the pain, and once he realizes it's killing him, he sees it as a just punishment for his failings as a person and allows it to continue happening.\n\nI can understand not empathizing that much with Charlie to some degree, but the people who see his refusal to get well as actively malicious and selfish on his part don't really understand what it's like to be truly depressed to that degree.  You might as well be telling a suicidal person to just \"suck it up\" or a depressed person to just \"stop being depressed\".  When you're that deep in the hole, it's nearly impossible to pull yourself out because you've already resigned yourself to death and also to the idea that you're not worth saving, and everyone would be better off with you gone.\n\nSame thing with him hiding his money from the caretaker.  He wasn't consciously doing it to make her life harder.  He was doing it because he felt he didn't deserve to get better, and he knew if he'd told her, she wouldn't have understood because who would willingly watch someone kill themselves like that.\n\nI think it was realistic how frustrated people became with him, but also a little grating at times that no one seemed to be able to comprehend why a mentally ill person would make irrational, self destructive decisions.\n\nHe's not a hero, and he's not a villain.  He's a guy who made an incredibly selfish, impulsive decision, caused a lot of suffering as a result, and then paid for it with his happiness and his life.  When we meet him, that person is long dead, and he's a shell of the man who did those things.  I don't think the film is trying to absolve Charlie of his past wrongdoings.  It's just painting a picture of an unfortunate situation that people often find themselves in in the real world.  There aren't always happy endings or meaningful lessons to learn.",
        "upvotes": 591,
        "comments": 59,
        "media": null,
        "permalink": "/r/movies/comments/1k19giz/wasnt_the_biggest_fan_of_the_whale_but_im_shocked/"
    },
    {
        "id": "1k1haej",
        "author": "Rameko",
        "title": "Best Non action scene, in an action movie?",
        "content": "A lot of people have asked what is the best action sequence in a non action movie, but on flip side, What is the best non action scene that takes place in an action movie? \n\nThinking something along the lines of Baby Jaga scene in John Wick or when Agent Smith has Morpheus prisoner and makes the speech to him. ",
        "upvotes": 158,
        "comments": 490,
        "media": null,
        "permalink": "/r/movies/comments/1k1haej/best_non_action_scene_in_an_action_movie/"
    },
    {
        "id": "1k1bkvk",
        "author": "FilmWaffle-FilmForum",
        "title": "What movie character is the best driver?",
        "content": "I recently watched Ronin for the first time a couple weeks ago and whilst the movie itself isn’t anything groundbreaking, the car chases are some of the best I’ve seen. Literally every character (mainly Sam) can travel at crazy high speeds without crashing. \n\nWhat movie character sticks out to you in terms of driving skills? ",
        "upvotes": 204,
        "comments": 662,
        "media": null,
        "permalink": "/r/movies/comments/1k1bkvk/what_movie_character_is_the_best_driver/"
    },
    {
        "id": "1k19h47",
        "author": "chocolate_buzz",
        "title": "What is the perfect casting choice that never happened?",
        "content": "I honestly cant believe that there is no movie in which Andy Garcia plays young Count Dracula.\n\nOr where Andy Garcia and Mark Strong play brothers.\n\nAnother one that i would love to see (possibly never going to happen) is Adam Driver as Captain Yossarian from Catch 22. I think he would be perfect in this impending doom, sudden eruptions and surrounding absurdity scenario.\n\nYour ideas? ",
        "upvotes": 287,
        "comments": 702,
        "media": null,
        "permalink": "/r/movies/comments/1k19h47/what_is_the_perfect_casting_choice_that_never/"
    },
    {
        "id": "1k1lu4u",
        "author": "indiewire",
        "title": "Ryan Coogler on the Origins of ‘Sinners,’ His Uncle James, and Why the Film Is His Most Personal (Interview)",
        "content": "",
        "upvotes": 31,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/k86L4xni7rNq-5BCFmTjr5fkXT7qbOckbs7w5jVWuRw.jpg?auto=webp&amp;s=0f1c36f3283a720ee81d6f88b6ae99ed1c3b59dc"
        },
        "permalink": "/r/movies/comments/1k1lu4u/ryan_coogler_on_the_origins_of_sinners_his_uncle/"
    },
    {
        "id": "1k0sjvk",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for Thunderbolts*",
        "content": "",
        "upvotes": 2976,
        "comments": 440,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/6axiyudaw8ve1.jpeg?auto=webp&amp;s=ea621ece13c6676487b706534862193b6b9c474d"
        },
        "permalink": "/r/movies/comments/1k0sjvk/new_poster_for_thunderbolts/"
    },
    {
        "id": "1k0gd20",
        "author": "Sisiwakanamaru",
        "title": "'Snow White' Banned in Lebanon Due to Gal Gadot's Presence in Film",
        "content": "",
        "upvotes": 36439,
        "comments": 2885,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BTMkEAjsum6SS9NbJb7Da6cAjoCcceNGmyT0PFkcmvE.jpg?auto=webp&amp;s=9ff38a8fcba8b805b4342b8bc28c4f2dd9ecfeb7"
        },
        "permalink": "/r/movies/comments/1k0gd20/snow_white_banned_in_lebanon_due_to_gal_gadots/"
    },
    {
        "id": "1k10qe9",
        "author": "indiewire",
        "title": "The 10 Best Anti-Fascist Films of All-Time, from ‘The Great Dictator ‘ to ‘The Zone of Interest’",
        "content": "",
        "upvotes": 681,
        "comments": 87,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WE7mwlVoFu_5Y9YMfhizTw1iQAYMtyX3zFiQFYspI_8.jpg?auto=webp&amp;s=bc00c20ca5607bce2c6b59ae9bf8250305f1069b"
        },
        "permalink": "/r/movies/comments/1k10qe9/the_10_best_antifascist_films_of_alltime_from_the/"
    },
    {
        "id": "1k1ajwz",
        "author": "SumWhanNew",
        "title": "The Salute of the Jugger 4K",
        "content": "Finally a 4K WIDESCREEN (1.85:1) remaster of this lost classic (with 3x edits) with a brand new color grade. This is EPIC! If you’ve never seen it, seek this one out! Starring Joan Chen, Rutgers Hauer, Delroy Lindo, Vincent D’Onofrio, Ghandi MacIntyre, Justin Monjo, Max Fairchild, Hugh Keys-Byrne. The Salute of the Jugger (aka: The Blood of Heroes). ",
        "upvotes": 60,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TtIA8388EilmE5jwB93-xcTNTedlFrtYkszyM0vIR7k.jpg?auto=webp&amp;s=32820b0c93232ad3c13d6e871c3fda2cbec3bcd5"
        },
        "permalink": "/r/movies/comments/1k1ajwz/the_salute_of_the_jugger_4k/"
    },
    {
        "id": "1k1i3c3",
        "author": "Kyunseo",
        "title": "Korean Star Don Lee's English-Language Action Film 'Pig Village' Reveals Key Cast (Exclusive)",
        "content": "",
        "upvotes": 18,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zKIzGhjzoZMnoYnEUxnkwcpqAd0b4aasP_KLRTTT-uU.jpg?auto=webp&amp;s=8b507e68301bae4d43c9828fa61e4173b8f3e094"
        },
        "permalink": "/r/movies/comments/1k1i3c3/korean_star_don_lees_englishlanguage_action_film/"
    },
    {
        "id": "1k0lwzq",
        "author": "MarvelsGrantMan136",
        "title": "First Image from Genndy Tartakovsky’s R-Rated Animated Dog Comedy ‘Fixed’",
        "content": "",
        "upvotes": 1855,
        "comments": 191,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/srz9fpasj7ve1.jpeg?auto=webp&amp;s=c1e0b1d9a3519c4345a0470413bb692d107ffb66"
        },
        "permalink": "/r/movies/comments/1k0lwzq/first_image_from_genndy_tartakovskys_rrated/"
    },
    {
        "id": "1k0kgzu",
        "author": "indiewire",
        "title": "'Aftersun' Star Frankie Corio Had Almost No Idea the Movie Was Supposed to Be Sad",
        "content": "",
        "upvotes": 1986,
        "comments": 99,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/CQkwxxPEV6PQCgOaSBzdTRdAebbPlq6_llHHotdS1Tg.jpg?auto=webp&amp;s=f171f5529a0b1b8f66e29344d27703c5bf18a1de"
        },
        "permalink": "/r/movies/comments/1k0kgzu/aftersun_star_frankie_corio_had_almost_no_idea/"
    },
    {
        "id": "1k158t9",
        "author": "avgDrStonelover",
        "title": "Recommend me a movie that’ll leave me thinking about it for weeks",
        "content": "I'm in the mood for something that *sticks*. You know those movies where the credits roll and you're just sitting there like... \"what the fuck did I just watch?\" And then you're thinking about it for the next few days, replaying scenes in your head, overanalyzing everything, maybe even questioning everything....\n\nGenre doesn't really matter psychological thrillers, mystery thrillers, dramas, mind-benders,  deeply emotional stories, even comedies are all welcome. I just want something that leaves a mark.\n\nsome movies that did this to me: Fightclu....(uhh sorry I can't talk about it, rule- 1 and 2) , Interstellar, The Theory Of Everything, se7en, the Martian, prisoners, shutters island, grave of the fireflies....\n\nThanks!!!",
        "upvotes": 86,
        "comments": 455,
        "media": null,
        "permalink": "/r/movies/comments/1k158t9/recommend_me_a_movie_thatll_leave_me_thinking/"
    },
    {
        "id": "1k0nfel",
        "author": "chrisarrant",
        "title": "John Hughes made a four-hour raw cut of The Breakfast Club, and the cast have seen it (but Emilio Estevez calls it “unreleaseable”)",
        "content": "",
        "upvotes": 1025,
        "comments": 114,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MZEPmRGp3BPvewZLucfpYORvQYALC16nl4WG5h5G2Yk.jpg?auto=webp&amp;s=1ad55329215f07cd25ba220c8a32237821661fd0"
        },
        "permalink": "/r/movies/comments/1k0nfel/john_hughes_made_a_fourhour_raw_cut_of_the/"
    },
    {
        "id": "1k0l1og",
        "author": "IndependenceOk5643",
        "title": "Recommend me a film that’ll haunt me long after it ends—any genre welcome",
        "content": "I'm looking for some powerful movie recommendations—films that are so emotionally intense or thought-provoking that they leave me staring blankly at the wall afterward, completely consumed by what I just watched. \n\nI've been scrolling through Netflix for days now, but nothing seems to stand out or feel worth my time. I’m open to any genre—drama, thriller, sci-fi, psychological, you name it—as long as it leaves a lasting impact. Please include the movie title and let me know where I can stream it. I'm ready for something that hits hard and stays with me.",
        "upvotes": 1223,
        "comments": 2872,
        "media": null,
        "permalink": "/r/movies/comments/1k0l1og/recommend_me_a_film_thatll_haunt_me_long_after_it/"
    },
    {
        "id": "1k1h1ho",
        "author": "addynap",
        "title": "Cowboy blowing smoke from barrel trope",
        "content": "Someone told me I won’t be able to find a video of Clint Eastwood or John Wayne doing the classic sharpshooter bit and they’ve been right but it sorta sparked the question of what movie popularized the now famous trope. I could see being something popularized in the 80s or 90s if it made sense for the guns of the time but I feel like it had to have started earlier.",
        "upvotes": 8,
        "comments": 19,
        "media": null,
        "permalink": "/r/movies/comments/1k1h1ho/cowboy_blowing_smoke_from_barrel_trope/"
    }
]