[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 37,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 12,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1q2eo56",
        "author": "zekevich",
        "title": "Netflix's \"second screen\" writing ideology doesn't give me hope for Netflix's future releases.",
        "content": "Them basically writing shows to \"accommodate\" for the idea that people are probably going to be scrolling on their phones while watching them, so they simplify and dumb down their shows so people can still understand what's going on while paying attention to something else. [x](https://medium.com/enrique-dans/second-screen-viewing-netflix-succumbs-to-the-dictatorship-of-the-smartphone-6b639c829fec)\n\nand quite frankly, I think this is a horrible idea. one that's going to do more harm than good. we should ***not*** be dumbing down media and art as a whole *just because* some people *might* not happen to be paying full attention.\n\nand Stranger Things 5 was a clear example of this. a good majority of the dialogue was overexplainy, exposition dumpy, unnatural and held your hand and basically treated you like you were stupid.\n\nand if THIS is any indicator of how netflix is about to write their shows in 2026 and onward? respectfully count me out, because..... 😬",
        "upvotes": 696,
        "comments": 67,
        "media": null,
        "permalink": "/r/netflix/comments/1q2eo56/netflixs_second_screen_writing_ideology_doesnt/"
    },
    {
        "id": "1q2squl",
        "author": "Sylverpepper",
        "title": "Stranger Things is quite something !",
        "content": "I just rewatched ALL of Stranger Things to be ready for season 5, and honestly, I loved it all over again. This series is really special and so amazing! I understand why it's so successful. I think it's meant to be watched back-to-back without waiting two years between seasons. It's not the same! And during season 5, I really felt something. It's off to a great start!\n\nIn any case, I've rarely seen people satisfied with the ending of a popular masterpiece. Whether it's a series or an anime, people are always disappointed with the ending. It's not easy to conclude a long adventure and satisfy everyone.",
        "upvotes": 14,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1q2squl/stranger_things_is_quite_something/"
    },
    {
        "id": "1q2m94q",
        "author": "Known_Broccoli_4274",
        "title": "Give netflix some credit",
        "content": "People moan a lot about Netflix, saying it's poor content but I have to say, I don't agree. I get we all like different things and genres but Netflix has some incredible originals they've made: virgin river, Ransom Canyon, Leanne, you. I think it's still worth money and getting the ad free for a few extra pounds definitely enhances user experience\nThe only negative I have is that they've got rid of friends &amp; the big bang theory...not many own a dvd player anymore and Netflix was the only platform that showed these series without having to purchase each individual season etc. Just my opinion 🩷",
        "upvotes": 26,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1q2m94q/give_netflix_some_credit/"
    },
    {
        "id": "1q2clxr",
        "author": "Vegetable_Engine_463",
        "title": "Anyone watched Members Only: Palm Beach? Is this really how wealthy Americans look and behave?",
        "content": "I watched Members Only: Palm Beach and the whole time I had a very odd feeling, like something was off. Visually everything checks out: luxury cars, massive mansions, yachts, ocean views, etc.\n\nAt the same time, the people in the show feel strange. The outfits look cringe and overloaded, kinda Chinese market-style. The overall vibe comes off as kitschy. In Europe this aesthetic disappeared a long time ago. In Italy if someone dressed like this showed up at a high-end event here, the reaction would be… complicated. Real wealth here usually shows through restraint, quality, and taste. Loud luxury feels outdated by decades.\n\nBecause of that, the show feels staged. Expensive scenery, dramatic behavior, exaggerated styling.\n\nAmericans, is this an accurate reflection of how wealthy elites in the US actually look and behave, especially in places like Palm Beach? Or is this more of a dressed-up TV version made for drama?",
        "upvotes": 70,
        "comments": 66,
        "media": null,
        "permalink": "/r/netflix/comments/1q2clxr/anyone_watched_members_only_palm_beach_is_this/"
    },
    {
        "id": "1q2yc05",
        "author": "Dapper_Telephone_117",
        "title": "What the hell is Emily in Paris?",
        "content": "I’m just here to hate for a second and just see what everyone thinks. I’ve never really watched Emily in Paris, so I do not have in depth analysis nor do I know the correct terms for screenwriting or cinematography techniques. Anyways, my family has been watching the latest season during the holidays so I’ve seen a few clips here and there and just sat down to watch a full episode with my mom \n\nThe first thing I noticed is that this show is like in ultra HD. Everything is so detailed and at the same time layered in a thick coat of matte that it literally hurts my eyes. The world is just too spotless and it’s uncanny to watch. \n\nWhy does the world seem to exclusively revolve around Emily? Almost every scene is structured in a way that seems like the other characters only react when Emily walks in or does something. It gave me the feeling of playing a video game and getting a dialogue prompt. Also, multiple times in the episode Emily would effortlessly just resolve issues or make the correct decision and everything just works out for her (minus the main drama with her best friend sleeping with the guy I assume is her ex). Is no one else capable of having a good idea or an original thought? \n\nThe writing and staging is just horrendous. Every scene is like 30 seconds long because the characters just say what needs to be said in order to continue dragging the decaying corpse the show calls a plot. In the last scene of this episode Emily is firing this intern or whatever (because her boss can’t?) and this girl rebuttals by telling her that her best friend and possibly ex are sleeping together and that everyone knows except her. Meanwhile Julian is unnaturally standing in the background just looking at this conversation unfold. He only reacts once Emily looks at him and his response is literally to ignore the betrayal on Emily’s face and to escort the intern out of the building because Mindy is queued in for the ‘big reveal’. Mindy literally just walks in while Emily is visibly distraught and just starts talking… 😒😒😒\n\nWhy are these characters so one dimensional? Why is the dialogue so stale? Why does Emily feel so unnatural? How on earth did this show get popular enough to warrant a (fifth?) season? \n\nI obviously know that I am not the target demographic for this kind of show, but common? I would expect everyone to hold their favorite genres to a high standard. This show just seems so poorly done and I hate that  this is the state our shows are in, baffling. ",
        "upvotes": 3,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1q2yc05/what_the_hell_is_emily_in_paris/"
    },
    {
        "id": "1q1rl8k",
        "author": "GuineaPKilledMe",
        "title": "Dave Chappelle - The Unstoppable",
        "content": "I have never seen something so unfunny in a long time. Genuinely what happened to this dude?? I mean I know what happened, but all he does it spew bitterness and hate.\n\nHe immediately came out preaching and ranting. Idek when he's actually telling jokes because all he does is go on and on about how he can't do this and can't do that. What a whiny baby.\n\nI used to love his standup specials. I just cannot believe that almost ten years later this man can absolutely not let anything go. I turned it off twenty minutes in without cracking as much as a smile.\n\nEdit: Some of y'all are so far up Dave Chappelle's ass that you're sending me Reddit Care alerts. You are a absolute pathetic loser to do that. Please grow up and choose to use those when someone is actually in dire need of help. I do not need help because I find your favorite comedian to be a bitter old man who rants at the clouds.",
        "upvotes": 939,
        "comments": 406,
        "media": null,
        "permalink": "/r/netflix/comments/1q1rl8k/dave_chappelle_the_unstoppable/"
    },
    {
        "id": "1q2gzfa",
        "author": "rebelsoul_8",
        "title": "Queen of the South",
        "content": "Just finished Queen of the South , anyone else seen this , i thought it was really well written and kept me engaged the whole series. The actors did a really good job to . ( Boaz especially) ",
        "upvotes": 22,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1q2gzfa/queen_of_the_south/"
    },
    {
        "id": "1q20n8a",
        "author": "emanuele94",
        "title": "Questions about Stranger Things",
        "content": "1. Why does Vecna need to open four gates in Season 4, but then in Season 5 he changes his plan and needs twelve children instead?\n\n2. Why does Vecna need twelve children on his side to bring the Abyss to Earth?\n\n3. Why does Vecna wait years before acting directly?\n\n4. Why, in the Abyss during the final showdown, are there no other creatures present (demogorgons, demodogs, demobats, etc.) besides the Mind Flayer? Did they join him spontaneously (as if that were a good strategy…)? Were they all in the Upside Down? Were they all dead? Who knows!\n\n5. Why is Mike’s mother able to move freely around the hospital with a gas tank and hide it inside one of the dryers without any demogorgon noticing?\n\n6. Why do the military, once they become aware of the “beanstalk” plan, do nothing to stop it?\n\n7. Why does Vecna, once he learns about the “beanstalk” plan (through Kali’s memories), do nothing to stop it?\n\n8. Why, inside Henry’s mind, does Holly need to pull out the “Rise of Skywalker” move, with binoculars?\n\n9. Why, once Eleven disappears, do the military decide to abandon the town and all the protagonists as if nothing had happened? Nancy and Hopper should end up in prison for at least manslaughter. Instead, Hopper regains his job as sheriff and even considers a career advancement.\n\n10. Why is a huge creature like the Mind Flayer unable to kill the protagonists in the final battle (with legs as big as an apartment building, which everyone easily dodges with a somersault)? And how do the protagonists manage to climb to the top of a canyon so quickly?\n\n11. Why, all of a sudden, can everyone enter and exit the Upside Down without needing an oxygen mask anymore?\n\n12. Why isn’t Max blind after coming out of her coma?\n\n13. Why is Joyce involved in extremely dangerous missions and plans, despite often having no real active role and providing no significant contribution?\n\n14. Why do the characters think it’s a good idea to stop and talk and deepen their relationships in the middle of very intense action scenes?\n\n15. Why do gravity, air, sound, etc. work normally in the Abyss just like on Earth? Very convenient for playing “space explorers”!\n\n16. Why is Vecna able to activate long-distance mind control over Hopper?\n\n17. Why does Vecna kill following “ritualistic” patterns instead of attacking en masse?\n\n18. Why is Eleven able to defeat 001 as a child but not as an adult (at least initially)?\n\n19. Why doesn’t Vecna kill Eleven immediately when he has the chance?\n\n20. Why are Jonathan and Nancy not even slightly injured by the slimy substance that forms after they attack the shield generator?\n\n21. Why does Henry receive an interdimensional stone with black dust and turn into a murderous madman?\n\n22. Why does the Mind Flayer change form and strategy every season? If his goal is to infest Earth, he had countless opportunities to do so (and couldn’t he have the demogorgons carry stones with black dust to possess other people, as he did with Henry)?\n\n23. Why does no one in Hawkins, besides the protagonists, wonder what is happening? No one comes up with conspiracy theories?\n\n24. Why does no one outside Hawkins take an interest in this town? Does no one have friends or relatives outside the city? What is the government doing? No external journalists investigate?\n\n25. Why do a bunch of kids always manage to figure everything out before scientists and the military?\n\n26. Why do parents tolerate such prolonged absences and/or so easily accept absurd or incomplete explanations?\n\n27. Why is the Abyss “frozen” on the day Will disappeared?\n\n28. Why does Will, despite having survived, attract no interest from the military? (There must be surveillance footage showing him fighting off demogorgons.)\n\n29. Why don’t the demogorgons in the laundry room hear the music Lucas plays to save Max?\n\n30. Why does no one seem to notice the gigantic walls surrounding the Upside Down before Season 5? Excluding Dr. Brenner—judging by the notes he wrote and then forgot in the Upside Down lab—when did he produce them? And why is there no trace of this information in the real Hawkins lab?\n\n31. Why is Eleven even capable of generating wormholes? It has been confirmed that she accidentally created the Upside Down in 1983.\n\n32. Why is Eleven able to hurl people into other dimensions? She is the one who threw Henry/001 into Dimension X / the Abyss.\n\n33. Who or what created the shield generator in the lab that keeps the Upside Down intact? Was it Eleven when she created the bridge?\n\n34. Why is Dimension X / the Abyss the only dimension trying to interfere with Hawkins?\n\n35. Why is Suzie no longer mentioned? Why aren’t Robin and Vickie included in the finale? Why are unresolved subplots left hanging?\n\n36. Why does the fate of characters like Dr. Kay remain ambiguous?\n\n37. Why does Nancy suddenly appear skilled with weapons, without any explanation or prior training?\n\n38. Why do demogorgons switch from being intelligent predators to almost stupid monsters, depending on the circumstances and the characters involved in a given scene?\n\n39. Why do the disappearance of dozens of people, numerous deaths, and the presence of giant monsters not lead to serious investigations or intervention by the press or the FBI?\n\n40. Why, in Season 5, do the vines no longer have any significance, when up until Season 4 simply touching them disturbed the hive mind?\n\n41. Why do the characters constantly seem on the verge of death but then survive (after a few seconds, a few episodes, or from one season to the next: Hopper, Nancy and Jonathan, Steve, Eleven)?\n\n42. Why did Vecna specifically take control of Will in Season 1 and not other kids?\n\n43. Why does the wormhole show only Hawkins in the Upside Down?\n\n44. Why do the Russians disappear entirely? Why do they no longer spy on operations in Hawkins, considering that even kids manage to do so with the help of a high school physics teacher?\n\n45. Why doesn’t Vecna maintain a constant army, and why doesn’t he fully exploit it?\n\n46. Why is Max able to graduate despite having missed almost two years of school?\n\n47. Why do Joyce and Hopper never talk about Henry, even though they went to school with him?\n\n48. Why does every season have to “reset” the world as if nothing had happened before?\n\n49. Why is Vecna not mentioned at all in the early seasons?\n\n50. Why does this series handle certain narrative turning points in such a sloppy way (\"good enough, let’s go!\")?\n\n",
        "upvotes": 125,
        "comments": 138,
        "media": null,
        "permalink": "/r/netflix/comments/1q20n8a/questions_about_stranger_things/"
    },
    {
        "id": "1q2xvul",
        "author": "koolloso",
        "title": "Stranger Things Finale Digital Cinema Package (DCP)",
        "content": "Does anyone have insight or a theory on how DCPs were distributed for this release?\n\nIf Netflix didn’t make any money from the screenings, I’d guess they’d also not want to spend a lot of money to provide hundreds of DCPs for the screenings. \n\nI saw it in two theaters. I saw it first in the actual theater (Tara Atlanta) that Lucas and Max were at in the montage at the end of the episode. There, it appeared to be a 2K projection. I also saw it in a standard Regal theater which appeared to be a 4K projection.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q2xvul/stranger_things_finale_digital_cinema_package_dcp/"
    },
    {
        "id": "1q22won",
        "author": "Prestigious-Play8863",
        "title": "Everyone who finished the Stranger Things finale, did it feel… off?",
        "content": "Everyone who finished the Stranger Things finale, did it feel… off?\n\nWatched it yesterday and I’m still sitting with it. Not angry, not impressed, just oddly underwhelmed. \n\nFeels like there was so much build-up for something that didn’t fully hit emotionally.\n\nAm I alone in this or did it leave you feeling the same way?\n\nHere's a detailed review -\nhttps://medium.com/@fbgmb/i-watched-the-stranger-things-finale-and-wait-thats-it-3ebde2924f9e",
        "upvotes": 71,
        "comments": 226,
        "media": null,
        "permalink": "/r/netflix/comments/1q22won/everyone_who_finished_the_stranger_things_finale/"
    },
    {
        "id": "1q2xlox",
        "author": "Alicewithhazeleyes",
        "title": "The Serpent… looking for other things like it",
        "content": "Was so good. I don’t usually binge shows but I absolutely did this one and then binged Monster of Florence after. I’m looking for something similar to these. I don’t mind dubbed shows for English or reading subtitles. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q2xlox/the_serpent_looking_for_other_things_like_it/"
    },
    {
        "id": "1q27y2d",
        "author": "Mucek121",
        "title": "What are your top 6 Netflix shows ever?",
        "content": "What are your top 6 Netflix shows ever?\n\n\n\nMine top 6 are  :\n\n\n\nOzark\n\n\n\nPeaky Blinders\n\n\n\nStranger Things\n\n\n\nQueen's Gambit\n\n\n\nThe Last Kingdom\n\n\n\nHaunting of Hill House",
        "upvotes": 40,
        "comments": 162,
        "media": null,
        "permalink": "/r/netflix/comments/1q27y2d/what_are_your_top_6_netflix_shows_ever/"
    },
    {
        "id": "1q2xdl7",
        "author": "Quick_Dot_9660",
        "title": "Harlan Coben - British Adaptations?",
        "content": "So I've recently learnt Harlan Coben is American and a bulk (maybe all) of his books are set in the US but there's a large portion of his adaptations on netflix are set in the UK in kind of non descript vaguely liverpool/manchester suburbs. \n\nDoes anyone know why? It's not usually something that happens with adaptations I was wondering if anyone had any production scoops.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1q2xdl7/harlan_coben_british_adaptations/"
    },
    {
        "id": "1q2rcql",
        "author": "Exact-Development200",
        "title": "The Following tv series",
        "content": "The Following just hit Netflix. Go check it out. It's a great show. Without giving spoilers, all I can say is it's about a serial killer that escapes prison and the FBI agent that caught him needs to recapture him.",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1q2rcql/the_following_tv_series/"
    },
    {
        "id": "1q2v664",
        "author": "Competitive_Gene_898",
        "title": "Netflix Cancels Stephen King’s The Talisman Series Before It Could Begin",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q2v664/netflix_cancels_stephen_kings_the_talisman_series/"
    },
    {
        "id": "1q2esby",
        "author": "Vegetable_Engine_463",
        "title": "Million-dollar question — is Derek’s family still tied up in that barn?",
        "content": "They got kidnapped, drugged, tied up, and left in some random barn. And that’s it, the end. Nothing in the finale. Why tf they didn’t show up at graduation? Are they alive or Dead? Did anyone ever go back for them, and if so — what did they say? Like: “well, we were kidnapped, but it’s all good, we’re gotta go back home, no worries.” \n\nOr… are they still just lying there?\n\nAnd what was the point of giving the sister a whole personality and a fight with Erica if she was gonna vanish right after? One scene and gone. For what?? ",
        "upvotes": 11,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1q2esby/milliondollar_question_is_dereks_family_still/"
    },
    {
        "id": "1q1vvza",
        "author": "Admirable-Abrocoma16",
        "title": "Where Did My Demogorgons Go? Stranger things Finale episode",
        "content": "So I just finished the Stranger Things finale and… excuse me, but did the Duffers accidentally misplace the Demogorgons in the Upside Down lost‑and‑found?  \n\n- Season 1: Demogorgon terrorizes Hawkins, eats Barb, becomes the face of nightmares.  \n- Season 2: Demo‑dogs everywhere, Will coughing up slugs, chaos.  \n- Season 3: Russians literally import a Demogorgon like it’s a Costco bulk item.  \n- Season 4: Hopper fights one bare‑chested with a sword like he’s auditioning for Conan the Barbarian.  \n- Season 5 finale: Not. Even. One. Cameo.  \n\nLike… Vecna gets his Shakespearean villain monologue, the Mind Flayer gets lore upgrades, but the OG monster? Vanished. No goodbye wave, no “thanks for the trauma,” not even a background shot.  \n\nI feel robbed. At least give me a single Demogorgon dissolving dramatically when the Upside Down collapses. Instead, it’s like Hawkins collectively forgot their first abusive ex. ",
        "upvotes": 109,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1q1vvza/where_did_my_demogorgons_go_stranger_things/"
    },
    {
        "id": "1q2y3of",
        "author": "peoplemagazine",
        "title": "Stranger Things Finale: What Happened to Erica, Murray and Mr. Clarke? The Duffer Brothers Weigh In",
        "content": "",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1q2y3of/stranger_things_finale_what_happened_to_erica/"
    },
    {
        "id": "1q2t50l",
        "author": "AssociateLittle1487",
        "title": "I can’t believe so many popular Netflix shows were disappointing",
        "content": "There were three shows I was looking forward to this year: Squid Game 3, Alice in Borderland 3, and Stranger Things 5. Each one ended up to be disappointing/underwhelming, no matter how much I held hope that the next series would be better. The only good thing is that each subsequent show was much better than the last (I liked AIB3 and ST5- would rate them 6 and 7-8/10 respectively). In fact, it seemed like they left out crucial plot points on purpose just to milk them out further- Squid Game and AIB USA.  The lack of Junho and Inho’s development. Mind Flayer only being revealed to possess Henry on the last episode + reveal of spin-offs shortly after.",
        "upvotes": 0,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1q2t50l/i_cant_believe_so_many_popular_netflix_shows_were/"
    },
    {
        "id": "1q2ogsu",
        "author": "niiyah_babyy",
        "title": "Limited series recommendations",
        "content": "I just finished the new limited series Run Away and it was so good !! Any other short series on Netflix i should check out ??? I love thrillers but any genre is cool. ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1q2ogsu/limited_series_recommendations/"
    },
    {
        "id": "1q2s5rw",
        "author": "0xairr",
        "title": "The Residence",
        "content": "This show is hilarious and I mean it\n\nGave it a watch after many recommendations but disappointed \n\nSo let me get this straight \n\nLilly hides the clock in the secret compartment in the passage so that her dna and finger prints can’t be traced from it\n\nBut then she (pretending as Elliott),gives order to the Chief Usher to seal the passage\n\nLike wtf that is the CHIEF USHER and probably knows about the secret compartment\n\nEven then the clock would have reminded in there and maybe found later \n\nWhy Lily didn’t just wipe the clock later or washed it so no evidence could be extracted ?\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q2s5rw/the_residence/"
    },
    {
        "id": "1q2yhkg",
        "author": "caroulos123",
        "title": "Netflix doesn’t hit the same anymore",
        "content": "Lately it really feels like Netflix used to have better shows than it does now. A few years back, things like Stranger Things, Narcos, and Mindhunter felt bigger, more original, and easier to get hooked on. I actually looked forward to new seasons dropping.\n\nNow I open Netflix and spend way too long scrolling, adding things to my list but never pressing play. A lot of new shows feel rushed or forgettable, even if the idea sounds good on paper. I still watch Netflix, but the excitement isn’t the same.\n\nAm I the only one who feels this way, or do you think the quality really changed? Are there any newer shows that gave you that old Netflix feeling again?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1q2yhkg/netflix_doesnt_hit_the_same_anymore/"
    },
    {
        "id": "1q27ir8",
        "author": "Raganjpix",
        "title": "Netflix Run Away Anya without wheelchair",
        "content": "I just started watching Run Away on Netflix last night… The daughter Anya Greene is portrayed in a wheelchair in almost every scene. But after her school teacher parent conference, she appears to be walking and standing at the same height as her parents. Am I missing something? Does she need that wheelchair or not? Can she walk sometimes or was this just a misunderstanding as I viewed the scene?",
        "upvotes": 17,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1q27ir8/netflix_run_away_anya_without_wheelchair/"
    },
    {
        "id": "1q28qq0",
        "author": "Famous-Attention-197",
        "title": "Why the Hell did they Move the Search Bar",
        "content": "sorry, just a rant but god this is such a stupid decision from a user perspective. \n\n  \nso I just scrolled past a bunch of shit I don't want to watch, then decide I'm going to search for something specific. and now I have to scroll back past all that shit I don't want to watch. \n\n  \nwhat the hell, Netflix. some stupid middle manager somewhere justifying their existence with shitty UI changes. ",
        "upvotes": 12,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1q28qq0/why_the_hell_did_they_move_the_search_bar/"
    },
    {
        "id": "1q17wlz",
        "author": "Boring_Ant_1677",
        "title": "Gaten Matarazzo: “I don’t think I ever really want to put Stranger Things behind me”",
        "content": "",
        "upvotes": 1925,
        "comments": 258,
        "media": null,
        "permalink": "/r/netflix/comments/1q17wlz/gaten_matarazzo_i_dont_think_i_ever_really_want/"
    },
    {
        "id": "1q21v0e",
        "author": "Particular_Cow_9302",
        "title": "Joyce Byers",
        "content": "I gained interest in Stranger Things because of Wynona Forever (millennial thangs) and stayed for the story. And although Joyce was sidelined for most of the seasons, the real ones remember that she was the first to crack the code on the Upside Down—ABCD… I’m very glad that the Duffer Brothers gave this younger generation a chance to appreciate such a beloved actress. ",
        "upvotes": 18,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1q21v0e/joyce_byers/"
    },
    {
        "id": "1q25wwr",
        "author": "IntrovertedIngenue",
        "title": "Members Only: Palm Beach — A Potemkin Village of Class",
        "content": "Genuine question with zero political motivations but just more of an observation.\n\nSo Members Only: Palm Beach looks like a perfect, wealthy facade from the outside, but as soon as they open their mouths or show their back tattoo ink, the \"decorum\" falls apart. This show feels like it was created by someone liberal to highlight (read: embarrass) the bastion of name dropping Florida MAGA women.\n\nFrom wigs falling off to tramp stamps to the attire, this is so counter to old money Palm Beach that surely this must be some sort of an inside joke, yes? Like the purest form of Schadenfreude \n\nEither way, some of the most entertaining low class dribble on television rn. I’m hooked…",
        "upvotes": 12,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1q25wwr/members_only_palm_beach_a_potemkin_village_of/"
    },
    {
        "id": "1q2rs2r",
        "author": "Pussypopculture",
        "title": "Stranger Things 5: My (Hot) Take (spoiler alert)",
        "content": "Like many of you, I was left with complicated feelings after the long-awaited finale of Stranger Things. Not only is it the end of an era, a decade-long series that helped usher many of us through difficult moments in our lives, but there’s also something about that finale that was not satisfactory. I’ve thought about it consistently since watching the finale, and there are a few elements my thoughts boil down to: playing it safe (plot armor), too much death-teasing, and a rushed final confrontation. Playing it safe and death-teasing go hand in hand. It’s not that I wanted a main character to die; I just didn’t want to see the plot bending to ensure their survival. As a viewer, I don’t need to be coddled; I need to be trusted to endure the danger and loss the story demands.\n\n\n\n\n\n\nI’ll start with Karen. I loved Karen’s confrontation with the Demogorgon, from her bravery with the wine bottle to being struck down, it made sense, and it had a great emotional impact that is doubled when Nancy arrives to find her mother blood-soaked on the ground. To our relief, Karen survives and even returns to kick Demo-butt one last time in the hospital despite her severe injuries, when Lucas, Max, Robin, and Vickie are in trouble. I can suspend my disbelief here, but I won’t deny that I was enticed by the possibility of Karen dying because of what it would mean for Nancy and Mike. The loss of their mother would be an interesting emotional obstacle that could’ve made the stakes higher (they’ve lost their mother, they can’t lose their sister too) and their journey more challenging. However, this would make Nancy the new matriarch of the family, thus trapping her in the domestic role she’s never wanted. Nancy would likely stay in Hawkins to care for Holly and miss out on her independent and unconventional life, which is what she wants. So, I understand the decision to keep Mrs. Wheeler alive from a writing and characterization perspective. The problem arises as the season progresses and we continue to experience close calls, each one diminishing the impact of the previous one. When characters are consistently placed at death’s door only to be saved, danger doesn’t feel like danger anymore; it’s like the illusion of danger to ensure excitement without consequence. There are few consequences to major dangerous actions, which leads me to my next death-tease: \n\n\n\nNancy and Jonathan trapped in what I’m calling the slime room.\n\n\n\n\nAfter Nancy shoots what she thinks is a shield generator, but is actually exotic matter holding the walls of the Upside Down together, her and Jonathan are knocked unconscious. The ground beneath them melts, and they fall into a room where the levels of melted material are quickly rising. When they wake up and realize they may soon die, both confess their true feelings, acknowledging their shared love but also that their relationship has been over for a while. This was one of my favorite decisions in the season, having Nancy choose herself, not Jonathan or Steve; this is consistent with her characterization and a beautiful reflection of how some relationships fizzle out without any specific cause. With this resolved, they can at least die in peace. But then, suddenly, Nancy notices the building has stopped melting and that the slime has stopped rising and has solidified; they're saved! Why did everything stop melting, and why did everything solidify? We don’t know, we just have to accept it. To me, this is the plot bending to ensure the survival of two important characters. After Nancy and Jonathan got out of this so easily, I figured no one important would be in any serious danger because either the plot or another character would rush in to save them.\n\n\n\n\n\n\nThis is applicable to Eleven’s ambiguous ending. Instead of allowing the audience to sit with her sacrifice and loss, the Duffer Brothers, using Mike, give us an alternate ending for Eleven that seems just plausible enough to give viewers hope that Eleven could be alive somewhere. I’ve heard convincing arguments for Eleven’s survival and death; there is evidence to support both. The theory of Eleven surviving depends on Kali having lived long enough after being shot to create the illusion of El vanishing with the Upside Down. The theory of Eleven dying rests on our assumption that Kali is already dead when Hopper finds her and Eleven. There is also the “kryptonite” to consider, which is active when Eleven pulls Mike into her head for their final goodbye; another possible indicator of Eleven staging her death. Regardless, I don’t think whether Eleven died is important; what matters is that she’s gone for good. I agree with the Duffer Brothers that Eleven had to go to end this story.  If she’s alive in a remote town with two, not three, waterfalls (make of that what you will), I consider this a great ending for her character. Yes, she’s forced to never see her chosen family again, but she gets the one thing she’s never had and has always craved: freedom, which can only come with a fresh start away from everything tied to her trauma. If she’s dead, that’s satisfactory as well; she created the Upside Down, so she goes down with it, genuinely ensuring the whole debacle can never happen again, because, let’s be honest, as long as she’s alive, there is a risk that it can start all over again. The important thing is, and I applaud the Duffer Brothers for this, that Eleven is gone.\n\n\n\n\n\n\nThe last thing I’d like to discuss is the final confrontation between the gang and Vecna and the Mind Flayer; it was too easy, considering the build-up. There are some snafus and death-teases, namely Eleven “getting shot” by Hopper and Steve almost falling off the radio tower, but as mentioned before, these had no impact in creating tension because, at this point, I had been conditioned to characters surviving every brush with death; the true surprise would’ve been to kill one of their darlings, unequivocally. The placement of these death-teases also made me assume they were just that, a tease. Steve dangles off the tower in the first 25 minutes of a two-hour episode, and Hopper is tricked by Vecna into supposedly shooting Eleven in the tank within the first 35. My immediate thought was “they’re not dying this soon,” and I was right.  \n\n\n\nNonetheless, I did enjoy the finale and agree that, regardless of the form it took, Eleven had to leave in order for this story to end properly. As she says to Mike, it’ll never end as long as she is there . . . unless she loses her powers for good? Just kidding, just kidding. Dr. Kay and others like her and Papa would’ve probably kept experimenting on her anyway, trying to bring them back. Speaking of the military/government presence, I don't believe we've seen the last of them. Hopper's line about taking the position of Chief of Police in Montauk, New York is enough for me to believe there will be a spin-off series that delves deeper into what inspired ST and that will carry the original title of ST, Montauk.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q2rs2r/stranger_things_5_my_hot_take_spoiler_alert/"
    }
]