[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 487,
        "comments": 258,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1ic6pni",
        "author": "boltsofsaffron",
        "title": "The Bernie Mac Show - a freaking gem",
        "content": "Man....I forgot just how funny this show is. The subtle humor, the flashbacks, the writing over the scenes, the end scenes that add extra context to what happened during the show...its hilarious man. Jordan, Baby Girl and Vanessa have some great comedic timing for being kids, and Bernie...well, he's a legend. I've been watching from the beginning again, and it might be one of my new all time faves. ",
        "upvotes": 65,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1ic6pni/the_bernie_mac_show_a_freaking_gem/"
    },
    {
        "id": "1ic4h53",
        "author": "StarKCaitlin",
        "title": "Jeremy Allen White to Star in 'Enigma Variations' Series at Netflix",
        "content": "",
        "upvotes": 13,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ic4h53/jeremy_allen_white_to_star_in_enigma_variations/"
    },
    {
        "id": "1icc93t",
        "author": "orange-black-tea",
        "title": "French Adaption of the Show Alpha Male",
        "content": "I watched the French adaption of the Spanish show “Alpha Male” called “Shafted” last night. My God, it was so bad. It reminded me of another French show “Hookup Plan. \n\nThen I googled it, turned out the producer of “Hookup Plan” Noemie Saglio is the director of the French version of “Alpha Male”. \n\nI love the original Spanish version. Netflix is adapting into French, Italian and Dutch versions. Hope that the Italian and the Dutch versions will have the same high quality as the original Spanish version.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1icc93t/french_adaption_of_the_show_alpha_male/"
    },
    {
        "id": "1ici2jp",
        "author": "Eeepp",
        "title": "How long will it take for Rose to be an official Night Agent? What is going on at the Night Agent Writer's room?",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ici2jp/how_long_will_it_take_for_rose_to_be_an_official/"
    },
    {
        "id": "1ichsgd",
        "author": "TryEasy6525",
        "title": "A community within Netflix? Good or Bad?",
        "content": "1) Would you be interested in connecting with other Netflix users who share similar content preferences?\n\n2) What features do you think would be cool in a Netflix community? For example, Discussion boards for shows/movies. Groups based on content preferences (e.g., action fans, true crime enthusiasts. Watch parties. Content recommendations from community members. \n\n3) How likely are you to write reviews or rate shows/movies or comment if a community feature is added to Netflix?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ichsgd/a_community_within_netflix_good_or_bad/"
    },
    {
        "id": "1icg5au",
        "author": "Heavy-Rough-3790",
        "title": "Horrible audio clipping",
        "content": "Has anyone else noticed horrible audio clipping? I have been watching the walking dead season 11 and the loud scenes sound like someone screaming into the mic. It’s so bad. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1icg5au/horrible_audio_clipping/"
    },
    {
        "id": "1icf854",
        "author": "HospitalHairy5133",
        "title": "cult-like documentaries &amp; series?",
        "content": "I love anything cult-related or borderline cult. I've seen and enjoyed:\n\n\\-Keep Sweet Pray and Obey\n\n\\-Wild Wild Country\n\n\\-Filthy Rich (both the Epstein and Ghislaine episodes)\n\n\\-Jimmy Saville\n\n\\-Bikram\n\n\\-Zodiac \n\n\\-The Program\n\n\\-Escaping Twin Flames\n\nAnything on or off Netflix that's similar - send it my way!",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1icf854/cultlike_documentaries_series/"
    },
    {
        "id": "1ib9728",
        "author": "Whobitmyname",
        "title": "Carey Mulligan ‘Just Started’ Filming ‘Beef’ Season 2 and Says ‘Almost Everything’ Is Different",
        "content": "",
        "upvotes": 476,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1ib9728/carey_mulligan_just_started_filming_beef_season_2/"
    },
    {
        "id": "1icde8o",
        "author": "Old-Firefighter224",
        "title": "Need show recommendations",
        "content": "I’ve watched all the newer shows and documentary’s on Netflix. Need some good recommendations of shorter shows. I can’t commit to something like greys anatomy lol ",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1icde8o/need_show_recommendations/"
    },
    {
        "id": "1ichejy",
        "author": "SomewhatProvoking",
        "title": "Question about the 8 show",
        "content": "I don't know if it fits as a pothole or abandoned element \n\nWhen 6th floor chose a card, there was blood on the table. But why? Nobody had been hurt yet so how did any blood get there. It was on the back so what does the blood really do for the storyline or characters? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ichejy/question_about_the_8_show/"
    },
    {
        "id": "1ibzxq7",
        "author": "qna27",
        "title": "Continue play on same device",
        "content": "I understand they have a service to keep track of point of time I'm watching a movie or series. But at times it plays a previous time when i resume on same device. I guess it makes sense of i played on device 1 then resumed on device 2, then went back to device 1 and there was a sync error. \n\nBut I have noticed this even when I play back on same device. \n\nSuggestion:\n\nOn same device save time played till locally &amp; don't overwrite that with server time if not played on different device.\n\nAnyone else experience this?",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ibzxq7/continue_play_on_same_device/"
    },
    {
        "id": "1icfa7n",
        "author": "Character-Soil-8900",
        "title": "wrong image for show",
        "content": "https://preview.redd.it/ok35cbiygtfe1.png?width=1148&amp;format=png&amp;auto=webp&amp;s=95972d4081095f889098c31c95953d581331464d\n\nthe hero image for Let Me Tell Your Fortune is actually  from another Japanese \"reality TV\" show The Boyfriend. have there been rampant layoffs at Netflix recently? are you guys painting the office? what are you doing over there? FIX IT. get your house in order.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1icfa7n/wrong_image_for_show/"
    },
    {
        "id": "1ic6d5x",
        "author": "patoons",
        "title": "Fast forwarding/Rewinding on netflix frame preview",
        "content": "I watch Monday night raw a day or 2 after it airs mainly because I can’t commit 3h to watching live and I’m not interested in like 50% of the show. Watching the next day allows me to ff thru the show and play when I want. I notice that when I FF, only sometimes it displays a small thumbnail of the frame the video is on. Sometimes it doesn’t show and I’m just seeking blindly. I am using the same device to stream Samsung smart tv) so it’s not a matter of device features. Any idea?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ic6d5x/fast_forwardingrewinding_on_netflix_frame_preview/"
    },
    {
        "id": "1ibjioi",
        "author": "Intrepid-Discount976",
        "title": "The Night Agent trying to become the new Jack Ryan is going to be its downfall",
        "content": "Jack Reacher, Jack Ryan, James Bond, Jason Bourne, whatever. The trope of the hyper competent spy action thriller that's geared specifically towards the male demographic. There are so many of these already, and apparently we needed another one?\n\nIMO what set the first season of The Night Agent apart was the male/female duo dynamic which tapped into both demographics and a wider audience. And while the writing occasionally went on the corny side, I appreciated the realistic aspect of physical limitations, i.e. the fighting was often clumsy, Rose was the computer wiz and not suddenly defeating men twice her size in hand-to-hand combat, and Peter wasn't this unrealistic prodigy agent who was somehow equally talented at technology and combat - they both needed the other in a believable partnership.\n\nSeason 2 felt like they were diverging away from the formula in order to turn it into another long-running spy thriller franchise, which the show runners pretty much confirmed in an interview. Also, the decision to make her suffer from PTSD and anxiety, and be in therapy twice a week felt entirely out of place considering Peter is somehow completely mentally unaffected? And how has no government organization recruited Rose yet to be a cyber intelligence officer? Instead this season wrapped up with her effectively becoming his Bond girl, with the writers saying it's undecided if Rose will even be back next season. Peter being willing to trade his whole life to save her and Rose in turn being like \"this gives me anxiety, I just wanna go back to Silicon Valley and be a normal girl :(\"\n\nAll of this made complete sense btw when I found out S1 is based on a book, and S2 was the show runners writing without any source material. For me the season was a letdown, and I'm honestly just uninterested in the direction they're taking this show",
        "upvotes": 38,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1ibjioi/the_night_agent_trying_to_become_the_new_jack/"
    },
    {
        "id": "1ibr6j0",
        "author": "notyourhistoryclass",
        "title": "The History Behind The Six Triple Eight.",
        "content": "In December of 2024, Tyler Perry came out with a movie called The Six Triple Eight, starring Kerry Washington. I love history and after doing a deep dive on the story, I found out that, while dramatized and a handful of fictional characters sprinkled in for the sake of good storytelling, it was in fact very accurate. I really love Kerry Washington's portrayal of Major Charity Adams, especially the scene where she tells Dean Norris, \"over my dead body, sir!\" Especially since this scene actually happened in real life. She was a woman, being sick of mistreated for so long, that she wasn't going to let anyone stand in her way of what she wanted. ",
        "upvotes": 14,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ibr6j0/the_history_behind_the_six_triple_eight/"
    },
    {
        "id": "1icfglg",
        "author": "DashiellHammett",
        "title": "Night Agent S2 ~ Let's List All the Unbelievable, Ridiculous, or Flat-Out Stupid Plot Points",
        "content": "So many to choose from.  I'll go first, sticking to Episode 1 (because I bailed by the end of Episode 2 because I couldn't take it anymore).  But please post examples from the entire second season. \n\nRose is a genius computer software engineer, and she goes into a potentially make-or-break meeting with an investor with $50 million dollars on the line for an amazing computer program she helped to create, and....She takes her phone into the meeting. It is not on silent. She is apparently unable to figure out how to  make it be silent as it continually interrupts the meeting, forcing her to finally leave the meeting while her boss explains that she is apparently having an \"off day\" (or something). ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1icfglg/night_agent_s2_lets_list_all_the_unbelievable/"
    },
    {
        "id": "1icd5ne",
        "author": "madhaunter",
        "title": "Firefox 134 unsupported ???",
        "content": "[Current error on Mozilla Firefox 134.0.2](https://preview.redd.it/889xh8qj0tfe1.png?width=692&amp;format=png&amp;auto=webp&amp;s=733cb60276babcaa4bf0411130f2c97d75caff0a)\n\nWhat the hell ? I'm under Linux, I already tried to clear all cookies/cache with no luck so far. Even disabling adblockers didn't solve anything.\n\nNo issues on Chromium but well... It's not my main browser",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1icd5ne/firefox_134_unsupported/"
    },
    {
        "id": "1icdsqj",
        "author": "fluxrider",
        "title": "Bad Quality",
        "content": "Since yesterday, I've been noticing really poor quality.\n\nI learned I could Alt-Ctrl-Shift-D and it says 960x540 for a movie that has the HD icon. My account/profile setting are set for max quality, and I'm on the premium plan that goes to 4K.\n\nYes, I'm running Linux/Firefox but I'm starting to be real pissed. Who's with me?\n\n(googling gives 3 years old solutions involving some firefox plugin that does not exist)",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1icdsqj/bad_quality/"
    },
    {
        "id": "1ib5hvi",
        "author": "S4v1r1enCh0r4k",
        "title": "Some rumors claim that season 5 will be split into two parts, premiering in October/November 2025",
        "content": "",
        "upvotes": 90,
        "comments": 74,
        "media": null,
        "permalink": "/r/netflix/comments/1ib5hvi/some_rumors_claim_that_season_5_will_be_split/"
    },
    {
        "id": "1ibvvx6",
        "author": "Human_Bed_6355",
        "title": "Menu sound but none for shows/movies",
        "content": "For last week I’ve tried getting on Netflix it a make the noise when you first load in. But ANY thing I tried to watch is silent. Have a gooogle tv so I can’t uninstall it. But I have uninstalled update and reinstalled still same issue, anyone have a fix or heard of this?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ibvvx6/menu_sound_but_none_for_showsmovies/"
    },
    {
        "id": "1iby6zo",
        "author": "supercoolnamehere08",
        "title": "Netflix got rid of Breaking bad and Better call Saul from Slovakia",
        "content": "The new stupid 2 hour movie got rid of hours of these tv shows ",
        "upvotes": 0,
        "comments": 3,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6acvq09ejpfe1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1iby6zo/netflix_got_rid_of_breaking_bad_and_better_call/"
    },
    {
        "id": "1ibxeiu",
        "author": "ApprehensivePoetry34",
        "title": "How do I stop getting the same Home Screen ad?? PLS STOP COCOMELON",
        "content": "Every time I open Netflix on my computer AND TV, the same ad starts playing on my homepage above everything else. The default media at the top. No, it’s nothing interesting, but instead is the f-ing “Underwater Melon - Fruit Merge” game. I have shown NO interest in games at all, let alone kid-like media. \n\nEVERY TIME I open Netflix I see this Cocomelon inspired game. HOW DO I GET RID OF IT?\n\nI have downvoted it, but it still shows up first and starts playing audio…EVERY time I open Netflix. WTF?!?\n\nFor context, I have the ad-enabled subscription. This shouldn’t matter, right?! UGH I DONT LIKE COCOMELON",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ibxeiu/how_do_i_stop_getting_the_same_home_screen_ad_pls/"
    },
    {
        "id": "1ibr2ni",
        "author": "Ecstatic_Star_2047",
        "title": "Almost all my account history has disappeared?",
        "content": "Just logged into Netflix and saw that not only has my profile picture been changed, but almost all of the movies and shows in My List are gone, and it only shows 2 continued watching series?? Out of probably the hundreds of items I had saved, only 5 are listed anymore??   \nI logged into netflix just a few hours earlier and everything was normal, so is anyone else experiencing this?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ibr2ni/almost_all_my_account_history_has_disappeared/"
    },
    {
        "id": "1ibwt3p",
        "author": "AnwetLegEt",
        "title": "Move Netflix Account Abroad",
        "content": "I'm thinking about moving my Netflix account to another country for cost reasons. Specifically, from Switzerland to Turkey. As far as I know, I have to have a local credit card, which I have. \n\nI was also told that I can't use the account abroad for a month after the move. Is that true? That wouldn't be a problem for me.\n\nAs far as I know, it always shows the content that is valid in the country in question. Is that correct? Are there any restrictions if I always watch from abroad?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ibwt3p/move_netflix_account_abroad/"
    },
    {
        "id": "1ib31p2",
        "author": "techfinpro",
        "title": "Finn Wolfhard Says ‘Stranger Things’ Couldn’t Have Ended Better After ‘Lord of the Rings’ Style Year-Long Shoot; Last Day on Set Was ‘Incredibly Emotional’",
        "content": "",
        "upvotes": 54,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ib31p2/finn_wolfhard_says_stranger_things_couldnt_have/"
    },
    {
        "id": "1ibt2hj",
        "author": "sreebsreeb",
        "title": "\"Your email address has been changed\" but not by me",
        "content": "Netflix web support just sends me around in circles telling me to contact customer support but circles around to web pages I have already been to.\n\nIs there a way to get chat or phone support?\n\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ibt2hj/your_email_address_has_been_changed_but_not_by_me/"
    },
    {
        "id": "1ibsy3n",
        "author": "Elegant-Page129",
        "title": "Recommendations?",
        "content": "What are some films like resident alien, the man who fell down to earth, etc.. like alien-y vibe or literally aliens who come down to earth. Or like just super powers without the cgi looking so fake ?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ibsy3n/recommendations/"
    },
    {
        "id": "1iagsqk",
        "author": "cu_when_i_cu",
        "title": "Netflix will keep raising prices, they want you to downgrade because they make more money off ads.",
        "content": "Old DVD subscriber here, unsubscribed this weekend. Won't won't sign back up until there's a number of shows to watch, binge and then disconnect again.",
        "upvotes": 709,
        "comments": 121,
        "media": null,
        "permalink": "/r/netflix/comments/1iagsqk/netflix_will_keep_raising_prices_they_want_you_to/"
    },
    {
        "id": "1ibmsoz",
        "author": "Paleoworlde",
        "title": "Do you know the name of this bug show?",
        "content": "I remember in the mid to late 2010’s I watched this show on Netflix about this world of bug humanoids who had wars against each other, it was in a style like one of those traditional Japanese paintings and I haven’t been able to find anything about it online.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ibmsoz/do_you_know_the_name_of_this_bug_show/"
    },
    {
        "id": "1ibre3e",
        "author": "Affectionate_Sea_161",
        "title": "Confused .. help please",
        "content": "Sorry if this has been asked .. I tried to search but didn’t find what I was looking for. I was sharing my account and finally got caught by Netflix. So I did the add member thing and profile transfer but now their account picture doesn’t show up as an option when I log in.. why?! If it’s all the same account why would that change and how do I get it back?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ibre3e/confused_help_please/"
    }
]