[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1m8wbo6",
        "author": "PiscesInChaos",
        "title": "I hate the new redesigned layout",
        "content": "The recent redesign of the app/interface is a major step backwards in usability, clarity, and overall user experience.\n\nThe layout is now cluttered and confusing, with good features buried under unnecessary animations and tabs. The new “My Netflix” section feels like an unhelpful dumping ground with zero intuitive structure. Browsing has become frustrating—everything is larger, slower, and less responsive. It now takes twice as many clicks to get to the content I actually want to watch.\n\nWorse, the previews autoplay more aggressively, recommendations feel even more random, and the horizontal scrolling is exhausting and inconsistent across devices. The redesign feels like it was built to impress a demo room, not serve actual users who just want quick, functional access to their content.\n\nNetflix used to be seamless. Now it feels bloated, distracting, and deeply out of touch with what made the platform great in the first place. At least should have give users an option to revert to the classic layout.",
        "upvotes": 37,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1m8wbo6/i_hate_the_new_redesigned_layout/"
    },
    {
        "id": "1m7yfl2",
        "author": "manzworld",
        "title": "Netflix urged to prepare for 'long and messy' Baby Reindeer legal battle\nThe woman who claims to be the real life Martha from the hit Netflix show Baby Reindeer is suing the streaming giant for $170 million, with a pretrial conference taking place",
        "content": "Article - A woman claiming to be the real life Martha from Baby Reindeer [is suing Netflix for $170 million](https://www.themirror.com/entertainment/celebrity-news/baby-reindeers-real-life-martha-524997) and one legal advisor has warned [the streaming giant](https://www.themirror.com/all-about/netflix) to expect a \"long\" court battle.\n\nFiona Harvey [filed a lawsuit against Netflix last year for defamation](https://www.themirror.com/entertainment/golden-globes-netflix-baby-reindeer-882144), intentional infliction of emotional distress, negligence and violation of her right of publicity, according to court documents obtained by The Mirror US. She alleged Netflix \"created an easily accessible road map to allow viewers to track her down in real life and connect the dots to her identity.\" In the show, the character Martha is played by Jessica Gunning.\n\nHarvey claimed she was \"tormented\" after [the show, in which she isn't named](https://www.themirror.com/entertainment/celebrity-news/baby-reindeers-richard-gadd-issues-462748), was released. She said she suffers from \"anxiety, nightmares, panic attacks, shame, depression, nervousness, stomach pains, loss of appetite and fear, extreme stress and sickness,\" according to the court documents. She's seeking $170 million in damages.\n\nA pretrial conference will be taking place in regards to the case today. Legal advisor James Pipe has spoken to The Mirror US and shared what he thinks Netflix could expect as the case begins.\n\nPipe told us, \"This lawsuit between Fiona Harvey and Netflix is already making headlines, and honestly, it's got all the ingredients of a long, messy legal battle. Harvey is suing for $170 million, claiming Baby Reindeer is basically a version of her life, and that Netflix defamed her, violated her privacy, and acted negligently by letting it air. But is she likely to win? That's not so easy to say.\"\n\nHe continued, \"First, she’ll need to prove that viewers could clearly tell she was the inspiration behind the character, and that what was shown was both false and harmful to her reputation. That's a tall order.\"\n\nThe expert explained, \"Netflix hasn't named her, and the show is billed as a dramatized 'true story', meaning some parts are based on real life, but others are fictionalized.\" When suggesting how Netflix will respond, Pipe said they will \"likely lean hard on freedom of speech.\"\n\nHe added, \"They'll argue that the show is protected artistic expression, that names and details were changed, and that no reasonable viewer would assume the character was a 100% accurate portrayal of a real person, especially someone never named.\"\n\nPipe also suggested Harvey might find it difficult to win the negligence parts of her case. \"They'll argue they didn’t act recklessly and took steps to fictionalize the story,\" he said.\n\nThe trial could be a long one, according to Pipe. \"With a claim this size and the level of media attention, we're probably looking at least a year or two before there's any final decision, unless they settle early, which can happen if both sides want to avoid a drawn-out court fight,\" he suggested.\n\nThe expert concluded, \"Bottom line: Harvey has a shot, but Netflix has deep pockets and strong legal arguments. It’s going to come down to whether the court sees this show as storytelling, or something more damaging.\"\n\nBaby Reindeer tells the dramatized story of comedian Richard Gadd's experience of being stalked, with the character Martha ending up with a nine-month jail sentence for her harassment against him. In a statement shared with The Mirror US, Harvey previously said, \"Earlier in 2024, Netflix released a program called 'Baby Reindeer', which they billed and marketed as a 'true story'. One of the two main characters, 'Martha', was clearly intended to be based on me.\"\n\nJames Pipe is a legal advisor who spoke with The Mirror US on behalf of [Free Grants For Felons](https://www.freegrantsforfelons.org).",
        "upvotes": 1425,
        "comments": 184,
        "media": null,
        "permalink": "/r/netflix/comments/1m7yfl2/netflix_urged_to_prepare_for_long_and_messy_baby/"
    },
    {
        "id": "1m8qnrt",
        "author": "WPJHtx",
        "title": "Help me find a new show to watch",
        "content": "Hey I’m looking for a new show to watch. I really like all American, one tree hill, on my block, never have I ever So teen dramas are kinda what I’m into. Any recommendations will be appreciated \n\nEdit: I really want something with that summer vibe ",
        "upvotes": 20,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1m8qnrt/help_me_find_a_new_show_to_watch/"
    },
    {
        "id": "1m8kgjz",
        "author": "Arr0zBlanco",
        "title": "SANDMAN and DEPT Q are must watch shows",
        "content": "Pretty much what the headline reads. Sandman is truly a marvelous production. Tom Sturridge IS Morpheus. Voice, demeanor, everything. The cinematography is gorgeous. \n\nAnd Dept Q—my gosh, I could watch it for just Karl and Akram’s bickering alone🤣🤣 ",
        "upvotes": 46,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1m8kgjz/sandman_and_dept_q_are_must_watch_shows/"
    },
    {
        "id": "1m91odt",
        "author": "IceMustFlow",
        "title": "Sneaky Resubscribe",
        "content": "We cancelled Netflix, as we tend to rotate streaming services every few months. This morning, when we were supposed to be finished, my young daughter tried bringing it up and was prompted if she wanted to re-subscribe. She clicked yes, not even understanding what that meant and boom, resubscribed and charged for an extra month, no sign-in required. WHAT? Absolutely not OK that this is even possible. She was signed into the Kids profile only, we just checked. Has this happened to anyone else?\n\nEdit: confirmed with Netflix support. TBF, they were helpful and have refunded the month and signed us out of all devices. However, they confirmed that the resubscription came from the TV and admitted that it is possible to do this without a password or PIN if the device is still signed in after you unsubscribe. Hmmm...",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1m91odt/sneaky_resubscribe/"
    },
    {
        "id": "1m93jps",
        "author": "thelurkingackerman",
        "title": "Extension that hides Episode titles/names cause of spoilers?",
        "content": "So I have an extension for another streaming site that lets me block thumbnails and/or episode titles from the shows I'm watching, cause so many of them literally spoil exactly what happens during the episode.\n\nAnd I was wondering if Netflix has a similar extension? I've searched online and I can't find any😕",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m93jps/extension_that_hides_episode_titlesnames_cause_of/"
    },
    {
        "id": "1m93gvg",
        "author": "Dismal_Design1291",
        "title": "Bojack horseman o cortar por la línea de puntos",
        "content": "Mi familia y yo estamos viendo una serie por turnos, y ahora me toca elegir la siguiente. Así que mi pregunta es: ¿cuál es mejor, BoJack Horseman o cortar por la línea de puntos?\n\nO si conoces una serie que sea mejor para pensar y reflexionar, también puedes recomendarla.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m93gvg/bojack_horseman_o_cortar_por_la_línea_de_puntos/"
    },
    {
        "id": "1m934xa",
        "author": "cameronmh1112",
        "title": "No home WiFi",
        "content": "I had a home WiFi a few years ago when my Netflix account was made but now I don’t pay for WiFi I have unlimited data and hotspot so I don’t need to but now I can’t login to Netflix without constantly sending myself codes is there any way around this ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m934xa/no_home_wifi/"
    },
    {
        "id": "1m927a6",
        "author": "Swimming_Tax_101",
        "title": "[Adolescence]  Philosophical understanding of Jamie’s actions?",
        "content": "Playing devils advocate here in asking whether his actions make sense? Killing is wrong, consent is always required. But we do live in times where one can’t expect men to uphold that. Katie made life difficult for him and he wanted revenge isn’t it? \nDefinitely pushed it too far and that was pretty psychopathic and plain wrong. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m927a6/adolescence_philosophical_understanding_of_jamies/"
    },
    {
        "id": "1m920jc",
        "author": "schmoopybeat",
        "title": "Downloaded media buffering",
        "content": "Wifi and data at my place are abysmal, so I downloaded some tv episodes on my iPad Air to watch. For some reason they’re buffering and won’t really play at all. They’re small, like 2-4 MB. Has anyone experienced this? What do I do? Turned off wifi, restarted the iPad and the app multiple times already.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m920jc/downloaded_media_buffering/"
    },
    {
        "id": "1m91uix",
        "author": "Fabulous_Pound915",
        "title": "Building the band: mtm first band to release a single",
        "content": "Their first single called bye comes out August 6th. They are promoting it on all social media. I really feel like the show did them no favors/they were given songs they did not gel with.  Because this song sounds like the fun upbeat pop we need from boys in pop. ",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/b9rbggw5e1ff1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1m91uix/building_the_band_mtm_first_band_to_release_a/"
    },
    {
        "id": "1m90n5x",
        "author": "CandyCrus76",
        "title": "Working at Netflix",
        "content": "Anyone here work at Netflix?  If so how’s the work life balance when working remote? Is it good for families.  Trying to understand the set your own hours thing that they say on their website.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m90n5x/working_at_netflix/"
    },
    {
        "id": "1m8pu62",
        "author": "DanSnowStark91",
        "title": "I wanna talk about the hunters wife",
        "content": "What’s everybody opinion on that show? If you watched it I thought it was really good. The show hooked me right from the first episode with the mystery element. But I thought the acting was great all across-the-board the two main leads were amazing and had major chemistry of each other. What did everyone think? \n\nAnd I shall add I did not like Sophie‘s husband. He’s the worst. What is everyone opinions on him? ",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1m8pu62/i_wanna_talk_about_the_hunters_wife/"
    },
    {
        "id": "1m8mw24",
        "author": "G_rdenofRoses",
        "title": "JOPLIN TWISTER",
        "content": "Just finished this documentary and OMG. What horrific things that town experienced! And they got quite a bit of footage as well. So much devastation made me emotional. I can’t even begin to imagine what they went through. For some reason I can’t remember this happening. Anyway, I must admit the kid forecaster and his mom kinda pissed me off … thoughts? ",
        "upvotes": 7,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m8mw24/joplin_twister/"
    },
    {
        "id": "1m8xso9",
        "author": "Brilliant_Lunch6001",
        "title": "ginny and georgia",
        "content": "is it bad that norah is my fav character…\n\nlike honestly don’t even lie, if ur frienda mom was on a murder trial U WOULD BE SCARED.\n\nalso she wasn’t as mean to max as ginny and abby were",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m8xso9/ginny_and_georgia/"
    },
    {
        "id": "1m8xa4h",
        "author": "The5tar",
        "title": "The interview preview instead of thats my boy",
        "content": "I have went to go watch that’s my boy on Netflix and it has showed the interview preview im not complaining but why would a different film that isn’t on Netflix be shown on another film",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m8xa4h/the_interview_preview_instead_of_thats_my_boy/"
    },
    {
        "id": "1m8x5rd",
        "author": "CrazyZestyclose3917",
        "title": "Happy Gilmore",
        "content": "Watched it the other day thinking, 'They should make a second one, I'd love to see where Happy is now'\n\nYou know what they say, ask and you shall recieve... Happy Gilmore 2 just released",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m8x5rd/happy_gilmore/"
    },
    {
        "id": "1m8w8lv",
        "author": "Additional_Key_8044",
        "title": "Mandala Murders Review: BALONEY!",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m8w8lv/mandala_murders_review_baloney/"
    },
    {
        "id": "1m8mwlb",
        "author": "LupeStealLikeLupin3",
        "title": "HITMAKERS [ALL] - Reality show about songwriters - Thoughts?",
        "content": "Just started watching this after being suggested it when I finished watched BUILDING THE BAND. \n\nIf you've seen it, what did you think of it?\n\nI found it quite interesting to see people involved in the pop-music process that I totally overlooked.\n\nAs a TV show, however, I think it might've been more interesting if the format was more a reality-tv gameshow like BUILDING THE BAND, with song-writers trying to get their song claimed by a hit recording artist.",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m8mwlb/hitmakers_all_reality_show_about_songwriters/"
    },
    {
        "id": "1m803tg",
        "author": "Personal_Bus_758",
        "title": "Why am I sure Amy Bradley fell off board",
        "content": "\nI personally believe that more than one eyewitness is lying. Besides the two girls in the ship I really don't buy the other stories. What makes me doubt whether she was trafficked or not is her leaving her wallet and shoes behind. A missing pair of shoes would prove she exited the room by her own feet. Usually people don't bring too much shoe wear to a week trip in a ship- mostly sandals and something for the nightclubs. If my sister were missing and she left her shoes behind, I would search in the wardrobe in case she picked another pair of shoes. If this was the case, they would have mentioned it. \n\n And if she was promised drugs like the navy said (I personally don't like that guy for a million reasons. Like wdym you didn't report it to extra military authorities asap. He's just, and I apologize for the language, a selfish scum) she would have taken her wallet and ID with her. In many trafficking operations victims are asked to bring along such documentation, especially cash money. Also, I found it weird her friends and family didn't mention any past history with drugs. The brother said she just smoked and drank, but not even a single thing about weed or some stronger stuff. Nor did her friends. Even there were some pictures in which she held pills, I wouldn't take that as a definitive hint.\n\nAnother important point, the pictures on the prostitution website were proven not to be her, since the tattoos don't match with other pictures that weren't shown on the doc. I don't know why they left that out. I feel like they left a lot of things out \n\nThe easiest explanation is that she  fell off the board, (maybe she felt a bit sick and wanted to puke or something), but then the two girls that saw her would have been confused or lying. If these girls are being truthful, then the father never saw her in the balcony, since one can't just teleport in so little time. They recently interviews yellow, who I noted didn't appeared on the doc, and some people noted that he lied about when he came back to his room. I haven't watched the video so I can't confirm myslef. That's something I read on the brother's X, who talks about scientology and shit... how the hell does someone get to that conclusion?\n\nThe trafficking narrative is overly complicated and has so many gaps were one has to fill with wondering and subjective eyewitnesses that might have been influenced by the phycosis of the media surrounding the case. It's not new people coming forward claiming to see someone who was already dead by then. The taxi driver, the tourist, the navy and the woman... I don't know, the way they told their stories was too fantastical to believe. \n\nBut if she did in fact fell off board, why haven't they found the body? Some people say she was eaten by fish, but I don't believe that. They mentioned in the doc that some mafias, more likely drug dealers or traffickers of all sorts (remember Curacao is relatively near to Venezuela and Colombia) operated there. Perhaps the body was found by someone who didn't report to the authorities, maybe because of fear of because they worked with this associations.\n\nPerhaps there are more witnesses who either are afraid to come forward or just didn't know it was her, or didn't care. I just found out about the case on Netflix. I hope the doc brings more leads to the case, and justice is brought to her and all similar victims. My family after watching the doc blamed Amy for her stupidity, selfishness and nativity. But I don't believe she was the kind of person to leave for drugs in such a shady situation without at least telling someone she was leaving, or writing a note. \n\nEDIT: I also forgot, was her key card in the cabin? That would be the first question I'd ask her brother. If the key card was missing, she either \n\nA) left and planned to come back\n\nB) fell off the balcony with the key card\n\nIf the key card was in the room\n\nA) she either left and didn't plan to come back, which doesn't make sense since she wanted to stay in the boat\n\nB) she left and forgot about it \n\nC) she fell off the balcony \n\nDoes anyone know whether her key card was found and if Brad knows about it? ",
        "upvotes": 96,
        "comments": 250,
        "media": null,
        "permalink": "/r/netflix/comments/1m803tg/why_am_i_sure_amy_bradley_fell_off_board/"
    },
    {
        "id": "1m86v7l",
        "author": "Odd_Eye_8730",
        "title": "Just finished Blue Eye Samurai. What a fantastic show!",
        "content": "Just finished Blue Eye Samurai and I’m honestly blown away. The animation is absolutely stunning — every frame feels like a piece of art, blending traditional Japanese aesthetics with a cinematic, modern flair. The fight choreography is some of the best I’ve seen in adult animation — fluid, intense, and grounded in real emotion. But it’s not just eye candy. The storytelling is layered and powerful, exploring identity, vengeance, and isolation with remarkable depth. The voice acting (especially Maya Erskine) brings so much weight to the characters, making them feel heartbreakingly real.\n\nWhat really impressed me was how Blue Eye Samurai balances action with emotion. The writing never talks down to the audience — it trusts you to understand the character’s internal struggles without spoon-feeding exposition. The historical setting adds another layer of richness without feeling forced or preachy. It’s raw, mature, and unafraid to be brutal when the story calls for it. Easily one of the most compelling shows Netflix has dropped in a long time, and I truly hope it gets the recognition (and second season) it deserves.",
        "upvotes": 35,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1m86v7l/just_finished_blue_eye_samurai_what_a_fantastic/"
    },
    {
        "id": "1m8oj38",
        "author": "Fatalisticfortuneguy",
        "title": "New Netflix Home Screen",
        "content": "Ewwww wtf did they do to the Home Screen setup. It was just fine as it was why’d they have to go and change it. Hate when companies to changes to layouts like we asked for it. ",
        "upvotes": 4,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1m8oj38/new_netflix_home_screen/"
    },
    {
        "id": "1m8eggu",
        "author": "EstateDesperate2654",
        "title": "PI Moms were actually psychos?",
        "content": "Apologies in advance if anyone else has said this, but is it just me or was that whole show an attempt at gaining sympathy for the moms' sob stories, yet as soon as they start talking about an actual missing child, they don't once mention how happy they were that the kid could be reunited with her family, it's anger and hatred towards Carl for ruining the show?\n\nThere wasn't a single likable person in this show. ",
        "upvotes": 12,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m8eggu/pi_moms_were_actually_psychos/"
    },
    {
        "id": "1m8tw5l",
        "author": "Gullible_Use_9063",
        "title": "Untamed (SPOILER) discussion on plot continuity.",
        "content": "The one thing I don’t get is when the girl originally fell onto the climbers, she was already dead. Like blue faced dead. As Paul was retelling the story, you can clearly see that she jumped off the cliff, very much alive as she was being chased. Also… in the beginning, when they originally did an autopsy, they didn’t even see the bullet wound in her leg because it was so scratched up, they thought it was an animal attack. It wasn’t until Kyle saw a bullet lodged into a log where they went back and saw the bullet wound. So we don’t get an explanation on how she got all scratched up like that? Also Paul saying “I knew Lucy would think I was trying to kill her once I shit her in the leg”. Like yeah!! No fucking shit!!?? Just sloppy writing, no consistency, no plot continuity. 3/10. Cool scenery I guess. (I know everyone else also says it, but heavily feels AI writing).",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m8tw5l/untamed_spoiler_discussion_on_plot_continuity/"
    },
    {
        "id": "1m8jkqv",
        "author": "TheMelnibonean",
        "title": "New Layout",
        "content": "Is there any way I can revert the tv layout? They just maxed everything and now I don’t feel I can explore the catalogue. Anyone knows if this is only an a/b test or are they rolling out for all users?",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m8jkqv/new_layout/"
    },
    {
        "id": "1m88o55",
        "author": "khargooshekhar",
        "title": "A Deadly American Marriage - the bizarre lies",
        "content": "I just watched this documentary on Netflix, and I am thoroughly disgusted with the outcome. While I understand that it would be distressing for Molly to think that the children she was helping to raise could be taken away from her, particularly after experiencing a miscarriage. I also can empathize with the fact that the refusal to formally adopt the children made her feel illegitimate and sidelined in their role as mother figure (even though Jason’s family maintained that he *was* taking steps to move forward with the adoption, but he was concerned about custody - which I find to be completely legitimate). \n\nHowever, trying to effectively erase the biological mother of two small children and late wife of her current husband is inexcusable. I believe both of the children’s accounts that she was overbearing and needed constant reinforcement that they loved her and saw her as their mother. It’s a tough spot to be in, but she displayed such utter disrespect (to put it lightly) to the memory of Mags that I just cannot fathom this. I myself lost my father to illness at a very young age, and I cannot imagine my mother trying to replace another man as my father. That doesn’t mean a child can’t accept a new person as a parental figure in their life, but it should never be at the expense of someone’s memory and legacy. \n\nMy real discussion point, however, is the bizarre lies she told about going to Ireland to be their godmother, as if they already had a very close relationship with the family prior to Mags’ death. Why was this just mentioned and then glossed over? That is a HUGE lie! Then also telling a book group that she gave birth to Sarah?! I found these to be very significant details that speak to her propensity to tell flat-out lies that she could never back up. That is just pathological. \n\nWhat does everyone make of this omission? They mentioned it and then didn’t elaborate at all. There was also something, if I’m not mistaken, about him being a professional boxer or something? What the hell? ",
        "upvotes": 11,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1m88o55/a_deadly_american_marriage_the_bizarre_lies/"
    },
    {
        "id": "1m8qmpg",
        "author": "Acrobatic-Berry7392",
        "title": "The Hunting Wives",
        "content": "I am looking for similar shows. I couldn’t stop watching it! So much drama, kink, &amp; killing. I can’t lie though, I got the biggest ick from the minors in the show. I felt like that could have been left out. Thoughts/Recommendations ",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1m8qmpg/the_hunting_wives/"
    },
    {
        "id": "1m8zhty",
        "author": "Timewilltell755",
        "title": "The Hunting Wives not one likable character?",
        "content": "And maybe I’m in the minority but I don’t think Malin Akerman is as beautiful as so many think.  She is kind of build like a man.  Brittany Snow I found unlikable in this.  She has one expression where she kind of opens her mouth in a gasping look.  \nI did enjoy the show for its mystery and some of the drama.  I could have done without the strap on scene and the later sex scene between Margo and Sophie.  It bordered on porn.  Less is more sometimes.  ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m8zhty/the_hunting_wives_not_one_likable_character/"
    },
    {
        "id": "1m90isr",
        "author": "hgredd",
        "title": "I hate Netflix and its powerful algorithm",
        "content": "I have been wanting to quit netflix for a while.  It will free up time to pursue other hobbies. But dam, netflix keeps recommending shows which get me hooked. That's the power of its algorithm.\n\nI have ignored the series \"Only you\" on the New and Popular list for a while. After clicking on it and watching the pilot, I know I am in trouble.  OMG the girls are so HOT........!  I have fallen again...",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1m90isr/i_hate_netflix_and_its_powerful_algorithm/"
    },
    {
        "id": "1m7ybka",
        "author": "begentlebutrough",
        "title": "Six feet under, underrated",
        "content": "Watch it right now if you haven’t. It’s about a family that owns a funeral home, and delves deep into basically any topic and experience you can imagine. The show is truly unique and made me cry more than I care to admit, especially the finale. \nThe sound track is beautiful, the characters are dynamic and you love and hate them, the cast is amazing. It’s real world, it’s an experience that I haven’t seen done so beautifully other than with this show. \nWatch it now \n",
        "upvotes": 38,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m7ybka/six_feet_under_underrated/"
    }
]