[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 14,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1otcxn2",
        "author": "FinalLightNL",
        "title": "Another price hike... Are you guys serious???",
        "content": "€20,99 for the new plan is ridiculous, how are you guys oblivious to why people are taking other roads to watch shows and movies?\n\nThat's it, i couldn't give less of a ...   i'm canceling my sub.",
        "upvotes": 40,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1otcxn2/another_price_hike_are_you_guys_serious/"
    },
    {
        "id": "1oth71o",
        "author": "Candiez89",
        "title": "“Beef” on Netflix",
        "content": "Wow. Just wow. I’d never even heard of the tv series “Beef” on Netflix and randomly stumbled upon it when I was browsing Netflix last night looking for something to watch. I ended up binge watching the whole thing in one go, and I have to say it was hands down one of the best tv series I’ve watched in a very long time. It had me laughing, crying, and just feeling all the feels.\n\nSerious credit to the actors, producers, and screenwriters for real. A special shoutout to the actor Steven Yeun in particular, who played the main character, Danny 👏👏🙌... Amazing.\n",
        "upvotes": 23,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1oth71o/beef_on_netflix/"
    },
    {
        "id": "1ot3vhz",
        "author": "Lower_Toe3514",
        "title": "What is that one movie which everyone loves unanimously but you hate it with all your heart?",
        "content": "For me it's Leon - The Professional.\nExcept the opening sequence and Gary Oldman's performance, nothing else felt quite compelling to me as most made it out to be. The pedophilic thread was the boiling point for me as I've never been this uncomfortable in even a disturbing movie, let alone a so-called \"action\" film. I'm familiar with the director's personal life as well as the extended cut and the disgust relating to it just goes on more by the day. Do let me know what is your opinion on this film as well as the films you hate which received critical acclaim.",
        "upvotes": 105,
        "comments": 571,
        "media": null,
        "permalink": "/r/netflix/comments/1ot3vhz/what_is_that_one_movie_which_everyone_loves/"
    },
    {
        "id": "1otckfi",
        "author": "Frosty_Ad_5096",
        "title": "What show or movie is this from?",
        "content": "",
        "upvotes": 15,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1otckfi/what_show_or_movie_is_this_from/"
    },
    {
        "id": "1otfjwb",
        "author": "Sufficient-Curve2951",
        "title": "Jacob Elordi's monster in Frankenstein",
        "content": "Is Guillermo del Toro’s Frankenstein the most humane depiction of the monster? This article makes some good points! Getting emotional over this movie was the last thing I expected but here we are! Monster's tale was beautifully adapted. What do you think?\n\n  \n[https://www.soapcentral.com/entertainment/how-guillermo-del-toro-s-frankenstein-reimagines-mary-shelley-s-monster-details-explored](https://www.soapcentral.com/entertainment/how-guillermo-del-toro-s-frankenstein-reimagines-mary-shelley-s-monster-details-explored)",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1otfjwb/jacob_elordis_monster_in_frankenstein/"
    },
    {
        "id": "1otgv3x",
        "author": "jaguaraugaj",
        "title": "Gunslingers - WTF",
        "content": "I love Westerns, but after Nicolas Cage spoke, I thought I was watching Idiocracy. So terrible, why has the quality of simple movie production become such a problem?",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1otgv3x/gunslingers_wtf/"
    },
    {
        "id": "1osywvk",
        "author": "GeneralIronsides2",
        "title": "Finished Death by Lightning and....",
        "content": "It is so well put together, and I was blown away by the fact that a lot of what happened in the show was pretty faithful to what actually happened, Charles Guiteau did become apart of a free loving commune, and was a failure at everything he did in life. Garfield was a Civil War hero and a abolitionist, and he didn't initially want his parties nomination, and is considered one of the last 'log cabin' Presidents, because he like Lincoln was born in a log cabin. Guiteau had hidden the gun in his pocket and the police only found it after taking him to the police station, and the first metal detector was used on Garfield. Guiteau's brain was actually studied, and its thought that his actions may have been due to syphilis, though of course in the 1880s medical tests like that were very unreliable. And Chester Arthur passed a lot of Garfield's corruption reforms. The score was great, made by the same composer that did Game of Thrones and Iron Man. I also thought they nailed Michael Shannon's look, his beard looks very similar to Garfield's pictures. Betty Gilpin's performance was so convincing.",
        "upvotes": 37,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1osywvk/finished_death_by_lightning_and/"
    },
    {
        "id": "1ot7z4m",
        "author": "purple_jelly30",
        "title": "Can someone suggest me shows similar to Derry girls ?",
        "content": "I really loved the show and also I enjoyed the accent so I’m looking for something as refreshing , funny and light as Derry girls. Please do recommend me some ! ",
        "upvotes": 6,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1ot7z4m/can_someone_suggest_me_shows_similar_to_derry/"
    },
    {
        "id": "1othirf",
        "author": "Different_Paint7862",
        "title": "How to contact customer service?",
        "content": "A subscription charge was put onto my bank account for 13£ but I never signed up to make an account. I suspect someone is using my details, and I’m trying to contact netflix through their customer service but cannot find any information.\n\nIf anyone has their customer service information, I would really appreciate it. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1othirf/how_to_contact_customer_service/"
    },
    {
        "id": "1otgq6i",
        "author": "infectiousparticle",
        "title": "Priority Viewing 2024-2025?",
        "content": "I only let myself have one streaming subscription at a time, technically I should make myself finish Yellowjackets first but I just heard about the Perfect Neighbor movie, having had followed the case I went to impulse-subscribe to watch it, but I already know the real story, so for $18, what else is worth my time? I haven’t had Netflix in over a year so the only other thing that comes to mind is Squid Games S2.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1otgq6i/priority_viewing_20242025/"
    },
    {
        "id": "1otfr38",
        "author": "UpsetHealth5516",
        "title": "Do you wish to skip re-caps and intros when binge-watching on mobile with less sit-ups?",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1otfr38/do_you_wish_to_skip_recaps_and_intros_when/"
    },
    {
        "id": "1oteq9z",
        "author": "Sufficient-Curve2951",
        "title": "Heweliusz",
        "content": "Just got to know the real story through this article! A great tragedy indeed but the Systematic failure and the cover-up are honestly a shame.\n\n[https://www.soapcentral.com/shows/heweliusz-the-tragic-real-life-ferry-disaster-inspired-netflix-s-latest-polish-historical-drama](https://www.soapcentral.com/shows/heweliusz-the-tragic-real-life-ferry-disaster-inspired-netflix-s-latest-polish-historical-drama)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oteq9z/heweliusz/"
    },
    {
        "id": "1ot5b3c",
        "author": "AccurateWin9104",
        "title": "Suggestions please",
        "content": "Have watched Breaking bad, Haunting of hill house, Better call Saul, Osama bin laden documentary, Boston bombings, currently watching John Wayne Gacy tapes.\nAny suggestions for suspense, thriller series on Netflix?",
        "upvotes": 5,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1ot5b3c/suggestions_please/"
    },
    {
        "id": "1ot8s1o",
        "author": "redflost",
        "title": "Extra Member",
        "content": "Is it possible to take someones Extra Member account and add it to my Netflix account now we live together?\n\nBasically this person was an Extra Member on my account but now we live together I want to cancel the Extra Member and add them to my household without losing any profile data. Is this possible?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ot8s1o/extra_member/"
    },
    {
        "id": "1ot0cdi",
        "author": "Scenora",
        "title": "Would you recommend Frankenstein to others?",
        "content": "Hey everyone! I just finished watching Frankenstein and really enjoyed it. \n\nDo you think it’s worth recommending to others? Would love to hear what you all think!",
        "upvotes": 7,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1ot0cdi/would_you_recommend_frankenstein_to_others/"
    },
    {
        "id": "1otbg1s",
        "author": "MotiveGFX",
        "title": "Next Gen Chef. Suprisingly good cooking competition….but!",
        "content": "Disclaimer: soft spoilers only. I dont spoil anything that would prevent you from watching the show! I dont mention any eliminations either or who won. Im still 2 episodes left in the show.\n\nThe host herself Olivia Culpo while attractive gives off the sense she knows absolutely nothing about food. She also offers no color commentary or anything interesting besides her plasticy faces she makes. It seems the only reason she got the job was because shes semi known by people and considered pretty.\n\nThe blonde judge seems to want to funk the contestant Sidney the whole time in a weird way… on top of that, he was saved in a situation where he shoulda been chosen to leave over a more capable chef. Then in another challenge for the bottom 3, the judges chose something that he was very good at as he exclaimed proudly that he started off his careeer doing just that for many years… which they all had to know! I feel like this was planned to purposely save him. \n\nCarla should have been booted a while back for not listening to feedback from the overseer chefs like 3 different times. \n\nWhen they chose Courtney to be head chef in brigade challenge, she clearly didnt kno what the fucc to do. Yet they didnt put her on the chopping block.\n\nNikki is lowkey hot af. When she is wearing jus her tanktop for in between shot interviews, holy crap she looks like a pornstar.\n\nThe clear standout in this entire show is Andrew. He is leagues beyond any of the contestants. \n\nIlke always seems like the bottom contestant but always surprises everyone. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1otbg1s/next_gen_chef_suprisingly_good_cooking/"
    },
    {
        "id": "1ostvhi",
        "author": "StandardConscious140",
        "title": "just finished Adolescence",
        "content": "I honestly wasn’t ready for this show.I thought *Adolescence* was just another teen Netflix drama but halfway through, I had to pause it because I started crying. As a mom, watching that boy get bullied, isolated, and then drift into those dark online spaces hit me *hard*. My son is 13, and lately he is been quieter, more defensive about his phone, and sometimes I catch glimpses of mean comments on his messages. The show made me realize how blind we parents can be when it comes to what happens behind screens. The way social media, group chats, can turn toxic so fast… it honestly scares me.\n\nSo now I am looking for real advice, What do you all actually use to protect your kids online?(tools, apps,research)please suggest in the comments",
        "upvotes": 16,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ostvhi/just_finished_adolescence/"
    },
    {
        "id": "1ot772n",
        "author": "theartdepartmentntx",
        "title": "\"Girls Incarcerated - WHERE Are The Brushes?\"",
        "content": "I know I am super late to the party, and this is actually my second watch through. I once again find myself thinking, rudeness and aggression aside, does not one girl own a brush? Maybe it's because I have a daughter but it baffles me that none of these girls are being told to brush their hair regularly. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ot772n/girls_incarcerated_where_are_the_brushes/"
    },
    {
        "id": "1osagjd",
        "author": "crazyirish71",
        "title": "End credits of House of Dynamite reveal what happened",
        "content": "Spoilers ahead…\n\nWe watched HoD and were loving the suspense but really disappointed by the ending.\n\nWe have the subtitles on all the time and if have English CC subtitles turned on around 1:44:00 when the “Music By” credits appear you hear an explosion in the distance and the subtitles say “explosion” so we took it as Chicago was hit.\n\nAnyone else hear this in the credits?",
        "upvotes": 172,
        "comments": 140,
        "media": null,
        "permalink": "/r/netflix/comments/1osagjd/end_credits_of_house_of_dynamite_reveal_what/"
    },
    {
        "id": "1ose2y2",
        "author": "Curious_Natural_1111",
        "title": "Guillermo del toro Frankenstein is an aesthetic sight",
        "content": "One of the most cinematic movie I have watched this year. Right from the beginning, the way flame was captured in the frozen night was breathtaking. Loved he costumes, the lightening, the set, just brilliant. Oscar Isaac really pulled off the role of mad scientist. \n",
        "upvotes": 86,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1ose2y2/guillermo_del_toro_frankenstein_is_an_aesthetic/"
    },
    {
        "id": "1ot7w0w",
        "author": "___enthusiast",
        "title": "Old show about MK ULTRA?",
        "content": "In 2017/2018 I watched a series in Netflix about a small town and something to do with MK ULTRA. There was a young boy who's father was in the army, and his mother was a nurse I think? \nI can't remember for the life of me what the show was called and I can't find it anywhere online. \nDoes anyone know what it could be?? ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ot7w0w/old_show_about_mk_ultra/"
    },
    {
        "id": "1ot2u2h",
        "author": "1mountaingoat",
        "title": "Error (-121) \"Please make sure your device has Internet connectivity and the Date and Time settings are accurate\"",
        "content": "Recurring error. Started appearing randomly and won't go away. I have factory reset the TV, reinstalled the app, hard reset modem/router. I have connected the TV via Ethernet and i have verified that the date/time are correctly set. This is the only app on the TV that doesn't work. I'm at a loss; what can i try next? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ot2u2h/error_121_please_make_sure_your_device_has/"
    },
    {
        "id": "1osr7lq",
        "author": "JettaLove",
        "title": "I loved The Asset! What should I watch next?",
        "content": "I really loved the series The Asset and am trying to find something else to watch now. Any suggestions??? I am watching Lazarus now but can’t quite get into. I love a good detective/cop “catch the killer” show. My favorite is probably The Killing. Anyway would love to hear your opinions! TIA",
        "upvotes": 5,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1osr7lq/i_loved_the_asset_what_should_i_watch_next/"
    },
    {
        "id": "1ot3ew4",
        "author": "Original_Giraffe_830",
        "title": "infinity train: book 1",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ot3ew4/infinity_train_book_1/"
    },
    {
        "id": "1ot1l90",
        "author": "rp2784",
        "title": "Interface main show skipping past the next show.",
        "content": "As scroll through the shows. I find that the main window will skip past the next show that is just to the right of it. Is that a bug or planned design?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ot1l90/interface_main_show_skipping_past_the_next_show/"
    },
    {
        "id": "1otb0jw",
        "author": "mr-bonsai-",
        "title": "Frankenstein was very inaccurate to the book and I'm disappointed.",
        "content": "**\\*\\*THERE ARE BOOK SPOILERS IN MY POST.\\*\\***\n\nI've long awaited to watch this movie. I thought to myself 'finally, an accurate depiction of the book!'\n\nNope.\n\nThe book is not even that long and I saw a very accurate depiction in a graphic novel so there's no excuse in terms of time constraint. In fact, they could've accurately depicted the book in less time than the time they took to produce the version they did.\n\nThe only true thing they didn't get wrong was that the monster was very large, athletic and intelligent. However, he wasn't wolverine and didn't have the ability to heal himself.\n\nThere was no old dude that was his friend and taught him everything. He watched a family from a barn for a long time and learned to be human that way. When he revealed himself to them to be 'a part of their family' they all screamed and he ran off.\n\nThey dragged the romance between Elizabeth and Victor and the monster far too long. In actuality Elizabeth was Victor's adopted sister that he ends up marrying and she is killed by the monster in the middle of the night after their wedding as seen by no one except Victor himself. He actually did agree to make him a companion but had a change of heart and destroyed it which made the monster get revenge, 'a bride for a bride'.\n\nThey also never 'made up' at the end... Victor Frankenstein hated the creature until his dying breath and the creature self immolated at the end of the book. There was no happy ending.\n\nThe actual events, far more cool and interesting, could have been made into an accurate movie and been shorter than the shit they made.",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1otb0jw/frankenstein_was_very_inaccurate_to_the_book_and/"
    },
    {
        "id": "1osjh0f",
        "author": "Historical-Egg-9194",
        "title": "Million dollar secret was a great reality show.",
        "content": "Loved it alot won't spoil anything but the way they build up the characters emotions and relationships every elimination dinner you wouldn't be sure who would get voted out and there was never a clear favourite to win it. The show was well done and very good. Recommend it to anyone who likes reality tv.",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1osjh0f/million_dollar_secret_was_a_great_reality_show/"
    },
    {
        "id": "1oswzdv",
        "author": "Dr_Valen",
        "title": "How does Netflix determine a household?",
        "content": "My Netflix has been giving me popups about not being in the household even tho I'm at home and have never used it outside my house for months now. I tried chatting with support but they're basically useless how does Netflix determine the household? Is it IP based cause all the devices getting the issues are in the same network? Is this stupid program just broken? ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1oswzdv/how_does_netflix_determine_a_household/"
    }
]