[
    {
        "id": "1k4dsjk",
        "author": "CheechAndChongAMA",
        "title": "Hey r/movies! I'm David Bushell, director of CHEECH &amp; CHONG’S LAST MOVIE, the new doc that stars Cheech &amp; Chong and traces their legacy as groundbreaking comedians &amp; counterculture icons. I’ve produced other films like SLING BLADE, ETERNAL SUNSHINE OF THE SPOTLESS MIND and DALLAS BUYERS CLUB. AMA!",
        "content": "Hey r/movies! - I'm David Bushell (you can call me Dave), director and producer of CHEECH &amp; CHONG’S LAST MOVIE, the new “movie-mentary” that stars Cheech and Chong and traces their legacy as groundbreaking comedians and counterculture icons. I’ve produced and executive produced other films like SLING BLADE, ETERNAL SUNSHINE OF THE SPOTLESS MIND and DALLAS BUYERS CLUB! I'll be back at 7:00pm ET today to answer your questions. Ask me anything!\n\nMore info:\n\nOfficial Trailer:\n\n[https://www.youtube.com/watch?v=yFZaR4ubS20](https://www.youtube.com/watch?v=yFZaR4ubS20)\n\nCHEECH &amp; CHONG’S LAST MOVIE – Exclusively in Theaters Friday 4/25 🥦\n\nIn the 1970s, Cheech &amp; Chong redefined stand-up comedy, blending drugs, sex, rock’n’roll, and improvisation into a genre-shaping act. Their multicultural, irreverent humor turned them into icons, counterculture rock stars, and Hollywood legends. How did Cheech and Chong ignite imaginations and stay relevant over 50 years? Join them for one last ride to find out... and bring a bud!\n\nDirected by: David Bushell\n\nProduced by: David Bushell and Robbi Chong\n\nStarring: Cheech Marin and Tommy Chong\n\n",
        "upvotes": 156,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/tty7wplwy6we1.png?auto=webp&amp;s=b8633f16ea613ba7bfa1e29fea679d8226484a9a"
        },
        "permalink": "/r/movies/comments/1k4dsjk/hey_rmovies_im_david_bushell_director_of_cheech/"
    },
    {
        "id": "1k4dndi",
        "author": "indiewire",
        "title": "'Sinners' Packs in Lots of Irish Music, Ryan Coogler Explains",
        "content": "",
        "upvotes": 411,
        "comments": 49,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-WRxuEXw0yGXZbLfKzWkMuCNmxKRMW0EKAG8S-SOuJU.jpg?auto=webp&amp;s=143bb5eeb21faa5231cf8bc05750ff29b323acfe"
        },
        "permalink": "/r/movies/comments/1k4dndi/sinners_packs_in_lots_of_irish_music_ryan_coogler/"
    },
    {
        "id": "1k4gzgb",
        "author": "cruelsummerbummer",
        "title": "Weapons | Teaser",
        "content": "",
        "upvotes": 166,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/d0jpE60recb7ladjZGPmzpGfhiC3Z_CUcxE-8CmK3TE.jpg?auto=webp&amp;s=596c4516c3309855c4ecc76a2c56546281f521b6"
        },
        "permalink": "/r/movies/comments/1k4gzgb/weapons_teaser/"
    },
    {
        "id": "1k4ez4h",
        "author": "JazzlikeTea7432",
        "title": "Remember when Tom Hanks who made a great transition from successful comedy films to a big bunch of drama films. Which other actors who started off comedy made a big jump to a dramatic actor?",
        "content": "Tom Hanks in his beginning run in Hollywood had a bunch of comedy films success like Splash 1984, even one of the film with Dan Aykroyd released in 1987 I can't remember the name of it, Big 1988, Turner and Hoach 1989, The Burbs 1989, A league of their own 1992 and others. But until he did Philadelphia 1993 he became a dramatic actor and even he did Forrest Gump afterwards he had a great transition.\n\nBut which other actors who started out comedy then became a dramatic actor just like Tom Hanks did the jump from a goofy actor to serious actor well any suggestions about this?",
        "upvotes": 214,
        "comments": 395,
        "media": null,
        "permalink": "/r/movies/comments/1k4ez4h/remember_when_tom_hanks_who_made_a_great/"
    },
    {
        "id": "1k3wc44",
        "author": "ShoebillJoe",
        "title": "Little Miss Sunshine hits HARD in 2025",
        "content": "I (37 M) cried multiple times on this rewatch. A family is struggling financially while torn apart by generational gaps, politics, and ethics. Familial failure is held together only by their need to help a little girl. Not to help her win, but to simply participate in her dream. A twisted dream defined by poor American standards. But despite the family's failures, they are brought together by what really mattered the whole time: their love for one another and a common goal. \n\n  \nIt's also a great look at early Carell and Dano. \n\n  \nDoes anyone else miss those feelgood vibes that we were getting in the early 2000s from indie movies before streaming was huge?",
        "upvotes": 4230,
        "comments": 324,
        "media": null,
        "permalink": "/r/movies/comments/1k3wc44/little_miss_sunshine_hits_hard_in_2025/"
    },
    {
        "id": "1k4fcox",
        "author": "RomanReignsDaBigDawg",
        "title": "Miles Caton and Ludwig Göransson perform \"I Lied to You\" from Sinners",
        "content": "",
        "upvotes": 148,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ObQqxYcXYkCxvx7C4cP1Ytisr6YBUy9apPj2XiLQse4.jpg?auto=webp&amp;s=8f6e9850f46f04da89e678793975878deec1e350"
        },
        "permalink": "/r/movies/comments/1k4fcox/miles_caton_and_ludwig_göransson_perform_i_lied/"
    },
    {
        "id": "1k41k7p",
        "author": "indiewire",
        "title": "David Cronenberg Doesn't Care About Movie Theaters",
        "content": "",
        "upvotes": 1002,
        "comments": 215,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/J_TM_5C5PuDRrAR1PRlF0CYjnAbWwOdkwLXKw-aoJGg.jpg?auto=webp&amp;s=4ddb30a8169d727c5c8e94df536e5f344c8a8aff"
        },
        "permalink": "/r/movies/comments/1k41k7p/david_cronenberg_doesnt_care_about_movie_theaters/"
    },
    {
        "id": "1k40i81",
        "author": "Amaruq93",
        "title": "\"The Bride of Frankenstein\" at 90: A 1935 horror sequel that changed movies forever",
        "content": "",
        "upvotes": 1116,
        "comments": 58,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kM8BMACAcIVRdvHlrb1f7z2yid7XmDmLEmhixn5L_kQ.jpg?auto=webp&amp;s=dd662caf40ad6194ed0a74c3b872dd870fc8b032"
        },
        "permalink": "/r/movies/comments/1k40i81/the_bride_of_frankenstein_at_90_a_1935_horror/"
    },
    {
        "id": "1k4bbq0",
        "author": "Polyglotpen",
        "title": "What's one movie scene that just sticks in your head, even years later? What makes it so memorable?",
        "content": "Hey folks,\n\nYou know those movie scenes that just get stuck in your brain and you can't shake them? Not necessarily the best scene ever, or from your favorite movie, but just a single, specific moment that pops up in your head out of nowhere, even years after you've seen it.\n\nWhat's that one scene for you? What movie is it from, and what's so unforgettable about it? Was it something shocking, something beautiful, something weird, or just a really powerful moment?\n\nFor me, it's definitely a few moments from Annihilation. But one that really messed with me was when they get deeper into the Shimmer and you start seeing how the mutations are blending everything together. Like those flowers that had human-like features, or even the way the crew members started to get mixed up with the environment and each other. That whole visual of nature and people merging in this bizarre, unnatural way was so creepy and unsettling. It really made you think about what was happening in that zone. That whole idea of things losing their boundaries and becoming something else… yeah, that sticks with you. Coming from a person with plant biology background may be a reason. \n\nWhat's that one scene for you? Share the movie and what made that specific moment so unforgettable. Let's hear those scenes that are just stuck to your memory!",
        "upvotes": 111,
        "comments": 307,
        "media": null,
        "permalink": "/r/movies/comments/1k4bbq0/whats_one_movie_scene_that_just_sticks_in_your/"
    },
    {
        "id": "1k3iybx",
        "author": "evilangel101",
        "title": "Always loved Jena Malone's and Emily Browning's response to how it feels to play a sexualized female character.",
        "content": "",
        "upvotes": 12863,
        "comments": 933,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/kdzacz0lmyve1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1k3iybx/always_loved_jena_malones_and_emily_brownings/"
    },
    {
        "id": "1k3pmdc",
        "author": "Retrofusion11",
        "title": "Fury Road is absolutely incredible… how did no one die filming this movie",
        "content": "Might be the GOT action film, phenomenal filmmaking. The fact that no one was killed on this movie is actually a feat in its entirely. Is it true that Miller didn't write a script but had each scene sketched and drawn out? either way this movie's failure at the box office will be talked about for years to come. It should of been a success ",
        "upvotes": 2938,
        "comments": 465,
        "media": null,
        "permalink": "/r/movies/comments/1k3pmdc/fury_road_is_absolutely_incredible_how_did_no_one/"
    },
    {
        "id": "1k3sj00",
        "author": "FilmWaffle-FilmForum",
        "title": "What movies did a complete 180 and switched genres halfway through?",
        "content": "From Dusk Till Dawn is the first movie that comes to mind. What starts off as your usually run of the mill crime movie turns into a vampire slasher with a mild emphasis on foot fetishes…\n\nI personally wasn’t a fan of the genre switch but I do respect the originality and risk taking. What other movies made a complete 180 and switched genres halfway through?",
        "upvotes": 1546,
        "comments": 1557,
        "media": null,
        "permalink": "/r/movies/comments/1k3sj00/what_movies_did_a_complete_180_and_switched/"
    },
    {
        "id": "1k3v0jt",
        "author": "LiteraryBoner",
        "title": "Dogma - Alanis Morissette Is God",
        "content": "",
        "upvotes": 1026,
        "comments": 135,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WXuNYgRouaDruIYLtE_vHkVTh98KyXnhq9vSYRgnK8Y.jpg?auto=webp&amp;s=6b68019c952e36c81ec63ccb46926cab98f3e8bd"
        },
        "permalink": "/r/movies/comments/1k3v0jt/dogma_alanis_morissette_is_god/"
    },
    {
        "id": "1k42dln",
        "author": "Bennett1984",
        "title": "The Rutger Hauer Sci-Fi Films That Aren't Blade Runner",
        "content": "",
        "upvotes": 271,
        "comments": 68,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pKTbQJ20RLXQWhWEW0wnY4tvZVRpgL36zC-RfSlCU4c.jpg?auto=webp&amp;s=0966452ed00e281a0eb6b245d83cd92cf45eaa1d"
        },
        "permalink": "/r/movies/comments/1k42dln/the_rutger_hauer_scifi_films_that_arent_blade/"
    },
    {
        "id": "1k3unpu",
        "author": "Pep_Baldiola",
        "title": "Bradley Cooper's Next Directorial “Is This Thing On?” Starring Will Arnett Wraps Production",
        "content": "",
        "upvotes": 803,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QUxgnTIdUrV7D7S9OqMnyWVTGdErlwFbUwxS6kfZwh0.jpg?auto=webp&amp;s=6dcb2fd43bf34db95ee6710133d15605f6132aa8"
        },
        "permalink": "/r/movies/comments/1k3unpu/bradley_coopers_next_directorial_is_this_thing_on/"
    },
    {
        "id": "1k41v80",
        "author": "Chessh2036",
        "title": "I Saw The Devil is one of the intense movies I’ve ever seen.",
        "content": "I finally sat down last night to watch this Korean film and it’s one of the most intense and unsettling revenge films I’ve ever seen. From showing the psychological toll of obsession, and how the desire for revenge can erode a person’s humanity. Questioning whether vengeance is ever truly satisfying—or just turns someone into the thing they hate. I can’t stop thinking about the ending. Nobody won. ",
        "upvotes": 209,
        "comments": 60,
        "media": null,
        "permalink": "/r/movies/comments/1k41v80/i_saw_the_devil_is_one_of_the_intense_movies_ive/"
    },
    {
        "id": "1k4hf0z",
        "author": "chewychubacca",
        "title": "Summer Camp movies to get an 11 year old boy excited about sleepaway summer camp?",
        "content": "All I know about are movies from the 80s and 90s. I'm looking for something more modern, to help excite an ADHD kid about what fun possibilities there are at a sleepaway summer camp. Doesn't have to be particularly realistic, just something that gives an exciting vibe to get a kid over the hump of \"no, i'll hate it\", to \"maybe that will be fun, let's try it\". ",
        "upvotes": 12,
        "comments": 73,
        "media": null,
        "permalink": "/r/movies/comments/1k4hf0z/summer_camp_movies_to_get_an_11_year_old_boy/"
    },
    {
        "id": "1k4159g",
        "author": "uofwi92",
        "title": "Famous Movie Fails",
        "content": "Not blooper mistakes like a stormtrooper banging his head on a door or a continuity error like an American flag having 50 stars in a movie set in 1945.\n\nI’m talking about something like (not a movie scene, but TV) Kevin spilling the chili. \n\nScenes of people dropping things. Of people tripping and falling. Things like that.\n\nI’m always fascinated when I see stuff like that - how do they make it look so real? I know some actors are very talented at pratfalls, but being realistically clumsy is a whole ‘nother level.",
        "upvotes": 163,
        "comments": 212,
        "media": null,
        "permalink": "/r/movies/comments/1k4159g/famous_movie_fails/"
    },
    {
        "id": "1k4abah",
        "author": "teddybluethecurser",
        "title": "What Ever Happened To Baby Jane",
        "content": "What was the light coloured stuff on the plate she gave her for breakfast with the budgie?\nEven looking at a photo online I cannot make out what it is and I’m thinking that being from Australia it’s likely something we don’t have. \nI can make out the tomato and then what may be lettuce underneath (based on pic I saw online), obviously the budgie and then the blob of stuff. \nMy mum and I were wondering what it is. ",
        "upvotes": 25,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1k4abah/what_ever_happened_to_baby_jane/"
    },
    {
        "id": "1k44frp",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - David Bushell - Monday 4/21 at 7:00 PM ET - Director of 'Cheech and Chong's Last Movie' - Exploring their 5-decade career performing stand-up, making records, and starring in hit films. It covers their lives, comedy partnership, and lasting influence on pop culture.",
        "content": "",
        "upvotes": 65,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hkp0zoco14we1.jpeg?auto=webp&amp;s=04eb510faf542f6abf1ce7a72268ac8279254fe5"
        },
        "permalink": "/r/movies/comments/1k44frp/amaqa_announcement_david_bushell_monday_421_at/"
    },
    {
        "id": "1k4cgmv",
        "author": "NeedNewNameAgain",
        "title": "Revisit Lake Placid",
        "content": "There are a number of films that I think perfectly encapsulate their genres, and I'd like to put forth Lake Placid as the epitome of creature-features.\n\nIt's hard to say that it's better than Jaws, which defines the genre, but in terms of the best follow ups, I think Lake Placid and Tremors reign supreme.\n\nAnd while I have a deep love for Tremors (pun intended) I think Lake Placid's dialogue and acting is far superior. \n\nBetty White as a foul-mouth old farm lady, Oliver Platt as a smarmy yet charmy billionaire, and Brendan Gleeson as the dry-witted sheriff absolutely sparkle as the supporting cast, around the fairly boring Bridget Fonda + Bill Pullman leads. \n\nThe CGI is decent, the dialogue is Shakespearean, and the overall product is absolutely stellar. It is everything a 90s movie wanted to be and if you've never seen it do yourself a favor and check it out.",
        "upvotes": 12,
        "comments": 17,
        "media": null,
        "permalink": "/r/movies/comments/1k4cgmv/revisit_lake_placid/"
    },
    {
        "id": "1k3ozwf",
        "author": "AdSpecialist6598",
        "title": "'Ne Zha 2' English Dub Targets Global Market After Record China Run",
        "content": "",
        "upvotes": 486,
        "comments": 43,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0blO6Xq-yMLYU7Az0iiQJW-i45fMeQUpl58pZ4xUmCE.jpg?auto=webp&amp;s=9235b2d0bc96e14a3a5847ea5541c7d26d024761"
        },
        "permalink": "/r/movies/comments/1k3ozwf/ne_zha_2_english_dub_targets_global_market_after/"
    },
    {
        "id": "1k461oa",
        "author": "HoboSnobo",
        "title": "Charlie Brown and the Eternal Eggless Easter: A Study in Animated Despair",
        "content": "",
        "upvotes": 33,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_hVK4b31Rzl4_1UzYDLKAy_NrUiN8TOdIOM_g9EYV9k.jpg?auto=webp&amp;s=2cac02873ff9eb07e596fc0de960d8918d4392e9"
        },
        "permalink": "/r/movies/comments/1k461oa/charlie_brown_and_the_eternal_eggless_easter_a/"
    },
    {
        "id": "1k4ecyo",
        "author": "zero-if-west",
        "title": "Brokeback Mountain 20th Anniversary",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1k4ecyo/brokeback_mountain_20th_anniversary/"
    },
    {
        "id": "1k4638n",
        "author": "Wizzythumb",
        "title": "Dutch guy creates official Hollywood movie trailer music from his attic",
        "content": "(English auto subtitles are available on this video).\n\nMost humble and relaxed non-Hollywood Dutch guy creates official trailer music for productions such as BabyGirl and The White Lotus from his attic in Rotterdam, The Netherlands.",
        "upvotes": 14,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5WW5oGMv_siihWGJnBhDhXWgl__HAu1K95yuILy4eOM.jpg?auto=webp&amp;s=7023d141f897c9c56ff369061df6bad7bda32b30"
        },
        "permalink": "/r/movies/comments/1k4638n/dutch_guy_creates_official_hollywood_movie/"
    },
    {
        "id": "1k3swx3",
        "author": "Any-Tradition7440",
        "title": "Which moment from history has been most frequently portrayed in film?",
        "content": "I’m watching the Crown and its depiction of the Apollo 11 mission, including the interview with the crew. It got me thinking about how many times I’ve seen this event portrayed in different movies and series, across time and genres, due to the historical significance and it’s impact on individual stories, themes and characters. What other historical moments are often portrayed like this and why do you think that is? What’s your personal favorite? \n\nI think a safe bet for a general category of moments might be World War 2, there are so many moments that resonates deeply with audiences and are interesting to portray in media from different perspectives. What else? ",
        "upvotes": 135,
        "comments": 136,
        "media": null,
        "permalink": "/r/movies/comments/1k3swx3/which_moment_from_history_has_been_most/"
    },
    {
        "id": "1k34md7",
        "author": "These_Feed_2616",
        "title": "I sometimes forget how small Leonardo DiCaprio’s filmography is",
        "content": "If you look at his Wikipedia, there’s not many films, there’s only like 20. Plus he only really makes like 1 film every 3-4 years. Really shows how selective and picky he is when it comes to the roles he does, he really makes sure there isn’t any garbage in his filmography, he wants it to be a completely solid resume. ",
        "upvotes": 6475,
        "comments": 796,
        "media": null,
        "permalink": "/r/movies/comments/1k34md7/i_sometimes_forget_how_small_leonardo_dicaprios/"
    },
    {
        "id": "1k3vwg6",
        "author": "deep_sea2",
        "title": "What are some great movies to LISTEN too?",
        "content": "When doing work, I often like to play movies in the background. This means that I often listen to and not watch the movies. What are some movies that are great to listen to without any visuals? This can include movies which are focused on dialogue, but can also include movies with great scores and sound design (e.g. Lynch has great sounds in his movies).",
        "upvotes": 61,
        "comments": 227,
        "media": null,
        "permalink": "/r/movies/comments/1k3vwg6/what_are_some_great_movies_to_listen_too/"
    },
    {
        "id": "1k3fz0c",
        "author": "Clankortio",
        "title": "What are some movies that begin with a break up, and main character moves on?",
        "content": "My long-term girlfriend and I recently broke up, and I’ve been feeling pretty lost. I’m looking for a movie where the main character gets dumped but eventually grows, finds peace, or learns to love themselves or learns to love somebody new. \n\nJust need something hopeful to remind me it gets better. Would really appreciate any recs.",
        "upvotes": 749,
        "comments": 546,
        "media": null,
        "permalink": "/r/movies/comments/1k3fz0c/what_are_some_movies_that_begin_with_a_break_up/"
    },
    {
        "id": "1k3sqjo",
        "author": "ChiefLeef22",
        "title": "Bring Her Back | Official Promo HD | Directed by Danny &amp; Michael Philippou",
        "content": "",
        "upvotes": 65,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YmreGPYEhesVtoRUehySbFYS3S4yVmKOzIa-UFraP4Q.jpg?auto=webp&amp;s=e1ac2fc979b35a8a40f92211a68a1d71714c53f0"
        },
        "permalink": "/r/movies/comments/1k3sqjo/bring_her_back_official_promo_hd_directed_by/"
    },
    {
        "id": "1k4i57h",
        "author": "Zackerz0891",
        "title": "What are your favorite years that had the best run with films in general?",
        "content": "I know I posted this before but I wanted to make it more open ended.\n\n1990-1999 when it comes to black films: House Party, Boyz N The Hood, New Jack City, Malcom X, Sister Act, Boomerang, Deep Cover, Juice, White Man Can’t Jump, Poetic Justice, Sister Act 2, Above the Rim, New Jersey Drive, Waiting to Exhale, Bad Boys, Devil in a Blue Dress, Higher Learning, Friday, Don’t Be A Menace While Drinking Your in The Hood, Dangerous Minds, Dead Presidents, Set it Off, A Thin Line Between Love and Hate, The Nutty Professor, Independence Day, Soul Food, Love Jones, How Stella Got Her Groove Back, The Players Club, He Got Game, Why Do Fools Fall in Love, Life, The Best Man, The Hurricane.\n\nThose films had a great combination of quality acting and box office success. That was an amazing decade when it came to films. Not only that the soundtracks were as massive as the films. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1k4i57h/what_are_your_favorite_years_that_had_the_best/"
    }
]