[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 2,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 13,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1qpcmyc",
        "author": "TinyTanic",
        "title": "Pastel de nata",
        "content": "Ciao a tutte e tutti, sono recentemente stato in Portogallo e mi sono innamorato dei pastel de nata. Qualcuno sa dove poterli trovare (magari anche buoni) a Torino?",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1qpcmyc/pastel_de_nata/"
    },
    {
        "id": "1qpdru7",
        "author": "mart1na71",
        "title": "permanente riccia Torino o Grugliasco",
        "content": "Ciao potreste consigliarmi un parrucchiere economico a torino (qualsiasi zona) o a grugliasco che faccia una buona permanente riccia o mossa ma sotto i 100€ se possibile (se conoscete qualche parrucchiere a nero vanno bene anche quelli)",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qpdru7/permanente_riccia_torino_o_grugliasco/"
    },
    {
        "id": "1qp6e3i",
        "author": "Melodic_Signature193",
        "title": "Vivere a Vanchiglia",
        "content": "Ciao a tutti, vi scrivo per chiedervi un'opinione. Vorrei ritrasferirmi a Torino, dove ho già vissuto gli anni dell'università, per motivi di lavoro e di vita e sono alla ricerca di una casa per una sistemazione un po' a lungo termine.\n\nPremettendo che ho già visto dal vivo mooolti alloggi (e su questo potrei fare un post a parte...), mi è capitata l'occasione di un privato (che in realtà è un conoscente di famiglia e una persona perbene) dove ha vissuto e studiato. L'alloggio si trova al limite di Vanchiglia, in una zona compresa tra corso Regina e lungo Dora Siena, non lontano dal Campus Einaudi ed è perfettamente in linea con quello che sto cercando in termini di spazi (rispetto a tanti buchi che ho visto anche in zone meno centrali).\n\nIo purtroppo non conosco direttamente il quartiere di Vanchiglia, avendo frequentato il Politecnico e avendo vissuto (quando a livello economico si poteva) in zone più centrali, ma a detta di molte persone che ho già sentito e/o ci hanno vissuto (e addirittura cresciute) non è affatto male; da quel che ho capito anche le aree limitrofe (Borgo Rossini) sono in forte riqualificazione e nelle vicinanze dovrebbe sorgere una fermata della M2 (quando si farà). Sulla carta ho visto che è una zona ben servita di tutto, con due-tree linee di mezzi pubblici che attraversano la città e non è lontana dal centro. Quindi anche in termini di investimento per il futuro, mi sembrerebbe una buona mossa.\n\nNon conosco direttamente invece in termini di sicurezza, anche se, anche lì, ho opinioni di amici e conoscenti che sono passati a tutte le ore del giorno e della notte in corso Regina a cui non è mai successo nulla. Non sono comunque una persona che esce fino a tarda notte, la mia prerogativa è più che altro quella di tornare a casa dopo il lavoro anche alle 20:00 o alle 21:00.\n\nIn generale mi sembra comunque un quartiere molto interessante e appetibile della città, pertanto ascolto le vostre opinioni sulla zona e soprattutto sulla micro-zona.\n\nRingrazio sin d'ora che mi risponderà!\n\nEDIT: ho anche aggiunto uno screen \"ad ampio spettro\" della zona.\n\nhttps://preview.redd.it/w5moma8s42gg1.png?width=906&amp;format=png&amp;auto=webp&amp;s=1e4b3dd2354d3bfb6721946fd20a6058954c038a\n\n",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1qp6e3i/vivere_a_vanchiglia/"
    },
    {
        "id": "1qpbxz7",
        "author": "AsvpXIII",
        "title": "VIP KAPPA FUTUR FESTIVAL",
        "content": "Ciao, c’è qualcuno che è stato di recente al Kappa con ingresso VIP?  \nNe vale davvero la pena?\n\nSono già stato con l’ingresso normale e mi ricordo soprattutto file infinite e gente (soprattutto inglesi) che pisciava un po’ ovunque...  \nL’esperienza VIP migliora davvero la situazione o è solo un sovrapprezzo con pochi vantaggi concreti?\n\nGrazie a chi vuole condividere la sua esperienza.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qpbxz7/vip_kappa_futur_festival/"
    },
    {
        "id": "1qpgr4l",
        "author": "clavdiet",
        "title": "Freddezza",
        "content": "Nata e cresciuta a Torino, con gli anni ho realizzato che questa città ha qualche problema. ma è normale che sia cosí difficile fare amicizia o cercare di comunicare con chiunque qui? Come cazzo è possibile che crescendo ho avuto solo amici e gruppi di amici egoisti che mi trattavano male? I giovani non hanno voglia di fare niente, si vergognano di tutto, e ti rispondono male anche a un complimento, tutti sono chiusi e che non sia mai che disturbi il loro gruppo di amici che hanno dalle medie provando a uscire insieme… che problemi ha questa generazione e questa città? seriamente, è deprimente vivere qui. Non aiuta il fatto che non succede mai nulla parlando di eventi. Il massimo che possono fare qui è invitare patrizio official al blackmoon. Chiunque stia decidendo se trasferirsi qui per favore cambiate idea , con la combinazione del clima orribile e gli stronzi che ci abitano, credo che possa essere una delle città piú tristi in italia",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1qpgr4l/freddezza/"
    },
    {
        "id": "1qpcfb5",
        "author": "dieselNoodle",
        "title": "piercer per secondo buco all'orecchio?",
        "content": "ciao, avevo fatto il secondo buco in farmacia e me l'hanno fatto asimmetrico, ora si è chiuso e vorrei rifarlo, stavolta da un piercer. ne conoscete uno che non costi un rene e che sia in zona piazza massaua magari? thx :)",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1qpcfb5/piercer_per_secondo_buco_allorecchio/"
    },
    {
        "id": "1qosw99",
        "author": "walk_onthewild_side",
        "title": "Bar dove conoscere gente nuova",
        "content": "Sono una ragazza trans canadese italiana e ho vissuto a lungo tra Toronto e Atene, città in cui uscire da sola la notte era quasi un rituale. Sono stata a Torino per 1 giorno, 2 mesi fa e me ne sono letteralmente innamorata. Si respira libertà, storia, amore, passione, creatività. Le persone sono un po’ riservate ma si lasciano andare facilmente se vedono che sei aperta all’amicizia vera.\n\nQuando abitavo in grandi città, entravo in un bar qualunque, mi sedevo, e prima o poi succedeva sempre qualcosa: una conversazione che nasceva dal nulla, con chiunque ragazze o ragazzi, persone cis o trans, l’uomo di mezza età che beve in silenzio o quello sposato che si concede una birra al bancone.\n\nSono anche un’artista non una di quelle che si atteggiano da diva, anzi, non me ne ero nemmeno resa conto finché non me l’hanno fatto notare 😅.\n\nA Torino cerco bar che restino aperti fino a tardi, o che resistano alla notte. Posti magari un po’ underground, dove andare da soli non stona, dove si incrociano giovani solitari, età mescolate, persone adulte (dai 25 ai 65), e dove c’è sempre quel personaggio strano che sembra appartenere al locale.\n\nMi attirano le luci basse, quelle che non espongono troppo e lasciano spazio all’immaginazione. Amo i bar labirintici, quelli in cui ti perdi leggermente, ma anche i posti piccoli se hanno un’anima. Vino o cocktail buoni, musica che accompagna senza invadere, prezzi che non ti riportano brutalmente alla realtà.\n\nNon cerco luoghi urlati, affollati, pensati solo per i gruppi. Cerco spazi dove stare, osservare, respirare la notte.\n\nSe non vi va di scriverlo qui e di rivelare i vostri rifugi segreti, potete anche scrivermi in privato 🌒",
        "upvotes": 17,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1qosw99/bar_dove_conoscere_gente_nuova/"
    },
    {
        "id": "1qpc3p0",
        "author": "Pieraldones",
        "title": "Mangiare in zona Lingotto",
        "content": "",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1qpc3p0/mangiare_in_zona_lingotto/"
    },
    {
        "id": "1qpc2gh",
        "author": "Pieraldones",
        "title": "Mangiare in zona Lingotto",
        "content": "Ciao a tutti, tra qualche mese inizierò la magistrale nel polo di economia di Unito e sto facendo una lista di posti dove andare a mangiare per vari contesti.\n\nSu maps ho liste di ristoranti etnici (vari, anche solo regionali), posti più serali e bar da colazioni o merende caratteristiche (sia per vista, sia per offerta del bar, sia per comodità). \n\nHo notato di avere salvato pochi locali in zona Lingotto, Borgo Filadelfia, Santa Rita ecc.. (cioè quelle raggiungibili velocemente a piedi o con pochi minuti di mezzi).\n\nAccetto ogni tipo di consiglio e sono curioso di scoprire cose nuove!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qpc2gh/mangiare_in_zona_lingotto/"
    },
    {
        "id": "1qolakz",
        "author": "Full_Prize_8462",
        "title": "New Bangladeshi in Turin",
        "content": "Buonasera\nI am Bangladeshi and new in Turin.\nI want to go to a Christian church every Sunday, but I don’t speak Italian and my English is very little.\nI am a bit afraid because of language.\nCan someone help me find a friendly church or group where I can join and feel welcome?\nThank you! 🙏😊",
        "upvotes": 19,
        "comments": 19,
        "media": null,
        "permalink": "/r/torino/comments/1qolakz/new_bangladeshi_in_turin/"
    },
    {
        "id": "1qogxmo",
        "author": "Extreme-Birthday-647",
        "title": "Trasferirsi a Torino per lavoro",
        "content": "Ciao a tutti, sto valutando un'offerta di lavoro a Torino. Non conosco molto la città, per questo faccio alcune domande...\n\n  \n1) Come è vivere a Torino, si sta bene?\n\n2) I mezzi pubblici sono affidabili? O serve per forza la macchina?\n\n3) Come affitto si trova qualcosa intorno massimo ai 600€ (no stanze o atra gente, ok monolocali)? Altrimenti quanto è un prezzo \"onesto\" per vivere da soli, in un appartamento anche piccolo/monolocale, ma non catapecchia da schiavi?\n\n4) Devo ancora capire dove sia esattamente il luogo di lavoro, penso in zona San Salvario, in caso per vivere vicino cosa sarebbe più appropriato? (se ne vale la pena)\n\n",
        "upvotes": 9,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1qogxmo/trasferirsi_a_torino_per_lavoro/"
    },
    {
        "id": "1qocchn",
        "author": "NoResponsibility151",
        "title": "Qualche gruppo di trekking a Torino?",
        "content": "Ciao a tutti!  \nMi sono trasferito da poco a Torino e sto cercando un gruppo di trekking o camminate nei dintorni. Ho 30 anni (M)  e mi alleno regolarmente in palestra, quindi cerco soprattutto un modo per rimettermi in movimento all’aria aperta e, allo stesso tempo, conoscere nuove persone in città.\n\nSo che è inverno e che magari non ci sono molti gruppi attivi in questo periodo, ma accetto volentieri consigli o suggerimenti, anche in vista della primavera.  \nGrazie mille a tutti!",
        "upvotes": 14,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1qocchn/qualche_gruppo_di_trekking_a_torino/"
    },
    {
        "id": "1qok9zo",
        "author": "EveningFail3662",
        "title": "[CERCO CONSIGLI] Proprietari a Torino: Quali garanzie cercate oggi in un inquilino?",
        "content": "Ciao a tutti,  \nsto cercando un trilocale (almeno 80mq, vuoto) a Torino. Budget max 600€ di affitto o al massimo con le spese condominiali insieme.  \nSo che il mercato è difficile, quindi sto preparando un \"fascicolo affidabilità\" da presentare ai proprietari per essere scelto subito. Vorrei sapere da chi affitta se queste garanzie sarebbero sufficienti per voi:\n\n* **Storico Pagamenti:** Estratti conto degli ultimi 3 anni con tutti i bonifici di affitto e riscaldamento evidenziati (mai un mese di ritardo).\n* **Lettera di Referenze:** Dichiarazione firmata dall'attuale proprietario che attesta che siamo ottimi pagatori, puntuali e rispettosi dell'immobile.\n* **Iscrizione Lo.C.Are:** Ci stiamo muovendo per iscriverci.\n* **Reddito e Garante:** Entrata fissa tramite ADI per un nucleo con over 70 e presenza di un **Garante con pensione INPS italiana certificabile, residente all'estero.** \n* **Liquidità Immediata:** Possibilità di pagare se necessario, anche **un anno di affitto anticipato più agenzia o sei mesi in anticipo più agenzia**.\n* **Profilo:** Famiglia tranquilla, abbiamo già tutti i mobili (cerchiamo casa vuota), cerchiamo stabilità a lungo termine per permettermi di finire dei corsi e tornare nel mondo del lavoro.\n\n**La mia domanda per voi:** Di fronte a questa documentazione e alla disponibilità di pagare 12 mesi in anticipo, vi fidereste anche senza il classico \"tempo indeterminato\"? Cosa manca secondo voi per rendere questa proposta irrinunciabile? essere iscritti a Lo.C.Are serve?\n\navevo anche sentito parlare di homes4all e cooperativa di vittorio, qualcuno ne ha gia sentito parlare?",
        "upvotes": 4,
        "comments": 54,
        "media": null,
        "permalink": "/r/torino/comments/1qok9zo/cerco_consigli_proprietari_a_torino_quali/"
    },
    {
        "id": "1qoay6r",
        "author": "ElectricalCat9056",
        "title": "Bar carino dove lavorare in Santa Rita",
        "content": "Buongiorno a tutti, vivo da poco vicino a Piazza Santa Rita e lavoro da remoto. Lavorare sempre da casa mi annoia, talvolta vado al Toolbox Coworking ma mi piacerebbe trovare un bar carino e comodo dove potermi piazzare a lavorare tranquillo e, perchè no, fare networking.\n\nConoscete qualche posto? L’ideale sarebbe in Santa Rita o parte sud di Crocetta (Largo Orbassano e dintorni)",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1qoay6r/bar_carino_dove_lavorare_in_santa_rita/"
    },
    {
        "id": "1qo9mug",
        "author": "Nunzz66",
        "title": "Pneumatici invernali, estive con catene a bordo o 4 stagioni?",
        "content": "Ciao a tutti!\n\nA breve mi trasferisco a Torino dalla Puglia e ho un dubbio enorme sulle gomme, visto che non sono abituato a guidare con il clima del nord.\n\nIl punto è questo: ho la macchina praticamente nuova (ha appena 8.000 km) con gli pneumatici estivi ancora perfetti e, sinceramente, mi piange il cuore a doverle \"svendere\" o buttare così presto.\n\nUserò l'auto essenzialmente per fare casa-lavoro in città e prendere la tangenziale, non ho interesse nell'avventurarmi in montagna, secondo voi è fattibile girare con le estive tenendo semplicemente le catene o le calze nel bagagliaio per essere in regola?\n\nLo chiedo anche per una questione pratica: non avrò un garage o una cantina dove conservare il secondo treno di gomme e vorrei evitarmi lo sbattimento (e la spesa) del deposito dal gommista.\n\nVoi che vivete lì, il freddo e l'umidità rendono le estive pericolose anche in città o si può fare? Valuto il passaggio alle 4 stagioni solo se mi dite che con le estive rischio di pattinare alla prima gelata.\n\nGrazie mille per i consigli!",
        "upvotes": 4,
        "comments": 40,
        "media": null,
        "permalink": "/r/torino/comments/1qo9mug/pneumatici_invernali_estive_con_catene_a_bordo_o/"
    },
    {
        "id": "1qoaka6",
        "author": "Imaginary_Stable3987",
        "title": "Torino Hardcore Fest",
        "content": "Ciao raga, cerco gente per andare al Torino Hardcore Fest del 27 e 28 febbraio, se siete interessati scrivetemi in dm cosi ci si organizza",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qoaka6/torino_hardcore_fest/"
    },
    {
        "id": "1qo8edq",
        "author": "Coccorocco1",
        "title": "Ciaspolata easy",
        "content": "Salve a tutti, sto cercando un percorso da fare con le ciaspole questo sabato che sia semplice…conoscete qualche posto?? Grazie mille",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1qo8edq/ciaspolata_easy/"
    },
    {
        "id": "1qnkt4p",
        "author": "Ancient_Tourist_4268",
        "title": "Secondo voi possiamo considerare Moncalieri quasi una parte di Torino?",
        "content": "Moncalieri è la città dell'hinterland di Torino meglio collegata.  \n  \nHa la stazione del treno, una stazione della metro, i bus : 67, 45, 70, 80, 81, 82 e 83  \nLa tangenziale che ti porta direttamente in corso unità d'italia in 3 secondi.  \n\n\nIl parco delle vallere che ti porta direttamente al parco del valentino.\n\nSe vivi nei pressi di Corso Roma dopo il ponte sei praticamente a Torino a piedi e camminando dritto da piazza bengasi in 40/45 min a piedi arrivi a porta nuova o in 15 min in bici.\n\nSecondo voi vista la vicinanza e le infrastrutture efficaci, potremmo considerare Moncalieri come quasi un ''quartiere'' di Torino? ",
        "upvotes": 8,
        "comments": 22,
        "media": null,
        "permalink": "/r/torino/comments/1qnkt4p/secondo_voi_possiamo_considerare_moncalieri_quasi/"
    },
    {
        "id": "1qnqkti",
        "author": "Imaginary_Hour6285",
        "title": "Train me up palestra costo",
        "content": "Qualcuno la frequenta? Avrei bisogno di sapere come vi trovate e quanto pagate?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qnqkti/train_me_up_palestra_costo/"
    },
    {
        "id": "1qnbjhr",
        "author": "Inevitable_Park_5571",
        "title": "Comprare casa a Torino",
        "content": "Buongiorno a tutti, due anni fa mi sono trasferita a Torino per lavoro e ora vorrei comprare casa. Ho trovato diversi appartamenti in Borgo Vittoria (principalmente Via Borgaro, Via Chiesa della Salute, Via Bibiana) uno in particolare è vicino a Piazza della Vittoria. Sapete dirmi se è una zona tranquilla? So che di giorno c'è un mercato molto carino, ma non so come sia di sera. Essendo una ragazza e vivendo da sola vorrei essere sicura di poter tornare a casa la sera senza problemi.  \nGrazie a tutti :)",
        "upvotes": 6,
        "comments": 23,
        "media": null,
        "permalink": "/r/torino/comments/1qnbjhr/comprare_casa_a_torino/"
    },
    {
        "id": "1qnbhn9",
        "author": "Relevant_Ad2728",
        "title": "Qual'è, quali sono...",
        "content": "Buongiorno a tutti, domanda da sconosciuto della zona in quanto provengo da un paesello in provincia di Cuneo che vorrebbe iniziare a frequentare di più la vita quotidiana e notturna di Torino. Qual è la zona, quali sono le zone, più frequentate dai giovani? (23-25+) Conosco giusto via Roma, via Garibaldi per lo shopping, ma volessi che ne so un giorno venire a farmi un aperitivo ecco non saprei dove andare. Conosco zona San Salvario ma non ho mai diciamo esplorato, conosco le panche che non so dove si trovino come zona, seguo turin_hub su Instagram ma funziona per le discoteche principalmente, mi piace molto andare al One e al pick up per esempio. Non voglio che il fatto One/pick up mi tolga diciamo la possibilità di conoscere altri locali con altri generi musicali in quanto sono molto aperto musicalmente, culturalmente e di idee. Insomma ho bisogno di nomi di zone, posti da poterci andare senza che sia necessariamente una disco. Grazie in anticipo!",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1qnbhn9/qualè_quali_sono/"
    },
    {
        "id": "1qmwrlz",
        "author": "SprinklesDue9894",
        "title": "My grandpa was from Torino, his name was Giovanni Francesco Prina, just wondering if anyone who lives there has the same last name and might be a possible relative",
        "content": "",
        "upvotes": 24,
        "comments": 37,
        "media": null,
        "permalink": "/r/torino/comments/1qmwrlz/my_grandpa_was_from_torino_his_name_was_giovanni/"
    },
    {
        "id": "1qn9dsd",
        "author": "eddz_",
        "title": "Any Italian language centers in Torino",
        "content": "Buongiorno, so i am a student here in Torino and i wish to learn the Italian language. Any Language Centers you guys recommend me to apply to here in Torino?\n\n",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1qn9dsd/any_italian_language_centers_in_torino/"
    },
    {
        "id": "1qn2wyo",
        "author": "DaMieleMiao",
        "title": "elettromiografo in prestito/ad un buon prezzo",
        "content": "buonasera, siamo due ricercatori autonomi che hanno pochi soldi ma tante idee di ricerca in mente e necessiteremmo l'aiuto di Torino",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1qn2wyo/elettromiografo_in_prestitoad_un_buon_prezzo/"
    },
    {
        "id": "1qno4zr",
        "author": "asilorepublic95",
        "title": "Non vado al McDonald's da un botto di tempo ,si può pagare con saty? se si ,alla cassa o spunta il QR code sul pos sotto al totem dopo l'ordine?",
        "content": "",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1qno4zr/non_vado_al_mcdonalds_da_un_botto_di_tempo_si_può/"
    },
    {
        "id": "1qnbc7r",
        "author": "Several-Exam3324",
        "title": "Ci sono dei buoni posti dove pranzare?",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qnbc7r/ci_sono_dei_buoni_posti_dove_pranzare/"
    },
    {
        "id": "1qmfieq",
        "author": "EatMeImAMuffin",
        "title": "GATTO SMARRITO CERCA STALLO",
        "content": "ciao a tutti, ieri sera ho trovato questo micetto dolcissimo che vagava perso in zona Aurora/Parco Dora. Ho chiesto in giro nel mio palazzo e quelli vicini, ma nessuno lo reclama. è un maschio, mi sembra non castrato. Ha un carattere davvero calmo e dolce, sicuro è domestico.\n\nIo purtroppo non posso tenerlo, ho già un cane che non va d’accordo con il gatto e temo per l’ incolumità di entrambi.\n\nQualche anima buona riesce a tenerlo in stallo?\n\nGrazie in anticipo anche se farete girare!",
        "upvotes": 69,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1qmfieq/gatto_smarrito_cerca_stallo/"
    },
    {
        "id": "1qnd3ij",
        "author": "Either-Durian3875",
        "title": "Buonjorno everyone!!! Im american and I'm gonna be in turino for a few days and REAAAALLY want to get my hair cut like this.... Does anyone have any hairdresser recs???? Grazie very much ❤️‍🔥🥺🥺",
        "content": "",
        "upvotes": 0,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/arlfyju4eofg1.jpeg?auto=webp&amp;s=de6f8bbe0b8eac3176d07d6c61166c68338c734d"
        },
        "permalink": "/r/torino/comments/1qnd3ij/buonjorno_everyone_im_american_and_im_gonna_be_in/"
    }
]