[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 5,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1mdwtzm",
        "author": "0rk4n",
        "title": "Torino o Urbino? Consigli per scelta universitaria e vita in coppia",
        "content": "Ciao a tutti, io lavoro full remote nell’IT, mentre lei si è appena laureata in Scienze Farmaceutiche (triennale) e ora vorrebbe completare il percorso con la magistrale in Farmacia per poi iscriversi all’albo. Stiamo valutando dove trasferirci e le opzioni sono Torino e Urbino, perché in entrambe le sedi il corso di Farmacia non ha obbligo di frequenza – caratteristica fondamentale, visto che vorrebbe lavorare part-time mentre studia.\n\nPremetto che non siamo mai stati in nessuna delle due città, quindi ci stiamo basando su ricerche online e pareri raccolti qua e là. Vi spiego i dubbi.\n\nUrbino: cittadina molto carina, tranquilla, a misura d’uomo. Non ci piace la movida o la discoteca, quindi da questo punto di vista sarebbe perfetta. È vicina a Pesaro e al mare (ok, non la Sardegna da cui vengo io, ma sempre meglio di niente). Il costo della vita è basso e gli affitti sembrano accessibili. Però… sembra davvero molto isolata. Trasporti scarsi, nessun aeroporto vicino, collegamenti complicati. E mi sembra un po’ carente anche dal punto di vista dei servizi sanitari (mi pare che per molte cose si debba andare a Pesaro).\n\nTorino: città molto più grande e ben servita, sia a livello sanitario che trasporti (aeroporto, treni, ecc.). Più opportunità anche per lei, sia per trovare un lavoretto durante l’università, sia post-laurea. La sede della mia azienda è proprio a Torino, quindi ogni tanto potrei lavorare in sede e conoscere i colleghi dal vivo. Tante cose da fare nei weekend (senza bisogno di essere festaioli): musei, mercatini, montagne vicine, città storiche nei dintorni. Di contro: costo della vita più alto, città più dispersiva, e il corso di farmacia potrebbe essere più impegnativo rispetto a Urbino (lei teme questo).\n\nInfo aggiuntive: ho la macchina, quindi potrei tranquillamente spostarmi anche da zone un po’ più esterne.  \nA Torino, quali quartieri consigliereste per vivere tranquilli ma senza essere troppo isolati? Con un budget di circa 500/600 euro per un bilocale è ancora possibile trovare qualcosa di decente)?\n\nInsomma: qualcuno ha vissuto in una (o entrambe) le città? Come vi siete trovati?E per chi ha studiato farmacia: quanto cambia davvero la difficoltà tra le sedi? E sui costi/zone: che ne pensate?\n\nOra devo in qualche modo \"convincere\" la mia ragazza ahahaaha. In ogni caso é una cosa temporanea, male che vada, post laurea ci si sposta a Torino o altrove (se si sceglie Urbino in quanto l'universitá é piu semplice).",
        "upvotes": 6,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1mdwtzm/torino_o_urbino_consigli_per_scelta_universitaria/"
    },
    {
        "id": "1mdgf9n",
        "author": "asilorepublic",
        "title": "Ma perché se non si conosce la strada a Torino, è così difficile guidare Soprattutto agli incroci con semafori?",
        "content": "Vedo incroci con semafori fatti alla cavolo, cartelli messi alla cavolo sulla carreggiata, proprio come dire io ve l ho messo poi se lo vedete bene se no amen... Ci dovrebbe essere una regola univoca... Agli incroci senza controviali si può svoltare, Mentre quando c'è ilccontro Viale, bisogna prendere quello.. Boh.. Ci voleva tanto? ",
        "upvotes": 25,
        "comments": 49,
        "media": null,
        "permalink": "/r/torino/comments/1mdgf9n/ma_perché_se_non_si_conosce_la_strada_a_torino_è/"
    },
    {
        "id": "1me0l55",
        "author": "Texas-Gold",
        "title": "Laboratorio per Riparazione Piumino (The North Face) a Torino?",
        "content": "Ciao a tutti e a tutte!  \n  \nDurante un'escursione ho danneggiato il mio **piumino (giubotto)** e vorrei farlo riparare. Ha un piccolo **strappo** a L sulla spalla (1.5cm x 1.5cm circa).  \n  \nNon lo uso non solo per le **escursioni** ma anche per la **città** durante l'inverno, quindi cerco qualcuno che faccia un **buon lavoro**, possibilmente **senza spendere troppo**.\n\nStarei cercando qualche **laboratorio** dove effettuano riparazioni in **zona centro**;  se qualcuno ha delle raccomandazioni o sa dove posso portarlo, fatemi sapere!\n\n**Grazie mille**! 😊",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1me0l55/laboratorio_per_riparazione_piumino_the_north/"
    },
    {
        "id": "1mdv5t2",
        "author": "gianfresca",
        "title": "Carte Pokemon",
        "content": "Buongiorno a tutti. Dove posso rivendere carte Pokemon a Torino? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mdv5t2/carte_pokemon/"
    },
    {
        "id": "1mdiifr",
        "author": "lospavaldo",
        "title": "dove si possono fare graffiti a torino legalmente",
        "content": "ciao cerco una zona in cui fare un graffiito in totalmente legale stavo pensando al parco dora qualcusa sa indicarmi dove farli?",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1mdiifr/dove_si_possono_fare_graffiti_a_torino_legalmente/"
    },
    {
        "id": "1mdhm4u",
        "author": "Lost_Spring_3298",
        "title": "Gruppo uscite: nuova vita sociale",
        "content": "Ciao a tutti, ragazzi e ragazze!  \nMi chiamo Thomas, oggi faccio 24 anni, e sono di Torino. Volevo sapere se ci fosse qualcuno che, come me, ha come obiettivo quello di migliorare la vita sociale e conoscere persone nuove. Sicuramente per \"vita sociale\" non intendo avere qualche conoscente in più da poter salutare una volta ogni due anni, ma delle persone con cui potermi confrontare, uscire, divertire, fare serate, viaggiare ed ovviamente puntare in alto.  \nSe sei in questa situazione fammi sapere, o addirittura se conosci gruppi, pagine o eventi al quale potrebbero essermi d'aiuto, ben venga!\n\nVolete sapere nel caso più su di me? Lavoro nel mondo dell'IT in una multinazionale (per fortuna c'è una sede proprio qui a Torino), mi piace pertanto l'informatica, la formula 1, le auto, la moda, i videogiochi, viaggiare, la palestra e... un mucchio di altre cose che non mi vengono in mente (la finanza forse?)  \nSto cercando di puntare in alto sia come persona che a livello professionale. Reputo di avere la \"testa sulle spalle\", nonostante mi piaccia sognare e sto ancora pian piano cercando di trovare la mia strada.\n\nFatemi sapere! Nel caso vi aspetto numerosi. Chissà, magari un gruppo di uscite, pieno di vita?",
        "upvotes": 5,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1mdhm4u/gruppo_uscite_nuova_vita_sociale/"
    },
    {
        "id": "1md1jnt",
        "author": "HolidayScallion8502",
        "title": "lavori notturni",
        "content": "ma vi sembra normale che in via berthollet zona San salvario facciano i lavori con martello pneumatico alle 1.30 di notte? \nAnticipo che faccio cameriere di sala quindi non è una lamentela legata al mio orario lavorativo, ma proprio di disturbo del sonno.\nchissene frega se durante la giornata viene bloccata una via porcamadonna, lasciate la gente dormire e imparate a muovervi senza macchina figli di troia.",
        "upvotes": 22,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1md1jnt/lavori_notturni/"
    },
    {
        "id": "1md00xy",
        "author": "No_Bug_3501",
        "title": "Techno in Turin",
        "content": "heyoooooo\n\nI came across this post 'cause I’ll be in Turin for a month in October, and I was checking out all the events on Resident Advisor — between Azimut Club, Q35 Warehouse, and Club To Club in November (which I already knew about)!\nHonestly, I was blown away by how many big-name artists they bring in every weekend. I had no idea Turin had such a solid international club scene! :)\nEven the ticket prices seem super low to me.\nIs the city really that cheap overall? Anyone got tips on how to live there for a month without breaking the bank?\n\n",
        "upvotes": 28,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/k5m8q3pupyff1.jpeg?auto=webp&amp;s=00948c1609f906ed42e9a98185e8071a2ffeecc1"
        },
        "permalink": "/r/torino/comments/1md00xy/techno_in_turin/"
    },
    {
        "id": "1md9c3d",
        "author": "_pigreco_",
        "title": "negozi streetwear torino e provincia",
        "content": "intendo negozi dove poter trovare della roba bella e delle chicche, non foot looker e aw lab. e risparmiate atipici, che oltre al fatto che sia stato fondato dal tipo dei duplici l’ho sempre trovato uno scam. ",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1md9c3d/negozi_streetwear_torino_e_provincia/"
    },
    {
        "id": "1mdbwwy",
        "author": "Pharrus",
        "title": "Pagamenti Passaporti Torino",
        "content": "Ciao a tutti, devo richiedere il passaporto e devo fare i pagamenti di 73.50 e 42.50, mi hanno detto degli amici che si possono fare anche ai tabacchini, sapete mica quali lo permettono o se ci sta qualche sito per vederlo?  \nGrazie mille a tutti.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1mdbwwy/pagamenti_passaporti_torino/"
    },
    {
        "id": "1mde1pn",
        "author": "Zestyclose-Tank9125",
        "title": "Edisu piemonte accomodation",
        "content": "CIAO! Sto richiedendo il contributo alloggio EDISU Piemonte per l'a.a. 2025/26, e ho visto che la data effettiva di trasloco è dal 2 ottobre in poi. Ma per quelli di voi che hanno ottenuto l'alloggio negli anni precedenti, quando avete potuto trasferirvi esattamente? Le mie lezioni iniziano il 22 settembre e non sono sicuro di cosa facciano di solito le persone nel frattempo. La maggior parte degli studenti trova un alloggio temporaneo per quei primi giorni? Grazie!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mde1pn/edisu_piemonte_accomodation/"
    },
    {
        "id": "1mddrqt",
        "author": "Olengu-29",
        "title": "Negozio attrezzature/utensili da cucina",
        "content": "Ciao!\nMi chiedevo se a Torino ci fosse qualche negozio di attrezzature da cucina professionali, con padelle, coltelli e utensili di ottima qualità e non il solito Kasanova",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1mddrqt/negozio_attrezzatureutensili_da_cucina/"
    },
    {
        "id": "1mdbw0s",
        "author": "Ilovefootball_it205",
        "title": "Amicizie",
        "content": "Ciao a tutti! Sono un ragazzo di 17 anni della zona di Torino. Mi farebbe piacere conoscere ragazzi e ragazze più o meno della mia età per uscire, chiacchierare e fare nuove amicizie 😊\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mdbw0s/amicizie/"
    },
    {
        "id": "1md79o6",
        "author": "Flukierx9",
        "title": "Dubbio su punteggio tolc per scienze biologiche",
        "content": "Ciao a tutti, ho fatto 32,25 punti al tolc b, vorrei fare richiesta per il corso di scienze biologiche di torino.\nQualcuno sa se è un punteggio con cui ci sono buone probabilità di entrare? È meglio riprovare il mese prossimo per aumentare il punteggio?\nGrazie in anticipo",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1md79o6/dubbio_su_punteggio_tolc_per_scienze_biologiche/"
    },
    {
        "id": "1md4f1x",
        "author": "irmakinon",
        "title": "Parcheggio",
        "content": "Salve, non sarò in Italia per due mesi. Potreste indicarmi un parcheggio economico dove posso lasciare la mia macchina",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1md4f1x/parcheggio/"
    },
    {
        "id": "1mcd0zs",
        "author": "MoSeMagna",
        "title": "A Torino c’è chi fa solo fiordilatte. Ma c’è più di un modo per farlo bene.",
        "content": "",
        "upvotes": 14,
        "comments": 26,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/nnf0x6joptff1.jpeg?auto=webp&amp;s=12a417944c1b66260268792e54649a86a2768762"
        },
        "permalink": "/r/torino/comments/1mcd0zs/a_torino_cè_chi_fa_solo_fiordilatte_ma_cè_più_di/"
    },
    {
        "id": "1mce4i5",
        "author": "glorious-ahole",
        "title": "How is Mirafiori Sud as an area",
        "content": "I am shifting soon to Mirafiori Sud, specifically Via plava and wanted to know how the area in general is..like is it safe? The apartment is good but the only problem is that it's a bit far from downtown. However I'm fine with it because its very close to the place I work",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1mce4i5/how_is_mirafiori_sud_as_an_area/"
    },
    {
        "id": "1mcglei",
        "author": "External_Cow_2392",
        "title": "Cerco ragazz*(non discrimino nessuno) per fare urbex",
        "content": "Un gruppo per fare urbex e magari registrare anche chi ci sta? \nPremessa ho 20 anni e soni maschio",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1mcglei/cerco_ragazznon_discrimino_nessuno_per_fare_urbex/"
    },
    {
        "id": "1mc6w8v",
        "author": "NoAttention795",
        "title": "Orchestra a Torino?",
        "content": "Ciao a tutti! Vado a Torino a febbraio per l'Erasmus e volevo sapere se c'è qualche orchestra in città con ingresso libero. Sono una violista :)",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mc6w8v/orchestra_a_torino/"
    },
    {
        "id": "1mc8nl6",
        "author": "Charming_Mind4890",
        "title": "Zona rebaudengo",
        "content": "Purtroppo per cause di forza maggiore dovrò trasferirmi da zona san paolo a rebaudengo, mannaggia mi divertivo troppo al gabrio. Ho 19 anni e mi piacerebbe sapere com'è la zona.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1mc8nl6/zona_rebaudengo/"
    },
    {
        "id": "1mc8hsq",
        "author": "jk-9551",
        "title": "Informazioni mirafiori sud",
        "content": "Salve a tutti, mi sono recentemente trasferito a Torino in zona lingotto vicino al politecnico.\nHo trovato una palestra a sud del grattacielo regione Piemonte. Siccome si trova vicino al quartiere mirafiori sud volevo sapere se la zona sarebbe abbastanza sicura di sera (gli orari che frequenterei sono appunto serali)",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mc8hsq/informazioni_mirafiori_sud/"
    },
    {
        "id": "1mbsew7",
        "author": "blunathan",
        "title": "la mia ragazza insegna italiano agli stranieri. c'è un qualche posto o evento dove lei possa portare il suo studente tedesco a parlare italiano?",
        "content": "È  un tedesco di 55 anni che non parla tanto italiano È si deve allenare. sarebbe fantastico un posto in cui potersii allenare con frasi semplici o banalmente qualcuno con cui chiacchierare senza essere mandato a quel paese. magari una qualche attivita.eventi? party? Avete delle idee? lui sarà a Torino dal 31 luglio all'8 agosto\ngrazie mille!",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1mbsew7/la_mia_ragazza_insegna_italiano_agli_stranieri_cè/"
    },
    {
        "id": "1mbp3ip",
        "author": "ookeyboomer",
        "title": "chi vuole venire allo zoom? costa troppo ma lo prendiamo scontato insieme",
        "content": "ciao ragazzi, i biglietti dello zoom costerebbero : \n26€ ingresso\n7€ piscina\n3€ oasi delle farfalle\n\nper un totale di 36€ a testa\n peró se acquisitamo 5 biglietti, tutto questo sarebbe a 19€ a testa (praticamente ti regalano la piscina, e l'ingresso costerebbe solo 16€) \n\na me servono 2 biglietti \nriesco a trovare tre persone che mi danno 47€ per avere tre ingressi all inclusive? \n(19x3, ingresso, piscina e farfalle)\n",
        "upvotes": 5,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/742n7kjmxnff1.jpeg?auto=webp&amp;s=b21d374c205c6ee7184d4053683cf397014ff473"
        },
        "permalink": "/r/torino/comments/1mbp3ip/chi_vuole_venire_allo_zoom_costa_troppo_ma_lo/"
    },
    {
        "id": "1mbhwae",
        "author": "SidYato",
        "title": "Zone dove comprare casa",
        "content": "Ho 28 anni e sto cercando di comprare casa a Torino perché dopo anni di case condivise con vari coinquilini ho la necessità di andare a vivere da solo. \nHo cercato un po’ in Parella, Campidoglio e Pozzo Strada, ma trovare un buon compromesso tra prezzo e immobile, considerando che ho un budget massimo di 130/140k euro, è davvero complicato.\n\nStavo quindi pensando allargare la mia ricerca e guardare un po’ più in periferia visto che sono comunque automunito, ma quali sono le zone migliori in cui cercare? Vorrei evitare di comprare in una brutta zona dove non posso manco farmi un giro a piedi",
        "upvotes": 8,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1mbhwae/zone_dove_comprare_casa/"
    },
    {
        "id": "1mbx47a",
        "author": "dkroods",
        "title": "Ora compatibile con oltre 5.000 dispositivi in più!",
        "content": "Ciao a tutti!  \nSiamo felici di annunciare un nuovo aggiornamento per *Take It Easy Torino*, l'app pensata per rendere la vita in città un po’ più semplice.\n\n**🆕 Novità principali:**\n- ✅ Supporto esteso: ora compatibile con **oltre 5.000 dispositivi in più**!\n- ⚡ App più **veloce**, **fluida** e **reattiva**.\n- 📊 Dati aggiornati e ottimizzazioni interne per offrirvi un’esperienza ancora migliore.\n\nGrazie a tutti per il supporto e i feedback! Se non l’avete ancora provata o volete aggiornare, è il momento giusto.  \nE come sempre, fateci sapere cosa ne pensate – ogni consiglio è prezioso. 🙌\n\n**📲 Download the app and take it easy!**\n\n➡️ [Scarica per Android](https://davomelkumyan40.github.io/TakeItEasy.github.io)  ",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EpYyQODxl6eljubkP760TGO7x_pny1FRo7fS3IDdcfI.jpeg?auto=webp&amp;s=d885862ca52d637caa091ac0189af5f9076f03ad"
        },
        "permalink": "/r/torino/comments/1mbx47a/ora_compatibile_con_oltre_5000_dispositivi_in_più/"
    },
    {
        "id": "1mblgwu",
        "author": "barelyheard",
        "title": "Cheapest Roll of film?",
        "content": "Hi guys, I always get my films when i’m in my country because sometimes the prices seem way overprices here - Marvin sells the most basic Kodak Colorplus for 22 euros 😳\n\nBut i’m in need of some rolls soon for a trip and wanted to know if someone knows a place that sells rolls for less. Something around 10-12 euros for Colorplus so I can get multiple. \n( Already tried RTP and reflessi in Crocetta :/) ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1mblgwu/cheapest_roll_of_film/"
    },
    {
        "id": "1mb8kzm",
        "author": "Head-Share500",
        "title": "Come possono parcheggiare le macchine straniere?",
        "content": "Ciao a tutti, qualche giorno fa ho parcheggiato la mia auto in via Nizza e ho usato un’applicazione per parcheggiare. Mentre scendevo dall’auto ho visto una famiglia composta da madre, padre e due ragazzine di circa 10-12 anni, davanti alla colonnina per pagare il parcheggio che cercavano di capire come procedere. Mi sono avvicinata per aiutarli, erano tedeschi ed erano qui in vacanza. Quando è arrivato il momento di inserire la targa, il,parcometro si bloccava perché era una targa straniera. Ho provato un paio di volte ma non sono riuscita ad arrivare alla fine. Mi sono chiesta se era un problema di quella colonnina oppure se tutte le colonnine rifiutano le targhe straniere, perché se così fosse come fanno gli stranieri a pagare il parcheggio a Torino?",
        "upvotes": 14,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1mb8kzm/come_possono_parcheggiare_le_macchine_straniere/"
    },
    {
        "id": "1mao0hj",
        "author": "Pale-Diamond-6384",
        "title": "Affittare in Barriera",
        "content": "Ciao amici!\n\nSto valutando l'acquisto di un immobile da affittare e ho trovato una casa interessante e cheap in questa zona. So che Barriera di Milano e abbastanza spicy (e quindi ancora relativamente economica), ma non vivendo più a Torino da qualche anno non so bene com'è cambiata la situazione al di là di Corso Novara. \n\nHo letto che c'è in progetto una grande riqualificazione di Corso Palermo che mi fa pensare ad una possibile gentrificazione stile San Salvario 20 anni fa e conseguente aumento dei prezzi degli immobili.\n\nÈ fattibile secondo voi affittare in questa zona per 700/800€ (trilocale di 75m2 e due stanze)? Rischio accoltellamento e sicurezza notturna? Pareri onesti solo senza essere eccessivamente drammatici!\n\nThanks!!",
        "upvotes": 4,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ey6keckeifff1.jpeg?auto=webp&amp;s=427688c33ae1ed1e2f46a9961a64b6cd04c57dc5"
        },
        "permalink": "/r/torino/comments/1mao0hj/affittare_in_barriera/"
    },
    {
        "id": "1mas0h0",
        "author": "forsequeneau",
        "title": "Negozi gameboy",
        "content": "Ciao torinesi!\n\nVorrei fare un regalo a un amico e non ho tempo per aspettare spedizioni online.\n\nEsiste a Torino un negozio affidabile che venda gameboy buoni/restaurati ecc?\n\nPremetto che io non me ne intendo per niente del mondo console/videogiochi, quindi qualsiasi consiglio è ben accetto.\n\nGrazie!",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1mas0h0/negozi_gameboy/"
    },
    {
        "id": "1maot9i",
        "author": "3dgarAllanHo3_",
        "title": "Coffee shops",
        "content": "Ciao! Sono tornata in Italia da poco dopo anni all'estero, e mi chiedevo se ci fossero dei coffee shop a Torino che facciano bevande come iced coffee, matcha latte e minchiate varie, che sotto sotto mi mancano un po'! Magari con un po' di spazio per leggere o lavorare! No Starbucks  :)) grazie!\n\nENG version:\nI just moved back to Italy after years abroad, and I was wondering wether there's a good coffee place that does iced coffee or matcha lattes and those sorts of things! I love our espresso and shakerato, but sometimes I find myself craving a overly sweet iced matcha ahah. Please don't recommend Starbucks lol",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1maot9i/coffee_shops/"
    }
]