[
    {
        "id": "1oc23pv",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 24,
        "comments": 6080,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oc23pv/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1ojdajz",
        "author": "IcefoxX5",
        "title": "[Match Thread] Southampton FC U21s - Real Madrid Castilla | U21 Premier League International Cup, Group Stage, Matchday 2",
        "content": "#FT: SOUTHAMPTON 1:1 CASTILLA\n\n&amp;#x200B;\n\n#PREMIER LEAGUE INTERNATIONAL CUP\n\n&amp;#x200B;\n\n**Scorers/replays:** \n\n0:1 Thiago Pitarch 76'\n\n1:1 Lekan Okunola 90'+4 \n\n&amp;#x200B;\n\n**match updates:** \n\n1' - kickoff, vamos! \n\n🔄 10' - Fortea leaves the pitch supported by the medical team, he has an ankle injury after a Southampton player stepped on his foot - hopefully it's nothing too grave. Manu Serrano comes on for him\n\n20' - penalty not given for a foul on Yáñez in the box\n\n33' - now a yellow for a dive in the box for Yáñez - it wasn't a penalty but it was never a dive either. Castilla dominating and pushing hard for the first goal here \n\n35' - now the best chance of the game is Southampton's on the counter. In the end it's a 3v1 situation on the goalkeeper, but the final pass is so bad, it forces their attacker to take a shot from a very tight angle, that Mestre can save nicely\n\n45' - huge chance for Castilla, Mesonero advances at the right side of the box and puts it inside - Álvaro let's it pass through with a nice dummy for Yáñez, who tries a precise shot, but it goes just wideif the box\n\n45'+1 - Lamini needs treatment after a bad elbow by a Southampton player that could've been a red card if the referee saw it. He is bleeding from his nose, but he can continue\n\n45'+4 - another clear stomp that should've been an easy yellow card for Southampton - English referee doing the job for the English home team here \n\nHT - half time in an even match - Castilla have more of the ball, but Southampton are dangerous on the counter. The game is also pretty physical, with the referee sadly not applying the same criteria for both teams here\n\n46' - 2nd halfway\n\n52' - quadruple chance for Castilla, first Mesoneros shot is blocked, then Bruno's shot on the following corner goes over the bar. One or two minutes later, Yáñez' low curled shot goes just wide, and in the next play, Manu Serrano's shot is saved by the keeper\n\n60' - suffocating dominance by Castilla now - Mesonero's curled shot is nicely saved by the keeper\n\n🔄 61' - Leiva on for Castrelo. His first match for Castilla, although unofficial, since the 2022/23 season \n\n63' - Yáñez' weak footed shot from a pretty tight angle is too central and the keeper can save it again. The goal needs to start arriving soon\n\n68' - Yáñez arrives after Bruno redirects a chipped pass further into the box. His volley is well wide, yet another missed chance by him. Castilla have had enough chances for 3-4 goals here by now\n\n🔄 69' - last subs, and Arbeloa unearths his gems - Manuel Ángel, César Palacios and Thiago Pitarch on for Mesonero, Ginés and Dani Yáñez\n\n⚽ 76' - GOLLLL DEL CASTILLA - corner from the right side - the ball gets played short, then all the way to the left to Leiva, he plays it to Bruno, who plays it into the box to Palacios. He lays it off with a flick to Pitarch, who curls it in nicely into the bottom right corner for the lead that was well overdue\n\n88' - HUGE SAVE by Mestre - Mestre's pass to open the buildup is too long for Manuel Ángel to reach. Castilla get caught off guard and one pass is enough to put their striker through with only Rivas in front of him. He wiggles past him to take a well placed shot, but Mestre's foot darts out to direct it wide of the goal\n\n90'+2 - and another big chance for Castilla, this time it's Leiva, who is through on the right wing and tries to surprise the keeper with a low shot at the near post, but it hits the side netting \n\n⚽ 90'+4 - unbelievable. Last kick of the game is a corner, and it reaches Southampton's keeper. His header is great, but Mestre's save is even better and he manages to squeeze it against the bar and out with his glove. The ball falls right in front of Okunola, who heads it into the net on the ground\n\nFT - an incredibly frustrating and unjust result for Castilla, who dominated practically the entire match and even more so in the second half, but did not take their chances well enough to generate a result that mirrored their dominance. Southampton only arrived twice at the end of the game and tied the game after an unlikely goalkeeper header in the dying minutes. Castilla now 2nd in the group table behind Wolves, who played one more match however\n\n&amp;#x200B;\n\n**Kickoff:** 20:00 CET\n\n**Venue:** St. Mary's Stadium, Southampton\n\n**Referee**: Ross Martin (ENG) \n\n**Competition:** U21 Premier League International Cup, Group Stage\n\n**Viewing options:** [RMTV/RM Play](https://play.realmadrid.com/live/237284)\n\n&amp;#x200B;\n\n**Castilla XI** (5-2-3): Sergio Mestre - Diego Aguado, Lamini Fati, Mario Rivas, Jesús Fortea (10' Manu Serrano)- Cristian David, Bruno Iglesias, Dani Mesonero (69' Manuel Ángel) - Gabri Castrelo (61' Álvaro Leiva), Álvaro Ginés (69' César Palacios), Dani Yáñez (69' Thiago Pitarch)\n\nBench: Guille Súnico (GK), Pol Fortuny.\n\nUnavailable: Fran González (rested), Joan Martínez (rested), David Jiménez (rested), Victor Valdepeñas (rested), Jorge Cestero (rested), Roberto Martín (injury), Hugo de Llanos (injured), Rachad Fettal (injured), Loren Zúñiga (rested). \n\nCoach: Álvaro Arbeloa\n\n&amp;#x200B;\n\n**Castilla last five matches:** LWWWW\n\n**PL International Cup stats:** 2nd | 3pt | 1-0-0 | 1:0\n\n",
        "upvotes": 10,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4HME4xj8DPkoCjrBA6RPTDUbx3uXTEuucJ44MsSSHFE.jpeg?auto=webp&amp;s=4ee92f49794109842e84d75a109db6d91065b0d9"
        },
        "permalink": "/r/realmadrid/comments/1ojdajz/match_thread_southampton_fc_u21s_real_madrid/"
    },
    {
        "id": "1ojxhsm",
        "author": "kanon951",
        "title": "Question: Is Lamine the youngest player to unfollow Carvajal on Instagram?",
        "content": "",
        "upvotes": 566,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2b6xznn0m8yf1.jpeg?auto=webp&amp;s=52c2dbb78d031d115f381df6ce98af19410a7bfd"
        },
        "permalink": "/r/realmadrid/comments/1ojxhsm/question_is_lamine_the_youngest_player_to/"
    },
    {
        "id": "1ojvq0c",
        "author": "Leekeew",
        "title": "We are about to buy Barca and ship the entire squad for fun",
        "content": "",
        "upvotes": 413,
        "comments": 55,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/6sdxeolf48yf1.jpeg?auto=webp&amp;s=db0d1e4f272cbba3230e681e869d438ea16e904d"
        },
        "permalink": "/r/realmadrid/comments/1ojvq0c/we_are_about_to_buy_barca_and_ship_the_entire/"
    },
    {
        "id": "1ojqw2b",
        "author": "Emergency-Hornet-594",
        "title": "Bellingham brilliant thread pass to Mbappé analysis",
        "content": "\nI found this on facebook, Bellingham dummy moves are so brilliantly time. I hope friendship Fc be back this season. \n\nAlso, Camaving is everywhere. I know he gave away possession 1 2 many times but overall he is so good. He need to improve his passing and vision.\n\nLink to the source : https://www.facebook.com/share/r/17Pgz92C1g/",
        "upvotes": 884,
        "comments": 38,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/i85vx2j9k6yf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ojqw2b/bellingham_brilliant_thread_pass_to_mbappé/"
    },
    {
        "id": "1ok4u5m",
        "author": "lyceras",
        "title": "What's your favorite El Clasico assist ever?",
        "content": "",
        "upvotes": 89,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/m9jvo0he2ayf1.png?auto=webp&amp;s=12cc8907aab3a0f26557a48121b826c4a981a6e5"
        },
        "permalink": "/r/realmadrid/comments/1ok4u5m/whats_your_favorite_el_clasico_assist_ever/"
    },
    {
        "id": "1ojuc6f",
        "author": "cyrusmancub",
        "title": "Xabi Alonso has been left very pleased with Vini’s apology and believes it’s an important step forward for the team’s dynamics",
        "content": "",
        "upvotes": 315,
        "comments": 79,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ojuc6f/xabi_alonso_has_been_left_very_pleased_with_vinis/"
    },
    {
        "id": "1ojtk2u",
        "author": "Emmanuel_I",
        "title": "Real Madrid seeks more than €4bn in damages from Uefa over Super League debacle",
        "content": "",
        "upvotes": 272,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GOVJGfQmuH33CKLi-SGGij0stwZ5Rls2v08sEMdG_7E.jpeg?auto=webp&amp;s=8b066fba41997368005abae506b0887f3a2d8827"
        },
        "permalink": "/r/realmadrid/comments/1ojtk2u/real_madrid_seeks_more_than_4bn_in_damages_from/"
    },
    {
        "id": "1ojyabv",
        "author": "No-Independent2522",
        "title": "Presentation ceremony of the 2024-2025 Golden Boot to Kylian Mbappé will be held tomorrow, October 31, at 1:30 p.m., in the VIP box of the Santiago Bernabéu stadium (live on Realmadrid TV).",
        "content": "",
        "upvotes": 106,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TFcxTGJ-4nfEVc2nRbk9ES9WefEG2eE0pCcAz588Nao.png?auto=webp&amp;s=72a90616cda61c2524537adf0501d21be4b98aff"
        },
        "permalink": "/r/realmadrid/comments/1ojyabv/presentation_ceremony_of_the_20242025_golden_boot/"
    },
    {
        "id": "1ok5aga",
        "author": "TheFeatherDiaries",
        "title": "OFFICIAL : Arda Güler wins Real Madrid's Player of the Month Award for OCTOBER",
        "content": "",
        "upvotes": 25,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/65gmrxzo5ayf1.jpeg?auto=webp&amp;s=24660214cd37d80e034b94dd6eeba5b8322f9503"
        },
        "permalink": "/r/realmadrid/comments/1ok5aga/official_arda_güler_wins_real_madrids_player_of/"
    },
    {
        "id": "1ojj2mc",
        "author": "victormarkno",
        "title": "KYLIAN MBAPPÉ &amp; VINÍCIUS JR x LOUIS VUITTON",
        "content": "source: [L’OFFICIEL](https://www.hommessingapore.com/style/louis-vuitton-real-madrid-partnership-mbappe-bellingham-fashion-football-sports-news)",
        "upvotes": 491,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wcyms441p4yf1.jpeg?auto=webp&amp;s=71aa0858cb4b4359befa70fe7a46dc31fa16a2a0"
        },
        "permalink": "/r/realmadrid/comments/1ojj2mc/kylian_mbappé_vinícius_jr_x_louis_vuitton/"
    },
    {
        "id": "1oj32g6",
        "author": "cyrusmancub",
        "title": "Vini’s official statement issued to address his Clásico substitution",
        "content": "",
        "upvotes": 2332,
        "comments": 272,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ko7872acn1yf1.jpeg?auto=webp&amp;s=e25b958a143801f9631bd3bab66d5ace53f0c745"
        },
        "permalink": "/r/realmadrid/comments/1oj32g6/vinis_official_statement_issued_to_address_his/"
    },
    {
        "id": "1ojqf1t",
        "author": "maybeMichaelScarn",
        "title": "How are we feeling before Liverpool at Anfield?",
        "content": "With Liverpool's loss to Crystal Palace 3-0 yesterday and crashing out of the EFL Cup, I personally think they will have a point to prove. Haven't watched them play much this year apart from the Arsenal match at the start of the season (which they won 1-0), the ATM match in UCL (which they also won 3-2), and the United match couple of weeks back (which they lost 2-1). Watched the highlights of the Frankfurt game and tbh, while they played well, Frankfurt was horrendous. \n\nI definitely don't think it will be an easy match specially since it's an away match for us. The Anfield crowd will make it tough and Liverpool will have a definite point to prove (and would do so) if they are able to defeat Real Madrid. \n\nLet's hope we play with the same intensity and don't take it lightly. Also it will be a homecoming for Trent and Xabi. ❤",
        "upvotes": 78,
        "comments": 48,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ojqf1t/how_are_we_feeling_before_liverpool_at_anfield/"
    },
    {
        "id": "1ojafls",
        "author": "Hiroshima-6-1945",
        "title": "Seems everyone wanted his Jersey",
        "content": "",
        "upvotes": 584,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/itlkajn633yf1.jpeg?auto=webp&amp;s=12eb1f890c3eeecc9e282c4ecbf607dc6c42dc1c"
        },
        "permalink": "/r/realmadrid/comments/1ojafls/seems_everyone_wanted_his_jersey/"
    },
    {
        "id": "1ojy0i4",
        "author": "Thesheeshmonster",
        "title": "Appreciation post- the midfield with camavinga and tcho. Don’t forget Militao and finally Vini",
        "content": "We all knew how good tcho is same with camavinga. I had my concerns after a long time away from the field because of serious injuries. But man did these two provide balance. Belli and Guler have the freedom to room preferably to the right side since thats most definitely our weakest offensive side. \n\nWe also knew huujsen is good especially on the ball at least I did before the signing. I was advocating for another center back in that same transfer window even though knowing madrids transfer strategy that was impossible.  I wasn’t expecting these sort of performances from him but Militao 2 acls later and still the same spirit and absolutely serviceable back next to huujsen. I do still believe we do need a center back, one is great at winning aerial duels and that aggression leadership and no bullshit similar to ramos but for now militao’s a very pleasant surprise. (I say this because the multiple serious injuries he’s come back from- also get rid of alaba lol) (main candidates for new cb next year are honestly either one of the two arsenal center backs lol) The reason I say that is I think that is the piece that will elevate madrid to dominate every competition every year and restart that dynasty. militao would be a world class backup in case anything happens to either starter.\n\n\nBack to the point, even though I don’t really believe a midfielder is a priority especially since we have too many of them and we haven’t even gotten into valverde and how as it seems his best position for the squad is at rb. (not his best positon overall) he provides his workrate energy and defense there which allows us to have tcho and camavinga both start which covers a lot more of our of the defensive struggles and allows guys like guler and  belli to roam and provide.\n\n\nVini- criticized for his antics and lack of press. I wouldn’t say he has stopped his antics really maybe lessened lol. But watch the last 5/6 games closely he is actually determined to press and most noticeably in the barca game. Vini with a chip on his shoulder or with a child from the other team talking shit lights a fire in him and gives us him best version. Like or not the best vini is the one with that fire lit.",
        "upvotes": 11,
        "comments": 9,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ojy0i4/appreciation_post_the_midfield_with_camavinga_and/"
    },
    {
        "id": "1oj4b6u",
        "author": "No-Independent2522",
        "title": "Man is 78 years old but still works like a goddamn machine",
        "content": "",
        "upvotes": 559,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/musalpk8x1yf1.jpeg?auto=webp&amp;s=5583ac297c8ec504dc21f6ac71defcf13a050bec"
        },
        "permalink": "/r/realmadrid/comments/1oj4b6u/man_is_78_years_old_but_still_works_like_a/"
    },
    {
        "id": "1oj5h56",
        "author": "CorruptedLife95",
        "title": "Jude y Vini embracing each other  ❤️",
        "content": "Vini y Jude embracing each other at the Real Madrid city during today’s practice. Seems like they are really enjoying the win over Barca! Team spirit is up and energy is high! Hope they can keep this momentum for the next few games! Real Madrid continue to shine under Xabi! How can you not love this team? ",
        "upvotes": 435,
        "comments": 38,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oj5h56/jude_y_vini_embracing_each_other/"
    },
    {
        "id": "1oj429a",
        "author": "cyrusmancub",
        "title": "[Mario Cortegana] Xabi Alonso’s omission from Vinicius’s apology message has been deliberate, as the player feels hurt by the treatment he is receiving from the coach. Those close to the player say they have felt the club’s support in recent days.",
        "content": "",
        "upvotes": 351,
        "comments": 286,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oj429a/mario_cortegana_xabi_alonsos_omission_from/"
    },
    {
        "id": "1oj521d",
        "author": "Goat23231",
        "title": "Thoughts on Vini’s game time this season?",
        "content": "",
        "upvotes": 296,
        "comments": 240,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2fj1t39r22yf1.jpeg?auto=webp&amp;s=9ab1066f4b5b22d2a0d09a53e3fee8e6f31ccd5c"
        },
        "permalink": "/r/realmadrid/comments/1oj521d/thoughts_on_vinis_game_time_this_season/"
    },
    {
        "id": "1oj6fs3",
        "author": "hith4ish",
        "title": "\"🚨 𝐄𝐗𝐂𝐋𝐔𝐒𝐈𝐕𝐄: Olympique Lyon make approach to sign 𝐄𝐧𝐝𝐫𝐢𝐜𝐤 𝐨𝐧 𝐥𝐨𝐚𝐧 in January! ❤️💙",
        "content": "\"🚨 𝐄𝐗𝐂𝐋𝐔𝐒𝐈𝐕𝐄: Olympique Lyon make approach to sign 𝐄𝐧𝐝𝐫𝐢𝐜𝐤 𝐨𝐧 𝐥𝐨𝐚𝐧 in January! ❤️💙\n\nTalks already underway with official approach to sign the Brazilian striker on loan from Real Madrid, deal on.\n\nOL presented their project to Endrick, now open to talk ahead of loan move as still assessing all options 🇫🇷🇧🇷\n\nFinal decision on the club will be made in next month.\"",
        "upvotes": 232,
        "comments": 49,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oj6fs3/𝐄𝐗𝐂𝐋𝐔𝐒𝐈𝐕𝐄_olympique_lyon_make_approach_to_sign/"
    },
    {
        "id": "1ojg0xh",
        "author": "IcefoxX5",
        "title": "Southampton FC U21s 0-[1] Real Madrid Castilla - Thiago Pitarch 76' | Premier League International Cup",
        "content": "",
        "upvotes": 70,
        "comments": 4,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/lp8rz9g844yf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ojg0xh/southampton_fc_u21s_01_real_madrid_castilla/"
    },
    {
        "id": "1oj04up",
        "author": "sukkulenten",
        "title": "Madridistas singing the club anthem in the street: Hala Madrid y nada más!",
        "content": "",
        "upvotes": 415,
        "comments": 8,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/gp92n3glu0yf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1oj04up/madridistas_singing_the_club_anthem_in_the_street/"
    },
    {
        "id": "1oj0t0d",
        "author": "No-Independent2522",
        "title": "[Mario Cortegana] Players who previously felt “untouchable” are unhappy with Xabi Alonso at Real Madrid. Victory over Barcelona was vital for his rebuild — but there is a rift.",
        "content": "",
        "upvotes": 355,
        "comments": 228,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/j2AzoXDq3NllJahb5MqFCIa_Xpmey0DoyTAiwNNdMmE.jpeg?auto=webp&amp;s=5058d64072b0d1031728ff3a668798a24330983d"
        },
        "permalink": "/r/realmadrid/comments/1oj0t0d/mario_cortegana_players_who_previously_felt/"
    },
    {
        "id": "1oj44ak",
        "author": "No-Independent2522",
        "title": "Real Madrid welcomes the Madrid Court’s dismissal of appeals by UEFA, RFEF &amp; LaLiga, confirming UEFA violated EU competition law and abused its dominant position over the Super League",
        "content": "",
        "upvotes": 151,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TFcxTGJ-4nfEVc2nRbk9ES9WefEG2eE0pCcAz588Nao.png?auto=webp&amp;s=72a90616cda61c2524537adf0501d21be4b98aff"
        },
        "permalink": "/r/realmadrid/comments/1oj44ak/real_madrid_welcomes_the_madrid_courts_dismissal/"
    },
    {
        "id": "1oj0mh5",
        "author": "Novel-Preparation491",
        "title": "We need to work on killing off games",
        "content": "Xabi has done a great job so far. The team is playing way better than last year and there’s a fire lit under our players. You saw how badly they wanted to smash Barca. They’re playing like they have a point to prove and it’s that energy that will win us trophies. \n\nAn area of vast improvement that needs to be made is our counter attacks. We need to work on killing off games. We keep making bad individual mistakes like a terrible final pass or bad finish. Some of our players will make bad decisions like trying to score a goal themselves when they should pass for a tap on. They keep fumbling and It’s going to cost us eventually. Last game Barca had opportunities to equalize and all our hard work would have been for nothing. The week before Getafe almost scored in the last few minutes of the game and we would have dropped points. \n\nMaybe because Xabi has only been here for a few months he is focusing on implementing his system and hasn’t had time to drill in counters. Once we improve that area of our game we will dominate and win games more comfortably. \n",
        "upvotes": 80,
        "comments": 18,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oj0mh5/we_need_to_work_on_killing_off_games/"
    },
    {
        "id": "1oiim7u",
        "author": "Ill-Improvement-8670",
        "title": "Ladies and gentlemen.. Vini Jr🤍✨🇧🇷⚽️",
        "content": "",
        "upvotes": 1163,
        "comments": 52,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/h9wqebr3kwxf1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1oiim7u/ladies_and_gentlemen_vini_jr/"
    },
    {
        "id": "1oingom",
        "author": "MadixWasThere",
        "title": "We had the greatest of them all in every corner",
        "content": "",
        "upvotes": 346,
        "comments": 33,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9ocago6lhxxf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1oingom/we_had_the_greatest_of_them_all_in_every_corner/"
    },
    {
        "id": "1oibzgm",
        "author": "Lvstamiq",
        "title": "Just imagine if Pedri wasn't there to stop Vini.. you gotta respect pedri man.",
        "content": "",
        "upvotes": 1071,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/j1q9pwv9cvxf1.jpeg?auto=webp&amp;s=f196c5883cadca56f3735ad4e96feded9d41b758"
        },
        "permalink": "/r/realmadrid/comments/1oibzgm/just_imagine_if_pedri_wasnt_there_to_stop_vini/"
    },
    {
        "id": "1oi7kcm",
        "author": "dogetothemoonnnn",
        "title": "⚖️ FC Barcelona charged with corruption in the Negreira case",
        "content": "[https://onefootball.com/en/news/fc-barcelona-charged-with-corruption-in-the-negreira-case-41868264](https://onefootball.com/en/news/fc-barcelona-charged-with-corruption-in-the-negreira-case-41868264)\n\n**FC Barcelona** has been formally **charged** as a legal entity **for a continuous crime of business corruption**, in the form of **fraud**, within the controversial **Negreira Case**. The judicial decision, announced by the judge presiding over Barcelona’s Court of Instruction No. 1, marks a turning point in the investigation examining the payments made by the Catalan club to **José María Enríquez Negreira**, former vice president of the Technical Referees Committee (CTA). The Blaugrana entity is accused of having paid **nearly 7.2 million euros** over almost two decades.",
        "upvotes": 1502,
        "comments": 157,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Lr1gUfLisPe4Yh6-WpZj5bIEnww9ZLa93bD3k0E5yCE.jpeg?auto=webp&amp;s=0c440608ecbd0e954960bf82286b1e88c64b6509"
        },
        "permalink": "/r/realmadrid/comments/1oi7kcm/fc_barcelona_charged_with_corruption_in_the/"
    },
    {
        "id": "1oicit0",
        "author": "chunchunmaru1129",
        "title": "WHAT IS THAT TINY THING 😂🤔😳????",
        "content": "",
        "upvotes": 721,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hbj2ut6vfvxf1.jpeg?auto=webp&amp;s=220aa4e213c44e341ed8d561cb60221a7a680b39"
        },
        "permalink": "/r/realmadrid/comments/1oicit0/what_is_that_tiny_thing/"
    }
]