[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1lw57xh",
        "author": "umudyy",
        "title": "torino",
        "content": "torino",
        "upvotes": 128,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/j4nfm1mklzbf1.jpeg?auto=webp&amp;s=67ca1d14ec052642ca573755bb8b099a6a08fc23"
        },
        "permalink": "/r/torino/comments/1lw57xh/torino/"
    },
    {
        "id": "1lwcswq",
        "author": "whoschri",
        "title": "motociclisti nel gruppo?",
        "content": "",
        "upvotes": 13,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/lkd23ax9u1cf1.jpeg?auto=webp&amp;s=c72b55f3ce09eb7af11460ff30d92a6477c2d787"
        },
        "permalink": "/r/torino/comments/1lwcswq/motociclisti_nel_gruppo/"
    },
    {
        "id": "1lwe7eq",
        "author": "heromatte",
        "title": "Quanto è sicura questa zona?",
        "content": "Ciao! Da settembre devo trasferirmi a Torino per la magistrale, e vi volevo chiedere quanto fosse sicura questa zona (l'appartamento è segnato in rosso).  \nHo letto che la zona barriera di Milano è la più pericolosa, ma questa mi sembra parecchio distante.\n\n[Mappa](https://preview.redd.it/mq4j1azr42cf1.png?width=2458&amp;format=png&amp;auto=webp&amp;s=01e1ac919e49bf253fe94a7a150346c2b21daf4c)\n\n",
        "upvotes": 9,
        "comments": 17,
        "media": null,
        "permalink": "/r/torino/comments/1lwe7eq/quanto_è_sicura_questa_zona/"
    },
    {
        "id": "1lwpw66",
        "author": "Forsaken_Wasabi4632",
        "title": "come trovare lavoro per l'estate?",
        "content": "ciao raga, volevo sapere come fatte voi di solito per trovare lavoro di un mese per l'estate a torino? C'e qualche settore che forse cerca un aiuto extra in questa epoca? Avevo considerato pure lavorare in nero ma non saprei dove cercare",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1lwpw66/come_trovare_lavoro_per_lestate/"
    },
    {
        "id": "1lvhpd0",
        "author": "Apoworld",
        "title": "a 21 minuti da Torino!",
        "content": "Il mio eden, a due passi dalla città! \n\nPerché fiumi e laghi sono così sottovalutati dai Torinesi (che non ne conoscono mezzo, tipicamente!)?",
        "upvotes": 409,
        "comments": 81,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xie7wllsfubf1.jpeg?auto=webp&amp;s=dfff9eabc090aeb5f3169b758c8a0e012734307f"
        },
        "permalink": "/r/torino/comments/1lvhpd0/a_21_minuti_da_torino/"
    },
    {
        "id": "1lwe5ll",
        "author": "Justo_24",
        "title": "Prezzo di affitto di un monolocale",
        "content": "Ciao, come stai? Sono brasiliano e ho intenzione di trasferirmi in Italia per studiare medicina. Vorrei sapere quale fascia di prezzo considerate accettabile per l'affitto di un monolocale a Torino? Preferibilmente in una regione che consenta un facile accesso all'università.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1lwe5ll/prezzo_di_affitto_di_un_monolocale/"
    },
    {
        "id": "1lweitz",
        "author": "Badger_Nerd",
        "title": "Corsi di giapponese?",
        "content": "Ciao ragazzi!\nSono un nerd milanese fuori sede ed è un po' che pensavo di imparare una nuova lingua.\nMi chiedevo se qualcuno qui conosce qualche scuola di lingua buona che offra dei corsi in presenza di giapponese nei pomeriggi , sera, o weekend; o anche solo degli insegnanti (madrelingua se possibile)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lweitz/corsi_di_giapponese/"
    },
    {
        "id": "1lwea55",
        "author": "DependentPost9445",
        "title": "Preparatore IronMan",
        "content": "Ciao a tutti, qualcuno conosce preparatori per iron man in Torino e dintorni? O comunque preparatori per sport di endurance?\nGrazie mille",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1lwea55/preparatore_ironman/"
    },
    {
        "id": "1lw826o",
        "author": "junanor1",
        "title": "Una buona pista per fare il ho kart ?",
        "content": "Ciao tutte e tutti,\nConosci una buona pista per go kart o track days verso Torino?\nGrazie ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1lw826o/una_buona_pista_per_fare_il_ho_kart/"
    },
    {
        "id": "1lvfvtu",
        "author": "AcousticBassGuitar",
        "title": "Judgment - 2018 (spin-off di Yakuza) Gvissini",
        "content": "giocatelo se vi capita che è un giocone ",
        "upvotes": 50,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/m3hbyegpytbf1.jpeg?auto=webp&amp;s=5ffacbfe46c064bcf929c272b0fff7c2db5bc29f"
        },
        "permalink": "/r/torino/comments/1lvfvtu/judgment_2018_spinoff_di_yakuza_gvissini/"
    },
    {
        "id": "1lvd8pf",
        "author": "umudyy",
        "title": "torino",
        "content": "",
        "upvotes": 45,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5vjnq61c4tbf1.jpeg?auto=webp&amp;s=49cdf82353dbf86c3b9622c31d076b100f6dbdf1"
        },
        "permalink": "/r/torino/comments/1lvd8pf/torino/"
    },
    {
        "id": "1lvhb6h",
        "author": "Andrenet93",
        "title": "Trasferirsi a Torino Nord",
        "content": "Ciao a tutti,\n\ndopo 10 anni in un'altra città, ho finalmente ottenuto un lavoro stabile che mi permetta di tornare dove sono nato e cresciuto. Sebbene l'azienda si trovi vicino Ciriè, la mia idea era comunque di cercare casa in Torino, privilegiando la vicinanza al lavoro (max. 30 minuti di guida), anche perché valuterei seriamente di comprare, anziché affittare, in ottica d'investimento.  \nHo quindi iniziato a valutare una macro-area (in foto) in cui cercare casa e volevo avere una vostra opinione su come e verso dove restringere il cerchio. \n\nIn particolare mi piacerebbe avere info su Barriera di Lanzo; Madonna di Campagna; Borgo Vittoria e Rebaudengo che sarebbero le opzioni più comode (e anche economiche).\n\nIn alternativa, se c'è qualcuno che abita fuori Torino 'da quel lato', valuto anche la prima cintura di Torino (Borgaro, Venaria, etc.).\n\n  \nGrazie in anticipo!",
        "upvotes": 15,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/iiiky43h9ubf1.png?auto=webp&amp;s=ecc65f188ae8f3f8b1010767472f00ad60db1693"
        },
        "permalink": "/r/torino/comments/1lvhb6h/trasferirsi_a_torino_nord/"
    },
    {
        "id": "1lvrfxc",
        "author": "utente_20",
        "title": "qualcuno mi può mandare i migliori gruppi telegram per meet up a torino?(sono cucinato senza)",
        "content": "",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1lvrfxc/qualcuno_mi_può_mandare_i_migliori_gruppi/"
    },
    {
        "id": "1lvi3fv",
        "author": "opulentbitch-",
        "title": "I'm going to be living in Porta Palazzo, should I not?",
        "content": "Hey everyone, \n\nI will be moving to Turin starting this September, for a year. And I, without proper research (rush for visa), chose Porta Palazzo, because I really liked the room. However, I see a lot of negative association with the place, which I did not think too much initially, but now, I'm a a little concerned. Should I or should I not be? I did pay half of the security deopist already.\n\nI need some advice regarding this. ",
        "upvotes": 9,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1lvi3fv/im_going_to_be_living_in_porta_palazzo_should_i/"
    },
    {
        "id": "1lvi9lu",
        "author": "sonnobreve",
        "title": "Ci sono fiumi o laghi o altre zone balneabili raggiungibili senza macchina da Torino?",
        "content": "Ho un'altissima voglia di fare un tuffo in qualche pozzo d'acqua fredda e vorrei anche portarci la mia ragazza, ma non ho ancora la patente e tutti i posti che trovo online sembrano raggiungibili soltanto in macchina. Un'oretta di camminata me la farei volentieri, oltre a poter prendere i pullman.\n\nEsiste qualcosa?",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1lvi9lu/ci_sono_fiumi_o_laghi_o_altre_zone_balneabili/"
    },
    {
        "id": "1lvkuon",
        "author": "Parallellinezz",
        "title": "Best wine bars/restaurants/coffee shops",
        "content": "Ciao!\n\nI’ll be spending a few weeks in Torino and I’m looking for any amazing recommendations.\n\nWhether it be the best coffee, best restaurants, best cafe, best place for an aperitivo - best anything! \n\nI’m definitely looking for one romantic restaurant also. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lvkuon/best_wine_barsrestaurantscoffee_shops/"
    },
    {
        "id": "1lvdoru",
        "author": "EdgelordMcMeme",
        "title": "Nuovi posti per mangiare bene",
        "content": "Ciao a tutti!\n\nTra poco sarà l'anniversario mio e della mia ragazza e come di consueto andremo a cena fuori. Ho bisogno di un vostro consiglio per trovare posti nuovi dove si mangia bene (ci piace andare ogni volta in un posto nuovo). I miei unici criteri sono che al primo posto il cibo sia buono (ovviamente la cosa più importante), il posto deve essere carino e non una bettola ma senza per forza essere super elegante (anzi, meglio se non eccessivamente elegante) e che abbia un buon rapporto qualità prezzo. Poi per quanto riguarda il tipo di cucina va benissimo qualsiasi cosa, anche se lei penso preferisca cucina tradizionale piemontese (ma se avete in mente altre proposte che fanno altro ditele pure). Voi che posti consigliereste?\n\nUnica cosa: non scrivete Scannabue in duecento perchè lo conosco già e vorrei provare un posto che non ho mai provato.\n\nGrazie!",
        "upvotes": 5,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1lvdoru/nuovi_posti_per_mangiare_bene/"
    },
    {
        "id": "1lvp22k",
        "author": "SafeZookeepergame573",
        "title": "Domanda per bikers di città",
        "content": "Ciao, credo di essere ancora l'unico ad usare la dinamo della bici come luce. Ebbene mi si sono fulminate entrambe, sapete dei negozi di ricambi in cui posso comprare quelle lampadine mignon? Grazie mille",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lvp22k/domanda_per_bikers_di_città/"
    },
    {
        "id": "1lw2o99",
        "author": "FlatwormDifferent190",
        "title": "If you saw me in Turin and in Italy, would you think i’m Italian or no?",
        "content": "",
        "upvotes": 0,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jtag21lbvybf1.jpeg?auto=webp&amp;s=a7b5179e80b7403d9f0260d539a46a10b40b87bc"
        },
        "permalink": "/r/torino/comments/1lw2o99/if_you_saw_me_in_turin_and_in_italy_would_you/"
    },
    {
        "id": "1lvnaen",
        "author": "AngAbb82",
        "title": "Eventi aziendali",
        "content": "Sto cercando una location per organizzare un evento aziendale con circa 350 persone. Idee su Torino e prima cintura?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1lvnaen/eventi_aziendali/"
    },
    {
        "id": "1lvg0z9",
        "author": "mangoguava87",
        "title": "Perché ci sono tanti tag con scritto “Male” a Torino?",
        "content": "In centro un muro su tre è ornato da queste scritte. Cosa intendono questi stacanovisti delle scritte?",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1lvg0z9/perché_ci_sono_tanti_tag_con_scritto_male_a_torino/"
    },
    {
        "id": "1luyl8u",
        "author": "Frengo_17",
        "title": "Come si vive in via Ormea?",
        "content": "Ciao a tutti, sono uno studente che presto andrà a studiare al poli, ho trovato una bella casa in via Ormea e vorrei sapere com'è la vita in quella zona, anche perché ho sentito che in quella via, anni fa, erano molto presenti sia spaccio che prostituzione, queste voci valgono anche oggi? Grazie per le risposte ",
        "upvotes": 12,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1luyl8u/come_si_vive_in_via_ormea/"
    },
    {
        "id": "1luvd6w",
        "author": "Feb-_-",
        "title": "Voglio portare la mia ragazza a vedere Torino",
        "content": "Ciao a tutti, sono M16, la mia ragazza M17, (potete skippare questo paragrafo se volete saltare subito alla conclusione) io vivo in provincia di Alessandria e lei in provincia di Asti, il 26 giugno di quest'anno abbiamo fatto 1 anno e l'ho portata a Torino, il mattino a 2 musei (il museo impossibile e il museo delle illusioni), a pranzo al Sushi Sound (il sito diceva che costava 13,90€, senza parlare del coperto che era di 3€, in piu col cibo di scarsa qualità, e ciò lo ha confermato pure la mia ragazza, insomma, ci siamo trovati male), il pomeriggio invece l'ho portata al parco Valentino, il suo posto preferito di Torino (nel tragitto c'è stata una tempesta di 10 minuti e invece di aspettare sotto al portico, o dentro alla stazione di Porta Nuova abbiamo preso un ombrello a 3€ e abbiamo provato da andare comunque, e oltre al fatto che si sia aperto verso l'alto, è pure volato via lasciando noi sotto la pioggia ma anche sotto ad un ricoedo divertentissimo) e dopo questa avventura siamo andati a fare un giro a via roma (mamma mia una bottiglietta d'acqua 3€), e infine siamo tornati a casa soddisfatti.\n\nBene, io per il 26 luglio la volevo portare all'acquario di Genova, ma questa è un'altra storia. Io volevo chiedergli, visto che ce una caterba di cose da fare a Torino che io non so nemmeno, molto probabilmente, oltre a quello descritto nel paragrafo precedente (ah ops è vero che vi avevo detto di skipparlo, perdonatemi) potreste consigliarmi qualcos'altro da fare in una giornata a Torino visto che (a parte essermi preso i pidocchi, aver incontrato una sudafricana fingersi una napoletana chiedendoci soldi, e aver quasi fatto una rissa contro un barbone, non sto scherzando purtroppo) vorrei riportarla visto che non abbiamo fatto molto quella giornata e considerando che il nostro treno arriva a Torino porta nuova (vi prego non fateci camminare troppo / pagare troppo per il bus)? vi faccio notare cari lettori che siamo in treno e per ora siamo ancora minnorenni, quindi per ora limitiamoci ad una giornata, poi si vedrà, grazie dell'aiuto, per chi risponderà",
        "upvotes": 17,
        "comments": 26,
        "media": null,
        "permalink": "/r/torino/comments/1luvd6w/voglio_portare_la_mia_ragazza_a_vedere_torino/"
    },
    {
        "id": "1lvc0xs",
        "author": "serReakt",
        "title": "Patente B - Aiuto!",
        "content": "Devo fare domanda per la patente B e vorrei sapere quali sono i passi da seguire. Devo fare tutto da zero, teoria, pratica, ecc. Inoltre, ci sono dei requisiti particolari per potersi iscrivere all'esame?\n\nLavoro a tempo pieno e l'ufficio della motorizzazione è aperto solo dalle 8:30 alle 11:30, quindi mi farebbe davvero comodo avere qualche informazione prima di andarci solo per chiedere.\n\nMi sono trasferito di recente ad Asti, ma il suo subreddit è poco attivo, quindi sto scrivendo qui. Se c'è qualcuno di Asti anche in questo gruppo, mi farebbe piacere avere qualche dritta specifica!\n\nGrazie in anticipo!",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1lvc0xs/patente_b_aiuto/"
    },
    {
        "id": "1lup7b1",
        "author": "AcousticBassGuitar",
        "title": "The Pilgrimage",
        "content": "Federico!\n\n\n\n\n\n\nGiovanni…",
        "upvotes": 21,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1oc92zlronbf1.jpeg?auto=webp&amp;s=cbf90374e4d50470db0b30d7786c9bd55e3c7b55"
        },
        "permalink": "/r/torino/comments/1lup7b1/the_pilgrimage/"
    },
    {
        "id": "1luylax",
        "author": "vici0608",
        "title": "Torino as a foreigner",
        "content": "Ciao Torino :) \nI am moving to Turin in September and wanted to know what your impression is as to how life is as a foreigner here. Are the people overall open or more closed up? I know, speaking Italian is very important - and I am currently learning - but even with a lot of practice I won’t get rid of my accent so it will be always noticeable that I am not Italian. (I am from Austria, if that makes a difference) \nI would be happy about some inside information or also tips on how to integrate better 😊",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1luylax/torino_as_a_foreigner/"
    },
    {
        "id": "1lujfgd",
        "author": "Not-a-cyclist",
        "title": "Cosa fare con vestiti usati?",
        "content": "Scusatemi se faccio errori, sono Canadese e mi sono appena trasferita qui.\nLa storia è che purtroppo il papà del mio compagno è mancato poco tempo fa.\n\nDobbiamo svuotare la sua casa per poi venderla, ma non abbiamo nessun idea di cosa fare con i sui verstiti usati, o altri oggetti che aveva a casa.\nQuelli rovinati possono essere usati come stracci. Quelli ancora validi ma di qualità normale (magliette e jeans) possono essere messi nei bidoni per vestiti usati.\nMa quelli belli, sartoriali? Che sono ancora in condizioni perfette, che di sicuro hanno un costo altissimo? Tipo dei giubbotti di lana vergine, pantaloni e giacche sartoriali, ecc.\n\nHo provato di venderli su Vinted, ma il costo è troppo alto. La gente che va su Vinted cerca di comprare roba a 5 euro massimo.\n\nCi sono posti che comprano cose belle? ",
        "upvotes": 8,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1lujfgd/cosa_fare_con_vestiti_usati/"
    },
    {
        "id": "1lumnhu",
        "author": "mitochondria_muse",
        "title": "Ho bisogno di aiuto per scegliere la zona in cui vivere – consigli?",
        "content": "Ciao!\nIo e un mio amico studieremo all'ospedale San Luigi di Orbassano. Stiamo cercando un appartamento in una zona che non sia a più di 20 minuti dall’ospedale con i mezzi pubblici, ma che non sia nemmeno troppo lontana dal centro città.\n\nVorremmo vivere in un quartiere non troppo isolato, con qualche bar, supermercato, ristoranti, magari anche un parco. Insomma, con tutto quello che di solito serve a degli studenti.\nAvete qualche consiglio su quale zona scegliere?\n\nQualcuno ci ha suggerito Santa Rita e Piazza Caio Mario. C’è qualcuno che vive lì e può dirci com’è la zona?\n\n",
        "upvotes": 5,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1lumnhu/ho_bisogno_di_aiuto_per_scegliere_la_zona_in_cui/"
    },
    {
        "id": "1luwo2a",
        "author": "sp_cp",
        "title": "Ricerca informazioni vecchie caramelle.",
        "content": "Salve  sto cercando delle informazioni su delle vecchie caramelle e dell'azienda che le produceva.So' che l'azienda che le produceva era la Stobbia a Torino.Su internet non ho trovato molte informazioni,so' solo che l'azienda chiuse negli anni 80.Mi serve qualsiasi informazione sull'azienda e sulle caramelle.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1luwo2a/ricerca_informazioni_vecchie_caramelle/"
    },
    {
        "id": "1lu0x62",
        "author": "ArtistaFortunato",
        "title": "Quanti anni prima di una Torino 100% ciclabile e senza o poche auto?",
        "content": "Ciao a tutti, io sono a Padova, la città con più auto per persone del veneto, ma le strade sono tutte con poche auto, parcheggi pochissimi e prettamente ciclabile. Non parlo di strade che ci siamo trovati, ad esempio il comune ancora prima di mettere una fermata di un tram fa una pista ciclabile e ne fa un sacco di nuove e per ogni pista ciclabile nuova c'è una campagna stampa, oltremodo le piste vengono mantenute e spesso riasfaltate o divise con nuovi divisori dalla strada o con nuove luminarie o si ridipingono le strisce sopra le pedonali (molte piste ciclabili sono sopra dossi con accanto strisce pedonali), la chiamano ciclopolitana, si tende anche ad unire le piste ciclabili con delle zone naturali, quindi alcuni parchi hanno le zone per le bici, due corsie, con vigilanza che ferma le bici e scendere, le fa andare nelle corsie e nel centro sono la norma, ci sono parcheggi per le bici e cestini ovunque\n\nQuesto preambolo perché sono stato da poco a Torino e cazzo le vostre strade sembrano perfette per queste cose, invece sembrano degli showroom per le auto, giravo e pensavo \"Ok a Padova pochi parcheggi , ma qui si supera il limite, perché le auto sono davanti agli esercenti? Cazzo, ci sono più auto che esercenti!\" Ci sono vie che hanno una corsia ma due parcheggi, corsi con 8, mi sembra esagerato. Io leverei parcheggi, multerei l'impossibile e con quei soldi farei politiche green. Facendo anche scrivere sul giornale dei milioni presi dalla cosa e delle politiche che verranno fatte grazie a quei soldi.\n\nVisto il problema dell'inquinamento non penso sarà lontano un futuro tutto ciclabile, secondo voi quanto tempo manca? 10, 20? 30 anni?",
        "upvotes": 33,
        "comments": 151,
        "media": null,
        "permalink": "/r/torino/comments/1lu0x62/quanti_anni_prima_di_una_torino_100_ciclabile_e/"
    }
]