[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 491,
        "comments": 270,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1iz1co8",
        "author": "anonRedd",
        "title": "What We Watched the Second Half of 2024",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iz1co8/what_we_watched_the_second_half_of_2024/"
    },
    {
        "id": "1izf0wa",
        "author": "Sweaty-Toe-6211",
        "title": "Millie Bobby Brown Urges Fans to 'Be Patient' for Final Season of “Stranger Things”: 'It Is Worth It, I Promise'",
        "content": "",
        "upvotes": 268,
        "comments": 203,
        "media": null,
        "permalink": "/r/netflix/comments/1izf0wa/millie_bobby_brown_urges_fans_to_be_patient_for/"
    },
    {
        "id": "1izif1m",
        "author": "Leading-Bug-Bite",
        "title": "The Way Havana Syndrome Was Brought To Life in Zero Day",
        "content": "Tell me it's Havana Syndrome without telling me it's Havana Syndrome was a subtle and brilliant move by Netflix in Zero Day. It was very interesting to see that they dared bring this sensitive topic to life as the US government finally admitted that there is indeed such a thing and it's officially referred to as anomalous health incidents (AHI).\n\nTo the naked eye, viewers who aren't really in the know would see the symptoms as something related to more exposed mental issues such as Dementia, Alzheimers or even Schizophrenia. Netflix did a great job there. The alternative of directly confirming that it was Havana Syndrome would have been terrifying for inquiring minds. Leaving the culprit to the viewers's interpretation was mindful. The thought of goverments having the capability to remotely mess with people's brains is best left in the Sci-Fi, Horror or Dystopian genres. \n\nIn general Zero Day and the topics discussed are beyond most people's comprehension of possibilities and capabilities meeting real-life. There were obvious political points that distract viewers from the overall themes given our current political climate. This will obviously lead to negative reviews from those who are too passionate about their political affiliations to see the series as anything other that political propaganda pushing conspiracy theories. A risk that Netflix willingly took for the greater good?\n\nThere were some things that were the product of a bit of research and imagination. Other things were clear political warnings of the IFs.\n\nIn the end, I sincerely wondered who the real consultants for Zero Day were. Some things in Zero Day were too real for comfort. ",
        "upvotes": 16,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1izif1m/the_way_havana_syndrome_was_brought_to_life_in/"
    },
    {
        "id": "1iz3un2",
        "author": "ECO_FRIENDLY_BOT",
        "title": "Zero Day is so poor",
        "content": "Just finished Zero Day and it was excruciating. Apart from the terrible plot and hammy dialogue most of the actors looked like they were phoning it in apart from Jesse Plemons. Netflix has been in decline for years now and while it still produces a good show now and again the overall output has been horrendous. I know De Niro has a lot of alimony to pay but it's sad to see him in sub par tv shows like this.",
        "upvotes": 175,
        "comments": 135,
        "media": null,
        "permalink": "/r/netflix/comments/1iz3un2/zero_day_is_so_poor/"
    },
    {
        "id": "1iznklr",
        "author": "NostalgicRetro73",
        "title": "How can you tell if you’ve seen a show on Netflix?",
        "content": "There’s so many true crime shows on different streamers, I don’t know if I’ve seen that particular documentary.  Like American Nightmare.  I remember watching a documentary on that story, but Netflix has it as new as if I never watched it. But I swore I watched a documentary about the missing woman reappearing etc.  Does NF erase bookmarks on the shows I watch, and makes them look like I never watched them? 🤷",
        "upvotes": 5,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1iznklr/how_can_you_tell_if_youve_seen_a_show_on_netflix/"
    },
    {
        "id": "1izga6c",
        "author": "EthanWilliams_TG",
        "title": "Netflix’s Latest Engagement Report Shows What’s Truly Driving Views",
        "content": "",
        "upvotes": 13,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1izga6c/netflixs_latest_engagement_report_shows_whats/"
    },
    {
        "id": "1izgp3i",
        "author": "Yuck_Few",
        "title": "Cassandra",
        "content": "For the love of Glob, just push the robot over and then smash the control panel in the basement \nOr just don't pay the electric bill?\nNothing about that story made any sense",
        "upvotes": 10,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1izgp3i/cassandra/"
    },
    {
        "id": "1izjxco",
        "author": "Sudden_Pop_2279",
        "title": "Squid Game' Season 2 was the most-watched show on Netflix in Q2 2024, in only 5 days",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1izjxco/squid_game_season_2_was_the_mostwatched_show_on/"
    },
    {
        "id": "1iyt6v9",
        "author": "Flat-Creek93",
        "title": "The Woman in the House Across the Street from the Girl in the Window",
        "content": "I’m going preface this by saying I’m a complete moron. I had no clue this was satire until like the last or second to last episode. In my defense, I knew nothing about this show when I clicked on it and was slightly preoccupied when I watched it. But OMG looking back on it, there’s so much dumb stuff I missed that’s absolutely hilarious. I might have to watch it again.",
        "upvotes": 407,
        "comments": 77,
        "media": null,
        "permalink": "/r/netflix/comments/1iyt6v9/the_woman_in_the_house_across_the_street_from_the/"
    },
    {
        "id": "1izvkns",
        "author": "Pale_Prior814",
        "title": "Need help with preview video audio always on now",
        "content": "General background info:\nI have the netflix app on my laptop, for the longest time it would keep audio muted on the preview videos and i could just toggle it on to hear with sound when I wanted to.\n\nProblem:\nSound is now always on for the previews and i have to mute every time I open the app, the big preview netflix always shows on the home page blasts at full netflix volume when i have it max 10 whenever watching anything on netflix and on my computer in general\n\nQuestion:\nDoes anyone know why its defaulting to having the preview audio always on now and how to fix it?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1izvkns/need_help_with_preview_video_audio_always_on_now/"
    },
    {
        "id": "1izvit2",
        "author": "Frank3634",
        "title": "New &amp; Popular",
        "content": "I always come here on Mondays to see what is new. It has been helpful not to keep track of all the shows. Just learned that Toxic Town was added to Netflix and never saw it in New &amp; Popular, how accurate is it?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1izvit2/new_popular/"
    },
    {
        "id": "1izgpuv",
        "author": "Pogrebnik",
        "title": "'Pokémon Concierge' Season 2 Will Debut in September on Netflix",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1izgpuv/pokémon_concierge_season_2_will_debut_in/"
    },
    {
        "id": "1iza29u",
        "author": "MrHaZeYo",
        "title": "I wish streaming services had options to make your own like TV station.",
        "content": "This applies to all of the big ones (hulu, Disney, Netflix, max, etc)\n\nSo what I mean is:\n\nSay I want to pick 10 TV shows and put them in a queue of sorts. The service plays 1-3 episodes of show A, then auto changes to show B, then C, etc. \n\nIt'd be cool to be able to also have an app that has all of the services your paying for all in one. The services still get your money, and you get everything from one app.",
        "upvotes": 13,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1iza29u/i_wish_streaming_services_had_options_to_make/"
    },
    {
        "id": "1izuhjj",
        "author": "jredjolly",
        "title": "Netflix Extra Member Deleted My Account",
        "content": "I am the primary account holder and my parents who live in a different household are also on the account. We finally got forced to split our accounts. I learned about the extra member feature, and initially moved my mom there first. I then realized the price per month only includes one extra member. No worries yet. I realized I should make myself the extra member and my parents the primary. \n\nWell, well, well, this is most certainly not an option! I moved my mom back to the primary account which *obviously* deleted her Netflix history (apparently joining the extra member spot is a *one way trip*). I then also learned that the primary member cannot move themselves to the extra member spot nor transfer the primary status to a different account. \n\nSo in the end I whipped my mom’s history and my only option is to make myself a new account as the extra member. Such a cluster. Netflix sucks as does its customer support. I asked for an email to give feedback and support told me that was also their job…",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1izuhjj/netflix_extra_member_deleted_my_account/"
    },
    {
        "id": "1izp2ik",
        "author": "giagiu8",
        "title": "Catalog and search results are completely different on fire stick and mobile, am I missing something?",
        "content": "I watch mostly horror movies and I've recently noticed (since I've been using it more) that when I check the catalog on tv I literally get suggested the same movies and shows over and over again both on the homepage and under the single movie (\"similar to this\"), and even when typing 'horror' in the search bar- to the point where I started believing that Netflix genuinely had just those few horror movies. \nI don't really use Netflix on my phone but I opened it today to find a completely different homepage: not only I had more movies, but the ones that I keep getting suggested on the tv don't pop up until I scroll for a bit. Even the same movies I watched, in the \"similar\" section have more suggestions. \n\nIs it a fault of the firestick's app or is there an extra setting I need to toggle to see all of them, or something along those lines?\n\nFor now I can just use the mobile app to add them to my list so I can easily find them again, but it's kinda annoying",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1izp2ik/catalog_and_search_results_are_completely/"
    },
    {
        "id": "1izklso",
        "author": "MiniNoodles",
        "title": "Netflix Special Fan Screening Email - Real or Fake?",
        "content": "Hi everybody,\n\n  \nI've been sent an email by [theelectricstate@netflixevents.com](mailto:theelectricstate@netflixevents.com) about attending a Netflix special fan screening for The Electric State in London next week. Is this a real email? There isn't any branding on the email and I can't find any information about the event online so I just want to make sure it's real before emailing back!\n\n  \nThanks everyone!",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1izklso/netflix_special_fan_screening_email_real_or_fake/"
    },
    {
        "id": "1izf1r9",
        "author": "L-E-G-O-S",
        "title": "What's happening to netflix?",
        "content": "My profile is almost completely reset. My list only has one show, my profile picture is reset, and I can't find the shows I'm trying to watch. This happened first on pc, but my phone and ps5 netflix were completely fine. But now It's happening on my ps5 too",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1izf1r9/whats_happening_to_netflix/"
    },
    {
        "id": "1izbj82",
        "author": "Morganbanefort",
        "title": "CHAOS: The Manson Murders | Official Trailer | Netflix",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1izbj82/chaos_the_manson_murders_official_trailer_netflix/"
    },
    {
        "id": "1iynxln",
        "author": "Sweaty-Toe-6211",
        "title": "Netflix CEO Ted Sarandos Explains Why Traditional Sitcoms Like 'The Big Bang Theory' Are Still Big Business",
        "content": "",
        "upvotes": 83,
        "comments": 60,
        "media": null,
        "permalink": "/r/netflix/comments/1iynxln/netflix_ceo_ted_sarandos_explains_why_traditional/"
    },
    {
        "id": "1izenua",
        "author": "777NightFury77",
        "title": "People of reddit I am working on a research paper, I’d love to hear your thoughts on OTT platforms and how they’ve changed the way you watch content. This short survey (just a few minutes!) will help me understand what drives people to choose streaming services over traditional TV.",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1izenua/people_of_reddit_i_am_working_on_a_research_paper/"
    },
    {
        "id": "1ize6s2",
        "author": "reapercrewsamcro",
        "title": "Netflix frame hopping Iag",
        "content": "I’ve been trying to watch breaking bad lately but out of no where the picture will freeze up and skip like a scratched dvd, my internet connection is really good and I’m wired in so I’m not sure if this is my tv itself or Netflix is bugging out, this started about a month ago. is this happening to anyone else please help. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ize6s2/netflix_frame_hopping_iag/"
    },
    {
        "id": "1iyoes0",
        "author": "nycsbestkeptsecret",
        "title": "This season is bad ? (The Night Agent )",
        "content": "I really just couldn’t get behind this season. This romance between Peter and Rose just doesn’t give me life. She also doesn’t have any sex appeal as well (as does Peter), the storyline between the US and Middle East is a bit redundant. \n\nNoors character got on my nerves (&amp; and man her brother same ) .\n\nI’m sorry for all the negativity, but I just couldn’t stand it. \n\nDoes anyone else feel this way ?! ",
        "upvotes": 42,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1iyoes0/this_season_is_bad_the_night_agent/"
    },
    {
        "id": "1iyrd7j",
        "author": "MysteriousDelay6266",
        "title": "HAVOC | Official Teaser | Netflix",
        "content": "",
        "upvotes": 20,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1iyrd7j/havoc_official_teaser_netflix/"
    },
    {
        "id": "1izb8jv",
        "author": "Ryoga476ad",
        "title": "Android Emulator to run Netflix",
        "content": "Hi, I am often travelling by plane and I used to watch Netflix while flying with my PC.  \nas you know, it's not possible anymore so I have to settle for a lesser experience on my phone.  \nWondering, is anyone using an Android emulator that allows you to download the movies/episodes to watch them offline?",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1izb8jv/android_emulator_to_run_netflix/"
    },
    {
        "id": "1iyr6sh",
        "author": "mad_max_mb",
        "title": "What’s the Best Show or Movie You’ve Watched on Netflix?",
        "content": "With so many options on Netflix, it’s hard to pick what to watch next. From intense thrillers to heartwarming dramas, the platform has something for everyone.\n\nFor me, \"Money Heist\" was an absolute game-changer—the tension, the characters, and that iconic Bella Ciao just made it unforgettable!\n\nWhat’s your top Netflix recommendation? A hidden gem, a must-watch series, or a recent favorite? Let’s share our best picks!",
        "upvotes": 14,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1iyr6sh/whats_the_best_show_or_movie_youve_watched_on/"
    },
    {
        "id": "1iyn6tg",
        "author": "Robemilak",
        "title": "'Zero Day' Ranks as Second Most Watched Netflix TV Shows This Week (Worldwide)",
        "content": "",
        "upvotes": 26,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1iyn6tg/zero_day_ranks_as_second_most_watched_netflix_tv/"
    },
    {
        "id": "1iz4oxq",
        "author": "Ambitious-Parking-33",
        "title": "Netflix speed watch option",
        "content": "Does anyone here watch Netflix shows or movies at 1.25x or 1.5x speed? I know I do it on social media, but it feels different when it comes to streaming. Also, has anyone ever watched at 0.5x or 0.75x speed? If so, why?",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1iz4oxq/netflix_speed_watch_option/"
    },
    {
        "id": "1izhuiu",
        "author": "laurie-tommy",
        "title": "Would anyone be a doll and tell me if these shows are on the $7.99 Netflix plan?",
        "content": "- Better Call Saul \n- Money Heist\n- Dynasty\n- You\n- Love is Blind\n- The Witcher \n- Squid Games \n- Stranger Things \n\nI want to know if it is worth it to buy my own plan now that they won’t allow sharing anymore. ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1izhuiu/would_anyone_be_a_doll_and_tell_me_if_these_shows/"
    },
    {
        "id": "1izg5rl",
        "author": "brokenheartedmonkeys",
        "title": "Gears Of War",
        "content": "Netflix Dave Batista is the only valid choice to play the role of Marcus Fenix in the Live action adaptation of Gears.\n\nIf you are a true fan of the franchise and understand that Dave Batista is Marcus Fenix please sign below and share with your friends and family. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1izg5rl/gears_of_war/"
    },
    {
        "id": "1iypg9a",
        "author": "Internal-Bed-3150",
        "title": "Netflix begins adapting the best season of Avatar: The Last Airbender to live-action",
        "content": "",
        "upvotes": 14,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1iypg9a/netflix_begins_adapting_the_best_season_of_avatar/"
    },
    {
        "id": "1izaj4f",
        "author": "MrDannn",
        "title": "What is with the Alpha Males (Macho Alphas) rip-off?",
        "content": "I saw one (Shafted) from France that got the same premise but at least some slight deviation from the originals. The Rooster that just show up is just so shameless in copying the premise/characters 100%. Did the producers of Macho Alphas sell the rights to adaptation to other studios? Do we have another \"Perfect stranger\" situation on our hand?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1izaj4f/what_is_with_the_alpha_males_macho_alphas_ripoff/"
    }
]