[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 11,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 652,
        "comments": 4958,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1njlc22",
        "author": "ZaphodBeeb69",
        "title": "Does Netflix Just Not Care?",
        "content": "Netflix has some GREAT original series. Stranger Things, Ginnie and Georgia, F Is For Family, etc, but they take sooooo long to come out. The girl from Stranger things is a married woman with a child and still playing a teenager in the show. It's been on for over 10 years. WTF? It's become a meme at this point. There's no way the higher ups at Netflix aren't hearing the jokes. They're not course correcting or trying to give us more consistency. By the time any new season of anything comes out, I've forgotten what's already happened. I think they just straight up don't give a shit about their customer base. ",
        "upvotes": 112,
        "comments": 91,
        "media": null,
        "permalink": "/r/netflix/comments/1njlc22/does_netflix_just_not_care/"
    },
    {
        "id": "1njhdex",
        "author": "Longjumping_Land_977",
        "title": "The Tinder Swindler has been arrested again – so here’s what’s actually going on",
        "content": "",
        "upvotes": 121,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1njhdex/the_tinder_swindler_has_been_arrested_again_so/"
    },
    {
        "id": "1niy2gn",
        "author": "SunnySouthDetroit",
        "title": "Monsters: The Ed Gein Story = Mind Blown",
        "content": "Just watched the trailer for this show and I am Stupid excited. I was trying to figure out who the lead actor was and had to look it up. Charlie Human omgawd! I'm a rabid SoA fan, and CH fan. \n\nI'm also a huge fan of the movie and watch it a few times a year. I did not have my hopes up for this but if it's half as good as the trailer, I can't wait. Come on October 2! ",
        "upvotes": 233,
        "comments": 139,
        "media": null,
        "permalink": "/r/netflix/comments/1niy2gn/monsters_the_ed_gein_story_mind_blown/"
    },
    {
        "id": "1njo07x",
        "author": "MamaMia1325",
        "title": "Next Gen Chef",
        "content": "It just came out and I just started watching but I'm already annoyed because KBC (Kelsey Barnard Clark) is one of the judges? (not a fan of hers AT ALL) 🤦🙃 Who else is watching??",
        "upvotes": 5,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1njo07x/next_gen_chef/"
    },
    {
        "id": "1nj6nwr",
        "author": "Need_Some_Sukoon",
        "title": "Need Netflix series suggestions!",
        "content": "Hey everyone 👋\nI’m looking for some good Netflix series to start watching. Open to any genre — thriller, comedy, drama, sci-fi, or even underrated gems that most people don’t talk about.\n\nSome I’ve already watched and enjoyed:- \n[ Stranger Things, Money Heist, Dark, YOU, Cobra Kai, Mind Hunter, etc.]\n\nWould love to hear your recommendations — what’s a must-watch on Netflix right now?\n\nThanks in advance!!",
        "upvotes": 46,
        "comments": 268,
        "media": null,
        "permalink": "/r/netflix/comments/1nj6nwr/need_netflix_series_suggestions/"
    },
    {
        "id": "1njulrf",
        "author": "ruger148",
        "title": "Anyone else still have Brooklyn 99 in Canada?",
        "content": "I thought it was supposed to leave yesterday but I still have it!!! IM SO HAPPY. But does anyone else still have it? Or am I just incredibly lucky for whatever reason?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1njulrf/anyone_else_still_have_brooklyn_99_in_canada/"
    },
    {
        "id": "1njuiwk",
        "author": "jeffreydowning69",
        "title": "Is anyone else experiencing problems today?",
        "content": "I have been having problems all day long with Netflix it keeps on freezing up stopping what I am watching and randomly disconnecting itself from my network.  ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1njuiwk/is_anyone_else_experiencing_problems_today/"
    },
    {
        "id": "1njue07",
        "author": "Basic_Pay_4798",
        "title": "Netflix stuck at loading screen",
        "content": "My internet is fine it works on every other device but when i try to watch something on my phone it's stuck on loading.Sometimes ill hear sound for a little and see the subtitles but with a black screen and then it just goes back to loading screen again,do you guys know how to fix this I tried uninstalling and reinstalling, clearing the cache and app data, force stopping it, restarting my device and nothing is working ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1njue07/netflix_stuck_at_loading_screen/"
    },
    {
        "id": "1njf7uj",
        "author": "Agreeable-Bike-3782",
        "title": "Adult cartoon recommendations?",
        "content": "Looking for something thats not too lame but basically can be  on in the background that you can dip in and out of? What's the best on offer? Not impressed with most so far.",
        "upvotes": 5,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1njf7uj/adult_cartoon_recommendations/"
    },
    {
        "id": "1njeogm",
        "author": "Atlast_2091",
        "title": "ONE PIECE: Season 2 | Sneak Peek | Netflix",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1njeogm/one_piece_season_2_sneak_peek_netflix/"
    },
    {
        "id": "1nj840r",
        "author": "Oregano-Town",
        "title": "Is The Chilling Adventures of Sabrina worth watching?",
        "content": "I personally don’t like Riverdale as I don’t enjoy the intense deviation from the original source material. No hate, I don’t mind when shows give a new take on an old story, but I really like the 1950s vibe of the original Archie comics and the show just wasn’t for me.\n\nI was kind of put off by the knowledge that The Chilling Adventures of Sabrina takes place in the same universe and worry that it’ll fall into the same problem I have with Riverdale. Did anyone here not like Riverdale but found themselves enjoying Sabrina? Or vice versa! I’m interested in hearing what people think!",
        "upvotes": 9,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1nj840r/is_the_chilling_adventures_of_sabrina_worth/"
    },
    {
        "id": "1njpf33",
        "author": "howdythere35",
        "title": "Cancer Survivor Yali Blank Chats “Bad Trip,” Netflix Placement, and More",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1njpf33/cancer_survivor_yali_blank_chats_bad_trip_netflix/"
    },
    {
        "id": "1nikksv",
        "author": "Less-Pen-5705",
        "title": "Yall remember back in the day when Netflix basic no ad plan was like 7/8.99???",
        "content": "Good times….now you have to pay like 20+ bucks to enjoy content without commercials…not only that, they’re piping down on password sharing and making it hard for people to use their family members/friends accounts….not only that, also the very limited new content that they have and the old content that they keep removing….in some ways Tubi is better than Netflix LMFAOOO. Yes tubi may have ads but atleast tubi is free!!! No way I’m paying 10/15+ bucks a month to still watch fucking commercials.",
        "upvotes": 228,
        "comments": 85,
        "media": null,
        "permalink": "/r/netflix/comments/1nikksv/yall_remember_back_in_the_day_when_netflix_basic/"
    },
    {
        "id": "1njntom",
        "author": "coolhead34",
        "title": "Greatest events of WWII in color vs WWII in color road to victory",
        "content": "I have seen the greatest events one but just noticed the road to victory one, which is made 2 years after and also has the double red symbol \n\nSo I was wondering like is it connected or something,  I started it noticed the narrator was different ( plus if it was connected why not just make a second season) and so in curious like how different is it, is it just the same events but with different people talking about it or is it focused on different events \n\nIf i Google it the only info I can find is people making fun of the narrator ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1njntom/greatest_events_of_wwii_in_color_vs_wwii_in_color/"
    },
    {
        "id": "1nj7jy0",
        "author": "Fun_Molasses5215",
        "title": "Stephen Richardson sues Love Is Blind producers over ‘inhumane working conditions’",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nj7jy0/stephen_richardson_sues_love_is_blind_producers/"
    },
    {
        "id": "1njgpn3",
        "author": "jedikkemoedernl",
        "title": "Show recomandations",
        "content": "So as the title mentions i am looking for show recomandations. My favourites are:\n - blacklist\n- prison break\n- the flash\n- lucifer\n\nPlease help me find anything in the same category that i will like ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1njgpn3/show_recomandations/"
    },
    {
        "id": "1njgafy",
        "author": "karengso",
        "title": "Netflix Emmy Award recommendations",
        "content": "I was wondering what were the best Netflix (or other streaming services) shows that won Emmy Awards? If you can tell me briefly what it’s about, that would be great! TIA",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1njgafy/netflix_emmy_award_recommendations/"
    },
    {
        "id": "1nj7ges",
        "author": "Routine_Abrocoma_699",
        "title": "recommendations",
        "content": "Need Netflix series suggestions!\n\nHey everyone 👋\nI’m looking for some good Netflix series to start watching. Open to any genre — thriller, comedy, drama, sci-fi, or even underrated gems that most people don’t talk about.\n\nSome I’ve already watched and enjoyed:- \n[ Stranger Things, Money Heist\n\nWould love to hear your recommendations — what’s a must-watch on Netflix right now?\n\nThanks in advance!!",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nj7ges/recommendations/"
    },
    {
        "id": "1nj8pb1",
        "author": "Lumpy-Rhubarb4124",
        "title": "Is there any good comedy shows on Netflix (Australia)?",
        "content": "I feel like I've seen all the good comedy shows on Netflix now. The last couple of nights I've been trying to find a new comedy show to get stuck into, but nothing sticks. If anyone could recommend something it would be appreciated. Maybe not the obvious ones as I've probably seen it. Thank you!",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1nj8pb1/is_there_any_good_comedy_shows_on_netflix/"
    },
    {
        "id": "1nhxelr",
        "author": "SnooRevelations7068",
        "title": "Netflix cancelled after 10 years. Are you feeling Netflix has gone downhill too?",
        "content": "Hit me yesterday, we haven’t checked out Netflix in awhile. Popped in, layouts completely different and nonsensical, and there really wasn’t anything good or new. Cancelled Netflix after 10 years, but the lack of content and cancelling of interesting shows after a season was ruining Netflix for us anyways. Wife and I both agreed, we don’t give af about the last season of Stranger Things anyways. Anyone else feeling the same way?",
        "upvotes": 873,
        "comments": 580,
        "media": null,
        "permalink": "/r/netflix/comments/1nhxelr/netflix_cancelled_after_10_years_are_you_feeling/"
    },
    {
        "id": "1niyop4",
        "author": "FloatingCow-",
        "title": "Travel locked.",
        "content": "Half of my family is currently with me at the hospital while my son is recovering from heart surgery. Around 1-2 months we will be staying here which is 4 hours away from home. Netflix was working fine until it locked me out entirely unless I change home location. When I go home or my family goes home they also use the Netflix account there. Same family same account I pay for the account fully yet I can’t use it anymore. It’s frustrating that they don’t have an option for this situation where I’m temporarily living somewhere else. I called support and they said to just keep switching back and forth the main household. If that’s the case what even is the point of locking you out if you can just keep going back and forth. Problem that shouldn’t exist. I just want to watch some breaking bad while waiting for my son to fully heal. I know nothing can be done and it is what it is but just wanted to rant. Now I’m just watching king of the hill on Hulu until we go home. ",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1niyop4/travel_locked/"
    },
    {
        "id": "1nj82ws",
        "author": "4723985stayalive",
        "title": "Best netflix documentaries?",
        "content": "No child death please.\n\nI like scams, hustles, light hearted stuff. Bombings where its about hunting them down, i like seeing well done police investigative work.\n I can handle murder but I prefer it to have crazy twists and stuff to helps me stay detached. \n\nI've watched all the trainwrecks, kings of tupelo (my favourite), all the bitcoin ones, all American manhunts. ",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1nj82ws/best_netflix_documentaries/"
    },
    {
        "id": "1niqki7",
        "author": "Anthro-Elephant-98",
        "title": "I found Disenchantment very disappointing",
        "content": "This may be an unpopular opinion, but I really did not like Disenchantment. I watched the first two seasons *hoping* I would get into it, but I never did. Personally, the reason that I found the show disappointing was because I went into it thinking it was going to be some epic fantasy quest plot line. Something comparable to that of Lord of the Rings, Game of Thrones, Narnia, Avatar: The Last Airbender, etc. but something with comedy as much as adventure, wonder, and advanced world building.  \n  \nThere was virtually *NO* adventure. At least not an epic one, anyway. Don’t get me wrong, I think there is DEFINITELY a market for an adult cartoon/fantasy parody series, similar to an animated Order of the Stick (iykyk). But with the plot line it currently has, the whole time, I was thinking, “and *whyyyyyy* is it set in a medieval fantasy world?” The setting didn’t seem to add anything interesting to the story. It could've been set in the real world following a rich heiress instead of a princess and literally NOTHING about the plot would change other than a few visual gags.   \n  \nI wanted to like this show. I really did. I watched the whole first and second seasons hoping it would get more interesting but it never did. As a fan of fantasy adventure quest stories, this was a huge disappointment. The only thing that I really enjoyed about this show was the animation. The animation was *exceptionally* good. But again, I feel like they could've done more with the fantasy adventure aspect of the world. Like I said, there is definitely a market for something like that, but this show wasn't it.",
        "upvotes": 11,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1niqki7/i_found_disenchantment_very_disappointing/"
    },
    {
        "id": "1nj5vlb",
        "author": "CaptainDestruction",
        "title": "Should Netflix have a tier of only their exclusive in house movies/shows?",
        "content": "As someone who is only subscribed to a few services I find that the amount I pay for all the services there is alot of overlapping content. My question centers around the idea of subscribing for the exclusive content and paying a lower amount and not getting the outside movies/shows, would this be a smart idea? Would you find it worth it(of course depending on the price)? I personally know many people who don’t subscribe to Netflix, Prime, HBO etc. because they only want to watch the exclusive content but don’t want to pay the price to get content they already have access to elsewhere.",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1nj5vlb/should_netflix_have_a_tier_of_only_their/"
    },
    {
        "id": "1nj7nfj",
        "author": "gladeplugin26",
        "title": "Shows on Netflix",
        "content": "Does anybody know how do you pitch a show idea to Netflix? I’m just a random, but I’ve been thinking about this show idea for a while and I think Netflix might like it, considering some of the stuff they have on there now. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nj7nfj/shows_on_netflix/"
    },
    {
        "id": "1nilndj",
        "author": "darth_vader39",
        "title": "Tom Clancy's Splinter Cell: Deathwatch | Official Trailer | Netflix",
        "content": "",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nilndj/tom_clancys_splinter_cell_deathwatch_official/"
    },
    {
        "id": "1njfhrv",
        "author": "OCapalot14",
        "title": "Is Stranger Things or Dark better?",
        "content": "I wanna have this debate to be honest they’re both great shows I feel like you can pick your poison with either one. I’ll start with saying I have Stranger Things by a little bit.",
        "upvotes": 0,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1njfhrv/is_stranger_things_or_dark_better/"
    },
    {
        "id": "1ni7h51",
        "author": "Fabulous-Question173",
        "title": "Adolescence",
        "content": "So I started this today and I can't stop watching it. I can definitely understand why it won some awards. The show touches on a lot things that some of us just don't think about. I can't imagine what kids go through with social media nowadays. I was a freshman in HS in 2002. We were right on that beginning of it. We were right at that age where everyone still got outside and did everything. Like drag main street. Later on it was bon fire parties. I can't even begin to imagine the photos and videos that could be out there. ",
        "upvotes": 60,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1ni7h51/adolescence/"
    },
    {
        "id": "1njaiuc",
        "author": "EboLad",
        "title": "Brooklyn 99",
        "content": "What do I do?\n\nBrooklyn 99 is gone. \n\nIt’s my top show for Netflix. It’s been taken away. Can I protest this? I watch it a lot. A lot a lot. I’m empty. Disney doesn’t do this to me. Did I not watch it enough? I watched it a lot. I feel empty. Can I download it? How do I get it all on my iPhone? What do I do? How can I get it all on my iPhone? \n\nPlease help me. It’s my favourite show. I can’t sleep. ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1njaiuc/brooklyn_99/"
    },
    {
        "id": "1nisopl",
        "author": "ZoinMihailo",
        "title": "King (2019) - Best Netflix film or just overhyped?",
        "content": "WillShakespeare1564 • 2h ago:\nMarry, good sir, thou dost pose a question most vexing to mine authorial heart!\nVerily, young Chalamet doth bear the crown's weight with such gravity as would make mine own Hal weep with recognition. Yet where, prithee, are the \"gilded monuments\" of verse that should accompany such kingly transformation?\nMethinks this film captures well the \"uneasy lies the head that wears a crown\" - the political machinations ring most true to mine intent. But alack! The poetry hath been murdered most foul, replaced by prose as plain as a Puritan's doublet.\nThe French scenes? Chef's kiss - though I confess 'tis strange to see mine Dauphin speak with such... how say you... \"realistic\" dialogue rather than mine flowery conceits.\nTL;DR: 'Tis a worthy adaptation that honors the substance of mine work whilst abandoning its soul. Netflix hath created a fine historical drama, but murdered a poetic tragedy.\nVerdict: Netflix hath honored the plot, but buried the Bard.\nP.S. - Still better than that Mel Gibson Hamlet nonsense, by my troth!",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nisopl/king_2019_best_netflix_film_or_just_overhyped/"
    }
]