[
    {
        "id": "1pqpfyk",
        "author": "ClarkGreggAMA",
        "title": "Hi /r/movies! I'm Clark Gregg. You might know me from Agents of SHIELD, Iron Man, Thelma, 500 Days of Summer, The Avengers, State and Main, The West Wing, The Shield, and more. Ask me anything!",
        "content": "Hi r/movies! I'm Clark Gregg. You might know me from things like **Agents of SHIELD**, **Iron Man**, **Thelma**, **500 Days of Summer**, **The Avengers**, **Magnolia**, **State and Main**, **Much Ado About Nothing**, **Being the Ricardos**, **Snowpiercer**, **The West Wing**, **The New Adventures of Old Christine**, **The Shield**, and more. Maybe you've also seen me on Broadway in A Few Good Men or Good Night, and Good Luck. Full list of credits [here](https://www.imdb.com/name/nm0163988/).\n\nI also star in **The Artist**, a new murder-mystery series which is streaming exclusively on [TheNetwork.Stream](http://TheNetwork.Stream)\n\nI'm here to answer your questions.\n\nMore information about my newest project:\n\n**The Artist** \\- In the twilight of the Gilded Age, murder strikes the estate of an eccentric and failing tycoon. As he hosts the era's biggest celebrities including Thomas Edison, Edgar Degas and Evelyn Nesbit, lies, mystery and ambition collide as the truth is shockingly revealed.\n\n*Trailer*: [http://youtube.com/watch?v=xoA7msjfqkA](http://youtube.com/watch?v=xoA7msjfqkA)\n\nStarring Mandy Patinkin, Janet McTeer, Danny Huston, Hank Azaria, Patti Lupone, Katherine McPhee, Clark Gregg, Ever Anderson, and Zachary Quinto. Streaming exclusively on The Network.\n\nPart 1 premiered on Thanksgiving, and Part 2 will be premiering on Christmas day.\n\nAsk me anything! Back at 3:30 PM today (Friday 12/19) to answer your questions.",
        "upvotes": 3117,
        "comments": 711,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/f6kw5v5jt68g1.jpeg?auto=webp&amp;s=f719cc49435ab34b2b61ff80a61d0f750eb38dcd"
        },
        "permalink": "/r/movies/comments/1pqpfyk/hi_rmovies_im_clark_gregg_you_might_know_me_from/"
    },
    {
        "id": "1pqbjno",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Avatar: Fire and Ash / The Housemaid / The SpongeBob Movie: Search for SquarePants)",
        "content": "**New In Theaters**:\n\n* [Avatar: Fire and Ash](https://old.reddit.com/r/movies/comments/1pqbh9u/official_discussion_avatar_fire_and_ash_spoilers/?)\n* [The Housemaid](https://old.reddit.com/r/movies/comments/1pqbhad/official_discussion_the_housemaid_spoilers/?)\n* [The SpongeBob Movie: Search for Squarepants](https://old.reddit.com/r/movies/comments/1pqbhbe/official_discussion_the_spongebob_movie_search/?)\n\n**Awards Run Catch-Up**\n\n* [Sentimental Value](https://www.reddit.com/r/movies/comments/1pkhnsl/official_discussion_sentimental_value_spoilers/)\n* [It Was Just an Accident](https://www.reddit.com/r/movies/comments/1pkhnwc/official_discussion_it_was_just_an_accident/)\n\n**25th Anniversary Throwback Discussion Threads**:\n\n**No throwbacks this week as we try to align the weeks so we can continue next year. Next batch of movies were Christmas day releases so we will post them with the Christmas day '26 releases.**\n\n**Still In Theaters**:\n\n* [Ella McCay](https://www.reddit.com/r/movies/comments/1pkhnoq/official_discussion_ella_mccay_spoilers/)\n* [Five Nights at Freddy's 2](https://old.reddit.com/r/movies/comments/1pekchd/official_discussion_five_nights_at_freddys_2/?)\n* [Hamnet](https://old.reddit.com/r/movies/comments/1pekcj2/official_discussion_hamnet_spoilers/)\n* [Zootopia 2](https://www.reddit.com/r/movies/comments/1p7rbyf/official_discussion_zootopia_2_spoilers/?)\n* [Eternity](https://www.reddit.com/r/movies/comments/1p7rc0x/official_discussion_eternity_spoilers/?)\n* [Wicked: For Good](https://old.reddit.com/r/movies/comments/1p2njr5/official_discussion_wicked_for_good_spoilers/?)\n\n**New On Streaming:**\n\n* [Wake Up, Dead Man](https://old.reddit.com/r/movies/comments/1plb82b/official_discussion_wake_up_dead_man_a_knives_out/?)\n* [Jay Kelly](https://old.reddit.com/r/movies/comments/1pg2zf7/official_discussion_jay_kelly_spoilers/?)\n* [Train Dreams](https://www.reddit.com/r/movies/comments/1p4qwxk/official_discussion_train_dreams/)\n* [PBS's The American Revolution](https://www.reddit.com/r/movies/comments/1p4qsya/official_discussion_pbs_the_american_revolution/)\n* [Nouvelle Vague](https://old.reddit.com/r/movies/comments/1oyaqq6/official_discussion_nouvelle_vague_spoilers/?)\n* [Playdate](https://old.reddit.com/r/movies/comments/1oyaqsm/official_discussion_playdate_spoilers/?)\n* [Frankenstein (2025)](https://old.reddit.com/r/movies/comments/1orfrtf/official_discussion_frankenstein_2025_spoilers/)\n* [Hedda](https://old.reddit.com/r/movies/comments/1orfruj/official_discussion_hedda_spoilers/?)\n* [Ballad of a Small Player](https://www.reddit.com/r/movies/comments/1okihwe/official_discussion_ballad_of_a_small_player/?)\n* [A House of Dynamite](https://old.reddit.com/r/movies/comments/1ofgyx9/official_discussion_a_house_of_dynamite_spoilers/?)\n* [The Hand that Rocks the Cradle (2025)](https://old.reddit.com/r/movies/comments/1ofgz2p/official_discussion_the_hand_that_rocks_the/?)",
        "upvotes": 34,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1pqbjno/official_discussion_megathread_avatar_fire_and/"
    },
    {
        "id": "1prlvb9",
        "author": "HasSomeSelfEsteem",
        "title": "How did Taylor Sheridan go from writing heartbreaking, thoughtful, and poignant films to writing disposable, propagandistic, soap operas?",
        "content": "My first exposure to Taylor Sheridan was 2015's \\*Sicario\\*. Directed by Denis Villeneuve, \\*Sicario\\* is a bleak story about the ultimate collapse of jurisdiction, legality, and morality around the War on Drugs as national elements and interests slowly degrade into pure power politics. It has been called the \\*Apocalypse Now\\* of the War on Drugs, and while I don't think \\*Sicario\\* is quite a film of that caliber I do think the comparison stands as legitimate.\n\nThe year after \\*Sicario\\* was released, 2016, saw the release of a crime tragedy set in West Texas titled \\*Hell or High Water\\*, directed by David Mackenzie. \\*Hell or High Water\\* is a great films, as all of the performances, settings, and dialogue create a sincere and disturbing look at rural poverty in America. The film, ostensibly a heist film, features characters fully formed from the land which reared them. The cars they drive, the way they talk, and clothes they wear all appear to the audience as sincere to the setting and theme.  The climactic refrain of the film is poignant, \"I've been poor my whole life, like a disease passing from generation to generation. But not my boys, not anymore.\"\n\nAnd the year after that we have 2017's \\*Wind River\\*, directed by Sheridan himself. I have mixed feelings about this film. It tackles the topic, that of the murder of Indigenous women on western reservations, with the appropriate weight and despair. At times it \\*almost\\* rises to the level of Cormac McCarthy and Larry McMurtry in terms of the grandiosity and profound sorrow in the western cannon. It is a film which is so tense at times it almost feels like your back is about to shatter from the strain. The climactic standoff absolutely deserves it's place in film history. And it features an incredible, but brief, performance by Gil Birmingham as a father who almost seems to be transforming into a being of pure grief. However, \\*Wind River\\* also features Jeremy Renner as a white guy who seems to really believe that he is just as native as the Native Americans he lives with, and while Elizabeth Olsen turns in a good performance as the representative of an uncaring federal government, she plays a far more central role in the plot that the great Graham Greene, whose portrayal of an indigenous police chief is commanding of respect.\n\nBy 2018 Sheridan had three critically acclaimed films under his belt, with one as director and one being nominated for Best Picture. Then he writes the superfluous sequel to \\*Sicario\\* titled \\*Sicario: Day of the Soldado\\*, which failed to make any real impact at all. Importantly, however, \\*Sicario 2\\* reduces the immorality and cynicism from the CIA characters and seemingly is more approving of the institutions he criticized in his own previous screenplay. All in all, a strange and disappointing follow up.\n\nAnd then \\*Yellowstone\\* happens, which launches Sheridan into the stratosphere in terms of fame and income. I hate \\*Yellowstone\\*. I hate how its understanding of the west is seemingly entirely based in the Texan hatred of public land and land conservation. I hate how the show's understanding of the rural working class and ranching is almost entirely seen as violent, confrontational, and libertarian. I hate the militarism of the show . But I think what I hate most is how a man who once wrote a heartbreaking film about rural poverty wasted the opportunity to offer any meaningful examination of life in the rapidly gentrifying American West, and instead became the primary advertiser for that gentrification.\n\nAnd then the rest is history. He's now writing disposable show after disposable show about the virtues of the American military establishment, as well as about the virtues of the oil industry decimating the rural farmland he was once such a mourner of. In \\*Wind River\\* oil rig workers were the racist, murdering, rapists, in \\*Landman\\* they're heroes holding up the American way of life.\n\nBut I know the answer already. It's money. Soap Operas aimed at suburban conservatives sell very well, and \\*Yellowstone\\* is the apotheosis of that genre.",
        "upvotes": 6197,
        "comments": 1087,
        "media": null,
        "permalink": "/r/movies/comments/1prlvb9/how_did_taylor_sheridan_go_from_writing/"
    },
    {
        "id": "1pryycy",
        "author": "hominoid_in_NGC4594",
        "title": "John McClane (Bruce Willis) taking out most of the hitmen that were sent to get rid of Matt Ferrell (Justin Long) at the beginning of \"Live Free or Die Hard\" was a pretty hard-core scene, and a really good re-introduction to McClane after a 10 year hiatus. Quality directing by Len Wiseman.",
        "content": "I love the 4th \"Die Hard\" movie. I wasn't expecting to like it much at all after the 3rd, which is one of my favorite action movies. I mean, it came out 10 years after 3. That is a long time between movies in a franchise. I figured it would be kind of a joke. But it was anything but. Anyway, [that opening scene](https://youtu.be/vx9ULc3TUnc?t=125) at Ferrell's apartment is top-notch action, and it hooked me right away the first time I saw it.",
        "upvotes": 488,
        "comments": 70,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/AK7_HFSO9-YFtE0rccEQP8VuxY6FgI3sCvmRqPvij4A.jpeg?auto=webp&amp;s=e0e4bf81c90acfd41541b37a38f934fb6fcd7ef6"
        },
        "permalink": "/r/movies/comments/1pryycy/john_mcclane_bruce_willis_taking_out_most_of_the/"
    },
    {
        "id": "1prie4m",
        "author": "MarvelsGrantMan136",
        "title": "James Gunn Finds His Brainiac For ‘Man Of Tomorrow’ In Lars Eidinger",
        "content": "",
        "upvotes": 4391,
        "comments": 426,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/DJ0-lOCHbNg4UKu65W1vwtCDE88bOW8m3knI0THh-p4.jpeg?auto=webp&amp;s=4282ec2f08c5ca799e7c3dadc2d11e58e759d829"
        },
        "permalink": "/r/movies/comments/1prie4m/james_gunn_finds_his_brainiac_for_man_of_tomorrow/"
    },
    {
        "id": "1prww0x",
        "author": "raxliana",
        "title": "the wild robot is a beautiful movie",
        "content": "i don’t know if i’m just high but this movie is so SO beautiful. so many scenes of beautiful moral story telling. i feel like anyone at any age can feel every emotion to this movie. it shows realistic things about nature to children without obviously doing too much and also not trying to censor the circle of life. and it’s SO FUNNY. i love this movie and it deserves a five star rating from EVERYONE",
        "upvotes": 417,
        "comments": 69,
        "media": null,
        "permalink": "/r/movies/comments/1prww0x/the_wild_robot_is_a_beautiful_movie/"
    },
    {
        "id": "1prb18d",
        "author": "Automaticalee",
        "title": "Transformers: Age of Extinction (2014) - The Romeo &amp; Juliet law scene, in which a 20 year old man describes how he can legally date Mark Wahlberg's 17 year old daughter by showing the law printed on a laminated card he keeps in his wallet.",
        "content": "",
        "upvotes": 9946,
        "comments": 1046,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/m9fwr2vu1c8g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1prb18d/transformers_age_of_extinction_2014_the_romeo/"
    },
    {
        "id": "1pruj0i",
        "author": "chunga_95",
        "title": "What is the most realistic, and unrealistic, depiction of a mundane task in movies?",
        "content": "I'll start: starting a gas powered chainsaw.\n\nUnrealistic: in National Lampoon's Christmas Vacation, when Clark has gone nuts and cuts the knob off the newel post - he starts the chainsaw in one pull. Fake!\n\n  \nRealistic: Mad Max Beyond Thunderdome, Max is running around Thunderdome trying to pull-start the chainsaw, but his life literally depends on it, he keeps pulling and pulling, and it won't catch. When it does, the chainsaw runs for a few seconds and dies. This is my experience with starting chainsaws. ",
        "upvotes": 430,
        "comments": 169,
        "media": null,
        "permalink": "/r/movies/comments/1pruj0i/what_is_the_most_realistic_and_unrealistic/"
    },
    {
        "id": "1prqkdt",
        "author": "Amaruq93",
        "title": "\"The pellet with the poison's in the vessel with the pestle, the chalice from the palace has the brew that is true!\" - from \"The Court Jester\" (1956, directed by Norman Panama &amp; Melvin Frank)",
        "content": "",
        "upvotes": 712,
        "comments": 71,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/x2oaz1pgqf8g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1prqkdt/the_pellet_with_the_poisons_in_the_vessel_with/"
    },
    {
        "id": "1prhkb1",
        "author": "MarvelsGrantMan136",
        "title": "Joseph Kosinski Doesn’t See ‘Tron: Ares’ As A Sequel To ‘Tron: Legacy’",
        "content": "",
        "upvotes": 2308,
        "comments": 336,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/L1GHF9pISUPGXcKa4tyQiYuEoTytlFki6NI82KrwtHM.jpeg?auto=webp&amp;s=51ee01a1c14b32196139ae3a34032551a3bb5380"
        },
        "permalink": "/r/movies/comments/1prhkb1/joseph_kosinski_doesnt_see_tron_ares_as_a_sequel/"
    },
    {
        "id": "1prre47",
        "author": "CinefiloAmador",
        "title": "How come \"Over the Hedge\" (2006) never got a sequel or is rarely talked about?",
        "content": "It got good reviews, made a lot of money, had a terrific cast, I adored the soundtrack, and yet, the film was completely forgotten. It didn't get a spin-off series or a sequel or anything. It was as if it didn't exist and the voice work was outstanding: Bruce Willis, Garry Shandling, Steve Carell, Wanda Sykes, Catherine O'Hara, William Shatner, Allison Janney...etc. \n\n\nI got to see it at my local theater back in the day, 3 times, and I enjoyed it a lot. Perfect for kids while not corny enough to put off adults.",
        "upvotes": 594,
        "comments": 89,
        "media": null,
        "permalink": "/r/movies/comments/1prre47/how_come_over_the_hedge_2006_never_got_a_sequel/"
    },
    {
        "id": "1ps09uo",
        "author": "flash69696969",
        "title": "Is Raiders of the Lost Ark the best opening of all time",
        "content": "It’s an incredible opening scene that does everything:\n\nIntroducing the main character, tells us what he does &amp; how he works, gets us excited about these comic book scenarios that seems ridiculous but he survives, introduces the whip, we understand he hates snakes, the score &amp; the Indy theme is stunning, the shots &amp; shadows create incredible visuals, the authentic props are everything. \n\nAnd we meet his arch nemesis Beloch! All within the first 13 minutes!\n\nCan I suggest it’s the greatest opening scene of all time?",
        "upvotes": 144,
        "comments": 131,
        "media": null,
        "permalink": "/r/movies/comments/1ps09uo/is_raiders_of_the_lost_ark_the_best_opening_of/"
    },
    {
        "id": "1prxsew",
        "author": "Cr1zyh1ppy",
        "title": "What's a film you can practically quote from start to finish and not get bored of?",
        "content": "Mines death becomes her.\n\n\"Ernest! You pushed me down the stairrsssssss!\"\n\n\"My ass! I can see.. my ass!\"\n\n\"I would like to talk about... Madeline Ashton\" 😡\n\n\"And she was a baaad actress\"\n\n\"Now a warning\" \"NOW A WARNING?!\"\n\n\"When you lost your index finger\"              \"I didn't lose it it broke off\".                 \"that's cause you cracked your knuckles all the tiiiime\"! \"ARGHHHH Help me my legs aren't working\"!                                                             \"AHH\"! 📶🤸🤸🎆\n\n\"En garde, bitch!\"\n\n\"She's dead!\".                                                      \"She is? These are the moments that make life worth living\"\n\nedit: it's really making me smile seeing all the films and quotes people love, I'm saving all I haven't seen to watch soon 🙂",
        "upvotes": 128,
        "comments": 361,
        "media": null,
        "permalink": "/r/movies/comments/1prxsew/whats_a_film_you_can_practically_quote_from_start/"
    },
    {
        "id": "1prvo5c",
        "author": "BunyipPouch",
        "title": "First Poster for Pedro Almodóvar's 'Bitter Christmas' - A woman is being abandoned by her partner during Christmas time.",
        "content": "",
        "upvotes": 132,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/h08o24ixzg8g1.jpeg?auto=webp&amp;s=73b4eaaaf0781ce28de5fb8cbf89d3f2be7d207e"
        },
        "permalink": "/r/movies/comments/1prvo5c/first_poster_for_pedro_almodóvars_bitter/"
    },
    {
        "id": "1prylc8",
        "author": "Insightful23blue",
        "title": "Old Hollywood Stars Merry Christmas",
        "content": "In order of appearance: Lucille Ball, Laurel and Hardy, James Stewart, Ginger Rogers, Carole Lombard, Bette Davis, Judy Garland, Gary Cooper, Loretta Young, Barbara Stanwyck, Doris Day, Donna Reed, George &amp; Gracie Burns, Myrna Loy, Bing Crosby and Frank Sinatra. (Courtesy Glamourdaze)",
        "upvotes": 76,
        "comments": 6,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/4ow0bi4drh8g1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1prylc8/old_hollywood_stars_merry_christmas/"
    },
    {
        "id": "1prjbpq",
        "author": "Alternative-Cake-833",
        "title": "Have you ever accidentally watched the wrong movie before?",
        "content": "For some reason many years back. my mother put on The Santa Clause on TV (indeed, I was young at the time). I heard good things about the first one and surprisingly never watched them at all so I decided to sit down and watch it. We usually watch Christmas movies every year as we go through most of them on our list.\n\nSomewhere during the movie, I was getting confused what was happening during the movie (Charlie is a teenager spraying graffiti and the robot taking over control). I felt like that was weird for a Christmas film since it was my first time watching the movie.\n\nIt actually turns out that I was watching the second Santa Clause, not the first one and that how Tim Allen's character becomes Santa Claus was actually in the first movie when I finally got around to it sometime later. I mean, I was a bit shocked when I found that I watched the sequel, not the original later on (though it does happen sometimes).\n\nI have since watched all three of the movies in order and they are good movies to enjoy during the holiday season. But oh my gosh, I was very confused when I watched Santa Clause 2, thinking that it was the first movie and not the sequel.",
        "upvotes": 627,
        "comments": 1370,
        "media": null,
        "permalink": "/r/movies/comments/1prjbpq/have_you_ever_accidentally_watched_the_wrong/"
    },
    {
        "id": "1prnhmw",
        "author": "GoldDerby",
        "title": "‘Scrooged’ sings! Alfre Woodard reveals how she led the closing credits sing-along with Bill Murray:",
        "content": "",
        "upvotes": 351,
        "comments": 42,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/atxCZUYp8OAWD_zpES3KW4nAQJe732Hw1E4Kp7x-Mbw.jpeg?auto=webp&amp;s=ba8cd55f6f6bcf19f98f6d7c5934444789225c9a"
        },
        "permalink": "/r/movies/comments/1prnhmw/scrooged_sings_alfre_woodard_reveals_how_she_led/"
    },
    {
        "id": "1prmns9",
        "author": "superdouradas",
        "title": "Today I watched Bad Boys from 1995 and the movie honestly feels like it could have been filmed in 2025",
        "content": "I’ve always found it interesting that in a lot of michael bay’s films they somehow feel “modern”, even decades later. am i the only one who notices this?\n\nI keep wondering if it’s mainly the lighting, the cinematography, or the way the camera moves that gives his movies that clean, look compared to most other films from the 90s. I get the same feeling with The Rock and Armageddon. I know a lot of people don’t consider him a great director, but honestly his movies seem to age surprisingly well.",
        "upvotes": 343,
        "comments": 155,
        "media": null,
        "permalink": "/r/movies/comments/1prmns9/today_i_watched_bad_boys_from_1995_and_the_movie/"
    },
    {
        "id": "1prhxvf",
        "author": "BunyipPouch",
        "title": "'Poker Face' Star Natasha Lyonne To Write, Direct and Produce 80s-Set Boxing Movie 'Bambo' - It follows a boxing-promoter father as he tries &amp; fails to become the next Don King, and takes his daughter along for the hurly ride of tax evasion, cocaine, race cars, lost dreams and heartbreak.",
        "content": "",
        "upvotes": 412,
        "comments": 53,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/eJNXxchhADYK8T11TGkJvjdwnMZsakXTed_jCkWQFYI.jpeg?auto=webp&amp;s=a5e990b1bcbaed53b460bcfa0b01d4616a0181eb"
        },
        "permalink": "/r/movies/comments/1prhxvf/poker_face_star_natasha_lyonne_to_write_direct/"
    },
    {
        "id": "1pqztf1",
        "author": "MarvelsGrantMan136",
        "title": "'James Bond' Films To Stream On Netflix As Part Of Shock Deal With Amazon",
        "content": "",
        "upvotes": 6279,
        "comments": 240,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GLPN_Z1pTZs-8gVzdZ1l0yvIGsHysqkfC7uleQlBRxU.jpeg?auto=webp&amp;s=01201882c2ad20fe6d5b403df88a1bdcfa195e92"
        },
        "permalink": "/r/movies/comments/1pqztf1/james_bond_films_to_stream_on_netflix_as_part_of/"
    },
    {
        "id": "1prhz7u",
        "author": "BunyipPouch",
        "title": "Louis Theroux Set to Screen New Documentary ‘The Settlers’ at Copenhagen Doc Film Festival - Fourteen years after his first visit and 2011 film 'The Ultra Zionists', Louis Theroux meets some of the growing community of religious-nationalist Israelis who have settled in the West Bank.",
        "content": "",
        "upvotes": 194,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FVunPYojtx8LhCWQHNFMUrkRMlLLdREpRAUmmbMbKcw.jpeg?auto=webp&amp;s=9c0a1e39cfbe2fad769d41b8d09eb58f32a3a40e"
        },
        "permalink": "/r/movies/comments/1prhz7u/louis_theroux_set_to_screen_new_documentary_the/"
    },
    {
        "id": "1pr20wa",
        "author": "fungobat",
        "title": "Frank Darabont Reveals the Real Story Behind Why He Didn't Take on 'The Dark Tower'",
        "content": "",
        "upvotes": 2133,
        "comments": 234,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SsBqLW4aM0CP1FaW8wjn7nwpbil0HTiQi4gyo317vEI.jpeg?auto=webp&amp;s=78dbf01a091dc4b646e76c1eca7e8a57ed54e2a0"
        },
        "permalink": "/r/movies/comments/1pr20wa/frank_darabont_reveals_the_real_story_behind_why/"
    },
    {
        "id": "1prrb6r",
        "author": "cutetiferous",
        "title": "Mulholland Drive question: is it best understood as a dream structure, or as multiple perspectives of the same self?",
        "content": "After rewatching, I’m torn between reading the film as a clean dream/reality split or as a psychological portrait, more like Steppenwolf’s “many selves,” where different versions of the same person take turns narrating guilt, desire, fantasy, and collapse. Curious how others frame it, seems like it has a million interpretations.",
        "upvotes": 41,
        "comments": 39,
        "media": null,
        "permalink": "/r/movies/comments/1prrb6r/mulholland_drive_question_is_it_best_understood/"
    },
    {
        "id": "1prkflr",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Nia DaCosta - Wednesday 1/7 at 11:15 AM ET - Director of '28 Years Later: The Bone Temple', 'Hedda', 'Candyman', 'The Marvels', and 'Little Woods'",
        "content": "",
        "upvotes": 86,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/eyy9nfihee8g1.png?auto=webp&amp;s=a65c1f31c2080964a7b3373d919e09fd83afb3ed"
        },
        "permalink": "/r/movies/comments/1prkflr/amaqa_announcement_nia_dacosta_wednesday_17_at/"
    },
    {
        "id": "1prbf4g",
        "author": "sidroy81",
        "title": "The Shrinking Freedom of Indian Cinema",
        "content": "",
        "upvotes": 331,
        "comments": 74,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3E7ShrzVBI3L4QUAPtW_8ttV8vo0oOYzLkMza9p3jP0.jpeg?auto=webp&amp;s=9604005cf63568514916a329fae147a5eca721a4"
        },
        "permalink": "/r/movies/comments/1prbf4g/the_shrinking_freedom_of_indian_cinema/"
    },
    {
        "id": "1prmwt0",
        "author": "exophrine",
        "title": "Tim Burton and Richard Ayoade on PEE-WEE'S BIG ADVENTURE (1985)",
        "content": "",
        "upvotes": 52,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/p-f90yPPlkmRNjOeSymTjoYW0ncnpwcrW8roCN78AhQ.jpeg?auto=webp&amp;s=8a8e8daa6fc65dbebf3313dcbbb40969d5003896"
        },
        "permalink": "/r/movies/comments/1prmwt0/tim_burton_and_richard_ayoade_on_peewees_big/"
    },
    {
        "id": "1prqjbt",
        "author": "Comfortable-Ear-7037",
        "title": "Nautical or seafaring films.",
        "content": "So here’s my list of seafaring, naval, pirate or otherwise related films I watch every couple years when summer rolls around. What movies am I missing that fit this list? Not debating how “good” these movies are or am after a certain “quality” just halfway decent and fit the theme.\n\n\\-Pirates of the Caribbean franchise (obvious)\n\n\\-Black Sails TV series \n\n\\-Master and Commander\n\n\\-Muppet Treasure Island\n\n\\-Hornblower TV miniseries\n\n\\-Heart of the Sea\n\n\\-Titanic\n\n\\-Perfect Storm\n\n\\-The Bounty\n\nWhat else can I add to this list?\n\nNote: I’ve left off some choices others may seem as obvious such as Life of Pi, Voyage of the Demeter, Captain Phillips etc, due to them not quite having the nautical focus quite as much or having too many other things going on. I like it when the ocean is the heart of the story.\n\nAlso, there are many films that have a sequence or a section that takes place at sea or on a boat, (The New World, certain seasons of Outlander etc,) but is not the main focus.\n\nSimilarly, I do enjoy films that take place on islands or beaches or tropical settings, but I’ve left these off this list as they lack the nautical focus.",
        "upvotes": 28,
        "comments": 110,
        "media": null,
        "permalink": "/r/movies/comments/1prqjbt/nautical_or_seafaring_films/"
    },
    {
        "id": "1prc2qq",
        "author": "PleasantBus5583",
        "title": "Which film had an amazing concept but poor execution?",
        "content": "Some movies begin with a powerful idea, strong trailers, and huge expectations, but end up disappointing because of weak writing, poor pacing, inconsistent direction, or underdeveloped characters. Which film do you think had an amazing concept but failed to live up to its potential, and what specific elements do you feel went wrong for you while watching it?",
        "upvotes": 208,
        "comments": 700,
        "media": null,
        "permalink": "/r/movies/comments/1prc2qq/which_film_had_an_amazing_concept_but_poor/"
    },
    {
        "id": "1prkbzk",
        "author": "West_Conclusion_1239",
        "title": "Phantom Thread is a film i hated, and then loved the second time once i understood what it was aiming for.",
        "content": "Yesterday i rewatched Phantom Thread years and years after the first time i did.\n\nI hated it the first time, because i was excited, and i expected something more similar to There Will Be Blood and The Master, my two favorite PTA films ever, in fact i imagined Anderson would almost close a trilogy of solemn Kubrickian character studies with this one.\n\nOnce i understood what it was aiming for the second time, i loved it.\n\nIt's a delicious and tender portrait of a twisted relationship between two flawed, complicated, toxic, and vulnerable people, a psychological romantic drama in the vein of Hitchcock and Ophuls films.\n\nI don't know maybe i was younger and wanted just more craziness like in Magnolia, Boogie Nights, and Punch-Drunk Love, and more twisted, intense, and entrancing characters like Freddie Quell, Daniel Plainview, and Lancaster Dodd. \n\nBut now at a different phase of my life, i understood the story and the characters, the dynamics between them, the motives and intentions behind their actions, the meanings of certain scenes, etc... \nIt just hit me, i got it.\n\nThe film isn’t about the external drama, it’s about the internal, slow-burn mechanics of obsession and control.\n\nThe second time i've seen the film it hits differently because you’re in a different headspace, more receptive to the nuance, power dynamics, and the quiet cruelty and tenderness of their relationship. \n\nThe way Reynolds and Alma manipulate, hurt, and love each other is so intricately choreographed that it’s basically a psychological pas de deux. \nThat’s what makes the film feel delicious once you understand it.\n\nDaniel Day-Lewis should have won his fourth Oscar, he was believable at every nuance of Reynolds Woodcock, brilliant artist, perfectionist, but also petty, childish, egotistical, manipulative, narcissist, and vulnerable almost like a kid.\n\nHe doesn’t just play Reynolds, he inhabits the contradictions of someone so brilliant and fragile at the same time. \nEvery gesture, every look, every tiny adjustment of posture communicates his internal thoughts and torments.\n\nAnd Vicky Krieps as Alma should have had at least an Oscar nomination, Reynolds's worthy counterpart in this twisted, almost toxic, relationship.\nShe's smart and strong in her subtlety. \n\nTheir chemistry makes the story work, it’s about negotiation, submission, control, and intimacy, not spectacle, big fights, or dramatic twists.\n\n\nHow everyone in the film industry during the Oscar season at the time was fixated on The Shape Of Water and Three Billboards Outside Ebbing, Missouri, but this one didn't sweep all the major categories at the time will always be insane to me.\n\n",
        "upvotes": 57,
        "comments": 35,
        "media": null,
        "permalink": "/r/movies/comments/1prkbzk/phantom_thread_is_a_film_i_hated_and_then_loved/"
    },
    {
        "id": "1przgqq",
        "author": "UteForLife",
        "title": "What movies are you looking forward to for 2026?",
        "content": "What movies are you looking forward to for 2026? It feels like we are finally moving away from standard sequels into some seriously ambitious storytelling from top directors. I am keeping an eye on the Nolan vs. Villeneuve face-off with The Odyssey and Dune: Messiah, along with grounded sci-fi like Project Hail Mary and Steven Spielberg’s Disclosure Day. There is also a lot of buzz around Behemoth from the creator of Andor and Robert Eggers’ next project, Werwulf. Which of these \"non-franchise\" picks is on your radar, or are you just waiting for the big Marvel and Star Wars returns?",
        "upvotes": 6,
        "comments": 27,
        "media": null,
        "permalink": "/r/movies/comments/1przgqq/what_movies_are_you_looking_forward_to_for_2026/"
    }
]