[
    {
        "id": "1ksrm43",
        "author": "Tsumaranai_Jinsei",
        "title": "Comunicado Oficial: Modrić",
        "content": "",
        "upvotes": 902,
        "comments": 218,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aloQaUuYbKpsUR7YBuBxNRmtXeXz4ScGOzxFnEQNbVQ.jpg?auto=webp&amp;s=66cdf9425482679cd64997bb7d2566cbfcea7e93"
        },
        "permalink": "/r/realmadrid/comments/1ksrm43/comunicado_oficial_modrić/"
    },
    {
        "id": "1kq7wdk",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 28,
        "comments": 3249,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kq7wdk/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1ktjnef",
        "author": "_thestarkboy",
        "title": "Vini's open letter to Carlo Ancelloti !",
        "content": "",
        "upvotes": 1017,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xl1fxc6kaj2f1.jpeg?auto=webp&amp;s=2a112f12ad925c537f5e3ace1148ea05490c05bf"
        },
        "permalink": "/r/realmadrid/comments/1ktjnef/vinis_open_letter_to_carlo_ancelloti/"
    },
    {
        "id": "1kthyub",
        "author": "shlokbhargava",
        "title": "Carlo Ancelotti apreciation post!",
        "content": "We could have gone invincibles in 2023/2024 season if not for Atletico Madrid, that too in a injury crisis. We had our main CBs gone RB played as the centre back. Also thanks to Joselu and Lunin for helping us reach the UCL finals. Thank you Ancelotti for managing my team, you will never be forgotten.",
        "upvotes": 487,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qjbh4sv6wi2f1.jpeg?auto=webp&amp;s=4f9e68682bbdfd5a58b02bb6bb3446eb71d9c8cd"
        },
        "permalink": "/r/realmadrid/comments/1kthyub/carlo_ancelotti_apreciation_post/"
    },
    {
        "id": "1ktfa4o",
        "author": "WhySoWeirdUsername",
        "title": "Carlos Final letter to Madrid",
        "content": "Today we part ways again. Once again, I carry with me in my heart every moment of this wonderful second stint as Real Madrid manager. They have been unforgettable years, an incredible journey filled with emotions, titles, and, above all, the pride of representing this club.\n\nThanks to President Florentino Pérez, the club, my players, my staff, and, above all, to this unique fan base that has always made me feel like one of them. What we've achieved together will forever remain in the memory of Real Madrid fans, not only for the triumphs, but for the way we achieved them. The magical nights at the Bernabéu are now part of football history.\n\nNow a new adventure begins, but my bond with Real Madrid is eternal.\n\nSee you soon, Real Madrid fans.\n\nHala Madrid and Nothing Else.",
        "upvotes": 758,
        "comments": 38,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/y7ub8wnh3i2f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ktfa4o/carlos_final_letter_to_madrid/"
    },
    {
        "id": "1ktbqwp",
        "author": "Disastrous-Lab2661",
        "title": "Luka Modric did everything he could to convince Real Madrid to let him stay: He offered to lower his salary, He accepted a bench role, He let the club take their time and make a decision when they want. The club, in the end, decided not to offer him a new deal. He waited until the end for Madrid.",
        "content": "\"He finally set the deadline of Thursday so that he could get the final farewell at Santiago Bernabeu.\n\nThis is why the announcement was made so late, Modric waited until the very end for Madrid to offer him a contract.\"\n\nIf this is true, I'm really disappointed with how things are ending with Luka Modric—he simply deserves more. I know this happens with most our legends but still..\n\n",
        "upvotes": 1505,
        "comments": 221,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rnHIdwkfsHp5zgLMpdA_YVkOpGDqnaQk3li2TbjkMiM.jpg?auto=webp&amp;s=91b356e20b554d913abdbf329a907f1631d18ff5"
        },
        "permalink": "/r/realmadrid/comments/1ktbqwp/luka_modric_did_everything_he_could_to_convince/"
    },
    {
        "id": "1ktexjk",
        "author": "cyrusmancub",
        "title": "Comunicado Oficial: Gracias Carlo",
        "content": "",
        "upvotes": 545,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4Zi0mI0v73EJmHIlWbfMqlHxLRsIoY-o32oej3ZXmgY.jpg?auto=webp&amp;s=0891e8870e335090d2fd54d1b59c5784bb406ee8"
        },
        "permalink": "/r/realmadrid/comments/1ktexjk/comunicado_oficial_gracias_carlo/"
    },
    {
        "id": "1ktfcjv",
        "author": "Kbs2069",
        "title": "Ancelotti dancing with the team last season",
        "content": "",
        "upvotes": 439,
        "comments": 7,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/4bra9vm74i2f1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ktfcjv/ancelotti_dancing_with_the_team_last_season/"
    },
    {
        "id": "1ktliia",
        "author": "Adventurous-Ninja-35",
        "title": "IT WAS ONE HELL OF A RIDE #GraciasCarletto",
        "content": "",
        "upvotes": 156,
        "comments": 2,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ktliia/it_was_one_hell_of_a_ride_graciascarletto/"
    },
    {
        "id": "1ktig3t",
        "author": "WhySoWeirdUsername",
        "title": "Carlo Ancelotti’s final pre-match press conference : If I cry, there is no problem. It will be nice and I share it with Modrić... who has been a spectacular support in this era at Real Madrid. Someone fantastic, a legend. It will be nice to say goodbye with him",
        "content": "Carlo Ancelotti gave his final pre-match press conference while still in charge of the club, speaking at Valdebebas before the La Liga clash with Real Sociedad on Saturday. Speaking about those who will follow him, he said, \n&gt; “I don’t want to give advice, everyone has their own methodology. But enjoy Real Madrid. Xabi Alonso will be the first and I wish him all the luck in the world. He has the quality to coach Real Madrid. Let him enjoy it, that’s what I have to say.”\n\nElaborating further on whether his departure marked the end of an era, he added that, \n&gt; “you may think that a golden generation is coming to an end, with Modrić. Although Carvajal is missing. But this generation, like everything else, must end at some point. And many have left: Casemiro, Cristiano Ronaldo... and Real Madrid continued, as it will continue, to be the best club in the world.”\n\nAncelotti on how special his farewell will be\n\n&gt; “Very, it is inevitable. It is my last game. Always, when an era comes to an end there is a lot of emotion. And this is happening to me. But I am not sad, not at all, but very happy. I have tried to do my best and we leave here happy and content, because sooner or later... this had to happen. Thank you for this time: players, club, president... we have had a great time during this time, I have had a great time. With much affection, help and grateful for the opportunity to coach spectacular players. This period is coming to an end, it has been quite long, but it has ended well. I have never argued with the president and I never will. Not on the last day either. So far, so good. And a new era begins, to which I go with the same enthusiasm with which I arrived here. It has been a successful period, we have won a lot and I consider that holding more than 700 press conferences with you is also a success! We have had a good time. But putting up with 700 press conferences... I don’t think it has been so easy. Some questions have not always been nice.”\n\nAncelotti on his final training session\n\n&gt; “It will be as it should be. A very nice one. As I said, these are exciting days, you talk with the players... and with so many people. My relationship with everyone has been very good and I appreciate the atmosphere: cooks, those who made me carbonara before the games, I thank everyone. I thank everyone. These are special days, but I have not done anything new.”\n\nAncelotti on his emotions in the final game\n\n&gt; “Yes, I get excited very quickly. It’s going to be an exciting day. If I cry, there is no problem. It will be nice and I share it with Modrić... who has been a spectacular support in this era at Real Madrid. Someone fantastic, a legend. It will be nice to say goodbye with him.”\n\nAncelotti on the club paying tribute to him\n\n&gt; “I am proud to have had the opportunity to coach this club. The success of everything I have achieved since 2013 is there. I want to say goodbye with the affection I have for the club.”\n\nAncelotti on his best night at the Bernabéu\n\n&gt; “Bufff, there have been many, many! It is very difficult to choose one. But I’ll go for the comebacks, because they are things that are still unexplained. I’ll remember, above all, those ones. PSG, Manchester City and Chelsea. They will always be unforgettable.”\n\nAncelotti on the transition to lead Brazil\n\n&gt; “The feeling is very nice, very much so. I’m very excited to have the opportunity to not betray Real Madrid with any other club and go to the national team with the most history, the five-time champions. It’s a great challenge, but I love being able to prepare for a World Cup with Brazil.”\n\nAncelotti on how he’d like to be remembered\n\n&gt; “As a good coach, obviously. But time will tell. At this moment, even as I say goodbye, I feel the affection of many people and that makes me very happy... and very happy.”\n\nAncelotti on if he’d return to Madrid after Brazil\n\n&gt; “These are things I don’t know. I don’t feel like coaching another club, or I didn’t, after Real Madrid. That’s what I have said and I maintain. In the future... I don’t know. But the most immediate thing is to do well with Real Madrid.”\n\nAncelotti on how the game has changed since he arrived\n\n&gt; “It has changed, it has changed. And I saw that if I didn’t adapt, I wouldn’t win any more Champions League titles. But in this second chapter I have been helped by a young coaching staff, with enthusiasm and a desire to learn. Preparing a match now is much more analytical than before. There are a lot of aspects that 20 years ago were not taken into account. But I have had a coaching staff, as I said, that has given me the enthusiasm to evolve. I am different now from 1995 and from 2013.”\n\nAncelotti on what Real Madrid needs to change\n\n&gt; “I don’t know, I don’t want to go into this. As I said: the club has all the tools to be competitive next year, and this will always be Real Madrid’s objective. Tomorrow I say goodbye to Modrić... who has been an example for everyone. And for a coach, to have someone like him... because there are many players with a lot of quality, but he has been able to make quality compatible with soul. And that’s made him a Real Madrid legend. This is very important. When you are able to combine the two, you are a legend. And when you can’t, you are a normal player.”\n\nAncelotti on whether he has any regrets\n\n&gt; “No, no. I know I’ve made a lot of mistakes, a lot of them; but since I’ve made so many, I can’t tell you which one has affected me the most. But nothing has kept me awake at night.”\n\nAncelotti on how he’d like to be thought of as a coach\n \n&gt; “I don’t know... I don’t know... My work can be judged, there is no problem. But I am not a coach, I am a person who does the job of coach. There will be those who think better or worse of my work, that’s fine. But I don’t want to be remembered as a bad person.”",
        "upvotes": 209,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/caJLmWNylXQkqUgkL9XwUEcUbSLcehGgGVgbSp_-qxU.jpg?auto=webp&amp;s=5d0713cc2d453edf8d0f1b45d07ef26d3f0f24ab"
        },
        "permalink": "/r/realmadrid/comments/1ktig3t/carlo_ancelottis_final_prematch_press_conference/"
    },
    {
        "id": "1kti35s",
        "author": "Adventurous-Ninja-35",
        "title": "We lost so much in 2 days.",
        "content": "",
        "upvotes": 201,
        "comments": 8,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/dzw8cr93xi2f1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kti35s/we_lost_so_much_in_2_days/"
    },
    {
        "id": "1ktggd9",
        "author": "TiffanyTease_xo",
        "title": "Bellingham's IG post for Luka.",
        "content": "",
        "upvotes": 248,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/o1wgm325gi2f1.png?auto=webp&amp;s=81dff2c33e5d4702997029cc392ef06fd8f7cfba"
        },
        "permalink": "/r/realmadrid/comments/1ktggd9/bellinghams_ig_post_for_luka/"
    },
    {
        "id": "1ktcyb5",
        "author": "FatFootballFan-772",
        "title": "Ode to our very own Lukita.",
        "content": "",
        "upvotes": 519,
        "comments": 15,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ktcyb5/ode_to_our_very_own_lukita/"
    },
    {
        "id": "1ktkngq",
        "author": "I_Like_F0oD",
        "title": "Nothing ever lasts forever 💔",
        "content": "",
        "upvotes": 121,
        "comments": 6,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/otbk9yx9ij2f1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ktkngq/nothing_ever_lasts_forever/"
    },
    {
        "id": "1kt889x",
        "author": "_thestarkboy",
        "title": "Fede Valverde on IG \"Grateful to have been part of a small part of your story. But thank you for being a big part of mine.\"",
        "content": "",
        "upvotes": 1050,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hfu1ubryvf2f1.jpeg?auto=webp&amp;s=53aa18cbb52ab37c854b69248bada248824d2c91"
        },
        "permalink": "/r/realmadrid/comments/1kt889x/fede_valverde_on_ig_grateful_to_have_been_part_of/"
    },
    {
        "id": "1ktnj4j",
        "author": "dakdakdakp",
        "title": "What Liverpool wants, RMA gets?",
        "content": "",
        "upvotes": 64,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/str02dlf3k2f1.png?auto=webp&amp;s=7c9242e072a90026d5ccbaf95b61314058381480"
        },
        "permalink": "/r/realmadrid/comments/1ktnj4j/what_liverpool_wants_rma_gets/"
    },
    {
        "id": "1kthbu1",
        "author": "vil727",
        "title": "Last few weeks as a Real Madrid fan",
        "content": "",
        "upvotes": 111,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/h6xewsr7qi2f1.jpeg?auto=webp&amp;s=0caf4bf1aa76e517a61d709e4919342505425e69"
        },
        "permalink": "/r/realmadrid/comments/1kthbu1/last_few_weeks_as_a_real_madrid_fan/"
    },
    {
        "id": "1ktfds1",
        "author": "Unboxing__Pandora",
        "title": "Ancelotti's most underrated achievement: Unlocking Vini's finishing.",
        "content": "We all remember the early days - how Vinícius Júnior dazzled everyone with his pace, dribbling, and flair, often doing the hardest part by beating defenders with ease, only to falter at the finish or make the wrong decision in the final third. There was raw talent, but also inconsistency.\n\nThat’s where Carlo Ancelotti’s impact has been transformative. Under his guidance, Vini has matured significantly. Ancelotti didn’t just give him confidence - he brought structure to his game. He helped channel Vini's energy more efficiently, improved his decision-making, and gave him the tactical awareness needed at the top level.\n\nNow, Vini still excites with his creativity, but he’s also become clinical, more composed under pressure, and consistently delivers in big moments. Credit to Ancelotti for recognizing the potential and patiently polishing a rough diamond into one of the most feared attackers in world football today.",
        "upvotes": 103,
        "comments": 16,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ktfds1/ancelottis_most_underrated_achievement_unlocking/"
    },
    {
        "id": "1ksvki7",
        "author": "firehawk070",
        "title": "And then, there was one 💔",
        "content": "",
        "upvotes": 2284,
        "comments": 48,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0cxcxfam4d2f1.png?auto=webp&amp;s=c7c3cba8a350a5369716bdaa455a892d38d05193"
        },
        "permalink": "/r/realmadrid/comments/1ksvki7/and_then_there_was_one/"
    },
    {
        "id": "1ktnopw",
        "author": "Ready_Ad_1353",
        "title": "\"Kvaratshelia declares Trent Alexander Arnold as the toughest defender he's faced since he joined PSG",
        "content": "",
        "upvotes": 29,
        "comments": 8,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/0elqg76l4k2f1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ktnopw/kvaratshelia_declares_trent_alexander_arnold_as/"
    },
    {
        "id": "1ktfr75",
        "author": "BananaKetcup007",
        "title": "Thank you Luka Modric",
        "content": "It feels so sad to see Modric leaving. It just hurts on a personal level. \nLuka Modric did everything he could to stay in the club. He offered to lower his salary and waited till the last moment for the management to provide him an extension. Even Xabi wanted Modric next season. No rumour from any other clubs, no proposal. He was always loyal to this club. \nAs a Madrid fan since day one, it really hurts and frustrating  to see how Real Madrid treat their legends. \nModric really deserved one year extension and retire at Madrid after the World Cup 26.",
        "upvotes": 89,
        "comments": 2,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/dno1jkk89i2f1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ktfr75/thank_you_luka_modric/"
    },
    {
        "id": "1ktj4va",
        "author": "Pebbledthoughts",
        "title": "[GUILLERMO RAI] Rodrygo's 'Mysterious' fever still persists and he won't play even tomorrow",
        "content": "",
        "upvotes": 47,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XPZl1uQTTPBfoBYwJacprrvJAmIrmaCF0YLMBJeZ-HE.jpg?auto=webp&amp;s=fab6caea23fa8f2c53139df0c6d8e431a13f99c0"
        },
        "permalink": "/r/realmadrid/comments/1ktj4va/guillermo_rai_rodrygos_mysterious_fever_still/"
    },
    {
        "id": "1ktammv",
        "author": "PriorSnow6874",
        "title": "Which player’s departure from your club hit you the hardest emotionally?",
        "content": "Luka Modrić has announced he’ll leave the club at the end of the season, and honestly, it’s hard to put into words what he’s meant to Real Madrid.\nA true legend, magician on the ball, and the heartbeat of our midfield for over a decade it’s the end of an unforgettable chapter.\nI love watching every bit of content on the Real Madrid TikTok channel, but every time I see a thank you video, I wish it wasn’t for someone like him.\nSo much heartbreak💔 ",
        "upvotes": 245,
        "comments": 127,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/o7yahkj9jg2f1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ktammv/which_players_departure_from_your_club_hit_you/"
    },
    {
        "id": "1kssz72",
        "author": "_thestarkboy",
        "title": "📲 Toni Kroos replies to Luka Modrić’s IG post.",
        "content": "",
        "upvotes": 2741,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/dcq6tk91mc2f1.jpeg?auto=webp&amp;s=80cacaeb8de49ed3541b61596f4546f7beda2cdd"
        },
        "permalink": "/r/realmadrid/comments/1kssz72/toni_kroos_replies_to_luka_modrićs_ig_post/"
    },
    {
        "id": "1kste3k",
        "author": "arkam_uzumaki",
        "title": "CRISTIANO RONALDO: “Thanks for everything, Luka! ❤️ It's been an honor to share so many moments with you at the club. Wishing you success in whatever comes next.”",
        "content": "",
        "upvotes": 2383,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/fna7yym0pc2f1.jpeg?auto=webp&amp;s=460439e4a8810917a619f5cd095a24c013e41e1c"
        },
        "permalink": "/r/realmadrid/comments/1kste3k/cristiano_ronaldo_thanks_for_everything_luka_its/"
    },
    {
        "id": "1ksrmj2",
        "author": "basedzone",
        "title": "Goodbye My Beautiful Legend 😭",
        "content": "",
        "upvotes": 2561,
        "comments": 63,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/b14ev1e2cc2f1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ksrmj2/goodbye_my_beautiful_legend/"
    },
    {
        "id": "1kss9r4",
        "author": "SixFeetBlunder-",
        "title": "Lukita leaves Real Madrid as the most decorated player in the club’s history",
        "content": "",
        "upvotes": 1979,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ysij88rvgc2f1.jpeg?auto=webp&amp;s=b2058d03103e06a0da76a65fdcfcd6b7ae3c7bff"
        },
        "permalink": "/r/realmadrid/comments/1kss9r4/lukita_leaves_real_madrid_as_the_most_decorated/"
    },
    {
        "id": "1kt262p",
        "author": "Luffy710j",
        "title": "We have go along all of this :(",
        "content": "",
        "upvotes": 568,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/i0rxpxl1ge2f1.jpeg?auto=webp&amp;s=df3ea3809b97787f61ac98a11bb7816cf6e0605c"
        },
        "permalink": "/r/realmadrid/comments/1kt262p/we_have_go_along_all_of_this/"
    },
    {
        "id": "1kss8hm",
        "author": "SixFeetBlunder-",
        "title": "All I can say is thank you, LUKA",
        "content": "I can’t believe that the player because of whom I started watching football and supporting Real Madrid is leaving. It doesn’t feel real. Luka wasn’t just another footballer to me, he was the reason I fell in love with the game\n\nFor me,Lukita isn’t just the best midfielder of his generation, he’s my favorite footballer of all time. Nobody comes close. The way he saw the game, the way he controlled tempo, the way he made the impossible look effortless. You couldn’t teach what he had. It was pure instinct, pure magic\n\nI’ll never forget that goal against Manchester United in the 2013 champions league RO 16,  Or his long-range strike vs Granada in 2014, when people were still doubting his impact. The trivela assist to Rodrygo vs Chelsea in 2022 still doesn’t feel real. At 36 years old, delivering that in a Champions League quarterfinal with Madrid on the ropes, only luka\n\nThere was that perfect Champions League final in 2018 against Liverpool, where he quietly ran the whole show. And who can forget the 2016 Clasico at Camp Nou when he bossed the midfield and silenced 90,000 with his poise? That was Modric  never loud, always in control\n\nIt wasn’t just the big games. It was the moments in between. The press resistance, the turns in tight spaces, the one touch passes that opened up entire defenses. That little skip he does before passing. The way he pressed like he was 28, even when he was 37. He never stopped giving everything.\n\nI grew up with him. I learned football watching him. Thank you, Luka, for every beautiful moment. For the elegance, the fight, the loyalty. You were the soul of this team. No one will ever wear the number 10 like you did.\n\nYou’ll always be a legend.\n\nHala Madrid y nada más",
        "upvotes": 1770,
        "comments": 33,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kss8hm/all_i_can_say_is_thank_you_luka/"
    },
    {
        "id": "1kt4koc",
        "author": "carlosluvsyou",
        "title": "An ode to an unforgettable player",
        "content": "So the time has finally come. It's gonna be an emotionally charged write up so bear with me.\n\nMy all-time favourite player is finally ending his time with us and I don't understand why.\nHe still has more to give but I guess in a way, it was always inevitable. And still it doesn't make the pain hurt any less.\n\nOne of a few left from that golden generation, the ones that made the 2010's an absolute dream. A little context. We were entering that decade facing off against the mighty Barcelona of Pep Guardiola and Lionel Messi. Who just got the sextuple if memory serves me right. I hate to admit it but that team was very much feared and it looked like dark days ahead. In came Mou to instil some fight in us and of course the likes of Cristiano and Benzema, but in 2012 this man arrived... and I've been in awe ever since. His grit and his shine. The vision to spot a pass or the work ethic to run down an attacker and make a tackle. His feints, the trivelas and of course those rockets into the top corner. He had it all. A complete player.\n\nFinally, la Decima (under another legend who is leaving us) after 12 long, cold years.\nWe all know how that felt when he put that corner in perfectly for Ramos to head that ball into immortality. Moments where you forget about social norms and just scream, cry and bounce around like a child playing with their favourite toy. He was a part of them all. The 3peat with Zizou and the historic KCM trio. The leagues. And then of course helping us throughout the greatest champions league campaign ever in 2022, leaving a younger, \"fitter\" Neymar in the dust. Who could forget nights like that.\n\nWe could go on and on about the memories he's left for us on the field... but the one that I'll always remember was when he was hammered on the plane chanting that song against Atletico after the match in Lisbon. Not sure if I’m allowed to say what he said but he basically told them we run the capital! \n\nA part of me dies every time one of our legends move on. It's a signal to the brain that time is moving rapidly and soon everyone I grew up with will fade away. As they say, it's sad because it was so good.\n\nI thought after Zidane, there would be no other… I’m glad I was proven wrong.\n\nThe Croatian kid from poverty and war who became a Ballon d'Or winner and the greatest midfielder the world has ever seen. Truly inspirational. But above all, a leader, a great mentor and a true Madridista.\n\nMount Olympus has a spot reserved for you.\n\nThank you for everything, Luka. You'll be missed.",
        "upvotes": 323,
        "comments": 8,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kt4koc/an_ode_to_an_unforgettable_player/"
    },
    {
        "id": "1ktddod",
        "author": "BEASTxTHOR",
        "title": "Bro I can't... Luka 🐐💔... The last blow is gonna be from Carvajal and I'm not ready...",
        "content": "",
        "upvotes": 69,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8jb0n860fh2f1.jpeg?auto=webp&amp;s=e865b31d291195d47547386923a93d6a3cdd41a9"
        },
        "permalink": "/r/realmadrid/comments/1ktddod/bro_i_cant_luka_the_last_blow_is_gonna_be_from/"
    },
    {
        "id": "1kt0dtr",
        "author": "May_zavy",
        "title": "Proud to have been able to see you play once",
        "content": "Once was not enough Luka.\nI wanted to see you again \n\nI still don’t get it, he did great this season compared to how shitty everyone was , almost everyone. We still need him as a playmaker \n\nHala Madrid Hala Madrid Hala Madrid Hala Madrid Hala Madrid Hala Madrid Hala Madrid Hala Madrid \n\nHala Madrid Hala Madrid Hala Madrid Hala Madrid Hala Madrid Hala Madrid Hala Madrid Hala Madrid ",
        "upvotes": 527,
        "comments": 8,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/bpkk6ks63e2f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kt0dtr/proud_to_have_been_able_to_see_you_play_once/"
    }
]