[
    {
        "id": "1h3xmgd",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://t.me/+K_tQ4Zzi0S80YjFk): Gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[LA TAVERNA DELLO STUDENTE](https://t.me/latavernadellostudente/5207): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g30QJSClHjRAUvFBqKJa-Re4duFBniS6HkLBoJRdgOQ.jpg?auto=webp&amp;s=2c44cf9a902b77de7dce3b5cad542f22791fb32e"
        },
        "permalink": "/r/torino/comments/1h3xmgd/la_piola_friends_meetup/"
    },
    {
        "id": "1h3xmg1",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram group for apartment hunting: https://t.me/CaseStudentiTorino\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 2,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1h3xmg1/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1hk98l5",
        "author": "West_Conclusion_1239",
        "title": "Affitti a Torino??",
        "content": "Si parla sempre di Milano per gli affitti altissimi, però io chiedo come sono gli affitti a Torino??\n\nSono situazioni impossibili come a Milano, per cui se hai la fortuna di guadagnare 2000 Euro al mese, ti puoi solo accontentare di stare in affitto nell'hinterland (non conosco le frazioni circostanti di Torino), oppure la situazione è un po' migliore??\n\nDitemi, autoctoni o trasferiti.\n\n",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1hk98l5/affitti_a_torino/"
    },
    {
        "id": "1hjyk63",
        "author": "blackv0idd",
        "title": "Gruppo conoscenze su torino per divertimento e uscite",
        "content": "Abbiamo creato un gruppo whatsapp per conoscerci meglio e organizzare qualcosa per passare del tempo insieme e divertirci, non ha importanza l’età, sono ben accetti ragazzi/e che hanno voglia di fare nuove amicizie,ovviamente nel rispetto collettivo\n\n",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1hjyk63/gruppo_conoscenze_su_torino_per_divertimento_e/"
    },
    {
        "id": "1hk78jt",
        "author": "ildivincodino99",
        "title": "Migliori pub, osterie e taverne?",
        "content": "Titolo.\n\nPossibilmente qualcuna molto \"familiare\"  e con una bella atmosfera e con attività da fare",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1hk78jt/migliori_pub_osterie_e_taverne/"
    },
    {
        "id": "1hjiei2",
        "author": "cawalli",
        "title": "Cappuccini by night ",
        "content": "",
        "upvotes": 33,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/legjpubeh98e1.jpeg?auto=webp&amp;s=bebd0f262af1077bbc18f5f50ab021f5bedb2064"
        },
        "permalink": "/r/torino/comments/1hjiei2/cappuccini_by_night/"
    },
    {
        "id": "1hjci6n",
        "author": "EducationalWafer4691",
        "title": "Ciao a Tutti sono un ragazzo di 35 anni . Mia mamma è morta da poco mentre mio padre va da mio fratello che non mi vuole .sono da solo a casa ricordando i Natali con mia mamma . Qualcuno può darmi un consiglio su dove andare o fare ? Grazie a tutti ",
        "content": "Sono",
        "upvotes": 72,
        "comments": 27,
        "media": null,
        "permalink": "/r/torino/comments/1hjci6n/ciao_a_tutti_sono_un_ragazzo_di_35_anni_mia_mamma/"
    },
    {
        "id": "1hk8m93",
        "author": "Chemical_Ocelot_9604",
        "title": "In quanti possono venire a Candiolo in provincia di Torino il 13 gennaio alle 11:00 al Torino village",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1hk8m93/in_quanti_possono_venire_a_candiolo_in_provincia/"
    },
    {
        "id": "1hjmbkh",
        "author": "pietrino97",
        "title": "Mi trasferisco a Torino... Consigli? Ed è fattibile una relazione a distanza a Milano...?",
        "content": "Tra un paio di mesi mi trasferirò a Torino per lavoro, sono un ingegnere neolaureato con un anno di esperienza, e ho accettato una proposta nel settore Automotive a Torino. L'ho fatto per avvicinarmi al mio settore degli studi, poiché a Milano (dove ho studiato e dove ho vissuto dal 2018 ad oggi), le offerte scarseggiano. Ho 27 anni, vorrei fare esperienza un po' nel settore e poi tentare nuovamente l'estero (sì, nuovamente, perché ahimè per ora non ho avuto riscontri interessanti).\n\nCome sono i prezzi degli affitti? Dite che è fattibile trovare una stanza singola o un mono/bilocale sotto i 600€ in una zona decente della città? Come sono i mezzi pubblici?\n\nE poi... domanda un po' scollegata dalle precedenti... il mio ragazzo abita a Milano, quindi saremmo in una relazione a distanza, io a Torino e lui a Milano appunto... Torino-Milano, in treno o macchina, è fattibile?\n",
        "upvotes": 7,
        "comments": 35,
        "media": null,
        "permalink": "/r/torino/comments/1hjmbkh/mi_trasferisco_a_torino_consigli_ed_è_fattibile/"
    },
    {
        "id": "1hjhokg",
        "author": "TrainAcrobatic2590",
        "title": "Dove vivresti nella provincia di Torino?",
        "content": "Se dovessi scegliere una città in provincia di Torino dove andare a vivere, tipo Avigliana, Giaveno, Coazze o così, quale prenderesti? Pensando a sicurezza, ospedali, scuole vicine, fare amicizia dopo i 30, cose da fare e dove si mangia bene.\n\n  \nGrazie!",
        "upvotes": 7,
        "comments": 38,
        "media": null,
        "permalink": "/r/torino/comments/1hjhokg/dove_vivresti_nella_provincia_di_torino/"
    },
    {
        "id": "1hjh08j",
        "author": "Ok_Custard_6188",
        "title": "C'è qualche ragazzo o ragazza qui che suona il basso elettrico e vuole suonare in una band di musica latina???",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1hjh08j/cè_qualche_ragazzo_o_ragazza_qui_che_suona_il/"
    },
    {
        "id": "1hj8ang",
        "author": "mar538",
        "title": "Appassionati di droni, consigli per zone di volo a Torino?",
        "content": "Ciao a tutti! Qualcuno qui appassionato di droni? Sto cercando zone nelle immediate vicinanze di Torino, dove poter volare in tranquillità e rispettando i regolamenti delle zone consentite. Se avete anche suggerimenti per posti un po' più distanti che meritano, li apprezzerei molto. Grazie!\n",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1hj8ang/appassionati_di_droni_consigli_per_zone_di_volo_a/"
    },
    {
        "id": "1hjf9se",
        "author": "Dandolod",
        "title": "Posti dove correre",
        "content": "Ciao, vorrei iniziare a correre fuori. Conoscete dei posti carini dove andare (preferibilmente in zona crocetta vicino al mauriziano, ma non per forza)? Grazie mille ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1hjf9se/posti_dove_correre/"
    },
    {
        "id": "1hjf5w4",
        "author": "Bokoblob",
        "title": "Looking for your favorite bar and restaurant!",
        "content": "Hi, people of Turin! I'm visiting your amazing city for a few days over Christmas with my parents and my brother. My brother and I are in our late 20s, and our parents are in their 50s.\n\nI'm looking for cool bars with a great vibe, good music, and nothing too touristy or expensive. Any recommendations?\n\nAlso, we're on the hunt for good restaurants with vegetarian options. What are your favorites?\n\nThanks a lot!\n\n",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1hjf5w4/looking_for_your_favorite_bar_and_restaurant/"
    },
    {
        "id": "1hjc2t6",
        "author": "AndyGreen1",
        "title": "I need help regarding studying at Politecnico di Torino.",
        "content": "Hi everyone.\n\nI'm an automotive engineer from a non-EU country. I initially planned to pursue a master's degree in Germany.\n\nI always thought Politecnico di Torino was a great university, but I chose to apply to German universities because I speak German and want to settle in Germany afterward.\n\nI would love to apply to Polito, but I have two concerns and need your help.\n\n1. I don't speak Italian. I think that would affect my opportunities to have an internship while studying, let alone a full-time job after graduation.  In general, would an international student have a chance with so many national engineers available? (Let alone the language barrier—it makes sense to learn the language anyway, plus I speak Spanish and love Italian and Italian culture.)\n\n2. I have read that even Italians move to Germany after their studies for better opportunities and better pay. Knowing that, it makes little sense to study in Italy and then move to Germany, as I'm not EU after all.\n\nThank you very much.",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1hjc2t6/i_need_help_regarding_studying_at_politecnico_di/"
    },
    {
        "id": "1hjf88p",
        "author": "misturbusy",
        "title": "Looking for English-speaking OBGYN (ginecologo) Torino",
        "content": "E: Hello, looking for recommendations for english-speaking OBGYNs in Torino. My wife will be about 5 months pregnant when we move there. We will have private insurance but open to public and private options.\n\nIT: Ciao, sto cercando raccomandazioni per ginecologi/ostetriche che parlano inglese a Torino. Mia moglie sarà incinta di circa 5 mesi quando ci trasferiremo lì. Avremo un'assicurazione privata, ma siamo aperti a opzioni sia pubbliche che private.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1hjf88p/looking_for_englishspeaking_obgyn_ginecologo/"
    },
    {
        "id": "1hisscf",
        "author": "Glittering_Drive_981",
        "title": "senzatetto a porta susa stazione ",
        "content": "praticamente tutte le mattine e sere c’è il tizio con i dread che ferma la gente con la frase “mi dai da mangiare?”, una volta gli ho portato del cibo, praticamente me lo ha schifato e mi ha chiesto se avevo soldi da dargli….\n\npoi c’è un tizio che mostra dei  braccialetti che anche lui è spesso in stazione la sera, l’altro giorno si è praticamente arrabbiato perché non volevo dargli dei soldi, gli ho anche mostrato che avevo zero moneta. insiste per comprargli qualcosa con la carta…rifiuto e si incazza andando via barbottando. tra l’altro a questo gli avevo già dato della moneta più volte in passato.\n\n\nio vorrei capire se questa gente ha bisogno veramente o è solo maleducata e sbandata. io non sono una persona cattiva ma vorrei capire se qualcuno ha mai parlato veramente con queste persone e conosce un minimo le loro storie. \n\nnon ho nulla contro di loro o il fatto di elemosinare (poi, se mi fermi tutte le mattine e quella volta che ci casco mi rispondi pure male un po’ mi girano) ma è davvero così conveniente elemosinare? ",
        "upvotes": 50,
        "comments": 36,
        "media": null,
        "permalink": "/r/torino/comments/1hisscf/senzatetto_a_porta_susa_stazione/"
    },
    {
        "id": "1hjdk9e",
        "author": "Simple_Psychology_11",
        "title": "Does anyone knows this BiancoRooms in Torino?",
        "content": "Hi guys,\n\nI would like to ask if someone lives or knows to someone that has lived in the rooms that BiancoRooms shows. I wrote them to the mail they have in their page  but the mail bounce back saying that it doesn't exist.  \n\nI am in process to book one of those rooms for my erasmus semester but i am not sure if i should?\n\nThank you for any help",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1hjdk9e/does_anyone_knows_this_biancorooms_in_torino/"
    },
    {
        "id": "1hioai0",
        "author": "afGAYnistan",
        "title": "Ciao, qualcuno ha in programma di visitare la Valle d'Aosta (Cervinia) per il nuovo anno?",
        "content": "Io ho intenzione di andarci, dato che quest'anno non andrò a trovare la mia famiglia per le vacanze. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1hioai0/ciao_qualcuno_ha_in_programma_di_visitare_la/"
    },
    {
        "id": "1hhvrdm",
        "author": "marlongarlon",
        "title": "BELLA RAGA MI HANNO DATO IL BENVENUTO A TORINO ",
        "content": "Ieri notte in via Pinerolo 😅😅",
        "upvotes": 59,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/e5g84fmdtt7e1.jpeg?auto=webp&amp;s=c78f16c81ae2444caa791afcbf12658ab79f244e"
        },
        "permalink": "/r/torino/comments/1hhvrdm/bella_raga_mi_hanno_dato_il_benvenuto_a_torino/"
    },
    {
        "id": "1hif1uv",
        "author": "Jimthafo",
        "title": "Sapete consigliarmi un bravo meccanico in zona san donato/cit turin/parella?",
        "content": "Ciao, come da titolo ho sempre noie con le macchine e il meccanico vicino a casa mia ha chiuso. Siccome ho avuto alcune esperienze spiacevoli in giro, volevo chiedere se vi sentivate di consigliare qualche professionista nelle zone sopracitate. Grazie!",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1hif1uv/sapete_consigliarmi_un_bravo_meccanico_in_zona/"
    },
    {
        "id": "1hhswr4",
        "author": "Tough_philosopher13",
        "title": "Vita notturna fetish/kinky a Torino?",
        "content": "Ciao!! Vivo a Bologna ormai da 7 anni e sto pensando di trasferirmi altrove. Per qualche motivo, Torino mi ispira. Mi chiedevo, ci sono eventi kinky o fetish in città? Perché questa è una cosa che mi mancherebbe molto di Bologna, che ha un mood molto “berlinese” per le serate che a me piace molto.\nGrazie in anticipo! ",
        "upvotes": 24,
        "comments": 62,
        "media": null,
        "permalink": "/r/torino/comments/1hhswr4/vita_notturna_fetishkinky_a_torino/"
    },
    {
        "id": "1hi05ko",
        "author": "OneOk553",
        "title": "Fare amicizie a Torino e dintorni",
        "content": "Ciao a tutti, \nvivo a Settimo vicino Torino, ed ho 40 anni. Nonostante le mie origini del sud, purtroppo per me è sempre stato difficoltoso stringere amicizie in questa città, bella ma austera, elegante ma chiusa. Si viene sempre percepiti con una certa diffidenza da altri gruppetti di amici già formati, e spesso si resta con la classica risposta del \"ci si vede\" o \"ci organizziamo\". L'ambiente di lavoro che frequento, purtroppo, è molto in là con gli anni, quindi non ho elementi in comune. Sono un po' nerd, per cui l'ultimo posto in cui andrei a socializzare è la palestra o un corso di ballo.\nMi ritrovo con molte conoscenze di circostanza, ma praticamente non ho nessuno con cui poter condividere il mio tempo libero e coltivare interessi come cinema, serie tv, fantasy, videogiochi, passeggiate o semplici uscite.\nNegli anni quelle poche amicizie strette con fatica si sono dissolte per i soliti motivi noti a tutti, che giungono inesorabili ad una certa età (lavoro, famiglia, figli ecc.). La mia fidanzata ha le sue amiche con cui si ritaglia i suoi spazi e vorrei anche io avere il \"mio gruppetto di amici\". \nPer cui se ci sono persone nella fascia di età fra i 30/45 anni (maschi o femmine), in Torino e dintorni, che sono nella stessa condizione e sono interessate a formare un gruppetto per il tempo libero, date consigli, scrivete o contattatemi.\nOgni luogo perde il suo fascino se si vive da soli.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1hi05ko/fare_amicizie_a_torino_e_dintorni/"
    },
    {
        "id": "1hi1vgl",
        "author": "dj1808",
        "title": "Bike parking advice",
        "content": "Ciao, recentemente si è trasferito a Torino, studiando il maestro. Voglio comprare un ciclo per il pendolarismo, ma il mio appartamento (a Cenisia) non ha un parcheggio per biciclette. Non sono sicuro di parcheggiare per strada, anche se è una strada principale. Qualche consiglio o suggerimento su come mantenere la bici sicura o qualche punto sicuro per parcheggiare?\n\n\n\nThe original, the above translated sorry if it was not accurate: \n\nHi, recently moved to Torino, studying master's. I want to buy a cycle to commute but my apartment( in Cenisia) has no bike parking. I am unsure about parking on the street, even though it is a main street. Any advice or suggestions about keeping the bike safe or any safe spots to park?",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1hi1vgl/bike_parking_advice/"
    },
    {
        "id": "1hi0fun",
        "author": "almareck",
        "title": "All you can eat senza il sashimi limitato ",
        "content": "Ciao ragazzi sapreste consigliarmi un sushi ayce che non abbia il limite a persona sul sashimi? Ne ho provati un po’ ma senza fortuna :(",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1hi0fun/all_you_can_eat_senza_il_sashimi_limitato/"
    },
    {
        "id": "1hhq39g",
        "author": "Paperellagheii",
        "title": "App MoveTo",
        "content": "Qualcuno utilizza mai l'applicazione  si MoveTo per i biglietti metro? Ho acquistato un Daily da 21€, dopo aver provveduto all'acquisto faccio per utilizzare l'applicazione ma crasha di continuo. Ho sia riavviato che reinstallato l'applicazione, ora la preoccupazione è che non ho più i biglietti non essendoci un login sull'applicazione e comunque continua a crashare.\n\nA qualcuno è mai successo questo problema con questa app schifosa e nel caso come avete risolto? \n\nGrazie",
        "upvotes": 5,
        "comments": 25,
        "media": null,
        "permalink": "/r/torino/comments/1hhq39g/app_moveto/"
    },
    {
        "id": "1hhtpaz",
        "author": "MaOr78",
        "title": "Creare Associazione per nuovo gioco",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1hhtpaz/creare_associazione_per_nuovo_gioco/"
    },
    {
        "id": "1hi1k6s",
        "author": "FaLe_Davi",
        "title": "Agganci torino",
        "content": "Salve a tutti, sono uno studente di torino che cerca qualche contatto affidabile e certificato per prendere della weed a torino e dintorni, qualcuno conosce? ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1hi1k6s/agganci_torino/"
    },
    {
        "id": "1hhcrcq",
        "author": "ivlia-x",
        "title": "Albero di Natale (vero), dove si compra?",
        "content": "Ciao, mi sono trasferita dalla Polonia un paio di mesi fa e non so dove si comprano gli alberi di Natale qui?\n\nDa noi verso novembre/dicembre ci sono i mercatini (in parcheggi o piazze) dove si possono trovare i venditori. Non ho visto niente del genere qui (Zona Santa Rita).\n\nVoglio un albero medio-piccolo di circa 100-150cm. Li ho visti da Pam ma erano già tutti secchi e morti… probabilmente perché un albero di 100cm costava 23€ (ma i morti si possono comprare per solo 6€, solo che a casa porti due rametti nudi)\n\n\n",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1hhcrcq/albero_di_natale_vero_dove_si_compra/"
    },
    {
        "id": "1hh7pz0",
        "author": "borisbanana77",
        "title": "Panettone per stranieri",
        "content": "\nCiao!\n\nLa prossima settimana sono in viaggio di lavoro e vorrei portare un po' di Panettone ai miei colleghi.\n\nSto cercando il panettone con il miglior rapporto qualità-prezzo da portare ai miei colleghi all'estero.\n\nNon conosco nessun tipo di questa torta perché l'ho provata forse due volte. Non sono Italiano...\n\nSe puoi, scrivi anche il prezzo stimato per il tuo suggerimento.\n\nCompreresti la torta al supermercato o da qualche altra parte?",
        "upvotes": 1,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1hh7pz0/panettone_per_stranieri/"
    },
    {
        "id": "1hh04cx",
        "author": "Vardl0kk",
        "title": "Sto valutando di trasferirmi dal mio paesino, Torino potrebbe fare per me?",
        "content": "Ciao a tutti! Ultimamente è da un po' che sto valutando di trasferirmi dal mio paesino in qualche altra città più grande.\n\nLe motivazioni principali sono semplicemente queste: per quanto tranquillo e sereno possa essere vivere in un paese di 10 mila abitanti, ci sto davvero stretto e non c'è spazio per le mie passioni.\n\nQui è un posto dove gli hobby che hai sono tuoi individuali, oppure ti piace il calcio e uscire in discoteca il venerdì. Fine.\n\nNulla da togliere a chi gli piace eh sia chiaro, però putroppo a me non interessano minimamente.\n\nI miei principali motivi per cercare città più grandi è per poter trovare un posto dove dare spazio ai miei interessi che sono:\n\n. HEMA scherma storica (da cosa so c'è la Sala d'Arme del folle)  \n. Suonare in band, preferibilmente metal, punk ecc (quindi diciamo che sarebbe figo se ci fosse una buona scena underground con locali dedicati dove piccoli gruppi possono suonare la sera)  \n. Auto e tuning, quindi semplicemente raduni statici e dinamici ecc ecc.  \n. Snowboarding e pensavo anche di ritornare ad andare sullo skate (anni fa lo facevo ma qua dove vivo non c'è mezzo skatepark, quindi mi ritrovavo a girare in un parcheggio vuoto da solo ed è diventato noioso tempo zero...)\n\nOra, detto questo, so che uno non può vivere solo di passioni (ahimè sarebbe bellissimo) ma devo anche lavorare ovviamente.   \nIo ho 23 anni, sono diplomato all'ITIS informatico e ho 4 anni e mezzo di esperienza di lavoro come sviluppatore front end (html, css, javascript, angular, ecc ecc) in un azienda abbastanza importante che riguarda lo sviluppo di software medico (cartelle cliniche, pronto soccorso, gestione ambulatoriale ecc ecc). Direi che il curriculum non è male ma comunque chiedo un parere a voi per sapere com'è la situazione. Non mi dispiacerebbe lavorare per multinazionali che trattano anche altri ambiti oltre a quello sanitario ovviamente. Me la cavo molto bene con l'inglese e non ho problemi ne a parlarlo ne a capirlo, magari faccio qualche piccolo errore grammaticale qua e là però per il periodo che sono stato in irlanda in vacanza non ho avuto alcun problema a interagire con la gente del posto.\n\nCasa e affito, questa è una cosa del quale non so niente quindi mi affido completamente a voi!   \nSono uno che del vivere nel centro non gliene frega niente e preferirei magari farmi anche 30 minuti di macchina ogni giorno per andare a lavoro ma avere magari una casa in una location più tranquilla.   \nDevo aspettarmi di svenarmi completamente solo per permettermi un tetto sopra la testa o trovo anche casette decenti a un prezzo decente? Il top sarebbe indipendente ma capisco che probabilmente è la cosa più complicata e forse all'inizio mi converebbe affittare per capire bene come muoversi e se mi trovo bene.\n\nL'idea sarebbe andare con la mia ragazza, anche lei lavora nella mia stessa azienda solo da un po' meno tempo e non nell'ambito sviluppo ma assistenza tecnica e software (possiamo dire help desk quindi). Anche lei ha solo il diploma (onestamente non ricordo di che scuola ahahah, mi sembra sociosanitario).\n\nQuindi detto ciò, illuminatemi! ",
        "upvotes": 7,
        "comments": 26,
        "media": null,
        "permalink": "/r/torino/comments/1hh04cx/sto_valutando_di_trasferirmi_dal_mio_paesino/"
    },
    {
        "id": "1hgrwf9",
        "author": "Frosty_Substance_293",
        "title": "Italian Interview",
        "content": "I am a high school student in the US and I have a school project to interview someone that grew up in Italy. The questions will be about your country’s culture and way of life.\n\nIf you are interested please respond and I will dm you the questions. If you have any questions feel free to ask.",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1hgrwf9/italian_interview/"
    }
]