[
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 75,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 22,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1lv8tec",
        "author": "ironfalafel",
        "title": "I'm Convinced Old Guard 2 story was created and mostly written by AI, and that's why it sucked.",
        "content": "Title says it all. To wait five years for a sequel to such an original story sucked as it is, but to then receive what we got as the final product was just a slap in the face to the audience. \n\nThe entire premise seemed like it was generated using AI along with the script. Everything was just so choppy and the movie felt like it had absolutely zero substance to it. \n\nI'd almost rather pretend we never got a sequel at all. ",
        "upvotes": 48,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1lv8tec/im_convinced_old_guard_2_story_was_created_and/"
    },
    {
        "id": "1lv80xo",
        "author": "greenhierogliphics",
        "title": "Animal kingdom no stopping",
        "content": "This series started kind of slow to me, but once it got rolling there’s just no stopping. I need to get to bed, but I NEED to see what’s going to happen next! On season 2 beginning episode 6. ",
        "upvotes": 21,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1lv80xo/animal_kingdom_no_stopping/"
    },
    {
        "id": "1lv6cgu",
        "author": "Comprehensive-Way482",
        "title": "'Monster' Season 4 in the Works at Netflix, Focused on Lizzie Borden",
        "content": "",
        "upvotes": 20,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lv6cgu/monster_season_4_in_the_works_at_netflix_focused/"
    },
    {
        "id": "1lv9q2w",
        "author": "tealbubblewrap24",
        "title": "New layout sucks. Is there any way to return to the old one?",
        "content": "My TV doesn't let me navigate easily to see literally ANYTHING anymore. I wanna scroll movies? Gotta scroll all the way to the top. TV shows? All the way to the top. My List? All the--you get it. It sucks. It's not user-friendly at all. It makes me want to unsubscribe. How can we roll back to the prior layout?",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lv9q2w/new_layout_sucks_is_there_any_way_to_return_to/"
    },
    {
        "id": "1lunkmp",
        "author": "refdeser",
        "title": "Trainwreck : The real Project X",
        "content": "Just finished watching it, crazy how something that started as a joke turned into a disaster overnight. I’ve never heard about this incident before, so if anyone from the Netherlands could share some insights, that’d be awesome. Did the documentary cover everything, or were some parts left out? Super curious to know more about what really happened.",
        "upvotes": 74,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1lunkmp/trainwreck_the_real_project_x/"
    },
    {
        "id": "1lvcqd4",
        "author": "kachigakachiguhhh",
        "title": "Is Sirens a comedy at all?",
        "content": "When it first came out it was labeled as comedy, then dark comedy, and now it’s categorized as drama.\n\nIt screams White Lotus copy + paste to me so far, midway through E2. \n\nI was looking for a light wind down show after a long day. Wondering if I should continue watching or find something else. (I just finished North of North and loved that) ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lvcqd4/is_sirens_a_comedy_at_all/"
    },
    {
        "id": "1lvch4q",
        "author": "S4v1r1enCh0r4k",
        "title": "We Finally Found Out Why the VIPs in ‘Squid Game’ Season 3 Were So Awkward",
        "content": "",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lvch4q/we_finally_found_out_why_the_vips_in_squid_game/"
    },
    {
        "id": "1lv79jx",
        "author": "Commercial-Paper822",
        "title": "Am I crazy? American apparel doc part 2",
        "content": "I could have SWORN when I watch the train wreck American apparel documentary it said part two coming today and now it's nowhere to be found and doesn't say that anymore ",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lv79jx/am_i_crazy_american_apparel_doc_part_2/"
    },
    {
        "id": "1lv5b8m",
        "author": "hellp-desk-trainee-",
        "title": "Netflix stutters slightly at end of a movie?",
        "content": "I was just wondering if Netflix stutters when anyone else is watching a movie on Netflix. It never fails that when we're about ten minutes from the end of the movie the app on our smart TV stutters for about three seconds or so before resuming normally. No other issues happen throughout the playback, and it is quite literally every movie. We use it as a gauge how long we have left on movies we haven't seen. ",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lv5b8m/netflix_stutters_slightly_at_end_of_a_movie/"
    },
    {
        "id": "1luwh8b",
        "author": "Unlucky-Film4604",
        "title": "They added coming soon, upcoming shows",
        "content": "Finally.  One of the things netflix deleted with the new UI was the menu for upcoming shows and movies. They have just added this on the home menu.  Hopefully they will add shows that are coming further up the line",
        "upvotes": 14,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1luwh8b/they_added_coming_soon_upcoming_shows/"
    },
    {
        "id": "1lv1acp",
        "author": "Prof_PW",
        "title": "Cancer Conflict, what do you think?",
        "content": "Wow, I probably picked the wrong night to start watching this series. Tomorrow, I will be living my episode one. \n\nTo explain, about three weeks ago, I got a bowel cancer screening test through the post. I followed instructions, which led to an appointment, and, as of writing, I am about 13 hours from the colonoscopy. \n\nI expect that the results will be a bit harsh, so as I mentioned, probably the wrong night to start this series 🤔\n\nBut regardless of the results tomorrow, I guess I will at least see how episode one ends 👍\n\nFor me, this is definitely a reality show where no one wants to be a star. But from what I have seen, it is very real.\n\n",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lv1acp/cancer_conflict_what_do_you_think/"
    },
    {
        "id": "1lv55e9",
        "author": "TeeRaw99",
        "title": "Help with a show?",
        "content": "Hi guys. I’m looking for a show I watched a few years backwhere the first few episodes people go missing in this remote forest area. They’re being kidnapped and their cars buried. The main guy goes to investigate and he himself gets kidnapped and car gets buried. At least I think it does coz that was the last episode i remember watching and his friends go looking for him in that remote forest area. Not sure if it was Netflix or a different service. Any help would be appreciated as I want to continue watching it. Thanks in advance :)",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lv55e9/help_with_a_show/"
    },
    {
        "id": "1lv8jjk",
        "author": "Flat-Lavishness3256",
        "title": "Cancellations",
        "content": "Hey, so I was rewatching Julie and the phantoms today and it just reminded me that so many good shows like this are always getting cancelled only to be replaced with shows that are mid or not even good at all. So, why do you think they cancel good shows?",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lv8jjk/cancellations/"
    },
    {
        "id": "1lu60pk",
        "author": "Fernsjjf",
        "title": "Alice in Borderland: Season 3 | Official Teaser | Netflix",
        "content": "Can't wait to watch. this will be the final chapter of the Alice of the Borderland series. We will finally get to know what is going happen and who is the mastermind behind this games.",
        "upvotes": 175,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1lu60pk/alice_in_borderland_season_3_official_teaser/"
    },
    {
        "id": "1luihld",
        "author": "Indoril-Nerevar337",
        "title": "Anime Is Booming on Netflix as Half of Users Now Watch It",
        "content": "",
        "upvotes": 26,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1luihld/anime_is_booming_on_netflix_as_half_of_users_now/"
    },
    {
        "id": "1lv5483",
        "author": "Fragrant_Peanut_9661",
        "title": "The Sandman S2",
        "content": "So I have but 2 things to say about S2 of The Sandman...\n\n1. WHY THE HELL DID THEY SPLIT IT INTO 2 SEPARATE PARTS???\n\n2. WHY AM I STILL BAWLING LIKE A FREAKIN BABY AFTER IT ENDED???\n\nDestruction was beautiful at the end. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lv5483/the_sandman_s2/"
    },
    {
        "id": "1lu55y7",
        "author": "Funny_Obligation2412",
        "title": "The old guard 2 sucked",
        "content": "Hi everyone,\n\nI was really excited to watch this. I liked the 1st one. I thought the idea was fun. Then the old guard 2 came along and I really thought it sucked big time.\n\nThis 2nd one seemed rushed with no good dialog and story line. The fight scenes looked cheap and slow. No explanation on what's going on. Uma's acting was bad.\n\n2 out of 10. Don't watch it.\n\n",
        "upvotes": 159,
        "comments": 57,
        "media": null,
        "permalink": "/r/netflix/comments/1lu55y7/the_old_guard_2_sucked/"
    },
    {
        "id": "1lv39h2",
        "author": "Proper_Fisherman_817",
        "title": "Can’t watch",
        "content": "It says I’m not connected to the same WiFi but I’m on my pc that has Ethernet cable to the same router. Why does it not work? We live under the same roof and this is the first time it has happened",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lv39h2/cant_watch/"
    },
    {
        "id": "1lv1zrt",
        "author": "L3lampman9",
        "title": "I hate the ai search",
        "content": "I usually am all for ai but this is not the case for Netflix ai search it just makes it take longer to find the show I want to watch as I have to type the full name of the show instead of just a keyword and then wait for it to register. I know this isn't a huge inconvenience but still I hate it.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lv1zrt/i_hate_the_ai_search/"
    },
    {
        "id": "1lvbfja",
        "author": "JHH-bruv-bruh",
        "title": "K-Pop Demon Hunters. My Criticism on IT AS A KOREAN",
        "content": "*Before BIASY! READ!!!: K-pop Demon Hunters* always draws criticism for its shallow representation of Korean culture, attempting to fuse traditional elements with flashy, Westernized aesthetics without meaningful context. Instead of honoring Korea’s deep-rooted spiritual and folkloric heritage, the series seems more interested in selling a stylized, exportable version of Korean mythology for global consumption. The depiction of demons, hanbok-inspired costumes, and rituals feels more like costume dressing than cultural storytelling—designed to be eye-catching for Western audiences rather than reflective of authentic beliefs or practices.\n\nMoreover, the project reflects a broader trend of cultural dilution, where traditional Korean identity is warped to fit a global pop template—particularly that of Western superhero or fantasy tropes. The characters behave more like Marvel protagonists than figures grounded in Korean mythos, and the narrative prioritizes action and glamour over introspection or spiritual depth. This risks reducing Korea’s rich cultural symbols to aesthetic commodities, stripped of their original meaning, and repackaged through a Western lens to fit mainstream expectations.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lvbfja/kpop_demon_hunters_my_criticism_on_it_as_a_korean/"
    },
    {
        "id": "1lv9c7u",
        "author": "Code_Rage",
        "title": "Netflix makes poor choices",
        "content": "Maybe it's just me. But theres nothing to ever watch on there. And some of the only good shows on Netflix. they end up cancelling. (E.g: the recruit, the residence) What other good shows have they cancelled and who do we petition too to get them back?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lv9c7u/netflix_makes_poor_choices/"
    },
    {
        "id": "1lul1tk",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix Unveils Chilling Teaser for Italy’s Most Disturbing Unsolved Serial Killer Case",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lul1tk/netflix_unveils_chilling_teaser_for_italys_most/"
    },
    {
        "id": "1lvb8dn",
        "author": "JHH-bruv-bruh",
        "title": "K-Pop Demon hunters is trash",
        "content": "Before bias, read: So basically, K-pop demon hunters is a movie about a group of three women that are passed down through generations to fight demons with music.  Also in IRL, Korean Shamanists from hundreds of years ago, were belived to scare away ghosts with musics(It's a fact, and I am Korean). The Shamanists did festivals or sang songs as a traditional ritual. These rituals existed for thousand of years. But in the movie, it shows as if there's only three of these shamans, AND THe K-POP Girls AREN't EVEN SINGING TRADITIONAL KOREAN SONGS. How IS THAT EVEN VALID??!?! The Movie is Just Breaking Korean TRadition and Morphing it into western culture. As a Korean, i am very distraught....",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lvb8dn/kpop_demon_hunters_is_trash/"
    },
    {
        "id": "1ltp7ox",
        "author": "Indoril-Nerevar337",
        "title": "Viewership Wasn't Enough: Netflix Has Canceled Two More Series After Just One Season",
        "content": "",
        "upvotes": 381,
        "comments": 168,
        "media": null,
        "permalink": "/r/netflix/comments/1ltp7ox/viewership_wasnt_enough_netflix_has_canceled_two/"
    },
    {
        "id": "1lut5rx",
        "author": "Popular-Soil-8748",
        "title": "why does my full screen keep flickeringg",
        "content": "i turned off graphics acceleration, i changed the cursor size and made it obnoxiously large and teal, and yet it is still glitching. ive tried basically every trick in the book and nothings worked at all. this didnt happen before and i havent tinkered with settings until now cuz im not a tech person so i have no idea whats going on ",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/51y3tqfagobf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1lut5rx/why_does_my_full_screen_keep_flickeringg/"
    },
    {
        "id": "1ltwfia",
        "author": "InformationSuperb597",
        "title": "Best/ most addictive shows to watch?",
        "content": "Hi! I’m struggling to find a new show to watch. I’m a 23 year old female, and some shows I have enjoyed are: Greys anatomy, the resident, The Pitt, Stranger things (was obsessed. OBSESSED.), Jane the Virgin, Never Have I ever, The Last of Us, Wednesday, Only Murders in the Building, etc. Any recommendations for me? I’m at a loss with finding a good show to watch. ",
        "upvotes": 109,
        "comments": 248,
        "media": null,
        "permalink": "/r/netflix/comments/1ltwfia/best_most_addictive_shows_to_watch/"
    },
    {
        "id": "1lusgbd",
        "author": "indiewire",
        "title": "Megan Stalter on ‘Too Much,’ Lena Dunham, and Playing Characters Who Are ‘Confident and Nervous at the Same Time’",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lusgbd/megan_stalter_on_too_much_lena_dunham_and_playing/"
    },
    {
        "id": "1lupazk",
        "author": "Educational-Tie2406",
        "title": "Help for a divorced friend",
        "content": "Hello all. Thanks in advance for your help. A good friend of mine recently got divorced. Her ex is a real POS. To keep this short his job affords him significant down time at the house so he set up all of their electronic world - all accounts, security codes, etc. When the divorce was final he didn’t share any of that information with her and she’s spent the last few months trying to take back one account at a time. \n\nShe’s onto Netflix now. She knows he’s still using the Netflix she pays for because after he moved our profiles showed up on her Netflix when that hadn’t been there before. She has no idea what the password is. Is there some solution to this?  This POS doesn’t deserve his free Netflix. I’d love to hear how angry the phone call is when he sits down to watch it and realizes he’s been kicked out of the account he created but doesn’t pay for. \n\nTL;DR: would like to know how to get someone off of a Netflix account when you don’t know the password. ",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1lupazk/help_for_a_divorced_friend/"
    },
    {
        "id": "1luroq0",
        "author": "S4v1r1enCh0r4k",
        "title": "Into the Wild: Netflix Drops Trailer for Chilling Murder Mystery ‘Untamed’ Set in Yosemite",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1luroq0/into_the_wild_netflix_drops_trailer_for_chilling/"
    },
    {
        "id": "1lulzg1",
        "author": "PiMama92",
        "title": "Tired of getting kicked out of my own household",
        "content": "Anybody really sick of the glitches with the household settings? I'm not home often and I usually watch on my phone  while my step daughter watches at home on her hotspot (we don't have home WiFi because we're not home enough to justify the added expense) and every single day it forces me to update the household. it's pushing me to cancel which sucks because I enjoy a lot of their exclusives, but the hassle just isn't worth it. ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lulzg1/tired_of_getting_kicked_out_of_my_own_household/"
    }
]