[
    {
        "id": "1pjfxod",
        "author": "scoreboard-app",
        "title": "Post Match Thread: Real Madrid vs Manchester City, UCL round whatever ",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1pjfxod)",
        "upvotes": 111,
        "comments": 1104,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pjfxod/post_match_thread_real_madrid_vs_manchester_city/"
    },
    {
        "id": "1ph9lu7",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 14,
        "comments": 3058,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ph9lu7/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1pjhipt",
        "author": "aprilhyped",
        "title": "🚨🤍Rodrygo reveals why he ran off to hug Xabi after his goal: \"I hugged Xabi because I know it's a tough time for him too, and I wanted to show that we support our coach.\"",
        "content": "Rodrygo also said: \"It's a difficult time for both us and our coach. We are with him. So many things are said that are lies.\"\n\nBig respect to Rodrygo for doing this, he seems to support Xabi even though he’s not getting the minutes. \n\nXabi needs time, and the players know it too. Stop blaming Xabi..",
        "upvotes": 851,
        "comments": 77,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wjnmwae2kg6g1.jpeg?auto=webp&amp;s=dc065ff7ae9cd84cb7e672b3e94ee260a0d441b4"
        },
        "permalink": "/r/realmadrid/comments/1pjhipt/rodrygo_reveals_why_he_ran_off_to_hug_xabi_after/"
    },
    {
        "id": "1pjg2rg",
        "author": "skincr",
        "title": "No good header? Here, right to your feet in a totally open space, nothing between you and the post. How could you fumble this?",
        "content": "",
        "upvotes": 717,
        "comments": 210,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vdusdpb79g6g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pjg2rg/no_good_header_here_right_to_your_feet_in_a/"
    },
    {
        "id": "1pjdmj5",
        "author": "No-Independent2522",
        "title": "Rodrygo opens the scoring 1-0 City",
        "content": "",
        "upvotes": 793,
        "comments": 63,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/723ah1igsf6g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pjdmj5/rodrygo_opens_the_scoring_10_city/"
    },
    {
        "id": "1pjbkbi",
        "author": "Low-Let-1147",
        "title": "It's ending tonight I can feel it 😤",
        "content": "",
        "upvotes": 648,
        "comments": 161,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qnup0hymef6g1.jpeg?auto=webp&amp;s=4a4919e3a52bdfd0fb516c72da6d02944e6cf7d7"
        },
        "permalink": "/r/realmadrid/comments/1pjbkbi/its_ending_tonight_i_can_feel_it/"
    },
    {
        "id": "1pjgfec",
        "author": "kazuya57",
        "title": "Mbappe haters when there's finally a big match without Mbappe but their favorites shit the bed anyway:",
        "content": "Mfers act like Mbappe pressing would suddenly solve Vinicius's finishing and Fede running around like a headless chicken",
        "upvotes": 272,
        "comments": 62,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/grdyj7exbg6g1.gif?format=png8&amp;s=4e566922ed06a5a9ee447ebf91654eddd39cb36d"
        },
        "permalink": "/r/realmadrid/comments/1pjgfec/mbappe_haters_when_theres_finally_a_big_match/"
    },
    {
        "id": "1pjg42l",
        "author": "KucoTheKing",
        "title": "Xabi Alonso deserved better tonight",
        "content": "I think we can all agree that Xabi Alonso coached a win today, considering all the chances and big mistakes in defence (Rudiger) and trying to stupidly chip 2m donnaruma ( jude, vini) costs us from winning and saving Xabi’s job. The only thing we can be mad is that Xabi let this Rodrygo sit on the bench for 7 months to play Brahim Diaz Mastantuono or even GG on right wing, when he had him all the time.  I genuinely don’t even feel angry anymore, with this win the morale of the team could have went up and to try to get la liga back, but now we are even more screwed.\nRodrygo, Carerras, Valverde did good job.",
        "upvotes": 230,
        "comments": 61,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pjg42l/xabi_alonso_deserved_better_tonight/"
    },
    {
        "id": "1pjgu01",
        "author": "cyrusmancub",
        "title": "Player reactions to the City defeat",
        "content": "All of Courtois, Asencio, and Rodrygo have come out in support of Xabi's continuation as coach.\n\nThibaut Courtois: \"We are FULLY with Coach Xabi. All of us.\"\nAsencio: \"The dressing room is fully with Xabi Alonso. We understand what he tells us, and we're with him.\"\n\nRodrygo: \"I hugged Xabi because I know it's a tough time for him too, and I wanted to show that we support our coach. We are 100% with our coach. We fully support Xabi.\"\n\nCourtois also admitted that the first goal was his fault, and both Asencio and Rodrygo said that they players need to perform better. \n\nAll in all, a united front after the defeat. Hoping it quiets any rumors of Xabi being sacked.",
        "upvotes": 132,
        "comments": 24,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pjgu01/player_reactions_to_the_city_defeat/"
    },
    {
        "id": "1pjgqm3",
        "author": "No-Independent2522",
        "title": "[SkySports] Xabi Alonso will NOT be sacked for now and will be given the match against Alaves, Real Madrid sources telling us.",
        "content": "",
        "upvotes": 125,
        "comments": 98,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pjgqm3/skysports_xabi_alonso_will_not_be_sacked_for_now/"
    },
    {
        "id": "1pjhc3j",
        "author": "Electrical_Cress_956",
        "title": "POV: You still believe in Xabi Alonso and this team",
        "content": "",
        "upvotes": 89,
        "comments": 17,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/qgoxh9vnig6g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pjhc3j/pov_you_still_believe_in_xabi_alonso_and_this_team/"
    },
    {
        "id": "1pjg54u",
        "author": "WorkingMastodon6147",
        "title": "Mbappe was never the problem, this situation would have risen even if we hadn't signed Mbappe.",
        "content": "\nTo all those who were saying Mbappe is responsible for the poor form of Vini and Bellingham. Watch the match again with your eyes open.\n\nI mean, convince me otherwise, but I genuinely think some of our players were playing to get Xabi Sacked, convince me otherwise.\n\nMbappe is literally the only world class consistent attacker we have. And I hope more of our fans will start appreciating Kroos and Modric even more. Courtois, saved us from yet another humiliation despite one blunder.\n\nMany of these players are avg or above avg, Kroos and Modric made them look world class, but the truth is these guys are barely above average, as soon as Valverde was asked to do more technical stuff, his form dropped.\n\nVini? Do I even need to explain, \"I'll do it 10 times if I have to.\" These were the words that he spoke after losing the Ballon d'or when the entire club backed him and now he is can't even bother taking constructive criticism for Xabi and demanding Ronaldo level contract when he is not even in the same universe. He is not even 1/4th of the player he was.\n\nVini and Bellingham literally missed two open chances, I don't even know what to say. Words haven't been invented to convey my anger rn.\n\nIf Mbappe played today in place of Vini, we would have won.",
        "upvotes": 95,
        "comments": 62,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pjg54u/mbappe_was_never_the_problem_this_situation_would/"
    },
    {
        "id": "1pjgks4",
        "author": "Available_Ad_6995",
        "title": "Xabi should not be sacked bc of this game.",
        "content": "I don’t think Xabi should be sacked. He’s style of play works, but the players aren’t executing. His fault is that he underutilizing the players, not using them in correct positions. No reason why a healthy Rodrygo should ever be on bench and Fran Garcia is playing on the wings. Endrick is on the bench?? The kid who scored almost copa del Rey game he played with limited minutes at that. Higher ups might be in his ear idk. \nAnyway he should at least see the season out. ",
        "upvotes": 81,
        "comments": 28,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pjgks4/xabi_should_not_be_sacked_bc_of_this_game/"
    },
    {
        "id": "1pjii93",
        "author": "AmbitiousAd3318",
        "title": "Carreras is more dangerous than Vinicius",
        "content": "This season vinicius is atrocius, bad passing, loss of speed, bad dribbling, bad overall decisions...\n\nEverytime carreras gets on the left wing he is way more dangerous and bold with the ball. Vinicius is equally bad with brazil NT too, even against Tunisia he couldn't make succeful a dribble (I watch the entire match).\n\nDoku tonight was 10 times better and he is mid...",
        "upvotes": 58,
        "comments": 16,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pjii93/carreras_is_more_dangerous_than_vinicius/"
    },
    {
        "id": "1pjgajb",
        "author": "AlekhineAl",
        "title": "I am shocked by the final third execution of Vinicius and Bellingham",
        "content": "2018/19 Vinicius had much better finishing than current Vinicius. HOLY COW! Vinicius feels like a blind man when he has to have the last touch on the action. Every angle , weight of the shot, angle of the shot, body turn is SO FAR OFF the mark that I feel like watching a Segunda Division player.\n\nAnd Bellingham’s passing was DIABOLICAL today. So many extra touches, turns and additional action in the final third where opponent manages to park the double decker in that time. Trying to be cute with the audacious Instagram worthy chip when the goal is wide open. My God! Is this how he will play in future ? The spark that a 10 requires isn’t present in his decision making or tactical ability. Weird hill for Xabi to die on.",
        "upvotes": 76,
        "comments": 103,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pjgajb/i_am_shocked_by_the_final_third_execution_of/"
    },
    {
        "id": "1pjb8h0",
        "author": "scoreboard-app",
        "title": "Match Thread: Real Madrid vs Manchester City Live Score | UEFA Champions League 25/26 | Dec 10, 2025",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1pjb8h0)",
        "upvotes": 136,
        "comments": 7695,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pjb8h0/match_thread_real_madrid_vs_manchester_city_live/"
    },
    {
        "id": "1pjapzw",
        "author": "cyrusmancub",
        "title": "Lineup v. City. Vini, GG, and Rodrygo up front.",
        "content": "",
        "upvotes": 136,
        "comments": 206,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pjapzw/lineup_v_city_vini_gg_and_rodrygo_up_front/"
    },
    {
        "id": "1pjgyva",
        "author": "Low-Let-1147",
        "title": "XABI ALONSO.I FEEL SAD FOR THE GUY",
        "content": "Today I saw tactics I can even say tactically we were superior but it was just the players character that let us down today and even at many instances.\n\nI know there's been a problem of big teams this season but in those matches also our players let the manager down it's just we ask questions from the manager\n\nPsg game so many mistakes at the back\n\nAtletico game so many mistakes at the back shaky defending\n\nLiverpool game no intensity in the attack\n\nToday again we missed straight forward chances\n\nBellingham's chip i don't even know what he was trying to do\n\nVini's pass to Rodrygo during that counter\n\nEndrick not laying off the simple pass to brahim\n\nAnd vini again trying to be Cristiano at Arda's corner when even a simple tapin would've worked\n\nThese are all our mistakes in the big games\n\nWhat you guys expect from the manager?? To score those chances or to bring intensity to the attack or to control the tempo of the match or to avoid mistakes while defending?? The problem isn't the manager it is the character of these players\n\nAnd then if the manager makes subs we hear the reports that the dressing room isn't happy\n\nI'M TELLING YOU GUYS CHANGING THE MANAGER ISN'T GONNA CHANGE ANYTHING IT'S JUST GONNA MAKE US LIKE MAN UNITED WE'LL KEEP CHANGING THE MANAGERS WITHOUT NOTICING THE MAIN PROBLEM AND IT'S THE CHARACTER OF THE PLAYERS EVERYONE IS JUST TRYING TO MAKE HEADLINES BY DOING SOMETHING EXTRA THOSE FANCY DRIBBLES, CHIPS, ACROBATICS AND ETC ETC.\n\n",
        "upvotes": 60,
        "comments": 28,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pjgyva/xabi_alonsoi_feel_sad_for_the_guy/"
    },
    {
        "id": "1pjgcfs",
        "author": "Quirky_Appearance539",
        "title": "I’m just waiting for folks to put defeat on Xabi somehow!",
        "content": "Like I don’t understand. Xavi Alonso coached a dominant win today. What’s he supposed to do if you can’t finish your chances? \n\nVinicius man it’s time to pack your bags &amp; leave. Guy’s offering nothing absolutely nothing from the wings. Not a single valuable contribution from him today. I’m so fed up man. Still some people are gonna come here &amp; defend this shit. How much does main character syndrome affect you? Just leave my club! \n\nBellingham. Please for the love of God stop this aura farming. Chance after chance you’re fluffing due your own shenanigans. Somehow you’re always trying to do solo runs instead of the basic job of a midfielder- passing! FFS you’re not Messi! \n\nRudiger. Please just retire. You’re finished. Last season was clear yet you were kept cause we couldn’t find another defender. You’re well past your best form. Please just leave. \n\nI’m gonna fight anyone who comes &amp; blames this defeat on Xavi. Had it not been for Courtois we would’ve been 4/5 down! Both teams were defensively so vulnerable yet we couldn’t take advantage. \n\nI’m just so pissed cause we played a freaking good game yet we’re getting nothing out of it due to these absolute awful individual performances! \n\nTHIS DEFEAT WAS NOT ON XABI! ",
        "upvotes": 60,
        "comments": 37,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pjgcfs/im_just_waiting_for_folks_to_put_defeat_on_xabi/"
    },
    {
        "id": "1pjig39",
        "author": "bezaalopez",
        "title": "At this point I think it’s common sense",
        "content": "After that game, I couldn't stop thinking about Endrick. He never gets a chance to play, and when he does, it's in the Champions League, losing to City with 10 minutes to go. He comes on and with his first touch, he hits the post with a header. It's obvious he's much more ready than Gonzalo, not saying Gonzalo is bad, but Endrick is ahead. And another thing, Endrick has that hunger for the game because he still wants to prove himself capable; he's not like the other stars who think they own the club.\nThe only thing I want is more minutes to him.",
        "upvotes": 44,
        "comments": 13,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/j8fd2hk7rg6g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pjig39/at_this_point_i_think_its_common_sense/"
    },
    {
        "id": "1pji2q6",
        "author": "Routine-Promotion520",
        "title": "POV: Champions League Heritage in one photo!",
        "content": "",
        "upvotes": 38,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/muvyvlr8og6g1.jpeg?auto=webp&amp;s=7b63a0cd3164a9709c20c00d59ae3ae2ac3d62ef"
        },
        "permalink": "/r/realmadrid/comments/1pji2q6/pov_champions_league_heritage_in_one_photo/"
    },
    {
        "id": "1pjgj33",
        "author": "No-Independent2522",
        "title": "[Opta] Real Madrid only had one shot on target in this match against Manchester City, their lowest tally in a Champions League match at the Bernabéu Stadium since at least 2003/04.",
        "content": "",
        "upvotes": 46,
        "comments": 35,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pjgj33/opta_real_madrid_only_had_one_shot_on_target_in/"
    },
    {
        "id": "1pjgq5o",
        "author": "KucoTheKing",
        "title": "Xabi and Vinicius Circus",
        "content": "\nMany people wonder why Vini played 90mins today? Xabi is scared to sub him off because of the circus he done when he was subbed off against barca, on press conferences media is still asking about that incident. And he went from it with no punishment or anything, there is too much freedom given to this players and it’s and will be very very big issue. If Xabi leaves some manager with balls should step in and show this players what discipline is.",
        "upvotes": 33,
        "comments": 23,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pjgq5o/xabi_and_vinicius_circus/"
    },
    {
        "id": "1pjay7h",
        "author": "hith4ish",
        "title": "Mna city starrting lineup today",
        "content": "",
        "upvotes": 59,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/18zwsjqlaf6g1.png?auto=webp&amp;s=a1934cd47177dc42595de1fd88afbd22610e1b30"
        },
        "permalink": "/r/realmadrid/comments/1pjay7h/mna_city_starrting_lineup_today/"
    },
    {
        "id": "1pjgp4y",
        "author": "hijazist",
        "title": "Xabi needs to implement his vision",
        "content": "Imho Xabi pulled a materclass today in tactics considering we’re playing Man City with this many injuries especially in the defense. Without Mbappe, Huijsen, Trent, Militao, and Camavinga we were able to press really good and that was reflected on the chances we created and control we had on the match. We’re playing a good Man City side yet we were head to head with them for most of the match despite our struggles on and off the field.\n\nTwo brain dead decisions from Rudiger and absolutely terrible finishing from Vini and Jude cost us the game.\n\nXavi needs to implement his vision with the players he wants. We’re building a team to be able to win more trophies, and we need to trust him with that. We didn’t bring him as a caretaker coach. \n\nWe pressed better today and that showed us results. Imagine if we pressed like this in recent games we played?? Why didn’t we? Apparently we can.\n\nSell the players that are rebelling against his tactics and replace them with ones passionate about this club. For now, move Mbappe to the left and try GG in the 9 spot and play Arda in his fav spot in the center.",
        "upvotes": 25,
        "comments": 24,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pjgp4y/xabi_needs_to_implement_his_vision/"
    },
    {
        "id": "1pj248b",
        "author": "cyrusmancub",
        "title": "Squid list vs. City. Mbappe makes the list.",
        "content": "",
        "upvotes": 113,
        "comments": 86,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pj248b/squid_list_vs_city_mbappe_makes_the_list/"
    },
    {
        "id": "1pjhcpz",
        "author": "Limp-Yesterday-5669",
        "title": "This sub needs to change",
        "content": "I swear this sub acts like they are in the dressing room. When has Vini expressed discomfort with xabi after the Barca incident, when has Jude e expressed discomfort with xabi, when has valverde expressed discomfort with xabi. Why is this stupid gossip coming from. All our players are frustrated, but they never openly criticized xabi. They all are going through tough time but they all are 100% with him in this. They pressed today, they pressed against Bilbao, they pressed Barca. They are with xabi in his ideas. Vini presses Bellingham presses. Only against low block teams they suffer and they take it easy which xabi needs to fix. People hear act like they know these players actions behind the scenes. They act like Vini stepped out and talking shit like salah on slot. These Vini fans and mbappe fans and arda stans need to leave this sub or shut up. Let xabi sort it out and give him some time instead of fanning the flames. ",
        "upvotes": 19,
        "comments": 31,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pjhcpz/this_sub_needs_to_change/"
    },
    {
        "id": "1pji1hf",
        "author": "SandwichSisters",
        "title": "Mbappe is holding Vini back",
        "content": "I hope we don’t hear this again at least for a week.\n\nRepeat 5 times after me: I won’t be suggesting stupid things over the next one week. I won’t be suggesting stupid things over the next one week. I won’t be suggesting stupid things over the next one week. I won’t be suggesting stupid things over the next one week. ",
        "upvotes": 17,
        "comments": 32,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pji1hf/mbappe_is_holding_vini_back/"
    },
    {
        "id": "1pjh7r9",
        "author": "Dirtysocks1",
        "title": "There is not quick solution to our problems",
        "content": "I’ve never seen Bernabeu this nervous before match and as the game went on the fans started to turn on players.\n\nXabi was pushing players forward all game long, but barely anyone paid attention.\n\nPlayers don’t help each other, don’t try to pass for the runs. A lot of walking. There is no leader on the pitch and no one to control tempo. Gonzalo barely touched ball as no one played to him.\n\nThe board saw last years problem as signed 3 defenders and TAA to play the balls. It’s better team than last year.\n\nI still think sacking Xabi won’t accomplish anything other than empower players, but at the same time, if they lost all respect, you can’t keep the coach as much as I like Xabi over some of the players. \n\nUltimately the fault is on board. There is no leader on the pitch, there is no tempo controller. You can’t really play without anyone in the box. Even Endrick almost scored a header…\n\nThe board bought all top young take talent and it didn’t work out. It happens, I can forgive that. The problem is how to get rid of some of the players. Who was last established player we sold? Casemiro 5 years ago? \n\nWe should build the team around Mbappe. Decide if wanna play Jude as a 10 and play 4-4-2 diamond and Mbappe as LW with a classic 9 or 4-3-3 and move Jude back. But how to you get rid of big contracts that run for next 3 years?\n\n",
        "upvotes": 16,
        "comments": 7,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pjh7r9/there_is_not_quick_solution_to_our_problems/"
    },
    {
        "id": "1piwkq4",
        "author": "FlyingWaterMen",
        "title": "[StatMuse] Most champions league G/A in the last 5 seasons.",
        "content": "",
        "upvotes": 262,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gz46xeugxb6g1.jpeg?auto=webp&amp;s=d1298ede630a4cedc3731fb0811b200d1fcaf404"
        },
        "permalink": "/r/realmadrid/comments/1piwkq4/statmuse_most_champions_league_ga_in_the_last_5/"
    }
]