[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 7,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 154,
        "comments": 562,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1n1t6ji",
        "author": "AztecTimber",
        "title": "I love foreign language shows and here are my favorites",
        "content": "Do you have any to add? I am particularly interested in German shows because I think it helps me speak it just a bit better. Plus I love the euro city settings. ",
        "upvotes": 32,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1n1t6ji/i_love_foreign_language_shows_and_here_are_my/"
    },
    {
        "id": "1n1krle",
        "author": "Glum_Reputation_9845",
        "title": "Rewatching The Social Dilemma and realizing it wasn’t even the half of it",
        "content": "When I first saw it, I thought it was shocking that apps manipulate us with notifications and algorithms. But the more I’ve learned since then, the scarier part isn’t just the manipulation and it's all about the data that's everywhere.  \n  \nYour phone number, your email, even your address history  all of it is floating around. The Social Dilemma scratched the surface because I feel it's much scarier real life. (that thing about what google knows about you is actually terrifying). I can’t help but think a real sequel would be less about screen addiction and more about how our entire identities are already being bought and sold in the background.  \n  \nHas anyone else felt that paranoia spike after realizing the real problem isn’t the apps on your phone, it’s the invisible network of companies that already own your information?",
        "upvotes": 53,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1n1krle/rewatching_the_social_dilemma_and_realizing_it/"
    },
    {
        "id": "1n10zec",
        "author": "AverageCowboyCentaur",
        "title": "Anyone else having trouble navigating Netflix?",
        "content": "some shows work and some shows don't even load the episode grid. It's like they play from the preview. The whole service just seems to be melting down and degrading. anybody else?",
        "upvotes": 989,
        "comments": 785,
        "media": null,
        "permalink": "/r/netflix/comments/1n10zec/anyone_else_having_trouble_navigating_netflix/"
    },
    {
        "id": "1n1to7o",
        "author": "PerformerAlert4654",
        "title": "Please help me find this Netflix series that was canceled",
        "content": "All I can remember is that there was three main characters and it was under the fantasy genre. It was two boys and a girl. One of the boys were black and is the main main character. I think their is magic involved and it was also a book series. It was canceled after only 1 season but i remember it being so good and wanting to read the book. I believe it had a rather long name as well?\n\nI am trying to remember more but I cant remember most of it.",
        "upvotes": 6,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1n1to7o/please_help_me_find_this_netflix_series_that_was/"
    },
    {
        "id": "1n1ek4n",
        "author": "AlittleupsetMax",
        "title": "How bad is Netflix new update",
        "content": "I am having problems with this service, besides the rate hikes and the inability to share, it seems like the actual service is having problems now.  The new home page isn’t very good.  After you browse for something, you have to go all the way to the top to search for what you were looking for.  Remember when they would pop a really anticipated movie on there?  Ahh the good ole days \n\nIs it still worth it?  I just finished Better Call Saul and I would say it was worth it for that show. Not too bad, it’s no Breaking Bad but what is?",
        "upvotes": 31,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1n1ek4n/how_bad_is_netflix_new_update/"
    },
    {
        "id": "1n0unz1",
        "author": "ToonAdventure",
        "title": "'KPop Demon Hunters' Is Netflix's Most-Watched Movie in History",
        "content": "",
        "upvotes": 592,
        "comments": 90,
        "media": null,
        "permalink": "/r/netflix/comments/1n0unz1/kpop_demon_hunters_is_netflixs_mostwatched_movie/"
    },
    {
        "id": "1n14day",
        "author": "TheGhostOfUncleBuck",
        "title": "Netflix is down 8/26 evening",
        "content": "Netflix say they are not experiencing any interruption. All is goo.\n\nNetflix also say they are experiencing a lot of inbound calls and chat support is longer than usual.\n\nHence, Netflix is DOWN.",
        "upvotes": 135,
        "comments": 68,
        "media": null,
        "permalink": "/r/netflix/comments/1n14day/netflix_is_down_826_evening/"
    },
    {
        "id": "1n1xg7h",
        "author": "ItsLix",
        "title": "I can't watch Netflix on my PC at all",
        "content": "I've been using Opera GX and noticed I couldn't play Netflix due to error code O7702-1290. I can load the website and profiles, browse shows and pick out an episode to watch. But after trying to load for a little bit, it gives me that error code and I am unable to find out why or how to fix it. Every other device I try it on works fine and I can watch there, just not my PC for whatever reason. It worked in the past, I checked my history and I was able to use it as recently as last month, but now it just doesn't.\n\n  \nI've tried clearing my cookies, cache, all of my browser settings and history, tried opening it on Chrome, Edge, and even downloaded and tried the Netflix app from the Microsoft store, tried a fresh install, enabling experimental flags to see if it was an html5 issue, changed my DNS, allowing DRM content to be played through my browser settings, updated, deleted, and re-updated my Widevine component, shutdown and restarted my PC multiple times. Nothing.\n\n\n\nAbsolutely nothing is working to get it to play on my PC and I cannot figure out why. I'm at my wit's end with it since I've been trying on and off to fix it for a week now, and every other search I come across either tells me how to fix Error Code 1003 instead of 1290, or even how to fix it for Linux or Vivaldi users. Can I get any help at all as to how this can be fixed or even a clue into the right direction?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n1xg7h/i_cant_watch_netflix_on_my_pc_at_all/"
    },
    {
        "id": "1n1prw1",
        "author": "Fiestabean",
        "title": "I need romance anime recommendations",
        "content": "Yeah you heard me I’m unapologetically addicted to Romance anime and need some recommendations doesn’t have to be solely romance either it can be a shonen type with romance too. \n\n \n",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n1prw1/i_need_romance_anime_recommendations/"
    },
    {
        "id": "1n12j61",
        "author": "ZoZleepy",
        "title": "Netflix Down (East Coast NY)",
        "content": "Anyone else having issues? \n\nApp isn't loading properly on Xbox or TV, glitching and shuddering\n\nThe new format looks like shit also, seems to be a whole mess\n",
        "upvotes": 119,
        "comments": 113,
        "media": null,
        "permalink": "/r/netflix/comments/1n12j61/netflix_down_east_coast_ny/"
    },
    {
        "id": "1n1v8la",
        "author": "Single-Mechanic-9323",
        "title": "scary movie recs?",
        "content": "hey! my friends and i are up in a cabin in the woods in the mountains and are in the mood to watch a good scary movie tonight with as many jump scares as possible. preferably nothing demonic or anything of that nature, but still as scary as possible so lemme know 🙏",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n1v8la/scary_movie_recs/"
    },
    {
        "id": "1n11yvx",
        "author": "Personal-Director734",
        "title": "My Netflix in the tv isn’t showing any of the options to play the show",
        "content": "It’s showing the titles and everything, but when I click on one it’s only playing the lil ad in the corner and the name of the show, not any of the ‘play’ ‘similar titles’ etc etc and idk what’s wrong with it.",
        "upvotes": 98,
        "comments": 61,
        "media": null,
        "permalink": "/r/netflix/comments/1n11yvx/my_netflix_in_the_tv_isnt_showing_any_of_the/"
    },
    {
        "id": "1n12y1z",
        "author": "condorre",
        "title": "Nothing to worry about, folks! (swipe)",
        "content": "",
        "upvotes": 82,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1n12y1z/nothing_to_worry_about_folks_swipe/"
    },
    {
        "id": "1n1w4cr",
        "author": "New-Camel-1365",
        "title": "The Gabby Petito Story Dramatization",
        "content": "I’ve heard of the Gabby Petito story many times, first via the news when her “disappearance” was being investigated and throughout the years via true crime youtubers that would cover her story. \n\nFrom what I know, the new Gabby Petito dramatization seems to be accurate to what was being reported on. It’s a bit jarring seeing in “real time” the tendencies of an abuser where when it’s good, it’s good but when it’s bad it’s bad. \n\nWhat are your guys’ opinions on this movie? Do you believe it to be generally accurate, was some things overdramatized, etc?\n\nAlso, RIP to Gabby. She really did seem like a sweet girl who believed in the best of others and I hate when abusers like Brian take advantage of that. I’ve been there and thank my stars I didn’t cross paths with someone like Brian.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n1w4cr/the_gabby_petito_story_dramatization/"
    },
    {
        "id": "1n0yvbo",
        "author": "Sudden_Pop_2279",
        "title": "Alice in Borderland: Season 3 | Main Trailer | Netflix",
        "content": "",
        "upvotes": 63,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1n0yvbo/alice_in_borderland_season_3_main_trailer_netflix/"
    },
    {
        "id": "1n1pj9x",
        "author": "Theycraveekelly",
        "title": "Recommendations",
        "content": "Hey, I know a lot of people post these so apologies in advance. \nThere’s a handful of shows that I’ve watch and liked so much that I binged everything and when it ended I felt like no other show could give me the feeling it gave me. Some of my favorites \nSupernatural\nGood girls\nDead to me\nThis is us\nParenthood\n\nI know these categories aren’t related and it’s kinda hard to find something related to these since they’re not really too similar. But these were all fun to watch and kept me hooked on it. \nI’ve tried watching 6 feet under but idk it’s not hitting the same",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1n1pj9x/recommendations/"
    },
    {
        "id": "1n1j5jm",
        "author": "Pntrdm",
        "title": "Just watched 2019 IO and so disappointed.",
        "content": "This is one of that kind of stories I'm keen on the most, but unfortunately left me disappointed. In the first 7 minutes it seemed so promised, but as it kept going it was clear they don't give a f\\*\\*k about the extinction of Earth when it comes to directing. 95% of this is about 2 human left on here are talking about unnecessary nonsense, making a love/emotion interest to each other tho it's not what it should have been told about but exploring the Earth, investigate for more possible survived human while they searching for more evidence which supports their research to date in the hope that there is a way to save the Earth. So sad it turned out otherwise. I gave it 3 stars on IMDB due to the concept only, but the execution is more than awful.\n\nLet me know if there's more movies like this so I can avoid it.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n1j5jm/just_watched_2019_io_and_so_disappointed/"
    },
    {
        "id": "1n1ow5v",
        "author": "Away_Preparation7749",
        "title": "Volume",
        "content": "Hi can anyone please help me ever since the new interferes of  Netflix. I can barely hear when watching a movie or TV show. And I have the volume way up. Is there anyway to fix this? Thank you very much ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n1ow5v/volume/"
    },
    {
        "id": "1n13sf1",
        "author": "LouisOKeefe",
        "title": "label overlaid over current video, pause not working, screensaver ads appear?",
        "content": "Today my Roku TV, while playing a show, has a permanent \"2025 Documentary 2 Seasons TV-MA Language,smoking\" overlaid on the left hand side (with a gradient alpha shading).  And, the pause function doesn't work.  And, occasional it takes over the screen to show floating Netflix Games icons.\n\nSeems like a software update gone badly wrong.",
        "upvotes": 18,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1n13sf1/label_overlaid_over_current_video_pause_not/"
    },
    {
        "id": "1n10kwi",
        "author": "tribeoftheliver",
        "title": "Sesame Street will premiere new episodes on November 10",
        "content": "",
        "upvotes": 26,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n10kwi/sesame_street_will_premiere_new_episodes_on/"
    },
    {
        "id": "1n14qd8",
        "author": "AccomplishedPut5175",
        "title": "Alice in Borderland Vs Squid Game!!",
        "content": "I just finished watching Alice in Bodeland and I can say that in my opinion it is better than Squad Game.\nOf course many of you will disagree with me, but I am interested in your opinion.\n\nGod bless you🍀",
        "upvotes": 8,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1n14qd8/alice_in_borderland_vs_squid_game/"
    },
    {
        "id": "1n1gaqs",
        "author": "Diligent-Crazy4476",
        "title": "netflix app still not working?",
        "content": "i’m in NC and my netflix app is still displaying the “There is a problem connecting to Netflix. Please try again later.” screen. Anybody know what’s up or how to fix it?",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1n1gaqs/netflix_app_still_not_working/"
    },
    {
        "id": "1n1e7th",
        "author": "Lucky-Mine-1404",
        "title": "netflix download",
        "content": "Why do Netflix downloads always expire after a few days? I want to watch at work, but they always expire. Making me want to cancel Netflix seems pretty greedy.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n1e7th/netflix_download/"
    },
    {
        "id": "1n13il6",
        "author": "grillmannn",
        "title": "Game ads during movies?",
        "content": "I have the middle tier Netflix plan. No ads.\nTonight I was watching a movie on Netflix and in the middle of the movie, a pop-up appeared advertising their games. I press the button and it went away but 10 minutes later it came back and just repeated several times. So what’s up with Netflix showing me ads for their games? Anyone else had this problem?",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1n13il6/game_ads_during_movies/"
    },
    {
        "id": "1n0owgu",
        "author": "Timely-Hovercraft-76",
        "title": "Is the new show “untamed “ any good?",
        "content": "Has anyone watched The Untamed on Netflix? The Yosemite backdrop looks gorgeous, and Eric Bana being in it makes me curious. Is it actually worth a watch?",
        "upvotes": 34,
        "comments": 162,
        "media": null,
        "permalink": "/r/netflix/comments/1n0owgu/is_the_new_show_untamed_any_good/"
    },
    {
        "id": "1n0y85p",
        "author": "GotGirls",
        "title": "Excited! Just had money to get Netflix! What to watch in horror, documentaries?",
        "content": "Watching Outer Banks! Great start what’s next? Love Mike Flanagan, horror (NOT The Substance like) docus, good old drama/romance, true crime! Throw it at me!! ",
        "upvotes": 10,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1n0y85p/excited_just_had_money_to_get_netflix_what_to/"
    },
    {
        "id": "1n0czgr",
        "author": "SoftPois0n",
        "title": "‘The Waterfront’ Canceled By Netflix After 1 Season",
        "content": "",
        "upvotes": 190,
        "comments": 142,
        "media": null,
        "permalink": "/r/netflix/comments/1n0czgr/the_waterfront_canceled_by_netflix_after_1_season/"
    },
    {
        "id": "1n0h6a6",
        "author": "Reico88",
        "title": "10 Favourite Animated Netflix Films",
        "content": "10. Entergalactic\n\n9. Vivo\n\n8. Chicken Run: Dawn of the Nugget\n\n7. Wendell &amp; Wild\n\n6. Nimona\n\n5. Orion and the Dark\n\n4. Pinocchio \n\n3. KPop Demon Hunter\n\n2. Klaus\n\n1. The Sea Beast ",
        "upvotes": 81,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1n0h6a6/10_favourite_animated_netflix_films/"
    },
    {
        "id": "1n14j0v",
        "author": "skyfall619",
        "title": "Jupiter legacy is actually good",
        "content": "Its very enjoyable. I dont know the comic so idk the difference. Pacing is a bit off I can tell but its a shame it wont be getting season 2. \n\nIt gives me that power ranger intentional cringe and im all for it. ",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n14j0v/jupiter_legacy_is_actually_good/"
    },
    {
        "id": "1n11txf",
        "author": "ToonAdventure",
        "title": "'KPop Demon Hunters:' Sony and Netflix in Sequel Talks",
        "content": "",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1n11txf/kpop_demon_hunters_sony_and_netflix_in_sequel/"
    }
]