[
    {
        "id": "1hqxs0r",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://t.me/+K_tQ4Zzi0S80YjFk): Gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[LA TAVERNA DELLO STUDENTE](https://t.me/latavernadellostudente/5207): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g30QJSClHjRAUvFBqKJa-Re4duFBniS6HkLBoJRdgOQ.jpg?auto=webp&amp;s=2c44cf9a902b77de7dce3b5cad542f22791fb32e"
        },
        "permalink": "/r/torino/comments/1hqxs0r/la_piola_friends_meetup/"
    },
    {
        "id": "1hqxs0j",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram group for apartment hunting: https://t.me/CaseStudentiTorino\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 2,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1hqxs0j/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1i4m4ha",
        "author": "LongjumpingBread5316",
        "title": "Ciao tutti ",
        "content": "I'm new to Turin and I don't know anyone In fact, it's easy to find a job, but it's hard to find friends. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1i4m4ha/ciao_tutti/"
    },
    {
        "id": "1i49nem",
        "author": "Important_Still5639",
        "title": "Is borgo filadelfia a safe place to stay for an Erasmus Semester or should I look for appartments in other districts of turin? I have only heard bad stuff about barriera di Milano/falchera/vallette/Aurora",
        "content": "",
        "upvotes": 11,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/bys4b6mjqrde1.png?auto=webp&amp;s=ad0047ab7b6de294d137ab5eb8eacd3767aaab49"
        },
        "permalink": "/r/torino/comments/1i49nem/is_borgo_filadelfia_a_safe_place_to_stay_for_an/"
    },
    {
        "id": "1i48k6o",
        "author": "Equivalent-Cable-846",
        "title": "Sciare senza auto",
        "content": "Io e la mia ragazza vorremmo provare due giorni nel complesso sciistico della Via Lattea.\n\n Siamo due principianti assoluti quindi non avremmo problemi nel caso le piste più difficili fossero chiuse. \n\nL'unico problema è che ci vorremmo spostare tramite mezzi pubblici e non sono sicuro di quali siano i migliori posti dove alloggiare per raggiungere le piste. Per esempio ho notato Sestrière come meta gettonata ma non sono sicuro se renda più accessibili le piste o meno.\nVorremmo fare almeno un giorno con un istruttore e avevo visto la maggior parte si trovavano lì a Sestriere ma non so se effettivamente convenga, quindi accetto qualsiasi consiglio. \n\nGrazie mille in anticipo",
        "upvotes": 5,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1i48k6o/sciare_senza_auto/"
    },
    {
        "id": "1i4inxv",
        "author": "Interesting_Cry1672",
        "title": "Motociclisti di montagna",
        "content": "Ciao! (31M) volevo sapere se qualcuno conoscesse qualche gruppo o luogo (online e non) in cui conoscere altri motociclisti con la passione dei viaggi in montagna, a Torino o in provincia. Ho cominciato a guidare la moto l’anno scorso, ho viaggiato un po’ soprattutto dalle parti della val pellice e val chisone, per ora mi son spinto fino al Colle delle Finestre e Vandalino come mete più “complicate”.\n\nPurtroppo della mia cerchia di amici, parenti e conoscenti sono l’unico a guidare la moto, e mi piacerebbe provare mete più impegnative ma mi rendo conto del pericolo di andare da solo, mi sentirei più tranquillo - soprattutto essendo neopatentato - a viaggiare insieme a un gruppo di altri motociclisti possibilmente.\n\nGuido una Kawasaki KLX250.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1i4inxv/motociclisti_di_montagna/"
    },
    {
        "id": "1i4c0o7",
        "author": "bec0m1ng",
        "title": "Acid Arab stasera 18/01 Notorius",
        "content": "Ciao, qualcuno vende un biglietto per Acid Arab stasera a un prezzo decente (max 30 euro)? Non sarò a Torino prima di mezzanotte e non riuscirò a prendere un biglietto alla porta.\nGrazie ☺️ ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1i4c0o7/acid_arab_stasera_1801_notorius/"
    },
    {
        "id": "1i4ag4o",
        "author": "ciotinho",
        "title": "Torino Filadelfia/Lingotto negozi/tabacchi con cui posso ricevere pacchi",
        "content": "Salve, lavoro dal lunedì fino al sabato e arrivando a casa la sera verso le 20 faccio fatica a essere presente al momento dell’arrivo del corriere, onde per cui avrei bisogno di un negozio/posto che ritiri a nome mio il pacco che farò spedire da giù. Voi vi affidate a qualcuno zona filadelfia/lingotto per il ricevimento di pacchi? Se sì chi? Grazie",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1i4ag4o/torino_filadelfialingotto_negozitabacchi_con_cui/"
    },
    {
        "id": "1i44ryw",
        "author": "man-teiv",
        "title": "dove trovare marmite? ",
        "content": "mi serve del marmite per delle ricette ma non riesco A trovarlo in giro per Torino. su Amazon costa 13€ al barattolo che no grazie.\n\nqualcun* ha avuto fortuna? anche del vegemite penso vada bene lo stesso, o non so se esistano equivalenti italiani ",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1i44ryw/dove_trovare_marmite/"
    },
    {
        "id": "1i3gbhg",
        "author": "Prestigious_Use9038",
        "title": "Band emergenti punkrock/metal?",
        "content": "Ciao ragazzi, sono diversi mesi che sto scoprendo nuove band punk/poppunk/punkrock/metalcore di Torino, avete qualche nome da farmi? Questo sottobosco musicale che sto scoprendo mi piace sempre di più :D",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1i3gbhg/band_emergenti_punkrockmetal/"
    },
    {
        "id": "1i31ej4",
        "author": "BrutalSock",
        "title": "Questo è “Io sono leggenda”",
        "content": "9:47, il protagonista sta guardando il telegiornale e per qualche motivo i giornalisti, sullo sfondo, hanno Piazza San Carlo. ",
        "upvotes": 63,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3rwz07oxnfde1.jpeg?auto=webp&amp;s=238dd7283009f47bbac23dd3d093fd2351ee4fe9"
        },
        "permalink": "/r/torino/comments/1i31ej4/questo_è_io_sono_leggenda/"
    },
    {
        "id": "1i3c7fl",
        "author": "selalleroo",
        "title": "Partitelle di pallavolo ",
        "content": "A breve conto di trasferirmi a Torino , e mi farebbe piacere ricominciare a fare qualche partita di pallavolo. Al momento sono troppo arrugginita per pensare di entrare in una vera squadra in campionato. L'idea sarebbe quella di trovare una squadretta in amicizia per fare qualche partita con l'obiettivo di divertirsi (tipo \"il calcetto della domenica\"). F27, ho un livello da terza divisione ormai. Esiste già qualche bella compagnia (anche mista eh, non per forza solo al femminile) che fa questa cosa? Grazie ciaooooo ",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1i3c7fl/partitelle_di_pallavolo/"
    },
    {
        "id": "1i3lfzc",
        "author": "Advanced_Air9286",
        "title": "Consiglio locale zona santa Rita, stadio olipico",
        "content": "Ciao ragazzi, qualcuno conosce un bel locale per bere zona santa Rita stadio olimpico? La di corso agnelli. Per serata con 6 persone di target 30 anni",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1i3lfzc/consiglio_locale_zona_santa_rita_stadio_olipico/"
    },
    {
        "id": "1i3kx3a",
        "author": "idontknowausernamer",
        "title": "Ricostruzione unghie a Torino",
        "content": "Ciao a tutti, vorrei iniziare a fare la ricostruzione alle unghie, anche da privati, l'importante è che non costino un rene. Consigli?\n\nvanno bene anche posti nei dintorni di Torino. Grazie a chiunque risponderà.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1i3kx3a/ricostruzione_unghie_a_torino/"
    },
    {
        "id": "1i398ec",
        "author": "_Luigino",
        "title": "L'Italia in cartolina – Torino",
        "content": "",
        "upvotes": 8,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HX4PpolbWaNqAjGbBBXRlUuEnPE_rI1q3k-pOwVyJfU.jpg?auto=webp&amp;s=25de4b15bf3c91a4c471c3795f921097ce9fb4f5"
        },
        "permalink": "/r/torino/comments/1i398ec/litalia_in_cartolina_torino/"
    },
    {
        "id": "1i3iogv",
        "author": "AfroJn",
        "title": "Domanda per i locali",
        "content": "Ciao gente di Torino! Presto mi trasferirò a Torino e ho trovato un bel appartamento al confine tra Lingotto e Mirafiori Nord. Ho letto alcune opinioni negative su queste zone su internet e mi chiedevo cosa ne pensano i locali. Sarebbe sicuro per una donna, sia di giorno che di notte?",
        "upvotes": 1,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1i3iogv/domanda_per_i_locali/"
    },
    {
        "id": "1i3mowd",
        "author": "ApprehensiveStar2568",
        "title": "Acqua dentro a ciabatta ",
        "content": "Buonasera, prima di uscire di casa ho inavvertitamente fatto cadere dell'acqua dentro a una ciabatta e ho proprio visto l'acqua entrare all'interno delle spine di questa ciabatta. La quantità caduta non è tantissima ma nemmeno definibile come \"schizzi\", all'incirca un fondo di bicchiere per intenderci. A questa ciabatta (che per di più è molto vecchia quindi non so quanto sia affidabile come sistemi di sicurezza) è collegato un caricatore di un telefono. Purtroppo ero molto di fretta e l'unica cosa che ho fatto è spostare la ciabatta dal comodino, dove era appoggiata, al pavimento. Dall'altra parte del letto ho un'altra ciabatta collegata a una presa a parete che però, ahimè, prende l'elettricità dalla presa a cui è attaccata l'altra ciabatta (con delle canaline da cui passano i cavi). Purtroppo io sarò assente da casa mia per due notti e ho spiegato tutto l'accaduto alla mia ragazza. Volevo sapere se per voi fosse comunque sicuro utilizzare un caricatore che è già attaccato alla seconda ciabatta (dunque non a quella incriminata) per caricare il telefono. Quando è successo il fatto non è saltata la corrente e specifico inoltre che hanno cambiato il contatore giusto un paio di giorni fa. Grazie a tutti in anticipo per la disponibilità.",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1i3mowd/acqua_dentro_a_ciabatta/"
    },
    {
        "id": "1i31sb8",
        "author": "BlueLights420",
        "title": "Parrucchiere per colorare i capelli",
        "content": "Salve gente, conoscete per caso un buon parrucchiere qui a Torino che se la cavi bene nel fare i capelli colorati e che offra possibilmente un prezzo non altissimo?\nGrazie a tutti 😉",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1i31sb8/parrucchiere_per_colorare_i_capelli/"
    },
    {
        "id": "1i39nv7",
        "author": "Jhon_Titorto",
        "title": "Soddisfazione reciproche",
        "content": "PARCHEGGIO TORINO (M35 Bisex) : paecheggi, abbassi il sedile mettendoti comodo e ti... ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1i39nv7/soddisfazione_reciproche/"
    },
    {
        "id": "1i2xq6q",
        "author": "barbax-7",
        "title": "Qual è il food delivery più usato?",
        "content": "Mi metto sempre a confrontare i vari servizi di food delivery perché mi è capitato in passato di trovare prezzi più alti in uno, ma andando a risparmiare alla fine poiché commissioni più basse.\n\nPerò ho come la sensazione che, per esempio, Just Eat sia il meno usato perché ha un sacco di posti che non ho mai sentito, e in generale hanno veramente poche recensioni.\n\nQual è invece l'opinione di voi altri che vivete Torino? Qual è il food delivery più usato dai locali, e quale preferite usare voi e perché?\n\n[View Poll](https://www.reddit.com/poll/1i2xq6q)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1i2xq6q/qual_è_il_food_delivery_più_usato/"
    },
    {
        "id": "1i2uuxk",
        "author": "WestSuspicious115",
        "title": "Torinese",
        "content": "Ciao,\n\nI'd like to know if there are any other forums that people residing in turin talk, have Q/As like this sub reddit.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1i2uuxk/torinese/"
    },
    {
        "id": "1i2m3y5",
        "author": "_lostinthisworld_",
        "title": "La bolletta della luce ",
        "content": "Ciao a tutti, ho una domanda riguardo la bolletta della luce Simecom. Ho pagato la bolletta in posta 3 giorni fa, tuttavia nell'app ancora non risulta come pagata e domani scade il termine per il pagamento. Questo mi creerà dei problemi? Grazie per l'aiuto \n\n\n\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1i2m3y5/la_bolletta_della_luce/"
    },
    {
        "id": "1i21i9r",
        "author": "xclajre",
        "title": "dogsitter",
        "content": "ciao! vorrei provare a fare da dogsitter per avere una piccola entrata, avete esperienza/consigli in merito?\n\nTempo fa mi ero iscritta all'app Rover ma non avevo trovato nessuno padrone interessato, forse la mia zona non è tra le più richieste (San Donato), conoscete altre app o servizi che possano mettermi in contatto diretto con i padroni? Grazie!",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1i21i9r/dogsitter/"
    },
    {
        "id": "1i1udoo",
        "author": "giokim77",
        "title": "Serata stand up stasera, vuoi venire?",
        "content": "Ciao,\nVado al camala (o comala) per una serata stand up ad offerta libera. Forse vado anche all aperitivo prima (31M). \n\nSe vuoi unirti, donna uomo o marsupiale, scrivimi :)",
        "upvotes": 8,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1i1udoo/serata_stand_up_stasera_vuoi_venire/"
    },
    {
        "id": "1i1vdns",
        "author": "doc_santini",
        "title": "looking for a real estate agent ",
        "content": "I just moved to Torino in June. Looking for someone to show me some places to rent or buy. If you are an agent or have had a good experience with a agency send me a dm!\n\nTIA",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1i1vdns/looking_for_a_real_estate_agent/"
    },
    {
        "id": "1i1cci1",
        "author": "DueToRetire",
        "title": "Esistono delle città ben collegate a Torino, con una buona qualità dell’aria/poco inquinamento?",
        "content": "",
        "upvotes": 14,
        "comments": 53,
        "media": null,
        "permalink": "/r/torino/comments/1i1cci1/esistono_delle_città_ben_collegate_a_torino_con/"
    },
    {
        "id": "1i193vk",
        "author": "A-non-776",
        "title": "ADHD a Torino",
        "content": "Salve a tutti, so che è una richiesta un po' bizzarra e difficile da formulare, ma ci provo: qualcuno ha esperienza con o è a conoscenza di posti a Torino in cui recarsi per consulti psicologici in merito a possibilità di ADHD o autismo? Se uno cercasse una possibile diagnosi, in età adulta, per disturbi di questo tipo, dove potrebbe andare?\n\nCapisco che tendenzialmente serva un più o meno lungo percorso con psicologo, di vari mesi e varie sedute magari, e non si possa risolvere con un test a crocette, ma non ho questa possibilità, e per quanto difficile cercherei un posto molto più \"diretto\"\nNon ho un lavoro con cui pagare una possibile terapia, ma sento di aver difficoltà nel trovare un lavoro anche proprio per questi motivi, quindi cerco la \"strada più breve e diretta\" anche per questo motivo; se avessi poi verificato questo mio dubbio, magari allora potrei cominciare un percorso, ma mi serve sapere prima che non sto perdendo tempo, ecco\n\nPer questo mi rivolgo a chi magari ha una sua esperienza diretta in merito e può darmi indicazioni che altrimenti non avrei mai saputo, spero che tutto sia abbastanza chiaro e ringrazio già chi mi darà attenzione, saluti ~",
        "upvotes": 15,
        "comments": 30,
        "media": null,
        "permalink": "/r/torino/comments/1i193vk/adhd_a_torino/"
    },
    {
        "id": "1i1abjr",
        "author": "Babele_20",
        "title": "Medico per fuori sede",
        "content": "Ciao a tutti, ho bisogno di una mano in quanto non riesco a capirci nulla…\nIo sono una fuori sede qua a Torino, vengo da Milano e avrei bisogno di aver un medico qua. Non ho residenza a Torino ma sono comunque domiciliata qua. Qualcuno che ha fatto richiesta di un medico di base sa cosa bisogna fare con precisione? Sul sito ci sono delle indicazioni ma sono un po’ confuse.\n\nGrazie per le risposte",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1i1abjr/medico_per_fuori_sede/"
    },
    {
        "id": "1i1bxeu",
        "author": "SkeletonWink",
        "title": "Consiglio su bici da prendere a Torino",
        "content": "Buonasera,\n\nSono un ragazzo M26 di Torino, e sono stufo di utilizzare i mezzi per andare a lavoro.  \nNon so se aiuta, ma corporatura media e alto 1.78.\n\nHo una tratta giornaliera di circa 3.5km, di solito porto con me zaino con all'interno pc del lavoro e una schiscetta a parte.  \nLa tratta è molto tranquilla e piana, esclusivamente in città.\n\nVorrei prendere una bici usata, budget sui 100 euro massimi, anche se trovarle a meno mi farebbe piacere.  \nNon saprei effettivamente cosa cercare oltre alla dicitura \"city bike\", e dove.\n\nGrazie in anticipo :)",
        "upvotes": 3,
        "comments": 28,
        "media": null,
        "permalink": "/r/torino/comments/1i1bxeu/consiglio_su_bici_da_prendere_a_torino/"
    },
    {
        "id": "1i1aj2g",
        "author": "Top-Text-7727",
        "title": "Videogiochi usati a Torino ",
        "content": "Salve. Dove abitavo prima c'erano un po' di negozi non brandizzati tipo Gamestop che vendevano videogiochi sia nuovi che usati a buon mercato. Potevi trovare giochi di recente uscita anche a 10 euro di meno al prezzo che trovavi nei negozi delle catene. A Torino ce ne sono? Io abito in Aurora.",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1i1aj2g/videogiochi_usati_a_torino/"
    },
    {
        "id": "1i1c5a2",
        "author": "Informal-Flower-527",
        "title": "Cena di compleanno/altro?",
        "content": "Ciao a tutti! Tra poco farò 25 anni e vorrei festeggiare con i miei amici facendo una cena da qualche parte! Qualcuno ha qualche consiglio su un ristorante che non sia la solita pizzeria in cui c’è un bel ambiente e si mangia bene? Mi andrebbe bene una cucina di qualsiasi tipo dalla asiatica alla messicana! O magari un posto in cui mettono musica? \nEventualmente che si potrebbe fare se non una cena? Attività? Escludiamo andare a ballare perché secondo me è troppo dispersivo \nGrazie 😊 \n\n",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1i1c5a2/cena_di_compleannoaltro/"
    },
    {
        "id": "1i1827e",
        "author": "Thecrazypacifist",
        "title": "Quale partita di Juventus dovrei vedere? ",
        "content": "Ho sempre sognato di vedere una partita di calcio allo stadio, ma non essendo un grande fan della Serie A, non so bene quale scegliere. Quale partita ha l’atmosfera più bella secondo te? Per fare un paragone NBA, direi una Lakers contro Celtics. Meglio una partita di Serie A o una di Champions League? Qual è il tuo match preferito?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1i1827e/quale_partita_di_juventus_dovrei_vedere/"
    }
]