[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 51,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 17,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1rdcfs5",
        "author": "Top-Oil6722",
        "title": "Why are all the shows made for 20 year olds? I mean, as the older bill payer of the house, I can't find anything new to watch.",
        "content": "Just saying... Every new series is... absolutely rubbish... Wouldn't hurt to try and appeal to demographics of all ages. \n\nPlease don't suggest K Pop demon Hunters to me...",
        "upvotes": 104,
        "comments": 174,
        "media": null,
        "permalink": "/r/netflix/comments/1rdcfs5/why_are_all_the_shows_made_for_20_year_olds_i/"
    },
    {
        "id": "1rd8svi",
        "author": "Prudent-Scar-9656",
        "title": "Netflix: Please do a documentary on 90s/00s Howard Stern next",
        "content": "I watched the ANTM documentary and have seen all the outrage from people who are shocked by the antics of Tyra and the 00's ANTM show. Yes, it was trashy, misogynistic reality tv, exploiting naive young women by forcing them into humiliating situations or into having emotional reactions. But you know who was the absolute king of exploiting women in the 90s/00s, and who has never had a documentary made about him, or had his disgusting reality radio/tv shows exposed to the younger generation? Howard Stern. Anyone who was alive back then knows exactly what I'm talking about. I don't even want to describe the misogynistic filth that man did to young women on his shows. If Tyra Banks is going to be raked over the coals for her middling at best reality tv show, which actually wasn't even the worst of the lot, then someone really needs to take a hard look at the biggest offender of them all: HS.  This man should have been called to account YEARS ago. Netflix, please make this your next documentary.",
        "upvotes": 199,
        "comments": 57,
        "media": null,
        "permalink": "/r/netflix/comments/1rd8svi/netflix_please_do_a_documentary_on_90s00s_howard/"
    },
    {
        "id": "1rdaimf",
        "author": "Helpful_Peanut_860",
        "title": "Tyra and ATM",
        "content": "Did Tyra think this docuseries was some sort of soft attempt to make everything okay and cover up whatever bad image she has now after ATM? But have no idea that all the people around her were actually throwing her under the bus one by one? I watched the show in the first few seasons (never really into it) and had zero idea the awful things this show had turned into. But this docuseries made me legit dislike her immensely. She is smug and fake and just completely full of bullsh\\*t. And while she thought she was redeeming herself, all people around her just outed her for who she truly is. And I really love that for all of them to get the truth out. ",
        "upvotes": 28,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1rdaimf/tyra_and_atm/"
    },
    {
        "id": "1rd6jj9",
        "author": "Leo_23-O",
        "title": "Does anyone else actually miss the \"Surprise Me\" button?",
        "content": "I was thinking about how Netflix killed the \"Play Something\" button a while ago because \"nobody used it.\" Honestly, at the time I didn't care, but now that the library feels so oversaturated, I kind of miss having a \"random\" option.\nThe current algorithm just keeps pushing the same 5 shows into every category, and I spend more time scrolling than actually watching anything. It feels like the discovery process is totally broken now.\nSince that button is gone, what are you guys using to break the loop? Do you use any external sites or just keep scrolling until your food gets cold? I’m so tired of this that I’m actually considering making my own tool to filter the catalog properly.",
        "upvotes": 24,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1rd6jj9/does_anyone_else_actually_miss_the_surprise_me/"
    },
    {
        "id": "1rcrmc8",
        "author": "lingeringneutrophil",
        "title": "Gordon Ramsey documentary: an overly long advertisement",
        "content": "In general, I like Gordon and have eaten at two of his restaurants in London. The food was very good. He can cook, he is a competent chef no doubt.\n\nHe is also a brand rather than a chef these days, and he works with media very well.\n\nThis whole documentary could have been half its length very easily. A lot of it felt very repetitive.\n\nYes, there are always some growing pains when opening a new restaurant. Yes, the food looks fabulous and influencers are gonna love it. Is it sustainable? Is it nutritious?! What about the overall environmental impact of serving this kind of food during the winter in London. Nobody asks these questions that matter more and more.\n\nWhat honestly bothered me was his empty-eyed wife having so much space where she didn’t really say anything too interesting. If you cut her bits out nothing of substance would be missing.\n\nHe brings up the wedding of his daughter so many times yet it is not a part of this documentary so we don’t even get to see the dress, flowers or food. Just an engagement party that feels a bit forced as the cameras are there.\n\nIt is an ad for his new restaurant in London, and the bits about him being a family man felt incredibly disingenuous and staged. He does a lot of cuddling with the kids but very little parenting. He doesn’t even cook for them in the show.\n\nHe says he loves his kids so much yet is gone easily six weeks at a time. His whole arrival in a helicopter to their country house in Cornwall was just silly and wasteful. He honestly comes across an absent father no matter the editing.\n\nHim talking about fitness? Bro I was a volunteer at London Marathon in 2009 and you didn’t even make it past 10 km. I was waiting to snap your photo yet you never made it to my mark (mile 15). Like give me a break. You travel, take photos with fans, shake hands, make TV shows, you have zero time for fitness or your kids so you’re in no position to lecture anyone about buying iPads for their kids.\n\nOverall, there was very little food shown, too much disingenuous family moments that weren’t even interesting, too much talking by his wife saying absotely nothing, and all those emotional reveals were spoken about many times before.\n\nA total meh for me",
        "upvotes": 96,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1rcrmc8/gordon_ramsey_documentary_an_overly_long/"
    },
    {
        "id": "1rdec62",
        "author": "RolyPolyOnSidewalk1",
        "title": "How to get Netflix to stop asking if I’m still watching?",
        "content": "On the Apple TV (streaming device), how do I get Netflix to stop asking if I’m still watching? I think it ask like every 30 minute. I think they changed the settings so, I can’t figure it out on the app. I tried to by logging in on my account on a search engine but, no luck finding those settings. Is there a way to change this? Thanks",
        "upvotes": 6,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1rdec62/how_to_get_netflix_to_stop_asking_if_im_still/"
    },
    {
        "id": "1rcjq44",
        "author": "Competitive_Gene_898",
        "title": "‘Wednesday’ Season 3 Welcomes Winona Ryder to the Cast",
        "content": "",
        "upvotes": 166,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1rcjq44/wednesday_season_3_welcomes_winona_ryder_to_the/"
    },
    {
        "id": "1rdlxbk",
        "author": "picklepaapad",
        "title": "Shows that won't overstimulate an adult.",
        "content": "I need suggestions for some series that are slow and calming yet interesting and easy to watch. And most importantly won't overstimulate my stressed brain. Thankyou.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rdlxbk/shows_that_wont_overstimulate_an_adult/"
    },
    {
        "id": "1rdk3dl",
        "author": "NoraMason1986",
        "title": "Question about 11.22.63 and Sadie",
        "content": "SPOILERS BELOW\n\nI just finished watching 11.22.63 and enjoyed it.   I have not read the book so my basis is the Hulu series only.   I have watched videos about the differences between the book and series, however.  \n\nTime travel always raises interesting scenarios and questions.  \n\nSomething that crossed my mind relates to Jake’s plan to take Sadie to the future with him after he saves JFK.  \n\nSince Sadie is from that time period, wouldn’t she return to the future as the old woman we see at the end of the series?   \n\nThe premise is that the time traveler loses two minutes when they return.   \n\nThoughts? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rdk3dl/question_about_112263_and_sadie/"
    },
    {
        "id": "1rd7rq0",
        "author": "Appropriate_Gur7902",
        "title": "Discussion: Can we please talk about Japanese dating show The Boyfriend!",
        "content": "Ughh I love this show much and a lot of the Japanese dating shows. The contrast between American and Japanese dating shows specifically The Boyfriend is so stark. Even when comparing it to The Ultimatum: Queer Love which is way better than a lot of other American hetero dating shows. The Boyfriend is so sweet and understated. This is one of the few reality dating shows that exists that is devoid of unethical and exploitative producers stringing together narratives and creating storylines to stir drama and boost ratings. It's also so raw and real in a way that can make some people maybe feel uncomfortable. There is a lot of silence and pauses in the episodes something that I think more closely mirrors reality than most of \"reality tv.\" Everyone is sohonest on the show in a way that makes you \"awww\" instead of cringe!",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rd7rq0/discussion_can_we_please_talk_about_japanese/"
    },
    {
        "id": "1rcmiyx",
        "author": "amarainn",
        "title": "What is your favorite show or movie that isn't in English?",
        "content": "I love that Netflix has so much content that isn't in English, but I get the feeling I don't see all the options that are available when it comes to non-English language content, so I would love to know some of your favorite recommendations!",
        "upvotes": 34,
        "comments": 199,
        "media": null,
        "permalink": "/r/netflix/comments/1rcmiyx/what_is_your_favorite_show_or_movie_that_isnt_in/"
    },
    {
        "id": "1rd9fq8",
        "author": "goxper",
        "title": "Just watched The Pale Blue Eye, worth the watch?",
        "content": "I spent my weekend watching The Pale Blue Eye on Netflix, and I have to say, I was hooked! The whole vibe of the movie with its dark, mysterious atmosphere really pulled me in. Christian Bale was, as always, fantastic, and the twists kept me guessing. I wasn’t sure what to expect with the Edgar Allan Poe storyline, but it worked really well. Have any of you seen it? What did you think about the pacing and the ending? I feel like it’s one of those movies that sticks with you a bit after.\n\n",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1rd9fq8/just_watched_the_pale_blue_eye_worth_the_watch/"
    },
    {
        "id": "1rcv428",
        "author": "Crafty_Two5432",
        "title": "Documentaries/reenactments not about murders:",
        "content": "I loved Fyre, Unknown Number, Poop Cruise, Tinder Swindler, Bad Vegan, Woodstock 99’. \n\nI know I said no murders but I also reaaally liked docuseries that aren’t too murdery like The Thing About Pam and Dr Death and The Act. I’m not really into anything about prisons or abductions. ",
        "upvotes": 13,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1rcv428/documentariesreenactments_not_about_murders/"
    },
    {
        "id": "1rcs2m4",
        "author": "Edexote",
        "title": "Extremelly low bitrate on Netflix",
        "content": "I recently saw Dune Two on 1080p Blu-Ray and I decided to compare the image with Netflix. I was greeted with an AV1 1080p stream of 0.49 Mbps. I was shocked. It's a brand new TCL TV running Google TV and the info showed this. Of costumer support doesn't fix this, I'll cancel. This is what they serve to paying customers?\n\nEdit: after I contacted Netflix support, the account was canceled. Their support is useless, they just direct you to the KBs and you're unable to escalate the situation. There are plenty of other streaming platforms anyway, all of them with better image quality.",
        "upvotes": 16,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1rcs2m4/extremelly_low_bitrate_on_netflix/"
    },
    {
        "id": "1rd3izr",
        "author": "CodDefiant2710",
        "title": "Winona Ryder To Appear in Third Season of Netflix’s ‘Wednesday’",
        "content": "[Winona Ryder](https://www.imdb.com/name/nm0000213/) will be joining the cast of Netflix’s [***Wednesday***](https://www.imdb.com/title/tt13443470) as it enters is third season. Ryder, who has starred in [***Stranger Things*** ](https://www.imdb.com/title/tt4574334/)and [***Beetlejuice***](https://www.imdb.com/title/tt0094721), will reportedly play the role of Tabitha, a new character in the series. Eve Green will also appear in the role of Morticia Addams’s troubled sister Aunt Ophelia. What do you think their decision? \n\n[https://cinemadailyus.com/news/winona-ryder-to-appear-in-third-season-of-netflixs-wednesday/](https://cinemadailyus.com/news/winona-ryder-to-appear-in-third-season-of-netflixs-wednesday/)",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1rd3izr/winona_ryder_to_appear_in_third_season_of/"
    },
    {
        "id": "1rcxmwg",
        "author": "Pemberly21",
        "title": "Looking for Teen Dramas",
        "content": "I want to find more teen dramas that have good romance, suspense, and keeps you on your heels, intense moments. I have already seen a lot of drama some of which are School Spirits, Panic, Motorheads, Outer Banks, Riverdale, TVD, Teen Wolf, and more I just can’t think of right now.\n\nAny suggestions???",
        "upvotes": 7,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1rcxmwg/looking_for_teen_dramas/"
    },
    {
        "id": "1rdaxby",
        "author": "Eastern-Investment88",
        "title": "Ha anyone watched the gardener spanish series?",
        "content": "If yes, I want to know what his mother made him in ep 3 to which she added his medicines that he ate and said its very delicious. What's the name of the dish? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rdaxby/ha_anyone_watched_the_gardener_spanish_series/"
    },
    {
        "id": "1rdam6w",
        "author": "cornbreath",
        "title": "Famous Last Words: Who would you like to see in this series?",
        "content": "Not a very nice way to put it, but when I saw Eric Dane’s episode I thought about watching Sir David Attenborough in this series and I got so sad I felt like sobbing. \n\nWhich other celebrity or public figure would you like to have their episode of Famous Last Words?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1rdam6w/famous_last_words_who_would_you_like_to_see_in/"
    },
    {
        "id": "1rcz3p9",
        "author": "equalitylove2046",
        "title": "Gift card for Netflix question?",
        "content": "Yes I was just curious if the gift card is more cost effective?\n\nI was thinking about maybe trying it again but the premium subscription is pretty pricey.\n\nDo the amount on gift cards go down pretty fast?\n\nJust curious I saw a lot that intrigued me recently that’s now on Netflix so I was just wondering.\n\nThanks all. 🤗👏",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1rcz3p9/gift_card_for_netflix_question/"
    },
    {
        "id": "1rcmtga",
        "author": "green9206",
        "title": "Netflix requires I connect to home WiFi every once in a while to keep using it even on my phone",
        "content": "So my question is what if I decide I don't want home WiFi anymore? My mobile plan offers unlimited 5G data and I prefer to use that rather than home wifi because coverage is spotty in some parts of the house. So if I theoretically cancel my broadband will Netflix one day stop working since there will not be any home wifi to connect to? I don't really understand the logic behind this. ",
        "upvotes": 17,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1rcmtga/netflix_requires_i_connect_to_home_wifi_every/"
    },
    {
        "id": "1rcrhz7",
        "author": "Sad-Diamond501",
        "title": "Documentaries to listen to during work",
        "content": "Hi looking for recommendations for shows or documentaries on Netflix that I can listen to during work. These would be things where I would not be able to watch but only listen to. Any recommendations would be appropriated. ",
        "upvotes": 7,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1rcrhz7/documentaries_to_listen_to_during_work/"
    },
    {
        "id": "1rd7jpy",
        "author": "hyyh_o7",
        "title": "Anyone going to watch BTS live on March 21?",
        "content": "I watched BTS’s 2019 MAMA performance recently and was honestly blown away by their stage presence. My little sister is ARMY, and she told me that the last time they performed live, they drew around 49M viewers on Weverse, which is pretty wild.\n\nWith their upcoming Netflix collab and the live performance on March 21st, I’m really looking forward to it. Anyone else planning to watch for the first time???",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rd7jpy/anyone_going_to_watch_bts_live_on_march_21/"
    },
    {
        "id": "1rcnxx3",
        "author": "RiskAndReason",
        "title": "Winona Ryder is joining the cast of Wednesday Season 3!",
        "content": "Not gonna lie, seeing Winona Ryder join Wednesday after loving her in Stranger Things feels kind of surreal.\n\nShe’s already such an icon in darker, gothic-leaning roles, so this casting actually makes so much sense.\n\nAnyone else excited to see her back in another spooky universe?",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rcnxx3/winona_ryder_is_joining_the_cast_of_wednesday/"
    },
    {
        "id": "1rd29mx",
        "author": "Embarrassed_Love7360",
        "title": "Finding Her Edge",
        "content": "I am a little late to the show, but I absolutely detest Brayden. He is so selfish that it bothers me that he could even be considered as a love interest. The only characters I like are the little sister, Freddie, and freddie’s partner. Are there any Adriana &amp; Freddie shippers here?? 😭",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rd29mx/finding_her_edge/"
    },
    {
        "id": "1rbrv9l",
        "author": "StunningComment6064",
        "title": "Guys, can you recommend a comedy show on Netflix that’s actually funny?",
        "content": "It’s very difficult to find a comedy TV show that makes me laugh. I mean, new TV shows seem to be running out of ideas. So could you recommend some comedy shows that you actually find funny? ",
        "upvotes": 180,
        "comments": 649,
        "media": null,
        "permalink": "/r/netflix/comments/1rbrv9l/guys_can_you_recommend_a_comedy_show_on_netflix/"
    },
    {
        "id": "1rcy5av",
        "author": "Skateboardingcow",
        "title": "PACIFIC RIM: THE BLACK",
        "content": "Will NETFLIX ever release PACIFIC RIM: THE BLACK on DVD or Blue-Ray? I love the series and I’d love to have it on DVD or Blu-Ray. I have an Xbox so I buy DVD’s so I won’t won’t chase down the series and constantly pay for subscriptions",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1rcy5av/pacific_rim_the_black/"
    },
    {
        "id": "1rcht52",
        "author": "hyyh_o7",
        "title": "Finally watched The Great Flood everyone was talking about",
        "content": "It was confusing at first. The movie starts as this intense disaster survival story, and I’m fully invested… then suddenly it flips into a wild sci‑fi twist with AI and simulations!\n\nI actually watched a YouTube video afterward and finally understood the explanation. Who else has seen it? What did you think of the twist?",
        "upvotes": 3,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1rcht52/finally_watched_the_great_flood_everyone_was/"
    },
    {
        "id": "1rc1mfu",
        "author": "Acceptable_Sell3455",
        "title": "Animal Kingdom",
        "content": "I discovered this series only recently and binged through all 6 seasons in under 2 weeks. Best series I've watched in ages. The characters were not all great, but my favourite was poor psycho Pope, the jobs were carried out fantastically, Mother a true horror show, on the whole much of it rather unrealistic, but I didn't care, I loved it.\n\nAnd yet ... no-one seems to speak of it. \n\nWhy? \n\nWas it not popular? ",
        "upvotes": 36,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1rc1mfu/animal_kingdom/"
    }
]