[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 20,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mdzg0u",
        "author": "Emondm24",
        "title": "Happy Gilmore 2 thoughts",
        "content": "I enjoyed it.  I quite enjoyed the video game like golf challenge during the last twenty minutes, it had the nice kind of the screw ball comedy that fits in this kind of world.  I liked seeing Ben Stiller return, the MJF and Becky roles, Haley Joel Osment having a key role.  He had the beard in his small role in the Boys so I knew who he was.  Didn’t like Shooters face turn.  Paying homage to the ones no longer with us was respectful.",
        "upvotes": 39,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1mdzg0u/happy_gilmore_2_thoughts/"
    },
    {
        "id": "1me1hz1",
        "author": "phreeakz",
        "title": "New design is back again and it is still horrible.",
        "content": "Seems like they haven't learned. No one liked it. Haven't read any positive comments about it, when they activated the Beta the first time. \n\nStill, new und upcoming is somewhere hidden. No filtering by categories (only through searching but the search window doesn't give a small info window about the movie/series with a short synopsis) .. It's looks overloaded. Can only side scroll through my list which takes ages. Everything is just randomly ordered and have to scroll sideways one by one. \n\nmodern layout is often not the practical one. ",
        "upvotes": 16,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1me1hz1/new_design_is_back_again_and_it_is_still_horrible/"
    },
    {
        "id": "1mdw287",
        "author": "Imaginary_Increase47",
        "title": "The Residence could had been much better!!",
        "content": "I binge-watched *The Residence* last night—well, kind of binge-watched. I went through episodes 1–4 and then skipped straight to the final episode (I'll explain why in a bit).\n\nThe first episode setup was great: a murder in the White House during a chaotic state dinner, and the best detective is brought in to solve the case. With so many characters, each with different responsibilities and motives, the plot seemed like it had potential for some interesting twists.\n\nBut as I watched the next few episodes, there were a few things I couldn't get out of my head:\n\n1. There’s a subtle jabs from Mrs. Cupps about how it’s all men everywhere, etc throughout. I enjoy watching shows and movies with strong female characters—but lines like that feel like they’re just pandering to the audience. Minor thing, but it stood out.\n2. The obsession with birds. I get that someone can be fixated on certain things (I am too), but there’s a bird analogy for *everything*. For every new discovery, there is a bird analogy being made. I mean after a while, it started feeling more like a way to stretch out the runtime than meaningful symbolism.\n3. Pacing. This is my biggest gripe. Things really dragged. Honestly, after episode 4, I jumped straight to the final episode—and I still understood what happened and how the investigation played out, since it all gets recapped in that last 1.5-hour episode.\n\nNow, I’ll say this: the characters and the subtle humor were genuinely great. But if the pacing had been tighter, and each episode trimmed down to around 30–40 minutes, the whole 8-episode series would’ve felt a lot more coherent and engaging.   \n  \nEdit: Surprised it got Emmy nomination.",
        "upvotes": 27,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1mdw287/the_residence_could_had_been_much_better/"
    },
    {
        "id": "1me5qgu",
        "author": "epictetusdouglas",
        "title": "Blacklist on Netflix",
        "content": "Is the Blacklist included with the ads basic tier? BTW how are the ads now? Last year when I was subscribed they were not bad. But other services have been increasing the number and length of ads on their basic services.\n\nThanks!",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1me5qgu/blacklist_on_netflix/"
    },
    {
        "id": "1me4jux",
        "author": "sassyblondechik",
        "title": "Just finished Hightown 10/10",
        "content": "Here’s my beef with Hightown. It’s an amazing series—messy, dramatic, nonstop entertainment—but that ending? Come on. Starz really did fans dirty. They canceled it, apparently because they couldn’t afford it, even though the show brought in huge viewership numbers. Make it make sense. So many unresolved storylines, it felt like they just walked off set mid-scene. I genuinely hope now that Netflix has picked it up, a 4th season is in the works. It deserves one. We deserve one. I’m honestly kind of mad about it.\n\nNow maybe this is a dumb question, but it’s been bugging me: why did the show seem more focused on who killed Jorge  than on Frankie himself—who, let’s be real, was a full-blown murderer? He’s out of prison again and somehow they still couldn’t charge him with anything? That was beyond frustrating. I get that the writers probably wanted to push Ray to kill him in the end, but still—it felt like everyone was just shrugging off Frankie’s entire rap sheet.\n\nIt’s such a great show, but man, that ending left me with more questions than closure.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1me4jux/just_finished_hightown_1010/"
    },
    {
        "id": "1mdimu9",
        "author": "Nebberlantis",
        "title": "What should they make the next Trainwreck about?",
        "content": "I recently watched the new one based off Storm Area 51, and I’ve been loving these past documentaries on the Poop Cruise, Project X, Astroworld and especially Woodstock ‘99.\n\nSo here’s my question: If you could suggest a topic for Trainwreck to cover in their next documentary, what would it be?",
        "upvotes": 87,
        "comments": 124,
        "media": null,
        "permalink": "/r/netflix/comments/1mdimu9/what_should_they_make_the_next_trainwreck_about/"
    },
    {
        "id": "1mdw6f7",
        "author": "Jerry_Cornelius_24",
        "title": "How do I contact Netflix about the new interface?",
        "content": "Hello,\n\nIt's all in the title. How do I express my dissatisfaction to Netflix about its unusable new interface?\n\nIt's an interface designed for phone or tablet screens, but it's unreadable and really not suitable for a large TV screen.\n\nSearching for programs is much more complicated and this interface dictates what Netflix wants you to watch.\n\nIt really makes me want to leave Netflix, **but I want them to know** why I'm going to cancel my subscription.\n\nI searched their website's support page but couldn't find anything relevant.",
        "upvotes": 7,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1mdw6f7/how_do_i_contact_netflix_about_the_new_interface/"
    },
    {
        "id": "1md80h5",
        "author": "leyy_pink1997",
        "title": "Just finished The Fall of the House of Usher — WHY did no one warn me it was this good?! 😱🔥",
        "content": "I went in thinking it would be another slow gothic horror, but damn—Mike Flanagan really cooked with this one. The visuals, the pacing, the way each episode was named after a Poe story… genius.\n\nAnd can we talk about Carla Gugino? She was terrifying and mesmerizing all at once. I haven’t binged something this fast in a while.\n\nAnyone else get Haunting of Hill House vibes but darker and more vicious? Curious if I should go for Midnight Mass next.\n\nWould love to hear your Flanagan rankings or any hidden gems on Netflix that are equally mind-blowing.\n",
        "upvotes": 155,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1md80h5/just_finished_the_fall_of_the_house_of_usher_why/"
    },
    {
        "id": "1me6pg6",
        "author": "Local_Structure_1453",
        "title": "View new releases in the new design",
        "content": "With the new update they have removed the new and new releases section and now I don't know how I can see the current and next week's releases.\n\nIs there any way to check it?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1me6pg6/view_new_releases_in_the_new_design/"
    },
    {
        "id": "1mdxxx3",
        "author": "Blandiblub",
        "title": "UK: Has Friends changed certificate recently?",
        "content": "My daughter was watching Friends on her profile (up to 12s) and was up to about S5 when she told me it's disappeared from her Continue Watching list. \n\nIt's obviously on my own profile and I noticed it's a 15. That would never have been on her profile at all. Maybe it used to be 12 but has changed to a 15?\n\nLooking at the BBFC, it appears the only episode which has a 15 certificate is The One With The Free Porn. And she tells me she had already seen that episode on her profile and gone beyond that. \n\nAnyone else?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mdxxx3/uk_has_friends_changed_certificate_recently/"
    },
    {
        "id": "1md2mol",
        "author": "Sweaty-Toe-6211",
        "title": "Adam Sandler’s ‘Happy Gilmore 2’ Debuts to 46.7 Million Views, Biggest Netflix U.S. Film Opening Ever",
        "content": "",
        "upvotes": 208,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1md2mol/adam_sandlers_happy_gilmore_2_debuts_to_467/"
    },
    {
        "id": "1me0xur",
        "author": "FeelingMyOats",
        "title": "Help - Teleparty extension issues (not syncing)",
        "content": "I'm not sure if the Teleparty extension is having issues right now or not, but basically I've been trying to watch a show with my friend and we've been using Teleparty a lot over the past month or two with no issues. But today, we're both experiencing the weirdest thing. I tried to create a session, but the link is noticeably shorter than usual and doesn't include the show title in it. I thought that would be fine, but when she opened the link, it just played on its own and refuses to sync. Then she tried to create the session, but the same thing happened to her too.\n\nIt's so weird because it shows in the chat log whenever one of us joins or pauses/plays and whatnot, but it's playing two separate instances. If I play, it's still paused for her, and vice versa. It's refusing to sync, and this has never happened before until today. Has anyone else experienced this? Is there a possible fix, or maybe it'll just randomly fix itself after a time? Thanks.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1me0xur/help_teleparty_extension_issues_not_syncing/"
    },
    {
        "id": "1md2rio",
        "author": "dailystar_news",
        "title": "Netflix have confirmed full cast for Pride and Prejudice TV series - what do you think?",
        "content": "",
        "upvotes": 114,
        "comments": 60,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/dbcx9j3blzff1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1md2rio/netflix_have_confirmed_full_cast_for_pride_and/"
    },
    {
        "id": "1md9nhk",
        "author": "Sudden_Pop_2279",
        "title": "'KPop Demon Hunters' becomes Netflix's most-watched original animated film",
        "content": "",
        "upvotes": 42,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1md9nhk/kpop_demon_hunters_becomes_netflixs_mostwatched/"
    },
    {
        "id": "1mdtwjm",
        "author": "ruthgrace",
        "title": "kpop demon hunters - wish the demons were more humanized!",
        "content": "I'm really bummed the movie didn't explore further into demons as people who deserve to be free! I wanted to hear Rumi's version of Takedown that humanized the demons.\n\nI think there's huge potential for a sequel here. If Rumi exists, that means that it's possible for demons to be free of Gwi-Ma. Maybe that's what her mom was working on, but them something went wrong and she died. But maybe Rumi can finish her mom's work and figure out how all demons can have a chance at getting their souls back and being free. It would be cool for a sequel to do that kind of \"moral circle expansion\" where people realize that some demons should have a chance too. But I guess it's too progressive... in the movie the general public doesn't know about demons at all.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mdtwjm/kpop_demon_hunters_wish_the_demons_were_more/"
    },
    {
        "id": "1mdvul2",
        "author": "Cooltwou",
        "title": "I have a question about WWE Content",
        "content": "Is WWE RAW from 2021 on Netflix because the last time I asked this someone else said it wasn’t on there and that has been a few months ago so I thought I would ask again ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1mdvul2/i_have_a_question_about_wwe_content/"
    },
    {
        "id": "1mdvss7",
        "author": "ChiMara777",
        "title": "Is it normal for the Netflix app to play audio clips (no video) of various shows while you browse the app?",
        "content": "I just resubscribed to Netflix for the first time in a year. Whenever I am browsing the app on my iPad, audio clips of various shows (this appears to be shows that are in My List) will randomly play. There is no video to go along with the audio, and the audio is completely unrelated to anything on the screen. I’m not sure if this is a bug or a feature of the app?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mdvss7/is_it_normal_for_the_netflix_app_to_play_audio/"
    },
    {
        "id": "1mdnuen",
        "author": "Strange-Original-201",
        "title": "So DONE with out of sync captions and being forced to watch more ads 90% of the time when I refresh",
        "content": "Seriously. I watch a lot of foreign language content. So I'll be watching something Korean, say... and there's a commercial. After the ad, the caption is completely out of sync and I have to refresh the page. That alone is super-freaking annoying - but THEN: it boots me back to ANOTHER bunch of freaking ads and will STILL be off with its timing afterwards. I have to time it JUST right for it to work. This is too annoying to be sustainable for me. It's been going on for months at this point. If Netflix can't get its act together, it doesn't deserve my money. ",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mdnuen/so_done_with_out_of_sync_captions_and_being/"
    },
    {
        "id": "1mdugo0",
        "author": "Different-Rip-2787",
        "title": "Glass Dome - A slow march to an unsatisfying end",
        "content": "By now I think everyone is familiar with the 'who-done-it' murder mystery. A crime happens. A series of hints are dropped. Some hints point to one suspect. Other hints point to other suspects. And finally the big reveal and the 'how-done-it': Somebody heretofore not suspected yet, turns out to have done the deed, and all the hints are tied together neatly at the end by the big reveal.  How good the show is, is a factor of how well the big reveal explained all those observed clues.\n\nThe Glass Dome on the other hand, tossed out a bunch of clues, and then swept aside all those dangling clues, and then reveals the real killer, which was a surprise to the audience. But unfortunately that surprising revelation doesn't explain any of the previous hints. So there is no 'a-ha moment' type of satisfaction. And the crimes were just completely out of character for the killer, as well as being highly implausible. And on top of that, the show's pacing was way too slow. Not recommended. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mdugo0/glass_dome_a_slow_march_to_an_unsatisfying_end/"
    },
    {
        "id": "1mdsx9s",
        "author": "Soil_spirit",
        "title": "Shedding some light on the ending of Too Much (Period Era context)",
        "content": "I’m seeing a lot of people confused and disappointed about the ending of Too Much — \n\nThe ending was a play off of Sense &amp; Sensibility by Jane Austen. It’s supposed to be the kitschy American dream of a quintessential British experience. In the beginning of the show, you see them watching Sense &amp; Sensibility before she leaves for England. She expects to live on a British estate and have a very “British” experience. \n\nThe ending is supposed to feel sort of rushed and nonsensical in an inside joke sort of way. Because if you love period era books and film adaptations, it’s sort of an inside joke that EVERY story has to end with the main character getting married. (It’s even a joke in 2019’s Little Women.) \n\nSo at the very end where they flash to her and Felix dressed in period era costumes (at their wedding), it’s an homage to the ending of Sense &amp; Sensibility where Marianne Dashwood and Colonel Brandon get married. That’s also why he throws the coins into the air. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mdsx9s/shedding_some_light_on_the_ending_of_too_much/"
    },
    {
        "id": "1mcqsfu",
        "author": "GingerVix666",
        "title": "If there’s one show on Netflix you could recommend…",
        "content": "…to someone who just joined the platform, what would it be? And why? Please don’t say Riverdale 😂😭 I’m just rejoining after a bit and want to know what’s worth watching ",
        "upvotes": 191,
        "comments": 782,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqsfu/if_theres_one_show_on_netflix_you_could_recommend/"
    },
    {
        "id": "1mdqby5",
        "author": "Sweetie_on_Reddit",
        "title": "Question about Bruce on Sirens",
        "content": "I think I understand most of Sirens, but one thing I don't understand is whether it means anything that Bruce thinks he knows Kiki.  Is he just projecting onto her?  Is it his dementia and it means nothing more than that?  I thought it was going to add up to something complicated but now that I finished it I'm unsure it meant much.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mdqby5/question_about_bruce_on_sirens/"
    },
    {
        "id": "1md0vy2",
        "author": "Hey-yo-iz-me",
        "title": "Squid game 3 - is it just me or do you also feel it is slow and boring?",
        "content": "It feels really slow paced. And story seems boring now. And the old aunty who killed her own son to save a stranger and her baby , my two brain cells cant comprehend that kind of kindness/empathy/stupidity. \n\nWhat are your views? ",
        "upvotes": 23,
        "comments": 75,
        "media": null,
        "permalink": "/r/netflix/comments/1md0vy2/squid_game_3_is_it_just_me_or_do_you_also_feel_it/"
    },
    {
        "id": "1mce7ep",
        "author": "Whobitmyname",
        "title": "‘Untamed’ Renewed for Season 2 at Netflix",
        "content": "",
        "upvotes": 518,
        "comments": 150,
        "media": null,
        "permalink": "/r/netflix/comments/1mce7ep/untamed_renewed_for_season_2_at_netflix/"
    },
    {
        "id": "1mdni2d",
        "author": "No_Situation_7748",
        "title": "Household with Second Address",
        "content": "So, my family has two addresses. We spend half our time at one address and the other half at another. Now we’ve never had a problem watching our Netflix account at both addresses but now we do.  At one of the addresses I’m told via my TV that I’m not part of my “household”.  After some research I’ve learned that this is Netflix’s way to prevent account sharing.  But I’m not account sharing. I’m using my account at my homes. Is this an oversight or is this a legit money grab to make me pay for two accounts?   ",
        "upvotes": 2,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1mdni2d/household_with_second_address/"
    },
    {
        "id": "1mdnhud",
        "author": "EmployLegal7589",
        "title": "Derpy and Sussie from KPDH",
        "content": "So I have become obsessed with Kpop Demon Hunters. What do you think about my Derpy and Sussie tattoo? Do you think this is just a fad or do you think K pop Demon Hunters is here to stay? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mdnhud/derpy_and_sussie_from_kpdh/"
    },
    {
        "id": "1mdn060",
        "author": "I_am_Eden",
        "title": "Netflix defaults to widevine, cannot watch 2k or 4k content on my PC",
        "content": "Hey there everyone,\n\nfor the last couple of days I have been trying to figure out the issue with my netflix app not being able to play content above 1080p.\n\nI have selected the \"high\" playback option in the netflix account settings.\n\nW11, up to date\n\nGPU: 4070ti supports HDCP 2.3\n\nDisplay: Odyssey neo g9 supports HDCP 2.3\n\nCable: DisplayPort 1.4\n\nnvidia drivers up to date\n\nresolution: 5120x1440 but even when I set it to 2560x1440 it changes nothing\n\nRefresh rate: 240hz but even limiting to 60hz against changes nothing.\n\nGigabit connection\n\nUsing the netflix app, updated\n\nTried Edge updated same issue\n\nChrome same issue  \nBrave same issue\n\nI am lost, any help is welcome. Using Ctrl+Shift+Alt+D to check the drm it always shows Widevine, no matter if I'm watching a show like stranger things or a movie like oppenheimer. For oppenheimer specifically the resolution is 960x540, even worse than what I get usually",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mdn060/netflix_defaults_to_widevine_cannot_watch_2k_or/"
    },
    {
        "id": "1mdtblr",
        "author": "yezzree",
        "title": "Help Me Change My Mind About Netflixes Original Movies and Shows",
        "content": "I've developed a bit of a prejudice against the shows and movies that netflix makes and I'd like to try and challenge that thought. \n\nI think partially I'm just annoyed that they're constantly pushing them on you, It feels like 70 percent of the things they suggest are their own shows and movies. The other element though is that many of the things I've seen seemed very bland and unoriginal in a similar way to eachother. Like the cinematography and color grading felt like they were done by the same people or something. I've almost come to think of them as slightly more polished lifetime, made-for-tv movies. \n\nBut since there are so darn many of them, and they're most of what I see on the platform, I feel like I should maybe give them a shot if I'm going to keep paying for the service. \n\nCan anyone suggest some genuinely great Netflix originals that might change my mind about their content? Also, I'd like to hear from any lovers of Netflixes original content and listen to their perspective on why they like it. \n\nThanks!",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1mdtblr/help_me_change_my_mind_about_netflixes_original/"
    },
    {
        "id": "1mdw47v",
        "author": "Migulll929",
        "title": "is it just me or netflix removed everything that isnt a netflix original?",
        "content": "was watching the K drama \"taxi driver\" last night, opened netflix this afternoon and everything was all just netflix originals, while everything else is gone, even some of the other shows that i was watching that werent N originals",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1mdw47v/is_it_just_me_or_netflix_removed_everything_that/"
    },
    {
        "id": "1mdfm0u",
        "author": "highonjuice",
        "title": "Some fanart of mine, HUNTRIX photocards! [OC]",
        "content": "Been a fan of Kpop Demon Hunters since it came out, and I’ve been slowly making photo cards for Huntrix!!\n\nHuntrix animal heads are inspired by Stray Kids’ SKZOO, using animals I feel fit their vibes 🐢🦢🐶",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mdfm0u/some_fanart_of_mine_huntrix_photocards_oc/"
    }
]