[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 4,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 53,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1l5n21b",
        "author": "Five50am",
        "title": "Anyone else watch Netflix less since they updated the layout?",
        "content": "I personally can't stand it. I loved how you could see many options on the screen and now it's like your zoomed in and have to scroll for days to see everything. I don't understand why they tried to fix what wasn't broken.",
        "upvotes": 9,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l5n21b/anyone_else_watch_netflix_less_since_they_updated/"
    },
    {
        "id": "1l5j6ro",
        "author": "jerkoff1610",
        "title": "The story of Raymond West and his link to the Tylenol Murders",
        "content": "Watched The Tylenol Murders, the Netflix doc about a week ago and I still can’t shake the Raymond West story. Everyone talks about the Tylenol poisonings but the way the doc weaves in Ray's disappearance from 1978 is seriously haunting.\n\nHe was this retired truck driver who knew James Lewis and then just… vanished. What they eventually found in his house is wild. And the connection to Lewis is super sketchy.\n\nHonestly feels like this should’ve raised way more red flags back then. Makes the Tylenol case even creepier in hindsight.\n\nAnyone else still thinking about that part? Curious what others make of it, coincidence or something bigger?",
        "upvotes": 13,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l5j6ro/the_story_of_raymond_west_and_his_link_to_the/"
    },
    {
        "id": "1l5n6pf",
        "author": "Ruffers75",
        "title": "Becoming Led Zeppelin",
        "content": "Hi Everyone,\nI’ve read that this is available from 7th June(today).\nCan’t seem to find it though?.\nHave I got the date wrong/being thick?.\nMany thanks!!.",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l5n6pf/becoming_led_zeppelin/"
    },
    {
        "id": "1l5lkz0",
        "author": "vurryscurry",
        "title": "Tires Season 2 audio is off by a second or two and it’s unwatchable.",
        "content": "Fix this, Netflix. And it’s not just “my tv” either. I have tried on every tv in my house and my phone, the audio still lags. Why does it seem like Netflix drops the ball far more often than not? ",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1l5lkz0/tires_season_2_audio_is_off_by_a_second_or_two/"
    },
    {
        "id": "1l5ovqv",
        "author": "techtoxin",
        "title": "[Request] Which Hindi movie to watch on Netflix?",
        "content": "I am Requesting Hindi movie which could be dubbed in Hindi which is worth to watch which I might not have seen earlier.\nSuggestions are welcome thank you in advance ☺️",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l5ovqv/request_which_hindi_movie_to_watch_on_netflix/"
    },
    {
        "id": "1l5og9p",
        "author": "Beneficial-Heart8015",
        "title": "Animal House",
        "content": "Watching this show is so stressful.  Is there any character that's redeemable? there's not a single character that's got redeeming qualities.  Even law enforcement is skeevy.\n\nDoes anyone find this show entertaining? I started this after Dept Q and it's not even close in quality programming. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l5og9p/animal_house/"
    },
    {
        "id": "1l5nxaa",
        "author": "InternPrestigious313",
        "title": "Need some recommendation for series",
        "content": "Something light and fun…\nI thought of asking you guys before randomly watching 2-3 episodes of some stupid show! \nMy fav series are: GOT, HOTD, How I met your mother, Nobody wants this, Schitts creek( i LOVEEEEEE IT), Never have I ever, some K dramas, how to make millions before gradma dies(it was soo heartwarming 🤌🏻) anddddd I can’t remember anymore…. But please recommend something nice😭🙏🏻",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l5nxaa/need_some_recommendation_for_series/"
    },
    {
        "id": "1l5mk5p",
        "author": "TheTravelingDanksman",
        "title": "Why dose netflix make my phone darker",
        "content": "Everytime I start streaming my phone seems to get less colorfully and it stays that way untill I close netflix. Almoat like a gray hue. how do I fix this.\nAndroid ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1l5mk5p/why_dose_netflix_make_my_phone_darker/"
    },
    {
        "id": "1l4tn78",
        "author": "Safe-Conversation770",
        "title": "Shows similar to Dept Q",
        "content": "As the title suggests, I am looking for recommendations for shows that have the same genre as Dept Q. I thoroughly enjoyed the series. Please help a girl out. ",
        "upvotes": 85,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1l4tn78/shows_similar_to_dept_q/"
    },
    {
        "id": "1l5lna5",
        "author": "CitizenTony",
        "title": "How many Jackie Chan movies are there on Netflix?",
        "content": "I don't know if those non-party websites where you can see the catalog of available films on various streaming services are really reliable. Except the recent movies starring Jackie Chan bought by netflix, I was wondering how much of his filmography is available overthere\n\nedit : Of course, the question is asked by someone who doesn't own an account anymore (but who might come back in a distant future, depending on certain criteria. Idk) otherwise the question would not be asked. That seems logical.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l5lna5/how_many_jackie_chan_movies_are_there_on_netflix/"
    },
    {
        "id": "1l5lhm3",
        "author": "oz_shadow",
        "title": "Need ideas to stream Netflix to TV using only a phone with internet?",
        "content": "I am helping a relative with this who is on a fixed budget.  We will add her as a separate paid add on if we can figure out how to allow her to access it on her tv in a separate household without wired internet.  \n\nHotspot data available on her cell phone is very limited so we want to avoid that option.  Data used on the actual cell phone is unlimited.  I’d like to know the options for her to be able to watch Netflix on an older 1080p television using only the cell phone as her internet source.\n\nThe phone is a newer Samsung.  Thank you in advance.",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1l5lhm3/need_ideas_to_stream_netflix_to_tv_using_only_a/"
    },
    {
        "id": "1l5klym",
        "author": "PassengerUnable3634",
        "title": "Recommend something like Ginny &amp; Georgia",
        "content": "Done watching this series. But want to watch something similar.\nRecommend few good shows similar to G&amp;G \nOr any feel good series.\nWhen are we supposed to get new season of this show?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l5klym/recommend_something_like_ginny_georgia/"
    },
    {
        "id": "1l5jwjw",
        "author": "lovereading04",
        "title": "Carry-On scene question",
        "content": "I’ve watched Carry-On a few times, and I’ve noticed that when Nora is running away from the Ready Teddy van and towards a police officer on the ground floor of the airport, that she decides to turn right, which is away from the police officer and other cars, that could’ve stopped the van from getting to her. \n\nWhy does she turn right? Why doesn’t she run towards the police officer like she should’ve done? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l5jwjw/carryon_scene_question/"
    },
    {
        "id": "1l5ezez",
        "author": "h2fast",
        "title": "Pineapple Express",
        "content": "What a fucking film 😂, they all played and amazing part what do you all think the cost of making that would be now because of how high up Seth rogan and the other actors are",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1l5ezez/pineapple_express/"
    },
    {
        "id": "1l5euu8",
        "author": "S4v1r1enCh0r4k",
        "title": "Leviathan Anime Takes Off July 10 with Airships, War, and a Wild New World",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l5euu8/leviathan_anime_takes_off_july_10_with_airships/"
    },
    {
        "id": "1l5l7mg",
        "author": "Pyro_Funto",
        "title": "Show stopped to let other profile watch?",
        "content": "Hey everyone, I am sharing an account with 2 other people but we have a limit of 2 simultaneous streams. I was watching a tv show and when reaching the end of the episode I clicked to start the next one, not even going back to the menu. However it now tells me there are too many ppl watching. How come the third person managed to start watching if I was already streaming? Is there a priority or did they forcefully stop my stream?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l5l7mg/show_stopped_to_let_other_profile_watch/"
    },
    {
        "id": "1l5kogw",
        "author": "LucyLovesApples",
        "title": "Squid games",
        "content": "Anyone feeling disappointed with the new series?? The first one was really good and I was looking forward to the new series but so far it’s difficult to watch and follow. ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1l5kogw/squid_games/"
    },
    {
        "id": "1l5gskn",
        "author": "Top-Three-USA",
        "title": "Netflix Viewers 'Up All Night' Binge-Watching ‘Excellent’ Ginny &amp; Georgia Season 3 After Long-Awaited Return",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l5gskn/netflix_viewers_up_all_night_bingewatching/"
    },
    {
        "id": "1l5gqhn",
        "author": "akshatsgi",
        "title": "What is up with Netflix subtitles?",
        "content": "I recently noticed that the Netflix subtitles on my Apple TV are appearing in front of the characters who is saying the dialogue.\n\nIt is a bit irritating because it sometimes blocks actors faces. \nIs anybody else facing this? \nIs there a way to revert this to be in the bottom of the screen?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l5gqhn/what_is_up_with_netflix_subtitles/"
    },
    {
        "id": "1l4rh3h",
        "author": "Blessed3000",
        "title": "STRAW Last scene",
        "content": "***Spoiler - read only if you have watched the movie / or don’t mind reading about what happens in the movie***\n\nJust watched this very moving and sad movie by Tyler Perry. The last scene shows Janiyah in the bank with the bank manager, and finally the FBI have turned her phone back on. She receives a call from her mother who is at home and the FBI are with her. She proceeds to tell Janiyah that her daughter has passed away. \n\nThis is followed by a series of what I assumed were flashbacks, but could have been hallucinations showing that she went to the school (because they asked her to come in) but the teacher tells her they didn’t call her. She then turns to look for her daughter and the hallway is empty with no sign of her daughter. (Was that real or hallucination?!) \n\nAlso she turns to the bank manager to tell her the news, and the bank manager says she already knew because she had been informed earlier. \n\nSo my questions are; did Janiyah’s daughter die a while back, hence causing her break down and the narrative about the school calling her in/ lunch money etc was a hallucination? Was the bank manager just playing along when she agreed to look after her daughter (in the event that Janiyah goes to jail)? \n\nOr did Janiyah’s daughter actually die the night before the hold up at the bank, and losing her job etc etc…  and she was not aware until that moment? \n\nJaniyah also hallucinates that the FBI throw a bomb into the bank and surround her and shoot her to death. But then back in reality she walks out with the bank manager in a state of trauma. \n\nThoughts? :-) any other views … ? ",
        "upvotes": 39,
        "comments": 81,
        "media": null,
        "permalink": "/r/netflix/comments/1l4rh3h/straw_last_scene/"
    },
    {
        "id": "1l5d0qk",
        "author": "sloppyduc",
        "title": "Solution for getting Old UI back",
        "content": "Hey guys I have found the solution for recent UI change;\n\nGo to your account &gt; security &gt; feature testing and turn it off \n\nNow sign out and sign in again on the Tv \n\nIf that still doesn’t work then uninstall and install the app again\n\nIt worked for me;\nHave a great day:)\n",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l5d0qk/solution_for_getting_old_ui_back/"
    },
    {
        "id": "1l5f2yn",
        "author": "Robemilak",
        "title": "Netflix Shareholders Vote Out Board Member Jay Hoag In Rare Repudiation",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l5f2yn/netflix_shareholders_vote_out_board_member_jay/"
    },
    {
        "id": "1l55oki",
        "author": "AnagnorisisForMe",
        "title": "Are you enjoying Season 3 of Ginny and Georgia?",
        "content": "I really enjoyed the first two seasons of the Ginny and Georgia series. But Season 3 isn't doing it for me for some reason. What are your thoughts about S3?",
        "upvotes": 7,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1l55oki/are_you_enjoying_season_3_of_ginny_and_georgia/"
    },
    {
        "id": "1l5exar",
        "author": "jiru777",
        "title": "why netflix said \"finish sign up\" even though i paid the subscription recently?",
        "content": "https://preview.redd.it/vvafewd0hg5f1.png?width=1919&amp;format=png&amp;auto=webp&amp;s=cc2b05f09062b4084575ec1de7827eb7775f837e\n\nhttps://preview.redd.it/zuw3l1e0hg5f1.png?width=1919&amp;format=png&amp;auto=webp&amp;s=028b47c8a798a01e9996b8c6e9bfe2aa54b9093d\n\nso i availed the basic plan of netflix last night. on the main phone which is my dad uses, it works well and has 4 different profile on it. whenever i log in/sign in that account on other device, it said finish signing up and force me to start a new membership? mind u that i already pay it on the active gmail.  what should i do?\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l5exar/why_netflix_said_finish_sign_up_even_though_i/"
    },
    {
        "id": "1l58guu",
        "author": "summerconcerts",
        "title": "Ginny&amp;Georgia season 3 who has watched?",
        "content": "I just finished the new season 3 on Netflix. Oh my goodness😳what now? What an ending Will there be another season in like 5 years? I knew they would end with a cliffhanger. ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1l58guu/ginnygeorgia_season_3_who_has_watched/"
    },
    {
        "id": "1l4i6xe",
        "author": "Merry_Little_Liberal",
        "title": "Tires Season 2 is FANTASTIC",
        "content": "I watched season 1, and enjoyed it, it was a 6/10 for me. \n\nI just binged the entire season 2, and I really enjoyed it. HUGE step up from season 1. \n\nThe character developments from Season 1 is fantasic. Kyla, Cal, Shane, Will, Dave,  new characters that will be main characters... really good development. \n\nBringing back side characters that were in Season 1 to reprise the role in season 2 was FANTASTIC. No Spoilers!!!  At least 3 primary side characters are back for season 2 with new side stories, like getting a \"Pontiac Bandit\" episode, I hope they continue it. \n\nReally good story development, already excited for Season 3. \n\n\nEpisodes had the same vibe as The Office jump from Season 1 to Season 2. \n\nIt is still very much \"guy humor\"... pussy jokes, and ragging on each other, sure.  But if you even remotely enjoyed Season 1, do not miss Season 2! \n\nI'm going 8.5/10! ",
        "upvotes": 106,
        "comments": 60,
        "media": null,
        "permalink": "/r/netflix/comments/1l4i6xe/tires_season_2_is_fantastic/"
    },
    {
        "id": "1l4ssm1",
        "author": "servalshark",
        "title": "Looking for a show for me and my mom!",
        "content": "Hi! Hopefully it’s cool that I post here. I very much would appreciate some show recommendations for me and my mom. She has mandatory down time for the foreseeable future and I need to keep her occupied. I’m going to try to get her into some puzzles or arts and crafts, but I’d also like a good show for us to watch together!\n\nFor her: she likes…cooking, the show Survivor, home renovation/HGTV, The Boys (weird outlier there but I thought I’d mention lol), some romance movies. \n\nI can do pretty much anything. I just want her to be happy and actually enjoy it. \n\nI was thinking of getting her to watch Nailed It! because it’s fun, but I think she’d find it too cheesy. I’ll look into anything you recommend though! Please refrain from including anything too dark or related to illness. Thanks! ",
        "upvotes": 14,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1l4ssm1/looking_for_a_show_for_me_and_my_mom/"
    },
    {
        "id": "1l52pl5",
        "author": "JAXATOMIX",
        "title": "Why do people hate bet?",
        "content": "I just finished it and wow.. it was a ride.\n\nI honestly think that after watching the anime it was amazing.\n\nBut I honestly don’t get why people hate it. I get that it can be cringy and low quality at times but other than that it was amazing. \n\nLet me know why people hate it and tell me ur opinion.",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1l52pl5/why_do_people_hate_bet/"
    },
    {
        "id": "1l58lsp",
        "author": "Interesting-Site-515",
        "title": "Bee movie top 10",
        "content": "Anyone else notice bee movie always seems to be in the top 10 watched movies list lol. I wonder if it’s mostly adults watching it for fun or kids actually watching. Either way it’s funny to think about.",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1l58lsp/bee_movie_top_10/"
    },
    {
        "id": "1l4tgg9",
        "author": "theeleven1111",
        "title": "Finished Ginny and Georgia and so bored now. Any similar shows?",
        "content": "Whole package of teenage and adult drama, comedy, great music and colorful.\n\nPlease recommend some great shows and movies.  I loved the charector of Georgia ",
        "upvotes": 7,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1l4tgg9/finished_ginny_and_georgia_and_so_bored_now_any/"
    }
]