[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1kc1pnd",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 23,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1kc1pnd/la_piola_friends_meetup/"
    },
    {
        "id": "1ker2bb",
        "author": "Sospettosamente",
        "title": "Vivere a Torino da un anno, ma ancora zero amici. Colpa nostra o della “riservatezza sabauda”?",
        "content": "Ciao a tutti,\nio (32) e la mia ragazza (27) ci siamo trasferiti a Torino circa un anno fa per lavoro e per cambiare un po’ aria. \nLa città ci piace molto: è vivibile, bella, si mangia bene e ci si sposta facilmente. Peró non siamo riusciti a fare praticamente nessuna nuova amicizia.\n\nPurtroppo nei rispettivi posti di lavoro non è andata benissimo da quel punto di vista: nel mio caso i colleghi sono tutti molto più grandi di me e con vite già molto diverse; nel suo sono quasi tutti fuori sede e tendono a tornare a casa nei weekend. Questo rende difficile creare un legame anche al di fuori dell’ambiente lavorativo.\n\nSiamo due persone tranquille, aperte ma non invadenti, e ci stiamo chiedendo se questa difficoltà a fare amicizia sia legata alla famosa “riservatezza sabauda”, oppure se sia normale trovarsi così a questa età in una città nuova.\n\nQualcuno si è trovato nella stessa situazione? Avete consigli su posti, eventi o attività dove sia più facile conoscere persone? Circoli, sport di gruppo, associazioni, qualsiasi cosa possa aiutare a fare due chiacchiere in modo naturale.\n\nGrazie mille a chi risponderà,\nun saluto da due torinesi adottivi un po’ spaesati ma fiduciosi!",
        "upvotes": 20,
        "comments": 44,
        "media": null,
        "permalink": "/r/torino/comments/1ker2bb/vivere_a_torino_da_un_anno_ma_ancora_zero_amici/"
    },
    {
        "id": "1keq6mg",
        "author": "Holiday-Scholar",
        "title": "Pub/birreria a Torino?",
        "content": "Ciao belli/e. Sto cercando un posto dove trascorrere il compleanno con gli amici per bersi una birra e mangiare qualcosa. Avete qualche consiglio? (No roba tipo doppio malto)",
        "upvotes": 5,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1keq6mg/pubbirreria_a_torino/"
    },
    {
        "id": "1keu2vi",
        "author": "Lo_beany",
        "title": "serate drum and bass/techno",
        "content": "sarò a Torino dal 9 al 26 maggio, consigli per serate??\nricordo di essere stata anni fa ad una serata con i The Dreamers, organizzano ancora?\nconosco Genau all'Azimut ma essendo via da Torino da un po' sto cercando consigli 😍✨",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1keu2vi/serate_drum_and_basstechno/"
    },
    {
        "id": "1kee2k0",
        "author": "Dangerous_Branch_491",
        "title": "Appassionati di cinema?",
        "content": "Ciao a tutti,\n\nvivo a Torino da quasi tre anni, ma complici il lavoro quasi esclusivamente da remoto e il mio carattere piuttosto introverso, non sono riuscito ancora a stringere amicizie qui.\n\nMi piacerebbe conoscere qualcuno con interessi simili per fare due chiacchiere, anche in chat e senza troppa pressione. Non sono il tipo da locali o grandi comitive: preferisco le conversazioni tranquille.\n\nM39, sono molto appassionato di cinema (sia d'autore che mainstream), ma anche di videogiochi,  sport (tennis, formula 1, atletica leggera...), scrittura - ultimamente mi sto avvicinando alla sceneggiatura. Sono consulente informatico e lavoro con Salesforce, se dice qualcosa a qualcuno.\n\nNessuna aspettativa precisa, solo voglia di condividere un po’ di passioni.\n\nSe ti va, scrivimi pure :)",
        "upvotes": 8,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1kee2k0/appassionati_di_cinema/"
    },
    {
        "id": "1kehlzc",
        "author": "SafeZookeepergame573",
        "title": "Dove comprare un buon Vermouth a Torino?",
        "content": "Ciao! A breve sarò ospite da alcuni amici e per sdebitarmi volevo portare qualcosa di \"tipico\" ed avevo pensato ad una buona bottiglia di vermouth. Avete consigli su dove è possibile comprare roba non industriale ed avete consigli sulla bottiglia specifica ? (Me ne intendo molto poco)",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1kehlzc/dove_comprare_un_buon_vermouth_a_torino/"
    },
    {
        "id": "1kejmqq",
        "author": "Pitiful_Ad_9645",
        "title": "Gruppi/eventi per fare nuove amicizie? Da 6 mesi a Torino ma non ho ancora un gruppo di amici (ho 27 anni)",
        "content": "",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1kejmqq/gruppieventi_per_fare_nuove_amicizie_da_6_mesi_a/"
    },
    {
        "id": "1ke62h0",
        "author": "umudyy",
        "title": "Bar / Cafe Advices",
        "content": "Hello everyone. I'm an international student in Turin, and some of my friends will be visiting me soon. Please recommend places so impressive that my guests will be amazed. It can be a café or a bar, it doesn't matter. As for bars, I only know Imbarchino and Jumping Jester.\n\nI know all the museums or stuff the post is only about cafes and bars. Thanks !",
        "upvotes": 9,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/l9u6zoi5inye1.jpeg?auto=webp&amp;s=863707429d984c923efde2c9646f97d7e36ea604"
        },
        "permalink": "/r/torino/comments/1ke62h0/bar_cafe_advices/"
    },
    {
        "id": "1ke3hat",
        "author": "Background-Chest-717",
        "title": "Most aestethic cafes / bars in Torino",
        "content": "Can you tell me most good looking cafes and bars in Torino ? Thanks !",
        "upvotes": 6,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3vtrwwbwvmye1.jpeg?auto=webp&amp;s=a6f5b94d0d8ef049c592896c0c04b1fd55a9d278"
        },
        "permalink": "/r/torino/comments/1ke3hat/most_aestethic_cafes_bars_in_torino/"
    },
    {
        "id": "1kdrge2",
        "author": "Jus_Crik_00",
        "title": "Angolo Corso Regina Margherita e Corso Principe Oddone",
        "content": "https://preview.redd.it/ux5790y54kye1.png?width=1093&amp;format=png&amp;auto=webp&amp;s=cd133cfcefd8f1a36af1707af47723b1e901e850\n\nCiao a tutti.  \nMia sorella ha trovato un annuncio per una camera all'angolo tra Corso Regina Margherita e Corso Principe Oddone.  \nQualcuno conosce la zona?  \nCom'è a livello di sicurezza, specialmente la sera?",
        "upvotes": 8,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1kdrge2/angolo_corso_regina_margherita_e_corso_principe/"
    },
    {
        "id": "1kdz9k4",
        "author": "DirectInteraction825",
        "title": "Dove parcheggiare la macchina per lunghi periodi (in zone centrali)?",
        "content": "Ciao, mi sono appena trasferito in una casa tra le fermate della metro di Porta Nuova e Re Umberto, più precisamente in Corso Stati Uniti. \n\nVado al lavoro in metro (scendendo a Marche) cercando di usare la macchina il meno possibile vista la difficoltà di trovare un parcheggio bianco vicino al centro. \n\nCiò che faccio di solito per parcheggiare é ripercorrere la strada della metro, e verso il Parco della Tesoriera parcheggiare, per poi tornare in metro. Stiamo parlando di quasi 4km da casa mia, e questa situazione onestamente mi scoccia un po’. \n\nDato che sono nuovo a Torino forse non conosco bene le zone e l’idea di parcheggiare vicino alla fermata della metro é l’unica che ho avuto per ora. Ci sarebbe anche la possibilità di cambiare residenza e pagare una cifra di circa 150€ all’anno per parcheggiare nei parcheggi blu in centro, ma vorrei evitare per ora, dato quanto uso la macchina. \n\nGrazie per ogni consiglio.",
        "upvotes": 1,
        "comments": 29,
        "media": null,
        "permalink": "/r/torino/comments/1kdz9k4/dove_parcheggiare_la_macchina_per_lunghi_periodi/"
    },
    {
        "id": "1kds6lp",
        "author": "Dany990ITA",
        "title": "spiazzale aperto per prove guida",
        "content": "Buongiorno, sono un ragazzo che ha fatto il foglio rosa di recente e vorrei provare a guidare con mio padre, ma non avendo mai toccato il volante avremmo voluto andare in qualche spiazzo dove c'è poca gente per poter fare pratica con manovre e movimento. Avete qualche consiglio su dove poter fare pratica? Se possibile sarebbe comodo zona Collegno, Grugliasco, Rivoli o Pianezza. \nGrazie mille in anticipo per i consigli",
        "upvotes": 1,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1kds6lp/spiazzale_aperto_per_prove_guida/"
    },
    {
        "id": "1kdw2fj",
        "author": "Sospettosamente",
        "title": "Dove posso trovare un ipod ?",
        "content": "Ciao a tutti!\nSto cercando un iPod nano o classic e mi chiedevo se a Torino esistono mercatini dell’usato o dell’elettronica, sia all’aperto che al chiuso, dove potrei avere fortuna. Qualcosa tipo mercatini delle pulci specializzati o negozi second-hand tech.\n\nConoscete posti del genere, magari dove portarsi dietro un po’ di contanti e trattare sul prezzo?\nAnche consigli su negozi vintage o bancarelle in periferia sono ben accetti!\n\nGrazie in anticipo!\n",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1kdw2fj/dove_posso_trovare_un_ipod/"
    },
    {
        "id": "1kdt590",
        "author": "UglycoreIT",
        "title": "Gruppetto telegram/discord?",
        "content": "Lo facciamo? ",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1kdt590/gruppetto_telegramdiscord/"
    },
    {
        "id": "1kczuze",
        "author": "SpotNL",
        "title": "Che significa questo graffito? Lo vedo spesso. È un personaggio famoso?",
        "content": "",
        "upvotes": 57,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/x6z4pwu15dye1.jpeg?auto=webp&amp;s=499765df509b13a712967698199f44cc7deba5b5"
        },
        "permalink": "/r/torino/comments/1kczuze/che_significa_questo_graffito_lo_vedo_spesso_è_un/"
    },
    {
        "id": "1kdcpc9",
        "author": "mainapizza",
        "title": "Bivacco con temporale?",
        "content": "Ciao a tutt*, domani volevo andare in tenda con un amico ma vedo che ci sono temporali un po' ovunque, pensavo quindi di ripiegare su un bivacco fisso relativamente facile da raggiungere (tipo massimo un paio d'ore di cammino), avete proposte? Partiamo da Asti e torniamo a Torino. \nGrazie ❤️",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1kdcpc9/bivacco_con_temporale/"
    },
    {
        "id": "1kd0llz",
        "author": "Vasilisa-itva",
        "title": "Altre conoscenze utile, unito",
        "content": "Allego la domanda x non scrivere ottanta volte la stessa cosa ",
        "upvotes": 0,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8agbbmxvbdye1.jpeg?auto=webp&amp;s=27e111b09c6cc20736d0d05cce23db0a4918d48e"
        },
        "permalink": "/r/torino/comments/1kd0llz/altre_conoscenze_utile_unito/"
    },
    {
        "id": "1kcy1k8",
        "author": "Independent_Sun_1457",
        "title": "Torino madama Cristina angolo corso dante",
        "content": "Ciao a tutti, sarei interessata a una casq in questa zona.\nE' sicuro per ragazze e famiglia? Grazie",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1kcy1k8/torino_madama_cristina_angolo_corso_dante/"
    },
    {
        "id": "1kcvbsu",
        "author": "attibearth",
        "title": "Citizenship Language Test/classes B1",
        "content": "Ciao tutti,\n\nWriting in English as this is mainly for internationals.\nI’m looking for a language school to ensure my level of Italian is comfortably B1 for the language test for citizenship through marriage.\n\nDoes anyone have any experience and/or suggestions? \n\nGrazie mille ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1kcvbsu/citizenship_language_testclasses_b1/"
    },
    {
        "id": "1kcl045",
        "author": "shibarama",
        "title": "Local library to study/work?",
        "content": "Hello everyone.\n\nI will be staying for two months in Torino and I wonder if there are public libraries where I can study or work. I'm also looking for cafes/bar options (if they are cheap, good! I'm not looking for something fancy, just a nice place in which I can buy a coffee).\n\nThanks for your suggestions!\n\n  \n",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1kcl045/local_library_to_studywork/"
    },
    {
        "id": "1kcmghn",
        "author": "NoTank8051",
        "title": "ravers",
        "content": "hey everyone iam visiting turin next week and want to go to a rave on friday i researched a bit and found azimut club and audiodrome if anyone here goes there often or even has been in either of them please text me i have some questions. thanks.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1kcmghn/ravers/"
    },
    {
        "id": "1kcmbbd",
        "author": "lucadepa_",
        "title": "skyline migliore",
        "content": "ciao a tutti, sono di torino, da un po’ di tempo mi chiedevo se oltre i posti che conosco io (superga,monte dei cappuccini parco europa e parco della maddalena) qualcuno di voi conoscesse posti simili in cui si può vedere la città dall’alto, grazie in anticipo",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1kcmbbd/skyline_migliore/"
    },
    {
        "id": "1kcxt2o",
        "author": "ajejebrazorfsul4",
        "title": "Cosa ne pensate di questi robottini assunti da gtt? Raccontate scene che avete visto!",
        "content": "",
        "upvotes": 0,
        "comments": 26,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7826nvs1lcye1.jpeg?auto=webp&amp;s=0b7af47c92286a98ab2444877ff3716ed98fe05e"
        },
        "permalink": "/r/torino/comments/1kcxt2o/cosa_ne_pensate_di_questi_robottini_assunti_da/"
    },
    {
        "id": "1kc95ll",
        "author": "mottentrottel",
        "title": "Attività all'aperto",
        "content": "Ciao! Qualcuno mi può consigliare dei posti carini dove fare qualche attività all'aperto a prezzi bassi? È la mia prima volta a Torino in primavera e vorrei approfittare questo bel sole ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1kc95ll/attività_allaperto/"
    },
    {
        "id": "1kce6da",
        "author": "Original_Draw_9492",
        "title": "Gtt oggi 1° maggio",
        "content": "Non so se ho capito bene ma, tram e bus fino alle 19:30, mentre la metro fino a mezzanotte è garantita?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1kce6da/gtt_oggi_1_maggio/"
    },
    {
        "id": "1kcmu95",
        "author": "Competitive-Air2715",
        "title": "u fum ste o nan ste?",
        "content": "ciao, sono qui in visita temporanea e cerco Ash o weed, community potreste aiutarmi? no pacchi no parla parla :)",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1kcmu95/u_fum_ste_o_nan_ste/"
    },
    {
        "id": "1kc89pe",
        "author": "adrieloth",
        "title": "Football Fields",
        "content": "Hello dear Turin people,\n\nI am looking for free football fields like the ones in Parco Ruffini. I have been here for some time but never found a pitch similar. There are no other free pitches to train alone?\n\nOr I can join your team if you are playing 7v7 or something hit me up.\nthanks!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1kc89pe/football_fields/"
    },
    {
        "id": "1kbi76b",
        "author": "umudyy",
        "title": "How can i make money as a foreigner ?",
        "content": "Hi im a student in PoliTo.I cant speak properly italiano for now.I need money nowadays.How can i make money ? I guess for working in the bars etc you should speak italiano.Do somebody know how can i do glovo ? Please contact to me . Thx !",
        "upvotes": 27,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ufld2z05izxe1.jpeg?auto=webp&amp;s=1f3bcb209b68fc03cfeb75c490dcfceb6fd606d7"
        },
        "permalink": "/r/torino/comments/1kbi76b/how_can_i_make_money_as_a_foreigner/"
    },
    {
        "id": "1kbsdt3",
        "author": "Usual_Ad8650",
        "title": "Conoscere nuova gente",
        "content": "Noi siamo una coppia che nn abbiamo molte amicizie e vorremmo conoscere una coppia per uscite in Torino noi siamo in provincia.",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1kbsdt3/conoscere_nuova_gente/"
    },
    {
        "id": "1kbo0hh",
        "author": "PurposeDismal2928",
        "title": "futuro fuorisede: linee di bus/tram da evitare",
        "content": "Ciao a tutti, sto cercando casa in zona San Donato / San Paolo / Cenisia e andrò a lezione a Palazzo Nuovo. Non sono di Torino e da quel che ho capito sono zone tranquille, quello su cui però ho dubbi sono le linee dei mezzi pubblici. Conosco la \"fama\" del 4 ma per il resto non ho idea di quali siano accettabili e quali sarebbero da evitare, se poteste darmi indicazioni a grandi linee mi dareste una grossa mano",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1kbo0hh/futuro_fuorisede_linee_di_bustram_da_evitare/"
    },
    {
        "id": "1kapmyr",
        "author": "Agreeable_Produce_86",
        "title": "Stolen bike",
        "content": "Just in case you saw my stolen bikeonline or somewhere let me know😅 thanks.",
        "upvotes": 161,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/arzas5afdsxe1.jpeg?auto=webp&amp;s=bfafbb517927faadfc989d3099de3b8e96280f9b"
        },
        "permalink": "/r/torino/comments/1kapmyr/stolen_bike/"
    }
]