[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 5,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1n9uaup",
        "author": "__Nkrs",
        "title": "Andare a vivere in provincia di Torino",
        "content": "Salve a tutti, sono 26M, vengo dal terzo mondo (campania). Odio tutto di questo posto, il posto, l'ignoranza, e lo svegliarmi con la puzza di plastica bruciata ogni 2-3 giorni. Nascere qui è stata la condanna che ha dettato la qualità sudicia (quasi un anagramma azzeccato) della mia vita fin ad ora. Fortunatamente, stare chiuso in casa mi ha fruttato un lavoro full remote con uno stipendio medio europeo (E non italiano).\n\nStavo valutando l'idea di andare a vivere altrove. Il problema è che ho viaggiato veramente poche volte in vita mia per colpa della povertá, quindi non sono abituato nè a vivere da solo, nè a capire se un posto è adatto o no per andare a viverci. Ho un parente a Torino che è disposto ad ospitarmi per una settimana, mi ha consigliato poi di trovare affitto nelle seguenti zone: Giaveno - Coazze - Avigliana. Ho visto un po' su google maps e mi sembrano posti decenti. I miei requisiti sono principalmente questi:\n\n\\- Posto vicino le montagne, o vicino il mare, E vicino ad una cittá ( &lt; 20/30 minuti di distanza in moto )  \n\\- Possibilitá di scendere di casa, e fare una camminata in natura senza rischiare di esser buttati sotto, derubati, o minacciati.  \n\\- Aria relativamente pulita. (Se giá non c'è plastica bruciata giá mi va bene).  \n\\- Possibilitá di fare conoscenze / amici con cui fare attivitá tipo disegno (o arte in generale), hiking / camping/ gravel biking, etc, calisthenics o palestra, riding (moto), ecc, visto che sono un loner di merda senza amici.  \n\\- Affitto non esagerato. Guadagno decentemente, ma non voglio spendere 800€ solo di affitto. Preferisco un appartamento piccolissimo ma il più possibile in natura con spazi aperti.\n\nDa google maps sembra che quei posti siano abbastanza ok per quello che voglio, ma vorrei opinioni di persone che ci vivono o che ne sappiano qualcosa.\n\nIn alternativa sono aperto a qualsiasi altro suggerimento se vi sentite gentili e volete aiutare un terrone pentito del posto in cui è spawnato. Grazie.\n\n# TL;DR per chi non vuole leggere il monologo:\n\nVivere a **Giaveno - Coazze - Avigliana** ,in full-remote, per una persona che ha bisogno di fare amicizie e ama hiking/montagne (o mare). Biker. Sì, no, o potrei puntare a posti migliori?",
        "upvotes": 19,
        "comments": 43,
        "media": null,
        "permalink": "/r/torino/comments/1n9uaup/andare_a_vivere_in_provincia_di_torino/"
    },
    {
        "id": "1na6ikz",
        "author": "Classic-Delivery-81",
        "title": "Trasformazione fisica, palestra.",
        "content": "Ciao a tutti!  \nMi alleno in palestra dal 18 marzo e sono abbastanza soddisfatto dei progressi, però sento che avrei potuto ottenere molto di più se fossi stato seguito da qualcuno con esperienza. Un PT per ora non me lo posso permettere, quindi sto cercando una persona che abbia già un po’ di conoscenza del mondo della palestra e che sia disposta a darmi una mano: consigli, correzioni sulla tecnica, programmazione base, ecc.\n\nNon cerco nulla di super professionale, solo qualcuno che magari ha già fatto un percorso simile e che ha voglia di condividere un po’ della sua esperienza. In cambio ci metto costanza, motivazione e impegno 💪\n\nMi alleno in zona vanchiglia.  \nSe qualcuno è interessato a darmi una mano, anche solo ogni tanto, mi farebbe davvero piacere!\n\nGrazie mille 🙏",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1na6ikz/trasformazione_fisica_palestra/"
    },
    {
        "id": "1na63x8",
        "author": "Individual_Brick8874",
        "title": "Un pub dove vedere la finale dell’US open?",
        "content": "Ciao!\nSto cercando un posto dove andare a vedere la finale domani sera, preferibilmente un bar/pub :)\n\nMi consigliereste un posto dove la mettono con certezza, o un sito da cui cercare?\n\nGrazie!\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1na63x8/un_pub_dove_vedere_la_finale_dellus_open/"
    },
    {
        "id": "1n9wgj6",
        "author": "Spiritual_Airport339",
        "title": "Jobs for international students in Turin?",
        "content": "Hi everyone,\nI’ll be moving to Turin soon as an international student. I’m wondering what kind of part-time jobs are available for students there.\n\nA few things about me:\n\nMy Italian is not very good yet, but I speak English fluently.\n\nI’ll be studying in Turin\nLooking for advice or experiences from other international students: What jobs are realistic to get? Any tips on where to apply or how to manage work + studies?\n\n\nThanks in advance!",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1n9wgj6/jobs_for_international_students_in_turin/"
    },
    {
        "id": "1n9vrxl",
        "author": "lulivo1",
        "title": "Dove mangiare a Torino e dintorni",
        "content": "Ciao a tutti! Avete consigli per dove mangiare e fare aperitivo con prezzi giusti a Torino? Ci vado la prossima settimana e passo qualche giorno nelle Langhe anche, e se avete  consigli per quella zona, gradirei molto!\n\n  \nGrazie mille!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n9vrxl/dove_mangiare_a_torino_e_dintorni/"
    },
    {
        "id": "1n9ogd6",
        "author": "KaleidoscopeAware179",
        "title": "Alphalab Audio a Torino",
        "content": "Il laboratorio più cool di Torino è tornato dalle ferie. \nRestauro e riparazione di strumenti musicali!\nVieni a trovarci il sabato dalle 10 alle 13 e dalle 14 alle 17, siamo in via Ciamarella 37.",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1n9ogd6/alphalab_audio_a_torino/"
    },
    {
        "id": "1n92fre",
        "author": "Professional_Deer365",
        "title": "Prima volta a Torino in macchina",
        "content": "È la prima volta che guido a Torino, qual'é il modo giusto per passare da un viale al controviale che va nel senso opposto?",
        "upvotes": 83,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/e0da45szxbnf1.png?auto=webp&amp;s=087549c838a564c366533cdfb5fadbdb66e6fccc"
        },
        "permalink": "/r/torino/comments/1n92fre/prima_volta_a_torino_in_macchina/"
    },
    {
        "id": "1n9ww8j",
        "author": "azzujess",
        "title": "help magistrale language technologies and digital humanities",
        "content": "mi hanno chiesto info su questa magistrale UNITO , per caso c'è qualcuno che ha fatto o sta facendo questa magistrale? o qualcuno che ha un link gruppo whatsapp?  chiedo per un amico !",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n9ww8j/help_magistrale_language_technologies_and_digital/"
    },
    {
        "id": "1na8hli",
        "author": "Puzzleheaded_Map9504",
        "title": "cerco amica per qualcosa",
        "content": "io ragazzo 18 anni torino centro",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1na8hli/cerco_amica_per_qualcosa/"
    },
    {
        "id": "1n9dyjw",
        "author": "WolfTop9764",
        "title": "Cerco amic* per avere un giro qui a Torino",
        "content": "Ciao a tutti, mi chiamo Chiara, sono nuova qui e mi piacerebbe crearmi un giro di amicizie, conoscere gente nuova. Sono a Torino da pochi mesi e tra lavoro e studi ho avuto poco tempo libero. Sono aperta e anche molto curiosa a nuove esperienze ma anche un po' timida! Mi piacciono le serate in giro, concertini, chiacchere, birretta e semplicità. Amo andare in bici, fare escursioni e anche il buon cibo. Se qualcuno è nella mia situazione o ha voglia di fare qualche esperienza io ci sono, scrivetemi pure :)   F, Età? 28 (ora piango)",
        "upvotes": 14,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1n9dyjw/cerco_amic_per_avere_un_giro_qui_a_torino/"
    },
    {
        "id": "1n9jk9n",
        "author": "letroz99",
        "title": "Giradischi",
        "content": "Help, mi si è rotto il giradischi, sapete dove posso portarlo ad aggiustare?\nPossibilmente a basso costo, non penso sia nulla di complesso, credo si sia leggermente staccata la parte in cui si posano i vinili per farli leggere (sono ignorante e non so come si chiamino i pezzi che compongono un giradischi)\nGrazie in anticipo!",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1n9jk9n/giradischi/"
    },
    {
        "id": "1n9188x",
        "author": "Lecco-rnie17",
        "title": "Balon e Gran Balon: sono ancora quelli di una volta?",
        "content": "Premetto: non sono di Torino, ma ci ho abitato per un annetto 14 anni fa. Mi piace scoprire pezzi vintage, quindi andavo spesso. Ci sono tornato quest'anno e, per quanto ancora apprezzi questo mercato rispetto ai mercati vintage nel resto dell'Italia, i prezzi mi sono sembrati non aumentati, di più, proprio schizzati in alto. Avete notato anche voi questa cosa? ",
        "upvotes": 27,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1y7g1jzrkbnf1.jpeg?auto=webp&amp;s=635b95d3e48c748990d3250275177d9e9fcf45e3"
        },
        "permalink": "/r/torino/comments/1n9188x/balon_e_gran_balon_sono_ancora_quelli_di_una_volta/"
    },
    {
        "id": "1n94xg1",
        "author": "MannyLove_s_You",
        "title": "Cercasi amic*",
        "content": "Il 13 settembre al ‘Magazzino sul Po’ (Murazzi) suona una band coreana che mi piace (chiamati Cotoba) e volevo sapere se ci sarà qualcuno della mia stessa età o se è possibile fare un gruppetto di persone con cui andare.\n\n\nIo sono una ragazza di 22 anni, studentessa, mi piacciono gli anime, l’arte, il true crime, la cultura asiatica e anche altro come cinema e musica e ascoltare le altre persone parlare dei propri interessi. Sono un po’ introversa ma spero davvero di poter fare amicizia con qualcuno❤️❤️\n\n\nPurtroppo i miei amici non ci saranno e l’ultima volta che sono andata ad un evento del genere da sola non me la sono passata molto bene.\nSe siete interessati al tipo di musica oppure se già pensavate di andare scrivetemi, ci scambiamo pure i profili insta se volete, magari possiamo anche berci un caffè un giorno o due prima per conoscerci.",
        "upvotes": 13,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1n94xg1/cercasi_amic/"
    },
    {
        "id": "1n956wr",
        "author": "Intelligent-Tart-287",
        "title": "Difficoltà a trovare casa a Torino come studente straniero",
        "content": "Ciao a tutti,\nquest’anno mi trasferirò a Torino per studiare e sto cercando un bilocale in affitto. Purtroppo sto avendo moltissime difficoltà: la maggior parte dei proprietari con cui ho parlato non vuole affittare a stranieri senza conoscermi di persona, e questo rende tutto molto complicato.\n\nSto cercando soprattutto in zona Crocetta o Centro, ma sarei aperto anche ad altre zone come San Donato. Idealmente cerco un appartamento ristrutturato, ma fino ad ora non ho avuto fortuna.\n\nHo anche provato a contattare diverse agenzie immobiliari, ma spesso non rispondono alle chiamate, oppure nessuno parla inglese e a volte mi riattaccano il telefono in faccia.\n\nVorrei chiedere a chi vive a Torino:\n\t•\tquali sono le agenzie immobiliari più affidabili e sicure che potrei contattare?\n\t•\tavete consigli pratici su come muovermi in questa situazione da straniero?\n\t•\tconoscete servizi di traduzione o mediatori che possano aiutarmi a comunicare meglio con i proprietari/agenzie?\n\nOgni consiglio è ben accetto. Grazie mille a chi risponderà! 🙏",
        "upvotes": 11,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1n956wr/difficoltà_a_trovare_casa_a_torino_come_studente/"
    },
    {
        "id": "1n93jtu",
        "author": "alexsimi",
        "title": "Quale app di Taxi",
        "content": "Devo prendere un taxi di sabato mattina per andare in centro (crocetta) ma non so quale sia più affidabile tra Wetaxi, Freenow e inTaxi.\n\nUber Black costa troppo.\n\nNon posso noleggiare auto/scooter/monopattini ecc. Neanche mezzi pubblici.\n\nGrazie!!",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1n93jtu/quale_app_di_taxi/"
    },
    {
        "id": "1n9ewum",
        "author": "Intelligent-Tart-287",
        "title": "Is Cenicia a Nice Zone?",
        "content": "Is Cenisia better than Crocetta or Centro in terms of safety, good environment and any other criteria you would have for a district? Please talk your thoughts. Grazie mille.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1n9ewum/is_cenicia_a_nice_zone/"
    },
    {
        "id": "1n8zyen",
        "author": "ale_bella",
        "title": "Rivoli per lavoro",
        "content": "Ciao a tutti! Scrivo qui perchè ho ricevuto una proposta di lavoro interessante a Rivoli che potrebbe portarmi a un trasferimento da Milano dove attualmente vivo e lavoro. L'unica cosa che mi blocca è che mi sembra una bellissima cittadina, ma forse un po' \"solitaria\" per una 30enne. Premetto che non amo Milano nè la vita mondana e preferirei mille volte vivere in una città più piccola e ricca di bellezza. Avevo anche valutato di vivere a Torino e spostarmi a Rivoli ma non essendo automunita è un tragitto piuttosto lungo, almeno finchè non verrà estesa la metro. A tal proposito: è credibile vederla finita entro il 2026?\n\nMi trasferirei sola, non ho amici che abitano a Torino, quindi sarebbe un ripartire da zero. Credete sia semplice farlo facendosi qualche amico e un po' di vita sociale?\n\nGrazie!",
        "upvotes": 7,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1n8zyen/rivoli_per_lavoro/"
    },
    {
        "id": "1n94o9n",
        "author": "katt12543",
        "title": "Favorite part about the city?",
        "content": "There are a lot of people here who talk about the worst parts, lots of complaints about traffic but what are your favorite places, things and parts about the city? What keeps you living here?",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1n94o9n/favorite_part_about_the_city/"
    },
    {
        "id": "1n9b78c",
        "author": "MatteoOnTheMove",
        "title": "Nuove conoscenze a Torino",
        "content": "Ciao a tutti! 🙋‍♂️\nSono un ragazzo di 25 anni appena rientrato a Torino dopo un po’ di tempo. Per varie vicissitudini personali non ho più molti contatti qui e mi piacerebbe crearne di nuovi.\n\nMi farebbe piacere conoscere persone con cui uscire la sera e magari organizzare qualche gita fuori porta o trekking nei weekend!\nAppassionato di viaggi e attività all’aria aperta, ma aperto a tutte le proposte.\n\nSe qualcuno è nella stessa situazione e ha voglia di unirsi, scrivetemi pure nei commenti o in DM.!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n9b78c/nuove_conoscenze_a_torino/"
    },
    {
        "id": "1n9aa3i",
        "author": "Similar_Profit_7298",
        "title": "In Bici da Caselle a Settimo",
        "content": "Salve, mi servirebbe un'aiuto su una situazione molto specifica, vorrei chiedere se fosse possibile raggiungere Settimo Cielo, in bici, partendo da Caselle/Borgaro, non parlo della lunghezza, dovrebbe essere mezz'oretta in piano, mi interessa, più che altro, sapere se il percorso sia pericoloso(brutte strade etc...) e nel caso, se qualcuno l'avesse già fatto.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1n9aa3i/in_bici_da_caselle_a_settimo/"
    },
    {
        "id": "1n97ybj",
        "author": "Esp3t0",
        "title": "Asking: Tips for a good shop to buy computer parts.",
        "content": "Buongiorno\n\nI am looking for a good shop to buy a case and a power supply to rebuild my computer.\n\nI found some places looking at google maps, but all of them seems more like they sell mounted PCs and notebooks.\n\nLooking on internet I found this site:\nhttps://www.computervalley.it/\n\nIs it a ok shop? Are the prices good? I have no idea what is a good price in euro.\n\nI need a case for a micro-ATX motherboard and a 650W gold power supply.\n\nP.S.: I dont know if in Italy have a service to check about the reputation of the place. In Brazil we have the \"Reclame Aqui\" that is a service that reunites complainings about places services and it gives notes to them. I always check it before using any service.",
        "upvotes": 1,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/efGiZW5OnVV5wgmWSNfJmCX4u2kCRCsK7RER2P8PtwI.png?auto=webp&amp;s=2c0fe3c04351b4753dda6f7196e57008f6629e3a"
        },
        "permalink": "/r/torino/comments/1n97ybj/asking_tips_for_a_good_shop_to_buy_computer_parts/"
    },
    {
        "id": "1n97cf2",
        "author": "RichDragonfly4181",
        "title": "CX studentati a Torino recensioni",
        "content": "per caso qualcuno ha delle opinioni da condividere riguardo all'alloggio in questi studentati? vi siete trovati bene ? pulizia spazi comuni? reception educata personale gentile? robe del genere grazie per l'aiuto",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1n97cf2/cx_studentati_a_torino_recensioni/"
    },
    {
        "id": "1n8zx3o",
        "author": "sol_asper",
        "title": "Esame Patente A da Privatista",
        "content": "Ciao a tutti, mi servirebbe un'informazione per l'esame pratico della patente A presso la Motorizzazione di Torino come privatista. Vorrei sapere se la Motorizzazione mette a disposizione una moto (con i requisiti corretti per l'esame) per i privatisti. Faccio questa domanda perché, per esempio, la Motorizzazione di Palermo mette a disposizione una moto per i privatisti.\n\nNel caso in cui non venga messa a disposizione una moto, conoscete qualche autoscuola che affitta solo la moto o qualche rental che affitta moto per gli esami?",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1n8zx3o/esame_patente_a_da_privatista/"
    },
    {
        "id": "1n8g6e5",
        "author": "KveldssangerM",
        "title": "Truffa soldi per benzina - Zona S. Rita",
        "content": "Ciao a tuttə,\nvolevo segnalare che, in zona Santa Rita, si aggira una ragazza(sulla 30ina) bionda, capelli corti, con occhiali, che ferma le persone per strada per chiedere soldi per la benzina, fingendo che il POS del benzinaio sia fuori uso.\nPromette di restituire i soldi immediatamente tramite bonifico/Satispay presentando e inviando la foto di pagamento effettuato, che però in realtà è una semplice ricerca sul sito Unicredit, all'interno della quale lei scrive \"Ricarica {numero} effettuata, {somma} €\"; poi vi gira un documento d'identità falso, dicendovi che per il pagamento ci vogliono 24h.\n\nCerca di distrarre con informazioni aggiuntive e credibili, per esempio a me ha detto che lavora da BojaFauss, con sede sia a Torino che ad Alba.\n\nLa carta di identità fornita è purtroppo a nome di un'altra persona, Roxana, che è anche il nome con cui questa truffatrice si presenta.\n\nI carabinieri sono a conoscenza sia della truffa che del nome della truffatrice da mesi ormai, hanno inviato al tribunale decine di denunce, ma dicono di avere le mani legate fino alla decisione del tribunale.\n\nFate attenzione, io sono stato preso in un momento di distrazione. È molto brava a fingere che sia in una situazione di reale bisogno (con me ha finto di chiamare la madre per rassicurarla che aveva risolto e che sarebbe tornata presto a casa).\n\n",
        "upvotes": 41,
        "comments": 31,
        "media": null,
        "permalink": "/r/torino/comments/1n8g6e5/truffa_soldi_per_benzina_zona_s_rita/"
    },
    {
        "id": "1n8ztqp",
        "author": "ohthanksobama",
        "title": "Baseball al Valentino",
        "content": "Qualcuno che ha voglia di fare 2 tiri di baseball al Valentino? Io ex giocatore semi professionista ma da almeno 10 anni fermo ;)",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n8ztqp/baseball_al_valentino/"
    },
    {
        "id": "1n92lx2",
        "author": "eddz_",
        "title": "Mi consigliate un'agenzia con cui potrei rivolgermi per cercare casa a Torino?",
        "content": "Buongiorno, io e un mio amico ci trasferiremo a Torino per continuare i nostri studi magistrali. Tuttavia, non conosciamo molte agenzie e la maggior parte sono delle truffe. Qualcuno può consigliarci un'agenzia a cui rivolgerci per quanto riguarda la ricerca di un alloggio? Potrebbe essere a Torino o nei dintorni, non ci interessa.\n\nGrazie!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1n92lx2/mi_consigliate_unagenzia_con_cui_potrei/"
    },
    {
        "id": "1n924xk",
        "author": "Ibrahimt51",
        "title": "Best way to go to Torino from. Malpensa airport.",
        "content": "Hi! I'm an international student coming to study at PoliTo, I'm going to arrive in Malpensa airport Terminal 1 on Ocotber 1st, the flight ticket says the plane should land at 13:30, I want to know what's the cheapest fastest way (direct trip if possible) to get to Turin from Malpensa airport terminal 1?\n\nWhat's confusing me the most is the timing, if I need to buy a train or bus ticket, then what's the appropriate departure time, or should I but ticket when I land in the airport and wouldn't that be more expensive than buying it in advance? ",
        "upvotes": 1,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1n924xk/best_way_to_go_to_torino_from_malpensa_airport/"
    },
    {
        "id": "1n91odh",
        "author": "Gu_Gu_Muck",
        "title": "Corsi di inglese",
        "content": "Ciao a tutti!\n\nSto cercando a Torino una qualche scuola che offra corsi di inglese, sono interessato a prendere una certificazione C1 dato che l’anno prossimo dovrei andare a studiare all’estero.\n\nConoscete scuole che preparano all’esame per la certificazione o che offrono la possibilità di sostenerlo direttamente da loro? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1n91odh/corsi_di_inglese/"
    },
    {
        "id": "1n8kttb",
        "author": "pietrosantoro13",
        "title": "Birra?",
        "content": "Ciao a tutti sono un ragazzo di 24 anni trasferitosi da pochissimo a Torino per lavoro. Chi si fa due chiacchere e una birra domani sera in zona San Salvario? Se siete simpatici la prima la offro io ",
        "upvotes": 10,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/w7cxdkbug7nf1.png?auto=webp&amp;s=6cad35284f524cccdbef69c950dae5c696d58c36"
        },
        "permalink": "/r/torino/comments/1n8kttb/birra/"
    },
    {
        "id": "1n8dmj5",
        "author": "Fit_Bake_6569",
        "title": "Che ne pensate di un listening bar a Torino?",
        "content": "Ciao a tutti,  \nsto ragionando su un’idea ancora molto preliminare e mi farebbe piacere avere un feedback schietto.\n\nIl concept è un **listening bar**: di giorno una caffetteria con colazioni semplici e genuine, senza fronzoli; la sera un cocktail bar con musica ascoltata da un buon impianto stereo.\n\nVorrei dare spazio anche allo **sport**: dalle partite di calcio, basket e tennis all’hockey su ghiaccio, NFL (un po’ in stile USA), insieme a un tocco di cultura skate e street. L’obiettivo è creare un posto dove ritrovarsi, bere qualcosa, ascoltare musica, guardare sport e stare insieme.\n\nSono ancora in fase di studio di costi, permessi e investimenti → quindi questo è solo uno “smoke test”.  \nSecondo voi, a Torino una cosa del genere potrebbe funzionare?  \nE se sì, **in quale zona ve lo immaginereste meglio**?\n\nGrazie a chi vorrà dire la sua!",
        "upvotes": 19,
        "comments": 32,
        "media": null,
        "permalink": "/r/torino/comments/1n8dmj5/che_ne_pensate_di_un_listening_bar_a_torino/"
    }
]