[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 7,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 161,
        "comments": 572,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1n3oyim",
        "author": "AnotherDarnDay",
        "title": "Unknown Number High-school Catfish",
        "content": "What the hell did I just watch? And what the hell was this person thinking?\n\nI'm in shock that someone would do such a thing to their own child. And that she doesn't seem to have any focus on what she actually did. \n\nThe daughter didn't seem to grasp what her mother did when they told her but the father acted on it right away. \n\nWas she totally jealous of her own daughter? ",
        "upvotes": 174,
        "comments": 287,
        "media": null,
        "permalink": "/r/netflix/comments/1n3oyim/unknown_number_highschool_catfish/"
    },
    {
        "id": "1n3og0r",
        "author": "Ok-You-5930",
        "title": "Unknown Number: What mental illness does Catfish Mom, Kendra Licari have? I have questions..",
        "content": "SPOILER ALERT: first, I’m really curious as to what mental illness Kendra Licari has. I have several family members with severe mental illness but I can’t figure this out… \n\nIt was so disturbing to learn what she did to her innocent daughter and her friends. But she was also obsessed with the boyfriend! And then we learn that she lied about having a job! And then we hear her skirt accountability blaming it on her trauma, and then we see how manipulative she is at every level. Like… I have questions. Weigh in on any:\n\n1. WTF did we just watch?\n2. What mentally illness do you think she has? And what makes you think that?\n3. Why was she fired?? We need a follow up on this. Sounds like Casey Anthony at Universal Studios..\n4. We’re all in agreement that she was obsessed with Owen right? \n5. HOW DID THIS PSYCHOPATH GET FREE IN 18 MONTHS?",
        "upvotes": 154,
        "comments": 260,
        "media": null,
        "permalink": "/r/netflix/comments/1n3og0r/unknown_number_what_mental_illness_does_catfish/"
    },
    {
        "id": "1n38enm",
        "author": "ADMlN-",
        "title": "What \"Unknown Number: The Highschool Catfish\" totally downplayed...",
        "content": "**Why did Kendra go after Owen's** ***new*** **girlfriend, a full year after he and Lauryn broke up?**\n\nThat isolated single detail proves this had absolutely nothing to do with protecting her daughter and everything to do with her own predatory obsession with Owen. Owen's mom tried to point it out, but they barely gave her a voice.\n\nIt feels like the real story was \"Predatory Mom Coach\" but decided \"Highschool Catfish Story\" was way more marketable. It's like they are deliberately downplaying the darkest part of this story and perpetuating Kendra's misdirection/manipulation.",
        "upvotes": 823,
        "comments": 909,
        "media": null,
        "permalink": "/r/netflix/comments/1n38enm/what_unknown_number_the_highschool_catfish/"
    },
    {
        "id": "1n3ajz4",
        "author": "unfiltered_12345",
        "title": "Need a thriller series to binge watch on Netflix",
        "content": "In desperate need of new series to watch, can't seem to stick to anything \nSo need a series that is dark, mysterious and very thrilling to watch.\nA series I cam binge watch in a day or over a few weeks.",
        "upvotes": 286,
        "comments": 493,
        "media": null,
        "permalink": "/r/netflix/comments/1n3ajz4/need_a_thriller_series_to_binge_watch_on_netflix/"
    },
    {
        "id": "1n3qylt",
        "author": "jcals17",
        "title": "Unknown Number: The High School Catfish",
        "content": "This story was insane, that was the last thing I expected. Rant incoming…\n\n\nIt really bothers me that her daughter Lauryn still had a relationship with her &amp; even a close one. \n\nShe didn’t just cyber bully her, she said disgusting things. She literally told her to OFF HERSELF. She broke up her daughter’s first relationship, she listened to her daughter cry, beg for it to stop, &amp; still did it. That’s sick, that’s not “that wasn’t me” “i dont know what i was doing”. She harassed her for almost TWO YEARS. You being assaulted does not excuse you to harass your daughter, it doesn’t even correlate. &amp; then to do it for almost 2 years. \n\nNot to mention her obsession with Owen, that’s disgusting &amp; predatory. She could have just called her daughter ugly, annoying blah blah but she said vulgar things about him. THATS WEIRD. I know this whole thing is weird but it’s even weirder that she was obsessed with him. \n\nI personally would never talk to my mother again. &amp; my mom is by best friend. You told me to off myself everyday multiple times a day. Then said “well I knew she wouldn’t do it”, I could never trust her again. \n\nLet me know your thoughts.",
        "upvotes": 31,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1n3qylt/unknown_number_the_high_school_catfish/"
    },
    {
        "id": "1n3w464",
        "author": "Cultural-Chart3023",
        "title": "Rewatching unknown number to see what I missed",
        "content": "1:23 from the very start the first red flag \"I just told her to ignore them\" what? The first time I watched it I did say wtf but let it go. Now I'm watching it again and already realise  that alone is weird af everyone else is taking it so seriously and worried about her and mums all \"oh well\".. \n\nThe signs were definitely there! ",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n3w464/rewatching_unknown_number_to_see_what_i_missed/"
    },
    {
        "id": "1n3mm53",
        "author": "L0v3_1s_War",
        "title": "“Golden” by HUNTR/X: EJAE, Audrey Nuna &amp; REI AMI is nominated for Song of the Summer at the 2025 MTV VMAs",
        "content": "",
        "upvotes": 12,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n3mm53/golden_by_huntrx_ejae_audrey_nuna_rei_ami_is/"
    },
    {
        "id": "1n3505s",
        "author": "Mysterious-Hold-2",
        "title": "Thumbs down to the new Netflix layout",
        "content": "I have let it sit for moment, given it a fair go, but I really don't like the new layout. It makes it harder to scroll through shows period.\n\nDo you need a TV the size of the Titanic wooden plank that saved Rose just to make it usable?",
        "upvotes": 84,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1n3505s/thumbs_down_to_the_new_netflix_layout/"
    },
    {
        "id": "1n3ut2s",
        "author": "RiderOfRohan_SQ",
        "title": "Living in two places and having one Netflix account?",
        "content": "I move states about twice a week (once to my work place for 3 days and then back), but not that regularly in holiday season and when I‘m jammed with work. So wherever I live I would love to have a Netflix account (even if just on mobile). But because of the forbidden account sharing and Netflix thinking I am some user from another household, my log in on my phone and other devices got blocked since I couldn’t log in in my home wifi in the required time period. \nAny advice what I could do?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n3ut2s/living_in_two_places_and_having_one_netflix/"
    },
    {
        "id": "1n3uell",
        "author": "stfujavii",
        "title": "Other types of dramas?",
        "content": "You watched three Korean dramas back to back, and now Netflix keeps recommending Korean dramas nonstop. I prefer period pieces and have probably seen everything Netflix offers in that genre. Any recommendations?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n3uell/other_types_of_dramas/"
    },
    {
        "id": "1n3u9oh",
        "author": "oak212",
        "title": "bonus family netflix",
        "content": "I am in the middle of season 4 and am enjoying Bonus Family very much.  So much happens in each episode that it is mind boggling.  Someone is always arguing with someone else, almost everyone is very opinionated and most are selfish. Clear communication with both of each child’s parents is often problematic.  It is a chaotic lifestyle.\n\nI am curious if others find the married therapist couple helpful or not.  It seems like the writers are mocking them and their therapeutic techniques.  With such a large family, I see the therapists seeing years of therapy costing their clients thousands of Kronor.  When Patrik had the serious incident in school and was distraught, he broke protocol and arrived at the therapists’ home without an appointment.  She was annoyed and couldn’t make an appointment sooner than his next scheduled appointment, which I found cold and insensitive.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n3u9oh/bonus_family_netflix/"
    },
    {
        "id": "1n3rsns",
        "author": "ishtar_888",
        "title": "No Spoilers Please - Echos 2022 Netflix twisty thriller where Michelle Monagan plays twins",
        "content": "Finally watching 2022 Netflix twisty thriller where Michelle Monagan plays twins Leni &amp; Gina and you never know who's who. 🤪 Soooo good. I don't think I'm biased because she's one of my favorite actors lol\n\nNot gonna do spoiler and give any of the plots away and ask please that no one else do. \n\nAlso has Matt Bomer as Jack, Daniel Sunjata as Charlie, Jonathan Tucker as Dylan James and Karen Robinson as Sheriff Louise Floss.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n3rsns/no_spoilers_please_echos_2022_netflix_twisty/"
    },
    {
        "id": "1n3a20t",
        "author": "exhaustedlittlething",
        "title": "Totally enjoyed The Thursday Murder Club movie. Any similar recommendations?",
        "content": "I just watched The Thursday Murder Club and loved it! Now I’m in the mood for more cozy-but-smart mystery stories. Do you have any suggestions for movies or series with a similar vibe (lighthearted mystery, witty characters, not too dark)? Doesn’t have to be on Netflix… open to any platform. Thank you! ",
        "upvotes": 31,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1n3a20t/totally_enjoyed_the_thursday_murder_club_movie/"
    },
    {
        "id": "1n3d3ti",
        "author": "Euphoric_Breakfast79",
        "title": "Netflix Announces Alice in Borderland Season 3 for September 25 Premiere",
        "content": "",
        "upvotes": 20,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n3d3ti/netflix_announces_alice_in_borderland_season_3/"
    },
    {
        "id": "1n3sznu",
        "author": "Math-Therapy",
        "title": "Old Guard 1 and 2",
        "content": "This storyline is really unusual and very fresh concept. Like I’m truly sold to the story as much as I was sold to Harry Potter.\n\nThe story writer and director have done a pretty good job. It’s a complex concept which they are trying to sell. It’s also a very American concept. I think creators should try and promote harder. \n\nI started with part 2 and then came back to watch part 1. It’s kinda funny because my first Harry Potter movies was also Chambers of secrets and then the Sorcerer’s stone. \n\nBut I genuinely hope there’s a part 3. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n3sznu/old_guard_1_and_2/"
    },
    {
        "id": "1n3d4l8",
        "author": "mekha-0608-matcha",
        "title": "Please recommend me some Netflix series with love in there",
        "content": "I ned some drama in my life\nSo i watched emily in paris, spinning out, ginny&amp;georgia, xo kitty, bridgerton, never have i ever, my life with the walter boys, nobody wants this and I don’t remember what else",
        "upvotes": 16,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1n3d4l8/please_recommend_me_some_netflix_series_with_love/"
    },
    {
        "id": "1n3rzlw",
        "author": "bigguys45s",
        "title": "Just curious, what anime series/ movies do you recommend/ suggest for a first time Netflix user?",
        "content": "I’m trying to get more into Japanese animation/ cinema just in general. Any suggestions or recommendations at all by any sort of chances? Maybe some like Studio Ghibli sort of stuff or even vintage/ older anime tv series/ shows/ movies at all?\n\nThanks again!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n3rzlw/just_curious_what_anime_series_movies_do_you/"
    },
    {
        "id": "1n3vn8g",
        "author": "689Dementia",
        "title": "The person guilty in Unknown Player: The High School Catfish had plenty of time in prison to craft their pathetic narrative",
        "content": "had all the time in the world to think, to manipulate their version of events, and presenting the story as a victim. So Gross.. Real people were traumatized. And now that person is using that pathetic narrative to gain empathy and attention??? wow",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n3vn8g/the_person_guilty_in_unknown_player_the_high/"
    },
    {
        "id": "1n3c3xm",
        "author": "Low_Independent_6204",
        "title": "PSA: younger",
        "content": "idk how i (f 36) slept on 7 seasons of this! no one told me it was sutton foster and hilary duff? and yes it’s not *amazing tv* but it’s different and a little edgy n silly. and i love a bingeable watch. ",
        "upvotes": 14,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1n3c3xm/psa_younger/"
    },
    {
        "id": "1n3s32r",
        "author": "IllustriousTalk4524",
        "title": "Trouble creating new netflix account",
        "content": "So netflix won't let me use my previous email since it was set up in my families home in south africa. I live in wuhan now and would like to make a new membership with a different email. I tried to do so online but it won't send the message to my phone as I have a chinese cellphone number. I tried putting in my email address on my phone but it keeps refreshing. Its such a headache.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n3s32r/trouble_creating_new_netflix_account/"
    },
    {
        "id": "1n3rf94",
        "author": "FitContext2888",
        "title": "Netflix search is horrible! (recommendations)",
        "content": "Netflix seems to show me the same 20 movies and series again and again and again. I know from other people’s account that there is other content there that I would like to see. Not something I’ve saved 3 years ago!\n\n/rant over\n\nIs there a website that has the full Netflix catalog that’s searchable but also can filter by geo restriction?\n\nSomething like UnoGs but that has Indonesia.\n\nThanks \n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n3rf94/netflix_search_is_horrible_recommendations/"
    },
    {
        "id": "1n3qxwy",
        "author": "Spocksangel",
        "title": "Five nights at Freddy’s",
        "content": "If you want to watch five nights at Freddy’s on Netflix in the us unfortunately it is not available and it is not clear when it is coming out on the states end .  I was really hoping to see it ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n3qxwy/five_nights_at_freddys/"
    },
    {
        "id": "1n2q9f9",
        "author": "BrettJoz",
        "title": "We’re getting another series based on a serial killer apart of the Monster series.",
        "content": "As a huge fan of the Monster Series, I’m glad they’re making another one based on Ed Gein.\n\nFor those who don’t know who Ed Gein is, he’s a serial killer who would skin his victims &amp; wear their skin as a mask. \n\nFun fact: Leatherface is actually based on Ed Gein",
        "upvotes": 186,
        "comments": 113,
        "media": null,
        "permalink": "/r/netflix/comments/1n2q9f9/were_getting_another_series_based_on_a_serial/"
    },
    {
        "id": "1n3io8t",
        "author": "Personal-Visual-3283",
        "title": "Race Across the World vs The Amazing Race",
        "content": "I’m in the UK and noticed that Race Across the World has just been added to Netflix. I have previously watched The Amazing Race and while the concept is similar, the production and vibe feels very different to me. I wondered how Race across the world was being received by those who hadn’t seen it before compared to The Amazing Race! It feels less dramatic to me (in a good way) but would be interested in the thoughts of others! ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n3io8t/race_across_the_world_vs_the_amazing_race/"
    },
    {
        "id": "1n3ltyp",
        "author": "chocolateturtle456",
        "title": "Casting Live Streams",
        "content": "Why can't I use my chrome cast to stream live events like the boxing or the WWE events from the app on my phone to my TV?\n\nIt's how I watch almost all of the sports I watch on different platforms.\n\nYou can't even do it once the event is over, it just seems stupid to me that they won't allow it.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n3ltyp/casting_live_streams/"
    },
    {
        "id": "1n3qxg7",
        "author": "Outrageous-Stop-1693",
        "title": "Jackie does not do well with grief...",
        "content": "When is Jackie actually gonna process her family's death?? She's doing everything else BUT crying, I hope they don't make the grief just slowly fade away instead of her actually facing it before she decides between Cole and Alex ",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1n3qxg7/jackie_does_not_do_well_with_grief/"
    },
    {
        "id": "1n360d6",
        "author": "Special_Country228",
        "title": "My Life With The Walter Boys SEASON 2 Every SONG",
        "content": "Hi All, I made a playlist with every song from the 2nd season, following the order of the episodes. I hope you like it! :)  \n[https://open.spotify.com/playlist/5bS3Df0J5zKofhHkVUK2yF?si=08b11f588e8c44c5](https://open.spotify.com/playlist/5bS3Df0J5zKofhHkVUK2yF?si=08b11f588e8c44c5)",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n360d6/my_life_with_the_walter_boys_season_2_every_song/"
    },
    {
        "id": "1n3f08e",
        "author": "Matthew0615",
        "title": "Poor quality on PC",
        "content": "Hello, I have known for years that Netflix on PC offers poor quality, with films that should be in full HD barely reaching 720p. I wonder if any of you know why this is? Or how to fix it?\n\n\n\nP.S.\n\nIf you're wondering how I know the exact quality of the movie when I watch it, it's thanks to the command ctrl+alt+shift+d.",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1n3f08e/poor_quality_on_pc/"
    },
    {
        "id": "1n3c1bo",
        "author": "MysteriousDelay6266",
        "title": "French Lover | Official Trailer | Netflix | SEPTEMBER 26",
        "content": "# FRENCH LOVER\n\n**September 26 only on Netflix.**\n\nWhen a jaded actor meets a down-on-her-luck waitress in Paris, their unexpected love story begins — but will it survive the glare of the spotlight?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n3c1bo/french_lover_official_trailer_netflix_september_26/"
    },
    {
        "id": "1n2x7ts",
        "author": "BlahblahblahLG",
        "title": "Why was the Gabby Petito Story removed from Netflix?",
        "content": "Does anyone know?\n\nI was watching it and had to pause and do something then when I came back to finish it, it had been removed!! I tried to Google what happened, but haven't found anything about it. Does anyone know? ",
        "upvotes": 9,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1n2x7ts/why_was_the_gabby_petito_story_removed_from/"
    }
]