[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 496,
        "comments": 261,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1iswm3v",
        "author": "lovethats",
        "title": "Gabby Petito Doc",
        "content": "Watching Brian’s parents “search” for Brian made my blood boil. A quote from the FBI said “they did not emote.” Of course they didn’t. They knew where to pretend to look the entire time. \n\nYou’re telling me he was within a mile of the car the entire time and his parents show up to look one day and they find his remains the same day. \n\nThen Brian says in his suicide note that Gabby “begged for an ending to her pain” and he thought it was “merciful.” \n\nI have never felt a level of anger at a family in my life. I hope the entire Laundrie family pays for what they did.\n\nThis is so sickening. ",
        "upvotes": 356,
        "comments": 120,
        "media": null,
        "permalink": "/r/netflix/comments/1iswm3v/gabby_petito_doc/"
    },
    {
        "id": "1isz6fc",
        "author": "Jumpy_Whereas181",
        "title": "How will Netflix recover from most of its flagship series ending?! (2026 and beyond)",
        "content": "I don’t think Netflix will be able to ever capture the success of Stranger Things or Squid games or any of its other bigger  series ending. So what’s next for Netflix? Can they ever reach this peak again? ",
        "upvotes": 39,
        "comments": 72,
        "media": null,
        "permalink": "/r/netflix/comments/1isz6fc/how_will_netflix_recover_from_most_of_its/"
    },
    {
        "id": "1it96ui",
        "author": "TheMirrorUS",
        "title": "Brian Laundrie’s parents shunned by Florida community over Gabby Petito’s murder following Netflix docuseries",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1it96ui/brian_laundries_parents_shunned_by_florida/"
    },
    {
        "id": "1isxyug",
        "author": "crazycrazybeanz",
        "title": "Gabby Petito Documentary",
        "content": "Did anyone think it was odd how, in the 3rd episode of the documentary, the Petito family spread Gabby’s ashes at the place where she was found dead? It caught me off guard since I feel like most people who are murdered wouldn’t want their ashes to be spread in the park where they were killed.",
        "upvotes": 28,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1isxyug/gabby_petito_documentary/"
    },
    {
        "id": "1isewv3",
        "author": "MassiveDexterFanGirl",
        "title": "The Laundrie Family are THE worst!",
        "content": "The way they just batted off the police and gave no cooperation at all, nothing to ease the minds of the Petito Family, it's disgusting! \nThey should be charged with perverting the course of justice! ",
        "upvotes": 297,
        "comments": 112,
        "media": null,
        "permalink": "/r/netflix/comments/1isewv3/the_laundrie_family_are_the_worst/"
    },
    {
        "id": "1isha22",
        "author": "tekavi23",
        "title": "Just Finished : Gabby Petito and I have so many questions",
        "content": "\n- POS killed her &amp; then stole her money to drive home\n\nLegally speaking : \n\n- when she went missing &amp; Brian had her van in Florida, couldn’t cops pressure him to answer questions since he had a van he didn’t own ?! \n\n- after the body was found &amp; there was a FBI wanted for Brian, couldn’t by law the parents be forced to speak ?\n- after Brian went “misssing” &amp; FBI searched the entire area …. The parents went and “found him” within the hour.\n- couldn’t the parents be criminally charged for aiding a murder?!\n ",
        "upvotes": 210,
        "comments": 200,
        "media": null,
        "permalink": "/r/netflix/comments/1isha22/just_finished_gabby_petito_and_i_have_so_many/"
    },
    {
        "id": "1iswkri",
        "author": "CoconutEast3651",
        "title": "how come peninsula got taken down?",
        "content": "A couple months back, I noticed that Peninsula (sequel to train to Busan) was on the list of movies that was going to be released on February 11, 2025 but I noticed that it's no longer on the list and is not anywhere on Netflix. Why did they not release it? I was kind of excited to watch it tbh.. ",
        "upvotes": 9,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1iswkri/how_come_peninsula_got_taken_down/"
    },
    {
        "id": "1it9dqu",
        "author": "infinityofpearls",
        "title": "Black Warrant TV vs Book! What are the key differences?",
        "content": "I know that the pacing in the book is much faster since it is only 178 pages. But what other significant changes have been made in the series's portrayal of Tihar?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1it9dqu/black_warrant_tv_vs_book_what_are_the_key/"
    },
    {
        "id": "1it8r5t",
        "author": "Powerful-Gain-2641",
        "title": "Looking for Recent Psychological Thrillers/Mysteries",
        "content": "I’m looking for some good psychological thriller or mystery movies/limited series from the last 10 years. I enjoy stories that:\n\n* Have a dark, suspenseful atmosphere\n* Keep me hooked from the very beginning\n* Feature twisted plots with mind games, secrets, or hidden motives\n* Have a serious, realistic tone (no supernatural, sci-fi, or comedy)\n\nSome thrillers I really liked are *Gone Girl*, *Fractured*, *Orphan*, *Copycat*, *Don't Breathe*, *Behind Her Eyes*, and *Hush*. I’d love to find more recent ones with the same kind of tension and mystery.\n\nWould appreciate any recommendations. Thanks!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1it8r5t/looking_for_recent_psychological/"
    },
    {
        "id": "1it876a",
        "author": "Paranoir89",
        "title": "American Murder: Gabby Petito- “Brian and Gabby’s Friend”",
        "content": "I watched the documentary in full and there’s so much to say, but I’ve honestly found other posts on it as well. \n\nOne thing I can’t seem to find is about their “friend” with the black hair.\n\nSomething about her feels off to me? I understand maybe nerves, and obviously she had known them prior to this happening.\n\nBut I don’t know, the energy she gives me is that she actually had feelings for Brian but was embarrassed about it, so she pushed it away, and wasn’t actually friends with Gabby, or was jealous of her. There’s times where she seems normal talking about them, like the engagement, but then other times not so much.\n\nIt doesn’t sit right with me that she’s in this documentary about him killing Gabby, and she’s yapping about Brian saying the friend thing or being the love of his life, and the bluebird text. She smiles a lot when talking about him, and then when she talks about him playing guitar for Gabby and “how could I be so blind?” Gives me the feeling he didn’t tell her about Gabby until they found out and she thought he was her lover boy-regardless if they were dating or not.\n\nShe isn’t actually crying at the end.\n\nIdk. I always think I’m reading too much into something and then something comes out and I’m like “I KNEW IT”, lol.\n\nI’m not even sure what this means, I guess I wonder if she knows more than she’s letting on? Gabby had reached out to her ex, and if I know anything about abusive bf’s, they’ll come back around to old “loves” to get an ego boost. Makes me wonder if he ever reached out to her when he and Gabby were fighting, or after Gabby’s death. She seems like she had that relationship with him. \n\nDid anyone else get this vibe from her or am I nuts?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1it876a/american_murder_gabby_petito_brian_and_gabbys/"
    },
    {
        "id": "1isw9hf",
        "author": "Squid1996",
        "title": "How I made this retro Netflix animation!",
        "content": "",
        "upvotes": 7,
        "comments": 4,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/pneygrd8q0ke1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1isw9hf/how_i_made_this_retro_netflix_animation/"
    },
    {
        "id": "1it5do6",
        "author": "spring_illust",
        "title": "Reagan FanArt",
        "content": "Netflix, give me the third season of Inside Job. \n\nJust wanted to do some anatomy studies and the reference came with the scythe, so maybe Reagan can threaten Netflix with this.\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1it5do6/reagan_fanart/"
    },
    {
        "id": "1iso5az",
        "author": "Apprehensive_Sign_93",
        "title": "Is one piece USA leaving?",
        "content": "I just noticed that one piece in the earlier seasons is leaving Netflix. I have acreenshots, they are in dutch but you should be able to understand them. It says final day is february 19th, Ig I can't complete the series now.",
        "upvotes": 17,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1iso5az/is_one_piece_usa_leaving/"
    },
    {
        "id": "1is0q3j",
        "author": "bluntprincess99",
        "title": "TW (Spoilers) How angry are you after seeing the American Murder: Gabby Petito ?",
        "content": "True crime documentaries usually anger us, but this angered me like no other. \n\nSpoilers\n\n\n\n\n\n\nThe man lied in his suicide letter. \nThe parents helped him cover up a murder. \n\nI mean how can people be this cruel and sociopathic. ",
        "upvotes": 433,
        "comments": 224,
        "media": null,
        "permalink": "/r/netflix/comments/1is0q3j/tw_spoilers_how_angry_are_you_after_seeing_the/"
    },
    {
        "id": "1it2qke",
        "author": "JalapenoMan999",
        "title": "I have a 175hz monitor, should I turn it down to 120hz?",
        "content": "All the content I watch on netflix on PC (I use chrome) is mastered in 24 fps, should I turn my monitor down from 180hz to 120hz when I go to watch stuff? \n\nI feel like I can feel a difference in frame pacing, but I honestly have no idea. Sometimes at 175hz, though, I feel like something is wrong with what I'm watching. Like it's different to my TV downstairs somehow. \n\nDoes changing my monitors refresh rate do anything? \n\nThanks",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1it2qke/i_have_a_175hz_monitor_should_i_turn_it_down_to/"
    },
    {
        "id": "1isbbfo",
        "author": "Josomie",
        "title": "Animated Squid Game Gi-hun in stop motion",
        "content": "",
        "upvotes": 26,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/jlc94w513wje1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1isbbfo/animated_squid_game_gihun_in_stop_motion/"
    },
    {
        "id": "1is9ql4",
        "author": "doofuzzle",
        "title": "Which Netflix animated series is surprisingly good?",
        "content": "For me, BoJack Horseman is the standout. I started watching it because I thought it would just be a silly animated show, but it turned out to be deep, emotional, and incredibly well-written, tackling tough topics like depression, addiction, and self-worth with humor and heart.",
        "upvotes": 33,
        "comments": 71,
        "media": null,
        "permalink": "/r/netflix/comments/1is9ql4/which_netflix_animated_series_is_surprisingly_good/"
    },
    {
        "id": "1isxnp4",
        "author": "fractal_coyote",
        "title": "Big Ugly - what an amazing cast!",
        "content": "A revenge flick starring \"Ron Perlman, Malcolm McDowell, Vinnie Jones, and Bruce McGill?!\"\n\nThis film is basically a Guy Ritchie film in the deep south of the USA - without needing Guy Ritchie. So fun!\n\nDefinitely not a geezer teaser this movie ruled.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1isxnp4/big_ugly_what_an_amazing_cast/"
    },
    {
        "id": "1isnqc8",
        "author": "Week-Stock",
        "title": "American Primeval: What is the name of poem recited by Devin?",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1isnqc8/american_primeval_what_is_the_name_of_poem/"
    },
    {
        "id": "1isndd1",
        "author": "indiewire",
        "title": "The 25 Best Rom-Coms on Netflix: ‘Notting Hill,’ ‘No Hard Feelings,’ and More",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1isndd1/the_25_best_romcoms_on_netflix_notting_hill_no/"
    },
    {
        "id": "1iscj20",
        "author": "dailystar_news",
        "title": "Netflix details how Gabby Petito trip of lifetime turned into double death hell",
        "content": "",
        "upvotes": 14,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iscj20/netflix_details_how_gabby_petito_trip_of_lifetime/"
    },
    {
        "id": "1it8q1y",
        "author": "Ipax88",
        "title": "I feels that nf originals often has gay scenes, do you see it too?",
        "content": "Don't ask me in which movies, because I already forgotten by now. ;)\n\nAnd this is not a matter of me supporting LGBT or not guys, this just asking out of curiosity...",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1it8q1y/i_feels_that_nf_originals_often_has_gay_scenes_do/"
    },
    {
        "id": "1it0qn7",
        "author": "high_hope707",
        "title": "\"Fall in Heroine\" YouTube - Lesbian reality show",
        "content": "[https://www.youtube.com/watch?v=4RJG0vvsUe4](https://www.youtube.com/watch?v=4RJG0vvsUe4)  \nFour Days, Three Nights: Nine Strangers, All Lesbian, One Wild Adventure!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1it0qn7/fall_in_heroine_youtube_lesbian_reality_show/"
    },
    {
        "id": "1isufcy",
        "author": "Traditional_End2977",
        "title": "Ruined my own experience thinking I guessed the \"twist\"",
        "content": "I'm curious if any other movie fans have done this\n\nI recently watched \"Missing\" on Netflix and kinda ruined my own experience of the movie thinking I knew better.. \n\nI've watched countless thrillers for decades to the extent where I'm annoyingly able to see the twist coming very early in movies. \n\nWell in Missing I thought I clocked a 'subtle' throwaway line in the first few miniutes that the \"babysitter\" would be the villian. I assumed it was lazy writing that would be a \"gotcha moment\" near the end - (It happens alot in these types of movies)\n\nI proceeded to roll my eyes for a large part of the movie thinking how predictable it was, only to see I was completely wrong and the movie was smarter than I gave it credit for!\n\nAnyone else do this before? I feel like it's a product of watching so many movies and getting used to seeing the same predictable patterns made over and over\n\nI'm glad I was wrong and a little annoyed that I soured my owners experience. I love movies and hate when they go exactly where you think they will! ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1isufcy/ruined_my_own_experience_thinking_i_guessed_the/"
    },
    {
        "id": "1iryv1b",
        "author": "Turtleballoon123",
        "title": "Started Baby Reindeer. It's brtutal and depressing yet compelling.",
        "content": "I don't know what to make of the show. It's brilliant, yet also brutal and depressing. Episode 4 is heart-wrenching. I've seen discussions from survivors who say the show can be triggering or who had to switch it off. I really feel for the series creator who based this off a story. It's so fucked up.",
        "upvotes": 128,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1iryv1b/started_baby_reindeer_its_brtutal_and_depressing/"
    },
    {
        "id": "1it4lqc",
        "author": "uniladnews",
        "title": "Family of Gabby Petito make heartbreaking admission following release of Netflix documentary about her death",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1it4lqc/family_of_gabby_petito_make_heartbreaking/"
    },
    {
        "id": "1isc2ag",
        "author": "Moonlightbeaming",
        "title": "American Murder: Gabby Petito + The Family Next Door",
        "content": "After watching both of these documentaries it's so eerieing the similarities of these two cases.\n\nTo start off: Both Gabby and Shannan had the same similarities of posting the \"happy life\" to social media. \n\nThe families are also similar as well.\nWith Chris Watts his family was the same narcissistic way as their son. Especially the mother. Blaming Shannan for everything. With Gabby, Brian’s mom is also narcissistic. In the same aspect as Brian. Both sons were narcissistic same as their mothers. \n\nThe body cams/story. In both body cams both Brian and Chris have that same smiley expression. They also both blamed the other party on wrong doing. Brian convinced the cops that Gabby was also being the aggressor. With Chris during the start he blamed Shannan stating they were fighting and she could of left with the kids. Also made the story convincing by her \"leaving the ring behind.\" During the interrogation Chris also claimed Shannan was choking one of the daughters and that's what \"made him\" kill Shannan.\n\nI just wanted to state this information because I started noticing the similarities when I saw the Brian body cam happened on August 12 2021. Chris murdered his family August 13 2018. \n\nIf there is anything else that is worth sharing please comment below! I'm sure there is a lot more similarities than my findings! ",
        "upvotes": 9,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1isc2ag/american_murder_gabby_petito_the_family_next_door/"
    },
    {
        "id": "1isxpnv",
        "author": "Butterleg",
        "title": "Standard HD only displaying in 720 quality?",
        "content": "I bought the standard plan, cuz it said it'd play videos at 1080p \n\nBut when I tried watching Far From Home, it's fixed at a lower res?\n\nYes, I changed playback settings to High, even the thingy that caps the amount of data you use: changed it to Maximum Data. My wifi is sitting at 60-80mbps\n\nSo what's the problem\n\n",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1isxpnv/standard_hd_only_displaying_in_720_quality/"
    },
    {
        "id": "1ismw1g",
        "author": "DUCKlloovvaa1497",
        "title": "Good apocalypse movie",
        "content": "I like movies about a group of people trying to survive the apocalypse especially if it’s zombies, I just finished watching day break and that was great. If anybody knows and good apacolypse tv-series’s or shows similar to daybreak please leave it in the reply’s.",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ismw1g/good_apocalypse_movie/"
    },
    {
        "id": "1irzxha",
        "author": "yercoolmarple",
        "title": "The character Rose in The Night Agent is insufferable at this point.",
        "content": "I just have to get this off my chest, even at the risk of getting massively downvoted, this character is so poorly written. She changes her mind ten times in a single episode and is excessively annoying. The story itself is dull and weak overall with no character developments, but I could live with that if it weren’t for ***this*** one character being forcefully inserted into every situation. It made sense in Season 1 since the story revolved around her, but in Season 2? Even FBI agents are unaware of Night Action, yet somehow, this civilian is deeply involved in everything??seriously? If the writers were so intent on keeping her relevant, why not just hire her as a tech? Instead, they throw a civilian into the field like it’s nothing. To top it all off, the actor really cannot act. It was really difficult to finish season 2. I am not even getting to the other issues like poor writting, countlessly irritating character arcs.. S1 was not the greatest but it felt like this had some promise going forward and boy, oh boy, was I wrong.",
        "upvotes": 78,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1irzxha/the_character_rose_in_the_night_agent_is/"
    }
]