[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 7,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 157,
        "comments": 563,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1n20z4c",
        "author": "A-Dog22",
        "title": "Sony sold Netflix the rights to ‘KPop Demon Hunters’ in a pandemic-era safety play—and now it’s Netflix’s biggest movie ever",
        "content": "",
        "upvotes": 201,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1n20z4c/sony_sold_netflix_the_rights_to_kpop_demon/"
    },
    {
        "id": "1n226i0",
        "author": "Street_Firefighter_7",
        "title": "The gabby petito story was removed off Netflix",
        "content": "I noticed that the movie is now removed after only being on the platform for less than 24 hrs. I paused it and came back to watch it and now it’s gone and I’m even getting errors whenever I click on the Netflix link for the movie. Anyone know why it was removed? ",
        "upvotes": 159,
        "comments": 109,
        "media": null,
        "permalink": "/r/netflix/comments/1n226i0/the_gabby_petito_story_was_removed_off_netflix/"
    },
    {
        "id": "1n2ar5g",
        "author": "FlareGamer64",
        "title": "Series recommendations with episodes that are specifically 20-35 minutes long?",
        "content": "Most shows I've watched on Netflix are 40-50 minutes long (Breaking Bad, Better Call Saul, Resident Alien, Untamed) which is fine but sometimes I need something a bit shorter before I go out. The Thin Blue Line has been perfect for this purpose but I'm almost done with it. I don't care if it's a drama or a animated show, just give me those recommendations.",
        "upvotes": 25,
        "comments": 98,
        "media": null,
        "permalink": "/r/netflix/comments/1n2ar5g/series_recommendations_with_episodes_that_are/"
    },
    {
        "id": "1n28v3l",
        "author": "nemopost",
        "title": "Have 20 or so years I have downgraded my Netflix plan.",
        "content": "I went from the top tier 4k plan to 1080p with commercials.  We watch netflix less now and don’t see a reason why we should be paying $30 for one service when we used to pay $50 for many back in the day on cable tv.  Now I hear the prices are going up again.  Something had to give. The new shows are less intriguing than they were, its just not worth it anymore. ",
        "upvotes": 15,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1n28v3l/have_20_or_so_years_i_have_downgraded_my_netflix/"
    },
    {
        "id": "1n1t6ji",
        "author": "AztecTimber",
        "title": "I love foreign language shows and here are my favorites",
        "content": "Do you have any to add? I am particularly interested in German shows because I think it helps me speak it just a bit better. Plus I love the euro city settings. ",
        "upvotes": 99,
        "comments": 58,
        "media": null,
        "permalink": "/r/netflix/comments/1n1t6ji/i_love_foreign_language_shows_and_here_are_my/"
    },
    {
        "id": "1n2dmco",
        "author": "intelerks",
        "title": "Netflix’s 'Monster' dives into Ed Gein’s gruesome legacy with Charlie Hunnam in lead",
        "content": "",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n2dmco/netflixs_monster_dives_into_ed_geins_gruesome/"
    },
    {
        "id": "1n2dend",
        "author": "fergrim85",
        "title": "Million Dollar Secret - i know I'm a bit behind the times here, but did anyone else notice Cara's clearly fabricated claims about her father's illness?",
        "content": "She claimed he had \"lymphoma, melanoma and leukemia\" which is nearly a statistical impossibility. (it's not impossible but the odds are astronomically low)\n\nAnd I mean, that's fine, the show is about lying liars who are lying.  But what made it bizarre is it wasn't something she talked about with fellow contestants, but in confessionals, \n\nAnd what made it even stranger to me is that the edit never keyed in on the magnitude of that particular lie.\n\nLying about a family member having a life threatening illness is tasteless and arguably immoral, but lying about it in such an exaggerated fashion is...a sign of severe issues working things out with reality.  It's the sort of thing someone with schizophrenia might say.\n\nAnyway I was just surprised not to see a single mini article mention it, or to see anyone mention it in the breakdown threads after her win.  Given it was such a gimme and an obvious WTF moment as she said it.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n2dend/million_dollar_secret_i_know_im_a_bit_behind_the/"
    },
    {
        "id": "1n292d8",
        "author": "BossJosh74",
        "title": "Thursday Murder Club is great!",
        "content": "I dont want to rush through the series of books, but Chris Columbus, this cast, this crew, during Christmas would be absolutely CINEMA. netflix plz more.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n292d8/thursday_murder_club_is_great/"
    },
    {
        "id": "1n2h6o9",
        "author": "Ok-Box9760",
        "title": "First Netflix content filtering browser extension",
        "content": "Hi.\n\nI built the first Netflix content filtering browser extension that allows you to filter content you have watched or rated on Netflix.\n\nI am currently in the testing phase of the extension and I invite you to join the testing group. Once you join the group the download link will be active.\n\nCurrently the first version is unstable but I will soon release a much more stable version 0.2\n\nhttps://groups.google.com/g/advanced-netflix-filter?pli=1",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n2h6o9/first_netflix_content_filtering_browser_extension/"
    },
    {
        "id": "1n2fba6",
        "author": "Coolme_pro",
        "title": "Netflix profile icons",
        "content": "hi, is there any way to remove the profile icons from my history? some of the pictures are lowk bad to look at because my sibling was trying to disturb me 😭 \n\nalso, does that affect the algorithm of profile icons recommended to me?\n\nfinally, I noticed that every profile has different icons, what should I do if I want a certain one (e.g. arcane) but I don't have it in my options ? (it's available on my other family member's account)\n\nthank you in advance:)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n2fba6/netflix_profile_icons/"
    },
    {
        "id": "1n2f1oq",
        "author": "potassiumnadilaw",
        "title": "Any good architecture stuff on Netflix?",
        "content": "Can you recommend some architecture-related shows on Netflix that are worth watching for someone in the field? Whether it’s a reality show, documentary, movie, or series, I’m open to anything. I just want to widen my perception of architecture.\n\nThanks in advanceee!",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1n2f1oq/any_good_architecture_stuff_on_netflix/"
    },
    {
        "id": "1n2e0iq",
        "author": "keepitwildinwyo",
        "title": "Movie night for kids ages 4-9",
        "content": "I’m hosting a popcorn, pizza, and movie night at my house and want to have a fun movie for both groups, but maybe not something they’ve seen or popular at the moment. Any ideas/recs? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n2e0iq/movie_night_for_kids_ages_49/"
    },
    {
        "id": "1n1krle",
        "author": "Glum_Reputation_9845",
        "title": "Rewatching The Social Dilemma and realizing it wasn’t even the half of it",
        "content": "When I first saw it, I thought it was shocking that apps manipulate us with notifications and algorithms. But the more I’ve learned since then, the scarier part isn’t just the manipulation and it's all about the data that's everywhere.  \n  \nYour phone number, your email, even your address history  all of it is floating around. The Social Dilemma scratched the surface because I feel it's much scarier real life. (that thing about what google knows about you is actually terrifying). I can’t help but think a real sequel would be less about screen addiction and more about how our entire identities are already being bought and sold in the background.  \n  \nHas anyone else felt that paranoia spike after realizing the real problem isn’t the apps on your phone, it’s the invisible network of companies that already own your information?",
        "upvotes": 63,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1n1krle/rewatching_the_social_dilemma_and_realizing_it/"
    },
    {
        "id": "1n25oao",
        "author": "St3lla_0nR3dd1t",
        "title": "Does the Netflix algorithm suit you or do you have to search for good tv",
        "content": "https://www.theguardian.com/media/2025/aug/28/bland-easy-to-follow-for-fans-of-everything-what-has-the-netflix-algorithm-done-to-our-films\n\nIs it just me but do you get the feeling that Netflix films are not challenging enough and produced to a quota rather than to quality. \n\nWould you pay more for better films?",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1n25oao/does_the_netflix_algorithm_suit_you_or_do_you/"
    },
    {
        "id": "1n2bhd8",
        "author": "blueberrman2",
        "title": "How do I disable netflix showing what I watch to other users?",
        "content": "My family has the basic netflix plan, where you can only watch from one device at a time, and if there's someone already watching and you try to watch something, it displays who is watching at that time, on what device they're watching on, and what they're watching. Is there a way to turn this off?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1n2bhd8/how_do_i_disable_netflix_showing_what_i_watch_to/"
    },
    {
        "id": "1n10zec",
        "author": "AverageCowboyCentaur",
        "title": "Anyone else having trouble navigating Netflix?",
        "content": "some shows work and some shows don't even load the episode grid. It's like they play from the preview. The whole service just seems to be melting down and degrading. anybody else?",
        "upvotes": 1017,
        "comments": 790,
        "media": null,
        "permalink": "/r/netflix/comments/1n10zec/anyone_else_having_trouble_navigating_netflix/"
    },
    {
        "id": "1n1to7o",
        "author": "PerformerAlert4654",
        "title": "Please help me find this Netflix series that was canceled",
        "content": "All I can remember is that there was three main characters and it was under the fantasy genre. It was two boys and a girl. One of the boys were black and is the main main character. I think their is magic involved and it was also a book series. It was canceled after only 1 season but i remember it being so good and wanting to read the book. I believe it had a rather long name as well?\n\nI am trying to remember more but I cant remember most of it.",
        "upvotes": 16,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1n1to7o/please_help_me_find_this_netflix_series_that_was/"
    },
    {
        "id": "1n29k6p",
        "author": "Affectionate_Yam4221",
        "title": "7 Exciting Shows To Watch if You Love 'Hostage'",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n29k6p/7_exciting_shows_to_watch_if_you_love_hostage/"
    },
    {
        "id": "1n28g9g",
        "author": "Plus-Breakfast-6125",
        "title": "Shake’s Love Is Blind NDA has expired, and he's already exposing his 'unhinged' co-stars",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n28g9g/shakes_love_is_blind_nda_has_expired_and_hes/"
    },
    {
        "id": "1n1ek4n",
        "author": "AlittleupsetMax",
        "title": "How bad is Netflix new update",
        "content": "I am having problems with this service, besides the rate hikes and the inability to share, it seems like the actual service is having problems now.  The new home page isn’t very good.  After you browse for something, you have to go all the way to the top to search for what you were looking for.  Remember when they would pop a really anticipated movie on there?  Ahh the good ole days \n\nIs it still worth it?  I just finished Better Call Saul and I would say it was worth it for that show. Not too bad, it’s no Breaking Bad but what is?",
        "upvotes": 45,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1n1ek4n/how_bad_is_netflix_new_update/"
    },
    {
        "id": "1n0unz1",
        "author": "ToonAdventure",
        "title": "'KPop Demon Hunters' Is Netflix's Most-Watched Movie in History",
        "content": "",
        "upvotes": 641,
        "comments": 93,
        "media": null,
        "permalink": "/r/netflix/comments/1n0unz1/kpop_demon_hunters_is_netflixs_mostwatched_movie/"
    },
    {
        "id": "1n233zu",
        "author": "lilnadsx",
        "title": "Petition to make a No Good Deed Spinoff...",
        "content": "... that features the two new couples moving into the neighborhood (Dennis &amp; Carla and Leslie &amp; Sarah) and maybe they solve some other random unsolved mystery or it's just more slice of life like Four Seasons... I just need to see more of all 4 of those characters!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n233zu/petition_to_make_a_no_good_deed_spinoff/"
    },
    {
        "id": "1n14day",
        "author": "TheGhostOfUncleBuck",
        "title": "Netflix is down 8/26 evening",
        "content": "Netflix say they are not experiencing any interruption. All is goo.\n\nNetflix also say they are experiencing a lot of inbound calls and chat support is longer than usual.\n\nHence, Netflix is DOWN.",
        "upvotes": 143,
        "comments": 69,
        "media": null,
        "permalink": "/r/netflix/comments/1n14day/netflix_is_down_826_evening/"
    },
    {
        "id": "1n2252u",
        "author": "TwiggyCH",
        "title": "Issues with playback as an \"extra member\"",
        "content": "I was wondering if anyone else has been experiencing playback issues as an \"extra member\"? My brother is the primary account holder &amp; he added me as an extra member not too long ago &amp; I've been having REALLY bad playback issues.\n\nMostly, if I pause a show or movie &amp; leave it for anything from a few seconds to a couple minutes, the moment I hit play it freezes, I get the loading circle, it freezes again, it fast forwards, freezes, loads, &amp; then plays. This happens EVERY time. I have no other playback issues with any other streaming service JUST Netflix. \n\nIt works fine on my phone, just not my tv. (It's Hisense Roku tv if it makes a difference. And when signing up I did put \"tv\" as my primary source(?) for watching the app)\n\nWhen visiting my brother last month he still had my profile on his main account &amp; I used it to watch some movies &amp; his Netflix worked just fine.\n\nAny ideas as to why this happens? Has anyone else experienced this?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n2252u/issues_with_playback_as_an_extra_member/"
    },
    {
        "id": "1n1xg7h",
        "author": "ItsLix",
        "title": "I can't watch Netflix on my PC at all",
        "content": "I've been using Opera GX and noticed I couldn't play Netflix due to error code O7702-1290. I can load the website and profiles, browse shows and pick out an episode to watch. But after trying to load for a little bit, it gives me that error code and I am unable to find out why or how to fix it. Every other device I try it on works fine and I can watch there, just not my PC for whatever reason. It worked in the past, I checked my history and I was able to use it as recently as last month, but now it just doesn't.\n\n  \nI've tried clearing my cookies, cache, all of my browser settings and history, tried opening it on Chrome, Edge, and even downloaded and tried the Netflix app from the Microsoft store, tried a fresh install, enabling experimental flags to see if it was an html5 issue, changed my DNS, allowing DRM content to be played through my browser settings, updated, deleted, and re-updated my Widevine component, shutdown and restarted my PC multiple times. Nothing.\n\n\n\nAbsolutely nothing is working to get it to play on my PC and I cannot figure out why. I'm at my wit's end with it since I've been trying on and off to fix it for a week now, and every other search I come across either tells me how to fix Error Code 1003 instead of 1290, or even how to fix it for Linux or Vivaldi users. Can I get any help at all as to how this can be fixed or even a clue into the right direction?",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1n1xg7h/i_cant_watch_netflix_on_my_pc_at_all/"
    },
    {
        "id": "1n219py",
        "author": "queenbiscuit311",
        "title": "Dandadan not showing up on netflix anymore?",
        "content": "I've been watching dandadan on netflix, but when i went in today it's just not there. I went to a link from my history and it says it's not availible in my country. The show is absolutely on netflix in the US, so I don't understand what's going on here. Anyone else with this issue?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n219py/dandadan_not_showing_up_on_netflix_anymore/"
    },
    {
        "id": "1n1prw1",
        "author": "Fiestabean",
        "title": "I need romance anime recommendations",
        "content": "Yeah you heard me I’m unapologetically addicted to Romance anime and need some recommendations doesn’t have to be solely romance either it can be a shonen type with romance too. \n\n \n",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1n1prw1/i_need_romance_anime_recommendations/"
    },
    {
        "id": "1n12j61",
        "author": "ZoZleepy",
        "title": "Netflix Down (East Coast NY)",
        "content": "Anyone else having issues? \n\nApp isn't loading properly on Xbox or TV, glitching and shuddering\n\nThe new format looks like shit also, seems to be a whole mess\n",
        "upvotes": 119,
        "comments": 113,
        "media": null,
        "permalink": "/r/netflix/comments/1n12j61/netflix_down_east_coast_ny/"
    },
    {
        "id": "1n1v8la",
        "author": "Single-Mechanic-9323",
        "title": "scary movie recs?",
        "content": "hey! my friends and i are up in a cabin in the woods in the mountains and are in the mood to watch a good scary movie tonight with as many jump scares as possible. preferably nothing demonic or anything of that nature, but still as scary as possible so lemme know 🙏",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1n1v8la/scary_movie_recs/"
    },
    {
        "id": "1n25aku",
        "author": "Nastia_dream",
        "title": "Is My life with Walter boys worth watching?",
        "content": "S2 comes out today (or already came out i didn’t check yet). Honestly all i’ve heard about this show is that it’s like ,,The summer i turned pretty’’ but from Netflix (I haven’t seen that other show, just saw clips and edits and decided it’s not for me). Also i mainly don’t watch teen shows anymore but sometimes i’d check something out from Netflix. Those who’ve seen this show, is it good enough to spend your time on watching or is it really like that other teen show from Amazon Prime ? So far the only reason i’ve been planning to check it out is because one of the main actresses was in Suits and i loved her in there. But other than that I don’t want to watch it if it’s just some cheesy drama with teen romance. ",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1n25aku/is_my_life_with_walter_boys_worth_watching/"
    }
]