[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 11,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 686,
        "comments": 5064,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1nrdav5",
        "author": "JollyToe440",
        "title": "Tired of seeing cheating in relationships in Netflix Shows",
        "content": "This ain’t no spoiler. I just began The Waterfront Episode 1. Before half of the episode was done, it seems like one of the main guys runs into his high school sweetheart. It is then made clear that they are both partnered up already. The next day, he goes to her shop where she works and they strike a convo. It feels like there will be cheating already, and i’m just fed up with that storyline. I won’t continue watching this show if the characters are just typical netflix tropes; unrelatable yet oh-so cheesy. Also, it just feels unnecessary to start this cheater narrative when the guy could’ve just been single. So cliché. \n\nReally wondering why this show is at the top searches. \n\nAnyone can let me know if there will be actual cheating or will they be normal people for once? ",
        "upvotes": 300,
        "comments": 79,
        "media": null,
        "permalink": "/r/netflix/comments/1nrdav5/tired_of_seeing_cheating_in_relationships_in/"
    },
    {
        "id": "1nrzl61",
        "author": "Beneficial_Pickle288",
        "title": "Altered Carbon",
        "content": "I never see anyone talk about this show or even recommend it when people ask for recommendations, which leads me to believe a lot of you have not seen it!  Definitely worth a watch, sci-fi action thriller with great characters, and a compelling story line.  I think they also have an animated series, which I have not seen yet, but definitely highly recommend the live action show!  Here is the trailer for your viewing pleasure.\n\nhttps://youtu.be/-Yt89b5AcwY?si=HVAoOhI4BiOW_p9P\n\n",
        "upvotes": 7,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1nrzl61/altered_carbon/"
    },
    {
        "id": "1nran0i",
        "author": "ToonAdventure",
        "title": "'Haunted Hotel' Renewed for Season 2 at Netflix",
        "content": "",
        "upvotes": 176,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1nran0i/haunted_hotel_renewed_for_season_2_at_netflix/"
    },
    {
        "id": "1nryevi",
        "author": "BrainImpressive9529",
        "title": "Need new recommendations 😭",
        "content": "So, I want some new series recommendations.. it feels like I have watched everything on netflix and can’t find any good series now.. please recommend me some good series..\n\nI have watched wednesday, alice in borderland, squid game, my life with walter boys, stranger things etc, and kdramas..\n\nI need something fun, mystery, feel good, could be anything but worth watching.. ",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1nryevi/need_new_recommendations/"
    },
    {
        "id": "1ns0418",
        "author": "Rodrigweez",
        "title": "Netflix Episode Info/Progress Bar keeps popping up while watching",
        "content": "We watch Netflix through a BenQ projector. If we watch Netflix through our AppleTV or Sony DVD player, every 5-15 minutes, the episode info box pops up from the bottom of the screen. When you click \"back\" on the remote, it goes away but then the progress bar remains. If we watch Netflix through the Android TV that came with the projector, we don't have this problem but the AndroidTV often doesn't boot up or has some other problem so we prefer not to use it.\n\nI've done factory resets on the AppleTV, the DVD player and the AndroidTV and downloaded all the updates for the projector. We've tested disabling remotes in case one of them is faulty. None of these things work.\n\nHas anyone else had this problem? And if so, how did you solve it?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ns0418/netflix_episode_infoprogress_bar_keeps_popping_up/"
    },
    {
        "id": "1nr3m7y",
        "author": "graemeisverytired",
        "title": "Squid Game success means that Famke Janssen is now acting for the first time in her native language in Netflix’s Amsterdam Empire",
        "content": "This new status quo is one that Dutch actress and X-Men icon, Famke Janssen, feels grateful for. Janssen stars in an upcoming Netflix show called Amsterdam Empire, and it's the first time that she has ever acted in her native language. Speaking with our video producer, Ashley Victoria Robinson, Janssen noted that Amsterdam Empire was part of this post-Squid Games world of international streaming. “Us now being in a time where Squid Game, everyone is watching anything in any language, and it doesn’t matter anymore. That has really changed the landscape for all of us, so that’s wonderful,\" Janssen said. \n\nMore: [https://www.thepopverse.com/tv-netflix-squid-game-international-shows-famke-janssen-amsterdam-empire-dutch/](https://www.thepopverse.com/tv-netflix-squid-game-international-shows-famke-janssen-amsterdam-empire-dutch/)",
        "upvotes": 106,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1nr3m7y/squid_game_success_means_that_famke_janssen_is/"
    },
    {
        "id": "1nrz3wu",
        "author": "Wild_Information_520",
        "title": "Strange audio edit on a movie (Hotel transylvania 2)",
        "content": "I was watching the movie \"Hotel Transylvania 2\" on Netflix. Since I hadn't seen it in a while, I wanted to rewatch it (obviously also watching the first one). Nothing strange, until we get to the scene where Dennis shows Torty's video to Grandpa Dracula. I'm Italian, and I was watching the video in Italian, so I thought it was a mistake due to the Italian audio, but it wasn't. Torty, after Dennis is put to bed, (from what I remembered) said \"Slow down, Buzzle Lump. The scariest monster of all is diabetes.\" Now, however, he just laughs. I was wondering if it was a mistake or not.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nrz3wu/strange_audio_edit_on_a_movie_hotel_transylvania_2/"
    },
    {
        "id": "1nrs8j0",
        "author": "New-Attitude4610",
        "title": "Best Netflix game",
        "content": "Hey everyone, I love horror + crime games. I’m curious: what do you think is the best Netflix game in that genre? Prefer games with strong mystery, atmosphere, maybe supernatural elements. Suggestions?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nrs8j0/best_netflix_game/"
    },
    {
        "id": "1nruq8l",
        "author": "Anna_crazy_banana",
        "title": "Shahmaran",
        "content": "I like to really explore Netflix and find any kind of show that’s fantasy, mythological-romance, with a hint of morale thinking of humanities nature. The shahmaran is that show and it’s sooooooo good! Like so good I need to come on here and tell more people about it so a 3rd season can be made!!. It’s in Turkish and I think watching it in its original language but with subtitles is the best way to go. I don’t understand Turkish but having the English voice overs just doesn’t feel like I’m watching the same show. And sheesh, the chemistry of the main characters 🥰🥰🥰 anyways, can I spread this love to my American peeps and any other country that doesn’t know about the show shahmaran??Please please watch it, get the views up, so I can get more seasons haha 🤣 ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nruq8l/shahmaran/"
    },
    {
        "id": "1nrja2h",
        "author": "AccomplishedPut5175",
        "title": "French Lover",
        "content": "Just watched this movie, and I highly recommend it.\nThe movie is light, enjoyable, sit back and enjoy.\n\nOmar Sy once again shows that he is a master in all genres, while Sara Giraudeau simply amazed me with her acting.",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nrja2h/french_lover/"
    },
    {
        "id": "1nro4rt",
        "author": "UnicornWhiskeyFairy",
        "title": "App sleep timers",
        "content": "I feel like I’m not the only one who watches/listens to shows on Netflix/Hulu/Disney/Discovery to fall asleep and there needs to be a way to make a timer. If our TV had the technology why don’t our apps?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nro4rt/app_sleep_timers/"
    },
    {
        "id": "1nr49m7",
        "author": "Trent-Popverse",
        "title": "Guillermo del Toro is planning to change his entire moviemaking style: \"I feel like I need a change\"",
        "content": "",
        "upvotes": 26,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nr49m7/guillermo_del_toro_is_planning_to_change_his/"
    },
    {
        "id": "1nrb2pi",
        "author": "tummyachemedicine",
        "title": "Please recommend me series like Dr. Cha and others that are attractive to middle aged women",
        "content": "My mom never had hobbies, specially after divorcing a few years ago and had to start working a lot. So when she saw me watching Dr. Cha she was really interested in it and we had a good time watching 6 episodes in one sitting. She works a lot day and night and only has 2 days, so I'd like for her to have a good time at least. She is quite the boomer too.\nWe come from a latin country with huge soap opera culture, but nowadays nobody watch much TV, and my mom is older and probably prefers things that are more drama and \"conservative\" (so probably no gay or very progressive stuff unless it's side characters 😭). I don't wanna change her, just have a good time.\nI thought about Bridgerton, older moms seem to love it, so please recommend me stuff like that moms like too.",
        "upvotes": 12,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1nrb2pi/please_recommend_me_series_like_dr_cha_and_others/"
    },
    {
        "id": "1nrndk0",
        "author": "Pdx_Obviously",
        "title": "Visiting Spain... But confused.",
        "content": "I'm in Spain on vacation.  When I opened Netflix for my typical pre-sleep wind down, I was pleasantly surprised that two shows that do not appear in my feed in the United States were showing here. Big Bang Theory and Friends.\n\nI watched several episodes of BBT over the last 4 evenings and when I opened up the app today, both it and Friends are gone.  Still in Spain.\n\nAny idea why?  It's fine... But just confusing.  Wondering if Netflix figured out I had an American account and blocked content that shows exclusively on Max in United States...?  \n\nAnyway if anyone can provide insight, it would help my curiosity. \n",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1nrndk0/visiting_spain_but_confused/"
    },
    {
        "id": "1nruxmw",
        "author": "Amirhoseinmoradi",
        "title": "Need recs: Movies/series that are actually good… but also kinda ho.t",
        "content": "Okay, here’s the deal: I enjoy movies and shows that actually have quality writing, acting, and storylines — but also don’t shy away from e.rotic scenes. Think Love (Gaspar Noé), Blue Is the Warmest Color, Elite, etc.\nNow I’m stuck — I feel like I’ve already watched the “obvious” ones.\nSo here’s my question for you:\n👉 What’s a movie or series that surprised you by being both really well-made and unexpectedly hot?\nBonus points if it’s something most people wouldn’t immediately think of.\nLet’s see who drops the most underrated gem.",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1nruxmw/need_recs_moviesseries_that_are_actually_good_but/"
    },
    {
        "id": "1nroidp",
        "author": "Only-Storage9984",
        "title": "Adolescence: I have questions, let’s talk about it!",
        "content": "I need somebody who is professionally trained to give me Jamie’s clinical diagnosis from his interview! Is he a sociopath with narcissistic tendencies? I’m by no means trained on the subject. I just watch a lot of serial killer shows and some of those traits seemed to be evident. I wasn’t sure if the psychologist was just overwhelmed, felt bad for him or genuinely scared or a combination then all. Either way one of the best acted, directed and written pieces of television I’ve ever seen! ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nroidp/adolescence_i_have_questions_lets_talk_about_it/"
    },
    {
        "id": "1nrew14",
        "author": "1have1question",
        "title": "Is it possible to show movies/ TV series which are only dubbed in my language?",
        "content": "I'm peculiar about how I watch my TV lol, and 99% of the time I want to see a dubbed version in my language (Italian). The problem is, sometimes there is a show which has the translated title, but it's only subs, so my only way of trying to tell if it was dubbed doesn't work. I've tried to talk to customer support, but they were no help and I don't want to bother them anymore.\n\nParticularly problematic because I like to watch anime and I'm often out of Italy. \n\nUsually if I search for Italian/TV series it works, but I'd like to not only see those, but ALL of the catalogue dubbed in Italian, if it makes sense.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nrew14/is_it_possible_to_show_movies_tv_series_which_are/"
    },
    {
        "id": "1nriouu",
        "author": "No_Cardiologist5966",
        "title": "Bug on netflix",
        "content": "I'm Brazilian and I have the following problem: the menus don't appear to play or change subtitles or select episodes.\n\n\nI even recorded it to show what my app looks like.\n\nWhen forcing a reinstallation, the app has a different version and the bug stops happening, but in 2 or 3 days it goes back to that version where the bug occurs and I have to redo the process.\n\n Does anyone help me?",
        "upvotes": 1,
        "comments": 3,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/34w9vqld1mrf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1nriouu/bug_on_netflix/"
    },
    {
        "id": "1nqmh74",
        "author": "Glass_Pomegranate820",
        "title": "Anyone watched Hunting Wives?",
        "content": "At first glance looks a little soapy for me but is also tagged mystery. Tempted to watch just for some of the Cast. Haven’t seen Katie Lowes in anything since Scandal, which I loved her in!! Thoughts? I watch a pretty wide range of drama, thriller, true crime, and some comedies.",
        "upvotes": 95,
        "comments": 115,
        "media": null,
        "permalink": "/r/netflix/comments/1nqmh74/anyone_watched_hunting_wives/"
    },
    {
        "id": "1nr6gsx",
        "author": "What_is_good97",
        "title": "If I bring my apple tv to my parents' house once a month, will I be able to get around the household block?",
        "content": "I rarely use netflix, but I'm a fan of great british bake off and want to watch the new weekly episodes, but my apple tv is no longer part of our base household.",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1nr6gsx/if_i_bring_my_apple_tv_to_my_parents_house_once_a/"
    },
    {
        "id": "1nqya2e",
        "author": "Longjumping_Bowl_403",
        "title": "Movie Review: Fractured (Netflix Original)",
        "content": "If you're into thrillers, the type that keep you guessing, hoping for something, a light at the end of the tunnel, this movie is for you. It'll keep you guessing all the way through. This type of movie evokes feelings straight from Shutter Island (a must watch). Somewhat dragged out, but very much worth a watch.\n\nPersonal Rating: 8.5/10",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nqya2e/movie_review_fractured_netflix_original/"
    },
    {
        "id": "1nranrh",
        "author": "RedBunnyJumping",
        "title": "Rollercoaster interview",
        "content": "Anyone else notice Netflix is doing some really creative stuff on TikTok lately???? isn't that mad?  \nfirst I thought it wasn't real...  \nMost celebrity promotion feels so fake and scripted. This feels like something youu actually choose to watch, not something you skip for real!!  Netflix found a way to make promotion that's actually entertainment! \n\nIt feels like they're actually trying to make good content rather than just pushing their shows :)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nranrh/rollercoaster_interview/"
    },
    {
        "id": "1nr8tnz",
        "author": "thatbeesh1234567",
        "title": "Offline downloads HMDI connection no longer working",
        "content": "I have been casting offline for well over 5 years (download content onto my iphone, iphone-hdmi adapter to connect to non-smart tv). I turn off data &amp; have no wifi, the HDMI projected the content onto the tv just fine from my phone. I was never able to do that with other streaming platforms such as Amazon Prime or Paramount (which I read online that's due to their policy or something, although Paramount did randomly work a time or two?).\n\n  \nAs of last Friday, I got an error Offl:10000; When I watch it directly on my phone, no issues &amp; it plays as normal (while remaining offline). I googled which told me to restart my phone, redownload the app, sign out, etc. I did all of that without success.\n\nI contacted Netflix to see what's going on &amp; the chat person said that I should have never been able to do that due to copyright or something &amp; that subscribers would only be able to watch offline content directly on the device. I am so confused as to how that is an infringement to be able to just play the content on a larger screen at home?\n\nI've had the same adapter for quite some time so perhaps a new one would allow it? Or I'm wondering if the netflix tech team realized the glitch &amp; just recently fixed it?\n\nI'm pretty freakin bummed out since we rely on this set up for the cottage that has horrible phone reception (i.e. can't stream directly with data) &amp; no internet up there.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nr8tnz/offline_downloads_hmdi_connection_no_longer/"
    },
    {
        "id": "1nr78rx",
        "author": "OutreObvious",
        "title": "BRING BACK CAPTAIN FALL",
        "content": "High key, I don’t feel like Netflix tried much in the marketing department. But in the current political/world/class climate… am I the only one who thinks they need to just give it one more go? At least finish the plot?\n\nI watch *a lot* of dark comedy.. and this is one of the few that actually feels different than the rest? Psh, the cancellation almost opens a Pandora’s box of my own conspiracy theories. Netflix treated Captain Fall no better than his parents—just GAH. At least finish the original 20 episodes, yeah?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nr78rx/bring_back_captain_fall/"
    },
    {
        "id": "1nr141c",
        "author": "DelboyTrotter164",
        "title": "Is this a bug?",
        "content": "So, I tried setting up my account but it doesn't let me for some reason. I typed in my email and an error comes up saying \"Sorry, something went wrong. Try again later.\". \n\nI tried a few times, updated the app, turned my phone off and on and it still shows the same thing. I waited a couple of hours and tried again and still the same. Is this Netflix' fault or am I doing something wrong?\n\n",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nr141c/is_this_a_bug/"
    },
    {
        "id": "1nr5kt9",
        "author": "JaniceRaynor",
        "title": "Netflix put out a KPOP Demon Hunters’ “Your Idol” cover, sang by Abaddon the demon from Haunted Hotel",
        "content": "Related subreddits r/HauntedHotel and r/kpopdemonhunters  \n\nIf Abaddon, the demon boy from the new animated series Haunted Hotel, was to write a song about his life, it would 100% be \"Your Idol\" from KPop Demon Hunters. Jimmi Simpson, the voice of Abaddon, performs a \"Your Idol\" cover in this special Haunted Hotel music video.",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/t1x6y9tgajrf1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1nr5kt9/netflix_put_out_a_kpop_demon_hunters_your_idol/"
    },
    {
        "id": "1nrhext",
        "author": "TylerSpicknell",
        "title": "I hope the success of K-Pop Demon Hunters will convince Netflix to treat animation with more respect.",
        "content": "They don't treat any of their animated movies and shows right, especially their shows. More often than not they just cancel it after one season or in the case of Inside Job renew then change their mind and cancel it. \n\nThey don't even want to give their animated movies sequels. That is why I almost lost hope, but I think this movie will cause Netflix to come around. ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1nrhext/i_hope_the_success_of_kpop_demon_hunters_will/"
    },
    {
        "id": "1nrgul3",
        "author": "Skur11",
        "title": "Leaked content for the Netflix vieeogame Storyteller",
        "content": "One of the artists assisted a game developing event I was exposing at in Argentina, she showed some pictures I'm certain were never seen before, I looked them up and nothing showed up, but correct me if I'm wrong. She said these were Work In Progress herself.\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nrgul3/leaked_content_for_the_netflix_vieeogame/"
    }
]