[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 10,
        "comments": 76,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 61,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1lclhx2",
        "author": "moistwound",
        "title": "Netflix is punishing me for traveling",
        "content": "So I’m on vacation in the Caribbean with my girlfriend — we live together in CO, and like most people these days, we pay for the cheapest version of Netflix (with ads) because streaming’s gotten outta control. Between all the different platforms, we keep it low tier just so we can still have access to most stuff.\n\nAnyway, we’re chilling on vacation, decide to throw on a movie, and go straight to Netflix — our usual go-to. And what do we get? A notification saying:\n“Your subscription tier is not available in this region.”\nSo… basically, we can’t use Netflix at all.\n\nAnd THEN — get this — it hits us with:\n“You can change your subscription [here]” with a link to upgrade.\nLike that’s gonna make me go “oh yeah sure, let me give Netflix more money just so I can use it on my vacation.” Bro, be serious.\n\nI’ve been paying for Netflix for years. I’m not asking for a free ride — just some common sense. Would it really kill them to say:\n“This tier isn’t available in your current region. You have 7 days of access while traveling — enjoy your vacation!”\nGive me a little grace period. A little respect. I’m not a new user. I’m just out of town for a minute.\n\nSo what now? Am I supposed to pause or cancel my Netflix sub every time I leave the country? Is it even worth paying anymore if I’m gone for part of the month? It shouldn’t be that complicated.\n\nAnd this is why people are done with streaming services. They nickel-and-dime loyal users, and act surprised when people jump ship. It’s like they want to lose us.\n\nNetflix — if you’re listening — stop punishing your paying customers for traveling. It’s not a good look. Especially when all we wanted to do was watch a damn movie on vacation.",
        "upvotes": 256,
        "comments": 102,
        "media": null,
        "permalink": "/r/netflix/comments/1lclhx2/netflix_is_punishing_me_for_traveling/"
    },
    {
        "id": "1lcpi0b",
        "author": "LowBudgetVillain",
        "title": "What’s a lesser-known show or movie that completely consumed your brain?",
        "content": "Hey Reddit, I’m on summer break and bored out of my mind.  \nI’m looking for series or movies to watch. Preferably something good enough to make me forget what day it is.\n\nStuff I enjoy:  \n• Psychological  \n• Horror  \n• Mystery or thrillers  \n• A good slow-burn with depth  \n• Soapy comfort shows like Gilmore Girls are fine too if they’re written well\n\nStuff I don’t enjoy:  \n• Anything overhyped that everyone’s watching right now  \n• Predictable plots or weak character arcs\n\nPlease give me your personal underrated faves. The kind of stuff you wish more people knew about. Bonus points if it has killer cinematography or sharp writing.\n\nThanks in advance ✨",
        "upvotes": 34,
        "comments": 135,
        "media": null,
        "permalink": "/r/netflix/comments/1lcpi0b/whats_a_lesserknown_show_or_movie_that_completely/"
    },
    {
        "id": "1lcv07u",
        "author": "MysticCrest1830",
        "title": "Kia Is Launching Its Premium Streaming Service In Europe, Netflix is Included",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lcv07u/kia_is_launching_its_premium_streaming_service_in/"
    },
    {
        "id": "1lcuikc",
        "author": "CurrentlyLucid",
        "title": "Mercy for none",
        "content": "I just got done with this, fairly new. Korean so I watched it with subtitles. A lot of high quality martial arts, fast moving story, and a fair amount of blood and gore to be honest. I loved it.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lcuikc/mercy_for_none/"
    },
    {
        "id": "1lc4y9j",
        "author": "artifex28",
        "title": "Netflix completely HIDES content if the SUBTITLE language doesn't match your set language.",
        "content": "This seems absolutely absurd that content is *completely hidden* just if your local subtitle language isn't a match.\n\nI've had English on forever (instead of Finnish that I am).\n\nA family member was completely baffled when I mentioned watching certain shows that she wouldn't be able to even find. After changing the profile language to English, she was able to find them. I tested this personally, it indeed works like this.",
        "upvotes": 122,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1lc4y9j/netflix_completely_hides_content_if_the_subtitle/"
    },
    {
        "id": "1lc9rcn",
        "author": "cerulloire",
        "title": "The \"Household\" aspect is insanely greedy.",
        "content": "I have the highest tiered plan, which literally allows 6 devices, shared between my parents on one TV, then myself, then my brother. I live a few cities over and my brother had to move to a different state, and we were able to stream no problem, but recently my brother and I can't watch it because it says we are not part of the household...? What's the point of paying for all these devices if we can't even use them? This isn't an issue on any other streaming service. Not being able to watch on more than 2 screens at one time is one thing that I can understand, I guess, but if you're literally paying for a plan that is laid out well to be shared, it's weird that we cannot actually share it. \n\nI'm also doubtful of \"adding an extra slot\", because while that sounds like it would alleviate the problem (unless it's just...another useless device) I refuse to give more money to Netflix and support the greed. Tbh I was willing to add the extra slot, but putting a tier on that too with ads/no-ads is just too far. \n\n\"Just Unsubscribe\" - I despise Netflix, and no longer use it, but my brother and parents still rely on it for streaming so while this isn't really my problem anymore, we won't be unsubscribing because my family is still enjoying it (regardless of me begging them to transition to another service, which we have already). I only know it does not work on my computer because my bro asked me to check what's up with Netflix rn. This doesn't change the fact that Netflix puts out sub-par cash grab originals (while cancelling/removing actually good content) behind the priciest plans, and it's even more frustrating that so many people are so tethered to Netflix that the company will never have a reason to decrease their prices. ",
        "upvotes": 53,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1lc9rcn/the_household_aspect_is_insanely_greedy/"
    },
    {
        "id": "1lcw8p0",
        "author": "Square-Actuary-4424",
        "title": "Some recs for UK/IRL",
        "content": "Hey guys, Ireland based.\nLooking for some drama recs. \ncould really use a few good series to keep me going.\nI’m sick of constantly scrolling and rewatching old stuff! \nThings I’ve really enjoyed recently are:\n- severance\n- silo\n- west world\n- last of us \n(Obviously not all from Netflix) \nJust giving an idea of stuff I like.\nAny recommendations are welcome! \n\nGo raibh maith agat! 🇮🇪💚",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lcw8p0/some_recs_for_ukirl/"
    },
    {
        "id": "1lcigpm",
        "author": "prettykitty2005",
        "title": "OPINION: Straw",
        "content": "this movie wasn’t bad. you just had high expectations for a TYLER PERRY movie. \n\nanyways, im not sure why people are critiquing teyana taylor’s acting as if she was ever a strong actress. she does everything under the sun but acting isn’t her strong suit. she was just a special appearance to me, it was nice seeing her on a screen thats all. ",
        "upvotes": 8,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1lcigpm/opinion_straw/"
    },
    {
        "id": "1lcfv06",
        "author": "OkRip3072",
        "title": "What show that has recently been cancelled that you’d like to see renewed/picked up on Netflix? Networks like FOX, CBS, USA,",
        "content": "There has been a few shows on these networks that have been canceled too soon, and Netflix resurrected them. For example, Lucifer was originally on FOX network cancelled after season 3 due to “declining viewership”, and Netflix picked it up for three additional seasons, so it’s not uncommon. What have you enjoyed watching that you would like Netflix to bring back?",
        "upvotes": 13,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1lcfv06/what_show_that_has_recently_been_cancelled_that/"
    },
    {
        "id": "1lcukum",
        "author": "CKWOLFACE",
        "title": "Looking for a certain English show",
        "content": "The show has a female Asian character in one the leads and takes place during the industrial revolution in London and mixs in fantasy? I remember there was a episode about kids losing their teeth?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lcukum/looking_for_a_certain_english_show/"
    },
    {
        "id": "1lcit9z",
        "author": "HANAquax",
        "title": "Upper class",
        "content": "Hi\nCan anyone please suggest me shows that talk about the lives of upper class and/or filthy rich people? \nPreferably ones without much drama unless they are too good. \nPeriod shows will be good too \nThanks",
        "upvotes": 8,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1lcit9z/upper_class/"
    },
    {
        "id": "1lcqggz",
        "author": "Cautious-Grab-316",
        "title": "Extra monitor playing Netflix from laptop will not show video, only black screen. Works with every other streaming service. What is happening ?",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/qbfiilfhz97f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1lcqggz/extra_monitor_playing_netflix_from_laptop_will/"
    },
    {
        "id": "1lcfw51",
        "author": "OkRip3072",
        "title": "What show would you like for Netflix to pick up?",
        "content": "There has been a few shows on these networks that have been canceled too soon, and Netflix resurrected them. For example, Lucifer was originally on FOX network cancelled after season 3 due to “declining viewership”, and Netflix picked it up for three additional seasons, so it’s not uncommon. What have you enjoyed watching that you would like Netflix to bring back?",
        "upvotes": 7,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1lcfw51/what_show_would_you_like_for_netflix_to_pick_up/"
    },
    {
        "id": "1lcnz5z",
        "author": "Significant_Win6284",
        "title": "Lorenzo from Medici is incredibly eloquent and pushed me down a Rhetoric rabbithole",
        "content": "I was watching Netflix's *Medici* and was struck by how well they all spoke, especially Cosimo and Lorenzo (Daniel Sharman). They were calm, measured, sharp. They made their arguments so eloquently and effectively, it felt impossible to disagree with them without sounding irrational or malicious.\n\n“We were common merchants not long ago. What right do we have to withhold that right from others?” Damn. I’m not even a big fan of democracy, but that line? Perfectly put. And then his line to Clarice in season 2: “We serve God by aiding those in need, but we also serve Him by recognizing the beauty of the world He created.” Hot damn.\n\nIf you haven't watched Medici, I strongly recommend it. The dialogues alone make it worth it.\n\nAnyway, curious as always, I started digging. Turns out they actually studied this stuff. **Rhetoric**. It was a formal subject back then... meant to teach persuasive speaking for oratory, court politics, negotiation, everything.\n\nWent deeper and found the classics. Aristotle’s *Rhetoric*, Cicero’s *The Orator*. Great stuff, but dense and full of references that are outdated by about two thousand years. Still, I’ve been studying it seriously for a few months now and trying to apply it to my life. And it’s already made a big difference, especially in my work where so much depends on influence and how you express ideas.\n\nHonestly, I’ve been loving it. So I started a newsletter called *The Rhetorician...* just a passion project for now. The goal? To speak as eloquently and persuasively as Lorenzo.\n\nDropping the link in case anyone wants to check it out:  \n[therhetorician.co](https://therhetorician.co)\n\nLet me know what you think.",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/03cur2uy797f1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1lcnz5z/lorenzo_from_medici_is_incredibly_eloquent_and/"
    },
    {
        "id": "1lcnrfr",
        "author": "shibani11",
        "title": "Loved \"The Residence\" until I realised...",
        "content": "I am watching episode 5 and initially I felt the lead looked familiar but then I forgot about it. I just realised the lead was in Orange is the new black. Now when I continue watching my mind is not able to focus and only clips of orange is the new black comes to my mind. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lcnrfr/loved_the_residence_until_i_realised/"
    },
    {
        "id": "1lck8cr",
        "author": "clayterris",
        "title": "Netflix fullscreen captions cause screen to shift up and down on 16:10 display",
        "content": "I have reported this no netflix and not heard back. There's another thread from \\~a month ago with the same issues, but no fixes that work. While in fullscreen, subtitles on the windows app and any browser on the device cause the the screen to jump every time the subtitles appear/disappear. This makes content unwatchable in fullscreen. This is not specific to any content, it's all titles across netflix. \n\n  \nI mention 16:10 as it's my ratio and I think everybody that posted on the other thread. (3840x2400 60hz)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lck8cr/netflix_fullscreen_captions_cause_screen_to_shift/"
    },
    {
        "id": "1lbn9mj",
        "author": "ElevatorNo415",
        "title": "Straw is one of the worst movies I’ve ever seen.",
        "content": "One of the most over the top unrealistic movies I’ve ever seen. Even for a Tyler Perry movie. If you like to constantly yell at the screen “yeah right that would never happen!” Then this movie is for you. Taraji P. Henson is a good actor but the entire supporting cast was so bad it was comical. ",
        "upvotes": 181,
        "comments": 350,
        "media": null,
        "permalink": "/r/netflix/comments/1lbn9mj/straw_is_one_of_the_worst_movies_ive_ever_seen/"
    },
    {
        "id": "1lcba0i",
        "author": "Different-Meat-8562",
        "title": "Haunted",
        "content": "Anyone watched Haunted, there are currently 3 seasons out. Are the stories real? It's pretty cool how they sit around and tell their story to their friends and family. I just wonder if the stories are real or are these actors ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lcba0i/haunted/"
    },
    {
        "id": "1lchuyn",
        "author": "jmcclintock8888",
        "title": "See no evil, hear no evil",
        "content": "So, I just finished up watching this classic and I need confirmation of something. Maybe I’m just hearing things, but in the final seconds of the film; right before the credits hit, I swear I heard a voice over (albeit softly) say something about “Live at Fox Eight; as if I had just watched this video on live TV and not straight through the Netflix app. \n\nCan anyone else confirm this? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lchuyn/see_no_evil_hear_no_evil/"
    },
    {
        "id": "1lcdqlf",
        "author": "Similar-Date3537",
        "title": "How to stop autoplay on Roku tv?",
        "content": "I am using a Roku smart tv.  Have the latest version of the Netflix app.  I've gone on the Netflix website, gone to the account, and unchecked \"autoplay\" for all users.\n\nBut every single time I look at anything on the Netflix app on my tv, it starts autoplaying.  \n\nHow do I stop this?  What am I missing?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lcdqlf/how_to_stop_autoplay_on_roku_tv/"
    },
    {
        "id": "1lbr5im",
        "author": "Snoo-66268",
        "title": "Justice for Mind Hunter!!!",
        "content": "Mindhunters had so much potential. It started slow, but the characters were just starting to develop. I throughly enjoyed the 70s era it was set, pre-technology. Hate when a good series ends abruptly and we’re left with unanswered questions and an empty void lol. \n\nI only recently heard of this show after so many redditors posted about it. I’m wondering why it was never on my radar when it came out. It must have been overshadowed when it debuted? Hoping there’s some possibility for a season 3, but that’s unfortunately just wishful thinking after some quick google searches :(",
        "upvotes": 29,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1lbr5im/justice_for_mind_hunter/"
    },
    {
        "id": "1lbja1p",
        "author": "Own_Spring_3489",
        "title": "Already watched shows",
        "content": "Is there a way to get netflix to stop suggesting shows you've already seen. In the \"your next watch\" section its now pretty much entirely shows ive already seen which has recently meant I am struggling to find new shows to watch because I normally just go by their recommendation. ",
        "upvotes": 69,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1lbja1p/already_watched_shows/"
    },
    {
        "id": "1lc7y6f",
        "author": "Fickle-Ad-4585",
        "title": "Mom’s Top Shows &amp; Movies to Binge + Looking for Your Recommendations!",
        "content": "Hey Netflix lovers! 👋\n\nI’m a busy mom who’s been diving deep into Netflix lately and wanted to share my favorite shows and movies that kept me glued to the screen. If you haven’t seen these, you’re seriously missing out!\n\nTop Netflix Shows:Ozark\n\nMoney Heist (La Casa de Papel) — the best heist show ever!\n\nInventing Anna\n\nThe Queen’s Gambit\n\nThe Night Agent\n\nRebellion\n\nThe Recruit\n\nTo Catch a Killer\n\nCarry On\n\nThe Croods\n\nSpencer Confidential\n\nThe Union\n\nRed Notice\n\n\nTop Netflix Movies:\n\nThe Rite (Anthony Hopkins is amazing!)\n\nDeliverance\n\nEqualizer 1 &amp; 2\n\nAmerican Sniper\n\nDen of Thieves\n\nMonsters\n\nInstant Family\n\n\nBonus for crime drama fans:\n\nYou\n\n\nWould love to hear your favorites too! Drop your recommendations or let me know if you want to hear why I loved any of these. Thanks for reading and happy Netflix bingeing! 🍿📺",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lc7y6f/moms_top_shows_movies_to_binge_looking_for_your/"
    },
    {
        "id": "1lc4sak",
        "author": "Creative-Ad-1363",
        "title": "Bad sport - hoop schemes",
        "content": "I'm blown away by this episode. The perfect storm of broke college players, who play for free, barely fed by the school, combined with predatory gamblers offering them a sliver of profits for point shaving. The players made $20k for fixing games, the bookies made millions. Sad and disappointing on sooooo many levels.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lc4sak/bad_sport_hoop_schemes/"
    },
    {
        "id": "1lbnwa5",
        "author": "Rachelgal2",
        "title": "Where Straw fell apart",
        "content": "This movie’s plot became absurd to be when the mom showed up to the daughter’s school and spoke with the principal about getting a phone call.\n\nIf I saw someone 24 hours after their child died, wearing their work clothes, saying I called them when I didn’t, I would be very alarmed and would not let that person leave without contacting a medical office or hospital.  She was clearly not it her right mind and no way a principal would shrug that off.  ",
        "upvotes": 17,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1lbnwa5/where_straw_fell_apart/"
    },
    {
        "id": "1lc4791",
        "author": "Fryolo",
        "title": "Looking for a song",
        "content": "Vatican Girl, episode 2, min 14.40 there is a scene of an old italian singer (Jimmy Fontana) singing in a club. I’m looking for the title of the song. I can’t use shazam because it’s too short, and by listening to the words he sings I can only understand “…e bon voyage a tutti…”. Can someone help me? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lc4791/looking_for_a_song/"
    },
    {
        "id": "1lc2flc",
        "author": "SoleSurvivor893",
        "title": "Documentary High Score Episode 1. Anyone know the instrumental song playing?",
        "content": "In episode one of the documentary high score on Netflix there’s a song playing in the background at the 22:40 mark right when the narrator starts talking about the success of Pac-Man with the audience of American women. It sounds like an upbeat version of some original pac man intro or beat but I’m blanking on whether it was an original song or something made by the folks in the documentary. Does anyone know where I can find an unedited and original version of this instrumental? Thanks!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lc2flc/documentary_high_score_episode_1_anyone_know_the/"
    },
    {
        "id": "1lb51pl",
        "author": "clevertulips",
        "title": "Why is Cobra Kai series considered good… universally bad acting, gratuitous nonsensical fight scenes every 5 seconds… ?!",
        "content": "Genuinely, I’m amazed that people rave about this series.  The cringe factor is off the charts,  most of the time, and the despair to be anything like Karate Kid is truly laughable considering just how bad the writing is. What the heck??",
        "upvotes": 215,
        "comments": 123,
        "media": null,
        "permalink": "/r/netflix/comments/1lb51pl/why_is_cobra_kai_series_considered_good/"
    },
    {
        "id": "1lcdm9f",
        "author": "Cable_Tugger",
        "title": "Equalizer 3 impossible to watch",
        "content": "I've just settled down to watch Equalizer 3 for some Sunday silliness and there's no way to understand the Italian parts without CC!\nI don't need to know when a [gun clicks], there are [footsteps in the distance] or [a butterfly flaps its wings in Peru]. I just want a translation of everything that isn't in English!\nHow hard can it be?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1lcdm9f/equalizer_3_impossible_to_watch/"
    },
    {
        "id": "1lbs9pz",
        "author": "FinalRecognition4514",
        "title": "The Straw plot twist",
        "content": "The movie was good but one thing I don’t understand is the lady at the school. How tf do you see a woman drop off a kid that doesnt exist and then hours later she comes to the school claiming she got a call about her daughter that once again… doesn’t exist. and you mean to tell me no one told her that her daughter died or at least told her  “look here crazy lady you’re daughter isn’t even here” the school hallucination scene was so far off of what actually happened ",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lbs9pz/the_straw_plot_twist/"
    }
]