[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 499,
        "comments": 274,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 16,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jr60tx",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix has 3 shows on Nielsen's Top 10 Overall for the week of March 3 to March 9",
        "content": "",
        "upvotes": 13,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jr60tx/netflix_has_3_shows_on_nielsens_top_10_overall/"
    },
    {
        "id": "1jrd7mn",
        "author": "indiewire",
        "title": "The 27 Best Movies Unavailable on Streaming",
        "content": "",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jrd7mn/the_27_best_movies_unavailable_on_streaming/"
    },
    {
        "id": "1jqfst1",
        "author": "celestialhvrt",
        "title": "Netflix Actor Cem Yiğit Üzümoğlu arrested after promoting consumption boycott.",
        "content": "Cem Yiğit Üzümoğlu, has starred in Netflix shows such as \"The Protector\" and \"Rise of Empires: Ottoman\" and he was the famous actor of Mehmed The conqueror. \n\nIn Istanbul, arrest warrants were issued for 16 people who called for a consumption boycott on April 2 via social media. As part of an investigation launched by the Istanbul Chief Public Prosecutor’s Office on charges of \"hate and discrimination\" and \"inciting the public to hatred and hostility,\" 11 suspects, including actor Cem Yiğit Üzümoğlu, have been detained. The police are still searching for five other individuals. (The boycott was launched in response to the lack of impartial media coverage during the process that began with Ekrem İmamoğlu's detention and continued with his arrest, as well as the arrest of hundreds of young people.\nOn 2 April, the boycott turned into a general one-day action to demonstrate the power of the public through consumption and to send a message to the entire market. Alongside millions of citizens, numerous public figures also supported the boycott calls.)\n\nSource: HalkTv, BirGün Daily",
        "upvotes": 123,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jqfst1/netflix_actor_cem_yiğit_üzümoğlu_arrested_after/"
    },
    {
        "id": "1jqkqka",
        "author": "thefabgar",
        "title": "Netflix HDR10+ support, only for 2025 TV models, for now... Is this a joke?",
        "content": "",
        "upvotes": 35,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1jqkqka/netflix_hdr10_support_only_for_2025_tv_models_for/"
    },
    {
        "id": "1jqxy2h",
        "author": "dhantantan",
        "title": "Recommendations like With Love Meghan",
        "content": "..but better.\n\nI loved the show's genre! Not to dunk on Meghan. I'm sure she tried her best. But I would love to watch another one of the same genre that's more.. Earnest? With a more articulate host; good chemistry with the guests (if any); more about the fun, slice of life, &amp; things being done than self-congratulating the host, etc.",
        "upvotes": 7,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jqxy2h/recommendations_like_with_love_meghan/"
    },
    {
        "id": "1jqdtmk",
        "author": "Legitimate_Ad3625",
        "title": "‘Adolescence’ Dethrones ‘Stranger Things 3’ and ‘Bridgerton 2’ on Netflix’s All Time Most Popular TV List With 96.7 Million Views",
        "content": "",
        "upvotes": 65,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1jqdtmk/adolescence_dethrones_stranger_things_3_and/"
    },
    {
        "id": "1jqtpok",
        "author": "MamaMia1325",
        "title": "Million Dollar Secret EP 4-6 (SPOILERS!!!)",
        "content": "First, let me say I'm so glad that Chris is finally gone. What a piece of work he was. He thought he was god's gift to women and what was with that comment at the end about him being Prince charming?? 🤦.\n\n I didn't really care for Sam in the 1st 3 episodes but she's one of my favorites now.\n\nSydnee is playing all the men like fiddles. Those men were pathetic- all it took was a pretty girl with a nice body to show them a little attention and they turned to jelly....(Good for her though.) I wasn't sure if she and Phil had a thing or her and Chris did. \n\nOverall, I enjoyed these three episodes more than the first three. But I liked them all. I'd love to see more seasons of the show. There's still some tweaking for them to do. \n\n***Edited to add-\nThis is by far my favorite podcast I've listened to that talks about this show.  \n\nSo far there are 2 episodes, one of them talks about 1-3 and the next one talks about 4-6.\n\nhttps://open.spotify.com/episode/7eUJyjTkELE2KfbxGHbqkF?si=N_LIduBhTuaX7OB6ws5hjw\n",
        "upvotes": 9,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1jqtpok/million_dollar_secret_ep_46_spoilers/"
    },
    {
        "id": "1jqw8jv",
        "author": "Zealousideal-Elk8908",
        "title": "Devil May Cry…",
        "content": "The new series of Devil May Cry is starting off pretty good. I had to look up the voice cast of the series and I have to say it was very strange seeing Kevin Conroy’s name. I thought maybe his son or someone else by the same name but then I progressed further into the first episode and I heard it… that heavenly Batman voice we grew up with as kids it’s unmistakably HIS voice for sure. His lines and role were done before his passing. Hearing his voice again truly brought a smile to my face",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jqw8jv/devil_may_cry/"
    },
    {
        "id": "1jr1ffl",
        "author": "OzorMox",
        "title": "PIN with games when offline",
        "content": "Does anyone else have issues playing games offline when they have a PIN set on their profile?\n\nI've been trying to play Civilization VI and it works fine online, but offline it will tell me my PIN is incorrect. I saw in a few places that 0000 should work but it doesn't for me.\n\nFor now I have removed the PIN but I wondered if this is a known bug? And also does it only affect Civ or all Netflix games?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jr1ffl/pin_with_games_when_offline/"
    },
    {
        "id": "1jqwpov",
        "author": "Bdgamer070",
        "title": "Seasons not showing up",
        "content": "I am watching outlander on Netflix and My TV in my bedroom shows a 7th season my living room TV only shows a 6th season why is that? One TV I use a fire stick and the other one is just a Roku TV.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jqwpov/seasons_not_showing_up/"
    },
    {
        "id": "1jqw1ps",
        "author": "SmallPresentation446",
        "title": "Is Rick and Morty off Netflix?",
        "content": "I started watching rick and Morty a few weeks ago on Netflix since it was not in there in the past. Today when I wanted to watch I saw it was not in there. Is Rick and Morty off Netflix now?\nI’m in Mexico btw so idk if it’s because of that",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jqw1ps/is_rick_and_morty_off_netflix/"
    },
    {
        "id": "1jrfbhb",
        "author": "IndividualPlace5423",
        "title": "Why is Netflix doing this?",
        "content": "I saw they just added Annie (2014) in March and our removing it at the end of April. Reason? I don't know so please answer. I know they do this a lot but I need to know why.",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1jrfbhb/why_is_netflix_doing_this/"
    },
    {
        "id": "1jqyfms",
        "author": "Longjumping_Sun_8707",
        "title": "Devil May Cry",
        "content": "Okay, Is it just me or did anyone else notice that Vice President Baines from Devil May Cry sounds like Arkham Knight Batman. Not to mention the superhero references...",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jqyfms/devil_may_cry/"
    },
    {
        "id": "1jpqjpy",
        "author": "dailystar_news",
        "title": "Bodybuilder Netflix star dies 'on treadmill at gym' day after chilling selfie",
        "content": "",
        "upvotes": 799,
        "comments": 137,
        "media": null,
        "permalink": "/r/netflix/comments/1jpqjpy/bodybuilder_netflix_star_dies_on_treadmill_at_gym/"
    },
    {
        "id": "1jqig06",
        "author": "Intro-Nimbus",
        "title": "Why is netflix spoiling its own shows? Do they want us to stop watching?",
        "content": "Example: \"Drive to survive\" has spoilers for the next episode at the end of the episodes. Well, if you already spoiled it, I guess I won't watch another episode.\n\nIt's great for shutting down binge watching, but usually I just see if HBO has something that they don't intentionally spoil available.\n\nAnd when you spoil the current episode by putting in a spoiler about what will happen \\_this- episode, I won't even watch the first one.\n\nNetflix, you're not competing with TV channels anymore, when someone starts watching an episode they already intended to see it, trying to hook people oldshool TV-style just drives them away.",
        "upvotes": 11,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1jqig06/why_is_netflix_spoiling_its_own_shows_do_they/"
    },
    {
        "id": "1jr9v72",
        "author": "Calm-Bug5455",
        "title": "adolescence left me wanting more and it left me with unanswered question",
        "content": "before you come for me, yes i know this is not what the point of the movie was but after finishing it, i really wish i could’ve seen more. and this is not me complaining about the movie, as i would still give it a very high rating and i really enjoyed the production, acting, cast, plot, etc. i wanted to see more of jamie’s sentence, his interactions with psychologists, his life in jail, more of jade’s story and coping after katie’s passing, more of bascombe and adam, more about tommy and ryan and the weapon, more of lisa, maybe even some of katie’s family and their way of processing the events, but maybe that was just me being greedy lol. i absolutely loved the series but i just wish it had gone more in depth, it just didn’t go far enough with the storyline for my personal taste.",
        "upvotes": 0,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1jr9v72/adolescence_left_me_wanting_more_and_it_left_me/"
    },
    {
        "id": "1jqmhoq",
        "author": "MysteriousDelay6266",
        "title": "FUBAR Season 2 Release Date (JUNE 12) On Netflix, First Look At New Cast",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jqmhoq/fubar_season_2_release_date_june_12_on_netflix/"
    },
    {
        "id": "1jqk5b1",
        "author": "OrdinaryWheel5177",
        "title": "Secret millionaire new episodes",
        "content": "I’m still liking this show after latest episodes released. I’ll add im super happy they got rid of Chris. No one likes that dude more than Chris. I hope jaimi gets the boot too. Way too much drama for me. ",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1jqk5b1/secret_millionaire_new_episodes/"
    },
    {
        "id": "1jqllyf",
        "author": "MysteriousDelay6266",
        "title": "The Gardener | Official Trailer | Netflix | APRIL 11",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jqllyf/the_gardener_official_trailer_netflix_april_11/"
    },
    {
        "id": "1jqwko6",
        "author": "KyleGrizz",
        "title": "Finding a show Mideval setting, foreign language (Romanian or other Slavic) comedy show like The Office with interviews usually had an hour episode run time, help?",
        "content": "It was very much a comedy, I recall it followed a father who was a noble and he was dumb but thought he was smart, it was a recent show had to be shot with the past 10 years. \nIt was on Netflix USA, I think the show title was the year the show was based in.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1jqwko6/finding_a_show_mideval_setting_foreign_language/"
    },
    {
        "id": "1jqvh8z",
        "author": "Waffle_Samurai0",
        "title": "Tv show",
        "content": " I watched this Netflix tv show a while back but I can’t remember the name it was a guy who had a friend over video games and he had a problem on his face and I think the protagonist killed his neighbor and his girlfriend cat",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jqvh8z/tv_show/"
    },
    {
        "id": "1jr9nub",
        "author": "WelshWolf93",
        "title": "How is Adolescence about Toxic Masculinity?",
        "content": "I just finished the show last night, and thought it was spectacular. I'm just a bit confused about one thing.\n\nEverywhere, this is hailed as showcasing the problems of toxic masculinity, but Jeremy wasn't a \"believer\" of the Incel stuff and said he looked it up but didn't like it. The only thing he agrees with is the \"80/20\" rule, which is just the Pareto Principle applied to relationships as opposed to land, wealth or other things. His dad wasn't typically 'toxic', if anything it seems like his grand-dad was, and Jeremy's dad was deliberately different to that.\n\nOn top of this, it implies that he confronts the girl specifically because she is calling him an incel on his photos, and using \"manosphere\" emojis to make it seem like he is part of the incel or Andrew tate stuff. But everywhere is saying \"the dangers of toxic masculinity\" as if he's a mini brainwashed Andrew Tate. \"the dangers of repeatedly humiliating and bullying an unhinged child until he stabs you to death\" is a more apt description\n\nI get that there is a lot of nuance in terms of Jeremy's psychology- but to me the show seemed to be about a kid who was bullied until he lost his temper and committed murder. I didn't see anything to suggest that the outcome would have been different if the person bullying him was a boy. I don't see how Andrew Tate or masculinity had any cause/effect here.\n\nPeople seem to collectively agree that he stabbed her because she turned him down - but on the tape he was talking/arguing pretty passively until she pushed him over and he snapped. It appeared that he was basically threatening her to stop - she called his bluff and pushed him over, his pride got hurt and he went psycho mode.\n\nThe show is still fantastic, but I genuinely don't see why all the Andrew tate/manosphere/toxic masculinity stuff was included. You could take it out of the story and have her bullying him online with literally any other emoji. She could have just as easily tried to convince everyone he was a racist, as opposed to an incel - would the show then be all about the dangers of racism?\n\nI'm sure I'm looking at this from the wrong angle since everyone else is on the same page, was just wondering if someone could put it into perspective for me please",
        "upvotes": 0,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1jr9nub/how_is_adolescence_about_toxic_masculinity/"
    },
    {
        "id": "1jr1kn4",
        "author": "muffinpie90",
        "title": "Love On The Spectrum Is Problematic",
        "content": "",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1jr1kn4/love_on_the_spectrum_is_problematic/"
    },
    {
        "id": "1jqs0y4",
        "author": "abernasty42",
        "title": "Anyone recovered their account after it was hacked/stolen?",
        "content": "I've had netflix since 2008.  A month ago my card was stolen in a data leak, no big deal. Cancel card and shred it at the bank.  Fast forward 3 weeks and all my netflix accounts are logged out. Username not found. hmm.  Just found an email in my spam folder on the same day my card was stolen that my email and password were changed.  Netflix only requires the debit card number to change an account (glad I had a good password!)  Netflix customer service says they can't verify I'm the actual account holder since I don't have the old debit card number anymore. I have years of bank transactions, dates of plan changes, IP address, etc.. Not good enough for them, it's got to be the number of the stolen debit card that I shredded at the bank (who doesn't keep records of debit card numbers once they are cancelled apparently).\n\nHas anyone every successfully recovered a stolen account or is it just SOL to my algorithm and move on?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jqs0y4/anyone_recovered_their_account_after_it_was/"
    },
    {
        "id": "1jqqa60",
        "author": "Smaug117",
        "title": "Netflix's Devil May Cry Review: A Devilishly Good Adaptation",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jqqa60/netflixs_devil_may_cry_review_a_devilishly_good/"
    },
    {
        "id": "1jq5mz1",
        "author": "Emergency-Message424",
        "title": "Secret millionaire show",
        "content": "This show is okay but man what’s the purpose of guessing the millionaire? Right or wrong there’s no consequence or reward. You’re better off just getting rid of the strongest competitors like any other show..",
        "upvotes": 22,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1jq5mz1/secret_millionaire_show/"
    },
    {
        "id": "1jqsp41",
        "author": "AIONisMINE",
        "title": "Cancelling netflix while having a netflix credit balance.",
        "content": "i have a significant netflix credit balance due to giftcards.\n\ni dont have any other payment method attached to my netflix account.\n\nwill there be any issues if i were to cancel my netflix subscription?\n\nmy netflix credit will still be there untouched until i decided to subscribe again, correct?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jqsp41/cancelling_netflix_while_having_a_netflix_credit/"
    },
    {
        "id": "1jqv7e9",
        "author": "IhatethatIdidthis88",
        "title": "Household question",
        "content": "So, I am thinking of getting netflix. And I plan to be seeing it via my browser on my pc. However in a few months, I will be moving out. New internet. New IP.\n\nWhat's the deal, can I watch still, from my browser? Do I need to delete my account and restart it? Can I restart account with existing email?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jqv7e9/household_question/"
    },
    {
        "id": "1jqxe3p",
        "author": "Ok_Slice5487",
        "title": "What Netflix plan should I get?",
        "content": "I have been off of Netflix for few years when they started password sharing crackdown. I am looking to get my own account and share it with my parents. I live in the US and my parents live in India.\n\nI need an account that would work for the both of us though my parents don't watch Netflix a lot. Can I get the standard plan and my parents can occasionally use that account in India? Also I travel to India frequently and would like use my account there, would it be allowed without issues?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jqxe3p/what_netflix_plan_should_i_get/"
    },
    {
        "id": "1jqix3o",
        "author": "sp00kynico",
        "title": "sonic profile picture not showing up on my account",
        "content": "Hi, I know there was a 5 year old thread already about pictures varying from profile to profile, but I've tried everything they suggested and still no luck. My brothers and my parents all managed to change their icons to Sonic ones, but the option doesn't show up SPECIFICALLY on my profile. Is there a solution to this? Maybe it's age restricted, even though I highly doubt that's the case? I've even tried watching a full episode of it, but they're still not available to me. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jqix3o/sonic_profile_picture_not_showing_up_on_my_account/"
    }
]