[
    {
        "id": "1pqbjno",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Avatar: Fire and Ash / The Housemaid / The SpongeBob Movie: Search for SquarePants)",
        "content": "**New In Theaters**:\n\n* [Avatar: Fire and Ash](https://old.reddit.com/r/movies/comments/1pqbh9u/official_discussion_avatar_fire_and_ash_spoilers/?)\n* [The Housemaid](https://old.reddit.com/r/movies/comments/1pqbhad/official_discussion_the_housemaid_spoilers/?)\n* [The SpongeBob Movie: Search for Squarepants](https://old.reddit.com/r/movies/comments/1pqbhbe/official_discussion_the_spongebob_movie_search/?)\n\n**Awards Run Catch-Up**\n\n* [Sentimental Value](https://www.reddit.com/r/movies/comments/1pkhnsl/official_discussion_sentimental_value_spoilers/)\n* [It Was Just an Accident](https://www.reddit.com/r/movies/comments/1pkhnwc/official_discussion_it_was_just_an_accident/)\n\n**25th Anniversary Throwback Discussion Threads**:\n\n**No throwbacks this week as we try to align the weeks so we can continue next year. Next batch of movies were Christmas day releases so we will post them with the Christmas day '26 releases.**\n\n**Still In Theaters**:\n\n* [Ella McCay](https://www.reddit.com/r/movies/comments/1pkhnoq/official_discussion_ella_mccay_spoilers/)\n* [Five Nights at Freddy's 2](https://old.reddit.com/r/movies/comments/1pekchd/official_discussion_five_nights_at_freddys_2/?)\n* [Hamnet](https://old.reddit.com/r/movies/comments/1pekcj2/official_discussion_hamnet_spoilers/)\n* [Zootopia 2](https://www.reddit.com/r/movies/comments/1p7rbyf/official_discussion_zootopia_2_spoilers/?)\n* [Eternity](https://www.reddit.com/r/movies/comments/1p7rc0x/official_discussion_eternity_spoilers/?)\n* [Wicked: For Good](https://old.reddit.com/r/movies/comments/1p2njr5/official_discussion_wicked_for_good_spoilers/?)\n\n**New On Streaming:**\n\n* [Wake Up, Dead Man](https://old.reddit.com/r/movies/comments/1plb82b/official_discussion_wake_up_dead_man_a_knives_out/?)\n* [Jay Kelly](https://old.reddit.com/r/movies/comments/1pg2zf7/official_discussion_jay_kelly_spoilers/?)\n* [Train Dreams](https://www.reddit.com/r/movies/comments/1p4qwxk/official_discussion_train_dreams/)\n* [PBS's The American Revolution](https://www.reddit.com/r/movies/comments/1p4qsya/official_discussion_pbs_the_american_revolution/)\n* [Nouvelle Vague](https://old.reddit.com/r/movies/comments/1oyaqq6/official_discussion_nouvelle_vague_spoilers/?)\n* [Playdate](https://old.reddit.com/r/movies/comments/1oyaqsm/official_discussion_playdate_spoilers/?)\n* [Frankenstein (2025)](https://old.reddit.com/r/movies/comments/1orfrtf/official_discussion_frankenstein_2025_spoilers/)\n* [Hedda](https://old.reddit.com/r/movies/comments/1orfruj/official_discussion_hedda_spoilers/?)\n* [Ballad of a Small Player](https://www.reddit.com/r/movies/comments/1okihwe/official_discussion_ballad_of_a_small_player/?)\n* [A House of Dynamite](https://old.reddit.com/r/movies/comments/1ofgyx9/official_discussion_a_house_of_dynamite_spoilers/?)\n* [The Hand that Rocks the Cradle (2025)](https://old.reddit.com/r/movies/comments/1ofgz2p/official_discussion_the_hand_that_rocks_the/?)",
        "upvotes": 62,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1pqbjno/official_discussion_megathread_avatar_fire_and/"
    },
    {
        "id": "1pn8e8n",
        "author": "TestamentOfAnnLeeAMA",
        "title": "Hi /r/movies! I'm Thomasin McKenzie. You might know me from Jojo Rabbit, Last Night In Soho, Leave No Trace, Old, Eileen, Fackham Hall, and The Power of the Dog. My next movie, The Testament of Ann Lee, premiered at Venice and is out in theaters next week. Ask me anything!",
        "content": "Hi reddit! I'm Thomasin McKenzie, here to answer your questions.\n\nYou might know me from **Jojo Rabbit**, **Last Night In Soho**, **Leave No Trace**, **Eileen**, **Fackham Hall**, **The Power of the Dog**, **Pantheon**, **Old**, **The King**, and **True History of the Kelly Gang**.\n\nMy next movie is **The Testament of Ann Lee**, out in theaters Christmas.\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\n**The Testament of Ann Lee,** is out in theaters nationwide starting December 25 via Searchlight Pictures. It's directed and co-written by Mona Fastvold. Score by Daniel Blumberg.\n\nIt also stars Amanda Seyfried, Lewis Pullman, Tim Blake Nelson, Christopher Abbott, Stacy Martin, Matthew Beard, Scott Handy, Viola Prettejohn, Jamie Bogyo, and David Cale.\n\n*Synopsis:*\n\nAnn Lee, the founding leader of the Shaker Movement, proclaimed as the female Christ by her followers. Depicts her establishment of a utopian society and the Shakers' worship through song and dance, based on real events.\n\n*Trailer:*\n\n[https://www.youtube.com/watch?v=-zK\\_nzG36mk](https://www.youtube.com/watch?v=-zK_nzG36mk)\n\nAsk me anything! I'll be back today Monday 12/15 at around 4:30 PM ET to answer your questions.",
        "upvotes": 1882,
        "comments": 250,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/z7rja9ak0d7g1.png?auto=webp&amp;s=c6f32f181c59ea6fcb98491e729977ac5acd4978"
        },
        "permalink": "/r/movies/comments/1pn8e8n/hi_rmovies_im_thomasin_mckenzie_you_might_know_me/"
    },
    {
        "id": "1pubbyo",
        "author": "Bennett1984",
        "title": "Unconventional Christmas Movies That Aren't Die Hard",
        "content": "",
        "upvotes": 2092,
        "comments": 1304,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xZK2Q0wZCS-vU5rKubtrvvhsRlqQT1pHzlIBOsgSf4M.jpeg?auto=webp&amp;s=f946eec048a6a3374fcac24efba6daf0d543e8dc"
        },
        "permalink": "/r/movies/comments/1pubbyo/unconventional_christmas_movies_that_arent_die/"
    },
    {
        "id": "1ptumrx",
        "author": "MarvelsGrantMan136",
        "title": "Avengers: Doomsday | Only in Theaters December 18, 2026",
        "content": "",
        "upvotes": 8404,
        "comments": 3768,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QAxanEvJSrFxDphFyNsAcsf3TUOqLNKSgL0tATjfsb0.jpeg?auto=webp&amp;s=5c2b1b3a26236bb74b98e7763064558a3eac0fcf"
        },
        "permalink": "/r/movies/comments/1ptumrx/avengers_doomsday_only_in_theaters_december_18/"
    },
    {
        "id": "1ptuqy6",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'Avengers: Doomsday'",
        "content": "",
        "upvotes": 7016,
        "comments": 1016,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/r8cet9mmny8g1.jpeg?auto=webp&amp;s=0df6e2b1363b93d397ff570643326b6809d4ff2e"
        },
        "permalink": "/r/movies/comments/1ptuqy6/official_poster_for_avengers_doomsday/"
    },
    {
        "id": "1ptzfju",
        "author": "MarvelsGrantMan136",
        "title": "‘Legend of Aang: The Last Airbender’ Will Skip Theaters and Debut on Paramount+ Alongside New ‘Safe Havens’ Series",
        "content": "",
        "upvotes": 2072,
        "comments": 297,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GJ7-BWKDZWoBYs3pqsNmWVu3Kxs7AmPme5QB5x1rKhw.jpeg?auto=webp&amp;s=7b6d8ac6f150cd5d38df7e070bd5fec9f5889fa5"
        },
        "permalink": "/r/movies/comments/1ptzfju/legend_of_aang_the_last_airbender_will_skip/"
    },
    {
        "id": "1pubpz0",
        "author": "Sasuke_was_right",
        "title": "Why do movies from the 80s and 90s feel better to watch?",
        "content": "Pretty much what the title says. I've been watching a lot of \"older\" movies recently (Gremlins, The Goonies, Halloween, etc) and something about them just feels more fulfilling to watch. Full disclosure, I'm 27 so nostalgia might play a role in it. Still, I've noticed \"newer\" movies often leave me feeling unfulfilled. There are even a few I've watched that have left me feeling nauseous; not from any particular content, but more from color saturation/camera techniques/I don't even know. Does anyone else experience this? Beyond just nostalgia I mean.",
        "upvotes": 297,
        "comments": 209,
        "media": null,
        "permalink": "/r/movies/comments/1pubpz0/why_do_movies_from_the_80s_and_90s_feel_better_to/"
    },
    {
        "id": "1ptz83g",
        "author": "SanderSo47",
        "title": "'Anaconda' (2025) Review Thread",
        "content": "[Rotten Tomatoes](https://www.rottentomatoes.com/m/anaconda_2025): 46% (57 reviews) with 5.40 in average rating\n\n[Metacritic](https://www.metacritic.com/movie/anaconda-2025/): 44/100 (25 critics)\n\nAs with other movies, the scores are set to change as time passes. Meanwhile, I'll post some short reviews on the movie. It's structured like this: **quote first, source second.** Beware, some contain spoilers.\n\n&gt; While the new film dutifully serves up the callbacks you’d expect, you never get a sense of why these buddies connected to this property more than any other. It’s enough to make me wish I could have seen Doug’s The Anaconda instead. Sure, his “indie-style” project seems to feature a nonsense plot, amateurish acting and extremely questionable action. But at least it would be a labor of love. Gormican’s Anaconda is just a big-budget IP extension trying to pretend it’s something sweeter and scrappier than it is. You don’t need to fall prey to its pretense.\n\n-[Angie Han, The Hollywood Reporter](https://www.hollywoodreporter.com/movies/movie-reviews/anaconda-review-paul-rudd-jack-black-1236454664/)\n\n&gt; “Anaconda” constricts its premise a little tighter as it moves along (if only because the absurdity ratchets up in a way that forces the film to adopt a clearer sense of itself), and there are some undeniably amusing bits of stupidity along the way. The post-modern stuff tends to fall flat, but, say, the sequence where Jack Black runs for his life with a regurgitated hog strapped to his back is hard to deny. And honestly, all I’ve ever asked of a movie — any movie — is that it make at least two jokes at Jon Voight’s expense, and on that score I have no choice but to acknowledge that Gormican’s meta-sequel delivers, if only just. Still, this self-reflexive Hollywood sendup is so slapdash and unsure of itself that it ultimately feels less like a bad in-joke than a case of a snake eating its own tail. \n\n-[David Ehrlich, IndieWire](https://www.indiewire.com/criticism/movies/anaconda-movie-review-2025-paul-rudd-jack-black-1235169505/): C\n\n&gt; The movie could have really used some of that anarchic, industry-skewering “Tropic Thunder” energy. The only risk taken here was asking Sony — plus any surviving members of the original cast — to poke fun at themselves, which only goes so far when the film has no fangs.\n\n-[Peter Debruge, Variety](https://variety.com/2025/film/reviews/anaconda-review-1236610556/)\n\n&gt; Anaconda is a disappointing follow-up for Gormican, who cannot crack the code on Sony's bewildering aquatic not-really-horror reboot. A cast of proven funny people are lost in a thick brush of hacky bits and ineffective storytelling, unable to machete their way through to a redeeming climax. There are brief bursts of creature-feature excitement and belly-tickling humor, but way more stretches of bafflingly unclear ambitions that feel like they're struggling to keep the \"movie within a movie\" gimmick afloat. It's Anaconda without the aqua-horror chills, throwback practical effects, and midnight-movie entertainment — what an odd choice.\n\n-[Matt Donato, IGN](https://www.ign.com/articles/anaconda-2025-review-jack-black-paul-rudd): 4 out of 10 \"bad\"\n\n&gt; If “Anaconda” had actually been made for $40,000 — no stars, all new faces — its pluckiness might have shined through and a message of some kind might actually have been made. Or at least, to quote Gormican’s movie, “Themes!” Instead we get a movie where big name actors punch downward, at the helpless “Anaconda” movies, and at audiences who like “Anaconda” movies, and at all the low-budget filmmakers who work very hard to make good movies, even the schlocky ones. When all is said and done, it can’t hold a candle to all the genuine, ultra-low budget, unapologetic claptrap it’s lampooning. Well, except for “Anacondas: Trail of Blood.” They can’t all be winners. The new “Anaconda” proves that.\n\n-[William Bibbiani, TheWrap](https://www.thewrap.com/creative-content/movies/anaconda-review-paul-rudd-jack-black-thandiwe-newton/)\n\n&gt; Regrettably, the one star of Anaconda that gets the shortest shrift is the most important one: the snake. While the film features some monstrous attacks, they play out like something out of an especially uninspired SNL digital short. Sure, the original film and its increasingly lower-budgeted sequels may be funny, but they still pay respect to their creature-feature roots. If Gormican and company had more seriously considered why this particular piece of I.P. continues to resonate, the film may have potentially balanced the horror and comedy elements in a manner that would have satisfied both fans and newcomers to the series.\n\n-[Mark Hanson, Slant](https://www.slantmagazine.com/film/anaconda-review-jack-black-paul-rudd/): 2/4\n\n&gt; Rudd and Black make the new Anaconda easy enough to accept as a comedy with a dash of clunky effects-based creature action, rather than a full-blown horror-comedy. Intense fandom of the earlier film isn’t necessary to have a good-enough time at this one, and Gormican deserves some credit for smuggling a mid-2000s-style studio comedy back into theaters under the guise of IP (the universal desire for which also gets shouted out here, naturally). Anaconda never reaches the delirious heights of Steve Martin’s similarly themed comedy Bowfinger. But it shares more DNA with that movie than some silly giant snake.\n\n-[Jesse Hassenger, The Guardian](https://www.theguardian.com/film/2025/dec/23/anaconda-review-jack-black-paul-rudd): 3/5\n\n&gt; Anaconda may be getting the benefit of the doubt here because of how few studio comedies make it to theaters. In another era, it might easily have gotten lost in a wave of post-modern updates that included The Brady Bunch and Starsky &amp; Hutch. Its plot offers few surprises, but its simple foundations and character motivations give Rudd and Black so much room to play that it’s an amiable time. The two stars keep the energy and charisma in strong supply, while their film uses low expectations to its advantage, knowing that a good comedy doesn’t need to squeeze too hard.\n\n-[Matt Schimkowitz, The A.V. Club](https://www.avclub.com/anaconda-review-2025): B–\n\n&gt; Anaconda’s early scenes, set in Buffalo and seemingly shot there, look appropriately shabby; the interiors are cluttered and drab, and filled with overexposed daylight pouring in from unshaded windows. For a couple of minutes, Rudd and Black’s characters get to act like authentic friends who’ve lost touch and reconnected over their mutual love of movies, over this art form’s power to tell stories that unite people in the dark through their shared connection and humanity. Then they go and run from a CGI snake for an hour. One sad I thought had watching Anaconda: If this is the only stuff modern Hollywood makes now, would these aspiring auteurs even want to work there anymore?\n\n-[Matt Singer, Screen Crush](https://screencrush.com/anaconda-2025-review/): 4/10\n\n&gt; The thing about a film like the original Anaconda is that arguments about whether it was good or not are beside the point — it fell squarely into that prime Blockbuster Video era in which a film could be so inescapable that its quality for a certain generation is incidental. A sequence in which Doug, Griff, Kenny, and Claire reminisce gleefully about scenes from this bit of pop-culture ephemera they caught during college gets at this fact perfectly, that what they’re pining for is not the movie itself, but this stretch of their lives in which they had time to hang out with their friends. The rest of Anaconda, which involves a quirky Brazilian snake handler played by Selton Mello and a mysterious local with dangerous secrets played by Daniela Melchior, unfolds clumsily and, worse, too earnestly, as though the point all along were to rediscover the magic of filmmaking. Son of Rambow this isn’t. Anaconda may have always been asking too much of its source material, but this reboot has been fatally defanged.\n\n-[Alison Willmore, Vulture](https://www.vulture.com/article/review-jack-blacks-anaconda-asks-too-much-of-nostalgia.html)\n\n____________________________________________________________________________________________\n\n**PLOT**\n\nFour childhood friends: Doug, Griff, Kenny, and Claire, seeking to recapture their youth, travel to the Amazon to film an amateur remake of the 1997 film *Anaconda*. Their project unravels when a real giant anaconda emerges, turning the light-hearted shoot into a perilous fight to stay alive. The movie that they're dying to remake? It might just kill them, literally.\n\n**DIRECTOR** \n\nTom Gormican\n\n**WRITERS**\n\nTom Gormican &amp; Kevin Etten\n\n**MUSIC**\n\nDavid Fleming\n\n**CINEMATOGRAPHY**\n\nNigel Bluck\n\n**EDITORS**\n\nCraig Alpert &amp; Gregory Plotkin\n\n**RELEASE DATE** \n\nDecember 25, 2025\n\n**RUNTIME**\n\n99 minutes\n\n**BUDGET**\n\n$45 million\n\n**STARRING**\n\n- Paul Rudd as Ronald \"Griff\" Griffen Jr.\n\n- Jack Black as Doug McCallister\n\n- Steve Zahn as Kenny Trent\n\n- Thandiwe Newton as Claire Simons\n\n- Daniela Melchior as Ana Almeida\n\n- Selton Mello as Santiago Braga\n\n- Ione Skye as Malie McCallister",
        "upvotes": 1388,
        "comments": 352,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/E58yGs7unoHs9_ALTFzWcrE_xGby9_D98hV-mxvbCYA.jpeg?auto=webp&amp;s=0ec587f8ac40e77f7f81bc8ab0bd3a22fd756baf"
        },
        "permalink": "/r/movies/comments/1ptz83g/anaconda_2025_review_thread/"
    },
    {
        "id": "1pua0dv",
        "author": "ReadWriteArithmetic",
        "title": "Rewatching Ben-Hur (1959), this movie really has stood the test of time. What other old films fall into that category?",
        "content": "Even though the movie was released over 60 years ago, and the movie is really long, 3 hours 42 minutes, it is really easy to watch and never feels like it is dragging on too slowly. Great story from start to end, and excellent acting. Also, it doesn't have that 'old film' effect some movies have as they age (as in, you watch some movies and think, I can see how it was seen as great at the time, but now with advances in technology, I can't really sit through this). \n\nWhat others old movies, lets say 40 years and older, have really stood the test of time? ",
        "upvotes": 258,
        "comments": 369,
        "media": null,
        "permalink": "/r/movies/comments/1pua0dv/rewatching_benhur_1959_this_movie_really_has/"
    },
    {
        "id": "1puaoag",
        "author": "BunyipPouch",
        "title": "Laura Dern Reflects on a Year of Personal Grief, Industry Anxiety and Great Movies",
        "content": "",
        "upvotes": 180,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/62eD7KgGLRNEq0t262bYREqDZGdiV5f0a1P5tb5XyiI.jpeg?auto=webp&amp;s=d4c232aad78fdf7a82036ae85a976f964d19d059"
        },
        "permalink": "/r/movies/comments/1puaoag/laura_dern_reflects_on_a_year_of_personal_grief/"
    },
    {
        "id": "1pu49mb",
        "author": "BunyipPouch",
        "title": "Alamo Drafthouse’s Terror Tuesday &amp; Weird Wednesday Expands Nationwide in 2026 - Both series are increasing from a handful of cities to every corporate Alamo theater nationwide, turning select weeknights each month into a celebration of cult, horror, and weird cinema.",
        "content": "",
        "upvotes": 421,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lVjZuTjSpeCbLn4-4j16B-AiqZMf82WrLUlqc3Ne3AU.jpeg?auto=webp&amp;s=036c222df3470ad11ba0b9cec28ae276271a2ac0"
        },
        "permalink": "/r/movies/comments/1pu49mb/alamo_drafthouses_terror_tuesday_weird_wednesday/"
    },
    {
        "id": "1pu85ph",
        "author": "Lonelyasian3",
        "title": "What movie and its sequel/s made you think, \"how the heck did we get here?\"",
        "content": "For me, it was The Fast and The Furious series. I know it's always been about heists, but I wish they kept the charm that the cars had in the first three movies. But to be fair, the cars shown were always the latest models of each era. But even then, from highway heists to space. Makes you wonder sometimes.",
        "upvotes": 184,
        "comments": 284,
        "media": null,
        "permalink": "/r/movies/comments/1pu85ph/what_movie_and_its_sequels_made_you_think_how_the/"
    },
    {
        "id": "1ptqs0k",
        "author": "YourChopperPilotTTV",
        "title": "Black Dynamite (2009) Directed by Scott Sanders and starring Michael Jai White - Pimp Regional Meeting",
        "content": "",
        "upvotes": 1804,
        "comments": 208,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/fyybe776mx8g1/CMAF_270.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1ptqs0k/black_dynamite_2009_directed_by_scott_sanders_and/"
    },
    {
        "id": "1puaqr8",
        "author": "ColonelAngus2000",
        "title": "80’s films",
        "content": "so my 12 yo son has become obsessed with Stranger Things. I’ve explained to him that the show is set in the 1980’s. I suggested he watch some films from that decade but being 12 he’s showing his ignorance by not even entertaining the idea of watching 80’s movies. I watched John Carpenters The Thing with him a month ago and he seemed lukewarm on it, even though I knew he was scared shitless. \n\nSo what 80’s films would he actually enjoy? I suggested he check out The Goonies, well, because it has Bob from Stranger Things in it. Other than that I’m not sure he’d be receptive to any other movies I throw his way. I’m open to suggestions ",
        "upvotes": 115,
        "comments": 444,
        "media": null,
        "permalink": "/r/movies/comments/1puaqr8/80s_films/"
    },
    {
        "id": "1ptokh1",
        "author": "ThreadAndSolve",
        "title": "Movies that quietly trust the audience and never explain themselves",
        "content": "Some movies don’t stop to explain themselves. They move forward and assume you’re watching closely. Characters don’t always say what they feel. \n\nScenes don’t always resolve in neat ways. You’re expected to read between the lines.\n\nNo Country for Old Men does this in a very deliberate way. Important events happen without buildup or explanation. Violence arrives suddenly and leaves just as fast. The film never tells you what it all means. It just places you in that world and lets you sit with the consequences.\n\nThen there’s Lost in Translation. Almost nothing in it is spelled out. The connection between the characters' lives in small gestures, half conversations and shared silence. You understand what’s going on because you’ve probably felt it yourself at some point.\n\nWhat I like about movies like these is how they stay with you. You think about them later. You replay scenes in your head. On a second watch, things land differently because you’re bringing more of yourself into it.\n\nI’m curious which films made you feel this way. Movies that trusted you enough to stay quiet and let you do some of the work.",
        "upvotes": 2464,
        "comments": 994,
        "media": null,
        "permalink": "/r/movies/comments/1ptokh1/movies_that_quietly_trust_the_audience_and_never/"
    },
    {
        "id": "1pu8gd9",
        "author": "AnzoEloux",
        "title": "Any where the characters realize they're in a bootstrap paradox in the middle of it?",
        "content": "This is kind of niche but I notice that a lot of the time the protagonist doesn't realize the paradox until it's too late or they never realize what kind of situation they were in at all.\n\nI watched TENET recently, where the entire foundation of the movie is, putting a LONG exposition short, &gt;!based on effect coming before cause. But cause must happen eventually. It's paradoxical, but the protagonists use this to their advantage when they understand how things work. Unlike a bootstrap paradox, where the point of origin doesn't exist, you at least know what the cause is in TENET.!&lt;\n\nNow I'm not necessarily looking for something similar, but it fits the idea of the protagonists being in a bootstrap, and they can either accept it or fight against it (most likely failing, otherwise it wouldn't happen at all, right?). I don't care if they break the paradox or if they continue the cycle, I just want them to realize it sooner than the point of no return.",
        "upvotes": 144,
        "comments": 89,
        "media": null,
        "permalink": "/r/movies/comments/1pu8gd9/any_where_the_characters_realize_theyre_in_a/"
    },
    {
        "id": "1pu6viw",
        "author": "Buck-The-System",
        "title": "The greatest missed opportunity in the history of sequels...",
        "content": "Christmas 1992.\n\nThe lights in your theater dim. The trailer for Jurassic Park looks INCREDIBLE. Your movie starts.\n\nAfter getting in trouble for shooting his bullying older brother with a BB-gun, a 10-year-old boy travels to New York with his parents a few days before Christmas. After a traumatic incident a couple years ago, his parents don't like to let him out of their sight, and after the BB-gun shooting there's no way they're letting him stay home with the rest of his siblings.\n\nThe family checks into Trump's Plaza Hotel, where the boy's father is attending a business conference. As his parents mingle at a Christmas mixer with the other businessmen and their wives, the boy disobeys their command to stay with the childcare workers who have been tasked with watching all the much-younger children of the other executives, giving his babysitters the slip so he can wander the halls of the hotel, causing mischief and exploring.\n\nSuddenly, gunfire rings out as a slick group of Euro-trash terrorists disguised as a catering company seize control of the Christmas party, taking dozens of high-value hostages. In another part of the hotel, their children are ALSO taken hostage. All of their children, that is, BUT ONE...\n\nNow back in his room watching an old gangster movie, the boy doesn't initially realize that the gunfire isn't a part of the movie he's watching. Eventually, after drawing himself a luxurious bubble bath and setting up a TV where he can watch it while soaking, he steals some money from his parents' bags and goes out into the hall to find a vending machine. On his way, he runs across an MP5-toting terrorist, who gives him chase.\n\nThe boy runs back to his room and slams the door, locking out the terrorist in the nick of time. As the terrorist works to kick down the door, the boy looks desperately for a place to hide. The door bursts open and the terrorist storms in, taunting the boy as he tosses the room in search of him.\n\nWith only the bathroom left to search, a maniacal grin spreads across the terrorist's face. He moves slowly towards the bathtub, certain the boy is hiding in the water under a foot of bubbles. \"I've got him!\" he whispers into his radio. BUT, just as he's about to plunge his hands into the water, the boy slips out from behind a robe hanging on the wall, kicks the terrorist in the balls, and shoves him headlong into the bath. As the terrorist bellows with rage and tries to get up, the boy pushes the TV into the bathtub, horrifically electrocuting the terrorist to death.\n\nIn the aftermath of his first kill, the boy arms himself with the terrorist's MP5. It's one hell of an upgrade from his old Red Ryder. Next, he finds the terrorist's radio, which the terrorist had dropped to the floor after getting kicked in the nuts. With it, he works to make contact with the police and slips off into the night, using the hotel's ventilation system, elevator shafts, and dumb waiters to move about undetected.\n\nBack in the conference room where all the hostages are corralled, the boy's parents notice that the terrorists are extremely angry. They overhear talk of a terrorist being killed and a kid who is missing from the childcare center. They look at each other, wide eyed, and whisper:\n\n\"Only Kevin can drive someone that crazy...\"\n\nElsewhere in New York, a phone rings. A man gets up from dinner with his wife and kids to answer it. It's the chief of police, calling to tell the man they've got a situation. The man tells the chief he's not working tonight and he has to get back to his family. He's about to hang up.\n\n\"Wait!\" pleads the chief. \"You're going to want to hear this.\"\n\nThe man groans and keeps listening. The chief informs him that terrorists have seized dozens of hostages at The Plaza Hotel, but that one 10 year old boy is on the loose, has killed a terrorist, and is feeding information to the cops. SWAT has the building surrounded, but it's too dangerous to go in. The Chief thinks their only hope is to send in one man to find the kid and take over feeding the cops information from the inside. \n\n\"You're the only man on the force with experience in this kind of thing,\" finishes the chief. \"It has to be you.\" The man thinks. Looking back at his family and pondering the situation. For a moment, he says nothing.\n\n\"He's just a kid, John. He's alone, he's scared, and he hasn't seen diddly squat from us.\" The man sighs. He knows what he has to do.\n\n\"Fine... But there better be a limo waiting to pick me up when this is over,\" the man agrees, because it'll be a cold day in hell before Detective John McClane let's Kevin McCallister DIE ALONE.",
        "upvotes": 117,
        "comments": 32,
        "media": null,
        "permalink": "/r/movies/comments/1pu6viw/the_greatest_missed_opportunity_in_the_history_of/"
    },
    {
        "id": "1pugxxt",
        "author": "darthphallic",
        "title": "A Christmas Carol is probably the most retold Christmas story. What are your favorite version/s?",
        "content": "I enjoy the greater works of Dickens so “A Christmas Carol” is probably my favorite Christmas movie, but with so many versions how do you pick which one to watch each year?! \n\nI’m personally a sucker for “A muppets Christmas Carol” because for all the goofiness of the muppets and the saccharine songs Michael Caine plays Scrooge like he’s in a serious stage play and it uses more dialogue directly from the book than most other versions. \n\nI also enjoy the 2019 FX retelling. I know it’s not particularly popular because of the overly dark and gritty aesthetic as well as some questionable choices regarding Ms. Cratchit. HOWEVER I really appreciate how much time they dedicated to Scrooges past to explain how he became this gnarled old bastard instead of just kind hand waving it off. Guy Pierce also plays a fantastic Ebenezer.  \n\nAnyway, what are your favorite versions? Give me some new variants to watch this year. ",
        "upvotes": 23,
        "comments": 93,
        "media": null,
        "permalink": "/r/movies/comments/1pugxxt/a_christmas_carol_is_probably_the_most_retold/"
    },
    {
        "id": "1ptho3k",
        "author": "BunyipPouch",
        "title": "First Poster for Post-Apocalyptic Zombie-Thriller 'This Is Not A Test' - Five students take shelter in their high school during a zombie outbreak.",
        "content": "",
        "upvotes": 3935,
        "comments": 267,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/tb5ya3c32v8g1.jpeg?auto=webp&amp;s=5ee70709f310c15aee731e4d796c81a04c358f0a"
        },
        "permalink": "/r/movies/comments/1ptho3k/first_poster_for_postapocalyptic_zombiethriller/"
    },
    {
        "id": "1puf8h2",
        "author": "Yaeevaa",
        "title": "Who do you think is the worst movie character of all time?",
        "content": "An easy one for me is Dolores Umbridge. Imelda Staunton did an absolutely fabulous job making her so genuinely awful that every scene she’s in is hard to watch, which honestly says a lot about how effective the performance was. Dolores isn’t just cruel, she’s smug, self-righteous, and hides her abuse behind fake sweetness, which makes her even worse.\n\nAnother one is President Coin from *The Hunger Games*. I hated her from the get-go. She presents herself as calm and reasonable, but it becomes clear very quickly that she’s just as power-hungry and manipulative as Snow, if not more so. Her willingness to sacrifice innocent lives for control makes her incredibly unsettling.",
        "upvotes": 19,
        "comments": 111,
        "media": null,
        "permalink": "/r/movies/comments/1puf8h2/who_do_you_think_is_the_worst_movie_character_of/"
    },
    {
        "id": "1puehy6",
        "author": "LightningEdge756",
        "title": "Trailers tend to give away way too much these days, so what is your preferred way to learn about movies?",
        "content": "Been wanting to watch new trailers but I've noticed that nowadays they practically show you everything these days (This is especially common with horror movie trailers). \n\nSo what's a way I can find out about new movies to check out without already having the trailers show me tons? Any reliable suggestions?",
        "upvotes": 20,
        "comments": 44,
        "media": null,
        "permalink": "/r/movies/comments/1puehy6/trailers_tend_to_give_away_way_too_much_these/"
    },
    {
        "id": "1ptsu1d",
        "author": "TheHahndude",
        "title": "Unintentional comedy scenes in moves.",
        "content": "It happens to all of us. A scene that’s absolutely not intended to be comical comes off as hilarious. Sometimes it’s the whole audience and sometimes it’s just you personally who finds it funny but either way the scene just doesn’t come off the way the film intended.\n\nWhat are some movie scenes that you or the entire group couldn’t stop laughing at even though you knew or realized soon after that it wasn’t meant to be funny?\n\nWhen I saw The Northman the scene where Olga and Amleth board a boat to leave and start a new life and she tells him she’s pregnant and he immediately jumps off the boat and starts swimming back to shore I burst out laughing and most of the audience followed my lead. ",
        "upvotes": 337,
        "comments": 652,
        "media": null,
        "permalink": "/r/movies/comments/1ptsu1d/unintentional_comedy_scenes_in_moves/"
    },
    {
        "id": "1pudhta",
        "author": "TheSimpler",
        "title": "Finding Exceptional Films",
        "content": "I've been trying to watch the best new movies and also discover older films and those I missed in recent years. Rotten Tomatoes critics score and adding 10% of the audience score to get a number out of 110 and it hasn't failed me yet. \n\nI somehow missed \"Blow the Man Down\" from 2020 and just loved it. I also caught Kind Hearts and Coronets from 1949 with Alec Guiness playing 8 different parts in a really fun murder mystery with dark comedy elements. \n\nI tend to filter by one genre to work down from 100% critics score down to 85% or so. I've done Action, Scifi and Crime so far and can't believe how many great films are out there. \n\nAnyone have thoughts on this system? I find Idmb just too weird a rating out of 10 and so many poor films are 6.2 while great films are 7.1. Its just a mob rule score. ",
        "upvotes": 13,
        "comments": 8,
        "media": null,
        "permalink": "/r/movies/comments/1pudhta/finding_exceptional_films/"
    },
    {
        "id": "1pucbib",
        "author": "Terrible-Ice8660",
        "title": "Is the movie that Anwar Congo made in “the act of killing” also available.",
        "content": "The documentary “the act of killing” looks at Anwar Congo making a movie about how he was a gangster and killed hundreds of people. Is that movie also available or no?\n\nThe movie that the documentary films him making. Was it ever finished? Was it ever released?   \n\nI want to see that movie, because the clips we see in the documentary were pretty good.  \n\nBut it makes sense if it never finished and never was released.  \n\nIf that’s true then is the footage available?  ",
        "upvotes": 13,
        "comments": 4,
        "media": null,
        "permalink": "/r/movies/comments/1pucbib/is_the_movie_that_anwar_congo_made_in_the_act_of/"
    },
    {
        "id": "1ptwkct",
        "author": "LowInteraction6397",
        "title": "The 40 movies that won Best Picture without winning acting",
        "content": "|Year|Best Picture winner|Acting nominee/s|Winner/s who beat the nominee/s (or all winners if there were no nominees)|\n|:-|:-|:-|:-|\n|1927/1928|*Wings*|None|Emil Jannings (Best Actor for both *The Last Command* and *The Way of All Flesh*) and Janet Gaynor for (Best Actress for *7th Heaven*, *Street Angel* and *Sunrise*)|\n|1928/1929|*The Broadway Melody*|Bessie Love (Best Actress)|Mary Pickford (*Coquette*)|\n|1929/1930|*All Quiet on the Western Front*|None|George Arliss (Best Actor for *Disraeli*) and Norma Shearer (Best Actress for *The Divorcee*)|\n|1930/1931|*Cimarron*|Richard Dix (Best Actor) and Irene Dunn (Best Actress)|Lionel Barrymore (*A Free Soul*) and Marie Dressler (*Min and Bill*)|\n|1931/1932|*Grand Hotel*|None|Fredric March (Best Actor for *Dr. Jekyll and Mr. Hyde*), Wallace Berry (also Best Actor but for *The Champ*) and Best Actress for Helen Hayes for (*The Sin of Madelon Claudette*)|\n|1932/1933|*Cavalcade*|Diana Wynyard (Best Actress)|Katharine Hepburn (*Morning Glory*)|\n|1935|*Mutiny on the Bounty*|Charles Laughton, Clark Gable and Franchot Tone (all 3 Best Actor)|Victor McLaglen (*The Informer*)|\n|1938|*You Can't Take It with You*|Spring Byington (Best Supporting Actress)|Fay Bainter (*Jezebel*)|\n|1940|*Rebecca*|Laurence Olivier (Best Actor), Joan Fontaine (Best Actress) and Judith Anderson (Best Supporting Actress)|James Stewart (*The Philadelphia Story*), Ginger Rogers (*Kitty Foyle*) and Jane Darwell (*The Grapes of Wrath*)|\n|1943|*Casablanca*|Humphrey Bogart (Best Actor) and Claude Rains (Best Supporting Actor)|Paul Lukas for (*Watch on the Rhine*) and Charles Coburn (*The More the Merrier*)|\n|1951|*An American in Paris*|None|Humphrey Bogart (Best Actor for *The African Queen*), Vivien Leigh (Best Actress for *A Streetcar Named Desire*), Karl Malden (Best Supporting Actor also for *A Streetcar Named Desire*) and Kim Hunter (Best Supporting Actress also for *A Streetcar Named Desire*)|\n|1952|*The Greatest Show on Earth*|None|Gary Cooper (Best Actor for *High Noon*), Shirley Booth (Best Actress for *Come Back, Little Shelba*), Anthony Quinn (Best Supporting Actor for *Viva Zapata!*) and Gloria Grahame (Best Supporting Actress for *The Bad and the Beautiful*)|\n|1956|*Around the World in 80 Days*|None|Yul Brynner (Best Actor for *The King and I*), Ingrid Bergman (Best Actress for *Anastasia*), Anthony Quinn (Best Supporting Actor for *Lust for Life*) and Dorothy Malone (Best Supporting Actress for *Written on the Wind*)|\n|1958|*Gigi*|None|David Niven (Best Actor for *Separate Tables*), Susan Hayward (Best Actress for *I Want to Live!*), Burl Ives (Best Supporting Actress for *The Big Country*) and Wendy Hiller (Best Supporting Actress for *Separate Tables*)|\n|1960|*The Apartment*|Jack Lemmon (Best Actor), Shirley MacLaine (Best Actress) and Jack Kruschen (Best Supporting Actor)|Burt Lancaster (*Elmer Gantry*, Elizabeth Taylor (*BUtterfield 8*) and Peter Ustinov (*Spartacus*)|\n|1962|*Lawrence of Arabia*|Peter O'Toole (Best Actor) and Omar Sharif (Best Supporting Actor)|Gregory Peck (*To Kill a Mockingbird*) and Ed Begley (*Sweet Bird of Youth*)|\n|1963|*Tom Jones*|Albert Finney (Best Actor), Hugh Griffith (Best Supporting Actor), Diane Cliento (Best Supporting Actress), Edith Evans (also Best Supporting Actress) and Joyce Redman (also Best Supporting Actress)|Sidney Poitier (*Lilies on the Field*), Melvyn Douglas (*Hud*) and Margaret Rutheford (*The V.I.P.s*)|\n|1965|*The Sound of Music*|Julie Andrews (Best Actress) and Peggy Wood (Best Supporting Actress)|Julie Christie (*Darling*) and Shelley Winters (*A Patch of Blue*)|\n|1968|*Oliver!*|Ron Moody (Best Actor) and Jack Wild (Best Supporting Actor)|Cliff Robertson (*Charly*) and Jack Albertson (*The Subject Was Roses*)|\n|1969|*Midnight Cowboy*|Dustin Hoffman (Best Actor), Jon Voight (also Best Actor) and Sylvia Miles (Best Supporting Actress)|John Wayne (*True Grit*) and Goldie Hawn (*Cactus Flower*)|\n|1973|*The Sting*|Robert Redford (Best Actor)|Jack Lemmon (*Save the Tiger*)|\n|1976|*Rocky*|Sylvester Stallone (Best Actor), Talia Shire (Best Actress), Burt Young (Best Supporting Actor) and Burguess Meredith (Best Supporting Actor)|Peter Finch (*Network*), Faye Dunaway (also *Network*) and Jason Robards (*All the President's Men*)|\n|1981|*Chariots of Fire*|Ian Holm (Best Supporting Actor)|John Gieguld (*Arthur*)|\n|1985|*Out of Africa*|Meryl Streep (Best Actress) and Klaus Maria Santander (Best Supporting Actor)|Geraldine Page (*The Trip to Bountiful*) and Don Ameche (*Cocoon*)|\n|1986|*Platoon*|Willem Dafoe and Tom Berenger (both Best Supporting Actor)|Michael Caine (*Hannah and Her Sisters*)|\n|1987|*The Last Emperor*|None|Michael Douglas (Best Actor for *Wall Street*), Cher (Best Actress for *Moonstruck*), Sean Connery (Best Supporting Actor for *The Untouchables*) and Olympia Dudakis (Best Supporting Actress for *Moonstruck*)|\n|1990|*Dances with Wolves*|Kevin Costner (Best Actor), Graham Greene (Best Supporting Actor) and Mary McDonnell (Best Supporting Actress)|Jeremy Irons (*Reversal of Fortune*), Joe Pesci (*Goodfellas*) and Whoopi Goldberg (*Ghost*)|\n|1993|*Schindler's List*|Liam Neeson (Best Actor) and Ralph Fiennes (Best Supporting Actor)|Tom Hanks (*Philadelphia*) and Tommy Lee Jones (*The Fugitive*)|\n|1995|*Braveheart*|None|Nicolas Cage (Best Actor for *Leaving Las Vegas*) Susan Sandaron (Best Actress for *Dead Man Walking*), Kevin Spacey (Best Supporting Actor for *The Usual Suspects*) and Mira Sorvino (Best Supporting Actress for *Mighty Aphrodite*)|\n|1997|*Titanic*|Kate Winslet (Best Actress) and Gloria Stuart (Best Supporting Actress)|Helen Hunt (*As Good as It Gets*) and Kim Basinger (*L.A. Confidential*)|\n|2003|*The Lord of the Rings: The Return of the King*|None|Sean Penn (Best Actor for *Mystic River*), Charlize Theron (*Monster*), Tim Robbins (Best Supporting Actor for *Mystic River*) and Renee Zellweger (Best Supporting Actress for *Cold Mountain*)|\n|2005|*Crash*|Matt Dillon (Best Supporting Actor)|George Clooney (*Syriana*)|\n|2006|*The Departed*|Mark Wahlberg (Best Supporting Actor)|Alan Arkin (*Little Miss Sunshine*)|\n|2008|*Slumdog Millionaire*|None|Sean Penn (Best Actor for *Milk*), Kate Winslet (Best Actress for *The Reader*), Heath Ledger (Best Supporting Actor for *The Dark Knight*) and Penélope Cruz (Best Supporting Actress for *Vicky Cristina Barcelona*)|\n|2009|*The Hurt Locker*|Jeremy Renner (Best Actor)|Jeff Bridges (*Crazy Heart*)|\n|2012|*Argo*|Alan Arkin (Best Supporting Actor)|Christoph Waltz (*Django Unchained*)|\n|2014|*Birdman*|Michael Keaton (Best Actor), Edward Norton (Best Supporting Actor) and Emma Stone (Best Supporting Actress)|Eddie Redmayne (*The Theory of Everything*), J.K. Simmons (*Whiplash*) and Patricia Arquette (*Boyhood*)|\n|2015|*Spotlight*|Mark Ruffalo (Best Supporting Actor) and Rachel McAdams (Best Supporting Actress)|Mark Rylance (*Bridge of Spies*) and Alicia Vikander (*The Danish Girl*)|\n|2017|*The Shape of Water*|Sally Hawkins (Best Actress), Richard Jenkins (Best Supporting Actor) and Octavia Spencer (Best Supporting Actress)|Frances McDormand (*Three Billboards Outside Ebbing, Missouri*), Sam Rockwell (also *Three Billboards Outside Ebbing, Missouri*) and Allison Janney (*I, Tonya)*|\n|2019|*Parasite*|None|Joaquin Phoenix (Best Actor for *Joker*), Renee Zellweger (Best Actress for *Judy*), Brad Pitt (Best Supporting Actor for *Once Upon a Time in Hollywood*) and Laura Dern (Best Supporting Actress for *Marriage Story*)|",
        "upvotes": 107,
        "comments": 68,
        "media": null,
        "permalink": "/r/movies/comments/1ptwkct/the_40_movies_that_won_best_picture_without/"
    },
    {
        "id": "1pt09ip",
        "author": "MarvelsGrantMan136",
        "title": "The Odyssey | Official Trailer",
        "content": "",
        "upvotes": 15459,
        "comments": 3790,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/b-c-luSTpSRK1YN-gyS4IXB7LaVMP-g3Nrix6Won_b0.jpeg?auto=webp&amp;s=19de7a05ecb5d0140eb8b9c46ae765f3a0331460"
        },
        "permalink": "/r/movies/comments/1pt09ip/the_odyssey_official_trailer/"
    },
    {
        "id": "1ptdusv",
        "author": "darth_vader39",
        "title": "Susie Figgis Dies: “Unique” Casting Director Of ‘Gandhi’, ‘The Full Monty’, ‘Harry Potter’, ‘Bohemian Rhapsody’ &amp; Many More Hits Was 77",
        "content": "",
        "upvotes": 1559,
        "comments": 48,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/T5s9vN8VXb6duCR4RKmpCeoAF6paMZjkVNBjLMHdLr8.jpeg?auto=webp&amp;s=faebbebe084ed2706a33140c82a4915999db4af2"
        },
        "permalink": "/r/movies/comments/1ptdusv/susie_figgis_dies_unique_casting_director_of/"
    },
    {
        "id": "1pudjmw",
        "author": "NightHawk7217",
        "title": "Emotional / Sad movies about Brotherhood",
        "content": "This year nearly broke me. Although my brothers and I are grown now with our own lives, I’m reminded how fortunate I am to have them by my side during hard times. I have the house to myself and I feel like crying tonight. Looking for films with the same emotional undertone as Warrior (2011) — not necessarily the MMA aspect, but the deep brotherhood, loyalty, and the “I've got you no matter what\" theme. The sadder the better. ",
        "upvotes": 7,
        "comments": 23,
        "media": null,
        "permalink": "/r/movies/comments/1pudjmw/emotional_sad_movies_about_brotherhood/"
    },
    {
        "id": "1pt06b4",
        "author": "cnn",
        "title": "Paramount’s new, hostile offer to Warner Bros. Discovery: Larry Ellison will personally guarantee $40 billion",
        "content": "",
        "upvotes": 7684,
        "comments": 768,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sF-kB3KVCB-Ic8YaZTrqDid6td3mwH7_ChyyVzQlS6Q.jpeg?auto=webp&amp;s=161185d2e12509beaf1ee595cece1c90ed9b273a"
        },
        "permalink": "/r/movies/comments/1pt06b4/paramounts_new_hostile_offer_to_warner_bros/"
    },
    {
        "id": "1pteav1",
        "author": "AssociateLittle1487",
        "title": "Netflix Refinances Chunk Of Bridge Loan For Warner Bros. Acquisition",
        "content": "",
        "upvotes": 1119,
        "comments": 97,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/tEJ6WHM8a_O6cupupPDAN1PhdimCPk1yszemTee-6WE.jpeg?auto=webp&amp;s=1970b5f485c8cf88d34907bad61f7f8ba372f174"
        },
        "permalink": "/r/movies/comments/1pteav1/netflix_refinances_chunk_of_bridge_loan_for/"
    }
]