[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 483,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1hwn7w1",
        "author": "S4v1r1enCh0r4k",
        "title": " New Jerry Springer docuseries discovers some shocking stuff about the show, some of which we could already assume, apparently the producers went as far as to blackmail poor guests if they thought about not showing up for the final show panel ",
        "content": "",
        "upvotes": 230,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1hwn7w1/new_jerry_springer_docuseries_discovers_some/"
    },
    {
        "id": "1hx3lam",
        "author": "Complete_Question_41",
        "title": "How the hell do I stop netflix from asking me to sign in every day or second day?",
        "content": "It makes no sense, and it means other people in the house can't use netflix on my xbox when I am not around as the damn thing keeps asking them to sign in.\n\nOnce every week, sure. But it's daily, which is just nuts.",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hx3lam/how_the_hell_do_i_stop_netflix_from_asking_me_to/"
    },
    {
        "id": "1hwtq3m",
        "author": "Frensisca-",
        "title": "Non-murder documentaries ",
        "content": "I would like to watch non-murder true crime documentaries, such as fraudulent, scam. financial, medical crimes etc also political scandals. I appreciate your recommendations.",
        "upvotes": 21,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1hwtq3m/nonmurder_documentaries/"
    },
    {
        "id": "1hwh37q",
        "author": "Robemilak",
        "title": "‘Squid Game’ Season 2 earns 126.2M views from its first 11 days on Netflix. Faster than any series ever on the platform.\n",
        "content": "",
        "upvotes": 85,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1hwh37q/squid_game_season_2_earns_1262m_views_from_its/"
    },
    {
        "id": "1hx6tbj",
        "author": "Yazikussy",
        "title": "American Primeval release time?",
        "content": "Hi. New(ish) into Netflix. I don't typically follow when things are releasing and I don't watch much.\n\nAmerican Primeval was said to be releasing today. Is there a specific time that Netflix does releases? Thanks!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hx6tbj/american_primeval_release_time/"
    },
    {
        "id": "1hwqxuk",
        "author": "Alternative-Earth325",
        "title": "Squid Game, Alice in Borderland, The 8 Show. What’s your favorite and why?",
        "content": "Which is the standout among the survival dramas *Squid Game*, *Alice in Borderland*, and *The 8 Show*? \n\n*Squid Game* offers a poignant look at desperation with its deadly childhood games, becoming a global phenomenon due to its storytelling and character arcs. \n\n*Alice in Borderland* combines sci-fi with survival, setting its narrative in a deserted Tokyo with an intriguing card game twist, noted for its visual appeal and plot twists. \n\n*The 8 Show* examines human psychology within a grim reality show, tackling themes of greed and morality with a touch of dark humor. \n\nConsidering their unique elements - from social critique to innovative game concepts - which do you believe excels in narrative depth, character development, and cultural impact? Share your thoughts on these compelling series.",
        "upvotes": 16,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1hwqxuk/squid_game_alice_in_borderland_the_8_show_whats/"
    },
    {
        "id": "1hx3ghf",
        "author": "ZealousidealLuck4665",
        "title": "The perfect couple is horrific ",
        "content": "Just started watching the perfect couple I'm on episode 2, I've stopped it numerous times because of the horrid script. Does it get better? From Nicoles awful lace front wigs and stiff face to the awful script that tries so hard to be scandalous and feels like some sort of rip off of White lotus in a way. I want to give it a chance but honestly have no idea if it's worth the watch or not if anyone has finished it, is it truly worth it?",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hx3ghf/the_perfect_couple_is_horrific/"
    },
    {
        "id": "1hx8hp5",
        "author": "ToonAdventure",
        "title": "My Melody &amp; Kuromi | First Look | Netflix Anime",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hx8hp5/my_melody_kuromi_first_look_netflix_anime/"
    },
    {
        "id": "1hx7e9w",
        "author": "TheEyeOfSmug",
        "title": "What's happening to the Netflix page design?",
        "content": "Not sure if it's just me, but the netflix app is starting to become overcrowded with junk. It's reminicent of google search, and how they started minimalist (which I loved) but over time, piled on so many superfluous doodads with no \"opt out\" functionality that I stopped using it. For example, now I'm seeing links to games, uninteresting categories making the \"Continue watching\" row difficult to find, giant full screen links to shows hogging space as I try to navigate through menus. It's also top ranking a lot of junk I'm not interested in... like live professional wrestling and other cable TV derivative content. I prefer science fiction, fantasy, horror, and foreign cinema (just movies and series).\n\nOh well, anyone else noticed this? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hx7e9w/whats_happening_to_the_netflix_page_design/"
    },
    {
        "id": "1hx72r3",
        "author": "Cameron_Walker17",
        "title": "Top 5 Epic Thanos (Player 230) Moments You Won't Believe! #squidgame2",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hx72r3/top_5_epic_thanos_player_230_moments_you_wont/"
    },
    {
        "id": "1hx6mu5",
        "author": "Odd_Extension4446",
        "title": "Why ?",
        "content": "Why is there a curved line below the download arrow in the Netflix app? It used to be a straight line, but this changed after Netflix introduced smart downloads. I want to understand the sentiment behind this downward curve, which resembles a sad face. Can anyone clarify?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hx6mu5/why/"
    },
    {
        "id": "1hwx4ia",
        "author": "WaveyJB",
        "title": "Which 3 series?",
        "content": "If you could only watch 3 series on repeat for the rest of your life, which three are you picking? Need some inspiration, can’t find anything that pulls me in from the trailers!",
        "upvotes": 3,
        "comments": 56,
        "media": null,
        "permalink": "/r/netflix/comments/1hwx4ia/which_3_series/"
    },
    {
        "id": "1hwkzv9",
        "author": "S4v1r1enCh0r4k",
        "title": "New teaser for Mo Season 2 just dropped",
        "content": "",
        "upvotes": 11,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hwkzv9/new_teaser_for_mo_season_2_just_dropped/"
    },
    {
        "id": "1hvlmba",
        "author": "EthanWilliams_TG",
        "title": "Watch Hulk Hogan Get Booed by Fans During WWE's Netflix Debut",
        "content": "",
        "upvotes": 3414,
        "comments": 408,
        "media": null,
        "permalink": "/r/netflix/comments/1hvlmba/watch_hulk_hogan_get_booed_by_fans_during_wwes/"
    },
    {
        "id": "1hwp5oq",
        "author": "blondeboss101",
        "title": "Shows/Movies that are originally in spanish?",
        "content": "I am trying to learn Spanish and I've heard one of the best ways to learn is to watch with subtitles. So far I have watched Narcos and Soy Georgina. Any other suggestions? Thanks in advance! ",
        "upvotes": 5,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hwp5oq/showsmovies_that_are_originally_in_spanish/"
    },
    {
        "id": "1hwzs31",
        "author": "_Vacation_mode_",
        "title": "Cannot transfer profile back into main account",
        "content": "My daughter moved back in with us. Contacted Netflix about transferring her profile back into the main account and saving the $8 sub-account fee. Nope, can't do it. Only recourse is to delete her sub-account and let her start over on the main account. Not very user friendly. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hwzs31/cannot_transfer_profile_back_into_main_account/"
    },
    {
        "id": "1hwhkek",
        "author": "Pogrebnik",
        "title": "Netflix's Top 10 Most Watched Movies of All Time: Some New Arrivals Made The Cut",
        "content": "",
        "upvotes": 11,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hwhkek/netflixs_top_10_most_watched_movies_of_all_time/"
    },
    {
        "id": "1hwnbva",
        "author": "Atlast_2091",
        "title": "Prison Cell 211 | Official Trailer | Netflix",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hwnbva/prison_cell_211_official_trailer_netflix/"
    },
    {
        "id": "1hx4pp1",
        "author": "Pitowi",
        "title": "Is it possible to watch Netflix in HD with windows 8.1?",
        "content": "And if so, on which web browser(s) is it possible? Would rather get a new browser or something than pay $100+ for windows 10/11. Is it possible anymore to watch HD netflix on Windows 8.1?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hx4pp1/is_it_possible_to_watch_netflix_in_hd_with/"
    },
    {
        "id": "1hx1bm5",
        "author": "HorrorRoutine349",
        "title": "Netflix handpicking what you can watch in the Raw archive.",
        "content": "Seriously why make an agreement with WWE if you are just going to dog all the fans and handpick what is watchable from the archive. You couldn't just let Peacock keep the archive o no Netflix has to get it's grubby hands on all of Raw and then pick and choose what fans can watch from the past.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hx1bm5/netflix_handpicking_what_you_can_watch_in_the_raw/"
    },
    {
        "id": "1hw2xuq",
        "author": "Ill_Dependent1389",
        "title": "Love these BTS Squid Game 2 🫰",
        "content": "",
        "upvotes": 72,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hw2xuq/love_these_bts_squid_game_2/"
    },
    {
        "id": "1hx7ot9",
        "author": "Illustrioushydra1582",
        "title": "Netflix has gotten complacent",
        "content": "Because Netflix is the original streaming service they think they’re untouchable\n\nNow that they have competition, they haven’t changed their business practises \nThey will look for the instant sensation hit the big top sellers \nSomething that is worldwide sensation \n\nBut all they’re doing is creating a self-fulfilling prophecy of cancelling shows \n\n\nNetflix have just gotten complacent because they didn’t have competition for so long and now this competition there don’t know how to compete \n\nThey’ve gotten comfortable  ripping us off\n\nBut eventually, that’s going to bite them in the ass because we are unsubscribing ",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1hx7ot9/netflix_has_gotten_complacent/"
    },
    {
        "id": "1hx7etw",
        "author": "Illustrioushydra1582",
        "title": "Netflix sucks and it’s days are numbered ",
        "content": "Thay keep canceling good shows \nKaos was canceled even though it had a80% completion rate\n\nWhat is Jeff Goldblum too expensive for the second season? \n\nI don’t see any reason to watch new shows thay are just going to cancelled it on cliff hanger\n\nNetflix days are numbers at this point \n\nDisney Amazon prime in HBO Max have better shows  \n\nNetflix needs to smarten up and stop acting like they don’t have competition \n\nIf you want people to subscribe stop cancelling shows that are not a worldwide sensation in 24 hours give it time to breathe before you cancel the contract",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1hx7etw/netflix_sucks_and_its_days_are_numbered/"
    },
    {
        "id": "1hwlwtb",
        "author": "jilldxasd35",
        "title": "Transferring profile ",
        "content": "Transferring profile\n\nTwo separate households, ip addresses. \n\nI had been logging in and watching a few minutes of something while at household 1’s (my dad) house once a week and still watching at household 2’s (my) house. Every so often we both would get the message about adding an account but could still watch. \n\nThough we decided to add me onto my dad’s account. He enabled profile transfers instantly. I entered in an email to be invited but never received an email. Later I did get a text, my dad must have done something. \n\nI tried to do a profile transfer while on his account at his house but it needed an existing account. \n\nI clicked the link in the text and created an account. \n\nNow when I get on his account at his house to transfer a profile it brings up this page after I have used my log in. What does this mean, and how can I get a profile to transfer? When I log in to Netflix with my account info I don’t have any of my old profile, nothings been transferred. \n\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hwlwtb/transferring_profile/"
    },
    {
        "id": "1hwqyts",
        "author": "matthewjn",
        "title": "Peak content from Netflix if you dislike the Shaman and like the song that plays during Mingle in Squid Game Season 2.",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hwqyts/peak_content_from_netflix_if_you_dislike_the/"
    },
    {
        "id": "1hx31wr",
        "author": "Adventurous_Jicama_9",
        "title": "I want to watch Netflix at the gym without my husband having to text me",
        "content": "We have a household account. The cardio machines at my gym have their own built in tablets with Netflix installed. But when I log in, it tells me that the cardio-machine tablet is not on our household account. I have an option to get an access code texted to my husband, but he's not at the gym with me and he's often doing other stuff and doesn't get his text messages in a timely fashion. \n\nMy husband's contact info is on our household account. Customer support says there's not a way to add my number as a second contact. \n\nWhat can I do about this?  We pay for a household account and I'm not trying to steal anything. I just want to watch stuff while I do cardio. \n\nI know I could use my phone but the screens on the cardio machines are much bigger and nicer. And if I'm paying for this fancy gym I want to use the perks. ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hx31wr/i_want_to_watch_netflix_at_the_gym_without_my/"
    },
    {
        "id": "1hwktiw",
        "author": "Flimsy_Task_3540",
        "title": "Surveys about  Hometown Chachacha and Physical 100",
        "content": "Hi! I'm a university student in Italy, I'm graduating in arts management. My research is focused on the succes and impact of Physical 100 and Hometown Chachacha, I've prepared a survey for each show and I'll link them below for anyone Interested. Thanks for the support !   \nHometown Chachacha : [https://docs.google.com/forms/d/e/1FAIpQLSeMxXggNbtOcFxHGhp\\_66581NIxUl6HV6Syq7eP\\_eF1upC7xA/viewform?usp=sf\\_link](https://docs.google.com/forms/d/e/1FAIpQLSeMxXggNbtOcFxHGhp_66581NIxUl6HV6Syq7eP_eF1upC7xA/viewform?usp=sf_link)\n\nPhysical 100 : [https://docs.google.com/forms/d/e/1FAIpQLSfS-c-ZAJCKJ1sW6357SOQigivCTyMkH1C-beDKNTivMbcgcQ/viewform?usp=sf\\_link](https://docs.google.com/forms/d/e/1FAIpQLSfS-c-ZAJCKJ1sW6357SOQigivCTyMkH1C-beDKNTivMbcgcQ/viewform?usp=sf_link)",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hwktiw/surveys_about_hometown_chachacha_and_physical_100/"
    },
    {
        "id": "1hwter1",
        "author": "Andoppy18",
        "title": "How Squid Game 2 Thrived in the Streaming Wars",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hwter1/how_squid_game_2_thrived_in_the_streaming_wars/"
    },
    {
        "id": "1hwch45",
        "author": "amandaasous",
        "title": "Netflix “set household” can’t stream while traveling for work",
        "content": "I read an old post when searching for this subject but my situation is different from most of the replies and the post itself. I’ve contacted Netflix support twice today and a few other times in the past about this dumb household limitations. You can only request a vacation code in advance and only a few times a year. I travel for work often and Netflix ALWAYS force closes every minute in all  hotels. At first I thought it was Marriott hotels all having shitty TVs but finally caught onto the pattern that it is a NETFLIX issue. Prime and Max work perfectly fine in all my hotels. But I cannot use Netflix in my hotel rooms while my husband uses it at home. (I pay for more than 1 screen btw.) even if my husband is not at home and I log out of every single device and only log into my mobile phone and the hotel tv, Netflix still force closes every minute on the tv. There’s no option to update household on the TV Netflix. It just doesn’t exist. Does ANYONE have anything they’ve done that has helped with this or advice? Do I just cancel Netflix atp?\n\nTL;DR Netflix “set household” isn’t an option on my hotel tv, I cannot stream Netflix while I travel for work, and I travel often. Any tips/advice?",
        "upvotes": 5,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1hwch45/netflix_set_household_cant_stream_while_traveling/"
    },
    {
        "id": "1hx39av",
        "author": "leaponover",
        "title": "So Much Hate",
        "content": "Netflix haters annoy me.  I usually watch shows while I'm playing mobile games and don't pay that much attention, but finished the 'Man on the Inside' and it was excellent and captured my attention.  Now I'm watching \"Nobody Wants This' and keep putting my tablet down. 'No Good Deeds' was meh, but thoroughly enjoying both of the former offerings.  I can spend 3 days scrolling through cable to find nothing good.  Netflix is a deserving receiver of my entertainment budget.",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hx39av/so_much_hate/"
    }
]