[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 35,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1ksbkz2",
        "author": "HP_sauce78",
        "title": "Watching worst roommate ever",
        "content": "I am so angry at the incompetence of police officers and the scary laws America has. As a British person, I’ve never heard a story where someone who moves into another persons home has more rights than they do???\n\nIt’s crazy what the hell. I’m talking specifically about ep3 (although I’m angry at all of them) and I hate how these victims have lost their homes due to stupid laws.\n\nFeel like I’m late to the story but I think it’s time Americans demand changes within the law ",
        "upvotes": 35,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1ksbkz2/watching_worst_roommate_ever/"
    },
    {
        "id": "1krxgf6",
        "author": "New-Entrepreneur4132",
        "title": "Untold the fall of Favre",
        "content": "What a hard one to watch. He did so much right. He also did so much wrong that is traceable and yet he still claims innocence. I don’t know how he lives with himself and looks in the mirror. Using welfare money from one of the poorest states in the US is a new bottom for any human. His sexual harassment is well-documented too. I hope they recover money for the people of Mississippi and I hope Favre acknowledges his wrongs and has regrets before Parkinson’s makes it hard for him to apologize. Greed is a horrible thing. ",
        "upvotes": 160,
        "comments": 103,
        "media": null,
        "permalink": "/r/netflix/comments/1krxgf6/untold_the_fall_of_favre/"
    },
    {
        "id": "1kseg86",
        "author": "Objective-Shift7932",
        "title": "I am not okay with this season 2",
        "content": "Is there a chance for \"I am not okay with this\" to come back for season 2? I really loved the first season and it sucks that they left it on a cliffhanger. I was thinking that they might start working on it again after Stranger Things season 5 releases but I'm not sure.",
        "upvotes": 8,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1kseg86/i_am_not_okay_with_this_season_2/"
    },
    {
        "id": "1ks25hd",
        "author": "Accomplished-Snow727",
        "title": "The Residence",
        "content": "Just finished watching The residence on Netflix.. LOVED IT. Now i have a hankering for murder mysteries but not like dead serious a little quirky, like the residence, but not a movie - a tv series? Any suggestions? ",
        "upvotes": 29,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1ks25hd/the_residence/"
    },
    {
        "id": "1ks6n78",
        "author": "LouisTully9000",
        "title": "Sneaky Links and the Death of Romance (as We Knew It)",
        "content": "At some point in the past five years; perhaps between the eighth season of Love Is Blind and the 437th rebranding of The Bachelor; televised dating quietly stopped being about dating. Instead, it became a parade of bronzed narcissists dry-humping on bean bags for the chance to sell flat tummy tea and boner pills to strangers on Instagram. Into this rich tradition steps Netflix’s latest entry, Sneaky Links: Dating After Dark, a show that dares to ask: What if your ex-booty call was also your soulmate? (And what if you were filmed trying to figure that out while shirtless, emotionally stunted, and surrounded by Ikea furniture?)\n\nIf you, like me, are 43 years old and unaware that “sneaky link” is Gen Alpha for “booty call,” you’re not alone. Apparently, the term “booty call” was too on-the-nose for a streaming platform that also produces prestige dramas about Elizabethan corsets and talking bears. Instead, we get “Sneaky Links,” a phrase that sounds like a sketchy URL you click by accident while searching for airfare.",
        "upvotes": 15,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ks6n78/sneaky_links_and_the_death_of_romance_as_we_knew/"
    },
    {
        "id": "1ksduiv",
        "author": "Shadowlab72",
        "title": "How to find independent movies on Netflix",
        "content": "Back in 2000 I started renting movies from Netflix and did so until about 2015. Netflix movies, mailed of course, had the best catalog of independent movies from anywhere. \n\nIf my local movie rental store didn't have an obscure title then I knew Netflix would. \nI know times have changed but I cannot seem to find many Independent films on Netflix streaming.\n\nI've tried the categories option but that's limited to drama comedy reality etc.. \n\nHas anybody found a way to find Independent films on the Netflix app?",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ksduiv/how_to_find_independent_movies_on_netflix/"
    },
    {
        "id": "1ksclig",
        "author": "loverules1221",
        "title": "Sneaky Links",
        "content": "Angelique and Colt look like brother and sister. They have the same lips and mouth. lol  They also just don’t care they are hurting the person they came with. Avery seems genuinely nice. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ksclig/sneaky_links/"
    },
    {
        "id": "1ksizbl",
        "author": "dapigtown",
        "title": "Netflix stuck at 540p everywhere on windows 11",
        "content": "For some reason Netflix on chrome, edge, and even the windows app are all stuck on 540p (960x540) when watching movies, and the weird thing is that this doesn't occur on TV shows (I get 1080p). I can confirm I've set playback settings to highest and my internet is more than sufficient at around 200 down. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ksizbl/netflix_stuck_at_540p_everywhere_on_windows_11/"
    },
    {
        "id": "1ksa84r",
        "author": "AwayRazzmatazz8937",
        "title": "Netflix show Bet",
        "content": "I really hope there's a season 2 of Bet. Miku Martineau Is absolutely beautiful. The show it's self if a pretty interesting concept and would love to see what they could do with more seasons.",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ksa84r/netflix_show_bet/"
    },
    {
        "id": "1ksg0hh",
        "author": "Only-File-6065",
        "title": "Secrets We Keep - Plot Hole?",
        "content": "In the beginning of the series after the police find ruby's passport, the detective goes to eat lunch in her car and then appears to throw away ruby's passport in a trash can along a beach. Why? I can't find any answers online, maybe I just saw the scene incorrectly but it's driving me crazy ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ksg0hh/secrets_we_keep_plot_hole/"
    },
    {
        "id": "1ksehoe",
        "author": "UnequalHectare",
        "title": "American Civil War documentaries?",
        "content": "I just listened to a podcast about Robert E Lee and how much he sucked as a person and a general despite popular belief, and now I really want to find a decent documentary about the Civil War. I know Ken Burns’ is fantastic, but the only place I could find it was on YouTube for $40. Is there anything decent on Netflix? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ksehoe/american_civil_war_documentaries/"
    },
    {
        "id": "1kscy0t",
        "author": "Creative-Ad-1363",
        "title": "Pernille was so depressing",
        "content": "I just watched all 5 seasons of Pernille. The main character is a single mom, and a children services counselor. \nThe vibe is Pernille being everything to everyone while neglecting her own wellness. \nIt depicts a miserable life of motherhood and public service. \n**SPOILER ALERT**\nIn the end Pernille gets engaged, as though that's some kind of prize. Its just another person for her to take care of. Not sure why this was considered a happy ending. There are absolutely no wins for Pernille just the labor of being a workhorse for her family and employer. \n\n",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kscy0t/pernille_was_so_depressing/"
    },
    {
        "id": "1krz9u7",
        "author": "S4v1r1enCh0r4k",
        "title": "Carey Mulligan has been cast as Digory's mother in Greta Gerwig's Narnia movie",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1krz9u7/carey_mulligan_has_been_cast_as_digorys_mother_in/"
    },
    {
        "id": "1ks0qzn",
        "author": "Kindly_Dot_7006",
        "title": "Appropriate Adult?",
        "content": "Just started the Fred and Rose West documentary and they are describing the people at the police station including an “appropriate adult”. Assuming it’s a UK thing, but what does that mean? What is that person’s role supposed to be?",
        "upvotes": 4,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1ks0qzn/appropriate_adult/"
    },
    {
        "id": "1krstm5",
        "author": "surveypoodle",
        "title": "Just started watching Manifest and I'm loving it.",
        "content": "https://preview.redd.it/sw4almgyh32f1.jpg?width=426&amp;format=pjpg&amp;auto=webp&amp;s=6e6c2b2780cdb0f9df5f6d7f6ab446de46425956\n\nSo I randomly came across this show. Half way through the show I thought this was sci-fi and then it got weirder and weirder. I skipped through most of the family scenes  to save some time and I was mostly curious where they're going with this. Then came people dying mysteriously, cartoon villians from the government performing medical experiments on people searching for \"the Holy Grail\", \"The Major\" who's way up the ranks to conduct large operations that even the NSA is not aware of. The scientist who's there to explain shit to people with psychic powers called \"the calling\", things disappearing, symbols, egyptian mythology, dead people coming back to life, Noah's Ark, and other \"mysterious\" phenomenon.\n\nI got even more excited when I realized there's 4 seasons of this. I don't know how it was even possible to stretch this for that many seasons and this got my curiosity even more. Most of the time I'm just skipping through the episodes until I get to see Michaela's pretty face but everything's all connected. Wow.\n\nTwenty years from now, this is gonna be a cult classic. Calling it now.",
        "upvotes": 12,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1krstm5/just_started_watching_manifest_and_im_loving_it/"
    },
    {
        "id": "1ks9eb2",
        "author": "Joni005",
        "title": "Netflix video player problems",
        "content": "Hi guys, as you can see in the photo my video player is experiencing some problems, the episode im on dosent show and the buttons on the right side, next episode button and the one to show all episodes dont work, it works fine on an icognito browser. I have tried deleting browser data for netflix but it didnt help, any suggestions. Thanks in advance :)\n\nhttps://preview.redd.it/xm0o66l9b72f1.png?width=1916&amp;format=png&amp;auto=webp&amp;s=c9261890e6e4e39e9727224550b4f42cfbfe8278\n\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ks9eb2/netflix_video_player_problems/"
    },
    {
        "id": "1krzegv",
        "author": "dhantantan",
        "title": "With Love Meghan - Looking for similar (better) shows",
        "content": "I enjoyed the calm, peaceful vibe, but the awkward abundance of self-congratulation was distracting. The lack of chemistry with guests was noticeable. Plus, sprinkling the dried flowers without consideration for the palate, 'the sweetness of the fruit is a real thing', detailed documentation of cooking process without recipes, etc 🧐\n\nI'd love to consume this genre done better - with an articulate and engaging host, where the guests radiate genuine fun.\n\nCulinary theme is appreciated, but not necessary.",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1krzegv/with_love_meghan_looking_for_similar_better_shows/"
    },
    {
        "id": "1ks5hja",
        "author": "S4v1r1enCh0r4k",
        "title": "A new featurette for Season 2 of ‘Wednesday' has been released.",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/kqiugl9ej62f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1ks5hja/a_new_featurette_for_season_2_of_wednesday_has/"
    },
    {
        "id": "1ksijl6",
        "author": "Reba_2027",
        "title": "How do I remove non English movies From my Netflix",
        "content": "I'm so tired or poorly made movie's ani. Or dumb thing's I don't care about.\n\nOften me and the misses settle down to watch something that seems good OH WAIT THAT'S FRENCH IN ENGLISH DUB AND LIP SYNC'S AWFUL AND STUPID!\n\nI'm tired of scrolling through and it being no good movies or rather 0 good American non bs movies it's all Chinese Dog S- or French or etc.  \n\nI want them off my lists gone I DON'T WANT TO SEE EM!\n\nis their a setting to remove all trash movies/shows like this from my view..",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ksijl6/how_do_i_remove_non_english_movies_from_my_netflix/"
    },
    {
        "id": "1kry14a",
        "author": "GenevieveCostello",
        "title": "Thought provoking, historic, funny, romantic, or emotional Netflix show suggestions",
        "content": "I don't care about the genre, but I'd like a show that doesn't leave me feeling like I've wasted my time. For example, I immediately regretted spending hours on Netflix only to feel nothing or often get distracted after binge-watching some reality shows like Love is blind. I want something worth spending time on, and well-made. \n\nHere are the shows that entertained me.\n\n1. Persian Lessons \n\n2. Midnight at the Pera Palace (Turkish)\n\n3. Women at War (French)\n\n4. Seaspiracy (Documentary)\n\n5. World War II from the front lines (Documentary)\n\n6. One Hundred Years of Solitude (Spanish)\n\n7. The Gentlemen \n\n8. The Queen's Gambit \n\n9. Inglourious Basterds \n\n10. The Devil Next Door (Documentary)\n\n11. Better than Us (Russian) \n\nI've lately turned off many shows before I even finish 1 episode.. I think I need your suggestions thanks :)\n\n\n\n",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kry14a/thought_provoking_historic_funny_romantic_or/"
    },
    {
        "id": "1ks278n",
        "author": "cupcake_cheesecake",
        "title": "Romance",
        "content": "What are some actual good romance movies on Netflix. I hate ones that start out boring and can't get my interest. Anyone know of any? Tired of action, thrillers, and reality TV. Want something more along the lines of a good love story",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ks278n/romance/"
    },
    {
        "id": "1kqzy3f",
        "author": "Then-Scholar1748",
        "title": "A Deadly American Marriage: Sarah Corbett believes there's a secret recording of her dad's death",
        "content": "She says there was a recording device in a nightstand in her dad's bedroom but that it was not recovered by the police. She also says it was seen at Molly Martens' brother's house. ",
        "upvotes": 254,
        "comments": 61,
        "media": null,
        "permalink": "/r/netflix/comments/1kqzy3f/a_deadly_american_marriage_sarah_corbett_believes/"
    },
    {
        "id": "1kr7ip1",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix Is Making a 'Clash of Clans' Animated Series",
        "content": "",
        "upvotes": 62,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1kr7ip1/netflix_is_making_a_clash_of_clans_animated_series/"
    },
    {
        "id": "1krotjr",
        "author": "Boring-Shallot3096",
        "title": "Kdrama - Extracurricular",
        "content": "If you’ve just watched Weak Hero Class 1 and you’ve been recommended Extracurricular because people say it’s similar, it’s not at all.\n\nDon’t know why people are saying it is, personally, I actually kind of hated it. I found it painfully boring and I regret watching it.\n\nI don’t think any of the characters are likeable and you really root for no one… just my opinion though.\n\nI will say the acting was very good but that’s not enough to keep me if the story sucks.\n\nNow, I’m in the minority here - a lot of people actually really like this show so take my opinion as an opinion, just letting you know that if you’re looking for another Weak Hero like I was, I don’t think this will satisfy you.\n\nIf you’re looking for something like Weak Hero in terms of action and fighting: Bloodhounds has got all that, and in terms of inter-friendship dynamics and characters with hero complexes: All of Us Are Dead explores that a bit.\n\nI think there’s also another show that’s supposed to be similar called The King of Pigs but I haven’t watched that so I don’t know too much about it, but give it a go if you so please.",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1krotjr/kdrama_extracurricular/"
    },
    {
        "id": "1krfmpm",
        "author": "incredible26069",
        "title": "Netflix not letting me use in my own house!",
        "content": "About six months ago I got a message from Netflix asking me to sign into my Wi-Fi or enter a code for 14 days of use. I am in my own house using my own account and network. I do not share my account outside my household. Last night it happened again but only on my PC.\n\nI do not have location hidden. I am using a wired connection through the same Wi-Fi box it wants me to sign into. I have a high-end PC and use Ethernet because it gives the best connection. I have Comcast for internet and cable. Netflix is part of my plan and I pay extra for an upgraded version through Comcast.\n\nThis only happens on my PC. It does not happen on the TV, Fire Stick, or Comcast box. My PC is in a different room and I like to play shows while I work.\n\nWhat made it more frustrating is that Netflix sends a code by email that expires in 15 minutes. Each time the email took around 20 minutes to arrive. After five failed tries it made me wait 24 hours before I could try again.\n\nI checked and the only devices connected are inside the house. Does anyone else have to deal with this nonsense.   ",
        "upvotes": 18,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1krfmpm/netflix_not_letting_me_use_in_my_own_house/"
    },
    {
        "id": "1krs8vn",
        "author": "sterrono",
        "title": "Looking for series....",
        "content": "Hey, I watched a series like 2-3 years ago I can't exactly\nremember it was on polish Netflix series if I'm not\nwrong, or prime video mayb e Hulu but highly netflix\nshow/series I can't fully recall the country as well but it\nwas eu series polish french norveigan idk, and the plot\nwhat I remember is it had main character poor guy from\nvillage looks after horses I guess enrers into university or\ncollege and it's full of rich people and there's a guy with\ncurly hair and mustache he is rich and they kinda seem\nto fall in love with each other and also mid show they go\non vocation or trip to snowy mountain places it's dark\nelite like show I can't Remember anything else maybe\nmain character name was Philippe or Victor I don't know I\ndidn't finish and I can't find it, at that time I even watched\ntrailers and checked actors profile my God now I can't\nfind anything tried ChatGpT and ai I think it's less popular\nshow or I misinterpreted the details and storylineif\nanyone knows please help!!!! I'm ready to elaborate or\ndiscuss more details....",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1krs8vn/looking_for_series/"
    },
    {
        "id": "1kqjuet",
        "author": "New-Talk3039",
        "title": "Thoughts on Netflix’s Sex Education?",
        "content": "Now that the show’s over, what did you think of Sex Education overall? Loved it or overrated?",
        "upvotes": 1618,
        "comments": 300,
        "media": null,
        "permalink": "/r/netflix/comments/1kqjuet/thoughts_on_netflixs_sex_education/"
    },
    {
        "id": "1krrjuj",
        "author": "ConversationKey276",
        "title": "American Son- How did yall feel?",
        "content": "I just watched American Son and I really enjoyed it. I saw a lot of people saying it was unrealistic, and I couldn’t disagree more. The black policeman pissed me off, but I also understood where he came from, bc my grampa used to say similar things. The white police officer made me mad also, cuz why was he so racist for? The husband was saying slick ish too🙄\nI just wish it was a bit longer to show the aftermath. But overall it was an 8/10.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1krrjuj/american_son_how_did_yall_feel/"
    },
    {
        "id": "1ks6p9m",
        "author": "BadKarma6996",
        "title": "Thoughts on Breaking Bad?",
        "content": "Breaking Bad is no doubt one of the most popular shows ever made.  \nWhat's your thought...? Is it a GOAT🐐 or Overrated...?\n\n  \nFor me, it’s a **GOATED** show and easily the **best I’ve ever watched**.  \n*PS – I haven’t watched Game of Thrones yet. Still need to find out if that can beat Breaking Bad for me. My hopes are low.*",
        "upvotes": 0,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1ks6p9m/thoughts_on_breaking_bad/"
    },
    {
        "id": "1krix1c",
        "author": "Valuable_Ad8608",
        "title": "Keep Sweet Pray &amp; Obey- I have a question",
        "content": "I just finished watching keep Sweet pray obey on Netflix and first of all what the fuck obviously it’s totally insane but one of the most random things I noticed was on the last episode in the white room on the ceiling. There’s shit tons of AC vents or some sort of vent at the top- like the ceiling is totally covered. What the fuck is that",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1krix1c/keep_sweet_pray_obey_i_have_a_question/"
    }
]