[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 8,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 312,
        "comments": 1856,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1n71pyj",
        "author": "Similar_Diver9558",
        "title": "'Irrelevant meets intolerable': Meghan Markle’s Netflix show tanks - Season 2 misses Top 10 entirely",
        "content": "",
        "upvotes": 305,
        "comments": 105,
        "media": null,
        "permalink": "/r/netflix/comments/1n71pyj/irrelevant_meets_intolerable_meghan_markles/"
    },
    {
        "id": "1n7altt",
        "author": "Educational_Tea2511",
        "title": "WEDNESDAY on netflix",
        "content": "I just finished *Wednesday*, and man, I’m not getting why everyone’s obsessed! Jenna Ortega’s got that deadpan stare on lock, and the show’s got a cool spooky vibe, but the story? Total snooze-fest. It’s like someone threw every teen show into a blender with some fake cobwebs. You’ve got the usual “weird kid with a big destiny” deal, a boring love triangle, and a boarding school that’s basically Hogwarts’ less fun cousin. It’s trying to be peak Tim Burton, but it’s more like Tim Burton’s distant nephew who’s trying too hard. Some parts dragged worse than my Monday mornings, and half the characters are flatter than my phone battery at 1%. I’ve seen X users call it overhyped, whining about the same old plot. Anyone else think it’s a bit of a yawn? What didn’t vibe for you? ",
        "upvotes": 38,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1n7altt/wednesday_on_netflix/"
    },
    {
        "id": "1n6ojq5",
        "author": "Longjumping_Land_977",
        "title": "Chris Watts claims he’s a ‘changed man’ and ‘forgiven by God’ in new letters to female pen pal",
        "content": "",
        "upvotes": 359,
        "comments": 194,
        "media": null,
        "permalink": "/r/netflix/comments/1n6ojq5/chris_watts_claims_hes_a_changed_man_and_forgiven/"
    },
    {
        "id": "1n71i3j",
        "author": "spider3407",
        "title": "Leanne",
        "content": "Has anyone else seen the show Leanne on Netflix? I'm watching it and it is so funny and clever. I'm surprised no one else has talked about it. It is so funny to see Kristen Johnson in a role where she drinks. I recently finished rewatching the show Moms. \nEdited for typos.",
        "upvotes": 64,
        "comments": 58,
        "media": null,
        "permalink": "/r/netflix/comments/1n71i3j/leanne/"
    },
    {
        "id": "1n79cox",
        "author": "Routine-Ad-1546",
        "title": "Katrina: Come Hell and High Water documentary",
        "content": "I know the documentary is new but its #2 of Netflix top 10 and I feel like its not talked about enough. I remember when Hurricane Katrina hit, I was 7 living in Winter Park, Florida and what we went through wasn't nearly half as bad as NOLA. I've cried so much and i'm not even finished with the 2nd ep. This documentary is so extremely devastating, a bunch of piss poor excuses working as government servants. The only one with integrity and honor being General Honoré. Its always better to be safe then sorry, mandatory evacuation of ppl in below sea level neighborhoods should've been 1st and not even second guessed. The corrupt Major Nagin, awful Governor Blanco, incompetent FEMA Director Brown, horrendous President Bush just ugh I want to vomit and I wonder if how tragically they screwed this up lives in their heads to this day.... None of them cared about their constituents or residents in the region. My heart aches.",
        "upvotes": 14,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n79cox/katrina_come_hell_and_high_water_documentary/"
    },
    {
        "id": "1n7hgcn",
        "author": "negborhodhypersexual",
        "title": "Cole’s character from My life with the Walter boys is badly written",
        "content": "I am sorry but I had to say it. I know he is supposed to be this bad boy heartthrob stereotype, but all the interactions he has with Jackie or parts that are supposed to further his storyline are shallow and badly delivered. I don’t know if it’s the writers, the actor or everything else, but I just can’t seem to connect with him. \n\nAlso, the actor’s bone structure doesn’t fit with the overall age casting. I know this show has a lot of complaints about the actors not suiting the ages they’re supposed to be, but at the same time he’s the one that sticks out the most for me, especially next to Danny who is supposed to be his twin.\n\nThe show seems like they’re trying to have Damon and Stefan the remake, but it’s not working because those two were ancient vampires. The dark and broody bit on a teenager without going deeper into his struggles or thought process is just cringe.",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1n7hgcn/coles_character_from_my_life_with_the_walter_boys/"
    },
    {
        "id": "1n731vx",
        "author": "Boho_baller",
        "title": "Dark. German with English subtitles OR English voiceover with subtitles",
        "content": "What did you find was the best way to watch the series Dark? I speak English. I always use subtitles regardless of the language, but how should this show be watched for best experience and understanding of context? ",
        "upvotes": 10,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1n731vx/dark_german_with_english_subtitles_or_english/"
    },
    {
        "id": "1n7cf2b",
        "author": "3M4N59",
        "title": "“Zero Day” Proteus",
        "content": "If proteus was merely stress then how come the Mossad agent literally mentioned it on the phone with him? Aswell as coming up to rodger at the funeral asking if he was “hearing music” etc… if it was never rebooted then why did it even come up at all? This really bothered me and kind of ruined the show, I haven’t seen anyone else discussing this either.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n7cf2b/zero_day_proteus/"
    },
    {
        "id": "1n6nt7c",
        "author": "DetectiveHot2071",
        "title": "KJ Apa spills messy details about the Riverdale cast sleeping together while filming",
        "content": "i knew it was happening but i'm still kinda shocked he said it so blatantly in an interview hahaha fourteen year old me is freaking out",
        "upvotes": 66,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1n6nt7c/kj_apa_spills_messy_details_about_the_riverdale/"
    },
    {
        "id": "1n6r2gu",
        "author": "bigguys45s",
        "title": "Just curious, for fans of Netflix’s, “Trainwreck” series of documentaries, what topics would you like to see next/ discussed about?",
        "content": "Maybe like the rise and fall of certain companies/ corporations over the years/ or even the current Roblox game scandals/ downfall, lol. Or the rise and falls of certain social media personalities/ YouTubers as well.\n\nI honestly enjoy the, “Trainwreck” series quite a bit. Entertaining (if often shocking) documentaries with a bit of twisted/ dark humor thrown in there as well.",
        "upvotes": 35,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1n6r2gu/just_curious_for_fans_of_netflixs_trainwreck/"
    },
    {
        "id": "1n75g21",
        "author": "Lonely_Holiday9034",
        "title": "The Hunting Wives",
        "content": "Okay so when I originally saw this show I immediately assumed it was a reality tv show LOL and man was I happy to be wrong. Such a good storyline that genuinely kept me guessing. Some of the characters had more predictable storylines obv because of foreshadowing etc etc but there were a lot of things I anticipated that I was wrong about. Now I’m rewatching it with my husband and catching more details I missed the first time around. And season 2?!!! Can’t wait. My one *annoyance* is that Sophie is just stupid reckless by the end by I guess they have to keep the plot movin somehow 😂😂😂🤷‍♀️",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1n75g21/the_hunting_wives/"
    },
    {
        "id": "1n6z6v1",
        "author": "Randomcosgirl",
        "title": "What’s going on?",
        "content": "Ok so earlier Netflix was ok but now it’s just a blank screen, I cleared the cashe, I checked the WiFi, I opened and closed it, I restarted my computer. Nothing will work. Is someone able to help me out",
        "upvotes": 6,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1n6z6v1/whats_going_on/"
    },
    {
        "id": "1n713e7",
        "author": "mywerkaccount",
        "title": "Dinnertime Live Season 3 guests so far",
        "content": "Wanted to get everyone's thoughts on this seasons guests on Dinnertime Live so far? \n\nWife and I love the show, love David, love Chris. But so far this season has premiered with the odd choice of choosing two guests that have already appeared - Joe Manganiello and Joel Kim Booster, then next they had Bill Simmons and Mina Kines (two names that are barely known outside of the US), and tonight is Chrissy Teigen and Diplo. \n\n\nI'm not saying I expect A level celebs but I just assumed they would have a larger pool of celebs wishing to be on the show as it seems like a good time, Dave seems like a good dude, and the food looks amazing. \n\n",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1n713e7/dinnertime_live_season_3_guests_so_far/"
    },
    {
        "id": "1n77u5t",
        "author": "oldsoulpapaya",
        "title": "My Life With the Walter Boys - season 2 issues. Jackie and Cole",
        "content": "I love My Life With the Walter Boys so much!! The whole cast seems so lovely and like a genuine family. But I have a few issues with season 2…\n\nFor me, the actress who plays Jackie can not act at all. Her character did not land. A lot of the scenes of hers felt stiff, flat, disengaged and unnatural. Take the final scene for example when the ambulance comes, her reaction just didn’t feel natural. It felt laboured and half hearted and I noticed it enough that it effected my overall feeling \n\nBy comparison the actor who plays Cole I thought was fantastic this season. I loved the delivery of that portrayal of the actor, really shined, especially this season. He did such a beautiful, seamless transition that  made him more likeable, vulnerable and understandable. It’s such a lovely light hearted family show that reflects the beauty and complexities of family subtly, and his character adds depth and rawness, which is really refreshing. He’s doing a great job\n\nThe love triangle though….is driving me crazyyyy. I honestly feel like it’s so obvious that Cole and Jackie are meant to be together. Their chemistry feels so natural, and they bring out the best in each other, it’s real relationship energy and intimacy where they feel like an in love couple with an unsaid understanding \n\nI really don’t enjoy Jackie and Alex as a couple. At all. It’s frustrating that season 2 ended on basically the same cliffhanger as season 1… but at least there’s clear growth with Cole this time around. His character feels more grounded and less arrogant, which I loved seeing\n\nI  want Jackie to finally settle down instead of bouncing between the brothers. Alex might be the “good boy” type, but it’s obvious Jackie’s heart is with Cole. That’s the relationship I want to see play out in season 3\n\nIt’s a great show and I adore the family essence of it but I have issue with season 2 not being much growth in the story and the actress who plays Jackie not being really present in her delivery. For me it was Cole’s character who really shined this season but I’m hoping everything steps up for everyone in season 3\n\nWhat does everyone else think?? ",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1n77u5t/my_life_with_the_walter_boys_season_2_issues/"
    },
    {
        "id": "1n6wlwn",
        "author": "bigguys45s",
        "title": "For those into music documentaries: What bands/ artists do you want to see a Netflix documentary/ movie on?",
        "content": "Beck, The Tubes, Prince, Madonna, Bjork, The Beach Boys, Talking Heads, Pearl Jam, Rolling Stones, Aerosmith, Van Halen, etc all come into my mind, but any other artists/ bands at all?\n\nThat DEVO music documentary sure was pretty cool/ insightful/ interesting for sure. Any other suggestions?",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1n6wlwn/for_those_into_music_documentaries_what_bands/"
    },
    {
        "id": "1n74062",
        "author": "NetflixBeforeSleep",
        "title": "What I think Wednesday vs Enid would have on their Shelf- thoughts?",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n74062/what_i_think_wednesday_vs_enid_would_have_on/"
    },
    {
        "id": "1n7b92y",
        "author": "Swimming_Kiwi_895",
        "title": "Anyone else feel like the film could have done more theme wise?",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n7b92y/anyone_else_feel_like_the_film_could_have_done/"
    },
    {
        "id": "1n6r0qo",
        "author": "Spy_RuLe11037",
        "title": "Can I save something when it’s due to leave Netflix?",
        "content": "Started watching prison break just over a week ago when I was recommended it by Netflix as it was leaving soon.\nLeaves tomorrow, and have 16 episodes overall to watch (12hrs) and no other place to stream it. Physically impossible to finish in time as tomorrow is in 5 hrs\n\nIs there a way similar to how you can download episodes to watch offline, but to watch after it’s left?",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1n6r0qo/can_i_save_something_when_its_due_to_leave_netflix/"
    },
    {
        "id": "1n71l26",
        "author": "irregular013",
        "title": "Drawing Closer - you found me... no... we found each other...",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/s3rg8ya6qumf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1n71l26/drawing_closer_you_found_me_no_we_found_each_other/"
    },
    {
        "id": "1n66u2r",
        "author": "Jenksz",
        "title": "Castlevania is Insanely Underrated",
        "content": "I never played the video games before watching this series but holy hell, this thing is genuinely a work of art. I’m at the end of season two and the voice acting, animation, the fight scenes… it’s just art. I can’t get over how good this thing is and how I’ve been sleeping on this. It’s just so incredibly good and I had to make sure others know it exists. \n\nFrom what I’ve read some people that have played the video games and are puritans weren’t all thrilled given that it seems like the plot differed from the games somewhat, but as someone coming into it fresh it’s incredibly entertaining to watch. Can’t remember the last time a Netflix show hooked me like this.  ",
        "upvotes": 76,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1n66u2r/castlevania_is_insanely_underrated/"
    },
    {
        "id": "1n79ask",
        "author": "o-J-A-Y-_-J-A-Y",
        "title": "Netflix removing content",
        "content": "Why was \"its always sunny in Philadelphia\" and \"the office\" removed from netflix UK? Just two days ago, netflix said its always sunny in \nPhiladelphias new season is coming soon? They're my two regular background shows.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1n79ask/netflix_removing_content/"
    },
    {
        "id": "1n6ryh1",
        "author": "indiewire",
        "title": "Kathryn Bigelow's 'A House of Dynamite' Is Best of Netflix at Venice",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n6ryh1/kathryn_bigelows_a_house_of_dynamite_is_best_of/"
    },
    {
        "id": "1n5oasb",
        "author": "CosmicCricket13",
        "title": "The Great Hack is one of the wildest documentaries I’ve seen in a while",
        "content": "I just finished The Great Hack on Netflix and I can’t stop thinking about it. The way the documentary lays out the Cambridge Analytica scandal feels like a thriller more than a history lesson. They follow people who were directly involved  journalists, former employees, even people who had their data pulled into the whole thing  and it shows how personal information became a weapon during elections.\n\nThe film does a really good job of making you see data as more than just numbers on a screen. They literally call it the most valuable resource in the world now, even more than oil, and watching how easily it was collected and sold was pretty disturbing.\n\nI think the scariest part was how much of it happened quietly. Most people had no idea their Facebook likes or quiz answers were being used to build psychological profiles on them. By the time they realized it, the damage had already been done.  It made me think about how much info we all give away without even noticing and it makes you a little sacred or at least made me a little scared. \n\n  \nWhat did you people think, did you like the premise? And also what are some movies like it that I can watch to feed my paranoia lol",
        "upvotes": 438,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1n5oasb/the_great_hack_is_one_of_the_wildest/"
    },
    {
        "id": "1n78n72",
        "author": "Excellent-Chair2796",
        "title": "Just Re-Subscribed But Will Be Leaving after the Month - Layout Is Terrible !!!",
        "content": "What the f\\*\\*\\* have Netflix done.   I have just re-subscribed yet have this total overload clunky giant layout that is quite simply AWFUL.  I've been away for a while and was looking forward to catching up on Netflix again, yet now am waiting for my subscription to end - this is surely Netflix committing corporate suicide !!!  Am I alone ?????",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1n78n72/just_resubscribed_but_will_be_leaving_after_the/"
    },
    {
        "id": "1n6m3mt",
        "author": "ArtylessQc",
        "title": "Unable to install netflix",
        "content": "My grandma wants to get netflix on her samsung smart tv, so I got to work and started to connect the tv to the wifi then opened the app. It wasn't loading at first, so I tried uninstalling the app but I can't find it again in the store. Has anyone experienced that and how can I find it? I have absolutely no experience with tvs lol",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n6m3mt/unable_to_install_netflix/"
    },
    {
        "id": "1n6ub03",
        "author": "Certain_Criticism568",
        "title": "How do I change language of the whole app on my phone?",
        "content": "I’m trying to learn German so I would like to see a lot of German films and TV series. \nBut my phone is in English and my account is in Italian so I only see films/series available in those languages, and only very few are available in German if I start the film and change the language subtitles/audio. \n\nHow do I change this? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n6ub03/how_do_i_change_language_of_the_whole_app_on_my/"
    },
    {
        "id": "1n6shwv",
        "author": "Playful_Row8100",
        "title": "90+ Best Netflix anime series. One ultimate watchlist.",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n6shwv/90_best_netflix_anime_series_one_ultimate/"
    },
    {
        "id": "1n6huam",
        "author": "KOFdude",
        "title": "Subtitles are getting delayed for me, but only on my profile",
        "content": "I was trying to watch Breaking Bad but I quickly noticed at episode 2 that the subs were out of sync, which is a big problem for me as I have hearing difficulties and therefore need them. I assumed this was a problem with the episode itself at first, but for some reason when my mum tried watching it on her profile (same account) the subtitles *were* in sync with the audio. Does anyone know why this is happening? I checked our settings but the only real difference there is that I've turned off previews and I doubt that actually effects anything.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n6huam/subtitles_are_getting_delayed_for_me_but_only_on/"
    },
    {
        "id": "1n60hru",
        "author": "AccurateInflation167",
        "title": "Staten Island Republican shares bizarre request to Netflix: bring back DVDs",
        "content": "",
        "upvotes": 48,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1n60hru/staten_island_republican_shares_bizarre_request/"
    },
    {
        "id": "1n69kty",
        "author": "chikapukiffy",
        "title": "Thriller/Mystery/ Mind-f*ck",
        "content": "\nGiving you the list I have watched with this genre :) \n\nM for Movie\nS for Series\n\nForgotten - M\n\nFractured - M\n\nMurder Mystery - S\n\nHigh Potential - S (Disney+)\n\nThe Residences - S\n\nFlower of Evil - S\n\nBehind her Eyes - S\n\nMemoir of a Murderer - M\n\nEscape Room - M\n\nThe Intruder - M\n\nWhen a Stranger Calls - M\n\nSecret Obsession - M\n\nThe Weekend Away - M\n\nTaken - M \n\nUnknown - M \n\nThe Call (2013) - M\n\nThe Call (2022, Park Shin Hye) - M \n\nWhen the Bough Breaks - M\n\nCarry-On - M\n\nThe Guilty - M\n\n7 Women and a Murder - M\n\nMurder Mystery - M\n\nMissing - M\n\nTime Cut - M\n\nReptile - M\n\nMurderer (Korean) - M \n\nLast Seen Alive - M \n\nVanished Into the Night - M\n\nSomewhere Between - S\n\nOnly Murders in the Building - S (Disney+)",
        "upvotes": 3,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1n69kty/thrillermystery_mindfck/"
    }
]