[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 35,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 10,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pmuo0i",
        "author": "EgoExplicit",
        "title": "Cancelled after being told Netflix can’t be used while traveling",
        "content": "I’ve been a Netflix customer since the early days. I travel frequently for work and usually bring a Roku stick to use in hotels.\n\nThis week I couldn’t log in, so I contacted Netflix support. I was told that my subscription is intended for use at my home location and that I can’t use it while traveling.\n\nWhat’s frustrating is that I’m on a plan with a 4-device limit and I stay within it. I’m not sharing my account with anyone outside my household — I’m just logging in from a different location while traveling.\n\nIt feels like Netflix has shifted from enforcing device limits to enforcing location, which is a big change in how the service works, especially for people who travel often. Streaming on a phone or laptop seems to work, but devices like Roku or Apple TV are where the problems show up.\n\nThe policy itself was disappointing, but what really pushed me to cancel was how little concern there was about losing a long-time customer. The response was essentially “that’s just how it is.”\n\nIf you travel often and rely on streaming devices, this is something to be aware of.",
        "upvotes": 1198,
        "comments": 164,
        "media": null,
        "permalink": "/r/netflix/comments/1pmuo0i/cancelled_after_being_told_netflix_cant_be_used/"
    },
    {
        "id": "1pmpu37",
        "author": "bottlecoco",
        "title": "need a ONE-SEASON banger Netflix show",
        "content": "Hey guys,\n\nI’m begging at this point. I don’t want a slow burn. I don’t want “it gets good in season 3.”\nI want a ONE-SEASON show on Netflix that just hits from start to finish.\n\nSomething so good I finish it in one sitting, stare at the wall afterward, and rethink my existence.\nNo fillers. No dragging. Just straight banger energy.\n\nAny genre is fine — thriller, mystery, drama, sci-fi — as long as it’s elite.\nPlease save me from scrolling Netflix for 40 minutes and watching nothing 🙏\n\nDrop your best recommendations ⬇️",
        "upvotes": 436,
        "comments": 876,
        "media": null,
        "permalink": "/r/netflix/comments/1pmpu37/need_a_oneseason_banger_netflix_show/"
    },
    {
        "id": "1pmkt4e",
        "author": "SnooSprouts2672",
        "title": "How would you rank the Knives Out movies?",
        "content": "  \nMy personal take below:\n\n1. Knives out (won by a mile for me)\n2. Wake up dead man\n3. Glass onion\n\nUnlike most people who watched 1 and 2 first. 1 never watched a Knives out movie before. So i watched 2 then 3. And lastly 1. I didnt enjoy Glass Onion but the ending with explosions was spectacular. Loved WUDM but to me the Knives Out 2019 was the perfect movie for me.\n\n\n\n  \n",
        "upvotes": 92,
        "comments": 96,
        "media": null,
        "permalink": "/r/netflix/comments/1pmkt4e/how_would_you_rank_the_knives_out_movies/"
    },
    {
        "id": "1pmhlht",
        "author": "Dariusgamer2007",
        "title": "Why is my ‘Your next watch’ 95% things I’ve already watched?",
        "content": "I’m really confused because Netflix for a few months now has been recommending me nothing but series and movies I’ve already watched. What’s going on? How do I stop this? ",
        "upvotes": 50,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1pmhlht/why_is_my_your_next_watch_95_things_ive_already/"
    },
    {
        "id": "1pmz5j7",
        "author": "AccomplishedPut5175",
        "title": "Wake Up Dead Man:A knives Out Mystery",
        "content": " i just finished watching this movie, and... I watched, if I can say, the first parts of this film as well, and while each part stands on its own, honestly, this third part of the sequel seems the weakest to me. The cast is perfect, but I prefer the stories from the earlier parts, especially the first part of this film saga.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1pmz5j7/wake_up_dead_mana_knives_out_mystery/"
    },
    {
        "id": "1pm0zc2",
        "author": "Fit_Possession_5545",
        "title": "The Beast in Me",
        "content": "Claire Danes in The Beast in Me is such a good actor. The lighting, the musical scoring, the characters all complemented the plot. Never a boring moment.\n\nMust watch.",
        "upvotes": 156,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1pm0zc2/the_beast_in_me/"
    },
    {
        "id": "1pmy0wg",
        "author": "shinyhpno",
        "title": "Anything that can keep a kid's attention?",
        "content": "Preferably animated for my sake, but this is a kid who needs action and dialogue only when it's funny. Rango, Godzilla: KOTM, Karate Kid: Legends are some of the recent ones we've enjoyed.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pmy0wg/anything_that_can_keep_a_kids_attention/"
    },
    {
        "id": "1pmx3mg",
        "author": "harpreetthind",
        "title": "Question about movies on TV show",
        "content": "Currently watching orange is the new black finished watching the beast in me and the haunting of Hill House and the haunting of Bly Manor and midnight mass what else does everybody recommend watching? Thanks for the suggestions",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pmx3mg/question_about_movies_on_tv_show/"
    },
    {
        "id": "1pmu7aw",
        "author": "NoBeing3286",
        "title": "Wayward- why Alex makes weird choices",
        "content": "Because he’s a sub and he is Laura’s. \nThe sex scene is important to the plot. \n\nLaura says something like “he is all mine\nThe sex scene also tells us that Laura is not how she looks, she takes control- later becomes cult leader. \nAlex belongs to Laura- he depends on her emotionally, he doesn't know how to not live in Laura’s world (almost like Leila). ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pmu7aw/wayward_why_alex_makes_weird_choices/"
    },
    {
        "id": "1plwvm6",
        "author": "Jumpy-Weekend-1223",
        "title": "Why is the volume so inconsistent when watching Netflix",
        "content": "most of the dialogue is barely audible, but during intense scenes the volume suddenly becomes extremely loud...the awful volume swings is just diagusting\n",
        "upvotes": 150,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1plwvm6/why_is_the_volume_so_inconsistent_when_watching/"
    },
    {
        "id": "1pmk8yp",
        "author": "harrietrosie",
        "title": "Best true crime docs 2024-2025",
        "content": "I've just got netflix again, haven't had it since 2023. Can anyone recommend some good true crime docs that I've missed in that time? I'm not really interested in heist/fraud etc.",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pmk8yp/best_true_crime_docs_20242025/"
    },
    {
        "id": "1plvc58",
        "author": "Less_Manufacturer218",
        "title": "Wake Up Dead Man, I really liked it!",
        "content": "It’s a very entertaining movie with a lot of underlying messages. The characters were great in their roles. The whole movie has a fantasy aspect to it that is also great and keeps you engaged!",
        "upvotes": 109,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1plvc58/wake_up_dead_man_i_really_liked_it/"
    },
    {
        "id": "1pmptn0",
        "author": "azaman92x",
        "title": "Recommendations please",
        "content": "I watched both seasons of the Night Agent and really enjoyed them (I know some people didn’t like the writing/plots but I did) and I hear there is a third season coming out soon, (no date released for the UK yet?) so I’m looking for recommendations on what to watch in the meantime please? TIA",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pmptn0/recommendations_please/"
    },
    {
        "id": "1pmurbz",
        "author": "fromindia1",
        "title": "Owning Manhattan got me wondering about realtors",
        "content": "Watching the show and seeing the agents that are selling multimillion dollar properties with huge egos. \n\nWhat is it that drives them to work for a broker instead of being on their own? They work as independent contractors, not employees. They bring their own business. They have their own teams, etc. Ravi has been mentioned a few times, but for some reason has not been on the show directly. \n\n\nWhat is it that Serhant offers these guys that they could not do on their own? \n\nI can see new agents depending on a firm to bring in listings, provide advertising, etc. but what’s in it for the experienced ones? The likes of Peter “Rabbit”, Jordan, etc.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pmurbz/owning_manhattan_got_me_wondering_about_realtors/"
    },
    {
        "id": "1pm0rj2",
        "author": "Wonderful_ion",
        "title": "What should I watch that is of substance on Netflix?",
        "content": "I’m open to either a show or a film and pretty flexible about genre. Curious what you’d recommend.\n\nThe last three I watched were Before Sunrise, The Talented Mr. Ripley, and The Virgin Suicides. All three had that very ’90s sense of longing and identity, more atmospheric than plot-driven, and they really lingered after.",
        "upvotes": 28,
        "comments": 110,
        "media": null,
        "permalink": "/r/netflix/comments/1pm0rj2/what_should_i_watch_that_is_of_substance_on/"
    },
    {
        "id": "1pmkwnx",
        "author": "Expert_Dealer_4439",
        "title": "Robby Hoffman special",
        "content": "Curious everyone else’s take. I watched this morning n felt pretty 😬 about the begining MEN/pedo jokes. The middle got better but overall I wasn’t super into it. Maybe I just prefer her podcast vibes. But curious what other fans thought.",
        "upvotes": 2,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1pmkwnx/robby_hoffman_special/"
    },
    {
        "id": "1plbq9a",
        "author": "arkelangel",
        "title": "I'm done.",
        "content": "I'm done. Years of subscriptions. Netflix has decided to remove casting. My tvs using chrome cast. I don't have a Netflix ap on my tv. I don't want to buy a new tv. I want to be able to cast when I go to friends houses, or when I'm in a hotel. Like.... This was a great feature. Netflix isn't useful to be if i can't watch it on my tv. I'm just so frustrated. I know it isn't customer services fault but omg ....",
        "upvotes": 1172,
        "comments": 224,
        "media": null,
        "permalink": "/r/netflix/comments/1plbq9a/im_done/"
    },
    {
        "id": "1pmkagx",
        "author": "nivz17",
        "title": "Netflix talkback issue",
        "content": "Randomly netflix on my phillips tv has started to talkback fulltime. Everything is disabled on the tv and the only app talkingback is netflix. I cant disable it. Any ideas?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pmkagx/netflix_talkback_issue/"
    },
    {
        "id": "1pmk4mo",
        "author": "Sufficient-Curve2951",
        "title": "Had I Not Seen the Sun",
        "content": "The way Part 1 left things off, I felt Part 2 would feature a twist angle or some redemption for Jen-yao. But the Tien-cheng and Hsiao-tung reveal was kinda underwhelming for me. Does anybody else feel that way?\n\n[https://www.soapcentral.com/shows/had-i-not-seen-sun-part-2-ending-explained-pin-yu-s-real-identity-revealed-jen-yao-faces-consequences](https://www.soapcentral.com/shows/had-i-not-seen-sun-part-2-ending-explained-pin-yu-s-real-identity-revealed-jen-yao-faces-consequences)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pmk4mo/had_i_not_seen_the_sun/"
    },
    {
        "id": "1pmjcbc",
        "author": "chumba170",
        "title": "“Next Episode” showing up way before episode ends",
        "content": "Seems to only be on the website version but I’ve been rewatching Spartacus on Netflix via my pc and several times I’ve had the “next episode” and “watch credits” tabs pop up well before the episode ends (sometimes halfway through). I already disabled auto play so I’m not sure how to fix this. Any advice would be appreciated! ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pmjcbc/next_episode_showing_up_way_before_episode_ends/"
    },
    {
        "id": "1pmlr6c",
        "author": "alexc2020",
        "title": "Why is there no option on Netflix (or any streaming service) to permanently/always skip summaries and intros?",
        "content": "Why is there still no simple setting on Netflix (or any streaming service) that says: “Always skip the recap, always skip the intro, and never ambush me with extra stuff”?\n\nGive me a real preference toggle:\n“Start content immediately. No recap. No intro. No sneak attack.”\n\nBecause sometimes the only summary I need is: I’m here to watch the thing I clicked on.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1pmlr6c/why_is_there_no_option_on_netflix_or_any/"
    },
    {
        "id": "1pm6682",
        "author": "Past_Armadillo2398",
        "title": "How long will the 2025 Christmas NFL games be available for replay on Netflix?",
        "content": "I know for 2024, Netflix supposedly let the games be available for replay 3 hours after they ended. But I cannot find any specific information for 2025. I am guessing it will be the same, but I am trying to find out for sure so I can plan around X-Mas commitments. Thanks",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pm6682/how_long_will_the_2025_christmas_nfl_games_be/"
    },
    {
        "id": "1pm62xb",
        "author": "EverythingElse42",
        "title": "What's on your Netflix+ watch list.",
        "content": "After the merger, what will you be watching first from the new content.\n\nOnce (and if) the purchase goes through and the content gets incorporated into Netflix (or Netflix +)\n\nWhat is going on your watch list?\n\nI look forward to...\n\n\nSuccession.\n\nThe last of us. \n\nVeep\n\nWestworld \n\n",
        "upvotes": 6,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1pm62xb/whats_on_your_netflix_watch_list/"
    },
    {
        "id": "1plx28l",
        "author": "missmightberight",
        "title": "Hjem til jul / Christmas at home season 3",
        "content": "Who’s seen the new season? What do you guys think about it?\n\nI looove it and hope there’ll be a hundred more seasons. No better series to start Christmas time. 🥹\n\nGosh I still hope Jonas and Johanne end up together, their chemistry is just different. 😭",
        "upvotes": 23,
        "comments": 72,
        "media": null,
        "permalink": "/r/netflix/comments/1plx28l/hjem_til_jul_christmas_at_home_season_3/"
    },
    {
        "id": "1pmu3op",
        "author": "Prior_Recipe_5999",
        "title": "S1e4",
        "content": "Absentia is awesome\n\nNick should not have slept with Emily\n\nI think Jack was involved in her kidnapping\n\nI feel bad for Alice\n\nAbsentia is awesome\n\nNick should not have slept with Emily\n\nI think Jack was involved in her kidnapping\n\nI feel bad for Alice\n\nAlso she didn’t kill Adam he didn’t abduct her it would serve no purpose if she wanted to kill him she would have done so right then ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1pmu3op/s1e4/"
    },
    {
        "id": "1pmdmyd",
        "author": "AryanKayum",
        "title": "Has this happened to anyone?",
        "content": "When I try to play watch any show or movie the screen shows a error popup (error code 5.10) \nIt appears everytime I tap on the video or try to watch something \nI can't see anything \nDidn't find anything related to my ecact problem so decided to make a post.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pmdmyd/has_this_happened_to_anyone/"
    },
    {
        "id": "1pm4ihj",
        "author": "Business_Prune_7638",
        "title": "Any good shows on Netflix?",
        "content": "I don’t have a certain genre as long as it’s good I really been into shows like beast in me, stranger things, and Ginny and Georgia. I like teen high school typa shows or like good thrillers been waiting for the new stranger things episodes to drop. ",
        "upvotes": 4,
        "comments": 69,
        "media": null,
        "permalink": "/r/netflix/comments/1pm4ihj/any_good_shows_on_netflix/"
    },
    {
        "id": "1plwohc",
        "author": "MrMrsPotts",
        "title": "Netflix is really really annoying now",
        "content": "I signed up for the ad version of Netflix. I tried to use it on my TV  but it apparently it is unusable on my model of TV! I have to pay twice as much for the ad free version. So I thought I would cast it from my phone. The ad version doesn't you caat either! So there is no way for me to watch Netflix even though I am paying for it.",
        "upvotes": 11,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1plwohc/netflix_is_really_really_annoying_now/"
    }
]