[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 11,
        "comments": 72,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 60,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1lbn9mj",
        "author": "ElevatorNo415",
        "title": "Straw is one of the worst movies I’ve ever seen.",
        "content": "One of the most over the top unrealistic movies I’ve ever seen. Even for a Tyler Perry movie. If you like to constantly yell at the screen “yeah right that would never happen!” Then this movie is for you. Taraji P. Henson is a good actor but the entire supporting cast was so bad it was comical. ",
        "upvotes": 119,
        "comments": 177,
        "media": null,
        "permalink": "/r/netflix/comments/1lbn9mj/straw_is_one_of_the_worst_movies_ive_ever_seen/"
    },
    {
        "id": "1lbr5im",
        "author": "Snoo-66268",
        "title": "Justice for Mind Hunter!!!",
        "content": "Mindhunters had so much potential. It started slow, but the characters were just starting to develop. I throughly enjoyed the 70s era it was set, pre-technology. Hate when a good series ends abruptly and we’re left with unanswered questions and an empty void lol. \n\nI only recently heard of this show after so many redditors posted about it. I’m wondering why it was never on my radar when it came out. It must have been overshadowed when it debuted? Hoping there’s some possibility for a season 3, but that’s unfortunately just wishful thinking after some quick google searches :(",
        "upvotes": 20,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1lbr5im/justice_for_mind_hunter/"
    },
    {
        "id": "1lbja1p",
        "author": "Own_Spring_3489",
        "title": "Already watched shows",
        "content": "Is there a way to get netflix to stop suggesting shows you've already seen. In the \"your next watch\" section its now pretty much entirely shows ive already seen which has recently meant I am struggling to find new shows to watch because I normally just go by their recommendation. ",
        "upvotes": 62,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1lbja1p/already_watched_shows/"
    },
    {
        "id": "1lc4791",
        "author": "Fryolo",
        "title": "Looking for a song",
        "content": "Vatican Girl, episode 2, min 14.40 there is a scene of an old italian singer (Jimmy Fontana) singing in a club. I’m looking for the title of the song. I can’t use shazam because it’s too short, and by listening to the words he sings I can only understand “…e bon voyage a tutti…”. Can someone help me? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lc4791/looking_for_a_song/"
    },
    {
        "id": "1lbnwa5",
        "author": "Rachelgal2",
        "title": "Where Straw fell apart",
        "content": "This movie’s plot became absurd to be when the mom showed up to the daughter’s school and spoke with the principal about getting a phone call.\n\nIf I saw someone 24 hours after their child died, wearing their work clothes, saying I called them when I didn’t, I would be very alarmed and would not let that person leave without contacting a medical office or hospital.  She was clearly not it her right mind and no way a principal would shrug that off.  ",
        "upvotes": 14,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1lbnwa5/where_straw_fell_apart/"
    },
    {
        "id": "1lc2flc",
        "author": "SoleSurvivor893",
        "title": "Documentary High Score Episode 1. Anyone know the instrumental song playing?",
        "content": "In episode one of the documentary high score on Netflix there’s a song playing in the background at the 22:40 mark right when the narrator starts talking about the success of Pac-Man with the audience of American women. It sounds like an upbeat version of some original pac man intro or beat but I’m blanking on whether it was an original song or something made by the folks in the documentary. Does anyone know where I can find an unedited and original version of this instrumental? Thanks!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lc2flc/documentary_high_score_episode_1_anyone_know_the/"
    },
    {
        "id": "1lb51pl",
        "author": "clevertulips",
        "title": "Why is Cobra Kai series considered good… universally bad acting, gratuitous nonsensical fight scenes every 5 seconds… ?!",
        "content": "Genuinely, I’m amazed that people rave about this series.  The cringe factor is off the charts,  most of the time, and the despair to be anything like Karate Kid is truly laughable considering just how bad the writing is. What the heck??",
        "upvotes": 191,
        "comments": 117,
        "media": null,
        "permalink": "/r/netflix/comments/1lb51pl/why_is_cobra_kai_series_considered_good/"
    },
    {
        "id": "1lbwvp8",
        "author": "NavSH27",
        "title": "Help",
        "content": "So, sometimes very unuasual thing happens when i want to watch netflix on my phone. I start the episode/movie and its video freezes but audio goes on and i have to wait to power off and start again and sometimes this lasts for days, this happens with other streaming platforms on my phone aswell. But then there are days when it works perfectly fine. Can anyone help",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lbwvp8/help/"
    },
    {
        "id": "1lbz0kb",
        "author": "ScrollingThrooo",
        "title": "Code: 3-0 This title is not available to watch instantly.....",
        "content": "How do I fix this? I've deleted and reinstalled the app. No issues with any other app. Having this issue on both my AppleTV and iPhone. Works fine on my Macbook Pro. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lbz0kb/code_30_this_title_is_not_available_to_watch/"
    },
    {
        "id": "1lbs9pz",
        "author": "FinalRecognition4514",
        "title": "The Straw plot twist",
        "content": "The movie was good but one thing I don’t understand is the lady at the school. How tf do you see a woman drop off a kid that doesnt exist and then hours later she comes to the school claiming she got a call about her daughter that once again… doesn’t exist. and you mean to tell me no one told her that her daughter died or at least told her  “look here crazy lady you’re daughter isn’t even here” the school hallucination scene was so far off of what actually happened ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lbs9pz/the_straw_plot_twist/"
    },
    {
        "id": "1lbiena",
        "author": "punisherisback17",
        "title": "If you were the ceo of Netflix, what would you do first!?",
        "content": "What would you do if you were the ceo? What changes would you make or add. Post whatever comes to mind and have fun. Happy weekend everyone and have fun",
        "upvotes": 11,
        "comments": 143,
        "media": null,
        "permalink": "/r/netflix/comments/1lbiena/if_you_were_the_ceo_of_netflix_what_would_you_do/"
    },
    {
        "id": "1lb2dwe",
        "author": "Sufficient-Paint-534",
        "title": "PLEASE GIVE ME SEASON 2 OF DEPT Q !",
        "content": "Okay what an amazing amazing show. Loved it. Last episode did feel a little rushed inspite of how dragged out the earlier episodes were ? Like there was so much happening. Few things I need to clarify though-\n\n1) Why did Rose say William saw Lyle on the ferry and got scared ? She meant William saw the man with the cap and not that he identified Lyle considering both lingaard siblings couldn't have remembered how Lyle Jennings looked like now\n2) Lyle acts extremely stupid when he's with his mom. Is this something to do with being abused? Because it is a little difficult to believe he pulled off all those crimes\n3) they never show the motive behind why Lyle targeted Sam. Was that because he ran in similar circles with Merritt or he just wanted to get back at Sam for punching him. Also, did Lyle pretend to be Sam H to know Merritts whereabouts or was he eventually going to know because he was stalking her.",
        "upvotes": 91,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1lb2dwe/please_give_me_season_2_of_dept_q/"
    },
    {
        "id": "1lbx8fx",
        "author": "Splat3420",
        "title": "Any good shows like cobra kai?",
        "content": "I just finished cobra kai and I thought it was awesome. I’m now stuck trying to find another show that gave me that same thrill that cobra kai gave me. Although I was never fully interested in the karate aspect of it, it was the mix of everyone’s personal lives clashing and seeing the result unfold when they fight. \nIf someone could rec a good show that was as investing as this one I’d appreciate it.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lbx8fx/any_good_shows_like_cobra_kai/"
    },
    {
        "id": "1lbptm8",
        "author": "139nn1_si3",
        "title": "Guy Burnet from Fubar season2",
        "content": "Am I the only one who instantly fall in love with Chips lol. After watching it I started searching up Guy Burnet but seems like he is not very recognized by people and I don’t get that. Like he was so attractive during the dance with Emma and his accent!!! ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lbptm8/guy_burnet_from_fubar_season2/"
    },
    {
        "id": "1lbkmah",
        "author": "Wicked-Twisted-Road",
        "title": "Recommendations for what to watch on airplane",
        "content": "Hi, I’m spending a lot of time in airports the next ten days. I need some recommendations.\n\nI really liked The Diplomat, Nobody Wants This, and Four Seasons.\n\nI had a hard time getting into Ginny and Georgia and Sirens.  \n\n",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lbkmah/recommendations_for_what_to_watch_on_airplane/"
    },
    {
        "id": "1lb9lnq",
        "author": "Noggiesformynoggin",
        "title": "Please recommend me a mystery movie/series which has elements of comedy",
        "content": "I love murder mysteries which have a touch of comedy! Though I feel I’ve watched them all? The series I’ve watched are-\n\nMurder Mystery (1&amp;2)\nOnly murder in the building (just as an example Ik it’s not on Netflix lol)\n7 women in a murder\n\nThank you!!",
        "upvotes": 15,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1lb9lnq/please_recommend_me_a_mystery_movieseries_which/"
    },
    {
        "id": "1lbbaiv",
        "author": "Wyldstallyn80",
        "title": "Fubar",
        "content": "Just watched series 2 of Fubar and this might not be a popular opinion but Guy Burnet could be a dark horse for the next James Bond, good looking, right age range and he managed to give his character a certain suaveness. ",
        "upvotes": 7,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1lbbaiv/fubar/"
    },
    {
        "id": "1lc095x",
        "author": "candy_dynac",
        "title": "The Eternaut is the worst short sci-fi series ever!",
        "content": "I cannot believe everyone worships this show. It's horrendous. There are so many plot inconsistencies. The sheer amount of plot armor the characters have is ridiculous. The female characters are so disposable and irrelevant to the story (especially the wives). The screenplay is absolutely terrible, making the characters deliver the most cringe-worthy dialogue ever (I saw the show in Spanish, I'm a native Spanish speaker, and I'm well acquainted with the idiomatic expressions and cultural references used in the show). Scenes that are supposed to be emotionally charged are underwhelming at best. Scenes that are supposed to be shocking have no shock value whatsoever. I wasted 6 hours of my life expecting this show to get better and it never did. I cannot believe they are going to do a second season!\n\nI haven't read the comic this show is supposed to be based on, but I believe it can't be worse than the show itself. \n\nOk, rant over. But I'm so annoyed! The only redeemable thing was the cast. I'm sure most of them did their best to work with what they had. ",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1lc095x/the_eternaut_is_the_worst_short_scifi_series_ever/"
    },
    {
        "id": "1lby491",
        "author": "DarthBynx",
        "title": "The new Netflix layout is pure aids and I hate it.",
        "content": "I don't understand why they had to revamp the layout. It looks like all of the other bad streaming services now. Netflix's layout was perfect before. It's the other services that should be trying to look like Netflix, not the other way around. Wtf is this shit?",
        "upvotes": 0,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1lby491/the_new_netflix_layout_is_pure_aids_and_i_hate_it/"
    },
    {
        "id": "1lblqfo",
        "author": "genericblondie",
        "title": "shows similar to Bridgerton and The Empress?",
        "content": "i’m talking, Bridgerton-esque vibes! Or if you know the show The Empress on Netflix, something like that too! I really like shows that take place in that era, but i also like there to be romance involved (i’m just a girl) and whatnot. ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lblqfo/shows_similar_to_bridgerton_and_the_empress/"
    },
    {
        "id": "1lb4q4k",
        "author": "Stunning_Magician495",
        "title": "Sirens - what was the point of the 3 ladies (Astrid, Chloe and whoever)",
        "content": "I binged the season, I’m still left with questions but the one that still irks me was, what was the point of these 3 ladies? Was it to show that they are just tick bored woman like 3 blind mice? The scene where they are shopping with Devon also made no sense? They talk about their willpower to project and get whatever they want, did Michaela find these ladies and get them these rich husbands? Was it voodoo? \n",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lb4q4k/sirens_what_was_the_point_of_the_3_ladies_astrid/"
    },
    {
        "id": "1latq5n",
        "author": "Worldly-Abrocoma2999",
        "title": "Fine I'll say it! FUBAR needs more love",
        "content": "https://preview.redd.it/lvt5xa5qyr6f1.jpg?width=1569&amp;format=pjpg&amp;auto=webp&amp;s=a9ee7e69cfb3e256134d64da44faaaca7936e5aa\n\nI don't understand why everybody is hating on FUBAR. It's the definition of a light summer watch. I personally love all of the punny jokes and references to arnold's past movies as well as the father daughter dynamic. Some people are acting like the shows goal was to be the next mission impossible or something like that. It's clearly not. Plus, I absolutely love the trope of \"will they? won't they?\" between Emma and Aldon. ",
        "upvotes": 47,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1latq5n/fine_ill_say_it_fubar_needs_more_love/"
    },
    {
        "id": "1lbm11a",
        "author": "danattack515",
        "title": "Fubar Season 2 plot issue",
        "content": "I'm only 1 and half episodes in to season 2 but surely I can't be the only one who see's the plot issue with Fubar season 2.\n\nGreta is trying to shut down the American power grid because she got paid a quarter of a billion dollars and will get another quarter of a billion when the jobs done... But they have clearly stated that if this happens the world economy will get destroyed... So what's the point in having all that money?\n\nGranted, she would still be considered \"rich\" and could look to use the money to buy other assets that hold more value in an economical disaster, but my guess is she's probably already fairly wealthy as it is, so she's probably not going to be in any considerably better position afterwards which makes the whole thing utterly pointless.\n\nJust my thoughts anyway. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lbm11a/fubar_season_2_plot_issue/"
    },
    {
        "id": "1lb7up5",
        "author": "JuryRevolutionary624",
        "title": "Will there be a season 3 of fubar",
        "content": "I really loved the two season of fubar and leaving the end with a cliffhanger and season 2 definitely exceeded my expectations and it was so good that I am rewatching from the first season again \nWould definitely love an another season tho",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lb7up5/will_there_be_a_season_3_of_fubar/"
    },
    {
        "id": "1lb9hcv",
        "author": "Glittering_South3125",
        "title": "How to remove gta banner from home screen",
        "content": "https://preview.redd.it/y7st9z6dgw6f1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=c9644dc0761b61023da7667106970fc05ccf16fc\n\nhow the hell can i remove this from my main screen, i never played game from netflix never clicked on any game why is this showing up on my screen how can i remove it",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lb9hcv/how_to_remove_gta_banner_from_home_screen/"
    },
    {
        "id": "1lbqu6i",
        "author": "zyzyx_music",
        "title": "The ads just keep getting worse…",
        "content": "I stg everytime I go on to Netflix after a little bit of time there are more ads, they happen more frequently, and are longer. It makes me sick to think that people with more money than they could ever need still want to get richer, and will sacrifice their customers for it. Same thing happened to YouTube. That’s how they get you to pay for premium. But guess what? They might add ads to premium too! It feels like they’re slowly grinding down consumers and grooming us into paying more. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lbqu6i/the_ads_just_keep_getting_worse/"
    },
    {
        "id": "1lb0q81",
        "author": "The_crazy_bird_lady",
        "title": "Where is the coming soon section?",
        "content": "Trying to find the coming soon section on this new update on my tv.  I can't find it anywhere.  Did they remove it?\n\nSo far not loving the update.  Now it's like all the other streaming services that I dislike.  I find it way more frustrating to find something to watch.",
        "upvotes": 8,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lb0q81/where_is_the_coming_soon_section/"
    },
    {
        "id": "1lbjvwq",
        "author": "Positive_Tune_5354",
        "title": "4K subscription vs 4K rent. Any explanation why 4K rent is noticeably better than Netflix 4K subscription while both are streaming?",
        "content": "I recently watched Queer 4K from Amazon prime video rent. The video quality was amazing and very crisp. Comparing it to Netflix 4K streaming, I am very disappointed that Netflix 4k doesn't look impressive at all compared to 1080p. The rent movie was also streaming. So, what is the main difference? I don't believe that Amazon prime would have better video quality compared to Netflix. I wonder if streaming services downgrade video qualities when it comes to a subscription plan. Any explanation about this?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1lbjvwq/4k_subscription_vs_4k_rent_any_explanation_why_4k/"
    },
    {
        "id": "1lbb31i",
        "author": "AnimatorNo8686",
        "title": "Netflix is broken on PC",
        "content": "I have two PC's, a better and an older one. On the better the quality is normal, but it keeps jumping back a few seconds (2-3 seconds) while I'm not even touching anything. On the older one the quality is unwatchable most of the time, even with a 30 MB/s network, and the same jumping back problem is happening here too. Why is it so broken why can't I just watch my movie?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lbb31i/netflix_is_broken_on_pc/"
    },
    {
        "id": "1lb69oa",
        "author": "RoundCalligrapher147",
        "title": "Ginny and Georgia season 3",
        "content": "Why was this season so delayed? It took quite a while for it to actually come out. Austin looks so old when ginny looks the same. They just never actually gave a full reason as to why it was actually delayed.",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1lb69oa/ginny_and_georgia_season_3/"
    }
]