[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 44,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 13,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qczq84",
        "author": "sfomonkey",
        "title": "Need light and uplifting show please. Long/many seasons would be great!",
        "content": "I'm struggling with my mental health RN, and concerned my depression will deepen. \n\nLooking for something light, uplifting, no cliffhangers, no bereavement/grieving please.   \n\nShows that ive seen that would fit the bill. Many  on the Inside, North of North, a Resident Alien were great.  The Good Place would be great, except I'm experiencing new grief and bereavement.\n\nNon Netflix shows that would work Mandalorian, Righteous Gemstones. Anime with good dub would be fine too. (Can't be bothered with subtitles ATM)\n\nA show that's uplifting, no violence would be so welcome. TIA ",
        "upvotes": 23,
        "comments": 126,
        "media": null,
        "permalink": "/r/netflix/comments/1qczq84/need_light_and_uplifting_show_please_longmany/"
    },
    {
        "id": "1qcqwi7",
        "author": "Tricky-Anywhere5727",
        "title": "Why the hell can't we just see subtitles in all languages?",
        "content": "The \"select language\" section has no effect at all, that's no secret. Even after LITERALLY REMOVING GERMAN ENTIRELY from netflix, setting my phone to English and removing German from my phones keyboard, they still only give me German subtitles or none. I don't know what to do anymore, what even is the reason why they don't show us all the languages? Most movies don't have that many dubs and subs anyways, it can't be that hard to display ~20 languages. That's the least I expect from a multimillion dollar company that I am paying a rising fortune every year.\n\n\nGet your app in order, for fucks sake ",
        "upvotes": 38,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1qcqwi7/why_the_hell_cant_we_just_see_subtitles_in_all/"
    },
    {
        "id": "1qd4xnc",
        "author": "poppunkangel",
        "title": "His &amp; Hers. Where is the banana?",
        "content": "I’m only 7 minutes in and all I can think about so far is where the heck did this man’s banana go😭 He has it in his hand like 1/4 of the way eaten and then they’re pulling up to the crime scene (shot from behind as they’re pulling up shows his one hand driving but banana is nowhere to be seen any longer). \n\nHe gets out of the car and… NO BANANA? WHERE DID IT GO? Surely he didn’t eat it that fast. ",
        "upvotes": 7,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1qd4xnc/his_hers_where_is_the_banana/"
    },
    {
        "id": "1qcnko1",
        "author": "Ordinary_Mango9815",
        "title": "Why do I do this to myself??",
        "content": "I started Mindhunter again because it’s one of my favorite shows to have ever been released on Netflix. I’m frustrated that it will never have the proper ending it deserves 😩😭😭😭\n\nJust wanted to rant about this!! Unsure why I am torturing myself by watching this over again but it’s a great show, with great acting and provides such an amazing depiction of the early days of criminal profiling. ",
        "upvotes": 26,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1qcnko1/why_do_i_do_this_to_myself/"
    },
    {
        "id": "1qd4avi",
        "author": "bludhavengabagool",
        "title": "Netflix is making a new show with Squid Game creator called The Dealer",
        "content": "\"[Netflix confirmed early this morning](https://www.hollywoodreporter.com/tv/tv-news/squid-game-hwang-dong-hyuk-netflix-the-deal-1236472053/) in South Korea that production is currently underway on The Dealer, the next original series produced by Squid Game creator Hwang Dong-hyuk. Hwang is producing the series, which has been described as a 'high-stakes casino crime drama,' but there is at least one element in the description that sets this new series apart from Hwang’s most well-known work.\n\nIn The Dealer, Geonhwa is a casino dealer who has to return to the shadowy world of illegal gambling after she falls victim to a scam and has to put her wedding plans on hold. However, to give her an edge at the tables, she 'is compelled to tap long-suppressed supernatural abilities,' which sounds like such a fun spin on the Squid Game formula of high-stakes tension and uneasy alliances with huge sums of money on the line.\" -full article [here](https://www.thepopverse.com/tv-squid-game-netflix-creator-next-project-the-dealer-supernatural-twist)",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qd4avi/netflix_is_making_a_new_show_with_squid_game/"
    },
    {
        "id": "1qcvnum",
        "author": "geologic-moose",
        "title": "Bridgerton S4 Netflix Tudum live stream BROKEN?",
        "content": "The Netflix Tudum live stream for the premier of Bridgerton Season 4 isn’t working? I’ve seen no announcement or comment from Netflix besides “We’ll Be Right Back” on the live stream page. \n\nSeems unprofessional to leave dedicated fans waiting with no knowledge of what’s going on with the event… thankfully I switched to YouTube to see cast interviews.\n\nWill we still get to see Episode 1 of Season 4? What about the special performance? So frustrating… at least tell us something!!",
        "upvotes": 7,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1qcvnum/bridgerton_s4_netflix_tudum_live_stream_broken/"
    },
    {
        "id": "1qcliu6",
        "author": "Sweaty_Parfait8251",
        "title": "Dead To Me",
        "content": "I started watching Dead To Me on Netflix this week, and it wasn’t until episode two that I found myself saying, Okay, now we have a story… IYKYK. Still wondering though, is it worth continuing, or should I find a better show to binge?",
        "upvotes": 14,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1qcliu6/dead_to_me/"
    },
    {
        "id": "1qbyn8g",
        "author": "rwaggoner",
        "title": "Can't watch Netflix at work on planning period since \"not in household\"",
        "content": "Well, I have never experienced this. I was aware of the household requirement in place for years, but I will watch shows at work for background noise during my planning/conference period at school using an Apple TV, which I use to share my computer screen to the projector. It now mandates I update my household to this location, which I won't do since it's not my home. It doesn't let me watch anything.\n\nThis is nuts. I get their concern with sharing, but there are better ways to verify identity, maybe using facial recognition or something similar. The concept that you can only ever use one IP address is ridiculous.\n\nAre there any workarounds? No option for a temporary code...\n\nI have done this for 5 years and never had a problem. No other apps have this issue.\n\nJust Netflix.\n\nIt's enough to make me consider cancellation.",
        "upvotes": 316,
        "comments": 103,
        "media": null,
        "permalink": "/r/netflix/comments/1qbyn8g/cant_watch_netflix_at_work_on_planning_period/"
    },
    {
        "id": "1qcpwxz",
        "author": "MissMystery11",
        "title": "The third season of Girl From Nowhere might have apparently yet sadly been canceled already. There is an unexpected reboot with a new actress instead.",
        "content": "8 years of our hopes is officially crushed. ",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qcpwxz/the_third_season_of_girl_from_nowhere_might_have/"
    },
    {
        "id": "1qcw57o",
        "author": "yo-caesar",
        "title": "Is netflix down in India?",
        "content": "Unable to sign in on a android. Able to sign in on web, but unable to play any movie or show. Don't know what's wrong. Reinstalled the app too. Still no result.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qcw57o/is_netflix_down_in_india/"
    },
    {
        "id": "1qd62vz",
        "author": "bimiki_",
        "title": "Boots é tão good vibes",
        "content": "Faz tempo que nao me divertia tanto vendo uma série, os personagens super engraçados, fiquei puta que vão cancelar.\nllllllllllllllllllllllllllllllllllllll",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qd62vz/boots_é_tão_good_vibes/"
    },
    {
        "id": "1qcud5l",
        "author": "Cal_PCGW",
        "title": "Looking for recs on short (half hour max) shows.",
        "content": "I'm looking for a short, tea time show - ideally 20-30 minute episodes. I'm UK-based and have Netflix but also iPlayer and Sky so I don't mind recs from those, but I don't have access to other services. Can be drama, comedy or animation.\n\nLoved (and recently finished) The Good Place. Currently finishing What We Do in the Shadows (iPlayer). Previously enjoyed Barry (Sky Comedy).\n\nAnimated shows I've seen: Cyberpunk Edgerunners (enjoyed - watched because I loved the game), Neon Genesis Evangelion (weird), Delicious in Dungeon (loved), the Terminator anime (forget the exact name - it wasn't bad), Cowboy Bebop (loved), Vinland Saga (liked the Viking stuff but the monologues and all the crying drove me up the bloody wall), Monster (didn't finish - liked the concept but lord it was slow), DanDanDan (puerile - quit after one episode), Scavenger's Reign (liked).\n\nFor the record, I am a nerd and a gamer, like sci-fi, fantasy, thrillers and basically anything imaginative. I am also a 58yo woman so I'm probably not going to enjoy anything aimed at kids and young adults.\n\nCheers.",
        "upvotes": 2,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1qcud5l/looking_for_recs_on_short_half_hour_max_shows/"
    },
    {
        "id": "1qckcol",
        "author": "DuxxieDings",
        "title": "i hope netflix has more adult animation shows like arcane, wolf king and blue eye samurai in 2026",
        "content": "any news on 2026 shows or future shows like arcane, wolf king and blue eye samurai. i know theres s2 of blue eye, but i want more shit like wolf king, blue eye and arcane to look forward too. \n\nArcane and Wolf King finished up in 2 seasons. it seems like adult cartoons get 2 seasons at least. Blue Eye is a masterpiece and i cant wait for s2 but i hope its not the last because i like it and its the last good adult animation on netflix thats currently airing.",
        "upvotes": 9,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qckcol/i_hope_netflix_has_more_adult_animation_shows/"
    },
    {
        "id": "1qd001z",
        "author": "Midnightlune_",
        "title": "Suggest some good series :)",
        "content": "Hey guys would you suggest me some series or movie like , \"Anne with an e\" or \"Enola homles,\" i really like those series and I'm looking for similar genre so please suggest some..",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1qd001z/suggest_some_good_series/"
    },
    {
        "id": "1qd2iry",
        "author": "Longjumping_Bowl_403",
        "title": "Movie Review: Open House",
        "content": "1/10.\n\nCan't believe Netflix allowed a borderline director to slap this circus together and have everyone waste 90 minutes.\n\nI knew I shoulda just watched Forrest Gump for the fifth time.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qd2iry/movie_review_open_house/"
    },
    {
        "id": "1qcvg3j",
        "author": "Stamina666",
        "title": "Resident Alien just removed?",
        "content": "I’m in NA and was watching Resident Alien and it cut off in the middle of the episode. Searched for it and now it’s just gone, where there any plans to actually remove it?",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1qcvg3j/resident_alien_just_removed/"
    },
    {
        "id": "1qc6dm7",
        "author": "Few_Pipe_9933",
        "title": "Any recommendations I enjoyed His&amp;Hers looking for similar movie/shows",
        "content": "Anything helps! I like movies/shows with plot twist or elements that make you feel like there’s something your missing. Also like suspense/thriller! Any recommendations?",
        "upvotes": 23,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1qc6dm7/any_recommendations_i_enjoyed_hishers_looking_for/"
    },
    {
        "id": "1qbbq72",
        "author": "Secretly_Wealthy90",
        "title": "11.22.63 IS SOOOO Good!!! highly recommended",
        "content": "how did i not know about this until now, 10 years later after it came out. Hulu did not do a good job at promoting it, Netflix put this at the top. \n\nall other streaming services should just shut down and license their content to Netflix IMO.\n\n\n\n",
        "upvotes": 1505,
        "comments": 394,
        "media": null,
        "permalink": "/r/netflix/comments/1qbbq72/112263_is_soooo_good_highly_recommended/"
    },
    {
        "id": "1qcvhgh",
        "author": "rasberrymateria",
        "title": "Ads on Monday Night Raw replay",
        "content": "Is anybody else getting ads now while watching replays? I just wanted to skip to the part I missed out on and now I'm seeing unskippable ads during it. I have the Premium plan and I wasn't seeing ads before while watching a replay. Is this happening to anybody else? I'm really bummed out by this now if this is permanent ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qcvhgh/ads_on_monday_night_raw_replay/"
    },
    {
        "id": "1qcp5d9",
        "author": "Puzzled-Process7433",
        "title": "Samsung TV -UE55U8072FUXXH",
        "content": "I've been trving to fix this for 3 hours and can't find a solution. Here's the problem: the TV works fine. but when I ao to Netflix or YouTube. some videos work and others don't. What I mean is, the video starts glitching, and only the video is the problem; the YouTube/Netflix interface works.\nHere's what I've tried so far\n• Unplugged the TV for over 3 minutes, then plugged it back in.\n• Held the power off button (to do a TV reset) • Modified connection DNS \n• Tried all the settings/variations from the image tab \n. Removed every single energy efficiency setting \n• Reinstalled the programs/cleared the cache \n• Tried turning off HDR from Netflix.\n• Updated the operating svstem from their website to the latest version using a USB\nNone of this worked. I iust bought it on December 23rd and don't know what to do next. Anyone can help?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qcp5d9/samsung_tv_ue55u8072fuxxh/"
    },
    {
        "id": "1qd44kz",
        "author": "bludhavengabagool",
        "title": "Rebecca Rittenhouse didn't know the twist ending of His &amp; Hers when she auditioned",
        "content": "",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1qd44kz/rebecca_rittenhouse_didnt_know_the_twist_ending/"
    },
    {
        "id": "1qcktlq",
        "author": "chlorinatedseacow",
        "title": "How good are the captions on Netflix usually?",
        "content": "Hello! \nI don't really watch a lot of shows on Netflix but I've been watching Stranger Things 5 and I've noticed the captions are off quite a bit. It's never anything super necessary being dropped, but it's still noticable when a word or a character's name is missing. They are always clearly pronounced too, so I guess I'm confused how that could have happened? \nI'm wondering if this is common among Netflix shows? Should I send a message somewhere? \nThank you! ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qcktlq/how_good_are_the_captions_on_netflix_usually/"
    },
    {
        "id": "1qbfm14",
        "author": "happymagtv",
        "title": "Shane Gillis inks major Netflix deal as ‘Tires’ season 3 enters production",
        "content": "Just saw that Shane Gillis and John McKeever, the creators behind *Tires*, have landed a big overall deal with Netflix. This is happening as they start filming Season 3.\n\nThe deal means they'll be developing new movies, shows, and unscripted stuff for Netflix, plus Gillis gets two more stand-up specials. Pretty huge vote of confidence in their specific brand of chaotic, blue-collar comedy after the show's success.\n\nThe quote from their statement is classic: \"thankfully, it's too late for them to back out.\"",
        "upvotes": 320,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1qbfm14/shane_gillis_inks_major_netflix_deal_as_tires/"
    },
    {
        "id": "1qcd3jj",
        "author": "Competitive_War2235",
        "title": "Weird sound",
        "content": "So I’m watching a show and all of a sudden the sound goes to like this voice mod… kinda like you hear when someone is trying to disguise their voice like on a cop show. Did I accidentally slow it down or hit some option …..? Just rewatched the scene and now it’s Normal like wtf ? Anyone had this happen ",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qcd3jj/weird_sound/"
    },
    {
        "id": "1qbpwam",
        "author": "godguided",
        "title": "Jodie Comer is absolute Badass and obsession",
        "content": "I just started Killing Eve, though it lost its plot and intensity after first season for me, but i am continuing it throughout just to see more of Jodie. Seriously no dull moment of her in the series for a second. I didn’t see her in anything before so this was my first time watching her and man the range she brings on table in one single show is not just incredible but so damn shockingly delightful. I mean no one be it male or female could have done job so amazingly well. I am surprised how i didn’t see her in anything else, is she underrated? How she has done in other shows or movie?",
        "upvotes": 48,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1qbpwam/jodie_comer_is_absolute_badass_and_obsession/"
    },
    {
        "id": "1qchtaf",
        "author": "zeitlosx3m",
        "title": "Netflix has not the same languages in series and films on my fire tv stick than on my pc.",
        "content": "Hi,\n\nSo i am from germany and i use netflix on pc in chrome browser and in my bedroom on an fire tv stick.\n\nSince yesterday my fire tv stick netflix suddenly just has englisch (original) and Portuguese for as  options. And yes i know that my series is available in german its young sheldon and i watched it yesterday in german.\n\nSo wtf is going on. Is netflix thinking my tv is in portugal???",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1qchtaf/netflix_has_not_the_same_languages_in_series_and/"
    },
    {
        "id": "1qch8k5",
        "author": "BluumDK",
        "title": "Subtitles distorts image",
        "content": "So whenever I Watch shows of streaming services on the browser or the windows application. The same frame the subtitles appeared the image gets distorted.\n\nWhen it happens, if I roll back 10 sec, and watch the same scene again, It doesn’t so it.\n\nI have a slowmo video of it, but can’t link it",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qch8k5/subtitles_distorts_image/"
    },
    {
        "id": "1qbyw6j",
        "author": "CM-Edge",
        "title": "No \"HD\" or \"4K\" logos on any content anymore to see what quality the movies or series run in?",
        "content": "When did they remove that? And why? Why does every company these days tries to make their product more inconvenient than before? \n\n[https://b.l3n.co/FsZg6b.png](https://b.l3n.co/FsZg6b.png)\n\n",
        "upvotes": 10,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1qbyw6j/no_hd_or_4k_logos_on_any_content_anymore_to_see/"
    }
]