[
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 24,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1lzz8vz",
        "author": "Pinchus121",
        "title": "I’m Phil Rosenthal, host of Somebody Feed Phil on Netflix and host of the Naked Lunch podcast. I travel the world eating incredible food and talking to even more incredible people. Let’s dish! AMA.",
        "content": "Hi Reddit! I’m Phil Rosenthal, host of Somebody Feed Phil on Netflix, and host of the Naked Lunch podcast with my good friend David Wild. I’ve spent the last several years traveling the globe with a fork in hand, trying to prove that the best way to connect with people is through good food and a lot of laughs. Season 8 of Somebody Feed Phil is now streaming on Netflix and we’re serving up new episodes of Naked Lunch every week wherever you get your podcasts, including chats with legends like Jane Fonda, John Stamos, Allison Janney, and so many more!  \n  \nGot questions about the best food cities, behind-the-scenes stories from the road (or the sitcom world), or where I stand on pineapple on pizza? I’m all yours!  \n  \nLet’s eat and chat.  \n  \nPhil  \nu/Pinchus121\n\nhttps://preview.redd.it/4k4qn42nrwcf1.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=19b27cd4f54858b592249a41b78424ec7203a1e5\n\n\n\n&gt;Thanks everyone for joining in! Be sure to check out Season 8 of Somebody Feed Phil now on Netflix and listen to new episodes of my podcast \"Naked Lunch\" every week!",
        "upvotes": 80,
        "comments": 115,
        "media": null,
        "permalink": "/r/netflix/comments/1lzz8vz/im_phil_rosenthal_host_of_somebody_feed_phil_on/"
    },
    {
        "id": "1m2a2tc",
        "author": "shmu_",
        "title": "Assassin's Creed confirmed for live-action Netflix adaptation",
        "content": "",
        "upvotes": 15,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1m2a2tc/assassins_creed_confirmed_for_liveaction_netflix/"
    },
    {
        "id": "1m1bshr",
        "author": "Longjumping_Land_977",
        "title": "Netflix releases series about baffling case of woman who disappeared on a cruise ship",
        "content": "",
        "upvotes": 1211,
        "comments": 420,
        "media": null,
        "permalink": "/r/netflix/comments/1m1bshr/netflix_releases_series_about_baffling_case_of/"
    },
    {
        "id": "1m2ddql",
        "author": "PM_0891",
        "title": "'Owning Manhattan' Season 2 drops Dec. 5!",
        "content": "Ryan Serhant just announced that Season 2 of 'Owning Manhattan' is coming Dec. 5!  \n  \nHere's an incredible profile I read about him that talks about his rise from broke actor to real estate mogul, how he built his media machine, and the psychology that drives him. It might give you a whole new perspective on who he really is.\n\n[https://www.readtheprofile.com/p/ryan-serhant-owning-manhattan-profile](https://www.readtheprofile.com/p/ryan-serhant-owning-manhattan-profile)",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ddql/owning_manhattan_season_2_drops_dec_5/"
    },
    {
        "id": "1m24oui",
        "author": "No-Comfort6053",
        "title": "Looking for new shows to watch",
        "content": "Ive already seen shameless, breaking bad, better call saul, avatar (and tlok), lucifer, archer, umbrella academy, black mirror, cobra kai, stranger things, Wednesday, jojos bizarre adventure and the resident. \nIm stuck on what to watch next and wanted some recommendations. Anything is welcome.",
        "upvotes": 7,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1m24oui/looking_for_new_shows_to_watch/"
    },
    {
        "id": "1m1wjfo",
        "author": "Dreamdays_0909",
        "title": "Building the Band - strange",
        "content": "I’m almost positive that the conversations the contestants are having with AJ when he tells them the amount of likes they have are completely fake lol. His responses are unnatural and scripted, and none of the cast ever say “hi AJ!”. The conversations don’t flow and the editing is peculiar lol. I think AJ is staring straight into a teleprompter and the screen they appear on is CGI. 🤦🏼‍♀️🤦🏼‍♀️",
        "upvotes": 15,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m1wjfo/building_the_band_strange/"
    },
    {
        "id": "1m288sz",
        "author": "PaperFennKhat",
        "title": "Papercraft Sussy Bird from KPop Demon Hunters",
        "content": "To go with my previous Derpy Tiger!",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m288sz/papercraft_sussy_bird_from_kpop_demon_hunters/"
    },
    {
        "id": "1m2d6fb",
        "author": "Top-Three-USA",
        "title": "Netflix Orders Live-Action ‘Assassin’s Creed’ Series with New Showrunners at the Helm",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m2d6fb/netflix_orders_liveaction_assassins_creed_series/"
    },
    {
        "id": "1m2ar2b",
        "author": "Brilliant_Tell6459",
        "title": "shows to watch",
        "content": "I need new shows to watch. Right now im hooked on The Rookie and I love it, but Im almost done with it and I feel like theres so many out there that I've heard about but never look into. For some reason I like to jump around between different shows It keeps me from getting bored. If anyone has any recommendations or binge worthy shows I would appreciate it and it can be any genre I like all. It can be on Netflix, HBO, Amazon Prime, or Hulu.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ar2b/shows_to_watch/"
    },
    {
        "id": "1m2apms",
        "author": "FlowerRoutine9174",
        "title": "anyone got any shows similar to breaking bad, dexter, prison break, umbrella academy.",
        "content": "I love these shows so i need more because I have none to watch and Im so bored. I’m still very mad that dexter and prison break were removed and I don’t have the motivation to rewatch breaking bad.",
        "upvotes": 1,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1m2apms/anyone_got_any_shows_similar_to_breaking_bad/"
    },
    {
        "id": "1m16z88",
        "author": "PlatinumOg69",
        "title": "Netflix feels so empty now",
        "content": "I dont know what happened but I haven't had Netflix in like 3 months and first thing I notice is it feels like their isint as much to watch anymore. I go through the horror movie category and it seems really short. Did they get rid of everything? basically all that's left is just Netflix originals which I do enjoy but I've watched probably all of their horror movies and their recent originals aren't that great. ",
        "upvotes": 297,
        "comments": 93,
        "media": null,
        "permalink": "/r/netflix/comments/1m16z88/netflix_feels_so_empty_now/"
    },
    {
        "id": "1m29wxb",
        "author": "Atlast_2091",
        "title": "Night Always Comes | Official Trailer | Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m29wxb/night_always_comes_official_trailer_netflix/"
    },
    {
        "id": "1m28m1e",
        "author": "ToonAdventure",
        "title": "Fixed | Director’s Cut | Official Red Band Teaser | Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m28m1e/fixed_directors_cut_official_red_band_teaser/"
    },
    {
        "id": "1m2dda9",
        "author": "Evening-Advance-7832",
        "title": "Your honest opinion on The Sand Man",
        "content": "So I watched both s1 and s2  and I gotto say if the writers wanted to advertise hell as a cool and glamorous  abode then they did just that. The siblings Dream, Desire, Delirium,Destiny,  Destruction , Death all got their own roles . I missed out the other sibling. Desire is really confusing because it's role is so confusing. \nQueen Nada got imprisoned in hell for 10000 years and when Dream rescued her she left because she was so angry at him. Destruction tried to warn dream about the atomic  or nuclear bomb that was gonna be used in wars. Delirium wanted to find out why Destruction left. Orpheus becoming the Oracle to save his wife from the underworld ruled by hades and his wife. I gotta say the writers made certain that lgbtq commu itu was included  here in this series. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m2dda9/your_honest_opinion_on_the_sand_man/"
    },
    {
        "id": "1m1d8fe",
        "author": "dailystar_news",
        "title": "Netflix stand by decision to axe The Residence a show they 'loved and championed'",
        "content": "",
        "upvotes": 77,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1m1d8fe/netflix_stand_by_decision_to_axe_the_residence_a/"
    },
    {
        "id": "1m27crg",
        "author": "RemarkableLab433",
        "title": "Shows",
        "content": "Hi everyone I’m looking for a great show I have bad adhd so finding something interesting is hard I’m big into mystery action and sci-fi.. I saw the blacklist loved and knew Amsterdam..\n\nI like something that is mysterious or a good edge of seat show thank you",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m27crg/shows/"
    },
    {
        "id": "1m1msqe",
        "author": "which_objective",
        "title": "Should Trainwreck be a series with different episodes?",
        "content": "It's all over my home page but seems like it could (or should) just be a series, rather than individual 1-hour movies. Why do you think they made it this way?",
        "upvotes": 21,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1m1msqe/should_trainwreck_be_a_series_with_different/"
    },
    {
        "id": "1m1dezx",
        "author": "Task_Force-191",
        "title": "Stranger Things 5 | Official Teaser | Netflix",
        "content": "",
        "upvotes": 62,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1m1dezx/stranger_things_5_official_teaser_netflix/"
    },
    {
        "id": "1m25eal",
        "author": "annabananas97",
        "title": "Is squid game season 3 worth watching?",
        "content": "I watched the first 2 episodes of season 3 already and I'm really doubting if I want to keep watching. I loved season 1 and was kind of disappointed  by season 2 until the last episode when things were picking up and we were getting somewhere but now at the start of season 3 we're almost back to where we were before the season 2 finale. \nAfter season 1 I thought it was supposed to be a criticism of capitalism and billionaires, but now that whole aspect is so much in the background and most of is just watching people die and being horrible. I get why people might enjoy that, but it's just not my type of show especially if it's mostly the same as season 1 and they just have different games. \nSo I guess I just wanted to ask if season 3 is similar to season 2 in that it mostly keeps focusing on the games itself? Or is it worth watching for people who don't just like it for the violence? ",
        "upvotes": 1,
        "comments": 56,
        "media": null,
        "permalink": "/r/netflix/comments/1m25eal/is_squid_game_season_3_worth_watching/"
    },
    {
        "id": "1m1bh6p",
        "author": "AccurateAd7960",
        "title": "Building the band - E1-E7 - THOUGHTS",
        "content": "So what are we thinking so far? \nMy thoughts below because I wish I knew someone who watched this 😂\n\nI personally am loving this show, so much talent and appreciated that they did all the showcases in one episode, I really thought they’d annoyingly split it. The pace has been good, and I know they need the cheeky cliffhanger. \n\nSZN 4 - \nI absolutely believe that SZN 4 are the clear winners unless they royally screw up. \nI really wish they’d chosen another name though! They all have such star quality, particularly Donzell and Aaliyah - incredibly powerful voices. Cameron’s is so unique and I feel when Katie gains her confidence she shines.  - plus they seem like nice people. \nThey all scream “I would have such a good time chilling at a party with them all” \nAbsolute fan here of what they are bringing to the table; the energy, the difference in voices, the oomph they give. \n\nSweet Seductions - \nI’m on the anti-Allison train and I know she’s being made the villain, but she just seems like such an awfully narcissistic person that I don’t think they could have edited it that much. it goes to show that chemistry on stage and actually having true friendship in the band really shows in the performance, “Sweet seductions” were not conducive - and I don’t see longevity in the band just based on their toxic relationship growing due to Allison being a drill instructor and treating them like props.i wish the other 2 had ended up with the other girls that Allison ditched. Allison will be the demise of them all. \n\nI think Soulidified and 3quency will also go far. \n3quency really surprised me tonight! But wow, they really did work so well together and seemed like such a unit. It was real sweet having the other girls try on the makeup too. \nAgain, seeing people be friendly to each other and supportive of each other is just going to make me like the band more haha but yeah they aced it. \n\nSoulidified is not my cup of tea BUT I can see how they would appeal to others, working hard as well together, seems like they have the business side of it all down pat and there voices do really work with each other. But some are definitely better than others, it doesn’t seem to matter as much though because they are blending so well. They really were great tonight and had fabulous energy with each other. Song choice suited them for sure. Even if they don’t win I think they’ll get signed elsewhere. \n\nMidnight till morning - I’m not going to lie I got my hopes up that they might try something a bit different with country dusky voices but they seem to just be wanting to fit the cookie cutter. I know it’s for the drama, but Connor is annoying me and the immaturity/insecurity shines whenever he makes a snarky comment about another band. Being Australian I was having hopes for them, but maybe the “laid back” Aussie way is preventing them from pushing themselves further 😘 I’d be so frustrated too if you’d made it that far and your 20 something yr old band mate just wanted to get laid. \nAlso very sad moment when Mason spoke to the late Liam Payne about seeing him way back, and about it being full circle. RIP Liam. \n\nAnd finally ! Gosh this is long - \nSiren society - I think they might leave, which is unfortunate as I actually think they did well tonight and really tried to push themselves with so much choreography. They seem really sweet to each other and supportive. I would have preferred them over sweet seduction any day. \nChoosing a song of one of the judges I don’t think did them well either, way too risky at that stage - and as Nicole said - she has her own way of interpreting her own song, to then emulate that - well it doesn’t work. \n\nAnyway everyone, I am SO KEEN to hear your thoughts on everyone! Who are your favorites? Who do you think is being carried? Who’s going out? \n\n",
        "upvotes": 70,
        "comments": 173,
        "media": null,
        "permalink": "/r/netflix/comments/1m1bh6p/building_the_band_e1e7_thoughts/"
    },
    {
        "id": "1m2cxuz",
        "author": "theshlogg",
        "title": "do you guys think if kdh was in america it would go different?",
        "content": "i think if it happened in the United states the demons would get slimed out day 1, and instead of swords and daggers they would have magic dracos and nines with switches, the demons are getting drive by'd before they make lone start pop or your congressman🥀🔥",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m2cxuz/do_you_guys_think_if_kdh_was_in_america_it_would/"
    },
    {
        "id": "1m1uxww",
        "author": "stevenjobsless",
        "title": "if anybody is watching building the band on netflix. WHO does allison sound like? Her speaking voice sounds EXACTLY like someone",
        "content": "i cant tell if its an actress or internet celebrity im leaning towards actress &amp; its bothering me so bad she has the same deadpan voice and tone of somebody and I cant put my finger on it. i cant continue i need to know. helpppppp",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m1uxww/if_anybody_is_watching_building_the_band_on/"
    },
    {
        "id": "1m23v5f",
        "author": "Mysterious_Web_3734",
        "title": "Help me log into Netflix",
        "content": "The entire problem:\n\nI clicked on \"log out of all devices\" option on Netflix.\n\nI forgot my password.\n\nThen I tried to have Netflix send me a password reset mail (I'm using a yahoo mail) but the mail is never arriving.\n\nI don't have a phone number connected to the account.\n\nWhen I tried to use Forgot Mail/Password option, it finds my mail and sends me a link - but I still never got it.\n\nI checked the spam and trash, nothing.\n\nWhat else can I do?\n\n\nIf there's no way to log into the account now, how do I cancel subscription? Will it cancel automatically if there's no money on the card at the time when they're supposed to take it? And will they keep automatically trying to take money forever/until I block them from my bank account?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m23v5f/help_me_log_into_netflix/"
    },
    {
        "id": "1m1xptg",
        "author": "Deirdge",
        "title": "Is Sirens a one-off or positioned for a S2?",
        "content": "Obviously we all need a contemporary Downton Abbey in the Hamptons-type junk-watch, but there was no real ending here. And the ending made little sense unless there’s a season deux. More smokin’ Swayze ahead? ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m1xptg/is_sirens_a_oneoff_or_positioned_for_a_s2/"
    },
    {
        "id": "1m103ae",
        "author": "Infamous-Associate99",
        "title": "Most recent show you couldn’t stop watching",
        "content": "I need something good to watch and I feel like I’ve seen it all. I like psychological thrillers and thrillers in general. If anyone has ever seen wayward pines, I would like to watch something like that",
        "upvotes": 274,
        "comments": 478,
        "media": null,
        "permalink": "/r/netflix/comments/1m103ae/most_recent_show_you_couldnt_stop_watching/"
    },
    {
        "id": "1m1only",
        "author": "maddenmaster838",
        "title": "Trainwreck documentary series",
        "content": "Why did we go from having a single trainwreck mini series 3 years ago to now it becoming a weekly release? I’m definitely not complaining I’ve been loving the trainwreck an each weeks. But why is that? Does anyone know? Does everyone else also enjoy the train wrecks as much as I have?",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1m1only/trainwreck_documentary_series/"
    },
    {
        "id": "1m151io",
        "author": "AKMac86",
        "title": "Trainwreck: Balloon Boy",
        "content": "Just finished the documentary. I remember when that whole saga was on the news. I think the guy was a nut and just wanted a way to make easy money. His wife was willing to go along with whatever he did. I have a lot of questions that were left unanswered by this documentary. Was he actually planning to go in the flying muffin UFO thing? If not, then why build it so large? If so, then how would he have controlled it? To me this seemed like he wanted to build something big enough that it would seem credible for a small person to fit inside when he called the police.  \n\nAnother thought… when the kid said ‘I thought we were doing this for a show,’ I think it spilled the beans that he was always planning to ‘accidentally’ let the balloon go so he could call the FAA. (Who would ever think to call the FAA?! That clearly seemed planned). So I’m wondering if  it’s possible his kid going missing was not the original plan but just became part of it. Either way, I think jail time was suitable. Thoughts?",
        "upvotes": 74,
        "comments": 62,
        "media": null,
        "permalink": "/r/netflix/comments/1m151io/trainwreck_balloon_boy/"
    },
    {
        "id": "1m2a701",
        "author": "Plane-Cloud-5837",
        "title": "Netflix’s KPop Demon Hunters broke their record, and this is how BTS reacted",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m2a701/netflixs_kpop_demon_hunters_broke_their_record/"
    },
    {
        "id": "1m1un0c",
        "author": "Aggressive_Roll5874",
        "title": "To those of you in Italy can you tell me if there’s a show on Netflix I’m looking for?",
        "content": "Ciao I’m hoping someone can please tell me if there’s a new show called RIV4LI on Netflix in Italy. I’ve been trying to see if it has been released in Italy or if it’s still filming but I am getting differing responses when I look it up. \n\nThe reason I want to watch it is because I watched DI4RI and it was great for Italian listening practice but the show was also really good 😊 \n\nGrazie ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m1un0c/to_those_of_you_in_italy_can_you_tell_me_if/"
    },
    {
        "id": "1m19wc6",
        "author": "Commercial-Kitchen78",
        "title": "Cozy shows",
        "content": " I’m waiting for cancer biopsy results and need a show I can distract myself with. Bonus if it will also be enjoyed by my kids 18g and 13b. It needs to be sexual assault free. I grew up without TV and wasn't allowed to watch over Pg 13. So my tastes are pretty cozy and mundane— we did watch milloaire house and loved it! \n\n\n\n",
        "upvotes": 23,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1m19wc6/cozy_shows/"
    },
    {
        "id": "1m1skbc",
        "author": "sirotan88",
        "title": "Chef &amp; My Fridge is such a wholesome cooking show",
        "content": "Don’t see much mentions of this show but if you have seen Culinary Class Wars you’d probably enjoy it!\n\nIt’s a casual, low competition, sometimes silly and hilarious cooking show. It’s all 15 minute cooking battles between 2 chefs; no grand prize or final winner, mostly just friendly low stakes competition.\n\nI’m obsessed with the show and selfishly want more people to watch it so they can renew it and keep it going! ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m1skbc/chef_my_fridge_is_such_a_wholesome_cooking_show/"
    }
]