[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 490,
        "comments": 262,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1iy5f5d",
        "author": "AwkwardUrkel",
        "title": "Disrupt The Market",
        "content": "I cancelled my Netflix today. \n\nI've been around since the DVD in the mail phase. I'm so tired of the incremental increase of subscriptions. At what point will enough of us hit cancel so they understand! ",
        "upvotes": 28,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1iy5f5d/disrupt_the_market/"
    },
    {
        "id": "1iy8ogp",
        "author": "MotherofBook",
        "title": "These Category titles are hilarious. Have y’all seen these?",
        "content": "Idk why this is so funny to me but ***‘Rich People Behaving Badly’*** As A category title, on Netflix, has taken me all the way out. \n\nThat’s very much how I name my categories. 🤣😂🤣🤣🤣",
        "upvotes": 14,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1iy8ogp/these_category_titles_are_hilarious_have_yall/"
    },
    {
        "id": "1ixzcpp",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix hit a record 8.6% of total TV screen time in January with Squid Game racking up an astonishing 9 billion minutes of viewing time",
        "content": "",
        "upvotes": 37,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1ixzcpp/netflix_hit_a_record_86_of_total_tv_screen_time/"
    },
    {
        "id": "1ixykn6",
        "author": "CampMain",
        "title": "Fifth and final series of You coming to Netflix April 24th",
        "content": "",
        "upvotes": 22,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ixykn6/fifth_and_final_series_of_you_coming_to_netflix/"
    },
    {
        "id": "1ix6jar",
        "author": "ellissabain",
        "title": "Brian Laundrie’s sister speaks out after Gabby Petito doc and angrily defends her brother",
        "content": "",
        "upvotes": 1163,
        "comments": 445,
        "media": null,
        "permalink": "/r/netflix/comments/1ix6jar/brian_laundries_sister_speaks_out_after_gabby/"
    },
    {
        "id": "1iy86ou",
        "author": "RJMC5696",
        "title": "Kaos",
        "content": "Just finished rewatching it for the second time. I Think it was a brilliant show with great actors, and had so much potential. Sad that there’ll be no season two. Anybody else wish there would be a second season? ",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iy86ou/kaos/"
    },
    {
        "id": "1iyaux4",
        "author": "br_web",
        "title": "Your device isn’t part of the Netflix Household for this account",
        "content": "I have been living in the same house for 6 years, I have had the same ISP for all the 6 years, I have 3x Apple TVs, 1x iPhone, 1x iPad and 1x MacBook Pro, all devices, but the MacBook Pro work fine with Netflix, only with the MacBook Pro I don't have access to Netflix and get the message below.\n\nWhy is this happening, none of the devices have been outside the house or connected to a different Wifi network or ISP, I would understand this could happen if the ISP changes the WAN IP, but in that case all devices in the house will be impacted (they all share the same WAN IP) not just one device, is there a reasonable explanation for this?\n\nNote: I already signed-out from all devices and rebooted them as requested by Netflix customer support (honestly it is a joke, zero power to do anything), then, the representative submitted a ticked with the \"offline team\", who is like a ghost team, they never called you back and send any communication with the status of the ticket, I had this exact same problem a year ago. \n\nThanks\n\n# Your device isn’t part of the Netflix Household for this account ",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1iyaux4/your_device_isnt_part_of_the_netflix_household/"
    },
    {
        "id": "1iy1guv",
        "author": "MysteriousDelay6266",
        "title": "Million Dollar Secret | Official Trailer | Netflix",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iy1guv/million_dollar_secret_official_trailer_netflix/"
    },
    {
        "id": "1ixt98g",
        "author": "Sweaty-Toe-6211",
        "title": "“I Can’t Tell You Anything”: One Piece Season 3 Is Happening, But the Show’s Cast Is Keeping Quiet",
        "content": "",
        "upvotes": 8,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ixt98g/i_cant_tell_you_anything_one_piece_season_3_is/"
    },
    {
        "id": "1iy6kr9",
        "author": "Potential-Custard209",
        "title": "Xo kitty train wreck",
        "content": "I’m sorry but this show is a train wreck that you can’t turn away from. It’s terrible, the acting is bad, and the storylines are just awful. Maybe it’s because I’m older and these actors are young but this show will never compare to the TATBILB movies. Am I the only one who thinks this show is overrated?? ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1iy6kr9/xo_kitty_train_wreck/"
    },
    {
        "id": "1iy58nf",
        "author": "omertombul",
        "title": "Netflix hw overlay problem",
        "content": "Im using a Xiaomi 10S, and due to software issues, every video looks yellowish and bad. Because of this, I have to use HW overlay. However, when HW overlay is enabled, Netflix shows a black screen. There is audio and subtitles but screen is black. I tried watching through a browser, but browsers either redirect me to the Netflix app or give an error. How can I watch Netflix with HW overlay enabled? Or is there a way to run it through a browser? Please, Im about to lose my mind",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iy58nf/netflix_hw_overlay_problem/"
    },
    {
        "id": "1ix1eod",
        "author": "Somethingman_121224",
        "title": "Dave Bautista Is Pushing Netflix To Finally Make A 'Gears Of War' Movie",
        "content": "",
        "upvotes": 310,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1ix1eod/dave_bautista_is_pushing_netflix_to_finally_make/"
    },
    {
        "id": "1ixso69",
        "author": "Pep_Baldiola",
        "title": "Revelations | Official Teaser | Netflix (from the director of Train to Busan)",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ixso69/revelations_official_teaser_netflix_from_the/"
    },
    {
        "id": "1iy3lk5",
        "author": "sycorech",
        "title": "Would screencasting netflix to smart tv make it a household?",
        "content": "As you know if you open your netflix account on your smart tv all devices in that account must have to connect that wifi sometimes to keep using netflix. But me and my friend are spliting our netflix so would that be a problem if i screencast from mu phone to netflix tv app?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iy3lk5/would_screencasting_netflix_to_smart_tv_make_it_a/"
    },
    {
        "id": "1ixsz31",
        "author": "Evereign8",
        "title": "\"Device not part of my household\"... yet all devices are.",
        "content": "So I have two tv's, a PS5, and my phone with netflix. All on the same network. The tv's are on wifi and the PS5 is on ethernet. We normally have one or two going at the same time. I have three profiles but all on one account. Our problem is that occasionally one device will say it isn't a part of my household and then I'd be prompted to update my household list (again). So.. I'll check the network, still connected to the one and only router in the house, and do the update anyway. Then, a few days later, another device (on the household list) will pop the same issue. This has been going on for a while and I've been constantly having to update the list on each device when it happens. I'd really appreciate some help with this as it's getting to be such a hassle. Maybe I'm missing something about screens on netflix or something? I have no idea. But if anyone knows about or has gone through similar, any info on this would be awesome. Thanks!",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ixsz31/device_not_part_of_my_household_yet_all_devices/"
    },
    {
        "id": "1iy2ciz",
        "author": "Yummy_Oishi",
        "title": "Linked lists?",
        "content": "I'm just a little confused.\nI resubscribe to Netflix again and I shared my account with my friend. We have our own profiles. When i got my account back I still had all of my shows on My List from before on my profile and she had none on her profile until she added 2 shows.\n\nAll of a sudden I go in today and all of my shows are gone apart from the two on my friend's profile. So I add it all back and all of a sudden she messages me like \"where'd all of these shows come from?\"\n\nAnd yes we were both on separate profiles. It's not a big deal I'm just wondering if that'd a thing? To have linked My Lists?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iy2ciz/linked_lists/"
    },
    {
        "id": "1iy16gb",
        "author": "Bambusbjornen",
        "title": "Using my own account in another home",
        "content": "I am regularly at my mom's place and watch Netflix alone on her TV while she does chores and such. Can I log in to my own account to continue where I left? It would be very inconvenient to have to log in and out of accounts each time just to watch for an hour.\n\nI can't cast from my phone either. I live in Europe, if it makes a difference.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1iy16gb/using_my_own_account_in_another_home/"
    },
    {
        "id": "1iy0ghn",
        "author": "kebabmc",
        "title": "Shows and continue watching bugged",
        "content": "When I opened my Netflix today on my iPad, nearly all of my continue watching was missing, and a bunch of shows just cannot be found. Example:  I had tried to start gurren Lagan, but when I searched on my iPad I couldn’t find it, but on my tv I could find it. Does anyone have an idea of what’s happening \n\nEdit: I’ve looked abit and I’m only getting Netflix originals, don’t know of this helps but any help on solving would be great. I’ve tried updating and uninstalling it ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iy0ghn/shows_and_continue_watching_bugged/"
    },
    {
        "id": "1ixzyeg",
        "author": "Ishaat-Ashfaq-Ayon",
        "title": "Netflix subtitles (CC) not in sync",
        "content": "I was watching House and noticed the English subtitle (CC) is not in sync in many episodes. My internet connection is fine. I've tried:\n- Turning the subtiles on and off\n- Restarting Netflix app\n- Restarting device (Phone)\n\nIs there any way to fix this? Is the problem with my device or with the show?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ixzyeg/netflix_subtitles_cc_not_in_sync/"
    },
    {
        "id": "1ixjtz3",
        "author": "Worldly-Committee-71",
        "title": "Maria isn’t Maria",
        "content": "I love Angelina to bits, but what horrible movie… I couldn’t finish it. Terrible pacing, no emotion, no range. I don’t believe Callas was that. \nThere were some good scenes when she sang, but all the rest is … really really bad and nothing saves it.\n\nWho thought it’s Oscar-worthy? ",
        "upvotes": 14,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1ixjtz3/maria_isnt_maria/"
    },
    {
        "id": "1ixy4ib",
        "author": "antox_99",
        "title": "Theory about Cassandra: A genuine mistake or a hidden part of the story?",
        "content": "I might or might not be the only person who had the Guten Morgen, Sonnenschein song by Nana Mouskouri stuck for days in my head. I surely went over to Youtube to play it over and over again until I learnt the lyrics. But then I noticed something intriguing. The song Cassandra used to sing every morning to wake up the Prill family was released in 1977, and Cassandra allegedly was disconnected by a power overrose the day she saw her family die in 1972. Not sure if it was a mistake from the crew or was intentionally chosen...which makes the whole plot a bit more dark to me, thinking about what happened during those years from which she could have learned the song.\n\nI mean if we think about the fact that she was able to turn on and off by herself, I assume Flynn moving the switch on episode 1 had little to no influence in her awakening, also I'm still skeptic about his mechanical abilities fixing the humanoid robot, he was a remarkable student but his hobbies were more artistic. Also we know so little about Margarethe and her time in \"captivity\", and we know nothing about what happened with Birgit and the baby. On top the way Cassandra immediately assumed the personality of an \"AI\" smart house when she was awaken rather than explaining her situation, and her immediate transformation into the antagonist that wanted to get rid of Samira to take over her family was to me always lacking a little bit on the character developing area.\n\nThe impact of betrayal, loss, and trauma can be profound and may lead to extreme emotions and behaviors. However, the transformation into someone with a desire to harm others usually involves a more extended period of psychological change. The transformation from experiencing trauma to becoming a villain is a complex process and rarely happens overnight, so that was the only part that didn't quite fit to me in Cassandra's redemption arch of the series. But if this is a hint of some background story happening in between the 1972 and the present days, this could eventually provide an explanation to this and all plot holes and doubts we were left with. What do you think? Is this just a mistake or a hint to a season 2?\n\nTL,DR: The good morning song Cassandra sings was released in 1977 and she disconnected in 1972. Is this a hint to a possible season 2 that fills up plot holes or just a mistake from the crew?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ixy4ib/theory_about_cassandra_a_genuine_mistake_or_a/"
    },
    {
        "id": "1ixvy3i",
        "author": "Somethingman_121224",
        "title": "'Peaky Blinders' Actress Confirms She Won't Be Back in 'The Immortal Man'",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ixvy3i/peaky_blinders_actress_confirms_she_wont_be_back/"
    },
    {
        "id": "1ixc6fq",
        "author": "RamboToots",
        "title": "Watching ‘Don’t Look Up’ Again",
        "content": "I recommend watching Don’t Look Up with Leave the World Behind.  Two movies worth a watch right now with all that’s going on.  Some comedic effect which I always appreciate.  ",
        "upvotes": 24,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ixc6fq/watching_dont_look_up_again/"
    },
    {
        "id": "1ixv65l",
        "author": "ItsAlwaysBlue212",
        "title": "I have trouble transfering extra member account back to main one.",
        "content": "In manage profile on the extra account the option to transfer profile os missing, where as it there on my main account. Is it even possible to transfer extra member account?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ixv65l/i_have_trouble_transfering_extra_member_account/"
    },
    {
        "id": "1iy73lw",
        "author": "SnooPies507",
        "title": "Netflix quality is just crap nowadays... with PREMIUM PLAN",
        "content": "https://preview.redd.it/hh2nhjk9vcle1.png?width=2287&amp;format=png&amp;auto=webp&amp;s=48858a18d2fc63148571e3862934ad324df470ce\n\nhttps://preview.redd.it/3ve30l1kvcle1.png?width=867&amp;format=png&amp;auto=webp&amp;s=b69c1caac7382c93b212376dd3648326302334d6\n\nJust look at how HORRID that aliasing is....\n\nNeither of the images are zoomed in.\n\nI am watching on a 3440x1440 screen, and I'm getting 720p quality.... while paying for a freaking PREMIUM PLAN....\n\nhttps://preview.redd.it/q20vhym0wcle1.png?width=900&amp;format=png&amp;auto=webp&amp;s=d5108a0bad5346996906df8e82803e2770f5ccd5\n\nI am absolutely FUMING with rage....\n\nIt's not just 1 or 2 shows... it's on every...single...freaking...show...\n\nI tried Edge, I tried Chrome, I tried the getting the Netflix 1080p extension also (for both browsers), I even tried their \"app\" from the microsoft store (which nowadays is just an Edge window in disguise).... in all scenarios, they all have the same shitty picture quality.\n\nIf I just do a \"watch &lt;name of show&gt; online free\" search on google, most of those websites actually have BETTER picture quality than what you get on Netflix... at which point it begs the question... why the hell am I even paying for a Netflix subscription then???",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1iy73lw/netflix_quality_is_just_crap_nowadays_with/"
    },
    {
        "id": "1ixa6r8",
        "author": "RebelGrin",
        "title": "Belle Gibson docu - why wasn't she criminally charged?",
        "content": "Belle Gibson’s actions—falsely claiming to have cured her cancer through natural remedies and profiting from those lies—were certainly unethical and deceptive. However, she was never criminally charged in Australia. Instead, she faced civil penalties under consumer law. \n\nAnd why didn't Apple and Penguin sue her? \n\nHere’s why criminal charges were not pursued in Australia:\n\n1. Civil vs. Criminal Law – Gibson’s conduct was primarily treated as a violation of consumer law rather than criminal fraud. The Australian Competition and Consumer Commission (ACCC) pursued her under the Australian Consumer Law (ACL) for misleading and deceptive conduct.\n2. Burden of Proof in Criminal Cases – For criminal fraud charges, prosecutors would need to prove beyond a reasonable doubt that she knowingly and intentionally deceived people for financial gain. While morally clear, legally, this can be more complex.\n3. Consumer Law Penalties – In 2017, the Federal Court found Gibson guilty of misleading consumers and fined her $410,000 for false health claims and failing to donate promised proceeds to charity. This was seen as a sufficient legal response.\n4. No Individual Criminal Complaints – Fraud charges often require direct victims to make formal complaints. While many people felt deceived, there wasn’t a widespread push for criminal prosecution.\n5. Lack of Specific Criminal Charges – Australian law does have fraud provisions, but proving criminal intent and harm at a level warranting prosecution may have been difficult.\n\nSo while her actions seemed fraudulent in a moral sense, legally, authorities chose a civil route rather than criminal charges. \n\nWould you have preferred a criminal case? \n\nI would ! ",
        "upvotes": 21,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1ixa6r8/belle_gibson_docu_why_wasnt_she_criminally_charged/"
    },
    {
        "id": "1ixw2uk",
        "author": "deadironman",
        "title": "Were both my mom's email and netflix hacked?",
        "content": "Hi all I hope someone has an answer to this.\n\nI live in Morocco and my mom has a netflix account that we share (I have her email too in case I need to confirm household and I cant get a hold of her since we live in different cities).\n\nAnyway for the past couple of weeks we both needed to reconfirm the household every time we wanted to watch something (which usually happened rarely) and when I checked her emails I noticed there was an account that logs into her account either from New York or California. \n\nNothing else seems to be messed on her gmail with so does this mean it was hacked only for the netflix account? and except from changing her password on both platforms is there anything else she can do to avoid this happening? \n\nThanks in advance to anyone who tries to help! ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ixw2uk/were_both_my_moms_email_and_netflix_hacked/"
    },
    {
        "id": "1ixmj3m",
        "author": "DeviantBoi",
        "title": "I accidentally clicked on getting weekly reminders for WWE Raw. Can't find how to make them stop.",
        "content": "I misclicked on my phone and now I'm getting weekly reminders about it.\n\nIt was on My List but the option to remove wasn't there. I had to click on the \"+\" to add it to my list and then I could remove it. But that hasn't stopped the notifications.\n\nEDIT: Just checked my list and it's back on it even though I had removed it. I guess it adds itself with each reminder. This is annoying as hell.\n\nAny ideas?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ixmj3m/i_accidentally_clicked_on_getting_weekly/"
    },
    {
        "id": "1ixaox7",
        "author": "TheMirrorUS",
        "title": "Karla Sofia Gascon plans to attend Oscars after Twitter scandal as Netflix funds outing",
        "content": "",
        "upvotes": 14,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1ixaox7/karla_sofia_gascon_plans_to_attend_oscars_after/"
    },
    {
        "id": "1ixc9f5",
        "author": "Stephxnle",
        "title": "Netflix Error Code CM: 42709",
        "content": "I have gotten a new phone and I had it replaced and now Netflix is popping up this error only on this device. \n\nMy TVs work fine and customer service was unable to resolve this issue so unfortunately I’m stuck. ",
        "upvotes": 5,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1ixc9f5/netflix_error_code_cm_42709/"
    }
]