[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 508,
        "comments": 276,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 20,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jzjpi6",
        "author": "gobsmacked247",
        "title": "I just finished North of North and I am jonesing for more!!!",
        "content": "I can’t believe how much I enjoyed this series!  The trailer got me hooked and I was not disappointed.  Every ep was awkward, and fun, and beautiful, and warm, and I could not get enough of the people and the town (village?)\n\nSeriously Netflix, don’t muck this one up!",
        "upvotes": 17,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jzjpi6/i_just_finished_north_of_north_and_i_am_jonesing/"
    },
    {
        "id": "1jyxr1y",
        "author": "Separate_Aide3850",
        "title": "Piper Rockelle’s mom Tiffany Smith slams Netflix Documentary",
        "content": "",
        "upvotes": 319,
        "comments": 94,
        "media": null,
        "permalink": "/r/netflix/comments/1jyxr1y/piper_rockelles_mom_tiffany_smith_slams_netflix/"
    },
    {
        "id": "1jys3tp",
        "author": "YogurtclosetProud545",
        "title": "Bad influence- Netflix",
        "content": "Just watched Bad Influence on Netflix and I’m sorry, but why is the documentary only pointing fingers at Piper and her mom, Tiffany? Don’t get me wrong—Tiffany was absolutely manipulative and toxic. But let’s be real… every single parent on that show knew exactly what was going on. They knew their kids were filming with her. They saw the content. They heard the complaints. But the views and money were looking too good, so they played along. Now suddenly everyone’s shocked and acting like they were completely blindsided? I get that the kids were young and didn’t deserve the trauma, but let’s not pretend the parents weren’t part of the problem too. They weren’t just bystanders—they were participants.\n",
        "upvotes": 473,
        "comments": 74,
        "media": null,
        "permalink": "/r/netflix/comments/1jys3tp/bad_influence_netflix/"
    },
    {
        "id": "1jz92d0",
        "author": "Fullwake",
        "title": "Is there anyway to make Netflix stop recommending me Cozy Grove? I have no interest in your games Netflix!",
        "content": "I don't go to Netflix for games, I am never going to play this game, and yet somehow it is the banner recommendation every single time I open Netflix, regardless of what has recently come out - even when its something that I might actually want to watch. I have disliked the game (thought I've never played it) and I've never liked a single game, yet somehow that dumb game is the permanent banner on Netflix for me. It's getting to be quite annoying. At this point it could be the best game in the world and I would still refuse to ever play it out of sheer spite. ",
        "upvotes": 26,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1jz92d0/is_there_anyway_to_make_netflix_stop_recommending/"
    },
    {
        "id": "1jzmngx",
        "author": "KKglobtrotter",
        "title": "I love North of North!!! Best heartfelt comedy I've watched in a long time!",
        "content": "I was intrigued by the trailer and I'm fan of Jay Ryan too, so I gave it a shot and I'm so glad I did. The pilot is funny but a little awkward as it introduces you to the characters and the setting really quickly but then episode per episode you fall in love with it. With the characters, the landscape, the amazing fashion sense of Inuit women, the stories that are unfolding, even the music ...omg I was shazaming everything! Acting is top notch. So natural, something you don't see very often in comedies . I couldn't recommend it more!!!! Eagerly waiting for more seasons!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jzmngx/i_love_north_of_north_best_heartfelt_comedy_ive/"
    },
    {
        "id": "1jzgptr",
        "author": "Quigsquib",
        "title": "Why do they put the main character and the love interest that they end up with in the thubnail!!",
        "content": "Why do they put the main character and the love interest that they end up with in the thubnail!!\n\nI've seen this in at least 3 shows so far! I don't want the entire love arc of the 16 season show spoiled in the first 5 episodes! 😭",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jzgptr/why_do_they_put_the_main_character_and_the_love/"
    },
    {
        "id": "1jzd6xs",
        "author": "JaniGriot",
        "title": "The gardener!",
        "content": "I am a lover of pretty much all Netflix series because Netflix is an avid supporter of audio description!\nHowever…\n\nI’m starting to be irritated because many of the best shows, are missing the English A.D. option!\n\nIs anybody else having this problem?\n\nAs a blind man, there aren’t very many places for me to go other than the prime Networks for streaming services to get audio described content. Before I went blind, I used to watch a huge amount of anime, but none of those services offer audio description so I no longer get to watch any of that content!\n\nNow, my mother has shared yet another show with me on Netflix called the gardener and though I would love to watch it, Netflix has not released this option for me!\n\nAgain! Lol Am I the only one having this problem, or are there other ways that people have gotten around this issue?",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jzd6xs/the_gardener/"
    },
    {
        "id": "1jzhkuz",
        "author": "IveyTheHockeyWitch",
        "title": "Just watched \"For Love\" and highly recommend it",
        "content": "I just watched the documentary \"For Love.\" It was a very powerful documentary, and perhaps because I have direct connections to its subject, it felt particularly impactful and well worth the watch. It is a gut punch to hear all the stories that are shared. It is not a light or even fun watch, and I personally had to pause and take a break after one specific group's story. It's an important conversation and can't be recommended enough. ",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jzhkuz/just_watched_for_love_and_highly_recommend_it/"
    },
    {
        "id": "1jzfhzi",
        "author": "BusyLeg8600",
        "title": "Bad Influence - This Doesn't happen to everyone?",
        "content": "I'm nearly finished watching bad influence. One of the girls talks about being pinned down while Tiffany dangles spit above her, the intention of sucking it back up at the last minute. This story is relayed like it's a really fucked up thing to do.\n\nI remember my mom doing this to me as a kid, and failing to suck the spit up (accidentally) in getting it on my face or in my mouth as well. I didn't like it, and tried to get out of it, but I was a kid and a lot weaker. While I didn't like it happened, I didn't think that much of it, I just figured my mom was a jerk. \n\nIs this actually a really bad thing to have happened? I'm having a hard time gauging where this falls on the scale of appropriate to inappropriate. I no longer talk to my mom for various other reasons, so it's not like she was a great person.",
        "upvotes": 3,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1jzfhzi/bad_influence_this_doesnt_happen_to_everyone/"
    },
    {
        "id": "1jz3n9o",
        "author": "SonOfAlfeus",
        "title": "Thronglets, the videogame based on an episode of Black Mirror by Netflix.",
        "content": "I took some screenshots of the game and you can see how much time and effort went into making this game, the artwork is absolutely beautiful and the storyline was quite remarkable.",
        "upvotes": 15,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jz3n9o/thronglets_the_videogame_based_on_an_episode_of/"
    },
    {
        "id": "1jzm5vs",
        "author": "Fit_Argument3087",
        "title": "Do you prefer a standard English dub or an English dubbing that reflects original language?",
        "content": "If you are watching a non-English show/movie that is dubbed into English, do you prefer the dub to reflect the original language (for example, voice actors speaking English with a German accent for the setting of Dark, or with a Spanish accent for La casa de Papel) or a more standard English dub with no inflections? If you're up for it, let me know the country you're from and what you are used to, I'm curious to see how much our background influences what kind of dubbing feels more natural to us. I'm from Italy and I'm more used to a standard Italian dubbing, but I would like to know more about English dubbing",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jzm5vs/do_you_prefer_a_standard_english_dub_or_an/"
    },
    {
        "id": "1jzbwbn",
        "author": "OddChard3399",
        "title": "The residence - unanswered questions! *SPOILERS*",
        "content": "Hi all, I've just finished The Residence and wondered if you could help me with some unanswered questions:\n\n- What happened outside? Why did so many people run out? What crashed?\n- Why did AB say 'I am going to be dead by the end of the night?' When Lily had asked to reconcile?\n- What was Harry talking to the Australian industrialist about?",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jzbwbn/the_residence_unanswered_questions_spoilers/"
    },
    {
        "id": "1jzl2oh",
        "author": "tequila56_",
        "title": "Netflix Movies",
        "content": "Why does it seem that the majority of the  movies t.v. shows on Netflix,  are foreign,  voice over and has  bad acting ?  It seems there is no options. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jzl2oh/netflix_movies/"
    },
    {
        "id": "1jzl2od",
        "author": "snow-bird-",
        "title": "Young Sheldon season 7",
        "content": "Netflix has been promoting Tuesday, April 15th as the date Season 7 will be added for the longest time. Well, tday is Tuesday April 15th. It's not added. Does Netflix update in a certain time zone? We were really looking forward to watching it. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jzl2od/young_sheldon_season_7/"
    },
    {
        "id": "1jz1kbb",
        "author": "LongGrade881",
        "title": "What did you think of the Elves in the movie \"Bright\"?",
        "content": "",
        "upvotes": 12,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1jz1kbb/what_did_you_think_of_the_elves_in_the_movie/"
    },
    {
        "id": "1jz4d3z",
        "author": "BunyipPouch",
        "title": "Gareth Evans, the director of 'The Raid', 'The Raid 2', Netflix's 'Apostle' and Netflix's upcoming 'Havoc' (starring Tom Hardy), is doing an AMA/Q&amp;A in /r/movies. It's live now, with answers tomorrow at 12 PM ET, for anyone interested in asking a question.",
        "content": " Gareth Evans, the director of 'The Raid', 'The Raid 2', Netflix's 'Apostle' and Netflix's upcoming 'Havoc' (starring Tom Hardy), is doing an AMA/Q&amp;A in /r/movies. It's live now, with answers tomorrow at 12 PM ET, for anyone interested in asking a question. \n\nIf you're interested in asking a question, it's live here now:\n\nhttps://www.reddit.com/r/movies/comments/1jz2rfp/hi_im_gareth_evans_writerdirector_of_new_netflix/\n\nHe'll be back at 12 PM ET tomorrow to answer questions. Any question/comment is much appreciated :)\n\nHis verification photo:\n\nhttps://i.imgur.com/WlT919w.png",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jz4d3z/gareth_evans_the_director_of_the_raid_the_raid_2/"
    },
    {
        "id": "1jz5fv6",
        "author": "MFmitzi",
        "title": "Thats' My Boy Showcase bugged",
        "content": "So I'm from UK and was scrolling on Netflix and went across That's My Boy and you know how when you go across it and stay on the thumbnail it plays a short clip of the movie/show but for some weird reason it's showing a highlight of the interview (James Franco) ",
        "upvotes": 4,
        "comments": 2,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/o0uh5f18buue1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1jz5fv6/thats_my_boy_showcase_bugged/"
    },
    {
        "id": "1jyfpgx",
        "author": "summeriswaytooshort",
        "title": "Bad Influence - $300K to 500K+ a month for years ???? where is all the money ????",
        "content": "Someone please explain if Piper is making $300K -500K a month per year, for years ( $6M a year) where is all the money? Yes I know living in LA is expensive but the house they were in wasn't at that level of income. In the beginning it sounds like they were renting in LA then at the end when they were filming the BF  on a super busy street - I guess it would make sense if it was an ocean front house.",
        "upvotes": 119,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1jyfpgx/bad_influence_300k_to_500k_a_month_for_years/"
    },
    {
        "id": "1jz9qob",
        "author": "needchr",
        "title": "Poor compression on video and audio. 1080p tier.",
        "content": "Noticed the bitrate seems over aggressive these days, if is things like lots of sand in a scene, then its block city, also watching some episodes of vikings and I am hearing some serious excessive sound compression.\n\nDo these issues improve on the 4k tier?\n\nPlayback settings is set to high.\n\nNoticed the 5.1 or stereo choice is gone, I did used to find forcing stereo sounded better.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jz9qob/poor_compression_on_video_and_audio_1080p_tier/"
    },
    {
        "id": "1jz993j",
        "author": "AbleFox9",
        "title": "Subtitle Translation Quality",
        "content": "I hear many people complaining about the quality of Netflix subtitles. Do you have any particular examples of where a poor translation ruined your watching experience? I am specifically referring to subtitles of foreign TV shows and movies; not English with English subtitles or your native tongue with its respective subtitles, etc. For example, because something that was said did not make sense after being translated, a cultural reference, wordplay, humour, idioms, ...",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jz993j/subtitle_translation_quality/"
    },
    {
        "id": "1jz96u2",
        "author": "Watterzold",
        "title": "Full screen quality keep getting lower in full screen",
        "content": "Buffering of the video is fine and it loads, dont have any problem with connection.  \nBut when i start watching something in full screen, the quality keep getting lower and lower, and to keep the max quality i need to watch it not in full screen.\n\nCleared cache, changed browser but nothing seems to work.\n\nHow can i fix it?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jz96u2/full_screen_quality_keep_getting_lower_in_full/"
    },
    {
        "id": "1jz8ohj",
        "author": "BikesForEveryBody",
        "title": "Update my credit card errors",
        "content": "I can't update my credit card. Clicking update button gives this error \"Sorry, we are unable to process your request. Please try again later.\" Support leads you back to the payment method payments screen with the button that gives you the same error. Can't update, can't delete, can't add.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jz8ohj/update_my_credit_card_errors/"
    },
    {
        "id": "1jytyrl",
        "author": "AggravatingAward3579",
        "title": "Some viewers think Million Dollar Secret’s winner was rigged. Thoughts?",
        "content": "People have been questioning the authenticity of Cara’s win. Some say her agendas were too easy compared to Phil’s scream agenda and Sam’s Justin Timberlake song agenda. Others theorize she had an ear piece in with someone feeding her information. I’ve seen people discrediting her by claiming there’s no way she could have known Sydnee had immunity AND that the sisters clue was about her. General distrust of her intuition and if she really is as intelligent as the show portrays her. What do you guys think? ",
        "upvotes": 7,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jytyrl/some_viewers_think_million_dollar_secrets_winner/"
    },
    {
        "id": "1jz6iqo",
        "author": "Low_Orange_6180",
        "title": "Help find a song from “Ragnarok”",
        "content": "I NEED to find the song from episode 2, season 1, of ragnarok. It’s played at 14:11-14:56. It’s the coolest thing ever! But I can’t find the name of it. Somebody who’s good at finding stuff like this, please please help!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jz6iqo/help_find_a_song_from_ragnarok/"
    },
    {
        "id": "1jz01ki",
        "author": "S4v1r1enCh0r4k",
        "title": "The Electric State, &amp; Adolescence made it to the overall Top 10 for the week of March 10-16,",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jz01ki/the_electric_state_adolescence_made_it_to_the/"
    },
    {
        "id": "1jz4t1l",
        "author": "spesas717",
        "title": "Cassandra transformation",
        "content": "Just finished the Cassandra thriller series and in those six episodes i think its not explained how she actually became a robot, or is it? did i miss a scene in the show where its actually shown or said?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jz4t1l/cassandra_transformation/"
    },
    {
        "id": "1jyyru8",
        "author": "Somethingman_121224",
        "title": "Netflix Fans Are Crazy About Korean Content, 'Squid Game' Dominates",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jyyru8/netflix_fans_are_crazy_about_korean_content_squid/"
    },
    {
        "id": "1jyllwx",
        "author": "Witty_Peace_9617",
        "title": "\"Bad influence, the dark side of kid-influencing\"",
        "content": "Hi all!! I recently watched \"bad influence the dark side of kid influencing\" and it absolutely blew my mind that someone from my childhood and then I watched every single day was getting treated like this. but the main thing I really wanted to ask is does anybody know anything that wasn't mentioned in the documentary because I tried to find things, but I think Tiffany has cleared out almost any evidence or proof of any other situation. i'm really just curious about this situation and want more insight into all of the things she did. if you know anything at all that wasnt mentioned in the documentary please comment!",
        "upvotes": 16,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1jyllwx/bad_influence_the_dark_side_of_kidinfluencing/"
    },
    {
        "id": "1jyzzr6",
        "author": "Available_Can7525",
        "title": "Madison reveals where her and Tyler stand nine months after Love on the Spectrum",
        "content": "[Madison](https://realitytvshrine.com/2025/04/09/madison-and-tyler-finally-give-a-lengthy-relationship-update-after-love-on-the-spectrum/) has given us another update after kissing Tyler in front of her parents on [Love on the Spectrum](https://realitytvshrine.com/2025/04/14/deunked-has-someone-from-the-cast-of-love-on-the-spectrum-season-three-unexpectedly-died/)! Now that it’s been almost ten months since filming ended, she finally revealed where she stands with Tyler and whether that sweet gift he gave her really did pay off. Turns out she’s super happy and still thriving, just like on season three.\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jyzzr6/madison_reveals_where_her_and_tyler_stand_nine/"
    },
    {
        "id": "1jyyj95",
        "author": "Internal-Bed-3150",
        "title": "Finn Wolfhard teases \"melancholy\" Stranger Things series finale",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jyyj95/finn_wolfhard_teases_melancholy_stranger_things/"
    }
]