[
    {
        "id": "1ipc970",
        "author": "RoundingAMA",
        "title": "Hey /r/movies! I'm Alex Thompson, director/producer of movies like SAINT FRANCES, GHOSTLIGHT and the writer/director of medical thriller ROUNDING, in theaters now! Ask me anything! I’ll be back at 4:00 PM ET today (Friday 2/14) to answer any questions.",
        "content": "",
        "upvotes": 23,
        "comments": 72,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mslaqxxcb4je1.png?auto=webp&amp;s=8c5877116ab31c5f9b882779d3ba378b5db9873e"
        },
        "permalink": "/r/movies/comments/1ipc970/hey_rmovies_im_alex_thompson_directorproducer_of/"
    },
    {
        "id": "1ip1fd2",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Captain America: Brave New World / Paddington in Peru / I'm Still Here)",
        "content": "[Captain America: Brave New World](https://old.reddit.com/r/movies/comments/1ip0ump/official_discussion_captain_america_brave_new/?)\n\n[Paddington in Peru](https://old.reddit.com/r/movies/comments/1ip0uph/official_discussion_paddington_in_peru_spoilers/?)\n\n[I'm Still Here](https://old.reddit.com/r/movies/comments/1ip0usd/official_discussion_im_still_here_spoilers/?)",
        "upvotes": 19,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1ip1fd2/official_discussion_megathread_captain_america/"
    },
    {
        "id": "1ipkc7t",
        "author": "MarvelsGrantMan136",
        "title": "Mia Goth Joins Christopher Nolan’s ‘The Odyssey’",
        "content": "",
        "upvotes": 5126,
        "comments": 479,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Eh3IiMYR-G__rBeoqSl4yVS6ECIa18owyR3sfFPX96o.jpg?auto=webp&amp;s=55ba24d58a613e80b97d289e73f5bdd1ff8298b1"
        },
        "permalink": "/r/movies/comments/1ipkc7t/mia_goth_joins_christopher_nolans_the_odyssey/"
    },
    {
        "id": "1iphilv",
        "author": "pourqwhy",
        "title": "What's the worst case of movie media illiteracy you've ever witnessed?",
        "content": "Inspired by the post about the interstellar subtitle \"spoiler\" and the media literacy crisis we're so obviously in. I want to hear your crazy 'How could they have possibly misunderstood this' stories!\n\nFor me it was that post a few years ago where someone badly reviewed Crazy Rich Asians because \"nothing happens\" and the main character doesn't go through any growth and isn't involved in any conflict. It made zero sense until you realize OP watched the whole thing thinking Nick, the LOVE INTEREST, was somehow the main character instead of Rachel.\n\nWhat are some examples you've witnessed?",
        "upvotes": 1910,
        "comments": 1847,
        "media": null,
        "permalink": "/r/movies/comments/1iphilv/whats_the_worst_case_of_movie_media_illiteracy/"
    },
    {
        "id": "1ipbcs0",
        "author": "take7pieces",
        "title": "Husband urged the family to watch his old favorite movie Mr.Holland’s Opus, only to find out it’s not as good as he remembers",
        "content": "He was very excited when he saw Hulu has it, so he urged everybody to watch it together, we made popcorn, a serious watch party for this family.\n\n\nIt was nice at first, great acting, same old same old “I don’t want to do the job but I have to, now let me help these kids”, it had great touching moments.\n\n\nSpoiler alter. Alert.\n\n\nHis son is deaf, then he started to feel frustrated, since they couldn’t bond. Then he basically kinda not bond with his kid for almost 15 years???? His sign language wasn’t even good when his kid was in high school. Eventually they had a big fight, he realized he’s been an absent dad, he sang to his son (with sign language) and everything is good again! \n\n\nI know it’s a movie, I guess it’s because I have kids now, the whole “father and son quickly bond again” storyline just seems so fake to me. \n\n\nThen there’s the most disturbing part. A student had a huge crush on him, he also seems to have feelings for her too???? The part they almost kiss just made me feel gross. \n\n\n\nEdit: apparently I am wrong about the symphony part so I am gonna delete it.\n\n\nHusband said, I didn’t know it’s so weird when I first saw it, I only remember it was pretty touching. \n\n\nFamily still had a great time. Funny how sometimes our old favorite films are not as good as we remember.",
        "upvotes": 4441,
        "comments": 1315,
        "media": null,
        "permalink": "/r/movies/comments/1ipbcs0/husband_urged_the_family_to_watch_his_old/"
    },
    {
        "id": "1ipcs7u",
        "author": "MarvelsGrantMan136",
        "title": "Robert Eggers' ‘Nosferatu’ Sets Peacock Streaming Date (February 21) With Never-Before-Seen Extended Cut Also Available",
        "content": "",
        "upvotes": 1704,
        "comments": 160,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2WhJG_Pkus-L_Tji80G5Ed52omHmAAh5CTjzmiiAqc8.jpg?auto=webp&amp;s=4ac6c401b1aef46ccb0f9f5406200b81daf0aeec"
        },
        "permalink": "/r/movies/comments/1ipcs7u/robert_eggers_nosferatu_sets_peacock_streaming/"
    },
    {
        "id": "1iplbvo",
        "author": "MarvelsGrantMan136",
        "title": "Corey Hawkins Latest To Join Christopher Nolan’s ‘The Odyssey’",
        "content": "",
        "upvotes": 414,
        "comments": 112,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/79DMiyO8EaQvdmDfmip3eZdSKzVPXHxOl9dESTyHydA.jpg?auto=webp&amp;s=af88204f10effcf076a79973e646d66a19287404"
        },
        "permalink": "/r/movies/comments/1iplbvo/corey_hawkins_latest_to_join_christopher_nolans/"
    },
    {
        "id": "1ipp6m4",
        "author": "BunyipPouch",
        "title": "First Poster for Documentary 'Cheech &amp; Chong's Last Movie' - Exploring their 5-decade career performing stand-up, making records, and starring in hit films. It covers their lives, comedy partnership, and lasting influence on pop culture.",
        "content": "",
        "upvotes": 231,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qdfw5mix47je1.jpeg?auto=webp&amp;s=f1e1e6ef9791bc9ba920b88bf48f3ab3a6b3c2a8"
        },
        "permalink": "/r/movies/comments/1ipp6m4/first_poster_for_documentary_cheech_chongs_last/"
    },
    {
        "id": "1ipkjqz",
        "author": "Unhappy-Plastic2017",
        "title": "Morgan Freeman in Deep Impact (1998) was the best representation of a president we have ever seen in movies. He was calm, collected and stated only facts.",
        "content": "[https://www.salon.com/2023/05/06/deep-impact-25-year-retrospective-science/](https://www.salon.com/2023/05/06/deep-impact-25-year-retrospective-science/)\n\nI just re-watched Deep Impact 1998 and it was a breath of fresh air to see a president represented in such a way. He was to the point - stated facts, and stated consequences for those that did not comply - no vagueness or game playing. I thought this was really interesting and I wish the politicians over the past 30 years or so actually did this. I am not sure things would actually turn out as presented in this movie nowadays if you actually talked to people with facts like they did in the movie - \"example - there were only a couple hundred people trying to break into the underground bunker in this movie but if this comet was actually going to hit the earth I think it would be thousands and thousands more.",
        "upvotes": 347,
        "comments": 162,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/oW3otlJ9zAvtjBDPxxum77mU_7urIjJDVMxbkPq5tYY.jpg?auto=webp&amp;s=994a9f2af472399f637b8de8b08862f875969bc1"
        },
        "permalink": "/r/movies/comments/1ipkjqz/morgan_freeman_in_deep_impact_1998_was_the_best/"
    },
    {
        "id": "1ipjav1",
        "author": "Odd_Advance_6438",
        "title": "Werner Herzog let Klaus Kinski get away with way too much",
        "content": "I’ve been going down the Kinski and Herzog rabbit hole, reading all their crazy stories. Herzog described Kinski as a very talented scumbag, who he still worked with on multiple films because they figured eachother were the best people for the project\n\nDid Kinski ever get punished for some of the stuff he did? It’s pretty awful. On their first movie, he randomly hit the extras with his sword while they were getting food so hard that they would’ve been killed if they weren’t wearing helmets. Also he got upset when a bunch of them were playing cards, so he took a gun and fired into their hut, leading to another extra having his finger blown off\n\nThen Herzog worked with him again, which seems pretty unsafe for the crew. On their Nosferatu movie, he apparently assaulted the female makeup artists so much that they refused to work again with Herzog until Kinski apologized\n\nPeople know what a menace Kinski was, but I feel like Herzog deserves a little more criticism for constantly endangering the people around him with this whiny little psycho",
        "upvotes": 388,
        "comments": 85,
        "media": null,
        "permalink": "/r/movies/comments/1ipjav1/werner_herzog_let_klaus_kinski_get_away_with_way/"
    },
    {
        "id": "1iphswg",
        "author": "Bullingdon1973",
        "title": "How Harrison Ford’s starring turn in WITNESS freed him to do more dramatic roles",
        "content": "",
        "upvotes": 460,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/F_oML8REGVyLK6y3lac-yiYGS1tAjTxRflK9-HDScH8.jpg?auto=webp&amp;s=4738f7175853748b5daa072949dc09525489fbdd"
        },
        "permalink": "/r/movies/comments/1iphswg/how_harrison_fords_starring_turn_in_witness_freed/"
    },
    {
        "id": "1ipa9ln",
        "author": "TheMiddlechild08",
        "title": "Due to subtitles, the beginning of Interstellar gives away what happens to a character.",
        "content": "This is really just me asking a question. At the beginning of Interstellar they show the testimonies of older people on tv talking about what it was like on earth before they had to leave. \n\nOne of them is old Murphy. And not only that, the subtitles say it’s her. I just wonder what the thought of this is here. I never realized it was her till like the third viewing, and then recently with the subtitles on it just flat out says it’s her. Is this an accident or on purpose? Like, if you had never seen the movie and watched it with subtitles on (which unfortunately is recommended for Nolan films) and the first 5 mins it gives it away that it’s her, even though it would be hard to catch that or understand what’s going on anyways. \n\nI just wonder if anyone has noticed that or what to think of it I guess lol. I just found it odd, or maybe not put her name in the subtitle. ",
        "upvotes": 1274,
        "comments": 476,
        "media": null,
        "permalink": "/r/movies/comments/1ipa9ln/due_to_subtitles_the_beginning_of_interstellar/"
    },
    {
        "id": "1iplwl6",
        "author": "NoCulture3505",
        "title": "Benedict Cumberbatch Replaces Tom Hardy in Cary Fukunaga’s Crime Thriller ‘Blood on Snow’",
        "content": "",
        "upvotes": 240,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/k6Kj-x5TSea9ln1lI-Bz2AgcXRJHZ6FZgooOQOfXCzU.jpg?auto=webp&amp;s=46cb755e65b0909548ab355e5ad353168ad31700"
        },
        "permalink": "/r/movies/comments/1iplwl6/benedict_cumberbatch_replaces_tom_hardy_in_cary/"
    },
    {
        "id": "1ipt3zk",
        "author": "Puzzled-Tap8042",
        "title": "‘Back in Action’ Leads Big Week for Netflix on Nielsen Charts With 4 Shows Surpassing 1 Billion Minutes",
        "content": "",
        "upvotes": 55,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vzyM8eUb7dwCknIKjfoQ1NCpwI55i104UDyt5lPVYA4.jpg?auto=webp&amp;s=33e3964418076faa24152f6e260a306122198db8"
        },
        "permalink": "/r/movies/comments/1ipt3zk/back_in_action_leads_big_week_for_netflix_on/"
    },
    {
        "id": "1ipgjsz",
        "author": "TheIronGnat",
        "title": "The courtroom scene in True Grit (2010) is one of the best written scenes in movie history.",
        "content": "Every time I watch this scene, there's a new layer of brilliance uncovered. It should be held up as an archetype of how to introduce characters in an entertaining and contextually authentic way without the need for boring exposition. It's just brilliant.\n\nFirst, the character of Rooster Cogburn is slowly revealed as he is questioned first by the prosecutor and then cross-examined by the defense attorney. We learn, in turn, that he is perfectly willing to use violence in defense of the law, that he is perfectly willing to use violence with the law as a cover, and then, finally, that he is simply a violent, vindictive man who casually kills and abuses his authority. It also shows him as a sarcastic and rather funny character who takes his many killings quite lightly, but is someone who at least pretends to have a belief in law and order.\n\nWe also learn, solely through brief reaction shots, a lot about Mattie's character as her interest in Rooster grows to conviction that he is the right man to track down her quarry. \n\nApart from this, the depiction of legal procedure is among the best ever filmed, with accurate objections and extremely accurate lawyer behavior. For example, at one point, the prosecutor asks a technically leading question (\"Did you find the jar with $120 in it?) which doesn't prejudice the witness at all and would have saved everyone's time, except that the defense attorney makes a pedantic objection that the question is technically leading. The judge sustains the objection, so the prosecutor's reaction is one of exasperation and he asks the more general (and technically appropriate for direct examination) question: \"What happened then?\" To which Rooster replies \"I found a jar with $120 in it.\"\n\nThen the cross examination is just an incredible work of dialogue crafting. A lengthy sequence in which Rooster describes his history of killing a particular family and, in a specific incident, describes how one member of the family \"came at me with a king bolt.\" The defense attorney clarifies incredulously \"You were armed and he advanced upon you with nothing more than a king bolt? From a wagon tongue!?\" \n\nNow, I guarantee that 95% of 2010 audiences had (and have) no idea what a wagon tongue is and had never even heard of a king bolt. But the scene is so well written, directed, and acted, that you don't need to. The writers don't need to sacrifice period accuracy because the context sets up more than enough for the audience to know what's going on without a full understanding of the details. \n\nThe scene's blocking, editing, and photography is also amazing. It feels dynamic and vital despite taking place in a courtroom where nearly everyone is stationary for the whole scene and where there are tons of extras just sitting in place. Closeups and medium shots are intermixed but not rapidly cut in the modern style-- the scene is allowed to develop and then the Coens get the hell out of it at the soonest possible moment. \n\nThis scene is like a Mozart piano concerto: there's not a single note out of place. Changing anything would be a diminshment. They should teach this to every prospective screenwriting student across the country for the next 50 years.",
        "upvotes": 292,
        "comments": 53,
        "media": null,
        "permalink": "/r/movies/comments/1ipgjsz/the_courtroom_scene_in_true_grit_2010_is_one_of/"
    },
    {
        "id": "1ipmric",
        "author": "These_Feed_2616",
        "title": "Denis Villeneuve",
        "content": "In my opinion, he’s one of the best directors working today, and as much as I love the Dune films, I really hope that after the 3rd film, he makes more drama and/or crime films, because Prisoners is in my opinion, one of the greatest films of the 21st century, Sicario and Enemy are great too! Can’t wait to see what he does in upcoming years!",
        "upvotes": 95,
        "comments": 90,
        "media": null,
        "permalink": "/r/movies/comments/1ipmric/denis_villeneuve/"
    },
    {
        "id": "1iozu61",
        "author": "Sonia341",
        "title": "A24’s ‘Death of a Unicorn’ Starring Jenna Ortega Rated “R” for Strong Violence &amp; Gore",
        "content": "",
        "upvotes": 4029,
        "comments": 163,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MEsvqDMioIpko_qZblIg25GsvQWIGsQ_hnc_SADwkgM.jpg?auto=webp&amp;s=985650d86f633ad7832107af385d517fb5744e2f"
        },
        "permalink": "/r/movies/comments/1iozu61/a24s_death_of_a_unicorn_starring_jenna_ortega/"
    },
    {
        "id": "1ipeorz",
        "author": "Minute-Necessary2393",
        "title": "Tangled is one of the most beautiful Disney films ever made.",
        "content": "Happy Valentines Day, everybody! And too celebrate....on my own...as usual (😢). I decided to watch one of my favorite Disney movies of all time....*Tangled*. This is not only one of my favorite Disney movies of all time, as I said, but also probably tied with *Frozen* as my favorite of the post-2000s Disney Era. Yes, I know there are objectively better films from the modern era like *Zootopia* and *Encanto*. But for my, *Tangled* is my all-time favorite (along with...well, you know).\n\nThe animation is absolutely beautiful, cozy, and still holds extremely, especially with the colors, the comedy also equally still holds up and I found myself laughing at a lot of points, the songs are memorable and catchy, I see The Light and the scene that goes with it is probably the highlight of the movie and one of, if not the most beautiful moment in have seen in any Disney film ever, Mother Gothel is truly the last great Disney (I love King Candy too, but he still got nothing on Gothel) who i am convinced is the Evil Queen from Snow White Years later and i refuse to think any different, the action is surprisingly solid, and not only is Rapunzel the best Disney princess (besides Kuzco, that is, lol), but also her and Eugene's love story is probably the best I've seen in any Disney film.\n\nThe two work off of each other extremely well, and you absolutely buy their chemistry, as they don't fall in love with one another right away, but instead there romance develops throughout the course of the film, and seeing it happen on screen is phenomenal, which just makes the scene when they eventually confess on the boat (in song form!) and when Rapunzel revives Eugene via her act of true love even more satisfying and heartwarming. The emotional/dramatic moments also work extremely well, and don't even get me started on how much of GOATs Maximus and Pascal are as comedic animal sidekicks.\n\nThe only problem I have is that the climax is admittedly the man saving the women again, but I'm willing to let it slide and view it more as a nitpick as it makes sense within the context of the story, and it's Rapunzel who ultimately brings Eugene back anyways. Not much else to say other then such a beautiful and solid film that I highly recommend, that i am surprised though also kindof glad Disney never did a sequel too (the closest we got was the equally fantastic and goated TV series, which i also highly recommend). With that said, if Frozen 3 and 4 are not crossovers with Tangled, I will be VERY disappointed. Maximus and Pacal interacting with Sven, Bruni, and Olaf is too amazing to think about.",
        "upvotes": 241,
        "comments": 38,
        "media": null,
        "permalink": "/r/movies/comments/1ipeorz/tangled_is_one_of_the_most_beautiful_disney_films/"
    },
    {
        "id": "1ipnfyr",
        "author": "thatdani",
        "title": "Multi-lingual folks, what movie moment hit differently for you because you understood the foreign language being spoken and /or written?",
        "content": "Guessing a lot of Spanish speaking people will be chiming in, since (at least in my experience) that's the #1 most prevalent non-English language spoken in American movies.\n\nMy personal example was watching Nosferatu in theaters in Romania. Both the village scene and the monastery scene had people snickering and laughing because of the unintentional silliness. Especially the moment &gt;!where the old nun throws garlic on Thomas and says \"Dau cu usturoi pentru strigoi\"!&lt; which sounds so authentically goofy to our ears, considering it's supposed to be set in the 1800s, but the accent is very classic \"rural grandma\" that all of us 90s city kids grew up with during summer vacation. It's like if you guys watched Sleepy Hollow and someone starts talking like Jeff Bridges in True Grit.\n\nIt's funny though, cause I definitely remember when I was a kid visiting my grandparents' village, there were old(er) people who had such thick dialects I legitimately could not understand them, and they would be born in like the 1920s-30s. Obviously they couldn't recreate this for Nosferatu, but still interesting to think about how unintelligible 1800s language would seem to us.",
        "upvotes": 64,
        "comments": 86,
        "media": null,
        "permalink": "/r/movies/comments/1ipnfyr/multilingual_folks_what_movie_moment_hit/"
    },
    {
        "id": "1ipj37l",
        "author": "MrShadowKing2020",
        "title": "Paramount-Skydance Merger Gets Green Light From SEC, EU",
        "content": "",
        "upvotes": 114,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/AMWJAvXY1CXFLfaOQdL8LVAoKFq5M0BcLq_5iWgnNFk.jpg?auto=webp&amp;s=4b4369a7b743da9dafb46c7699d99f990b81b2cc"
        },
        "permalink": "/r/movies/comments/1ipj37l/paramountskydance_merger_gets_green_light_from/"
    },
    {
        "id": "1ipgfzs",
        "author": "TheMediocreCritic",
        "title": "Raiders of the Lost Ark's opening is a great example of establishing character through action",
        "content": "The opening of Raiders is Iconic, and it's easy to see why. It is a thrilling sequence that sets the pace for the film to come. It sits firmly in the halls of great sequences and has been mimicked, parodied, and copied many times since its inception in 1981. One of the greatest feats it accomplishes is establishing the character of Indiana Jones with little to no dialogue.\n\n\n\nThe sequence is great; who doesn't like a rolling boulder and shooting darts, but the sequence is doing much more heavy lifting story-wise than you may notice at first glance? The trials that Indy navigates all serve to highlight the different aspects of the character that will play a larger role later in the film\n\n\n\nFor example, Indy is shown to be capable and intuitive. In this first scene, he finds the temple and thwarts an attack, but later, he shows that he is reckless and impatient, making mistakes that cause the temple to fall. The first sequence shows that all his planning goes sideways as soon as  it's tested. He is good at his job but has rivals. He sometimes trusts the wrong people, and his actions often lead to him being in very preventable situations.\n\n\n\nOne of my favorite aspects of the character, which continues throughout the films, is that he constantly loses. He finds and loses the ark and the grail. He almost never really wins a fight. He is luck and opportunity rolled into one. I think this is why the character has been loved for so long, he is just a guy bumbling through things with the best intentions\n\n  \n",
        "upvotes": 148,
        "comments": 35,
        "media": null,
        "permalink": "/r/movies/comments/1ipgfzs/raiders_of_the_lost_arks_opening_is_a_great/"
    },
    {
        "id": "1ip2pgn",
        "author": "HazelsWarren",
        "title": "What is the worst plot twist you've ever seen in a movie?",
        "content": "Inspired by the recent 'worst movie you've ever seen' thread ... what is the worst plot twist you've ever seen? Not looking for plot twists you didn't like but still fit the narrative pretty well, but more like ones that completely made everything before and after worse off. \n\nFor me, it's The Dressmaker. The first 30-45 mins are okay, seems like a romantic drama starring Kate Winslet and Sarah Snook with beautiful costumes. The movie feels light and funny in parts. But then &gt;! Kate Winslet's fortunes go downhill faster than you can say A Serious Man (by the Coen Brothers). Her love interest, Liam Hemsworth, drowns in sorghum inside a grain silo (she witnesses it). Then more people die in gruesome ways, and Kate Winslet ends up blowing up the town at the end. Tone-wise, it is so off...  !&lt;\n\nThe plot choices completely ruin some of the great things it had going for it.",
        "upvotes": 1420,
        "comments": 2560,
        "media": null,
        "permalink": "/r/movies/comments/1ip2pgn/what_is_the_worst_plot_twist_youve_ever_seen_in_a/"
    },
    {
        "id": "1ipbb4b",
        "author": "Thewhatnow5678",
        "title": "What movie is too big for the small screen?",
        "content": "Is there a movie, that you\na) never watched on the small screen after seeing it in theatres or) watched it on small screen but feel like you missed that grand feeling of theater?\n\nFor me it's Blade Runner 2049 and the new Dune movies. Saw all of them twice in cinemas, I'll probably skip the watch on a TV entirety. The soundscape, the scope in general... It doesn't translate to small. ",
        "upvotes": 233,
        "comments": 649,
        "media": null,
        "permalink": "/r/movies/comments/1ipbb4b/what_movie_is_too_big_for_the_small_screen/"
    },
    {
        "id": "1ipisz9",
        "author": "LaserDiscCurious",
        "title": "Walt Disney's \"Swiss Family Robinson\" (1960): How many of you grew up with it on VHS or Laser Disc?",
        "content": "I must have seen Swiss Family Robinson a hundred times when I was a kid. I wanted to live in the Treehouse or meet the animals or see the stars. \n\nEverybody in the cast is perfect, I even liked some of the freedoms made, like the addition of Roberta (played by the lovely Janet Munro, whom I was shocked to find out died young, 12 years after the film). I probably identified with Francis the most, since I was his age, though I probably was closer to Ernst when I grew up (except gay instead of straight, though Tommy Kirk, bless his heart, couldn't convince anyone he liked girls). \n\nThe scenery, the cinematography, the adventures. It's the kind of family film you don't see these days.",
        "upvotes": 84,
        "comments": 33,
        "media": null,
        "permalink": "/r/movies/comments/1ipisz9/walt_disneys_swiss_family_robinson_1960_how_many/"
    },
    {
        "id": "1ipq4xc",
        "author": "Chucheyface",
        "title": "2 \"Seconhand Lions\" tidbits.",
        "content": "In the film, both of the old uncles live to their 90's. Interestingly though, despite the fact that the film came out in 2003, both actors Michael Caine and Robert Duvall are both alive, being 91 and 94 respectively. Additionally in the beginning of the film, while  going down their driveway, there is all of the signs saying \"turn back\" and other warning signs however, when Walter, the little boy, is leaving the house all sad, it shows the same sign saying turn back, except in this context it means turn back, TOWARDS the house to the uncles. ",
        "upvotes": 26,
        "comments": 13,
        "media": null,
        "permalink": "/r/movies/comments/1ipq4xc/2_seconhand_lions_tidbits/"
    },
    {
        "id": "1iph2uj",
        "author": "Bullingdon1973",
        "title": "Fernanda Torres on ‘the Oscar run of her life’ and how her nomination was received in Brazil.",
        "content": "",
        "upvotes": 89,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FyPVdH7N2USD36bH_afp_OC0zHz14KBzvmvkynpBj1c.jpg?auto=webp&amp;s=16aa200a7ed6dbfedda3af77513ef198bc20baf7"
        },
        "permalink": "/r/movies/comments/1iph2uj/fernanda_torres_on_the_oscar_run_of_her_life_and/"
    },
    {
        "id": "1ipla7q",
        "author": "NoCulture3505",
        "title": "Official Poster for “The Friend”, Starring Bill Murray &amp; Naomi Watts",
        "content": "",
        "upvotes": 47,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jeo8gril86je1.jpeg?auto=webp&amp;s=6600be1abdc54af8a95f1837309dc93241c73397"
        },
        "permalink": "/r/movies/comments/1ipla7q/official_poster_for_the_friend_starring_bill/"
    },
    {
        "id": "1iplfcw",
        "author": "waitingforthesun92",
        "title": "Roy Orbison Biopic Due From ‘Bohemian Rhapsody’ Producer Via Compelling Pictures",
        "content": "",
        "upvotes": 41,
        "comments": 43,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/X40dBTCu--iybgMUTkA3rDMDAyxEcmT_UlPMpRszTUI.jpg?auto=webp&amp;s=a57fa0aec356e960f17d5c3836125249ec87407b"
        },
        "permalink": "/r/movies/comments/1iplfcw/roy_orbison_biopic_due_from_bohemian_rhapsody/"
    },
    {
        "id": "1ipsxzp",
        "author": "bpres08",
        "title": "What was the movie that made you become a movie fan?",
        "content": "Everyone has that movie that made them become more passionate about movies, whether it was for the storytelling, the cinematography, or the visual effects.\n\nFor me, it was Raiders of the Lost Ark at the age of 5 or 6. I think it was the first “real” adult movie I’d watched and it made me want to watch the rest of Spielberg’s movies. \n\nWhat was the movie that made you a movie fanatic?",
        "upvotes": 13,
        "comments": 76,
        "media": null,
        "permalink": "/r/movies/comments/1ipsxzp/what_was_the_movie_that_made_you_become_a_movie/"
    },
    {
        "id": "1ipio5g",
        "author": "JonasKahnwald11",
        "title": "Poster for 'Bob Trevino Likes It' - Starring John Leguizamo and Barbie Ferreira - Follows a young woman who searches for her estranged father Bob Trevino online and forms a bond with a different man of the same name.",
        "content": "",
        "upvotes": 40,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/m1fro7iyn5je1.jpeg?auto=webp&amp;s=2b33c6665c3e21ac82b81ef5061c69dbcfe5d7a9"
        },
        "permalink": "/r/movies/comments/1ipio5g/poster_for_bob_trevino_likes_it_starring_john/"
    },
    {
        "id": "1iowsxb",
        "author": "Edm_vanhalen1981",
        "title": "Cheech and Chong documentary will light up theaters on 4/20",
        "content": "",
        "upvotes": 1630,
        "comments": 83,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EwxjcP2w0muh-t8sWU0rfLO6Iswqk_rJ58eBy02tvvk.jpg?auto=webp&amp;s=76c08d1d9d25fb1409aafadde94f92d91034650a"
        },
        "permalink": "/r/movies/comments/1iowsxb/cheech_and_chong_documentary_will_light_up/"
    },
    {
        "id": "1ipq16o",
        "author": "Pyro-Bird",
        "title": "Cillian Murphy, Demi Moore, Saoirse Ronan (Twice) Among Irish Film &amp; TV Awards Winners",
        "content": "",
        "upvotes": 13,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/W4Q-KZuiCw0TfE6CJyDVhBvPTBkfTUAT49Jwh1KIahM.jpg?auto=webp&amp;s=0f706d6bfe4c87dbfe09d7ea7945b0dbbceb5f31"
        },
        "permalink": "/r/movies/comments/1ipq16o/cillian_murphy_demi_moore_saoirse_ronan_twice/"
    }
]