[
    {
        "id": "1lcovgx",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 30,
        "comments": 3338,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lcovgx/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1lbetgi",
        "author": "RM_Official_Thread",
        "title": "r/RealMadrid Reddit CWC Fantasy League and Prediction Bracket Challenge",
        "content": "FIFA Official app has 2 games going on for the CWC and it would be fun if we use both to determinate if you guys know as much football as you pretend to when  you're all arguing tactics in the sub and claiming you know how to fix the team and that Carlo had none.\n\n\\# Join the Fantasy League for this subreddit here:\n\n[https://play.fifa.com/fantasy/join-league/BDHSOJPY](https://play.fifa.com/fantasy/join-league/BDHSOJPY)\n\n\\# Join the Prediction bracket for this subreddit here:\n\n[https://play.fifa.com/bracket-predictor/join-league/60B7D21B](https://play.fifa.com/bracket-predictor/join-league/60B7D21B)\n\npost your bracket or fantasy team here to get people going.\n\nWinner of each will get a custom flair set to whatever you want (as long as its reasonable)",
        "upvotes": 18,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/L2IQgNCexcLebmnUV4r1PsoE08WHXZ9oOuLG1NvcOCg.png?auto=webp&amp;s=e5d92205c44c2e30bc741130b750be458855c060"
        },
        "permalink": "/r/realmadrid/comments/1lbetgi/rrealmadrid_reddit_cwc_fantasy_league_and/"
    },
    {
        "id": "1lhfhot",
        "author": "Charybd1ss",
        "title": "Franco Mastantuono wins MOTM vs Monterrey",
        "content": "",
        "upvotes": 212,
        "comments": 26,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/orvayhy9qe8f1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1lhfhot/franco_mastantuono_wins_motm_vs_monterrey/"
    },
    {
        "id": "1lh5mqk",
        "author": "7777777777777777777Y",
        "title": "Arda Güler vs Al Hilal",
        "content": "",
        "upvotes": 378,
        "comments": 62,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/skrekpbm6c8f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1lh5mqk/arda_güler_vs_al_hilal/"
    },
    {
        "id": "1lgwlqh",
        "author": "landofphi",
        "title": "Steven Gerrard says Luis Suarez was a better player than likes of Erling Haaland, Mo Salah, Harry Kane, Robert Lewandowski, Fernando Torres, Sergio Aguero, Zlatan Ibrahimovic &amp; Robin Van Persie. Only Karim Benzema (2022 Ballon d'Or winner) was better than Luis Suarez",
        "content": "",
        "upvotes": 567,
        "comments": 72,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ZoIUURC3tmshzBdvHHK5Im11tc3gMIfcD9PuoJVlqdA.jpeg?auto=webp&amp;s=39c0eb20e88d64dc2645736bf07c5d8278294b0a"
        },
        "permalink": "/r/realmadrid/comments/1lgwlqh/steven_gerrard_says_luis_suarez_was_a_better/"
    },
    {
        "id": "1lh50h4",
        "author": "94Temimi",
        "title": "[Official] Squad list for our match against Pachuca. Rudiger is back, Mbappe still out.",
        "content": "",
        "upvotes": 89,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TAOZqmRwK7yUf4VFT-5HdxCB17roXUuwAN088hbIDzY.jpg?auto=webp&amp;s=c3acfd02819028c05d47060fe6494efcdc8e83fe"
        },
        "permalink": "/r/realmadrid/comments/1lh50h4/official_squad_list_for_our_match_against_pachuca/"
    },
    {
        "id": "1lh3lv1",
        "author": "miamosimmy",
        "title": "Can anyone ID these autographs?",
        "content": "I've come into possession of this shirt whilst clearing out my late Dad's wardrobe. \n\nMy kids are asking me which autograph belongs to and I've no idea. \n\nI've managed to whittle it down to 2005/06 season and the shirt numbers are a massive help (6 = Helguera, 9 = Ronaldo) but after that, I'm afraid I don't have a clue. \n\nAny guesses? ",
        "upvotes": 96,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/v7xuppn4sb8f1.jpeg?auto=webp&amp;s=b0a3c96ed9e013e042481543c0ece7f144a9871d"
        },
        "permalink": "/r/realmadrid/comments/1lh3lv1/can_anyone_id_these_autographs/"
    },
    {
        "id": "1lh5jvm",
        "author": "DANKWINGS",
        "title": "My philosophy on Vinicius' slump and why I think he can recover with the right coaching",
        "content": "All of this is personal opinion and some may disagree however I do also want to preface by saying Vinicius has not had as bad of a season as some people make it out to be. 36 G/A is by no means a bad season. There's also been a large amount of chances he's created this season that no one's got on the end of. \n\nNow I want to point out that, and this is in by no means hate, because I love the guy too, the addition of Kylian Mbappe. This has slightly changed Vini's game, which I'll get into slightly later.\n\nVinicius for his most successful seasons was conditioned around playing with Karim Benzema. Probably the best 9 of our generation and a very good false 9 by most standards. He was tall, quick, fluid on the ball with his feet and could not only contribute to build up, but had the mentality of a 9. He knew where to find the scrappy passes, and where to find his head on the crosses, to score them.\n\nThis made Vinicius game a lot easier. If you watch Vinicius play around Karim, you can notice that his game was a lot simpler. He'd take 1/2 maybe 3 step overs, knock the ball and run and Karim was there every single time to receive the cross, pass or through ball. Another big thing Vini would do a lot is simply turn after letting the ball run past, because he knew he'd beat the RB on pace. Karim knew he would be fed the ball. Whilst this doesn't sound like a big deal, it's a huge deal, because it inspires confidence in the winger feeding the ball (Vinicius) to be better overall. Football is a confidence based game. Confidence is the largest thing on the pitch. With no confidence, you are already defeated mentally. \n\nNow we can see as Benzema has left, and Kylian was bought in, Vinicius has lost some of that confidence he once had. Do I think this is Mbappe's fault? Absolutely not. I mean without Mbappe we might've had an even worse season than what we currently have, but at least we still have two trophies. That generational talent bailed us out a good few times. What I've noticed about Vini's game now is firstly, he takes a LOT more unprecedented touches, than he used to. It's not a simple knock and run now, it's a lot more complex dribbling, which ultimately results in him losing the ball. I think this has slowly seeped into his game because Mbappe is by no means, a 9 like Karim. There is a 7 minute complication you can find on this subreddit, of Vini creating chances, and no one being on the end of them. Part of this is also with Bellingham having less involvement in the box til later in the game (if a goal is needed), because he doesn't want to clash with Mbappe. \n\nNow because of this lack of target man (a true number 9) and balls that he's whipped in that no one's got on the end of, has either slowly subconsciously OR intentionally, made Vini Jr take more touches, trying to do a lot more work by himself to either score and bail out the team or give a PERFECT pass to someone in the box. These extra touches have made it easier for defenders to win the ball from him, and every time he's losing the ball, he's losing a little more confidence. Mentally this is very defeating. This is what's making him appear a lot worse / more selfish than he once was. \n\nNow luckily, as the season has improved, Kylian has improved his positioning and overall game (we all know he has a bit of a slow start and fumbled a lot of easy chances, most created by Vini) and we can see where this has had *slightly* positive affects on Vini's game. Take the most recent Classico for example, or even some of the Vini - Mbappe counters in the Copa Del Rey. \n\nI was watching Thierry Henry on a podcast the other day and he was asked about losing the ball. He said he'd have a run at the right back, If he lost the ball, it was of no concern, as long as he ran to win it back. Vinicius doesn't do much tracking back, which combined with everything else I've spoken about makes him appear worse, especially now. Henry also said something that got me thinking though. \n\n*'As a winger I only need to get past the defender ONCE in 90 minutes, to play the ball into my striker so he can score, just ONE chance.'*\n\nWhen I watch Vini play, there is a lot of times he has this one chance, but we simply don't have anyone there, or lack the quality to get on the end of the ball. I mean hell, the most recent chance was our game against Al Hilal. Beat his man, got the ball to Guler who hit the crossbar. Got the ball again (in the same chance) and played a lovely cross to Gonzalo Garcia who unfortunately couldn't guide it in with enough pace. Luckily for us, we've seen over the years that Vini is happy to take that assisting role. They can call him selfish now, but I hope people who actually watch football can see where that's come from to an extent. \n\nI'd also like to add that because of Vini's recent success, teams and opposing coaches will learn from this and mark him accordingly as a danger man. If you notice now, Vini gets a lot less isolated 1v1s. As soon as he's on the ball, there's two players on him. \n\n**What I think needs to happen:** Vinicius Jr needs to be told he will always beat more players on pace than fancy skill moves. This has always been the method of fast, pacey wingers. You don't need to go for a rainbow flick and 3 nutmegs, it's not necessary. It looks great, and those skills can be incorporated approaching a players prime years. The team also needs to overload the box a lot more on chances. Like I referenced previously, there's a large amount of times he's whipped the ball in, and absolutely no one's there. If we actually flood the box correctly, we'd have a much better chance at putting these well-placed balls in the back of the net. Another thing I'd love to see, which we got glimpses of towards the end of the season, is more link up between him and Kylian. We've seen Kylian can score from the 9 position, his game will grow and he'll only improve. If he and Kylian link up more, they will garner more chemistry creating more chances on those quick counters, yet again refer to the most recent Classico for examples. Vinicius also needs to be told (and the forwards overall) that you're okay to have a go trying to beat your man, however if you lose the ball, it's absolutely your job to contribute to the press that wins the ball back. \n\nThese are just my thoughts. The team has had its struggles overall, especially with the departing of Kroos. I'm happy to hear alternative views and discuss in the comments. Either way, you won't catch me trying to force out my LW who's been a big part in our recent success. \n\n¡Hala Madrid y Nada Mas!\n\n\n\n\n\n",
        "upvotes": 68,
        "comments": 19,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lh5jvm/my_philosophy_on_vinicius_slump_and_why_i_think/"
    },
    {
        "id": "1lh4wp0",
        "author": "7777777777777777777Y",
        "title": "Full sequence of penalty vs Al Hilal",
        "content": "",
        "upvotes": 72,
        "comments": 12,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/1scs9p541c8f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1lh4wp0/full_sequence_of_penalty_vs_al_hilal/"
    },
    {
        "id": "1lgtoqc",
        "author": "Imetanga",
        "title": "We are becoming social monsters",
        "content": "Vini can’t change his hairstyle without getting criticised. He can’t dance in a stadium — even the Atlético captain says he won’t allow it. He can’t release a documentary — haters downvote it to the worst rating ever. His photos and videos on social media are edited with racial tones or to mock his appearance just to farm 100k likes.\n\nThey’ve hung his effigy under a bridge. Racist chants follow him across Spanish stadiums. \nAnd now people are upset and creating rumors because he has changed his two-year-old Instagram pins?\n\nNo player has been scrutinised and attacked like Vini over the past five years.\n\nThe way some madrid fans abandoned him after an underwhelming six months is absolutely disgusting.",
        "upvotes": 373,
        "comments": 109,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lgtoqc/we_are_becoming_social_monsters/"
    },
    {
        "id": "1lgxvvn",
        "author": "More-Judgment-9253",
        "title": "Do all of Vini's haters have the memory of a goldfish??",
        "content": "How am I seeing people say vini is the problem and he needs to leave when he has 36GA this season? Are we forgetting that when Mbappe was doing his best Hojlund impression for the first 6 months vini was the one saving us and he would have had about 30 assists if Mbappe wasn't going through whatever he was going through mentally? And yes his attitude needs to be fixed but at the end of the day despite mbappe missing all those chances we literally NEVER saw vini complain, not even once, and this is the guy people want out of the club? Yes, he's been average sometimes over the past 6 months but he still helped us a lot in different games like the last clasico for example where he gave mbappe 2 assists. He's literally played one game in this new era so far and now people want him gone, give him some more time, this is the guy that has saved us in the UCL multiple times.",
        "upvotes": 114,
        "comments": 71,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lgxvvn/do_all_of_vinis_haters_have_the_memory_of_a/"
    },
    {
        "id": "1lgg792",
        "author": "ae_babubhaiya",
        "title": "Finally arrived. Modric's special edition jerseys. 2025",
        "content": "",
        "upvotes": 1396,
        "comments": 48,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4rwgdard_p4EgxwHt66ltNjicFMIaan-SBt_fq3-444.jpeg?auto=webp&amp;s=08b27b38d83043a823127d758b9a8883b3e0cb8c"
        },
        "permalink": "/r/realmadrid/comments/1lgg792/finally_arrived_modrics_special_edition_jerseys/"
    },
    {
        "id": "1lh4jir",
        "author": "ManuMora98",
        "title": "[Fem - Sandra Riquelme] Sara Holmgaard (LB) will become a Real Madrid player after Everton announces that she'll leave the club on June 30th",
        "content": "",
        "upvotes": 24,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9fzVfe41q_HCPYlb4oxvPfyg_JlpuKMofN-VzWW3Rsw.jpg?auto=webp&amp;s=9874b31c82b13d7620b4ef47e787c44ffb3502bf"
        },
        "permalink": "/r/realmadrid/comments/1lh4jir/fem_sandra_riquelme_sara_holmgaard_lb_will_become/"
    },
    {
        "id": "1lgws2p",
        "author": "idemnagoleruke",
        "title": "I'm really glad to see that Real Madrid has tactical philosophy",
        "content": "Yes, first match under Alonso finished in a 1-1 draw, but finally we can see that Real Madrid has tactical ideology. We saw that team played in 3-2-5 formation with the ball, with one full-back tucking in to play alongside centre backs. In the first half, Arnold played as a attacking midfielder in right half-space, but he wasn't looking good. However, in the second half Alonso made change and got Arnold in defensive midfielder position. After that change, team looked good. I hope that Rodrygo and Vinicius could often get into 1 vs 1 against opposition's full-backs.\nYes, it is Xabi's first match as a Madrid coach, but we can already see changes. Some players doesn't have great understansing of half-spaces and positional play, but I believe that Xabi Alonso will get the best out of this team and I believe that we will see positional play. \nOne more thing. Remember that Guardiola's first season at Man City wasn't the best, but already in second season Man City was very, very scary team to face. Real Madrid will need some time to change and to adapt to new playing style, but it will worth it. Madrid is going to be one of the most dominant teams tactically.\n\n\nEdit: I don't want to say that Ancelotti doesn't have tactics. Of course he has, but he doesn't have tactical philosophy. ",
        "upvotes": 48,
        "comments": 13,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lgws2p/im_really_glad_to_see_that_real_madrid_has/"
    },
    {
        "id": "1lgqd63",
        "author": "mg_phopla",
        "title": "Vini is an important part of our team...",
        "content": "I honestly feel like these attacks on Vini come from our rivals, because I don't get it. Sure, he was out of form for most of the season and he wasn't at his best, but he still had a decent season(21 goals, 18 assists in all comps).🤷🏾‍♂️. The teams performance was sub-par as a whole. He carried the team for past few seasons. Carried us at the start of this season as well while Mbappe was adjusting. (since Benzema Ballon d'Or season he's been our most creative player). Now all this hate?\nI get criticism for his attitude, because it's horrible and he has it coming, but he's our player, and he puts up numbers, we need to support our players. We can call him out on his antics all day and I'm all for that.\nWe can't be calling for people's heads after some bad games. When you look at the bigger picture, he's a crucial part of our team and won't leave.",
        "upvotes": 99,
        "comments": 102,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lgqd63/vini_is_an_important_part_of_our_team/"
    },
    {
        "id": "1lghf6z",
        "author": "Enough-Possibility59",
        "title": "So close !! I still enjoyed watching this game",
        "content": "",
        "upvotes": 421,
        "comments": 14,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/m3haq5jhv58f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1lghf6z/so_close_i_still_enjoyed_watching_this_game/"
    },
    {
        "id": "1lg39ua",
        "author": "Nyghl",
        "title": "Xabi himself played as a pivot in training to teach players how to do it",
        "content": "",
        "upvotes": 2186,
        "comments": 117,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/yhhfanmix28f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1lg39ua/xabi_himself_played_as_a_pivot_in_training_to/"
    },
    {
        "id": "1lgbcyj",
        "author": "TheFeatherDiaries",
        "title": "Arda Güler vs Franco Mastantuono - Who has more potential/higher ceiling?",
        "content": "",
        "upvotes": 369,
        "comments": 89,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ztwhibrbl48f1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1lgbcyj/arda_güler_vs_franco_mastantuono_who_has_more/"
    },
    {
        "id": "1lgc2o9",
        "author": "94Temimi",
        "title": "Real Madrid Police Escort on the way to Al Hilal match",
        "content": "",
        "upvotes": 216,
        "comments": 15,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/e3128r04q48f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1lgc2o9/real_madrid_police_escort_on_the_way_to_al_hilal/"
    },
    {
        "id": "1lg89fe",
        "author": "Radbevto",
        "title": "Most seasons with 70+ goal contributions in the 21st century (top 5 leagues, club and country)",
        "content": "",
        "upvotes": 309,
        "comments": 61,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/q3t2b78xy38f1.png?auto=webp&amp;s=bdfb3a4cf3300e4559102f32ab40c05f5ad2ee0a"
        },
        "permalink": "/r/realmadrid/comments/1lg89fe/most_seasons_with_70_goal_contributions_in_the/"
    },
    {
        "id": "1lgexmq",
        "author": "94Temimi",
        "title": "[Basket] Real Madrid Basket Take Game 1 of The League Final vs Valencia with an 89–75 final score",
        "content": "",
        "upvotes": 134,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/fi5e6m01c58f1.png?auto=webp&amp;s=6738f3a38178e6cfb683837d8eff260c85b4546c"
        },
        "permalink": "/r/realmadrid/comments/1lgexmq/basket_real_madrid_basket_take_game_1_of_the/"
    },
    {
        "id": "1lgkmsh",
        "author": "sidewinder787",
        "title": "How would you improve this team, if you were the president of Real Madrid?",
        "content": "We know who Perez has hired as the manager and we know what players he's bought so far for the upcoming season. If you were president of RM, would you have kept Ancelotti, Signed Alonso or gone with another manager? What about players? Who would you have bought, or sold? I like the addition of Alonso and I'm stoked to see what he can do. As for the players I'm over Vini and I would've sold him already. ",
        "upvotes": 29,
        "comments": 95,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lgkmsh/how_would_you_improve_this_team_if_you_were_the/"
    },
    {
        "id": "1lhivqq",
        "author": "Alternative-Camp-635",
        "title": "this starting 11 speaks balance and maybe what Madrid actually need",
        "content": "i think this is the most balanced madrid for xabi ball, and will do well, i think vini is better as inside forward, along jude and mbappe as striker,\n\nreason for trent in inversion in midfield to provide those crosses and switches, valverde for cover and also progression, their position is inter-changable , so a rotations of valverde and trent,\n\nguler solved the controller problem,\n\ntchuameni still has the physical presence\n\ncarreras will work as lwb",
        "upvotes": 0,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/p4vu56qotf8f1.png?auto=webp&amp;s=29608de5d3bdb58fd394e31c2e319f3d55911676"
        },
        "permalink": "/r/realmadrid/comments/1lhivqq/this_starting_11_speaks_balance_and_maybe_what/"
    },
    {
        "id": "1lg4yqb",
        "author": "Virtual_Bee_6807",
        "title": "Who’s the most underrated Madrid player since 2010?",
        "content": "Not talking about the stars like Ronaldo, Modrić, or Benzema, I mean the players who quietly did their job, didn’t always get the headlines, but were absolutely vital to our success.\n\nFor me, I’d say angel di maria. The engine in midfield during the La Décima run, played out of position, always delivered big in finals, and still doesn’t get enough respect.\n\nCurious to hear who comes to mind for you all. There’s a lot of names that deserve more love.",
        "upvotes": 117,
        "comments": 130,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lg4yqb/whos_the_most_underrated_madrid_player_since_2010/"
    },
    {
        "id": "1lg5q5v",
        "author": "Domesticated_Cum",
        "title": "Am I the only happy with our midfield talent?",
        "content": "Everywhere I go, I see \"Real Madrid Fans\" crying about how we don't have Wirtz or Zubimendi. \n\n  \nI really like the players we have. I think Camavinga, Tchouameni, Jude, Guler, Valverde, and Cabaillos are elite talent that will grow and develop at Real Madrid. I don't want any high profile players to join at the moment. I see what Xabi is doing and I'm very excited to see the team improve and better execute the ideas. I hope we don't sign anyone in midfield. I want to see Guler and Camavinga play more, learn, and improve. Becoming a great team with these names is 50x more satisfying than buying Wirtz or some most wanted midfielders at the moment. We should only buy first team players for positions we don't have (RB, CB, LB, ST)\n\n  \nLooking forward to watch more games under Xabi and see how the game changes. Last game I saw Courtois playing higher and providing passing options. We saw Huisjen as well driving the ball forward to exploit spaces left by 1:1 marking. The second half change of Guler gave us massive advantage and we completely dominated the second half, while also struggling to score.\n\n  \nWe also tried to play high press but didn't really do it well and Al-Hilal was able to get out easily every time. But I'm sure it will improve.",
        "upvotes": 67,
        "comments": 59,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lg5q5v/am_i_the_only_happy_with_our_midfield_talent/"
    },
    {
        "id": "1lg58ux",
        "author": "Reasonable_Flow8839",
        "title": "Where do you rank Casemiro in the list of most important midfielders in our modern era?",
        "content": "Casemiro’s departure hit hard for many of us, and while Tchouaméni is doing a great job, I’ve been thinking about how massive Casemiro’s role was during our Champions League dominance from 2016–2018.\n\nHe wasn’t flashy, but he allowed Modrić and Kroos to fully express themselves. He also popped up with key goals and wasn’t afraid to do the dirty work.\n\nDo you think he’s top 5 in terms of importance over the last decade? Or was he just the right player at the right time?",
        "upvotes": 52,
        "comments": 46,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lg58ux/where_do_you_rank_casemiro_in_the_list_of_most/"
    },
    {
        "id": "1lfnixv",
        "author": "94Temimi",
        "title": "First official photos of our 3rd kit for the 2025/26 season",
        "content": "Courtesy of @[Hamza\\_RMFC](https://x.com/Hamza_RMFC) on X   \n",
        "upvotes": 441,
        "comments": 75,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YkSjNv3B22PLasDwXB_b0ec_Oj5y1m6jkD-8NaHVy10.png?auto=webp&amp;s=6427d850d9c1f11a4e6c7fff7dcc81d81e4b3cb5"
        },
        "permalink": "/r/realmadrid/comments/1lfnixv/first_official_photos_of_our_3rd_kit_for_the/"
    },
    {
        "id": "1lfapef",
        "author": "Chico813",
        "title": "Blessed to have been able to photograph this club yesterday... ON the sun",
        "content": "What's up, y'all. I'm a local photographer in Miami and I was lucky enough to get a chance to cover such an incredible club. I love the way Real Madrid came out in the second half and there were several solid sequences of play. Unfortunate that they didn't capitalize on an Al-Hilal that was on its heels. Hope to see you in one of the knockouts here. \n\nAll photos here are mine and if you wish to use any, please reach out to me about photo credits and such. Be well and good luck. ",
        "upvotes": 2163,
        "comments": 84,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/64XTyJi3-SdkufhreShxpgxAANYV8GLpqPkTW8khEKE.jpeg?auto=webp&amp;s=29013e3fee47271a196c4c8d3aff095fea18548e"
        },
        "permalink": "/r/realmadrid/comments/1lfapef/blessed_to_have_been_able_to_photograph_this_club/"
    },
    {
        "id": "1lfk7sv",
        "author": "94Temimi",
        "title": "A summary of Vini's contributions yesterday. No care to even make a run in a completely open space to provide a passing option to Jude. Frustrating watch to say the least.",
        "content": "",
        "upvotes": 576,
        "comments": 233,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/l81xzn13tx7f1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1lfk7sv/a_summary_of_vinis_contributions_yesterday_no/"
    },
    {
        "id": "1lh1jt8",
        "author": "tamops",
        "title": "Bellingham/Vini as CF while Mbappe recovers",
        "content": "With Mbappe out of the squad due to illness, wouldn’t you rather see Bellingham or Vini play CF than Gonzalo?\n\nBellingham did well in that position 2 seasons ago, and Vini as CF couldn’t be any worse than current Vini as LW 😆\n\nPlus playing either of them as CF would free up another starting position for players like Arda, Brahim, and Rodrygo (as LW).\n\nIn particular playing Rodrygo as LW or starting Arda would add a lot more creativity to our team.\n\nThoughts?",
        "upvotes": 0,
        "comments": 25,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lh1jt8/bellinghamvini_as_cf_while_mbappe_recovers/"
    },
    {
        "id": "1lf77qw",
        "author": "ranger_ronaldo",
        "title": "THIS THING IS SO REAL",
        "content": "",
        "upvotes": 2264,
        "comments": 81,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/94p20un70v7f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1lf77qw/this_thing_is_so_real/"
    },
    {
        "id": "1lfx0eg",
        "author": "Tricky-Passion1845",
        "title": "Our midfield needs serious work",
        "content": "Don’t get me wrong, our midfield doesn’t have any bad players but the problem is that it’s filled with athletic box to box freaks in the forms of Camavinga, Federico Valverde and Jude Bellingham. Tchouameni is a lock at cdm and non negotiable but one or even two of the others have to go because we are in desperate need of a Kroos/modric type of profile in the midfield and it hurts to say this but it’s the unfortunate truth.  Arda Guler needs to be a starter and we need someone like an Angelo Stiller to control the game from deeper(not Tchouameni deep)\nLet me know what you guys are thinking ",
        "upvotes": 45,
        "comments": 136,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lfx0eg/our_midfield_needs_serious_work/"
    }
]