[
    {
        "id": "1joono2",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1joono2/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1joonon",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1joonon/la_piola_friends_meetup/"
    },
    {
        "id": "1jovxy6",
        "author": "bonny-95",
        "title": "Sacra di San Michele",
        "content": "",
        "upvotes": 89,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jovxy6/sacra_di_san_michele/"
    },
    {
        "id": "1jp31ra",
        "author": "Particular-Glove-225",
        "title": "Cerco nuove amicizie",
        "content": "Ciao a tutti. Sono di Torino ma ultimamente avrei voglia di fare nuove amicizie. Ho 35 anni, donna, mi piacciono molto le materie artistiche, ho studiato al liceo artistico e pratico ancora disegno e pittura. Inoltre mi piacciono le materie umanistiche in generale, in particolare storia, filosofia e psicologia. Sono tendenzialmente introversa, mi piace più che altro fare attività tranquille con poche persone. Non sono esattamente una cinefila, ma non mi dispiace passare una serata a guardare un film o semplicemente ad ascoltare un po' di musica e chiacchierare un po'. Se avete piacere, scrivetemi pure. Buona serata a tutti! ",
        "upvotes": 10,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1jp31ra/cerco_nuove_amicizie/"
    },
    {
        "id": "1jog8tq",
        "author": "DiamondbackArmadillo",
        "title": "cos'è questo??",
        "content": "Tana del pesce...?",
        "upvotes": 354,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/j161c5wyq3se1.png?auto=webp&amp;s=3e5d661e1e17da68cb0be170515471bc681a06a7"
        },
        "permalink": "/r/torino/comments/1jog8tq/cosè_questo/"
    },
    {
        "id": "1jpaje7",
        "author": "Ready-Concept4047",
        "title": "Corsi Formativi",
        "content": "Ciao a tutti, vorrei cambiare lavoro, ho una laurea triennale L-36 conseguita ormai 3 anni fa, dopo la laurea mi sono concentrato esclusivamente sul lavoro ma penso sia arrivato il momento di cambiare realtà. La mia domanda è: conoscete o avete fatto corsi formativi qui a Torino che secondo voi sono davvero validi per quanto riguarda la formazione e la conseguente immissione sul mercato del lavoro? Sia a pagamento che finanziati da enti pubblici/UE, ed eventualmente con stage finale in azienda\nQualsiasi cosa vi venga in mente\nGrazie",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jpaje7/corsi_formativi/"
    },
    {
        "id": "1jp68hq",
        "author": "HeadphoneGirly",
        "title": "vecchietto con musical techno",
        "content": "RAGA continuo a vedere un vecchietto con la cassa attaccata al collo che mette la musica Techno\n(Porta nuova)\nSono l'unica??",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1jp68hq/vecchietto_con_musical_techno/"
    },
    {
        "id": "1jorqda",
        "author": "autumnshimmer",
        "title": "Negozio riparazioni oggetti elettronici datati?",
        "content": "Salve gente, come va? Come da titolo sto cercando un negozio dedicato alla riparazione di oggetti elettronici abbastanza datati. Per essere specifico sto cercando di riparare un walkman WM-EX606 del 1992. Grazie mille!🫶🏻",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1jorqda/negozio_riparazioni_oggetti_elettronici_datati/"
    },
    {
        "id": "1jo9md0",
        "author": "tarkinn",
        "title": "How is living in Torino / Turin",
        "content": "",
        "upvotes": 25,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vrhg3pco7tre1.jpeg?auto=webp&amp;s=8f5869ae5942d91e7371d2585903597a6518f04b"
        },
        "permalink": "/r/torino/comments/1jo9md0/how_is_living_in_torino_turin/"
    },
    {
        "id": "1jp2t0u",
        "author": "Dry-Eye1685",
        "title": "Controllori metro",
        "content": "Salve, volevo chiedere se qualcuno di voi avesse mai incontrato i controllori dentro la metro... Per sapere se nel momento in cui uno passa i tornelli senza biglietto poi ci fosse qualche rischio di essere beccato oppure no.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1jp2t0u/controllori_metro/"
    },
    {
        "id": "1jo400o",
        "author": "Original_Draw_9492",
        "title": "Negozi cinesi zona Lingotto",
        "content": "Come da titolo, non sono di Torino e ancora non conosco benissimo la zona ma cercavo negozi in stile cinesi che hanno un po di tutto per ogni evenienza, per intenderci in zona vicino al Centro Commerciale\nNegozi di merceria di ogni genere, cose di casa, ufficio, un minimo di elettronica, fai da te ecc.",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1jo400o/negozi_cinesi_zona_lingotto/"
    },
    {
        "id": "1jocx0y",
        "author": "Repulsive-Yak-126",
        "title": "Hospitals for non eu citizens",
        "content": "What would you recommend me if I have sings of skin sickness. Is there any free hospitals for non eu citizens ( exchange student without tessera sanitaria) and what would I need to do in order to meet with a doctor here?",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1jocx0y/hospitals_for_non_eu_citizens/"
    },
    {
        "id": "1jo3zlv",
        "author": "emaravi94",
        "title": "Locali per compleanno",
        "content": "Ciao,\n\nSaremmo un gruppo di 10-15 persone, sui 30-40 anni, per festeggiare il mio 31° compleanno.\n\nCercavo qualcosa tipo apericena/aperitivo/pizza dove però, al termine della mangiata, ci fosse anche un po' di musica/ballo o comunque un po' di movimento/intrattenimento, visto che molte persone non sono particolarmente festaiole e quindi il tutto rischia di rimanere troppo tranquillo.\n\nL'anno scorso sono andato al BeFed di Settimo Mulino ed è stato molto divertente.  \nCercavo però qualcosa più in Torino, siccome non tutti hanno l'auto.\n\nGrazie per i consigli!",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jo3zlv/locali_per_compleanno/"
    },
    {
        "id": "1joa08x",
        "author": "BeepBeepSadFucks",
        "title": "Erasmus exchange student",
        "content": "Hello everyone,today i was announced that i am welcomed in the Erasmus mobility program and I will go to University of Torino. I have never traveled before in any country and also have no idea what to expect for my stay there. I study Communications and Public Relations but I dont know where I could look up to find anything about this study program there.\nI have a few concerns that i might have a hard time socialising there as i only know english well and my native language. Will i have to take exams in italian or is english just enough? \nAnything you can tell me before leaving as what I should do,what to expect from the students and the program there or any piece of advice overall is very welcomed. Thank you!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1joa08x/erasmus_exchange_student/"
    },
    {
        "id": "1jo6p0r",
        "author": "Giuido",
        "title": "Fumetterie Yu-gi-oh retro format",
        "content": "Ciao a tutti. Conoscete fumetterie che organizzano local di Yu-Gi-Oh? Nello specifico di formati Goat o Edison?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jo6p0r/fumetterie_yugioh_retro_format/"
    },
    {
        "id": "1jo5ux5",
        "author": "DeepCalligrapher8814",
        "title": "Smart Working - Free",
        "content": "Questa settimana avrei necessità di fare un giorno in smart working in qualche location possibilmente free ( o comunque con normale consumazione) avevo sentito da un ragazzo che c'è un bar di un hotel che lo permette di fare in zona Metro Marconi. Conoscete qualche altro posto e qualcuno che si vuole unire?\n\nCome lavoro faccio il Software Developer.",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1jo5ux5/smart_working_free/"
    },
    {
        "id": "1jnxmjx",
        "author": "Cec_Patu",
        "title": "Parrucchieri Uomo a Torino",
        "content": "Buongiorno!\nDopo anni di permanenza a Torino non sono ancora riuscito a trovare un parrucchiere soddisfacente.\nL'ultimo in cui sono stato (molto grande e noto), mi ha fatto spendere effettivamente poco (16€). Ma non mi ha fatto lo shampoo né prima (avevo capelli puliti ci sta) e ne dopo, lasciandomi con molti capelli tagliati in testa. Quest'ultima cosa l'ho ritrovata costantemente in ogni parrucchiere che ho provato a Torino, ma perché non ti sciacquano la testa io non capisco. Ovviamente alcune volte l'ho chiesto ed è stato fatto, ma non senza storcere il naso.\n\nOra la domanda:\nMi potreste consigliare un parrucchiere a Torino che faccia un trattamento come si deve e che non ti faccia somigliare ad un personaggio di Gomorra una volta uscito? Anche a costo di spendere 30€ va bene.\n\nGrazie!",
        "upvotes": 4,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1jnxmjx/parrucchieri_uomo_a_torino/"
    },
    {
        "id": "1jnyc6q",
        "author": "raphyy_sanchez",
        "title": "nice café recommendation for studying ? i live in san salvario",
        "content": "Thank you ! ",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1jnyc6q/nice_café_recommendation_for_studying_i_live_in/"
    },
    {
        "id": "1jnvpt7",
        "author": "kutatiger",
        "title": "Where is the huge gathering located?   I missed it.",
        "content": "https://x.com/joeymannarinous/status/1906442597796921603?s=46",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/CAOX3qEv9z4DtTYQAALEbJYrrt_ZJvmsCwFg9XwdVPI.jpg?auto=webp&amp;s=f89ec84029139d7630ecbdc34af21ca3be6eeb84"
        },
        "permalink": "/r/torino/comments/1jnvpt7/where_is_the_huge_gathering_located_i_missed_it/"
    },
    {
        "id": "1jnmobn",
        "author": "JimmyAngel5",
        "title": "Corso di Piccola Scultura Ceramica",
        "content": "Ciao, \n\nPer chi fosse interessato al Cortile del Maglio organizzano un corso di modellazione artistica di 8 incontri a partire da aprile, organizzato dall'associazione Aquarius Ceramica:\n https://www.instagram.com/aquariusceramica?igsh=eG4wOWV3aGJ0ZnJx\n\n",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1jnmobn/corso_di_piccola_scultura_ceramica/"
    },
    {
        "id": "1jnfw0u",
        "author": "One-Yogurt-9548",
        "title": "Nuovo a San Paolo, cerco un gruppo di giovani (&lt; 35) per attività sociali! 🎉",
        "content": "Ciao a tutti! Mi chiamo Simone, ho 28 anni e mi sono appena trasferito nella zona di San Paolo. Sto cercando di creare un gruppo di una decina di persone (bilanciato tra uomini e donne) per fare un po' di sana socialità e divertirci insieme! 😊\n\n**Cosa propongo?**  \nEcco alcune delle attività che mi piacerebbe organizzare:\n\n* **Cene e serate al pub** 🍻\n* **Serate giochi da tavolo** 🎲\n* **Dungeons &amp; Dragons** (per gli amanti dei giochi di ruolo) 🐉\n* **Passeggiate** (per chi ama la natura e la città) 🚶‍♂️\n* **Cattura Pokémon** (per chi è fan dell'app) 🎮\n* **Cucinare insieme** 🍝\n\nL'idea è creare un ambiente amichevole, stimolante e divertente, con persone simpatiche, aperte a nuove esperienze e pronte a fare nuove amicizie. Se vi piace l'idea di fare attività sociali e conoscervi in modo divertente e informale, questo gruppo fa al caso vostro!\n\n**Chi sono?**  \nSono una persona molto attiva, con mille progetti in corso (alcuni un po' pazzi, altri molto concreti!), amo la musica, la tecnologia e ho un grande interesse per la cultura e il volontariato. Sono anche un grande appassionato di giochi da tavolo, e mi piace fare nuove conoscenze, tanto che sono anche attivo nel panorama associativo della mia città.",
        "upvotes": 10,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1jnfw0u/nuovo_a_san_paolo_cerco_un_gruppo_di_giovani_35/"
    },
    {
        "id": "1jnl30u",
        "author": "Gen070",
        "title": "Corsi di disegno a Torino?",
        "content": "Ciao a tutti!\n\nDa diverso tempo ho deciso di imparare a disegnare a matita, ma tra una cosa e l'altra non sono mai riuscito a dedicarmici davvero in modo serio. Negli ultimi giorni mi sono deciso a riprendere a esercitarmi, però mi farebbe piacere non solo farlo in maniera più strutturata, ma anche poter conoscere e fare amicizia con altre persone che siano appassionate di disegno. \n\nPer caso qualcuno saprebbe consigliarmi dei corsi di disegno a Torino? Possibilmente in orario serale dato che sono uno studente universitario e spesso durante la giornata devo seguire dei corsi in uni/studiare.\n\nGrazie mille in anticipo a tutti!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jnl30u/corsi_di_disegno_a_torino/"
    },
    {
        "id": "1jnenth",
        "author": "ivlia-x",
        "title": "Quando riapre la passarella olimpica?",
        "content": "Ciao, avete qualche informazione? Da due settimane è chiusa, prima per un evento sportivo e adesso non c’è scritto niente. \n\nSono incazzata perché è l’unico centro commerciale vicino a me, ci andavo spesso a piedi e adesso invece di 26 minuti ci vuole quasi un’ora (56min). ",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1jnenth/quando_riapre_la_passarella_olimpica/"
    },
    {
        "id": "1jnkozo",
        "author": "cluelesswind",
        "title": "Bologna-Torino domani: opzioni veloci ed economiche?",
        "content": "Ciao, domani devo raggiungere Torino da Bologna e cerco la soluzione più rapida ed economica. Preferibilmente opzioni tipo carpooling o mezzi che non richiedano ore interminabili, senza spendere una fortuna. Qualcuno ha consigli pratici o gruppi WhatsApp utili? Grazie in anticipo!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jnkozo/bolognatorino_domani_opzioni_veloci_ed_economiche/"
    },
    {
        "id": "1jn9oml",
        "author": "Carlossss11",
        "title": "Pomeriggio al vale?",
        "content": "Chi avrebbe voglia di venire al Valentino per rilassarsi un po’ sotto il sole primaverile giocando a carte/palla/giochi di società con birre, stuzzichini e tanta allegria? \nSarebbe il top se si creasse un gruppo bilanciato tra uomini e donne quindi dai fatevi avanti ",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1jn9oml/pomeriggio_al_vale/"
    },
    {
        "id": "1jnjlto",
        "author": "GardenSure8482",
        "title": "Centro personal/piccola palestra Santa Rita e dintorni",
        "content": "Ciao a tutti, vista la pro attività di questo gruppo volevo chiedere consiglio a voi per sapere se conoscete centri personal o palestre piccole che siano poco frequentate. \n\nIl costo non è un problema (anche fossero 150€/mese).\n\nL’obiettivo è quello di riuscire ad allenarsi tranquillo anche negli orari di punta (pausa pranzo, orario serale).\n\nGrazie in anticipo a tutti per eventuali consigli",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jnjlto/centro_personalpiccola_palestra_santa_rita_e/"
    },
    {
        "id": "1jnequp",
        "author": "Similar-Medium-8438",
        "title": "Gruppo whatsapp",
        "content": "22 anni e da poco a Torino e da quello che ho capito c'è un gruppo whatsapp per conoscersi a Torino.Se sì come si entra?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1jnequp/gruppo_whatsapp/"
    },
    {
        "id": "1jmjahf",
        "author": "Inevitable-Bad5953",
        "title": "Come trovare un lavoro qui a Torino ?",
        "content": "Ciao a tutti, sono inglese e mi sono trasferito qui a Torino all’inizio dell’anno, e non sono ancora riuscito a trovare un lavoro. Parlo italiano a un livello abbastanza alto (alto B2 per specificare) e anche francese e tedesco, quindi non cerco lavori esclusivamente in inglese, però mi sembra impossibile trovare qualcosa. Ormai non so cosa fare, adesso fa tre mesi che sto cercando lavoro senza neanche una risposta/colloquio. Tutte le posizioni di livello più basso/neolaureato vogliono qualcuno con tantissimi certificazioni che veramente non servano a niente rispetto al lavoro, l’altro ieri ho letto che per lavorare nei communications da Ferrero (ad esempio), chiedono una laurea in scienze culinarie. Secondo me questo è un spreco di una laurea, non credo che gente che studiasse scienze culinarie immagina di lavorare nei communications 💀💀💀. Anche i lavori che vogliono madrelingua inglese non mi rispondono. Mi sembra che la unica opzione sarebbe fare un stage e lavorare praticamente gratuitamente, ma per me non è possibile perché (SHOCK) devo pagare l’affitto e il resto. Se avete consigli/conoscete posti dove potrei candidarmi, per favore ditemi o qui o per messaggio privato. Ho risparmiato i soldi in Inghilterra per venire qui mentre che cerco un lavoro, però se non riesco a trovare qualcosa dovrò tornare in Inghilterra (che non voglio fare perché qui c’è la mia partner) Grazie ❤️",
        "upvotes": 23,
        "comments": 32,
        "media": null,
        "permalink": "/r/torino/comments/1jmjahf/come_trovare_un_lavoro_qui_a_torino/"
    },
    {
        "id": "1jmqyz9",
        "author": "Limbo-709",
        "title": "Alla ricerca di amici con interessi in comune",
        "content": "Come da titolo sono della provincia di Torino e non esco moltissimo perché non ho amici con hobby e passione in comune con cui uscire. Per cui ho pensato di rompere questo circolo vizioso facendo questo post. Magari qualcuno lo troverà tramite alcune parole chiave. \n\nSono sulla ventina e studio chimica ma mi sono sempre piaciute molto anche le materie umanistiche come letteratura e storia, in senso superficiale anche psicologia e filosofia.\n\nMi piace il cinema nel senso di film d'autore, sia quelli più popolari come Tarantino, Nolan, Lynch ma anche registi magari orientali tipo Miike o Sion Sono. Mi piace anche il mondo dell'animazione anche se ultimamente guardo pochi anime, magari giusto qualche film. \n\nContinuo però a leggere fumetti, forse la mia passione più costante, iniziata coi Topolino poi Comics e infine manga. Attualmente mi sto leggendo il manga di Detective Conan, che fu il mio primo e più importante anime da bambino.\nHo letto circa 2500 volumi manga, da serie lunghe a volumi unici, passando per qualche webtoon.\n\nAttualmente il mio hobby principale è la musica però, il mio primo artista preferito è stato Caparezza, con il quale ho poi conosciuto altri rapper alternativi come Murubutu, Claver e Rancore, ed anche John de Leo dei Quintorigo che mi ha aperto il mondo al jazz e la musica sperimentale.\nAttualmente ascolto principalmente Post-rock, un sottogenere del rock prettamente strumentale e orchestrale. IDM, un genere di musica elettronica anche detto Brain dance caratterizzato da ritmi super complessi, infine Dark Jazz, un sottogenere ispirato alle atmosfere dei film noir. Quindi artisti come godspeed you black emperor, Aphex Twin e Bohren Club of the gore.\nPerciò riassumendo mi piace principalmente musica sperimentale e ambient oltre al caro hip-hop conosciuto con Caparezza.\n\nDa ragazzino avevo provato a suonare uno strumento ma all'epoca non ascoltavo veramente la musica quindi abbandonai, ma sto ripensando di provare la chitarra.\n\nPer quanto riguarda gli sport non sono uno sportivo, anche se tra amici ho giocato a volte a calcio o a pallavolo, non mi fanno impazzire. Preferisco ping pong e mi sarebbe sempre piaciuto provare a imparare il tiro con l'arco!\n\nNon so cos'altro aggiungere, non penso di essere un individuo tanto unico e che ci siano molti altri con i miei stessi hobby o passioni ma purtroppo non ci sono mai incappato, perciò spero di rompere questa situazione con questo post! \nSpero che magari qualcuno cerchi qualche parola chiave da me menzionata e trovi questo post perciò non farti problemi a contattarmi anche a mesi passati.\n\nDi carattere sono un tipo introverso e riservato, ma mi rendo conto della piacevolezza di condividere una passione in compagnia, contattatemi in DM o nei commenti :)",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1jmqyz9/alla_ricerca_di_amici_con_interessi_in_comune/"
    },
    {
        "id": "1jmyjzh",
        "author": "Alchimista95",
        "title": "Giovani imprenditori",
        "content": "Sono un giovane commercialista, vorrei conoscere giovani imprenditori per confrontarci su temi aziendali / espandere il proprio network.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1jmyjzh/giovani_imprenditori/"
    },
    {
        "id": "1jmqou4",
        "author": "Kikto_jkk",
        "title": "Mio padre chiede dove andare ad ascoltare musica Rock live a torino",
        "content": "",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1jmqou4/mio_padre_chiede_dove_andare_ad_ascoltare_musica/"
    },
    {
        "id": "1jmmam6",
        "author": "BroqueviNEGAR",
        "title": "Am I cooked?",
        "content": "I'm an international student I'm applying for the University of Turin for the program economics finance and data sciences. \nI'm done with my SATs, hate me for this but I didn't know that for English TOLC E exam there will be limited seats for online exam. \n\nMy university deadline is 30th April for submitting all the documents and the next seat available for the English TOLC E exam is 6th May😭😭. Am I really cooked??? I know I should've been more careful and I cannot risk losing another year of my academic studies. Is there any other way or solution that you guys can help me out with.",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1jmmam6/am_i_cooked/"
    }
]