[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 7,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 108,
        "comments": 335,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mougvq",
        "author": "HallConscious9108",
        "title": "Netflix is in a slump",
        "content": "Feels like almost all the really good shows have been coming out on Prime or Apple TV lately \n\nFeels like content slop on the home page \n\nNetflix used to be the crème de la creme \n\nWhat happened? ",
        "upvotes": 32,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1mougvq/netflix_is_in_a_slump/"
    },
    {
        "id": "1moq875",
        "author": "OCapalot14",
        "title": "Best Netflix Shows of all time",
        "content": "Stranger Things\n\nDark\n\nBlack Mirror\n\nBoJack Horseman\n\nOzark\n\nArcane\n\nCobra Kai\n\nHaunting of Hill House\n\nYou\n\nOrange is the New Black \n\nSex Education \n\nOuter Banks\n\nWednesday \n\nMindhunter \n\nSquid Game\n\nBridgerton\n\nGinny &amp; Georgia \n\nLupin\n\nWeak Hero\n\nNever Have I Ever \n\nAlice in Borderland \n\nBeef\n\nThe Crown\n\nNarcos \n\nQueen’s Gambit \n\nMoney Heist\n\nUmbrella Academy \n\nOne Piece (Live action)\n\nBlue Eye Samurai \n\nPeaky Blinders \n\nHouse of Cards \n\nLove Death + Robots \n\nNot in any particular order btw\n\n\n",
        "upvotes": 34,
        "comments": 103,
        "media": null,
        "permalink": "/r/netflix/comments/1moq875/best_netflix_shows_of_all_time/"
    },
    {
        "id": "1mofhb7",
        "author": "indiewire",
        "title": "IndieWire names Guillermo del Toro's \"Frankenstein\" as one of 53 of their most anticipated fall movies.",
        "content": "",
        "upvotes": 50,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1mofhb7/indiewire_names_guillermo_del_toros_frankenstein/"
    },
    {
        "id": "1moswbi",
        "author": "heiresss",
        "title": "Netflix raises monthly cost for Australian users",
        "content": "“Netflix has raised its membership prices once more.\n\nAccount holders on Netflix’s two standard plans will now be slogged an extra $2 per month, with the cheapest Netflix option, ‘Standard with ads,’ rising from $7.99 to $9.99 per month.\n\nThe standard, ad-free plan will rise from $18.99 to $20.99 per month. \n\nNetflix’s premium plan will see the steepest increase, up $3 per month from $25.99 to $28.99.\n\nThere’s also been a $1 price hike across the board to add an extra member to any of the plans.\n\nNetflix last increased its prices in May 2024 – before that, the premium plan was $22.99, meaning users on this plan have seen a 26 percent price increase over the past 15 months.”\n\nSource: News.com.au\nhttps://www.news.com.au/entertainment/tv/streaming/netflix-raises-monthly-cost-for-australian-users/news-story/a1c2c17c0a4e6a16912ef5e1fe98f6fd\n\nDefinitely considering cancelling ahead of this going into effect.",
        "upvotes": 8,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1moswbi/netflix_raises_monthly_cost_for_australian_users/"
    },
    {
        "id": "1mowfpb",
        "author": "ClementTrandon",
        "title": "Shows similar to YOU",
        "content": "I finished the show, and am just wrapping up with Dexter and want to find a show similar to YOU that holds an inner monologue and at least somewhat focuses on things similar to you, it doesn’t have to be exact but I’ve been binging all the mainstream shows like it and want to find some more stuff to watch.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mowfpb/shows_similar_to_you/"
    },
    {
        "id": "1morcm5",
        "author": "Mental_Low_7944",
        "title": "Do you ever feel like time is moving quickly now? That could be because of how long your favorite shows have been taking to come out with new seasons.",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1morcm5/do_you_ever_feel_like_time_is_moving_quickly_now/"
    },
    {
        "id": "1morjid",
        "author": "Longjumping_Wolf_781",
        "title": "My Oxford Year Movie vs. Book",
        "content": "Did anyone else read the book and LOVE it but then HATE the movie? I mean practically everything was changed. First and foremost - having a degree in literature doesn’t qualify her to be a financial analyst? I guess technically she could have done internships or whatever BUT STILL I felt like a big part of the beginning of the book was that it’s her first time studying literature at a higher level and that was how the contrast was created between her studies at Oxford vs. her career in DC. I feel like everything that was good was taken out. Every scene was either changed or replaced entirely by a new scene. A lot of the characters were portrayed different in the movie from how they were written. I never expect an adaptation to be spot on but if they really wanted to change everything then why even call it an adaptation at that point? Just write a different story!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1morjid/my_oxford_year_movie_vs_book/"
    },
    {
        "id": "1movqwz",
        "author": "JuniorDebt4632",
        "title": "Looks so good.",
        "content": "Look at this amazing viewable space on Netflix Mobile. It feels like I can breathe. Not feeling claustrophobic at all.\n\nAren't we glad we have such an intelligent company making it so we can easily see our viewing options? \n\nKudos to you Netflix.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1movqwz/looks_so_good/"
    },
    {
        "id": "1mnu8dy",
        "author": "L0v3_1s_War",
        "title": "HUNTR/X’S ‘GOLDEN’ from ‘KPOP Demon Hunters’ Hits No. 1 on Billboard Hot 100",
        "content": "",
        "upvotes": 158,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1mnu8dy/huntrxs_golden_from_kpop_demon_hunters_hits_no_1/"
    },
    {
        "id": "1moua4d",
        "author": "Southernbeard26",
        "title": "Shared account with multiple screens purchased needs code?",
        "content": "Second day in a row I’ve had to ge tmy code on a shared account to access Netflix. We have a multi screen account…is this an every day thing now? Wtf Netflix. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1moua4d/shared_account_with_multiple_screens_purchased/"
    },
    {
        "id": "1mot5vz",
        "author": "Jaded-Fisherman4803",
        "title": "3 Underrated Netflix Shows You Need to Watch in August 2025",
        "content": "Good Girls (2018-2021)\n\nWarrior (2019-2023)\n\nLove (2016-2018)",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mot5vz/3_underrated_netflix_shows_you_need_to_watch_in/"
    },
    {
        "id": "1moen2v",
        "author": "Large_Basket_5440",
        "title": "One Hundred Years of Solitude - second part?",
        "content": "I have really enjoyed the first part of the series but when I looked online, I couldn’t find any information around when (or if) will be the second part aired. Did I miss any news or there were no news around the series? \n\nI had really low expactations about the series as a huge book fan before watching - but now I am desperate for the next part. \n",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1moen2v/one_hundred_years_of_solitude_second_part/"
    },
    {
        "id": "1moejzy",
        "author": "guesthost1999",
        "title": "Anyway to see if you watched a movie?",
        "content": "I got half way through a movie before everything came back to my head and realized I watched it already.\n\nWould be great if there was a way to show if/when a show was watched previously.",
        "upvotes": 4,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1moejzy/anyway_to_see_if_you_watched_a_movie/"
    },
    {
        "id": "1moqa4f",
        "author": "PositiveAd537",
        "title": "Macbook screen flickering",
        "content": "Just got a new macbookOS which was used before first time watching netflix on it and my screen flickers only on Netflix I readjusted the mouse many times it works but it doesnt solve the problem fully it just happens every once in awhile so I have to keep changing the mouse size how can I solve it fully? And what may be causing the problem?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1moqa4f/macbook_screen_flickering/"
    },
    {
        "id": "1mofw7o",
        "author": "Realistic-Relief3865",
        "title": "Just finished the watcher",
        "content": "I honestly don’t know how I feel about it. A part of me wants to hate it because it just felt so messy and unsatisfying by the last episode.  I saw a lot of people being annoyed that the watcher wasn’t revealed but i felt like it was pretty obvious that it was the neighbours, especially when you consider them being in the tunnel, their group about conserving the houses, everyone getting letters once they have a bad interaction with them, and the fact that the man is a librarian and they mentioned theres a typewriter. One thing that annoyed me badly was the tunnels, they were so desperate to find out but yet didn’t go and explore the tunnels better themselves, the answer literally could have been revealed by then. Another thing that annoyed me was the fact that when the two ladies invited Nora over, she hears the thuds, left looking terrified, just to never bring that up again. I really wanted to like it and I felt like it could’ve been great if they actually properly worked on the storyline. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mofw7o/just_finished_the_watcher/"
    },
    {
        "id": "1moo3h8",
        "author": "graemeisverytired",
        "title": "Filming The Thursday Murder Club on Netflix felt more like a college reunion than working, according to Helen Mirren and Pierce Brosnan",
        "content": "“But you know the great thing about Thursday Murder Club,” explained Helen Mirren. “Was that we all kind of knew each other. I mean, I’d worked with Ben – Sir Ben, Sir Ben – in the theater when we were in, like, in our early 20s. So we knew each other really, really well.”\n\nMore: https://www.thepopverse.com/movies-the-thursday-murder-club-cast-helen-mirren-pierce-brosnan-college-reunion-vibes-jimmy-fallon-the-tonight-show",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1moo3h8/filming_the_thursday_murder_club_on_netflix_felt/"
    },
    {
        "id": "1momrc3",
        "author": "Tobermory-",
        "title": "Low quality on Netflix app",
        "content": "For some reason this past month or so the Netflix app on my phone has been playing at no more than 720p for 99% of the time. Ive checked in the app settings and I’ve got it on streaming in highest quality and highest data usage, my WiFi is around 800mbps, and it’s streams in perfect 1080p on every other device I watch on through the same account. I’m on an iPhone 11 so I don’t know if that’s the issue but otherwise I’m stumped, does anyone have an answer?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1momrc3/low_quality_on_netflix_app/"
    },
    {
        "id": "1mo9fkx",
        "author": "YisusButAtWhatCost",
        "title": "So i finally start Dexter..",
        "content": "After seeing most of the show through Youtube Shorts for at least a year, i finally open netflix and start seeing it, even if i saw most major spoilers, i still find myself entertained watching it, can’t comprehend how didn’t notice this show back years… still, is worth it",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1mo9fkx/so_i_finally_start_dexter/"
    },
    {
        "id": "1moj85z",
        "author": "omerhaim",
        "title": "Installing Netflix on iOS 15",
        "content": "Hey\nI had to erase my son iPad that had Netflix installed on it, now I can’t install Netflix the minimum iOS version is higher. 16 or 17 \nAnything I can do to get it installed?\nTried safari, it directs to the App Store ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1moj85z/installing_netflix_on_ios_15/"
    },
    {
        "id": "1mohxvc",
        "author": "Available_Clothes_18",
        "title": "Glitchy when \"Use graphics acceleration when available\" turned on",
        "content": "Hi, I use Google Chrome on my laptop, and when the \"Use graphics acceleration when available\" settings is turned on, Netflix glitches when in fullscreen. The screen is kind of \"jumpy\"  it makes it unwatchable.\n\nThe problem is, if I turn off the setting in Chrome, then it's Youtube that glitches in fullscreen, and some websites like Canva stop working properly.\n\nIm tired of having to turn it on/off all the time. Is there a definite way to make Netflix work properly on Google Chrome while still having the setting turned  on?  And without having to use another browser.\n\nBy the way this setting is in Chrome Settings &gt; System &gt; Use graphics acceleration when available\n\nthanks",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mohxvc/glitchy_when_use_graphics_acceleration_when/"
    },
    {
        "id": "1momgpo",
        "author": "RestlessRhys",
        "title": "Is it worth watching Wednesday season 2?",
        "content": "I liked season 1 but I'm two episodes into season 2 and i have no interest so far, does season 2 have anything worth continuing for? Or should i skip it and watch something else instead?\n\n(Obviously no spoilers as I might return to it in future)",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1momgpo/is_it_worth_watching_wednesday_season_2/"
    },
    {
        "id": "1mo9akg",
        "author": "Beautiful_Belt4306",
        "title": "Odd sound issues",
        "content": "Netflix makes sound when you click on an account, the boot up sound if you will. But, once you click on a show, nothing. I've tried closing the app via the \"Get Help\" button, also changed off the HDR selection in hopes of that changing it. I'm using the RCA Smart TV app, no third-party speakers. Every other app plays sounds perfectly. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mo9akg/odd_sound_issues/"
    },
    {
        "id": "1mosukj",
        "author": "Slight-Arrival5985",
        "title": "Train wreck… Netflix lies about the “real” project x.",
        "content": "The real project x happed in 2008 by Corey Worthington he posted it to MySpace massive riot in Melbourne Australia \n\n\nAlright — here’s the full story of Corey Worthington’s party, which became infamous in Australia and later tied to the inspiration for Project X.\n\n\nThe Lead-Up\n\t•\tDate: Saturday, 12 January 2008\n\t•\tLocation: Narre Warren, a suburb of Melbourne, Victoria, Australia\n\t•\tAge: Corey was just 16 years old at the time.\n\t•\tHis parents went away for the weekend, leaving Corey at home.\n\t•\tHe decided to throw a small gathering — but made the critical mistake of posting the details publicly on MySpace and sharing it through SMS.\n\t•\tWord spread quickly — strangers started showing up, many bringing their own friends.\n\n\nThe Party\n\t•\tBy evening, about 500+ people had descended on the street.\n\t•\tThe crowd spilled onto the front yard and road, with music blasting and alcohol flowing.\n\t•\tNeighbours called police as noise and chaos grew.\n\t•\tPeople began damaging cars, throwing bottles, and smashing property.\n\t•\tPolice cars arrived, but bottles and other objects were thrown at them — making the scene dangerous to approach.\n\t•\tThe riot squad had to be called in, and a police helicopter was deployed.\n\n(There was no plan unlike the 2012 copycat of the movie that was inspired by these events)\n\nThe Aftermath\n\t•\tThe damage bill for the street was estimated at tens of thousands of dollars.\n\t•\tCorey’s parents came home to find their neighbourhood wrecked.\n\t•\tBut the most famous moment wasn’t the party itself — it was Corey’s TV interview with Channel 9’s A Current Affair.\n\t•\tWearing yellow sunglasses and a fur-lined hoodie, Corey refused to apologise.\n\t•\tWhen asked to take off his sunglasses, and say apologise he replied: “I’ll say sorry but I’m not taking of my glasses”.”\n\n\t•\tHis laid-back, almost cocky attitude made him instantly notorious — he was seen as either a teenage legend or a reckless brat, depending on who you asked.\n\nThe Cultural Impact\n\t•\tCorey was offered money to host other parties, became a short-lived celebrity, and even entered the reality show Big Brother Australia.\n\t•\tHis party became part of Aussie pop culture — referenced in memes, comedy, and discussions about internet-fuelled chaos.\n\t•\tMany say the attitude and scale of Corey’s party helped inspire the 2012 Hollywood film Project X, although the movie exaggerated everything to absurd levels.\nThat caused many others to try to copy it and none of them could ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1mosukj/train_wreck_netflix_lies_about_the_real_project_x/"
    },
    {
        "id": "1mnp3fl",
        "author": "sirius_2025",
        "title": "Wednesday first episode puppy review",
        "content": "Netflix owes my 5 month old puppy an apology for being so scary! It should come with a puppy rating 😅 He was on edge every time he heard a bird for the rest of the episode ",
        "upvotes": 36,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/y9i08tbufgif1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1mnp3fl/wednesday_first_episode_puppy_review/"
    },
    {
        "id": "1moc090",
        "author": "Disastrous_Bedroom60",
        "title": "Finding a series",
        "content": "Hi everyone (delete if not allowed ) I remember watching a series on netflix maybe as far back as 2015. It was a series about food and why certain food became famous in certain places. For example the first 2 episodes consisted of NY and how the water became integral to the rise in falafels (i think) and the next episode was how a girl rescued the original sourdough mix during the san Francisco fire. It also gave a brief history on how the cities originated. I've tried everything, even going back through my viewing history with no luck. I'm beggining to think I've imagined this ! Any help would be appreciated",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1moc090/finding_a_series/"
    },
    {
        "id": "1mob6ki",
        "author": "Capable_Transition97",
        "title": "Help me find a show",
        "content": "All I remember about it is the character dynamics so the main character is a blonde boy who uses a sword he also has a master that turns into a monster in like the later half of the first season the main heroine is a girl with brown hair who uses magic and also start to date one of the main villains that turned good he also killed the girls master  so now it’s this low triangle between the mc main heroine and bad guy it had a second season that ended on a cliffhanger with them entering a new realm also pretty sure the bad guy uses a ice sword or some sorta ice power ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mob6ki/help_me_find_a_show/"
    },
    {
        "id": "1mo0n1n",
        "author": "ImoutoCompAlex",
        "title": "I see very few people discussing the upcoming Japanese show, Final Draft on Netflix so I created a subreddit for it: r/FinalDraft",
        "content": "If you're a fan of Physical 100 or Culinary Class Wars, Japan decided to make their own Athletic competition show featuring 25 Athletes engaged in a series of Physical challenges for a cash prize, similar to Korea's Physical 100.\n\nI see very few people talking about this show so I made a subreddit for it: r/FinalDraft. We're putting up discussion threads in a few hours when the show airs. Come discuss it with us!",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mo0n1n/i_see_very_few_people_discussing_the_upcoming/"
    },
    {
        "id": "1mo3m6o",
        "author": "ShinyRockAid",
        "title": "Restaurant War Thailand",
        "content": "I’m really loving this show A LOT. I hope it will be popular like the Culinary Class Wars. Anyway, asking it because I haven’t seen any blogs or lists on the internet, so I’d like to know the locations of the contestants’ food stalls/restaurants I would really love to visit them as soon as I get back in Thailand. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mo3m6o/restaurant_war_thailand/"
    },
    {
        "id": "1montwv",
        "author": "DepartmentAdept5045",
        "title": "Shady business practice.",
        "content": "Can we talk about how Netflix is being shady af, and releasing one season of a show over a few months, so that people have to pay for multiple months of a subscription? It’s really starting to irritate me. They just did it with Wednesday, and they’re about to do it in a few months with stranger things. They stretch out EIGHT EPISODE SHOWS, over 3 months so that people who would usually watch the show and then cancel their subscription HAVE to sub for more months to get the full season. I wouldn’t even be mad if they released it like one episode a week because that’s how live tv has worked forever, but no, this way 8 episodes would only be 2 months worth of subscriptions and they wouldn’t be milking another month out of you. I’ve literally ALWAYS had my subscription, and don’t cancel it, so I don’t even care about the money aspect, I’m just irritated I have to wait ridiculous amounts of time to finish one season of a show. Because they wanna squeeze people for all they possibly can. Sorry I’m just annoyed and hate cliff hangers. ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1montwv/shady_business_practice/"
    },
    {
        "id": "1mo5o62",
        "author": "riosunset",
        "title": "New on Netflix",
        "content": "Just finished Department Q which I loved and binged in 2 days. Any recommendations for anything similar / new? \nI seem to be stuck in limbo of everything I like beibgbin mid season break / end of season\nThe rookie. 911. Greys anatomy. Criminal minds. \nFinished station 19 recently and sad it’s over. ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1mo5o62/new_on_netflix/"
    }
]