[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 486,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1haf6gm",
        "author": "netflix",
        "title": "Netflix received 36 Golden Globes nominations!\n\nCongratulations to Emilia Pérez, Nobody Wants This, Squid Game, Monsters: The Lyle and Erik Menendez Story, Maria, Ripley, Griselda, Black Doves, The Gentlemen, The Diplomat, A Man on the Inside, and Glen Powell who scored his first-ever nomination.",
        "content": "",
        "upvotes": 29,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1haf6gm/netflix_received_36_golden_globes_nominations/"
    },
    {
        "id": "1hl0d6u",
        "author": "parkix",
        "title": "How \"Carry On\" could have ended in 5 minutes",
        "content": "Receives random text: \"Put the earbud in, Ethan.\"\n\"Yeah, no. This is sketchy. I’ll report it to my boss, have the cops detain the woman who gave me the earbud, and we’ll investigate what’s going on instead of blindly following orders from a random text.\"\n\nMovie ends. Roll credits.\n\nQuite amazing how easily people are entertained.\n\n\n",
        "upvotes": 456,
        "comments": 135,
        "media": null,
        "permalink": "/r/netflix/comments/1hl0d6u/how_carry_on_could_have_ended_in_5_minutes/"
    },
    {
        "id": "1hkobca",
        "author": "TheExpressUS",
        "title": "Squid Game creator 'sick' of Netflix hit and 'begs for no more calls' about the show",
        "content": "",
        "upvotes": 500,
        "comments": 71,
        "media": null,
        "permalink": "/r/netflix/comments/1hkobca/squid_game_creator_sick_of_netflix_hit_and_begs/"
    },
    {
        "id": "1hl3isn",
        "author": "_GenderNotFound",
        "title": "Is Hot Frosty meant to be this bad? ",
        "content": "Help, my mom is subjecting me to this garbage. But for real, was it made to be bad? I hate it so much. I also hate how rationality does not exist in movies. \n\nIf the scarf is keeping him alive, he can take it off, turn into an ice sculpture, then everyone will see that he's a snowman like he says. I swear, the main lady in this movie is the only one who has sense. I love her, with her \"You can't love someone right away. It takes time and knowing a person.\"",
        "upvotes": 13,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1hl3isn/is_hot_frosty_meant_to_be_this_bad/"
    },
    {
        "id": "1hl73jd",
        "author": "No_Walrus4306",
        "title": "Is “you” worth watching?",
        "content": "I have lots of free time during Christmas and I’m looking for a good show on Netflix. Someone recommended me “you” and he told me it’s as good as breaking bad but after watching a few episodes I feel like it’s a waste of time. Did you guys find it good?",
        "upvotes": 3,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1hl73jd/is_you_worth_watching/"
    },
    {
        "id": "1hkh6dx",
        "author": "Robemilak",
        "title": "‘GLASS ONION: A KNIVES OUT MYSTERY’ released 2 years ago today. How did you like it?",
        "content": "",
        "upvotes": 199,
        "comments": 95,
        "media": null,
        "permalink": "/r/netflix/comments/1hkh6dx/glass_onion_a_knives_out_mystery_released_2_years/"
    },
    {
        "id": "1hl1syb",
        "author": "gesunheit",
        "title": "Ella Enchanted (2004) is leaving soon, if you want a cozy Princess Bride/Live Action Shrek movie for the holidays!",
        "content": "This is definitely one of my favorite childhood comfort movies. I feel like it’s a bit lesser known, it’s a delightful medieval fairytale adventure with an extremely charming Anne Hathaway, and Cary Elwes villain! The campy humor of medieval anachronisms like wooden escalators and Crockery Barn wedding registries reminds me a lot of the humor in Shrek. Plus, it’s a quick hour and a half movie which is a genre I feel is harder to find these days. Highly recommend as a comforting holiday watch!",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hl1syb/ella_enchanted_2004_is_leaving_soon_if_you_want_a/"
    },
    {
        "id": "1hl5qnb",
        "author": "ariel_the_mermayd",
        "title": "harper and will",
        "content": "why doesn’t harper do her freaking hair? the whole movie, her hair is in a weird clip looking like she rolled outta bed, then complains when she’s misgendered / feels ugly. why not do her hair?!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hl5qnb/harper_and_will/"
    },
    {
        "id": "1hl5odl",
        "author": "Gravey4rd",
        "title": "Arcane: Viktor inspired by Ultron?",
        "content": "I was watching the new Arcane season and,\n\nThe mask… the robot army… the evolution???\nCheck out my conspiracy theory:\n\nWhat’s your thoughts?\n\n* https://ibb.co/WVxwYXb\n* https://ibb.co/kc7c7Rf",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hl5odl/arcane_viktor_inspired_by_ultron/"
    },
    {
        "id": "1hl7xky",
        "author": "MMsPrincess",
        "title": "I NEED A SEASON 2 OF I AM NOT OKAY WITH THIS PLEASEE",
        "content": "I have been waiting for season 2 for years now!!!!! I need season 2. I LOVE LOVE LOVE THIS SHOW PLEASE!!!!!!!!!!!!!!!!!!!!!!!!!!!! Netflix please I'm begging you. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hl7xky/i_need_a_season_2_of_i_am_not_okay_with_this/"
    },
    {
        "id": "1hl4b6g",
        "author": "AWat48",
        "title": "Single All The Way - sevens removed? ",
        "content": "I love this movie, but I feel like they cut an after credit scene sometime from when it was originally released to now. I distinctly remember 3 scenes not in the cut on Netflix currently: \n\n1. The plant store opening \n2. The book sequel being a hit \n3. The ski instructor/trainer moving to LA\n\nDid I make all of this up in my head? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hl4b6g/single_all_the_way_sevens_removed/"
    },
    {
        "id": "1hkpli9",
        "author": "djbeardo",
        "title": "Gifting Netflix for parents - suggestions to watch?",
        "content": "My parents have never had Netflix but they love watching television, so I think it’ll be a good gift. \n\nI’d like to give them a watch list to get started, but I’d appreciate some help on recommendations. \n\nThey are in their 70s and like all the big CBS procedurals. Big NCIS fans, Tracker, Magnum PI, Blue Bloods, all the FBIs. They really liked Reacher and Yellowstone. I tease them that if there’s someone running around with a gun, they watch it. They don’t like sci-fi or fantasy. 30 minute sitcoms are not their thing either. \n\nI think they’d be into The Diplomat. Any other ideas?",
        "upvotes": 8,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1hkpli9/gifting_netflix_for_parents_suggestions_to_watch/"
    },
    {
        "id": "1hkc7gm",
        "author": "Lovepeacepositive",
        "title": "Ronny Chieng special so phenomenal!! ",
        "content": "This guy f-ing killed it.  His audience couldn’t even keep up with his one liner references that were so clever.  After I watched it, I had watched his special from 2022 and you can tell he did not hold back this time around.  I mean he was honest about how he was there to take the audiences money.  He was honest about how American culture is so twisted with money when it comes to their own parents and America.  He made so many important points that people in general should really reflect on.  I love this guy - reminds me so much of George Carlin.  I had no idea who he was but I tend to watch what’s in the top 10 and this is.  Not as heart felt as Jamie Foxx’s special but clearly a different story there.  Ronny paid tribute to his dad at the end and I had some tears but I hadn’t laughed that hard in so long.  I hope he does more specials/ tours - before he decides to peace out. I’d pay to see him to make me laugh.    I wanted to see who else watched and everyone’s thoughts were.  Did you love it as much as me or were you insulted like some people are by comedians these days? ",
        "upvotes": 65,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1hkc7gm/ronny_chieng_special_so_phenomenal/"
    },
    {
        "id": "1hkfkpi",
        "author": "nyknickspodcast",
        "title": "I’ve seen 10 different pages post about Carry-On on Facebook",
        "content": "They all say it’s a 10/10 movie and compare it to Die Hard.\n\nNetflix is paying people to do this right? No one on facebook is saying anything bad about this mediocre movie? I’m not buying it.",
        "upvotes": 35,
        "comments": 97,
        "media": null,
        "permalink": "/r/netflix/comments/1hkfkpi/ive_seen_10_different_pages_post_about_carryon_on/"
    },
    {
        "id": "1hkzuyj",
        "author": "LeonardBr0_NoCapri0",
        "title": "The Accident, awful but couldn't stop watching",
        "content": "Has anyone else got hooked on \"the accident\" and hated every minute of it? It was so nonsensical but I had stick around to see what happened next. I chose this series because lately I have been a fan of foreign movies and series over the typical American ones, but this one was not it!\n\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hkzuyj/the_accident_awful_but_couldnt_stop_watching/"
    },
    {
        "id": "1hky87k",
        "author": "ReksTheCookie",
        "title": "Biggest Heist Ever",
        "content": "I just watched this and am baffled by the whole witness protection thing. They allude to there being more to the story and conspiracy. Anybody knows what theories are out there regarding why they were sentenced so little time and then offered witness protection? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hky87k/biggest_heist_ever/"
    },
    {
        "id": "1hl3kcd",
        "author": "Zikari82",
        "title": "Are you expecting Squid Game S2 to be good?",
        "content": "Seeing the repeated posts of the creators, not wanting ro continue or originakly not even want to do S2, I'm thinking we might get a Joker 2 scenario here. The unexpected sucess of the first season and Netflix attempt to milk this as a franchise obviously conflicted with the original message. So if I want to be done with that I would make sure nobody likes Season 2 intentionally. Thoughts...",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1hl3kcd/are_you_expecting_squid_game_s2_to_be_good/"
    },
    {
        "id": "1hl4njy",
        "author": "Luckyduck84135",
        "title": "Wonder if Netflix is gonna be able to handle the NFL on Xmas day?",
        "content": "I dont have high hope's, not gonna lie. They failed miserably during the Tyson, Paul fight. Loading screen freeze, buffering, terrible picture quality or just failing to load all together. I really hope they got their 💩 together or thier going to lose subscribers in droves and bye bye stock price. ",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1hl4njy/wonder_if_netflix_is_gonna_be_able_to_handle_the/"
    },
    {
        "id": "1hkpcen",
        "author": "1stTinyPanther",
        "title": "Belly Laugh",
        "content": "Hi all, please suggest a good show or movie (I don’t care if it’s new or old) that will have me laughing throughout. I don’t remember the last time I had a good belly laugh and really need one. Suggestions for shows that aren’t vulgar are appreciated.",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hkpcen/belly_laugh/"
    },
    {
        "id": "1hl2yzm",
        "author": "-deetjay-",
        "title": "Can Netflix Avoid Glitches in Its Christmas Day NFL Broadcasts?",
        "content": "Link should be free to read.  Interesting article explaining the issues that happened during the Paul-Tyson fight and how Netflix is preparing for future live events.  ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hl2yzm/can_netflix_avoid_glitches_in_its_christmas_day/"
    },
    {
        "id": "1hky7ja",
        "author": "ivy-reddit",
        "title": "Issue Using My Friend's Account",
        "content": "Hi!\n\nI'm currently in UK and my friend (whose account I use) is in India. Initially, I was able to use her account just fine and was able to log into her other account as she sometimes shares with her sister.\nBut this time around, I was unable to log in despite her renewing the plan and sending me the correct ID and password. \nI tried logging into my phone as well as my laptop but Netflix simply asks me to choose a plan to continue. Can someone help me out? \nThanks! x\n",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hky7ja/issue_using_my_friends_account/"
    },
    {
        "id": "1hkrxf1",
        "author": "sashanichole01",
        "title": "Question about NFL live games streaming. ",
        "content": "Will the Christmas Day NFL live games be available on\nplayback/streaming for those of us who can't watch live?\nSpecifically the Texans game (Beyoncé's half time performance)? Im unable to find this information anywhere so l'm hoping someone here will know.  Thanks in advance. ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hkrxf1/question_about_nfl_live_games_streaming/"
    },
    {
        "id": "1hkwhsi",
        "author": "EarlessBanana",
        "title": "How to Stop \"What did you think of...\" Emails?",
        "content": "My subscribing email account keeps getting \"What did you think of \\[recently watched program\\]?\" rating request emails for the programs watched by one specific profile (the first one, which I assume it regards as the \"master\" profile).\n\nI've gone to the \"unsubscribe\" link (the same as what's available via the Notification Settings menu in account preferences) and deselected everything except Account Updates (security alerts, billing), but the emails keep coming.\n\nThis is a major nuisance as well as a privacy concern (even though it's reasonable for the registered email to have access to all profiles).\n\nThanks!",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hkwhsi/how_to_stop_what_did_you_think_of_emails/"
    },
    {
        "id": "1hkjpqw",
        "author": "kindlingpup",
        "title": "Is the Tales of Arcadia one of the most underrated Netflix originals?",
        "content": "I absolutely love this show trilogy, but I somehow never see or hear it mentioned when people talk about the best Netflix originals (usually being Stranger Things and Squid Games, which I also love).\n\nIs it because it has a source material? (Trollhunters 2015 book) But I would argue that couldn't have been that popular yet since the show came out a year later. Or it just didn't get a huge pickup?\n\nWhat are your thoughts on this show trilogy?\n\nhttps://preview.redd.it/411y8f4eak8e1.png?width=1012&amp;format=png&amp;auto=webp&amp;s=9698a208d567b88e57ebc1f1a362af3e87202313\n\n",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hkjpqw/is_the_tales_of_arcadia_one_of_the_most/"
    },
    {
        "id": "1hkonff",
        "author": "Quirky_Tension_8675",
        "title": "Steeler game Christmas day",
        "content": "Hi folks. Short and to the point. Can I sign up for Netflix watch the Steeler game and cancel right after the game? Thank you, Merry Christmas. I live in Sioux Falls SD.",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hkonff/steeler_game_christmas_day/"
    },
    {
        "id": "1hkg0ur",
        "author": "born_again_tim",
        "title": "Very Murray Christmas question",
        "content": "Ok I’m going to seem fucking crazy, but I could have sworn I once saw this movie a Bill Murray was talking to the disillusioned groom-to-be (Jason Swartzman) who told him that his fiancé had slept with his friend in a previous life and that was why they were fighting.\n\nDoes anyone remember that or am I crazy?!",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hkg0ur/very_murray_christmas_question/"
    },
    {
        "id": "1hkr5cj",
        "author": "OutsideFull3290",
        "title": "Brian and Katrina 🫨(Suits)",
        "content": "Suits S8:E13 \nOkay I don’t know how to feel about their relationship .First it seemed like an innocent friendship but then they started spending more time together ,late nights ,Getting food ,having lusting moments to nearly falling for each other . Make no mistake I do not agree with infidelity . Those passionate moments ,The perfume smelling ,sexual eye contact. Most importantly let’s not forget nearly kissing while holding the child ? But then I’m screaming at myself again because i feel their chemistry but Brian has a family and they both need to understand that . ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hkr5cj/brian_and_katrina_suits/"
    },
    {
        "id": "1hk0rq5",
        "author": "sukh345",
        "title": "Netflix not working in browsers ",
        "content": "I recently bought Netflix basic plan that is 1 screen with laptop, tv and mobile option to play.\n\nHowever, when i login Netflix on my laptop it doesn't play even if it plays after clearing cookies it doesn't play all shows just throws some random error everytime.\n\nIt works properly on my android ✅.\n\nDoesn't work in android browser &amp; iphone browser in desktop mode too.\n\nI know it's single screen , i only try to watch on 1 device at a time not on multiple.",
        "upvotes": 10,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1hk0rq5/netflix_not_working_in_browsers/"
    },
    {
        "id": "1hkcum9",
        "author": "Acrobatic-Painting22",
        "title": "Netflix not working on Chrome",
        "content": "https://preview.redd.it/ktsrqa7s2i8e1.png?width=1902&amp;format=png&amp;auto=webp&amp;s=8645a6030cfab3e60f411df0d3ab6fd7a066d2bb\n\nSo I have been getting this error since 3 days and I can't watch Netflix on chrome, when I asked the technical support person, they just told me to switch to another browser for the time being since its an issue from chrome's side.\n\nI think there should be a better solution than just switching.\n\nPlease do help",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hkcum9/netflix_not_working_on_chrome/"
    },
    {
        "id": "1hk773x",
        "author": "brc55",
        "title": "Aaron Rodgers documentary-what’s in his coffee/protein shake?",
        "content": "Anyone know what the ingredients are in Aaron Rodgers coffee/protein shake? His chef in the third episode makes it for him and he adds some kind of black tar to it, collagen, and a few other things. ",
        "upvotes": 2,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1hk773x/aaron_rodgers_documentarywhats_in_his/"
    },
    {
        "id": "1hkayqy",
        "author": "CherryFlavouredWine",
        "title": "Confused? ",
        "content": "I think I’m being simple here but, which Netflix plan allows more than 15 downloads per month? \nI just don’t want to upgrade and then still not be able to download more as that’s all I want. I’m guessing it’s the options without ads but, yeah. \nI can’t seem to find a straight answer on their website. \nI’m uk for reference by the way. \n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hkayqy/confused/"
    }
]