[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 12,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1olf332",
        "author": "whatchagonnadoelbert",
        "title": "Netflix \"leaking\" my wife's viewing behavior into my profile",
        "content": "My wife and I have our own separate profiles.  I am the account holder, FWIW.  My wife watches a LOT of K-dramas.  I watch no K-dramas.  I watch no Asian-based content.  A lot of the stuff my watches from her profile end up as suggestions and \"watch next\" on my profile, and this HEAVILY skews what Netflix thinks I'm interested in. \n\nHas anyone else experienced this and actually convinced someone at Netflix to do something about it?  The one agent I spoke to several months ago said, \"Oh, your wife must be watching K-dramas using your profile.\"  He refused to believe that there could be a problem with Netflix's system.  I've seen my wife use Netflix and she is always using her profile.",
        "upvotes": 120,
        "comments": 62,
        "media": null,
        "permalink": "/r/netflix/comments/1olf332/netflix_leaking_my_wifes_viewing_behavior_into_my/"
    },
    {
        "id": "1olrq6q",
        "author": "RealAccount2024",
        "title": "I don’t mind the ads on Netflix but…",
        "content": "why do they have to be so loud?\n\nLiterally the last ad break I had at least doubled the decibel level. \n\nI get they want you to pay attention to them but that’s some gorilla tactics. ",
        "upvotes": 13,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1olrq6q/i_dont_mind_the_ads_on_netflix_but/"
    },
    {
        "id": "1oljr8m",
        "author": "Cxinthechatnow",
        "title": "After watching a House of Dynamite, I realized the guys carrying the nuclear football probably have one of the most boring jobs in the world",
        "content": "Think about it — you’re probably a high-ranking officer, one of the best of the best, trusted enough to literally follow the president everywhere with a bag that could end the world.\n\nAnd then… nothing ever happens.\n\nDay after day, year after year, you just carry this mysterious briefcase around, always on alert but never actually doing anything. You train for the most extreme scenario imaginable, but your actual job is to wait.\n\nIt’s like being on the world’s most stressful standby mode. You’re part of history, but your daily life is probably just… walking, standing, and waiting for something that hopefully never happens.\n\nKinda wild when you think about it.",
        "upvotes": 16,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1oljr8m/after_watching_a_house_of_dynamite_i_realized_the/"
    },
    {
        "id": "1olr9yw",
        "author": "Ok_Process2503",
        "title": "Annoying Episode Releases",
        "content": "Anyone else frustrated with Netflix adding more and more slow release content? \n\nThey add the episodes slowly and only say the amount of episodes that are up already. For example, at first, Love in the Clouds said it only had 22 episodes, when really there are now 36 episodes. Further, the last episode is scheduled to come out today but it’s not out yet (it’s already about noon ET) and I’m not sure what time of day it will be out.\n\nIt feels like they are just messing with us now 😑",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1olr9yw/annoying_episode_releases/"
    },
    {
        "id": "1old1je",
        "author": "livewithoutwarninggg",
        "title": "Is Animal Kingdom worth watching?",
        "content": "I’ve watched 3 episodes so far. And it’s okay it’s not the best show I’ve seen. Does it get better? Should I continue watching. I’ve seen a lot of people talking about it so I decided to check it out. ",
        "upvotes": 49,
        "comments": 79,
        "media": null,
        "permalink": "/r/netflix/comments/1old1je/is_animal_kingdom_worth_watching/"
    },
    {
        "id": "1olms4w",
        "author": "Crow_Whisperer",
        "title": "Fun suggestions to change algorithm",
        "content": "Hi everyone! I have been really into crime and murder documentaries, as well as serious dramas, and now I can't find anything else to watch. I have tried looking up a few lighter shows or movies to watch but it hasn't really changed my selection. It's the same 20ish shows and movies and I'm so tired of it. What are fun, silly, and/or lighthearted titles I can flood my search bar with? Thank you in advance!",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1olms4w/fun_suggestions_to_change_algorithm/"
    },
    {
        "id": "1olt7ep",
        "author": "OverPotato2322",
        "title": "Netflix Exploring Warner Bros. Discovery Bid, Hires Bank for M&amp;A Offer",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1olt7ep/netflix_exploring_warner_bros_discovery_bid_hires/"
    },
    {
        "id": "1olqu7b",
        "author": "Spiky-Penguin2023",
        "title": "Terry Silver (Karate Kid 3 &amp; Cobra Kai) vs Noah Flynn (The Kissing Booth)",
        "content": "Both Terry Silver from The Karate Kid 3 and Noah Flynn from The Kissing Booth are very tall and strong individuals who are adept and experienced at fighting.\n\nBut who would win in a 1v1 fight?\n\nRound 1: Young Terry Silver from KK3 vs Noah Flynn\n\nRound 2: Old Terry Silver from Cobra Kai Season 4-5 vs Noah Flynn",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1olqu7b/terry_silver_karate_kid_3_cobra_kai_vs_noah_flynn/"
    },
    {
        "id": "1okpnwf",
        "author": "b3ndgn",
        "title": "They just remove Henry Cavill's Geralt image",
        "content": "So new season of Witcher is now showing. I have Henry Cavill's Geralt image as my profile thumbnail for the past 5 years and never change it. I understand in the past that they remove it as one of the choices when creating new account or just changing.\n\nBut when I open Netflix today this is what I see.  \nTheir 404 image  \n[https://i.postimg.cc/QtgJkGK6/no-more-hc.png](https://i.postimg.cc/QtgJkGK6/no-more-hc.png)\n\nThey're really trying to push the new Witcher but we all know it's gonna be a bad writing all over again.\n\nCiao!\n\nEDIT: Oh God! I just saw the EP 1. The jab, the shade they throw us as the viewer. ",
        "upvotes": 183,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1okpnwf/they_just_remove_henry_cavills_geralt_image/"
    },
    {
        "id": "1olmjnq",
        "author": "ohsome2022",
        "title": "Recommend my next series",
        "content": "I became so interested with House of Cards, The Diplomat, and Designated Survivor that I get to finish everything in a month.\n\nAny series recommendation with the same genre/storyline?",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1olmjnq/recommend_my_next_series/"
    },
    {
        "id": "1ol2sl5",
        "author": "kimchayoppar",
        "title": "Why was Yu Menglong’s name removed from “Eternal Love”?",
        "content": "He was a main actor in that film and yes it is so tragic that he has died (look up Yu Menglong case) but I don’t understand why his name was removed? Especially since Netflix isn’t a Chinese company? I don’t get it at all. Like was Netflix threatened or what?",
        "upvotes": 14,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1ol2sl5/why_was_yu_menglongs_name_removed_from_eternal/"
    },
    {
        "id": "1olg44e",
        "author": "Accurate-Cobbler-408",
        "title": "Supacell Season 2",
        "content": "This was a series that I enjoyed pretty much, but I can't tell why Netflix makes series so short and then makes you wait a year or more for a new season! \n\nBy the time the new season starts, you've almost forgotten about this show.  This first season was back in 2024 and only had 6 episodes.\n\nIts still not released and I think its supposed to come out on 2027? WTF?\n\nAnyone else feel the same way or know why Netflix does this? They did the same thing with Cobra Kai and Black Mirror!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1olg44e/supacell_season_2/"
    },
    {
        "id": "1oliuf8",
        "author": "Lankinator-",
        "title": "Ambient shows",
        "content": "Could anybody provide any suggestions for an ambient programme that can be played in the background?\n\n\nI don't mean to have a show on just for background noise, I mean similar to 'Fireplace For Your Home'.\n\n\nI remember there used to be a series of 'moving art' shows that included things like following a steam train along its route, or an aquarium style show with fish floating past.\n\n\nI'm on the UK Netflix.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oliuf8/ambient_shows/"
    },
    {
        "id": "1okni3g",
        "author": "HehroMaraFara",
        "title": "Witcher S4: When the whole vibe is “we cut the budget by 75%, figure it out”",
        "content": "I don’t know if the issue was they knew the lead change would be that impactful so they didn’t want to throw good money after bad; or if they figure they’ve maxed out their audience and it’s now them just finishing the story without any growth expectations. \n\nThe directing is so over the top melodrama and self indulgent that I had to fast forward certain parts only two episodes into the new season. The makeup is bad, the effects are few and far between and the script feels very “written by GPT”. \n\nThe move to Hemsworth (one of the other ones, not THE Hemsworth) didn’t fit either. The use of a thick black shirt and leather jacket isn’t fooling anyone. He’s maybe 2 bills soaking wet. ",
        "upvotes": 94,
        "comments": 62,
        "media": null,
        "permalink": "/r/netflix/comments/1okni3g/witcher_s4_when_the_whole_vibe_is_we_cut_the/"
    },
    {
        "id": "1ol8x7h",
        "author": "BusinessNonYa",
        "title": "Thumbs down resets itself sometimes.",
        "content": "It happens more frequently on new releases or Netflix owned media. i.e. N0S4A2. I have zero interest in this so I gave it a thumbs down yesterday. Today it was at the top of the page when it shouldn't be. So i clicked on it and saw my vote had reset again. Annoying beyond measure.",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ol8x7h/thumbs_down_resets_itself_sometimes/"
    },
    {
        "id": "1okjdtx",
        "author": "Conscious-Can-5334",
        "title": "Aileen Wuornos",
        "content": "I’m about half way through this new documentary. I’ve always believed she had to of been guilty or they wouldn’t have sentenced her to death. But watching this I can’t help but believe her when she talks about them being self defense. So far it looks like she didn’t get a fair trial. It also seems like Tyria was wwwaaaaayyyyy more involved than we know. Thoughts? ",
        "upvotes": 140,
        "comments": 86,
        "media": null,
        "permalink": "/r/netflix/comments/1okjdtx/aileen_wuornos/"
    },
    {
        "id": "1ol1zs9",
        "author": "Iam_MissRain",
        "title": "Boots: What exactly happens with Sullivan at the end?",
        "content": "Just finished the series yesterday. \n\nI am confused what happens with Sullivan at the end?  \nDid he skips the arrest and absconds?\nI felt his character was ended quite abruptly. ",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ol1zs9/boots_what_exactly_happens_with_sullivan_at_the/"
    },
    {
        "id": "1olfz0x",
        "author": "cieje",
        "title": "watched Stranger Things now it's all over YouTube",
        "content": "is there a setting to disable it from sharing my viewing data or something? same exact thing happened with Plex a few weeks ago, I changed the setting, and it stopped. \n\nit's super annoying, invasive, and creepy. within hours (minutes really) of watching it (doing a rewatch) like a fifth of the recommendations on YouTube are ST clips. it actually makes me not want to watch it on Netflix if doing so it's just going to fill up my YouTube recommendations.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1olfz0x/watched_stranger_things_now_its_all_over_youtube/"
    },
    {
        "id": "1ok73sb",
        "author": "Agreeable_Stranger73",
        "title": "Aileen queen of the serial killers",
        "content": "Outraged to see prosecutor, John Tanner exposed for ignoring evidence in Aileen’s murder trial! This is illegal -why hasn’t John Tanner been brought to justice ?Aileen had said that she was raped and tortured by Richard Mallory.  who she then shot in self-defense. Prosecutor John Tanner knew that RM had a prior rape conviction, but he suppressed the evidence so that Aileen  would get the death penalty.",
        "upvotes": 213,
        "comments": 119,
        "media": null,
        "permalink": "/r/netflix/comments/1ok73sb/aileen_queen_of_the_serial_killers/"
    },
    {
        "id": "1ojzvfb",
        "author": "Nook_6",
        "title": "Go watch Dark (no spoilers)",
        "content": "I don’t know what you’re watching right now, but Dark *must* be the next thing. \n\nOne of the best things I’ve seen on screen in my life. \n\nCome prepared for an epic and unbelievable ride, and concentrate. It’s a complicated series with exactly zero comic reliefs.\n\nI will not say anything in case I make spoilers.\nYou will not regret this, trust me.",
        "upvotes": 456,
        "comments": 218,
        "media": null,
        "permalink": "/r/netflix/comments/1ojzvfb/go_watch_dark_no_spoilers/"
    },
    {
        "id": "1oki8ii",
        "author": "Smooth_Wasabi8433",
        "title": "Watching the show Wayward and ......",
        "content": "Can't decide if I should keep going or not.. \nSo far it seems like a mix of bad acting and cheesy moments.. \nSomeone convince me I'm wrong WITHOUT SPOILERS in case I decide to keep going. \n\nI'm on episode 3 season 1 \n",
        "upvotes": 40,
        "comments": 101,
        "media": null,
        "permalink": "/r/netflix/comments/1oki8ii/watching_the_show_wayward_and/"
    },
    {
        "id": "1ol6b7z",
        "author": "Tragickingdom555",
        "title": "There are 16 old movies/shows on the coming soon page on Netflix. Not much new.",
        "content": "I check the coming soon page about twice a week because I get excited to add shows and movies to my list and noticed about 16 on the coming soon page were older movies/shows. This has been the most I’ve seen. Anyone know what’s going on? \n\nEdited to say: I enjoy the new shows, documentaries, movies and am disappointed there will be almost nothing for the next month.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ol6b7z/there_are_16_old_moviesshows_on_the_coming_soon/"
    },
    {
        "id": "1okwimk",
        "author": "Top_Jump941",
        "title": "SPOILERS ABOUT THE WITCHER SEASON 4",
        "content": "Am I thinly one who was kinda satisfied when the rat gang got slaughtered by that Witcher?\n\nOkay, don’t take this the wrong way, but I honestly hated the Rat gang. Every time they appeared on screen, I just wanted to skip the scene. I didn’t enjoy that whole “independence” phase Ciri went through, it just didn’t feel like her to me. To be fair, I haven’t read the books, so maybe I’m missing something important about their role. But from the show alone, I just couldn’t stand them.\n\nWhat do you guys think?",
        "upvotes": 3,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1okwimk/spoilers_about_the_witcher_season_4/"
    },
    {
        "id": "1ojz3ig",
        "author": "darth_vader39",
        "title": "Stranger Things 5 | Official Trailer | Netflix",
        "content": "",
        "upvotes": 338,
        "comments": 177,
        "media": null,
        "permalink": "/r/netflix/comments/1ojz3ig/stranger_things_5_official_trailer_netflix/"
    },
    {
        "id": "1ol4ay8",
        "author": "GreyHound_123",
        "title": "Random account on my TV",
        "content": "Hi all,\n\nI am not using Netflix and I don’t have any account logged into Netflix on my TV. However, today I opened Netflix app and there is already an account logged in with three profiles.\n\nLast I used Netflix on my TV was more than 6 months ago when I used it for one month and then ended my subscription and logged out. I checked now and my ID is not logged into any devices.\n\nWhat could explain this random account on my TV? I don’t recognise the email or the profile names. I did a search on the name from email and the name appears to be from Nigeria. Is my TV hacked or something? All other apps (YouTube, Apple TV) seem to have my correct ID logged in.\n\nAppreciate your input.",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1ol4ay8/random_account_on_my_tv/"
    },
    {
        "id": "1ol15gj",
        "author": "wanna_be_many_things",
        "title": "ST05 Theories",
        "content": "Okay, let me get one thing straight away. Netflix and the Duffer Brothers succeed in planting a strong idea in our heads. So, we need to get one thing out of the way, \"Steve Harrington is **NOT** going to die.\" They've primed us for it, the internet is convinced, and that's precisely why it won't happen. Steve is going to live his dream of having \"six little nuggets.\"\n\nWith that cleared up, here are my seven biggest predictions and hopes for **Stranger Things 5,** which I believe bring the saga to its proper, high-stakes conclusion:\n\n**1. The Strategist’s Downfall: Vecna Neutralises the Brain:**  \nIf Vecna wants to win, he doesn't hit the muscle, he hits the brain. The true way to cripple the entire party is to take Dustin Henderson out of the picture (Please don't hate me, but I have a feeling). Every time the gang hits a brick wall, it's Dustin's logic, D&amp;D strategy, or science knowledge that finds the solution (Dart, the compass, the radio relay, Suzie's code). I predict Vecna will hit Dustin hard, if not killing him, at least leaving him incapacitated or trapped in the mental void. This leaves the gang strategically lost, raising the stakes immensely.\n\n**2. The Heartbreak We Need: The Mother is Gone:**  \nIt’s time for a major parent death that doesn't involve the Byers or Hoppers. Mrs Karen Wheeler is going to die. Her character has spent four seasons feeling trapped and yearning for more. Her death was arguably hinted at when she almost met Billy in Season 3. Her sacrifice (perhaps protecting Holly or being Vecna’s psychological victim) forces Ted Wheeler to finally wake up and be a real father, which completes his useless-dad arc perfectly. This gives Mike and Nancy a shared, devastating trauma that anchors them.\n\n**3. The Lover Boy's Sacrifice: Goodbye, the Lover:**  \nForget Steve, Jonathan is the one making the ultimate sacrifice.\n\n* The Narrative Cracks: His relationship with Nancy has been a slow-motion breakup since Season 3, and they were completely separated in Season 4. It only makes sense for him to officially step aside.\n* The Redemption: His death would be a direct act of self-redemption, finally being there to protect his brother, Will, and his family, making up for the guilt he carried from Season 1. He gifts Nancy her true love, a still-living Steve, and dies protecting the people he cares for most.\n\n**4. Revenge is Sweet: The Smartest of All Comes to Hawkins**  \nWith Dustin in the dust or incapacitated, the gang needs a new genius. The solution? Suzie will arrive in Hawkins and be the gang's secret weapon, guiding them through the tactical final campaign. She will take over as the smart brain, using her coding and science background to avenge her beloved \"Dusty-bun.\" It’s the perfect blend of revenge and necessary plot advancement.\n\n**5. The Battle of Minds: The Fallen Fight Back**  \nThe battle can't just be physical; it has to be mental. I believe the final fight takes place in a shared psychic space where those Vecna has claimed or tormented band together to take him down. This means Max's mind fights, and we see the consciousness of Eddie Munson, Chrissy, Bob Newby, and even Barbara Holland... even the Dusty-bun, the forgotten casualties, fight back against Vecna. It gives every victim a final heroic moment of resistance.\n\n**6. The Full Circle: The Gatekeeper**  \nThe story started with Will Byers' disappearance, and it must end with the fate of Will Byers. Will is the key, the one whose mind seemingly influenced the Upside Down to freeze on the day he was taken. To truly close the dimension and prevent it from destroying the real world, Will must take Vecna's place. He sacrifices his freedom by remaining in the Upside Down as the new anchor/gatekeeper, keeping a small portal open for his family and friends to visit. This gives him a tragic, yet hopeful, ending, and leaves the door slightly ajar for the franchise to revisit the universe with him as a possible future complication (A Villain, maybe?).\n\n**7. How It All Ends: The Final Pairings**\n\n* Mike - El / Jane Hopper: Obvious and earned. They are the main leads and will end up together. I predict El loses her powers to defeat Vecna, allowing her to finally have a \"normal\" life.\n* Lucas - Max: The victory we deserve. Max wakes up from her coma when Vecna is defeated.\n* Steve - Nancy: The emotional climax of the love triangle is resolved by Jonathan’s sacrifice, putting the original couple back together for good.\n* Robin - Vickie: Finally, a simple, happy ending for Robin, the hero who gets to live a normal, open life with the girl she loves.\n* Jim - Joyce: The parents get their happy ending. Their shared trauma and love bond them forever.\n* Dustin - Suzie: In case Dustin also has the Max treatment and is not killed by Vecna.\n\nWhat part of this final campaign would you be most devastated or thrilled to see happen?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ol15gj/st05_theories/"
    },
    {
        "id": "1okz425",
        "author": "ToonAdventure",
        "title": "Happy Halloween from #SesameStreet!",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1okz425/happy_halloween_from_sesamestreet/"
    },
    {
        "id": "1olb5df",
        "author": "Trulsbulltuhus",
        "title": "WHY ONLY \"ENGLISH (CC)\" SUBTITLES??!!",
        "content": "Why Is There Not An Option For English Subtitles, Without The Captions For People With Hearing Difficulties? I Love That (CC) Is An Option, But It Makes No Sense, What So Ever, That Basic English Subtitles Is Not An Option. For Me The Captions Are Just Distracting. And It Must Be So Easy For Them To Have Both Options Available. ",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1olb5df/why_only_english_cc_subtitles/"
    }
]