[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 7,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 52,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1l5zkqa",
        "author": "Movingskyclub",
        "title": "Parents stayed over for a week watching Korean dramas. How do I delete that history so I stop getting recommended shows similar to those?",
        "content": "I have no taste for Korean dramas, sadly, and now I’m getting lots of recommendations for “internationally acclaimed romantic dramas”. How do I stop this, short of resetting my watch history?",
        "upvotes": 25,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1l5zkqa/parents_stayed_over_for_a_week_watching_korean/"
    },
    {
        "id": "1l5yp3d",
        "author": "Inevitable-Scar-2982",
        "title": "Please give me some good mind bending shows!",
        "content": "I love shows that make you think and leave you stunned. I wanted to be genuinely shocked!\nLike I’ve seen Dark and it was the best shows I’ve EVER EVER SEEN! I need shows like Dark, The OA, Umbrella Academy, Love, death and robots, Black Mirror and Years and Years. I can’t explain what you’d call these but just ones with twists and that aren’t predictable. \nPlease give me some actual good shows along these lines, I tried ‘From’ and I just found it too boring and couldn’t get into it. Please no detective dramas! I lot of these shows are going in an AI direction which is really cool. \n\nI just need something gripping from start to finish, no predictability. ",
        "upvotes": 15,
        "comments": 56,
        "media": null,
        "permalink": "/r/netflix/comments/1l5yp3d/please_give_me_some_good_mind_bending_shows/"
    },
    {
        "id": "1l5n21b",
        "author": "Five50am",
        "title": "Anyone else watch Netflix less since they updated the layout?",
        "content": "I personally can't stand it. I loved how you could see many options on the screen and now it's like your zoomed in and have to scroll for days to see everything. I don't understand why they tried to fix what wasn't broken.",
        "upvotes": 51,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1l5n21b/anyone_else_watch_netflix_less_since_they_updated/"
    },
    {
        "id": "1l5v4np",
        "author": "Remote_Nature_8166",
        "title": "I wish they could fix that annoying issue",
        "content": "So if i’m watching a show and it only has three minutes left, if I accidentally exit it and go back to it, it just winds up back at the beginning even though I wasn’t done with the episode and I gotta scroll all the way back. That’s such a stupid feature. It should just be doing that when it hits the credits.",
        "upvotes": 11,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l5v4np/i_wish_they_could_fix_that_annoying_issue/"
    },
    {
        "id": "1l5j6ro",
        "author": "jerkoff1610",
        "title": "The story of Raymond West and his link to the Tylenol Murders",
        "content": "Watched The Tylenol Murders, the Netflix doc about a week ago and I still can’t shake the Raymond West story. Everyone talks about the Tylenol poisonings but the way the doc weaves in Ray's disappearance from 1978 is seriously haunting.\n\nHe was this retired truck driver who knew James Lewis and then just… vanished. What they eventually found in his house is wild. And the connection to Lewis is super sketchy.\n\nHonestly feels like this should’ve raised way more red flags back then. Makes the Tylenol case even creepier in hindsight.\n\nAnyone else still thinking about that part? Curious what others make of it, coincidence or something bigger?",
        "upvotes": 48,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1l5j6ro/the_story_of_raymond_west_and_his_link_to_the/"
    },
    {
        "id": "1l5lkz0",
        "author": "vurryscurry",
        "title": "Tires Season 2 audio is off by a second or two and it’s unwatchable.",
        "content": "Fix this, Netflix. And it’s not just “my tv” either. I have tried on every tv in my house and my phone, the audio still lags. Why does it seem like Netflix drops the ball far more often than not? ",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1l5lkz0/tires_season_2_audio_is_off_by_a_second_or_two/"
    },
    {
        "id": "1l5n6pf",
        "author": "Ruffers75",
        "title": "Becoming Led Zeppelin",
        "content": "Hi Everyone,\nI’ve read that this is available from 7th June(today).\nCan’t seem to find it though?.\nHave I got the date wrong/being thick?.\nMany thanks!!.",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l5n6pf/becoming_led_zeppelin/"
    },
    {
        "id": "1l5t61h",
        "author": "rudranksh",
        "title": "Netflix playback for universal and columbia (and maybe sony) is capped on 540p on chrome and edge on windows",
        "content": "i know this gets asked a lot but this is so frustrating especially since we as subscribers pay to get the better quality  \nAnyone got a fix for this or any reason why this happens  \nthanks for your help",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l5t61h/netflix_playback_for_universal_and_columbia_and/"
    },
    {
        "id": "1l5sju9",
        "author": "Aurora_rage",
        "title": "I'm travelling, and the only two options that I'm getting are either \"Update Netflix Household\" or create an Account\".",
        "content": "There is no option of \"Watch Temporarily\" \n\nCan anyone please tell me the reason or someone has faced the same? \nWhy am I not getting the option to get a code? ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1l5sju9/im_travelling_and_the_only_two_options_that_im/"
    },
    {
        "id": "1l5rpmh",
        "author": "Real_Display2994",
        "title": "Netflix doesn’t work?",
        "content": "My Netflix doesn’t work. It just keeps loading but I can’t see the pictures of the film. Is it just for me or is it a big problem? I hope that they fix that.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l5rpmh/netflix_doesnt_work/"
    },
    {
        "id": "1l5lna5",
        "author": "CitizenTony",
        "title": "How many Jackie Chan movies are there on Netflix?",
        "content": "I don't know if those non-party websites where you can see the catalog of available films on various streaming services are really reliable. Except the recent movies starring Jackie Chan bought by netflix, I was wondering how much of his filmography is available overthere\n\nedit : Of course, the question is asked by someone who doesn't own an account anymore (but who might come back in a distant future, depending on certain criteria. Idk) otherwise the question would not be asked. That seems logical.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l5lna5/how_many_jackie_chan_movies_are_there_on_netflix/"
    },
    {
        "id": "1l5vsal",
        "author": "dailystar_news",
        "title": "WWE Money in the Bank 2025 LIVE on Netflix as Seth Rollins and Stephanie Vaquer set to star",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l5vsal/wwe_money_in_the_bank_2025_live_on_netflix_as/"
    },
    {
        "id": "1l5ezez",
        "author": "h2fast",
        "title": "Pineapple Express",
        "content": "What a fucking film 😂, they all played and amazing part what do you all think the cost of making that would be now because of how high up Seth rogan and the other actors are",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1l5ezez/pineapple_express/"
    },
    {
        "id": "1l5nxaa",
        "author": "InternPrestigious313",
        "title": "Need some recommendation for series",
        "content": "Something light and fun…\nI thought of asking you guys before randomly watching 2-3 episodes of some stupid show! \nMy fav series are: GOT, HOTD, How I met your mother, Nobody wants this, Schitts creek( i LOVEEEEEE IT), Never have I ever, some K dramas, how to make millions before gradma dies(it was soo heartwarming 🤌🏻) anddddd I can’t remember anymore…. But please recommend something nice😭🙏🏻",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l5nxaa/need_some_recommendation_for_series/"
    },
    {
        "id": "1l4tn78",
        "author": "Safe-Conversation770",
        "title": "Shows similar to Dept Q",
        "content": "As the title suggests, I am looking for recommendations for shows that have the same genre as Dept Q. I thoroughly enjoyed the series. Please help a girl out. ",
        "upvotes": 100,
        "comments": 64,
        "media": null,
        "permalink": "/r/netflix/comments/1l4tn78/shows_similar_to_dept_q/"
    },
    {
        "id": "1l5x76k",
        "author": "Jigagug",
        "title": "Refund request support/form/location?",
        "content": "Is there an official page or channel for a refund form? I wanted to watch Rick and Morty that was still on Netflix last year but isn't anymore?\n\nI couldn't find an easy refund request form in their support, or any sort of support for a refund at all, everyone knows Netflix is very anti-consumer but is my only option really making a reclamation through my bank that can take months?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l5x76k/refund_request_supportformlocation/"
    },
    {
        "id": "1l5mk5p",
        "author": "TheTravelingDanksman",
        "title": "Why dose netflix make my phone darker",
        "content": "Everytime I start streaming my phone seems to get less colorfully and it stays that way untill I close netflix. Almoat like a gray hue. how do I fix this.\nAndroid ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1l5mk5p/why_dose_netflix_make_my_phone_darker/"
    },
    {
        "id": "1l5lhm3",
        "author": "oz_shadow",
        "title": "Need ideas to stream Netflix to TV using only a phone with internet?",
        "content": "I am helping a relative with this who is on a fixed budget.  We will add her as a separate paid add on if we can figure out how to allow her to access it on her tv in a separate household without wired internet.  \n\nHotspot data available on her cell phone is very limited so we want to avoid that option.  Data used on the actual cell phone is unlimited.  I’d like to know the options for her to be able to watch Netflix on an older 1080p television using only the cell phone as her internet source.\n\nThe phone is a newer Samsung.  Thank you in advance.",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1l5lhm3/need_ideas_to_stream_netflix_to_tv_using_only_a/"
    },
    {
        "id": "1l5l7mg",
        "author": "Pyro_Funto",
        "title": "Show stopped to let other profile watch?",
        "content": "Hey everyone, I am sharing an account with 2 other people but we have a limit of 2 simultaneous streams. I was watching a tv show and when reaching the end of the episode I clicked to start the next one, not even going back to the menu. However it now tells me there are too many ppl watching. How come the third person managed to start watching if I was already streaming? Is there a priority or did they forcefully stop my stream?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l5l7mg/show_stopped_to_let_other_profile_watch/"
    },
    {
        "id": "1l5klym",
        "author": "PassengerUnable3634",
        "title": "Recommend something like Ginny &amp; Georgia",
        "content": "Done watching this series. But want to watch something similar.\nRecommend few good shows similar to G&amp;G \nOr any feel good series.\nWhen are we supposed to get new season of this show?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l5klym/recommend_something_like_ginny_georgia/"
    },
    {
        "id": "1l5euu8",
        "author": "S4v1r1enCh0r4k",
        "title": "Leviathan Anime Takes Off July 10 with Airships, War, and a Wild New World",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l5euu8/leviathan_anime_takes_off_july_10_with_airships/"
    },
    {
        "id": "1l5jwjw",
        "author": "lovereading04",
        "title": "Carry-On scene question",
        "content": "I’ve watched Carry-On a few times, and I’ve noticed that when Nora is running away from the Ready Teddy van and towards a police officer on the ground floor of the airport, that she decides to turn right, which is away from the police officer and other cars, that could’ve stopped the van from getting to her. \n\nWhy does she turn right? Why doesn’t she run towards the police officer like she should’ve done? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l5jwjw/carryon_scene_question/"
    },
    {
        "id": "1l5og9p",
        "author": "Beneficial-Heart8015",
        "title": "Animal House",
        "content": "Watching this show is so stressful.  Is there any character that's redeemable? there's not a single character that's got redeeming qualities.  Even law enforcement is skeevy.\n\nDoes anyone find this show entertaining? I started this after Dept Q and it's not even close in quality programming. ",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1l5og9p/animal_house/"
    },
    {
        "id": "1l55oki",
        "author": "AnagnorisisForMe",
        "title": "Are you enjoying Season 3 of Ginny and Georgia?",
        "content": "I really enjoyed the first two seasons of the Ginny and Georgia series. But Season 3 isn't doing it for me for some reason. What are your thoughts about S3?",
        "upvotes": 10,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1l55oki/are_you_enjoying_season_3_of_ginny_and_georgia/"
    },
    {
        "id": "1l5gskn",
        "author": "Top-Three-USA",
        "title": "Netflix Viewers 'Up All Night' Binge-Watching ‘Excellent’ Ginny &amp; Georgia Season 3 After Long-Awaited Return",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l5gskn/netflix_viewers_up_all_night_bingewatching/"
    },
    {
        "id": "1l5gqhn",
        "author": "akshatsgi",
        "title": "What is up with Netflix subtitles?",
        "content": "I recently noticed that the Netflix subtitles on my Apple TV are appearing in front of the characters who is saying the dialogue.\n\nIt is a bit irritating because it sometimes blocks actors faces. \nIs anybody else facing this? \nIs there a way to revert this to be in the bottom of the screen?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1l5gqhn/what_is_up_with_netflix_subtitles/"
    },
    {
        "id": "1l5d0qk",
        "author": "sloppyduc",
        "title": "Solution for getting Old UI back",
        "content": "Hey guys I have found the solution for recent UI change;\n\nGo to your account &gt; security &gt; feature testing and turn it off \n\nNow sign out and sign in again on the Tv \n\nIf that still doesn’t work then uninstall and install the app again\n\nIt worked for me;\nHave a great day:)\n",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1l5d0qk/solution_for_getting_old_ui_back/"
    },
    {
        "id": "1l5ovqv",
        "author": "techtoxin",
        "title": "[Request] Which Hindi movie to watch on Netflix?",
        "content": "I am Requesting Hindi movie which could be dubbed in Hindi which is worth to watch which I might not have seen earlier.\nSuggestions are welcome thank you in advance ☺️",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l5ovqv/request_which_hindi_movie_to_watch_on_netflix/"
    },
    {
        "id": "1l5f2yn",
        "author": "Robemilak",
        "title": "Netflix Shareholders Vote Out Board Member Jay Hoag In Rare Repudiation",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l5f2yn/netflix_shareholders_vote_out_board_member_jay/"
    },
    {
        "id": "1l5exar",
        "author": "jiru777",
        "title": "why netflix said \"finish sign up\" even though i paid the subscription recently?",
        "content": "https://preview.redd.it/vvafewd0hg5f1.png?width=1919&amp;format=png&amp;auto=webp&amp;s=cc2b05f09062b4084575ec1de7827eb7775f837e\n\nhttps://preview.redd.it/zuw3l1e0hg5f1.png?width=1919&amp;format=png&amp;auto=webp&amp;s=028b47c8a798a01e9996b8c6e9bfe2aa54b9093d\n\nso i availed the basic plan of netflix last night. on the main phone which is my dad uses, it works well and has 4 different profile on it. whenever i log in/sign in that account on other device, it said finish signing up and force me to start a new membership? mind u that i already pay it on the active gmail.  what should i do?\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l5exar/why_netflix_said_finish_sign_up_even_though_i/"
    }
]