[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 497,
        "comments": 272,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 15,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jcoxfo",
        "author": "Internal-Bed-3150",
        "title": "Adapting The Magician's Nephew first will make problems for Netflix",
        "content": "",
        "upvotes": 80,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1jcoxfo/adapting_the_magicians_nephew_first_will_make/"
    },
    {
        "id": "1jchy01",
        "author": "NellyNoo2000",
        "title": "Adolescence - one shot q&amp;a",
        "content": "Loved this thread on Netflix UK &amp; Ireland Twitter page about how they filmed the show.\n\nI was fascinated by the one shot episodes &amp; this q&amp;a answered most of my questions. Hopefully it answers yours too",
        "upvotes": 255,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1jchy01/adolescence_one_shot_qa/"
    },
    {
        "id": "1jcrapq",
        "author": "Positive_Night_5172",
        "title": "Too many shows being canceled after 1 season. I think they should be required to accept them for at least 2 seasons and the 2nd seasons should have an alternate finale that wraps the show up in case there's not going to be a 3rd season. Otherwise it's just a waste of viewers time and money.",
        "content": "I've gotten to the point that I won't even watch the 1st season of a show until it's been renewed for a 2nd season. I'm tired of wasting my time becoming interested in a new show only to be disappointed when it's canceled show quickly. They aren't even giving these shows a chance. They should come with a warning at the beginning letting viewers know it's a 1 season show so you can decide if yiu even want to bother or not. \nIf Netflix wasn't free with my T-Mobile service I would have canceled it. I'm getting pretty tired of Prime doing the same, or maybe worse, taking years to come out with new seasons. And even then they only have 6, or if you're lucky, 8 episodes. I really miss when shows had a new season every year, right around then same time as the last, and where 12 to 20 episodes depending on whether it was cable or network tv. ",
        "upvotes": 37,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1jcrapq/too_many_shows_being_canceled_after_1_season_i/"
    },
    {
        "id": "1jcyjoq",
        "author": "indiewire",
        "title": "‘Adolescence’ Review: Netflix’s Real-Time Crime Drama Impressively Subverts Expectations",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jcyjoq/adolescence_review_netflixs_realtime_crime_drama/"
    },
    {
        "id": "1jd09r6",
        "author": "Poshdelux",
        "title": "Adolescents Series season 2 potential.",
        "content": "I finished the Adolecance series and couldn't help but feel unsatisfied. It was left inadequate, has so much potential for a full body of work. I was even thinking of an episode where the camera follows the day in question on CCTV. \n\nAnyone else left feeling this way? If so, what would be your idea for an episode? What would you like to explore in this series entire topic?",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jd09r6/adolescents_series_season_2_potential/"
    },
    {
        "id": "1jcz0n5",
        "author": "jake72469",
        "title": "Question: Brooklyn Nine-Nine. Only 4 seasons? More...",
        "content": "They recently added seasons 5 and 6 of Brooklyn Nine-Nine but at the same time they removed seasons 1 and 2 so that Netflix is only showing 4 seasons at a time.  I expect something similar will occur when they release seasons 7 and 8.  I've never seen Netflix do this before.  Is this a new thing or is this something we should expect with other shows?",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jcz0n5/question_brooklyn_ninenine_only_4_seasons_more/"
    },
    {
        "id": "1jciagd",
        "author": "bbportali",
        "title": "Looks like Adolescence has very good ratings and might be worth a watch as a mini series",
        "content": "",
        "upvotes": 21,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1jciagd/looks_like_adolescence_has_very_good_ratings_and/"
    },
    {
        "id": "1jcbf3z",
        "author": "Objective-Effort-614",
        "title": "Black Mirror",
        "content": "Looks like a new season is coming out soon. What’s your favorite episodes? Some of them are great and some are not so good. \n\nThinking about rewatching some episodes. Suggestions welcome. ",
        "upvotes": 57,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1jcbf3z/black_mirror/"
    },
    {
        "id": "1jcsylg",
        "author": "Chris_S_B",
        "title": "Adolescence Episode 4.",
        "content": "I finished watching Adolescence last night and thought it was brilliant. There's something I'd like other people's opinion on in episode 4. When the family are driving back from the DIY shop and Jamie rings to wish his dad a happy birthday, why do you think he chose that day to tell them he was changing his plea to guilty? My opinion is that he didn't want his family to have fun without him and gave him an element of control over them. ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jcsylg/adolescence_episode_4/"
    },
    {
        "id": "1jcvnov",
        "author": "Grimmer6",
        "title": "All Of Us Are Dead ending",
        "content": "What do you guys theorise of the ending? I personally think that it was Cheong-san among the surviving hambie. Nam-ra jumped of the roof and they all came near the edge to see the other surviving hambies and all of their reactions had been changed which is normal. Everyone was shocked but Su-hyeok smiled a bit with the shock. It was like \"damn mf, you made it\". And On-jo was in total shock like she didn't expect that. The reaction on her face doesn't justify seeing other hambies made her shocked. It was a shock of something dear to you which you never expected to come being infront of you. I personally belive it's Cheong-san among the survivors who made them surprised. What do you guys think?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jcvnov/all_of_us_are_dead_ending/"
    },
    {
        "id": "1jcv03e",
        "author": "Dagomesh",
        "title": "Can't watch Netflix on 2 different Profils.",
        "content": "Recently I have the problem that I cannot watch Netflix on 2 different devices ( Webbrowser / PS5 ) on two seperate Profils at the same time.\n\nI currently have 2 Profils, my Profil and one for our son. He is watching on his PS5 which is in the same Wifi Network via Wifi Repeater, so we are all connected to the same Router. \nAs he is watching on his own Profil, I get the Message \"E123 Too many people are using one account\" on my Profil and vice versa.\n\nSo I already disconnected all devices and waited for about 10 - 15 minutes. I have the basic hd service which would allow me to use 4 devices in total. The live Chat didn't really help because they just suggested the same method of disconnecting everything which they also did on their end.\n\nHas anyone encountered the same problem ? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jcv03e/cant_watch_netflix_on_2_different_profils/"
    },
    {
        "id": "1jcyuvh",
        "author": "ZackaryAsAlways",
        "title": "The Electric State - Film Review",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jcyuvh/the_electric_state_film_review/"
    },
    {
        "id": "1jcwqu6",
        "author": "jinjer2",
        "title": "Chronology for Adolescence",
        "content": "Help me out with the timeline of the main characters. Parents recount a story about a school dance when A-ha was popular. This was when, mid to late 80s? So if say 13 years old in 1986 then turn 50 in 2023, correct? So … they met in 1986 but first kid born 2005 and second in 2010?\n\nI guess it fits but something seems off. What did I miss? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jcwqu6/chronology_for_adolescence/"
    },
    {
        "id": "1jcralq",
        "author": "MaestroZackyZ",
        "title": "Playback Speed not changing?",
        "content": "When I change the playback speed, nothing actually happens. I can't find any other posts of people having the same issue which is crazy to me. I am trying to watch on my computer (iMac) on Google Chrome. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jcralq/playback_speed_not_changing/"
    },
    {
        "id": "1jcelo9",
        "author": "OkTime3175",
        "title": "“Adolescence” pictures of kids in the intro?",
        "content": "Does anyone know the meaning behind the pictures of the kids in the intros for adolescence? I found it so eerie with the soundtrack but I can’t see how they link to the actual show ",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jcelo9/adolescence_pictures_of_kids_in_the_intro/"
    },
    {
        "id": "1jcele2",
        "author": "CortaCircuit",
        "title": "\"Sorry, something went wrong. Please try again later.\" Unable to sign up... this happens every time I try and reset my password or I try and add a payment method...",
        "content": "I have contacted Customer Service. They say it should go away within a couple days. Well it has been about two weeks since I last tried and it is still happening...\n\nAnyone had this error, how do you get around it?\n\nI had originally signed up fine. I was charged on my credit card, then two days later Netflix cancels my membership and refunds my payment. Now I can't do anything.  \n",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jcele2/sorry_something_went_wrong_please_try_again_later/"
    },
    {
        "id": "1jc7b8c",
        "author": "FearlessDirection129",
        "title": "Hot Take: Shows like The Ultimatum/ Temptation Island are a recipe to Disaster for people in the show",
        "content": "Although fun to watch drama as a viewer, i don't understand how couples are brave enough to sign up for such shows when they are 99% sure they will break up after.\n\nSomethimes I think couples shown were never together and made up for the show for drama that is supposed to happen.\n\nAlso Netflix controls the view angle of the show so they can sabotage a career of any person and no one would trust them ever with thier actions shown on the show. Although they all still become instant celebs after premiere.\n\nWhat do you guys think?",
        "upvotes": 20,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1jc7b8c/hot_take_shows_like_the_ultimatum_temptation/"
    },
    {
        "id": "1jc9ick",
        "author": "Worn-Out__Wishes",
        "title": "Please suggest disturbing / horror movies/shows/ documentaries!",
        "content": "What i have watched- \n\nDahmer \nAdolescence \nBlack mirror\nThe haunting of bly and hill house\nGacy tapes\nHouse of usher \nGabriel Fernandez doc\n\nBack on Netflix after a few years and would love some new recommendations. Thank you 🙏🏼 \n",
        "upvotes": 11,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1jc9ick/please_suggest_disturbing_horror_moviesshows/"
    },
    {
        "id": "1jclfpe",
        "author": "Unlucky-Better",
        "title": "Every time I try to play a movie it's stuck on loading. Even if I download the movie it won't play and only get stuck on a black screen. My family members don't have this problem on their phones.",
        "content": "How do I fix this? I have tried everything I have seen. Restarting my device, changing networks, clearing cache, uninstalling and reinstalling Netflix and other stuff. I just wanna watch some movies bruh 😭😭🙏🙏",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jclfpe/every_time_i_try_to_play_a_movie_its_stuck_on/"
    },
    {
        "id": "1jbq59u",
        "author": "Liquid_Lunch_1991",
        "title": "Adolescence",
        "content": "It takes a lot for a show/movie to upset and unsettle me and I wanna say with total honesty this show completely and utterly fucked my shit up. I admire the audacity of the filmmaking and writing and omg the acting is incredible, but seriously….this is the first time I’ve ever watched something I wished I could unwatch\n",
        "upvotes": 224,
        "comments": 120,
        "media": null,
        "permalink": "/r/netflix/comments/1jbq59u/adolescence/"
    },
    {
        "id": "1jbs898",
        "author": "S4v1r1enCh0r4k",
        "title": "[Trailer] Netflix's New 'Bad Influence' Docuseries Explores the Dark Side of Kid Influencers",
        "content": "",
        "upvotes": 114,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1jbs898/trailer_netflixs_new_bad_influence_docuseries/"
    },
    {
        "id": "1jc7x3q",
        "author": "ECO_FRIENDLY_BOT",
        "title": "Cobra Kai Finale",
        "content": "Finished the final season of Cobra Kai recently and have to admit I'll miss it on Netflix as it was one of the better shows available on the streamer. While the dialogue may not be great and the plot can be very clichéd it also had some great humour especially from William Sabka as Johnny Lawrence. The young cast were also very reliable and it had some great recurring characters especially Paul Walter Hauser as Stingray. The fight scenes were well choreographed and it was nice to see so many of the cast from the older movies return. I wouldn't be surprised if there is a spinoff too considering how popular it was.",
        "upvotes": 11,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1jc7x3q/cobra_kai_finale/"
    },
    {
        "id": "1jcvn6b",
        "author": "Feeling_Echidna_525",
        "title": "Netflix keeps deleting my profile/account?",
        "content": "Hi - hope someone can help. A couple of days ago I opened the Netflix app only to find all my watch history and profile wiped, Netflix had turned to Spanish and there was no payment method on my account. I switched it back to English and proceeded to create another profile and paid again. Then I opened it tonight and it has been wiped again (except no Spanish this time). I don't want to have to pay again but there seems to be absolutely no history on my Netflix account of me having already paid. Can anyone help?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jcvn6b/netflix_keeps_deleting_my_profileaccount/"
    },
    {
        "id": "1jca4hd",
        "author": "MamaMia1325",
        "title": "Younger",
        "content": "I hadn't ever heard of this show until about a month and a half ago. I absolutely love it. I'm sad that there are no more seasons. What are some similar shows to this? They don't have to be on Netflix, they can be on any streaming service. (tia). ",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jca4hd/younger/"
    },
    {
        "id": "1jc9r94",
        "author": "EbbPhysical7246",
        "title": "Student survey: help me out!!",
        "content": "https://forms.gle/T5VzHoG7hBJvbkrh8\n\nNeed as many responses as possible for a class project- thanks!!!",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jc9r94/student_survey_help_me_out/"
    },
    {
        "id": "1jby2iq",
        "author": "TheMirrorUS",
        "title": "Virgin River's Martin Henderson confesses one thing he 'hates' about Netflix drama as season 7 filming begins",
        "content": "",
        "upvotes": 27,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jby2iq/virgin_rivers_martin_henderson_confesses_one/"
    },
    {
        "id": "1jcpj95",
        "author": "Mental_Sherbet8768",
        "title": "Was there any significance to the scene when the police arrived to arrest Jamie and he had a little accident?",
        "content": "I'm talking about adolescence—when the police wrecked the Miller house to arrest Jamie. When he got up from bed, he had wet himself that night. Was that the aftereffect of what he did that night or was it meant to show how vulnerable he still was—that despite committing the most heinous crime, he was still just a boy?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jcpj95/was_there_any_significance_to_the_scene_when_the/"
    },
    {
        "id": "1jcha8e",
        "author": "According-Beyond-274",
        "title": "Eliab Gets Grounded Was Streamed On Netflix (Fanmade)",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6nkty3dmm0pe1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1jcha8e/eliab_gets_grounded_was_streamed_on_netflix/"
    },
    {
        "id": "1jcwyze",
        "author": "sunsetcoast28",
        "title": "Get SWAT trending on Netflix",
        "content": "If you haven’t heard CBS have cancel SWAT again and there’s a petition to save the show and fans and even the cast don’t want SWAT to end\n\nCBS don’t want the show on their network so we need to get the show trending on Netflix to show that people still watch the show and maybe hopefully Netflix saves the show by putting it on their streaming service \n\nEven if you don’t like or watch SWAT a lot of people do.\n\n#SAVESWAT \n",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jcwyze/get_swat_trending_on_netflix/"
    },
    {
        "id": "1jcgp48",
        "author": "Rraai",
        "title": "How do I remove gaming apps recommendations in the netflix main page of the web browser?",
        "content": "I installed a game from Netflix that was in the Appstore and now everytime I go on Netflix through my PC on the web browser it recommends me apps in the main page and it's pissing me off because I use it as a streaming service, I do not care about games that don't even run on that platform.\n\nAnybody knows how can I remove them?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jcgp48/how_do_i_remove_gaming_apps_recommendations_in/"
    }
]