[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 495,
        "comments": 270,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1j3hzk7",
        "author": "Neat_Panda9617",
        "title": "I HIGHLY recommend Toxic Town!",
        "content": "Typical British production with incredible actors, well-written script, and compelling story. Thought it might be too much of a bummer but then I saw who was in it and gave it a shot. Watched all four episodes yesterday and stood up cheering when it ended.",
        "upvotes": 92,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1j3hzk7/i_highly_recommend_toxic_town/"
    },
    {
        "id": "1j3n6kb",
        "author": "ECO_FRIENDLY_BOT",
        "title": "American Primeval",
        "content": "Really enjoyed this latest Western from Netflix which was surprisingly good and was up there with Godless in terms of quality. It's a pity they didn't make it 8 episodes as it's a very interesting period in American history especially the evolution of the Mormons and their bloody past. The cast was excellent especially rhe always reliable Betty Gilpin and Taylor Kitsch who is good in most things despite some of the hate he gets from critics. Shea Whigham is impressive as always and must be one of the best character actors working today. Also nice performance from Dane Dehaan who always delivers a memorable performance and really should be a bigger name in Hollywood. A quality show that stands out amongst all the rubbish on Netflix.",
        "upvotes": 17,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1j3n6kb/american_primeval/"
    },
    {
        "id": "1j3r39q",
        "author": "No_Culture7573",
        "title": "STILL not over this…",
        "content": "Is anyone else still salty about the ANNE WITH AN E cancellation ordered “jointly” by CBC and Netflix in 2019 just ahead to its season 3 premiere? I have never seen such fierce retaliation and clap back from a fanbase after a series cancelation ever, with a change.org petition reading 1.5 MILLION signatures. Hello CBC and Netflix executives???? Still also salty about Netflix saving Manifest for 2 more seasons despide being originally cancelled. Who even asked for that? 😂 ",
        "upvotes": 9,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j3r39q/still_not_over_this/"
    },
    {
        "id": "1j34j3w",
        "author": "Independent-Dark-910",
        "title": "Just lost my account",
        "content": "Hey everyone, I need to vent about something wild that just happened. I went to fire up Netflix on my TV last night, only to see my account was signed out. Weird, right? I figured it was a glitch, so I tried logging back in—bam, denied. Okay, no biggie, I’ll reset my password. Except when I tried, Netflix hit me with “no account exists” for my email. This is an account I’ve had for over five years.\n\nAt this point, I’m thinking, “Oh great, I’ve been hacked.” So I call Netflix support to sort it out. I’m assuming five years of payment history tied to my card, watch history, all that jazz would make it obvious I’m the real owner. The rep I talked to was nice enough—she even admitted she could see the new email on the account looked fraudulent (some random string of letters and numbers). But then she drops the bomb: there’s nothing she can do. Apparently, because the email got changed, I’m locked out for good unless I want the whole account wiped. Years of watchlists, recommendations, and profiles? Gone.\n\nLuckily, my Netflix password was unique, so this won’t spiral into other accounts getting compromised. Still, it stings to lose it like that. I’m just baffled they couldn’t verify me with all the data they have—payment records, IP addresses, something! The only option they gave was to nuke the account and start fresh. I get that security protocols exist for a reason, but this feels like punishing the victim instead of the hacker.\n\nHas anyone else dealt with this? Did I miss some secret way to reclaim it? Or am I just stuck rebuilding my Netflix life from scratch?",
        "upvotes": 104,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1j34j3w/just_lost_my_account/"
    },
    {
        "id": "1j3ergl",
        "author": "ImpossiblePeak1722",
        "title": "With love, Megan",
        "content": "I can't seem to ignore, but the energy between Michael and Meghan in the kitchen is just off. Why she does not maintain eye contact, she keeps looking down while talking.",
        "upvotes": 12,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1j3ergl/with_love_megan/"
    },
    {
        "id": "1j3ibfy",
        "author": "AggressiveDrinker",
        "title": "Rachel Weisz To Star In ‘Vladimir’ Limited Series Ordered By Netflix. 20th Television is the studio.",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j3ibfy/rachel_weisz_to_star_in_vladimir_limited_series/"
    },
    {
        "id": "1j31tc7",
        "author": "Certain_Passion1630",
        "title": "Why did Suits get so much more hype than White Collar?",
        "content": "Maybe this is a popular take I wasn’t aware of, but I started watching Suits 1-2 years ago when it seemed like everyone was talking about it. \n\nI just finished season 1 of White Collar, and all the character dynamics are basically the same: the genius criminal (Neal and Mike), the experienced mentor (Peter and Harvey), the quirky ally (Moz and Louis), and the smart woman behind the scenes keeping everyone levelheaded (Elizabeth and Donna). \n\nThen I looked and White Collar came out 2 years before Suits. I don’t know how popular the shows were when they first aired, but Suits was in the Netflix top 10 for weeks and I just happened to see White Collar one day while scrolling through shows. ",
        "upvotes": 110,
        "comments": 61,
        "media": null,
        "permalink": "/r/netflix/comments/1j31tc7/why_did_suits_get_so_much_more_hype_than_white/"
    },
    {
        "id": "1j3e25m",
        "author": "Sudden_Pop_2279",
        "title": "Jurassic World Chaos Theory Season 3 Gets April 2025 Release Date on Netflix; Know When and How to Watch",
        "content": "",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j3e25m/jurassic_world_chaos_theory_season_3_gets_april/"
    },
    {
        "id": "1j3gdch",
        "author": "SpecialistWeb8987",
        "title": "Wtaf does Netflix think by labeling this as fit for 6yo?",
        "content": "",
        "upvotes": 5,
        "comments": 20,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/8p3gbhvukpme1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1j3gdch/wtaf_does_netflix_think_by_labeling_this_as_fit/"
    },
    {
        "id": "1j3mupv",
        "author": "zachteria",
        "title": "Any similar shows to Toxic Town?",
        "content": "I watched Toxic Town yesterday and it was really good, any other dramas based on actual corruption/issues? Like Toxic Town or Three Girls (BBC) Preferably British too.",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1j3mupv/any_similar_shows_to_toxic_town/"
    },
    {
        "id": "1j2ot14",
        "author": "FuturismDotCom",
        "title": "Netflix Is Using AI Upscaling on a 1980s Sitcom and the Results Are Horrific",
        "content": "",
        "upvotes": 307,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1j2ot14/netflix_is_using_ai_upscaling_on_a_1980s_sitcom/"
    },
    {
        "id": "1j3qjgp",
        "author": "thelittlesandy",
        "title": "Anyone got recommendations for me? (Not horror)",
        "content": "I finished Apple Cider Vinegar last night, which was great, and now I'm wondering what to watch next. Can be anything except for horror and war films/shows!\n\nLeave recommendations in the replies and I'll see if they're available on my local Netflix :)",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j3qjgp/anyone_got_recommendations_for_me_not_horror/"
    },
    {
        "id": "1j3pwnv",
        "author": "Original_Pudding6909",
        "title": "Extra member ?",
        "content": "I invited someone to be an extra member, and when they went to create an account via the invite link, Netflix is asking for a payment method, and plan selection.\n\nWhat is this?  I’ve already taken care of all of that in my own account.  Has anyone else experienced this?\n\nThanks!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j3pwnv/extra_member/"
    },
    {
        "id": "1j3pftd",
        "author": "courtneymarie_5",
        "title": "Petition to get an annual review like Spotify does",
        "content": "I think it would be so cool if Netflix gave an annual review over your most watched, quickest binge, how many hours you watch and how many shows you watched on your account each year 👀 ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j3pftd/petition_to_get_an_annual_review_like_spotify_does/"
    },
    {
        "id": "1j3m0gd",
        "author": "Maximum_Opening330",
        "title": "help finding tv series",
        "content": "i can’t remember the name, I also think it got discontinued but i am not sure. i watched it in like 2021-22. they were freshman’s in highschool im pretty sure. the two main characters i don’t remember the names of. the female was white and the boy was black, the girls mom was dead and i think the girls dad was the principal. the boy he had like 2 other friends and the girl. ik this isn’t really much but if you know what im talking about off this information please tell me",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1j3m0gd/help_finding_tv_series/"
    },
    {
        "id": "1j3co3v",
        "author": "RebelGrin",
        "title": "Love Rats - show about romantic scams",
        "content": "What the fuck am I watching? I am screaming at the screen on how gullible they are, next minute I just have tears from laughter.\n\n90% of these people who get scammed is because they behave like gold diggers. Just like the tinder swindler victims. Rich guy likes them, and they lick their lips by the thought of having a relationship with them, which blinds them for the obvious scam. They are promised riches and instead get scammed out of all their money and more. All by the promise of living a rich life, in an expensive house in an exotic location.\n\nAnd then the glaring red flags being ignored. Like this woman who's bank accounts were frozen as the bank told her the transactions were flagged as fraud. She wouldn't have it and told the bank to unfreeze the accounts, and kept sending money to her love rat. Friends were screaming at her to stop it but no, this was true love.\n\nThen the woman with the guy telling her his daughter had died. She then finds out he is a scammer because he told her she was stupid for getting scammed by him. He then makes up with her and scams her out of even more money. HOW?!\n\nThe woman who flew to Sri Lanka to meet up with a hotel bus boy, ended up being proposed to and  then ended up at the dudes parents in a metal shed and no one spoke English. She then gets confused into marriage and flies home, sells her house, takes early retirement, sends funds to build a house in Sri Lanka and when she arrives nothing is finished. Guy then asks for 31,000 pound for  a second hand hi-ace van, which she pays. And is now no longer even talking to her. She then finds postcards from another woman he is married to. Oh my word. \n\nThe woman who broke up with her husband because he cheated on her, but after the divorce kept him on to do her books and defrauded her in the process.\n\nThe woman who was talking to a guy online, didn't really go anywhere, he was rude to her, she cut if off, but he then send her a screenshot of an investment. And she immediately had her head turned, fell for the fake investment app, and got scammed out of 50,000$. LOL\n\nThe woman who met a millionaire, guy was in Dubai for business, but she ended up sending him money because his GB bank account were frozen. She asked him if there was no else who can lend him money. He literally said, yes if I need a million pounds, but not for these small amounts. LOOOOOOL\n\netc et etc.\n\nYou cannot be this stupid. Sorry.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j3co3v/love_rats_show_about_romantic_scams/"
    },
    {
        "id": "1j3kqzd",
        "author": "Internal-Bed-3150",
        "title": "Netflix is making a vampire show based on a popular horror podcast",
        "content": "",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1j3kqzd/netflix_is_making_a_vampire_show_based_on_a/"
    },
    {
        "id": "1j3k6xd",
        "author": "Sheenasa",
        "title": "My favourite chrome extension for subtitles on Netflix just became unsupported. Does anyone know of another good extension?",
        "content": "I watch Netflix in browser on my desktop pc. I find the medium subtitle size to be way too big, and the small one to be too small. So I found an extension that fixed that problem, and it even let me pick how far up or down the subtitles are on the screen. That extension no longer works unfortunately.\n\nDoes anyone know of another extension that lets me have more control over how subtitles on Netflix appear? or have some tips or tricks, or any other solution?\n\nAny help much appreciated. :)\n\nI've included screenshots of how small and medium subtitles appear to me. EDIT: omg why was it so hard to add screenshots lol. kept saying the image was deleted. hopefully it works now\n\n  \nEDIT 2: OK so after some more googling I think I found another promising extension called Language Reactor.  \nAfter playing around with the settings its now much better. \n\n[New extension size](https://preview.redd.it/4896a6lhgqme1.png?width=2560&amp;format=png&amp;auto=webp&amp;s=c17a12bd04328fd31feed88cfd8810e833f3034c)\n\n[Small size](https://preview.redd.it/hqicc6eneqme1.png?width=2560&amp;format=png&amp;auto=webp&amp;s=f2703dc56fe05eb3318af53c1948de55227cb725)\n\n[Medium size](https://preview.redd.it/plfbdeofeqme1.png?width=2560&amp;format=png&amp;auto=webp&amp;s=5315dcf67ce86d196f5a921394d8604fcb4b1387)\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j3k6xd/my_favourite_chrome_extension_for_subtitles_on/"
    },
    {
        "id": "1j3ik7x",
        "author": "Ice-Guardian",
        "title": "How do I cancel my account if someone hacked my account and changed the email to theirs (UK)?",
        "content": "Someone hacked my account just now, I got an email that I'd requested a password change and then got another email saying my email associated with my account has been changed, so I can't sign in to do anything.\n\nWhat's the solution to this? Who do I contact?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j3ik7x/how_do_i_cancel_my_account_if_someone_hacked_my/"
    },
    {
        "id": "1j3h7vp",
        "author": "Teddy_050609",
        "title": "Is this just a me issue is there loads of things missing from Irish Netflix",
        "content": "I noticed recently that a few tv shows have been taken off Irish Netflix which is usually the same as uk Netflix are in longer on Irish Netflix such as downtown abbey the tv series and peaky blinders if anyone has the same issue please help me I feel like I’m going crazy ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j3h7vp/is_this_just_a_me_issue_is_there_loads_of_things/"
    },
    {
        "id": "1j3engk",
        "author": "thequietbookworm",
        "title": "Cannot download Netflix episodes/movies to Windows laptop - alternatives??",
        "content": "As we all know the issue of Netflix removing the download button for episodes on Windows PCs (meaning that we cannot watch Netflix offline anymore during long flights for instance), does someone know an alternative? \n\nA legal website offering movies which I can download on my laptop would be great.\nScreen mirroring from phone to PC also doesn‘t really solve the issue, because why on earth would I want to use my phone for that long unnecessarily just to screen what used to be a built-in function of Netflix on PCs…?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j3engk/cannot_download_netflix_episodesmovies_to_windows/"
    },
    {
        "id": "1j3rh4p",
        "author": "Psychological_Ad1037",
        "title": "My hair stylist was throwing spoilers and scissors about Gabby Petito!",
        "content": "I just need to get this out and maybe even hear worse situations that others have been in (misery lives company?).\n\nHere goes: It's Saturday and I am heading to my hair stylist who just moved salons to one that is 15 minutes farther. I've only been going to her for less than a year. She's pretty good, but it's clear she's not been doing it for long. Anyhow, as I tell her every time, I really just want to zone out today, if you don't mind. She says no problem, then proceeded to talk, and talk, and talk. I'm too polite to not respond to her, so I find myself in full blown chats (as she watches me actually falling asleep, mentally begging her to let me sleep!!!). \n\nEventually, she started talking about Netflix shows, including Gabby Petito. I say to her straight away, \"I haven't seen it yet, so please no spoilers or info!\" She says, \"Okay, I will just tell you what everyone already knows.\" I interrupted her and said that I don't know anything, nada, zip, and I want to go in blind. She assures me she won't give anything away and just dives into the story. She goes on to tell me everything from the first episode. She ends her complete breakdown of what happens - including several spoilers - by saying, \"I can't tell you anything more because I only watched the first episode...see, no spoilers!\" I politely smiled and wondered again, is the drive worth it? \n\nOkay, when I type it out, it doesn't sound that bad. But, it was! I promise it was! I am pretty sure it was. I think it was?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j3rh4p/my_hair_stylist_was_throwing_spoilers_and/"
    },
    {
        "id": "1j39k2e",
        "author": "syris_JesusLovesU",
        "title": "Creeped Out (Side Show: Part 2 episode)",
        "content": "The animal edits in this episode are hilariously horrible. Like they went on google and then inserted the image lol. When the monkeys were about to take Zephaniah, it didn’t even show what happened. The bad edits are just funny lol.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j39k2e/creeped_out_side_show_part_2_episode/"
    },
    {
        "id": "1j2jsij",
        "author": "MysteriousDelay6266",
        "title": "The Electric State | Final Trailer | Netflix",
        "content": "",
        "upvotes": 49,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1j2jsij/the_electric_state_final_trailer_netflix/"
    },
    {
        "id": "1j38p0n",
        "author": "MSLogan07",
        "title": "Good news for WWE fans in Pakistan",
        "content": "I contacted to live agent of Netflix and asked about WWE programming on Netflix Pakistan. and they said it will be shown live and replays too in Pakistan. Good news for us. Also, Wrestlemania coming on April 1 on Netflix Pakistan.\n\nThank God. Finally Sony doesn't have rights for our region and we can watch it live too.\n\n[Wrestlemania Coming on April 1 on Netflix Pakistan](https://preview.redd.it/h77ggbypvnme1.jpg?width=927&amp;format=pjpg&amp;auto=webp&amp;s=dbbb61c0e0ff0e757b1ef73541608e3700e754fc)",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j38p0n/good_news_for_wwe_fans_in_pakistan/"
    },
    {
        "id": "1j375p7",
        "author": "P80overGlock",
        "title": "Need help finding an old tv show",
        "content": "It was a long time ago I would say like 2015-16 it was show about a city with random people around the city that had some type of power and their where people that had to defeat them when they use their powers to commit crimes\nPlease help me find it thank u 🙏 ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1j375p7/need_help_finding_an_old_tv_show/"
    },
    {
        "id": "1j36kwd",
        "author": "jokur07",
        "title": "how do i fix this issue?",
        "content": "https://preview.redd.it/nbbf8szrzmme1.png?width=994&amp;format=png&amp;auto=webp&amp;s=fa655105d342742762575b9323addd41667ee9de\n\nits so annoying when this happen and i cant watch netflix anymore, im a premium netflix user and we only have 5 members using and in the premium account it says we can only add 6 members on it, and this sht been bugging me lately and also i dont have any extra members \n\nhttps://preview.redd.it/9ezwjwb70nme1.png?width=1158&amp;format=png&amp;auto=webp&amp;s=86e33498edabe23f37cccebc18b3ac71d92d7ea1\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j36kwd/how_do_i_fix_this_issue/"
    },
    {
        "id": "1j2yv2n",
        "author": "Lullaby_of_Broadway",
        "title": "Looking for a certain true crime documentary that had animation",
        "content": "Looking for a true crime documentary I saw on Netflix about a teenage murder. What set it apart was that to hide each kids identity they animated them. Does anybody know?",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j2yv2n/looking_for_a_certain_true_crime_documentary_that/"
    },
    {
        "id": "1j31tue",
        "author": "Substantial-Area9201",
        "title": "Medusa trailer language spoken",
        "content": "Which language was it? Sounds like Spanish, unfortunately I'm not familiar enough with other languages to know for sure that it is Spanish and if so which Spanish specifically ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j31tue/medusa_trailer_language_spoken/"
    },
    {
        "id": "1j2sv9c",
        "author": "rachiepants2017",
        "title": "Did anyone else love Elite? Danna Paola's latest interview makes me want to rewatch!",
        "content": "",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1j2sv9c/did_anyone_else_love_elite_danna_paolas_latest/"
    }
]