[
    {
        "id": "1jc5dnt",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement: Ana de Armas - Thursday 5/15 at 12:00 PM ET - Star of Ballerina, Knives Out, Blonde, Blade Runner 2049, No Time To Die, Ghosted, The Gray Man, Deep Water",
        "content": "",
        "upvotes": 826,
        "comments": 131,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ml59cp306xoe1.png?auto=webp&amp;s=87978abf99e5d5093cea308eac8d21af24e0ee3f"
        },
        "permalink": "/r/movies/comments/1jc5dnt/amaqa_announcement_ana_de_armas_thursday_515_at/"
    },
    {
        "id": "1jc3g7s",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement: Kelly Marie Tran - Monday 3/17 at 1:00 PM ET - Star of Raya and the Last Dragon, The Croods: A New Age, Control Freak, Star Wars: The Last Jedi, The Wedding Banquet",
        "content": "",
        "upvotes": 77,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7kkdptrnqwoe1.png?auto=webp&amp;s=1f6b3afd76013a178178305ad471b16e98131c7c"
        },
        "permalink": "/r/movies/comments/1jc3g7s/amaqa_announcement_kelly_marie_tran_monday_317_at/"
    },
    {
        "id": "1jcbw8g",
        "author": "Morganbanefort",
        "title": "Tom Cruise's Villain in 'Collateral' Still Rules 20 Years Later",
        "content": "",
        "upvotes": 10077,
        "comments": 696,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FXWR-O-uAWXTn8Kw6rsJzoJEpNB_ToyTIGBx14GMoSQ.jpg?auto=webp&amp;s=f91a90bcfb1d5e2fafd4081a5c5e749e6a997c66"
        },
        "permalink": "/r/movies/comments/1jcbw8g/tom_cruises_villain_in_collateral_still_rules_20/"
    },
    {
        "id": "1jcispa",
        "author": "LarryKeene",
        "title": "Which comedy film delivered the biggest laugh of your lifetime?",
        "content": "I love comedy movies but a lot of movies that are labelled as 'funny' just don't make me laugh.\n\nI want a comedy to leave me with aching jaws and tears streaming down my face.\n\nWhich comedy movies have you seen that have left you unable to breathe from laughing so much?\n\nI don't mean gentle rom coms or high brow comedy that you really have to think about.\n\nI want those movies that are so outrageously funny they leave your sides aching.\n\nI'll start with 4 - 'Raising Arizona', 'Top Secret', 'Four Lions', and 'Monty Python's Life of Brian'.",
        "upvotes": 506,
        "comments": 2030,
        "media": null,
        "permalink": "/r/movies/comments/1jcispa/which_comedy_film_delivered_the_biggest_laugh_of/"
    },
    {
        "id": "1jclb4t",
        "author": "Amaruq93",
        "title": "\"The Great Outdoors\" (1988) | Almost Cult Classics",
        "content": "",
        "upvotes": 251,
        "comments": 69,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/udYnEgXXyj7Vs6SGyMrmRZSFrTtUPPBt0oxCBQjJ-Eo.jpg?auto=webp&amp;s=160c1a892dd6126037bce20f6aa13a32f944162a"
        },
        "permalink": "/r/movies/comments/1jclb4t/the_great_outdoors_1988_almost_cult_classics/"
    },
    {
        "id": "1jcmjws",
        "author": "ChrisEye21",
        "title": "\"Bad\" Movies You Still Like",
        "content": "Plenty of movies out there that are considered \"bad\". \n\nName a movie (less than 50% Rotten Tomatoes score) that you still like. I'll Start:\n\n\n\nIn Time (2011)\n\n\n\nMaybe its just the idea behind it that I like, im not sure. I know the movie could have been better. But I still enjoy it...but dont get me started on that awful poker scene.",
        "upvotes": 80,
        "comments": 519,
        "media": null,
        "permalink": "/r/movies/comments/1jcmjws/bad_movies_you_still_like/"
    },
    {
        "id": "1jc8t7z",
        "author": "OneFirefighter1233",
        "title": "12 angry men Is the most interesting movie i've ever watched",
        "content": "Hi, so first and foremost i know it's one of the greatest movies ever made, well i didnt know It until Yesterday when i watched the movie, i only knew that It was a good film and i wanted to Watch It.\n\nIt's incredible that a movie made 60+ years ago and shot mainly in One room, with 90% of the script which Is characters talking to each Other, sits as the most interesting movie i've ever watched in my life. \n\nListen, i'm not a cinephile and i dont know really nothing about cinema, i watched some movies but forgot most of them, i only care for the plot and what Is going on, if that movie keeps me interested Is good, if not i move on, and this movie Is the best thing i've ever watched, and i'm not exaggerating.\n\nI didnt find something in my life that hooked me so much and i recommend everyone to at least give a try if you didnt watch it",
        "upvotes": 994,
        "comments": 133,
        "media": null,
        "permalink": "/r/movies/comments/1jc8t7z/12_angry_men_is_the_most_interesting_movie_ive/"
    },
    {
        "id": "1jcl1lq",
        "author": "solis_the_novice_pro",
        "title": "Watching SOUL while depressed.",
        "content": "I just watched soul for the first time based on a coeworkers recommendation to me. I was freaking out because someone asked me when I want to do with my life, what I want to learn, any skills or knowledge I’m interested in, and I started freaking out. I don’t know. I don’t even know what I like to do for fun when I’m not at work; I just go about my day and a lot of the time I find myself sitting and waiting for the time to just pass. \nAnyways she told me to watch Soul and or inside out (I have never seen either of them), so I watched soul.\n\nFirst 30 minutes were depressing as fuck\nThe next hour was fun and entertaining\nand the last 20 ish minutes was devistating. She told me it’s supposed to be bitter sweet but I don’t get it. I just felt the movie was to relatable and it reinforced that I am not good enough and that I don’t have any purpose to be alive. \nI don’t see my therapist for a few days but I can’t hold this in. I’m internally panicking and I’m so lost.",
        "upvotes": 83,
        "comments": 23,
        "media": null,
        "permalink": "/r/movies/comments/1jcl1lq/watching_soul_while_depressed/"
    },
    {
        "id": "1jc1ifd",
        "author": "BunyipPouch",
        "title": "First Poster for 'Neighborhood Watch' - Starring Jack Quaid &amp; Jeffrey Dean Morgan - When a mentally ill young man witnesses an abduction and the police refuse to believe him, he reluctantly turns to his next door neighbor- a bitter, retired security guard- to help him find the missing woman.",
        "content": "",
        "upvotes": 2568,
        "comments": 179,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/oa1vq485bwoe1.jpeg?auto=webp&amp;s=0e5cc4c3ef6abf9489f41d99c67a39fddb77b61d"
        },
        "permalink": "/r/movies/comments/1jc1ifd/first_poster_for_neighborhood_watch_starring_jack/"
    },
    {
        "id": "1jcdni4",
        "author": "WinstonMarrs",
        "title": "The ER doctor in Heat is a real doctor",
        "content": "I was rewatching Heat (for like the 50th time in my life at this point).  I was having fun laughing at some of the stuff that I now see as overly dramatic but I found cool when I was younger.\n\nAnyways, once it got to the hospital (filmed at St Mary's in Long Beach) scene where Lauren is taken after Pacino finds her in the tub, I was very impressed by the actors in that scene - they seemed to really memorize their hospital lingo and make it believable.  But as I watched more, I kinda felt like the main doctor had to have been someone they just found at the hospital they filmed at and told him to \"pretend this just happened\".\n\nSo I wound up doing some quick research on imdb and got his name, but he's not credited in any other movie.  Some google searching led me to his profile, and everything seems to line up and definitely looks like he was a real doctor, pretty cool:\n\nhttps://preview.redd.it/8buza1izazoe1.png?width=2080&amp;format=png&amp;auto=webp&amp;s=8e1e96c63c1d057eb2e7ec47a521cec51c3f5e27\n\nAlso, I think the blonde nurse is also a real nurse too, she seems way to natural in her actions in that scene.",
        "upvotes": 243,
        "comments": 51,
        "media": null,
        "permalink": "/r/movies/comments/1jcdni4/the_er_doctor_in_heat_is_a_real_doctor/"
    },
    {
        "id": "1jchxgr",
        "author": "dxdx_",
        "title": "Eternal Sunshine of the Spotless Mind - a subtle implication that seems to have slipped through the cracks",
        "content": "I’ve searched high and low for references to this scene and what others took from it, but it seems no one else in the entire universe has picked up on it (at least not anyone that feels the need to share every waking thought online, anyway).\n\nThere is a scene where Mary walks over to Dr Mierzwiak’s car to chat with him. Shot from Stan’s perspective, they both look back at him and laugh amongst themselves, with Stan and the viewer unaware exactly what it is they’re laughing about. At some point in the film (it’s been a while), Stan confesses his love for Mary. In my mind, the clear implication from the conversation between Mary and Dr Mierzwiak is that Stan has at some point had Mary erased, and is now unknowingly falling for her again, something Mary and Dr Mierzwiak find to be comical.",
        "upvotes": 87,
        "comments": 14,
        "media": null,
        "permalink": "/r/movies/comments/1jchxgr/eternal_sunshine_of_the_spotless_mind_a_subtle/"
    },
    {
        "id": "1jca70y",
        "author": "HughJManschitt",
        "title": "Anybody's parents let them pick out movies to watch they thought were \"family friendly\" but turned out to not be?",
        "content": "Mine was \"A Perfect World\" starring Kevin Costner and Clint Eastwood. It came out in 1993, and I'm pretty sure I was closer to 7-8 when I watched it. The reason my mother let me pick it out (from a VHS RENTAL STORE, GASP HOW ANTIQUATED) was because it had a kid in a ghost face costume on it walking with a guy she must have assumed was his father (Costner).\n\n  \nNah, this was about a pair of murderers who break out of prison and kidnap said kid, kind of a road movie with Eastwood as the Texas Ranger chief who is chasing them. It's worth a watch, it's a decent movie directed by Eastwood however as a kid it was scary to me. The ending is a gut punch too, was one of my first \"anti-hero\" sad movies. \n\nAnyway, anybody else got stories like this?",
        "upvotes": 397,
        "comments": 661,
        "media": null,
        "permalink": "/r/movies/comments/1jca70y/anybodys_parents_let_them_pick_out_movies_to/"
    },
    {
        "id": "1jc50kh",
        "author": "Drakhanfeyr",
        "title": "Alien Romulus - WOW!",
        "content": "I was in high school when the first Alien movie came out, I've seen all of them and I love the series.  Decades later, I thought I might not enjoy Alien Romulus. Boy was I wrong. This film has new, younger characters who are believable and (mostly) likeable, a well-written story, interesting subplots/ back stories which don't detract from the main storyline, a new artificial life character who is different from any we have seen before, plus some tub-thumping one-liners which pay homage to Ripley. This is probably the second best movie of the entire franchise, after Aliens.",
        "upvotes": 553,
        "comments": 386,
        "media": null,
        "permalink": "/r/movies/comments/1jc50kh/alien_romulus_wow/"
    },
    {
        "id": "1jcdq5e",
        "author": "CamaroLover2020",
        "title": "Biggest Movie Achievement in history..",
        "content": "For me it's the movie \"Coherence\" they had a budget of only $50,000, they didn't use ANY scripts, and it only took 5 days to film, and it's actually a very good movie.....probably one I'll watch again in a couple years to understand it better...as it's a mind trip, and takes more than one sitting to get everything that's going on.",
        "upvotes": 88,
        "comments": 93,
        "media": null,
        "permalink": "/r/movies/comments/1jcdq5e/biggest_movie_achievement_in_history/"
    },
    {
        "id": "1jcn10i",
        "author": "UmpireMental7070",
        "title": "What are some other good movies like Taken, Nobody, The Equalizer?",
        "content": "Looking for more good movies where the protagonist is a seemingly normal family man type who is actually a highly trained professional like ex-special forces, etc who goes on an ass-kicking spree in search of revenge after bad guys mess with their family or other innocent people.  There has to be a bunch more movies in this genre to add to my list.",
        "upvotes": 16,
        "comments": 93,
        "media": null,
        "permalink": "/r/movies/comments/1jcn10i/what_are_some_other_good_movies_like_taken_nobody/"
    },
    {
        "id": "1jc3qga",
        "author": "soviet_turd",
        "title": "the use of color in \"Her\" is just genius",
        "content": "I'll begin by saying that this movie is absolutely one of the most beautiful films ive ever seen. The bright colors (red, orange, yellow and green) have such an impact on the vibe of the film. With that said, Theo wears ALOT of red and orange colors. Similarly, the OS1 primary color is a bright orange which matches his shirt in the posted frame. Colors like red and pink symbolize love, and In this case, the start of Theodore and Samanthas romantic journey. Theodore continues to wear these bright orange/red shirts during the \"Honeymoon phase\" (as Theodore calls it) of their relationship. It signifies a healthy beginning to true love.\n\nHowever, as we dive into the issues that Theo and Sam face, he wears more neutral colors such as pale blue and white. When Sams prostitute shows up, Theo is wearing a white shirt. In this moment Theo is extremely uncomfortable, as he is being asked to have sex with someone hes never met by his computer girlfriend. This ultimately causes a pretty deep split between the two, probably the biggest we see in the whole movie aside from the breakup.\n\nAlthough It is a pretty obvious detail, the color usage is a very nice touch in my opinion. I love that colors symbolize the strength and status of Theo and Sams relationship as the movie plays on.\n\nhttps://preview.redd.it/6vmtsjj4twoe1.jpg?width=1064&amp;format=pjpg&amp;auto=webp&amp;s=9c0480a652ffe064fcd40d642c62d3100348a651\n\n",
        "upvotes": 375,
        "comments": 29,
        "media": null,
        "permalink": "/r/movies/comments/1jc3qga/the_use_of_color_in_her_is_just_genius/"
    },
    {
        "id": "1jcnuhl",
        "author": "Switch_Empty",
        "title": "Victims of the format wars. Movies that never got a release on VHS or DVD/Blu-ray?",
        "content": "Kind of an esoteric question but were there any movies that were released on betamax or other formats (laserdisc, HD DVD, etc) that never got a VHS or DVD/Blu-ray release? \n\nI know there are many movies that were released on VHS that have never gotten (and sadly probably never will) a DVD release. My question is about those formats that \"lost\" the format wars like betamax, HD DVD, laserdisc, etc.\n\nI know there's exclusives that were only found on certain formats. (The laserdisc of E.T. is the only one that has the Harrison Ford cameo for example.) Also some soundtracks/mixes and interviews that were only found on some formats. My interest is mostly in whole movies but I'm not going to be mad if someone shares knowledge otherwise.",
        "upvotes": 7,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1jcnuhl/victims_of_the_format_wars_movies_that_never_got/"
    },
    {
        "id": "1jcobtd",
        "author": "Vegetable-Ferret8241",
        "title": "Who remembers Lisa Eilbacher from An Officer and a Gentleman and Beverly Hills Cop.?",
        "content": "How did you guys find her and was she a big A star in the 80s compare to her other actress from the 80s era of films with her only having such big hits films as she was known for like An Officer and a Gentleman and Beverly Hills Cop film and why didn't she return for the Beverly Hills Cop 4 film that was released last year on Netflix well.",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1jcobtd/who_remembers_lisa_eilbacher_from_an_officer_and/"
    },
    {
        "id": "1jc02a4",
        "author": "Buffalo_wing_eater",
        "title": "Really enjoyed watching L.A. Confidential",
        "content": "The film excels in every aspect to make a good film about police and investigating. Although I was not well-acquainted with the film prior to viewing, the title struck a chord with me, and I was thoroughly impressed throughout. It is arguably one of the finest, if not the best, police investigation films I have ever encountered.",
        "upvotes": 375,
        "comments": 120,
        "media": null,
        "permalink": "/r/movies/comments/1jc02a4/really_enjoyed_watching_la_confidential/"
    },
    {
        "id": "1jbus8b",
        "author": "Scarpine1985",
        "title": "Question about Rampart (2011) staring Woody Harrelson (delicate issue discussed)",
        "content": "Is the implication that Woody's character has molested his daughters? The film seems to drop oblique hints, but does not address it directly:\n\n- In the opening scene, he has an uncomfortable conversation with the lady cop asking if her daddy ever \"disciplined\" her.\n\n- He has a very weird family dynamic where he has fathered each daughter by two sisters, and they all live together. The younger daughter is even a bit confused by this and ask if she's the product of incest.\n\n- The older daughter despises him and becomes very upset whenever he touches her.\n\n- There's a scene where he invites the younger daughter to watch TV with him instead of doing homework, and says \"we won't yell mom.\" He sits on the couch with his arm around her, and the camera lingers on him as he looks at her.\n\n- In the scene where the daughters visit him in the hotel room, he says \"I've never hurt you\" and the you ger daughter becomes upset to the point where she can't even speak and the older daughter rushes her out.\n\nIs this what the film was implying?",
        "upvotes": 795,
        "comments": 229,
        "media": null,
        "permalink": "/r/movies/comments/1jbus8b/question_about_rampart_2011_staring_woody/"
    },
    {
        "id": "1jcl7dg",
        "author": "BDJohnSquires",
        "title": "The Toxic Avenger Made an Appearance on the Green Chicago River for St. Patrick's Day",
        "content": "",
        "upvotes": 10,
        "comments": 10,
        "media": null,
        "permalink": "/r/movies/comments/1jcl7dg/the_toxic_avenger_made_an_appearance_on_the_green/"
    },
    {
        "id": "1jc5gqy",
        "author": "Calzonieman",
        "title": "I saw 3 billboards outside Ebbing Missouri when it came out, but just rewatched it again and came away far more impressed.",
        "content": "I must have been preoccupied, or in a crappy mood or something the first time, because while I didn't dislike it, I didn't remember being overly impressed.\n\nThis time, I was fully focused and came away giving it a 9+stars.\n\nI've always enjoyed Francis McDormand and Woody Harrelson, and I've always though Sam Rockwell was totally underrated, but the performances of Peter Dinklage was a role that I'd never seen him play, and was amazing. I don't remember John Hawkes being in this, and he's superb in every role he plays.\n\nAnyway, I'd recommend anyone checking this out again, or definitely catch it if you've never seen it before.",
        "upvotes": 164,
        "comments": 79,
        "media": null,
        "permalink": "/r/movies/comments/1jc5gqy/i_saw_3_billboards_outside_ebbing_missouri_when/"
    },
    {
        "id": "1jc2q5l",
        "author": "Sergio_Ro",
        "title": "Name a bad or painfully mediocre movie with a surprisingly good ending",
        "content": "I’ll start, and to clarify, by ending I don’t mean an entire third act, but rather just the final 5-10 minutes or so that for some reason prove way more enjoyable than what the movie was letting on might happen.\n\nMy pick is Death Note.\n\nI feel as though the source material would have been enough to make a great movie, but instead we ended up with this Final Destination doppelgänger. So many things didn’t land right, and yet I thoroughly enjoyed the ending, how it came together, the music they used to set the mood and LaKeith Stanfield’s performance.",
        "upvotes": 213,
        "comments": 527,
        "media": null,
        "permalink": "/r/movies/comments/1jc2q5l/name_a_bad_or_painfully_mediocre_movie_with_a/"
    },
    {
        "id": "1jc8h2y",
        "author": "dimestorepublishing",
        "title": "\"The Last Witch Hunter\" A terrible movie that I loved",
        "content": "Okay, so yes, this is a bad movie, B movie all the way, was not stunning, was not amazing, but damn it dude, I had a blast watching this, like, Vin Disel doing all his most Vin Diseliest things, stupid plot, totally ridiculous, for some reason Michael Cane is in this thing. \n\nI did some research and found out that, much like Riddick, this movie was based on one of Vin's DnD characters. Like, all us dorks out there who play table top think \"Man a movie about my character would be so awesome,\" and spoiler, no, it would be stupid, and we have proof of that BECAUSE THERES A GUY OUT THERE NAMED VIN DISEL WHO SOMEHOW GOT ENOUGH MONEY TO MAKE MOVIES BASED ON HIS CHARACTERS and they're terrible, but they're so FUCKING fun!\n\nThe entire movie is tropes, EVERY scene, is a trope, its kind of amazing, I had a blast watching this 4/5 would recommend.",
        "upvotes": 88,
        "comments": 33,
        "media": null,
        "permalink": "/r/movies/comments/1jc8h2y/the_last_witch_hunter_a_terrible_movie_that_i/"
    },
    {
        "id": "1jcm64f",
        "author": "Berd_Nerd",
        "title": "I rarely watch movies outside of the pop culture sphere, yet I watched \"Jeanne Dielman, 23 quai du Commerce, 1080 Bruxelles\" and absilutely loved it",
        "content": "I've been seeing videos about the Criterion Closet for years now, so when I saw a stack of them in stores I picked one up at random and found I had pick Jeanne Dielman. I had no idea what the movie was abut, let alone that it was over 3 hours of the most mundane subject matter. Despite my inexperience with a larger movie portfolio, I still ended up loving this. What I found quite different about thsi movie form everything else I've ever watched is the lack of dialogue and busy on-screen motions is it gives you so much time to think about Jeanne and how she's acting. You can process through how she goes about her days in relation to you, and reckon with your preconceptions about what a home life is like for women like her. The buildup is long and nessecary so that it feels completely natural when she snaps in the last 10 minutes. I could totally see me never watching this again, but I'm really glad I went way out fo my comfort zone and tried something totally unique. It has really made me rethink waht exactly a movie is supposed to be.",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1jcm64f/i_rarely_watch_movies_outside_of_the_pop_culture/"
    },
    {
        "id": "1jco8gm",
        "author": "Arm_chair_gawd",
        "title": "Soylent Green",
        "content": "Charleston Heston movie that was ahead of its time and a dire warning as well.\nSOYLENT GREEN was a typical sci-fi dystopian movie from the 70 ‘s when Heston’s career was being regulated to such movies and campy disaster movies. \n\nCharleton Heston’s career was a shadow of its former self after appearing in Beneath the Planet of the Apes but he had one last hurrah in SOYLENT GREEN when it comes to movies with important messages or warnings. He plays a NYC detective that investigates the company behind Soylent Green, a superfood whose ingredients are unknown to the public.\nThe movie addresses climate change, food supply, and overpopulation in a very dark manner. It was years before any of these subjects took center stage but Soylent Green was ahead of the curve. Makes you think about where today’s processed food actually comes from and the effects it’s having on the general population. Add additional comments.\n\nIts a very dark movie but in 70’s people had access to healthier foods than we do today and I suspect if the situation ever came down to it, our government would feed us human remains while the rich and privileged get to enjoy real food.\nWe are approaching that time as corporations are considering feeding us bugs and drink cockroach milk.\nAnyway after SOYLENT GREEN, Heston did another dystopian movie called THE OMEGA MAN where in the end his blood provides a cure for a virus turning people into vampires. From that point on it was EARTHQUAKE and AIRPORT 75 and roles in lesser movies and TV shows until his final role in 2003. \n",
        "upvotes": 5,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/L0AHiioDqlrbDAFEj8SUcN6w7orVv_faVdAfDHEkIoM.jpg?auto=webp&amp;s=5725127f32ab509c17dfca9287552213a40b0f81"
        },
        "permalink": "/r/movies/comments/1jco8gm/soylent_green/"
    },
    {
        "id": "1jbtddq",
        "author": "sp0rkah0lic",
        "title": "Rewatching The Royal Tenenbaums and crying at the end",
        "content": "Yeah I'm drunk. Yeah I've seen it 20 times . Maybe some AI auto mod will flag me. But I don't care. I\"ve loved this movie for 20 years. It's basically perfect. I watched Crimson Tide and Enemy of the State tonight too. RIP Gene you're amazing and we will never forget you. He died saving all of us from a sinking battleship and idgaf what CNN says. ",
        "upvotes": 618,
        "comments": 148,
        "media": null,
        "permalink": "/r/movies/comments/1jbtddq/rewatching_the_royal_tenenbaums_and_crying_at_the/"
    },
    {
        "id": "1jceeyu",
        "author": "Possible-Fee5688",
        "title": "Any Korean film recommendations?",
        "content": "I’ve seen most of bong joon hos work. I’ve seen some of Lee Chang dong. I actually love all of Bong joon hos movies. I want to know if there are any other movies I should check out. I although snow piercer is often undervalued I reallly really love that movie. Parasite, jeez everyone knows about that movie absolute masterpiece. ",
        "upvotes": 24,
        "comments": 120,
        "media": null,
        "permalink": "/r/movies/comments/1jceeyu/any_korean_film_recommendations/"
    },
    {
        "id": "1jcp8a8",
        "author": "TheJedibugs",
        "title": "Is there a name for the style of films like Unfriended and Searching? IE: Narrative told through computer screens.",
        "content": "It’s similar to cinema verite, but that terms doesn’t really seem appropriate, but I can’t find anything that names this particular style. Have any of you guys heard this classified by a particular name/term? There was even an episode of Modern Family shot in the same way. It’s been catching on and around for more than a few years now, so it seems like it should have its own name.\n",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1jcp8a8/is_there_a_name_for_the_style_of_films_like/"
    },
    {
        "id": "1jbdmzg",
        "author": "MarvelsGrantMan136",
        "title": "New ‘Starship Troopers’ Movie in the Works from ‘District 9’ Filmmaker Neill Blomkamp",
        "content": "",
        "upvotes": 9398,
        "comments": 1021,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Tw9WB0JXhuexfEQgFQ4nNh0q2Qa6w4OTY4L9JJZoS3I.jpg?auto=webp&amp;s=b9585ec2082066cb9910c00fb3981f4bd30dcc4b"
        },
        "permalink": "/r/movies/comments/1jbdmzg/new_starship_troopers_movie_in_the_works_from/"
    },
    {
        "id": "1jcflze",
        "author": "BaxterFax",
        "title": "Are there any must watch silent films?",
        "content": "I’m interested in expanding my knowledge and appreciation of all sorts of films, one genre that I’ve had trouble with are silent films.\n\nI haven’t given them too much of a chance though, I’ve only tried watching a couple and wind up getting bored.  (The Birth of a Nation and Alice in Wonderland 1915)\n\nI still found these very interesting and they were definitely impressive considering the time period, but I don’t think I could sit there and watch the entirety of these.  \n\nAre there any silent films that are too great to pass up, or maybe this genre just isn’t for me?  ",
        "upvotes": 15,
        "comments": 118,
        "media": null,
        "permalink": "/r/movies/comments/1jcflze/are_there_any_must_watch_silent_films/"
    },
    {
        "id": "1jcopkn",
        "author": "Unlucky-Bug2412",
        "title": "Which movie villain do you secretly root for and why?",
        "content": "It's a common trope to root for the hero, but sometimes, the villains steal the show. From their charismatic presence to their complex motives, some antagonists are just too compelling to disregard. For example, many people find themselves rooting for Thanos in *Avengers: Infinity War* due to his philosophical, albeit flawed, reasoning. Who's your favorite movie villain that you secretly (or not so secretly) cheer on, and what makes them so appealing?\n\nhttps://preview.redd.it/ak1cktkdr2pe1.jpg?width=334&amp;format=pjpg&amp;auto=webp&amp;s=cf213f6190124726aba6b4f9833bdcc495500c84\n\n",
        "upvotes": 3,
        "comments": 33,
        "media": null,
        "permalink": "/r/movies/comments/1jcopkn/which_movie_villain_do_you_secretly_root_for_and/"
    }
]