[
    {
        "id": "1j0tp5q",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1j0tp5q/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1j0tp69",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1j0tp69/la_piola_friends_meetup/"
    },
    {
        "id": "1jch2ou",
        "author": "gwhiz97",
        "title": "Best pizza in Turin",
        "content": "We have one day in Turin today after skiing in Aosta before flying back home - want to get a great pizza today there, where’s the best place to go?\n\nNothing too flashy, proper down to earth place would be great!\n\nAny other Turin tips please shout!",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1jch2ou/best_pizza_in_turin/"
    },
    {
        "id": "1jc2u19",
        "author": "mandrake_55",
        "title": "Consigli Bracierie a Torino?",
        "content": "Mi consigliate delle bracierie a TO e zone limitrofe con un buon rapporto qualità prezzo?\nNon cerco un locale fighetto, ma della buona carne a prezzi onesti",
        "upvotes": 4,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1jc2u19/consigli_bracierie_a_torino/"
    },
    {
        "id": "1jbwijt",
        "author": "_L_-",
        "title": "Corsi di Teatro a Torino :)",
        "content": "Ciao, conoscete dei corsi di teatro a Torino che consigliereste come hobby? \n\nMagari qualche corso che faccia una prima lezione gratuita",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jbwijt/corsi_di_teatro_a_torino/"
    },
    {
        "id": "1jbtcad",
        "author": "Anxious-Sloth7919",
        "title": "Bbq",
        "content": "Ciao, dove posso trovare posti barbecue gratuiti nei parchi vicino al centro città?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1jbtcad/bbq/"
    },
    {
        "id": "1jbx6cf",
        "author": "Repulsive-Yak-126",
        "title": "Sushi buffet",
        "content": "Cia tutti,  do u know a good sushi buffets here in Torino. And their rules, because in some of them u can only order 7 dishes and etc.\nThank you in advance!",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1jbx6cf/sushi_buffet/"
    },
    {
        "id": "1jbue6l",
        "author": "New-Frosting-3636",
        "title": "Comprare casa a Torino",
        "content": "Ciao a tutti, guardando su i vari siti di annunci immobiliari noto un certo mismatch tra i prezzi degli affitti e quelli per l'acquisto (in parole povere: rata del mutuo a 10/15 anni inferiore o simile all'affitto per un un appartamento equivalente). Qualcuno ha qualche insight a riguardo?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jbue6l/comprare_casa_a_torino/"
    },
    {
        "id": "1jbrr6r",
        "author": "Eilex-",
        "title": "Sfm",
        "content": "Buongiorno a tutti, tutta questa settimana sarò a Torino, precisamente a Carmagnola, vorrei raggiungere la città tramite i treni sfm4/7, sul sito Trenitalia c’è scritto che nelle ore di punta ci sono dei treni di rafforzamento, ma consultando l’orario non ho trovato nulla, potreste aiutarmi? Grazie e buona giornata ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1jbrr6r/sfm/"
    },
    {
        "id": "1jbrgd0",
        "author": "Intelligent-Deal-759",
        "title": "Partita di calcetto domenica 18-19",
        "content": "Ciao ragazzi vorreste giocare a calcetto 18-19 zona aurora? \nMancano 2, per favore famo sconto 50%",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jbrgd0/partita_di_calcetto_domenica_1819/"
    },
    {
        "id": "1jbat6l",
        "author": "Wise_Personality4178",
        "title": "Why is almost everyone I pass by super vigilant of pickpocket",
        "content": "I may not dress very well, and when I pass people by on the street, they always hold their bag or put their hands into their pockets, as if I’m going to steal their things? I don’t get it. Back in Spain, I didn’t come across such kind of situation. I’m Asian by the way. Why is that? Is it just me or something normal? I’m a highly sensitive person and have been keeping a certain social distance from others for a long time, and now to avoid being mistaken, I keep an even larger distance from people I meet on the street, in the supermarket, etc. I don’t know how to go on living like that in Turin, is there any suggestion for me? Thanks in advance. ",
        "upvotes": 8,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1jbat6l/why_is_almost_everyone_i_pass_by_super_vigilant/"
    },
    {
        "id": "1jb0icy",
        "author": "MaleficentHurry8609",
        "title": "Life hacks torinesi",
        "content": "Condividete tutti quei segreti e rivelazioni frutto di anni passati in questa città e che vi hanno reso la vita più semplice e piacevole (scoprire negozi convenienti, locali interessanti o qualsiasi altra cosa)!",
        "upvotes": 35,
        "comments": 30,
        "media": null,
        "permalink": "/r/torino/comments/1jb0icy/life_hacks_torinesi/"
    },
    {
        "id": "1jbabmv",
        "author": "Bitter_Impression_63",
        "title": "Cena con delitto",
        "content": "Ciao a tutti, io e i miei amici volevamo partecipare ad una cena con delitto o comunque un'esperienza in stile escape room in cui bisogna risolvere un caso. Avete dei consigli?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jbabmv/cena_con_delitto/"
    },
    {
        "id": "1jbq4kp",
        "author": "GaoHua",
        "title": "Ragazza orientale da Gao Hua - Chieri",
        "content": "Cenavo da solo da Gao Hua a Chieri giovedì sera, al tavolo di fronte c'eri tu, con un ragazzo, ed eri bellissima, i tuoi tratti orientali e la tua pelle olivastra, i nostri incroci di sguardi sono stati intensissimi, soprattutto l'ultimo quando sono uscito.\n\n",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1jbq4kp/ragazza_orientale_da_gao_hua_chieri/"
    },
    {
        "id": "1jb8tnu",
        "author": "Pascu_tv",
        "title": "Carta Musei Piemonte",
        "content": "Ciao Raga sono a Torino da pochi giorni e ho preso la carta Musei del Piemonte, che mi consigliate da vedere di bello/poco conosciuto? So che questo weekend è aperto il primo Parlamento d'Italia 😁\n\nP.s. se qualcuno si offrisse di farmi (M25) da guida di persona anche meglio!",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1jb8tnu/carta_musei_piemonte/"
    },
    {
        "id": "1jb07kj",
        "author": "reare0",
        "title": "Tricks torinesi",
        "content": "Ciao gente, ho necessità di compiere due cose: il cambio montatura degli occhiali e il comprarmi un telefono nuovo. Avete in mente qualche posto dove si risparmia per l'uno e per l'altro. Grazie 🎈",
        "upvotes": 9,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1jb07kj/tricks_torinesi/"
    },
    {
        "id": "1jb7wr5",
        "author": "Geeksaurus",
        "title": "Distributore luce",
        "content": "Buonasera.\n\nVolevo chiedere se per caso la mia fosse un'esperienza unica o se qualcun'altro ha avuto a che fare con un certo distributore di elettricità (che non so se nominare). \n\nMi spiego: io mi sarei dovuto trasferire a None a inizio Marzo, spostandomi da Torino. Ho firmato il contratto il 17/2 e il giorno stesso ho attivato con Enel le pratiche di luce e gas. La fornitura gas è andata a buon fine, tant'è che ho avuto l'appuntamento col tecnico il 19 per accendere il gas, ed è proceduto tutto per il meglio.\n\nPer la questione luce, invece, sono rimasto in un oblio del quale non vedo il fondo: la mia pratica è bloccata dal 17/2 in quanto rifiutata dal distributore, dato che sui loro sistemi è rimasta \"in lavorazione\" una pratica di cessione dell'inquilino precedente. La cosa più irritante è che non solo non ho vere informazioni sullo stato della situazione, ma sembra che dovrò aspettare fino al 28/3 perchè venga superata la cosa, permettendo poi dal 31 (perchè mica si lavora nel weekend) l'inizio dei 5 giorni lavorativi entro i quali verrà attivata la luce.\n\nQualcuno ha avuto problemi simili? Siete riusciti a risolvere? Io non so nemmeno come contattare i tecnici del distributore, dato che il centralino non ha (o si rifiuta di darmi) un contatto.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jb7wr5/distributore_luce/"
    },
    {
        "id": "1jb4krw",
        "author": "Melodic-Dirt-5512",
        "title": "Controllo IREN contatore gas e contatore segnato in bolletta.",
        "content": "Ciao ragazzi, ieri è venuto un tipo, a chiedere informazioni per comprare il consumo segnato nel contatore del gas e il numero segnato in bolletta. Mi ha detto che serviva sostanzialmente per tutelarci. Ma non mi fido troppo. Io ho un contratto con Plenitude che compra il gas da italgas se non sbaglio, non da Iren, quindi non capisco il perché di questo controllo. \n\nÈ una truffa o proverà a rifilarmi un nuovo contratto per \"tutelarmi\" dal libero mercato?\n\nGrazie in anticipo",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1jb4krw/controllo_iren_contatore_gas_e_contatore_segnato/"
    },
    {
        "id": "1jahqsf",
        "author": "dkroods",
        "title": "🚆📢 Take It Easy TO - Nuovo aggiornamento: \"News &amp; Avvisi\"! 📢🚆",
        "content": " **Nuovo aggiornamento: arriva la sezione \"News &amp; Avvisi\"!**\n\nGrandi novità per gli utenti di Take It Easy TO! 🎉 Abbiamo aggiunto una nuova sezione: **\"News &amp; Avvisi\"** 📰✨\n\nOra puoi restare sempre aggiornato sulle **ultime notizie sui trasporti pubblici, avvisi di servizio e comunicazioni importanti**, tutto direttamente nell’app!\n\n📌 **Cosa c’è di nuovo?**  \n✅ Aggiornamenti in tempo reale sui trasporti pubblici  \n✅ Avvisi di servizio e informazioni utili  \n✅ Un unico spazio per tutte le notizie importanti\n\nAggiorna subito l’app per provare questa nuova funzione! 🚀\n\n📲 **Scarica/Aggiorna ora**:  \n[Android](https://play.google.com/store/apps/details?id=com.takeiteasy.torino.app&amp;pcampaignid=web_share),  \nIOS: sarà disponibile in futuro\n\nFacci sapere cosa ne pensi e resta connesso per altre novità! 🚍💨\n\n\\#TakeItEasyTO #Torino #Turin #TrasportiTorino #NewsTrasporti #GTT 🚉✨",
        "upvotes": 16,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nnQwOdFPDhG66upzOUX8tpygSBrrCbAym8Jn9SOS4gI.jpg?auto=webp&amp;s=44e52737a24a4ce0d5f7adb7f20f5ea1e5f986e6"
        },
        "permalink": "/r/torino/comments/1jahqsf/take_it_easy_to_nuovo_aggiornamento_news_avvisi/"
    },
    {
        "id": "1jaycmk",
        "author": "grovio8888",
        "title": "Ditta di Traslochi",
        "content": "Ciao! Avete avuto esperienze decenti a prezzi onesti con ditte di traslochi? Consigli?\nGrazie ",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1jaycmk/ditta_di_traslochi/"
    },
    {
        "id": "1jajiza",
        "author": "stvrrlost",
        "title": "conoscenze torino provincia",
        "content": "c'è qualcuno interessato alla musica o anche solo interessato a parlare con qualcuno del più e del meno qua?\nsono una ragazza di diciannove anni, quindi vi prego non uomini disperati e morti di figq.\nvorrei solo qualcuno di interessante con il quale discutere di vari argomenti.",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1jajiza/conoscenze_torino_provincia/"
    },
    {
        "id": "1jaiwmk",
        "author": "NoAd4257",
        "title": "raga ma serate free entry tipo il sabato a torino con musica garage/bassline e open format?",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1jaiwmk/raga_ma_serate_free_entry_tipo_il_sabato_a_torino/"
    },
    {
        "id": "1jaor69",
        "author": "airakay",
        "title": "Does anyone know where I can get my bike tire inflated for free?",
        "content": "",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1jaor69/does_anyone_know_where_i_can_get_my_bike_tire/"
    },
    {
        "id": "1jad1hn",
        "author": "frefrefra",
        "title": "Best places to buy chocolate",
        "content": "Ciao!\nI am visiting torino and I was wondering which  cioccolateria is considered good here.\nI heard torino is famous for the chocolate and I wanted to buy some chocolate related gifts to bring back home to my family.Which stores have quality products and what about their prices ?\nGrazie Mille and sorry for writing the post in English  :))",
        "upvotes": 4,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1jad1hn/best_places_to_buy_chocolate/"
    },
    {
        "id": "1jae1bk",
        "author": "Flat_Reserve8599",
        "title": "Cerco insegnante di lingua giapponese",
        "content": "Buongiorno, come da titolo cerco qualcuno/a che mi possa insegnare la lingua giapponese, preferirei un madrelingua/o con titolo di studio, \nSe interessati scrivetemi qui o su telegram, @Lelielle",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jae1bk/cerco_insegnante_di_lingua_giapponese/"
    },
    {
        "id": "1jamnyv",
        "author": "ConcertFamiliar2790",
        "title": "Cerco aiuto per pulizie",
        "content": "Ciaoo\n\nCerco aiuto per pulizia di appartamento referenziato.\n\nGrazieee",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jamnyv/cerco_aiuto_per_pulizie/"
    },
    {
        "id": "1j9o9vj",
        "author": "Nrawkea",
        "title": "Asili nidi, che paura.",
        "content": "Ho una bambina che dovrà iniziare il nido a settembre e, viste le lunghe liste d'attesa, abbiamo cominciato con largo anticipo a visitare strutture sia private che pubbliche. Senza aspettative particolari, siamo rimasti molto delusi dalle prime visite. Finora abbiamo visto due nidi privati, entrambi situati in appartamenti riadattati, privi di spazi esterni, con scarsa ventilazione e poca luce naturale.\n\nIn entrambe le strutture, le condizioni erano piuttosto desolanti: muri sporchi, pavimenti rovinati, giocattoli rotti o molto usurati, libri strappati e lettini con materassi sfondati. I bagni, pur puliti, erano insufficienti rispetto al numero di bambini, e la stanza per il cambio pannolini era mal ventilata e con cattivo odore. Il personale presente era ridotto al minimo indispensabile e i bambini sembravano poco seguiti, spenti, stanchi e tristi. Sebbene sulla carta siano previste molte attività, nei fatti si tratta perlopiù di semplici passatempi poco strutturati e formativi.\n\nInoltre, uno dei nidi offre visite di un pediatra omeopata: ammetto la mia ignoranza sul tema, ma trovo sorprendente che le ASL consentano di introdurre l'omeopatia in una struttura educativa per l'infanzia.\n\nSinceramente, nemmeno da adulto vorrei passare una giornata intera in luoghi così poco curati. Eppure, ci sono liste d'attesa lunghissime.\n\nNei prossimi giorni visiteremo altri due nidi pubblici e tre privati. Siamo stati particolarmente sfortunati noi oppure questa è la norma?",
        "upvotes": 49,
        "comments": 30,
        "media": null,
        "permalink": "/r/torino/comments/1j9o9vj/asili_nidi_che_paura/"
    },
    {
        "id": "1j9uw2y",
        "author": "ariannacar",
        "title": "Gelaterie a Torino???",
        "content": "Io e i miei compagni universitari avevamo preso l'abitudine di andare alla romana, MA hanno alzato i prezzi a 3,50. avete suggerimenti per gelaterie che siano più economiche? (Siamo disperati)",
        "upvotes": 14,
        "comments": 51,
        "media": null,
        "permalink": "/r/torino/comments/1j9uw2y/gelaterie_a_torino/"
    },
    {
        "id": "1j9ihth",
        "author": "Free_Illustrator3232",
        "title": "Looking for Goodwill like",
        "content": "Ciao !\nI am in internship in Turin, coming from France. And I’m currently looking for a shop or a place that sales second hand items such as kitchen ustensils, Tupperware, drawer… \nWhat could you suggest me ? ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1j9ihth/looking_for_goodwill_like/"
    },
    {
        "id": "1j9fhws",
        "author": "cresta42",
        "title": "Arrampicata al C.A.T. - cercasi compagni",
        "content": "Ciao a tutti, come dice il titolo sto cercando gente con cui arrampicare al Centro Arrampicata Torino (C.A.T.). Sono arrivato da poco a Torino e non conosco nessuno che faccia corda e che sappia fare sicura.",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1j9fhws/arrampicata_al_cat_cercasi_compagni/"
    },
    {
        "id": "1j9h21q",
        "author": "Stupore_95",
        "title": "Trasferirsi a Torino per studente attempato",
        "content": "Salve a tutti amici! Sono un ragazzo di 29 anni che sta per terminare il suo percorso di studi triennale. Spero di non andare off topic con questo mio post ma avrei bisogno di qualche dritta. Inizio con ordine:\n\n1) com'è l'università di Torino? Ho spulciato tra i corsi (mi sto laureando in storia) e ho trovato molto interessante il corso di laurea magistrale in scienze strategiche, se qualcuno ha delle info a riguardo potrebbe condividerle? Essendo a numero chiuso, in alternativa proseguirei in maniera canonica con scienze storiche. Anche un questo caso, com'è la facoltà? Consigliereste l'università di Torino per questi due possibili percorsi?\n\n2) Allo stato attuale delle cose come siamo messi ad affitti? Piccola premessa, sto studiando all'università di Bologna e i prezzi sono diventati semplicemente allucinanti secondo me, sono stato costretto a spostarmi in una città vicina per fare il pendolare.\n\nVi ringrazio tutti e grazie in anticipo!",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1j9h21q/trasferirsi_a_torino_per_studente_attempato/"
    },
    {
        "id": "1j8tpql",
        "author": "Desperate_Question50",
        "title": "Consigli su come fare amicizia a Torino 😂",
        "content": "Ciao a tutti :) so che fa un pochino ridere ma chiedo consiglio a voi popolo di reddit 😂 sono amy e ho 29 anni, mi sono trasferita da un mese nel quartiere di mirafiori nord a Torino, e non so proprio come fare per conoscere nuove persone, sono una ragazza molto solare, mi piace ridere, scherzare, amo tantissimo leggere e sono anche un tantino nerd, perciò amo i videogiochi e anche i giochi da tavolo😂 ho ancora la mia vecchia compagnia di amici ma ci metto 4 ore tra andata e ritorno e non posso farlo tutti i weekend, mi piacerebbe conoscere altre persone con cui uscire la sera o anche solo per un caffè o un aperitivo, perciò vi prego consigliatemi perché le uniche altre persone con cui ho fatto amicizia sono i vecchietti che si siedono sulle panchine del parco dove porto il cane perciò la situazione inizia ad essere tragica ahhahahaha ",
        "upvotes": 34,
        "comments": 60,
        "media": null,
        "permalink": "/r/torino/comments/1j8tpql/consigli_su_come_fare_amicizia_a_torino/"
    }
]