[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 41,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 13,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1q6m0fa",
        "author": "Stormin_333",
        "title": "Torture is the new gunfight in so many shows.",
        "content": "Why has torture become so prevalent in media in recent years?  It is constant.  Sometimes less graphic than other times, but every show eventually at least has somebody tied to a chair and punched over and over.  Some really lean in on it and get graphic.\n\nGross\n",
        "upvotes": 332,
        "comments": 147,
        "media": null,
        "permalink": "/r/netflix/comments/1q6m0fa/torture_is_the_new_gunfight_in_so_many_shows/"
    },
    {
        "id": "1q7crlh",
        "author": "Lhakey",
        "title": "His&amp;Hers - My honest thoughts",
        "content": "I literally wrapped this show up 20 minutes ago and WOW. I have some strong emotions on this one.\n\nSide note: I am by no means a critic. I just wanted to share my thoughts in case you were on the edge.\n\nIt’s a stark contrast from your typical detective show, mixing in lust, hatred, romance, and love into a twisted story. It was refreshing! Throughout the show I drew sharp comparisons between titles like Gone Girl and The Girl on the Train, with a distinct splash of the traditional detective themed Hollywood blockbuster. However, even then it was entirely different. \n\nThere is definitely something to be said about the predictability throughout this show. With modern day crime films, I often feel I have a solid grasp of when or how an event is going to take place or come forth, but not with this. This was entirely fresh and entirely unpredictable. The director does a fantastic job of steering the viewers mind; Pushing us to a prejudice and bias that even the most experienced crime thriller fanatics try to avoid. I thoroughly enjoyed the plot and its many twists and turns.\n\nI say all this with some slight criticism. In order to accomplish such a rollercoaster of a plot line, I did feel there was a certain loss of realism. The general structure of the plot is gripping, but the actual substance of it can be slightly off putting. I felt as if some of the reasonings were a slight bit of a reach for my tastes, but could be well within the palettes of most viewers.\n\nFrom a cinematographic point of view, the show was well made. The scenery, the mood, and the pacing, was attractive to your typical crime thriller junkie. I have little to complain about aside from the pacing in the last episode. I felt as if there could have been a slight bit more to explore concerning the main protagonist and his trauma, but it was brushed off for the jaw dropping peak of the show (absolutely 100% unexpected). So yes, I will say the cinematography was well done. It’s no Lord of the Rings or Interstellar, but it has more than enough to make the viewing experience pleasurable. \n\nAlso, there were so many morals and lessons put into this story. Maybe it’s just me being impressionable, but I definitely felt there was some moving moments throughout. \n\nI strongly recommend this series and look forward to more similar work in the future. \n\n\n TLDR: Great series. It was a nail biter that had me constantly questioning my theories. There’s some minor misgivings but they are made up for by other plot twists and so on. 8.2/10. Strongly recommend!\n",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1q7crlh/hishers_my_honest_thoughts/"
    },
    {
        "id": "1q6pv44",
        "author": "Thissuxxors",
        "title": "The Gabby Petito case - I really need to stop watching these crime docs",
        "content": "They're just so ridiculously sad, I asked myself why do I watch them. I said I would not watch another one after that Netflix documentary about that pos who wanted to leave his wife for another woman and offed his kids. That one really haunted me.\n\nI didn't think this one would get to me as much as it did. What a beautiful soul Gabby was. I honestly have no idea what she saw in that ugly pos. And her think she thought she was lucky that he wanted her was ludicrous, he is the one that was lucky to have her. I don't understand how you can do that to someone who loved you that much even when you were being a piece of shit that you are and she still wanted to spend her life with him.\n\nSorry, I have to vent. This was such a difficult watch.",
        "upvotes": 127,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1q6pv44/the_gabby_petito_case_i_really_need_to_stop/"
    },
    {
        "id": "1q730co",
        "author": "Coach006",
        "title": "What the HELL did I just watch?!?!?!",
        "content": "'Becky' it drew me in with the trailer and the individuals playing the parts. Never heard anything about this movie, but DAMN!!!!!! I guess that I'd call it unexpected???",
        "upvotes": 20,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1q730co/what_the_hell_did_i_just_watch/"
    },
    {
        "id": "1q7fswp",
        "author": "FrictionMitten",
        "title": "Closed captioning on non-English movies/series",
        "content": "I watch with captions on no matter the language. I do this for a number of reasons, from catching all of the dialogue, to watching during quiet time at the house.\n\nThe issue that I am having is - if I am watching a movie, say in Korean, and there is English dialogue, it is omitted from closed captioning. Is there a setting that I am missing that will have that typed on screen as well?  It is frustrating and there is only so much lip-reading that I can successfully do. \n\nThanks in advance.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q7fswp/closed_captioning_on_nonenglish_moviesseries/"
    },
    {
        "id": "1q77ybn",
        "author": "Baapofmovies_123",
        "title": "Netflix’s His &amp; Hers Review (2026): This Limited Series Is A Glossy, Twisty Thriller Made for Binge-Watching(Rating: 3.5/5)",
        "content": "Each episode is very well balanced, as it ends with enough intrigue to pull viewers straight into the next, and every twist will engage the viewers. The production values are slick, and throughout the show the pacing is very consistent. ",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q77ybn/netflixs_his_hers_review_2026_this_limited_series/"
    },
    {
        "id": "1q6xmhu",
        "author": "michelob81",
        "title": "Members only Palm Beach",
        "content": "Watching the Palm Beach show and honestly I've never been so happy to be working class. Don't get me wrong I'd love to drive those cars and eat that food but I'd prefer to do it with human beings. Palm Beach looks like a luxurious corner of hell on earth. What a pack of flippin demons.",
        "upvotes": 24,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1q6xmhu/members_only_palm_beach/"
    },
    {
        "id": "1q75d50",
        "author": "CommercialAlert158",
        "title": "Marcello Hernandez",
        "content": "Was I the only one that didn't find his special funny? I had high expectations on this special. I was so excited to watch it. I didn't laugh that much!? ",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1q75d50/marcello_hernandez/"
    },
    {
        "id": "1q6vlbr",
        "author": "RiverRose91",
        "title": "Unlocked: A Jail Experiment Season 2",
        "content": "It's just come out and it has been wild. I could totally tell by episode 3 that Irish is a huge manipulator and sending Woody to do his dirty work. I agree stealing is a really big no no and the new guy should have maybe got punishment, but he was withdrawing and not in his right mind.\n\nAny kind of open pod situation even these mini pods can be rife with exploitation and theft, so I understand why it's such a big deal. Anyways.... I didn't see another post on season 2 for redditors to discuss, so here it is! ",
        "upvotes": 13,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1q6vlbr/unlocked_a_jail_experiment_season_2/"
    },
    {
        "id": "1q70tk7",
        "author": "Boringheart__0",
        "title": "Unlocked: a jail experiment",
        "content": "Is anyone else in love with this this show? It’s one of the most in depth jail docs I’ve ever seen and emotional storytelling. On episode 7 and I can’t believe this show isn’t talked about more",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q70tk7/unlocked_a_jail_experiment/"
    },
    {
        "id": "1q784az",
        "author": "Ok-Lavishness4747",
        "title": "Bald Eagle is the most hilarious character in stranger things ❤️",
        "content": "His dialogue are so well written I just can’t stop laughing to his lines. In ST5 when they confirmed the planet was really moving, he calls hopper and tells him “I have Good News Bad News. The good news is that Dustin’s theory was correct and a huge planet is moving towards us, the bad news is that Dustin’s theory was correct and a huge planet is moving down our heads.”😂😂😂😂",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1q784az/bald_eagle_is_the_most_hilarious_character_in/"
    },
    {
        "id": "1q6sp89",
        "author": "CrochetEnthusiast9",
        "title": "Sean Combs Documentary",
        "content": "The amount of people dead in connection with P. Diddy is absolutely insane! \n50 months for all of that it's even more insane! \nThis guy has too much power! ",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q6sp89/sean_combs_documentary/"
    },
    {
        "id": "1q76stk",
        "author": "LadiesEatFart1",
        "title": "Action movies &amp; Tv series",
        "content": "What are some really good fast paced action movies/TV shows right now on Netflix? If you could give me some good recommendations, that would be great of you, thank you in advance.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q76stk/action_movies_tv_series/"
    },
    {
        "id": "1q75mvw",
        "author": "Solar_AU",
        "title": "What car drives Simon Greene in Run Away?",
        "content": "What car drives Simon Greene (James Nesbitt) in the new British Netflix TV series Run Away? Looks like a light green or gray Sports Utility Vehicle (SUV)? is this a fully electric vehicle?",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1q75mvw/what_car_drives_simon_greene_in_run_away/"
    },
    {
        "id": "1q70csy",
        "author": "Imaginey_Lie",
        "title": "Arrow",
        "content": "Okay, so I was watching crisis on infinite earths, and I went to go to the arrows then remembered that the Arrow is no longer on Netflix, so I can't finish it. I'm upset, please. Does anyone know where the arrow ended up cause I do not",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1q70csy/arrow/"
    },
    {
        "id": "1q6sizt",
        "author": "anonymous36758",
        "title": "dropping and starting new shows",
        "content": "i’m not sure how i used to binge shows one after another, nowadays i will start a show then start another and start another &amp; i end up having 20 currently watching shows. idk what to do. ",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1q6sizt/dropping_and_starting_new_shows/"
    },
    {
        "id": "1q6locr",
        "author": "Cohoney",
        "title": "Frieren is not for everyone?",
        "content": "Half of my friends and some of my family are not able to see nor search for Frieren on Netflix.\nI have contacted support, they only have excuses and no solutions..\n(I love the show, I can see it on my account)\n",
        "upvotes": 10,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1q6locr/frieren_is_not_for_everyone/"
    },
    {
        "id": "1q6y93t",
        "author": "Bulky-Farmer-201",
        "title": "Liar series review",
        "content": "Would you recommend liar series? Is it similar with run away by harlan coben that has multiple stressful unpredictable plot twists? Would like something similar to that series ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q6y93t/liar_series_review/"
    },
    {
        "id": "1q6w9t2",
        "author": "Salted_Caramel777",
        "title": "Binge worthy series &amp; show",
        "content": "please recommend me very very good show with a lot of twist, plot and mind blowing. maybe thriller/suspense\n\nfor shows &amp; movies i really like: all mike flanagan shows, all nolan movies, genres like that\n\nsomething that i will never get tired of clicking the next episode",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1q6w9t2/binge_worthy_series_show/"
    },
    {
        "id": "1q63mfd",
        "author": "Extension-Fall-4286",
        "title": "A House of Dynamite",
        "content": "WTF is up with the ending?!!! Who the hell writes a screenplay that shows the same story through several characters point of view and builds to the climax for each viewpoint and then just says “ Fuck it, roll credits….?!!!!” No answers, no decision being made…..nothing!! I understand the concept of leaving an ending open for interpretation by the audience, and as much as I hated the way The Sopranos ended, it was obvious that they were leaving their options open for sequels or whatever, but to just build, build, build to an ending from every point of view with absolutely zero closure or at the very least, a final decision by the President whether or not to even respond to an imminent nuclear bombing of Chicago???? DISAPPOINTING!!!!\n\nSorry, just finished the movie and screamed at the screen and needed to vent to the masses of Reddit. I should get my emotions in check 😂😂😂\n\nHope you all just chose to watch some stand up comedy tonight and go to bed with humor on your brain!! 💯 ",
        "upvotes": 44,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1q63mfd/a_house_of_dynamite/"
    },
    {
        "id": "1q6ub1x",
        "author": "skullcat1",
        "title": "Nitpick: Does anyone get \"flash frames\" on their stream?",
        "content": "Resubscribed to Netflix after a break. Been loving catching up on my favorite franchises, recent film releases, and beloved comfort show (I Think You Should Leave, looking at you).\n\nOne quirk I'm having that I haven't seen before is that occasionally I'm getting what video editors call \"flash frames\". \n\nWatching fine for a while, and then there's one blink of a different scene, but it's gone before you can register it. Not like a cool Fight Club \"one frame of porn\", just some little gremlin in the stream. \n\nI've watched a bunch of movies and shows, so it's not particular to one encode/show/movie, it's definitely across the stream. \n\nFwiw, I'm watching through Fios and have top tier bandwidth. \n\nAgain this is a nit, just a quick \"blip\", but it keeps happening. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q6ub1x/nitpick_does_anyone_get_flash_frames_on_their/"
    },
    {
        "id": "1q6kanj",
        "author": "hmmmindeed778",
        "title": "Has anyone else watched Absentia!",
        "content": "I’ve never heard anyone talk about it. While finding it fairly redundant and unrealistic I didn’t mind the show. Just curious as to what you all felt about it! ",
        "upvotes": 2,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1q6kanj/has_anyone_else_watched_absentia/"
    },
    {
        "id": "1q6swf8",
        "author": "NoEmployer9676",
        "title": "Anyone else have color instability ?",
        "content": "Sometimes when I watch Netflix, the color are weirdly changing during a scene, somekind of calibration problem\n\nI noticed it only happens when I am on a streaming plateform like Netflix or Disney +, not when I watch TV, no when I watch a blu ray or play video games \n\nAnd when it happens, I got the feeling it is only during Netflix originals like right now when I watch Stranger Things never in others shows like B99 or movies on the platforms \n\nDoes anyone else have that problem as well ? Where does it came from ?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q6swf8/anyone_else_have_color_instability/"
    },
    {
        "id": "1q6ipya",
        "author": "wannabejoanie",
        "title": "Anyone else having these issues in the android app?",
        "content": "I've been having this issue in my Netflix app on my android phone. My husband, who uses the same account on the same kind of phone, just a different profile, says he doesn't have this issue. \n\nIf I'm going between two or more shows, series or movies, (for example, there's a certain show I watch with my daughter together that's on my profile, but not on hers because she's got a kids profile, but sometimes I want do watch like, stranger things or something in between)\n\nEven if I've completely exited out of all apps, I'll select the second in line of \"recently watched\" and it won't take me to stranger things, it'll take me to like, an episode and a half back of the show i was watching with my kid. It's *so annoying* and as far as I know I have the most recent updates on all my systems and apps, this has gone on for long enough I've had multiple apps and systems updates. \n\nWe both have a galaxy s22+. He says he doesn't have this issue but it's almost constant for me. \n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q6ipya/anyone_else_having_these_issues_in_the_android_app/"
    },
    {
        "id": "1q6zwuk",
        "author": "PickleRemarkable4904",
        "title": "Stranger Things conspiracy/ Potential idea in future shows",
        "content": "OK. Hear me out.\n\nThere maybe a call for some need for watchers/consumers to have an emersive experience in a show.  Where clues are placed for people to search and pin clues to new ideas or sites concerning the show. \n\nWhile the whole conformity gate was a weird call for more episodes, people seemed to really have fun going down the rabbit hole. \n\nGranted if this was ever done on purpose I have no idea how it would look. If it would b3 some form of cryptograms or Morris codes or pictures within a picture.  People are tired of always watching the same formulary in shows. Seeing renewed versions of shows played out with new actors in a new decade.  \n\nI think it is food for thought and could be something to be considered in the future. Just my two cents",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q6zwuk/stranger_things_conspiracy_potential_idea_in/"
    },
    {
        "id": "1q5j88c",
        "author": "FarScheme4636",
        "title": "Run Away - Harlan Coban - TERRIBLE",
        "content": "DONT READ UNTIL YOUVE FINISHED IT\n\nSorry but I keep searching for people’s opinion’s on this show and it’s always mostly positive - I’m so confused!! This was one of this worst series. First of all, why was the daughter not a suspect for the police as she was the last person who saw him dead? There was also NO chemistry between the detectives and that sex storyline was so unnecessary?! Also why would they drag out the whole storyline just to say the daughter killed Aaron?   And then reveal it was the mum? Cornelius said that a few episodes ago too! Also the music.. the acting.. it was TERRIBLE. I don’t understand how people thought this was good? 60K for a dealer to tell james nesbitt that his daughter was seen on the bus… WHY did the detectives not find out that info from the missing persons report?!? Did they even bother looking for her?!? Honestly I’m raging. The whole show was STUPID!!! Plus why does everyone have a gun in the UK!!!!!!! The percentage of gun violence in the UK is 5%.. FIVE PERCENT\n\nAND ANOTHER THING WHY DID THE PARENTS GO TO THE DRUG DEN AND THE MUM GET HERSELF SHOT IF SHE KNEW WHERE THE DAUGHTER WAS AND WHO KILLED AARON… it makes NO SENSE!!!!!!!",
        "upvotes": 205,
        "comments": 241,
        "media": null,
        "permalink": "/r/netflix/comments/1q5j88c/run_away_harlan_coban_terrible/"
    },
    {
        "id": "1q6rq7n",
        "author": "TheListenerCanon",
        "title": "The comparison between Dark and Stranger Things!",
        "content": "So, so far, I've seen the first 5 episodes of Dark (eg. first half of S1), so please no spoilers outside of that. Or at the very least put the spoiler tags.\n\nThat being said, I so far think this it's better than ST at it's best (eg. S1) and maybe one of the best shows I've seen. I realize I need more to see but it's that good.   \n  \nHowever, I don't get the comparison. Outside of being sci-fi shows on Netflix, they're not the same thing. One is an arthouse-like TV show that's not meant to be appeal to wide audience. The other isn't, well at, least past S1. To me, it's like comparing a Tarkovsky movie to a  MCU movie!\n\nDoes anyone else feel that way?",
        "upvotes": 0,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1q6rq7n/the_comparison_between_dark_and_stranger_things/"
    },
    {
        "id": "1q70upu",
        "author": "Acrobatic-Nose-3731",
        "title": "Why does the official Netflix reddit account have all the \"banana length\" achievements",
        "content": "Like what are you doing I mean it's one thing to have ambey like one of them cus a joke but all what is Netflix doing jjjjhhhhhhgghshdhdhdhdjdjdjjddjjdjdjdjd",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1q70upu/why_does_the_official_netflix_reddit_account_have/"
    }
]