[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 492,
        "comments": 261,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1iqseno",
        "author": "dailystar_news",
        "title": "Netflix star found dead at home age 24, as police investigate circumstances",
        "content": "",
        "upvotes": 627,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1iqseno/netflix_star_found_dead_at_home_age_24_as_police/"
    },
    {
        "id": "1iqupoq",
        "author": "Vector_Heat",
        "title": "How Oil Propaganda Sneaks Into TV Shows",
        "content": "",
        "upvotes": 22,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iqupoq/how_oil_propaganda_sneaks_into_tv_shows/"
    },
    {
        "id": "1iqrvcy",
        "author": "Somethingman_121224",
        "title": "Kate Winslet Will Debut as Director in Netflix's Drama 'Goodbye June'",
        "content": "",
        "upvotes": 22,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iqrvcy/kate_winslet_will_debut_as_director_in_netflixs/"
    },
    {
        "id": "1iqxifd",
        "author": "Infamous-Watch-9192",
        "title": "Bridgerton Season 4: Benedict and Sophie's Romantic Masquerade Unveiled",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iqxifd/bridgerton_season_4_benedict_and_sophies_romantic/"
    },
    {
        "id": "1ir2uok",
        "author": "Potential-Meat741",
        "title": "The Double",
        "content": "Just a random observation/thought. I'm at Ep 28 of the Chinese Drama 'The Double', right after Wencai dies. I'm gna refer to Jiang li's stepmom as Fu Ren bc i can't recall her name for some reason. But seeing the loving relationship they had, Fu Ren is a victim too in a sense, although she's still horrible. I was just thinking if Fu Ren's father wasn't that way, Wencai and Fu ren wldve lived happily ever after and have a kid of their own. The original Jiang Li wouldn't have been sent to zhenv hall, she would've still been alive and living well. Her mother wouldn't have passed either without fu ren's sabotage. Concubine Hu would still be 'sane' and an actual part of the family and her daughter would still be alive. Tong er would also be alive. So total of 8(?) lives, if we include fu ren's unborn son with Wencai, would've been saved. \n\nAnyways this was just a thought i had and wanted to share, don't take it too seriously because obviously without this, the whole plot line wouldn't have existed. Xue Fangfei probably would've ended up actually dying, her dad would as well and justice wouldn't be served. But idk, pretty sad to think about.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ir2uok/the_double/"
    },
    {
        "id": "1iqrix7",
        "author": "TheExpressUS",
        "title": "Netflix Sweet Magnolias season 4's biggest differences from the book",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iqrix7/netflix_sweet_magnolias_season_4s_biggest/"
    },
    {
        "id": "1iqshtb",
        "author": "NotJuli2011",
        "title": "Don‘t know what to watch?",
        "content": "Hey I need a good show that is not too boring and has deep characters.\n\nMy all time favorites are Breaking Bad, Shameless (US), Vikings, Prison Break.\n\nI also loved Haunting of Hill House, Peaky Blinders, Skins, Ginny &amp; Georgia, Top Boy, Last Kingdom, Queens Gambit…\n\nRecently I cannot decide what to watch. There are so many shows and I don‘t want to waste my time with a bad show.\n\nThanks for your recommendations :)\n\n",
        "upvotes": 5,
        "comments": 80,
        "media": null,
        "permalink": "/r/netflix/comments/1iqshtb/dont_know_what_to_watch/"
    },
    {
        "id": "1ir25xh",
        "author": "xGoldenDipperx",
        "title": "Old Netflix preview music",
        "content": "Back in 2017-2018 when I was using Netflix, I remember there used to be music that played when you were previewing a movie/show specifically ones that weren’t that popular on Netflix.\n\nThe music that played didn’t really belong to a specific movie/show but were placeholders since the preview audio was not set and I can not find these “default Netflix music tracks” anywhere on the internet.\n\nSpecific examples would be mostly the anime shows, like steins gate.\n\nWould greatly appreciate it if anyone could help me find them since they were very nostalgic to me.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ir25xh/old_netflix_preview_music/"
    },
    {
        "id": "1ir1ma8",
        "author": "classy_5647",
        "title": "Horrible AI Filter on A Different World",
        "content": "Netflix has added A Didferent World - a show many of us know and love. It was filmed in the late 80s and early 90s. Since then, reruns have been shown on TVOne and it streamed on HBO Max for a time. In both instances, the show was in its original format. However, Netflix has added a horrible AI smoothing filter to all episodes which has made them completely unbearable to watch. I've seen a few people complain about it online. How can we get rid of it? Should I start a petition and send it to Netflix? This is ridiculous and so unnecessary. Many of us like the 80s/90s graininess because it adds to the charm and nostalgia of the show. No one asked for this attempt at modernizing the look of it. I'm so frustrated about this! ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ir1ma8/horrible_ai_filter_on_a_different_world/"
    },
    {
        "id": "1iq9bom",
        "author": "Practical-Creme-6025",
        "title": "Netflix pricing in Europe (as of February 2025)",
        "content": "*Premium plan only",
        "upvotes": 89,
        "comments": 67,
        "media": null,
        "permalink": "/r/netflix/comments/1iq9bom/netflix_pricing_in_europe_as_of_february_2025/"
    },
    {
        "id": "1iqz06o",
        "author": "BosniakBruv34",
        "title": "Are y'all gonna watch \"Son of a donkey\" when it releases",
        "content": "It is basically a new netflix show produced by Superwog, an australian comedian duo led by Theodore and Nathan Saideen. I watched superwog before and i can tell you it is one of the best australian comedies i've ever watched after fat pizza. Can't wait for it to launch, this and Squid Game season 3 is what i am eagering for.\n\nI really don't understand why this show is getting hate before even being released. C'mon guys, let's give the aussies a chance!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iqz06o/are_yall_gonna_watch_son_of_a_donkey_when_it/"
    },
    {
        "id": "1ir01go",
        "author": "cardsrealm",
        "title": "Everything About “American Primeval”: Synopsis, Trailer, and the Story Behind It",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ir01go/everything_about_american_primeval_synopsis/"
    },
    {
        "id": "1iqukje",
        "author": "New_Seat_3868",
        "title": "Netflix",
        "content": "What does the title, Asura, mean in this context?  I goggled it and learned it is a reference to a Buddhist god. How does that fit in with the themes of the show?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iqukje/netflix/"
    },
    {
        "id": "1iqpzq7",
        "author": "Afraid-Till-4101",
        "title": "Is Solo account and Shared account nothing different when it comes to screen limit?",
        "content": "I was still confused with mine, I have a Premium plan which has 4 screen limit device at once, and I have other 2 slots for Solo profile members outside my household. So does it mean, those 2 solo acc would be counted in the screen limit of 4 device if ever being watched all at once? Cause if yes, I'm just gonna abolished those 2 solo membership cause it's already costs me lol. Please enlighten me, thank you!",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1iqpzq7/is_solo_account_and_shared_account_nothing/"
    },
    {
        "id": "1iqrn6y",
        "author": "Competitive-Rip5932",
        "title": "What do you prefer?",
        "content": "I have watched Squid game season 1 and 2 and i found it really interesting and dramatic, especially for the critic to the south korean system and the fact that people risk their life for money.\nAfter this I searched for some similar series and I found out \"the 8 show\", that in my opinion is way better than squid game, am I the only one thinking it?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iqrn6y/what_do_you_prefer/"
    },
    {
        "id": "1iq8c02",
        "author": "fermulator",
        "title": "Canada Pricing Increases (again) Feb 2025",
        "content": "Netflix year over a year continues to increase their prices and they are no longer competitive. (in my opinion.)\n\nBecause of this ongoing increase last year we downgraded to the standard with ads plan, which has been fine . The cost was $5.99.\n\nHere are the changes \n- Standard with ads $5.99 to $7.99\n- standard $16.49 to $18.99\n- premium $20.99 to $23.99\n\nAbsolutely unacceptable . (to me)\n\nWe have cancelled our membership .  I encourage others to do the same in solidarity.",
        "upvotes": 23,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1iq8c02/canada_pricing_increases_again_feb_2025/"
    },
    {
        "id": "1ir52mo",
        "author": "HovercraftFlimsy9622",
        "title": "My Netflix is tweaking out",
        "content": "",
        "upvotes": 0,
        "comments": 4,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/lsltdz39zkje1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1ir52mo/my_netflix_is_tweaking_out/"
    },
    {
        "id": "1iqdhoq",
        "author": "anushkaaaaaaaaaaa",
        "title": "Cassandra",
        "content": "This show was so good, oh my god! Yes, there were plenty of obvious dumb decisions, but overall, it was a really great watch. I ended up binging it in one night. It actually made me sad—she just wanted a family, and it breaks my heart. A victim turned villain.",
        "upvotes": 11,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1iqdhoq/cassandra/"
    },
    {
        "id": "1iqyx9d",
        "author": "unidentifiedbe",
        "title": "cant sign in?",
        "content": "this has been the case for ~2 days now, my assumption is that this has something to do with the price changes in europe. I already automatically paid for february on the 8th (9.99€)\nor is this something else? will it fix itself?",
        "upvotes": 0,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1iqyx9d/cant_sign_in/"
    },
    {
        "id": "1iqohm7",
        "author": "kurd2005",
        "title": "How to view deleted movie timestamp",
        "content": "I was watching “the karate kid” a while back but they removed it from Netflix and I don’t remember what time stamp it stopped at. Is there anyways to find out?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iqohm7/how_to_view_deleted_movie_timestamp/"
    },
    {
        "id": "1iqo9yh",
        "author": "Ok_South9239",
        "title": "Has anyone fanfic’d an ending to the society?",
        "content": "I know the society season 2 has come up a lot here and I’ve given up hoping tbh. They were gonna release a graphic novel for season 2 but the publisher fucking WENT OUT OF BUSINESS before they could release it (whyyyy is this show cursed).\n\nAnyway im torturing myself rewatching it for some reason so is there like a fanfic or something that’s at least 60 percent satisfying? ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iqo9yh/has_anyone_fanficd_an_ending_to_the_society/"
    },
    {
        "id": "1iprjma",
        "author": "TheMirrorUS",
        "title": "Netflix says Emilia Perez controversy is 'bummer' for Selena Gomez and Zoe Saldana",
        "content": "",
        "upvotes": 253,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1iprjma/netflix_says_emilia_perez_controversy_is_bummer/"
    },
    {
        "id": "1iq60c1",
        "author": "AnthologicalAnt",
        "title": "Watch list question...",
        "content": "Am I the only person that fills their watch list of shows and films that I would love to watch. And as soon as I want to watch something, everything looks like a load of crap I wouldn't ever want to watch? ",
        "upvotes": 17,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1iq60c1/watch_list_question/"
    },
    {
        "id": "1ir3taz",
        "author": "georgenstitch",
        "title": "Why does Netflix release documentaries on controversial topics?",
        "content": "I’ve recently been trying to widen the category of documentary that I watch. And I’m curious for others thoughts on this and can’t see that it’s ever been discussed previously!\n\nWhy does Netflix release documentaries on controversial topics?\n\nHow does Netflix get away with supporting, producing and releasing these films and series?\n\nI will try to explain briefly what I mean by the above, and refer to some examples.\n\nNetflix is a massive corporation, it is the 23rd most visited website in the world, and produces thousands of original films and series. It has 301.6 million subscribers. The only places it is not available are the authoritarian countries of Russia, North Korea, China and Syria, countries with a commitment to abolishing capitalism. Netflix is the prime example of effective capitalism - constant new media, instant access, affordable prices and sold worldwide.\n\nHowever, it has many documentaries that oppose capitalism, or other social norms, and instead promote the opposite. This appears somewhat hypocritical, or ironic, that documentaries such as “Buy More” are produced and released by Netflix - a company that has grown due to consumerism, with a potential environmental detriment.\nOther examples include:\n - “seaspiracy”\n - “the social dilemma”\n - “saving capitalism”\n - “the minimalists”\n - “cowspiracy”\n - “blackfish”\n\nWhat insights do you have on this? \n\nHow much do you feel you would be influenced by these documentaries? \n\nDo you think these series would only tailor a certain category of consumer?",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1ir3taz/why_does_netflix_release_documentaries_on/"
    },
    {
        "id": "1iqnrex",
        "author": "AnusChakra",
        "title": "Netflix editing in distortions in old footage",
        "content": "After watching a bunch of Netflix real crime I noticed that literally EVERY old piece of footage was distorted one way or another. It can be discoloring, lines of white noise or distortion of parts of the screen.\n\nI know that even footage from the 90s can look ancient, but at some point I realized that Netflix does this to \"help the viewer\". When they again show footage from some time ago they add the distortion so that viewer subconsciously can place the footage in time (\"ah, right, we're having a flashback\").\n\nDid anyone else notice this? And is it indeed an editing trick to help the viewer? Or is really all their archived footage damaged?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iqnrex/netflix_editing_in_distortions_in_old_footage/"
    },
    {
        "id": "1iqwsna",
        "author": "Nervous_Property210",
        "title": "Any help on breaking bad?",
        "content": "I really am extremely sensitive to gore(specifically, throat slits decapitation anf other I can do gun shots and like sounds but none of that any help on which episodes not to watch that have that stuff? ",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1iqwsna/any_help_on_breaking_bad/"
    },
    {
        "id": "1iqzsmo",
        "author": "DeliciousMoose1",
        "title": "Would it be better if Netflix went private as a company?",
        "content": "I don't know much about economics so I'm wondering this. So Netflix is destroying itself with a constant need for growth so that buying stocks is worth it. If it became a private company (I guess someone would need to buy it?) would it be better for it, because it would be fine if it had stagnant profits? Because there wouldn't be the issue of shareholders selling their stock if it wasn't growing?",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1iqzsmo/would_it_be_better_if_netflix_went_private_as_a/"
    },
    {
        "id": "1iq809f",
        "author": "Upstatealphamama",
        "title": "Dead Boy Detectives",
        "content": "Did anyone watch Dead Boy Detectives? Did you like it? It's in the same universe as Sandman. I really enjoyed both shows and was really looking forward to season 2 of Dead Boy Detectives but found out it was canceled due to low views. I feel like Netflix cancels so many shows super quickly. ",
        "upvotes": 9,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1iq809f/dead_boy_detectives/"
    },
    {
        "id": "1iqwnwn",
        "author": "TheMirrorUS",
        "title": "Netflix fans share 'under the radar' shows that deserve more 'recognition'",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iqwnwn/netflix_fans_share_under_the_radar_shows_that/"
    },
    {
        "id": "1iqi886",
        "author": "ProfessionalMusic414",
        "title": "Trailer for #aSTRANGERdarkly #earlyrelease #trailer",
        "content": "I tagged my project on ig &lt;aSTRANGERdarkly&gt;\n\n#ASTRANGERDARKLY\n#PARTTWO of #PKD’s\n#aSCANNERDARKLY",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iqi886/trailer_for_astrangerdarkly_earlyrelease_trailer/"
    }
]