[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 10,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 702,
        "comments": 5176,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1ny08z4",
        "author": "Last-Upstairs1387",
        "title": "Netflix Has Gone Downhill",
        "content": "I’m bracing for downvotes, but hear me out: Netflix has gone down. Not crash-and-burn down, but a steady slide from must-have to “I’ll resub when there’s a buzzy release.” I get that plenty of people still love it, but what used to feel like discovery now feels like searching, and that shift matters.\n\nThe biggest crack is trust. Too many promising shows get axed after a season or two, so viewers stop investing. It’s hard to recommend something when you might be setting a friend up for a cliffhanger that never gets resolved. Netflix still lands hits, but fewer cut through the noise, and the middle tier—the quirky, mid-budget series that built the brand—has thinned out. What’s left is an awkward mix of glossy tentpoles and disposable reality.\n\nPricing and policies haven’t helped. Between tier reshuffles, an ad-supported option, and the password-sharing crackdown, Netflix asks for more while delivering less certainty. If I’m paying premium, I want premium clarity: finished stories, a strong middle class of originals, and an interface that helps me find them. Instead, the algorithm cycles the same tiles, autoplay shouts at me, and the Top 10 often reads like a marketing strip rather than a reliable compass.\n\nThe binge model, once Netflix’s superpower, is showing its limits. A full-season drop creates a weekend of hype and a Monday of amnesia. Competitors that pace releases weekly keep conversation alive longer, which builds community and anticipation. Netflix’s experiments with split seasons feel more like damage control than a coherent strategy for keeping shows in the zeitgeist.\n\nI know the counterpoint: scale demands broad bets. Serving the whole world means optimizing for averages, and averages don’t produce many cult classics. There are still gems—especially international series—but they’re buried under repetition and generic thumbnails. Personalization should feel like a path that widens as you walk it, not a carousel that loops you back to the same five options.\n\nWhat would winning look like? Start with a renewed commitment to finishing stories—greenlight responsibly and communicate clearly about endpoints. Reinvest in the mid-tier that keeps people engaged between megahits. Rethink curation beyond raw engagement: elevate human-programmed shelves, surface more staff picks, and rotate true discovery rows weekly. On product, make autoplay opt-in, expand “because you watched” with smarter, transparent explanations, and let users pin interests so the home screen adapts to them, not the other way around.\n\nAnd if you disagree, that’s fine. I expect pushback, maybe even a pile-on. But the criticism comes from a place of former love. Netflix made streaming exciting because it felt bold and curious. Lately, it feels cautious and crowded. The audience is still here, willing to be surprised. The question is whether Netflix wants to be surprising again.\n\nIf you’re still all-in on Netflix, tell me what I’m missing and what’s genuinely great right now. I’d love to be convinced to stay subscribed year-round instead of hopping in and out for the next shiny release.\n\n",
        "upvotes": 299,
        "comments": 142,
        "media": null,
        "permalink": "/r/netflix/comments/1ny08z4/netflix_has_gone_downhill/"
    },
    {
        "id": "1nxvtl8",
        "author": "peoplemagazine",
        "title": "Charlie Hunnam Says He Lost 30 Pounds to Transform Into Infamous Murderer Ed Gein for Netflix’s Monster — and Opens Up About How Else He Prepared for the Role",
        "content": "",
        "upvotes": 65,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1nxvtl8/charlie_hunnam_says_he_lost_30_pounds_to/"
    },
    {
        "id": "1ny0evj",
        "author": "bbrennann",
        "title": "Charlie Hunnam as Ed Gein is bad casting and this seasons first episode strikes a weird tone",
        "content": "The tone of this show is weird\n\nOnly on episode one but here's some thoughts.\n\nHunnam is a strange choice. He's too hot and can't do an american accent and accounting for the strangest voice choice of all time, it just comes off silly and \"simple jack-y\".\n\n  \nAnd the TONE??? The show so far plays less like an upclose look at a monster like dahmer and has been this hypersexual tease of teenage girls talking about bras, flashes of nazi BDSM imagery and concentration camps cut together in an exciting way. he gets the images from a girl who looks so sweet she's bound to be his first victim. \n\nGein is portrayed as a hot and muscular horny weirdo with a terrible voice, who fails to bring life to a character with the same kind of tv-watchability as Evan Peters's  cold, scary, planning, broken, psychopathic predator \n\nI'm writing this after watching the ridiculous scene at the Nazi BDSM party where Jewish prisoners are sexually humiliated against their will. And again- it's just the tone. It was off. And this show so fare seems kinda sexploitation-y and bad acting and bad casting and idk if i can keep going. \n\nThoughts?",
        "upvotes": 37,
        "comments": 85,
        "media": null,
        "permalink": "/r/netflix/comments/1ny0evj/charlie_hunnam_as_ed_gein_is_bad_casting_and_this/"
    },
    {
        "id": "1nxldkf",
        "author": "millzbill",
        "title": "Netflix loses $20 billion in value as stock drops in its worst week since April.",
        "content": "",
        "upvotes": 227,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1nxldkf/netflix_loses_20_billion_in_value_as_stock_drops/"
    },
    {
        "id": "1ny4p3l",
        "author": "PokeHunterLasVegas",
        "title": "Monster: Ed Gein thoughts ?",
        "content": "Why do they have him talking like Derek Zoolander? Seriously, whenever he talks I just hear \"I think Ive got the black lung...all I ever wanted was to make you proud pop\"\n\nIdk, watched the first 4 episodes and aside from thinking the blonde gf is a complete smoke show, idk, show kinda sucks",
        "upvotes": 10,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1ny4p3l/monster_ed_gein_thoughts/"
    },
    {
        "id": "1nxx769",
        "author": "schi__zoid",
        "title": "Monsters: Ed Gein - there's something off about the show",
        "content": "I don't know how to describe it. I'm halfway through, and it feels like there's an exaggeratedly slow pace, with too many details and distractions meant to... increase the disgust? IDK - as if the story itself isn't  enough.\n\nAnyone else felt this way?\n",
        "upvotes": 19,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1nxx769/monsters_ed_gein_theres_something_off_about_the/"
    },
    {
        "id": "1nxhwz4",
        "author": "Organic_Caramel_8354",
        "title": "Wayward SUCKS",
        "content": "0/10. Weird. Uncomfortable. Good acting but terribly unpredictable script. I am so disappointed. I wasted 8 hours of my life for this. Unless there is a follow up season, I don’t see any rectification for this. \n\n",
        "upvotes": 236,
        "comments": 194,
        "media": null,
        "permalink": "/r/netflix/comments/1nxhwz4/wayward_sucks/"
    },
    {
        "id": "1nxeh8z",
        "author": "MelodicJello2099",
        "title": "Monster: Ed Gein is such a let down",
        "content": "Holy flip man this show blows. It’s wrenchingly slow paced, incredibly boring and all over the place. I don’t think I can make my way to another episode. I have no idea what the point in this is supposed to be but it’s horrid. Such a let down. ",
        "upvotes": 267,
        "comments": 409,
        "media": null,
        "permalink": "/r/netflix/comments/1nxeh8z/monster_ed_gein_is_such_a_let_down/"
    },
    {
        "id": "1nxjqgd",
        "author": "conzojay1",
        "title": "Ed gein story nonsense.",
        "content": "So he hits his brother over the head with a massive log (which didn’t actually happen in real life.) but somehow, the coroner misses the huge massive head wound the body would have and just blindly accepts asphyxiation as the cause of death without even checking the lungs either. Stupid logic, totally broke my immersion. ",
        "upvotes": 117,
        "comments": 87,
        "media": null,
        "permalink": "/r/netflix/comments/1nxjqgd/ed_gein_story_nonsense/"
    },
    {
        "id": "1ny340o",
        "author": "Sweaty-Toe-6211",
        "title": "Halo TV Show Hits Netflix, Quickly Becomes One Of The Most Popular Shows On The Platform",
        "content": "",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ny340o/halo_tv_show_hits_netflix_quickly_becomes_one_of/"
    },
    {
        "id": "1nyb1gm",
        "author": "Mysterious_Beat_8533",
        "title": "Monster: Ed Gein story",
        "content": "I think Tom Hollander was absolutely abysmal as Alfred Hitchcock. The casting was just a complete misfire, not that the shows writing of Hitchcock was any better. Any time he’s on screen I’m genuinely tempted to just fast forward to the Gein parts, he’s just painfully bad. Was pretty excited to watch this considering how good the Dahmer season was, but the flash forwards are just so disjointed and completely ruin any flow the show gets into. IMO they could have done it in a way that made the Psycho storyline work, like do it in the second half of the season, but the flash forwards to this, combined with the episodes of Buchenwald psychosis just make the show a complete mess.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nyb1gm/monster_ed_gein_story/"
    },
    {
        "id": "1ny80eo",
        "author": "Opening-Tomato9669",
        "title": "Fool me once (late review)",
        "content": "I watched this show today and what a waste of time and energy. I can't believe they made such of fuss over nothing. The acting was half decent but the plot does not make sense at all. Why did she go to such lengths at trying to find who killed Joe when she did it herself. A good thriller should be atleast a little bit if sense when you run it back in your head but this did not. She also comes across to me as a selfish mother . Why bring a child if you can not live for them. Time in time again , I have realised that living for love is more heroic than dying for it and this show is the exact example why. Her sister would not have wanted her to die to show the world the truth. It was stupid. Also how come Joe turned out to be a psycopath . Like do people not know the person they marry. He did not just kill once or twice. He probably killed more than shown in the show. What a rubbish show. I hated it maybe because I knew going in I was going to waste my time and I did it anyways. Okay bye!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ny80eo/fool_me_once_late_review/"
    },
    {
        "id": "1nyax60",
        "author": "WinterPomegranate297",
        "title": "You Season 5 and The Lost Bookshop by Evie Woods !Spoilers!",
        "content": "Yesterday I watched the last season of You. Part of the story was about Brontë, a randomly discovered employee of Joe’s.\nIt’s about a special bookstore that used to belong to his guardian (basically father) Mr. Mooney. Of course, the two of them fall in love, but it’s forbidden because he’s married and has a son.\n\nNow today I started reading the book, and I’m at chapter 19. Here, the married bookstore owner, who also has a son, inherited his antiquarian bookshop with old books from his father. He hires a female employee who just showed up out of nowhere, and they seem to be falling in love. Of course, that’s not really possible either. At the same time, the author Emily Brontë has already been mentioned several times.\n\nSo, for me it’s quite a coincidence that I’ve come across two such similar stories in a row. I know this isn’t such an unusual scenario, but honestly, I didn’t even know the name Brontë before, and I feel like the similarities are pretty striking, even though the rest of the story will probably play out differently.\n\nWhat do you think?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nyax60/you_season_5_and_the_lost_bookshop_by_evie_woods/"
    },
    {
        "id": "1ny28pb",
        "author": "lenniemom",
        "title": "Thoughts on Monster: Gein",
        "content": "Very very very different than Dahmer, Mendenez, OJ and Versace. \n\nAlmost melancholy in a way for the first episode. Second episode shocking. \n\nKind of like a engine revving up. \n\nHalfway through third episode. ",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ny28pb/thoughts_on_monster_gein/"
    },
    {
        "id": "1nxqnuv",
        "author": "anon9876543210nymous",
        "title": "It's ridiculous we have to wait 2-3 years for the next season !",
        "content": "I was eager for Wednesday and strange things to return \n\nAlso squid game. Upload ...\n\nBut I read online platforms will only renew a show once it's streamed for a year and shows ratings *good enough to renew*  which means filming can't really begin until much later to allow a timely release \n\nNetflix, prime all of them are doing this.\n\nI feel like they are trying so hard to save money that customer satisfaction isn't even considered ",
        "upvotes": 13,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1nxqnuv/its_ridiculous_we_have_to_wait_23_years_for_the/"
    },
    {
        "id": "1nyaa2w",
        "author": "lenniemom",
        "title": "What the Fudge? End of Monster: Gein",
        "content": "What the Fudge was this ending?  I like the song, but what the Fudge was Ryan Murphy thinking? \n\nThis is going to either make or break Charlie's career. \n\n",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nyaa2w/what_the_fudge_end_of_monster_gein/"
    },
    {
        "id": "1nxz9ex",
        "author": "Dadpod12",
        "title": "Halloween Movie Recs that Land Somewhere Between Disney and Freddy Krueger?",
        "content": "Looking for some Halloween movie recommendations that hit that sweet spot, not too cutesy Disney level, but also not full-on Freddy Krueger nightmare fuel.\n\nMy kids are getting older (around preteen age), and they’re at that stage where they want something a little scarier and more grown up, but I’d still like them to sleep through the night. 😅\n\nStuff like Ghostbusters, Gremlins, and have been hits in our house. Beetlejuice went over pretty well too. Trying to find more in that “fun spooky” category, things with monsters, mystery, or Halloween vibes without being too gory or depressing. Most recently we liked Hubie Halloween and The Curse of Bridge Hollow. Any recommendations for that middle ground? Bonus points for movies with adventure or humor mixed in! ",
        "upvotes": 4,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1nxz9ex/halloween_movie_recs_that_land_somewhere_between/"
    },
    {
        "id": "1nxcw4k",
        "author": "Big-Sprinkles7377",
        "title": "Charlie Hunnam as Ed Gein",
        "content": "I cannot get over how absolutely absurd his voice is in this show. I understand that he’s trying to replicate Gein’s voice to the best of his ability, but…did he really need to sound like THAT?? It was definitely a choice, that’s for sure. Lori Metcalf rules though. ",
        "upvotes": 116,
        "comments": 213,
        "media": null,
        "permalink": "/r/netflix/comments/1nxcw4k/charlie_hunnam_as_ed_gein/"
    },
    {
        "id": "1ny95q1",
        "author": "JicamaOdd2748",
        "title": "Riv4lries spin-off of Dia4ries",
        "content": "I just finished the show, and I honestly liked it. I found it really interesting. I tried watching Di4ries before, but I couldn’t get into it. I’m glad I at least finished this spinoff, though . Now I’m going back to Di4ries to give it another try and see if I like it this time. Has anyone else watched it? How did you feel about the show if you have?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ny95q1/riv4lries_spinoff_of_dia4ries/"
    },
    {
        "id": "1nxyzsd",
        "author": "shingaladaz",
        "title": "Sneaky Pete S2 questions",
        "content": "Why didn’t Maggie just tell Luka the money was behind the drywall? She had opportunity to do so.\n\nWho shot Sam in E10? They enter the house after being shot at by Colin’s girlfriend and then Sam is shot in the back. Who took the shot?\n\nThe whole Buffalo thing confused the crap out of me. I have a few questions;\n\nThey practiced some sort of disappearing illusion on the buffalo but I didn’t see it happen in the casino. Why?\n\nWhat was under the pallet wrap and what was in the big black box? Was the 2nd buffalo under the wrap? Was the black box empty? Why not just use one black box that had the 2nd buffalo in it and swap it out under the cloth? \n\nWhere’d the toilet rolls come from that the bags were filled with?\n\nWhen did Maggie have time to swap the money?\n\n**And there are some pretty awesome conveniences;**\n\nMaggie got to cut the buffalo.\n\nMaggie going back to the storage facility at all.\n\nColin and the guy that killed his dad killed each other rather than one kill the other and then that guy kills Otto. Instead Otto walks away like he knew they’d kill each other. Give me a break.\n\nAudrey getting away with everything. Dumb filler storyline that leads nowhere every single time is just that….dumb.\n\nAnd the amount of times Marius was in trouble and almost immediately out of it and cracking on as if nothing happened just became daft.\n\nThis season frustrated me. Not going to bother with S3. Can see where it’s going and can see why it was cancelled.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nxyzsd/sneaky_pete_s2_questions/"
    },
    {
        "id": "1ny7pi8",
        "author": "moon-1992",
        "title": "Recommendation for a lighthearted comedy show: dudes",
        "content": "\n\nI clicked on this show ‚dudes’ while looking for something to watch during dinner. The preview looked interesting; interesting enough that I thought it could just be some light background entertainment. But then I couldn’t stop watching and ended up finishing all eight episodes in one go.\n\nIt’s about four male friends in their 40s dealing with love, kids, work, houses, friendship in a funny and lighthearted way. It’s the perfect show to unwind with after a long workday or while eating.\n\nIt’s short, relatable, and genuinely entertaining. Totally recommend it!\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ny7pi8/recommendation_for_a_lighthearted_comedy_show/"
    },
    {
        "id": "1ny698l",
        "author": "Sure_Designer_2129",
        "title": "Batch releases for anime",
        "content": "If anyone is familiar with Netflix or its internal workings: why does Netflix often release anime in 8-10 episode batches then wait for a year instead of adding one new episode weekly? I am hearing that they are planning on doing it again with their new Steel Ball Run anime, proving that they either haven't learned anything by how abysmally Stone Ocean performed, or they have some sort of monetary incentive. This is strange because some of the other anime on Netflix DO have weekly episodes. How does Netflix decide which ones merit which type of release?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ny698l/batch_releases_for_anime/"
    },
    {
        "id": "1ny5ykw",
        "author": "yer_yeet_got_yote22",
        "title": "Monster: The Ed Gein Story",
        "content": "“Fornicating with a divorced woman. Drinking wine and eating these sinful cold cuts.” \n\nLMAO 😂😂😂\nI can’t stop laughing at this line. Who is writing this? Who wrote it? \nEvery character on this show is so weird it’s like the town has a gas leak. \n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ny5ykw/monster_the_ed_gein_story/"
    },
    {
        "id": "1nyati9",
        "author": "drywall_punching",
        "title": "Monster: The Ed Gein Story is legitimately one of the most disturbing things I've watched in a long time.",
        "content": "The way it's directed is better than most horror movies made of recently. The acting in it is also so good, it's so good it's disturbing. And this is coming from someone who has seem some dark shit on the internet and watched Cannibal Holocaust. Do not watch this if your squeamish or easily disturbed by gore or watching a guy straight up have sex with corpses.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nyati9/monster_the_ed_gein_story_is_legitimately_one_of/"
    },
    {
        "id": "1ny5cib",
        "author": "AdEuphoric3706",
        "title": "Wayward opinions?",
        "content": "In my opinion, it was really mid. It has SO much potential, but the ending was completely unsatisfying and left many plot holes. Plus, I feel like a lot of the language they use and soundtrack takes you out of the 2003 setting. It was also just so messy...felt like a different plot line each episode. (Semi spoilers) The last episode when Evelyn like leaves her wordly body made me cringe so bad. There was so much potential there. One thing I did like though was that there was a transgender character whose whole personality wasn't based around being trans. It was brought up a normal amount, but it wasn't the focus of the show. Acting was great too. What do y'all think?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ny5cib/wayward_opinions/"
    },
    {
        "id": "1nxyuwz",
        "author": "Infinite-Albatross44",
        "title": "The Way Home",
        "content": "Just finished the second season of the way home and I must say, i was lost in the story for almost two days of binge watching. Anyone else? It just grabbed and pulled me down the rabbit hole!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nxyuwz/the_way_home/"
    },
    {
        "id": "1ny43e4",
        "author": "LivingBee3614",
        "title": "Is dandadan streaming in Sweden?",
        "content": "Like I search it up and I still does not pop up I have tried in different ways and Netflix is in its latest version so I don’t understand I even searched it in different ways anyone know why is does not pop up?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ny43e4/is_dandadan_streaming_in_sweden/"
    },
    {
        "id": "1ny3cra",
        "author": "Ramazandro",
        "title": "Strange sound coming from the TV when Netflix is opened",
        "content": "When I open the Netflix app on my Homatics Box R 4K Plus, I hear a strange hissing sound coming from the TV, though not often. It disappears when I restart the box, or it temporarily stops when I mute the TV. I've noticed that the hissing only occurs when I open Netflix; it doesn't occur when I use other apps. How can I solve the problem?\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ny3cra/strange_sound_coming_from_the_tv_when_netflix_is/"
    }
]