[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 35,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 10,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1ppp9um",
        "author": "Fun_Molasses5215",
        "title": "Simon Cowell’s new boyband December 10 faces heated legal battle over name",
        "content": "",
        "upvotes": 80,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1ppp9um/simon_cowells_new_boyband_december_10_faces/"
    },
    {
        "id": "1ppr8q1",
        "author": "cmcb4",
        "title": "So, I was searching for Rob Reiner movies last night, specifically The Sure Thing and Stand By Me.",
        "content": "Another evening of struggling to decide on what to watch. I searched for Rob Reiner movies last night, specifically The Sure Thing and Stand By Me. We have the lowest cost ad version, so some movies have a lock symbol on them (upgrade $ required)ok fine. Only Stand By Me came up, (no lock symbol) so told my wife, let’s watch this. I was about to select it and right before our eyes the lock symbol popped up on it. Uhhgg..sob’s. ",
        "upvotes": 9,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ppr8q1/so_i_was_searching_for_rob_reiner_movies_last/"
    },
    {
        "id": "1ppnrgj",
        "author": "AssociateLittle1487",
        "title": "Netflix to launch FIFA World Cup video game",
        "content": "",
        "upvotes": 17,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1ppnrgj/netflix_to_launch_fifa_world_cup_video_game/"
    },
    {
        "id": "1pp9b3j",
        "author": "qqrz",
        "title": "Blue eye samurai",
        "content": "Who else has been waiting for this to come back since 2024? Best quality show to come out of  netflix in recent years. As someone who was never into animated shows before,  this blew me away with the quality of the writing and animation, and I have been waiting for the second season patiently....",
        "upvotes": 117,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1pp9b3j/blue_eye_samurai/"
    },
    {
        "id": "1ppiotz",
        "author": "starmaxeros",
        "title": "Warner CEO Zaslav giving Netflix CEOs a tour of their newly acquired studio",
        "content": "",
        "upvotes": 31,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ppiotz/warner_ceo_zaslav_giving_netflix_ceos_a_tour_of/"
    },
    {
        "id": "1ppqz69",
        "author": "CyberNeko97",
        "title": "Netflix Partners With FIFA For A New Era Of Digital Football Games",
        "content": "",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ppqz69/netflix_partners_with_fifa_for_a_new_era_of/"
    },
    {
        "id": "1poy8to",
        "author": "NovarisLight",
        "title": "Why can't I say \"not interested \" in these stupid fights advertised on autopsy on the top of Netflix?",
        "content": "As titled. I want to see or hear about these idiot fights on Netflix. There is no option to opt out. Why not? I am starting to dislike this service more and more.\n\nEdit: Title autocorrected... *on top of. Not autopsy...",
        "upvotes": 264,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1poy8to/why_cant_i_say_not_interested_in_these_stupid/"
    },
    {
        "id": "1ppsh9h",
        "author": "Beneficial_Eagle_453",
        "title": "Four (among many others) of the best Netflix series that they discarded...",
        "content": "When Netflix was fairly new they built a reputation of being a sort of \"saviour\" for series that were canceled on other channels, and rarely canceled theirs. As they grew to the global powerhouse they are now they began to cancel more and more. These are four shows that frankly were among Netflix finest and deserved at least a season to conclude the story. The Alienist (perfect at so many levels), Bodies (I honestly thought there would be a second season), Archive 81, left the fans with a bitter taste too after that amazing season finale and finally 1899 another fine series that did not deserved to be cancelled.  I am at the point that I don't even know anymore if I should invest time in starting a new series fearing that after one season netflix may cancel it. Anyone else feels like it?",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ppsh9h/four_among_many_others_of_the_best_netflix_series/"
    },
    {
        "id": "1pps0tw",
        "author": "KhalDingo",
        "title": "Badly in love is deceiving",
        "content": "It is an unexpected comedy in a form of a serious dating show. I am hooked, the participants are right out from a manga or an anime series. I didn’t expect that type of personality exist in Japan since everytime I travel I only see how polite and nice Japanese people are.\n\nI highly recommend watching this show. It shows another form of reality in Japan.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pps0tw/badly_in_love_is_deceiving/"
    },
    {
        "id": "1ppumsa",
        "author": "indy100online",
        "title": "Emily in Paris season 5: Every outfit inside Emily's $37,000 wardrobe",
        "content": "There are a number of things that excite us about a new season of [*Emily in Paris*](https://www.indy100.com/tv/emily-in-paris-season-5-release-date-plot), but one thing that remains consistent is the style.\n\n[Lily Collins](https://www.indy100.com/celebrities/lily-emily-in-paris-heels)' marketing mogul character has become [Netflix](https://www.indy100.com/tv/netflix-chicken-nugget-show)'s very own fashion icon thanks to her bold, daring taste, and in season 5, she hasn't slipped either.\n\nWith the new batch of episodes comes a whole host of new wardrobe inspiration, and we've already done the deep dive into where her looks are from.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ppumsa/emily_in_paris_season_5_every_outfit_inside/"
    },
    {
        "id": "1ppix0t",
        "author": "GainzAndZen",
        "title": "Finally Completed Breaking Bad",
        "content": "It was hell of a ride, absolute banger biach...\n\nMy favourite characters were Gus Fring , Hank And Walter \n\nI was disappointed to see hank die \nAlso Walter die .. I think he got away with all the monstrous things he did\n\nSometimes I was vouching for Walter to win and sometimes for hank \n\nIn the starting seasons i thought Skyler for wrong and arrogant \n\nBut later on I understood Skyler was right though I do not support her affair with ted \n\nIn the starting I was also vouching for Walter but later on I finally realised that he had become a monster regardles of his cancer \n\nThroughout the whole series I was trying to put me in characters shoes that I were in a similar situation then how would I have reacted \n\nBut in the end sometimes Skyler 's decision were right and sometimes walt's .. I was in moral dilemma \n\nNonetheless \n Season 1 was great (4.9/5)\n Season 2 was also good (4.5/5)\n Season 3 was a bit slow (4.3/5)\nBut season 4 and 5 were also bangers (5/5)  absolute cinema experience \n\nAfter penguine this is the series I have loved the most \n\nAnd should I watch better call saul and el camio movie? \n( I think they have extended it just to make money sorry if I am wrong )\n\n\nAnd if you can suggest something similar to watch I'm in..",
        "upvotes": 15,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1ppix0t/finally_completed_breaking_bad/"
    },
    {
        "id": "1ppt79m",
        "author": "Postking43",
        "title": "I cant play red dead redemption??",
        "content": "Red dead redemption is available on netflix?But when i search for it i cant find it and also on pc when i try to download from my laptop it says not compatible with your mobile device?Yes i know, i can install games on my phone thru my pc, but it says not compatible with your mobile device, i have a samsung s23... and also on play store when i search up red dead redemption i dont get the game...Yes i have tried searching on netflix but it still doesnt show.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ppt79m/i_cant_play_red_dead_redemption/"
    },
    {
        "id": "1ppp8g4",
        "author": "Additional_Key_8044",
        "title": "Frankenstein: Aesthetically Pleasing, Visually Lush, Morally Unequivocal",
        "content": "",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ppp8g4/frankenstein_aesthetically_pleasing_visually_lush/"
    },
    {
        "id": "1ppvmks",
        "author": "brysonboompaul",
        "title": "50 Cent Takes More \"Stranger Things\" Jabs As Diddy Doc Stays #1",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ppvmks/50_cent_takes_more_stranger_things_jabs_as_diddy/"
    },
    {
        "id": "1ppq1kv",
        "author": "Clarine87",
        "title": "What's the cause of my main monitor going black when netflix is fullscreen on another monitor and starts a new episode?",
        "content": "I assume it's connected to some kind of content protection, but it's really frustating when playing video games and I don't understand why the main monitor is affected whereas the monitor which is displaying the netflix content isn't (going black). \n\nOf course the screen of the second monitor is black in the episode transition (but the mouse pointer remains visible indicating it's just the website browser feed which is blank) - whereas the main monitor has a black screen and nothing is visible - as though it were off.\n\nForgot to add, it's usually for less than a second. It doesn't matter if netflix is full screen or windowed.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ppq1kv/whats_the_cause_of_my_main_monitor_going_black/"
    },
    {
        "id": "1posalo",
        "author": "Thin_Dig_8140",
        "title": "Kudos to netflix for adding a feature that automatically turns on the subtitles when you turn the volume all the way down.",
        "content": "Title says it all honestly i think its absolutely awesome. Im not sure if its a new feature or not but im posting this because I feel like its not known about maybe im just late literally just found out.",
        "upvotes": 279,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1posalo/kudos_to_netflix_for_adding_a_feature_that/"
    },
    {
        "id": "1ppsvyb",
        "author": "NotBob_05",
        "title": "How bad is the frequency of ads on the 5$ plan?",
        "content": "I wanted to buy Netflix for a month and I was wondering if paying 7€ extra is worth it for ad free? Is it like one ad at the start of episodes or like one ad every 5 minutes? Only want to have it for a month but if ads are like really frequent I think paying more might be worth it.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ppsvyb/how_bad_is_the_frequency_of_ads_on_the_5_plan/"
    },
    {
        "id": "1pps0vs",
        "author": "NoPersonality1998",
        "title": "Recordings of live shows on netflix",
        "content": "Hello. Me and my friends want to watch boxing match on netflix, but we can't watch it live. Are recordings of such live events usualy available on netflix next day? Thanks.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pps0vs/recordings_of_live_shows_on_netflix/"
    },
    {
        "id": "1pprzn3",
        "author": "3PointMolly",
        "title": "Looking for help finding the title of a Christmas movie on Netflix",
        "content": "I’m looking for the title of a specific Christmas movie that I saw promoted on Netflix.  I don’t know much about it, however the snippet that I saw showed some girls who saw their mom on TV attending a concert or sporting event after seemingly leaving home.   I know that’s not much but perhaps one of you have seen it?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pprzn3/looking_for_help_finding_the_title_of_a_christmas/"
    },
    {
        "id": "1ppff0b",
        "author": "paleogames",
        "title": "Pantheon is the best animated series I've ever seen. Possibly the best entertainment I've ever seen.",
        "content": "Watch the trailer. If you like that vibe, it will blow your mind. \n\nSo many creative ideas in every aspect of the show, from character design to visual representations of battles, love and digital worlds. \n\nIt's a masterpiece and I can hardly explain why it resonates so much with me. I sure am a computer nerd but when it comes to tv I have a broad taste and tend to find tech oriented series uninteresting.  For instance I didn't like Mr robot even though I thought I should based on friends recommendations. \n\nPantheon hits the right beat for me. Eternal respect to the creators. \n\n",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ppff0b/pantheon_is_the_best_animated_series_ive_ever/"
    },
    {
        "id": "1pp30tc",
        "author": "DefCatMusic",
        "title": "Is Netflix 4k worth it?",
        "content": "Wife and I just spent ​our christmas bonus and gift ​budget on a new oled 4k tv and sound system. Netflix then prompted us that we should upgrade to the 4k plan. For us + her little sister as an added member that is 33.98$. we do watch a lot of Netflix but I'm worried I could just be purchasing bluerays of what I want to watch at this point.\n\n  \nAnyway was to pay this yearly in a bundle instead? I doubt any services have a bundle that include the 4K plan.",
        "upvotes": 16,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1pp30tc/is_netflix_4k_worth_it/"
    },
    {
        "id": "1ppsedr",
        "author": "peanut-dustt",
        "title": "With Love Meghan Festive Special",
        "content": "Don’t get me wrong there are things to criticise Meghan for but this ain’t none of them.\n\nI really enjoyed this special, seeing the hand made crackers and quick appetisers and centrepieces for the festive period really was inspiring.\n\nPeople love to criticise her and im not the biggest fan but I really think this is her niche. It reminds me of the one off Christmas specials that Kirstie Allsopp would do on channel 4.\n\nI really think if she did further specials like this for Easter or for the summer period it would be a hit. It’s nice light entertainment to sit back and enjoy and maybe get a few ideas from. If you find any issues with this Christmas special just admit you hate her for no reason.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ppsedr/with_love_meghan_festive_special/"
    },
    {
        "id": "1ppalo2",
        "author": "choochooreddi",
        "title": "Does anyone know at what time 10DANCE releases?",
        "content": "It's supposed to release today on the 18th, but I was wondering if anyone knows when that could be. I don't have Netflix and I've heard conflicting opinions about the exact time(s) shows or movies become available to watch. Would appreciate any help!",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ppalo2/does_anyone_know_at_what_time_10dance_releases/"
    },
    {
        "id": "1ppixdg",
        "author": "Sorry-Area4177",
        "title": "[Countdown] Stranger Things 5 - Vol. 2 Countdown",
        "content": "[https://www.reddit.com/r/Stranger\\_Things5/comments/1ppicw5/countdown\\_stranger\\_things\\_5\\_vol\\_2\\_countdown/?utm\\_source=share&amp;utm\\_medium=web3x&amp;utm\\_name=web3xcss&amp;utm\\_term=1&amp;utm\\_content=share\\_button](https://www.reddit.com/r/Stranger_Things5/comments/1ppicw5/countdown_stranger_things_5_vol_2_countdown/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button)",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ppixdg/countdown_stranger_things_5_vol_2_countdown/"
    },
    {
        "id": "1ppjgq4",
        "author": "Suspicious-Peace9233",
        "title": "The 100 is leaving",
        "content": "I am on my third rewatch of this show. It’s such an escapism show for me. It’s comforting. It seems so detached from reality. Maybe it’s because the characters will always be in a worse situation than me but I love this show. When I saw it was leaving, I decided to watch it again. I made it to season 4. Tonight is the last night. I may cancel my subscription. I do not watch much on here anymore. I don’t have HBO which is where the 100 is going. It’s frustrating because I have so many streaming services. I am just sad it is leaving",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1ppjgq4/the_100_is_leaving/"
    },
    {
        "id": "1poqwe5",
        "author": "kdrama_fan_921",
        "title": "Too many dating shows... but very very few gamey competitive shows",
        "content": "Netflix has an ocean of dating reality shows and it's truly getting tiring.. bcoz there's no other variety available.... Battle camp was such a nice change... It was fun.... Different groups, winning challenges based on luck, strength &amp; logic.... ,with periodic eliminations... but they cancel that too....?? We need more shows like battle camp please...",
        "upvotes": 31,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1poqwe5/too_many_dating_shows_but_very_very_few_gamey/"
    },
    {
        "id": "1ppezms",
        "author": "ConcentrateNew9810",
        "title": "Project Bakover curse?",
        "content": "We're just watching the show on Netflix and are checking the places on Google Maps.\n\n Seems like most of the locations are now \"Permanently closed\"\n\nI could not find any drama online. Any idea what happens to those seemingly successful bakeries that they close down not long after?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ppezms/project_bakover_curse/"
    },
    {
        "id": "1pottwf",
        "author": "Tasty-Account2220",
        "title": "Netflix: Pluto",
        "content": "I’ve just finished Pluto after stumbling upon it by chance on Netflix. I was actually just looking for something to have playing in the background, without the intention of actively watching it. Ever since Vinland Saga and AoT, I had pretty much given up on finding something genuinely good in that space — especially on Netflix.\n\nFirst of all: did anyone else notice how many hints and references there were to Monster?\n\n1. Tenma being a scientist/doctor.\n2. And what I found even crazier: they basically adapted Julius Reichwein 100% as Ban-Kouchou. He looks exactly like Julius Reichwein. Like, 1:1. \n\nI also really loved the many Evangelion references (e.g. “pierced Braun 1589 → Adam pierced by the Lance”). Those are just the ones I personally noticed.\n\nThat said, I’m left with a few questions:\n\n1. How was Braun 1589 able to kill a human? And how was Gesicht able to kill a human as well, when they technically shouldn’t be capable of that? As far as I understand, only Pluto — and Abdulla — should have been able to do so, since they were equipped with unpleasant emotions. Braun and Gesicht were created as “normal” AIs.\n2. Why was Atom able to lie to Helena at the end?\n3. Who is the teddy bear, and why did Braun decide to kill him?\n\nI get that, especially in sci-fi, you can’t avoid a few plot holes — but there were quite a few things that ultimately made me settle on an 8.5/10.\n\nThe lack of fight scenes didn’t bother me at all — quite the opposite. There were so many incredibly beautiful and symbolic images: Pluto crying together with Atom, Epsilon slowly shattering to light etc. It all felt almost like a dream. I think it was a very smart decision by the creators to prioritize these atmospheric visuals over action scenes.\n\nI might have liked to see at least one female member among the seven robots, though.\n\nLastly, I really wonder why this anime is so relatively unknown. And: do you have any other anime recommendations? I had basically given up on the whole medium, but Pluto has given me hope that there’s still something truly great out there.",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pottwf/netflix_pluto/"
    }
]