[
    {
        "id": "1lw9k8l",
        "author": "NishinosanTV",
        "title": "KPop Demon Hunters directors and music supervisor is doing an AMA on r/kpop today at 9 AM PT.",
        "content": "Hey r/netflix \n\nWe're being visited by some of the people behind KPop Demon Hunters today for an AMA on [r/kpop](https://www.reddit.com/r/kpop/). Notably the directors Maggie Kang and Chris Appelhans alongside the music supervisor Ian Eisendrath. The AMA starts at 9 AM PT.\n\nYou can send your questions in the thread attached to this post. Or, you can head on over directly to [r/kpop](https://www.reddit.com/r/kpop/) now, it'll be pinned at the top.\n\nNish\n\n[r/kpop](https://www.reddit.com/r/kpop/) modteam",
        "upvotes": 12,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lw9k8l/kpop_demon_hunters_directors_and_music_supervisor/"
    },
    {
        "id": "1lxi3wf",
        "author": "Whorelations",
        "title": "LIVE Tonight: Biggest Event in Women's Boxing History",
        "content": "You’ve probably seen this on your Netflix recommendations—but if not, tune into  ***Katie Taylor vs. Amanda Serrano 3***  live tonight at 8 PM EST, an all-women’s boxing event with international undercards and major titles on the line.\n\nThe event features fighters from the UK, Mexico, Brazil, Canada, the U.S., and Spain, showcasing a global roster of talent. One big name on the card is  *Chantelle Cameron*, who split two fights with Taylor—and never got a third, after Taylor declined the trilogy. That tension still lingers.\n\nIf you watched  ***Jake Paul vs. Mike Tyson***  in November 2024, you probably agree that the co-main stole the show. Tonight, that rematch is back—this time at *Madison Square Garden*. Hopefully Netflix’s servers hold up better this time; last time, glitches meant a lot of fans missed key moments.\n\nAs for the main event: Serrano lost the first fight, barely dropped the second by  *unanimous 95–94*, and left the ring with a nasty cut. She’ll be coming back for blood. Taylor, meanwhile, is looking to shut the door on the rivalry for good—**this bout is billed as the final chapter of their trilogy**.\n\nFrom top to bottom, this card is loaded. This is surely going to be a night to remember. ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1lxi3wf/live_tonight_biggest_event_in_womens_boxing/"
    },
    {
        "id": "1lx24tv",
        "author": "jenkinsvr",
        "title": "I just want to say... Thank You Netflix",
        "content": "Wow, thank you so much Netflix. I just recently got into the show, Into the Night. I was hooked from the first episode, fully invested, and halfway through, I had that creeping realization: “Oh no… this feels canceled.” And of course, I was right!\n\n No official announcement, no goodbye, just radio silence. Honestly, it’s such a bold move to lure viewers in with such great storytelling only to pull the plug without warning. Truly inspiring.\n\nWho needs closure or a satisfying conclusion when you can just leave characters and audiences dangling in a void of unfinished arcs? The way you cancel shows based purely on streaming data instead of giving them time to grow? Absolutely visionary. \n\n\nNothing says “we value your time” like pulling the rug mid-binge. Really, Netflix, thank you for reminding me not to get emotionally attached to anything on your platform ever again. Great job keeping disappointment fresh and consistent!\n\n",
        "upvotes": 127,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1lx24tv/i_just_want_to_say_thank_you_netflix/"
    },
    {
        "id": "1lxjvp7",
        "author": "No_Restaurant9741",
        "title": "Just started watching Alice in borderland",
        "content": "Wanted to fill the empty hole I had since Squid Game ended so started watching Alice in borderland. Currently on episode 3 and I am going into the series completely blind.",
        "upvotes": 12,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1lxjvp7/just_started_watching_alice_in_borderland/"
    },
    {
        "id": "1lxmun8",
        "author": "Few_Substance_705",
        "title": "\"Too much\" is just \"Girls\" repackaged and its cringe and out of touch.",
        "content": "HOT TAKE!! I am yet to meet the Lena Dunham/ Girls Stans. \n\nFor the life of me I couldn't understand who resonated with \"Girls\" the entire premise was a selfish, spoiled jewish chick who made terrible decisions and then became the victim of her own sabotage. Fast forward to I was on a 9 hour flight last night and downloaded \"too much\" on Netflix, within the first few mins it felt familiar. And then when I saw Lena Dunham in the second episode It hit me. The main character is Lena Dunham in \"Girls\" and this entire show is \"Girls\" repackaged and set in London. EVEN her love interest looks and acts like exactly Adam!! \n\nThe worst part is in an interview Lena Dunham said this show was meant to resonate with Gen Z. How???!! I am a millennial who works in marketing and even I know Its so out of touch! ",
        "upvotes": 5,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1lxmun8/too_much_is_just_girls_repackaged_and_its_cringe/"
    },
    {
        "id": "1lwrkhp",
        "author": "Sudden_Pop_2279",
        "title": "‘Squid Game’ Season 3 Achieves Netflix’s Best 10-Day Viewership Ever With 106.3 Million Views",
        "content": "",
        "upvotes": 277,
        "comments": 64,
        "media": null,
        "permalink": "/r/netflix/comments/1lwrkhp/squid_game_season_3_achieves_netflixs_best_10day/"
    },
    {
        "id": "1lxbhl6",
        "author": "corrupted0088",
        "title": "Thank you Netflix for animal kingdom!!!",
        "content": "What should my next show be? I enjoyed animal kingdom and waterfront. I liked ozark so something similar to that ? I have watched the outer banks it was pretty good more for the younger crowd but I enjoyed it.",
        "upvotes": 9,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lxbhl6/thank_you_netflix_for_animal_kingdom/"
    },
    {
        "id": "1lxnsct",
        "author": "Lostinlife213",
        "title": "User login",
        "content": "Can I see who is logged in on Netflix on my Xbox like location or device can’t seem to figure this out without using a pc or laptop only can use my Xbox or google cast ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lxnsct/user_login/"
    },
    {
        "id": "1lxf9o9",
        "author": "Ballin_Like_Curry",
        "title": "What to watch based on my likes?",
        "content": "Just got netflix after about a 7 year break so am looking to catch up on some gems i missed based on my likes. Off the top of my head stuff that i remember watching and liking was Dark,the sandman,stranger things,yellowjackets,squid game,the rain,the oa, and a couple zombie shows",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lxf9o9/what_to_watch_based_on_my_likes/"
    },
    {
        "id": "1lxbzv6",
        "author": "adele28",
        "title": "Does anyone know the documentary I am talking about?",
        "content": "I watched this a while ago and barely remember it now. What I do remember is that it's a kind of documentary series about a conman. One of the scams was the guy claimes to join a marathon (I think) and he is sponsored by someone who was from the same country that the conman claimed to be from. After receiving the money, he keeps making excuses, gets disqualified from the marathon, etc. My description could be wrong, I watched this quite a while ago 😬",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lxbzv6/does_anyone_know_the_documentary_i_am_talking/"
    },
    {
        "id": "1lxg0je",
        "author": "Billybob35",
        "title": "Madea's Destination Wedding is now streaming",
        "content": "Cast:\n\nTyler Perry\nCassi Davis Patton\nDavid Mann\nTamela Mann\nTaja V. Simpson\nDiamond White\nJermaine Harris\nXavier Smalls\n\n[https://www.youtube.com/watch?v=WdAYvmk4QjA](https://www.youtube.com/watch?v=WdAYvmk4QjA)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lxg0je/madeas_destination_wedding_is_now_streaming/"
    },
    {
        "id": "1lwugb2",
        "author": "Key-Monk6159",
        "title": "Old Guard 2",
        "content": "I can't think of a show I more looked forward to continuing after One and was thrilled when Two finally showed up.\n\nAnd it Really SUCKED!\n\nThey spent the money. Hired the actors. Got the crew together. And this is what they come with?\n\nThat is all.",
        "upvotes": 27,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1lwugb2/old_guard_2/"
    },
    {
        "id": "1lxejx8",
        "author": "Kooky_Writer_780",
        "title": "How to fix this??",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/o42wpwcmgacf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1lxejx8/how_to_fix_this/"
    },
    {
        "id": "1lxc3sg",
        "author": "Distinct-Cup2008",
        "title": "New Interface and Promoted Shows",
        "content": "IMO, i don't like the new interface. This is why:\n\n1. It is a little slow overall\n\n2. 'My List' should have remained a grid because that makes it easier to find shows in a large list. Now you have to scroll one show at a time. With Netflix shuffling the list, it is really painful to  pick the show you want\n\n3. Glad you put the 'Coming Soon' shows back. Those reminders are a goldmine.\n\n4. Can you add a category for \"Leaving Soon\"?\n\n5. I am seeing a lot of canceled and incomplete shows being promoted. These shows should be tagged as such, it's so we don't have to waste time with shows that go nowhere. I have lost 20 hrs of my life to this, but its more about investing your emotions into a show and then you are left hanging. I do Google but sometimes those results are false. We should not have to constantly research this. Just pull shows that are cancelled or have no ending. I think it makes more sense to have every season be self-contained if you are regularly cancelling shows. I think from observing, a lot of people are really frustrated by this, so it makes sense for you to have content providers fashion their content like this but perhaps give them a handful of episodes to come to a close. Some of the shows i wasted time on could have been wrapped up with 2-3 more episodes.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lxc3sg/new_interface_and_promoted_shows/"
    },
    {
        "id": "1lx2v2w",
        "author": "Twikkilol",
        "title": "No obvious way to contact Netflix support",
        "content": "So I cannot log into my account both on my phone and computer(s) and it just gives me \"technical error\" reason. Looking through support, th ere is no obvious reason how to contact support, no phone number listed, no live chat, no email. \n\nHow can such a large company have such a poor service quality? ",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1lx2v2w/no_obvious_way_to_contact_netflix_support/"
    },
    {
        "id": "1lx6wqj",
        "author": "leyy_pink1997",
        "title": "What documentaries is the best to watch ?",
        "content": "Like napanood KO Yung Man on Wire where is\nJames Marsh's doc about artist Phililppe Petit's artful caper brings you every ounce of suspense that can be wrung from a man on a (suspended) wire. The stories was Using actual footage from the event seamlessly mingled with new re-enactments, filmmaker James Marsh masterfully recreates high-wire daredevil Philippe Petit's",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lx6wqj/what_documentaries_is_the_best_to_watch/"
    },
    {
        "id": "1lx3zbd",
        "author": "Important-Tell-1178",
        "title": "Jenna Ortega Returns in 'Wednesday' Season 2: Enid in Danger!",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lx3zbd/jenna_ortega_returns_in_wednesday_season_2_enid/"
    },
    {
        "id": "1lwwepm",
        "author": "Expensive-Baby-1391",
        "title": "Question for Penville Season 5 Episode 6",
        "content": "There is a song playing in the credits of Season 5 Episode 6 of Penville and I desperately want to know what it is. I tried everything from Shazam to watching the credits to find the name of the song. Does anyone know what its called?",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lwwepm/question_for_penville_season_5_episode_6/"
    },
    {
        "id": "1lxdvoa",
        "author": "starss4riri",
        "title": "HAWKING???",
        "content": "WHY AM I JUST FIGURING NOW OUT THAT THE DOGS NAME IN THE “ADAM PROJECT” IS HAWKING??? I THOUGHT HIS NAME WAS ROCKET 😓😭 I FEEL LIKE ROCKET SOUNDS SO MUCH BETTER THAN HAWKING",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lxdvoa/hawking/"
    },
    {
        "id": "1lx9cxs",
        "author": "indiewire",
        "title": "'Too Much' Cameo Guide: Lena Dunham's Life Story, Fact vs. Fiction",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lx9cxs/too_much_cameo_guide_lena_dunhams_life_story_fact/"
    },
    {
        "id": "1lx0lqu",
        "author": "Kiwimati",
        "title": "Battle camp - spelling",
        "content": "Don't really like reality tv but started watching battle camp because I like to see the games they have to play. \nI know reality tv is often scripted and I hope BC is as well. \n\nBecause no way is it possible that the spelling game is real? Words like ocean, steam, revenge?! Seriously... English is not my first language (it's not even my second) and I know perfectly how to spell these super easy words. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lx0lqu/battle_camp_spelling/"
    },
    {
        "id": "1lxd532",
        "author": "Usual_Technician_810",
        "title": "I'm obsessed with these jeans please help 😭",
        "content": "In the new series \"Building The Band\" Noreilla wore these jeans. I tried Google pics but nothing, so please help a girl out. (Btw I like the show too)",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1lxd532/im_obsessed_with_these_jeans_please_help/"
    },
    {
        "id": "1lvzgbo",
        "author": "MaxwellSmart07",
        "title": "Nominations for the worst series currently playing on Netflix?",
        "content": "I’ve seen a lot of losers, well actually I’m mostly on Reddit while my wife watches. Currently she is watching Blindspot, a ridiculous the world’s going to blow up every day FBI drams (um, farce). That’s my nomination. Any others anyone wants to warn me about. Thanks.",
        "upvotes": 214,
        "comments": 309,
        "media": null,
        "permalink": "/r/netflix/comments/1lvzgbo/nominations_for_the_worst_series_currently/"
    },
    {
        "id": "1lvsll9",
        "author": "grasskisser",
        "title": "Netflix cancels The Residence",
        "content": "I just read this and I am so upset! I really enjoyed this show, so did everyone else I know who watched it. It was about a murder in the White House, and it really kept me guessing the whole time. Cordelia  Cupp, a modern day Columbo, and bird watcher was riveting!  I am so sad because Netflix, in my opinion, does this with so many shows. I wish they would at least commit and do less shows for production. They have so much junk on the platform that is no good, but this was, it really was! Tell me what you ladies and gentleman think below. Am I the only one? I would love to hear your thoughts. ",
        "upvotes": 368,
        "comments": 120,
        "media": null,
        "permalink": "/r/netflix/comments/1lvsll9/netflix_cancels_the_residence/"
    },
    {
        "id": "1lwwinc",
        "author": "Muppet885",
        "title": "Trainwreck: The Real Project X",
        "content": "I really thought this story was going to be based on the Corey Worthington party in Australia that was the movie Project X's inspiration but no this was even more insane then Corey's party. \n\nTrainwreck does these documentaries so damn well! I have watched every single documentary now! ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lwwinc/trainwreck_the_real_project_x/"
    },
    {
        "id": "1lwo7gv",
        "author": "KixAss37",
        "title": "Building The Band Subreddit!",
        "content": "If you're into the Netflix show \"Building The Band\"come check out r/BuildingTheBandSeries! We're chatting about the singers, band drama, songs, and everything else related to the series. All appropriate posts and comments are welcome. So feel free to jump in and share your thoughts and opinions, no pressure! 🙈",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lwo7gv/building_the_band_subreddit/"
    },
    {
        "id": "1lwn1md",
        "author": "Holiday-Chipmunk-378",
        "title": "Show suggestions",
        "content": "I am just finishing “Animal Kingdom” season 6 -  can anyone suggest my next watch ??  Fan of crime / thriller / anything gripping .  Thanks in advance !!! ",
        "upvotes": 3,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1lwn1md/show_suggestions/"
    },
    {
        "id": "1lx55l9",
        "author": "Minimum_Way2086",
        "title": "Are there any non-violent, non-intense shows on Netflix?",
        "content": "I like having background sound basically when I go to sleep - typically been doing YouTube videos of late night celebrity interviews, but I’d like to actually watch a bit of a show before falling asleep. \n\nBut it feels like everything on Netflix is either too intense or too violent to watch right before going to sleep 😂 Or maybe my algorithm is too influenced by my daytime documentary watching, lol. \n\nAny recommendations for a show that is suitable to watch before going to sleep? Bonus points if the episodes are around 30 minutes each. ",
        "upvotes": 0,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1lx55l9/are_there_any_nonviolent_nonintense_shows_on/"
    },
    {
        "id": "1lwibs6",
        "author": "Right_Carpenter_7418",
        "title": "Where is the “coming soon” tabs of Netflix in it’s new UI",
        "content": "Before the Ui change, there were sections called “coming this week”, “coming next week”, and “coming soon”. But ever since the new Ui came, it only shows “coming soon”, and my problem with that is that it doesn’t even show ALL of the soon to be released shows/movies. The way I know is that in the “top searches” section, it shows “The Fragrant Flower Blooms with Dignity”, but it states it’s releasing soon.\nAnyone know where I can find the “coming next week”, “coming this week” sections?",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1lwibs6/where_is_the_coming_soon_tabs_of_netflix_in_its/"
    },
    {
        "id": "1lwqjk1",
        "author": "Blink_Flashpoint",
        "title": "KPop Demon Hunters 4K Availability?",
        "content": "Hi, didn’t know where else to ask this\n\nI just wanted to ask if people on the premium Netflix plan have the option to see the movie in 4K? Or is HD the highest option available? If the movie is not available in 4k on Netflix, does Sony ever release movies to blu ray later?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lwqjk1/kpop_demon_hunters_4k_availability/"
    },
    {
        "id": "1lwkt6d",
        "author": "Illustrious_Cut1730",
        "title": "Miss Italia mustn’t die",
        "content": "I found this documentary on Netflix! \n\nMiss Italia is part of my childhood, I used to watch it with my grandma and it marked the end of the summer and the beginning of the school (I think the final was a couple of days before the school start). \n\nAside from the sweet memories with my nonna, I always thought it was a bleak context and quite toxic. \n\nBut then you have Aurora, who is an absolute gem and has no fear of being unapologetically herself. She even stood up for the winner of one pageant, that her mom was fat-shaming.\n\nAurora, we need more people like you! ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lwkt6d/miss_italia_mustnt_die/"
    },
    {
        "id": "1lx28xw",
        "author": "CrAzY-GEMU-OKAMI96",
        "title": "Is the Squid Game finale as as as people say it is?",
        "content": "I hear people constantly complaining about the ending to the show. I'm only on S2 ep2. So I don't want to waste my time watching something that will end poorly. (I already did that with The Promised Neverland, never again)",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1lx28xw/is_the_squid_game_finale_as_as_as_people_say_it_is/"
    }
]