[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 11,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 598,
        "comments": 4618,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1ngbunt",
        "author": "Lonely_College2451",
        "title": "Breaking Bad, yay or nay? Bingeable or no?",
        "content": "I'm about to start Breaking Bad for no reason other than that I've heard it's good. \n\nI avoided it I think because my dad raves about it and y'know, when you're a teen and your dad starts raving about something, you're like ew I don't wanna watch that! Well now that I'm older, and I also have a better relationship with my dad, I've learned that I'm allowed to watch/listen to/read the same things he does and like it and it doesn't have to mean anything. \n\nI'm biting the bullet. I saw a reel the other day on Instagram with some dude from the show, played by Giancarlo Esposito, walking out of a room with HALF HIS FACE GONE??? And I was like DAMN! Apparently he knocks his role out of the park and I do love the guy. \n\nSo, am I in trouble? Is it really a great show? Will I find myself sucked in? Be honest lol I wanna know how bad I'm about to fixate on this shit. I wanna know how dynamic and bingeable it is. ",
        "upvotes": 102,
        "comments": 275,
        "media": null,
        "permalink": "/r/netflix/comments/1ngbunt/breaking_bad_yay_or_nay_bingeable_or_no/"
    },
    {
        "id": "1nfww65",
        "author": "Haunting_Tie_589",
        "title": "Are you actually joking?",
        "content": "How DARE they? Like ads aren't bad enough now they block some shows and films unless you go and free?\n\nI am genuinely so angry about this.\n\nWhat do you guys think???",
        "upvotes": 276,
        "comments": 130,
        "media": null,
        "permalink": "/r/netflix/comments/1nfww65/are_you_actually_joking/"
    },
    {
        "id": "1ngd85i",
        "author": "Crackiller1733",
        "title": "Has Netflix not learned from the Tyson/Paul fight ?",
        "content": "Netflix not loading . Is it too many users trying to watch the fight? Like come on this is getting ridiculous. Trying to watch this fight and can’t load. Anyone else having issues?",
        "upvotes": 11,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1ngd85i/has_netflix_not_learned_from_the_tysonpaul_fight/"
    },
    {
        "id": "1ngb4cq",
        "author": "Financial-Wish-311",
        "title": "What is the big deal about Canelo Crawford?",
        "content": "Netflix is calling it 'once in a life time'. Crawford is going to get absolutely schooled. Crawford is punching above his weight here literally. Can see Canelo coasting to victory. But what I can't get is the hype. Why is this supposedly a ‘Super fight'",
        "upvotes": 7,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1ngb4cq/what_is_the_big_deal_about_canelo_crawford/"
    },
    {
        "id": "1ngepf5",
        "author": "Fancy_Dev",
        "title": "Anyone else having trouble watching the fight?",
        "content": "Been having trouble watching the fight. It keeps showing me the feed in 144p and it looks really awful. I have more than enough bandwidth to stream the event at max quality.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ngepf5/anyone_else_having_trouble_watching_the_fight/"
    },
    {
        "id": "1ngegmq",
        "author": "khon24",
        "title": "Is anyone getting 4k on the Canelo Crawford stream?",
        "content": "I asked chat support earlier if the fight would be broadcast in 4K before I upgraded my account to premium and they had to go check with their team for 10 minutes but ultimately said yes it will be. So I upgraded and of course it’s still 1080p. Is anyone getting 4k?",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ngegmq/is_anyone_getting_4k_on_the_canelo_crawford_stream/"
    },
    {
        "id": "1ngbku7",
        "author": "CollectionOk8963",
        "title": "Can I get the boxing match tonight on a with ads subscription ? Don’t have Netflix so I’m just wondering what plan I’d need for the fight",
        "content": "Does the ad free subscription work for the fight tonight? I’m trying to watch the canelo fight I don’t have Netflix but just wanted to see if the 7.99 plan would still get the fight .. thanks ",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ngbku7/can_i_get_the_boxing_match_tonight_on_a_with_ads/"
    },
    {
        "id": "1nfx3r9",
        "author": "Thick_Difficulty_247",
        "title": "Anyone Can Delete Profiles?",
        "content": "I have an adult account on Netflix and two child accounts. Is there anyway to stop the child accounts from being able to delete each other? They do this to spite and it’s a real inconvenience having to set it up all the time.\n\nI did look and the answer was no but this was 2 years ago so thought maybe I’d see if anything has changed!",
        "upvotes": 12,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nfx3r9/anyone_can_delete_profiles/"
    },
    {
        "id": "1ngelby",
        "author": "LaBeef73",
        "title": "What type of intro",
        "content": "Dana white’s stamp is all over the production for Canelo vs Crawford. But this dry intro for the announcer needs to be changed. Idk give a fly fuck if Voldemort sponsored this fight keep the camera on the fighters. And keep it short a sweet.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ngelby/what_type_of_intro/"
    },
    {
        "id": "1ngd0l4",
        "author": "Fit-Force-9125",
        "title": "Should I watch Komi Can’t Communicate",
        "content": "  Recently got recommended and I watched the trailer , I want to know what you guys thought of this show and If I should check it out??? Let me know if it’s good!! ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ngd0l4/should_i_watch_komi_cant_communicate/"
    },
    {
        "id": "1ngc1ub",
        "author": "Khyranos",
        "title": "Could watch movie yesterday, but not today. Now only giving me a 'reminder' option.",
        "content": "Was watching this yesterday/early this morning (I work overnight), and it won't let me watch it now, instead only giving me an option to 'remind' me. What gives?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ngc1ub/could_watch_movie_yesterday_but_not_today_now/"
    },
    {
        "id": "1ngaftx",
        "author": "Karionnn",
        "title": "Netflix stuck at loading",
        "content": "As title says, Netflix is stuck on loading, already tried most suggestions like restarting internet, clearing cache, restarting phone, and clearing data\n\nYet this pos still wont work, any suggestions?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ngaftx/netflix_stuck_at_loading/"
    },
    {
        "id": "1nga0vi",
        "author": "kalat1979",
        "title": "Home For Christmas Season 3, New Locations",
        "content": "Any news on when season 3 is dropping? \n\nHave any new locations been announced? I loved both I Hate Christmas and Yoh! Christmas, I hope they keep redoing the story in new countries. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nga0vi/home_for_christmas_season_3_new_locations/"
    },
    {
        "id": "1ng9x2f",
        "author": "chaotic-kotik",
        "title": "Subtitles are missing on Dutch Netflix",
        "content": "Hey folks. I have a slightly strange question. I noticed that many shows on Netflix in the Netherlands have no Dutch or English subtitles. For instance, one punch man has only German subtitles and Demon Slayer has only French subtitles. Why is that?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ng9x2f/subtitles_are_missing_on_dutch_netflix/"
    },
    {
        "id": "1ng9s53",
        "author": "razor_guy",
        "title": "17-year .NET dev curious about making the leap to Netflix - realistic or pipe dream?",
        "content": "I’ve been a C# .NET developer for my entire 17-year career, primarily building domain-driven, object-oriented internal line-of-business web applications on smaller teams (never more than 10 people).\n\nI keep seeing Netflix salaries posted online and they’re significantly higher than what I’m making here on the east coast (Pennsylvania). It’s got me curious about what actually drives those compensation levels - is it the scale, the technical complexity, the culture, or something else entirely?\n\nI realize complexity probably varies wildly between teams at Netflix, so maybe this is impossible to answer broadly. But I guess what I’m really wondering is: do I have what it takes to work there?\n\nI don’t consider myself anything special - just a solid software engineer who enjoys problem-solving. But when I see those salary numbers, I can’t help but wonder if there’s a whole different level of engineering happening that I’m not exposed to in my current role.\n\nHas anyone made a similar transition from traditional enterprise development to a company like Netflix? What was the biggest adjustment?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ng9s53/17year_net_dev_curious_about_making_the_leap_to/"
    },
    {
        "id": "1ng8cke",
        "author": "darkbluemidnights",
        "title": "Shows like Brooklyn nine nine",
        "content": "I’ve just finished watching Brooklyn nine nine (at least all that’s available on Netflix, I read that there’s more on other streaming services) and I’d like another show with a similar vibe. I tried looking at an old thread, but every time I’d go to look up a show it wouldn’t show up on Netflix. Main thing I’m looking for is humor and good character dynamics \n\nSome other shows I liked are the good place (disappointing that it’s leaving Netflix), a few episodes of yellowjackets and Ghosts (US) (I currently can’t/haven’t watched either entire show, but I’ve enjoyed what I watched,) and young Sheldon",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1ng8cke/shows_like_brooklyn_nine_nine/"
    },
    {
        "id": "1ng8a1l",
        "author": "fizzlingbee",
        "title": "How much time after you unpause, can you pause again?",
        "content": "So, if I paused three times in a row, which is the limit, can I unpause for one month and then pause for 2-3 months in a row again? Is there a limit per times a year or something like that? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ng8a1l/how_much_time_after_you_unpause_can_you_pause/"
    },
    {
        "id": "1ng86ge",
        "author": "Puzzleheaded_Sky3043",
        "title": "Family reunion",
        "content": "So i have a question on the episode Pt 1 episode eight “remember macho mazzi?”, and while maybe the message of jade’s part of the story may be like obvious for other people i didnt get it. What i mean is i did(?) I got the natural beauty part and im sorry but in so confused, can someone explain more on the topic jade’s part of the episode was explaining? I’m not black myself so maybe its more of something in the black community those people can understand and relate with but in confused. Please help 😔",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ng86ge/family_reunion/"
    },
    {
        "id": "1ng708n",
        "author": "NftxCrypto",
        "title": "Thoughts on Incantation",
        "content": "I found it to be a great Movie.I was hooked to the screen from the first minute.The visuals,lore,and acting were all great.I am more intrigued by these kind of traditional lores which are creepy rather than some cheap jumscares.But somehow i feel it heavily under appreciated.Let me know your thoughts on these and some recommendations too.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ng708n/thoughts_on_incantation/"
    },
    {
        "id": "1ng6ziq",
        "author": "Odd_Pair3538",
        "title": "USB c to Hdmi?",
        "content": "Hi, \\*finally yay\\* i have found right moment and space to watch something longer and decided to cast my screen to projector by maxhub share. Unsuprisingly instead of video i see dark screen.\n\nFor whatever reason netflix app cannot be instated on projector easily, and using browser on it to watch something is dounting.\n\nIs it worth risking buying usb c to hdmi adapter? What may i need to change in settings to ensure that video gets through?\n\nTo be honest, I'm a bit tied. So much fuss is neccesery to watch anything. Maybe I will just drop subscribtion at this point.\n\nNo idea where from i will get things i intent to see from in decent quality yet, especially having prefference for legal sources.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ng6ziq/usb_c_to_hdmi/"
    },
    {
        "id": "1ng6qfh",
        "author": "CWill4",
        "title": "Can I watch the Crawford vs Alvarez fight the next day?",
        "content": "The fight is Saturday night but im not available to watch it. Will I be able to go to it tomorrow and watch it? Im not sure how live events work and I can't find an answer.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ng6qfh/can_i_watch_the_crawford_vs_alvarez_fight_the/"
    },
    {
        "id": "1ng5uis",
        "author": "Comfortable-Name3569",
        "title": "Beauty and the Bester Docu",
        "content": "I just started the documentary and am now desperately looking for the song in the intro. Shazam didn’t find anything so I’m needing your help! \nDoes anyone recognize it? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ng5uis/beauty_and_the_bester_docu/"
    },
    {
        "id": "1ng54w9",
        "author": "Sufficient_Ad_7641",
        "title": "Constant low quality",
        "content": "I’ve got the premium membership of Netflix and no matter what I only get 720p resolution despite watching on a 4k screen. My internet connection is perfectly fine and I’m watching through the Netflix app on Microsoft store, does anyone else have this issue or know how to resolve it ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ng54w9/constant_low_quality/"
    },
    {
        "id": "1nf7w0j",
        "author": "ProofMechanic",
        "title": "With Netflix dropping a new Ed Gein series, fans are once again asking for Mindhunter to return",
        "content": "Ever since *Dahmer* became a massive hit, there’s been constant talk about whether Netflix might bring back *Mindhunter*. Now, with the upcoming Ed Gein series (October 3) from the same producer, a lot of people in the comments are repeating the same thing: *“Bring back Mindhunter.”* Is there still a change to make a comeback? ",
        "upvotes": 118,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1nf7w0j/with_netflix_dropping_a_new_ed_gein_series_fans/"
    },
    {
        "id": "1ng41y4",
        "author": "Better_Garbage",
        "title": "Wrong language? Help!!!",
        "content": "For some reason my netflix is in a completely different language. So i thought maybe my toddlers pushed a button? \nNo. Ive checked all the profiles and they are all set to English. Display is Set to English, even subtitles. \nI dont know what to do. Its like this on all devices",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ng41y4/wrong_language_help/"
    },
    {
        "id": "1nfdr0v",
        "author": "curdledwang",
        "title": "The Wrong Paris!!",
        "content": "Hey everyone!! I just stumbled across a hilarious new rom-com called The Wrong Paris! It stars Miranda Cosgrove (loved School of Rock)\n\nIt’s so cute, funny, amazing ensemble cast. Perfect for people who just need something to unwind and have a ton of laughs. Would recommend! ",
        "upvotes": 45,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1nfdr0v/the_wrong_paris/"
    },
    {
        "id": "1ng19uc",
        "author": "SiSRT",
        "title": "Screen goes black with audio from time to time while watching Netflix in fullscreen mode. Happens with Firefox and Edge Browser. Happens probably 3 times per hour",
        "content": "I don't know what changed! But I have since a few weeks the issue, that the whole TV goes black while watching Netflix in full screen mode. The audio just continues. This happens with Firefox and Edge. Probably 3 times per hour. Annoying!\n\nTo resolve the problem I have either to disconnect the HDMI cable or to turn off the monitor and on again.\n\nIt does not occur while watching Netflix in window mode. this works in either browser, but obviously, it's not the same experience with all the menu bars ...\n\n* I have tested the HDMI cable on another monitor, it does not happen.\n* If i watch Youtube, Vimeo, streaming TV, Disney+ or even a video with VLC media player in full screen mode, I do not have this issue.\n\nThe issue \"goes suddenly black with only audio\" only happens with Netflix in full screen mode.\n\n* I have turned on and off hardware acceleration - did not help\n* I have disabled all AddOns - did not help\n* I've reinstalled the video AND audio driver - did not help.\n* I have ensured all Windows Updates are installed - did not help.\n\nWhat could be the issue?\n\nthank you.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ng19uc/screen_goes_black_with_audio_from_time_to_time/"
    },
    {
        "id": "1nfampr",
        "author": "LackAccomplished6057",
        "title": "Any movie recommendations to switch the brain off after a long day at work?",
        "content": "Hi everyone,  \nAfter long hours at the office, I usually come home mentally drained and don’t feel like watching anything too heavy or serious. I’m looking for some *switch-your-brain-off* kind of movies — something fun, light, maybe even silly, that doesn’t require a lot of thinking but is still entertaining.\n\nGenres I usually enjoy:\n\n* Comedies (feel-good or goofy)\n* Action movies with simple plots\n* Lighthearted rom-coms\n* Animated/family movies that adults can enjoy too\n\nBasically, something I can put on to relax, laugh, and forget about work stress for a while.\n\nWhat are your go-to *comfort movies* after a long day?",
        "upvotes": 57,
        "comments": 98,
        "media": null,
        "permalink": "/r/netflix/comments/1nfampr/any_movie_recommendations_to_switch_the_brain_off/"
    },
    {
        "id": "1ng6h40",
        "author": "lookfurther2020",
        "title": "Love Con Script (aka Revenge)",
        "content": "Seems like that Norwegian Chick got lots upon lost of rap and support, so she along with that fat ass friend (detective) got to script a revenge mediocre plot to earn some money... I am really surprised someone has ever bought into producing that shit...\n\nWant a proof? \"Show me one single copy of an arrest warrant or a Court Order\"... NONE\n\nHere are some notes for the idiot that wrote the script:\n\n\\- When police arrest someone they read him/her their Miranda Rights\n\n\\- They never sit them in the front of the car\n\n\\- They use cuffs, not chains\n\n\\- Any processing across the state line has to be done through the FBI or US Marshals\n\nMen get scammed too, so let's get over the Tinder Swindler which got all those Gold Diggers exposed, it is a well known fact :)",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ng6h40/love_con_script_aka_revenge/"
    },
    {
        "id": "1nfzylq",
        "author": "EntertainmentOk2661",
        "title": "Stranger things season 4 only in 4k",
        "content": "Why season 1-3 of stranger things not in 4k only season 4 im running Netflix on an Apple TV 4K with a lg g5 oled .Maybe it’s just my tv I don’t know answers will help.\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nfzylq/stranger_things_season_4_only_in_4k/"
    }
]