[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 6,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 127,
        "comments": 401,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mv1iic",
        "author": "Otherwise-Jump-4571",
        "title": "Had this gem of an interaction with a Netflix rep. I called for support and he ended up cancelling my account.",
        "content": "Some of the messages were cut out for privacy. If parts of the conversation doesn't make sense to you, it's not because of the cut out messages.\n\n\n\nHe did a really poor job explaining that whole new member thing (still don't understand it). He promised to resolve the issue but cancelled my account instead.\n\n  \nI asked for a transcript of the chat, and he said it will pop up if I closed the chat. Good thing I took screenshots. ",
        "upvotes": 130,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1mv1iic/had_this_gem_of_an_interaction_with_a_netflix_rep/"
    },
    {
        "id": "1muo4m8",
        "author": "Sweaty-Toe-6211",
        "title": "‘Dept. Q’ Renewed for Second Season at Netflix",
        "content": "",
        "upvotes": 584,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1muo4m8/dept_q_renewed_for_second_season_at_netflix/"
    },
    {
        "id": "1muzrde",
        "author": "Conscious-Quarter423",
        "title": "‘Wednesday’ Season 2 Gains 29.1 Million Views in Second Week on Netflix. That’s a 42% decrease from the week before.",
        "content": "",
        "upvotes": 116,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1muzrde/wednesday_season_2_gains_291_million_views_in/"
    },
    {
        "id": "1mupni5",
        "author": "veditafri",
        "title": "What's the Netflix show suprised you after starting it just for background noise?",
        "content": "What Netflix show suprised you the most? You started it with  low expectations, just to have something on - but  ended up binge-watching the whole thing instead?",
        "upvotes": 95,
        "comments": 168,
        "media": null,
        "permalink": "/r/netflix/comments/1mupni5/whats_the_netflix_show_suprised_you_after/"
    },
    {
        "id": "1mupavk",
        "author": "ex1stence",
        "title": "“Fit For TV” was a complete waste of time",
        "content": "How tf do \"documentaries\" like this even get made? Literally everything they mentioned in all three episodes was a complete nothingburger, and it was honestly sad to see how deep the producers were trying to dig to find anything even remotely interesting to put in the doc.\n\nDanny gaining the weight back after the show? Wow yeah, turns out people who have a bad relationship with food before the show didn't magically rewire their entire brains after leaving TBL. Not sure how that's NBC's fault or even a controversial thing, but man did they soak up about 20 minutes just repeating the same thing over and over again.\n\nBob said a mean thing to Joelle one time (which did inevitably get her to finish the 30-second treadmill run)? DUN DUN DUNNNN. Dramatic music and another 15 minutes over the fact that yes, every trainer yells at you when you try to give up during a workout because that's literally the job you are paying them to do.\n\nJillian gave....you guys it's so bad, it's terrible, I'm trembling and shaking even as I type this....CAFFEINE to contestants??? Holy shit ya'll, NBC is basically the devil incarnate let's spend another 20 minutes talking about it.\n\nThe whole thing was mining for any controversy it could possibly find and there just wasn't a damn thing to say. I'm a millennial and as someone who struggled with my weight at the time the show first aired, it was actually really inspiring to see how much diet and exercise was paying off for people who were way bigger than I was. While I may not be able to draw a direct line between TBL and my eventual love of exercise, I know that watching these people get on the treadmill and work their asses off (literally) gave me a model that I continue to follow to this day when it comes to my diet and how I take care of my body.\n\nThis wasn't a documentary about scandal or NBC doing anything wrong, it was just a drag on the most inconsequential events that when you pull back and look at what they actually said, sure as shit wasn't worth 120 minutes of my time.",
        "upvotes": 38,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1mupavk/fit_for_tv_was_a_complete_waste_of_time/"
    },
    {
        "id": "1mv0yds",
        "author": "bobbaganush",
        "title": "Two-and-a-half years between first and second season…",
        "content": "I just looked to see when 3 Body Problem’s new season would be out. The first was dropped March of ‘24. Looks like the second will be sometime between October and December of ‘26. This seems to be a trend with a lot of their series nowadays. It’s ridiculous. Does anyone here have an idea as to why they do this?",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1mv0yds/twoandahalf_years_between_first_and_second_season/"
    },
    {
        "id": "1muwuwf",
        "author": "ToonAdventure",
        "title": "Netflix Top 10 Report: Fixed and Night Always Comes Struggle, While KPop Demon Hunters Poised to Surpass Red Notice Next Week",
        "content": "",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1muwuwf/netflix_top_10_report_fixed_and_night_always/"
    },
    {
        "id": "1mv0zqe",
        "author": "LeeleeLola",
        "title": "Animal Kingdom",
        "content": "Just discovered this show about 3 weeks ago and I've been binge-watching it nonstop!! I'm now at the end of S5. Such a great show! Every character is so well-acted. I ended up really hating Smurf and wasn't sad at all at her exit!I also thought the Nicky character was completely unnecessary, but I guess they needed her to get to the father's storyline. I just love Pope. He was so cringey in the beginning and now I just want to give him a big hug. Shawn Hatosy is an incredible actor! Thoughts? Like the show?Who is your favorite character?",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mv0zqe/animal_kingdom/"
    },
    {
        "id": "1muhlo8",
        "author": "CouchPilot3000",
        "title": "How likely is Dexter to get caught with today’s tech?",
        "content": "I was watching a.k.a binging Dexter and couldn’t help thinking how impossible it would be for him to pull that off today. Back in the early 2000s he’s wiping blood with bleach, keeping trophies, and somehow dodging every camera in Miami.\n\nFast forward to now and it feels like the walls would close in almost instantly. Between license plate scanners, smart cameras on every block, DNA databases growing by the day, and even random smart devices recording in the background, I don’t know how someone could live that double life. Even his “burner phones” would leave a trail with tower pings and data brokers selling location info. ",
        "upvotes": 39,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1muhlo8/how_likely_is_dexter_to_get_caught_with_todays/"
    },
    {
        "id": "1muy67l",
        "author": "Narrow_Sail_6448",
        "title": "Need a recommendation for what show to watch on my plane",
        "content": "Have a 14hr flight coming up which I’m absolutely dreading. I’m looking to start a show to pass time. A show that isn’t slow to start but gets your interest within the first 2 to 3 episodes. Just need 1 recommendation of something that is currently on Netflix so I can download season 1. The shows I’ve watched in the past and really enjoyed (no order): breaking bad, better call Saul, ozark, prison break, suits, money heist. Thank you in advance ",
        "upvotes": 6,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1muy67l/need_a_recommendation_for_what_show_to_watch_on/"
    },
    {
        "id": "1mv95ba",
        "author": "gluhmy",
        "title": "Question about Households when using Mesh WiFi System -",
        "content": "Is there a way to stop Netflix from asking for a code when an actual person in my actual household is trying to log in?\n\n  \n\n\nBasically, there's 2-3 devices using Netflix, all connected to a different mesh thingy/access point, but all is connected to ONE Router. (We have dead spots so we set up a mesh system)  \n  \n\n\n* 1st device is the TV downstairs that connects to the router \n* 2nd device is my fiancé's PC, connected to 1 node via LAN that's connected to the router downstairs\n* 3rd device is my PC, connect to another node via LAN that's ALSO connected to the router downstairs\n\n\n\nSince I am the primary account holder, I am the one receiving the codes via email. And I have to confirm EVERY TIME someone wants to watch on the TV, or when my fiancé wants to watch on his PC.\n\n\n\nSometimes, I watch on my tablet, which is connected to the access point from the node connected to my PC. And that doesn't ask for a code, maybe because it's in the same network as my PC. BUT TECHNICALLY, everything is in the same network, just in different nodes. \n\n\n\n  \nIt's getting annoying...how are they unable to recognize 1 mesh system as the same household? How can I prevent this?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mv95ba/question_about_households_when_using_mesh_wifi/"
    },
    {
        "id": "1mv925u",
        "author": "Fun_Molasses5215",
        "title": "This is all false’: Jillian Michaels explodes over Biggest Loser doc, threatens to sue Netflix",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mv925u/this_is_all_false_jillian_michaels_explodes_over/"
    },
    {
        "id": "1mux02n",
        "author": "YouOdd9569",
        "title": "Recommend series with good background soundtracks/music",
        "content": "I really enjoy series especially with killer soundtracks and songs that create more emotion in the show. What netflix shows has this? For reference, im into adventure/drama and sometimes comedy.",
        "upvotes": 5,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1mux02n/recommend_series_with_good_background/"
    },
    {
        "id": "1mv1pnt",
        "author": "wiffle_ball_",
        "title": "Show recommendation!",
        "content": "We just started watching The Lazarus Project today &amp; binged to episode 5. Oh my goodness, it is SO GOOD! \n\nIf you like thriller shows involving time travel, with emotional storylines &amp; excellent character development, this is for you.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mv1pnt/show_recommendation/"
    },
    {
        "id": "1mv0zjn",
        "author": "QualityOdd6492",
        "title": "The Diplomat",
        "content": "I finished the whole 2 seasons....now what? Is there anything that is nearly as good?  I don't do horror, or gore, please. And I can't stand futuristic or animation. But The Diplomat really held my attention, and it has surprises! Help me please find a series I can look forward to turning on for 1, 2, or 3 episodes at a time.",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1mv0zjn/the_diplomat/"
    },
    {
        "id": "1mtlxtl",
        "author": "SplitNational2929",
        "title": "KPop Demon Hunters Is About to Become Netflix’s Biggest Movie of All Time",
        "content": "",
        "upvotes": 1946,
        "comments": 197,
        "media": null,
        "permalink": "/r/netflix/comments/1mtlxtl/kpop_demon_hunters_is_about_to_become_netflixs/"
    },
    {
        "id": "1mtzjia",
        "author": "Intro-Nimbus",
        "title": "What happened to Wednesday?",
        "content": "It's so.. off.  \nIt's completely lost the vibe of the old series and the movie. Gomez is the worst cast I've seen in a long time, Morticia is completely at odds with her mother and daughter.  \nThey're a school of misfits, yet everyone seem to react just like normies to things like eyeballs and murder - Fester thankfully being his old self is the exception.  \nWe have completely ridiculous subplots with competitions vs scouts acting like a parody of marines, that seem to be written for an audience of 4-year olds. There are numerous silly subplots that go literally nowhere.\n\nI fell like I'm watching random scenes from kids movies about summer camp and school, except the dialogue was better in the shows that focused on 7-year olds.\n\nThe dialogue is terrible, it's convoluted and everyone talks like a try-hard emo.\n\nNot to mention the constant exposition, is the target audience persons suffering from loss of short-term memory?\n\nIt is atrocious, I want to like it but it is a burning file of poo.",
        "upvotes": 360,
        "comments": 115,
        "media": null,
        "permalink": "/r/netflix/comments/1mtzjia/what_happened_to_wednesday/"
    },
    {
        "id": "1mutrnc",
        "author": "Informal_Mouse_4305",
        "title": "My List vs \"Another Season Is Coming\"",
        "content": "Sometimes it is clearly officially announced that another season is coming. Sometimes there are rumours and the series isn't officially completed or cancelled.   \n  \nFor the shows where you've watched all episodes, do you keep them in your list or do you remove them? I really want to be notified by Netflix when a new season is released so I currently keep all of them.  But that clutters my list considerably over the years... I have so many shows there that I want to ignore until the new season is available.   \n  \nI wish there was a way to move them from \"My List\" to a \"Remind Me List\" or at least push them to the very bottom of the list...  What's your approach/tips on this?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mutrnc/my_list_vs_another_season_is_coming/"
    },
    {
        "id": "1mufuie",
        "author": "According_Test4787",
        "title": "The Diplomat season 3 on the 16th of October",
        "content": "AND IM SOO EXCITED. i loved the show, the suspense, the drama, the politics involved. its a great show definitely one of the best netflix has ever produced tbh. \n\n(i used the official trailer flair cause there isnt one for teasers… and using a flair is required)",
        "upvotes": 15,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mufuie/the_diplomat_season_3_on_the_16th_of_october/"
    },
    {
        "id": "1muz22h",
        "author": "geologist98",
        "title": "My Oxford Year (thoughts)",
        "content": "Just finished it. Knew it was going to be super cringe. The plot is so superficial, the cancer thing... Like wtf? The characters so cringe. The representation of studying in the UK (I've studied) so romanticised. I mean I have ONE question at this point; HOW do these kind of 'creative ideas' go through the board of producers. Just how? There are so many freaking talented people out there whose ideas get shoveled down the ground. Been there myself having people telling me that the ideas I pitched them 'don't make sense or aren't logical' :'( how is this movie holding any logic at this point 😭",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1muz22h/my_oxford_year_thoughts/"
    },
    {
        "id": "1muydgk",
        "author": "YouOdd9569",
        "title": "Recommend me a show based on my watch history!",
        "content": "These are some of the netflix shows I watched: Bojack, Power, Top boy, ackley bridge, stranger things, rick and morty, baki hanma, saiki k, attack on titan\n\nAside from netflix I really enjoyed animes such as kurkokos basketball",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1muydgk/recommend_me_a_show_based_on_my_watch_history/"
    },
    {
        "id": "1muv9u7",
        "author": "LouisTully9000",
        "title": "America’s Team: A Gambler and His Cowboys Interview with Directors Chapman and Maclain Way",
        "content": "If you’ve spent any time in Texas, you know two things: the brisket is smoked low and slow, and the Dallas Cowboys are God’s chosen franchise, at least according to the Cowboys. For everyone else, there’s a new Netflix docuseries, ***America’s Team: A Gambler and His Cowboys*****,** which offers a front-row seat to the team’s Shakespearean saga of oil money, egos, and end zones.\n\nThe series charts the Cowboys’ meteoric rise and inevitable implosion under the ever-magnificent, occasionally Machiavellian, Jerry Jones, the Arkansas oilman who bought the team, fired living legend Tom Landry, endured a 1-15 season that would make a lesser man retreat into witness protection, and then, somehow, assembled a dynasty that won three Super Bowls in four years. This is not just football history. It’s American legend with shoulder pads.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1muv9u7/americas_team_a_gambler_and_his_cowboys_interview/"
    },
    {
        "id": "1muv24p",
        "author": "Zsombor1661",
        "title": "How does Netflix games work?",
        "content": "Can I play all the games on mobile?\nAnd, how does it work on tv, how do I play them? Can I even play the games on a tv or just on my mobile?\nSorry if it is a stupid question, but I didn't even know there are games untill now.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1muv24p/how_does_netflix_games_work/"
    },
    {
        "id": "1munypv",
        "author": "ToonAdventure",
        "title": "Wolf King | Season 2 Trailer | Netflix",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1munypv/wolf_king_season_2_trailer_netflix/"
    },
    {
        "id": "1muscvv",
        "author": "mr_toilet___paper",
        "title": "Series suggestion",
        "content": "I have just finished squid games recently and need your suggestions guys.I am mostly looking for a series that have strong characters with promising screenplay and content.The genres I prefer the most was thrillers, historical.I have already finished series like Game of thrones,The last Kingdom, Vikings ,Money heist, peaky blinders ,Reacher ,Dark, haunting of the hill house...these all i remember now.So guys suggest me some best Netflix series which i should go for next ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1muscvv/series_suggestion/"
    },
    {
        "id": "1mtkdcg",
        "author": "BoredPandaOfficial",
        "title": "New Netflix doc claims \"The Biggest Loser\" did more harm than good as former contestants reveal PTSD",
        "content": "",
        "upvotes": 279,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1mtkdcg/new_netflix_doc_claims_the_biggest_loser_did_more/"
    },
    {
        "id": "1mu4eu1",
        "author": "m3n00bz",
        "title": "Netflix letting kids upgrade plans.",
        "content": "I kept getting upgraded from free ad supported from my T-Mobile plan to the $25 4k premium and couldn't figure out how this was happening. Well, my young child showed me that it allows him to do this when he tries to watch certain movies on his roku tv under his kid restricted account. \n\n\n It's insane that they don't require a password to upgrade the plan.  I guess I can see why this is good for Netflix but they shouldn't be allowing this without a password.  \n\nI've had a talk with my son but I'm sure he won't think twice to upgrade us again.\n\n\nEdit:\n\nThis is the screen on his TV for those asking:\nhttps://imgur.com/a/P1XOmcF",
        "upvotes": 18,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1mu4eu1/netflix_letting_kids_upgrade_plans/"
    },
    {
        "id": "1mun5tr",
        "author": "BrotherofGenji",
        "title": "Anybody else or just me?",
        "content": "So the other day I got Netflix back and everything was fine and dandy, but I tried putting Subtitles on (I dont watch without them, havent for over 15 years, and not just on Netflix - I do CC on live TV too and subtitles on on other streaming services as well). \n\nAnyway I selected the subtitle setting I wanted and now the Audio/Subtitles small menu keeps flashing. I dont have my cursor over it at all. It just shows up every so often and is annoying.\n\nAnd then it gave me a 404 error yesterday temporarily for some reason but I'm sure its unrelated. \n\nAlso it's not just one show or movie, its all of them. Anything I can do? I've already tried logging out and back in. I dont wanna deal with this lol i dont need the small menu opening every 5 seconds.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mun5tr/anybody_else_or_just_me/"
    },
    {
        "id": "1mtpdb6",
        "author": "Inevitable_Map4791",
        "title": "Just rewatched Enemy of the State last night,  scary how much of that feels possible now",
        "content": "Back when I first saw Enemy of the State , it felt like over-the-top Hollywood paranoia, all satellites following you in real time, phone taps in seconds, every move tracked which is very typical of the entertainment industry. Watching it again last night it feels way less like science fiction and way more like a Tuesday.  \n  \nThe wild part is we don’t even need spy satellites anymore. We hand over our locations to apps 24/7, leave microphones in our homes, and carry around devices that log everywhere we’ve been. Add in data brokers, security cameras on every corner, and facial recognition in half the apps we use, and you’ve basically got the same surveillance net the movie warned about. Made me super anxious last night about my own data, I don't get spam calls much but I get lots of promotional offers in my mail from places I haven't even heard of. Data gets sold online all the time and it's probably in the subscription agreement if anyone ever read it but is there a way to take these off for sure? It's the internet and nothing truly gets deleted but at least make it less visible. Would appreciate anyone knowing more than I do to tell me how I could try and track and maybe delete my data online.",
        "upvotes": 72,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1mtpdb6/just_rewatched_enemy_of_the_state_last_night/"
    },
    {
        "id": "1mucjpv",
        "author": "Bubbe103",
        "title": "Movie/series reccomendations? (Teen, dramas, k-dramas, psychology, mystery, kinda horror?)",
        "content": "Okay so i have a lot of different tastes, i can list some of the movies and shows that seem to be simlar in genre (according to me):\n\n⭐Girl Interrupted, ⭐The Virgin Suicides, End of the F***ing World, I Am Not Okay With This, Adolescence, First Kill\n\n⭐One of Us Is Lying, A Good Girl’s Guide to Murder, ⭐The Society\n\n⭐Squid Game, ⭐All of Us Are Dead, #Alive\n\n⭐Show Me Love / Fucking Åmål, XO, Kitty, ⭐Mean Girls, ⭐Clueless\n\n⭐Gilmore Girls, Ginny and Georgia, Bonusfamiljen\n\n⭐Extraordinary Attorney Woo\n\nThe Queen’s Gambit\n\n\n⭐ = rewatced like 456 times 🔥\nThank youu, multiple suggestions are appreciated!! ",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1mucjpv/movieseries_reccomendations_teen_dramas_kdramas/"
    }
]