[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1majx8l",
        "author": "K1mbacat",
        "title": "Netflix cancelling shows after one season is making me want to cancel my subscription",
        "content": "Is anyone else frustrated about this? I’ll watch a new show (released within the past few months), finish the season and get invested, only to find out they’ve cancelled it a month later. I’ve found articles saying it’s due to “low viewership”, but they didn’t even recommend the shows to me, no advertising, etc, and then cancel it shortly after, before most people have even heard of the series. I’m starting to consider cancelling my subscription because of this.",
        "upvotes": 190,
        "comments": 81,
        "media": null,
        "permalink": "/r/netflix/comments/1majx8l/netflix_cancelling_shows_after_one_season_is/"
    },
    {
        "id": "1mal9qz",
        "author": "Spirited-Region-2611",
        "title": "Did anyone else think Trainwreck: Astroworld, took forever to get to the point?",
        "content": "I found myself zoning out because, I’m aware it was telling a lot of peoples stories, but the documentary just wasn’t as captivating as the other ones. ",
        "upvotes": 15,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1mal9qz/did_anyone_else_think_trainwreck_astroworld_took/"
    },
    {
        "id": "1ma3fls",
        "author": "StreetFriendship1200",
        "title": "Binge-worthy limited series?",
        "content": "It’s Saturday afternoon. Hubby and I were planning to host some friends for cocktails and a lovely dinner, but they just called to cancel the last minute because they are sick and don’t wanna make us ill. So we have the night to ourselves, for date night. And some amazing cocktails, appetizers and a grilled porkchop dinner ahead of us. Don’t feel like inviting anyone else, so I’m currently searching for a good Netflix movie or limited series to watch tonight. Something good, like a thriller or action pack. Any suggestions welcome! I’m running out of patience scrolling aimlessly on damn Netflix and reading reviews 🙄",
        "upvotes": 189,
        "comments": 367,
        "media": null,
        "permalink": "/r/netflix/comments/1ma3fls/bingeworthy_limited_series/"
    },
    {
        "id": "1ma7qv2",
        "author": "kathyknitsalot",
        "title": "Untamed",
        "content": "Just finished watching this and I feel like something was off. I usually like Eric Bana and Sam Neill, and the story was interesting but I don’t know if it was the writing or acting.  It was hard to get into the characters.  Any of them. Anyone else have an opinion? ",
        "upvotes": 82,
        "comments": 119,
        "media": null,
        "permalink": "/r/netflix/comments/1ma7qv2/untamed/"
    },
    {
        "id": "1maqaq9",
        "author": "Electronic_Driver_78",
        "title": "Sandman Season 2: A Story Without Evil, Yet Full of Consequence",
        "content": "Just finished the last season of The Sandman, and something struck me that I can't stop thinking about: there’s no clear villain. Actually, there’s no real villain at all.\n\nSure, we have Lord Azazel arguably the closest candidate. But can you really call a demon a \"villain\" when evil is literally his nature? He’s doing what demons do. There's no moral twist, no manipulation, just raw, elemental ambition. Even Lucifer, who I fully expected to be the looming big bad this season, didn’t take that role. And honestly, I was a little disappointed she didn’t even show up at Morpheus’ funeral. I kept waiting for her to appear, one last move, one final word but no. Her absence almost said more than her presence could have.\n\nThe beauty of this season, I think, is how conflict arises from duty, grief, pride, and change rather than a singular evil force. Morpheus isn't fighting villains; he's navigating consequences. Everyone's following their nature, their role in the grand cosmic dance, even when it clashes with others. And that makes it all feel more... mythic? More tragic? Definitely more human.\n\nCurious if anyone else felt the same. Did you miss having a \"main antagonist\"? Or did the lack of one make the story hit harder?\n",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1maqaq9/sandman_season_2_a_story_without_evil_yet_full_of/"
    },
    {
        "id": "1manhms",
        "author": "Additional_Key_8044",
        "title": "Aap Jaisa Koi Review: Romance Done Right",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1manhms/aap_jaisa_koi_review_romance_done_right/"
    },
    {
        "id": "1mahwxl",
        "author": "Old_Customer_1894",
        "title": "Was it worth it, In-ho?",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/j4luf9fowdff1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1mahwxl/was_it_worth_it_inho/"
    },
    {
        "id": "1mamjk5",
        "author": "Additional_Key_8044",
        "title": "Sarzameen Review: New Age Shakti",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mamjk5/sarzameen_review_new_age_shakti/"
    },
    {
        "id": "1mai1ir",
        "author": "atheniah",
        "title": "\"Not part of household\" but I'm the account owner",
        "content": "Wondering if anyone knows how I can fix this issue. Twice now Netflix has given me the \"your device is not part of the household\" thing, but I am the account holder. Its my account, with my email and login, which I am paying for. \n\nI've tried to figure out how to update the household so that it recognises me but I don't have a TV, only a laptop, and it says you don't have to do it for a laptop and there doesn't seem to be a way to do it. \n\nDoes anyone know a way to stop it doing this? If it happens again I'm probably just going to cancel my Netflix. ",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mai1ir/not_part_of_household_but_im_the_account_owner/"
    },
    {
        "id": "1manori",
        "author": "fabdab501",
        "title": "Low quality on Netflix when using a playback speed extension",
        "content": "For some reason I get low quality on Netflix when using a playback speed extension. The extension is called \"Global Speed\". Anyone know a fix to the problem?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1manori/low_quality_on_netflix_when_using_a_playback/"
    },
    {
        "id": "1manh36",
        "author": "Additional_Key_8044",
        "title": "Vir Das: Fool Volume Review: Funny And Profound",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1manh36/vir_das_fool_volume_review_funny_and_profound/"
    },
    {
        "id": "1mamroj",
        "author": "Additional_Key_8044",
        "title": "Mandala Murders Review: BALONEY!",
        "content": "",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mamroj/mandala_murders_review_baloney/"
    },
    {
        "id": "1malfak",
        "author": "andropogon09",
        "title": "Does Hightown deserve a 4th season?",
        "content": "Hightown is another one of those shows (like Loudermilk or Resident Alien) first discovered by viewers when it appeared on Netflix. Should Netflix create a 4th season, or do you think most of the major issues were resolved in the series finale?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1malfak/does_hightown_deserve_a_4th_season/"
    },
    {
        "id": "1majr6q",
        "author": "judoxing",
        "title": "Adolescents: red-pill culture and postmodernism",
        "content": "A key part of the series is Jamie’s stubborn pleas of innocence despite his murder of Katie being clearly captured on camera. \n\nHe’s so adamant that most people spend much of the series assuming there must be more to the murder than just Jamie doing it (there isn’t, as is clear is episode 1).\n\nA take I haven’t seen anywhere else is that Jamie’s pleas of innocence are another impact of his online incel/red pill exposure: fundamental to redpill, alt-right culture is a type of postmodernism. All mainstream narratives are false, institutions can’t be trusted and aim only to mislead and control the public, presumably a shadowy global organisation controls everything. This is epistemological framework is central to Andrew Tate’s shtick and all reactionary public intellectuals (like Bret and Eric Weinstein) who repeatedly refer to “they”.\n\nJamie is brain deep into this stuff and subsequently is effectively delusional when he comes crashing into reality after committing murder. When he’s saying he didn’t kill Katie, it’s not so much that he’s lying as that he genuinely doesn’t understand the typical concept of truth in which he’s being judged upon.\n\nThis theme is spelt out more clearly in the final episode when the youth who sells Eddie the paint confides that he’s a part of an online community who believes Jamie to have been framed by some conspiracy of “them” - he says something like “they didn’t even make the stab wound anatomically correct”\n\nThe final brilliance of the show is it manages to elicit this type of conspiratorial attitude from some section of the audience who feel it remains open by the end whether Jamie was the killer.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1majr6q/adolescents_redpill_culture_and_postmodernism/"
    },
    {
        "id": "1majjlh",
        "author": "Ok-Echidna9086",
        "title": "Netflix bugging my monitors only when I’m playing a game",
        "content": "Been playing like this for months and I didn’t update anything or change any cables but this started happening right when I have a game open and Netflix at the same time. Does anyone have a fix for this?",
        "upvotes": 0,
        "comments": 3,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zcmk8ekxeeff1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1majjlh/netflix_bugging_my_monitors_only_when_im_playing/"
    },
    {
        "id": "1ma9zsb",
        "author": "Lilcommy",
        "title": "The new UI on the PS app is trash.",
        "content": "I personally fine this new UI completely trash. I can't find anything to watch. And I just log off and go to something else. Its cluttered and the auto playing of trailers is just a pain that takes up way to much of the screen. I don't understand always changing UIs that arnt broken or unusable. ",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1ma9zsb/the_new_ui_on_the_ps_app_is_trash/"
    },
    {
        "id": "1ma3kaw",
        "author": "ViralGeneration21",
        "title": "Dept Q - random unanswered question?",
        "content": "I’ve just finished watching Dept Q. \n\nOne question I have is - why was Aisla Jennings (lyles mum) wearing a wig?\n\nShe seemed like she was in disguise as an older character and I was waiting for another bombshell to reveal she was someone pretending to be the mum or something!? \n\nOr I thought maybe she was just hiding her identity from Merrit but she had it on the whole time (when merrit was locked away) Including when she answered the door to local police man. \n\nAnyone have any reason for this?\n\n\n",
        "upvotes": 10,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1ma3kaw/dept_q_random_unanswered_question/"
    },
    {
        "id": "1majxvn",
        "author": "Janexe_",
        "title": "Netflix accounts replaced with spanish accounts.",
        "content": "Today my dad booted up netflix on the tv and saw that all the accounts are now in spanish(?) and our accounts are no more. they also have like a white lock next to the profile picture. The whole app is in spanish and we dont know how to change it back or how it happened. Does anyone know why? and how do we change it back to English?\n\nhttps://preview.redd.it/zv0hut9bjeff1.png?width=4080&amp;format=png&amp;auto=webp&amp;s=1cfd3ffee4bfca8f8a47ec4c68c209364d19d360\n\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1majxvn/netflix_accounts_replaced_with_spanish_accounts/"
    },
    {
        "id": "1ma7xvh",
        "author": "SubstantialBat3596",
        "title": "The Penguin Lessons",
        "content": "This movie! Has anyone watched this? (I assume many have.) It’s so charming and has all the feels! Anyone who’s watched it - what did you think? \nAnyone who hasn’t - check it out!! \n(Also, apparently I have a new book to add to my list!) ",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ma7xvh/the_penguin_lessons/"
    },
    {
        "id": "1ma6bt5",
        "author": "BarracudaJazzlike730",
        "title": "Thoughts on \" Hit Makers\"?",
        "content": "Just finished the 6 episodes and I feel kinda disappointed. There wasn't really any pay off. Should have ended with the artists actually performing their songs. The other takeaway was that I believe many of the lyrics came from chat GPT. When I typed in similar themes and asked for song lyrics I got very similar results to what they had. Overall, not that great of a show IMO. Any thoughts on this? ",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ma6bt5/thoughts_on_hit_makers/"
    },
    {
        "id": "1ma6snx",
        "author": "cookiebutter-23",
        "title": "Thrillers",
        "content": "Looking for a movie/show that is similar to the books I like to read! Thrillers/whodunit Frieda McFadden, Alex Michaelides, Delia Owens, Lisa Jewell etc….. don’t like super scary or super smutty stuff..help! ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ma6snx/thrillers/"
    },
    {
        "id": "1m9yljz",
        "author": "JohnIsInTrouble",
        "title": "Korean Dramas Any Recommendations?",
        "content": "Hi so just recently I’ve gone on a massive binge on Korean Dramas and have mostly been enjoying myself but I’ve just finished The Frog. I’ve started to notice that Korean shows always start out great then sometimes take a massive nose dive. I’ve watched 8 show, my Name, happiness, Gyeongseong Creatures, #alive, Ballerina, kingdom and all of us are dead. Would love some more recommendations because KDramas are so different to many others I’ve watched. ",
        "upvotes": 10,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1m9yljz/korean_dramas_any_recommendations/"
    },
    {
        "id": "1m9ra5j",
        "author": "LastOnesLeft92",
        "title": "Remove already seen things from your page?",
        "content": "Anyone else that things its crazy Netflix keeps showing already seen things on your page. It feels impossible to find new shows, when it is constantly suggesting things you already saw.",
        "upvotes": 19,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1m9ra5j/remove_already_seen_things_from_your_page/"
    },
    {
        "id": "1m9a67t",
        "author": "IntelligentYinzer",
        "title": "Sex Trafficking Warrant Served at House Connected to Alleged 'TikTok Dance Cult'",
        "content": "",
        "upvotes": 284,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1m9a67t/sex_trafficking_warrant_served_at_house_connected/"
    },
    {
        "id": "1m9kfgo",
        "author": "S-T-R-I-D-E-R",
        "title": "\"Sandman\" was beautiful",
        "content": "Sandman series was really very appealing  and what a wonderful world building it had... So great use of vfx and amazing acting by the actors... Morpheus was goated and so was Death and all of the siblings and the lore was damn fascinating... I really don't know what went wrong with the series cause it's been cancelled by the Netflix but I really loved the series a lot and it's intricate world building and i really believe it should have gotten more seasons out of it.\nEdit: *appealing ",
        "upvotes": 45,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1m9kfgo/sandman_was_beautiful/"
    },
    {
        "id": "1ma8kk4",
        "author": "Wind-Whistle20",
        "title": "Happy Gilmore 2: Maxi league seemed cool",
        "content": "Why couldn’t both leagues exist? The golfers put on a thrilling show there showing its major potential. If I lived in that fictional world, I would want to see more of the Maxi league. Who cares if their golfers are or aren’t as good? They didn’t shut down the UFC because Floyd beat McGregor. I don’t think golf fans would stop watching golf because this league exists.",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1ma8kk4/happy_gilmore_2_maxi_league_seemed_cool/"
    },
    {
        "id": "1ma84ww",
        "author": "Few_Hunter3814",
        "title": "Where are the rest of the SEC teams?",
        "content": "Just saw the trailer for that documentary and I felt a little left out since I didn’t see my team(Mizzou). I wonder if they just chose select teams or if they had to ask to join, or mabye they just aren’t popular enough. Does anybody know?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ma84ww/where_are_the_rest_of_the_sec_teams/"
    },
    {
        "id": "1maifbw",
        "author": "Medical-Beautiful190",
        "title": "Kick back$$$",
        "content": "#Netflix has a keep video playing option which reserves 10-20 gig of bandwidth, the size of uhd movie, in advance, to keep videos playing without cutting out, plus streaming video in 4K at the same time, is EXACTLY why netflix is a bandwidth hog. ISPs need to chill on video streaming bandwidth allowance.\nThey don't care. $$$",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1maifbw/kick_back/"
    },
    {
        "id": "1m99sv5",
        "author": "cerealmilkanddarkrum",
        "title": "Happy Gilmore 2",
        "content": "What was everyone’s thoughts ? I was actually really pleasantly surprised. Lots of good surprises in it. I think it’s the best thing Adam\nSandar has done in awhile. ",
        "upvotes": 124,
        "comments": 204,
        "media": null,
        "permalink": "/r/netflix/comments/1m99sv5/happy_gilmore_2/"
    },
    {
        "id": "1m9olff",
        "author": "FoodNapTV",
        "title": "Hit Play on Hightown !!!",
        "content": "Hightown is finally on Netflix!!!! \n\nThis show is criminally underrated. \n\nI’m begging you, try it. You won’t be disappointed. \n\nMaybeeeee Netflix will pick it up for a 4th season ??? 😍",
        "upvotes": 11,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1m9olff/hit_play_on_hightown/"
    }
]