[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 12,
        "comments": 73,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 60,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1lc4y9j",
        "author": "artifex28",
        "title": "Netflix completely HIDES content if the SUBTITLE language doesn't match your set language.",
        "content": "This seems absolutely absurd that content is *completely hidden* just if your local subtitle language isn't a match.\n\nI've had English on forever (instead of Finnish that I am).\n\nA family member was completely baffled when I mentioned watching certain shows that she wouldn't be able to even find. After changing the profile language to English, she was able to find them. I tested this personally, it indeed works like this.",
        "upvotes": 69,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1lc4y9j/netflix_completely_hides_content_if_the_subtitle/"
    },
    {
        "id": "1lc9rcn",
        "author": "cerulloire",
        "title": "The \"Household\" aspect is insanely greedy.",
        "content": "I have the highest tiered plan, which literally allows 6 devices, shared between my parents on one TV, then myself, then my brother. I live a few cities over and my brother had to move to a different state, and we were able to stream no problem, but recently my brother and I can't watch it because it says we are not part of the household...? What's the point of paying for all these devices if we can't even use them? This isn't an issue on any other streaming service. Not being able to watch on more than 2 screens at one time is one thing that I can understand, I guess, but if you're literally paying for a plan that is laid out well to be shared, it's weird that we cannot actually share it. \n\nI'm also doubtful of \"adding an extra slot\", because while that sounds like it would alleviate the problem (unless it's just...another useless device) I refuse to give more money to Netflix and support the greed. Tbh I was willing to add the extra slot, but putting a tier on that too with ads/no-ads is just too far. \n\n\"Just Unsubscribe\" - I despise Netflix, and no longer use it, but my brother and parents still rely on it for streaming so while this isn't really my problem anymore, we won't be unsubscribing because my family is still enjoying it (regardless of me begging them to transition to another service, which we have already). I only know it does not work on my computer because my bro asked me to check what's up with Netflix rn. This doesn't change the fact that Netflix puts out sub-par cash grab originals (while cancelling/removing actually good content) behind the priciest plans, and it's even more frustrating that so many people are so tethered to Netflix that the company will never have a reason to decrease their prices. ",
        "upvotes": 36,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1lc9rcn/the_household_aspect_is_insanely_greedy/"
    },
    {
        "id": "1lcfv06",
        "author": "OkRip3072",
        "title": "What show that has recently been cancelled that you’d like to see renewed/picked up on Netflix? Networks like FOX, CBS, USA,",
        "content": "There has been a few shows on these networks that have been canceled too soon, and Netflix resurrected them. For example, Lucifer was originally on FOX network cancelled after season 3 due to “declining viewership”, and Netflix picked it up for three additional seasons, so it’s not uncommon. What have you enjoyed watching that you would like Netflix to bring back?",
        "upvotes": 3,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1lcfv06/what_show_that_has_recently_been_cancelled_that/"
    },
    {
        "id": "1lbn9mj",
        "author": "ElevatorNo415",
        "title": "Straw is one of the worst movies I’ve ever seen.",
        "content": "One of the most over the top unrealistic movies I’ve ever seen. Even for a Tyler Perry movie. If you like to constantly yell at the screen “yeah right that would never happen!” Then this movie is for you. Taraji P. Henson is a good actor but the entire supporting cast was so bad it was comical. ",
        "upvotes": 156,
        "comments": 254,
        "media": null,
        "permalink": "/r/netflix/comments/1lbn9mj/straw_is_one_of_the_worst_movies_ive_ever_seen/"
    },
    {
        "id": "1lcba0i",
        "author": "Different-Meat-8562",
        "title": "Haunted",
        "content": "Anyone watched Haunted, there are currently 3 seasons out. Are the stories real? It's pretty cool how they sit around and tell their story to their friends and family. I just wonder if the stories are real or are these actors ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lcba0i/haunted/"
    },
    {
        "id": "1lcfw51",
        "author": "OkRip3072",
        "title": "What show would you like for Netflix to pick up?",
        "content": "There has been a few shows on these networks that have been canceled too soon, and Netflix resurrected them. For example, Lucifer was originally on FOX network cancelled after season 3 due to “declining viewership”, and Netflix picked it up for three additional seasons, so it’s not uncommon. What have you enjoyed watching that you would like Netflix to bring back?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1lcfw51/what_show_would_you_like_for_netflix_to_pick_up/"
    },
    {
        "id": "1lcdqlf",
        "author": "Similar-Date3537",
        "title": "How to stop autoplay on Roku tv?",
        "content": "I am using a Roku smart tv.  Have the latest version of the Netflix app.  I've gone on the Netflix website, gone to the account, and unchecked \"autoplay\" for all users.\n\nBut every single time I look at anything on the Netflix app on my tv, it starts autoplaying.  \n\nHow do I stop this?  What am I missing?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lcdqlf/how_to_stop_autoplay_on_roku_tv/"
    },
    {
        "id": "1lbr5im",
        "author": "Snoo-66268",
        "title": "Justice for Mind Hunter!!!",
        "content": "Mindhunters had so much potential. It started slow, but the characters were just starting to develop. I throughly enjoyed the 70s era it was set, pre-technology. Hate when a good series ends abruptly and we’re left with unanswered questions and an empty void lol. \n\nI only recently heard of this show after so many redditors posted about it. I’m wondering why it was never on my radar when it came out. It must have been overshadowed when it debuted? Hoping there’s some possibility for a season 3, but that’s unfortunately just wishful thinking after some quick google searches :(",
        "upvotes": 25,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1lbr5im/justice_for_mind_hunter/"
    },
    {
        "id": "1lc4sak",
        "author": "Creative-Ad-1363",
        "title": "Bad sport - hoop schemes",
        "content": "I'm blown away by this episode. The perfect storm of broke college players, who play for free, barely fed by the school, combined with predatory gamblers offering them a sliver of profits for point shaving. The players made $20k for fixing games, the bookies made millions. Sad and disappointing on sooooo many levels.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lc4sak/bad_sport_hoop_schemes/"
    },
    {
        "id": "1lbja1p",
        "author": "Own_Spring_3489",
        "title": "Already watched shows",
        "content": "Is there a way to get netflix to stop suggesting shows you've already seen. In the \"your next watch\" section its now pretty much entirely shows ive already seen which has recently meant I am struggling to find new shows to watch because I normally just go by their recommendation. ",
        "upvotes": 69,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1lbja1p/already_watched_shows/"
    },
    {
        "id": "1lc7y6f",
        "author": "Fickle-Ad-4585",
        "title": "Mom’s Top Shows &amp; Movies to Binge + Looking for Your Recommendations!",
        "content": "Hey Netflix lovers! 👋\n\nI’m a busy mom who’s been diving deep into Netflix lately and wanted to share my favorite shows and movies that kept me glued to the screen. If you haven’t seen these, you’re seriously missing out!\n\nTop Netflix Shows:Ozark\n\nMoney Heist (La Casa de Papel) — the best heist show ever!\n\nInventing Anna\n\nThe Queen’s Gambit\n\nThe Night Agent\n\nRebellion\n\nThe Recruit\n\nTo Catch a Killer\n\nCarry On\n\nThe Croods\n\nSpencer Confidential\n\nThe Union\n\nRed Notice\n\n\nTop Netflix Movies:\n\nThe Rite (Anthony Hopkins is amazing!)\n\nDeliverance\n\nEqualizer 1 &amp; 2\n\nAmerican Sniper\n\nDen of Thieves\n\nMonsters\n\nInstant Family\n\n\nBonus for crime drama fans:\n\nYou\n\n\nWould love to hear your favorites too! Drop your recommendations or let me know if you want to hear why I loved any of these. Thanks for reading and happy Netflix bingeing! 🍿📺",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lc7y6f/moms_top_shows_movies_to_binge_looking_for_your/"
    },
    {
        "id": "1lcb7e9",
        "author": "Such_Crow8542",
        "title": "How (Not) To Animate a Video Game",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lcb7e9/how_not_to_animate_a_video_game/"
    },
    {
        "id": "1lcdm9f",
        "author": "Cable_Tugger",
        "title": "Equalizer 3 impossible to watch",
        "content": "I've just settled down to watch Equalizer 3 for some Sunday silliness and there's no way to understand the Italian parts without CC!\nI don't need to know when a [gun clicks], there are [footsteps in the distance] or [a butterfly flaps its wings in Peru]. I just want a translation of everything that isn't in English!\nHow hard can it be?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1lcdm9f/equalizer_3_impossible_to_watch/"
    },
    {
        "id": "1lc4791",
        "author": "Fryolo",
        "title": "Looking for a song",
        "content": "Vatican Girl, episode 2, min 14.40 there is a scene of an old italian singer (Jimmy Fontana) singing in a club. I’m looking for the title of the song. I can’t use shazam because it’s too short, and by listening to the words he sings I can only understand “…e bon voyage a tutti…”. Can someone help me? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lc4791/looking_for_a_song/"
    },
    {
        "id": "1lbnwa5",
        "author": "Rachelgal2",
        "title": "Where Straw fell apart",
        "content": "This movie’s plot became absurd to be when the mom showed up to the daughter’s school and spoke with the principal about getting a phone call.\n\nIf I saw someone 24 hours after their child died, wearing their work clothes, saying I called them when I didn’t, I would be very alarmed and would not let that person leave without contacting a medical office or hospital.  She was clearly not it her right mind and no way a principal would shrug that off.  ",
        "upvotes": 16,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1lbnwa5/where_straw_fell_apart/"
    },
    {
        "id": "1lc2flc",
        "author": "SoleSurvivor893",
        "title": "Documentary High Score Episode 1. Anyone know the instrumental song playing?",
        "content": "In episode one of the documentary high score on Netflix there’s a song playing in the background at the 22:40 mark right when the narrator starts talking about the success of Pac-Man with the audience of American women. It sounds like an upbeat version of some original pac man intro or beat but I’m blanking on whether it was an original song or something made by the folks in the documentary. Does anyone know where I can find an unedited and original version of this instrumental? Thanks!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lc2flc/documentary_high_score_episode_1_anyone_know_the/"
    },
    {
        "id": "1lb51pl",
        "author": "clevertulips",
        "title": "Why is Cobra Kai series considered good… universally bad acting, gratuitous nonsensical fight scenes every 5 seconds… ?!",
        "content": "Genuinely, I’m amazed that people rave about this series.  The cringe factor is off the charts,  most of the time, and the despair to be anything like Karate Kid is truly laughable considering just how bad the writing is. What the heck??",
        "upvotes": 207,
        "comments": 121,
        "media": null,
        "permalink": "/r/netflix/comments/1lb51pl/why_is_cobra_kai_series_considered_good/"
    },
    {
        "id": "1lbwvp8",
        "author": "NavSH27",
        "title": "Help",
        "content": "So, sometimes very unuasual thing happens when i want to watch netflix on my phone. I start the episode/movie and its video freezes but audio goes on and i have to wait to power off and start again and sometimes this lasts for days, this happens with other streaming platforms on my phone aswell. But then there are days when it works perfectly fine. Can anyone help",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lbwvp8/help/"
    },
    {
        "id": "1lbz0kb",
        "author": "ScrollingThrooo",
        "title": "Code: 3-0 This title is not available to watch instantly.....",
        "content": "How do I fix this? I've deleted and reinstalled the app. No issues with any other app. Having this issue on both my AppleTV and iPhone. Works fine on my Macbook Pro. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lbz0kb/code_30_this_title_is_not_available_to_watch/"
    },
    {
        "id": "1lbiena",
        "author": "punisherisback17",
        "title": "If you were the ceo of Netflix, what would you do first!?",
        "content": "What would you do if you were the ceo? What changes would you make or add. Post whatever comes to mind and have fun. Happy weekend everyone and have fun",
        "upvotes": 14,
        "comments": 156,
        "media": null,
        "permalink": "/r/netflix/comments/1lbiena/if_you_were_the_ceo_of_netflix_what_would_you_do/"
    },
    {
        "id": "1lbs9pz",
        "author": "FinalRecognition4514",
        "title": "The Straw plot twist",
        "content": "The movie was good but one thing I don’t understand is the lady at the school. How tf do you see a woman drop off a kid that doesnt exist and then hours later she comes to the school claiming she got a call about her daughter that once again… doesn’t exist. and you mean to tell me no one told her that her daughter died or at least told her  “look here crazy lady you’re daughter isn’t even here” the school hallucination scene was so far off of what actually happened ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lbs9pz/the_straw_plot_twist/"
    },
    {
        "id": "1lb2dwe",
        "author": "Sufficient-Paint-534",
        "title": "PLEASE GIVE ME SEASON 2 OF DEPT Q !",
        "content": "Okay what an amazing amazing show. Loved it. Last episode did feel a little rushed inspite of how dragged out the earlier episodes were ? Like there was so much happening. Few things I need to clarify though-\n\n1) Why did Rose say William saw Lyle on the ferry and got scared ? She meant William saw the man with the cap and not that he identified Lyle considering both lingaard siblings couldn't have remembered how Lyle Jennings looked like now\n2) Lyle acts extremely stupid when he's with his mom. Is this something to do with being abused? Because it is a little difficult to believe he pulled off all those crimes\n3) they never show the motive behind why Lyle targeted Sam. Was that because he ran in similar circles with Merritt or he just wanted to get back at Sam for punching him. Also, did Lyle pretend to be Sam H to know Merritts whereabouts or was he eventually going to know because he was stalking her.",
        "upvotes": 95,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1lb2dwe/please_give_me_season_2_of_dept_q/"
    },
    {
        "id": "1lc738a",
        "author": "GoodReza",
        "title": "Canceling subscription over new layout",
        "content": "I have been Netflix since the early DVD days and been a fan. However I literally can’t find a thing with the new UI and having the thumbnail expand to something else is so disorienting, I just focus on the 3 tiny thumbnails.   I’ve not been able to find a single show to watch since the update. \n\nAnyhow - as much as I want to use their service I physically can’t.   \n\nAnyone else canceling over this?",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1lc738a/canceling_subscription_over_new_layout/"
    },
    {
        "id": "1lbkmah",
        "author": "Wicked-Twisted-Road",
        "title": "Recommendations for what to watch on airplane",
        "content": "Hi, I’m spending a lot of time in airports the next ten days. I need some recommendations.\n\nI really liked The Diplomat, Nobody Wants This, and Four Seasons.\n\nI had a hard time getting into Ginny and Georgia and Sirens.  \n\n",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lbkmah/recommendations_for_what_to_watch_on_airplane/"
    },
    {
        "id": "1lbx8fx",
        "author": "Splat3420",
        "title": "Any good shows like cobra kai?",
        "content": "I just finished cobra kai and I thought it was awesome. I’m now stuck trying to find another show that gave me that same thrill that cobra kai gave me. Although I was never fully interested in the karate aspect of it, it was the mix of everyone’s personal lives clashing and seeing the result unfold when they fight. \nIf someone could rec a good show that was as investing as this one I’d appreciate it.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lbx8fx/any_good_shows_like_cobra_kai/"
    },
    {
        "id": "1lb9lnq",
        "author": "Noggiesformynoggin",
        "title": "Please recommend me a mystery movie/series which has elements of comedy",
        "content": "I love murder mysteries which have a touch of comedy! Though I feel I’ve watched them all? The series I’ve watched are-\n\nMurder Mystery (1&amp;2)\nOnly murder in the building (just as an example Ik it’s not on Netflix lol)\n7 women in a murder\n\nThank you!!",
        "upvotes": 15,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1lb9lnq/please_recommend_me_a_mystery_movieseries_which/"
    },
    {
        "id": "1lbbaiv",
        "author": "Wyldstallyn80",
        "title": "Fubar",
        "content": "Just watched series 2 of Fubar and this might not be a popular opinion but Guy Burnet could be a dark horse for the next James Bond, good looking, right age range and he managed to give his character a certain suaveness. ",
        "upvotes": 8,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1lbbaiv/fubar/"
    },
    {
        "id": "1lbptm8",
        "author": "139nn1_si3",
        "title": "Guy Burnet from Fubar season2",
        "content": "Am I the only one who instantly fall in love with Chips lol. After watching it I started searching up Guy Burnet but seems like he is not very recognized by people and I don’t get that. Like he was so attractive during the dance with Emma and his accent!!! ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lbptm8/guy_burnet_from_fubar_season2/"
    },
    {
        "id": "1lc095x",
        "author": "candy_dynac",
        "title": "The Eternaut is the worst short sci-fi series ever!",
        "content": "I cannot believe everyone worships this show. It's horrendous. There are so many plot inconsistencies. The sheer amount of plot armor the characters have is ridiculous. The female characters are so disposable and irrelevant to the story (especially the wives). The screenplay is absolutely terrible, making the characters deliver the most cringe-worthy dialogue ever (I saw the show in Spanish, I'm a native Spanish speaker, and I'm well acquainted with the idiomatic expressions and cultural references used in the show). Scenes that are supposed to be emotionally charged are underwhelming at best. Scenes that are supposed to be shocking have no shock value whatsoever. I wasted 6 hours of my life expecting this show to get better and it never did. I cannot believe they are going to do a second season!\n\nI haven't read the comic this show is supposed to be based on, but I believe it can't be worse than the show itself. \n\nOk, rant over. But I'm so annoyed! The only redeemable thing was the cast. I'm sure most of them did their best to work with what they had. ",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1lc095x/the_eternaut_is_the_worst_short_scifi_series_ever/"
    },
    {
        "id": "1lb7up5",
        "author": "JuryRevolutionary624",
        "title": "Will there be a season 3 of fubar",
        "content": "I really loved the two season of fubar and leaving the end with a cliffhanger and season 2 definitely exceeded my expectations and it was so good that I am rewatching from the first season again \nWould definitely love an another season tho",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lb7up5/will_there_be_a_season_3_of_fubar/"
    }
]