[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 14,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1oaxz4z",
        "author": "JusHarrie",
        "title": "The Perfect Neighbour- What shocked me so much....",
        "content": "...was that this could have been any neighbourhood and could happen anywhere. I remember playing out in the village I was raised in as a child, and there was always one weird house where a scary adult would live. You and your friends would all avoid them at all costs, but sometimes a ball would just go into their garden by accident or you'd just be existing and they'd make your life a misery when they came out, etc. I forgot how scary that used to be as a child and this documentary really reminded me of that fear and power imbalance of an adult making you feel that way when you are just playing and having fun outdoors which should be such a magical part of childhood. I knew something horrible was going to happen in this situation of course, but for some reason I didn't think it would be such a cruel and barbaric murder like that for some reason. Yes, the lady is definitely mean, racist, angry and a nasty bully, but for her to take the life of that wonderful lady and mother, and leave those babies motherless just absolutely broke my heart, I just didn't see it coming. All of that loss and hurt over something minor. One minute they had their lovely mother just advocating for her children and defending them like she had every right to do so, and then next minute she was gone. Her life was lost, and those poor children of hers will never feel the same again. All over that evil lady, who had years to just go live somewhere else if she wasn't happy in a family neighbourhood.\n\nI don't know. It's just really broken my heart. It's just so senseless. ",
        "upvotes": 168,
        "comments": 131,
        "media": null,
        "permalink": "/r/netflix/comments/1oaxz4z/the_perfect_neighbour_what_shocked_me_so_much/"
    },
    {
        "id": "1oaximx",
        "author": "SaltPomegranate4",
        "title": "The Perfect Neighbour is one of the most incredible documentaries I’ve ever seen.",
        "content": "Absolutely powerful. No narration. Just body cam footage acting as a first person account. Incredibly painful to watch. I cried a lot. \n\nThe anger that they didn’t arrest her. That they said “thank you” after she finally stood up to be taken to be charged. America has a big racism problem and it’s not just Susan Lorincz. \n\nIt’s an indictment on the US justice system that I had predicted she’d get away with it or given just a few years in prison. The absolute RELIEF when she got sent down. I hope she’s miserable for the rest of her days. \n\nWhat a beautiful community. I hope the boys and all the neighbours affected are supported through their pain. ",
        "upvotes": 127,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1oaximx/the_perfect_neighbour_is_one_of_the_most/"
    },
    {
        "id": "1ob2x5q",
        "author": "AdvancedDay7854",
        "title": "The Perfect Neighbor- What was the deal with Susan breaking down that fence",
        "content": "Felt it was kind of a loose end, but did Susan end up paying for that fence she broke through? Was it ever revealed why she did it other than her excuses? Did she feel emboldened because she’d ‘gotten away’ essentially with this to be more brazen? ",
        "upvotes": 28,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1ob2x5q/the_perfect_neighbor_what_was_the_deal_with_susan/"
    },
    {
        "id": "1ob5wlo",
        "author": "tellmestuffineed2kno",
        "title": "Perfect Neighbor",
        "content": "I have 30 minutes left in this documentary and WHY ISN’T THIS PIECE OF $HIT NOT IN JAIL YET????? I pray to God she doesn’t walk free. She was using the N word like it was nothing being interviewed by the detectives the first time. Evil. Pure evil\n",
        "upvotes": 13,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ob5wlo/perfect_neighbor/"
    },
    {
        "id": "1oagjm6",
        "author": "Ok-Intention-4593",
        "title": "The Perfect Neighbor- where did Susan live before?",
        "content": "I just finished the perfect neighbor and it was horrifying. Susan was so consistently malignant and evil, it made me wonder where she lived before she moved to AJs neighborhood and if her prior neighbors have similar stories? Her next level insane behavior and repetitive but very similar lies (always fearing for her life, even as she is being placed under arrest) makes me think it’s not possible this HASN’T happened before? May she rot in prison, I’d bet my last dollar she’s terrorizing other inmates and guards daily. \nIf anyone knew her before I’d be curious to know your experience. I’m sad the law couldn’t have stopped this from happening but I don’t blame anyone but Susan. ",
        "upvotes": 521,
        "comments": 555,
        "media": null,
        "permalink": "/r/netflix/comments/1oagjm6/the_perfect_neighbor_where_did_susan_live_before/"
    },
    {
        "id": "1oarvcp",
        "author": "689Dementia",
        "title": "The Perfect Neighbor, did everyone truly consent?",
        "content": "I’m feeling deeply uncomfortable about the fact that we have access to intimate footage from a tragic event involving dozens of children, parents, couples, and people who lost their mothers. For us, it’s \"entertainment\". For them, it’s their actual lives.\n\nThis documentary is currently trending on Netflix, but I can’t stop thinking: did everyone involved truly consent to having their trauma turned into a top-rated film?\n\nI’ve seen posts on Facebook from people close to the victims, and many of them are clearly upset. Some mention that one person may have agreed, and possibly received money for everyone(maybe just a rumors), but even if that’s true, does it justify broadcasting such personal pain?\n \n- What do we know about the consent process for this kind of media?  \n- Do you think it’s ethical to share such footage if only one person agreed?  \n- Where do we draw the line between public interest and exploitation?\n\nCurious to hear your thoughts.\n",
        "upvotes": 69,
        "comments": 69,
        "media": null,
        "permalink": "/r/netflix/comments/1oarvcp/the_perfect_neighbor_did_everyone_truly_consent/"
    },
    {
        "id": "1oar7ff",
        "author": "Mylo_Does",
        "title": "I don’t start Netflix shows unless they’ve already finished",
        "content": "The OA being cancelled changed the way I watch streaming content. I thought I was watching one of the greatest stories of all time, as did many others. Now I can’t even recommend it to others because of the heartbreak.\n\nUnfinished stories are a big pet peeve of mine.\n\nAnyone else the same?",
        "upvotes": 55,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1oar7ff/i_dont_start_netflix_shows_unless_theyve_already/"
    },
    {
        "id": "1ob5tuk",
        "author": "gamblinonme",
        "title": "Boots is so fucking good",
        "content": "Idk how accurate the portrayal of Marine boot camp is but they did an amazing job of character development. They did a great job of addressing toxic masculinity, how men struggle with sexuality in the armed forces at any age, how young kids struggle with figuring out who they are and their purpose, loss, relationship dynamics and much more. Kudos to Netflix- can’t wait to read the book. ",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ob5tuk/boots_is_so_fucking_good/"
    },
    {
        "id": "1ob5bpx",
        "author": "aspiringimmortal",
        "title": "WTF Netflix??",
        "content": "Netflix, my dude, explain something to me…\n\nHow on earth are you releasing Frankenstein **A WEEK AFTER** Halloween?\n\nI don’t understand. That’s like releasing a Santa movie in January. Do you hate money? Make this make sense?",
        "upvotes": 6,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1ob5bpx/wtf_netflix/"
    },
    {
        "id": "1oaget4",
        "author": "Funny-Cup-9416",
        "title": "Alright Reddit, please cure my boredom, what’s something absolutely worth watching right now?",
        "content": "I want to watch something really good doesn’t matter if it’s new or old, but please no fantasy or political stuff.\n\nI watch thrillers, drama, crime, emotional stories.\n\nWhat’s that one show or movie that you guys think i should be watching tonight. \n\nI’m doing a night shift, so even if it’s a Tv Show it’s okay to me.\n\nPs: Women in the Cabin 10 sucks one of the worst films i’ve ever seen on Netflix.\n\nEdit: I finally decided to watch, “The perfect Neighbor”.",
        "upvotes": 115,
        "comments": 240,
        "media": null,
        "permalink": "/r/netflix/comments/1oaget4/alright_reddit_please_cure_my_boredom_whats/"
    },
    {
        "id": "1oao54e",
        "author": "Real-Ad-5297",
        "title": "Dr Susan Lorincz - delusional",
        "content": "The most frustrating part is her sat in the interrogation room saying 'No. I can't do this. I'm not going.'\n\nWhat the actual fuck. Delusional. \n\nThe most frustrating part is her sat in the interrogation room saying 'No. I can't do this. I'm not going.'\n\nWhat the actual fuck. Delusional. ",
        "upvotes": 24,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1oao54e/dr_susan_lorincz_delusional/"
    },
    {
        "id": "1oaxtjl",
        "author": "Adelphos33",
        "title": "Perfect Neighbor - help me solve a debate between me and my wife - should PD have intervened more forcefully earlier?",
        "content": "My argument is that the police department should have had social workers or other officials intervene into what was clearly an escalating situation. Have them talk to the lady, the kids, and the kids parents, encourage the lady to move out (especially when they learned she had a gun, which was before the shooting happened), make sure the lady is on the appropriate meds, have a cop and a social worker observe the kids play, etc. Just repeatedly sending police to that situation should have resulted in the sheriff’s office escalating to some kind of intervention.\n\nMy wife basically says you can’t do that, and it’s pointless.\n\nAm I crazy to think the police department really failed the community here by not getting more involved?",
        "upvotes": 4,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1oaxtjl/perfect_neighbor_help_me_solve_a_debate_between/"
    },
    {
        "id": "1ob4xpi",
        "author": "bridgeb0mb",
        "title": "question about wayward? spoiler alert",
        "content": "this show confused the hell out of me, but i finished all 8 eps. so are we supposed to be led to believe Evelyn set Alex up to kill the first person he killed before they moved to twin pines? like, Evelyn set up the scenario so Alex would feel inclined to move to Twin Pines for a fresh start?\n\n\nthe only reason laurie can have a baby is because she did the leap thing, right? so Evelyn wanted both of the babies parents to do the leap? am i understanding this all correctly?\n\n\n\nin the beginning evelyn gives Alex a granola bar that she made. did the granola bar have whatever drug they use for leap in it? and then when alex gave the bar to riley and he ate it instead, he was crazy and that's why he tried to kill laurie? (or was it just a granola bar ???)\n\n\nare these things we are supposed to assume? admittedly i scrolled on my phone a lot while watching this show.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ob4xpi/question_about_wayward_spoiler_alert/"
    },
    {
        "id": "1oa17bq",
        "author": "chunkybonks",
        "title": "The Perfect Neighbor - Dr. Susan Lorincz",
        "content": "Umm excuse me. What exactly was this murderer a “doctor” of? She only referred to herself as a doctor once and nothing comes up when you search for it. Anyone know?",
        "upvotes": 545,
        "comments": 1011,
        "media": null,
        "permalink": "/r/netflix/comments/1oa17bq/the_perfect_neighbor_dr_susan_lorincz/"
    },
    {
        "id": "1ob0g66",
        "author": "SplitNational2929",
        "title": "Netflix's The Perfect Neighbor is currently sitting at #1, ahead of KPop Demon Hunters",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ob0g66/netflixs_the_perfect_neighbor_is_currently/"
    },
    {
        "id": "1oayoo6",
        "author": "Upbeat_Nectarine5010",
        "title": "The perfect neighbor documentary",
        "content": "Did anyone watch the actual trial footage of the case? I’m halfway through the testimonies of the people who knew Susan and I feel like this all sounds like idk manipulation or something, I’m sure she showed signs of being racist.. as much as she called the cops I’m sure she complained to the church goers who were “so close to her” I feel like I’m not here to demonize anyone but her past and what happened to her doesn’t warrant for her to hate children and specific races! She needed major therapy from what i heard and was untreated and committed this horrible act. \n\nAny thoughts if you watched? ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oayoo6/the_perfect_neighbor_documentary/"
    },
    {
        "id": "1oaycqp",
        "author": "akrazyho",
        "title": "Help, blind person here I can’t get audio description on the TV, but I can get it on the app",
        "content": "If it matters, I’m on the free plan, the basic one from T-Mobile.\n\nI’m more than willing to admit that I’m just not doing the right thing and this just might be a me issue But I will say I’m pretty technically savvy and I normally don’t have problems turning on audio description in the TV app.\n\nMaybe somebody can test it out for me and see if you can change to audio description for the show the residence on the basic plan on a TV \n\nIt’s strange because for other shows, I have no issues changing it to auto description, but for this one is not listed as an audio option on my TV   Audio description is definitely available through the Netflix app for this show for me, but for whatever reason it’s just not working on the TV \n\n\n\nAlso, what happened to the casting option on Netflix because if I could just cast what’s on my phone to my TV that would work and it’s weird because I have the same Netflix app signed into my phone and TV which I know you can’t use it at the same time on the basic plan, but still if I could just cast it, it would cast the audio description as well",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oaycqp/help_blind_person_here_i_cant_get_audio/"
    },
    {
        "id": "1o9ypkn",
        "author": "jonnyson14",
        "title": "Boots is the best show on Netflix right now",
        "content": "If you haven't watched it you absolutely need to. I laughed, I cried, I got angry, it's absolutely brilliant. I stuck it on with no knowledge of what it was, I thought I was just in for a modern take on stripes. Instead I got treated to the most compelling show I've watched in years! I'm begging people to watch it so it gets a season 2! I need it in my veins.",
        "upvotes": 410,
        "comments": 253,
        "media": null,
        "permalink": "/r/netflix/comments/1o9ypkn/boots_is_the_best_show_on_netflix_right_now/"
    },
    {
        "id": "1ob4jzt",
        "author": "waynehastings",
        "title": "The Diplomat season three",
        "content": "I absolutely love The Diplomat. The writing is so good: funny, tight, smart. The acting is top notch. Somehow I missed that season 3 was released. I'm binge watching seasons 1 and 2 for the third time before starting 3. Who's with me? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ob4jzt/the_diplomat_season_three/"
    },
    {
        "id": "1oacifb",
        "author": "EitherSheepherder854",
        "title": "The Diplomat",
        "content": "I am so hooked on this show. I love the cast and I love the story.  Currently I am on season 3 and I do not want it to end . Has anyone watched this yet? \n",
        "upvotes": 55,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1oacifb/the_diplomat/"
    },
    {
        "id": "1ob37s6",
        "author": "Motor-Revolution-425",
        "title": "The Perfect Neighbor - Diagnosis?",
        "content": "I just watched the Netflix documentary and I’m curious if the neighbor was ever diagnosed with some kind of mental disorder? She reminds me a lot of someone I know who is toxic, “crazy”, bipolar, narcissistic, past traumas (abuse received and given), no social or self awareness, but more so some imbalance going on. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ob37s6/the_perfect_neighbor_diagnosis/"
    },
    {
        "id": "1ob2wy7",
        "author": "glitterypinkapples",
        "title": "Skip intro for all episodes",
        "content": "Skip intro is definitely one of the best features on Netflix but doing it for every single episode when you just want to binge watch without reaching for the remote again has to be the most annoying thing (for example once in bed for the night). Especially when the theme song of the show you’re watching is either annoying or the sound levels of it compared to the actual show is way out of wack. \n\nYes, absolute lazy energy and first world problem but a skip intro for whole session / all episodes would be amazing. ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ob2wy7/skip_intro_for_all_episodes/"
    },
    {
        "id": "1ob2rnc",
        "author": "williesmustache",
        "title": "Picture in picture stopped working",
        "content": "On a newer tablet running android 15, I am subbed to the premium subscription, I have cleared the cache, data, deleted and reinstalled, reset the tablet, shut down the tablet, turned off pip permissions then turned back on, all background usage is allowed, all permissions for netflix are allowed, the app is up to date, android and every system app is up to date.\n\nPicture in picture worked fine this morning and works with other apps but I can't do anything to get it running again on my tablet. It is fine on my phone still tho.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ob2rnc/picture_in_picture_stopped_working/"
    },
    {
        "id": "1oaibur",
        "author": "Negative-Industry944",
        "title": "Subtitles dropped in quality?",
        "content": "Has anyone else noticed the subtitles on Netflix have become unbelievably bad in the past week or so?\n\nI've been watching a few different shows, and the subtitles aren't matching the actual dialogue. They're essentially summarising what's being said, not transcribing it.\n\nIt's completely missing the nuance and accuracy of the conversations, and it's really frustrating. It's happening across multiple shows, so it doesn't seem to be a one-off problem.\n\nIt's really frustrating for me (and I don't have any hearing impairment), but it must be infinitely worse for anyone who is D/deaf or hard of hearing. I really hope they fix it soon.\n\nJust wondering if anybody else had noticed this? ",
        "upvotes": 18,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1oaibur/subtitles_dropped_in_quality/"
    },
    {
        "id": "1ob1wkd",
        "author": "d15p05abl3",
        "title": "I think Netflix ‘Residence’ score contains an uncredited cover/arrangement",
        "content": "Watching episode 2 and I enjoyed a piece I was fairly confident was an arrangement of an original song by _The Penguin Café Orchestra_.\n\nOriginal is ‘The Snake and the Lotus (the Pond)’ from the 1987 album ‘Signs of Life’. I was intrigued by the reworking - went online to learn about it. The song is listed as ‘Investigation’ by the composer who did the series score, Mark Mothersbaugh (formerly of ‘Deva’). Google AI search result said\n\n&gt; ‘While some search results may reference music by Penguin Cafe Orchestra, this is a separate project and is not featured in the show's official soundtrack’.\n\nWhich I found oddly specific and evasive.\n\nDid anyone else recognise it?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ob1wkd/i_think_netflix_residence_score_contains_an/"
    },
    {
        "id": "1ob1r4t",
        "author": "Just-Fan-7637",
        "title": "Question about The Residence?",
        "content": "I've been watching and I've been enjoying the Residence, but I really must ask anyone here. When making the Residence, was the layout of the White House used was the actual layout of the real White House? How accurate was it to the real thing?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ob1r4t/question_about_the_residence/"
    },
    {
        "id": "1ob0ahd",
        "author": "Funny-Cup-9416",
        "title": "Looking for intense dramas about betrayal and emotional breakdown.",
        "content": "I’ve been watching a lot of intense relationship dramas lately, and I’m curious if there are any good movies where the husband actually catches his wife cheating like right in front of his eyes and it really messes him up emotionally afterwards.\n\nI didn’t experience anything like this myself, but I find those kinds of stories really gripping and heartbreaking at the same time. I like seeing how he deal with betrayal, depression, and trying to rebuild his lives afterwards.\n\nAny recommendations for movies like that?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ob0ahd/looking_for_intense_dramas_about_betrayal_and/"
    },
    {
        "id": "1oazz5y",
        "author": "Chickenpulaav",
        "title": "Locke &amp; Key: a masterful idea ruined by lazy acting and writing",
        "content": "Loved the concept, hated the execution. Here’s why this show had all the potential but ended up being one big missed opportunity. (I am not sure how the rating is so high)\n\n\t•\tIn Season 1, Dodge tells Bode you can go anywhere only if there’s a door, so how’s Gideon using the Anywhere Key to land in the middle of a forest in Season 3? Make it make sense.\n\t•\tThey could’ve easily trapped Gideon inside Gordie’s head, like erin, but nope, they were too busy chasing keys.\n\t•\tKinsey could draw anything to fight Gideon… and she picks a motorcycle? Really?\n\t•\tChamberlain Locke literally had all the answers and still got treated like background furniture.\n\t•\tTyler’s “love story” in Season 3 was just painful to watch. The girl literally stalks him back his home, forces a date, and somehow we’re meant to root for them? Bring Jackie back with the Shadow Key instead, please.\n\t•\tJosh started out with actual depth, obsessed with the keys and the door and then just fizzled out. Making Gideon his ancestor added nothing.\n\t•\tScot and Kinsey’s reunion after the Gabe mess? Did scot forget she wanted to date both of them and never really chose him.\n\t•\tNina Locke deserved way more energy, more purpose.\n\t•\tHonestly, Gabe, Eden, and Dodge carried the whole show.\n\nBrilliant premise. Terrible writing.\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oazz5y/locke_key_a_masterful_idea_ruined_by_lazy_acting/"
    }
]